{"Laurier Lévesque was the first Quebec premier to hold a referendum on sovereignty-association in 1980.": [{"url": "https://www.thecanadianencyclopedia.ca/en/article/quebec-referendum-1980", "page_content": "Lévesque founded the Parti Québécois, whose main objective was Québec sovereignty (Canapress). PreviousNext\n\nPolitical Context\n\nIn the late 1950s and the early 1960s, several organizations were established to promote or achieve Québec independence. Some of them, such as the Rassemblement pour l’indépendance nationale (RIN; see Pierre Bourgault) also tried their luck in the province’s political arena. On 13 October 1968, a political party was founded that was to continue to have an impact on Québec and Canadian politics for many years to come. The Parti Québécois, created by the merger of the Mouvement souveraineté-association, led by René Lévesque, and the Ralliement national, led by Gilles Grégoire, also received the support of the militant base of the RIN, which was dissolved at about the same time. As a new, pro-independence political party, the Parti Québécois soon became the rallying point for almost all nationalist movements and associations in Québec.\n\nAfter enjoying moderate success on the political scene, the Parti Québécois won the Québec general election of 15 November 1976, defeating the Liberals under Robert Bourassa. This victory was attributable to a political manoeuvre, carefully orchestrated by Claude Morin, in which the party promised that it would hold a referendum on sovereignty-association during its first term in government.\n\nJoe Clark at the PC Convention at which he won his party's leadership (photo by John de Visser).\n\nOn 22 May 1979, the federal Liberal Party, led by Pierre Elliott Trudeau, lost the Canadian general election. René Lévesque would now be dealing with a federal minority government led by Joe Clark, a prime minister who had little influence in Québec. Thus conditions had at last become favourable for the date of the referendum to be announced. On 21 June 1979, René Lévesque told Québec’s National Assembly that the referendum would be held in the spring of 1980. In November 1979, the PQ government published La nouvelle entente Québec-Canada (known in English as the White Paper on Sovereignty-Association), in which it asserted that “sovereignty is indissociable from association.” The wording of the referendum question was announced on 20 December 1979:\n\nThe Government of Quebec has made public its proposal to negotiate a new agreement with the rest of Canada, based on the equality of nations; this agreement would enable Quebec to acquire the exclusive power to make its laws, levy its taxes and establish relations abroad — in other words, sovereignty — and at the same time to maintain with Canada an economic association including a common currency; any change in political status resulting from these negotiations will only be implemented with popular approval through another referendum; on these terms, do you give the Government of Quebec the mandate to negotiate the proposed agreement between Quebec and Canada?\n\nIn the meantime, in early December, the political calculus had changed again, when Joe Clark’s government lost a vote of confidence on its first budget. New federal elections were set for 18 February 1980. This time, the Liberals won, taking 74 out of 75 ridings in Québec, and Pierre Trudeau — who had returned as party leader — now formed a majority government ( see Elections of 1979 and 1980 ). He promised that his government would reform federalism and that a No vote in the upcoming Québec referendum would not be a vote for the status quo.\n\nPierre Trudeau, speaking in 1968. Prime Minister Pierre Trudeau speaks for the federalist side, during the campaign for the 1980 Quebec Referendum on sovereignty. PreviousNext\n\nResults of the Referendum\n\nWhen the referendum was held on 20 May 1980, the plan for sovereignty-association was rejected by 59.56% of the votes cast, with a participation rate of 85.61%. An estimated 50% of francophone voters had supported this option. Some observers attributed part of this support, especially among women, to a clumsy comment by Lise Payette, Parti Québécois Minister of State for the Status of Women. In a speech in the National Assembly on International Women's Day (8 March 1980), she had decried the stereotypical character of Yvette, who still appeared in Québec elementary school readers as the good little girl who helped around the house. At a partisan meeting the following day, Payette said that Claude Ryan, the leader of the No camp, wanted women to remain “Yvettes,” and she then insulted his wife by saying that he was married to one. Liberal Party activists wasted no time in exploiting the minister’s blunder. They held a massive “Brunch des Yvettes” in Québec City, followed by several others, including one in Montréal that attracted over 15,000 female supporters of the No camp. The “Yvettes” movement may well deserve credit for reversing the initial trend that showed 47% in favour of the Yes option.\n\nDespite the democratic reforms and intellectual revival that Ryan brought to the Québec Liberal Party, his leadership was seriously questioned and he resigned in the fall of 1982 (Canapress).\n\nIn the days following the referendum defeat, the Parti Québécois reaffirmed that sovereignty was still the only viable option for Québec and would one day win majority support. This hope was already palpable in the speech that René Lévesque gave on the night after the referendum, when he said, “If I have understood you correctly, you are telling us, ‘until the next time.’”\n\nConstitutional Talks Resume\n\nIn the aftermath of the referendum, intensive negotiations took place between the federal government and the 10 provincial governments (see also Constitutional History), but were suspended when the provincial representatives rejected the federal proposals to patriate the Canadian Constitution. Later, all of the provinces except Québec embraced this idea.\n\nIn April 1981, despite its loss in the referendum, the Parti Québécois was re-elected, with 80 seats in the National Assembly and 49.2% of the votes (an increase of more than 8% in popular support compared with the election of 1976).\n\nHer Majesty Queen Elizabeth II with Prime Minister Pierre Elliott Trudeau signing the Constitution, 17 April 1982.\n\nConstitutional Accords Rejected and Second Québec Referendum Held\n\nIn September 1984, a Conservative federal government was elected, led by Brian Mulroney, and constitutional discussions between the federal and Québec governments resumed. In May 1985, the Parti Québécois announced the conditions that the government of Québec would require in order to support patriation. They included recognition of Québec’s distinct status and its right to either veto federal-provincial agreements or to opt out of them with adequate financial compensation if they were reached without Québec’s consent (see Federal-Provincial Relations).\n\nThe talks continued beyond the December 1985 Québec general election, in which Robert Bourassa’s Liberals were returned to power. In June 1987, an agreement was reached. Known as the Meech Lake Accord, it recognized Québec as a “distinct society,” comprised other constitutional changes as well, and was conditional on approval by the House of Commons and the provincial legislatures. At the end of the day, the agreement (see Meech Lake Accord: Document) was not adopted.\n\nIn October 1992, a Canada-wide referendum was held on another agreement, the Charlottetown Accord (see Charlottetown Accord: Document). This agreement was rejected by 54.3% of the voters. In October 1995, a Parti Québécois government held another referendum on Québec sovereignty (see Québec Referendum (1995)), which the No side won by a very slim majority: 50.58% of the votes. The participation rate was also very high: 93.25% of all Quebecers participated in this democratic exercise.\n\nAs of this writing, some two decades since this second referendum, the achievement of political sovereignty for Québec is still part of the program of the Parti Québécois. A second party in Québec’s National Assembly, Québec Solidaire, has also taken a position in favour of the principle of sovereignty for Québec."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/rene-levesque", "page_content": "\\u00a9 Marie-Josée Hudon. All portraits reproduced are the property of the artist. Courtesy: Musée des Grands Québecois. Lévesque founded the Parti Québécois, whose main objective was Québec sovereignty (Canapress). PreviousNext\n\nRené Lévesque, premier of Québec 1976-85, politician, journalist, nationalist (born 24 Aug 1922 in Campbellton, NB; died 1 November 1987 in Montréal, QC). A prominent member of Jean Lesage's Liberal Cabinet during the Quiet Revolution, Lévesque later founded the Parti québécois (PQ), eventually bringing it to power in 1976. The PQ's main objective was Québec independence, and for 15 years Lévesque was the leading champion of that ideal — holding and losing the province's first referendum on sovereignty in 1980.\n\nGaspé Childhood\n\nLévesque grew up in the remote, coastal town of New Carlisle, among the fishermen and farmers of the Gaspé peninsula. Because there was no hospital there in 1922, he was born in nearby Campbellton, New Brunswick, the eldest child of Dominique Lévesque, a prominent lawyer, and Diane Dionne. Although the Lévesques were well-to-do, poverty was dire in the Gaspé at that time. René became aware at a young age that most of the French Canadians were poorer, with smaller homes and more wretched schools, than the English Canadian families — descendants of Loyalists who had fled the American Revolution — who were the self-appointed elites of the region.\n\nA bright student who impressed his Jesuit teachers, Lévesque resolved early on at the Séminaire de Gaspé that he was destined to be a leader. He idolized his father, who introduced him to politics, and to French and English literature — giving the boy a bilingual upbringing. When Lévesque was 14, however, his father died in hospital at the age of 48. His mother quickly remarried, the family relocated to Québec City, and Lévesque drifted away from both his family and his studies.\n\nExpelled from the Collège des Jésuites Saint Charles Garnier for low marks, he finished his formal schooling at the Séminaire de Québec and enrolled in the law school at Université Laval, but gave up on his studies before obtaining a degree.\n\nJournalism\n\nLévesque had discovered radio journalism in 1938, his last summer in New Carlisle. In Québec City he worked at CBV, a regional Radio-Canada station. When the Second World War broke out, he was keen to get into the action, not as a soldier but as a war correspondent. Radio-Canada refused to send him, so in 1944 Lévesque found a position in London with the French section of the United States government service, Voice of America — thereby avoiding conscription by the Canadian military. He didn't get to the front lines until February 1945, joining the American armies as they crossed the Rhine and swept through the devastated remains of Germany. He was among the first US correspondents to see the horrors of the Dachau concentration camp following its liberation.\n\nThe war instilled in Lévesque a fondness for Americans (versus English Canadians), and a deep awareness of the barbarism that can flow from the extremes of nationalism. It wasn't enough to erase his own nationalist impulses, but it did temper them; he was committed throughout his life to democracy.\n\nAfter the war Lévesque returned to Radio-Canada, becoming an announcer for La voix du Canada, a news program broadcast out of Montréal to French-speaking countries around the world. He quickly established himself as an engaging and widely-followed foreign newsman, reporting from the Korean War in 1951 and the Soviet Union in 1955. From 1956 he hosted the television series \"Point de mire\" (Focal Point) and became one of Québec's most influential TV commentators. Short, balding and chain-smoking, Lévesque lacked the good looks for this emerging visual medium, but his intelligence and wit, and his ability to explain world events to a domestic audience, enabled him to become one of Québec's first TV stars.\n\nIn 1947, Lévesque married Louise L'Heureux, his fiancée from before the war, with whom he wouldhave two sons and a daughter. Surrounded by admirers in the broadcasting world, Lévesque wasn't a faithful husband, and the couple would divorce in 1978.\n\nIn 1959, Lévesque became actively involved in a strike by Radio-Canada producers, who wanted to form a union. He was dismayed by the indifference of the Diefenbaker government in Ottawa, and of his English CBC colleagues, towards the strikers' goals, which only hardened his views towards English Canada and fuelled his political aspirations. He decided journalism wasn't enough — it was time to stop covering the world, and start changing it instead.\n\nLesage Cabinet\n\nLévesque joined Jean Lesage's Liberals in the provincial election of 1960, becoming a Member of the Legislative Assembly for Montréal and helping to defeat the old Union nationale government. It was the beginning of the Quiet Revolution, and Lévesque became one Lesage's most popular and energetic Cabinet ministers — helping to modernize Québec, to encourage its French-speaking majority to become \"masters in our own house,\" and to help ease the province away from the oppressive influence of the Roman Catholic clergy.\n\nAfter a brief stint as minister of water resources and public works, in which he fought corruption in the civil service, Lévesque was appointed minister of natural resources in 1961. He became point-man for the controversial but ultimately successful effort to nationalize the province's private electric utilities and fold them into what became the energy colossus of Hydro-Québec. If Francophone Québecers didn't own or control big business interests in their province, Lévesque insisted, they would at least control its vast natural resources, via their government.\n\nParti québécois\n\nIn 1966, the Lesage government was defeated and Lévesque — increasingly nationalistic, and critical of his party's relations with the federal government — quit the Liberals the following year to found the Mouvement souveraineté-association, which in October 1968 became the Parti québécois. The move was hardly surprising. Through the 1960s, even as a Liberal minister, Lévesque had made his views on independence increasingly clear, telling the Anglophone media in Canada that he wouldn't be upset if Québec separated. At the 1967 Québec Liberal Party convention he had even tabled an incendiary resolution, largely unsupported by other delegates, titled \"A sovereign Quebec within a Canadian economic union.\" Meanwhile, he grew increasingly antagonistic with Pierre Trudeau, who entered federal politics in 1965 advocating a very different vision.\n\nHaving managed to unite the various groups promoting independence and a new political status for Québec, Lévesque's party won 23 % of the vote in the 1970 provincial elections — although he himself failed to win a seat. Then the October Crisis erupted, and Trudeau, now prime minister, invoked the War Measures Act. Lévesque joined a coalition of prominent Québecers in condemning what they saw as Ottawa's anti-democratic response to the crisis. At the same time, Lévesque and his friends failed to unequivocally condemn the terror kidnappings of the Front de libération du Québec (FLQ) and the group's subsequent murder of Pierre Laporte. This allowed the PQ's critics to publicly equate the party with the FLQ, costing the PQ considerable support.\n\nIn the 1973 provincial election the Liberals won a landslide victory, and Lévesque once again failed to win himself a seat. The PQ, however, managed to become the official Opposition.\n\nPQ Comes to Power\n\nIn the next election, in 1976, Lévesque and his party faced off against the now-unpopular Liberal regime of Robert Bourassa, weary after years in power and beset by scandal and accusations of nepotism. Lévesque promised good government. He also downplayed the PQ's essential goal — sovereignty — while reassuring Québecers that a PQ government would commit to holding a referendum on the issue first, rather than declaring sovereignty unilaterally. The PQ won a majority of 71 seats, including one for Lévesque, who became the province's 23rd premier. He headed the first Québec government committed to breaking up Confederation. The rest of Canada was stunned.\n\nDuring its first term, the new government passed several progressive measures concerning automobile insurance, rezoning of agricultural lands and the abolition of secret electoral funding. One of the most important and controversial pieces of legislation was Bill 101, the Charter of the French Language, which formalized the status of French as the official language of Québec. Proclaimed lawin 1977, Bill 101 excluded English from the provincial legislature and courts, and restricted access to English schools to anyone other than children whose parents had attended English schools in Québec. French schooling became compulsory for English-speaking immigrants, even those from other Canadian provinces.\n\nAlthough strongly supported by the public and the PQ, the law triggered an exodus of more than 130,000 Anglophones from the province between 1976 and 1981 . As well, a number of Montréal-based companies, including Sun Life Assurance Company of Canada, relocated their head offices to Toronto. In the ensuing years, court rulings would strike down many of the law's measures as contrary to the Constitution, including the ban on English in the legislature and courts. Eventually, children whose parents had attended English schools elsewhere in Canada, were allowed into English schools in Québec.\n\n1980 Referendum\n\nIn the fall of 1979, as time was running out on his government's mandate, Lévesque finally introduced in the National Assembly a plan for sovereignty-association — a politically independent Québec, still economically tied to Canada. A referendum on the question was scheduled for 20 May 1980, only months after the defeat of Joe Clark's Conservatives in Ottawa, and the return to power of Lévesque's nemesis Pierre Trudeau.\n\nAfter an emotional campaign led on the \"non\" side by Liberal Opposition leader Claude Ryan and federal Cabinet minister Jean Chrétien (with key support from Trudeau), and on the \"oui\" side by Lévesque and his ministers, the sovereigntists won only 40 percent of the vote, failing to capture even a majority of the Francophone vote. It was the hardest defeat of Lévesque's career. If there was any consolation, Lévesque believed the vote had at least legitimized the right of Québecers to determine their own future regarding Confederation. Ottawa had recognized that fact through its active participation in the campaign.\n\nConstitution Battle\n\nAgainst all expectations, the PQ was re-elected in 1981, with Lévesque heading his second majority government. The party may have been helped at the polls by the emergence of new battle lines pitting Lévesque and other provincial premiers against Trudeau, who had announced his intention to repatriate the Constitution from Britain and to proceed unilaterally if the provinces opposed him.\n\nTrudeau had made the vague promise, during the 1980 referendum campaign, of \"renewing\" the Constitution. Now his government was proposing new, centralized federal powers over the economy, a constitutionally-entrenched Charter of Rights and Freedoms, and a new constitutional amending formula. After months of political debate and grandstanding among Trudeau, Lévesque and the other premiers, the First Ministers, as they were called, assembled in Ottawa in November, 1981, in a final bid to settle their differences.\n\nLévesque was one of several powerful and strong-willed premiers (along with Alberta's Peter Lougheed) — together comprising eight provinces, or the Gang of Eight — who opposed Trudeau's plans and had fought them through the courts. But huddled together in Ottawa that November, the seven English-speaking premiers in the coalition were won-over by the promise of a \"notwithstanding clause\" in the new Charter — limiting its power over provincial authority. The compromise was not enough for Lévesque, who had also insisted on constitutional recognition of Québec as a \"distinct society,\" and on a constitutional veto for Québec. He accused his fellow premiers of abandoning \"Québec at the moment of crisis.\"\n\nWith the agreement of nine provinces, Trudeau pressed ahead. The repatriated Constitution was signed by Queen Elizabeth in the spring of 1982 — with the support of all the premiers except Lévesque, whose government represented the second-most populous province in the country. It was a detail that would bedevil the country and its First Ministers for years to come.\n\nFinal Years in Office\n\nLévesque returned to the National Assembly to face the hard task of governing. Confronted with economic recession and spiralling provincial deficits, his government met with considerable opposition and public disapproval, including illegal public-sector union strikes, when it attempted to reduce spending to solve its grave financial problems.\n\nThere was also turmoil inside the PQ and growing doubts about Lévesque's leadership. In 1984, a party crisis erupted when Lévesque announced his intention of not fighting the next election on the issue of independence, while maintaining sovereignty-association as the party's official raison d'être. Several important ministers resigned in protest, but the party reaffirmed Lévesque's leadership at a special convention in January 1985. Still, exhausted by years of struggle — and the defeat of his fondest political goals — Lévesque, at 62, fell into depression and was even hospitalized against his will. In June 1985 he resigned as premier.\n\nLegacy\n\nLévesque enjoyed two years of retirement, before his heart gave out on 1 November, 1987. In that time he wrote his memoirs, which proved hugely popular. Upon his death, he was remembered across the country, by friends and foes alike, as a giant of Canadian politics.\n\nLévesque's mark on Québec, and Canada, is as indelible as any leader that province has produced: as a journalist he opened the minds of Francophone Québecers and awakened them to the wider world; he was a central figure of the Quiet Revolution; a creator of the energy powerhouse that became Hydro-Québec; founder of the PQ and leader of Québec's first openly separatist government; the angry, intransigent torch-bearer of the \"distinct society\" ideal, who refused to endorse the 1982 Constitution, leaving an open wound in the federation that festers still.\n\nThrough it all, Lévesque acknowledged that whatever injustices Québecers suffered inside Confederation, Canada was still a free and decent country. \"Canada's federal system,\" he once said, \"is not excessively oppressive or anything like a gulag.\" He was never the most ardent nationalist or separatist of his time, yet he fanned the flames of nationalist sentiment in pursuit of his aims. His insistence on wanting to break up the nation, in spite of the Canadian virtues he admired, are what made him such a perplexing — and often hated — figure in the minds of English-speaking Canadians, both inside Québec, and elsewhere."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/quebec-referendum-1995", "page_content": "Former Parti Québécois leader Jacques Parizeau, September 1989. In 1994, he became the second leader of the separatist PQ to become premier (photo by Jim Merrithew). Founder of the Bloc Québécois and later premier of Québec (courtesy Office of the Premier, Government of Québec). Image: Simon Villeneuve/Wikicommons.\\r\n\nPreviousNext\n\nThe failure of the Meech Lake Accord and the Charlottetown Accord left considerable uncertainty about the constitutional future of Canada. The first sign was a dramatic change in the political landscape of the House of Commons following the 1993 election. The Progressive Conservative Party, associated with former Prime Minister Brian Mulroney and the failed accords, was virtually wiped out. While the federalist Liberals under Jean Chrétien won a majority, the opposition was fractured along regional lines, between the western-based Reform Party of Canada and the avowedly separatist Bloc Québécois, which formed the Official Opposition.\n\nGrowing Discontent\n\nThe rest of Canada was tired of constitutional matters. However, the alienation of Québec, attributable in part to the poisoned atmosphere following the debate over distinct society, brought the separatist Parti Québécois (PQ) back into power. Premier Jacques Parizeau promptly promised that a referendum on Québec separation would be held some time during 1995. In preparation for the referendum, draft legislation was prepared and a series of public consultations were held. The referendum was originally scheduled for the spring of 1995 but was delayed until 30 October 1995. The question posed in the referendum read as follows: \"Do you agree that Québec should become sovereign, after having made a formal offer to Canada for a new economic and political partnership, within the scope of the Bill respecting the future of Québec and of the agreement signed on 12 June 1995?\"\n\nThe Bill referred to in the question was Bill 1, An Act respecting the future of Québec (Loi sur l’avenir du Québec), which included a declaration of sovereignty in its preamble and the agreement of 12 June 1995, was the text of the agreement between the Parti Québécois and the Action démocratique du Québec (the ADQ) ratified by Premier Parizeau, Lucien Bouchard (leader of the Bloc Québécois) and Mario Dumont (the leader of the ADQ). The referendum itself was conducted under the provisions of the Québec Referendum Act.\n\nAt the beginning of the referendum campaign, the so-called \"No\" side (opposed to separation) had a substantial lead in the polls. But as the campaign progressed, and particularly when Lucien Bouchard took over the leadership of the \"Yes\" side from Parizeau during the final three weeks of the campaign, the \"Yes\" side gained momentum.\n\nResult of the Referendum\n\nUltimately, after an emotional and somewhat controversial campaign, the \"No\" side achieved victory by a narrow majority of 50.58 per cent.\n\nFollowing the vote, there was considerable controversy relating to the counting of the ballots (because of the large number of \"spoiled\" ballots), the enumeration of eligible voters and other concerns. Parizeau resigned and Bouchard assumed the leadership of the Parti Québécois and became premier of Québec. He had announced, prior to becoming premier, his intention to conduct another referendum on separation in 1997.\n\nDuring the final days of the campaign, federal politicians announced their intention of meeting some of Québec’s concerns. For example, Prime Minister Chrétien said that he would take steps toward recognizing Québec as a \"distinct society\" and guaranteeing Québec a de facto veto over constitutional changes.\n\nReaction of the Federal Government\n\nChrétien created a special Cabinet committee to formulate a new constitutional proposal. The proposal that emerged, primarily designed to address Québec's long-standing concerns, provided for three non-constitutional initiatives to be enacted by the House of Commons.\n\nThe first initiative, in the form of a motion in the House of Commons, would recognize Québec as a distinct society within Canada (i.e., a society characterized by the French language, its unique culture and a civil law system). The motion was adopted by Parliament.\n\nA second initiative would grant a veto to the Western region, the Atlantic region, Ontario and Québec over all future constitutional changes to national institutions such as the Senate, the creation of new provinces and any amendments regarding the distribution of powers. That is, such constitutional changes would require the consent of any two of the four western provinces, provided the two provinces constituted 50 per cent of the population of the West, and any two of the Atlantic provinces, provided the two provinces constituted 50 per cent of the population of the Atlantic region, as well as Ontario and Québec. At the insistence of British Columbia, this was changed so that BC became a separate region and would have a veto over major constitutional change. The Prairie provinces would also have a veto, in that consent would now be required of any two Prairie provinces, provided the provinces constituted 50 per cent of the population of the Prairie region. Demographically, this in effect gives the province of Alberta a veto.\n\nUnder the third initiative, the federal government would give up any role it plays in labour/market training, apprenticeship programs, co-operative education programs and workplace-based training, thus allowing the provinces to assume this responsibility.\n\nThe Calgary Declaration, which was presented for discussion in 1997 by all the provincial premiers except Québec’s, recognized the unique character of Québec society, but added the condition that all the provinces would be equal and would receive whatever was given to Québec by virtue of the interpretation of the “distinct society” clause. All the provincial legislatures adopted the Calgary Declaration except Québec’s National Assembly.\n\nImpasse\n\nNone of these initiatives promised an end to Canada's constitutional uncertainty, particularly with the prospect of another referendum in Québec. This uncertainty led to litigation in the courts as to the legal rules regarding the rights of a province to secede, under domestic constitutional law and under public international law.\n\nIn 1998, the Supreme Court of Canada ruled that Québec does not have the right to unilaterally secede from Canada. Nonetheless, the nine justices expressed the opinion that the other provinces and Ottawa would be obliged to enter into negotiations with Québec if voters in Québec unequivocally expressed their desire for independence by a clear majority (see Reference re Secession of Quebec).\n\nOn 29 June 2000, the Governor General gave Bill C-20 (commonly referred to as the Clarity Act) royal assent. The Bill was presented by the Chrétien government in response to the Supreme Court’s Québec Secession Reference, which stipulates that \"political actors\" are responsible to determine what, among other things, constitutes a clear question and a clear majority, and that, following a referendum, a province or territory can initiate its secession from Canada.\n\nWhen a Liberal government was elected in Québec in 2003, the PQ and the question of separatism were put on the back burner until the PQ’s return to power under Pauline Marois in 2012. At that juncture, however, Québec sovereignty was again put on hold due to the government’s minority standing — the PQ with 54 seats, the Liberals 50, Coalition avenir Québec with 19, and Québec solidaire with 2 seats. Though the centre-left Québec solidaire also stood for Québec independence, the party contributed to the division of the sovereigntist vote.\n\nConfident that a majority of seats could be won, Marois called an early election in spring 2014 — just 18 months after the minority PQ government had formed. At the beginning of March, the announcement of Pierre Karl Péladeau’s candidacy and his profession of faith in Québec independence rekindled the debate concerning a possible third referendum. The PQ, ahead in the polls at the beginning of the campaign, was relegated to the Official Opposition after the election. The Quebec Liberal Party led by Philippe Couillard came to power, and the independence project was again dropped from the political agenda.\n\nSee also Constitutional Law; Constitutional History; Québec Referendum (1980)."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/sovereignty-association", "page_content": "\\u00a9 Marie-Josée Hudon. All portraits reproduced are the property of the artist. Courtesy: Musée des Grands Québecois. Former Parti Québécois leader Jacques Parizeau, September 1989. In 1994, he became the second leader of the separatist PQ to become premier (photo by Jim Merrithew). Prime Minister Pierre Trudeau speaks during the 1980 Quebec Referendum on sovereignty. PreviousNext\n\nIntroduced in the document Option Québec (tr. An Option for Québec), written by the MSA leader René Lévesque, the expression sovereignty-association (or souveraineté-association in French) replaced the word independence and implied the idea of an association that would evolve from an agreement under international law and be limited to the economic domain (1967). In the 1970 PQ program, La Solution (1970), it is not presented as a necessary condition for Québec’s accession to sovereignty.\n\nAfter the Québec referendum of 1980, the PQ’s adoption of the strategy of the beau risque, which set the sovereignty option aside, in 1984, and the election of Jacques Parizeau as leader of the Parti Québécois, the use of the expression sovereignty-association declined, and the simpler term sovereignty gained ascendancy. Within the sovereignist movement, the defenders of sovereignty-association, like those of the “go-slow” strategy, came to be regarded as the moderate wing, often described as mous (soft), as opposed to the hardline wing — the purs et durs.\n\nOrigins of Sovereignty-Association and the Referendum Strategy\n\nRené Lévesque left the Québec Liberal Party on 14 October 1967 and founded the MSA on 19 November 1967. At the time, the MSA appeared more moderate than the Rassemblement pour l’indépendance nationale (RIN), from the standpoints both of economic policy and of anticolonialist rhetoric. It was on the specific issue of association that the negotiations between the RIN and the MSA broke down. When the Parti Québécois was founded in 1968, the RIN was disbanded, and its members were invited to join the PQ as individuals.\n\nStarting with the PQ congress in 1974, sovereignty-association became linked with the go-slow strategy proposed by Claude Morin. First, the Parti Québécois set aside the option of an independence election leading to sovereignty without a referendum. So as not to frighten voters, the PQ instead committed to holding a referendum once it had assumed power. Then a third step was added, making two referendums necessary: a first giving the Québec government the authority to negotiate with the rest of Canada, and a second leading to sovereignty.\n\nDoctrine of Sovereignty-Association\n\nIn October 1978, Premier Lévesque declared in the National Assembly that Québec had to radically transform its union with the rest of Canada, and that sovereignty and association should come about \"smoothly and simultaneously.\" In what came to be called the White Paper on Sovereignty-Association (La nouvelle entente Québec-Canada), the PQ government claimed that \"sovereignty is indissolubly linked with association.\"\n\nThe document went on to describe the doctrine more fully: it foresaw a common monetary system with the rest of Canada, coupled with a reorganization of the tasks of the present Bank of Canada into new common institutions, including a central monetary authority. It also presupposed a joint free-trade zone and a common external tariff (though each of the two communities could protect its own agriculture). It allowed for the free passage of goods and persons between Québec and Canada, and a variety of special agreements concerning jobs and immigration. A community council, composed of an equal number of ministers from each side and presided over alternately by a Canadian and a Québécois, would settle any disputes that might arise.\n\nThree other Québec-Canada institutions were proposed: a committee of experts to serve (under the council) as general secretariat to the community; a court of justice consisting of an equal number of Québec and Canadian judges with exclusive jurisdiction over the interpretation and workings of the association treaty; and a joint monetary authority responsible for the management of the single exchange rate, but not for the debt of the two sovereign partners (each would handle its own). Sovereignty-association, in the view of the White Paper, was not an end in itself, but a means by which Québec could freely direct its own affairs. Québec would thus enjoy the economic advantages of the federal union and the benefits of political independence.\n\nDecline of Sovereignty-Association\n\nIn May 1980, the Parti Québécois government used a referendum to ask the people of Québec for a mandate to negotiate sovereignty-association, thus defined, with the federal and other provincial authorities. The PQ lost the vote (60 per cent to 40 per cent). In 1984, after consultation with its membership, the PQ decided to put aside this option, and not make it the party’s platform in the next election. The beau risque (bold risk) was a constitutional reform strategy championed by René Lévesque and made possible by the election of the Conservative government of Brian Mulroney in Ottawa. This strategy led to internal dissent, and a group of dissidents faithful to the party’s basic objective, including Jacques Parizeau, decided to leave. At the urging of the PQ’s new leader, Pierre-Marc Johnson, the party adopted the concept of “national affirmation” in the first article of its program, doing away with the concept of sovereignty-association. The PQ subsequently lost the Québec election of 1985.\n\nThe PQ’s referendum strategy evolved considerably after Jacques Parizeau became party leader in 1988. The term sovereignty was retained without being linked to the term association. In the Québec referendum of 1995, the question asked no longer mentioned association, but instead proposed an economic and political partnership with the rest of Canada. Unlike the conditions in the 1980 referendum, in the 1995 referendum, Québec could have acceded to sovereignty if the Yes side had won and negotiations with Canada had subsequently failed. Thus sovereignty-partnership would appear to be defined more as a form of political independence, whereas sovereignty-association meant a new agreement on Confederation.\n\nSee also French Canadian nationalism; Separatism; Constitutional History."}, {"url": "https://www.constitutionalstudies.ca/2019/07/sovereignty-association/", "page_content": "‘Sovereignty-association’ is one manifestation of Quebec separatism. It calls for political independence and an ongoing economic partnership with Canada. Conceptualized by René Lévesque, ‘sovereignty-association’ was the centrepiece of the Parti Québécois' (PQ) secessionist platform during the years Lévesque led the party (1968-85). ‘Sovereignty-association’ was intended to increase the strength of the independence movement by calming fears that a political divorce from Canada would deliver tough economic times to the people of Quebec. Lévesque's political instincts were shrewd. In the 1970s Quebec public opinion polls consistently reported that people were more likely to support political independence if it included maintaining an economic partnership with Canada.\n\nA mandate to negotiate ‘sovereignty-association’ was the subject of the 1980 Quebec referendum, the first Quebec referendum on sovereignty. Premier Lévesque sought majority support from Quebec voters to negotiate the terms of ‘sovereignty-association’ with Canada. The results of those negotiations would be put to the public in a second referendum.\n\nIn a 1979 position paper the PQ stated that sovereignty-association should include free trade between Canada and Quebec, common tariffs against imports, and a common currency. New joint Quebec-Canada political institutions were proposed to govern these economic arrangements. Various English Canadian political leaders declared that they would not negotiate an economic association with a sovereign Quebec. These declarations generally are conceded to have contributed to the decisive defeat the separatists suffered in the 1980 referendum.\n\nIn the 1990s, the idea that an economic association with Canada must be a condition of Quebec independence waned in popularity. The question posed in the 1995 referendum only stipulated that Quebec should offer a new economic and political partnership to Canada before declaring independence. Canada's acceptance was not a prerequisite for sovereignty. Unlike in 1980, the separatists lost this second referendum by the narrowest of margins (50.6 percent to 49.4 percent) (see secession).\n\nSources:"}, {"url": "https://www.cbc.ca/news/canada/montreal/quebec-remembers-1st-referendum-1.944455", "page_content": "With his wife Corinne looking on, Premier René Lévesque tries to quiet the crowd in Montreal's Paul Sauvé Arena before conceding defeat on May 20, 1980, in the Quebec referendum. ((Canadian Press))\n\nQuebec politicians of all stripes are sharing their memories of the province's first referendum — held 30 years ago on Thursday — in which the majority of voters rejected the sovereigntist movement's dream of independence.\n\nParti Québécois Premier René Lévesque called a referendum on May 20, 1980, seeking a mandate from Quebecers for his ultimate political goal of sovereignty-association and a new relationship with Canada.\n\nQuebec voters were asked whether they wanted \"a new agreement with the rest of Canada, based on the equality of nations.\"\n\nAfter a heated campaign, 59.66 per cent of Quebec voters said No and 40.46 per cent said Yes.\n\nIn conceding defeat, the charismatic Lévesque told disappointed supporters that \"If I've understood correctly, you are telling me, 'Next time.'\"\n\nQuebec — and Canada — would have to wait another 15 years for a second referendum vote, which came in 1995.\n\nQuebec politicians remember 1980\n\nWhile many players on Quebec's political scene today were actively involved in the 1980 referendum, current Premier Jean Charest admitted to reporters on Thursday he did not vote, because he was getting married that summer and was hard at work.\n\n'No' supporters wave banners at Montreal's Verdun Arena as early returns suggested a victory for their camp. ((Canadian Press))\n\nBut he applauded the referendum as a fine example of civic participation. \"There's one thing we can be really proud of, as Quebecers, is our sense of democratic duty. It was an exceptional exercise,\" Charest said.\n\nLiberal Finance Minister Raymond Bachand was a fervent pro-sovereignty supporter at the time, and a key organizer for the Yes side campaign.\n\n\"I left [then labour minister] Pierre-Marc Johnson as chief of staff to go work for Mr. Lévesque, and it was a great exercise in democracy,\" Bachand told reporters. \"It was a great day for democracy.\"\n\nLike many Quebec politicians who switched allegiances mid-career, Bachand was asked to clarify why his beliefs have evolved.\n\n\"Thirty years later, the world has changed tremendously, and Quebec has changed, has progressed,\" he told reporters. \"In the economic ensemble in the world, if you look at free trade, what Europe is today, what it was, 30, 40 years ago, it's a totally different world.\"\n\n\"Quebec has progressed, notwithstanding the Constitution.\"\n\nBachand said many Quebecers still believe in sovereignty and he \"is going to respect that. But I think that the solution for Quebecers is to work inside this federation.\"\n\nQuebec Solidaire MNA Amir Khadir, a physician by trade, told reporters he also worked for the Yes committee.\n\n\"I admit I did a couple of illegal things, like sticking stickers in places where they weren't supposed to go,\" he said.\n\nPQ house leader Stéphane Bédard said he remembers his \"magical thinking\" that fateful night, when he ran back and forth between his family kitchen and television, trying to will poll numbers in favour of the Yes camp.\n\nBut he, like Charest, did not cast a vote. \"I was 12 at the time,\" Bédard said."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/parti-quebecois", "page_content": "Lévesque founded the Parti Québécois. Former Parti Québécois leader Jacques Parizeau, September 1989. In 1994, he became the second leader of the separatist PQ to become premier\n\n(photo by Jim Merrithew). Founder of the Bloc Québécois and later premier of Québec (courtesy Office of the Premier, Government of Québec). Pierre Karl Péladeau announcing his candidacy for the riding of St. Jerome, Quebec. Sunday, March 9, 2014\n\nImage: The Canadian Press/Graham Hughes. PreviousNext\n\nFounding\n\nThe Parti Québécois (PQ) was founded on 13 October 1968 through the merger of the Mouvement souveraineté-association (MSA), led by René Lévesque, and the Ralliement national (RN), led by Gilles Grégoire, a former Créditiste Member of Parliament.\n\nThe MSA was founded in November 1967, following a Quebec Liberal Party policy convention where René Lévesque (then minister of Natural Resources in the Liberal provincial government of Jean Lesage) and other party members who were also Quebec nationalists tried to gain acceptance for a program entitled Pour un Québec souverain dans une fédération canadienne (“For a sovereign Quebec in a Canadian federation”). Failing at this effort, they decided to quit the Liberal Party and form their own movement.\n\nIn 1968, the MSA negotiated a merger with the Ralliement national (RN). The RN, founded in March 1966, was itself the result of the merger of the provincial wing of the Ralliement créditiste with the Regroupement national. The RN claimed to be inspired by Pierre Bédard’s Parti canadien, Louis-Hippolyte LaFontaine’s Parti canadien-français, l’Action libérale nationale and the Bloc populaire canadien. The RN received only 3.2 per cent of the votes in the Quebec general election of 5 June 1966. Gilles Grégoire became its president on 21 August 1966.\n\nThe militant base of a third party, the Rassemblement pour l’indépendance nationale (RIN), also contributed to the founding of the PQ. The RIN had begun as a citizen movement in 1960, and in 1963 it became the first pro-independence political party in Quebec’s history. Pierre Bourgault became its leader in May 1964, and it took 5.6 per cent of the votes in the provincial election of 1966. But Bourgault did not endorse the idea of sovereignty-association promoted by René Lévesque — for the RIN, unilaterally declared independence (see Separatism) was the only acceptable option. Hence the negotiations between the RIN and Lévesque’s MSA failed. The RIN did not merge with the MSA and the RN, but instead was dissolved in 1968, and its supporters were invited to join the PQ.\n\nThis new pro-independence party thus became the rallying point for almost all Quebec nationalist movements and associations. It established a national executive council, developed its infrastructure, and built a rapidly growing network of party members. Other major Quebec nationalist organizations that supported the PQ included the Société Saint-Jean-Baptiste and the Mouvement national des Québécois.\n\nFirst election victory\n\nIn the first two elections in which it participated, the PQ achieved very limited success. In 1970, it won 23.5 per cent of the popular vote, but only seven seats in the National Assembly. The first seven PQ members of the National Assembly and the ridings that they represented were as follows: Camille Laurin (Bourget), Guy Joron (Gouin), Marcel Léger (Lafontaine), Robert Burns (Maisonneuve), Lucien Lessard (Saguenay), Charles-Henri Tremblay (Mercier et Sainte-Marie), and Claude Charron (Saint-Jacques).\n\nIn Quebec’s 1973 provincial general election, the results were even more disappointing for the PQ: only six PQ candidates were elected, even though the party took 30.2 per cent of the popular vote, while the Liberals, led by Robert Bourassa, took 102 seats out of 110. But in 1976, the PQ finally emerged victorious, trouncing the Liberals while capturing 41.4 per cent of the vote and 71 seats. The PQ victory was attributable largely to an electoral strategy nimbly executed by Claude Morin, in which the party promised to hold a referendum on sovereignty-association during its first term in office.\n\nThe PQ passed many important pieces of legislation during this first term. Bill 101, the Charte de la langue française (Charter of the French Language), made French the sole official language of Quebec (see Quebec Language Policy). The Act Respecting the Preservation of Agricultural Land and Agricultural Activities was passed in 1978, and the complementary Act Respecting Land use Planning and Development was passed in 1979. In 1978, the Automobile Insurance Act was passed, creating a government-managed system of no-fault compensation and property damage insurance for automobile owners. The Parti Québécois government also passed Bill 89, establishing a new Civil Code and reforming family law (1980).\n\nReferendum of 1980\n\nThe referendum on sovereignty-association that the PQ had promised during the 1976 election campaign was held in May 1980 (see Quebec Referendum (1980)). After a televised debate on the subject in the National Assembly, numerous public meetings were held. The opponents of Quebec’s negotiating sovereignty-association with the rest of Canada — the “No” side — took 60 per cent of the votes, beating the “Yes” side handily by a 20-point margin. Despite this failure, the PQ was returned to power in the 1981 elections, with 80 seats and 49.2 per cent of the votes.\n\nIn a consultative referendum of PQ members, René Lévesque won support for the party to set the question of sovereignty-association aside temporarily, but lost the support of a group of dissidents who refused to accept this result. In November 1984, the PQ government was shaken by the resignation of a group of pro-independence ministers including Jacques Parizeau. René Lévesque resigned the leadership of the Parti Québécois in June 1985 and was replaced as PQ leader and Premier of Quebec by Pierre-Marc Johnson in October 1985.\n\nIn the December 1985 elections, the PQ experienced a shattering defeat at the hands of Bourassa’s resurgent Liberals, receiving only 38.7 per cent of the vote and retaining only 23 seats in the National Assembly. In November 1987, one week after the death of René Lévesque, Pierre-Marc Johnson resigned as PQ leader. Jacques Parizeau, a stauncher champion of independence, was the main contender to replace him and became party leader on 19 March 1988.\n\nYears in Official Opposition\n\nBoth in government and as Official Opposition from 1985 to 1994, the Parti Québécois took an ambiguous posture, attacking the federal system from which it hoped to separate, while also trying to take advantage of it as much as possible. The party’s position during the Fall 1981 federal-provincial constitutional negotiations on the patriation of the Constitution was a good example. Quebec joined seven other provinces in opposing the Pierre Elliott Trudeau government’s plan to patriate the Constitution first and reach a new agreement about it with them second. But the other dissident provinces ended up accepting a new constitutional agreement, leaving Quebec isolated. Even after Robert Bourassa’s Liberals were returned to power in Quebec’s 1985 elections, the province refused to ratify the constitutional agreement unless it received new concessions.\n\nIn the Quebec general election of 1989, the Parti Québécois proposed to hold a series of “sectoral referendums” on individual constitutional jurisdictions such as language if it took power, but lost to Bourassa’s Liberals again, carrying only 29 seats and receiving 40 per cent of the vote. Polls showed support for the sovereignist option rising once more, however, in the wake of the failure of the Meech Lake Accord on 22 June 1990. Jacques Parizeau’s troops played a leading role in organizing the “No” camp for the October 1992 referendum on a proposed new constitutional agreement, the Charlottetown Accord, which a large majority of Quebecers rejected. In the Quebec general election of September 1994, the Parti Québécois was returned to power with 44.7 per cent of the votes and 77 seats in the National Assembly — a strong majority.\n\nThe 1995 Referendum and the Bouchard years\n\nOn 12 June 1995, three political parties — Action démocratique du Québec (ADQ), the Parti Québécois, and the Bloc Québécois (a new sovereignist party on the federal scene, serving as the Official Opposition in the House of Commons) — signed an agreement by which they formed the “Yes” Committee and collaborated on formulating the question for a new referendum on Quebec sovereignty (see Quebec Referendum (1995)). This referendum was held on 30 October 1995. With a voter-participation rate of 93.5 per cent, the Yes camp was defeated by a hair-thin margin, receiving 49.42 per cent of the vote to the No side’s 50.58 per cent. Jacques Parizeau resigned as PQ leader the next day, and Lucien Bouchard, leader of the Bloc Québécois in Ottawa, became PQ leader and Quebec premier of on 29 January 1996.\n\nBelieving that any new referendum held too soon after this last one would be doomed to failure, Bouchard focused on building Québec’s economy and eliminating the province’s budget deficit by imposing massive cutbacks on health and social spending. On the whole, the PQ’s fiscal policies did help to right the Québec economy, and the party was re-elected in 1998 with 76 out of the 125 seats in the National Assembly. Bouchard remained premier for three more years but, disappointed at the lack of enthusiasm for the sovereignist cause during his term in office, he resigned in 2001.\n\nQuébec finance minister Bernard Landry succeeded Bouchard as PQ party leader and premier of Québec on 8 March 2001. In 2002, surveys showed a major decline in the PQ’s popularity, to the benefit of the Quebec Liberal Party, led by Jean Charest, and the ADQ, led by Mario Dumont. The passage of additional progressive legislation, such as the Act to Combat Poverty and Social Exclusion (2002), helped the Parti Québécois to climb back in the polls somewhat, but not enough, and the party was defeated by the Liberals in the general election of 14 April 2003.\n\nInternal strife\n\nIn the wake of this political reversal, some PQ members questioned Bernard Landry’s leadership, and at the party convention in June 2005, he announced his intention to resign if he did not receive the support of at least 80 per cent of the delegates in the leadership vote to be held there. He received only 76.2 per cent of the votes, made good on his word, and bowed out. On 6 June 2005, Louise Harel became acting leader of the PQ.\n\nOn 15 November 2005, André Boisclair, a former minister in the Bouchard and Landry cabinets, became the sixth leader of the Parti Québécois, edging out Pauline Marois and Richard Legendre. Boisclair pushed the party’s position on Québec independence further by denouncing Bill C-20 (the federal Clarity Act on referendums for Québec secession). Boisclair asserted that sovereignty was a political issue, not a legal one, and stated that in the next Québec election, he would seek a mandate to hold a referendum on sovereignty. In August 2006, when Boisclair won a by-election in the riding of Pointe-aux-Trembles and took his seat in the National Assembly, surveys showed the PQ ahead of the Liberals. But the following months proved hard on the party, which lost ground in the polls, especially to the ADQ.\n\nThe general election of 26 March 2007 confirmed this rise in the fortunes of the ADQ, which had been founded in 1994 on a moderate conservative platform and had, over the years, gained favour with a growing number of Quebecers who did not want another referendum. Thus, in the 2007 general election, while the PQ took only 36 seats, the ADQ took 41. For the first time in 30 years, the Parti Québécois formed neither the government nor the Official Opposition in the National Assembly. Two months later, André Boisclair announced his resignation as party leader.\n\nOn 27 June 2007, Pauline Marois was elected PQ party leader by acclamation, thus becoming the first woman to hold this position. Under her leadership, the PQ supported the Bouchard–Taylor Commission hearings on reasonable accommodation and tabled two private members’ bills of note: Bill 195, the Québec Identity Act, which would have established Quebec citizenship; and Bill 196, the Québec Constitution, which would have established a Quebec constitution. Neither of these bills was ever passed by the National Assembly, because they were unconstitutional.\n\nAfter the December 2008 general election, the Parti Québécois returned to the National Assembly as the Official Opposition, winning 51 seats while the Liberals took 66, thus securing only a weak majority.\n\nIn June 2011, five PQ members of the National Assembly, including Louise Beaudoin, Pierre Curzi, and Lisette Lapointe (the wife of Jacques Parizeau) decided to quit the PQ caucus and sit as independents. They did so in protest against Bill 204, a private member’s bill tabled by Agnès Maltais, a PQ MNA from Quebec City, which was designed to provide protection against lawsuits for the agreement between Québécor Inc. and Quebec City on the management of the city’s new multi-functional amphitheatre, the Colisée (see also Québec Nordiques). In the following months, several PQ MNAs called Marois’s leadership into question. One of them, Jean-Martin Aussant, called for her resignation and even went so far as to create a new sovereignist party, Option Nationale, in September 2011. (Since 2006, the sovereignist vote had already been divided by the emergence of another sovereignist party, Québec solidaire.)\n\nBrief return to power\n\nOn 4 September 2012, the Parti Québécois won the provincial election, defeating the Liberal government of Jean Charest, which had been in power for nine years. The PQ was called on to form a minority government, and Pauline Marois became the first female premier in the history of Quebec.\n\nDuring her first year in power, Marois enjoyed growing popularity, in particular because of the leadership she showed after the tragic trainwreck that claimed 47 lives in Lac-Mégantic on 6 July 2013. But her government stirred up controversy throughout Canada when it announced plans to adopt a Quebec Values Charter. Tabled in November 2013, this charter (Bill 60) affirmed the values of State secularism and religious neutrality; one of its provisions would have banned the wearing of religious symbols by government employees, including staff of daycare centres and hospitals.\n\nDemonstrators take part in a protest against Quebec's proposed Values Charter in Montreal on Saturday Sept. 14, 2013 Supporters of a proposed Quebec Values Charter march in Montreal, Sunday, September 22, 2013 PreviousNext\n\nBelieving that she now had the chance to secure a majority mandate, Marois called a general election on 5 March 2014, only 18 months after the election that had brought her to power with a minority. But she lost her bet: on 7 April 2014, the Liberal Party, under its new leader, Philippe Couillard, won 70 out of 125 seats, leaving its main opponents trailing far behind. The Parti Québécois won only 30 seats (24 fewer than in the preceding election) and was invited to form the Official Opposition. The Québec solidaire party, led by Françoise David, took three seats, while the Coalition Avenir Québec (led by former PQ minister François Legault and participating in its second election since its founding in 2011) won 22. As a result of the defeat, Marois resigned as PQ leader and left politics.\n\nIn May 2015, Pierre Karl Péladeau became the eighth leader in the history of the Parti Québécois. However, on 2 May 2016 — less than a year after being named head of the PQ — Péladeau announced his resignation as party leader, leader of the official opposition and member of the National Assembly (MNA), citing family reasons. The party’s caucus chose Sylvain Gaudreault to serve as interim leader. A new leadership lace was launched which Jean-François Lisée won. In October 2016, he became the ninth leader of the Parti Québécois and leader of the official opposition.\n\nThe 2018 election reshaped Quebec’s electoral landscape. Defeating the Liberal Party (31 seats) and the Parti Québécois (10 seats), the Coalition Avenir Québec formed government with 74 seats and 37.47 per cent of votes. This result shattered the two-party system which existed between the QLP and the PQ since the 1970s. The PQ was reduced to third place alongside Québec solidaire who also won 10 seats. Jean-François Lisée was himself defeated in his borough of Rosemont and resigned as leader. Pascal Bérubé acted as interim leader until October 2020 when Paul St-Pierre Plamondon was elected leader.\n\nThe 2022 election was marked by the decisive victory of the CAQ, led by François Legault. The CAQ won nearly 41 per cent of the vote and elected 90 members of the National Assembly out of 125. Despite an election campaign considered by many the best, the number of seats won by the PQ in the legislature was reduced to three. This is the worst result of the party since its foundation. With 14.6 per cent of the vote, the PQ finished in third place, but came fourth in terms of the number of seats taken in the National Assembly, behind the Liberal Party (21 seats) and Québec solidaire (11 seats).\n\nSocial and political heritage\n\nIn the course of its history, the Parti Québécois has been elected five times as Québec’s governing party, for a total of nearly 20 years in power: from November 1976 to December 1985, from September 1994 to April 2003, and from September 2012 to April 2014. Under its stewardship, Québec has acquired some important tools for promoting economic development and social equity.\n\nWorth mentioning among the PQ’s many achievements are the adoption of the Charter of the French Language (1977), the prohibition against discrimination on grounds of sexual orientation in the Québec Charter of Human Rights and Freedoms (1978), the passage of the Act Respecting the Preservation of Agricultural Land and Agricultural Activities (1978), the creation of a Québec environment ministry (1979) and labour standards commission (1980), the addition of pregnancy as one of the grounds of discrimination recognized by the Québec Charter of Human Rights and Freedoms (1982), the adoption of the Pay Equity Act (1996) and the Act Respecting the Elimination of the Deficit and a Balanced Budget (1996), the creation of early-childhood centres (1997), the introduction of the Québec’s Public Prescription Drug Insurance Plan (1997) and the Québec Parental Insurance Plan (2001), the signing of an agreement with the Cree Nation of Québec (the “Paix des Braves,” 2002), and the closing of the Gentilly-2 nuclear power plant (2012)."}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-3-319-68846-6_43-1", "page_content": "Historical Background and Confederation\n\nQuebec’s secession efforts are grounded in the long and complicated history of the birth of the Canadian federation and subsequent events. Quebec was initially a colony of the French government. In the eighteenth century, Quebec came under British control when France lost its North American territories to Britain in the Conquest of New France during the 7 Years’ War (McConnell 2006). However, by then, due to years of French influence, Quebec had developed a distinct cultural and religious identity and legal and political institutions that were not easily reconcilable with English laws and institutions. After the Rebellions of 1837–1838, Quebec was amalgamated with Upper Canada (present-day Ontario) into the Province of Canada in 1841, and shortly after the failure of that union, became a province of the Canadian federation in 1867 (McConnell 2006; see also: Kennedy 1922, 298–322; Stanley 2011, 81–86; Vipond 2017, 83–88).\n\nAs the Supreme Court of Canada, Canada’s highest court, has noted several times including as recently as in 2021, federalism was a legal response to the existing political and cultural realities that existed at Confederation (Secession Reference 1998, para. 43; Canadian Western Bank 2007, at para. 22; References re GGPPA 2021, para. 48). At Confederation, political leaders told their respective communities that the Canadian union would reconcile the diversity that existed among the initial members with a unified political state in which different people could resolve their disagreements and work together toward common goals and a common interest (Secession Reference 1998, para. 43). Indeed, the British North America Act, 1867, renamed the Constitution Act, 1867 after patriation, reflects Confederation’s commitment to preserving diversity, especially with respect to French language and culture and Quebec’s interests. The Constitution Act, 1867 makes guarantees to protect French language and culture by making French an official language in Quebec and all of Canada. It also allocates the provinces jurisdiction over education and the broad area of “Property and Civil Rights in the Province” (Secession Reference 1998, para. 38).\n\nMost of Canada had a shared understanding of the Confederation’s objectives. However not everyone agreed on the nature of it. Many French-speaking Canadians believed Confederation was based on the principle of a federation of nations, namely, the British and French (Marchildon and Maxwell 1992, 593; Couture 2007; Silver 2011, 96–106). In essence, many French-speaking Canadians viewed themselves as a different “people” from English-speaking Canadians as “…la nation canadienne-française constitue un “peuple” au sens le plus plein du terme…” (Craven 1991, 240). But many English-speaking Canadians saw Canada as a homogenous nation composed of different regions represented by the provinces (Couture 2007). It is this tension about the nature of Confederation that has been at the core, among other events, of the political and constitutional crisis in Canada and the province of Quebec since 1867 and what animated Quebec’s secession efforts.\n\nFirst Referendum for Quebec’s Independence\n\nQuebec’s separatist movement re-emerged as a political force in the late 1950s and the 1960s. Popular support for separatism in Quebec and the organizations that represented it increased beginning in the late 1950s leading eventually to the election of the Parti Québécois in Quebec in 1976, a Quebec nationalist political party that rallied to power on the back of a program of political independence but economic association with the rest of Canada (Hudon 2013; Archibald and Lambert 2007).\n\nIn 1980, the first referendum on Quebec’s independence was held. The Parti Québécois asked the people of Quebec to give it a mandate to “negotiate a new constitutional agreement with the rest of Canada, based on the equality of nations” (Hudon 2013; Hogg 2007, §5.7(a)). Nearly 60% of Quebecers voted “no” against the Parti Québécois’s proposed sovereignty-association, including much of the French-speaking population in the province (Hudon 2013; Hogg 2007, §5.7(a)).\n\nPatriating Canada’s Constitution\n\nPatriation was the federal government’s immediate response to the first Quebec referendum. Canadian governments had been trying to agree on a way to patriate and amend the country’s constitution since the 1920s. However, patriation took center stage during the referendum when Canada’s Prime Minister at the time, Pierre Elliot Trudeau, campaigned for the “no” side and promised Quebecers that he would renew the Canadian constitution (Sheppard 2012; Dodek 2016, 27). Prime Minister Trudeau was determined to patriate Canada’s constitution from the authority of the British parliament to Canada’s federal parliament and provincial legislatures with a new amending formula that would no longer require England’s approval to change the constitution (Sheppard 2012; Dodek 2016, 27). His vision also included a new charter of rights and freedom that would replace the Canadian Bill of Rights (Sheppard 2012; Dodek 2016, 25). Although Prime Minister Trudeau was eventually successful in patriating Canada’s constitution and introducing a new charter of rights and freedom in 1982, the events leading to it deeply fractured the relationship between Quebec and the rest of Canada.\n\nPatriation first took center-stage in Canada in November 1927 at a conference called by the federal government (Russell 1993, 55). At the Dominion-Provincial Conference, Minister Ernest Lapointe, the federal minister of justice at the time and Prime Minister Mackenzie King’s Quebec lieutenant, proposed a formula for amending Canada’s constitution (Russell 1993, 55). Amendments would be enacted by the federal Parliament, but they would require provincial consent. Ordinary amendments would require the consent of a majority of the provinces (Russell 1993, 55). Fundamental amendments involving “questions as provincial rights, the rights of minorities, or rights generally affecting race, language and creed” would require the unanimous consent of all the provinces (Russell 1993, 55–56). At the time, it was believed that there was no “widespread demand” for such changes, the proposal could “stir up local party strife” or “arouse sentiment and feeling” and amendments could become too easy to secure under the formula despite the provincial consent requirements (Russell 1993, 56). Minister Lapointe’s formula did not receive approval.\n\nFollowing this attempt, federal and provincial ministers attended several conferences to discuss patriation in 1935, 1950, and the early 1960s, but no agreement was arrived at (Russell 1993, 57). In 1960, Minister E. Davie Fulton, the federal minister of justice at the time, proposed an amending formula at a federal-provincial conference. Amendments affecting the federal-provincial division of powers and the use of the English or French language would require unanimous consent, while amendments affecting certain provinces would require the consent of the concerned provinces (Russell 1993, 72). Most other amendments would be subject to the 7/50 rule, requiring consent of the federal parliament plus the legislatures of two-thirds of the provinces representing at least 50% of the Canadian population (Russell 1993, 72). At the time of the conference, Saskatchewan opposed the formula but no attempt to implement the formula occurred until 1964. In 1964, Minister Guy Favreau, the new federal minister of justice, produced legislation embodying the formula and all premiers agreed to the Fulton-Favreau formula (Russell 1993, 72). However, in 1965, the Quebec government withdrew its support for the formula as a result of significant criticism in the province and patriation failed once again (Russell 1993, 72–74).\n\nOver the next 6 years, federal-provincial conferences and discussions about patriation and constitutional review continued without much success. In February 1971, the possibility of patriation emerged in the shape of a limited constitutional package from a working session of first ministers that took the form of Victoria Charter by June 1971 (Russell 1993, 85–87). Among other things, the Charter included a mini charter of democratic and language rights – in line with by then Prime Minister Trudeau’s vision – and a different constitutional amending formula (Russell 1993, 88–89). Unanimity would not be required for any amendments (Russell 1993, 89). Instead, most constitutional amendments would require the approval of the federal House of Commons and approval by the legislatures of any province that had 25% of Canada’s population (i.e., Ontario and Quebec), at least two Atlantic provinces and at least two Western provinces accounting for 50% of the Western Canadian population (Russell 1993, 89). Quebec rejected the Victoria Charter and it failed (Russell 1993, 90–91).\n\nAfter the failure of the Victoria Charter, constitutional politics took a bit of a backseat. It became front and center again with the election of the Parti Québécois in 1976 and became part of the federal government’s immediate response to the first Quebec referendum. At the time, Prime Minister Trudeau’s dream of patriation and a Canadian charter of rights and freedom was supported by the premiers of Ontario and New Brunswick (Sheppard 2012). But, all other premiers including Quebec’s new Premier René Lévesque – who came to be known as the “Gang of Eight” – opposed it because they were concerned it would transfer power from the provinces to the federal government and diminish provincial power as Prime Minister Trudeau had drafted a set of demands for new, centralized powers over the Canadian economy (Sheppard 2012). Without the support of 8 of Canada’s 10 premiers and clearly mindful of the experience of the Victoria Charter, Prime Minister Trudeau threatened that he would make a unilateral request for patriation to the British Parliament (Sheppard 2012). But the Gang of Eight challenged Trudeau’s threats in several provinces and eventually Prime Minister Trudeau submitted his resolution to the Supreme Court of Canada.\n\nIn a split decision that was seen as a messy win for both sides, the Supreme Court of Canada found by a 7–2 majority that the federal government had the legal right to patriate and amend Canada’s constitution without provincial consent (Patriation Reference 1981, 758–759). But the Court also ruled by a 6–3 majority that any proposed amendments that reduced provincial powers would require a “substantial degree of provincial consent” to be determined by the politicians and not the courts because to do otherwise would be a breach of constitutional convention (Patriation Reference 1981, 758–759). The Supreme Court’s mixed decision sparked a final round of hurried negotiations and what Prime Minister Trudeau called “the one last time” conference (Sheppard 2012).\n\nIn the first two days of the conference no deal was reached. Both sides held their ground (Sheppard 2012). On the third day with no deal in sight, Prime Minister Trudeau pitched one last proposal: immediate patriation, followed by a two-year period to address the problem of the amending formula and charter of rights and freedom and failing that a public referendum (Russell 1993, 119–120; Albert 2020, 3–5; CBC 2001). Although Prime Minister Trudeau’s proposal was well received by Premier Lévesque, not all premiers were comfortable with another referendum (Sheppard 2012; CBC 2001).\n\nOn the evening of the third day – an evening that has come to be known, based on Premier Lévesque’s critique of the actions of the Canadian leaders, as the Night of the Long Knives – various ministers and advisors from different provinces, except the Quebec delegation which was staying in a separate hotel across the Ottawa River from the conference, gathered to discuss other options and arrived at a deal (Sheppard 2012; CBC 2001). A “notwithstanding clause” would operate to limit the force of the new charter by allowing provinces to exempt their laws from certain charter rights, something Prime Minister Trudeau was against (Russell 1993, 120–121; Sheppard 2012). And Premier Lévesque’s “opt out clause,” which would have allowed provinces to opt out of shared federal-provincial programs but receive equivalent funds to set up its own programs in place, would be dropped (Russell 1993, 120–121).\n\nIt is unclear whether any attempt was made to reach Premier Lévesque and the Quebec delegation that evening (Sheppard 2012). Some say attempts were made but were unsuccessful. Others say no attempts were made. Premier Lévesque was presented with the deal the next morning on the final day of the conference and feeling betrayed and plotted against by the English-speaking premiers refused to sign it (Sheppard 2012). Prime Minister Trudeau and all other nine premiers signed on the deal, and on 17 April 1982, Queen Elizabeth II proclaimed Canada’s Constitution Act, 1867 and new Constitution Act, 1982 containing the Charter of Rights and Freedom formalizing the patriation of Canada’s constitution from England (Dodek 2016, 31). Although Quebec did not sign the deal, Canada’s new constitution and charter of rights and freedom still applied in the province and formed a political sore that further fueled separatist sentiment in the province.\n\nMeech Lake Accord\n\nIt took 5 years before an agreement was reached to bring Quebec consensually into the constitutional accord. In a new political climate, Quebec was headed by a liberal government led by Robert Bourassa and a progressive conservative government was at the helm of the federal government led by Brian Mulroney (Gall Meech 2006b). Prime Minister Mulroney opened constitutional discussions with all the provinces (Gall Meech 2006b). Quebec made a series of proposals that, if accepted, would lead to its formal endorsement of Canada’s constitution (Gall Meech 2006b). All the provinces and the federal government initially agreed to Quebec’s proposed amendments in a document that came to be known as the Meech Lake Constitutional Accord of 1987 (“Meech Lake Accord”) (Gall Meech 2006b). However, the Accord’s provisions failed to become law as political support for it unraveled in 1990 (Gall Meech 2006b).\n\nQuebec’s proposed constitutional amendments encompassed five main modifications. The Accord’s first proposal dealt with the distinctiveness of Quebec within Canada. Quebec would be recognized as a “distinct society” within Canada, and the existence of French-speaking Canadians, centred in but not limited to Quebec, and English-speaking Canadians, concentrated outside Quebec but also present in Quebec, would be recognized as a fundamental characteristic of Canada (Meech Lake Accord 1987; Meech Lake Communiqué 1987). Both these characteristics would inform the interpretation of Canada’s constitution and the federal government and other provinces would be committed, in the exercise of their powers, to preserving French-speaking Canadians and English-speaking Canadians (Meech Lake Accord 1987; Meech Lake Communiqué 1987).\n\nThe Accord’s remaining four proposals addressed matters that enhanced the role and powers of the provinces relative to the federal government. First, provinces would have a greater role in the immigration process, an area over which the federal government exercised jurisdiction (Meech Lake Accord 1987; Meech Lake Communiqué 1987). Second, as vacancies to the Senate and the Supreme Court of Canada arose, the provinces would submit candidates to the federal government from whom they would have to fill the vacancy, a task that was the Prime Minister’s prerogative (Meech Lake Accord 1987). At least three of the nine Supreme Court of Canada justices would have to be from the bar of Quebec and trained in civil law (Meech Lake Accord 1987; Meech Lake Communiqué 1987; later codified in Supreme Court Act, s. 6; Supreme Court Act Reference 2014, para. 1). Third, provinces would be able to opt out of any federal programs in areas of exclusive provincial jurisdiction and would be entitled to “reasonable compensation” from the federal government in order to fund their own programs “compatible with the national objectives” (Meech Lake Accord 1987; Meech Lake Communiqué 1987). Finally, the Accord also proposed to make more prospective constitutional amendments subject to a higher approval standard (Meech Lake Accord 1987). Under the Constitution Act, 1982, most constitutional amendments are subject to the 7/50 rule: approval of the federal government (Senate and House of Commons) plus the legislatures of two-thirds of the provinces representing at least 50% of the Canadian population (Constitution Act, 1982, s. 38(1)). The Accord proposed the standard of unanimous consent – that of the federal parliament and all provincial legislatures – for matters of Senate and Supreme Court of Canada reform, proportionate representation in the House of Commons, the extension of existing provinces into the territories, and the addition of new provinces (Meech Lake Accord 1987). Unanimous consent of the federal parliament and all provincial legislatures is provided for in the Constitution Act, 1982 but is reserved for a limited number of constitutional amendments, such as the office of the Queen, Governor General, and Lieutenant Governors, the use of the English or French language, and the composition of the Supreme Court (Constitution Act, 1982, s. 41). The Accord proposed to expand the constitutional amendments that would need to obtain the higher and more difficult standard of unanimous consent.\n\nAlthough the Accord and its provisions came as a surprise to many across Canada, opinion polls showed that public support for the Accord was more than 66% in 1987 (McConnell 2006). In order to become law, however, the Accord needed to be ratified by Parliament and all 10 provinces within 3 years of the passing of an enabling resolution, which Quebec passed on 23 June 1987 (McConnell 2006; Gall Meech 2006b). Only in this way would the Accord’s provisions become entrenched in Canada’s constitution (McConnell 2006). Unfortunately, before the deadline of 23 June 1990, political support for the Accord broke down.\n\nFormer Prime Minister Trudeau came out in strong opposition of the Accord shortly after it was released in 1987 deeming it as the end of any dream of “one Canada” (MacDonald 2002, 269–274; Gall Meech 2006b). He was joined by certain interest groups – those representing Indigenous peoples, women, French-speaking Canadians outside Quebec, and other minorities – the territories, and many English-speaking Canadians who were not comfortable with the “distinct society” clause because they feared it would give Quebec special status in Confederation rather than making it 1 of 10 equal provinces (Gall Meech 2006b; McConnell 2006). Changes in government in New Brunswick, Manitoba, and Newfoundland also brought to power political parties who opposed the Accord (McConnell 2006). By the beginning of June 1990, almost 75% of Canadians polled sided with former Prime Minister Trudeau and opposed the Accord (Hillmer 2013).\n\nIn June 1990, Prime Minister Mulroney called a meeting of all the provincial premiers in an attempt to save the Accord before the constitutionally mandated ratification deadline (McConnell 2006). Although all premiers agreed to ratify the Accord on the condition that there would be further constitutional discussions on issues such as the Senate, the amending formula, equality, and Indigenous issues, the Accord unraveled when it was clear that it would not gain support in the Manitoba and Newfoundland legislatures in time for the ratification deadline (Gall Meech 2006b; McConnell 2006). Once the ratification deadline passed, the Accord died, yet further souring the relationship between Quebec and the rest of Canada. Many Quebecois viewed the Accord’s failure as a rejection of Quebec and support for secession soared in the province (McConnell 2006).\n\nCharlottetown Accord\n\nEven before the Meech Lake Accord died, a new round of negotiations began to resolve the political dilemma created by the patriation of Canada’s constitution and enactment of the Charter of Rights and Freedom without Quebec’s consent. In February 1990, Quebec established the Allaire Committee to study options if the Accord failed, and in June 1990, after the failure of the Meech Lake Accord, the Quebec government established the Belanger-Campeau Committee to study Quebec’s relationship with Canada (McConnell 2006; Gall Charlottetown 2006a). In November and December 1990, the federal government also established two national panels (McConnell 2006). The Spicer Commission was tasked with answering criticisms on the nature of Canada’s constitutional process and the Beaudoin-Campeau Committee was asked to create a new constitutional amending formula (McConnell 2006; Gall Charlottetown 2006a).\n\nAll the committees conducted detailed studies with different scopes that led to varied recommendations. Quebec’s Belanger-Campeau Committee recommended that another referendum of sovereignty be held if Quebec did not receive a suitable offer from the rest of Canada by October 1991 (McConnell 2006). Quebec’s Allaire Committee, on the other hand, did not recommend a referendum but recommended that the Senate be abolished and that Quebec receive exclusive power over its communications, energy, environment, agriculture, and regional development (McConnell 2006). Although the federal government’s established Spicer Commission also recommended that the Senate be reformed or abolished, it additionally recommended that the federal government review its institutions and symbols to foster a sense of country and that Quebec be recognized as a unique province without recommending any shift of jurisdictional authority (McConnell 2006). And the Beaudoin-Campeau Committee was silent on all the above aforementioned recommendations because its scope was limited to a new constitutional amending formula. It recommended reducing the time to ratify constitutional amendments from 3 to 2 years, adding in a regional veto, requiring national referendums on major changes, requiring unanimous consent for changes involving the monarch, language, and provincial control of resources, and amending the 7/50 rule of consent for general constitutional changes to requiring consent of the federal parliament and the legislatures of Ontario, Quebec, and any two Western and two Atlantic provinces instead (McConnell 2006).\n\nIn order to coordinate the various recommendations made by the four committees, the federal government created another public forum in June 1991, the Dobbie-Castonguay Parliamentary Committee, later reconstituted and named the Dobbie-Beaudoin Committee, which released its proposals in September 1991 and March 1992 (McConnell 2006). The Dobbie-Castonguay Parliamentary Committee recommended recognizing Quebec as a distinct society, entrenching Indigenous self-government in Canada’s constitution, including a “Canada clause” in the constitution elaborating on values such as egalitarianism and diversity and senate reform (McConnell 2006). The Dobbie-Beaudoin Committee also recommended recognizing Quebec as a distinct society and senate reform but recommended a Quebec veto on all constitutional changes (McConnell 2006). Both these reports formed the basis of negotiations between the federal, provincial, and territorial governments and representatives of Aboriginal peoples which eventually resulted in Charlottetown Accord (Gall Charlottetown 2006a).\n\nThe Charlottetown Accord included proposals on five main topics. First, the Accord proposed adding in a new “Canada clause” in the constitution that would express fundamental Canadian values and guide courts in their interpretation of the constitution (Charlottetown Accord 1992). The values listed included recognizing Quebec as a distinct society within Canada that includes a French-speaking majority, a unique culture, and civil law tradition; a commitment of Canadians and their governments to the vitality and the development of official language minorities throughout Canada; and recognizing that the governments of Aboriginal peoples of Canada constitute one of the three orders of government in the country (Charlottetown Accord 1992).\n\nSecond, the Accord proposed a number of major reforms to Canada’s legislative and judicial institutions. Canada’s Senate would be reformed for one. Each province would have an equal number of senators who would have to be elected either by the province’s legislature or by general election in each province and exercise effective powers representative of the provinces and issues (Charlottetown Accord 1992). The Accord also proposed entrenching all matters relating to the Supreme Court into the constitution subject to unanimous approval, except for the nomination and appointment process of Supreme Court judges, which under the Accord would require approval under the general constitutional 7/50 amending formula (Charlottetown Accord 1992). Changes were also proposed to the House of Commons. Quebec would be guaranteed 25% of the seats in the House of Commons and otherwise the composition of the House of Commons would be adjusted to better reflect representation by population increasing the number of seats allotted to Ontario, British Columbia, and Alberta (Charlottetown Accord 1992).\n\nThird, the Accord also proposed adding a provision in the constitution that would require the federal government to provide “reasonable compensation” to any province that opted not to participate in a Canada-wide shared-cost program established by the federal government in an area of exclusive provincial jurisdiction so far as the province enacted its own program “compatible with the national interests” (Charlottetown Accord 1992). Somewhat relatedly, the Accord sought to enhance Canada’s social and economic union and strived to include a “social-economic charter” within Canada’s constitution (Charlottetown Accord 1992). On the social side, the proposed charter described the commitment of the federal and provincial governments to a comprehensive, universal, portable, publicly administered, and accessible health care system; reasonable access of all Canadian residents to housing, food, and other necessities; protecting workers’ right to organize and bargain collectively; and protecting, preserving, and sustaining the environment for present and future generations (Charlottetown Accord 1992). On the economic side, the proposed charter would recognize policy objectives underlying Canada’s economic union including working together to strengthen Canada’s economic union; the free movement of persons, goods, services, and capital; the goal of full employment; ensuring all Canadians have a reasonable standard of living; and ensuring sustainable and equitable development (Charlottetown Accord 1992).\n\nFourth, the Accord proposed several amendments relating to the rights of Aboriginal peoples. It proposed amending the constitution to recognize the right of Aboriginal peoples to self-government enshrining Aboriginal governments as a third order of government in Canada constitutionally similar to the federal and provincial governments (Charlottetown Accord 1992). Relatedly, the constitution would be amended to provide the legislative bodies of Aboriginal peoples access to the notwithstanding clause in the constitution and guarantee Aboriginal representation in the senate. Aboriginal representation in the House of Commons would not be guaranteed in the constitution but would be required to be pursued by the federal government (Charlottetown Accord 1992). In addition, the Accord also proposed requiring the consent of Aboriginal peoples to future constitutional amendments that involved their interests and amending the constitution to provide that nothing in the Charter of Rights and Freedom abrogates or derogates from Aboriginal, treaty or other rights of Aboriginal peoples (Charlottetown Accord 1992).\n\nFifth, and perhaps most contentiously, the Accord attempted to resolve long-standing debates surrounding the division of powers between the federal and provincial governments. It would have given the provinces exclusive jurisdiction over forestry, mining, tourism, housing, recreation, and cultural affairs, while the federal government would retain jurisdiction over national cultural bodies, such as the Canadian Broadcasting Corporation and National Film Board (Charlottetown Accord 1992). In addition, the federal government would be required to negotiate agreements with the provinces to harmonize policy in telecommunications, labor development and training, regional development, and immigration (Charlottetown Accord 1992). Moreover, the Accord would have limited two centralizing powers in Canada’s constitution. It would have repealed the federal power of disallowance and reservation which gives the federal government the power to overrule any provincial law within one year of its approval (Charlottetown Accord 1992). It would have also limited the scope of the federal declaratory power, which gives the federal government the power to declare a “work” to be for the general advantage of Canada and bring it under the jurisdiction of the federal government, to new works with the explicit consent of the provinces where the work is located (Charlottetown Accord 1992).\n\nAlthough the Charlottetown Accord had the formal support of the federal government and all ten provincial governments and could have been legally enacted as a constitutional amendment, the federal government submitted the Accord to a national referendum in October 1992 still smarting from the criticism surrounding the Meech Lake Accord (Gall Charlottetown 2006a). British Columbia, Alberta, and Quebec had their own referendum laws, but British Columbia and Alberta choose to participate in the federal referendum. Quebec held its own provincial referendum (Gall Charlottetown 2006a). Nationally, 54.3% of the vote opposed the Accord while in Quebec 56.7% opposed the Accord (Gall Charlottetown 2006a). The Accord only won majority support in New Brunswick, Newfoundland, Prince Edward Island, the Northwest Territories, and by the narrowest margin of 50.1%, in Ontario (Gall Charlottetown 2006a). The Charlottetown Accord thus also failed to obtain Quebec’s consent for Canada’s constitution.\n\nQuebec’s Second Referendum and the Secession Reference\n\nAfter the failures of the Meech Lake and the Charlottetown Accords, the Parti Québécois won the 1994 Quebec election on the promise of holding another referendum on sovereignty (Whites 1999, 324; Hogg 2007, §5.7(a)). On 30 October 1995, the second referendum was held and the question posed to voters was whether “…Quebec should become sovereign, after having made a formal offer to Canada for a new economic and political partnership…” (Hogg 2007, §5.7(a)). The referendum was defeated by a narrow margin of 50.6% to 49.4% (Hogg 2007, §5.7(a); Haljan 1998, 191).\n\nAlthough the question posed to voters in the second referendum included the prospect of a continuing “economic and political partnership” with Canada, the question was somewhat stronger than the one posed in the first Quebec referendum on sovereignty for two reasons (Hogg 2007, §5.7(a)). First, whereas in the first referendum the Parti Québécois asked Quebec for a mandate to negotiate sovereignty-association with Canada, the second referendum implied that sovereignty would be declared regardless of whether Canada accepted Quebec’s offer of partnership (Hogg 2007, §5.7(a)). Second, whereas in the first referendum it was clear in the question itself that a second referendum would be held to approve the outcome of the sovereignty-association negotiations, the second referendum seemed to assume that the Quebec National Assembly had the authority to proclaim Quebec as a sovereign state as soon as the negotiations were complete or were judged fruitless (Hogg 2007, §5.7(a)). No second referendum would occur to approve the arrangements for Quebec’s separation (Hogg 2007, §5.7(a)). In essence, the second referendum was understood by many to proceed on the assumption that a unilateral declaration of independence would be legally effective to remove Quebec from Canada without any amendment to Canada’s constitution or without Canada’s approval to the terms of the arrangement for separation (Hogg 2007, §5.7(a)). It is not entirely clear that the Parti Québécois believed that a unilateral declaration of independence would be sufficient to effect secession without negotiation with the rest of Canada. Not only did the separatist movement beginning with René Lévesque always argue it would negotiate with the federal government, but the Parti Québécois appointed Lucien Bouchard as “Chief Negotiator” in 1976, suggesting they believed negotiation would follow a referendum victory (Phillips 1995; Doran 2001, 199–200). Nonetheless, the assumption that a unilateral declaration of independence was sufficient to effect secession formed the basis of a reference that ended up before the Supreme Court of Canada.\n\nIn the Secession Reference, the federal government posed three reference questions to the Supreme Court of Canada. First, the federal government asked whether Quebec’s National Assembly, legislature, or government could effect the secession of Quebec from Canada unilaterally under Canada’s constitution. A unanimous court answered no (Secession Reference 1998, para. 104). Second, the federal government asked whether Quebec’s National Assembly, legislature, or government could effect the secession of Quebec from Canada unilaterally under international law. A unanimous court also answered in the negative (Secession Reference 1998, para. 138). And third, the federal government asked in the event of a conflict between domestic and international law on Quebec’s right to effect unilateral secession from Canada, which would take precedence. The Supreme Court did not answer the question in light of its answers to the previous two questions (Secession Reference 1998, para. 147).\n\nOn the first issue, the Supreme Court of Canada held that Quebec could not unilaterally secede under Canada’s constitution without principled negotiations with other participants in the Confederation within Canada’s constitutional framework (Secession Reference 1998, para. 104). The Supreme Court reasoned as follows.\n\nSecession is the effort of a group or section of a state to withdraw itself from the political and constitutional authority of that state to achieve a new territorial unit on the international plane (Secession Reference 1998, para. 83). It is both a legal and a political act (Secession Reference 1998, para. 83). In legal terms, secession would require an amendment to Canada’s constitution, to which Quebec is bound despite its refusal to join the patriation of the constitution and the adoption of the Charter of Rights and Freedom of 1982, which would necessarily require negotiation, because an act of secession “would purport to alter the governance of Canadian territory in a manner which undoubtedly is inconsistent with our current constitution arrangements” (Secession Reference 1998, paras. 47 and 83–84).\n\nCanada’s constitution is an expression of the sovereignty of the people of the country (Secession Reference 1998, para. 85). It is made up of the written text, but also unwritten constitutional rules and principles – federalism, democracy, respect for minorities and constitutionalism and the rule of law – that inform and sustain the constitutional text and assist in the interpretation of the constitution and constitutional rights and obligations (Secession Reference 1998, paras. 32, 49 and 52). Democracy is an unwritten constitutional principle that may be given form through a referendum procedure (Secession Reference 1998, at paras. 32 and 87). Although the democratic principle would demand that considerable weight be given to the clear expression of the will of the people of Quebec to secede from Canada, democracy exists in the larger context of other constitutional principles (Secession Reference 1998, at paras. 87 and 149). A democratic vote by however strong a majority and the unwritten constitutional principle of democracy in Quebec could not have any legal effect on its own, nor could it push aside other the unwritten constitutional principles of federalism, the rule of law, the rights of individuals and minorities and the operation of democracy in the other provinces or in Canada as a whole (Secession Reference 1998, para. 151). As a result, while an expression of the democratic will of the people of Quebec could confer legitimacy on the efforts of the Quebec government to secede by legal constitutional means, Quebec could not, despite a clear referendum, purport to unilaterally invoke a right of self-determination to dictate the terms of a proposed secession to other parties in Canada’s federation (Secession Reference 1998, paras. 87 and 151).\n\nAs for the political aspect of secession, the Supreme Court was cautious in its guidance, but imposed a reciprocal obligation to negotiate on the other provinces and federal government. It held that should there be “a clear majority vote on a clear question” in favor of secession, this would confer legitimacy on the efforts of the Quebec government to initiate the constitutional amendment process to secede by legal means (Secession Reference 1998, para. 87). A clear repudiation of the people of Quebec of the existing constitutional order would impose a reciprocal obligation on the other provinces and federal government to negotiate constitutional changes to respond to that desire (Secession Reference 1998, para. 88). Although the negotiations do not need to lead to an agreement necessarily, the parties would be required to conduct negotiations consistent with constitutional principles and values considering the interests and rights of Quebec, other provinces, the federal government and minority groups (Secession Reference 1998, paras. 95–96). Notably, the Supreme Court did not define what “a clear majority on a clear question” means. Nor did the Court explain how the constitutional principles and values would govern negotiations. It left both of these questions for political actors to decide.\n\nHowever, the Court did opine on the consequences of one side refusing to negotiate or failing to negotiate consistent with constitutional principles and values. Although the Court acknowledged that “[w]here there are legal rights there are remedies”, it explained that in some circumstances, including the issue of Quebec’s secession, the only appropriate recourse “lies through the workings of the political process rather than the courts” (Secession Reference 1998, para. 102). As such, the Supreme Court held that to the extent that a party breaches its constitutional duty to negotiate in accordance with constitutional principles and values, the party could face consequences at the international level (Secession Reference 1998, para. 103). For Quebec, its failure to negotiate in accordance with constitutional principles and values could undermine its claim to legitimacy as an independent state, a precondition for recognition by the international community (Secession Reference 1998, para. 103). For the federal government and other provincial governments, their failure to fulfil their obligation to negotiate in accordance with constitutional principles and values could undermine the legitimacy of their response to Quebec’s request for secession and the existing constitutional arrangement (Secession Reference 1998, para. 103).\n\nIt is worth noting that, on one hand, the Supreme Court concluded that secession is a legal as much as a political act, and thus there is a legal obligation to negotiate on the parties if there is a clear majority on a clear question in favor of secession. On the other hand, the Court failed to explore any legal remedies if one side refused to negotiate or failed to negotiate consistent with constitutional principles and values (Hogg 2007, §5.7(a)). However, given the political context underlying the Secession Reference, it is not particularly surprising that the Court treaded with caution and avoided opining on issues it did not need to consider to answer the reference questions before it (see also: Choudhry and Howse 2000, 166; Penney 2005, 240–246, 258–259).\n\nOn the second issue, Quebec’s right to unilaterally effect secession under international law, the Supreme Court held that Quebec had no right under international law to unilaterally secede (Secession Reference 1998, para. 138). Both parties in the reference, the Attorney General of Canada and amicus curiae on behalf of Quebec, acknowledged through their experts that it was clear that international law does not specifically grant component parts of a sovereign state the legal right to secede unilaterally from their parent state (Secession Reference 1998, para. 111). However, amicus curiae argued that the right to unilateral secession in international law existed on two grounds. It exists because it is not specifically prohibited and what is not specifically prohibited is inferentially permitted (Secession Reference 1998, para. 111). Alternatively, amicus curiae argued that states have an implied duty to recognize the legitimacy of secession brought about by the exercise of the well-established international legal right of “a people” to self-determination (Secession Reference 1998, para. 111).\n\nThe Supreme Court rejected the first proposition. It noted that while international law neither contains a right of unilateral secession nor the explicit denial of such a right, the denial is somewhat implicit in the exceptional circumstances required for secession to be permitted under the right of people to self-determination (Secession Reference 1998, para. 112). As for the second proposition, the Court accepted that the right of self-determination belongs to “peoples” and much of the Quebec population certainly shares characteristics of being “a people” (Secession Reference 1998, paras. 123 and 125). But, the Court held that the right of secession only arises under the principle of self-determination of people at international law where “a people” is governed as part of a colonial empire; where “a people” is oppressed, as for example, under foreign military occupation; or possibly where “a people” is denied meaningful access to government to pursue their political, economic, social and cultural development (Secession Reference 1998, para. 138).\n\nIn all three of these circumstances, “a people” is entitled to a right of secession under the principle of self-determination because they have been denied their ability to internally exert their right to self-determination (Secession Reference 1998, para. 138). All three of these circumstances are exceptional and in the Supreme Court’s view were “manifestly inapplicable to Quebec under existing conditions” (Secession Reference 1998, para. 138). Quebec did not meet the threshold of a colonial or an oppressed people (Secession Reference 1998, para. 154). Nor could it be said that Quebecers were being plausibly denied access to government to pursue their political, economic, social, and cultural development (Secession Reference 1998, paras. 136 and 154). Quebecers were equitably represented in Canada’s legislative, executive and judicial institutions (Secession Reference 1998, para. 136). The Supreme Court noted, that for close to 40 of the last 50 years, as at the time of the reference, the Prime Ministers of Canada have been Quebecers, Quebecers have held from time to time all the most important positions in the federal Cabinet and at the time, the Prime Minister of Canada, the Right Honourable Chief Justice of Canada and two other members of the Supreme Court, the Chief of Staff of the Canadian Armed Forces, and the Canadian ambassador to the United States and the Deputy Secretary-General of the United Nations were all Quebecers (Secession Reference 1998, para. 135). Quebecers occupied prominent positions within the government of Canada and were free to make political choices and pursue economic, social and cultural development within Quebec, across Canada and throughout the world (Secession Reference 1998, para. 136). As a result, the Court concluded that the “continuing failure to reach agreement on amendments to the Constitution, while a matter of concern, does not amount to a denial of self-determination” and based on the constitutional arrangements in place at the time of the reference “Quebecers [were not] in a disadvantaged position within the scope of the international law rule” (Secession Reference 1998, para. 137).\n\nThe Supreme Court did not close its eye to the possibility that de facto secession could take place without the required agreement or constitutional amendments (Secession Reference 1998, paras. 106 and 143). It recognized that Quebec could unilaterally effect its secession as a matter of fact (Secession Reference 1998, para. 106). Such a secession would be unconstitutional, but the Court noted that an unconstitutional secession could ultimately become effective if the seceding government achieved effective control of a territory and recognition by the international community (Secession Reference 1998, paras. 106–107). Recognition by the international community would likely be contingent on the legality and legitimacy of secession having regard to the conduct of Quebec and the rest of Canada (Secession Reference 1998, para. 155). But even then, such recognition would not provide retroactive jurisdiction for the act of secession at international law (Secession Reference 1998, para. 155). Secession would remain an illegal act, but it would acquire legal status if, as a matter of “empirical fact”, it came to be recognized on the international plane (Secession Reference 1998, para. 146).\n\nImplications of the Secession Reference and the Right of External Self-Determination in International Law\n\nIn Canada, the immediate events that followed the Secession Reference was Parliament’s enactment of the Clarity Act (Hogg 2007, §5.7(a). The Clarity Act was intended to provide direction on the process by which it would be determined whether a referendum had yielded “a clear majority on a clear question” (Hogg 2007, §5.7(a)). But more importantly, relying on the Supreme Court’s decision in Secession Reference, the Clarity Act “recognized” that under Canada’s constitution, there is no unilateral right of secession and that an amendment of the constitution would be required in order for a province to secede from Canada (Hogg 2007, §5.7(a)).\n\nOn the international stage, the Secession Reference led to two primary developments. First, it clarified and explained the state of international law concerning the scope of the right of external self-determination. Second, it provided valuable guidance on the importance of process legitimacy and the duty to negotiate between opposing factions in the context of secessionist attempts in representative and constitutional democracies, which has been relied on by countries around the world including Spain, Scotland, Italy, the European Union after Brexit, Sri Lanka and Ethiopia, to name a few (Delledonne and Martinico 2019; see also: Choudhry 2017, 1085–1092). The first development is the focus of this article and the discussion below.\n\nSelf-determination as a principle of international law was first considered in the Åland Islands case of 1921. At issue was whether the citizens of the Åland Islands could assert their right to self-determination to hold a plebiscite which would “leave no doubt as to the unanimous wish of the population for reunion with Sweden” and secession from Finland (Report of the Rapporteurs on Åland Islands 1921, 1). The Council of the League of Nations concluded that sovereignty of the Åland Islands belonged to Finland and resolved that Finland provide new guarantees on the language, culture and rights of the citizens of the Åland Islands (Åland Islands Case 1921, 699). The Council’s legal reasoning and commentary on self-determination is found in legal reports from the Commission of Jurists and Commission of Rapporteurs it appointed to advise it on the case (Åland Islands Case 1921, 699).\n\nBoth Commissions firmly rejected a positive international law right of external self-determination and the Commission of Rapporteurs did not even recognize self-determination as a rule of international law (Report of the ICJ on Åland Islands 1920; Report of the Rapporteurs on Åland Islands 1921, 3). The Commission of Jurists concluded “[p]ositive international law does not recognise the right of national groups, as such, to separate themselves from the State of which they form part by the simple expression of a wish, any more than it recognises the right of other States to claim such a separation. Generally speaking, the grant or refusal of the right to a portion of its population of determining its own political fate by plebiscite or by some other method, is exclusively, an attribute of the sovereignty of every State which is definitively constituted…” (Report of the ICJ on Åland Islands 1920). Similarly, the Commission of Rapporteurs concluded that the principle of self-determination “is not, properly speaking a rule of international law and the League of Nations has not entered it in its Covenant. … It is a principle of justice and of liberty, expressed by a vague and general formula which has given rise to the most varied interpretations and differences of opinion” (Report of the Rapporteurs on Åland Islands 1921, 3).\n\nIt was almost 25 years later, when the Charter of the United Nations came into force, that the international community officially recognized the principle of self-determination (Crawford 2019, 130). Article 1 of the UN Charter provides that the purposes of the United Nations is to “develop friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples”. Article 55 of the UN Charter similarly provides that the United Nations will promote international economic and social cooperation “based on respect for the principle of equal rights and self-determination of peoples”.\n\nMany saw the references to the principle of self-determination in the UN Charter as “merely hortatory” (Crawford 2019, 130). However, this concern was soon addressed when the international community not only adopted self-determination of all peoples but framed it as a right. In the Declaration on the Granting of Independence to Colonial Countries and Peoples (“Declaration”) adopted by the UN General Assembly in 1960, and referred to in a long series of resolutions since, the principle of self-determination is recognized as one of the obligations stemming from the UN Charter and the right of self-determination of all peoples – to freely determine their political status and freely pursue their economic, social and cultural development – is expressly acknowledged (Crawford 2019, 131). Recognition of self-determination as a right was further reinforced when it was included in Articles 1 of the International Covenant on Civil and Political Rights (“ICCPR”) and the International Covenant on International Covenant on Economic, Social and Cultural Rights (“ICESCR”) in 1966 (Crawford 2019, 131).\n\nAt the time of the Declaration and the ICCPR and ICESCR, the main purpose of recognizing a right of self-determination of all peoples was to provide a meaningful vehicle for decolonization (Abel 2020). Indeed, between 1945 and 1970, 55 states gained independence through the application of the right of self-determination (Abel 2020; Namibia 1971, 75). In 1971, in its advisory opinion, Legal Consequences for States of the Continued Presence of South Africa in Namibia (South West Africa) notwithstanding Security Council Resolution 276 (1970), the International Court of Justice (“ICJ”) considered the legal consequences for other States of South Africa’s continued presence in Namibia. The ICJ confirmed the existence of a positive international law right of self-determination, found that the right to self-determination became applicable to non-self-governing territories, such as Namibia, and seemed to suggest that the very process of decolonization could be understood in terms of the application of the right to self-determination (Namibia 1971, 31). Decolonization was therefore one of the prime purposes, if not the prime purpose, of the advancement of a right to external self-determination (Abel 2020).\n\nHowever, as territories under a colonial regime increasingly relied on the right of external self-determination to become post-colonial states, the international community became concerned with the ramifications of a right of external self-determination in a post-colonial world (Abel 2020; Buchanan 1992, 348; see also: Buchheit 1978, 117–121). The Commission of Rapporteurs had given voice to this concern several decades earlier in its report relating to the Åland Islands case. In explaining why an absolute rule allowing the minority population of a State to have a right of external self-determination was not possible, the Commission stated, “[t]o concede to minorities, either of language or religion, or to any fractions of a population the right to withdrawing from the community to which they belong, because it is their wish or good pleasure, would be to destroy order and stability within States and to inaugurate anarchy in international law; it would be to uphold a theory incompatible with the very idea of the State as a territorial and political unit” (Report of the Rapporteurs on Åland Islands 1921, 4). The Commission’s theoretical concern was starting to be seen in the international community as having potential to become reality. As a result, self-determination began to be referred to once more as a principle and the customary international law principle of uti possidetis further developed (Klabbers 2006, 195; Abel 2020).\n\nFour years after Namibia, in 1975, the ICJ considered in its advisory opinion Western Sahara whether there were any legal ties between the Western Sahara territory and Morocco and/or the Mauritanian entity. The ICJ answered the question in the affirmative (Western Sahara 1975, 68–69). It found there had been legal ties of allegiance not establishing any ties of territorial sovereignty between both Morocco and the territory in question and the Mauritanian entity and the territory (Western Sahara 1975, 68). As such, none of the involved parties could establish title to the territory in question before the occupation of the territory in Spain but could point to having some legal ties with the territory. And in the absence of ties of territorial sovereignty, the ICJ held that there were no legal ties that could affect the application of self-determination with respect to the territory, in particular the application of “the principle of self-determination through the free and genuine express of the will of the peoples of the Territory” (Western Sahara 1975, 68).\n\nWestern Sahara is notable in the development of the understanding of the right of self-determination for two main reasons. First, the ICJ defines “the principle of self-determination” as “the need to pay regard to the freely expressed will of peoples” (Western Sahara 1975, 33). By omission, the ICJ excluded secession and other modalities of self-determination (Klabbers 2006, 194). Second, in Western Sahara, the ICJ repeatedly refers to self-determination as a principle not a right and ultimately defines “the principle of self-determination” (Western Sahara 1975, 33, 68). In effect, the ICJ conceived of self-determination as a procedural principle that has much to do with figuring out the “freely expressed will of people” but not necessarily attaching any substantive or enforceable rights to this freely expressed will (Klabbers 2006, 195 and 197).\n\nAt the same time, the international community’s concerns with the scope of the right of external self-determination could also be seen in the development of the customary international law principle of uti possidetis, a principle that was well-established in international law even before the time of the Åland Islands case but gained new attention in the 1980s. In the Case Concerning the Frontier Dispute, the ICJ considered the delimitation of the land frontier between Burkina Faso and Mali. In explaining the principle of uti possidetis, the ICJ held it is “a general principle, which is logically connected with the phenomenon of the obtaining of independence, whenever it occurs” (Frontier Dispute 1986, 565). Moreover, in laying out support for the principle of uti possidetis, the ICJ invoked the “principle of self-determination” (but also referring to it as a right in other places) to explain that stability has “induced” African states to consent to the maintenance of the “territorial status quo in Africa” and to “take account of it in the interpretation of the principle of self-determination of peoples” (Frontier Dispute 1986, 566–567).\n\nAlthough, the Frontier Dispute is not a case about the right or principle of self-determination (the ICJ spoke about the right of self-determination only in passing), some scholars have taken it for implying two things with respect to self-determination. First, in Frontier Dispute as in Western Sahara, the ICJ construed self-determination as a principle rather than as a right (Klabbers 2006, 196). Second, the ICJ’s explanation of the principle of uti possidetis and self-determination shows that the Court viewed self-determination in territorial terms as something belonging to territories, not peoples (Klabbers 2006, 196).\n\nThe ICJ has also considered self-determination in three additional cases. In 1995, in East Timor (Portugal v. Australia), the ICJ held that the “principle of self-determinations of peoples has been recognized by the United Nations Charter and in the jurisprudence of the Court”, is one of the “essential principles of contemporary international law,” and has an erga omnes character (East Timor 1995, 102). All three of these propositions were confirmed in 2004 in the ICJ’s advisory opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory, and, as recently as 2019, in the ICJ’s advisory opinion on the Legal Consequences of the Separation of the Chagos Archipelago from Mauritius in 1965 (Wall 2004, 171–172; Chagos Archipelago 2019, 136 and 139). Notably, in all these cases, the ICJ oscillated between referring to self-determination as a right and a principle.\n\nThe ICJ and international community’s preoccupation with limiting the right of self-determination is plain. As mentioned above, the concerns were first described in the Commission of Rapporteurs report relating to the Åland Islands case in the 1920s (Report of the Rapporteurs on Åland Islands 1921, 4). And the United Nations gave voice to this concern in 1992 in a report of the Secretary-General to the UN General Assembly and Security Council where it recognized the time of “absolute and exclusive sovereignty” has passed, but stated “[y]et if every ethnic, religious or linguistic group claimed statehood, there would be no limit to fragmentation, and peace, security and economic well-being for all would become ever more difficult to achieve” (Agenda for Peace 1992, 5).\n\nIn 1998, the Supreme Court of Canada considered the right of external self-determination in the Secession Reference in light of this international context and understanding of the right of self-determination. As a starting point, the Supreme Court used both principle and right to describe self-determination but seemed to conceptualize self-determination as a right but one so widely recognized in international treaties that it could also be considered a general principle of international law (Secession Reference 1998, paras. 113–114). But more importantly, as detailed above, the Supreme Court definitively identified two bases on which peoples could have a right to external self-determination: where a people is governed as part of a colonial empire and where a people is subject to alien subjugation, domination or exploitation (Secession Reference 1998, para. 154). And the Court recognized a third circumstance that “possibly” gives rise to a right of external self-determination – where a people is denied any meaningful exercise of its right to self-determination within the state of which it forms a part – known in the international community as “remedial secession”, a controversial concept in international law which came to the forefront in the Kosovo, Crimea and Palestine disputes (Secession Reference 1998, para. 154; Crawford 2019, 132).\n\nRemedial secession began to seriously be considered and developed by scholars as a third basis of external self-determination in response to a wave of ethnic conflicts that affected several states in the early to mid-1990s (Meester 2010, 218; Tomuschat 2006, 42; Suksi 2005, 225; see also: Buchanan 1992, 354–356). Beyond the two broadly accepted situations of colonial domination and alien subjugation, some scholars created a new category of external self-determination, that of a last-resort remedy entailing a right to secede in situations involving denial of internal self-determination or massive human rights abuses (Meester 2010, 218).\n\nRemedial secession was argued to be grounded in two sources (Meester 2010, 219). First, in the report of the Commission of Rapporteurs in the Åland Islands case. The Commission seemed to recognize that “[t]he separation of a minority from the State of which it forms a part and its incorporation in another State can only be considered as an altogether exceptional solution, a last resort when the State lacks either the will or the power to enact and apply just and effective governance” (Report of the Rapporteurs on Åland Islands 1921, 4). Second, scholars found support in the 1970 Declaration on Principles of International Law Concerning Friendly Relations and Co-operation among States in Accordance with the Charter of the United Nations. It states:\n\n[A]ll peoples have the right freely to determine, without external interference, their political status and to pursue their economic, social and cultural development … Nothing in the foregoing paragraphs shall be construed as authorizing or encouraging any action which would dismember or impair, totally or in part, the territorial integrity or political unity of sovereign and independent States conducting themselves in compliance with the principles of equal rights and self-determination as described above and thus possessed of a government representing the whole people belonging to the territory without distinction as to race, creed or colour. (Declaration 1970, 8, 10–11)\n\nIn Secession Reference, in recognizing that where “a definable group is denied meaningful access to government to pursue their political, economic, social and cultural development”, an international law right of external self-determination could “possibly” exist but “remains unclear” the Supreme Court of Canada contemplated the existence of this third category of external self-determination that some scholars were arguing for (Secession Reference 1998, paras. 135, 138, and 154; Meester 2010, 220; Constantinides 2018, 67). However, it is fair to say that remedial secession was not and is not an established rule or principle of international law and the Secession Reference did not change international law in that regard (Crawford 1999, 114; 2006, 390; 2019, 132; Meester 2010, 220; Constantinides 2018, 67; Mar 2013, 79–108).\n\nRemedial secession came to the forefront on the international stage in 2000s when Kosovo unilaterally declared independence from its parent state, Serbia, on 17 February 2008. The United Nations General Assembly asked the ICJ to render an advisory opinion on whether Kosovo’s unilateral declaration of independence was in accordance with international law. Several parties made submissions on the issues of remedial succession before the ICJ, but a majority of the Court found it unnecessary to consider the issue and refused to directly address it (Kosovo 2010, 438). However, 11 of 36 State submissions expressly recognized and supported remedial secession as established in international law and two judges also supported it in their separate opinions, and most of them cited the Supreme Court of Canada’s decision in Secession Reference (Meester 2010, 223).\n\nIn particular, Judge Abdulqawi Ahmed Yusuf was the most explicit in supporting remedial secession. He began with clearly stating that right of self-determination is one that is not “of mere historical interest nor has it exhausted its role in international law following the end of colonialism” (Kosovo 2010, 621). In the post-colonial context, the right of self-determination can operate to “pierce” the veil of sovereignty and confer certain internationally protected rights on peoples, groups and individuals who may be subject to “acts involving atrocities, persecution, discrimination and crimes against humanity committed inside a State” and imposes obligations on their own State as well as other States (Kosovo 2010, 620–621).\n\nJudge Yusuf recognized that international law disfavours the fragmentation of existing states, promotes stability within the borders of states and does not grant every racially or ethnically distinct group within a state, even if it qualifies as a people for the purposes of self-determination, a right to unilateral secession simply because it wishes to create its own separate state (Kosovo 2010, 620 and 622). But he found that international law pays close attention to the plight of such groups where “the State not only denies them the exercise of their internal right of self-determination (as described above), but also subjects them to discrimination, persecution and egregious violations of human rights or humanitarian law” (Kosovo 2010, 622). Under such exceptional circumstances, the right of peoples to self-determination can support a claim to separate statehood if it meets the conditions prescribed by international law (Kosovo 2010, 622).\n\nJudge Yusuf went on to note that in order to determine whether a specific situation constitutes an exceptional case that could justify a claim to external self-determination, certain criteria have to be considered, such as “such as the existence of discrimination against a people, its persecution due to its racial or ethnic characteristics, and the denial of autonomous political structures and access to government” (Kosovo 2010, 624). In addition, “[a]ll possible remedies for the realization of internal self-determination must be exhausted before the issue is removed from the domestic jurisdiction of the State” (Kosovo 2010, 624). Judge Yusuf’s opinion clearly lends support to remedial secession as a third basis of external self-determination the Supreme Court of Canada identified in Secession Reference.\n\nRemedial secession also received support in the separate opinion of Judge Antônio A. Cançado Trindade. Unlike Judge Yusuf, Judge Trindade did not expressly adopt a right of remedial secession, but his opinion seemed to adopt much of the language pertaining to the concept (Meester 2010, 244). Judge Trindade began by accepting that the principle of self-determination has survived decolonization “to face nowadays new and violent manifestations of systematic oppression of peoples” (Kosovo 2010, 593). He went on to note:\n\nNo State can invoke territorial integrity in order to commit atrocities (such as the practices of torture, and ethnic cleansing, and massive forced displacement of the population), nor perpetrate them on the assumption of State sovereignty, nor commit atrocities and then rely on a claim of territorial integrity notwithstanding the sentiments and ineluctable resentments of the “people” or “population” victimized. … Such atrocities amount to an absurd reversal of the ends of the State, which was created and exists for human beings, and not vice-versa. (Kosovo 2010, 593)\n\nJudge Trindade found that States have a duty to protect and empower their inhabitants, a duty that finds grounding in the 1970 Declaration on Friendly Relations and the 1993 Vienna Declaration and Programme of Action (Kosovo 2010, 594–595). He concluded that a government that incurs grave and systematic violations of human rights ceases to represent the people of a victimized population and fails to conduct itself in compliance with the principle of equal rights and self-determination of peoples (Kosovo 2010, 595).\n\nJudge Trindade did not expressly accept that the right of self-determination of peoples incorporates remedial secession, but he appeared to accept the concept when he refers to the principle of self-determination arising from new situations of systematic oppression, subjugation and tyranny as taking precedence over the principle of territorial integrity (Meester 2010, 244). Indeed, when Judge Trindade concluded, regarding Kosovo, that “the entitlement to self-determination of the victimized population emerged, as the claim to territorial integrity could no longer be relied upon by the willing victimizers”, he appeared to give voice to the legitimacy of remedial secession (Kosovo 2010, 595).\n\nAlthough remedial secession is not an established rule or principle of international law, the existence and legitimacy of it remains an open question (Crawford 2019, 232). In Canada, remedial secession certainly remains a possibility, but the situation in Quebec must rise to the Supreme Court’s threshold of the peoples of Quebec being denied any meaningful exercise of their right of self-determination within the country, an exceptionally high standard. In the Case of Lozidou v. Turkey, two judges of the European Court of Human Rights in a concurring opinion accepted that “peoples may also exercise a right to self-determination if their human rights are consistently and flagrantly violated or if they are without representation at all or are massively under-represented in an undemocratic and discriminatory way” (Lozidou 1996, 24). And in Kosovo, while the ICJ majority opinion refused to consider remedial secession and one judge expressly refused it, two judges accepted remedial secession, and maybe more would have if the ICJ would have considered the issue (Meester 2010, 252). Until then, remedial secession has and will continue to be raised as an argument in situations of self-determination and unilateral secession such as the Kosovo, Crimea and Palestine disputes and the issue remains open to debate."}, {"url": "https://simple.wikipedia.org/wiki/1980_Quebec_referendum", "page_content": "The 1980 Quebec independence referendum was the first referendum in Quebec on whether Quebec should make a deal with Canada that would allow the province to have more control over its own laws, government, and trade agreements with other countries. The referendum was called by Quebec's Parti Québécois (PQ) government. The PQ wanted Quebec to be independent from Canada.\n\nThe province-wide referendum took place on Tuesday, May 20, 1980, and the proposal to request more independence from Canada was defeated. 59.56 percent of voters voted against the referendum question and 40.44 percent voted in favour of it.[1]\n\nA second referendum on sovereignty in 1995 also failed, but by a smaller margin (50.58% to 49.42%).\n\nQuebec, a province in the Canadian Confederation since its foundation in 1867, has always been the only province where the most commonly spoken language is French. Quebec has also historically been very connected to French culture and the Catholic Church, which was seen as the national church when the French colonists began to settle in what became Quebec. Many Quebecois people value their French identity and culture. In the early 1960s, Quebec went through a Quiet Revolution where politicians separated the role of the church from the role of government organisations in a process called secularisation. During this time period, political groups in the province began to identify as federalists (who wanted to be a part of a unified Canada) and sovereigntists (who wanted Quebec to become a sovereign nation state, separate from Canada).\n\nA prominent sovereigntist was René Lévesque, who helped found the Parti Québécois (PQ) with like-minded separatists. The PQ proposed \"sovereignty-association\", a proposal for Quebec to be a sovereign nation-state while also sharing an economic partnership with Canada. The PQ had originally planned on declaring independence upon forming government, without putting it up for a vote in Quebec. Instead of doing this, the PQ chose to use a referendum so that the international community would be more likely to accept them as a truly independent nation.\n\nThe PQ won the 1976 election, beating the governing Quebec Liberals. The PQ campaign platform included a promise to hold a referendum on sovereignty-association during their first term. In government, the PQ created a number of popular reforms to long-term issues in the province, including francophone nationalist laws such as Bill 101, which reinforced French as the province's official language.\n\nThe PQ's beliefs were in conflict with the federal Liberal government of Pierre Elliot Trudeau, who did not agree with Quebec sovereignty. Instead, Trudeau urged Quebecers to seek empowerment at the federal level through reforms that provided for bilingualism and protection for individual rights. Trudeau was considered such a major opponent to Quebec sovereignty that Lévesque refused to call a referendum while Trudeau was the Prime Minister.\n\nThe Progressive Conservatives led by Joe Clark won a minority government in the May 22 1979 federal election. Clark's minority government made a point to not have the federal government be involved in the referendum, leaving the task of representing federalist voices to Claude Ryan, the new leader of the Quebec Liberal Party.\n\nOn June 21, 1979, Lévesque announced the promised referendum would occur in the spring of 1980, and that the question on the ballot would be announced before Christmas.\n\nLead-up to the Referendum Campaign [ change | change source ]\n\nOn November 1, 1979, the Quebec government released its constitutional proposal in a white paper titled Québec-Canada: A New Deal. The Québec Government Proposal for a New Partnership Between Equals: Sovereignty-Association.\n\nA dramatic change occurred in Ottawa on December 11, 1979, when the Clark government unexpectedly lost a vote of confidence on a budget bill, forcing a federal election. Three days afterward, Trudeau announced his return as leader of the Liberals. Polls showed Clark losing handily.\n\nThe wording of the referendum question was a subject of debate between members of the Parti Québécois caucus. Some preferred a simple wording focused on Quebec becoming sovereign from Canada. Lévesque realised that sovereignty-association would require negotiations with the Government of Canada. Lévesque decided that the question would be written so that it gave the government of Quebec the power to negotiate with the Government of Canada, and that if the referendum passed, they would have a second referendum after making an agreement with the Canadian government so that Quebecers could approve the deal or vote against it. He also felt the safety of a second referendum would convince swing voters to vote \"Yes.\"\n\nA significant debate arose as to whether a \"question\" under the Referendum Act could have more than one sentence: the final compromise was to use semicolons.\n\nThe question announced on December 20, 1979 was:\n\n\"The Government of Quebec has made public its proposal to negotiate a new agreement with the rest of Canada, based on the equality of nations; this agreement would enable Quebec to acquire the exclusive power to make its laws, levy its taxes and establish relations abroad — in other words, sovereignty — and at the same time to maintain with Canada an economic association including a common currency; any change in political status resulting from these negotiations will only be implemented with popular approval through another referendum; on these terms, do you give the Government of Quebec the mandate to negotiate the proposed agreement between Quebec and Canada?\"[note 1]\n\nLévesque, while noting its cumbersome nature, stated that it was transparent and could be easily understood.\n\nLegislative debate [ change | change source ]\n\nOn February 18, 1980, the federal Liberals won a majority in the House of Commons, and Trudeau returned as Prime Minister. Trudeau announced Jean Chrétien as having responsibilities for the federal response to the referendum.\n\nTelevision had recently been introduced to the Quebec National Assembly, and the legislative debate on the referendum question was scheduled for prime time live viewing on March 4, 1980. The debate lasted two weeks, and the result was a PQ success and a disaster for the provincial Liberals. The PQ Cabinet, coordinated by House Leader Claude Charron, provided detailed outlines of their files and the benefits they said sovereignty would provide them. The Liberals did not consider that the television audience would view their quick and taunting retorts about the referendum question to be insubstantial compared to the lengthy and detailed speeches of PQ members. The Liberals seemed to lack preparation and Ryan, unaware of the television cameras, was caught yawning on a few occasions during Liberal interventions.\n\nPolls released after the debates showed the Yes and No side roughly even, with a majority among Francophone voters for the \"Yes\" side.\n\nBrunch des Yvettes [ change | change source ]\n\nLess helpful to the \"Yes\" campaign was a speech by former television presenter Lise Payette to a committee in Montreal, where she mocked what she viewed as the \"No\" side's complacency by imagining a person who planned on voting \"No\" as a Yvette - a docile schoolgirl from pre-Quiet Revolution schoolbooks. Payette also used this as a general theme in the legislature. Payette stated that Ryan wanted a Quebec full of \"Yvettes\" and that his wife, Madeline Ryan, was an Yvette. Lise Bissonnette, a popular journalist, responded to Payette's personal attack wrote a sarcastic editorial that compared Payette's television career with Mme Ryan's accomplishments in the public and private sector.\n\nPayette apologized during the legislative debate, but the remark and the editorial sparked a movement. On March 30, a group of 1,700 women, including Madeline Ryan, held the brunch des Yvettes at the Château Frontenac in Quebec City. The movement grew until a rally at the Montreal Forum on April 7 when 14,000 women denounced the minister's declarations about women and manifested their support for the \"No\" side.\n\nOn April 15, Lévesque announced before the National Assembly the referendum would occur on May 20, 1980. The same day, on the opening of the House of Commons, Trudeau announced that the Government of Canada would not negotiate sovereignty-association under any circumstances, as he considered the question too vague and the Canadian government's authority too uncertain to do so. He also stated that the question was too vague to give Lévesque and the PQ any mandate to declare independence, making any result from a \"Yes\" vote impossible; in contrast, he offered that a \"No\" vote would lead to constitutional change. His position was supported by Clark and national NDP leader Ed Broadbent.\n\nThe \"Yes\" campaign was, in the initial stages, low key. It focused on gaining broad acceptance of sovereignty-association through specialized \"regroupments\" that would be presented with special certificates at ceremonies led by Lévesque and other cabinet ministers. The regroupments were seen as an attempt to show broad support for the movement and create conversations at the ground level, however, the attempt to create them in some heavily Federalist professions, such as lawyers, prompted a severe backlash.\n\nThe \"No\" campaign, led by Ryan, was run as a traditional election campaign, with Ryan campaigning during the day and making speeches in local hockey arenas across rural Quebec.\n\nControversially, the Canadian government became involved on its own accord in the referendum despite the provisions of the provincial Referendum Act, which tightly restricted all campaigning to the designated \"Yes\" and \"No\" committees with set budgets. Canadian government politicians made appearances coordinated by Minister of Justice Jean Chrétien and Marc Lalonde, mainly speculating on the economic uncertainty a \"Yes\" vote could bring. Chrétien argued that prominent PQ member Claude Morin would sacrifice Canada's oil and national gas price to drive in an ambassadors' Cadillac. Lalonde argued that old age pensions were directly threatened by a \"Yes\" vote. Though initially reluctant, Ryan started to accept and welcome the Canadian government's help, and continued to speak across Quebec.\n\nThe referendum prompted an unheard-of political mobilization, and the campaign was seen as a traumatic event in Quebec, as the hard choice between \"Yes\" and \"No\" shattered the nationalist consensus that had existed since the Quiet Revolution.\n\nTrudeau at Paul Sauvé Arena [ change | change source ]\n\nOn May 14, six days before the vote, Trudeau made his final appearance at a packed Paul Sauvé Arena, where the PQ had celebrated their victory in 1976. Trudeau attacked the \"Yes\" campaign for not asking a clear question, and stated that a \"Yes\" vote was a dead end, given that the rest of Canada was not bound by the question and that it was too vague to pursue independence if negotiations were refused.\n\nTrudeau then stated that he would interpret a vote for the \"No\" as a mandate to renew federalism and change the constitution, putting his MPs' seats on the line if he were to fail to keep this promise. Addressing himself to Canadians outside Quebec on behalf of his MPs, Trudeau challenged English Canada that change would have to occur and that the referendum could not be interpreted as an endorsement of the status quo.\n\nAfter this Trudeau hit an emotional high note, invoking a remark by Lévesque days earlier that he was showing his \"Elliott\" side during the campaign. Trudeau detailed the story of his parents, who had both had many ancestors in Quebec, and remarked that his full name was both a Québécois and a Canadian name. Trudeau then began to list members of the Parti Québécois who had Irish or English last names. The riposte brought the crowd to an uproar, and Trudeau exited to chants of \"Elliott.\"\n\nThe speech, which prompted Morin to wonder if his mind was changed, was seen as the death knell of the \"Yes\" camp, despite Lévesque's attempts to cast doubt over Trudeau's words.\n\nNo: 2,187,991 (59.56%) Yes: 1,485,851 (40.44%) ▲\n\nTotal votes % of votes Valid ballots 3,673,842 98.26% Rejected ballots 65,012 1.74% Participation rate 3,738,854 85.61% Registered voters 4,367,584\n\nImmediate aftermath [ change | change source ]\n\nAfter the lopsided defeat, a visibly emotional Lévesque addressed his supporters, many of whom were shown on screen in tears at the result. Lévesque began his concession speech by saying \"My dear friends, if I understand you correctly, you're saying: 'until next time.'\" In the speech, he called the Canadian government's involvement in the campaign \"scandalously immoral,\" and emphasized that the result must be accepted and that it was now the Canadian government's responsibility to provide the changes to the constitution that Trudeau had promised. Lévesque ended by asking the audience to sing \"Gens du Pays\" for him, as he did not have any voice left.\n\nClaude Ryan's speech was later in the evening. After refusing to let Jean Chrétien use the microphone to address those gathered, he proceeded to demand an election be called and listed every riding that had voted for the \"No\" side. The speech was generally seen as callous and harsh, especially after the emotional crowd scenes broadcast during Lévesque's speech. Trudeau addressed the country afterward with a more conciliatory tone, emphasizing the need for unity after the hurt feelings and strained friendships that had been caused by the referendum. The next morning, Chrétien was tasked with creating a provincial consensus.\n\nMaximum amount authorized by referendum law: $2,122,257 ($0.50/voter x 4,244,514 voters)\n\n\"No\" Committee:\n\nState subsidy ($0.25/voter): $1,061,128.50\n\nAmount received by political parties: $987,754.04\n\nContributions by voters: $11,572.60\n\nTotal fund: $2,060,455.11\n\nTotal committed and discharged expenditure: $2,060,455.00\n\n\"Yes\" Committee:\n\nState subsidy ($0.25/voter) : $1,061,128.50\n\nAmount received by political parties: $683,000.00\n\nContributions by voters: $305,118.05\n\nTotal fund: $2,049,246.55\n\nTotal committed and discharged expenditure: $2,047,834.00\n\n[20]\n\nAfter the referendum, Trudeau acted upon his promise by calling together the provincial premiers in a first ministers' conference. The meeting showed signs of deadlock, and Lévesque surprised observers by uniting with the dissident premiers, who warmly received his decentralist views. Facing a lack of cooperation from the premiers, Trudeau then announced his intention to unilaterally patriate the constitution from the United Kingdom and have a charter of rights and constitutional amending formula approved by national referendum.\n\nIn the meantime, there was a provincial election in Quebec. Despite a brief post-referendum malaise, the PQ easily defeated Ryan's Liberals in the 1981 provincial election, campaigning both on their governing record and against Trudeau's intentions. Notably, the PQ did not promise to hold a second referendum.\n\nWith regards to Trudeau's plans to unilaterally patriate and change the constitution, the newly re-elected Lévesque, who had initially argued for the incorporation of a Quebec veto into the new constitution, agreed with eight other premiers (the Gang of Eight) to a proposal that would not allow Quebec a veto, but would permit \"opting out\" of certain federal endeavours with compensation.\n\nThe federal government, still interested in proceeding unilaterally, sought an opinion on whether it was legally entitled to do so from the Supreme Court of Canada. The Supreme Court ruled that any constitutional changes, including patriation of the constitution, could be made unilaterally under the letter of the law, but, by non-binding convention, \"a substantial degree of provincial consent was required\".\n\nThe Supreme Court's decision prompted a final meeting among the first ministers. Lévesque abandoned the Gang of Eight and opted to join Trudeau in advocating immediate patriation with the promise of a future referendum on the other matters. The other premiers, loath to be seen arguing against the charter of rights that was included in Trudeau's proposed constitutional changes, formulated a compromise proposal with Jean Chrétien that was acceptable to the Canadian government. The compromise came during the Kitchen Meeting, which took place after Lévesque had left for the evening. In Quebec, that night has sometimes been called the \"Night of the Long Knives\".\n\nAs a result of the compromise between the premiers (other than Lévesque) and the federal government, the government partiated the Canadian constitution in the Constitution Act, 1982 without support from Lévesque or Quebec's National Assembly. The result was a shattering defeat for the PQ, especially after the Quebec government's loss in its Quebec Veto Reference case. The National Assembly of Quebec, compared to its position in 1976, actually lost power under Lévesque and the PQ.\n\nHistorical debate would centre on whether Trudeau's advocacy and agreement on patriation were in accord with or in contravention of his commitments made in his speech at the Paul Sauvé Arena. Trudeau defended his actions by stating he had kept his promise to deliver a new constitution that resided entirely within Canada and an embedded Charter of Rights. Quebec nationalists argue that this is an overly literal view of his words and that, in context to a Québécois audience, Trudeau had promised that Quebec would be given a status in accordance with a decentralized view of federalism, or his MPs would resign.\n\nIn 1984, Brian Mulroney led the Progressive Conservatives to victory nationally, having committed during the campaign to try to find a way to accommodate Quebec's objections to the constitution. Lévesque pledged to take the risk of trying to work towards a deal with Mulroney. This led to a split in the PQ and subsequently Lévesque's resignation from politics in 1985. After the PQ defeat by the Liberals of Robert Bourassa, the Mulroney government began negotiations with Quebec to find a deal that would be acceptable to all provinces. The 1987 Meech Lake Accord and the 1992 Charlottetown Accord, despite receiving unanimous consent among the provincial premiers, each failed in dramatic public fashion, reviving the sovereignty movement.\n\nThe PQ returned to office, led by hard-line separatist and former Finance Minister Jacques Parizeau, in 1994. Parizeau called a second sovereignty referendum of 1995, which featured a more direct question. That referendum failed by a margin of less than 0.6%.\n\n↑ In French: « Le Gouvernement du Québec a fait connaître sa proposition d’en arriver, avec le reste du Canada, à une nouvelle entente fondée sur le principe de l’égalité des peuples ; cette entente permettrait au Québec d'acquérir le pouvoir exclusif de faire ses lois, de percevoir ses impôts et d’établir ses relations extérieures, ce qui est la souveraineté, et, en même temps, de maintenir avec le Canada une association économique comportant l’utilisation de la même monnaie ; aucun changement de statut politique résultant de ces négociations ne sera réalisé sans l’accord de la population lors d’un autre référendum ; en conséquence, accordez-vous au Gouvernement du Québec le mandat de négocier l’entente proposée entre le Québec et le Canada ? »\n\nBastien, Frédéric Bastien (2013). The Battle of London: Trudeau, Thatcher, and the Fight for Canada's Constitution. Toronto: Dundurn. ISBN 9781459723290 .\n\nEnglish, John (2009). Just Watch Me: The Life of Pierre Elliott Trudeau Volume Two: 1968–2000. Toronto: Knopf Canada. ISBN 978-0-676-97523-9 .\n\nFraser, Graham (1984). PQ: René Lévesque and the Parti Québécois in Power. Toronto: MacMillan. ISBN 0771597932 .\n\nLévesque, René (1986). Memoirs. Montreal: McClelland and Stewart. ISBN 0-7710-5285-5 .\n\nTrudeau, Pierre Elliot (1993). Memoirs. Toronto: McClelland & Stewart. ISBN 0-771-08588-5 .\n\nOther websites [ change | change source ]"}, {"url": "https://www.constitutionalstudies.ca/2019/07/sovereignty-association/?print=print", "page_content": "Sovereignty-Association\n\n|\n\n‘Sovereignty-association’ is one manifestation of Quebec separatism. It calls for political independence and an ongoing economic partnership with Canada. Conceptualized by René Lévesque, ‘sovereignty-association’ was the centrepiece of the Parti Québécois' (PQ) secessionist platform during the years Lévesque led the party (1968-85). ‘Sovereignty-association’ was intended to increase the strength of the independence movement by calming fears that a political divorce from Canada would deliver tough economic times to the people of Quebec. Lévesque's political instincts were shrewd. In the 1970s Quebec public opinion polls consistently reported that people were more likely to support political independence if it included maintaining an economic partnership with Canada.\n\nA mandate to negotiate ‘sovereignty-association’ was the subject of the 1980 Quebec referendum, the first Quebec referendum on sovereignty. Premier Lévesque sought majority support from Quebec voters to negotiate the terms of ‘sovereignty-association’ with Canada. The results of those negotiations would be put to the public in a second referendum.\n\nIn a 1979 position paper the PQ stated that sovereignty-association should include free trade between Canada and Quebec, common tariffs against imports, and a common currency. New joint Quebec-Canada political institutions were proposed to govern these economic arrangements. Various English Canadian political leaders declared that they would not negotiate an economic association with a sovereign Quebec. These declarations generally are conceded to have contributed to the decisive defeat the separatists suffered in the 1980 referendum.\n\nIn the 1990s, the idea that an economic association with Canada must be a condition of Quebec independence waned in popularity. The question posed in the 1995 referendum only stipulated that Quebec should offer a new economic and political partnership to Canada before declaring independence. Canada's acceptance was not a prerequisite for sovereignty. Unlike in 1980, the separatists lost this second referendum by the narrowest of margins (50.6 percent to 49.4 percent) (see secession).\n\nSources:"}]}