{"Micky Moody left the Whitesnake in 1982": [{"url": "https://blabbermouth.net/news/guitarist-micky-moody-discusses-his-departure-from-whitesnake", "page_content": "Greece's Rockpages webzine recently conducted an interview with original WHITESNAKE guitarist Micky Moody. An excerpt from the chat follows below.\n\nRockpages: Did you feel a full member of WHITESNAKE or just a player in [vocalist] David Coverdale's band?\n\nMicky: Full member, indeed. I wasn't getting the full money, but that's another story! The only time when I didn't feel a full member of WHITESNAKE was in 1982 when David asked me to rejoin the band. I had left in late 1981, because I had had enough of the business side of things.. anyway, when I returned, Cozy Powell and Mel Galley were in WHITESNAKE... great musicians, to say the least. But I kinda felt like a session guitar player in that lineup. We had a different management and the vibe was not the same, by any means. I don't blame David for this decision... We weren't making any money and he needed something better for his career. But, in that particular lineup, I was treated like a session player... it was all about David and Cozy. I didn't enjoy that period with WHITESNAKE.\n\nRockpages: Did you think that it was during that time that David was thinking of going into a more commercial direction?\n\nMicky: Absolutely!\n\nRockpages: From your perspective, when exactly do you think he started having those thoughts?\n\nMicky: I think right after the \"Saints & Sinners\" record. David started listening to a lot of American industry people... especially John David Kalodner from Geffen. This guy was ruthless and I'll tell you why... The last time that I played with WHITESNAKE was in October 1983. While I was playing... I think it was in Hamburg... John Kalodner was standing at the side of the stage and he was taking notes. I thought that \"This is sinister... this is dark.\" By the end of the show, he went straight to David and he showed him the notes... It was obvious that John Kalodner did not think much of me. Here's a story after that incident... We were at a hotel in Germany... on the same tour... and David was sitting with John Sykes. Without any specific reason, he turned to me and he said, \"Don't you ever turn your back at the audience during the show.\". He said that in front of John Sykes and it was evident that Sykes was really embarrassed. I didn't say anything, but I remember thinking, \"Fuck you!\" I am sorry to tell you this, but this is the truth. He had embarrassed me in front of another musician, but David had already decided to bring John Sykes in the band. After the last gig in Belgium, I asked the tour manager to go and get all the members of WHITESNAKE in my room to announce my decision to leave the band. Everybody came in my room except Coverdale... Cozy — being a truly honest guy — said to me, \"Good decision!\" Jon Lord started crying... 'cause Jon is always very emotional. A week later, David called me and said, \"Oh, you're leaving the band...\" That's the story, guys!\n\nRead the entire interview from Rockpages."}, {"url": "https://bravewords.com/news/ex-whitesnake-guitarist-micky-moody-john-kalodner-was-ruthless-he-was-standing-at-the-side-of-the-stage-taking-notes", "page_content": "Greece's Rockpages webzine has issued an exclusive interview with original WHITESNAKE guitarist Micky Moody. His whole career was covered and here's an excerpt where Moody remembers his last year with Whitesnake:\n\nQ: Did you feel a full member of Whitesnake or just a player in David Coverdale’s band?\n\nA: \"Full member, indeed. I wasn’t getting the full money, but that’s another story! The only time when I didn’t feel a full member of Whitesnake was in 1982 when David asked me to rejoin the band. I had left in late 1981, because I had had enough of the business side of things.. anyway, when I returned Cozy Powell and Mel Galley were in Whitesnake... great musicians, to say the least. But, I kinda felt like a session guitar player in that lineup. We had a different management and the vibe was not the same, by any means. I don’t blame David for this decision... we weren’t making any money and he needed something better for his career. But, in that particular line-up, I was treated like a session player... it was all about David and Cozy. I didn’t enjoy that period with Whitesnake.\"\n\nQ: Did you think that it was during that time that David was thinking of going into a more commercial direction?\n\nA: \"Absolutely!\"\n\nQ: From your perspective, when exactly do you think he started having those thoughts?\n\nA: \"I think right after the Saints & Sinners record. David started listening to a lot of American industry people... especially John David Kalodner from Geffen. This guy was ruthless and I’ll tell you why... he last time that I played with Whitesnake was in October 1983. While, I was playing... I think it was in Hamburg.. John Kalodner was standing at the side of the stage and he was taking notes. I thought that 'this is sinister... this is dark'. By the end of the show, he went straight to David and he showed him the notes... it was obvious that John Kalodner did not think much of me. Here’s a story after that incident... we were at a hotel in Germany... on the same tour... and David was sitting with John Sykes. Without any specific reason, he turned to me and he said: 'Don’t you ever turn your back at the audience during the show'. He said that in front of John Sykes and it was evident that Sykes was really embarrassed. I didn’t say anything, but I remember thinking 'Fuck you'! I am sorry to tell you this, but this is the truth. He had embarrassed me in front of another musician, but David had already decided to bring John Sykes in the band. After the last gig in Belgium, I asked the tour manager to go and get all the members of Whitesnake in my room to announce my decision to leave the band. Everybody came in my room except Coverdale... Cozy - being a truly honest guy - said to me: 'Good decision'! Jon Lord started crying.. cause Jon is always very emotional. A week later, David called me and said, 'Oh, you’re leaving the band...'. That’s the story guys!\"\n\nRead the full interview at this location."}, {"url": "http://classicrockrevisited.com/show_interview.php?id=942", "page_content": "Micky Moody: One True Charmer\n\nBy Jeb Wright\n\nWhitenake began with David Coverdale and Micky Moody. To be honest, Micky was there before Whitesnake on Coverdale’s solo albums he released after leaving Deep Purple. It was Moody on the classic tunes “Here I Go Again” and “Fool For Your Loving” way before Coverdale and the USA version of Whitesnake made the songs massive hits.\n\nMicky never got to enjoy that success, however, because after recording the European version of Slide It In, he was ousted from the band and replaced with American hot shot guitar player John Sykes. Coverdale became an MTV star and the rest is history.\n\nMoody is now back with original Whitesnake bassist Neil Murray in a new band titled Snakecharmer. The band, with its obvious “Snake” reference makes sure everyone knows who these guys used to play with. The music is a throwback to the early Whitesnake of era with a bit of a mid 1980’s twist to it.\n\nThis is one damn fine album of pure classic hard rock. Moody proves he still has the same hard rock melodic powerful guitar style that he had over 35 years ago and the rest of the boys in the band slam out song after song of pure rock and roll.\n\nIn the interview that follows, Moody discusses forming the band, writing the music and even how he first met David Coverdale and formed Whitenake.\n\nThis is an interview with a true rock and roll charmer who just happens to play a mean guitar.\n\nJeb: Snakecharmer is a great band. Do you realize how damn good this stuff is?\n\nMicky: [laughter] We think it’s good and we are very pleased that other people think it is good, as well. I have to say, this is the first time I have ever listened to an album where I’ve enjoyed every track. Most albums have one, or two, tracks that I might skip. Last week, I put the headphones on and listened to it properly and had to admit it is good. We are very, very pleased with it.\n\nJeb: Neil Murray is the other original Whitesnake member in Snakecharmer. How did this band come to be?\n\nMicky: About three years ago, I was playing a gig in London, locally, in this blues type of club. I live in Richmond and back in the day, all of the bands like the Stones, and the Yardbirds played there, and it was quite historical, from a British blues point of view.\n\nThere is club here, now, that deals with guys from that era and they asked me to play a gig there one night with a guy called Pete French, who played with Cactus and Atomic Rooster back then. We put a band together for a one off, just for fun. We were playing kind of Jeff Beck type of things.\n\nWe had a break and I went to the bar, as we do, and who’s standing there but Neil Murray and his mate Doogie White. I said, “Hello Neil, I didn’t know you were coming. Did you pay to get in?” He said, “Yes.” I said, “Oh, you should have told me you were coming and I could have put your name on the guest list. You’re an old chap; you didn’t need to pay to get in.”\n\nWe played together over the years since Whitesnake in The Moody Marsden Band, Company of Snakes and M3. We had not played together in maybe four, or five, years. We decided that we should get together and do some gigs.\n\nHe called me back, a couple of days later, and said that he had spoken with Laurie Wisefield, who he works with in We Will Rock You in London. Neil said that Harry James from Thunder would also love to do something. I was recommended a guy called Chris Ousey, who I had never met before. A friend of Neil’s, Michael Bramwell, played some keys. We went out and did a few fun gigs playing some Whitesnake, some Wishbone Ash and some Thunder. We called it The Monsters of British Rock.\n\nUriah Heep’s manager, Martin Darvill, said that we had a good lineup and that we should record something. We went into his studio and we put down the first two tracks that we wrote, which were “Turn of the Screw” and “Smoking Gun.” It took us a while to record the album because this is not one of those permanent things. We have to all try to make time to do it. Now that it is taking off a little bit, we are hoping to take a bit more time.\n\nJeb: Will there be a future for this band, or will you all be too busy?\n\nMicky: I am pretty sure there will be a future for this band. I don’t do as much as some of the others. I do some TV music and I do some albums of guitar music. I am writing another book. Laurie and Neil are presently in We Will Rock You. They will let them do other things if they like. Adam Wakeman is off with Ozzy or Black Sabbath. Harry does Magnum and a couple of other bands. Chris has never really been on the road that much, as he is more of a studio singer and writer. If things take off, and the offers are reasonable, then we will do some work.\n\nJeb: Chris has a very versatile voice. I think of Paul Rodgers a bit. I think David Coverdale and a bit of Lou Gramm.\n\nMicky: He has indeed. We had not met him. A friend of ours, who does our sound, who lives in Manchester, used to be in a band with him in the ‘80’s doing covers. He recommended him. I listened to him on YouTube and I thought he had a good voice.\n\nHe has done a lot of stuff for other guitar players who want vocals. I like his lyrics too. He is a quiet guy. He is not your average rock singer, as such. He is a very thoughtful guy and he writes intelligent lyrics, which I kind of like.\n\nThere have been a few small criticisms where we could do more like Coverdale did, where the lyrics were a bit naughty. Maybe we will get one of those going on. Chris really puts a lot of time and effort into what he does and I quite like it.\n\nJeb: How many more times can you work this Snake thing into a name of a band?\n\nMicky: [Laughter] To be quiet honest, I was coming up with all kinds of names, as everybody else was. It is kind of hard to get away from it for Neil and myself.\n\nI look at it this way: Neil and I are genetically connected to Whitesnake because we were there, from the beginning. I am proud of our stuff and I don’t want to pretend that I wasn’t a part of that. I can appreciate record companies and management wanting to keep that Snake thing going a little bit, without standing on somebody’s toes, so to speak—or somebody’s tail.\n\nI actually came up with the name Snakecharmer, as we were trying to keep the Snake thing going. I was quite happy to call it something else, but the business people think, “Why throw all that away. You put all of that work into the early Whitesnake band, so why not hint at it?” Business is business.\n\nA lot of the early influence of the early Whitesnake came from Neil and me. We didn’t say that we were going to get together and purposely write songs that sound like early Whitesnake; we didn’t do that at all. When we get together this is what comes out. This music is all from the heart.\n\nJeb: Is all of the material on the album new?\n\nMicky: It is all brand new material. We wrote it all in the last year.\n\nJeb: Let’s talk about some of the songs. “My Angel” would have been a huge smash if this song had come out in 1985.\n\nMicky: I don’t know what to say about that, really! I like all of the songs on the album. Chris writes all of the lyrics and the rest of us would make little demos in our home studios and send them to Chris. He would listen to them and put lyrics and melody lines on them.\n\nThe music all came from the heart and soul. We didn’t say, “Let’s write a song that sounds like ‘Here I Go Again’ and another that sounds like ‘Fool for your Loving.’” We just wrote music and that is what came out.\n\nJeb: “Accident Prone” is a rocking track.\n\nMicky: Laurie wrote that with Chris. It is a great song; it is the most commercial one on the album. He is a great guitar player and I am really pleased to be playing with him.\n\nJeb: “To the Rescue” has that bluesy thing going on.\n\nMicky: It is a slow shuffle. It is very lazy. We rehearsed it the last couple of days. We have our launch on Saturday and we are going to do that in the set. We are doing nine of the songs in the set.\n\nThose kinds of songs just come natural. It is not really phenomenally musical; it just has a good feel about it. Chris puts a nice vocal on those tracks. Chris is not a renowned hard rock singer; he comes from AOR. It is quite a nice mixture. Prior to him doing solo stuff, he would do Whitesnake and Foreigner in cover bands, so he is familiar. He is younger than myself, so he was not around in the late ‘60’s when we were listening to The Jeff Beck Group, Jimi Hendrix, Cream and early Led Zeppelin. He didn’t come from that early British rock that we did, as he came along a bit later, but it fits.\n\nJeb: “Falling Leaves” is a good example of that mixture. It has that AOR sound, but you guys still have that British rock style too.\n\nMicky: It is a power ballad and we needed one on the album. Laurie had the idea and it fit. We only recorded 12 songs and that is all we’ve ever recorded. It was one of those magical things where all of the tracks seemed to fit.\n\nJeb: I can really hear classic Whitesnake in “Smoking Gun.”\n\nMicky: That is the first song I wrote with Chris. We recorded two songs, early on. I kicked the ball off with coming up with “Smoking Gun” and then an idea for “Turn of the Screw.”\n\nI think the “Smoking Gun” does fit into the old Whitesnake vibe. Again, I wasn’t trying to do that, but I always loved that tempo. It just hits me. Stephen Stills did that kind of stuff in the early ‘70’s. I think that influenced Whitesnake.\n\nJeb: “Turn of the Screw” is the best overall rock song on the album.\n\nMicky: That was the second song we wrote and it was straight down the line. “Falling Leaves” is a lovely power ballad, but let’s not loose rock and roll. That is a great classic rock song.\n\nJeb: You have been able to be creative over the years. Some people burn out but not you. Why do you still have that gift where others do not?\n\nMicky: Maybe it is because I never learned to do anything else [laughter]. Some people grow out of it and go into production, or meet a rich chick, or make lots of money and buy property, or whatever. I have always played guitar.\n\nI think about music all of the time and I have that passion to keep on playing. I haven’t been playing live as much recently, but I keep picking up the guitar every time I pass by it. I still get excited about it. Either that or I am just really boring [laughter]. I just love guitar playing and I’ve done it since I was a kid.\n\nJeb: Looking back, how did you first come to join Whitesnake?\n\nMicky: I come from an area in England, in the Northeast, which is a very working class area where people do steel work. It is very much like Pittsburgh, actually. I am from a place called Middlesbrough. I went to school with this guy named Paul Rodgers. We were in class for four, or five, years in high school—we don’t call it that, as we call it secondary school. I grew up with Paul. We were from the same town and were in the same classroom. We put a band together when we were fourteen years old.\n\nJeb: Was that The Roadrunners?\n\nMicky: That was the Roadrunners. We then had The Wallflowers. We went to London and Paul Kossoff was working in the music shop and we all became friends. I went back to Middlesbrough to learn some classical guitar and Paul formed a band with Paul Kossoff and the rest is history.\n\nWhen I went back to my hometown in 1968 there was a young guy who was a student who was called David Coverdale. We come from the same town. We would be in a coffee bar and David would be sitting there, as he was coming from art school. I got talking to David and he was in a local band. I was in the top local band called Tramline that was very much influenced by the West Coast thing. I got to know David then. I moved off to London and a few years later, I heard that he joined Deep Purple.\n\nHe was going to Malibu to live and he found out where all of his old mates were. We actually had a big sendoff for him back in 1974 where we got drunk and stoned and did all of that stuff we did in the ‘70’s.\n\nI heard nothing from him for a long time, when he called and said he was living in Germany. He said that he wanted to do a solo album and he wanted to know if I would come help him do that.\n\nHe came to my show that I was playing a few days later in Munich. I was playing with a band called Snafu at the time. We had a drink and a month later, I was staying with him for a while. I thought he only wanted me to play on a couple of tracks. He wanted to get away from the hard rock. He had such a fantastic voice that he wanted to do ballads, soulful stuff and acoustic stuff.\n\nI ended up doing two albums with him. The first one was White Snake and the second was Northwinds. He left Deep Purple and he said that he wanted to put a band together and that he wanted me to help him put it together, which I did. I was the first ever Snake back in ’77. I helped put Whitesnake together.\n\nAt first, it was called ‘David Coverdale’s Whitesnake’ but he didn’t want that. He wanted it just to be called ‘Whitesnake’. I was the one who said that we should have two guitar players. I wasn’t into hard rock, I was playing Little Feat and the Allman Brother and that kind of stuff, which is really my cup of tea.\n\nWe got Bernie Marsden in the band. I’d known him for a few years and he’d been playing with Paice, Ashton, & Lord; it was all a bit incestuous. That is basically how I got to know David and how I came to help him put Whitesnake together.\n\nJeb: Whitesnake became David’s band. In the early days, however, it was a total band effort.\n\nMicky: It was. We would all do solo spots and we would hang out together. We would have a lot of fun and we were all mates. It was like being in school again. It was the best camaraderie I have ever experienced in my entire musical life. Of course, we never made much money. Bands don’t, unless they sell lots of records. We never cracked the States and we never even came there. Unless you crack the States you don’t make much money. In those days, the records companies had money to put in the bands.\n\nJeb: To me, Ready & Willing was a very important album and was very influential.\n\nMicky: That is probably my favorite Whitesnake album, to be honest. The following album, Come an’ Get It was more commercial. The Ready & Willing album was my kind of album. I loved the song I wrote with David called “Ain’t Gonna Cry No More Today” with the acoustic guitar thing. We did a blues called “Love Man” and we did “Fool for Your Lovin’.” For me, I felt the most comfortable with that album, more so than I did with all of the other Whitesnake albums. There is really something special about that album.\n\nJeb: Talk about Slide It In. Why did it have to happen where two versions were made and why did it have to fall apart after that?\n\nMicky: In a nutshell, there were business problems and money issues—the usual things that sort of creep into a band. The first band had broken up at the end of ’81. David wanted to try something different, so he got away from the old management company.\n\nI left the band at the end of ’81 because it wasn’t really fun anymore and we weren’t generating the kind of money we wanted too. I won’t go into that, but in ’82, I was doing a few gigs with Bernie and David asked me if I wanted to come back and finish off Saints & Sinners.\n\nBy then, he had gotten in with Mel Galley because of the Glenn Hughes connection with Trapeze. He wanted to put the band back together with him, Cozy Powell and myself.\n\nTo be quite honest, there was no magic there, in that particular band. We recorded Slide It In in Munich and it was kind of clinical to me and it was not the same sort of band that Whitesnake had been.\n\nAt the end of the year, I left the band after the end of a European tour in the fall of ’83. I really didn’t have a particularly good time. You would have to ask David the rest of it.\n\nGeffen was interested in bringing him to the States and creating a new Whitesnake. They ended up taking a lot of Mel Galley and me off it and putting on John Sykes. I was gone by then, so I really can’t tell you anything further.\n\nJeb: I just feel that the band should have broke with Neil and you in the band, you did deserve the success.\n\nMicky: A lot of people feel that way. You’d have to ask David on that point. It wasn’t the same, let’s put it that way. That band in 1983 was not the Whitesnake that I knew and loved.\n\nJeb: Did you once get to play with Duane Eddy?\n\nMicky: I did. He was an influence on me when I started playing guitar in 1963, when I was a kid. I used to love “(Dance with the) Guitar Man” and all of that; I used to love that shit.\n\nIn 1987, there was a TV program to commemorate the tenth anniversary of Elvis Presley’s death. I was in the house band and Duane came on and played “Love Me Tender” and I got to back him. He was a very quiet and deep sort of guy. I did shake his hand and tell him he was an influence on me.\n\nJeb: You also played with Eric Clapton.\n\nMicky: I played live with him in a charity situation. I have never been in his band. I played a charity show with him two years ago and he was great. It was a thrill for me, as I have loved him since the Yardbirds.\n\nJeb: When you look back at your era of Whitesnake do you understand why there are so many rock nerds like me that want to tell you how great that music was?\n\nMicky: [laughter] I love it! You can tell me as much as you want. I am proud of it, very much so. Sometimes people say that I shouldn’t do this, or that, as I have nothing to do with Whitesnake, but I tell them that I was there before Whitesnake! I go back a long, long way with David.\n\nJeb: Last one: On Snakecharmer there is a song called “Stand Up.” Are you worried Mick Jones of Foreigner is going to think he wrote that song?\n\nMicky: To be quite honest, we have had that comparison quite a few times. That music was written by Harry James. It is a backing track that Harry sent it to Chris and we did it. It is as simple as that. Harry may need to worry about that [laughter].\n\nJeb: I would love to see you in USA playing gigs.\n\nMicky: It depends how it goes. We have some festivals that we would like to do. Everyone has a lot of commitments, but if it starts to do okay, then we would all love to tour. We would love to go out and play our own music.\n\nhttp://www.snakecharmer.org"}, {"url": "https://blabbermouth.net/news/former-whitesnake-guitarist-micky-moody-plays-with-trumpets", "page_content": "M3 guitarist Micky Moody (ex-WHITESNAKE) has just had his book, \"Playing with Trumpets - A Rock and Roll Apprenticeship\", released by SAF Publishing.\n\nThe book's description reads as follows: \"In 1981, whilst onstage with hard rockers WHITESNAKE at the Monsters of Rock Festival at Donington Park, in a rare moment of self-analysis as he raised a clenched fist in salute to 65,000 faithful fans, Micky Moody pondered the question, 'How the hell did I get here?' This is that story...\"\n\nTo order a copy of the book, click here.\n\nM3, the \"classic WHITESNAKE\" tribute band featuring Micky Moody, Bernie Marsden (guitar, ex-WHITESNAKE),Neil Murray (ex-WHITESNAKE, BLACK SABBATH),Jimmy Copley (drums, ex-PAUL RODGERS, GILLAN, BECK),Mark Stanway (keyboards, ex-MAGNUM) and Stefan Berggren (vocals, SNAKES IN PARADISE, COMPANY OF SNAKES, RAZORBACK),has lined up the following U.K. dates:\n\nDec. 13 - The Brook - Southampton, UK\n\nDec. 14 - Robin 2 Bilston - Wolverhampton, UK\n\nDec. 15 - The Golden Diamond - Sutton - Ashfield, Notts, UK\n\nDec. 16 - Carnegie Theatre - Workington, UK\n\nM3's first DVD, \"Rough an' Ready\" (cover),was released in June 2005 via Classic Pictures. The \"Rough an' Ready\" DVD footage was shot on June 12, 2004 at Burnley Mechanics in Burnley, England and includes a guest appearance by former RAINBOW and current YNGWIE MALMSTEEN vocalist Doogie White. The DVD also includes an exclusive acoustic performance and interviews recorded in 2005 live at Classic T Stage, Shepperton Film Studios, U.K. featuring classic WHITESNAKE tracks \"Till The Day I Die\", \"Trouble\", and \"The Time Is Right For Love\"."}, {"url": "https://listappeal.com/whitesnake-guitarists/", "page_content": "When David Coverdale formed Whitesnake in 1976 after leaving Deep Purple, he likely had no idea that he would someday become a staple on music video channels and have a connection to cars and Tawny Kitaen. In the beginning, David Coverdale simply wanted to combine his soulful vocals with great guitar riffs to create a bluesy rock sound that would dominate hard rock stations and festivals in Europe. Until Slide It In was released in 1984, Coverdale’s Whitesnake would be nearly unknown in the U.S. That changed after the release of Slide It In. Although he was the lead guy, Coverdale understood the value of great axe slingers. The list below shows that his vision went well beyond cars and women in videos and more towards great masters of radio ready riffs.\n\nMickey Moody\n\nAlthough not as well-known as some of the other Whitesnake guitarists, Micky Moody has the distinction of being with David Coverdale from the beginning as an original member of Coverdale’s solo project that preceded Whitesnake. The solo albums, White Snake (1977) and Northwinds (1978) included co-writing efforts from Moody along with contributions from Deep Purple bassist Roger Glover.\n\nAlong with Bernie Marsden on guitar, Neil Murray on bass and Deep Purple alum Jon Lord on keyboards, Moody would play on the first Whitesnake album Trouble. Moody would continue his work with Whitesnake through 1984’s breakthrough album Slide it In. Moody would leave after this record and return to session work, solo projects and various guest appearances.\n\nBernie Marsden\n\nPrior to being a founding member of David Coverdale’s Whitesnake along with Coverdale and Micky Moody, Bernie Marsden was guitarist for Paice Ashton Lord – which included Ian Paice and Jon Lord of Deep Purple. The band only recorded one album before breaking up. Bernie Marsden also had a brief stint with hard rock greats UFO before giving way to Michael Schenker.\n\nFollowing Paice Ashton Marsden instead hooked up with Coverdale for his new post-Deep Purple band. With Whitesnake, Bernie Marsden was one half of the guitar attack for the first ep and 5 albums beginning in 1978 with Trouble and going through 1982’s Saints & Sinners. During this time, Marsden co-wrote many of the Whitesnake songs and is best known for co-writing the international hit “Here I Go Again.”\n\nAlthough Bernie Marsden never reached the commercial success of his Whitesnake output, he has remained very active in solo projects, numerous bands and guest appearances.\n\nMel Galley (Trapeze)\n\nAlong with the legendary Glenn Hughes (Deep Purple) on bass and vocals and drummer Dave Holland (Judas Priest), Mel Galley was a founding member of the criminally underrated British rock band Trapeze. From 1970 through 1979, Trapeze recorded 6 studio albums. The band remained together through various lineup changes until Galley left to join Whitesnake in 1982. Galley joined Micky Moody as the guitar duo for Slide it In – the most successful Whitesnake album to that point.\n\nWhile a member of Whitesnake, Mel Galley suffered an arm injury that resulted in nerve damage that kept him from being able to play guitar. He was able to use a device known as The Claw that allowed him to play guitar again. Although no longer a member of Whitesnake, Galley was able to resume his career and record albums with his brother for the band Phenomena which included many famous guest contributors including John Wetton (King Crimson and Asia), Brian May (Queen) and former bandmate Glenn Hughes.\n\nVivian Campbell (Dio, Def Leppard)\n\nWhen Ronnie James Dio decided to leave Black Sabbath to embark on a solo career, he knew he needed a monster guitar player. Having worked beside Richie Blackmore in Rainbow and Tony Iommi in Black Sabbath, Dio knew how important a great guitarist is to a heavy metal band. Originally, Dio selected Ratt’s guitarist – Jake E. Lee – for his new band. Shortly after joining Dio, Jake E. Lee was offered the job of replacing Randy Rhodes in Ozzy’s band leaving an empty spot in the lineup. Dio turned to a virtually unknown 20-year-old guitarist from Northern Ireland named Vivian Campbell. Although young, Vivian Campbell already had recorded output with British metal band Sweet Savage. Once Dio released their first album Holy Diver in 1983, Vivian Campbell became a well-known name in heavy metal circles. Following up the successful debut, Vivian continued with Dio for Last in Line and Sacred Heart. After 2 Platinum Albums and 1 Gold album, Campbell left Dio and joined Whitesnake in 1987 shortly after the band recorded the self-titled Whitesnake (also known as 1987) – but in time to re-record a guitar solo for “Give Me all Your Love.” Campbell then joined fellow guitar hero Adrian Vandenberg, bassist Rudy Sarzo and drummer Tommy Aldridge as the touring band to support the Whitesnake tour. Shortly after the tour, Campbell left Whitesnake in 1988.\n\nFollowing stints with Lou Gramm, Riverdogs and Shadow Kings, Campbell joined Def Leppard in 1992 to replace Steve Clark for the Adrenalize album. Vivian Campbell is still a member of Def Leppard and has recorded several albums with the hard rock giants including 2022’s Diamond Star Halos album.\n\nAdrian Vandenberg (Vandenberg)\n\nVandenberg stormed on to the heavy metal scene in 1982 with their debut album Vandenberg with the help of a Top 40 hit in “Burning Heart.” The Dutch band was headed up by a virtual unknown guitarist named Adrian Vandenberg. Along with the single “Burning Heart,” Adrian Vandenberg wrote the music and lyrics and co-produced the debut album which peaked at number 65 on the US album charts. The follow up album Heading for a Storm was released the following year in 1983 hoping to build on the momentum of the successful debut. The album unfortunately never came close to the previous success and stalled out at 169 on the Billboard 200. The third album, Alibi, released in 1985, did little to improve on things and would become the last Vandenberg record until a 2020 reunion.\n\nDavid Coverdale first approached Adrian Vandenberg about joining Whitesnake in the early 80’s but the guitarist declined due to his own band. In 1986, with Vandenberg stalled commercially after three albums, Adrian agreed to join Whitesnake. Coverdale had recently fired the entire band and was looking to go in a new direction around the time of the release of Whitesnake. While the album was recorded by other members, including John Sykes, Vandenberg did record the guitar solo for the massive hit “Here I Go Again.” For the follow up album Slip of the Tongue, Vandenberg co-wrote all track on the album but was unable to record the album due to an injury. Steve Vai stepped in to record the guitar parts and then joined up with Vandenberg for the supporting tour. Vandenberg would be on board for 1997’s return album Restless Heart where he again co-wrote all of the songs.\n\nin between his work with Whitesnake, Vandenberg formed Manic Eden with fellow Whitesnake bandmates Rudy Sarzo and bass and Tommy Aldridge on drums. They released their only album Manic Eden in 1994. The group disbanded when Vandenberg signed up for the 1994 Whitesnake reunion tour.\n\nFollowing his time in Whitesnake, Vandenberg formed a new band – Vandenberg’s MoonKings. The band released Vandenberg’s MoonKings in 2014 and MK II in 2027, along with an acoustic album titled Rugged and Unplugged in 2018.\n\nDoug Aldrich (Dio, Dead Daisies)\n\nDoug Aldrich recorded his first album – Dangerous Attraction – in 1987 with Glam rock band Lion. After a few more albums with Lion, he formed the Bad Moon Rising in 1991 where they would record several albums in the 90’s. Although not a success in the U.S. market, Bad Moon Rising were very popular in Japan. After the breakup of Bad Moon Rising, Aldrich formed Burning Rain and recorded 2 albums before disbanding in 2002. While Aldrich recorded several albums with various bands in the 15 years between 1987 and 2002, he was still somewhat obscure outside of heavy metal circle. That all changed in 2002 when he joined as lead guitarist for Dio for Killing the Dragon. Aldrich also appears on a few Dio live albums but he left before the recording of the next Dio album in 2004.\n\nWhen David Coverdale announced the formation of a new tour for 2003, Aldrich was named guitarist where he would remain until 2014. During this time, Aldrich made a big mark on Whitesnake – performing on 2008’s return album Good to Be Bad – playing guitar and co-writing all songs on the album. In 2011, Aldrich would be back to record Forevermore, where he would again co-write all of the songs with David Coverdale.\n\n2014 would mark the official end of Aldrich’s tenure as guitarist for Whitesnake but it was the beginning of a very active recording career over the past 8 years. In addition to recording new albums for former band Burning Rain, Aldrich joined forces with hard rock supergroup The Dead Daisies in 2016 recording Make Some Noise. Aldrich is still lead guitarist for The Dead Daisies and has recorded two additional albums – Burn it Down (2018) and Holy Ground (2021).\n\nOther Guitarists\n\nJohn Sykes (Thin Lizzy, Blue Murder, Tygers of Pan Tang)\n\nBy the time John Sykes joined Whitesnake in 1984, he had built an impressive resume as a guitar player for British Metal band Tygers of Pan Tang and heavy rockers Thin Lizzy. As co-lead guitarist for Tygers of Pan Tang, along with Robb Weir, Sykes played on Spellbound and Crazy Nights – both released in 1981. These two albums helped solidify Tygers as one of the preeminent bands in the New Wave of British Heavy Metal (NWOBHM) movement of the early 80’s along with Iron Maiden, Saxon and Def Leppard. Although Sykes left the band in early 1982 shortly after the release of Crazy Nights, he is credited with guitar on two songs from The Cage released in 1982 including the minor hit of their cover of “Love Potion No. 9.”\n\nSykes did not waste much time landing in another band when he joined arena rock stars Thin Lizzy where he recorded their final studio album 1983’s Thunder and Lightning. On the subsequent farewell tour, Sykes is lead guitarist for their live album titled Life.\n\nWhile on tour with Thin Lizzy, Sykes met the members of Whitesnake and was asked to join the band. Sykes debuted live for the band in early 1984. While Slide it In was already released in the UK with Moody and Galley on guitar, Sykes recorded some new guitar parts for the US release. Slide it In would become the band’s biggest hit to date in the US. By the time the band entered the studio for the follow up, titled Whitesnake, Sykes was deeply entrenched in the songwriting ultimately co-writing seven of the nine tracks including two of the biggest songs on the album “Still of the Night” and “Is This Love.” With the help of MTV, Whitesnake became a massive success in the US selling more than 8 million copies. With the album ready for release in early 1987, David Coverdale made the decision to fire the entire band – including John Sykes.\n\nFollowing his stint in Whitesnake, Sykes joined forces with Tony Franklin – best known as bassist for The Firm with Jimmy Page and Paul Rodgers – and drum legend Carmine Appice formerly of Vanilla Fudge and Cactus. The trio, known as Blue Murder, released their self-titled debut in 1989 with Sykes on guitar and lead vocals. While the album was a moderate success, it did not meet the high expectations of the band. Blue Murder reconvened to release a follow up in 1993 titled Nothin’ But Trouble. Following the breakup of Blue Murder, Sykes embarked on a solo career and has played as guest on various projects.\n\nSteve Vai (David Lee Roth, Zappa)\n\nSteve Vai is one of the most renowned guitarists in the world including selection by Guitar World magazine as the 10th Greatest Guitarist. Steve Vai left the Berklee College of Music to join Frank Zappa on tour in 1990 where he would record and tour over the next few years. In 1984, he briefly joined Alcatrazz as replacement for Yngwie Malmsteen and subsequently record Disturbing The Peace album. Shortly after, Steve Vai would receive his first big break when David Lee Roth recruited him to join his band along with bassist extraordinaire Billy Sheehan and drummer Gregg Bissonette. Vai played guitar on the first two David Lee Roth albums – Eat ‘Em and Smile and Skyscraper. Both albums were commercially successfully selling more than 1 million copied each. Following the Skyscraper tour, Vai left the band in 1989 and joined Whitesnake for the Slip of the Tongue record replacing Adrian Vandenberg. The album was a commercial success – selling over 3 million copies worldwide. By 1990, Steve Vai left Whitesnake to pursue other projects. In addition to his work with Zappa, Whitesnake and David Lee Roth, Vai is best known for his groundbreaking instrumental album Passion and Warfare released in 1990.\n\nWarren DeMartini (Ratt)\n\nAnyone who followed heavy metal in the 1980’s can only imagine Warren DeMartini as lead guitarist of Ratt where the band recorded several platinum selling albums including Out of the Cellar and Invasion of Your Privacy as well as heavy metal staples such as “Round and Round,” “Wanted Man” and “Lay it Down.” While DeMartini will always be best known for his time in Ratt, he did have a brief stint with Whitesnake in 1994 as a touring guitarist alongside Adrian Vandenberg. Despite his inclusion in the band, DeMartini did not appear on a Whitesnake record. Following his brief tenure in Whitesnake, DeMartini released some solo records and also re-joined his old bandmates in Ratt to record three albums Collage (1997), Ratt (1999) and Infestation (2010).\n\nSteve Farris (Mr. Mister)\n\nAlthough Steve Farriss is virtually unknown by name to most rock fans, his work has been seen and heard by millions. Before his stint with 80’s band Mr. Mister, he was briefly courted by Kiss to become their guitarist for the album Creatures of the Night. While he did not end up joining the band, his solo on the track “Creatures of the Night” was used on the record. As guitarist for Mr. Mister, Farriss helped create some of the most memorable songs of the decade including “Kyrie” and “Broken Wings” both Number 1 hits off the 2nd album Welcome to the Real World. In addition to his guitar on the album, Farriss had songwriting credits on 6 of the 10 tracks. Farriss remained on board for the third album in 1987 Go On… – which did not equal its predecessor. The band would break up in 1990 leaving behind a Platinum selling album and three Top 10 hits. Following Mr. Mister, Farriss continued as guitarist for artists as varied as Rod Stewart and Dolly Parton as well as a brief stint with Whitesnake in 1997.\n\nReb Beach (Winger, Dokken, Alice Cooper)\n\nAfter attending Berklee College of Music, guitarist Reb Beach started out as a session musician working with Twisted Sister on 1987’s Love is for Suckers, Chaka Khan’s 1986 album Destiny, and Bee Gees E.S.P. album from 1987. Around this time, he was asked to work on an album by pop artist Fiona titled Beyond the Pale. It was on this session that he met the bass player for Alice Cooper named Kip Winger. Shortly after, Kip and Reb formed Sahara – which would later become known as Winger.\n\nThe debut album, Winger, was released in 1988 and became a success eventually selling more than 1 million copies in the US. The album included two Top 40 hits in “Seventeen” and “Headed for a Heartbreak.” In addition to his lead guitar duties, Beach co-wrote 7 of the album’s tracks including “Seventeen.” The follow up In the Heart of the Young was released in 1990 and also reached Platinum status with the help of their highest charting hit to date “Miles Away.” Beach once again co-wrote 7 of the songs on the album. The third Winger album, titled Pull, was released in 1993. The album did not achieve the commercial success of the first two records.\n\nFollowing Winger’s break up in 1994, Reb Beach joined Alice Cooper’s band and then became George Lynch’s replacement in Dokken for 1999’s Erase the Slate. He also recorded an album with supergroup The Mob in 2005. The band included Doug Pinnick (King’s X), Kip Winger and Kelly Keaggy (Night Ranger)\n\nReb Beach has been a member of Whitesnake since 2003 and has recorded several live and studio albums with the band including Good to be Bad (2008), Forevermore (2011) and The Purple Album (2015). Beach has simultaneously remained a member of Winger recording 2006’s reunion album titled IV, Karma in 2009 and Better Days Comin’ in 2014."}, {"url": "https://www.allmusic.com/artist/micky-moody-mn0000403626", "page_content": "Micky Moody Follow Artist +\n\nGuitarist Mick Moody is best known as a member of the inaugural lineup of Whitesnake, though he actually began his career years earlier as a member of Juicy Lucy. After exiting Juicy Lucy, Moody played…\n\nRead Full Biography"}, {"url": "https://www.oldies.com/artist-biography/Whitesnake.html", "page_content": "This UK-based heavy rock band has been led throughout its career by David Coverdale (22 September 1951, Saltburn-By-The Sea, North Yorkshire, England). The lead vocalist with Deep Purple since 1973, Coverdale left that unit in 1976 and recorded two solo albums, Whitesnake and Northwinds. Shortly afterwards, he formed a touring band from musicians who had played on those records. Entitled David Coverdale\u0092s Whitesnake, the band included Micky Moody (b. 30 August 1950, Middlesbrough, North Riding of Yorkshire, England; guitar, ex-Tramline, Juicy Lucy), Bernie Marsden (b. Bernard John Marsden, 7 May 1951, Buckingham, Buckinghamshire, England; guitar, ex-UFO), Brian Johnston (keyboards), Neil Murray (bass) and Dave Dowle (drums). Pete Solley (b. 19 October 1948, England; ex-Procol Harum) replaced Johnston before in turn making way for Deep Purple\u0092s Jon Lord (b. 9 June 1941, Leicester, Leicestershire, England) during sessions for the Snakebite EP, which featured a cover version of Bobby Bland\u0092s \u0091Ain\u0092t No Love In The Heart Of The City\u0092.\n\nFor much of the late 70s Whitesnake toured in the UK, Europe and Japan (the first US tour was in 1980). During this period there were several personnel changes, with another ex-Deep Purple member Ian Paice (b. 29 June 1948, Nottingham, Nottinghamshire, England) joining on drums. Whitesnake\u0092s first British hit was \u0091Fool For Your Loving\u0092 (number 13 in May 1980), composed by Coverdale, Marsden and Moody, and the double album Live... In The Heart Of The City reached number 5 the same year. Come An\u0092 Get It climbed to number 2 in the UK album charts in April 1981, with \u0091Don\u0092t Break My Heart Again\u0092 reaching number 17 the same month. The follow-up Saints & Sinners (1982) featured the original version of one of the band\u0092s most famous songs, \u0091Here I Go Again\u0092.\n\nAt this point, the illness of Coverdale\u0092s daughter and tension among the members caused a hiatus in the band\u0092s career. When Whitesnake re-formed in 1982 only Coverdale, Lord and Moody remained from the earlier line-up. The new members were Mel Galley (b. 8 March 1948, Cannock, Staffordshire, England; guitar), ex-Back Door and Alexis Korner bass player Colin Hodgkinson (b. 14 October 1945, Peterborough, Cambridgeshire, England), and Cozy Powell (b. Colin Flooks, 29 December 1947, Cirencester, Gloucestershire, England, d. 5 April 1998, Bristol, England; drums). The US version of Slide It In (1984) featured additional overdubs from ex-Thin Lizzy guitarist John Sykes (b. 29 July 1959, Reading, Berkshire, England). However, this configuration lasted only briefly and by 1984 the long-serving Moody and Lord had left, the latter to join a regenerated Deep Purple.\n\nWhile Coverdale remained the focus of Whitesnake, there were numerous personnel changes in the following years, including the return of Neil Murray and the recruitment of Aynsley Dunbar (b. 10 January 1946, Liverpool, Lancashire, England; drums) to join Coverdale and Sykes. These had little effect on the band\u0092s growing reputation as one of the leading exponents of heavy rock, with unambiguously sexist record sleeves marking out their lyrical and aesthetic territory. Frequent tours finally brought a million-selling album in the USA with 1987\u0092s Whitesnake and Coverdale\u0092s bluesy ballad style brought transatlantic Top 10 hits with a re-mixed \u0091Here I Go Again\u0092 (US number 1, UK number 9) and \u0091Is This Love\u0092 (US number 2, UK number 9). Almost immediately there were wholesale personnel changes, with Coverdale joined by several session musicians. Most notable among these players was Adrian Vandenberg (b. 31 January 1954, Enschede, the Netherlands), who was co-writer with Coverdale on the band\u0092s 1989 album Slip Of The Tongue, co-produced by Keith Olsen and Mike Clink. Virtuoso guitarist Steve Vai (b. Steven Siro Vai, 6 June 1960, Carle Place, New York, USA) was also a member of the band in the late 80s, while further personnel passing through the ranks during this period included bass player Rudy Sarzo, and drummers Denny Carmassi and Tommy Aldridge.\n\nDespite headlining the Donington Festival in August 1990, Coverdale put Whitesnake on ice at the end of the year. He later joined forces with Jimmy Page for the release of Coverdale/Page in early 1993, but when Whitesnake\u0092s recording contract with Geffen Records in the USA expired in 1994, it was not renewed. The band toured in support of the same year\u0092s Greatest Hits set before splitting up again. Coverdale returned with a new album in 1997 with Vandenberg, Carmassi, Guy \u0091Starka\u0092 Pratt (bass), Brett Tuggle (keyboards). Restless Heart was a mellow (by Whitesnake standards) recording that helped emphasize Coverdale\u0092s terrific range. Following its release and a farewell tour, the singer once again put the band on hold to concentrate on solo work. He revived Whitesnake in 2002 for a 25th anniversary tour that quickly turned into a more permanent reunion, with a line-up featuring a host of young musicians. After five years of touring, Coverdale returned to the studio to complete a new album, Good To Be Bad.\n\nSource: The Encyclopedia of Popular Music by Colin Larkin. Licensed from Muze."}, {"url": "https://www.imdb.com/title/tt18283618/characters/nm0600513", "page_content": "Whitesnake: Here I Go Again (Original Version) (1982 Music Video) Micky Moody: Micky Moody\n\nIt looks like we don't have any photos or quotes yet.\n\nBe the first to contribute! Add a photo or add a quote."}, {"url": "http://www.promusictutor.com/blog/an-interview-with-micky-moody-from-whitesnake/", "page_content": "An Interview with Micky Moody from Whitesnake\n\nHi, this is Micky Moody, I’m a guitar player. I have been kicking around for a few years now. I started playing as a child really when I was 12. When I was 16 I left home and went to London with my friend Paul Rodgers and got stuck into the music business, of course in them days there was a hell of a lot of opportunities but I was very dedicated and I think you have to be if you want to make it in this business.\n\nI joined a band called Tramline and we made a couple of albums for Island Records. After that I joined a soul band called Lucas and the Mike Cotton Sound. After that I played for a while with Zoot Money and then was asked to join Juicy Lucy which was really my introduction to the bad old world of rock and roll really.\n\nAnyway, after that I formed a band with a couple of friends called Snafu. I did session work for a few years before teaming up with an old friend of mine from the northeast, Dave Coverdale who I’ve known since late 60’s and eventually it evolved into Whitesnake of which I was the original member.\n\nThroughout all of that, though I was primarily a rock guitarist, blues guitarist, I always had a love for acoustic guitar, but I played steel string acoustic as well, with emphasis on Bert Lams and of course the Mississippi blues players like Robert Johnson. But I always had a love of the acoustic guitar and especially open tunings which I found very, very interesting.\n\nI can honestly say I’ve been in some strange sessions with music I never thought I’d play. Sometimes it was worrying and other times it was pure enjoyment, but I think that’s part of your life as a musician, you have to be prepared.\n\nOn a personal level, I think the music that stayed with me throughout my career is probably rock, blues influenced rock and it’s a music I really feel. But that’s the style that I like, it’s a very expressive style, it suits me, it suits my heart, suits my soul and I think at the end of the day, all that, the only advice I can offer to young aspiring musicians is just be yourself.\n\nI think it’s time now to pass on some of my knowledge that I’ve picked up along the way and I’ve enjoyed performing these tutorials. It’s been educational to me as well but I hope that I can pass on to you some of my experience, some of my playing, some of my feeling and hope that it’ll get into you and that it’ll influence you and inspire you to greater heights."}], "Micky Moody went on to form The Snakes in 1982, with whom he released two albums.": [{"url": "https://en-academic.com/dic.nsf/enwiki/4039868", "page_content": "Michael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. From 2010 he has been working with Murray, guitarist Laurie Wisefield, drummer Harry James, singer Chris Ousey and keyboard player Michael Bramwell in Monsters of British Rock which has morphed into Snakecharmer with Adam Wakeman on keyboards.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also worked alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, PP Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner and Uriah Heep. For TV he has also accompanied such stars as Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Ben E. King and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009).[1] A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets - A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene.[2] His media music has been featured on such TV programmes as Waking the Dead, Bo Selecta, America's Next Top Model, How To Look Good Naked, Top Gear, Mad Men and Wife Swap USA.\n\nBiography\n\n1960s\n\nWhile still at school in Middlesbrough and regularly attending private guitar lessons, Moody formed a band named The RoadRunners with several other local boys including Paul Rodgers (later to form Free and Bad Company), and later, Bruce Thomas, who would eventually play bass with Elvis Costello and the Attractions. The band were kept busy performing a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene so they took the decision to turn professional, change their name to the Wildflowers, and move to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without ever releasing any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur, John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had already split and gone their separate ways. At this point Moody joined Lucas and the Mike Cotton Sound who, as well as proving to be a highly-polished Soul band, also acted as Gene Pitney's backing band for his UK tours as well as backing others, such as Paul Jones.[3][4]\n\n1970s\n\nIn 1970 he joined the recently re-patriated Zoot Money before replacing Neil Hubbard in Juicy Lucy. As a member of Juicy Lucy, he recorded three albums and toured extensively before the group disbanded. After the band split, Micky co-founded Snafu which combined his funk-rock guitar style with some down-home stateside grooves. The band recorded three albums - SNAFU, Situation Normal, and All Funked Up. They also appeared on a John Peel session, the Old Grey Whistle Test and Supersonic and toured extensively before the individual members headed off to pursue different ventures. Moody undertook occasional work as a session player before, during and after Snafu, most notably for Graham Bonnett. He also contributed to one track on City to City by Gerry Rafferty. Moody performed as an original member of Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist, Bob Young. The result was Young & Moody. He then toured with Frankie Miller and guested with Hinkley's Heroes before hooking up with another friend from the North East, David Coverdale. Micky had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, but by this point Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. He invited Moody to assist and the result was the album White Snake released in 1977 which was followed by a second album Northwinds in 1978. Moody shared writing credits on four of the nine songs on Whitesnake (including the title track) and three of the eight songs featured on Northwinds. With the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston (replaced after a few months by Pete Solley) to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the EP Snakebite followed by two Studio albums: Trouble (also in 1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble, and was sole author of a fifth (the lively instrumental, Belgian Tom's Hat Trick). He contributed to three of the ten songs on Lovehunter, most notably the title track. While working with Whitesnake he found time to play slide guitar on several tracks on Roger Chapman's debut solo album, Chappo.\n\n1980s\n\n\n\nCourtesy: Andrew King Bernie Marsden (left) and Micky Moody; at Hammersmith Odeon, in 1981Courtesy: Andrew King\n\nMoody contributed slide guitar to three tracks on Ex-Lindisfarne Ray Jackson's solo debut In the Night released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, which spawned two UK single hits in the form of Fool for your Loving and the album title track; Moody co-wrote both tracks. The band also released the double album Live...in the Heart of the City in that year. He also found time to write and record two singles with Bob Young. In 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Micky maintained a busy schedule with Whitesnake and the band released the album Come an' Get It that year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. The band was put on hold for much of 1982 and Moody undertook some session work, for the likes of Sheena Easton. By late 1982 Whitesnake were back, (with Mel Galley replacing Marsden), and a re-juvinated Moody joining Galley on the album's backing vocal sessions. Going into 1983, Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. However Micky was not particularly happy with the direction the new band was taking and felt increasingly sidelined by Coverdale.[5] Despite the deteriorating situation within Whitesnake, Moody persevered with recording the Slide It In album (which he describes as an 'unhappy experience' ) before quitting the band in 1983 at the end of a tour.[1] Moody went back to session work with a series of artists including Mike Oldfield, Gary Glitter, Mike d'Abo, and Roger Chapman as well as selected TV work. He toured with Chris Farlowe and also worked with ex-Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language Of Rock And Roll. He also put together the first version of the Micky Moody Band featuring ex-Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with the their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with his erstwhile Whitesnake guitarist-in-crime, Bernie Marsden, to tour and record with the Moody Marsden Band, concentrating mostly on the British and western European markets. Featured in various line-ups were drummers Zak Starkey, Terry Williams, John Trotter, Henry Spinetti and Dave Dowle; bass players Jaz Lochrie, Pete Stroud, Steve Price, Neil Murray and David Levy, and keyboard players Don Ariey and Josh Phillips. Guests in the studio included harmonica player Mark Feltham, keyboard player Volker 'Wolfman' Kunschner, brass players Nick Pentelow, Frank Mead and Martin Drover, and backing singers Monica Reed-Price and Mick Lister. The Moody Marsden Band recorded two live albums, Never Turn Our Back On the Blues and Live In Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Alvin Lee, Eric Burdon, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set, Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced media music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company Of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams[6] to arrange and record a selection of classic Chicago blues tracks in a mostly 'unplugged' fashion; the result was Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional gigs in a duo format with bluesman Papa George, and continues to do so. The next 'Snake' metamorphosis was into M3 Classic Whitesnake, and although ex-Black Sabbath singer Tony Martin was in the starting line-up, Stefan Berggren was soon back in the frontman's spot. M3 released a live CD featuring Martin, and a live DVD featuring Berggren with a guest appearance from former Richie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were ex-Paul Rodgers Band, Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time, Moody played on the album Nah Aufnahme by German superstar Westernhagen, which eventually topped the national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me in tandem with the autobiographical Playing with Trumpets - A Rock 'n' Roll Apprenticeship, the latter recounting his early days in the music business, mostly in the company of Paul Rodgers. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before forming Snakecharmer with Neil Murray, also formerly of Whitesnake and The Company of Snakes.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 SNAFU (album)\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back On The Blues\n\n1994 live In Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst The Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nSolo\n\n2000 I Eat Them For Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! - Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n(VA) 1970 Zoot Money (Zoot Money)\n\n(Zoot Money) 1973 In Memory of Robert Johnson (Paul Williams)\n\n(Paul Williams) 1973 I Never Got (Tony Kelly)\n\n(Tony Kelly) 1973 Manor Live (VA)\n\n(VA) 1973 Me and My Friend (Patrick Campbell Lyons)\n\n(Patrick Campbell Lyons) 1974 Funkist (Bobby Harrison)\n\n(Bobby Harrison) 1975 Squire (Alan Hull)\n\n(Alan Hull) 1975 Legend (Mickey Jupp)\n\n(Mickey Jupp) 1977 Graham Bonnet (Graham Bonnet)\n\n(Graham Bonnet) 1977 Fancy That (Joanna Carlin)\n\n(Joanna Carlin) 1977 City to City (Gerry Rafferty)\n\n(Gerry Rafferty) 1979 Chappo (Roger Chapman)\n\n(Roger Chapman) 1981 Line Up (Graham Bonnet)\n\n(Graham Bonnet) 1982 Riff Burglars (Roger Chapman)\n\n(Roger Chapman) 1982 Music Money And Madness (Sheena Easton)\n\n(Sheena Easton) 1986 In Quo Country (Bob Young)\n\n(Bob Young) 1987 Islands (Mike Oldfield)\n\n(Mike Oldfield) 1987 Party Album (Gary Glitter)\n\n(Gary Glitter) 1987 Reaching Out (Paul Millns)\n\n(Paul Millns) 1987 Indestructible (Mike D'Abo)\n\n(Mike D'Abo) 1987 No Angel (Sanne Salomonsen)\n\n(Sanne Salomonsen) 1988 New Day (Jane Harrison)\n\n(Jane Harrison) 1989 Walking The Cat (Roger Chapman)\n\n(Roger Chapman) 1990 Hybrid and Lowdown (Roger Chapman)\n\n(Roger Chapman) 1991 Blue-Eyed Slide (Brian Knight)\n\n(Brian Knight) 1992 Parlour Games (John Spencer)\n\n(John Spencer) 1992 Blues Brittania (VA)\n\n(VA) 1992 Waiting In The Wings (Chris Farlowe)\n\n(Chris Farlowe) 1992 Very Much Alive (Willy Finlayson and The Hurters)\n\n(Willy Finlayson and The Hurters) 1993 Midnight Postcards (Adam Faith)\n\n(Adam Faith) 1994 Tellin' Stories (Walter Trout)\n\n(Walter Trout) 1994 Line Up (Borderline)\n\n(Borderline) 1995 Together (Peter Smith)\n\n(Peter Smith) 1995 Green and Blues (Bernie Marsden)\n\n(Bernie Marsden) 1996 Kiss My Soul (Roger Chapman)\n\n(Roger Chapman) 1996 Blue Thunder (Blue Thunder)\n\n(Blue Thunder) 1998 Pinboard Wizards (Jackie Lynton)\n\n(Jackie Lynton) 2000 Here After (Jamie Marshall)\n\n(Jamie Marshall) 2000 Gimme All Your Topp (VA)\n\n(VA) 2000 Snakebites (VA)\n\n(VA) 2000 Glory Bound (Chris Farlowe)\n\n(Chris Farlowe) 2001 Another Hair Of the Dog (VA)\n\n(VA) 2001 Tam de ti ye... (Ani Lorak)\n\n(Ani Lorak) 2002 Fairytale (Peer Gynt)\n\n(Peer Gynt) 2002 Who's He Calling Me Him (Norman Beaker Band)\n\n(Norman Beaker Band) 2003 Freak Out (Chris Catena)\n\n(Chris Catena) 2004 On The Wire (Smokie)\n\n(Smokie) 2005 Nah Aufnahme (Westernhagen)\n\n(Westernhagen) 2007 One More Time for Peace (Roger Chapman)\n\n(Roger Chapman) 2007 Human Spirit (Gary Fletcher)\n\n(Gary Fletcher) 2008 Slap My Hand (Jimmy Copley)\n\n(Jimmy Copley) 2009 Live At Abbey Road (Endangered Species)\n\nReferences"}, {"url": "https://peoplepill.com/people/micky-moody/", "page_content": "Michael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. More recently, he has toured and recorded with Snakecharmer.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009). A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.\n\nBiography\n\n1960s\n\nWhile still at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with several others from the smae area including Paul Rodgers (later of Free and Bad Company). They were joined some time later by bass player Bruce Thomas, who moved onto play with Elvis Costello and the Attractions. The band performed a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.\n\n1970s\n\nIn 1970 he joined the recently re-patriated keybopard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guste with with Hinkley's Heroes before joining his friend David Coverdale. Moody had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, upto this time Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two Studio albums, Trouble (1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble and was sole writer of Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.\n\nIn 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Moody continued to maintain a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others. By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was not happy with the direction the new band was taking and felt increasingly sidelined by Coverdale. However, despite the deteriorating situation within Whitesnake, Moody recorded Slide It In with them. A process he described as an 'unhappy experience' and after which he left the band in 1983.\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected T.V music library work. He toured with Chris Farlowe and also worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record with the Moody Marsden Band in U.K and Europe. The Moody Marsden Band recorded two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional duo gigs with bluesman Papa George. 'Snake' metamorphosed into M3 Classic Whitesnake and also released released a live CD featuring Martin and a live DVD featuring Berggren with a guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time Moody played on the album Nah Aufnahme by German musician Westernhagen, which eventually appeared in thethe national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me which was released at the same time as publication of his autobiographical memoirsPlaying with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a stellar line up which also includes former Whitesnake colleague Neil Murray. He also made regular appearances alongside blues guitarist Papa George and has been an active member of the Sunflower Jam house band and the Bad Apples.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 Snafu\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\n1978 Snakebite\n\n1978 Trouble\n\n1978 Live at Hammersmith\n\n1979 Lovehunter\n\n1980 Ready an' Willing\n\n1980 Live...in the Heart of the City\n\n1981 Come an' Get It\n\n1982 Saints & Sinners\n\n1984 Slide It In (UK version)\n\n(UK version) 1994 Greatest Hits\n\n2003 Best of Whitesnake\n\n2003 The Silver Anniversary Collection\n\n2004 The Early Years\n\n2008 30th Anniversary Collection\n\n2011 Box of Snakes\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\n2016 Black & Chrome (with Ali Maas)\n\nGuest appearances"}, {"url": "https://blabbermouth.net/news/guitarist-micky-moody-discusses-his-departure-from-whitesnake", "page_content": "Greece's Rockpages webzine recently conducted an interview with original WHITESNAKE guitarist Micky Moody. An excerpt from the chat follows below.\n\nRockpages: Did you feel a full member of WHITESNAKE or just a player in [vocalist] David Coverdale's band?\n\nMicky: Full member, indeed. I wasn't getting the full money, but that's another story! The only time when I didn't feel a full member of WHITESNAKE was in 1982 when David asked me to rejoin the band. I had left in late 1981, because I had had enough of the business side of things.. anyway, when I returned, Cozy Powell and Mel Galley were in WHITESNAKE... great musicians, to say the least. But I kinda felt like a session guitar player in that lineup. We had a different management and the vibe was not the same, by any means. I don't blame David for this decision... We weren't making any money and he needed something better for his career. But, in that particular lineup, I was treated like a session player... it was all about David and Cozy. I didn't enjoy that period with WHITESNAKE.\n\nRockpages: Did you think that it was during that time that David was thinking of going into a more commercial direction?\n\nMicky: Absolutely!\n\nRockpages: From your perspective, when exactly do you think he started having those thoughts?\n\nMicky: I think right after the \"Saints & Sinners\" record. David started listening to a lot of American industry people... especially John David Kalodner from Geffen. This guy was ruthless and I'll tell you why... The last time that I played with WHITESNAKE was in October 1983. While I was playing... I think it was in Hamburg... John Kalodner was standing at the side of the stage and he was taking notes. I thought that \"This is sinister... this is dark.\" By the end of the show, he went straight to David and he showed him the notes... It was obvious that John Kalodner did not think much of me. Here's a story after that incident... We were at a hotel in Germany... on the same tour... and David was sitting with John Sykes. Without any specific reason, he turned to me and he said, \"Don't you ever turn your back at the audience during the show.\". He said that in front of John Sykes and it was evident that Sykes was really embarrassed. I didn't say anything, but I remember thinking, \"Fuck you!\" I am sorry to tell you this, but this is the truth. He had embarrassed me in front of another musician, but David had already decided to bring John Sykes in the band. After the last gig in Belgium, I asked the tour manager to go and get all the members of WHITESNAKE in my room to announce my decision to leave the band. Everybody came in my room except Coverdale... Cozy — being a truly honest guy — said to me, \"Good decision!\" Jon Lord started crying... 'cause Jon is always very emotional. A week later, David called me and said, \"Oh, you're leaving the band...\" That's the story, guys!\n\nRead the entire interview from Rockpages."}, {"url": "https://www.abebooks.co.uk/9781786062161/Snakes-Ladders-Autobiography-Rock-Roll-178606216X/plp", "page_content": "When the world was bitten by the hard-rocking and hard-drinking Whitesnake, it was Micky Moody's gritty riffs and signature bluesy slide-guitar that helped propel them to international stardom, as they shouldered aside contemporary rivals, going on to sell millions of albums worldwide.\n\nBut before Whitesnake and life on the road with former Deep Purple singer David Coverdale became a chaotic reality, Moody had already formed a teenaged band with Free s Paul Rodgers, played with Juicy Lucy, been a founder member of Snafu and worked as an in-demand session musician. This saw him play with performers whose egos, neuroses and, in some cases, supreme talent led to some memorable encounters, giving him the opportunity to contribute, with some gusto, to the hedonism of the Seventies. His musical footprint has been nothing short of epic.\n\nBut how did such a party-loving, excess-fueled outfit as Whitesnake conquer the mighty world of hard rock and at what cost? Outrageous stories about catastrophic narcotic mix-ups and infamous groupies come as thick and fast as the band's musical output itself. However, with success comes a price, and as global domination, commercial success and late-night carousing began to give way to suspicion, greed and the repercussions of excess on the road, serious fallout was inevitable.\n\nIn his memoir, Snakes and Ladders, Micky relates his musical odyssey with fondness and a wry sense of humour. From, guitar lessons to guitar hero, this is his story of climbing the ladder and surviving the Snake."}, {"url": "https://www.qbd.com.au/micky-moody-snakes-and-ladders/micky-moody/9781786062161/", "page_content": "Authors Micky Moody\n\nISBN 9781786062161\n\nPublished 01 / 02 / 2017\n\nBinding Paperback\n\nPages 400\n\nDimensions 126 x 198mm 126 x 198mm\n\nAs a guitarist for Whitesnake and Juicy Lucy during the 1970s and 1980s, Micky Moody went on a true rock ‘n’ roll odyssey\n\n\n\nAfter Moody’s musical induction playing in bands around Middlesborough (including one which featured Paul Rodgers of Free and Bad Company), a turn in blues-rock band Juicy Lucy followed. While there were appearances on The Old Grey Whistle Test and John Peel’s show, major success still eluded him. Therefore, when the opportunity to join Whitesnake, led by former Deep Purple vocalist David Coverdale arrived, he took it with both hands.\n\n\n\nWhitesnake released their debut album in 1978, and three more LPs followed in rapid succession. Two of their early hit singles, ‘Ready An’ Willing’ and ‘Fool For Your Loving’ were co-written by Moody himself. However, following increasing band tensions, he left the band in 1983. Moody describes the experience as a ‘rock and roll apprenticeship’, and his recollections of life on the road are vivid, compelling and often hilarious.\n\n\n\nThis is a must-read for any fan of classic rock and a wonderfully original music memoir."}, {"url": "https://www.paperplus.co.nz/shop/books/non-fiction/biography-memoir/micky-moody", "page_content": "As a guitarist for Whitesnake and Juicy Lucy during the 1970s and 1980s, Micky Moody went on a true rock `n' roll odyssey After Moody's musical induction playing in bands around Middlesborough (including one which featured Paul Rodgers of Free and Bad Company), a turn in blues-rock band Juicy Lucy followed. While there were appearances on The Old Grey Whistle Test and John Peel's show, major success still eluded him. Therefore, when the opportunity to join Whitesnake, led b\n\n...\n\nAs a guitarist for Whitesnake and Juicy Lucy during the 1970s and 1980s, Micky Moody went on a true rock `n' roll odyssey After Moody's musical induction playing in bands around Middlesborough (including one which featured Paul Rodgers of Free and Bad Company), a turn in blues-rock band Juicy Lucy followed. While there were appearances on The Old Grey Whistle Test and John Peel's show, major success still eluded him. Therefore, when the opportunity to join Whitesnake, led by former Deep Purple vocalist David Coverdale arrived, he took it with both hands. Whitesnake released their debut album in 1978, and three more LPs followed in rapid succession. Two of their early hit singles, `Ready An' Willing' and `Fool For Your Loving' were co-written by Moody himself. However, following increasing band tensions, he left the band in 1983. Moody describes the experience as a `rock and roll apprenticeship', and his recollections of life on the road are vivid, compelling and often hilarious. This is a must-read for any fan of classic rock and a wonderfully original music memoir.\n\nProduct code: 9781786062161"}, {"url": "https://blues.gr/profiles/blogs/an-interview-with-legendary-micky-moody-of-juicy-lucy-snafu", "page_content": "\"If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\" Micky Moody: Mr. Rock n' Roll Guitar\n\nMicky Moody is best known for his role in the definitive Whitesnake line-up, though his vast and varied career was spawned out of a sixties school band which also included another future star, Free and Bad Company singer Paul Rodgers. Micky quickly graduated to the recording studios via the R&B combo Tramline before touring Britain and Europe with some of the countrys top soul musicians.\n\nJoining the highly acclaimed Juicy Lucy was a large step towards rock stardom, and major tours of Britain, Europe and the USA accompanied a regular output of recorded works. After Juicy Lucy split, Micky co-founded Snafu, combining his rock-style guitar with down-home stateside grooves, and became a major contributor on the song-writing front. Snafu recorded three albums and toured extensively before the individual members headed off to pursue their different ventures. Micky then became engrossed in session work as his reputation as a versatile performer spread. Soon a phone call from David Coverdale assured Micky of a vital place in his future plans, starting with the guitar slot and co-writing position on his forthcoming solo albums, Whitesnake and Northwinds.\n\n\n\nAs a sideman, Micky has featured alongside such classic British singers as Graham Bonnet, Frankie Miller, Chris Farlowe, Sheena Easton, Roger Chapman, Elkie Brookes and Eric Burdon. Visitors from the states such as Meat Loaf, Matt guitar Murphy, Ben E. King and Walter Trout have all employed his talents to enhance their performances.\n\nMicky's session work has included many T.V. commercials and some film scores. As a writer or co-writer his credits are numerous and include many of the classic Whitesnake favourites. With the Moody Marsden band, he and his guitar sparring partner Bernie Marsden toured extensively and released four albums before continuing their Whitesnake legacy with the Snakes and the Company of Snakes.\n\nIn 2000 Micky finally released his first solo album I Eat Them For Breakfast on Armadillo records.\n\n\n\n\n\n\n\nInterview by Michael Limnios\n\n\n\n\n\nWhat was the first gig you ever went to & what were the first songs you learned?\n\nAs a child I was taken by my parents to a Christmas pantomime where the special guests were Cliff Richard and the Shadows. I was aware of their music and, like a lot of youngsters who took up the guitar in the early 1960's, I was especially drawn to the playing of Hank Marvin. I went to private guitar lessons from the age of twelve, so the first tunes I learned to play where from guitar tutor books.\n\n\n\n\n\nWhich was the best moment of your career and which was the worst?\n\nGetting my first gold album (Ready an'Willing - Whitesnake) was a great moment. Playing onstage with Eric Clapton was also special.\n\nThe worst was performing with Snafu at the huge Roosevelt Stadium in New Jersey supporting Emerson Lake & Palmer. It was the ugliest drink and drug-sodden atmosphere I have ever experienced. We should never have supported ELP, this was not our audience and our management were to blame. We had to leave the stage because of the abuse, and also to avoid the missiles that were thrown at us from a truly dystopian gathering.\n\n\n\n\n\nWhat do you learn about yourself from music? What experiences in your life make you a GOOD musician?\n\nI believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\n\n\n\n\n\nFrom whom have you have learned the most secrets about blues rock music & in which songs can someone hear the best of your work?\n\nI loved the Jeff Beck Group with Rod Stewart on vocals. They could take blues and soul songs and heavy them up, and some of their originals songs sounded very inspired. Beck played like nobody else, and still does. I'm also a fan of American guitarist Harvey Mandel, especially the stuff he did in the late 6o's-early 70's and, of course, Eric Clapton in Cream. Blues rock slide? Early Johnny Winter; Duane Allman; Lowell George; Ry Cooder; Zoot Horn Rollo; Sonny Landreth, and Glenn Ross Campbell's steel playing.\n\nI think I improved with age! Some of my best playing is on my solo albums 'I Eat Them For Breakfast' and 'Don't Blame Me'. I was more in control of my own destiny on those albums.\n\n\n\n\n\nWhat characterizes your “philosophy” about the music?\n\nI've always been fascinated by the number of different styles of music that you can coax from the guitar. I'm known primarily as an electric guitarist but I have always loved the natural sound of acoustic music. I've discovered a lot of open tunings throughout the years, and different types of right-hand picking techniques from pick and fingers, thumpick and fingers and flesh (no picks at all). In the last few years I have written and produced two instrumental albums: 'Acoustic Journeyman' and 'Electric Journeyman'. Although I've been involved in a lot of song writing over the years, playing the guitar is still my main passion. People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\n\n\n\n\n\nWhy did you think that Micky Moody, continues to generate such a devoted following?\n\nI don't know if I have a devoted following! Maybe people appreciate that I've never been afraid to attempt different styles and that I try to express a range of emotions when I play.\n\n\n\n\n\nWhat is the “thing” you miss most from the Tramline? Which memory from the Wildflowers makes you smile?\n\nTramline: I was only seventeen at the time, in great health with my whole life ahead of me. Yes, I miss that feeling! The Wildflowers: Traveling to London with the other three guys in an old van fitted-out with bunk beds; we were so dedicated!\n\n\n\n\n\nTell me about the beginning of Juicy Lucy. How did you get together and where did it start?\n\nJuicy Lucy's Singer Paul Williams had seen me perform in Tramline, Lucas and the Mike Cotton Sound and Zoot Money's band. He must have been impressed because when Neil Hubbard left Juicy Lucy to join the Grease Band he suggested me to the other guys. They were rehearsing at a house in the countryside so I went and rehearsed with them and got the job.\n\n\"I believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\"\n\nWhat are some of the most memorable stories you've had from Juice Lucy?\n\nSoon after I joined Juicy Lucy we flew to the United States for a tour which lasted for nearly a month. It was my first time in America and suddenly I was looking at things and visiting places I'd only seen on television. New York: we played at the legendary Fillmore East supporting Cactus and Lee Michaels; visited Atlantic's famous recording studio where Roberts Flack was recording with some of the greatest session musicians in the US (including the great Bernard 'Pretty' Purdie on drums). The Fillmore West, San Francisco where we supported Elton John and The Kinks, and looking out on a warm November day at Alcatraz Prison and the San Francisco Bay. Los Angeles: two or three nights at the Whiskey A Go- Go, staying at the Tropicana Hotel - Californian groupies! Boston: two nights at the Boston Tea Party supporting Leon Russell and Elvin Bishop - both had great bands. Went to Chicago and Madison WN too.\n\nLots of touring, especially in Germany, and taking over as lead guitarist when members from the original line-up quit. It was all great experience!\n\n\n\n\n\nAny comments about your experiences with Chris Farlowe, Roger Chapman & Bernie Marsden? Would you like to tell your best memory about them?\n\nI was aware of Chris and Roger from my teens back in the north of England. Chris Farlowe and the Thunderbirds featured Albert Lee on guitar which was a real bonus for us guitar players. Tramline supported Family on a club date so I got see them live; Roger singing in that unusual fashion over very original-sounding songs. So it's been a thrill to actually work with them. Other great singers I've worked on stage with include Frankie Miller, Graham Bonnet, Gary Brooker, , Paul Rodgers in the Roadrunners/Wildflowers and David Coverdale in Whitesnake. Bernie and I developed a special understanding as dual guitarists, firstly with Whitesnake, then with the Moody Marsden Band. It had very little to do with Wishbone Ash or Thin Lizzie, and was influenced by the 60's British Blues players and American Southern Rockers like the Allman Brothers and Lynyrd Skynyrd.\n\nWould you mind telling me your most vivid memory from Snafu?\n\nSee above! On a more positive note, recording the first album at the Manor Studios. We had a nice, tight funky thing going on in the early days.\n\n\"People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\"\n\nDo you remember anything interesting stories from Whitesnake?\n\nI have an incredible amount of interesting stories from my days with Whitesnake. How many weeks do you have to listen to them?!! It's impossible to pick out a few as there were so many. I had some of the best times of my life - it was the 70s, totally politically-incorrect, sexy and indulgent. That's all I'm saying!\n\n\n\n\n\nHow did you first meet John Mayall, do you remember anything interesting from touring with him?\n\nI was still in London after the breakup of the Wildflowers (1967) and Bruce Thomas, the bass player, discovered where John Mayall lived. Although I'd already decided that I would move back to my home town and spend some time studying the classical guitar, Bruce wanted to progress in the blues scene. We took the tube train to Paddington Station and walked a few blocks to Mayall's flat, which was at the top of a house close to the station. He had no idea who we were but was kind enough to invite us up to his flat, where his new guitarist Mick Taylor sat listening to blues albums. Bruce gave him his number for future reference and we had a nice cup of tea!\n\nI met him again the following year when Tramline supported his 'Crusade' band at the Marquee Club in London. In the spring of 1970, when I was playing with Zoot Money, we supported him and his drummer-less band on a number of shows on his British tour. His line-up was very odd: Jon Mark on nylon-strung guitar; Johnny Almond on Saxophones and Alex Dmochowski on bass. He seemed like quite a private, laid-back person.\n\n\"Being in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\"\n\nHow has the music business changed over the years since you first started in music?\n\nI was very lucky to have started my career in the Sixties and to have developed it in the Seventies. There was very little in the way of entertainment for the masses apart from music, TV (very limited those days) and film, and most people went to gigs and bought records. The opportunities were immense, unlike today were the public have so much choice, most of it available through the internet or multimedia. Recorded works and live performances were treated with respect and giving things for free, or worse, having them pirated, was rarely an option. I also think that, in some regards, technology has made the art of creating and performing music too accessible and instantaneous. If utilized correctly technology can be put to good use, but practice and dedication to one's instrument will always produce the better musician.\n\n\n\n\n\nWhy do you think that the blues doesn’t quite get the recognition and respect that other genres seem to get? Give one wish for the BLUES\n\nI'm not sure I agree with your opinion! I think that after pop and rock, blues is one of the most accepted forms of music to be embraced by a wide audience. Long may the Blues continue!\n\n\"I would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\"\n\nWith such an illustrious career, what has given you the most satisfaction musically?\n\nBeing in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\n\n\n\n\n\nWhat is the difference and similarity between the LIVE/GIG and the STUDIO feeling? And between your session projects, solo albums and the band’s recording?\n\nThere's obviously a big difference between playing live and playing in a recording studio; some people excel in one and struggle with the other. I think that for most people, playing live is their raison d'etre, whilst the recording studio is a workshop within which you can create. I've been lucky enough to have had a lot of experience in both, some experiences turning out better than others. Playing live, there is (hopefully) an atmosphere created by both performers and audience, whereas you have to create an atmosphere in a studio - and concentrate - you have to live with the results!\n\nI'm in control of my own projects so I'm responsible for the outcome. On sessions you have to try and make the artist/producer comfortable and pleased with your efforts. I'm involved in a new band called Snakecharmer and we're all very experienced - watch out for us!\n\n\n\n\n\nAre there any memories from the US tour “Best of British Blues”, which you’d like to share with us?\n\nUnfortunately the 'Best of British Blues' tour of 1996 was memorable for the wrong reasons. The line-up consisted of featured artists Eric Burdon and Alvin Lee, and the band was Aynsley Dunbar, Boz Burrell, Tim Hinkley and myself. I don't like to talk ill of the dead, but Boz created problems right from the first gig; he was unhappy with the promoter and seemed uncomfortable with the personnel. Halfway through the tour he went to pieces and couldn't continue, so Aynsley suggested Tony Franklin who'd played with bass with The Firm (Paul Rodgers/Jimmy Page). The band then seemed to split into two camps: Burdon, Dunbar and Franklin, and Lee, Hinkley and Moody. Eric Burdon thought that his guitarist should come to the House of Blues in L.A. and perform on stage with us just to show me how it should be done! What a fucking insult! Alvin sensed the vibes and a couple of gigs later he booked a plane home. We didn't even finish the tour. There were some good moments, but overall, definitely one to forget!\n\n\n\n\n\nIf you go back to the past what things you would do better and what things you would avoid to do again?\n\nI would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\n\n\n\nMicky Moody - Official website\n\n\n\n\n\n"}, {"url": "https://www.wikiwand.com/es/Micky_Moody", "page_content": "Michael Joseph \"Micky\" Moody (nacido el 30 de agosto de 1950, en Middlesbrough, Reino Unido) es un guitarrista inglés, y un exmiembro de las bandas de rock Juicy Lucy y Whitesnake.\n\nTambién fue un miembro fundador de la banda británica de rhythm and blues/rock Snafu. Junto con sus ex-colegas de Whitesnake Bernie Marsden y Neil Murray, ha fundado varias bandas (The Snakes, Company of Snakes y M3 Classic), con las que se llevaron a cabo principalmente las primeras canciones de Whitesnake.\n\nMás recientemente, ha estado trabajando con Murray, el guitarrista Laurie Wisefield, el baterista Harry James, el cantante Chris Ousey y el teclista Michael Bramwell en Monsters of British Rock.\n\nAdemás de esto, Moody también tocó con la banda Moody Marsden y ha trabajado junto a figuras como Roger Chapman, Frankie Miller, Eric Burdon, Farlowe Chris y Uriah Heep. Para la televisión también ha respaldado a estrellas tales como Meat Loaf, Boy George, Brookes Elkie, Hendryx Nonah, Ben E. King y uno de sus primeros héroes de la guitarra, Duane Eddy.\n\nDesde el año 2000 ha publicado varios álbumes en solitario: I Eat Them For Breakfast en 2000, Don't Blame Me en 2006, Acoustic Journeyman en 2007 y Electric Journeyman en 2009.[1]\n\nUn guitarrista tan versátil como Moody ha sido un músico de sesión activo y su sitio web propio tiene una colección más de 100 discos a los que ha contribuido musicalmente a partir de 2009. El 2006 vio el lanzamiento del autobiográfico Playing Con Trumpets - A Rock 'n' Roll Apprenticeship,, un libro de memorias sobre sus primeros días en la escena musical.[2]"}, {"url": "http://dictionary.sensagent.com/Micky_Moody/en-en/", "page_content": "From Wikipedia\n\nMichael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the hard rock bands Juicy Lucy and Whitesnake. Together with his former Whitesnake colleagues Bernie Marsden and Neil Murray, he has founded several bands (The Snakes, Company of Snakes and M III), with which they mainly perform old Whitesnake songs. Micky has also played on other albums such as Jamie Marshall 's 'Hereafter'\n\nBesides this, Moody also played with Bob Young in The Young & Moody Band and since 2001 has released several solo albums I Eat Them For Breakfast in 2001, \"Don't Blame Me\" in 2006, \"Acoustic Journeyman\" in 2007 and \"Electric Journeyman\" in 2009.[1] . Moody has been an active session musician and his own Website lists over 100 albums to which he has contributed musically as of 2009 [2]\n\n1960's\n\nWhile still at school in Middlesbrough Moody formed a band with several other local boys, including Paul Rodgers (later to form Free and Bad Company), and later Bruce Thomas who would eventually play bass with Elvis Costello and the Attractions. Colin Bradley who later moved towards the uptempo Country sound and David Usher who later doubled for Ginger Baker. Slightly older than the three who musical educated the the newly formed band with rare imported vinyl from the The States (Chess Recordings etc). The band called themselves the Road Runners and were managed by Joseph Bradley, Colin Bradley's Older Brother. They were kept busy performing a range of covers in local halls and clubs. As the band developed they took the decision to turn professional and move to London, at this point they changed their name to the Wild Flower were Colin Bradley would pursue a career in Engineering but still playing semi pro. They had some success and undertook some touring but relationships within the band frayed and they eventually split without ever releasing any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons, he also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he hooked up with another local musician John McCoy to form the group Tramline. A deal for two albums was signed with Island records, but by the time the second album was released the band had already split and gone their separate ways. At this point Moody joined the Lucas and Mike Cotton Sound who acted as Gene Pitney's backing band for a UK tour and then he moved on to play with Zoot Money[3] [4] In 1970 he Joined Juicy Lucy, replacing Neil Hubbard.\n\n1970's\n\nAs a member of Juicy Lucy he recorded three albums before the group disbanded. After Juicy Lucy split Micky co-founded Snafu which combined his Brit-rock guitar style with some down-home stateside grooves. The band recorded three albums - SNAFU, Situation Normal and All Funked Up. The band also appeared on a John Peel session and toured extensively before the individual members headed off to pursue different ventures. Moody undertook occasional work as a session player before, during and after Snafu, most notably for Graham Bonnett, he also contributed to one track on City to city by Gerry Rafferty. Moody recorded an album with Bob Young (Status Quo's tour manager and occasional songwriter), and he also hooked up with another friend from the North East, David Coverdale. Moody had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, but by this point Coverdale had been fronting Deep Purple and was looking to undertake a solo venture, he invited Moody to assist and the result was the album White Snake released in 1977, this was followed by a second Album Northwinds in 1978. Moody shared writing credits on four of the nine songs on Whitesnake (Including the title track) and three of the eight songs featured on Northwinds. With the demise of Deep Purple Mk3 Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston (replaced after a few months by Pete Solley) to form a band that took its name Whitesnake from the title of Coverdale's first solo album and in 1978 they recorded the EP 'Snakebite' followed by two Studio albums: Trouble also in 1978 and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on Keyboards. Moody is credited with co-writing four of the ten tracks on Trouble, and was sole author of a fifth; the lively instrumental Belgian Tom's Hat Trick. He contributed to three of the ten songs on Lovehunter, most notably the title track. While working with Whitesnake he found time to play slide guitar on several tracks on the debut solo album Chappo for Roger Chapman.\n\n1980's\n\nBernie Marsden (left) and Micky Moody; at Hammersmith Odeon, in 1981\n\nCourtesy: Andrew King\n\nMoody contributed slide guitar to three tracks on Ray Jackson's solo debut In the Night released in 1980.By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, which spawned two UK single hits in the form of Fool for your Loving and the album title track, Moody co-wrote both tracks. The band also released the double album Live...in the Heart of the City in that year.In 1981 Graham Bonnet released his album Line up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Moody maintained a busy schedule with Whitesnake and the band released the album Come and Get it in this year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. The band was put on hold for much of 1982 and Moody undertook some session work, for Sheena Easton. By late 1982 Whitesnake were back, (with Mel Galley replacing Marsden), and Moody had rejoined. However his name was placed at the bottom of musicians listed on Saints and Sinners, and his song-writing credits were far fewer than previously. Going into 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. However Moody was not particularly happy with the direction the new band was taking and felt increasingly sidelined by Coverdale [5] despite the deteriorating situation within Whitesnake Moody persevered with recording the Slide It In album (which he describes as an 'unhappy experience' ) before quitting the band in 1983 at the end of a tour.[6]Moody went back to session work, firstly with his friend Bob Young and then with a series of Artists including Mike Oldfield, Gary Glitter, Mike D'Abo, and Roger Chapman.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 SNAFU (album)\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\nWith David Coverdale\n\nWith Whitesnake\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live In Europe\n\n2001 Here They Go Again\n\n2002 Burst The Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nSolo\n\n1992 Never Turn Your Back on the Blues (live album, with Bernie Marsden)\n\n(live album, with Bernie Marsden) 1994 Live In Hell - Unplugged (live album, with Bernie Marsden)\n\n(live album, with Bernie Marsden) 1994 The Time Is Right For Live (the two above albums released as one)\n\n(the two above albums released as one) 1994 Real Faith (with Bernie Marsden)\n\n(with Bernie Marsden) 2000 The Night The Guitars Came To Play (with Bernie Marsden)\n\n(with Bernie Marsden) 2000 I Eat Them For Breakfast\n\n2001 Ozone Friendly (with Bernie Marsden)\n\n(with Bernie Marsden) 2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! - Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n(VA) 1970 Zoot Money (Zoot Money)\n\n(Zoot Money) 1973 In Memory of Robert Johnson (Paul Williams)\n\n(Paul Williams) 1973 I Never Got (Tony Kelly)\n\n(Tony Kelly) 1973 Manor Live (VA)\n\n(VA) 1973 Me and My Friend (Patrick Campbell Lyons)\n\n(Patrick Campbell Lyons) 1974 Funkist (Bobby Harrison)\n\n(Bobby Harrison) 1975 Squire (Alan Hull)\n\n(Alan Hull) 1975 Legend (Mickey Jupp)\n\n(Mickey Jupp) 1977 Graham Bonnet (Graham Bonnet)\n\n(Graham Bonnet) 1977 Fancy That (Joanna Carlin)\n\n(Joanna Carlin) 1977 City To City (Gerry Rafferty)\n\n(Gerry Rafferty) 1979 Chappo (Roger Chapman)\n\n(Roger Chapman) 1981 Line Up (Graham Bonnet)\n\n(Graham Bonnet) 1989 Walking The Cat (Roger Chapman)\n\n(Roger Chapman) 1990 Hybrid and Lowdown (Roger Chapman)\n\n(Roger Chapman) 1992 Parlour Games (John Spencer)\n\n(John Spencer) 1992 Blues Brittania (VA)\n\n(VA) 1993 Midnight Postcards (Adam Faith)\n\n(Adam Faith) 1994 Tellin' Stories (Walter Trout)\n\n(Walter Trout) 1994 Line Up (Borderline)\n\n(Borderline) 1995 Together (Peter Smith)\n\n(Peter Smith) 1995 Green and Blues (Peter Green)\n\n(Peter Green) 1996 Kiss My Soul (Roger Chapman)\n\n(Roger Chapman) 1996 Blue Thunder (Blue Thunder)\n\n(Blue Thunder) 1998 Pinboard Wizards (Jackie Lynton)\n\n(Jackie Lynton) 2000 Here After (Jamie Marshall)\n\n(Jamie Marshall) 2000 Gimme All Your Topp (VA)\n\n(VA) 2000 Snakebites (VA)\n\n(VA) 2000 Glory Bound (Chris Farlowe)\n\n(Chris Farlowe) 2001 Tam de ti ye... (Ani Lorak)\n\n(Ani Lorak) 2002 Fairytale - Peer Gynt\n\n2003 Freak Out (Chris Catena)\n\n(Chris Catena) 2004 On The Wire (Smokie)\n\n(Smokie) 2005 Nah Aufnahme (Westernhagen)\n\n(Westernhagen) 2007 One More Time for Peace (Roger Chapman)\n\n(Roger Chapman) 2007 Human Spirit (Gary Fletcher)\n\n(Gary Fletcher) 2008 Slap My Hand (Jimmy Copley)"}]}