{"Micky Moody played on Juicy Lucy's first two albums.": [{"url": "https://www.allmusic.com/artist/micky-moody-mn0000403626/discography", "page_content": "Discography Micky Moody Follow Artist +\n\nGuitarist Mick Moody is best known as a member of the inaugural lineup of Whitesnake, though he actually began his career years earlier as a member of Juicy Lucy. After exiting Juicy Lucy, Moody played…\n\nRead Full Biography"}, {"url": "https://www.allmusic.com/artist/micky-moody-mn0000403626", "page_content": "Micky Moody Follow Artist +\n\nGuitarist Mick Moody is best known as a member of the inaugural lineup of Whitesnake, though he actually began his career years earlier as a member of Juicy Lucy. After exiting Juicy Lucy, Moody played…\n\nRead Full Biography"}, {"url": "https://www.qobuz.com/us-en/interpreter/micky-moody/340265", "page_content": "Micky Moody\n\nGuitarist Mick Moody is best known as a member of the inaugural lineup of Whitesnake, though he actually began his career years earlier as a member of Juicy Lucy. After exiting Juicy Lucy, Moody played with Snafu for a few years, as well as on several session gigs, before joining Whitesnake in 1978. When bandleader David Coverdale began tinkering with Whitesnake's lineup in the mid-'80s, Moody resumed his prior career as a session guitarist; he also formed a blues-rock outfit called the Moody & Marsden Band with Whitesnake cohort Bernie Marsden, which released an album titled Never Turn Our Back on the Blues in 1994. Moody and Marsden reunited again in the Whitesnake-affiliated supergroup Company of Snakes in 2000, and Moody released his first solo album, the bluesy I Eat Them for Breakfast, in 2001.\n\n© Steve Huey /TiVo\n\nRead more"}, {"url": "https://peoplepill.com/people/micky-moody/", "page_content": "Michael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. More recently, he has toured and recorded with Snakecharmer.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009). A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.\n\nBiography\n\n1960s\n\nWhile still at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with several others from the smae area including Paul Rodgers (later of Free and Bad Company). They were joined some time later by bass player Bruce Thomas, who moved onto play with Elvis Costello and the Attractions. The band performed a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.\n\n1970s\n\nIn 1970 he joined the recently re-patriated keybopard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guste with with Hinkley's Heroes before joining his friend David Coverdale. Moody had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, upto this time Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two Studio albums, Trouble (1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble and was sole writer of Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.\n\nIn 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Moody continued to maintain a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others. By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was not happy with the direction the new band was taking and felt increasingly sidelined by Coverdale. However, despite the deteriorating situation within Whitesnake, Moody recorded Slide It In with them. A process he described as an 'unhappy experience' and after which he left the band in 1983.\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected T.V music library work. He toured with Chris Farlowe and also worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record with the Moody Marsden Band in U.K and Europe. The Moody Marsden Band recorded two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional duo gigs with bluesman Papa George. 'Snake' metamorphosed into M3 Classic Whitesnake and also released released a live CD featuring Martin and a live DVD featuring Berggren with a guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time Moody played on the album Nah Aufnahme by German musician Westernhagen, which eventually appeared in thethe national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me which was released at the same time as publication of his autobiographical memoirsPlaying with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a stellar line up which also includes former Whitesnake colleague Neil Murray. He also made regular appearances alongside blues guitarist Papa George and has been an active member of the Sunflower Jam house band and the Bad Apples.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 Snafu\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\n1978 Snakebite\n\n1978 Trouble\n\n1978 Live at Hammersmith\n\n1979 Lovehunter\n\n1980 Ready an' Willing\n\n1980 Live...in the Heart of the City\n\n1981 Come an' Get It\n\n1982 Saints & Sinners\n\n1984 Slide It In (UK version)\n\n(UK version) 1994 Greatest Hits\n\n2003 Best of Whitesnake\n\n2003 The Silver Anniversary Collection\n\n2004 The Early Years\n\n2008 30th Anniversary Collection\n\n2011 Box of Snakes\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\n2016 Black & Chrome (with Ali Maas)\n\nGuest appearances"}, {"url": "https://blues.gr/profiles/blogs/an-interview-with-legendary-micky-moody-of-juicy-lucy-snafu", "page_content": "\"If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\" Micky Moody: Mr. Rock n' Roll Guitar\n\nMicky Moody is best known for his role in the definitive Whitesnake line-up, though his vast and varied career was spawned out of a sixties school band which also included another future star, Free and Bad Company singer Paul Rodgers. Micky quickly graduated to the recording studios via the R&B combo Tramline before touring Britain and Europe with some of the countrys top soul musicians.\n\nJoining the highly acclaimed Juicy Lucy was a large step towards rock stardom, and major tours of Britain, Europe and the USA accompanied a regular output of recorded works. After Juicy Lucy split, Micky co-founded Snafu, combining his rock-style guitar with down-home stateside grooves, and became a major contributor on the song-writing front. Snafu recorded three albums and toured extensively before the individual members headed off to pursue their different ventures. Micky then became engrossed in session work as his reputation as a versatile performer spread. Soon a phone call from David Coverdale assured Micky of a vital place in his future plans, starting with the guitar slot and co-writing position on his forthcoming solo albums, Whitesnake and Northwinds.\n\n\n\nAs a sideman, Micky has featured alongside such classic British singers as Graham Bonnet, Frankie Miller, Chris Farlowe, Sheena Easton, Roger Chapman, Elkie Brookes and Eric Burdon. Visitors from the states such as Meat Loaf, Matt guitar Murphy, Ben E. King and Walter Trout have all employed his talents to enhance their performances.\n\nMicky's session work has included many T.V. commercials and some film scores. As a writer or co-writer his credits are numerous and include many of the classic Whitesnake favourites. With the Moody Marsden band, he and his guitar sparring partner Bernie Marsden toured extensively and released four albums before continuing their Whitesnake legacy with the Snakes and the Company of Snakes.\n\nIn 2000 Micky finally released his first solo album I Eat Them For Breakfast on Armadillo records.\n\n\n\n\n\n\n\nInterview by Michael Limnios\n\n\n\n\n\nWhat was the first gig you ever went to & what were the first songs you learned?\n\nAs a child I was taken by my parents to a Christmas pantomime where the special guests were Cliff Richard and the Shadows. I was aware of their music and, like a lot of youngsters who took up the guitar in the early 1960's, I was especially drawn to the playing of Hank Marvin. I went to private guitar lessons from the age of twelve, so the first tunes I learned to play where from guitar tutor books.\n\n\n\n\n\nWhich was the best moment of your career and which was the worst?\n\nGetting my first gold album (Ready an'Willing - Whitesnake) was a great moment. Playing onstage with Eric Clapton was also special.\n\nThe worst was performing with Snafu at the huge Roosevelt Stadium in New Jersey supporting Emerson Lake & Palmer. It was the ugliest drink and drug-sodden atmosphere I have ever experienced. We should never have supported ELP, this was not our audience and our management were to blame. We had to leave the stage because of the abuse, and also to avoid the missiles that were thrown at us from a truly dystopian gathering.\n\n\n\n\n\nWhat do you learn about yourself from music? What experiences in your life make you a GOOD musician?\n\nI believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\n\n\n\n\n\nFrom whom have you have learned the most secrets about blues rock music & in which songs can someone hear the best of your work?\n\nI loved the Jeff Beck Group with Rod Stewart on vocals. They could take blues and soul songs and heavy them up, and some of their originals songs sounded very inspired. Beck played like nobody else, and still does. I'm also a fan of American guitarist Harvey Mandel, especially the stuff he did in the late 6o's-early 70's and, of course, Eric Clapton in Cream. Blues rock slide? Early Johnny Winter; Duane Allman; Lowell George; Ry Cooder; Zoot Horn Rollo; Sonny Landreth, and Glenn Ross Campbell's steel playing.\n\nI think I improved with age! Some of my best playing is on my solo albums 'I Eat Them For Breakfast' and 'Don't Blame Me'. I was more in control of my own destiny on those albums.\n\n\n\n\n\nWhat characterizes your “philosophy” about the music?\n\nI've always been fascinated by the number of different styles of music that you can coax from the guitar. I'm known primarily as an electric guitarist but I have always loved the natural sound of acoustic music. I've discovered a lot of open tunings throughout the years, and different types of right-hand picking techniques from pick and fingers, thumpick and fingers and flesh (no picks at all). In the last few years I have written and produced two instrumental albums: 'Acoustic Journeyman' and 'Electric Journeyman'. Although I've been involved in a lot of song writing over the years, playing the guitar is still my main passion. People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\n\n\n\n\n\nWhy did you think that Micky Moody, continues to generate such a devoted following?\n\nI don't know if I have a devoted following! Maybe people appreciate that I've never been afraid to attempt different styles and that I try to express a range of emotions when I play.\n\n\n\n\n\nWhat is the “thing” you miss most from the Tramline? Which memory from the Wildflowers makes you smile?\n\nTramline: I was only seventeen at the time, in great health with my whole life ahead of me. Yes, I miss that feeling! The Wildflowers: Traveling to London with the other three guys in an old van fitted-out with bunk beds; we were so dedicated!\n\n\n\n\n\nTell me about the beginning of Juicy Lucy. How did you get together and where did it start?\n\nJuicy Lucy's Singer Paul Williams had seen me perform in Tramline, Lucas and the Mike Cotton Sound and Zoot Money's band. He must have been impressed because when Neil Hubbard left Juicy Lucy to join the Grease Band he suggested me to the other guys. They were rehearsing at a house in the countryside so I went and rehearsed with them and got the job.\n\n\"I believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\"\n\nWhat are some of the most memorable stories you've had from Juice Lucy?\n\nSoon after I joined Juicy Lucy we flew to the United States for a tour which lasted for nearly a month. It was my first time in America and suddenly I was looking at things and visiting places I'd only seen on television. New York: we played at the legendary Fillmore East supporting Cactus and Lee Michaels; visited Atlantic's famous recording studio where Roberts Flack was recording with some of the greatest session musicians in the US (including the great Bernard 'Pretty' Purdie on drums). The Fillmore West, San Francisco where we supported Elton John and The Kinks, and looking out on a warm November day at Alcatraz Prison and the San Francisco Bay. Los Angeles: two or three nights at the Whiskey A Go- Go, staying at the Tropicana Hotel - Californian groupies! Boston: two nights at the Boston Tea Party supporting Leon Russell and Elvin Bishop - both had great bands. Went to Chicago and Madison WN too.\n\nLots of touring, especially in Germany, and taking over as lead guitarist when members from the original line-up quit. It was all great experience!\n\n\n\n\n\nAny comments about your experiences with Chris Farlowe, Roger Chapman & Bernie Marsden? Would you like to tell your best memory about them?\n\nI was aware of Chris and Roger from my teens back in the north of England. Chris Farlowe and the Thunderbirds featured Albert Lee on guitar which was a real bonus for us guitar players. Tramline supported Family on a club date so I got see them live; Roger singing in that unusual fashion over very original-sounding songs. So it's been a thrill to actually work with them. Other great singers I've worked on stage with include Frankie Miller, Graham Bonnet, Gary Brooker, , Paul Rodgers in the Roadrunners/Wildflowers and David Coverdale in Whitesnake. Bernie and I developed a special understanding as dual guitarists, firstly with Whitesnake, then with the Moody Marsden Band. It had very little to do with Wishbone Ash or Thin Lizzie, and was influenced by the 60's British Blues players and American Southern Rockers like the Allman Brothers and Lynyrd Skynyrd.\n\nWould you mind telling me your most vivid memory from Snafu?\n\nSee above! On a more positive note, recording the first album at the Manor Studios. We had a nice, tight funky thing going on in the early days.\n\n\"People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\"\n\nDo you remember anything interesting stories from Whitesnake?\n\nI have an incredible amount of interesting stories from my days with Whitesnake. How many weeks do you have to listen to them?!! It's impossible to pick out a few as there were so many. I had some of the best times of my life - it was the 70s, totally politically-incorrect, sexy and indulgent. That's all I'm saying!\n\n\n\n\n\nHow did you first meet John Mayall, do you remember anything interesting from touring with him?\n\nI was still in London after the breakup of the Wildflowers (1967) and Bruce Thomas, the bass player, discovered where John Mayall lived. Although I'd already decided that I would move back to my home town and spend some time studying the classical guitar, Bruce wanted to progress in the blues scene. We took the tube train to Paddington Station and walked a few blocks to Mayall's flat, which was at the top of a house close to the station. He had no idea who we were but was kind enough to invite us up to his flat, where his new guitarist Mick Taylor sat listening to blues albums. Bruce gave him his number for future reference and we had a nice cup of tea!\n\nI met him again the following year when Tramline supported his 'Crusade' band at the Marquee Club in London. In the spring of 1970, when I was playing with Zoot Money, we supported him and his drummer-less band on a number of shows on his British tour. His line-up was very odd: Jon Mark on nylon-strung guitar; Johnny Almond on Saxophones and Alex Dmochowski on bass. He seemed like quite a private, laid-back person.\n\n\"Being in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\"\n\nHow has the music business changed over the years since you first started in music?\n\nI was very lucky to have started my career in the Sixties and to have developed it in the Seventies. There was very little in the way of entertainment for the masses apart from music, TV (very limited those days) and film, and most people went to gigs and bought records. The opportunities were immense, unlike today were the public have so much choice, most of it available through the internet or multimedia. Recorded works and live performances were treated with respect and giving things for free, or worse, having them pirated, was rarely an option. I also think that, in some regards, technology has made the art of creating and performing music too accessible and instantaneous. If utilized correctly technology can be put to good use, but practice and dedication to one's instrument will always produce the better musician.\n\n\n\n\n\nWhy do you think that the blues doesn’t quite get the recognition and respect that other genres seem to get? Give one wish for the BLUES\n\nI'm not sure I agree with your opinion! I think that after pop and rock, blues is one of the most accepted forms of music to be embraced by a wide audience. Long may the Blues continue!\n\n\"I would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\"\n\nWith such an illustrious career, what has given you the most satisfaction musically?\n\nBeing in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\n\n\n\n\n\nWhat is the difference and similarity between the LIVE/GIG and the STUDIO feeling? And between your session projects, solo albums and the band’s recording?\n\nThere's obviously a big difference between playing live and playing in a recording studio; some people excel in one and struggle with the other. I think that for most people, playing live is their raison d'etre, whilst the recording studio is a workshop within which you can create. I've been lucky enough to have had a lot of experience in both, some experiences turning out better than others. Playing live, there is (hopefully) an atmosphere created by both performers and audience, whereas you have to create an atmosphere in a studio - and concentrate - you have to live with the results!\n\nI'm in control of my own projects so I'm responsible for the outcome. On sessions you have to try and make the artist/producer comfortable and pleased with your efforts. I'm involved in a new band called Snakecharmer and we're all very experienced - watch out for us!\n\n\n\n\n\nAre there any memories from the US tour “Best of British Blues”, which you’d like to share with us?\n\nUnfortunately the 'Best of British Blues' tour of 1996 was memorable for the wrong reasons. The line-up consisted of featured artists Eric Burdon and Alvin Lee, and the band was Aynsley Dunbar, Boz Burrell, Tim Hinkley and myself. I don't like to talk ill of the dead, but Boz created problems right from the first gig; he was unhappy with the promoter and seemed uncomfortable with the personnel. Halfway through the tour he went to pieces and couldn't continue, so Aynsley suggested Tony Franklin who'd played with bass with The Firm (Paul Rodgers/Jimmy Page). The band then seemed to split into two camps: Burdon, Dunbar and Franklin, and Lee, Hinkley and Moody. Eric Burdon thought that his guitarist should come to the House of Blues in L.A. and perform on stage with us just to show me how it should be done! What a fucking insult! Alvin sensed the vibes and a couple of gigs later he booked a plane home. We didn't even finish the tour. There were some good moments, but overall, definitely one to forget!\n\n\n\n\n\nIf you go back to the past what things you would do better and what things you would avoid to do again?\n\nI would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\n\n\n\nMicky Moody - Official website\n\n\n\n\n\n"}, {"url": "https://rateyourmusic.com/release/album/juicy_lucy/pieces/", "page_content": "By the time 1972's \"Pieces\" was released, for all intents and purposes, Juicy Lucy was a new band. Signed by Polydor, the group did not include a single founding member. Defacto leader/singer Paul Williams had joined the band as part of the second line-up, as did guitarist Micky Moody. Keyboardist Jean Roussel and the former Blodwyn Pig rhythm section of Ron Berg and Andy Pyle had all joined the previous year. In the business world, I guess you would call this an example of \"extending the brand\".\n\n\n\nProduced by Grease Band drummer Bruce Rowlands, the band's fourth album marked a change in musical direction. With Williams and friend/lyricist John Edwards responsible for the majority of the ten tracks, out the door went most of their blues roots; replaced by a more commercial and varied attack that included boogie-rock ('Promised Land'), country ('Dead Flowers In The Mirror'), country-rock ('Prospector Dan'), and even a couple of shots at commercial pop-rock (It Ain't Easy''). For a band that was rapidly running out of options, you couldn't really blame them for casting about for an audience. Williams had a likeable voice and the rest of the band were all thoroughly professional, but with the exception of 'The Cuckoo' and the rocker 'Suicide Pilot', nothing here really captured your ears. Far too often the results sounded like music recorded and selected by a legal committee.\n\nMore ▾\n\n(side 1)\n\n1.) Promised Land (Chuck Berry) -\n\nTechnically there wasn't anything wrong with the band's cover of Chuck Berry's 'Promised Land'. The performance was full of bar room swagger, with Paul Williams turning in a suitably energetic vocal and Mick Moody adding just the right amount of lead guitar. Small club and a couple of cold beers and this one probably sounded like dynamite ... That said, why bother covering the tune - their performance added nothing to the hundreds of earlier cover versions, let alone the Berry original. rating: ** stars\n\n2.) The Cuckoo (traditional arranged by Paul Williams) -\n\nThe band 'discovered' the traditional song 'The Cuckoo' on a Taj Mahal album and decided to give it a shot. Given a driving, upbeat arrangement and one of Williams best vocals and kicked along by some tasty Moody slide guitar, the result was one of the few highlights on the collection. rating: **** stars\n\n3.) All My Life (Paul Williams - John Edwards) -\n\n4.) It Ain't Easy (Zoot Money - Colin Allen) -\n\nWritten by Zoot Money who suggested the band record it, 'It Ain't Easy' was a breezy, mid-tempo rocker; one of the album's most commercial offerings. Showcasing a pretty melody, a catchy chorus, and a beautiful Moody lead guitar solo, the song had FM radio written all over it. It was also thoroughly predictable and dull. This could have been a Pablo Cruise release for all it mattered which might explain why Polydor released it as a single in the UK:\n\n\n\n- 1972's 'It Ain't Easy' b/w 'Promised Land' (Polydor catalog number 200 1279). rating: ** stars\n\n\n\n(side 2)\n\n1.) Suicide Pilot - (Paul Williams - John Edwards) -\n\nI've always been partial to a tough, sleazy rock song and the Williams-Edward original 'Suicide Pilot' fit the bill. Hum, an English band that capably nailed Lynyrd Skynyrd-styled Southern rock. Who would've guessed ? Guitarist Moody deserved the spotlight on this one. rating: **** stars\n\n2,) Why Can't It Happen To Me (Paul Williams - John Edwards) -\n\nWith a laidback jazz-tinged feel, the dry ballad 'Why Can't It Happen To Me' has always reminded me a bit of Mark Knopfler and Dire Straits. rating: *** stars\n\n3.) Dead Flowers In The Mirror (Paul Williams - John Edwards) -\n\nA straight forward country number, 'Dead Flowers In The Mirror' was a total waste of vinyl. Moody was quoted as saying the song was intended as a country spoof. Waste. rating: * star\n\n4.) Prospector Dan (Paul Williams - John Edwards) -\n\n'Prospector Dan' found the band taking a stab at country-rock. With a catchy hook, it was certainly better than 'Dead Flowers' and with a moderately funny lyric, actually sounded a bit like a Barenaked Ladies track. rating: *** stars\n\n5.) How Can A Poor Man Stand Such Times And Live (Alfred Reed) -\n\n'How Can A Poor Man Stand Such Times And Live' was another track the band had heard on a Taj Mahal album. I've never heard the Taj Mahal version, but this version was far too country for my tastes. rating: * star\n\n\n\n\n\nYeah there were a couple of isolated treasures, but overall it wasn't a particularly impressive way for the band to go out. I don't think the album saw a US release. Who knows why, but in 1997 the British Repertoire label reissue the album in CD format (Repertoire catalog number REP4644-WY).\n\n\n\n\n\nAnd that was the end of the band until Ray Ownes reactivated the nameplate was reactivated in the mid-1990s.\n\n\n\nYou'd have to write a novel to track the member's post Juicy Lucy comings and goings, but among their post-Juicy Lucy endeavors:\n\n\n\n- Berg and Pyle joined Savoy Brown.\n\n- Moody joined SNAFU for a couple of albums; was in an early version of Whitesnake, and played in The Moody Marsden Band.\n\n- Roussel hooked up with Cat Stevens and did sessions work.\n\n- WIlliams joined Jim Hiseman's Tempest.\n\nPublished"}, {"url": "https://rawkbawx.rocks/details.php?id=af951d15bc444b6b17570f88a7238fc8c5ef0423", "page_content": "\n\nRockbox Search Search Active Torrents\n\n\n\n\n\n\n\nIrc Channel info\n\nWebIRC Login irc.p2p-network.net\n\n#rockbox\n\nMirc link Come Join Us\n\nTorrent's details Page Links: Other Torrents - Comments File Name: [Request] Juicy Lucy - Full-Length Discography (1969-2006) Download Torrent: [Request] Juicy Lucy - Full-Length Discography (1969-2006) Description: Blues rock from the United Kingdom, full-length discography of seven albums released between 1969 and 2006.\n\n\n\n\n\n\n\n\n\n\n\nJuicy Lucy is a blues-rock band officially formed on 1 October 1969. After the demise of The Misunderstood, vocalist Ray Owen, steel guitarist Glenn Ross Campbell, and saxophone player Chris Mercer formed Juicy Lucy. The group later recruited guitarist Neil Hubbard, bassist Keith Ellis, and drummer Pete Dobson.\n\nThe band name was inspired by a character in The Virgin Soldiers (1966) by Leslie Thomas.\n\n\n\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley composition \"Who Do You Love?\". Their self-titled debut album then fell just shy of the Top 40 in the UK Albums Chart. The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.\n\nLine-up changes ensued, as ex-Zoot Money singer Paul Williams, guitarist Micky Moody, and drummer Rod Coombes replaced Owen (who exited for a solo career), Hubbard, and Dobson for 1970's Lie Back and Enjoy It (#53 - UK Albums Chart). In May 1970, the band appeared at the annual NME poll-winners concert. Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This. In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.\n\nThe constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces. This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter.\n\n\n\nMicky Moody was a member of Snafu between 1973 and 1976, and he later joined the inaugural Whitesnake line-up in 1978. A 1996 album called Blue Thunder was released under the Juicy Lucy name by Paul Williams and Micky Moody, featuring guest musicians Mick Taylor and Andy Summers. Moody and Williams also released an album called Smokestacks, Broomdusters and Hoochie Coochie Men in 2002.\n\n\n\nJuicy Lucy's version of the song \"Who Do You Love?\" was subsequently featured in the video game Shellshock: Nam '67.\n\nIn 1995, Ray Owen resurrected the band's name and recorded Here She Comes Again. The line-up for this recording also included Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums). This version of the band broke up in 1997, but Owen persevered and joined up with guitarist Steve Fish. Although legal problems would not allow them usage of the name Juicy Lucy, the outfit performed as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\n\n\nIn 2004, bassist Fudge and drummer Paul Fletcher joined the band, after the legal situation had been resolved. This version of Juicy Lucy released the album Do That And You'll Lose It in 2006 and toured the UK with Nazareth. They played at the Cambridge Rock Festival in 2007.\n\nIn 2009, a new line-up of Juicy Lucy was formed as - due to health problems - Owen was unable to continue touring on a regular basis. The band was then fronted by singer/guitarist Steve Fish, with Paul Fletcher on drums and James Morris on bass, and this line-up continued to tour throughout the UK. In September 2012, Frank Cokayne (on bass guitar) joined Fish and Fletch in the UK-based version of the band. In March 2013, Cokayne was replaced by Michael Phillips. \"Mississippi Woman\" and \"Who Do You Love?\" (from the band's first album) are still performed live.\n\nOwen now occasionally plays live in France under the moniker \"Ray Owen's Juicy Lucy\", accompanied by Mike Jarvis and Spencer Blackledge from the 1990s incarnation of the band. He also performs solo acoustic sets around the UK, including regular engagements at the Lewes Con Club.\n\n\n\n\n\nJuicy Lucy At MySpace\n\n\n\n\n\n1969 Juicy Lucy\n\n\n\n1970 Lie Back And Enjoy It\n\n\n\n1971 Get A Whiff A This\n\n\n\n1972 Pieces\n\n\n\n1995 Here She Comes Again\n\n\n\n1996 Blue Thunder\n\n\n\n2006 Do That And You’ll Lose It\n\n\n\n\n\nIf you like this torrent show some gratitude to site and please make a donation. If you do Odin will grant you power and more spicy music!\n\n\n\n\n\nAs requested by a fellow member valkokoev from Bulgaria! Genre: Rock Subgenre: Blues Rock Bitrate: 320 k Size: 755.44 MB Show/Hide Files: File Name Size 1969 Juicy Lucy/01-Mississippi Woman.mp3 8.72 MB 1969 Juicy Lucy/02-Who Do You Love.mp3 7.02 MB 1969 Juicy Lucy/03-She's Mine, She's Yours.mp3 13.24 MB 1969 Juicy Lucy/04-Just One Time.mp3 10.72 MB 1969 Juicy Lucy/05-Chicago North-Western.mp3 9.33 MB 1969 Juicy Lucy/06-Train.mp3 13.48 MB 1969 Juicy Lucy/07-Nadine.mp3 6.47 MB 1969 Juicy Lucy/08-Are You Satisfied.mp3 14.45 MB 1969 Juicy Lucy/09-Walking Down The Highway.mp3 11.03 MB 1970 Lie Back And Enjoy It/01-Thinking Of My Life.mp3 10.35 MB 1970 Lie Back And Enjoy It/02-built For Comfort.mp3 13.86 MB 1970 Lie Back And Enjoy It/03-Pretty Woman.mp3 7.47 MB 1970 Lie Back And Enjoy It/04-Whisky In My Jar.mp3 9.22 MB 1970 Lie Back And Enjoy It/05-Hello LA Bye Bye Birmingham.mp3 9.67 MB 1970 Lie Back And Enjoy It/06-Changed My Mind.mp3 7.14 MB 1970 Lie Back And Enjoy It/07-That Woman's Got Something.mp3 6.71 MB 1970 Lie Back And Enjoy It/08-Willie The Pimp.mp3 12.88 MB 1970 Lie Back And Enjoy It/09-Lie Back And Enjoy It.mp3 3.48 MB 1970 Lie Back And Enjoy It/10-Walking Down the Highway.mp3 10.96 MB 1970 Lie Back And Enjoy It/11-I'm A Thief.mp3 8.63 MB 1971 Get A Whiff A This/01-Mr Skin.mp3 8.63 MB 1971 Get A Whiff A This/02-Midnight Sun.mp3 8.40 MB 1971 Get A Whiff A This/03-Midnight Rider.mp3 7.46 MB 1971 Get A Whiff A This/04-Harvest.mp3 9.87 MB 1971 Get A Whiff A This/05-Mr A Jones.mp3 7.16 MB 1971 Get A Whiff A This/06-Sunday Morning.mp3 8.84 MB 1971 Get A Whiff A This/07-Big Lil.mp3 10.62 MB 1971 Get A Whiff A This/08-Jessica.mp3 9.37 MB 1971 Get A Whiff A This/09-Future Days.mp3 9.44 MB 1972 Pieces/01-Promised Land.mp3 8.95 MB 1972 Pieces/02-Cuckoo.mp3 8.51 MB 1972 Pieces/03-All My Life.mp3 14.98 MB 1972 Pieces/04-It Ain't Easy.mp3 13.53 MB 1972 Pieces/05-Suicide Pilot.mp3 9.66 MB 1972 Pieces/06-Why Can't It Happen To Me.mp3 8.89 MB 1972 Pieces/07-Dead Flowers In The Mirror.mp3 9.12 MB 1972 Pieces/08-Prospector Dan.mp3 11.22 MB 1972 Pieces/09-How Can A Poor Man Stand These.mp3 8.96 MB 1995 Here She Comes Again/01-Who Do You Love.mp3 6.90 MB 1995 Here She Comes Again/02-Saturday Night.mp3 9.58 MB 1995 Here She Comes Again/03-Here She Comes Again.mp3 10.16 MB 1995 Here She Comes Again/04-Talk To Me.mp3 9.08 MB 1995 Here She Comes Again/05-Try My Love.mp3 9.62 MB 1995 Here She Comes Again/06-Gone Tomorrow.mp3 13.15 MB 1995 Here She Comes Again/07-Voodoo Chile.mp3 11.89 MB 1995 Here She Comes Again/08-Instrumentalizationalized.mp3 8.64 MB 1995 Here She Comes Again/09-Up To The Trax.mp3 9.03 MB 1995 Here She Comes Again/10-Pretty Woman.mp3 9.22 MB 1995 Here She Comes Again/11-Drug Squad.mp3 16.82 MB 1996 Blue Thunder/Track_01.mp3 10.10 MB 1996 Blue Thunder/Track_02.mp3 11.89 MB 1996 Blue Thunder/Track_03.mp3 13.48 MB 1996 Blue Thunder/Track_04.mp3 9.02 MB 1996 Blue Thunder/Track_05.mp3 12.77 MB 1996 Blue Thunder/Track_06.mp3 10.96 MB 1996 Blue Thunder/Track_07.mp3 11.40 MB 1996 Blue Thunder/Track_08.mp3 10.08 MB 1996 Blue Thunder/Track_09.mp3 13.49 MB 1996 Blue Thunder/Track_10.mp3 8.27 MB 2006 Do That and You'll Lose It/01-Silver Bird.mp3 11.53 MB 2006 Do That and You'll Lose It/02-Making a Name.mp3 8.73 MB 2006 Do That and You'll Lose It/03-Forty Days.mp3 18.54 MB 2006 Do That and You'll Lose It/04-Species.mp3 15.30 MB 2006 Do That and You'll Lose It/05-Where Were You.mp3 15.01 MB 2006 Do That and You'll Lose It/06-Madeline & Suzy.mp3 11.08 MB 2006 Do That and You'll Lose It/07-Only When You Know.mp3 13.38 MB 2006 Do That and You'll Lose It/08-Freedom.mp3 11.82 MB 2006 Do That and You'll Lose It/09-Facts of Life.mp3 7.37 MB 2006 Do That and You'll Lose It/10-One Time, One Place.mp3 13.55 MB 2006 Do That and You'll Lose It/11-God Only Knows.mp3 10.94 MB 2006 Do That and You'll Lose It/12-Floss.mp3 24.20 MB 71 files Added: 20/07/2014 Peer(s): Seed(s): 2, Leecher(s): 0 = 2 Peer(s) Last Seed Update 11/06/2023 12:27:53\n\n\n\nBack"}, {"url": "https://wiki2.org/en/Micky_Moody", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish musician\n\nMusical artist\n\nMichael Joseph Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed The Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. From 2011 to 2015, Moody toured and recorded with Snakecharmer, a band he co-formed.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy.[citation needed] Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009).[1] A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene.[2] Another book of memoirs, Snakes and Ladders, was released in 2016. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.[citation needed] More recently Micky has worked alongside Ali Maas Moody and they have co-written and released two albums, Black & Chrome and Who's Directing Your Movie?\n\nYouTube Encyclopedic\n\n1 / 5 Views: 2 300 942 329 818 4 308 3 962\n\nMicky Moody - A Taste For Bourbon\n\nMicky Moody [All information in the comments]‎\n\nRelaxing Whiskey Blues Music - Best Of Slow Blues - Fantastic Electric Guitar Blues\n\nJuicy Lucy - Who Do You Love (1971) (MIcky Moody)\n\nMicky Moody - My Lady Friend Transcription\n\nBiography\n\n1960s\n\nWhile at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with others from the area including Paul Rodgers (later of Free and Bad Company). They were subsequently joined by bass player Bruce Thomas, later to play with Elvis Costello and the Attractions. The band performed covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.[3][4]\n\n1970s\n\nIn 1970 he joined recently re-patriated keyboard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guest with Hinkley's Heroes before joining his friend David Coverdale. Moody knew Coverdale – who had fronted Deep Purple and was looking to undertake a solo venture – from the Middlesbrough music scene in the late sixties. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two studio albums, Trouble (1978) and Lovehunter (1979), recorded by a modified lineup with Jon Lord on keyboards. Moody is credited with cowriting four of the tracks on Trouble and was sole writer of 'Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.[citation needed]\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.[citation needed]\n\nIn 1981, Graham Bonnet's Line-Up featured Moody playing guitar on all tracks and three songs written by Moody with Bob Young. Moody maintained a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others.[citation needed] By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was unhappy with the direction the new band was taking and felt increasingly sidelined by Coverdale.[5] Despite this deteriorating situation, he recorded Slide It In – a process he described as an 'unhappy experience' – but then left the band in 1983.[1]\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected TV music library work. He toured with Chris Farlowe and worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, witty view of some of the people and experiences they'd encountered over the years, he and Bob Young wrote a book on musicians' humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band, featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade, he and Bernie Marsden played selected venues with their own Moody Marsden Band.[citation needed]\n\n1990s\n\nDuring the early 1990s, Moody toured extensively with Roger Chapman. \"What a bloke,\" marvelled the singer. \"Every hotel we stayed in, he used to get his black bin-liners out and start taping them to the windows – can't sleep if there's any light in the room. They used to think he was mad. Lovely fella though. A great guitarist. And intelligent too. Too intelligent for Coverdale.\"[6]\n\nMoody reunited on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record as the Moody Marsden Band in U.K and Europe. They issued two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the US as part of the Best of British Blues tour, also featuring Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jørn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in reproducing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Stefan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.[citation needed]\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams[7] to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also played occasional duo gigs with bluesman Papa George.[citation needed] 'Snake' metamorphosed into M3 Classic Whitesnake and also released a live CD (featuring former Black Sabbath singer Tony Martin) and a live DVD with the former The Company Of Snakes singer Stefan Berggren back, and with the special guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. The DVD also featured sessionman Jimmy Copley (who worked with bands such as Go West and Tears for Fears) on drums and Mark Stanway from Magnum on the keyboards.\n\nAround this time Moody played on Nah Aufnahme by German musician Westernhagen, which eventually appeared in the national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me, released at the same time as his memoirs Playing with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a line up which also includes former Whitesnake colleague Neil Murray, former Wishbone Ash guitarist Laurie Wisefield, singer Chris Ousey (Heartland), drummer Gary James (Thunder, Magnum) and Ozzy's keyboardist Adam Wakeman. In 2015, Moody left \"Snakecharmer\" to pursue his solo career. In recent years, Moody also made regular appearances alongside blues guitarist Papa George and has been an active member of the \"Sunflower Jam\" house band and the Bad Apples.[citation needed]. In 2016 he and Ali Maas Moody released their first album together. They also played live regularly with their Ali Maas and Micky Moody Band.\n\n2020s\n\nIn 2020 Micky and Ali released their second co-written album and continue to work together.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\n2001 Ozone Friendly\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\nWith Whitesnake\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\n2020 Who's directing your Movie?\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n(VA) 1970 Zoot Money (Zoot Money)\n\n(Zoot Money) 1973 In Memory of Robert Johnson (Paul Williams)\n\n(Paul Williams) 1973 I Never Got (Tony Kelly)\n\n(Tony Kelly) 1973 Manor Live (VA)\n\n(VA) 1973 Me and My Friend (Patrick Campbell Lyons)\n\n(Patrick Campbell Lyons) 1974 Funkist (Bobby Harrison)\n\n(Bobby Harrison) 1975 Squire (Alan Hull)\n\n(Alan Hull) 1975 Legend (Mickey Jupp)\n\n(Mickey Jupp) 1977 Graham Bonnet (Graham Bonnet)\n\n(Graham Bonnet) 1977 Fancy That (Joanna Carlin)\n\n(Joanna Carlin) 1977 City to City (Gerry Rafferty)\n\n(Gerry Rafferty) 1979 Chappo (Roger Chapman)\n\n(Roger Chapman) 1981 Line Up (Graham Bonnet)\n\n(Graham Bonnet) 1982 Riff Burglars (Roger Chapman)\n\n(Roger Chapman) 1982 Madness, Money & Music (Sheena Easton)\n\n(Sheena Easton) 1986 In Quo Country (Bob Young)\n\n(Bob Young) 1987 Islands (Mike Oldfield)\n\n(Mike Oldfield) 1987 Party Album (Gary Glitter)\n\n(Gary Glitter) 1987 Reaching Out (Paul Millns)\n\n(Paul Millns) 1987 Indestructible (Mike D'Abo)\n\n(Mike D'Abo) 1987 No Angel (Sanne Salomonsen)\n\n(Sanne Salomonsen) 1988 New Day (Jane Harrison)\n\n(Jane Harrison) 1989 Walking The Cat (Roger Chapman)\n\n(Roger Chapman) 1990 Hybrid and Lowdown (Roger Chapman)\n\n(Roger Chapman) 1991 Blue-Eyed Slide (Brian Knight)\n\n(Brian Knight) 1992 Parlour Games (John Spencer)\n\n(John Spencer) 1992 Blues Brittania (VA)\n\n(VA) 1992 Waiting in the Wings (Chris Farlowe)\n\n(Chris Farlowe) 1992 Very Much Alive (Willy Finlayson and The Hurters)\n\n(Willy Finlayson and The Hurters) 1993 Midnight Postcards (Adam Faith)\n\n(Adam Faith) 1994 Tellin' Stories (Walter Trout)\n\n(Walter Trout) 1994 Line Up (Borderline)\n\n(Borderline) 1995 Together (Peter Smith)\n\n(Peter Smith) 1995 Green and Blues (Bernie Marsden)\n\n(Bernie Marsden) 1996 Kiss My Soul (Roger Chapman)\n\n(Roger Chapman) 1996 Blue Thunder (Blue Thunder)\n\n(Blue Thunder) 1998 Pinboard Wizards (Jackie Lynton)\n\n(Jackie Lynton) 2000 Here After (Jamie Marshall)\n\n(Jamie Marshall) 2000 Gimme All Your Topp (VA)\n\n(VA) 2000 Snakebites (VA)\n\n(VA) 2000 Glory Bound (Chris Farlowe)\n\n(Chris Farlowe) 2001 Another Hair of the Dog (VA)\n\n(VA) 2001 Tam de ti ye... (Ani Lorak)\n\n(Ani Lorak) 2002 Fairytale (Peer Gynt)\n\n(Peer Gynt) 2002 Who's He Calling Me Him (Norman Beaker Band)\n\n(Norman Beaker Band) 2003 Freak Out (Chris Catena)\n\n(Chris Catena) 2004 On The Wire (Smokie)\n\n(Smokie) 2005 Nah Aufnahme (Westernhagen)\n\n(Westernhagen) 2007 One More Time For Peace (Roger Chapman)\n\n(Roger Chapman) 2007 Human Spirit (Gary Fletcher)\n\n(Gary Fletcher) 2008 Slap My Hand (Jimmy Copley)\n\n(Jimmy Copley) 2009 Live at Abbey Road (Endangered Species)\n\n(Endangered Species) 2010 Live in Kawasaki/Demons & Wizards in Kawasaki (Official Bootleg) (Uriah Heep)\n\n(Uriah Heep) 2013 The Proof (The Proof)\n\n(The Proof) 2013 Tailshaker (Brothers in Blues)\n\n(Brothers in Blues) 2013 Friends for a LIVEtime (The Hamburg Blues Band)\n\n(The Hamburg Blues Band) 2014 Celebrating Jon Lord (VA)\n\n(VA) 2015 Hold On (Eugene Hideaway Bridges)\n\nReferences"}, {"url": "http://www.alexgitlin.com/juicy.htm", "page_content": "Week of March 29, 1997\n\nJuicy Lucy\n\nWho was the mysterious Juicy Lucy? Glenn 'Fernando' Campbell was always meaning to tell me. The cheerful dude in the big hat who played the steel guitar loved to keep everyone guessing and he never revealed his secret. At least - not to me. But Lucy was doubtless one of those ladies of the road, who lubricated the wheels of rock, if you'll pardon the phrase. Musically speaking Juicy Lucy, the band that bore her name, was one of the most respected outfits to come howlin' and wailin' out of the Sixties' blues boom. They had style and class. They also had some of the finest musicians of the day, ready to rock and eager to tour. Their debut album 'Juicy Lucy' (Vertigo), released in 1969 became famous for its notorious gatefold album sleeve, depicting a plump, naked lady covered in grapes, bananas and a half consumed melon. Not a pretty sight, but once seen, never forgotten.\n\nDespite their dramatic launch and excellent credentials, the band never quite made it into the international super league. They had a Top Twenty hit in 1970 with their version of Bo Diddley\u0092s \u0091Who Do You Love\u0092 and a subsequent hit with \u0091Pretty Woman\u0092. Glenn was filmed in action with the band for the rock movie 'Supersession' and Juicy Lucy went on to record several more albums for Vertigo, Polydor and Island, including 'Lie Back And Enjoy It', 'Pieces' and 'Get A Whiff Of This', before they finally broke up in 1972. Juicy Lucy underwent considerable line up changes during this turbulent period. The band featured on 'Pieces' provides revealing aspects of a fascinating saga which began when Glenn Campbell first arrived in Britain from the States, and ended with the final version of Juicy Lucy, fronted by guitar legend Micky Moody.\n\nThe roots of Juicy Lucy lay way back in The Misunderstood, a band championed by both the author of these notes and the lugubrious, mild mannered Radio One DJ John Peel. The reasons for this enthusiasm lay in the fact that Glenn Campbell was not just a fine musician who played a pedal steel guitar with great gusto. He was an American in London and thus seemed closer to the source. He was also very funny and entertaining, and liked a glass of English beer. His laid back sense of humour provided a welcome contrast to the attitude of many British blues practitioners, who seemed to imagine that you had to undergo some sort of private hell and spread a message of unrelenting gloom to be considered a true blues man!\n\nThe original Misunderstood was formed in 1966 and reformed for its trip to England. They made two singles for Fontana including 'Children Of The Sun,' and featured good looking young singer Steve Hoard. However the Misunderstood were eventually superseded by a more commercial Juicy Lucy. The first Lucy lineup included Ray Owen (vocals), Glenn Campbell (steel guitar, mandolin and vocals), Neil Hubbard (guitar), Chris Mercer (saxophone, and piano), Keith Ellis (bass and vocals) and Pete Dobson on drums. The band was managed by Nigel Thomas who also looked after the affairs of Joe Cocker. A controversial but energetic music biz figure, Nigel died of a heart attack a couple of years ago. Micky Moody (born August 30, 1950), who is featured on the present album, remembers seeing the first version of the band on the road. 'The band was virtually formed around Glenn and everyone remembers their first album cover with the lady covered in fruit! I think her name was Zelda Plum. It was a great album and I remember seeing the band in action at their early gigs.\u0092\n\nMoody is from Middlesborough. He went to school with Paul Rodgers who later came to fame with Free and Bad Company. Micky and Paul formed a band at school called The Roadrunners which became The Wild Flowers when they moved to London in 1967 and 'starved to death in our caftans!' Micky later went home to study classical guitar while Paul Rodgers met Paul Kossoff and Simon Kirke and formed Free. Says Moody: 'I went back to the North East and was asked by a local club owner and singer called John McCoy to help form a blues band called Tramline.' The singer was friendly with record boss Chris Blackwell and the band released two albums on Blackwell's Island label. In March 1969 Moody auditioned for Lucas & The Mike Cotton Sound, a well known soul band. He got the gig, but switched to Zoot Money's band for a few months in 1970. He'd got to know Zoot's regular singer Paul Williams, who by this time had joined Juicy Lucy. Micky was brought up to date on all the latest Juicy gossip. 'Ray Owen had been sacked after a couple of months and Paul had got the gig. He told me Neil Hubbard was leaving and asked if I'd like to join on lead guitar. I said, 'Great!' I went straight into recording the album 'Like Back And Enjoy It.' We were gigging all the time and became particularly popular in Germany where the band was very respected.\"\n\nHowever it proved increasingly difficult to break out of the club circuit, and reach a higher level of acceptance. \"We made another album 'Get A Whiff Of This' before the group finally disintegrated in 1971.' Glenn Campbell went back to America, apparently disillusioned, but during their time together the, Campbell/Moody guitar partnership had worked well. \u0091It was good because we didn't get in each other's way. I liked Glenn's playing and did a bit of slide guitar myself, using the bottle neck. Yes I remember Glenn wearing his big hat. But we all used to do that, it was quite trendy at the time!\u0092\n\nDespite the defection of the mainman, Paul Williams wasn't ready to give up. \u0091Paul said he wanted to keep the band together. He wanted me to be the lead guitarist and also play bottle neck slide and the band kind of reformed. We had the famous rhythm section of Ron Berg and Andy Pyle from Blodwyn Pig. The line-up varied from time to time and Bernie Marsden actually came down for a blow. We were looking for another player because we wanted twin guitars. I'd been promoted to lead and we needed a rhythm player to get that American funky sound, without being too heavy. Bernie came down, but he was wrong for the job, as he was more in the Clapton vein.\u0092\n\nThe third and final version of Juicy Lucy remained functional between July 1971 and June 1972. Rhythm player Dave Tedstone worked with them for a while but the line up on 'Pieces' mainly featured Paul Williams (vocals), Micky Moody (guitar), Jean Roussel (keyboards), Ron Berg (drums) and Andy Pyle (bass). Later Paul Williams would depart to join Jon Hiseman's Tempest, Jean Roussel worked with Cat Stevens and the rhythm section defected to Savoy Brown. Juicy Lucy's style meanwhile had begun to move away from the more predictable blues sound.\n\nSays Micky: \u0091The music had a more mellow edge to it. We got a deal with Polydor to record the 'Pieces' album which was produced by Bruce Rowlands, drummer with the Grease Band.'\n\nIt was recorded at Olympic Studios, Barnes in December 1971. Most of the songs were written by Paul and a lyricist friend of his called John Edwards. There were a few guests on the album. Albert Lee and Chas Hodges were on backing vocals and Ian McLagan from the Small Faces and Mick 'Wynder K. Frogg' Weaver were on keyboards. Incidentally those two guys have been working together again on albums in Los Angeles.\u0092 'Pieces' is packed with good performances and kicks off with a rousing version of Chuck Berry's 'Promised Land' intended as a tribute to the master. \u0091Although it was mainly a mellow album we wanted to show we could still play rock'n'roll,\u0092 says Micky. \u0091The next song, 'Cuckoo', was one we'd head on a Taj Mahal album called 'Natch'l Blues.' This showed the kind of West Coast influence on the band.\n\nWe really liked Taj Mahal and Ry Cooder. 'It Ain't Easy' was a song Zoot Money wrote and passed on to Paul, and 'Suicide Pilot' was a Williams/Edwards original and a good rock'n'roller. Some of the songs have early Seventies' style lyrics, like 'Dead Flowers In The Mirror' which I recall was a bit of a country spoof! The final cut 'How Can A Poor Man Stand These Times' was taken from Ry Cooder's first album and was written by a blues singer called Alfred Reed. Did the album do very well? I don't think so I haven't been paid for it!' The band virtually split up not long afterward the album was released in the summer when Paul left to join Tempest. Yet the band struggled on with Frankie Miller for a couple more gigs and Bobby Harrison also sang for a while.\n\nWe tried to get Frankie Miller into the band but his management said 'no.' Then Bobby said he had a management deal and asked if we'd like to form a band with him. So we formed a new band called SNAFU and in 1972 we toured with Joe Cocker in Europe and did some gigs with Slade. But as Nigel Thomas, our manager, was looking after Joe Cocker, we sort of got pushed to the background. At one point I was asked to join Boxer with Mike Patto but didn't really fancy that, so I teamed up with Bobby Harrison and that was the end of Juicy Lucy.\u0092\n\nIt was a sad end to a band which had started out with such promise, and high hopes.\n\nAmazingly, despite all the line up changes and shifts in musical direction, the band's name alone could still command strings of college and club gigs right up to the end, such was the demand for 'live' music in those days. Subsequently, Moody did three albums with SNAFU. After they disbanded in 1976, Moody returned to session work and in that role backed singers Graham Bonnett, Frankie Miller, Chris Farlowe, Sheena Easton, Eric Burdon and Roger Chapman. In the mid-seventies, David Coverdale asked him to work on a project that became the first Whitesnake album. Micky played lead guitar on the album, contributed four songs and subsequently toured the world with Whitesnake.\n\nMoody has also recorded with Bob Young ('Young And Moody' album recently reissued on Repertoire) and worked with Bernie Marsden in the Moody Marsden Band. Recently Moody has reunited with Paul Williams to sing in a new band called Blue Thunder. No doubt, when the last punters have left and it\u0092s time for a drink at the bar, reminisce and they swap tales of the days when Juicy Lucy was on the loose!\n\nChris Welch , London 1997\n\nTaken from the liner notes to the 1997 Repertoire reissue of Juicy Lucy \" Pieces \" (1972) album, REP4644-WY\n\nPersonnel :\n\nLoughty Amao - Percussion\n\nGlenn Campbell - Guitar, Vocals\n\nPete Dobson - Drums\n\nKeith Ellis - Bass\n\nNeil Hubbard - Guitar\n\nChris Mercer - Sax, Keyboards\n\nRoy Owen - Vocals\n\nRod Combes - Drums\n\nMick Moody - Guitar\n\nPaul Williams - Vocals, Keyboards, Percussion\n\nJim Leverton - Bass\n\nRon Berg - Drums\n\nAndy Pyle - Bass\n\nJean Roussel - Keyboards\n\nAlbums :\n\nJuicy Lucy (Vertigo VO 2) 1969 (also released on Atco in the US)\n\nLie Back And Enjoy It (Vertigo 636 014) 1970\n\nGet A Whiff Of This (Bronze ILPS 9157) 1971 (also released on Atco in the US)\n\nPieces (Polydor 2310 160) 1972\n\nHere She Comes Again (1995)\n\nBlue Thunder (1997)\n\nThere's also a compilation, \"Who Do You Love?\" (Sequel NEXLP 105) 1990, also available on CD (Sequel NEXCD 105) 1990. The first two albums have been reissued on CD (BGO Records BGO 279) 1995.\n\n45s :\n\nWho Do You Love?/Walking Down The Highway (Vertigo V1) 1970\n\nPretty Woman/I'm A Thief (Vertigo 6059 015) 1970\n\nIt Ain't Easy/Promised Land (Polydor 200 1279) 1972\n\nReissue :\n\nWho Do You Love?/Chicago North Western (Bronze BRO 72) 1979\n\nSteel guitarist, Glenn Fernando Campbell, was the star behind this band. He'd joined them from The Misunderstood. Their vinyl zenith is usually considered to be their first album which contained a number of tight, well constructed songs, including a fine cover of Bo Diddley's \"Who Do You Love?\", which also took them into the 45 charts. It came on the now big collectable spiral Vertigo label in an attractive gatefold sleeve. Sadly it was downhill thereafter, their fortunes were hardly helped by several personnel changes. Paul Williams, ex-Zoot Money, came in on vocals, replacing Roy Owen on the second album, but the result was a disappointment. None of the original line-up survived for their fourth and final effort, \"Pieces\". The line-up for this included Andy Pyle, whilst he took a brief break from Savoy Brown. The final verdict must be that they failed to achieve their early promise.\n\nThe Sequel compilation also includes a couple of previously unissued tracks, \"I'm A Thief\" and \"Changed My Mind, Changed My Sign\". The Vertigo Annual 1970 included their own composition, \"Mississippi Woman\".\n\nSource: The Tapestry of Delights - The Comprehensive Guide to British Music of the Beat, R&B, Psychedelic and Progressive Eras 1963-1976, Vernon Joynson\n\nISBN 1 899855 04 1\n\nTo Ray Owen's Juicy Lucy Web Site\n\nBack to Alex's Home Page"}, {"url": "https://rateyourmusic.com/list/Arkofrock/bernie_marsden_and_micky_moody___works/", "page_content": "Albums and Videos from Artists and Bands with which Bernie and Micky played on. The list contains: A) At the first part , every album in which Bernie & Micky played as main musicians, not as guests guitarists. B) At the second part , the artists who released those albums. Note: The List does not contains compilations (except some special editions), singles & bootlegs (except bootlegs with very good recordings or officials).\n\n1 1. First part: The albums\n\n\"At the BBC: The Pauls Jones Show, Sessions 2002-2010\" which contains the first nine tracks (of this release) plus six other good BBC recordings. A pretty good bootleg ... for collectors & fans, for the rest of the listeners there is another one better bootleg with the BBC sessions, the 2010 releasewhich contains the first nine tracks (of this release) plus six other good BBC recordings.\n\nADVERTISEMENT\n\n\"Big Boy Blue: Live at the Granary - Limited Pre-Release Edition March 2005\" The Normal Release of the\n\n\"Stacks: Limited Pre-Release Edition March 2005\" The normal release of the\n\n\"Sampler\". A collection of live gigs, reissued in 2008 as compilation with the title\n\nSome guitar lessons by one of the top guitarists.\n\nADVERTISEMENT\n\n\n\n\n\nIt is a kind of reissue of a 2005 bootleg titled \"The Paul Jones R 'n' B Show: Sessions 2002-05\" the track list differs after the track nine. A very good bootleg, good recordings & nice performances, not only for collectors & fans ... find it.It is a kind of reissue of a 2005 bootleg titledthe track list differs after the track nine.\n\nADVERTISEMENT\n\nft Bernie Marsden\n\nft Bernie Marsden\n\nft Bernie Marsden\n\n27 27. Alaska Alive\n\nft Bernie Marsden\n\nft Bernie Marsden\n\n28 28. Alaska Alive [Bootleg / Unauthorized]\n\n\"Alive\", pretty good sound. A rip or the video, pretty good sound.\n\n\"Alive\", pretty good sound. A rip or the video, pretty good sound.\n\n29 29. Alaska Unreleased [Bootleg / Unauthorized]\n\nA mini LP, a fan club release with a few unreleased songs.\n\nA mini LP, a fan club release with a few unreleased songs.\n\nft Bernie Marsden\n\nft Bernie Marsden\n\n32 32. Bernie Marsden & Snowy White Notodden Blues Festival, Norway, August 11th 1995\n\nA very good recording ... and the most important, some very good performances from two well known artists.\n\n\n\nIt worths not only for the fans of Bernie Marsden and Snowy White, it worths for every one who listen to Blues & Blues Rock music ... find it.\n\nA very good recording ... and the most important, some very good performances from two well known artists.\n\n\n\nIt worths not only for the fans of Bernie Marsden and Snowy White, it worths for every one who listen to Blues & Blues Rock music ... find it.\n\nft Micky Moody\n\n34 34. Borderline Line Up\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\n46 46. The Little House Band Christmas 2000\n\nft Bernie Marsden & Micky Moody\n\n\n\nPS: The line-up is the same as The Company of Snakes\n\nft Bernie Marsden & Micky Moody\n\n\n\nPS: The line-up is the same as The Company of Snakes\n\nA Bootleg, a complete rip of the DVD Rough an' Ready\n\n49 49. M3 Classic 'Snake Live\n\na.k.a. \"Classic 'Snake Live Vols 1 & 2\" (Japan release too), contains the \"Classic 'Snake Live, Vol. 1\" (2004) and the unreleased (as far as i know) \"Vol. 2\".\n\na.k.a. \"Classic 'Snake Live Vols 1 & 2\" (Japan release too), contains the \"Classic 'Snake Live, Vol. 1\" (2004) and the unreleased (as far as i know) \"Vol. 2\".\n\nThe official audio release of Rough an' Ready DVD.\n\nContains the live albums \"Live in Hell - Unplugged\" (1993) & \"Never Turn Our Back on the Blues\" (1994).\n\n57 57. Moody Marsden Ozone Friendly\n\nA reissue of \"Real Faith\" (1994) with a lot of changes on the track-list.\n\nA reissue of \"Real Faith\" (1994) with a lot of changes on the track-list.\n\nft Bernie Marsden\n\nft Bernie Marsden\n\nft Bernie Marsden\n\n61 61. Snafu Snafu\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\n64 64. Snakecharmer Snakecharmer\n\nft Micky Moody\n\nft Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\n71 71. Whitesnake Trouble\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\n73 73. Whitesnake Lovehunter\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Bernie Marsden & Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Micky Moody\n\nft Bernie Marsden\n\nA compilation with a lot of songs which are not included within the duet's 1977 album.\n\n86 86. Second part: The artists/bands\n\n97 97. The Little House Band\n\n\n\n\"The Company of Snakes\" According to what is written at the cover of the album \" Christmas 2000 \", this band has the same basic line-up as the\n\n\"The Company of Snakes\" According to what is written at the cover of the album \" Christmas 2000 \", this band has the same basic line-up as the\n\n100 100. Mike Cotton\n\n\n\nMicky Moody played for a short time in this band. There are no infos for release(s) where Micky appears in.\n\nMicky Moody played for a short time in this band. There are no infos for release(s) where Micky appears in."}], "Micky Moody joined Juicy Lucy in 1969": [{"url": "https://wiki2.org/en/Juicy_Lucy_(band)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish blues rock band\n\nJuicy Lucy was a British blues rock band officially formed on 1 October 1969. After the demise of The Misunderstood, Juicy Lucy was formed by steel guitarist Glenn Ross Campbell, and prolific Blackburn saxophonist Chris Mercer.[1] The group later recruited vocalist Ray Owen, guitarist Neil Hubbard, bassist Keith Ellis, and drummer Pete Dobson.[2]\n\nThe band name was inspired by a character in The Virgin Soldiers (1966) by Leslie Thomas.[3]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 4 228 3 107 12 792\n\nJuicy Luicy - Chicago North Western (1970)\n\nJuicy Lucy - Chicago North Western - 2nd version (1970)\n\nJuicy Lucy - French TV 1971 \"Don't Keep Me Wonderin\" Transcription\n\nCareer\n\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley composition \"Who Do You Love?\"[4] Their eponymous debut album then fell just shy of the Top 40 in the UK Albums Chart.[2] The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.[5] (Some versions have less fruit than others.)\n\nLine-up changes ensued, as former Zoot Money singer Paul Williams (born Paul William Yarlett, 1940),[6] guitarist Micky Moody, and drummer Rod Coombes replaced Ray Owen (who joined Killing Floor,[7] before embarking on a solo career), Neil Hubbard and Pete Dobson, prior to the recording of 1970's Lie Back and Enjoy It (#53 – UK Albums Chart).[4] In May 1970, the band appeared at the annual NME poll-winners concert.[8] Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This.[2] In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.[9]\n\nThe constant turnover took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces.[5] This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg.[5] Juicy Lucy disbanded shortly thereafter.[5]\n\nMicky Moody was a member of Snafu between 1973 and 1976, and he later joined the inaugural Whitesnake line-up in 1978. A 1996 album called Blue Thunder was released under the Juicy Lucy name by Paul Williams and Micky Moody, featuring guest musicians Mick Taylor and Andy Summers. Moody and Williams also released an album called Smokestacks, Broomdusters and Hoochie Coochie Men in 2002.\n\nJuicy Lucy's version of the song \"Who Do You Love?\" was subsequently featured in the video game Shellshock: Nam '67.\n\nIn 1995, Ray Owen resurrected the band's name and recorded the album Here She Comes Again.[5] The line-up for this recording also included Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums).[5] This version of the band broke up in 1997, but Owen persevered and joined up with guitarist Steve 'Mr Fish' Fishwick. Although legal problems would not allow them usage of the name Juicy Lucy, the outfit performed as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\nIn 2004, bassist Colin Fudge and drummer Paul Fletcher joined the band, after the legal situation had been resolved. This version of Juicy Lucy released the album Do That and You'll Lose It in 2006 and toured the UK with Nazareth. They played at the Cambridge Rock Festival in 2008.\n\nIn 2009, a new line-up of Juicy Lucy was formed as – due to health problems – Owen was unable to continue touring on a regular basis. The band was then fronted by singer/guitarist Steve 'Mr Fish' Fishwick, with Paul Fletcher on drums and James Morris on bass, and this line-up continued to tour throughout the UK. In September 2012, Frank Cokayne (on bass guitar) joined Fishwick and Fletcher in the UK-based version of the band. The songs \"Mississippi Woman\" and \"Who Do You Love?\" (from the band's first album) were regularly performed live by this trio, until they parted ways in 2018.\n\nRay Owen (14 July 1947 – 31 October 2018) occasionally played live in France under the moniker \"Ray Owen's Juicy Lucy\", accompanied by Mike Jarvis and Spencer Blackledge from the 1990s incarnation of the band, and latterly with Sylvain Galesso on drums and Rosie Woodland on bass guitar. He also performed solo acoustic sets around the UK, including regular engagements at the Lewes Con Club, before his death from cancer in 2018, aged 71.[10][11]\n\nMembers\n\nFinal lineup\n\nSteve \"Mr. Fish\" Fishwick – vocals, guitar (2004–2018)\n\nMike Phillips – bass (2013–2018)\n\nPaul \"Fletch\" Fletcher – drums (2004–2018)\n\nDiscography\n\nStudio albums\n\nYear Album Label UK\n\n[12] 1969 Juicy Lucy Vertigo 41 1970 Lie Back and Enjoy It 53 1971 Get a Whiff a This Bronze — 1972 Pieces Polydor — 1995 Here She Comes Again HTD Records — 1996 Blue Thunder Outer Music — 2005 Raiding the Fruit Bowl (EP) — 2006 Do That and You'll Lose It — \"—\" denotes releases that did not chart.\n\nCompilation albums\n\n1974 – The Best of Juicy Lucy (Island Records)\n\n(Island Records) 1991 – Who Do You Love – The Best of Juicy Lucy (Anthology)\n\n1998 – Pretty Woman\n\n2010 – Rock Hits Collection[13]\n\nSingles\n\nYear Song UK\n\n[12] 1970 \"Who Do You Love\" 14 \"Pretty Woman\" 44 1972 \"It Ain't Easy\" — \"Midnight Sun\" — \"—\" denotes releases that did not chart.\n\nSee also\n\nReferences"}, {"url": "https://nostalgiacentral.com/music/artists-a-to-k/artists-j/juicy-lucy/", "page_content": "Juicy Lucy was formed in 1968 from the ashes of a psychedelic garage band called The Misunderstood, who had released the single I Can Take You To The Sun and had received great support from John Peel, but had failed to make any lasting commercial impact.\n\nAmerican pedal-steel guitarist Glenn ‘Fernando’ Campbell, vocalist Ray Owen and saxophonist Chris Mercer – who had moved to Britain from the US with The Misunderstood – re-formed the group as Juicy Lucy with all-new British players, Neil Hubbard (guitar, ex-Bluesology), Keith Ellis (bass, ex-Koobas and Van Der Graaf Generator) and Pete Dobson (drums).\n\nThe band almost immediately hit the UK Top 20 (#14) with their cover version of Bo Diddley‘s Who Do You Love?. Their self-titled debut album (1969) was also a hit, though it stopped just shy of the Top 40.\n\nWithin months, Ray Owen left the group to try his hand at a solo career. He was replaced by Paul Williams (ex-Zoot Money’s Big Roll Band). Hubbard and Dobson also departed, being replaced by Micky Moody and Rod Coombes respectively.\n\nTheir second album, Lie Back and Enjoy It, was released in 1970 and contained a hit single in Pretty Woman (not the Roy Orbison song).\n\nAnother bassist, Jim Leverton, assumed Ellis’ duties for the follow-up, 1971’s Get a Whiff A This.\n\nThe constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes, exiting prior to the fourth Juicy Lucy album, 1972’s Pieces.\n\nThis was recorded by a makeshift lineup of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter. Micky Moody later joined the inaugural Whitesnake line-up in 1978.\n\nFounder member Ray Owen revived the name in 1995 for the album Here She Comes Again with Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums) rounding out the band.\n\nA couple of years later this version of the band broke up but Owen wanted to keep on going, especially when he formed a musical partnership with a guitarist known as Mr Fish.\n\nLegal problems kept the new band from using the Juicy Lucy name, so they gigged as Ray Owen’s Moon (Moon being the title of Ray Owen’s 1971 solo album).\n\nBy 2004 bassist Fudge and drummer Fletch had joined the band and the legal issue was settled. The new Juicy Lucy spent 2006 working on a new album (subsequently titled Do That And You’ll Lose It), and touring the UK with fellow rock veterans Nazareth.\n\nThe band is still touring in the UK, fronted by Mr Fish. Ray Owen performs occasionally as Ray Owen’s Juicy Lucy, accompanied by Mike Jarvis and Spencer Blackledge from the ’90s incarnation of the band.\n\nRay Owen\n\nVocals\n\nGlenn ‘Fernando’ Campbell\n\nPedal steel guitar, mandolin, vocals\n\nChris Mercer\n\nSaxophone, keyboards\n\nNeil Hubbard\n\nGuitar\n\nKeith Ellis\n\nBass, vocals\n\nPete Dobson\n\nDrums\n\nPaul Williams\n\nVocals\n\nMicky Moody\n\nGuitar\n\nRod Coombes\n\nDrums\n\nJim Leverton\n\nBass\n\nJean Roussel\n\nKeyboards\n\nAndy Pyle\n\nBass\n\nRon Berg\n\nDrums\n\nMike Jarvis\n\nGuitar\n\nAndy Doughty\n\nBass\n\nSpencer Blackledge\n\nDrums\n\nMr Fish\n\nGuitar\n\nFudge\n\nBass\n\nStephen ‘Fletch’ Fletcher\n\nDrums"}, {"url": "https://blues.gr/profiles/blogs/an-interview-with-legendary-micky-moody-of-juicy-lucy-snafu", "page_content": "\"If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\" Micky Moody: Mr. Rock n' Roll Guitar\n\nMicky Moody is best known for his role in the definitive Whitesnake line-up, though his vast and varied career was spawned out of a sixties school band which also included another future star, Free and Bad Company singer Paul Rodgers. Micky quickly graduated to the recording studios via the R&B combo Tramline before touring Britain and Europe with some of the countrys top soul musicians.\n\nJoining the highly acclaimed Juicy Lucy was a large step towards rock stardom, and major tours of Britain, Europe and the USA accompanied a regular output of recorded works. After Juicy Lucy split, Micky co-founded Snafu, combining his rock-style guitar with down-home stateside grooves, and became a major contributor on the song-writing front. Snafu recorded three albums and toured extensively before the individual members headed off to pursue their different ventures. Micky then became engrossed in session work as his reputation as a versatile performer spread. Soon a phone call from David Coverdale assured Micky of a vital place in his future plans, starting with the guitar slot and co-writing position on his forthcoming solo albums, Whitesnake and Northwinds.\n\n\n\nAs a sideman, Micky has featured alongside such classic British singers as Graham Bonnet, Frankie Miller, Chris Farlowe, Sheena Easton, Roger Chapman, Elkie Brookes and Eric Burdon. Visitors from the states such as Meat Loaf, Matt guitar Murphy, Ben E. King and Walter Trout have all employed his talents to enhance their performances.\n\nMicky's session work has included many T.V. commercials and some film scores. As a writer or co-writer his credits are numerous and include many of the classic Whitesnake favourites. With the Moody Marsden band, he and his guitar sparring partner Bernie Marsden toured extensively and released four albums before continuing their Whitesnake legacy with the Snakes and the Company of Snakes.\n\nIn 2000 Micky finally released his first solo album I Eat Them For Breakfast on Armadillo records.\n\n\n\n\n\n\n\nInterview by Michael Limnios\n\n\n\n\n\nWhat was the first gig you ever went to & what were the first songs you learned?\n\nAs a child I was taken by my parents to a Christmas pantomime where the special guests were Cliff Richard and the Shadows. I was aware of their music and, like a lot of youngsters who took up the guitar in the early 1960's, I was especially drawn to the playing of Hank Marvin. I went to private guitar lessons from the age of twelve, so the first tunes I learned to play where from guitar tutor books.\n\n\n\n\n\nWhich was the best moment of your career and which was the worst?\n\nGetting my first gold album (Ready an'Willing - Whitesnake) was a great moment. Playing onstage with Eric Clapton was also special.\n\nThe worst was performing with Snafu at the huge Roosevelt Stadium in New Jersey supporting Emerson Lake & Palmer. It was the ugliest drink and drug-sodden atmosphere I have ever experienced. We should never have supported ELP, this was not our audience and our management were to blame. We had to leave the stage because of the abuse, and also to avoid the missiles that were thrown at us from a truly dystopian gathering.\n\n\n\n\n\nWhat do you learn about yourself from music? What experiences in your life make you a GOOD musician?\n\nI believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\n\n\n\n\n\nFrom whom have you have learned the most secrets about blues rock music & in which songs can someone hear the best of your work?\n\nI loved the Jeff Beck Group with Rod Stewart on vocals. They could take blues and soul songs and heavy them up, and some of their originals songs sounded very inspired. Beck played like nobody else, and still does. I'm also a fan of American guitarist Harvey Mandel, especially the stuff he did in the late 6o's-early 70's and, of course, Eric Clapton in Cream. Blues rock slide? Early Johnny Winter; Duane Allman; Lowell George; Ry Cooder; Zoot Horn Rollo; Sonny Landreth, and Glenn Ross Campbell's steel playing.\n\nI think I improved with age! Some of my best playing is on my solo albums 'I Eat Them For Breakfast' and 'Don't Blame Me'. I was more in control of my own destiny on those albums.\n\n\n\n\n\nWhat characterizes your “philosophy” about the music?\n\nI've always been fascinated by the number of different styles of music that you can coax from the guitar. I'm known primarily as an electric guitarist but I have always loved the natural sound of acoustic music. I've discovered a lot of open tunings throughout the years, and different types of right-hand picking techniques from pick and fingers, thumpick and fingers and flesh (no picks at all). In the last few years I have written and produced two instrumental albums: 'Acoustic Journeyman' and 'Electric Journeyman'. Although I've been involved in a lot of song writing over the years, playing the guitar is still my main passion. People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\n\n\n\n\n\nWhy did you think that Micky Moody, continues to generate such a devoted following?\n\nI don't know if I have a devoted following! Maybe people appreciate that I've never been afraid to attempt different styles and that I try to express a range of emotions when I play.\n\n\n\n\n\nWhat is the “thing” you miss most from the Tramline? Which memory from the Wildflowers makes you smile?\n\nTramline: I was only seventeen at the time, in great health with my whole life ahead of me. Yes, I miss that feeling! The Wildflowers: Traveling to London with the other three guys in an old van fitted-out with bunk beds; we were so dedicated!\n\n\n\n\n\nTell me about the beginning of Juicy Lucy. How did you get together and where did it start?\n\nJuicy Lucy's Singer Paul Williams had seen me perform in Tramline, Lucas and the Mike Cotton Sound and Zoot Money's band. He must have been impressed because when Neil Hubbard left Juicy Lucy to join the Grease Band he suggested me to the other guys. They were rehearsing at a house in the countryside so I went and rehearsed with them and got the job.\n\n\"I believe the special 'something' that differentiates a good musician from a not-so-good musician is natural ability; you either have it or you don't. Practice, dedication, experience and inventiveness helps too!\"\n\nWhat are some of the most memorable stories you've had from Juice Lucy?\n\nSoon after I joined Juicy Lucy we flew to the United States for a tour which lasted for nearly a month. It was my first time in America and suddenly I was looking at things and visiting places I'd only seen on television. New York: we played at the legendary Fillmore East supporting Cactus and Lee Michaels; visited Atlantic's famous recording studio where Roberts Flack was recording with some of the greatest session musicians in the US (including the great Bernard 'Pretty' Purdie on drums). The Fillmore West, San Francisco where we supported Elton John and The Kinks, and looking out on a warm November day at Alcatraz Prison and the San Francisco Bay. Los Angeles: two or three nights at the Whiskey A Go- Go, staying at the Tropicana Hotel - Californian groupies! Boston: two nights at the Boston Tea Party supporting Leon Russell and Elvin Bishop - both had great bands. Went to Chicago and Madison WN too.\n\nLots of touring, especially in Germany, and taking over as lead guitarist when members from the original line-up quit. It was all great experience!\n\n\n\n\n\nAny comments about your experiences with Chris Farlowe, Roger Chapman & Bernie Marsden? Would you like to tell your best memory about them?\n\nI was aware of Chris and Roger from my teens back in the north of England. Chris Farlowe and the Thunderbirds featured Albert Lee on guitar which was a real bonus for us guitar players. Tramline supported Family on a club date so I got see them live; Roger singing in that unusual fashion over very original-sounding songs. So it's been a thrill to actually work with them. Other great singers I've worked on stage with include Frankie Miller, Graham Bonnet, Gary Brooker, , Paul Rodgers in the Roadrunners/Wildflowers and David Coverdale in Whitesnake. Bernie and I developed a special understanding as dual guitarists, firstly with Whitesnake, then with the Moody Marsden Band. It had very little to do with Wishbone Ash or Thin Lizzie, and was influenced by the 60's British Blues players and American Southern Rockers like the Allman Brothers and Lynyrd Skynyrd.\n\nWould you mind telling me your most vivid memory from Snafu?\n\nSee above! On a more positive note, recording the first album at the Manor Studios. We had a nice, tight funky thing going on in the early days.\n\n\"People sometimes ask me what is my favourite kind of music, and my answer is always \"Good music!\" If possible, always play the kind of music that stimulates your emotions, and try to keep an open mind.\"\n\nDo you remember anything interesting stories from Whitesnake?\n\nI have an incredible amount of interesting stories from my days with Whitesnake. How many weeks do you have to listen to them?!! It's impossible to pick out a few as there were so many. I had some of the best times of my life - it was the 70s, totally politically-incorrect, sexy and indulgent. That's all I'm saying!\n\n\n\n\n\nHow did you first meet John Mayall, do you remember anything interesting from touring with him?\n\nI was still in London after the breakup of the Wildflowers (1967) and Bruce Thomas, the bass player, discovered where John Mayall lived. Although I'd already decided that I would move back to my home town and spend some time studying the classical guitar, Bruce wanted to progress in the blues scene. We took the tube train to Paddington Station and walked a few blocks to Mayall's flat, which was at the top of a house close to the station. He had no idea who we were but was kind enough to invite us up to his flat, where his new guitarist Mick Taylor sat listening to blues albums. Bruce gave him his number for future reference and we had a nice cup of tea!\n\nI met him again the following year when Tramline supported his 'Crusade' band at the Marquee Club in London. In the spring of 1970, when I was playing with Zoot Money, we supported him and his drummer-less band on a number of shows on his British tour. His line-up was very odd: Jon Mark on nylon-strung guitar; Johnny Almond on Saxophones and Alex Dmochowski on bass. He seemed like quite a private, laid-back person.\n\n\"Being in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\"\n\nHow has the music business changed over the years since you first started in music?\n\nI was very lucky to have started my career in the Sixties and to have developed it in the Seventies. There was very little in the way of entertainment for the masses apart from music, TV (very limited those days) and film, and most people went to gigs and bought records. The opportunities were immense, unlike today were the public have so much choice, most of it available through the internet or multimedia. Recorded works and live performances were treated with respect and giving things for free, or worse, having them pirated, was rarely an option. I also think that, in some regards, technology has made the art of creating and performing music too accessible and instantaneous. If utilized correctly technology can be put to good use, but practice and dedication to one's instrument will always produce the better musician.\n\n\n\n\n\nWhy do you think that the blues doesn’t quite get the recognition and respect that other genres seem to get? Give one wish for the BLUES\n\nI'm not sure I agree with your opinion! I think that after pop and rock, blues is one of the most accepted forms of music to be embraced by a wide audience. Long may the Blues continue!\n\n\"I would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\"\n\nWith such an illustrious career, what has given you the most satisfaction musically?\n\nBeing in a position to enjoy playing the guitar professionally, working with hundreds of talented people, writing songs and instrumentals pieces, and being able to afford good instruments.\n\n\n\n\n\nWhat is the difference and similarity between the LIVE/GIG and the STUDIO feeling? And between your session projects, solo albums and the band’s recording?\n\nThere's obviously a big difference between playing live and playing in a recording studio; some people excel in one and struggle with the other. I think that for most people, playing live is their raison d'etre, whilst the recording studio is a workshop within which you can create. I've been lucky enough to have had a lot of experience in both, some experiences turning out better than others. Playing live, there is (hopefully) an atmosphere created by both performers and audience, whereas you have to create an atmosphere in a studio - and concentrate - you have to live with the results!\n\nI'm in control of my own projects so I'm responsible for the outcome. On sessions you have to try and make the artist/producer comfortable and pleased with your efforts. I'm involved in a new band called Snakecharmer and we're all very experienced - watch out for us!\n\n\n\n\n\nAre there any memories from the US tour “Best of British Blues”, which you’d like to share with us?\n\nUnfortunately the 'Best of British Blues' tour of 1996 was memorable for the wrong reasons. The line-up consisted of featured artists Eric Burdon and Alvin Lee, and the band was Aynsley Dunbar, Boz Burrell, Tim Hinkley and myself. I don't like to talk ill of the dead, but Boz created problems right from the first gig; he was unhappy with the promoter and seemed uncomfortable with the personnel. Halfway through the tour he went to pieces and couldn't continue, so Aynsley suggested Tony Franklin who'd played with bass with The Firm (Paul Rodgers/Jimmy Page). The band then seemed to split into two camps: Burdon, Dunbar and Franklin, and Lee, Hinkley and Moody. Eric Burdon thought that his guitarist should come to the House of Blues in L.A. and perform on stage with us just to show me how it should be done! What a fucking insult! Alvin sensed the vibes and a couple of gigs later he booked a plane home. We didn't even finish the tour. There were some good moments, but overall, definitely one to forget!\n\n\n\n\n\nIf you go back to the past what things you would do better and what things you would avoid to do again?\n\nI would give more thought to the business side of things; there are a lot of smiling assassins out there who have no second thoughts about taking things that do not belong to them - usually money.\n\n\n\nMicky Moody - Official website\n\n\n\n\n\n"}, {"url": "https://alchetron.com/Juicy-Lucy-%28band%29", "page_content": "Get a Whiff a This, Lie Back and Enjoy It , Juicy Lucy, Do That and You'll Lose It, Who Do You Love: The Anth\n\nJuicy Lucy is a British blues rock band officially formed on 1 October 1969. After the demise of The Misunderstood , Juicy Lucy was formed by vocalist Ray Owen, steel guitarist Glenn Ross Campbell , and prolific Blackburn saxophonist Chris Mercer. The group later recruited guitarist Neil Hubbard , bassist Keith Ellis , and drummer Pete Dobson.\n\nCareer\n\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley composition \"Who Do You Love?\" Their self-titled debut album then fell just shy of the Top 40 in the UK Albums Chart. The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.\n\nLine-up changes ensued, as former Zoot Money singer Paul Williams (born Paul William Yarlett, 1940), guitarist Micky Moody, and drummer Rod Coombes replaced Owen (who joined Killing Floor, before embarking on a solo career), Hubbard, and Dobson prior to the recording of 1970's Lie Back and Enjoy It (#53 - UK Albums Chart). In May 1970, the band appeared at the annual NME poll-winners concert. Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This. In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.\n\nThe constant turnover took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces. This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter.\n\nMicky Moody was a member of Snafu between 1973 and 1976, and he later joined the inaugural Whitesnake line-up in 1978. A 1996 album called Blue Thunder was released under the Juicy Lucy name by Paul Williams and Micky Moody, featuring guest musicians Mick Taylor and Andy Summers. Moody and Williams also released an album called Smokestacks, Broomdusters and Hoochie Coochie Men in 2002.\n\nJuicy Lucy's version of the song \"Who Do You Love?\" was subsequently featured in the video game Shellshock: Nam '67.\n\nIn 1995, Ray Owen resurrected the band's name and recorded the album Here She Comes Again. The line-up for this recording also included Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums). This version of the band broke up in 1997, but Owen persevered and joined up with guitarist Steve Fish. Although legal problems would not allow them usage of the name Juicy Lucy, the outfit performed as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\nIn 2004, bassist Colin Fudge and drummer Paul Fletcher joined the band, after the legal situation had been resolved. This version of Juicy Lucy released the album Do That And You'll Lose It in 2006 and toured the UK with Nazareth. They played at the Cambridge Rock Festival in 2007.\n\nIn 2009, a new line-up of Juicy Lucy was formed as - due to health problems - Owen was unable to continue touring on a regular basis. The band was then fronted by singer/guitarist Steve Fish, with Paul Fletcher on drums and James Morris on bass, and this line-up continued to tour throughout the UK. In September 2012, Frank Cokayne (on bass guitar) joined Fish and Fletcher in the UK-based version of the band. In March 2013, Cokayne was replaced by Michael Phillips. The songs \"Mississippi Woman\" and \"Who Do You Love?\" (from the band's first album) are still performed live by this trio.\n\nOwen now occasionally plays live in France under the moniker \"Ray Owen's Juicy Lucy\", accompanied by Mike Jarvis and Spencer Blackledge from the 1990s incarnation of the band. He also performs solo acoustic sets around the UK, including regular engagements at the Lewes Con Club.\n\nAlbum discography\n\n1969 - Juicy Lucy (Vertigo)\n\n1970 - Lie Back and Enjoy It (Vertigo)\n\n1971 - Get a Whiff a This (Bronze)\n\n1972 - Pieces (Polydor)\n\n1974 - The Best of Juicy Lucy (Island Records) (Compilation album)\n\n1991 - Who Do You Love - The Best of Juicy Lucy (Anthology) (Compilation album)\n\n1995 - Here She Comes Again\n\n1996 - Blue Thunder\n\n1998 - Pretty Woman (Compilation album)\n\n2005 - Raiding the Fruit Bowl (EP)\n\n2006 - Do That And You'll Lose It\n\n2010 - Rock Hits Collection (Compilation album)"}, {"url": "https://www.liquisearch.com/juicy_lucy_band/career", "page_content": "Career\n\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley perennial \"Who Do You Love?\" Their self-titled debut album then fell just shy of the Top 40 in the UK Albums Chart. The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.\n\nLine-up changes were quickly afoot as ex-Zoot Money singer Paul Williams, guitarist Micky Moody, and drummer Rod Coombes replaced Owen (who exited for a solo career), Hubbard, and Dobson for 1970's Lie Back and Enjoy It (#53 - UK Albums Chart). In May 1970, the band appeared at the annual NME poll-winners concert. Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This. In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.\n\nThe constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces. This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter.\n\nMicky Moody (born 30 August 1950, in Middlesbrough), later joined the inaugural Whitesnake line-up in 1978. Before then he was a member of another rock outfit Snafu between 1973 and 1976. Moody also released the bluesy solo album I Eat Them For Breakfast in 2001. Plus, Juicy Lucy's version of the song \"Who Do You Love?\" was featured in Shellshock: Nam '67.\n\nFounder member Ray Owen revived the name in 1995 for the album Here She Comes Again which found Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums) rounding out the band. A couple of years later this version of the band broke up but Owen wanted to keep on going, especially when he formed a musical partnership with a guitarist known as Mr. Fish. Legal problems kept the new band from using the Juicy Lucy name, so they gigged as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\nBy 2004, bassist Fudge and drummer Fletch had joined the band and the legal issue was settled. The new Juicy Lucy spent 2006 working on a new album (subsequently titled Do That And You'll Lose It), and touring the UK with fellow rock veterans Nazareth.\n\nThey played the Cambridge Rock Festival in 2007. The link with the past though is not forgotten, and the modern day Juicy Lucy still plays \"Mississippi Woman\", \"Who Do You Love?\" and more from their first album. In 2009, a new line up formed as, due to health problems, Owen was unable to continue on a regular basis. The band is now fronted by singer/guitarist Mr Fish, Fletch (drums) and James (bass), and is still touring the UK. Owen now performs occasionally as Ray Owen's Juicy Lucy, accompanied by Mike Jarvis and Spencer Blackledge from the 1990s incarnation of the band. As of September 2012 Frank Cokayne (previously the driving force behind Brighton Southern Rockers \"Under The Gun\") will provide bass guitar."}, {"url": "https://www.wikilogy.com/biography/micky-moody/", "page_content": "Micky Moody is an English musician, best known as a guitarist. He has played with a wide range of artists, including The Tornados, The Moody Blues, Juicy Lucy, and Nazareth. Micky Moody was born in Middlesbrough, North Yorkshire, England on 30 August 1950. He started playing guitar at the age of 12, and by the time he was 18, he was playing in local clubs. In 1969, Moody joined The Tornados, who were then the UK's leading instrumental group. He played on their final album, \"The Last of the Tornados\", and also toured with them. In late 1969 You might be interested to know more about Micky Moody. So, in this article, we discussed all information about Micky Moody's net worth, wiki, bio, career, height, weight, family, pics, affairs, car, salary, age, and other details in 2023. So let's get started...\n\nMicky Moody Biography\n\nMicky Moody\n\nDo you wanna know Micky Moody's full Biodata? Micky Moody, also known as Michael Joseph Moody is a Guitarist. He was born in Middlesbrough, North Yorkshire, England, UK on August 30, 1950. He is 73 years old. Take a look at the following table for more information.\n\nName Micky Moody Nickname Michael Joseph Moody Gender Male Date of Birth 30-Aug-1950 Age in 2023 73 Birth Place Middlesbrough, North Yorkshire, England, UK Country England Nationality English Height None (m) Weight Unknown (KGs) Profession Guitarist Famous as Musician, Songwriter, Author\n\nYou may also like>\n\nMicky Moody Net Worth, and Salary 2023\n\nWhat is the Networth of Micky Moody? What is the income source of Micky Moody? We all know that is it almost impossible to say someone's total asset, and how much he or she earns every month. According to the various source, there is an approximate asset that is net worth. So what is the networth of Micky Moody? As of 2023, the current net worth of Micky Moody is $1.5 Million.\n\nMicky Moody Age, and Birthday Info 2023\n\nHow old is Micky Moody? In this section, we will talk about Micky Moody's age, and birthday-related info. Micky Moody's actual age is 73, and his birthday is on 30-Aug-1950. When is Micky Moody's next birthday? The next birthday of Micky Moody is on 30 August, 2023.\n\nBirthday August 30, 1950 Name of the Day Wednesday Zodiac Sign (Horoscope) Virgo Next Birthday 30 August, 2023 Age in 2023 73 years Place of Birth Middlesbrough, North Yorkshire, England, UK Country of Birth England\n\nMicky Moody's Height, Weight, and Physical Condition\n\nWhat is the physical condition of Micky Moody? The physical condition of Micky Moody is good. How tall is Micky Moody? Want to know Micky Moody's Height Weight in Feet-Inch or Meter-Centimeter? In this section, we discussed his height-weight along with his eyes and hair colors. His height is Not known, and weight is Unknown.\n\nMicky Moody's Height: Not known\n\nMicky Moody's Weight: Not known\n\nIn the below table, you will find the height of Micky Moody in Meter, Centimeter, and Feet Inche, & the weight in KG and Pound.\n\nHeight In Centimeters: Not known\n\nIn Meters: Not known\n\nIn Feet Inches: Not known Weight In KG: Not known\n\nIn Pound: Not known Eye Color - Hair Color -\n\nRead also: Mie Sonozaki Net Worth, Age, Height, Weight, Husband, Wiki, Family\n\nMicky Moody Girlfriend and Marital Status\n\nDo you want to know whether Micky Moody is married or unmarried? Who is the Girlfriend of Micky Moody? In this section, we will talk about Micky Moody's personal life, life story. As you are curious to know about Micky Moody. We added the information below.\n\nMarital Status Yet to update\n\nMicky Moody Educational Qualifications\n\nDo you want to know what is the educational qualifications of Micky Moody? In this table, we added the education information of Micky Moody. As we do not have all data currently, we keep some fields blank which we will update soon.\n\nSchool Yet to update College Yet to update University Yet to update\n\nMicky Moody Facebook Instagram Twitter and YouTube\n\nVisit the official Facebook, Instagram, Twitter, Wikipedia, and YouTube accounts of Micky Moody. For those who do not have an account on a certain platform, we added the official website link of the platform.\n\nFAQs about Micky Moody\n\nSome FAQs (Frequently Asked Questions) about Micky Moody.\n\nWhat is the Net Worth of Micky Moody?\n\nThe Net Worth of Micky Moody is $1.5 Million.\n\nWhat is the Height of Micky Moody?\n\nThe height of Micky Moody is None.\n\nWhere is the birthplace of Micky Moody?\n\nThe birthplace of Micky Moody is Middlesbrough, North Yorkshire, England, UK\n\nWhat is the Date of Birth of Micky Moody?\n\nThe birthday of Micky Moody is on 30-Aug-1950.\n\nIs Micky Moody Married?\n\nThe marital status of Micky Moody is: Yet to update.\n\nConclusion\n\nSo that's all we have about Micky Moody's net worth, bio, wiki, biography, height, weight, awards, facts, siblings, awards, and other information. We hope you get the information about Micky Moody. Share your thoughts in the comment section.\n\nDisclaimer\n\nThe info about Micky Moody's net worth, wiki, bio, career, height, weight, family, affairs, car, salary, age, and other details are based on Wikipedia, IMDb, Forbes, Instagram, and Facebook of Micky Moody. There may have wrong or outdated info, if you find so, please let us know by leaving a comment below."}, {"url": "http://www.alexgitlin.com/juicy.htm", "page_content": "Week of March 29, 1997\n\nJuicy Lucy\n\nWho was the mysterious Juicy Lucy? Glenn 'Fernando' Campbell was always meaning to tell me. The cheerful dude in the big hat who played the steel guitar loved to keep everyone guessing and he never revealed his secret. At least - not to me. But Lucy was doubtless one of those ladies of the road, who lubricated the wheels of rock, if you'll pardon the phrase. Musically speaking Juicy Lucy, the band that bore her name, was one of the most respected outfits to come howlin' and wailin' out of the Sixties' blues boom. They had style and class. They also had some of the finest musicians of the day, ready to rock and eager to tour. Their debut album 'Juicy Lucy' (Vertigo), released in 1969 became famous for its notorious gatefold album sleeve, depicting a plump, naked lady covered in grapes, bananas and a half consumed melon. Not a pretty sight, but once seen, never forgotten.\n\nDespite their dramatic launch and excellent credentials, the band never quite made it into the international super league. They had a Top Twenty hit in 1970 with their version of Bo Diddley\u0092s \u0091Who Do You Love\u0092 and a subsequent hit with \u0091Pretty Woman\u0092. Glenn was filmed in action with the band for the rock movie 'Supersession' and Juicy Lucy went on to record several more albums for Vertigo, Polydor and Island, including 'Lie Back And Enjoy It', 'Pieces' and 'Get A Whiff Of This', before they finally broke up in 1972. Juicy Lucy underwent considerable line up changes during this turbulent period. The band featured on 'Pieces' provides revealing aspects of a fascinating saga which began when Glenn Campbell first arrived in Britain from the States, and ended with the final version of Juicy Lucy, fronted by guitar legend Micky Moody.\n\nThe roots of Juicy Lucy lay way back in The Misunderstood, a band championed by both the author of these notes and the lugubrious, mild mannered Radio One DJ John Peel. The reasons for this enthusiasm lay in the fact that Glenn Campbell was not just a fine musician who played a pedal steel guitar with great gusto. He was an American in London and thus seemed closer to the source. He was also very funny and entertaining, and liked a glass of English beer. His laid back sense of humour provided a welcome contrast to the attitude of many British blues practitioners, who seemed to imagine that you had to undergo some sort of private hell and spread a message of unrelenting gloom to be considered a true blues man!\n\nThe original Misunderstood was formed in 1966 and reformed for its trip to England. They made two singles for Fontana including 'Children Of The Sun,' and featured good looking young singer Steve Hoard. However the Misunderstood were eventually superseded by a more commercial Juicy Lucy. The first Lucy lineup included Ray Owen (vocals), Glenn Campbell (steel guitar, mandolin and vocals), Neil Hubbard (guitar), Chris Mercer (saxophone, and piano), Keith Ellis (bass and vocals) and Pete Dobson on drums. The band was managed by Nigel Thomas who also looked after the affairs of Joe Cocker. A controversial but energetic music biz figure, Nigel died of a heart attack a couple of years ago. Micky Moody (born August 30, 1950), who is featured on the present album, remembers seeing the first version of the band on the road. 'The band was virtually formed around Glenn and everyone remembers their first album cover with the lady covered in fruit! I think her name was Zelda Plum. It was a great album and I remember seeing the band in action at their early gigs.\u0092\n\nMoody is from Middlesborough. He went to school with Paul Rodgers who later came to fame with Free and Bad Company. Micky and Paul formed a band at school called The Roadrunners which became The Wild Flowers when they moved to London in 1967 and 'starved to death in our caftans!' Micky later went home to study classical guitar while Paul Rodgers met Paul Kossoff and Simon Kirke and formed Free. Says Moody: 'I went back to the North East and was asked by a local club owner and singer called John McCoy to help form a blues band called Tramline.' The singer was friendly with record boss Chris Blackwell and the band released two albums on Blackwell's Island label. In March 1969 Moody auditioned for Lucas & The Mike Cotton Sound, a well known soul band. He got the gig, but switched to Zoot Money's band for a few months in 1970. He'd got to know Zoot's regular singer Paul Williams, who by this time had joined Juicy Lucy. Micky was brought up to date on all the latest Juicy gossip. 'Ray Owen had been sacked after a couple of months and Paul had got the gig. He told me Neil Hubbard was leaving and asked if I'd like to join on lead guitar. I said, 'Great!' I went straight into recording the album 'Like Back And Enjoy It.' We were gigging all the time and became particularly popular in Germany where the band was very respected.\"\n\nHowever it proved increasingly difficult to break out of the club circuit, and reach a higher level of acceptance. \"We made another album 'Get A Whiff Of This' before the group finally disintegrated in 1971.' Glenn Campbell went back to America, apparently disillusioned, but during their time together the, Campbell/Moody guitar partnership had worked well. \u0091It was good because we didn't get in each other's way. I liked Glenn's playing and did a bit of slide guitar myself, using the bottle neck. Yes I remember Glenn wearing his big hat. But we all used to do that, it was quite trendy at the time!\u0092\n\nDespite the defection of the mainman, Paul Williams wasn't ready to give up. \u0091Paul said he wanted to keep the band together. He wanted me to be the lead guitarist and also play bottle neck slide and the band kind of reformed. We had the famous rhythm section of Ron Berg and Andy Pyle from Blodwyn Pig. The line-up varied from time to time and Bernie Marsden actually came down for a blow. We were looking for another player because we wanted twin guitars. I'd been promoted to lead and we needed a rhythm player to get that American funky sound, without being too heavy. Bernie came down, but he was wrong for the job, as he was more in the Clapton vein.\u0092\n\nThe third and final version of Juicy Lucy remained functional between July 1971 and June 1972. Rhythm player Dave Tedstone worked with them for a while but the line up on 'Pieces' mainly featured Paul Williams (vocals), Micky Moody (guitar), Jean Roussel (keyboards), Ron Berg (drums) and Andy Pyle (bass). Later Paul Williams would depart to join Jon Hiseman's Tempest, Jean Roussel worked with Cat Stevens and the rhythm section defected to Savoy Brown. Juicy Lucy's style meanwhile had begun to move away from the more predictable blues sound.\n\nSays Micky: \u0091The music had a more mellow edge to it. We got a deal with Polydor to record the 'Pieces' album which was produced by Bruce Rowlands, drummer with the Grease Band.'\n\nIt was recorded at Olympic Studios, Barnes in December 1971. Most of the songs were written by Paul and a lyricist friend of his called John Edwards. There were a few guests on the album. Albert Lee and Chas Hodges were on backing vocals and Ian McLagan from the Small Faces and Mick 'Wynder K. Frogg' Weaver were on keyboards. Incidentally those two guys have been working together again on albums in Los Angeles.\u0092 'Pieces' is packed with good performances and kicks off with a rousing version of Chuck Berry's 'Promised Land' intended as a tribute to the master. \u0091Although it was mainly a mellow album we wanted to show we could still play rock'n'roll,\u0092 says Micky. \u0091The next song, 'Cuckoo', was one we'd head on a Taj Mahal album called 'Natch'l Blues.' This showed the kind of West Coast influence on the band.\n\nWe really liked Taj Mahal and Ry Cooder. 'It Ain't Easy' was a song Zoot Money wrote and passed on to Paul, and 'Suicide Pilot' was a Williams/Edwards original and a good rock'n'roller. Some of the songs have early Seventies' style lyrics, like 'Dead Flowers In The Mirror' which I recall was a bit of a country spoof! The final cut 'How Can A Poor Man Stand These Times' was taken from Ry Cooder's first album and was written by a blues singer called Alfred Reed. Did the album do very well? I don't think so I haven't been paid for it!' The band virtually split up not long afterward the album was released in the summer when Paul left to join Tempest. Yet the band struggled on with Frankie Miller for a couple more gigs and Bobby Harrison also sang for a while.\n\nWe tried to get Frankie Miller into the band but his management said 'no.' Then Bobby said he had a management deal and asked if we'd like to form a band with him. So we formed a new band called SNAFU and in 1972 we toured with Joe Cocker in Europe and did some gigs with Slade. But as Nigel Thomas, our manager, was looking after Joe Cocker, we sort of got pushed to the background. At one point I was asked to join Boxer with Mike Patto but didn't really fancy that, so I teamed up with Bobby Harrison and that was the end of Juicy Lucy.\u0092\n\nIt was a sad end to a band which had started out with such promise, and high hopes.\n\nAmazingly, despite all the line up changes and shifts in musical direction, the band's name alone could still command strings of college and club gigs right up to the end, such was the demand for 'live' music in those days. Subsequently, Moody did three albums with SNAFU. After they disbanded in 1976, Moody returned to session work and in that role backed singers Graham Bonnett, Frankie Miller, Chris Farlowe, Sheena Easton, Eric Burdon and Roger Chapman. In the mid-seventies, David Coverdale asked him to work on a project that became the first Whitesnake album. Micky played lead guitar on the album, contributed four songs and subsequently toured the world with Whitesnake.\n\nMoody has also recorded with Bob Young ('Young And Moody' album recently reissued on Repertoire) and worked with Bernie Marsden in the Moody Marsden Band. Recently Moody has reunited with Paul Williams to sing in a new band called Blue Thunder. No doubt, when the last punters have left and it\u0092s time for a drink at the bar, reminisce and they swap tales of the days when Juicy Lucy was on the loose!\n\nChris Welch , London 1997\n\nTaken from the liner notes to the 1997 Repertoire reissue of Juicy Lucy \" Pieces \" (1972) album, REP4644-WY\n\nPersonnel :\n\nLoughty Amao - Percussion\n\nGlenn Campbell - Guitar, Vocals\n\nPete Dobson - Drums\n\nKeith Ellis - Bass\n\nNeil Hubbard - Guitar\n\nChris Mercer - Sax, Keyboards\n\nRoy Owen - Vocals\n\nRod Combes - Drums\n\nMick Moody - Guitar\n\nPaul Williams - Vocals, Keyboards, Percussion\n\nJim Leverton - Bass\n\nRon Berg - Drums\n\nAndy Pyle - Bass\n\nJean Roussel - Keyboards\n\nAlbums :\n\nJuicy Lucy (Vertigo VO 2) 1969 (also released on Atco in the US)\n\nLie Back And Enjoy It (Vertigo 636 014) 1970\n\nGet A Whiff Of This (Bronze ILPS 9157) 1971 (also released on Atco in the US)\n\nPieces (Polydor 2310 160) 1972\n\nHere She Comes Again (1995)\n\nBlue Thunder (1997)\n\nThere's also a compilation, \"Who Do You Love?\" (Sequel NEXLP 105) 1990, also available on CD (Sequel NEXCD 105) 1990. The first two albums have been reissued on CD (BGO Records BGO 279) 1995.\n\n45s :\n\nWho Do You Love?/Walking Down The Highway (Vertigo V1) 1970\n\nPretty Woman/I'm A Thief (Vertigo 6059 015) 1970\n\nIt Ain't Easy/Promised Land (Polydor 200 1279) 1972\n\nReissue :\n\nWho Do You Love?/Chicago North Western (Bronze BRO 72) 1979\n\nSteel guitarist, Glenn Fernando Campbell, was the star behind this band. He'd joined them from The Misunderstood. Their vinyl zenith is usually considered to be their first album which contained a number of tight, well constructed songs, including a fine cover of Bo Diddley's \"Who Do You Love?\", which also took them into the 45 charts. It came on the now big collectable spiral Vertigo label in an attractive gatefold sleeve. Sadly it was downhill thereafter, their fortunes were hardly helped by several personnel changes. Paul Williams, ex-Zoot Money, came in on vocals, replacing Roy Owen on the second album, but the result was a disappointment. None of the original line-up survived for their fourth and final effort, \"Pieces\". The line-up for this included Andy Pyle, whilst he took a brief break from Savoy Brown. The final verdict must be that they failed to achieve their early promise.\n\nThe Sequel compilation also includes a couple of previously unissued tracks, \"I'm A Thief\" and \"Changed My Mind, Changed My Sign\". The Vertigo Annual 1970 included their own composition, \"Mississippi Woman\".\n\nSource: The Tapestry of Delights - The Comprehensive Guide to British Music of the Beat, R&B, Psychedelic and Progressive Eras 1963-1976, Vernon Joynson\n\nISBN 1 899855 04 1\n\nTo Ray Owen's Juicy Lucy Web Site\n\nBack to Alex's Home Page"}, {"url": "https://rawkbawx.rocks/details.php?id=af951d15bc444b6b17570f88a7238fc8c5ef0423", "page_content": "\n\nRockbox Search Search Active Torrents\n\n\n\n\n\n\n\nIrc Channel info\n\nWebIRC Login irc.p2p-network.net\n\n#rockbox\n\nMirc link Come Join Us\n\nTorrent's details Page Links: Other Torrents - Comments File Name: [Request] Juicy Lucy - Full-Length Discography (1969-2006) Download Torrent: [Request] Juicy Lucy - Full-Length Discography (1969-2006) Description: Blues rock from the United Kingdom, full-length discography of seven albums released between 1969 and 2006.\n\n\n\n\n\n\n\n\n\n\n\nJuicy Lucy is a blues-rock band officially formed on 1 October 1969. After the demise of The Misunderstood, vocalist Ray Owen, steel guitarist Glenn Ross Campbell, and saxophone player Chris Mercer formed Juicy Lucy. The group later recruited guitarist Neil Hubbard, bassist Keith Ellis, and drummer Pete Dobson.\n\nThe band name was inspired by a character in The Virgin Soldiers (1966) by Leslie Thomas.\n\n\n\nThe band immediately notched a UK Top 20 hit with their cover version of the Bo Diddley composition \"Who Do You Love?\". Their self-titled debut album then fell just shy of the Top 40 in the UK Albums Chart. The album's cover featured a burlesque dancer named Zelda Plum, naked except for a covering of fruit.\n\nLine-up changes ensued, as ex-Zoot Money singer Paul Williams, guitarist Micky Moody, and drummer Rod Coombes replaced Owen (who exited for a solo career), Hubbard, and Dobson for 1970's Lie Back and Enjoy It (#53 - UK Albums Chart). In May 1970, the band appeared at the annual NME poll-winners concert. Another bassist, Jim Leverton, assumed Ellis' duties for the follow-up, 1971's Get a Whiff a This. In August 1971, Juicy Lucy appeared on the bill at the Weeley Festival near Clacton-on-Sea, Essex.\n\nThe constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer, plus Coombes exiting prior to the fourth Juicy Lucy album, 1972's Pieces. This was recorded by a makeshift line-up of Williams, Moody, keyboardist Jean Roussel, and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy disbanded shortly thereafter.\n\n\n\nMicky Moody was a member of Snafu between 1973 and 1976, and he later joined the inaugural Whitesnake line-up in 1978. A 1996 album called Blue Thunder was released under the Juicy Lucy name by Paul Williams and Micky Moody, featuring guest musicians Mick Taylor and Andy Summers. Moody and Williams also released an album called Smokestacks, Broomdusters and Hoochie Coochie Men in 2002.\n\n\n\nJuicy Lucy's version of the song \"Who Do You Love?\" was subsequently featured in the video game Shellshock: Nam '67.\n\nIn 1995, Ray Owen resurrected the band's name and recorded Here She Comes Again. The line-up for this recording also included Mike Jarvis (guitar), Andy Doughty (bass), and Spencer Blackledge (drums). This version of the band broke up in 1997, but Owen persevered and joined up with guitarist Steve Fish. Although legal problems would not allow them usage of the name Juicy Lucy, the outfit performed as Ray Owen's Moon (Moon being the title of Ray Owen's 1971 solo album).\n\n\n\nIn 2004, bassist Fudge and drummer Paul Fletcher joined the band, after the legal situation had been resolved. This version of Juicy Lucy released the album Do That And You'll Lose It in 2006 and toured the UK with Nazareth. They played at the Cambridge Rock Festival in 2007.\n\nIn 2009, a new line-up of Juicy Lucy was formed as - due to health problems - Owen was unable to continue touring on a regular basis. The band was then fronted by singer/guitarist Steve Fish, with Paul Fletcher on drums and James Morris on bass, and this line-up continued to tour throughout the UK. In September 2012, Frank Cokayne (on bass guitar) joined Fish and Fletch in the UK-based version of the band. In March 2013, Cokayne was replaced by Michael Phillips. \"Mississippi Woman\" and \"Who Do You Love?\" (from the band's first album) are still performed live.\n\nOwen now occasionally plays live in France under the moniker \"Ray Owen's Juicy Lucy\", accompanied by Mike Jarvis and Spencer Blackledge from the 1990s incarnation of the band. He also performs solo acoustic sets around the UK, including regular engagements at the Lewes Con Club.\n\n\n\n\n\nJuicy Lucy At MySpace\n\n\n\n\n\n1969 Juicy Lucy\n\n\n\n1970 Lie Back And Enjoy It\n\n\n\n1971 Get A Whiff A This\n\n\n\n1972 Pieces\n\n\n\n1995 Here She Comes Again\n\n\n\n1996 Blue Thunder\n\n\n\n2006 Do That And You’ll Lose It\n\n\n\n\n\nIf you like this torrent show some gratitude to site and please make a donation. If you do Odin will grant you power and more spicy music!\n\n\n\n\n\nAs requested by a fellow member valkokoev from Bulgaria! Genre: Rock Subgenre: Blues Rock Bitrate: 320 k Size: 755.44 MB Show/Hide Files: File Name Size 1969 Juicy Lucy/01-Mississippi Woman.mp3 8.72 MB 1969 Juicy Lucy/02-Who Do You Love.mp3 7.02 MB 1969 Juicy Lucy/03-She's Mine, She's Yours.mp3 13.24 MB 1969 Juicy Lucy/04-Just One Time.mp3 10.72 MB 1969 Juicy Lucy/05-Chicago North-Western.mp3 9.33 MB 1969 Juicy Lucy/06-Train.mp3 13.48 MB 1969 Juicy Lucy/07-Nadine.mp3 6.47 MB 1969 Juicy Lucy/08-Are You Satisfied.mp3 14.45 MB 1969 Juicy Lucy/09-Walking Down The Highway.mp3 11.03 MB 1970 Lie Back And Enjoy It/01-Thinking Of My Life.mp3 10.35 MB 1970 Lie Back And Enjoy It/02-built For Comfort.mp3 13.86 MB 1970 Lie Back And Enjoy It/03-Pretty Woman.mp3 7.47 MB 1970 Lie Back And Enjoy It/04-Whisky In My Jar.mp3 9.22 MB 1970 Lie Back And Enjoy It/05-Hello LA Bye Bye Birmingham.mp3 9.67 MB 1970 Lie Back And Enjoy It/06-Changed My Mind.mp3 7.14 MB 1970 Lie Back And Enjoy It/07-That Woman's Got Something.mp3 6.71 MB 1970 Lie Back And Enjoy It/08-Willie The Pimp.mp3 12.88 MB 1970 Lie Back And Enjoy It/09-Lie Back And Enjoy It.mp3 3.48 MB 1970 Lie Back And Enjoy It/10-Walking Down the Highway.mp3 10.96 MB 1970 Lie Back And Enjoy It/11-I'm A Thief.mp3 8.63 MB 1971 Get A Whiff A This/01-Mr Skin.mp3 8.63 MB 1971 Get A Whiff A This/02-Midnight Sun.mp3 8.40 MB 1971 Get A Whiff A This/03-Midnight Rider.mp3 7.46 MB 1971 Get A Whiff A This/04-Harvest.mp3 9.87 MB 1971 Get A Whiff A This/05-Mr A Jones.mp3 7.16 MB 1971 Get A Whiff A This/06-Sunday Morning.mp3 8.84 MB 1971 Get A Whiff A This/07-Big Lil.mp3 10.62 MB 1971 Get A Whiff A This/08-Jessica.mp3 9.37 MB 1971 Get A Whiff A This/09-Future Days.mp3 9.44 MB 1972 Pieces/01-Promised Land.mp3 8.95 MB 1972 Pieces/02-Cuckoo.mp3 8.51 MB 1972 Pieces/03-All My Life.mp3 14.98 MB 1972 Pieces/04-It Ain't Easy.mp3 13.53 MB 1972 Pieces/05-Suicide Pilot.mp3 9.66 MB 1972 Pieces/06-Why Can't It Happen To Me.mp3 8.89 MB 1972 Pieces/07-Dead Flowers In The Mirror.mp3 9.12 MB 1972 Pieces/08-Prospector Dan.mp3 11.22 MB 1972 Pieces/09-How Can A Poor Man Stand These.mp3 8.96 MB 1995 Here She Comes Again/01-Who Do You Love.mp3 6.90 MB 1995 Here She Comes Again/02-Saturday Night.mp3 9.58 MB 1995 Here She Comes Again/03-Here She Comes Again.mp3 10.16 MB 1995 Here She Comes Again/04-Talk To Me.mp3 9.08 MB 1995 Here She Comes Again/05-Try My Love.mp3 9.62 MB 1995 Here She Comes Again/06-Gone Tomorrow.mp3 13.15 MB 1995 Here She Comes Again/07-Voodoo Chile.mp3 11.89 MB 1995 Here She Comes Again/08-Instrumentalizationalized.mp3 8.64 MB 1995 Here She Comes Again/09-Up To The Trax.mp3 9.03 MB 1995 Here She Comes Again/10-Pretty Woman.mp3 9.22 MB 1995 Here She Comes Again/11-Drug Squad.mp3 16.82 MB 1996 Blue Thunder/Track_01.mp3 10.10 MB 1996 Blue Thunder/Track_02.mp3 11.89 MB 1996 Blue Thunder/Track_03.mp3 13.48 MB 1996 Blue Thunder/Track_04.mp3 9.02 MB 1996 Blue Thunder/Track_05.mp3 12.77 MB 1996 Blue Thunder/Track_06.mp3 10.96 MB 1996 Blue Thunder/Track_07.mp3 11.40 MB 1996 Blue Thunder/Track_08.mp3 10.08 MB 1996 Blue Thunder/Track_09.mp3 13.49 MB 1996 Blue Thunder/Track_10.mp3 8.27 MB 2006 Do That and You'll Lose It/01-Silver Bird.mp3 11.53 MB 2006 Do That and You'll Lose It/02-Making a Name.mp3 8.73 MB 2006 Do That and You'll Lose It/03-Forty Days.mp3 18.54 MB 2006 Do That and You'll Lose It/04-Species.mp3 15.30 MB 2006 Do That and You'll Lose It/05-Where Were You.mp3 15.01 MB 2006 Do That and You'll Lose It/06-Madeline & Suzy.mp3 11.08 MB 2006 Do That and You'll Lose It/07-Only When You Know.mp3 13.38 MB 2006 Do That and You'll Lose It/08-Freedom.mp3 11.82 MB 2006 Do That and You'll Lose It/09-Facts of Life.mp3 7.37 MB 2006 Do That and You'll Lose It/10-One Time, One Place.mp3 13.55 MB 2006 Do That and You'll Lose It/11-God Only Knows.mp3 10.94 MB 2006 Do That and You'll Lose It/12-Floss.mp3 24.20 MB 71 files Added: 20/07/2014 Peer(s): Seed(s): 3, Leecher(s): 0 = 3 Peer(s) Last Seed Update 09/06/2023 16:06:10\n\n\n\nBack"}, {"url": "https://cod.ckcufm.com/programs/391/18626.html", "page_content": "Tonight's show:The music of U.K. guitarists Jim Cregan and Micky Moody will be featured.\n\nWhen The Alarm Clock Rings\n\nBlossom Toes - We Are Ever So Clean(1967/2007))\n\nLove Bomb\n\nBlossom Toes - If Only For A Moment(1969/2007)\n\nSail On\n\nStud - Stud(1971)\n\nSuspicion\n\nFamily - It's Only A Movie(1972)\n\nA New Awakening\n\nJulie Driscoll - 1969(1971)\n\nReach Out For The Truth\n\nLinda Lewis - Lark(1972)\n\nMake Me Smile(Come Up and See Me)\n\nSteve Harley And Cockney Rebel - The Best Years of Our Lives(1975)\n\nSay It Ain't So Joe\n\nMurray Head - Say It Ain't So(1976)\n\nBorn Loose\n\nRod Stewart - Foot Loose & Fancy Free(1977)\n\nChildren of The Sun\n\nThe Misunderstood - Before The Dream Faded(1966/1982)\n\nMississippi Woman\n\nRay Owen's Moon - Moon(1971)\n\nHarpoon Man\n\nTramline - Somewhere Down The Line(1968/2008)\n\nWho Do You Love\n\nJuicy Lucy - Juicy Lucy(1968/2008)\n\nThinking of My Life\n\nJuicy Lucy - Lie Back and Enjoy It(1970)\n\nThat`s The Song\n\nSnafu - Snafu(1973)\n\nLock and Key\n\nSnafu - Situation Normal(1974)\n\nYoung and Moody\n\nBob Young & Micky Moody - Young & Moody(1977)\n\nSomeone Else`s Door\n\nBob Young & Micky Moody - Young & Moody(1977)\n\nSunny Days\n\nDavid Coverdale - Whitesnake(1977)\n\nWe`re Gonna Make It\n\nTony Ashton & Jon Lord - First of The Big Bands(1974)\n\nSay No More\n\nBabe Ruth - Stealin`Home(1976)\n\nMalice In Wonderland\n\nPaice,Ashton & Lord - Malice In Wonderland(1977)"}, {"url": "https://jazzrocksoul.com/artists/juicy-lucy/", "page_content": "Juicy Lucy were an English blues-rock band from London that released two albums on Vertigo circa 1969/70, followed by an album apeice on Bronze and Polydor between 1971 and 1972.\n\n\n\nMembers: Ray Owen (vocals, 1969-70), Glenn Ross Campbell (steel guitar, 1969-72), Chris Mercer (saxophone, 1969-72), Neil Hubbard (guitar, 1969-70), Keith Ellis (bass, 1969-71), Pete Dobson (drums, 1969-70), Paul Williams (vocals, 1970-73, 1996), Micky Moody (guitar, 1970-73, 1996), Rod Coombes (drums, 1970-72), Jim Leverton (bass, 1971-73), Bernie Marsden (guitar, 1971), Jean Roussel (keyboards, 1972-73), Andy Pyle (bass, 1972-73), Ron Berg (drums, 1972-73)\n\nDiscography:"}]}