{"In 1978, Micky Moody joined Whitesnake": [{"url": "https://wiki2.org/en/Micky_Moody", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish musician\n\nMusical artist\n\nMichael Joseph Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed The Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. From 2011 to 2015, Moody toured and recorded with Snakecharmer, a band he co-formed.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy.[citation needed] Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009).[1] A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene.[2] Another book of memoirs, Snakes and Ladders, was released in 2016. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.[citation needed] More recently Micky has worked alongside Ali Maas Moody and they have co-written and released two albums, Black & Chrome and Who's Directing Your Movie?\n\nYouTube Encyclopedic\n\n1 / 5 Views: 2 300 942 329 818 4 308 3 962\n\nMicky Moody - A Taste For Bourbon\n\nMicky Moody [All information in the comments]‎\n\nRelaxing Whiskey Blues Music - Best Of Slow Blues - Fantastic Electric Guitar Blues\n\nJuicy Lucy - Who Do You Love (1971) (MIcky Moody)\n\nMicky Moody - My Lady Friend Transcription\n\nBiography\n\n1960s\n\nWhile at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with others from the area including Paul Rodgers (later of Free and Bad Company). They were subsequently joined by bass player Bruce Thomas, later to play with Elvis Costello and the Attractions. The band performed covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.[3][4]\n\n1970s\n\nIn 1970 he joined recently re-patriated keyboard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guest with Hinkley's Heroes before joining his friend David Coverdale. Moody knew Coverdale – who had fronted Deep Purple and was looking to undertake a solo venture – from the Middlesbrough music scene in the late sixties. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two studio albums, Trouble (1978) and Lovehunter (1979), recorded by a modified lineup with Jon Lord on keyboards. Moody is credited with cowriting four of the tracks on Trouble and was sole writer of 'Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.[citation needed]\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.[citation needed]\n\nIn 1981, Graham Bonnet's Line-Up featured Moody playing guitar on all tracks and three songs written by Moody with Bob Young. Moody maintained a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others.[citation needed] By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was unhappy with the direction the new band was taking and felt increasingly sidelined by Coverdale.[5] Despite this deteriorating situation, he recorded Slide It In – a process he described as an 'unhappy experience' – but then left the band in 1983.[1]\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected TV music library work. He toured with Chris Farlowe and worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, witty view of some of the people and experiences they'd encountered over the years, he and Bob Young wrote a book on musicians' humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band, featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade, he and Bernie Marsden played selected venues with their own Moody Marsden Band.[citation needed]\n\n1990s\n\nDuring the early 1990s, Moody toured extensively with Roger Chapman. \"What a bloke,\" marvelled the singer. \"Every hotel we stayed in, he used to get his black bin-liners out and start taping them to the windows – can't sleep if there's any light in the room. They used to think he was mad. Lovely fella though. A great guitarist. And intelligent too. Too intelligent for Coverdale.\"[6]\n\nMoody reunited on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record as the Moody Marsden Band in U.K and Europe. They issued two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the US as part of the Best of British Blues tour, also featuring Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jørn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in reproducing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Stefan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.[citation needed]\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams[7] to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also played occasional duo gigs with bluesman Papa George.[citation needed] 'Snake' metamorphosed into M3 Classic Whitesnake and also released a live CD (featuring former Black Sabbath singer Tony Martin) and a live DVD with the former The Company Of Snakes singer Stefan Berggren back, and with the special guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. The DVD also featured sessionman Jimmy Copley (who worked with bands such as Go West and Tears for Fears) on drums and Mark Stanway from Magnum on the keyboards.\n\nAround this time Moody played on Nah Aufnahme by German musician Westernhagen, which eventually appeared in the national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me, released at the same time as his memoirs Playing with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a line up which also includes former Whitesnake colleague Neil Murray, former Wishbone Ash guitarist Laurie Wisefield, singer Chris Ousey (Heartland), drummer Gary James (Thunder, Magnum) and Ozzy's keyboardist Adam Wakeman. In 2015, Moody left \"Snakecharmer\" to pursue his solo career. In recent years, Moody also made regular appearances alongside blues guitarist Papa George and has been an active member of the \"Sunflower Jam\" house band and the Bad Apples.[citation needed]. In 2016 he and Ali Maas Moody released their first album together. They also played live regularly with their Ali Maas and Micky Moody Band.\n\n2020s\n\nIn 2020 Micky and Ali released their second co-written album and continue to work together.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\n2001 Ozone Friendly\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\nWith Whitesnake\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\n2020 Who's directing your Movie?\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n(VA) 1970 Zoot Money (Zoot Money)\n\n(Zoot Money) 1973 In Memory of Robert Johnson (Paul Williams)\n\n(Paul Williams) 1973 I Never Got (Tony Kelly)\n\n(Tony Kelly) 1973 Manor Live (VA)\n\n(VA) 1973 Me and My Friend (Patrick Campbell Lyons)\n\n(Patrick Campbell Lyons) 1974 Funkist (Bobby Harrison)\n\n(Bobby Harrison) 1975 Squire (Alan Hull)\n\n(Alan Hull) 1975 Legend (Mickey Jupp)\n\n(Mickey Jupp) 1977 Graham Bonnet (Graham Bonnet)\n\n(Graham Bonnet) 1977 Fancy That (Joanna Carlin)\n\n(Joanna Carlin) 1977 City to City (Gerry Rafferty)\n\n(Gerry Rafferty) 1979 Chappo (Roger Chapman)\n\n(Roger Chapman) 1981 Line Up (Graham Bonnet)\n\n(Graham Bonnet) 1982 Riff Burglars (Roger Chapman)\n\n(Roger Chapman) 1982 Madness, Money & Music (Sheena Easton)\n\n(Sheena Easton) 1986 In Quo Country (Bob Young)\n\n(Bob Young) 1987 Islands (Mike Oldfield)\n\n(Mike Oldfield) 1987 Party Album (Gary Glitter)\n\n(Gary Glitter) 1987 Reaching Out (Paul Millns)\n\n(Paul Millns) 1987 Indestructible (Mike D'Abo)\n\n(Mike D'Abo) 1987 No Angel (Sanne Salomonsen)\n\n(Sanne Salomonsen) 1988 New Day (Jane Harrison)\n\n(Jane Harrison) 1989 Walking The Cat (Roger Chapman)\n\n(Roger Chapman) 1990 Hybrid and Lowdown (Roger Chapman)\n\n(Roger Chapman) 1991 Blue-Eyed Slide (Brian Knight)\n\n(Brian Knight) 1992 Parlour Games (John Spencer)\n\n(John Spencer) 1992 Blues Brittania (VA)\n\n(VA) 1992 Waiting in the Wings (Chris Farlowe)\n\n(Chris Farlowe) 1992 Very Much Alive (Willy Finlayson and The Hurters)\n\n(Willy Finlayson and The Hurters) 1993 Midnight Postcards (Adam Faith)\n\n(Adam Faith) 1994 Tellin' Stories (Walter Trout)\n\n(Walter Trout) 1994 Line Up (Borderline)\n\n(Borderline) 1995 Together (Peter Smith)\n\n(Peter Smith) 1995 Green and Blues (Bernie Marsden)\n\n(Bernie Marsden) 1996 Kiss My Soul (Roger Chapman)\n\n(Roger Chapman) 1996 Blue Thunder (Blue Thunder)\n\n(Blue Thunder) 1998 Pinboard Wizards (Jackie Lynton)\n\n(Jackie Lynton) 2000 Here After (Jamie Marshall)\n\n(Jamie Marshall) 2000 Gimme All Your Topp (VA)\n\n(VA) 2000 Snakebites (VA)\n\n(VA) 2000 Glory Bound (Chris Farlowe)\n\n(Chris Farlowe) 2001 Another Hair of the Dog (VA)\n\n(VA) 2001 Tam de ti ye... (Ani Lorak)\n\n(Ani Lorak) 2002 Fairytale (Peer Gynt)\n\n(Peer Gynt) 2002 Who's He Calling Me Him (Norman Beaker Band)\n\n(Norman Beaker Band) 2003 Freak Out (Chris Catena)\n\n(Chris Catena) 2004 On The Wire (Smokie)\n\n(Smokie) 2005 Nah Aufnahme (Westernhagen)\n\n(Westernhagen) 2007 One More Time For Peace (Roger Chapman)\n\n(Roger Chapman) 2007 Human Spirit (Gary Fletcher)\n\n(Gary Fletcher) 2008 Slap My Hand (Jimmy Copley)\n\n(Jimmy Copley) 2009 Live at Abbey Road (Endangered Species)\n\n(Endangered Species) 2010 Live in Kawasaki/Demons & Wizards in Kawasaki (Official Bootleg) (Uriah Heep)\n\n(Uriah Heep) 2013 The Proof (The Proof)\n\n(The Proof) 2013 Tailshaker (Brothers in Blues)\n\n(Brothers in Blues) 2013 Friends for a LIVEtime (The Hamburg Blues Band)\n\n(The Hamburg Blues Band) 2014 Celebrating Jon Lord (VA)\n\n(VA) 2015 Hold On (Eugene Hideaway Bridges)\n\nReferences"}, {"url": "https://myvintagerock.com/2015/02/07/whitesnake-newcastle-city-hall-26th-october-1978/", "page_content": "Posted February 7, 2015 by vintagerock in Magnum, Whitesnake. Tagged: blues, classic rock, concert, concerts, gig, gigs, heavy metal, heavy rock, music, rock, rock n roll. 3 Comments\n\nWhitesnake Newcastle City Hall 26th October 1978\n\nSupport from Magnum\n\nDavid Coverdale embarked on a solo career in 1977 after the split of Deep Purple. His first solo album “White Snake” was released in February 1977. All the songs were written by David Coverdale and Micky Moody, who was also guitarist in David’s band. The album wasn’t particularly successful, but its title inspired the name of Coverdale’s future band, which was to come together one year later. In early 1978 Coverdale released his second solo album “Northwinds”. The band which was to be Whitesnake was already coming together. In June 1978 the “Snakebite” EP was released, which contained the Whitesnake favourite, their cover of Bobby Bland’s “Ain’t No Love in the Heart of the City”. Coverdale: “Originally I had no plans to actually record ‘Ain’t No Love in the Heart of the City’…if you can believe it…a song that connects so deeply with so many that I still play it today, 25 years later.”\n\nI first saw Whitesnake at Newcastle City Hall in October 1978. They had just released the “Trouble” album, and this was the first night of their first major tour of UK concert halls. The line-up was David Coverdale (vocals), Micky Moody (guitar), Bernie Marsden (guitar), Neil Murray (bass), Jon Lord (keyboards) and Dave Dowle (drums). Jon Lord had just joined. From the programme: “David Coverdale and Whitesnake – two names that have imprinted themselves on the British Rock media and the public in the last nine months….David Coverdale and Whitesnake left audiences and industry aware that a brilliant, yet deeply experienced new force had arrived on the rock scene.”\n\nWhitesnake were heavy but soulful. Much more bluesy than Purple, but also heavier. Coverdale had an incredible voice; one minute he could be singing the most soulful gentle blues, and then he would thrust his head back, that mane of hair would sway behind him, and he would bellow and scream some of the rockiest songs to be heard on a concert stage anywhere. And with Jon Lord in the band, you knew that they had to play some Purple songs. Their versions of “Might Just Take Your Life” and “Mistreated” were pure class. “Mistreated” in particular was a tour de force for Whitesnake; particularly because of Coverdale’s amazing vocal performances of the song. But Whitesnake wasn’t just the David Coverdale show; this was a strong rock band with two excellent guitarists who both understood, and could play, the blues, and in Jon Lord the greatest exponent of the Hammond organ.\n\nPhil Sutcliffe, reveiwing the concert is Sounds (11 November 1978): ‘Mistreated’: the most astonishing first line I’ve ever heard is Coverdale gathering into that bellow of “I’ve been Mistreated”: the sort of passion that enabled Samson to pull down the Philistine temple; the song is magnificent and raw, an insight like an old roaster’s painting of a butcher’s shop, life as red meat; at the end Coverdale throws his head back and howls like a wolf and we roar at him; “You like the blues? Of course you f***ing do – all northerners like the blues and don’t we know it”. Whitesnake were incredible that night, and the Newcastle heavy rock brigade now had a new band to worship alongside Rainbow and Gillan.\n\nI saw Whitesnake 10 or so times over the next 5 or 6 years and will write about those gigs over the next week.\n\nSetlist: Come On; Might Just Take Your Life (Deep Purple cover); Lie Down (A Modern Love Song); Ain’t No Love in the Heart of the City; Trouble; Steal Away; Mistreated; Belgian Tom’s Hat Trick; Take Me with You; Rock Me Baby; Breakdown.\n\nThanks to Mitch for his photo of David Coverdale and Whitesnake, which he took at an earlier concert at Redcar Coatham Bowl on 24th March 1978."}, {"url": "https://blabbermouth.net/news/guitarist-micky-moody-discusses-his-departure-from-whitesnake", "page_content": "Greece's Rockpages webzine recently conducted an interview with original WHITESNAKE guitarist Micky Moody. An excerpt from the chat follows below.\n\nRockpages: Did you feel a full member of WHITESNAKE or just a player in [vocalist] David Coverdale's band?\n\nMicky: Full member, indeed. I wasn't getting the full money, but that's another story! The only time when I didn't feel a full member of WHITESNAKE was in 1982 when David asked me to rejoin the band. I had left in late 1981, because I had had enough of the business side of things.. anyway, when I returned, Cozy Powell and Mel Galley were in WHITESNAKE... great musicians, to say the least. But I kinda felt like a session guitar player in that lineup. We had a different management and the vibe was not the same, by any means. I don't blame David for this decision... We weren't making any money and he needed something better for his career. But, in that particular lineup, I was treated like a session player... it was all about David and Cozy. I didn't enjoy that period with WHITESNAKE.\n\nRockpages: Did you think that it was during that time that David was thinking of going into a more commercial direction?\n\nMicky: Absolutely!\n\nRockpages: From your perspective, when exactly do you think he started having those thoughts?\n\nMicky: I think right after the \"Saints & Sinners\" record. David started listening to a lot of American industry people... especially John David Kalodner from Geffen. This guy was ruthless and I'll tell you why... The last time that I played with WHITESNAKE was in October 1983. While I was playing... I think it was in Hamburg... John Kalodner was standing at the side of the stage and he was taking notes. I thought that \"This is sinister... this is dark.\" By the end of the show, he went straight to David and he showed him the notes... It was obvious that John Kalodner did not think much of me. Here's a story after that incident... We were at a hotel in Germany... on the same tour... and David was sitting with John Sykes. Without any specific reason, he turned to me and he said, \"Don't you ever turn your back at the audience during the show.\". He said that in front of John Sykes and it was evident that Sykes was really embarrassed. I didn't say anything, but I remember thinking, \"Fuck you!\" I am sorry to tell you this, but this is the truth. He had embarrassed me in front of another musician, but David had already decided to bring John Sykes in the band. After the last gig in Belgium, I asked the tour manager to go and get all the members of WHITESNAKE in my room to announce my decision to leave the band. Everybody came in my room except Coverdale... Cozy — being a truly honest guy — said to me, \"Good decision!\" Jon Lord started crying... 'cause Jon is always very emotional. A week later, David called me and said, \"Oh, you're leaving the band...\" That's the story, guys!\n\nRead the entire interview from Rockpages."}, {"url": "https://peoplepill.com/people/micky-moody/", "page_content": "Michael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. More recently, he has toured and recorded with Snakecharmer.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009). A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.\n\nBiography\n\n1960s\n\nWhile still at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with several others from the smae area including Paul Rodgers (later of Free and Bad Company). They were joined some time later by bass player Bruce Thomas, who moved onto play with Elvis Costello and the Attractions. The band performed a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.\n\n1970s\n\nIn 1970 he joined the recently re-patriated keybopard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guste with with Hinkley's Heroes before joining his friend David Coverdale. Moody had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, upto this time Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two Studio albums, Trouble (1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble and was sole writer of Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.\n\nIn 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Moody continued to maintain a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others. By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was not happy with the direction the new band was taking and felt increasingly sidelined by Coverdale. However, despite the deteriorating situation within Whitesnake, Moody recorded Slide It In with them. A process he described as an 'unhappy experience' and after which he left the band in 1983.\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected T.V music library work. He toured with Chris Farlowe and also worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record with the Moody Marsden Band in U.K and Europe. The Moody Marsden Band recorded two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional duo gigs with bluesman Papa George. 'Snake' metamorphosed into M3 Classic Whitesnake and also released released a live CD featuring Martin and a live DVD featuring Berggren with a guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time Moody played on the album Nah Aufnahme by German musician Westernhagen, which eventually appeared in thethe national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me which was released at the same time as publication of his autobiographical memoirsPlaying with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a stellar line up which also includes former Whitesnake colleague Neil Murray. He also made regular appearances alongside blues guitarist Papa George and has been an active member of the Sunflower Jam house band and the Bad Apples.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 Snafu\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\n1978 Snakebite\n\n1978 Trouble\n\n1978 Live at Hammersmith\n\n1979 Lovehunter\n\n1980 Ready an' Willing\n\n1980 Live...in the Heart of the City\n\n1981 Come an' Get It\n\n1982 Saints & Sinners\n\n1984 Slide It In (UK version)\n\n(UK version) 1994 Greatest Hits\n\n2003 Best of Whitesnake\n\n2003 The Silver Anniversary Collection\n\n2004 The Early Years\n\n2008 30th Anniversary Collection\n\n2011 Box of Snakes\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\n2016 Black & Chrome (with Ali Maas)\n\nGuest appearances"}, {"url": "https://www.thisisdig.com/feature/come-an-get-it-whitesnake-album/", "page_content": "Whitesnake may have initially been put together as the backing band for vocalist David Coverdale, a former member of Deep Purple, but they quickly became a force in their own right. After establishing themselves as blues-rock contenders with a pair of late-70s records, Trouble (1978) and Lovehunter (1979), the group adapted their sound for the 80s, embarking on a run of albums that turned them into hard-rock heroes with commercial rewards to boot. Released in April 1981, Whitesnake’s fourth album, Come An’ Get It, was an invitation the rock-loving public couldn’t refuse.\n\nListen to Come An’ Get It here.\n\n“A real stroke of genius”\n\nThe name “White Snake” was first used in 1977 as the title of David Coverdale’s debut solo album. By the time the band that took the record’s name gathered to record Come An’ Get It, however, guitarist Micky Moody was the only musician to have survived from those sessions. Guitarist Bernie Marsden, bassist Neil Murray and former Deep Purple keyboardist Jon Lord had joined in 1978, with Ian Paice, another former Purps alumni, taking over from drummer Dave Dowle the following year. It was this line-up that had recorded 1980’s Ready An’ Willing, whose debut single, Fool For Your Loving, gave the group their first taste of success, helping the album to hit No.6 in the UK while also taking Whitesnake into Top 100 US album and singles charts for the first time.\n\nA mere four days after wrapping up their tour in support of the record, the band entered Ringo Starr’s Startling Studios, in Tittenhurst Park, Ascot, the former home of John Lennon and Yoko Ono, to record its follow-up with producer Martin Birch (Fleetwood Mac), Black Sabbath, Blue Öyster Cult, Iron Maiden). Speaking to GQ magazine in 2019, guitarist Marsden recalled the sessions for Come An’ Get It: “The studio itself at Tittenhurst was not very large” – a situation that forced Paice to set his kit up in the corridor outside. Doing so, however, “became vital for the entire album, as the high ceiling created a sublime sound. It turned out to be a real stroke of genius.”\n\nWith the rest of the band in the studio, Marsden continued, “There was a very cosy atmosphere and it was easy to get to work. Martin [Birch] immediately began weaving his magic spells, with Martin Adam, the house engineer, as his assistant. I have no idea how much Tittenhurst cost Whitesnake (I’m not sure any of us ever knew what anything really cost), but whatever it was, it was worth it.”\n\nWith the group taking breaks to play football outside, the relaxed atmosphere was later described by Coverdale as “great” and ”positive” for the band.\n\n“I don’t feel we came as close as we did on Come An’ Get It”\n\nCome An’ Get It still contained the blues-style ballads with which Whitesnake cut their teeth, while the likes of the title track and Wine, Women An’ Song saw Coverdale developing a provocative style of songwriting he was fast making his own: “If I can make you smile/I will raise my glass,” he sings on the latter, “But if you don’t like it/Then, baby, you can kiss my ass!” In a different vein, the brooding, melodramatic masterpiece Don’t Break My Heart Again returns to the kind of vulnerability that had helped Fool For Your Loving scale the charts."}, {"url": "https://alchetron.com/Micky-Moody", "page_content": "Michael Joseph Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes, having previously collaborated with unofficial 5th Status Quo member Bob Young in Young & Moody. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed [the Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. More recently, he has toured and recorded with Snakecharmer.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009). A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene. Another book of memoirs Snakes And Ladders was released in 2016. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread.\n\n1960s\n\nWhile still at school in Middlesbrough and attending private guitar lessons, Moody formed The Roadrunners with several others from the area including Paul Rodgers (later of Free and Bad Company). They were joined some time later by bass player Bruce Thomas, who moved onto play with Elvis Costello and the Attractions. The band performed a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene and turned professional, changing their name to The Wildflowers and subsequently moving to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without making any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had broken up. Moody joined Lucas and the professional Soul band Mike Cotton Sound who became Gene Pitney's backing band for UK tours as well as others such as Paul Jones.\n\n1970s\n\nIn 1970 he joined the recently re-patriated keyboard player Zoot Money as guitarist. He then replaced Neil Hubbard in Juicy Lucy with whom he recorded three albums and toured extensively before the group disbanded. After the band split, Moody co-founded Snafu which combined his funk-rock guitar style with U.S down-home stateside grooves. The band recorded three albums SNAFU, Situation Normal and All Funked Up. They also appeared on a John Peel The Old Grey Whistle Test session and the T.V series Supersonic. Extensive touring followed before the band broke up. At this time Moody undertook occasional work as a session player most notably for Graham Bonnet. He also contributed to one track on Gerry Rafferty's City to City. He performed with the former Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist Bob Young which became Young & Moody. He then toured with Frankie Miller and stood in as a guest with Hinkley's Heroes before joining his friend David Coverdale. Moody had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, upto this time Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. Coverdale invited Moody to work with him and the album White Snake was released in 1977. Moody shared writing credits on four songs including the title track. A second album Northwinds followed in 1978, on which Moody contributed to three songs. Following the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the E.P Snakebite followed by two Studio albums, Trouble (1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble and was sole writer of Belgian Tom's Hat Trick', an instrumental. While working with Whitesnake he also played slide guitar on Roger Chapman's debut solo album Chappo.\n\n1980s\n\nMoody contributed slide guitar to three tracks on former Lindisfarne member Ray Jackson's solo debut In the Night, which was released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, from which two UK singles were taken, Fool for Your Loving and the album title track, both co-written by Moody. The band also released the double album Live...in the Heart of the City in the same year. At his time he recorded two singles with Bob Young, with all tracks written by Moody.\n\nIn 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Moody continued to maintain a busy schedule with Whitesnake and the band released the album Come an' Get Itin the same year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. Whitesnake took time out for much of 1982 and Moody undertook some session work, with Sheena Easton and others. By late 1982 Whitesnake was reformed with Mel Galley replacing Marsden and Moody joining Galley on the album's backing vocal sessions. In 1983 Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. Moody was not happy with the direction the new band was taking and felt increasingly sidelined by Coverdale. However, despite the deteriorating situation within Whitesnake, Moody recorded Slide It In with them. A process he described as an 'unhappy experience' and after which he left the band in 1983.\n\nMoody returned to session work with Mike Oldfield, Gary Glitter, Mike d'Abo and Roger Chapman, as well as selected T.V music library work. He toured with Chris Farlowe and also worked with former Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language of Rock and Roll. He also put together the first version of the Micky Moody Band featuring former Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with Whitesnake guitarist Bernie Marsden, to tour and record with the Moody Marsden Band in U.K and Europe. The Moody Marsden Band recorded two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced library music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams to arrange and record a selection of acoustic classic Chicago blues tracks for the album Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional duo gigs with bluesman Papa George. 'Snake' metamorphosed into M3 Classic Whitesnake and also released released a live CD featuring Martin and a live DVD featuring Berggren with a guest appearance from former Ritchie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time Moody played on the album Nah Aufnahme by German musician Westernhagen, which eventually appeared in thethe national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me which was released at the same time as publication of his autobiographical memoirsPlaying with Trumpets – A Rock 'n' Roll Apprenticeship. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced the albums Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before co-forming Snakecharmer, a line up which also includes former Whitesnake colleague Neil Murray and Adam Wakeman. He also made regular appearances alongside blues guitarist Papa George and has been an active member of the Sunflower Jam house band and the Bad Apples.\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 Snafu\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back on the Blues\n\n1994 live in Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\n2001 Ozone Friendly\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\n1978 Snakebite\n\n1978 Trouble\n\n1978 Live at Hammersmith\n\n1979 Lovehunter\n\n1980 Ready an' Willing\n\n1980 Live...in the Heart of the City\n\n1982 Saints & Sinners\n\n1984 Slide It In (UK version)\n\n1994 Greatest Hits\n\n2003 Best of Whitesnake\n\n2003 The Silver Anniversary Collection\n\n2004 The Early Years\n\n2008 30th Anniversary Collection\n\n2011 Box of Snakes\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst the Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n2007 Rough An' Ready (live album, DVD)\n\nWith Snakecharmer\n\n2013 Snakecharmer\n\n2017 Second Skin\n\nWith The Bad Apples\n\n2014 Played\n\nWith Ali Maas\n\n2016 Black & Chrome\n\nSolo\n\n2000 I Eat Them for Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! – Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n2009 Electric Journeyman\n\n2016 Black & Chrome (with Ali Maas)\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n1970 Zoot Money (Zoot Money)\n\n1973 In Memory of Robert Johnson (Paul Williams)\n\n1973 I Never Got (Tony Kelly)\n\n1973 Manor Live (VA)\n\n1973 Me and My Friend (Patrick Campbell Lyons)\n\n1974 Funkist (Bobby Harrison)\n\n1975 Squire (Alan Hull)\n\n1975 Legend (Mickey Jupp)\n\n1977 Graham Bonnet (Graham Bonnet)\n\n1977 Fancy That (Joanna Carlin)\n\n1977 City to City (Gerry Rafferty)\n\n1979 Chappo (Roger Chapman)\n\n1981 Line Up (Graham Bonnet)\n\n1982 Riff Burglars (Roger Chapman)\n\n1982 Madness, Money & Music (Sheena Easton)\n\n1986 In Quo Country (Bob Young)\n\n1987 Islands (Mike Oldfield)\n\n1987 Party Album (Gary Glitter)\n\n1987 Reaching Out (Paul Millns)\n\n1987 Indestructible (Mike D'Abo)\n\n1987 No Angel (Sanne Salomonsen)\n\n1988 New Day (Jane Harrison)\n\n1989 Walking The Cat (Roger Chapman)\n\n1990 Hybrid and Lowdown (Roger Chapman)\n\n1991 Blue-Eyed Slide (Brian Knight)\n\n1992 Parlour Games (John Spencer)\n\n1992 Blues Brittania (VA)\n\n1992 Waiting in the Wings (Chris Farlowe)\n\n1992 Very Much Alive (Willy Finlayson and The Hurters)\n\n1993 Midnight Postcards (Adam Faith)\n\n1994 Tellin' Stories (Walter Trout)\n\n1994 Line Up (Borderline)\n\n1995 Together (Peter Smith)\n\n1995 Green and Blues (Bernie Marsden)\n\n1996 Kiss My Soul (Roger Chapman)\n\n1996 Blue Thunder (Blue Thunder)\n\n1998 Pinboard Wizards (Jackie Lynton)\n\n2000 Here After (Jamie Marshall)\n\n2000 Gimme All Your Topp (VA)\n\n2000 Snakebites (VA)\n\n2000 Glory Bound (Chris Farlowe)\n\n2001 Another Hair of the Dog (VA)\n\n2001 Tam de ti ye... (Ani Lorak)\n\n2002 Fairytale (Peer Gynt)\n\n2002 Who's He Calling Me Him (Norman Beaker Band)\n\n2003 Freak Out (Chris Catena)\n\n2004 On The Wire (Smokie)\n\n2005 Nah Aufnahme (Westernhagen)\n\n2007 One More Time For Peace (Roger Chapman)\n\n2007 Human Spirit (Gary Fletcher)\n\n2008 Slap My Hand (Jimmy Copley)\n\n2009 Live at Abbey Road (Endangered Species)\n\n2010 Live in Kawasaki/Demons & Wizards in Kawasaki (Official Bootleg) (Uriah Heep)\n\n2013 The Proof (The Proof)\n\n2013 Tailshaker (Brothers in Blues)\n\n2013 Friends for a LIVEtime (The Hamburg Blues Band)\n\n2014 Celebrating Jon Lord (VA)\n\n2015 Hold On (Eugene Hideaway Bridges)"}, {"url": "https://rawramp.me/2016/04/22/fresh-project-for-micky-moody-whitesnake-guitarist-announces-maas-and-moody-hrhblues-new-album-in-july/", "page_content": "We met up with the English guitarist MICKY MOODY in the comfortable surroundings of the O2 Academy, Sheffield during the 2016 HRH BLUES Weekend.\n\nMoody had arrived at the venue with the singer Ali Maas.\n\nAli Maas began singing as a teenager in Horsham, Sussex.\n\nAs a young adult she gigged with indie-band “Playing at Trains” and at this stage began to develop skills as a songwriter. She formed the rock band McQueen with Levitation producer Mike Dignam and she met up with the Russian rockers Mumiytroll appearing on their albums as a backing vocalist.\n\nWe had already seen this talented blues singer performing with Papa George as well as with Alan Glen, John O’leary and the Allstar Blues Revue.\n\nMicky Moody is most famous for his work with rock bands Juicy Lucy and Whitesnake. More recently he has been working with the Chris Ousey/ Laurie Wisefield project SNAKECHARMER.\n\nWe sat down with both musicians to discuss their plans:\n\nTell us about your new project\n\n\n\n“It’s called MAAS and MOODY and it features ALI MAAS on vocals and myself (MOODY) on guitars, as usual… And there’s gonna be a brand new album — all original material — which has already been mastered (last week) — we haven’t got a release date as yet but it will probably be out the end of July, with a bit of luck. It will be released on Armadillo Music. That’s what we’ve been doing…”\n\nHow many shows have you done together?\n\n“Just done a couple of local ones, really. The BULL’S HEAD in London. It’s been building up and we have been incorporating the songs gradually. It’s been more writing, really. Though here at the HRH BLUES festival we are performing a MICKY MOODY show— though we will be doing some of our new stuff from the album.”\n\nWe have heard rumours that your son is involved with new project?\n\n“Yes, my son’s on drums. My elder son, yeah. With Roy Parsons on bass [also with Tim Hain Band] Stuart Dixon on guitar. Stuart hasn’t worked with us before. But we’ve had a couple of gigs, as I told you. I haven’t been on the road, really, since I did the Snakecharmer gigs, back in November… so we’re looking forwards to doing a tour — probably more towards the end of the year — once the album is out. ”\n\nSo did ALI help with the writing process?\n\n“ Yes, we co-wrote everything. And it’s not like Snakecharmer! I think we have gone back to the kind of stuff I used to do in the 1970s. A lot of slide stuff. Down-home. Swampy. Bluesy. Rocky.”\n\nALI MAAS: “ Yes, we feel definitely swampy! And it’s quite an eclectic sound that we are developing. And there’s a rock element to it. I have got rock blood. And Micky has got all sorts of blood — God knows what kind of blood is in there — but there’s all sorts..”\n\nHow do you keep the energy and the vitality up?\n\nMoody: “Well, we don’t intend to be living on the road all the time. And this project won’t interfere with my other gigs… I really love playing with Papa George, for example. We’ll obviously be doing live shows but I have done a lot in my time. I like work. That’s true, but I don’t want to spend my life on the road. ”\n\n“We have already started writing the next album! And the first one isn’t even out yet! We can’t stop. We love the creative process. And I think I just have a natural energy inside. And of course its the excitement. I think basically, its just that we both do what we wanna do! Without being too indulgent, you know what I mean, it’s still lively stuff (it won’t bore anyone) but we’re not gonna do the obvious stuff. ”\n\nMy final Hoorah! With the rock stuff and the Whitesnake associated stuff was with Snakecharmer. Yeah, that didn’t really work out for me. For whatever reasons. So this new project is really what I wanna do. It’s the stuff I was actually doing before I joined Whitesnake. In 1978 I helped form Whitesnake but I had been a pro for 10 years before that. Playing all kinds of stuff. And that’s what I like to do. And you’ve seen me with George, the kind of roots we have, we just wanna keep it soulful and happy. And cool too…”\n\n“Don’t get me wrong, Whitesnake material is great stuff. But I don’t want to do it any more. I just did it with Snakecharmer… It’s great stuff but I’d rather leave it to other people to do. I can’t go any further with it. I want to do something different now. ”\n\n“I really enjoy working with the people in this new band. We’re all friends and there’s no shit going on, you know what I mean? It’s good vibes with this band. ”\n\nWhat is the title of the new album ?\n\n“The title is Black and Chrome”\n\nWhy?\n\n“It sounds good! ”\n\nALI MAAS: “ There’s a lyric on the album… One of the songs is about a trip up the Mississippi on the back of a Harley and motorbikes and that do figure in the subject matter of the album… ”\n\n“Also Black and Chrome are the optimum colours for a classic looking finish. The colours go well together. It’s classic rock ‘n’ roll. Stylish. Timeless. And that’s what we are gonna try and emulate. It may been sleek and sharply clean, but occasionally there might be a bit of mud up the side… ”\n\nWell, good luck with your new project and the release of the album. We cannot wait to hear it!\n\nMicky Moody (with Ali Maas) was talking to @neilmach © at HRH BLUES 2016\n\nAll Images: @neilmach 2016 ©\n\nLink: https://www.facebook.com/hrhblues/\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/4039868", "page_content": "Michael Joseph \"Micky\" Moody (born 30 August 1950) is an English guitarist, and a former member of the rock bands Juicy Lucy and Whitesnake. He was also a founder-member of Snafu. Together with his former Whitesnake colleague Bernie Marsden he founded the Moody Marsden Band, and later, The Snakes. Along with Marsden and ex-Whitesnake bassist, Neil Murray, he formed Company of Snakes and M3 Classic Whitesnake with which they mainly performed early Whitesnake songs. From 2010 he has been working with Murray, guitarist Laurie Wisefield, drummer Harry James, singer Chris Ousey and keyboard player Michael Bramwell in Monsters of British Rock which has morphed into Snakecharmer with Adam Wakeman on keyboards.\n\nBesides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also worked alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, PP Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner and Uriah Heep. For TV he has also accompanied such stars as Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Ben E. King and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009).[1] A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets - A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene.[2] His media music has been featured on such TV programmes as Waking the Dead, Bo Selecta, America's Next Top Model, How To Look Good Naked, Top Gear, Mad Men and Wife Swap USA.\n\nBiography\n\n1960s\n\nWhile still at school in Middlesbrough and regularly attending private guitar lessons, Moody formed a band named The RoadRunners with several other local boys including Paul Rodgers (later to form Free and Bad Company), and later, Bruce Thomas, who would eventually play bass with Elvis Costello and the Attractions. The band were kept busy performing a range of covers in local halls and clubs. By 1967 they had developed and outgrown the local music scene so they took the decision to turn professional, change their name to the Wildflowers, and move to London. They had some success and undertook some touring, but relationships within the band frayed and they eventually split without ever releasing any recordings. Moody returned home to Middlesbrough where for a while he widened his musical horizons by taking classical guitar lessons. He also became increasingly interested in slide guitar techniques (a style he would later be closely associated with). While living in Middlesbrough he was asked by local singer and entrepreneur, John McCoy, to form a group which became Tramline. A deal for two albums was signed with Island Records, but by the time the second album was released the band had already split and gone their separate ways. At this point Moody joined Lucas and the Mike Cotton Sound who, as well as proving to be a highly-polished Soul band, also acted as Gene Pitney's backing band for his UK tours as well as backing others, such as Paul Jones.[3][4]\n\n1970s\n\nIn 1970 he joined the recently re-patriated Zoot Money before replacing Neil Hubbard in Juicy Lucy. As a member of Juicy Lucy, he recorded three albums and toured extensively before the group disbanded. After the band split, Micky co-founded Snafu which combined his funk-rock guitar style with some down-home stateside grooves. The band recorded three albums - SNAFU, Situation Normal, and All Funked Up. They also appeared on a John Peel session, the Old Grey Whistle Test and Supersonic and toured extensively before the individual members headed off to pursue different ventures. Moody undertook occasional work as a session player before, during and after Snafu, most notably for Graham Bonnett. He also contributed to one track on City to City by Gerry Rafferty. Moody performed as an original member of Status Quo drummer John Coghlan's Diesel Band, then recorded an album with the band's tour manager and lyricist, Bob Young. The result was Young & Moody. He then toured with Frankie Miller and guested with Hinkley's Heroes before hooking up with another friend from the North East, David Coverdale. Micky had known Coverdale from the local music scene in the Middlesbrough area in the late sixties, but by this point Coverdale had been fronting Deep Purple and was looking to undertake a solo venture. He invited Moody to assist and the result was the album White Snake released in 1977 which was followed by a second album Northwinds in 1978. Moody shared writing credits on four of the nine songs on Whitesnake (including the title track) and three of the eight songs featured on Northwinds. With the demise of Deep Purple MkIV, Coverdale and Moody joined forces with Bernie Marsden, Neil Murray, Dave 'Duck' Dowle and keyboardist Brian Johnston (replaced after a few months by Pete Solley) to form a band that took its name Whitesnake from the title of Coverdale's first solo album. In 1978 they recorded the EP Snakebite followed by two Studio albums: Trouble (also in 1978) and Lovehunter (1979) which were recorded by a modified line up with Jon Lord on keyboards. Moody is credited with co-writing four of the ten tracks on Trouble, and was sole author of a fifth (the lively instrumental, Belgian Tom's Hat Trick). He contributed to three of the ten songs on Lovehunter, most notably the title track. While working with Whitesnake he found time to play slide guitar on several tracks on Roger Chapman's debut solo album, Chappo.\n\n1980s\n\n\n\nCourtesy: Andrew King Bernie Marsden (left) and Micky Moody; at Hammersmith Odeon, in 1981Courtesy: Andrew King\n\nMoody contributed slide guitar to three tracks on Ex-Lindisfarne Ray Jackson's solo debut In the Night released in 1980. By this point Whitesnake now featured Ian Paice from Deep Purple on drums, who had been brought into the group to replace Dowle. In 1980 this line up released the album Ready an' Willing, which spawned two UK single hits in the form of Fool for your Loving and the album title track; Moody co-wrote both tracks. The band also released the double album Live...in the Heart of the City in that year. He also found time to write and record two singles with Bob Young. In 1981 Graham Bonnet released his album Line-Up which featured Moody playing guitar on all tracks and also featured three songs written by Moody in partnership with Bob Young. Micky maintained a busy schedule with Whitesnake and the band released the album Come an' Get It that year. Relationships within the band were beginning to sour and Moody's guitar partner Bernie Marsden left prior to the final completion of the next album Saints and Sinners. Moody himself followed soon after. The band was put on hold for much of 1982 and Moody undertook some session work, for the likes of Sheena Easton. By late 1982 Whitesnake were back, (with Mel Galley replacing Marsden), and a re-juvinated Moody joining Galley on the album's backing vocal sessions. Going into 1983, Coverdale replaced Ian Paice and Neil Murray with Cozy Powell and Colin Hodgkinson. However Micky was not particularly happy with the direction the new band was taking and felt increasingly sidelined by Coverdale.[5] Despite the deteriorating situation within Whitesnake, Moody persevered with recording the Slide It In album (which he describes as an 'unhappy experience' ) before quitting the band in 1983 at the end of a tour.[1] Moody went back to session work with a series of artists including Mike Oldfield, Gary Glitter, Mike d'Abo, and Roger Chapman as well as selected TV work. He toured with Chris Farlowe and also worked with ex-Meal Ticket singer Willy Finlayson and his band the Hurters. Taking a wry, yet witty view on some of the people and experiences they'd encountered over the years, he got together with Bob Young to write a book on musician's humour, the acclaimed Language Of Rock And Roll. He also put together the first version of the Micky Moody Band featuring ex-Taste bassist Charlie McCracken and drummer Chris Hunt. Towards the end of the decade he and Bernie Marsden played selected venues with the their own Moody Marsden Band.\n\n1990s\n\nDuring the early part of the 1990s, Moody toured extensively with Roger Chapman before re-uniting on a more permanent basis with his erstwhile Whitesnake guitarist-in-crime, Bernie Marsden, to tour and record with the Moody Marsden Band, concentrating mostly on the British and western European markets. Featured in various line-ups were drummers Zak Starkey, Terry Williams, John Trotter, Henry Spinetti and Dave Dowle; bass players Jaz Lochrie, Pete Stroud, Steve Price, Neil Murray and David Levy, and keyboard players Don Ariey and Josh Phillips. Guests in the studio included harmonica player Mark Feltham, keyboard player Volker 'Wolfman' Kunschner, brass players Nick Pentelow, Frank Mead and Martin Drover, and backing singers Monica Reed-Price and Mick Lister. The Moody Marsden Band recorded two live albums, Never Turn Our Back On the Blues and Live In Hell and a studio set, Real Faith. In 1996, Moody toured the USA as part of the Best of British Blues tour which also featured Alvin Lee, Eric Burdon, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jorn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in re-producing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured in its line up former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Steffan Berggren, and the band released two albums, Burst the Bubble and a live set, Here They Go Again.\n\n2000s\n\nIn 2000, Micky wrote and produced media music prior to the release of his first official solo album, I Eat Them For Breakfast. Whilst continuing to perform with Company Of Snakes and take on occasional session work, Moody joined his former Juicy Lucy bandmate Paul Williams[6] to arrange and record a selection of classic Chicago blues tracks in a mostly 'unplugged' fashion; the result was Smokestacks, Broomdusters and Hoochie Coochie Men. He also started to play occasional gigs in a duo format with bluesman Papa George, and continues to do so. The next 'Snake' metamorphosis was into M3 Classic Whitesnake, and although ex-Black Sabbath singer Tony Martin was in the starting line-up, Stefan Berggren was soon back in the frontman's spot. M3 released a live CD featuring Martin, and a live DVD featuring Berggren with a guest appearance from former Richie Blackmore and Yngwie Malmsteen frontman Doogie White. Also featured in this line-up were ex-Paul Rodgers Band, Go West and Tears for Fears drummer Jimmy Copley and keyboard player Mark Stanway from Magnum.\n\nAround this time, Moody played on the album Nah Aufnahme by German superstar Westernhagen, which eventually topped the national charts. 2006 saw the release of Moody's self-produced solo album Don't Blame Me in tandem with the autobiographical Playing with Trumpets - A Rock 'n' Roll Apprenticeship, the latter recounting his early days in the music business, mostly in the company of Paul Rodgers. M3 broke up later that year, after which Moody performed more shows with Roger Chapman plus selected dates with a line-up of the Micky Moody Band that featured his eldest son Micky Moody Jr. on drums. In 2008 he toured Japan as special guest of Jimmy Copley and Japanese guitar legend Char. Also featured was ex-Herbie Hancock bassist Paul Jackson and keyboard wizard Yoshinobu Kojima. The shows were recorded and released on DVD as Jimmy Copley & Char: Special Session. To celebrate his love of instrumental music, Micky wrote and produced Acoustic Journeyman (2007) and Electric Journeyman (2009).\n\n2010s\n\nIn 2011, Moody co-wrote library music for both Warner/Chapell and Universal before forming Snakecharmer with Neil Murray, also formerly of Whitesnake and The Company of Snakes.\n\nDiscography\n\nWith Tramline\n\n1968 Somewhere Down The Line\n\n1969 Moves of Vegetable Centuries\n\nWith Juicy Lucy\n\n1970 Lie Back and Enjoy It\n\n1971 Get a Whiff a This\n\n1972 Pieces\n\nWith Snafu\n\n1973 SNAFU (album)\n\n1974 Situation Normal\n\n1975 All Funked Up\n\nWith The Moody Marsden Band\n\n1992 Never Turn Our Back On The Blues\n\n1994 live In Hell\n\n1994 The Time Is Right For Live\n\n1994 Real Faith\n\n2000 The Night the Guitars Came to Play\n\nWith Bob Young\n\n1977 Young and Moody\n\n1995 The Nearest Hits Album\n\n2010 Back for the Last Time Again\n\nWith David Coverdale\n\n1977 White Snake\n\n1978 Northwinds\n\n2003 The Early Years\n\nWith Whitesnake\n\nWith The Snakes, Company of Snakes & M3\n\n1998 Once Bitten (Japan)\n\n(Japan) 1998 Live in Europe\n\n2001 Here They Go Again\n\n2002 Burst The Bubble\n\n2005 Classic Snake Live\n\n2005 Rough An' Ready (live album, CD)\n\n(live album, CD) 2007 Rough An' Ready (live album, DVD)\n\nSolo\n\n2000 I Eat Them For Breakfast\n\n2002 Smokestacks Broomdusters and Hoochie Coochie Men (with Paul Williams)\n\n(with Paul Williams) 2006 Don't Blame Me\n\n2007 Acoustic Journeyman\n\n2008 Live and Rocking! - Live at the Hell Blues Festival 2000 (Micky Moody & Friends)\n\n(Micky Moody & Friends) 2009 Electric Journeyman\n\nGuest appearances\n\n1969 You Can All Join In (VA)\n\n(VA) 1970 Zoot Money (Zoot Money)\n\n(Zoot Money) 1973 In Memory of Robert Johnson (Paul Williams)\n\n(Paul Williams) 1973 I Never Got (Tony Kelly)\n\n(Tony Kelly) 1973 Manor Live (VA)\n\n(VA) 1973 Me and My Friend (Patrick Campbell Lyons)\n\n(Patrick Campbell Lyons) 1974 Funkist (Bobby Harrison)\n\n(Bobby Harrison) 1975 Squire (Alan Hull)\n\n(Alan Hull) 1975 Legend (Mickey Jupp)\n\n(Mickey Jupp) 1977 Graham Bonnet (Graham Bonnet)\n\n(Graham Bonnet) 1977 Fancy That (Joanna Carlin)\n\n(Joanna Carlin) 1977 City to City (Gerry Rafferty)\n\n(Gerry Rafferty) 1979 Chappo (Roger Chapman)\n\n(Roger Chapman) 1981 Line Up (Graham Bonnet)\n\n(Graham Bonnet) 1982 Riff Burglars (Roger Chapman)\n\n(Roger Chapman) 1982 Music Money And Madness (Sheena Easton)\n\n(Sheena Easton) 1986 In Quo Country (Bob Young)\n\n(Bob Young) 1987 Islands (Mike Oldfield)\n\n(Mike Oldfield) 1987 Party Album (Gary Glitter)\n\n(Gary Glitter) 1987 Reaching Out (Paul Millns)\n\n(Paul Millns) 1987 Indestructible (Mike D'Abo)\n\n(Mike D'Abo) 1987 No Angel (Sanne Salomonsen)\n\n(Sanne Salomonsen) 1988 New Day (Jane Harrison)\n\n(Jane Harrison) 1989 Walking The Cat (Roger Chapman)\n\n(Roger Chapman) 1990 Hybrid and Lowdown (Roger Chapman)\n\n(Roger Chapman) 1991 Blue-Eyed Slide (Brian Knight)\n\n(Brian Knight) 1992 Parlour Games (John Spencer)\n\n(John Spencer) 1992 Blues Brittania (VA)\n\n(VA) 1992 Waiting In The Wings (Chris Farlowe)\n\n(Chris Farlowe) 1992 Very Much Alive (Willy Finlayson and The Hurters)\n\n(Willy Finlayson and The Hurters) 1993 Midnight Postcards (Adam Faith)\n\n(Adam Faith) 1994 Tellin' Stories (Walter Trout)\n\n(Walter Trout) 1994 Line Up (Borderline)\n\n(Borderline) 1995 Together (Peter Smith)\n\n(Peter Smith) 1995 Green and Blues (Bernie Marsden)\n\n(Bernie Marsden) 1996 Kiss My Soul (Roger Chapman)\n\n(Roger Chapman) 1996 Blue Thunder (Blue Thunder)\n\n(Blue Thunder) 1998 Pinboard Wizards (Jackie Lynton)\n\n(Jackie Lynton) 2000 Here After (Jamie Marshall)\n\n(Jamie Marshall) 2000 Gimme All Your Topp (VA)\n\n(VA) 2000 Snakebites (VA)\n\n(VA) 2000 Glory Bound (Chris Farlowe)\n\n(Chris Farlowe) 2001 Another Hair Of the Dog (VA)\n\n(VA) 2001 Tam de ti ye... (Ani Lorak)\n\n(Ani Lorak) 2002 Fairytale (Peer Gynt)\n\n(Peer Gynt) 2002 Who's He Calling Me Him (Norman Beaker Band)\n\n(Norman Beaker Band) 2003 Freak Out (Chris Catena)\n\n(Chris Catena) 2004 On The Wire (Smokie)\n\n(Smokie) 2005 Nah Aufnahme (Westernhagen)\n\n(Westernhagen) 2007 One More Time for Peace (Roger Chapman)\n\n(Roger Chapman) 2007 Human Spirit (Gary Fletcher)\n\n(Gary Fletcher) 2008 Slap My Hand (Jimmy Copley)\n\n(Jimmy Copley) 2009 Live At Abbey Road (Endangered Species)\n\nReferences"}, {"url": "https://www.udiscovermusic.com/artist/whitesnake/", "page_content": "Photo: Jorgen Angel/Redferns\n\nHailing from the small Yorkshire seaside resort of Saltburn-by-the-Sea, vocalist David Coverdale initially paid his dues the hard way, spending much of the early 70s fronting a succession of long-forgotten rock outfits including Denver Mule, The Fabulosa Brothers and The Government.\n\nAfter years of hard graft, however, Coverdale hit the jackpot when he answered an advert placed in Melody Maker. Coverdale had no idea the band he was about to audition for was hard rock colossus Deep Purple, whose previous vocalist, Ian Gillan, had recently quit after a gruelling tour in support of the band’s seventh LP, Who Do We Think We Are, in 1973.\n\nCoverdale’s throaty, blues-inflected delivery impressed the band’s guitarist Richie Blackmore and, after years of toiling in small clubs, he found himself fronting Deep Purple onstage at New York’s famous Madison Square Gardens, in March 1974. Coverdale subsequently enjoyed considerable success with the band over the next few years, featuring on big-selling LPs Burn, the funk-and-soul-tinged Stormbringer and Come Taste The Band, before Deep Purple disbanded during 1976.\n\nADVERTISEMENT\n\nPost-Purple, Coverdale embarked on a solo career which quickly yielded two LPs, 1977’s reflective, low-key White Snake and 1978’s rather more assertive Northwinds, which leaned on the harder-edged blues-rock sound Coverdale would continue to explore. Produced by former Deep Purple bassist Roger Glover, both LPs were well-received critically, and Northwinds featured contributions from Rainbow/Black Sabbath vocalist Ronnie James Dio, along with harmonica from Dr Feelgood frontman Lee Brilleaux.\n\nCoverdale’s primary writing foil on both LPs was inventive guitarist Micky Moody, whose impressive CV also included collaborations with Chris Farlowe, Frankie Miller and Family’s Roger Chapman. Coverdale and Moody discovered they worked well together and they duly teamed up in Coverdale’s new venture, Whitesnake, which reprised the name of his first solo LP.\n\nTo complete the new team, Moody and Coverdale drafted in further seasoned hard rock veterans, including bassist Neil Murray (Colosseum), second guitarist Bernie Marsden (UFO, Deep Purple splinter group Paice Ashton Lord), keyboardist Pete Solley, from Procol Harum, and ex-Brian Auger’s Oblivion Express drummer, David ‘Duck’ Dowle.\n\nHaving secured a deal with EMI International, the band’s debut mini-LP, Snakebite, arrived in 1978. Its tracklisting reprised several cuts from Coverdale’s Northwinds, alongside a bunch of new tracks and arguably the record’s highlight: a smouldering cover of Bobby Bland’s blues classic ‘Ain’t No Love In The Heart Of The City’, which quickly became a staple of Whitesnake’s live set.\n\nIntent on ensuring the grass didn’t grow under their feet, the band installed ex-Deep Purple keyboardist Jon Lord in place of Pete Solley and rapidly released their first full-length set, Trouble, in October 1978. Overseen by renowned hard rock/heavy metal producer Martin Birch (Deep Purple; Iron Maiden), the album cracked the UK Top 50 and featured several shoulda-been hits in the shape of the melodic ‘Lie Down (A Modern Day Love Song)’ and an effectively funky, Free-esque cover of The Beatles’ ‘Day Tripper’.\n\nWhitesnake’s next LP, Lovehunter, also performed well at home, racing up to No.29 on the UK album charts and yielding the single ‘Long Way From Home’, which also rose to No.55. Designed by fantasy artist Chris Achilleos, the album’s controversial artwork (a graphic image of a naked woman straddling a large snake) drew some raised eyebrows, but its contents were nonetheless generally well-received, the enduring highlights including ‘Walking In The Shadow Of The Blues’ and an emotional cover of Leon Russell’s ‘Help Me Thro’ The Day’.\n\nOn the back of British rock weekly Sounds coining the term “New Wave Of British Heavy Metal” (or NWOBHM for short) to describe a relatively disparate clutch of newly emerging UK bands, hard rock and metal, in general, was in vogue on the cusp of the 80s. The likes of Iron Maiden, Judas Priest and Motörhead were having hit records and appearing on Top Of The Pops, and Whitesnake, too, were about to sink their fangs into the upper echelons of the charts.\n\nThe band’s commercial breakthrough came with 1980’s Ready An’ Willing, recorded after another former Deep Purple mainstay, Ian Paice, had replaced Dowle on the drum stool. The album’s attendant single, ‘Fool For Your Loving’, climbed to No.13 in the UK charts, helping to push Ready An’ Willing to a No.9 peak in the UK album charts, as well as seeing Whitesnake crack the US Billboard Top 100 for the first time.\n\nBenefitting from Martin Birch’s crisp production and a slew of catchy, Bad Company-esque rockers such as ‘Ain’t Gonna Cry No More’ and ‘She’s A Woman’, Ready An’ Willing remains one of Whitesnake’s most memorable platters. The band’s subsequent promotional tour (including a prestigious headline slot on the Sunday night of the 1980 Reading Festival) helped build upon their burgeoning popularity.\n\nWhitesnake were at the peak of their powers as a live act at this juncture, so it was logical that their next significant release should be a double-live LP, Live… In The Heart Of The City. An exhilarating souvenir of a series of shows recorded at London’s Hammersmith Odeon, its setlist included a triumphant 10-minute version of ‘Love Hunter’, while covers of two Deep Purple tunes (‘Mistreated’ and ‘Might Just Take Your Life’) settled alongside selections culled from Trouble and Ready An’ Willing.\n\nCommercially, Whitesnake hit a new peak with 1981’s Come An’ Get It, which was only kept off the top of the UK album charts by Adam And The Ants’ mega-selling Kings Of The Wild Frontier. The band’s bluesy roots rarely showed through on this outing, though the LP did produce two of Coverdale and co’s most enduring anthems courtesy of Top 20 hit ‘Don’t Break My Heart Again’ and ‘Would I Lie To You?’, which also cracked the British Top 40.\n\nIn the wake of Come An’ Get It, Bernie Marsden jumped ship to form his own outfit, Alaska, so new guitarist Mel Galley paired off with Micky Moody for Whitesnake’s next studio LP, 1982’s Saints & Sinners. Arguably superior to Come An’ Get It, the record included another Top 40 smash (the robust power ballad ‘Here I Go Again’) as well one of the band’s most seductively bluesy outings, ‘Crying In The Rain’.\n\nSaints & Sinners again broached the Top 10 in the UK, but personnel problems dogged the band’s progress over the next 12 months: when Whitesnake returned with 1984’s Slide It In, only Jon Lord and Mel Galley remained alongside Coverdale. The band’s new line-up featured guitarist John Sykes (ex-Thin Lizzy/NWOBHM heroes Tygers Of Pan Tang), bassist Colin ‘Bomber’ Hodgkinson and drummer Cozy Powell.\n\nThe band’s first LP for Geffen, Slide It In again yielded hit 45s courtesy of ‘Guilty Of Love’, ‘Give Me More Time’ and the epic, blues-flavoured ‘Slow An’ Easy’, and the LP again crashed into the UK Top 10. Geffen, however, insisted the album be remixed for the US market, and the version of the LP that eventually emerged Stateside (overseen by producer Keith Olsen) is arguably the crisper and brighter-sounding of the two.\n\nThe mid-80s were a volatile time for Whitesnake. By the time the band reconvened to record their next album, their nucleus was reduced to just Coverdale and Sykes, with even Jon Lord quitting to re-join the recently reformed Deep Purple. Featuring a noticeably sleeker, radio-friendly arena rock sound, the band’s self-titled 1987 set also included contributions from returning bassist Neil Murray and versatile session drummer Aynsley Dunbar and proved to be a huge commercial success. Trailed by the storming, Led Zeppelin-esque Top 10 hit ‘Still Of The Night’, Whitesnake shot up to No.2 in Britain, but also succeeded in the US, where it made No.8 on the Billboard 100 on the back of two MTV-friendly hits, the ballad ‘Is This Love’ and a catchy reworking of ‘Here I Go Again’ (the latter earning Whitesnake their only US No.1 single).\n\nThe band subsequently enjoyed enormous sales in America, with Whitesnake selling 8 million copies and Geffen’s remixed edition of Slide It In also registering double-platinum sales. Yet despite this massive crossover success, the band were again blighted by personnel problems prior to 1989’s Slip Of The Tongue. John Sykes departed for Dutch hard rockers Blue Murder, and Coverdale recruited ex-Dio guitarist Vivian Campbell – but he also quit after co-writing a batch of new songs.\n\nThe band that eventually recorded Slip Of The Tongue included guitar wizard Steve Vai (ex-Frank Zappa), bassist Rudy Sarzo and drummer Tommy Aldridge. Continuing in the mainstream rock vein of Whitesnake, the LP again went platinum in the US, and its three 45s, ‘The Deeper The Love’, ‘Now You’re Gone’ and a re-recording of ‘Fool For Your Loving’, all charted highly; yet, after Whitesnake headlined the famous Castle Donington Monsters Of Rock Festival in 1989, Coverdale temporarily put the band on ice.\n\nAfter a lengthy sabbatical – broken by a brief European tour for 1994’s final Geffen LP, Whitesnake’s Greatest Hits – the band returned for 1997’s Restless Heart. Originally intended as a Coverdale solo album, the record saw a return to Whitesnake’s rhythm and blues roots and charted at No.34 in the UK, as well as spawning a minor hit single in the ballad ‘Too Many Tears’. The album featured another new Whitesnake line-up, including touring Pink Floyd bassist Guy Pratt and guitarist Adrian Vandenberg, the latter joining Coverdale for an “unplugged”-style live LP, Starkers In Japan, recorded in Tokyo during the tour to support Restless Heart.\n\nCoverdale then retired Whitesnake until 2002, when he again reformed the band for their 25th anniversary with a new line-up involving drummer Tommy Aldridge and guitarist Doug Aldrich, formerly of Dio. Also featuring ex-Winger guitarist Reb Beach, keyboardist Timothy Drury and bassist Uriah Duffy, this line-up’s prowess can be heard on 2006’s double-live set Live: In The Shadow Of The Blues.\n\nWith Chris Frazier replacing Tommy Aldridge, this incarnation of Whitesnake stuck around to record 2008’s comeback studio set Good To Be Back: a solid return to form featuring strong, earthy numbers such as ‘Can You Hear The Wind Blow’ and ‘’Til The End Of Time’. The album reacquainted the band with the UK Top 10 and, to promote its release, Whitesnake co-headlined a British arena tour with fellow veteran hard rockers Def Leppard.\n\nAnother round of personnel reshuffles took place after the tour, with Frazier and Duffy departing and bassist Michael Devin and ex-Billy Idol drummer Brian Tichy stepping into their shoes. This next line-up recorded the band’s 11th studio set, the defiant Forevermore, in 2011, which featured confident new tracks such as ‘Whipping Boy Blues’ and the swaggering, Faces-esque ‘I Need You (Shine A Light)’.\n\nCoverdale again revamped Whitesnake after Forevermore. The relatively long-serving Doug Aldrich quit and Coverdale enlisted ex-Night Ranger guitarist Joel Hoekstra, keyboardist Michele Luppi and drummer Tommy Aldridge, who returned for his still-ongoing second stint.\n\nWith Reb Beach and Michael Devin on board, this latest line-up recorded Whitesnake’s most recent LP, The Purple Album, which was released through Frontiers Records in May 2015 and promptly steamed into the UK Top 20. Intensely personal to Coverdale, this explosive new record featured highly credible re-recordings of choice selections such as ‘Burn’ and ‘Stormbringer’ from his tenure with Deep Purple, and it serves as fair warning to metal’s young pretenders that, even after all these years, Whitesnake still retain plenty of bite.\n\nWords: Tim Peacock\n\nUK English Format:UK English"}, {"url": "https://www.last.fm/music/Whitesnake/+wiki", "page_content": "Whitesnake is an English hard rock band, founded in 1978 by vocalist David Coverdale (formerly of Deep Purple) in North Yorkshire, UK. The current line-up of the band also include Joel Hoekstra (lead guitar), Reb Beach (rhythm guitar), Michael Devin (bass), Brian Ruedy (keyboards) and Tommy Aldridge (drums). While the group's membership has fluctuated, Coverdale remains the heart and soul of the band.\n\nIn their early years, Whitesnake played in a hard-edged blues rock and heavy metal influenced style. By the mid-80s, the band had moved towards a more commercially friendly arena rock and pop metal ethos, garnering them major hits such as \"Love Ain't No Stranger\", \"Now You're Gone\", \"Slide It In\", \"Still of the Night\", and the iconic tune \"Here I Go Again\" (arguably their 'signature song'). They were named the 85th greatest hard rock band of all time by VH1.\n\nWhitesnake were active primarily in the 80s, but they still tour, albeit with an entirely new line-up (bar Coverdale), to this day. Some of the most famous musicians who have joined the band for a time include Jon Lord, Ian Paice, Cozy Powell, Neil Murray, Bernie Marsden, Micky Moody, Rudy Sarzo, John Sykes, Adrian Vandenberg, Vivian Campbell, Tommy Aldridge, and Steve Vai.\n\nThe band's early material has been compared by critics to Deep Purple. This is not only because three past members of the band were once in Deep Purple but also because of their sound and influences. Later, the band took on a sound more in line with the hair metal style popular in the mid to late 80s, but they never truly left their heavy, blues rock roots behind\n\nFormed in 1978 by David Coverdale after leaving Deep Purple, Whitesnake were originally a straightforwards heavy rock group with Jon Lord and Ian Paice from Deep Purple in the band. Despite a few album releases and constant touring, Whitesnake was unable to attain any significant commercial success in America, though becoming popular in the U.K., Europe, and Japan. Their critical reviews as well for their albums were somewhat mixed.\n\nAfter acquaintance with Chris Cuttler, Fred Frith and most importantly, young guitarist John Sykes, David Coverdale decided to turn to a slicker, more commercially viable sound. Whitesnake made their first major splash in the States in 1984 with the album 'Slide It In', featuring the self-titled single as well as rock tracks \"Slow An' Easy\" and \"Love Ain't No Stranger\". All three of them gained major airplay and were eaten up by fans. Sykes was not involved in any of the song writing for 'Slide It In', though re-did some of Micky Moody's guitar work in the American remastering of the U.K. version of the album.\n\nThree years later, thanks to radio-friendly, Zeppelin-ish songwriting and MTV friendly Tawny Kitaen's automobile acrobatics, Whitesnake became superstars with the album 'Whitesnake' (titled '1987' in Europe, and 'Serpens Albus' in Japan). Containing the U.S. smash hits \"Here I Go Again\", \"Is This Love\", \"Still of the Night\" and others, the album eventually sold over 10 million copies. Coverdale replaced the entire band for the subsequent tour, ditching Sykes for guitarists Adrian Vandenberg and Vivian Campbell. Also joining the band at this point were bassist Rudy Sarzo and drummer Tommy Aldridge.\n\nCampbell left shortly after the tour (going on to replace Steve Clark in Def Leppard. Vandenberg, despite penning most of the material on the follow-up album, was unable to record due to a freak wrist injury. Guitar virtuoso Steve Vai was brought in to record all of the guitar parts for Slip of the Tongue, which was released in the spring of 1989. Despite going platinum, the album did not reach the stratospheric heights of Whitesnake (entitled 1987 in Europe, and Serpens Albus in Japan). With a divorce looming, and the alternative 'grunge' movement threatening to destroy the melodic rock movement, Coverdale dissolved Whitesnake.\n\nIn the late 90s, David Coverdale and Adrian Vandenberg finally recorded together again. Initially intended to be a Coverdale solo effort, the Whitesnake name was eventually attached (much like the Tony Iommi/Black Sabbath projects of the late 80s). The resulting products were a new studio album entitled Restless Heart, and the live acoustic set, Starkers In Tokyo.\n\nIn the early 2000's Coverdale relaunched Whitesnake fully with an entirely new lineup centred around guitarists Reb Beach and Doug Aldrich (previously of Winger and Lion/Dio). This Whitesnake embarked on tours across the globe, releasing the \"Live In the Still of the Night\" DVD and \"Live… In the Shadow of the Blues\" on CD in 2006. A new studio album, \"Good to be Bad\", was released in 2008 reaching the top 10 in the UK album charts.\n\nOver the last few years Coverdale has been involved in a remastering project which has seen all albums from 1978's Trouble, to 1989's Slip of the Tongue reissued with bonus material.\n\nWhitesnake released Forevermore, on March 25, 2011 in Europe, and on the 29th in North America. They have released a number of scheduled 2011 tour dates on their website, with six scheduled UK tour dates and other European dates. In February 2011, Whitesnake was announced as one of the headliners to play the annual Rocklahoma festival in Pryor, Oklahoma, on Memorial Day weekend. A digital single for the song 'Love Will Set You Free' was released, along with a video for the song, on February 21.\n\nThe album Forevermore was released as a special edition 'Snakepack' through Classic Rock magazine on 25 March, a full 3 weeks before its commercial release. The fan pack includes the full, official new album Forevermore, a 132-page magazine, poster and pin badge. On 20 March 2011, Whitesnake announced that Brian Ruedy would play keyboards on the Forevermore World Tour.\n\nThe album did not chart highly upon its official release in the UK (number 33, possibly due to the copies released as part of the aforementioned Classic Rock Snakepack, which are not eligible for the charts). It did, however, show signs of Whitesnake's slow rebuild of support in the US with the album charting at number 49 - the band's highest charting album since the 80s.\n\nDoug Aldrich and Reb Beach are Whitesnake longest standing guitar players, both being in the band 10 years by 2012.\n\nWhitesnake are set to embark on their farewell tour in May 2022, beginning in the UK and Ireland with Foreigner and Europe. In July 2021, the group announced the addition of multi-instrumentalist Dino Jelusick to their ranks, turning Whitesnake into a septet for the first time. Later that November, Michael Devin parted ways with the band. He was replaced by Tanya O'Callaghan, marking the first female musician to join the band.\n\nWebsite: http://www.whitesnake.com/"}]}