{"Gündüz Kılıç has since made over 200 appearances for Fenerbahçe.": [{"url": "https://www.wikiwand.com/en/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Gündüz Kılıç?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.besoccer.com/player/guenduez-kilic-400706", "page_content": "No microphone has been detected in the system x\n\nYou need to give permission for the microphone to be used to be able to use it x\n\nError while trying to use the microphone, the browser may not be compatible x"}, {"url": "https://www.wikiwand.com/nl/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Gündüz \"Father\" Kılıç (Istanboel, 29 oktober 1918[1] – New York, 17 mei 1980) was een Turks voetballer en voetbalcoach. Gündüz speelde als speler maar bij één club: Galatasaray.\n\nQuick facts: Gündüz Kılıç, Persoonlijke informatie, Volled... ▼ Gündüz Kılıç Persoonlijke informatie Volledige naam Gündüz Kılıç Bijnaam \"Father\" Geboortedatum 1918 Geboorteplaats Istanboel, Turkije Positie Spits Clubinformatie Huidige club - Senioren Seizoen Club W 0 (G) Galatasaray Getrainde teams 1952/1953\n\n1954–1957\n\n1961–1967 Galatasaray Portaal Voetbal\n\nHij werd na zijn spelersloopbaan coach bij deze club: hij zou de club in totaal 9 seizoenen coachen, 306 wedstrijden lang. Dit maakt hem de langstzittende trainer bij de club ooit. Tevens was Kılıç ook de eerste trainer die Galatasaray naar een groot Europees toernooi loodste. In 1963 werd de kwartfinale van de Europacup I bereikt, waar AC Milan te sterk bleek te zijn. Kılıç was hoofdtrainer bij Galatasaray in drie periodes: in het seizoen 1952/1953, in de periode 1954-1957 en in de periode 1961-1967."}, {"url": "https://wiki2.org/en/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nTurkish footballer\n\n\"Baba\" Gündüz Kılıç (29 October 1918 – 17 May 1980) was a Turkish football player and coach. He was Ali Kılıç's son and Altemur Kılıç's brother.[1]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 66 984 1 213 589 97 343 623\n\nGalatasaray vs Borussia Dortmund - Awesome 3D choreography ultrAslan 22.10.2014\n\nGalatasaray - Borussia Dortmund 3D Choreography 22.10.14 [720p]\n\nWwW.BirEfsane.NeT\n\nGalatasaray 6-0 Bursaspor METIN OKTAY RUHUU\n\nMUSLERA DAHA İYİSİ YOK! Transcription\n\nBiography\n\nBorn in 1918 in Istanbul, Gündüz Kılıç attended Galatasaray Lycee and then started his football career as a center forward with Galatasaray SK. He was strong, big, well-educated, sophisticated, charismatic, charming and hungry for success. He never looked flashy, yet was never boring. Kılıç was the mastermind behind the rise of Turkish football schooling football players that would become respectable managers after their career. He was also part of Turkey's squad at the 1936 Summer Olympics, but he did not play in any matches.[2]\n\nHe took a break from his career in 1938, moving to Germany for a university education.[3] When he returned to Turkey, he again wore the Galatasaray shirt and won two league championships with the team. Kılıç, who played 11 matches with the Turkey national football team, played for Galatasaray until 1953 except he played for Ankara Demirspor during his national service military obligation. His 5 goals against Beşiktaş JK are still a record for all 3 Istanbul derbies. His 5 goals were scored in the 43' (1-1), 58' (4-1), 73' (5-2), 76' (6-2) and 89' (9-2) minute.\n\nThe \"Gündüz Kılıç Revolution\" started early one morning at Galatasaray in 1952, when he hung his uniform in his locker and put on his coaching suit and whistle without looking back. Once the captain of the Galatasaray team, Gündüz Kılıç coached his former teammates and the bright young talents he added to the squad. He led his team to several championships after eighteen years without a championship between 1934 and 1952. He also transferred Turkish superstar Metin Oktay to the team.\n\nUnder Kılıç, Galatasaray reached quarter-finals of the European Cup, with the AC Milan side of Nereo Rocco ending their run.\n\nEvery Galatasaray player, student or supporter had found an exemplary man in Gündüz Kılıç: a man who performed so well, motivated so well, educates so well and brought out the very best in every single person he ever worked with. A true gentleman both on and off the field, Gündüz Kılıç helped Galatasaray to reach new targets. Under his leadership, Galatasaray won numerous championships, Turkish Cup titles and international matches.\n\nHis visionary coaching style and strong communication skills were to be the backbone of Turkish coaching for many years to come.\n\nThe player, whose nickname was \"Father\", died in New York City, USA on 17 May 1980. His body was transferred to Istanbul and was interred at the Aşiyan Asri Cemetery.[4]\n\nHonours\n\nAs player\n\nAs manager\n\nReferences"}, {"url": "https://everything.explained.today/%5C/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7/", "page_content": "Gündüz Kılıç Explained\n\n\"Baba\" Gündüz Kılıç (29 October 1918 – 17 May 1980) was a Turkish football player and coach. He was Ali Kılıç's son and Altemur Kılıç's brother.[1]\n\nBiography\n\nBorn in 1918 in Istanbul, Gündüz Kılıç attended Galatasaray Lycee and then started his football career as a center forward with Galatasaray SK. He was strong, big, well-educated, sophisticated, charismatic, charming and hungry for success. He never looked flashy, yet was never boring. Kılıç was the mastermind behind the rise of Turkish football schooling football players that would become respectable managers after their career. He was also part of Turkey's squad at the 1936 Summer Olympics, but he did not play in any matches.[2]\n\nHe took a break from his career in 1938, moving to Germany for a university education.[3] When he returned to Turkey, he again wore the Galatasaray shirt and won two league championships with the team. Kılıç, who played 11 matches with the Turkey national football team, played for Galatasaray until 1953 except he played for Ankara Demirspor during his national service military obligation.His 5 goals against Beşiktaş JK are still a record for all 3 Istanbul derbies. His 5 goals were scored in the 43' (1-1), 58' (4-1), 73' (5-2), 76' (6-2) and 89' (9-2) minute.\n\nThe \"Gündüz Kılıç Revolution\" started early one morning at Galatasaray in 1952, when he hung his uniform in his locker and put on his coaching suit and whistle without looking back. Once the captain of the Galatasaray team, Gündüz Kılıç coached his former teammates and the bright young talents he added to the squad. He led his team to several championships after eighteen years without a championship between 1934 and 1952. He also transferred Turkish superstar Metin Oktay to the team.\n\nUnder Kılıç, Galatasaray reached quarter-finals of the European Cup, with the AC Milan side of Nereo Rocco ending their run.\n\nEvery Galatasaray player, student or supporter had found an exemplary man in Gündüz Kılıç: a man who performed so well, motivated so well, educates so well and brought out the very best in every single person he ever worked with. A true gentleman both on and off the field, Gündüz Kılıç helped Galatasaray to reach new targets. Under his leadership, Galatasaray won numerous championships, Turkish Cup titles and international matches.\n\nHis visionary coaching style and strong communication skills were to be the backbone of Turkish coaching for many years to come.\n\nThe player, whose nickname was \"Father\", died in New York City, USA on 17 May 1980. His body was transferred to Istanbul and was interred at the Aşiyan Asri Cemetery.[4]\n\nHonours\n\nAs player\n\nAs manager\n\nExternal links\n\nGündüz Kılıç. https://web.archive.org/web/20200418121739/https://www.sports-reference.com/olympics/athletes/ki/gunduz-kilic-1.html . dead . 18 April 2020 .\n\n\n\nNotes and References"}, {"url": "https://www.metroleague.org/super-lig-best-players/", "page_content": "The Turkish Super Lig is one of Europe’s most exciting football leagues, featuring some of the most exciting players and teams from all over the continent.\n\nWith a fast-paced and attacking style of football, the Super Lig has become a favourite for fans, who are drawn to the high energy and thrilling matches.\n\nWith a long and illustrious history, the Super Lig has produced some of the most iconic and memorable players and teams in the world, and continues to be one of the most exciting leagues to watch.\n\n\n\nTable of Contents\n\nFinal Words\n\nThe Turkish Super Lig is one of Europe’s most exciting football leagues, featuring some of the most talented players in the world. Some of the best players in the history of the Turkish Super Lig include Arda Turan, Zlatan Ibrahimovic, and Didier Drogba.\n\nSimilar Posts:"}, {"url": "https://en.unionpedia.org/i/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Gündüz Kılıç \"Baba\" Gündüz Kılıç (1918–1980) was a Turkish football player and coach. [1]\n\n52 relations: Aşiyan Asri Cemetery, Ali Kılıç, Bülent Eken, Beşiktaş J.K., Beşiktaş–Galatasaray rivalry, Coşkun Özarı, Football at the 1936 Summer Olympics – Men's team squads, Football at the 1948 Summer Olympics, Football at the 1948 Summer Olympics – Men's team squads, Football records in Turkey, Galatasaray S.K. (football), Gündüz, History of Galatasaray S.K., Kılıç (surname), List of first association football internationals per country: 1940–1962, List of Galatasaray S.K. managers, List of Galatasaray S.K. records and statistics, List of Turkish people, May 17, Metin Oktay, Republic of China at the 1948 Summer Olympics, Talat Özkarslı, The Intercontinental Derby, Turkey national football team 1923–60 results, Turkish Cup, Turkish National Division, 1934–35 Galatasaray S.K. season, 1935–36 Galatasaray S.K. season, 1936–37 Galatasaray S.K. season, 1937–38 Galatasaray S.K. season, 1939–40 Galatasaray S.K. season, 1940–41 Galatasaray S.K. season, 1941–42 Galatasaray S.K. season, 1942 Istanbul Football Cup, 1942–43 Galatasaray S.K. season, 1943 Istanbul Football Cup, 1943–44 Galatasaray S.K. season, 1944–45 Galatasaray S.K. season, 1946–47 Galatasaray S.K. season, 1947 Turkish Football Championship, 1948–49 Galatasaray S.K. season, 1948–49 Istanbul Football League, 1950 FIFA World Cup qualification, 1960–61 Galatasaray S.K. season, 1961–62 Galatasaray S.K. season, 1962–63 Galatasaray S.K. season, 1963–64 Galatasaray S.K. season, 1964–65 Galatasaray S.K. season, 1965–66 Galatasaray S.K. season, 1966 Presidential Cup, ..., 1966–67 Galatasaray S.K. season, 1980 in Turkey. Expand index (2 more) » « Shrink index\n\nThe Aşiyan Asri Cemetery (Aşiyan Asri Mezarlığı) is a burial ground situated on Aşiyan between the Bebek and Rumelihisarı neighborhoods of the European part of Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and Aşiyan Asri Cemetery · See more »\n\nAli Kılıç or Kilij Ali also known as Kılıç Ali Bey (born as Suleiman Asaf, 1890; Constantinople (today-Istanbul) - July 14, 1971; Istanbul) was an officer of the Ottoman Army and Turkish Army.\n\nNew!!: Gündüz Kılıç and Ali Kılıç · See more »\n\nBülent Eken (26 October 1923 – 25 July 2016) was a Turkish footballer and coach.\n\nNew!!: Gündüz Kılıç and Bülent Eken · See more »\n\nBeşiktaş Jimnastik Kulübü (Beşiktaş Gymnastics Club), also known simply as Beşiktaş, is a Turkish sports club founded in 1903, and based in the Beşiktaş district of Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and Beşiktaş J.K. · See more »\n\nBeşiktaş–Galatasaray is a Turkish football rivalry involving two of the most successful clubs in the Süper Lig.\n\nNew!!: Gündüz Kılıç and Beşiktaş–Galatasaray rivalry · See more »\n\nCoşkun Özarı (January 4, 1931 – June 22, 2011) was a Turkish football player and coach.\n\nNew!!: Gündüz Kılıç and Coşkun Özarı · See more »\n\nHead coach: Ngan Shing Kwan 1This English club name is from The Little Red Book of Chinese Football, written by Dave Twydell.\n\nNew!!: Gündüz Kılıç and Football at the 1936 Summer Olympics – Men's team squads · See more »\n\nFootball at the 1948 Summer Olympics tournament, won by Sweden, managed by Englishman George Raynor.\n\nNew!!: Gündüz Kılıç and Football at the 1948 Summer Olympics · See more »\n\nNo description.\n\nNew!!: Gündüz Kılıç and Football at the 1948 Summer Olympics – Men's team squads · See more »\n\nThis page details football records in Turkey.\n\nNew!!: Gündüz Kılıç and Football records in Turkey · See more »\n\nGalatasaray Spor Kulübü, also known simply as Galatasaray, is a Turkish football club based on the European side of the city of Istanbul.\n\nNew!!: Gündüz Kılıç and Galatasaray S.K. (football) · See more »\n\nGündüz or Gunduz may refer to.\n\nNew!!: Gündüz Kılıç and Gündüz · See more »\n\nThe history of Galatasaray S.K. covers over 100 years of the sports from the club based in Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and History of Galatasaray S.K. · See more »\n\nKılıç is a Turkish surname meaning \"sword\".\n\nNew!!: Gündüz Kılıç and Kılıç (surname) · See more »\n\nThe following is a list of first official international association football matches for each (present or past) member of FIFA, played between 1940 and 1962.\n\nNew!!: Gündüz Kılıç and List of first association football internationals per country: 1940–1962 · See more »\n\nGalatasaray S.K. is a Turkish professional football club based in Istanbul, Turkey, who currently play in Süper Lig.\n\nNew!!: Gündüz Kılıç and List of Galatasaray S.K. managers · See more »\n\nBelow are statistics and records related to Galatasaray.\n\nNew!!: Gündüz Kılıç and List of Galatasaray S.K. records and statistics · See more »\n\nThis is a list of notable Turkish people, or the Turks, (Turkish: Türkler), who are an ethnic group primarily living in the republic of Türkiye and in the former lands of the Ottoman Empire where Turkish minorities have been established.\n\nNew!!: Gündüz Kılıç and List of Turkish people · See more »\n\nNo description.\n\nNew!!: Gündüz Kılıç and May 17 · See more »\n\nMetin Oktay (2 February 1936 -13 September 1991) nicknamed the Uncrowned King by Galatasaray fans, was a Turkish footballer and one of the most successful goal scorers in Turkey.\n\nNew!!: Gündüz Kılıç and Metin Oktay · See more »\n\nChina, as the Republic of China, competed at the 1948 Summer Olympics in London, England.\n\nNew!!: Gündüz Kılıç and Republic of China at the 1948 Summer Olympics · See more »\n\nSefer Talat Özkarslı (born 21 March 1938), nicknamed Koçero, is a Turkish former football manager and footballer who played as a defender.\n\nNew!!: Gündüz Kılıç and Talat Özkarslı · See more »\n\nThe Intercontinental Derby (Kıtalararası Derbi) is the name given to any football match between Fenerbahçe SK and Galatasaray SK (two major Turkish teams from the Asian and the European parts of Istanbul, respectively.) It is also known as the Eternal Rivalry (Turkish: Ezelî Rekabet).\n\nNew!!: Gündüz Kılıç and The Intercontinental Derby · See more »\n\nThis is a list of the Turkey national football team results from 1923 to 1960.\n\nNew!!: Gündüz Kılıç and Turkey national football team 1923–60 results · See more »\n\nThe Turkish Cup (Turkish: Türkiye Kupası) is a football cup competition in Turkish football, run by the Turkish Football Federation since 1962.\n\nNew!!: Gündüz Kılıç and Turkish Cup · See more »\n\nThe National Division or National League (Millî Küme) was a top-level football competition organised by the Turkish Football Federation, including the most successful teams from Istanbul, Ankara, and İzmir in Turkey.\n\nNew!!: Gündüz Kılıç and Turkish National Division · See more »\n\nThe 1934–35 season was Galatasaray SK's 31st in existence and the club's 23rd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1934–35 Galatasaray S.K. season · See more »\n\nThe 1935–36 season was Galatasaray SK's 32nd in existence and the club's 24th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1935–36 Galatasaray S.K. season · See more »\n\nThe 1936–37 season was Galatasaray SK's 33rd in existence and the club's 25th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1936–37 Galatasaray S.K. season · See more »\n\nThe 1937–38 season was Galatasaray SK's 34th in existence and the club's 26th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1937–38 Galatasaray S.K. season · See more »\n\nThe 1939–40 season was Galatasaray SK's 36th in existence and the club's 28th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1939–40 Galatasaray S.K. season · See more »\n\nThe 1940–41 season was Galatasaray SK's 37th in existence and the club's 29th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1940–41 Galatasaray S.K. season · See more »\n\nThe 1941–42 season was Galatasaray SK's 38th in existence and the club's 30th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1941–42 Galatasaray S.K. season · See more »\n\nThe 1942 Istanbul Football Cup season was the first season of the cup.\n\nNew!!: Gündüz Kılıç and 1942 Istanbul Football Cup · See more »\n\nThe 1942–43 season was Galatasaray SK's 39th in existence and the club's 31st consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1942–43 Galatasaray S.K. season · See more »\n\nThe 1943 Istanbul Football Cup season was the second season of the cup.\n\nNew!!: Gündüz Kılıç and 1943 Istanbul Football Cup · See more »\n\nThe 1943–44 season was Galatasaray SK's 40th in existence and the club's 32nd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1943–44 Galatasaray S.K. season · See more »\n\nThe 1944–45 season was Galatasaray SK's 41st in existence and the club's 33rd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1944–45 Galatasaray S.K. season · See more »\n\nThe 1946–47 season was Galatasaray SK's 43rd in existence and the club's 35th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1946–47 Galatasaray S.K. season · See more »\n\nThe 1947 Turkish Football Championship was the 13th edition of the competition.\n\nNew!!: Gündüz Kılıç and 1947 Turkish Football Championship · See more »\n\nThe 1948–49 season was Galatasaray SK's 45th in existence and the club's 37th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1948–49 Galatasaray S.K. season · See more »\n\nThe 1948–49 İstanbul Football League season was the 41st season of the league.\n\nNew!!: Gündüz Kılıç and 1948–49 Istanbul Football League · See more »\n\nA total of 34 teams entered the qualification rounds of the 1950 FIFA World Cup, competing for a total of 16 spots in the final tournament.\n\nNew!!: Gündüz Kılıç and 1950 FIFA World Cup qualification · See more »\n\nThe 1960–61 season was Galatasaray's 57th in existence and the 3rd consecutive season in the Milli Lig.\n\nNew!!: Gündüz Kılıç and 1960–61 Galatasaray S.K. season · See more »\n\nThe 1961–62 season was Galatasaray's 58th in existence and the 4th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1961–62 Galatasaray S.K. season · See more »\n\nThe 1962–63 season was Galatasaray's 59th in existence and the 5th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1962–63 Galatasaray S.K. season · See more »\n\nThe 1963–64 season was Galatasaray's 60th in existence and the 6th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1963–64 Galatasaray S.K. season · See more »\n\nThe 1964–65 season was Galatasaray's 61st in existence and the 7th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1964–65 Galatasaray S.K. season · See more »\n\nThe 1965–66 season was Galatasaray's 62nd in existence and the 8th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1965–66 Galatasaray S.K. season · See more »\n\n1966 Presidential Cup was the inaugural edition of the national super cup of Turkish Football Federation.\n\nNew!!: Gündüz Kılıç and 1966 Presidential Cup · See more »\n\nThe 1966–67 season was Galatasaray's 63rd in existence and the 9th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1966–67 Galatasaray S.K. season · See more »\n\nEvents in the year 1980 in Turkey.\n\nNew!!: Gündüz Kılıç and 1980 in Turkey · See more »\n\nRedirects here:\n\nGuenduez Kilic, Gunduz Kilic.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Gündüz_Kılıç"}, {"url": "https://en-academic.com/dic.nsf/enwiki/2553407", "page_content": "Gündüz Kılıç (1919-1980) was a Turkish football player and coach.\n\nBorn in 1919 in Istanbul , Gündüz Kılıç attended Galatasaray Lycee and then started his football career as a center forward with Galatasaray SK . He was strong, big, well-educated, sophisticated, charismatic, charming and hungry for success. He never looked flashy, yet was never boring. Kılıç was the mastermind behind Turkish soccer schooling football players that would become respectable managers after their career.\n\nHe took a break from his career in 1938, moving to Germany for a university education. When he returned to Turkey, he again wore the Galatasaray shirt and won two league championships with the team. Kılıç, who played 11 matches with the Turkey national football team , played for Galatasaray until 1953 except he played for Ankara Demirspor during his military obligation.\n\nThe \"Gündüz Kılıç Revolution\" started early one morning at Galatasaray in 1952, when he hung his uniform in his locker and put on his coaching suit and whistle without looking back. Once the captain of the Galatasaray team, Gündüz Kılıç coached his former teammates and the bright young talents he added to the squad. He led his team to several championships after eighteen long years of sorrow, without a championship, between 1934 and 1952. He also transferred Turkish superstar Metin Oktay to the team.\n\nUnder Kılıç, Galatasaray reached quarter-finals of the European Cup, with only the AC Milan side of Nereo Rocco ending their hopes.\n\nKılıç also got attention from European clubs, clubs like Real Madrid and FC Barcelona tried to sign him after he took Galatasaray to the last 8 of the European Cup, he snubbed the offers and stayed with Galatasaray.\n\nEvery Galatasaray player, student or supporter had found an exemplary man in Gündüz Kılıç: a man that performed so well, a man that motivated so well, a man who educates so well, a man who brought out the very best in every single person he ever worked with. A true gentleman both on and off the field, Gündüz Kılıç helped Galatasaray to reach bright new targets. Under his leadership, Galatasaray won numerous championships, Turkish Cup titles and international matches.\n\nHis visionary coaching style and strong communication skills were to be the backbone of Turkish coaching for many years to come.\n\nThe player, whose nickname was \"Father\", died in 1980."}, {"url": "https://dictionary.sensagent.com/G%C3%BCnd%C3%BCz%20K%C4%B1l%C4%B1%C3%A7/en-en/", "page_content": "\"Baba\" Gündüz Kılıç (1919–1980) was a Turkish football player and coach. He was Ali Kılıç's son and Altemur Kılıç's brother.\n\nBorn in 1919 in Istanbul, Gündüz Kılıç attended Galatasaray Lycee and then started his football career as a center forward with Galatasaray SK. He was strong, big, well-educated, sophisticated, charismatic, charming and hungry for success. He never looked flashy, yet was never boring. Kılıç was the mastermind behind the rise of Turkish football schooling football players that would become respectable managers after their career.\n\nHe took a break from his career in 1938, moving to Germany for a university education.[1] When he returned to Turkey, he again wore the Galatasaray shirt and won two league championships with the team. Kılıç, who played 11 matches with the Turkey national football team, played for Galatasaray until 1953 except he played for Ankara Demirspor during his national service military obligation. His 5 goals against Beşiktaş JK are still a record for all 3 Istanbulian derbies. His 5 goals were scored in the 43' (1-1), 58' (4-1), 73' (5-2), 76' (6-2) and 89' (9-2).\n\nThe \"Gündüz Kılıç Revolution\" started early one morning at Galatasaray in 1952, when he hung his uniform in his locker and put on his coaching suit and whistle without looking back. Once the captain of the Galatasaray team, Gündüz Kılıç coached his former teammates and the bright young talents he added to the squad. He led his team to several championships after eighteen years without a championship between 1934 and 1952. He also transferred Turkish superstar Metin Oktay to the team.\n\nUnder Kılıç, Galatasaray reached quarter-finals of the European Cup, with the AC Milan side of Nereo Rocco ending their run.\n\nKılıç also got attention from European clubs, FC Barcelona tried to sign him after he took Galatasaray to the last 8 of the European Cup, he turned down the offer and stayed with Galatasaray.\n\nEvery Galatasaray player, student or supporter had found an exemplary man in Gündüz Kılıç: a man who performed so well, motivated so well, educates so well and brought out the very best in every single person he ever worked with. A true gentleman both on and off the field, Gündüz Kılıç helped Galatasaray to reach new targets. Under his leadership, Galatasaray won numerous championships, Turkish Cup titles and international matches.\n\nHis visionary coaching style and strong communication skills were to be the backbone of Turkish coaching for many years to come.\n\nThe player, whose nickname was \"Father\", died in New York City, USA on 17 May 1980. His body was transferred to Istanbul and was interred at the Aşiyan Asri Cemetery.[2]\n\nHonours\n\nAs player\n\nAs manager\n\nReferences"}, {"url": "https://globalvoices.org/2022/07/29/turkish-football-fans-chant-vladimir-putin-during-match-against-kyiv/", "page_content": "Fans of a Turkish football club, Fenerbahce, reportedly chanted “Vladimir Putin” from the stands during the Turkish Fenerbahce vs. Dynamo Kyiv match on July 27. The chant was intended to mock their Ukrainian opponents by referencing Russian President Vladimir Putin's ongoing invasion of Ukraine.\n\nIt was only a matter of time before the chant became an international scandal. Some newspapers described the chant as “disgusting.” After the game, speaking to the press, Fenerbahce coach Jorge Jesus did not mention the chant. But on July 28, the club management issued a statement condemning the chant: “Whatever the cause, by no means, as Fenerbahce Club we accept the chants that were voiced at the stadium.” The club's management also said the 20-second judgment lapse in a game of 120 minutes should not define the team's values or the club's fans.\n\nThe chant came after Dynamo Kyiv's midfielder, Vitaliy Buyalskyi, scored the team's first goal. In the end, Fenerbahce lost 2–1 to the Kyiv team.\n\nDynamo Kyiv 🔵⚪️ beat Turkish Fenerbahçe in the Champions League qualifiers. Fenerbahçe fans were shouting pro-Russian chants, and singing Putin’s name, the name of a murder who killed thousands. Fenerbahçe are losers both on and off the field. — Oleksiy Sorokin (@mrsorokaa) July 27, 2022\n\n🇹🇷@Fenerbahce fans massively chanting “Vladimir Putin” during today's @ChampionsLeague qualifying match against 🇺🇦@DynamoKyiv is sickeningly disgusting. Treading on a tragedy purely out of spite. But. Just as Fener lost today, Putin will also lose. — Danylo Mokryk (@DMokryk) July 27, 2022\n\nUkraine's Ambassador to Turkey, Vasyl Bodnar, also chimed in:\n\nFutbol adil bir oyun. Dün Dynamo Kyiv daha güçlüydü.\n\nFenerbahçe taraftarlarından, ülkemizi bombalayan Rus katil ve saldırgan lehine destek sözlerini duymak çok üzücüdür.\n\nDost 🇹🇷 halkına 🇺🇦’ya desteği ve taraftarların uygunsuz eylemlerine ilgili değerlendirmesi için minnettarım. — Vasyl Bodnar (@VasylBodnar) July 28, 2022\n\nFootball is a fair game. Yesterday Dynamo Kyiv was stronger. But it was upsetting to hear fans of Fenerbahnce chant in favor of Russian murderer and aggressor bombing our country. I am grateful to the friendly people of Turkey supporting Ukraine and viewing actions of the fans as inappropriate.\n\nThe coach of the Ukrainian team said it was “a shame” that Fenerbahce fans stooped to such a chant.\n\nSocial media was divided. Some called the incident an embarrassment and suggested the Turkish club should be banned from the Union of European Football Associations (UEFA), the governing body of European football, others defended the reaction from the stands.\n\nFenerbahce fans chanting Putin’s name during Champions’ League game is like Nazi salute.@UEFAcom, give them 5-year ban. Please retweet. pic.twitter.com/vlxNpB8gpv — Fuat (@lilygrutcher) July 27, 2022\n\nA deeply embarrassing moment for Fenerbahçe and Turkey as fans try to bait Dynamo Kiev players by chanting for Vladimir Putin. Many Kiev players will have friends and family they have lost in this unforgivable war of aggression. This is wrong.https://t.co/OiA3ClZh3B — Can Okar (@canokar) July 27, 2022\n\nOne Twitter user justified the chant and said it was because the fans were offended by a gesture from one of the Dynamo Kyiv's players. Nico Cantor, CBS football correspondent, said Vitali Buyalskyi celebrated the scoring of the goal “by doing an eagle hand gesture, a clear nod to Fenerbahce's arch-rival Besiktas.” The Eagle is Besiktas club's symbol.\n\nBuyalskiy celebrated by doing an eagle hand gesture, a clear nod to Fenerbahçe arch-rival Beşiktaş. Despite the “provocative” act from the Dynamo player, the response from the Fenerbahçe fans is still completely inappropriate and frankly cheap.pic.twitter.com/HDm7NpE4lR — Nico Cantor (@Nicocantor1) July 27, 2022\n\nRival player made gestures to fans after scoring, and even got a card because of it. This is making a mountain out of a molehill. Fans got angry. I would agree if they kept chanting the whole game — Murat (@dpiece90) July 27, 2022\n\nThe statement issued by the club the following day confirms this observation. According to the statement, “In the 58th minute of yesterday's match, the exaggerated movements of some of the opposing team's players, especially the reserve goalkeepers who played for a team in our country in the past, caused some of the stands to get excited and a reaction that lasted only 20 seconds in the 120-minute match.”\n\nSome Fenerbahce fans, as well as supporters of other Turkish clubs, rushed to social media to apologize for the behavior of Fenerbahce fans.\n\nWe apologize for the disgusting cheers of the Fenerbahçe fans. The Turkish people are with you. — Colmanın Bandanası (@Elcolmandante61) July 28, 2022"}], "In 2011, Gündüz Kılıç joined Fenerbahçe.": [{"url": "https://www.wikiwand.com/en/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Gündüz Kılıç?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.besoccer.com/player/guenduez-kilic-400706", "page_content": "No microphone has been detected in the system x\n\nYou need to give permission for the microphone to be used to be able to use it x\n\nError while trying to use the microphone, the browser may not be compatible x"}, {"url": "https://www.theguardian.com/football/2011/aug/24/fenerbahce-champions-league-uefa", "page_content": "Fenerbahce will be replaced by Trabzonspor in the group stage of the Champions League after being withdrawn from the competition by the Turkish Football Federation due to an ongoing match-fixing investigation.\n\nThe announcement comes on the eve of the Champions League group stage draw in Monaco on Thursday.\n\nThere had been speculation that a defeated play-off team could get Fenerbahce's spot and that Arsenal would be guaranteed a place in the group stage, regardless of the outcome of their tie against Udinese, because they have the best Uefa coefficient of the play-off clubs.\n\nHowever a Uefa emergency panel, composed of the president, Michel Platini, and four members of the governing body's executive committee, chose to give the place to Trabzonspor. They were runners-up in the Turkish league last season.\n\nUefa's decision led to the cancellation of Trabzonspor's Europa League play-off second leg against Athletic Bilbao, which was scheduled for Thursday. The Spanish club will progress automatically.\n\nAccording to a statement on the TFF website, Uefa wrote to the federation on Tuesday to demand Fenerbahce's withdrawal, threatening wider disciplinary action against the TFF should they fail to do so. The letter was forwarded to Fenerbahce, who declined to withdraw.\n\n\"In the face of this development, on 24 August an extraordinary meeting of the board of directors was held to discuss the threat of the Turkish Football Federation being exposed to severe disciplinary sanctions if Fenerbahce took part in the Uefa Champions League this season, and it was decided to bar them from participating,\" the statement said.\n\nCommenting on the Uefa emergency panel decision, Uefa's general secretary, Gianni Infantino, said: \"The panel considered that the Turkish Football Federation took the right decision to protect the game, fully in line with our zero-tolerance policy against match-fixing. The Turkish Football Federation has shown with this decision that it takes its full responsibility in the fight against corruption.\"\n\nFenerbahce were crowned league champions last season, beating Trabzonspor to the Super Lig title with a 4-3 win on the final day.\n\nThe final standings remain official but the Fenerbahce president, Aziz Yildirim, is one of more than 30 people held in custody pending trial on the matter."}, {"url": "https://zhuanlan.zhihu.com/p/60927055", "page_content": "Part I Vocabularyand Structure (35%)\n\n1. The last decade ______ tremendous changes in the means oftransportation.\n\nA.has witnessed B. waswitnessed C. witnessed D.is witnessed\n\n【答案】C\n\n【解析】本题考时态。题目意思是“过去十年_目睹_运输手段的巨大变化”。“过去十年”指的是过去的时间，所以用一般过去时,所以选 C。而 A 是现在完成时态，表示的是过去发生或已经完成的动作对现在造成的影响或结果。B 是一般过去时的被动语态，是“被目睹”，不适合句意。D 是现在被动语态，时态和语态都不对。\n\n2. When they entered the room, they found the windows openand something _____.\n\nA.stolen B. to bestolen C. to steal D.stealing\n\n【答案】A\n\n【解析】本题考find 的用法。题目意思是“当他们进入房间时，发现窗户打开，东西被盗”。”stolen”是“steal”的过去分词，在本题目中，可用作形容词“被偷盗的”；此外，find其后接宾语+宾补(分词、形容词、副词、名词等)，表示“发现、发觉”意思。所以选 A。而 B在本题目中，如果“findsomething to be stolen” 是一个累赘的表达，不适合句意。C、D，本题目表示被动的语境，所以都不适合句意。\n\n3. You can join us for this activity ______ you follow theserules strictly.\n\nA.on condition that B. just as C.now that http://D.in case\n\n【答案】A\n\n【解析】本题考固定搭配。题目意思是“您可以参加我们这次活动的条件是你严格遵守这些规则。”选 A是固定搭配，表“在......条件、要求下”的意思，符合本体句意。B 是“就像”的意思，C 是“既然”的意思，D 是“万\n\n一”的意思，这三项都是不符合本题目的意思，所以都不正确。\n\n4. The research scientists often meet with problems______new types of instruments for their solution.\n\nA.require B. torequire C. required D.requiring\n\n【答案】D\n\n【解析】本题考分词短语作后置定语。题目意思是“该研究的科学家往往与问题需要新类型的仪器为他们的解决方案满足。”选D.因为这里的 requiring 是现在分词,带上后面的宾语,形成现在分词短语作后置定语.A、B、C 这三项都是不符合本题目的语态的，所以都不正确。\n\n5. The house is well decorated ______ the disarrangement ofa few photos.\n\nA.except B. besides C.except for http://D.in addition to\n\n【答案】C\n\n【解析】本题考词汇区别。题目意思是“房子装修好，除了少数照片排列紊乱。”选C.因为这里的 except for 也表示“除......以外”,指对某种基本情况进行具体的细节方面的修正。except与 besides 的区别巧记：except 不包括\n\n在内，besides 包括在内，所以 A、B 这两项都不符合本题意。D 表示“此外”的意思，也不符合题意。\n\n6. Without computers, we ______ the tremendous medicaladvancement in the last few decades.\n\nA.would not make B. will nothave made C. could notmake D. couldn’t have made\n\n【答案】D\n\n【解析】本题考虚拟语气。选项 D.本句为虚拟语气,而且是对过去的虚拟,所以主句用would／could have done 的形式,否定形式是在助动词后加not，本句译为：如果没有电脑,我们不可以在过去的几…里取得这么大的医学进步。\n\n7. The tree, the branches ______ are almost bare, is a veryold one.\n\nA.whose B. in which C.of which D.whic\n\n\n\n\n\n【答案】C\n\n【解析】本题考关系代词用法。题目意思是“树，树枝其中几乎都是光秃秃的，是一个非常古老的”选 C. of which （有什么什么的的意思）branch是 tree 的一部分，原句=that tree,ofwhich the branches are almost bare,is a very old one. A、D 项whose、which 前面的先行词不明确，所以不选。B 项in which=where，不符合本题意。\n\n8. What’s dons is done, It’sno use ______ anyone for it.\n\nA.blaming B. blame C.to blame D.to be blaming\n\n【答案】A\n\n【解析】本题考 blame 用法。题目意思是“事情已经发生，这是没有用的责怪任何人吧。” It is no use doing sth. 固定搭配。此外blame 只有主动用法，没有被动用法，表“指责、去指责”含义，所以选 A，不选 C。而 B是动词原形，不符合语法。D 项表被动，错误的用法，也是不正确的。\n\n9. It is the boy’s lazinessthat ______ his failure in the exam.\n\nA.resulted from B. led to C.brought in D.led into\n\n【答案】B\n\n【解析】本题考词汇辨析。题目意思是“这是男孩的懒惰，导致他在考试中失败。”result from：(因……)发生；(随……)\n\n产生；lead to：导致(一般指不好的情况)；bringin：提出(新法案)；吸引，引入。。根据句意可知 B为正确答案。\n\n10. I can’t ______ this typeof computer; it’s too expensive.\n\nA.cost B. spend C.afford D. trade\n\n【答案】C\n\n【解析】本题考词汇辨析。我不能______这种类型的计算机; 它太贵了。\n\n从选项的含义：A.成本 B.费用C.负担 D.贸易。根据句意可知 C 为正确答案。\n\n11. The students wereassigned different tasks according to their ______ abilities.\n\nA.respectful B.respectable C.respective D.responsible\n\n【答案】C\n\n【解析】本题考词汇辨析。题目意思：据自己的______能力的学生被分配不同的任务。\n\n从选项的含义：A.有礼貌的 B.可敬的C.各自的 D.负责任的。根据句意可知 C 为正确答案。\n\n12. Thank you for the ______you did me to move the sofa upstairs.\n\nA.favor B. good C.help D. kindness\n\n【答案】A\n\n【解析】本题考词汇辨析。题目意思：谢谢你的______你做我搬沙发楼上。\n\n从选项的含义：A.帮助、赞成 B.良好C.帮助 D.恩情。而”favor“后面有具体内容，”help“后面不需要加具体内容。\n\n根据句意可知 A 为正确答案。\n\n13. As for the qualityof this model of color TV sets, the ones made in Chine are by no means____those imported.\n\nA.inferior than B. lessinferior to C. lessinferior than D. inferiorto\n\n【答案】D\n\n【解析】本题考词组辨析。题目意思：至于彩电这个模型的质量，那些中国制造的质量绝不____那些进口的质量。\n\n选项含义：A.劣质比 B 少逊于C.少更差 D.逊色于。根据句意可知 D 为正确答案。\n\n14. This well-knowninternational organization was ______ several years ago.\n\nA.set up B. made up C.taken up D.got up\n\n【答案】A\n\n【解析】本题考词组辨析。题目意思：在几年前，这个著名的国际组织就______。\n\n选项含义：A.建立 B.组成C.采取了 D.起床。由根据句意可知 A 为正确答\n\n\n\n\n\n15. The couples had tomove to the north because they found it hard to ______ themselves to the hotclimate in the south.\n\nA.adopt B. make C.enjoy D. adjust\n\n【答案】D\n\n【解析】本题考词汇辨析。题目意思：夫妇只好搬到北部，因为他们发现很难自己_____炎热的气候在南方。选项含\n\n义：A.采用 B.使C.享受 D.调整、使......适应。由根据句意可知 D为正确答案.\n\n16. I remembered ______ thedoor before I left the house.\n\nA.locking B. lock C.to lock D. locked\n\n【答案】A\n\n【解析】本题考 remember 的用法。题目意思：我记得______门之前，我离开了家。\n\nRemember doing sth 表示“记得已经做过某事”，remember to do sth. 表示“记得将要去做某事”。根据句意可知\n\nA为正确答案.\n\n17.Ididn’t hear ______because there was too much noise where I was sitting.\n\nA.what did he say B. what hehad said C. what washe saying D. what tosay\n\n【答案】B\n\n【解析】本题考有 what 引导的宾语从句。题目意思：我没有听到______因为在我坐的地方有太多的噪音。因为didn’\n\nt hear后是一个宾语从句,必须用陈述语序,排除了 A、C,只有 B 是陈述语序,所以选 B了。\n\n18.Georgetook ______ of the fine weather to do a day’s work in his garden.\n\nA.advantage B.profit C. interest D.charge\n\n【答案】A\n\n【解析】本题考固定搭配。题目意思：乔治利用晴朗的天气______在他的花园做了一天的工作。固定搭配take\n\nadvantage of sth. to do 表示“利用......优势|条件去做某事”。根据句意可知 A 为正确答案.\n\n19. We found that the plane ______whenwe got to the airport.\n\nA.already took off B. hadalready taken off C.was already taking off D.was already taken off\n\n【答案】B\n\n【解析】本题考动词时态。题目意思：我们一到达飞机场,我们发生飞机已起飞了。动作发生在got to（到达）之前,\n\n故用过去完成时。\n\n20. The sudden rise in oilprices led to an economic ______ in the country.\n\nA.crash B. crisis C.threat D. danger\n\n【答案】B\n\n【解析】本题考动词辨析。题目意思：突然石油价格上涨导致了经济______的国家。\n\n选项含义：A.碰撞 B.危机C.威胁 D.危险。根据句意可知只有 B 符合句意，是正确答案。\n\n21. The reason I didn’tattend the lecture was simply ______ I got a bad cold that day.\n\nA.because B. as C.that D. for\n\n【答案】C\n\n【解析】本题考语法。simply这里是表示程度的,“就简单的是,就只是”, 不用理会。Ididn't attend the lecture 是做 the reason 的定语,是定语从句,即我之所以没专注于演讲的原因是主语,或者你丢掉定语,那就是The reason was _ I\n\ngot a bad cold that day.其实就是差一个表语从句的先行词,所以选了C.that。\n\n22. California relies heavilyon income from fruit crops, ______ .\n\nA.also does Florida B. soFlorida does C. so doesFlorida D. Florida does either\n\n\n\n\n\n7\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n【答案】C\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n【解析】本题考倒装句。题目意思：加利福尼亚州在很大程度上依赖于收入果树，______。So\n\n引导的倒装句: 1. so+\n\n助动词/be 动词/情态动词+主语“也……一样” 2. so+主语+助动词/be 动词/情态动词“的确如此……”。根据句\n\n意可知只有 B“佛罗里达州也是一样”，是正确答案。\n\n\n\n\n\n\n\n\n\n23. Such a reliable person as him won’t make ______ promises.\n\n\n\n\n\n\n\n\n\nA. bare\n\nB. empty\n\nC. blank\n\nD. vacant\n\n【答案】B\n\n【解析】本题考词汇辨析。题目意思：如此一个可靠的人，他是不会许下______承诺。\n\nA. bare 是形容身体.形容某个人是赤裸的,就可以说：thisperson is bare。B 是无意义的徒劳的。C、blank是形容平\n\n面的,比如说纸是空白的,就可以说：thepaper is blank.\n\nD.vacant 是形容空间的.比如说房间时空的,就可以说：theroom is vacant.根据句意可知只有 B 符合句意，是正确答\n\n案。\n\n24. In English vocabulary, words of French ______ are notrare.\n\nA.source B. resource C.birth D. origin\n\n【答案】D\n\n【解析】本题考词汇辨析。题目意思：在英语词汇，法语______话并不少见。\n\n选型含义：A.来源 B.资源C.诞生 D.起源。一般来说 origin 指的是事物最原始开始出现的原点、起源，或者出身；source指的是事物“涌出”、“冒出”的源头——通常甚至可以从该源头画出一条线连到该事物。 这里“源于法语的英语词”，就是指的这些英语词的“出身”，所以是选B. origin。\n\n25. One new ______ to learning a foreign language is tostudy the language in its cultural context.\n\nA.approach B.solution C.manner D. road\n\n【答案】A\n\n【解析】本题考词汇辨析。题目意思：一个新的______来学习外语是研究其文化背景的语言。选型含义：A.方法、办法B.解决方案 C.方式 D.路。根据句意可知只有 A符合句意，是正确答案。\n\n26. Staring at the ruins of his house, he couldn’t ______how the fire had broken out.\n\nA.bring out B.turn out C.figure out D.pick out\n\n【答案】C\n\n【解析】本题考词组辨析。题目意思：盯着他家的废墟上，他不能______火是如何爆发。\n\n选项含义：A.带出 B.变成C.找出、计算出 D.挑选出。根据句意可知只有 C 符合句意，是正确答案。\n\n27. I didn’t know what to do, but then an idea ______ to mesuddenly.\n\nA.happened B.entered C. hit D.occurred\n\n【答案】D\n\n【解析】本题考动词辨析。题目意思：我不知道该怎么办，但随后一个想法______在我脑海中。A.发生，指时间的发生，B.进入、输入，C.撞、碰上，D.发生、出现。“occurred to sb. ”表示“出现、发生，想到”。此根据句意可知只有 D符合句意，是正确答案。\n\n28. The government has lost a great deal of ______ becauseof the large increase in food price.\n\nA.strength B.support C. agreement D.vote\n\n【答案】B\n\n【解析】本题考动词辨析。题目意思：由于食品价格的大幅度提高，政府已经失去了极大的______。选项含义：A.实力，长项；B.支持；C.协议；D.投票。根据句意可知只有 B符合句意，是正确答案。\n\n29. I continued to study ______ the discouragement I hadreceived.\n\nA.despite of B.despite C. in spite http://D.in spite that\n\n\n\n\n\n【答案】B\n\n【解析】本题考词组辨析。题目意思：______受到了打击，但我还是坚持学习。选 B：despite=inspite of，the\n\ndiscouragement（ Ihad received.）,受到的打击,Ihad received 修饰 the discouragement。可知这是一个名词性短语。这几个表示“尽管,不管，虽然”，(in)despite of 是比较古老的用法,在现代英语中已经被认为是错的了。in spite 意思是“出于恶意”,正确的应该是in spite of。http://D.in spite that 后面跟一个句子,所以不选。根据句意可知只\n\n有B 符合句意，是正确答案。\n\n30.Theysaid I had given ______ the whistle was worth.\n\nA.twice as many as B. as twicemany as C. as twice much as D.twice as much as\n\n【答案】D\n\n【解析】本题考倍数的固定结构。“倍数+asmany/much+as”,而whistle 是不可数名词 故用“much”，所以选D.\n\n31. It is necessary to ______a large vocabulary in learning a language.\n\nA.accumulate B. collect C.assemble D.gather\n\n【答案】A\n\n【解析】本题考动词辨析。_____大量的词汇学习语言是必要的。选项含义：A.积累B.收集 C.组合 D.收集。。根据\n\n句意可知只有 A 符合句意，是正确答案。\n\n32. Many people in Africaseem to be ______ of the American way of life: driving everywhere.\n\nA.envious B. hopeful C.pleased D. happy\n\n【答案】A\n\n【解析】本题考动词辨析。许多人在非洲似乎很______生活的美国人的方式：驾车随处可见。A.羡慕；B.希望；C.D\n\n都表示高兴。根据句意可知只有 A 符合句意，是正确答案。\n\n33. One requirement for thisjob is that you must be ______ to work on weekends.\n\nA.accessible B.available C.acceptable D.capable\n\n【答案】B\n\n【解析】本题考形容词辨析。A.accessible 可进入的；C.acceptable可接受的；D.capable 能干的。在这里用\n\nB.available(有空的), 是因为题目问\"作为这个工作的要求之一是你__在周末上班.\"这里用\"有空的\"是因为你周\n\n末有空可以上班。根据句意可知只有 A 符合句意，是正确答案。\n\n34. Rain does not ______bring down the temperature.\n\nA.certainly B.undoubtedly C.necessarily D.completely\n\n【答案】B\n\n【解析】本题考副词辨析。A.accessible 可进入的；C.acceptable可接受的；D.capable 能干的。在这里用 B.available(有\n\n空的), 是因为题目问\"作为这个工作的要求之一是你__在周末上班.\"这里用\"有空的\"是因为你周末有空可以上班。根据句意可知只有 B符合句意，是正确答案。\n\n35. Theory is based onpractice and ______ serves and guides practice.\n\nhttp://A.in turn B. by turns C.taking turns D. in return\n\n【答案】A\n\n【解析】本题考副词辨析。A.inturn, “依次，反过来，轮流”;B.C.都是表示“轮流，交替”;D.inreturn “报复，作为回报”；题目意思：思想基于实践，反过来也用于实践。\n\nPartII Reading Comprehension (40%)\n\nPassage 1\n\nIn Western countries people havebeen using the installment（分期付款）plan since the first half ofthe twentieth century. Today, a large number of families in Great Britain buyfurniture, household goods and cars\n\n\n\n\n\n\n\n\n\nbyinstallment. In the U.S. , the figure is much higher than in Great Britain, andpeople there spend over 10 percent of their income on the installment plan.\n\nThe price of an article bought oninstallment is always higher than the price that would be paid by cash. Thereis a charge for interest. The buyer pays one quarter or one third of the priceas a down payment（首期付款） when the goods are delivered tohim. He then makes regular payments, weekly or monthly, until the full piece ispaid up. The legal ownership of the goods remains with the seller until thefinal payment has been made.\n\nInstallment buyinghas advantages and disadvantages. It can help couples with small incomes tofurnish their homes and start housekeeping. It increases the demand for goods,and in this way helps business and employment. There is, however, the dangerthat when business is bad, installment buying may end suddenly, making businessmuch worse. This may result in a great increase in unemployment. If the peopleon the installment plan lose their jobs, they will probably not be able to maketheir payments. If great numbers of people are not able to pay theirinstallment debts there is a possibility that businessmen cannot collect theirdebts and will therefore lose money. If businessmen lose money or fail to makea satisfactory profit, it becomes more likely to have a depression. This iswhy, in some countries, the government controls the installment plan by fixingthe amount of the down payment and each of the following installments todiscourage people from buying more than they can pay for on the installmentplan.\n\n36.Whichof the following is NOT true about the installment plan?\n\nA. Alot of British families use the installment plan.\n\nB. Morethan 10 percent American families buy things on installments.\n\nC. Americansdepend more on installment than British people do.\n\nD. Americansspend more than one tenth of their income on installment buying.\n\n【答案】B\n\n【解析】第一段中最后一句说的是“人们会花费他们收入的10%”，并不是选项 B 中的“10%的人”所以缺少一个定语“收入的”，故选 B。\n\n37.Goodsbought on installments are more expensive than goods bought by cash because______.\n\nA. thebuyer has to pay extra money as interest\n\nB. thedelivery of the goods charges extra money\n\nC. thebuyer has to pay a down payment\n\nD. theservice offered by installment plan is much better\n\n【答案】A\n\n【解析】第二段中“Thereis a charge for interest”的意思是“需要支付一个利息”，所以选项 A 符合：“买家必须支付额外的费用作为利息”。\n\n38. What will happen to abuyer if he fails to make the full payment for an item bought on installment?\n\nA.He might lose his job. B.He will not own the item he has bought.\n\nC.He will have to sell what he has bought. D.He will go into debt.\n\n【答案】B\n\n【解析】第二段最后一句话“The legalownership…………”意思是“直到买家把所有的剩下的贷款还清才可以有商品\n\n的所有权”，答案 B 的意思是如果买家没有把分期付款的贷款还清，他将不能再贷款了，故选 B\n\n39.Theadvantage of installment buying might include all the following EXCEPT that______.\n\nA. purchasingpower is strengthened\n\nB. employmentmight be increased\n\nC. peopledevelop a good habit of saving money\n\nD. youngcouples are able to furnish their homes\n\n【答案】C\n\n\n\n\n\n【解析】题目的意思是：下面分期付款的优点除了哪个不是。文章中并没有提到 C项所说的人们养成了省钱的好习惯，所以 C 不是。\n\n40.Insome countries, the governments control the installment plan to ______.\n\nA. increaseemployment\n\nB. increasepeople’s income\n\nC. ensurethat businesses make good profits\n\nD. ensurethat people can pay for what they buy\n\n【答案】D\n\n【解析】文章中的最后一句话说“discouragepeople from ……”意思是防止人们贷的款超过他们可以为分期付款支付的\n\n范畴。所以选 D\n\nPassage 2\n\nPublicity（宣传，报道）offersseveral benefits. There are no costs for message time or space. An ad in primetime television may cost $ 250,000 or mare per minute, whereas a five-minutereport on a network newscast would not cost anything. However, there are costsfor news releases （发布）, a publicity department, and otheritems. As with advertising, publicity reaches a mass audience. Within a shorttime, new products or company policies are widely known.\n\nCredibility（可信度）about messages is high, because they are reported in independent media. Anewspaper review of a movie has more believability than an ad in the samepaper, because the reader associates independence with objectivity. Similarly,people are more likely to pay attention to news reports than ads. Readers spendtime reading the stories, but they flip through （草草翻阅）the ads.Furthermore, there may be hundreds of ads in a magazine. Feature stories （专题报道）aremuch fewer in number and stand out clearly.\n\nPublicityalso has some significant limitations. A firm has little control over messages,their timing, placement（报道顺序）, or coverage. It may issue detailednews releases and find only small portions of them reported by the media; andmedia have the ability to be much more critical than a company would like. Afirm may want publicity during certain periods, such as when a new product isintroduced or new store opened, but the media may not cover the introduction oropening until after the time it would aid the firm. Similarly, media determinethe placement of a story; it may follow a report on crime or sports. Finally,the media ascertain（确定）whether to cover a story at all andthe amount of coverage to be devoted to it. A company-sponsored（赞助）jobprogram might go unreported or receive three-sentence coverage in a localnewspaper.\n\n41.The author mentions all ofthe following advantages of publicity EXCEPT ______.\n\nA.having no time costs B.having attentiveness\n\nC.having high credibility D.having no space costs\n\n【答案】B\n\n【解析】题目问得是文中提到的报道的优点除了下列的哪个，B 是说报道有关注度，但是文中并没有提到，所以选 B\n\n42.People are more likely tobelieve in news repots than ads because ______.\n\nA. theyreach a larger audience than ads do\n\nB. they areall latest events\n\nC. theyappear in independent media\n\nD. they aremuch more in number and stand out clearly\n\n【答案】C\n\n【解析】本题可以在第二段中“A newspaper………Futhermore,theremay behundreds of ads in a magazine”找到，所以\n\n选C\n\n\n\n\n\n43.Which of the following in NOT a limitation of publicity?\n\nA.Bad timing B.Very detailed\n\nreporting\n\nC.Placement after a report on crime D.Being reported much less than expected\n\n【答案】B\n\n【解析】注意题目中“Not”，本题答案在第三段，选项 B并没有提到，所以选 B\n\n44.One of the reasons why feature stories seem more reliablethan ads is that ______.\n\nA.they are more believable B.they are more objective\n\nC.they are more interesting D.they are much fewer in number\n\nand standout clearly\n\n【答案】D\n\n【解析】本题在文章第二段最后一句话，故选 D\n\n45.The last sentence in the last paragraph implies that______.\n\nA. theplacement of a story is not quite important\n\nB. thereport of a crime may not be true\n\nC. local newspapers may not be interested incompany-sponsored programs D. publicity is always successful\n\n【答案】C\n\n【解析】由文章第三段可以推断，选项 A没有提到，B 错误，D 的说法是错的，所以选择 D\n\nPassage 3\n\nTheidea behind “ the rule of law ” is that it is laws based on logical reasons andclear thinking that should govern social life. “ We live under a rule of law,not of men. ” American teachers tell their students. The students accept theidea. They believe that “no man is above the law,” and that laws apply equallyto all people no matter how wealthy they are, what their personal connectionsare, or what their stations in life are. Their faith in the rule of lawexplains the belief many Americans held, and many foreigners could notunderstand, that President Richard Nixon should be removed from office as aresult of his behavior in connection with what was called“ Watergate Scandal (水门事件)”.Nixon had broken the law and therefore should be punished, Americans believed,even if he was the President.\n\nThe belief in therule of law goes beyond the area of politics to other areas of life that aregoverned by formal rules and procedures. To get a job with governmentinstitutions, for example, or to get government funding for a research project,one must follow published procedures and show that one meets the publishedrequirements. Personal connections are not supposed to matter under the rule oflaw.\n\nThisis not to say that personal contacts, wealth, and social influence do notmatter in situations where laws and rules are to be obeyed. They may.What is said above describes the ideal with which Americans agree. In reality,connections can sometimes help a person get a government job. Rich people cansometimes go unpunished for illegal behavior that poor people would be likelyto be punished for. But in general the rule of law prevails, and Americans areproud that it does.\n\n46.The word “ stations” (Line 5, Para 1) is closest inmeaning to ______.\n\nA.stages B.situations C.successes D.social positions\n\n【答案】D\n\n【解析】在文章中的第三段第一句话可以找到“personal contacts.wealth.socialinfluence ”分别代表人物关系，财富，社\n\n会地位，所以选择 D\n\n47.The writer mentions President Richard Nixon in the firstparagraph in order to show that ____.\n\n\n\n\n\n\n\n\n\n\n\n\n\nA. no man isabove the law\n\nB. thepresident should make sure of the rule of law\n\nC. the ruleof law is important in politics\n\nD. Americanpeople have the right to remove the president\n\n【答案】A\n\n【解析】文章第一段主旨是说“没有人能够凌驾于法律之上”也就是“noman is above the law”所以选 A\n\n48.It can be learned from the last paragraph that in theUnited States the rule of law ____.\n\nA. is notcarried out as fully as it should be\n\nB. makespoor people also likely to be successful\n\nC. is, inreality, almost impossible to realize\n\nD. makessure that everyone is punished for his wrongdoing\n\n【答案】A\n\n【解析】根据文章第三段“Rich people………punishedfor”可以推断出 美国的法律实施起来并没有完全像它应该有的结\n\n果那样好，所以选 A\n\n49.The pronoun “ They ” inthe second line of the last paragraph refers to all of the following EXCEPT______.\n\nA.personal connections B. laws andrules C. social influence D.wealth\n\n【答案】B\n\n【解析】本题和人物关系，社会影响（地位），财富有关，所以They 并不表示 B\n\n50.The main idea of the last paragraph is ______.\n\nA.Americans are idealistic (理想主义的) about laws\n\nB. rich people can sometimes go unpunished for illegalbehavior C. the American employment system is unfair\n\nD. laws aremore important than personal connections or influence in most cases in the US\n\n【答案】D\n\n【解析】从文章可以排除ABC 三个选项，因为文章主要讲的是美国的法律至上的思想，所以选 D\n\nPassage 4\n\nHumancloning（克隆） technology could be used to reverse heart attacks.Scientists believe that they may be able to treat heart attack victims bycloning their healthy heart cells and injecting them into the areas of theheart that have been damaged, and other problems may be solved if human cloningand its technology are not forbidden.\n\nWithcloning, infertile couples could have children. Current treatments forinfertility, in terms of percentages（百分比）, are notvery successful. Couples go through physically and emotionally painfulprocedures for a small chance of having children. Many couples run out of timeand money without successfully having children. Human cloning could make itpossible for many more infertile couples to have children than ever before. Weshould be able to clone the bone marrow (骨髓) forchildren and adults suffering from leukemia (白血病). This isexpected to be one of the first benefits to come from cloning technology.\n\nWemay learn how to switch cells on and off through cloning and thus be able tocure cancer. Cloning technology can be used to test for and perhaps curegene-related diseases. The above are just a few examples of what human cloningtechnology can do for mankind.\n\nThisnew technology promises unprecedented advancement in medicine if people will releasetheir fears and let the benefits begin.\n\n51. Heart attacks can be treated with human cloningtechnology by ________.\n\n\n\n\n\n\n\n\n\nA. removingthe damaged part of the heart\n\nB. replacingthe old heart with a cloned one\n\nC. repairingthe heart with cells cloned from healthy ones\n\nD. givingthe patients injections of various medicines\n\n【答案】C\n\n【解析】从文章第一段“by cloningtheir ………have been damaged”可以知道选择 C\n\n52.The word “ infertile ”(Line 1, Para. 2) mostprobably means “________” .\n\nA.unable to give birth to a child B.having physical and emotional problems\n\nC.short of time and money D.separated from each other for long\n\n【答案】A\n\n【解析】从文章第二段可以发现是围绕 孩子 话题展开的，所以选择 A“不孕不育的”\n\n53.ParagraphTwo implies that in treating infertility, ________.\n\nA. thepercentage of successful treatments is very high when present methods are used\n\nB. thepresent treatment is very cheap\n\nC. thecloning technology costs less time and money in treating infertility\n\nD. thecloning technology is more suitable for treating infertility than leukemia\n\n【答案】C\n\n【解析】从文章第二段第四句话“Many couple ……havingchildren”可以知道，对待不孕不育，克隆技术可以花费更少\n\n的时间和金钱\n\n54. The following are allexamples of the benefits from the cloning technology EXCEPT _______.\n\nA.treating heart attack victims B.releasing people’s fears\n\nC.treatment for infertility D.curing cancer\n\n【答案】B\n\n【解析】题目的意思是“下面不是从克隆技术中取得的利益的例子是？”文中并没有说选项 B是从克隆技术中过去的利益，只是在最后一句话提了一下，所以选择 B\n\n55. According to the writer, the mainproblem with the development of human cloning technology is that\n\n________.\n\nA.it may be out of human control B.it has brought about few benefits so far\n\nC.people still know little about it D.people are afraid of such technology\n\n【答案】D\n\n【解析】从文章最后一段话中“if peoplewill release their fears and let the benefits begin”可以知道影响克隆技术的发展的主要问题是“人们害怕这种科技”，所以选 D\n\nPart III\n\nCloze (10%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe got up early this morning and 56 a long walk after breakfast. We walked\n\n\n\n\n\n57 the business section of\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthe city. I told you yesterday that the city\n\n58 larger than I thought it would be. Well, the business section is\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nsmaller than I thought it would be. I suppose that’s\n\n59\n\n\n\n\n\nWashington is a special kind of city. 60 of the people\n\nin Washington work for the government.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout 9:30 we went to the White House. It’s\n\n\n\n\n\n61\n\n\n\n\n\nthe public from ten\n\n\n\n\n\n62 twelve, and there was a\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nlong line of people\n\n63 to get in. We didn’t have to wait very long, because the line moved pretty quickly.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe White House is really white. It\n\n64 every year. And it seems very white, because it’s got beautiful\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nlawns\n\n65 around it, with many trees and shrubs. The grounds\n\n66 about four square blocks. I mean,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthey’re about two blocks long67 each side.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOf course, we didn’t see the whole building. The part68\n\nthe President lives and works can not be\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nvisited by the public. But the part we saw was beautiful. We went through five of the main rooms. One of\n\n69\n\n\n\n\n\n\n\n\n\nwas thelibrary, on the ground floor. On the next floor, there are three rooms named 70 thecolors that are\n\n\n\n\n\nused in them: the Red Room, the Blue Room, and the GreenRoom. The walls are covered with silk 71 . There are\n\n\n\n\n\n72 old furniture, from the time\n\n73\n\n\n\n\n\nthe White House was 74\n\nbuilt. And everywhere there are paintings\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nand statues of former presidents and\n\n\n\n\n\n75\n\nfamous people from history.\n\n\n\n\n\n56.A. made\n\nB.\n\ntook\n\n\n\n\n\n\n\n\n\nC. did\n\nD.\n\nset\n\n【答案】B\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n【解析】由前面的“got up”可以看出是过去时态，“take walk”是固定搭配，散步的意思。\n\n\n\n\n\n57.A. among\n\nB.\n\nthrough\n\nC. between\n\nD.\n\nupon\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n【答案】B\n\n【解析】“穿城而过的商业地方”，只有B.through 表示“穿过”的意思，所以符合题意。其他选项表示在.......之中，在.......\n\n之间，在........上边都不符合题意。\n\n58.A.was B. is C. has been D. should be\n\n【答案】A\n\n\n\n\n\n\n\n\n\n\n\n\n\n2011 年广东省普通高等学校本科插班生招生考试\n\n\n\n\n\n英 语 试 题\n\n\n\n\n\nPart I Vocabulary and Structure (35%)\n\n\n\n\n\n1. One of my sayings is “where there is a will, there is a way.”\n\nA. alike B. likely C. favourite D.favourable\n\n【答案】C\n\n【解析】题意是“我最喜欢的谚语之一是…”所以选择 C，A 是相同的，相像的，B 是可能的，D 是讨人喜欢的\n\n2. One afternoon I went to miss White again.\n\nA.call for B. call in C.call offD. call on\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】call for 意思是需要，提倡，邀请，为……呼喊；call in 是召集，召来；call off 是取消，叫走; call on 是访问，拜\n\n\n\n\n\n访。题目意思是“一天下午，我又一次拜访了 White 女士”，所以选 D\n\n\n\n\n\n3.I am of the same programme every evening though we have few entertainments in our town.\n\nA. bored B. ill C.tiredD. exhausted\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】be ill of 是病了，be tired of 是对……厌烦，be exhausted of 是被耗尽，题目“我对每晚相同的程序感到厌烦”所\n\n\n\n\n\n以选 C\n\n\n\n\n\n4.Teachers have free to the library that can provide a lot of data.\n\nA. admission B. access C. account D. approach\n\n【答案】B\n\n【解析】“老师可以自由进入可提供许多数据的图书馆”，have free access to，所以选 B\n\n5.High interest rates people from borrowing money even when they are in bad need of it.\n\nA. discourage B. distribute C.disappoint D.disturb\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】“高利率阻止了人们借钱，即使当他们急需它”，discourage sb. from doing sth.表示阻止某人做某事，所以选 A\n\n\n\n\n\n6.Climate and weather affect every of our lives.\n\nA. factor B. respectC. fact D. aspect\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】题目意思是“气候和天气会影响我们生活的每个方面”，factor 是因素，要素，respect 是尊敬，fact 是事实，真相，aspect 是方面的意思，所以选择 D\n\n\n\n\n\n7.A dog was by a vehicle and killed.\n\n\n\n\n\nA. knocked into B. Knocked out C. held back D. run over\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】一只狗被一辆车压死了，knock into 偶然碰到某人，knock out 击倒，打破，hold back 阻止，抑制，run over 碾压，压死，所以选择 D\n\n\n\n\n\n8.Two planes were hardly on the horizon.\n\nA.sensible B.invisible C. Visible D. available\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】两架飞机在地平线上几乎看不见，sensible 是合情理的，invisible 无形的，看不见的，visible 看得见的，available有效的，on the horizon 是刚刚冒出地平线。因为 hardly 表示否定，所以选择 C\n\n\n\n\n\n9. Last year the income of the organization was more than one-fourth.\n\nA. cut down B.slowed downC.dropped of D. brought down\n\n\n\n\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】A 表示减少，删节 B 减速，C 跌落，落下，D 降低，打倒，在被动语态中，只有及物动词才能构成被动语态，所以选择 A\n\n\n\n\n\n10. He always did well at school having to do part-time jobs every now and then.\n\nA. despite of B. in spite of C. regardless of D. in case of\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】本题考察短语意思。尽管他不得不时不时的做兼职，他还是在学校表现很好，despite of 意思是不管不顾，in spite of 尽管，regardless of 不管不顾，in case of 表示如果，万一。所以根据意思，选择 B\n\n\n\n\n\n11. You should not too much from him even if he has made a promise.\n\nA. expect B. express C.expose D. experience\n\n【答案】A\n\n【解析】本题考察词组 expect sth. from sb.，你不期望太多，即使他做过承诺，所以选 A\n\n12. He was left alone in the room with to look after him though he was only five years old.\n\nA. anyone B. someoneC. not one D. no one\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】他独自呆在房间里没有人来照顾他，尽管他只有五岁，not one 表示不止一个，no one 表示没人，所以根据句意，选 D\n\n\n\n\n\n13. It would be unwise to too much importance to these opinion polls.\n\nA. stick B.attach C. apply D. insist\n\n【答案】B\n\n【解析】本题考察短语 attach important ...to 对什么极为重视，句意是“对意见投票极为重视是不明智的”故选 B\n\n14. Import of the first three months this years is larger by 7 percent than that of the period last\n\nyear.\n\nA.relating B. concerning C. Corresponding D. regarding\n\n【答案】C\n\n【解析】题目意思为“今年前三个月的输入量比去年相应阶段的输入量提高了 7%”，relate 把……联系起来，concern 涉\n\n及，correspond 符合，类似（题中应译为“相应阶段”），regard 注意，注重所以选 C\n\n15. My cap looks to John’s，so I often take his by mistake.\n\nA. same B. identical C. different D. likely\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】我的帽子和约翰的帽子完全相似，所以我经常错误的戴上他的，same 表示相同的人或者事物，也可指外表或意义相同，但实际却有差别的事物，identical 表示同一的，完全相像的，所以选 B\n\n\n\n\n\n16. Aunty Mary earned a good reputation hard working and being honest.\n\nA. aboutB. with C. at D. For\n\n【答案】D\n\n【解析】玛丽因为努力的工作和她的诚实获得了一个好的名誉，for 在这里表示原因，故选 D\n\n\n\n\n\n17. Jim isn’ t ,but he did badly in the final exams last term, which surprised us greatly.\n\nA. dull B. bright C. awkward D. clever\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】Jim 是不笨的，但是他在上个学期的期末考试中做的不好，这件事是我们十分惊讶，do badly in 表示 在……做的\n\n\n\n\n\n不好，根据后半句，说明 Jim 很聪明，又因为前半句是否定，所以选 A。\n\n\n\n\n\n18. Finally we to get what we wanted after we had suffered so much hardship.\n\nA. operated B. attempted C. managed D. succeeded\n\n\n\n\n\n【答案】C\n\n\n\n\n\n\n\n\n\n【解析】operate to do 表示操作去做……，attempt to do 表示尝试去做……，manage to do 表示设法成功做……，succeed\n\n\n\n\n\n后用介词 in，所以综上，选 C\n\n\n\n\n\n19. It’s my power to give you advice on the matter.\n\nA. above B. below C. under D. beyond\n\n【答案】A\n\n\n\n\n\n【解析】在这个问题上给你几条意见超出了我的能力，beyond one's power 超出某人的能力，故选 A\n\n\n\n\n\n20. Having stayed in the United States for more than ten years, he got an American .\n\nA. speech B. accent C. voice D. sound\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】他已经在美国居住超过了 10 年，所以他有一种美国口音，speech 演讲，accent 口音，voice 声音，sound 听，所以口音，选择 B\n\n\n\n\n\n21. Feburary is the month is usually the coldest.\n\n\n\n\n\n\n\n\n\nA. the weather B. whose weather C. its weather D. when the weather\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】二月通常是天气最冷的的一个月。本题考察的事定语从句，先行词是 month，因为 month 是修饰 weather 的，所\n\n\n\n\n\n以选 B\n\n22. At first, I didn’t recognize her because she at least fifty pounds.\n\nA. have lost B. might lose C. had lost D.may lose\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】本题考察的是时态。句子意思是：刚开始，我并没有认出她，因为她已经减了至少 50 磅，因为我“没有认出”是过去，所以她减肥是“过去的过去”，即过去完成时，所以选 C\n\n\n\n\n\n23. John suggested anything about it until they found out more facts.\n\nA. not to say B. not say C. to say not D.not saying\n\n【答案】D\n\n【解析】本题考察 suggest 的用法，suggest 后面接 doing，否定形式为 suggest not doing ，所以选 D\n\n24. The general’s command was that the soldiers the place and carry out more important tasks.\n\nA. leave B. left C. have leftD.would leave\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】本题考察连词 and 的用法。and 前后动词形式保持一致，因为 and 后面的动词 carry 是原型，所以 and 前动词应\n\n\n\n\n\n为原型，故选 A\n\n25.1 was very tired. Otherwise, I to the theatre with you for the new film .\n\nA. had gone B. have gone C.would have gone D. must have gone\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】本题考察虚拟语气。would＋现在完成时，表示过去本做但实际并没有做的事，所以选 C\n\n\n\n\n\n26.to wait for hours, she brought along a book to read.\n\n\n\n\n\n\n\n\n\nA. Expected B. Expecting C.Expect D. To expect\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】本题考察动词的用法。因为 she 和 expect 是主动关系，所以选择 expecting 表主动。动词＋ed 表示被动，过去的动作，动词＋ing 表示主动，正在进行，所以选 B 表示主动。\n\n\n\n\n\n27. Mrs. Smith, together with her friends, to visit the new museum.\n\nA. are goingB. are C. is going D. will be\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】本题考察 together with 的用法。together with 连接两个主语时，谓语动词的形式是与前一个主语保持一致，因为前一个主语是 Mrs. Smith，所以谓语动词与其保持一致，故选 C\n\n\n\n\n\n\n\n\n\n28.before we leave the day after tomorrow, we should have a wonderful dinner party. A. Had they arrived B. Were they to arrive C.Were they arriving D. Would they arrive\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】本题考察虚拟语气的倒装，句意是：假如后天我们动身之前他们能赶到的话，我们就举办一个美好的晚宴，这是对将来的虚拟，倒装后省略 if，故选 B\n\n\n\n\n\n29. Mr. Wang said such a thing to happen at school again and he forgave me this time.\n\nA. ought not to be allowed B. ought to be not allowed\n\nC. ought to be allowed not D. not ought to be allowed\n\n【答案】A\n\n【解析】ought to do sth.做某事，否定形式为 ought not to do sth.所以选 A\n\n30. A Dream of the Red Mansion is said into dozens of languages in the last decade.\n\nA. to translate B. to have translated\n\nC. to be translated D. to have been translated\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】句意为：据说在过去的十年间，《红楼梦》已经被翻译成许多种语言，“已经被翻译”，用现在完成时，所以选\n\n\n\n\n\nD\n\n\n\n\n\n31. We enjoyed ours elves very much last night at the party. You with us.\n\nA. should have comeB. must come C. must have come D. should come\n\n【答案】A\n\n【解析】should have done 表示做的事却没有做，故选 A\n\n32. Only under special circumstances to take make-up tests.\n\nA. freshmen are permitted B. are freshmen permitted\n\nC. permitted are freshmen D. are permitted freshmen\n\n【答案】B\n\n【解析】本题考察 only 的倒装，permit 与 to 连用，所以选择 B\n\n33.There is not much news in today’ s paper, ?\n\nA. is it B. isn’ t it C. isn’t there D. is there\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】本题考察反义疑问句，前肯定，后否定，而且时态，结构必须保持一致，又因为前面用 there is not ，所以后面要\n\n\n\n\n\n用肯定形式，所以选 D\n\n34. You’ve already missed too many classes this term.. You four classes just last week.\n\nA. had missed B. miss C. missed D.have missed\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】本题考察时态。句意为：你这个学期已经没有上许多课了，上周你又有四节课没上。所以用过去时，又因为过去完成时是表示过去的过去发生的动作，需要有一个动作作为参考点，但是后半句并没有，所以直接用过去式，选 C\n\n\n\n\n\n35. Before leaving in the village, he visited the old house he spent his childhood.\n\nA. in which B. which C. to which D. at which\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】本题考察 spend 的用法，spend time in（doing）sth 所以选择 A\n\n\n\n\n\n\n\n\n\nPart II Reading Comprehension (40%)\n\n\n\n\n\nPassage 1\n\n\n\n\n\nEven people who don’t understand English can enjoy Chaplin’s films because they are almost silent. It isn’t\n\n\n\n\n\n\n\n\n\n\n\n\n\nwhat he says that makes us laugh. His comedy (喜剧）doesn’t depend upon words or language, but on the little actions which mean the same thing to people all over the world.\n\n\n\n\n\nIn his films, Chaplin raises his thick black eyebrow ( 眉毛 ).He straightens his coat or swings his walking stick in the air. He hides behind a fat lady or climbs under a table to escape from his enemies. Trying to be brave, he faints away on the floor. He pretends to be what he is not and never could be a rich，successful, important man. It is the secret fo Chaplin’s huge success.\n\n\n\n\n\nHe discovered the character of the little tramp almost by accident. As young men, he and his brother traveled to America in a small company of actors and acted in various cities. One day Charles was invited to join a new company that was making comedies. It was in his second film that he wore the clothes that made his reputation : black hat, tight coat, big trousers, huge shoes, moustache ( 胡须 )and walking stick. He intended simply to make people laugh. But the odd disguises(扮相)made him look both comic and sad.\n\n\n\n\n\nHis appearance was a popular success, right form the beginning. But his early films hadn’t much story. They were full of actions. The little man played fast-moving games of hide-and-seek with his enemies, racing down city streets, jumping on trains, and boating down rivers.\n\n36. Which of the following is true?\n\n\n\n\n\nA. Chaplin was a homeless traveler\n\n\n\n\n\nB. Chaplin hardly did actions in films.\n\n\n\n\n\nC. Chaplin amused his audience by his actions.\n\n\n\n\n\nD. Chaplin always did the same actions in his films.\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】本题可以在文中第一段最后一句找到。需要注意题目强调的是“true”\n\n37. The secret of Chaplin’s success is that he created a character who .\n\nA. faints away on the floor, trying to be brave\n\nB. behaves as if he was a successful, important richman\n\nC. straightens his coat or swings his walking stick in the air\n\nD. hides behind a fat lady or climbs under a table to escape from his enemies.\n\n【答案】B\n\n\n\n\n\n【解析】本题在第二段最后一句，“他假装成一个他本来就不是并且也从不可能是的富人，成功人士，重要的人”，因为是“假\n\n\n\n\n\n装”，所以选 B\n\n38. The word “tramp” in Line 1, Paragraph 3 may mean a” ”.\n\nA. person who walks far B. person who wakls heavily\n\nC. disabled person who is unlucky D. homeless person who moves about\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】因为文章中第二句说卓别林和他的哥哥两个人到美国的小公司当演员，也如果很多城市。所以选择 D\n\n\n\n\n\n39. With the help of his odd appearance, Chaplin intended to look .\n\nA. rich B. funny C. successfulD. impressive\n\n【答案】B\n\n【解析】根据文章第三段最后一句话中“comic”，可以知道选择 B\n\n40. Chaplin’s films were full of the following actions EXCEPT .\n\nA. boating down rivers B. racing down city streets\n\nC. Jumping on trains D. driving bicycles\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】根据文章第四段最后一句我们可以看出没有 driving bicycles，所以选择 D\n\n\n\n\n\n\n\n\n\nPassage 2\n\n\n\n\n\nA cat burglar invaded the bedroom of the President of the United States, who confronted him and helped him escape. The event occurred in the early morning hours in one of the first days of the presidency of Calvin Coolidge, late in August, 1923. He and his family were living at the Willard Hotel in Washington that they had occupied during his vice presidency.\n\n\n\n\n\nCoolidge awoke to see a burglar search his clothes. Finally he got a wallet and a watch. When he was removing the watch chain, Coolidge spoke : “I wish you wouldn’t take that.’，The thief, at his voice, said: “why?” “I don’t mean the watch and chain, only the charm. Take it near the window and read what is engraved (雕刻）on the back of it ,”the President said. The burglar read: “Presented to Calvin Coolidge,Speaker of the House, by the Massachusetts General Court.” “Are you President Coolidge?” he asked. The President answered, “Yes, and the Legislature gave me that watch charm...Fm fond of it. It would do you no good. You want money. Let’s talk this over.” Holding up the wallet, the thief bargained: “I’ll take this and leave everything else. ” Coolidge，knowing there was $80 in the billfold, persuaded the thief to sit down and talk. The young man said he and his college roommate had overspent during their vacation and did not have enough money to pay their hotel bill. Coolidge added up the room rate and two rail ticket back to the campus. Then he counted out $32 and said it was a loan. He then told the thief that there would be a Secret Service agent patrolling (巡逻）the hotel corridor and asked if an escape could be made by going back along the hotel ledge (窗台）.\n\n\n\n\n\nThe man left through the same window he had entered.\n\n41. The phrase “a cat burglar” in the first line means”a thief who ”.\n\nA. steals cats B. has nine lives like a cat\n\nC. is fond of the game of cat-and-mouse\n\nD. enters buildings by climbing through windows\n\n【答案】D\n\n【解析】由文章最后一句话我们可以看出，这个小偷是从窗户爬上来的。\n\n42. The burglar intended to steal the .\n\nA.Wallet B.WatchC.wallet and the watch D.wallet and the watch chain\n\n【答案】D\n\n【解析】由文章第二段可以看出小偷准备把总统的手表和钱偷走，所以选 D\n\n43. The “charm” in Paragraph 2 probably means” ”.\n\nA. the power of attracting people\n\n\n\n\n\nB. a word believed to have magic power\n\n\n\n\n\nC. a small object that is attached to a chain\n\n\n\n\n\nD. a small thing worn for supposed magic power\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】有文章第二段可以知道这块手表的手链上刻有字，总统指的是这个，所以选择 C\n\n\n\n\n\n44. The President gave the burglar dollars.\n\nA. 80 B. 32 C. 48 D. 112\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】文章第二段中“Then he counted out $32”，count out 意思是不把……考虑在内，所以推断给了小偷 32 美元\n\n\n\n\n\n45.What can we infer from the passage? A. Coolidge kept the secret for the burglar.\n\n\n\n\n\nB. Coolidge gave the watch to the burglar kept the charm.\n\n\n\n\n\nC. Coolidge gave the burglar a sum of money which was only enough to pay his hotel bill.\n\n\n\n\n\nD. Coolidge reported the burglary to the Secret Service Agency and the burglar was arrested.\n\n\n\n\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】最后一句话说明了总统告诉了这个小偷哪里有巡逻队，并且让他离开了，所以可以知道，总统为这个小偷保守住了这个秘密，所以选 A\n\n\n\n\n\nPassage 3\n\n\n\n\n\nChina will continue its policy of encouraging people to study abroad, Vice-Minister of Education Wei Yu said last week.\n\nChina will also encourage students to return to the motherland to participate in its modernization effort, she said, and if they want to go abroad again the country will give them the green light.\n\nOn June 23，1978，the late Deng Xiaoping, then Chinese Vice-premier, decided that more people should study abroad, and the policy started a 20-year study-abroad fever.\n\n\n\n\n\nIn Chinese cities, it is difficult to find a young person who has not heard of TOEFL (Test of English as a Foreign Language) or GRE (Graduate Record Examination), the primary tests required to attend graduate school in the United States.\n\nChina sent its first group of students to study in the United States and Europe back in 1872. That ended during World War II.\n\nDuring the 1950’s，the major destination for students was the former Soviet Union. Many current Chinese leaders were students in Soviet colleges.\n\n\n\n\n\nBut the “cultural revolution (1966-76)’’ dealt a blow to the enthusiasm. Any contacts with foreigners were strictly banned (禁止).\n\n\n\n\n\n“To some extent, the difficulty of a shortage of talented people has been eased,” she said, “thanks to the study-abroad policy which has in turn promoted China’s opening-up to the rest world.” Wei went on to say that during the past two decades，about 300,000 Chinese have gone to study in more than 100 countries. By the end of 1997，a total of 163,100 Chinese had studied in the United States，accounting for 56 percent of the students who went overseas to study.\n\n\n\n\n\n“Facts have proved that Deng’s decision was correct.”Wei said .\n\n\n\n\n\nAnother official said that more and more students have returned to China after completing their studies abroad. “China’s economic miracle is providing them with opportunities to develop their talent.? he said, adding that their social status, working and living conditions have been improving.\n\n\n\n\n\n46. In Paragraph 2, the “green light” refers to .\n\nA. the passport B. the permission\n\nC. the symbol of welcome D.one of the traffic signals\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】根据句意说：如果他们想要再次去国外的话，我们国家将会给他们亮绿灯，所以是给予允许的意思，并不是 A 的\n\n\n\n\n\n护照，通行证的意思，所以选 B\n\n\n\n\n\n47. The passage implies that .\n\n\n\n\n\n\n\n\n\nA. in China few young people have taken the TOEFL test .\n\n\n\n\n\nB. it is difficult to find many young people to take TOEFL test.\n\n\n\n\n\nC.TOEFL and GRE are tests_for primary education in the U.S.\n\n\n\n\n\nD.TOEFL and GRE are two popular tests for Chinese youth to study in the U.S.\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】根据文章第四段段意，我们可以看出：去美国学习 TOFEL 和 GRE 试是十分受中国年轻人欢迎的，所以选 D\n\n\n\n\n\n48. According to the passage,about 300,000 Chinese have been sent to study abroad since .\n\n\n\n\n\n\n\n\n\nA. 1978 B.1976 C. 1950 D. 1872\n\n【答案】A\n\n\n\n\n\n【解析】本题考察学生的推断能力。根据文章的第八段“Wei want on to say that……。还有 By the end of 1997，可以推断，\n\n\n\n\n\n前面那句话说的是 1997 年，又因为前面那句话有“during the past two decades”在过去的 20 年间，也就是 1997 年的 20 年前～1997 年，所以大概是 1978 年，选 A\n\n\n\n\n\n49. China’s study-abroad policy is rewarded, for .\n\n\n\n\n\n\n\n\n\nA. The returned talents from abroad have helped China to develop .\n\n\n\n\n\nB. 163,000 students have received or completed higher education in the U.S.\n\n\n\n\n\nC. all the students who went to the U.S. for further studies have returned to China.\n\n\n\n\n\nD. the problem of shortage of talents has become more severe.\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】根据文章最后一段，我们可以看出这些留学生回来促进中国的发展，所以选 A\n\n\n\n\n\n50. From the passage，it may be concluded that .\n\nA. people go abroad mainly for better working conditions.\n\n\n\n\n\nB. very few young people have complete their education abroad.\n\n\n\n\n\nC. China’s study-abroad policy has been proved a great success.\n\n\n\n\n\nD. more talented overseas students will come to China to finish their studies.\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】从文章倒数第二段，我们可以看出，这个政策取得了很大的成功。所以选 C\n\n\n\n\n\nPassage 4\n\n\n\n\n\nThousands of years ago man used handy rocks for his surgical operations. Later he used sharp bone or horn, metal knives and more recently, rubber and plastic and that was where we stuck, in surgical instrument terms, for many years. In the 1960s a new tool was developed，one which was, first of all，to be of great practical use to the armed forces and industry, but which was also, in time, to change greatly the art and science of surgery.\n\n\n\n\n\nThe tool is the laser (激光）and it is being used by more and more surgeons all over the world. As we all know, light is hot^ any source of light—from the sun itself down to a simple match burning—will give warmth. But light is usually spread out over a wide area. The light in a laser beam (激光束)，however, is concentrated ( 密\n\n\n\n\n\n集).This means that a light with no more power than that produced by an ordinary electric light bulb becomes intensely strong as it is concentrated to a pinpoint-sized (针尖大小的）beam.\n\n\n\n\n\nExperiments with these pinpoint beams showed researchers that different energy sources produce beams that have a particular effect on certain living cells. It is now possible for eye surgeons to operate on the back of human eye without harming the front of the eye, simply by passing a laser beam right through the aye -ball.No knives, no stitches (缝针)，no unwanted damage—a true surgical wonder. Operations which once made patients tired and in need of long period of recovery time now leave them feeling calm and comfortable. So much more difficult operations can now be tried.\n\n\n\n\n\nThe rapid development of laser techniques in the past ten years has made it clear that the future is likely to be very exciting.Perhaps some cancers will be treated with laser in a way that makes surgery not only safer but also more effective. Altogether, tomorrow may see more information coming to light on the diseases which can be treated medically.\n\n51. The instruments of surgical operations up until 1960s can be described as .\n\nA. traditional B. complicated C. magical D. revolutionary\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】从文章开头我们可以看出 1960s 后，有了高科技，所以 1960s 前技术是比较低端的，所以选择 A\n\n\n\n\n\n52. What changes have taken place since the appearance of laser in the 1960s?\n\nA. Industrial revolution has mademedical help available for industrial workers.\n\nB. The research in study of art went through a complete revolution.\n\n\n\n\n\nC.Surgery benefits greatly from the industrial revolution.\n\n\n\n\n\nD.The methods in surgery for patients changed greatly.\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】根据文章第一段最后一句话，我们知道了 1960s 后，外科治疗的方法取得了很大的进步。所以选 D\n\n\n\n\n\n53. The laser beam is very strong because .\n\n\n\n\n\n\n\n\n\nA.it is artificially lighted\n\n\n\n\n\nB. it gives off heat in all directions.\n\n\n\n\n\nC. it contains a concentrated beam of the light\n\n\n\n\n\nD.its temperature increases due to the heat of the sun\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】文章中第二段“This means that a light……beam.”可以看出激光束之所以这么大的威力是因为它把光线集中在一\n\n\n\n\n\n起，使它不会那么分散，所以选 C\n\n\n\n\n\n54. By applying the laser beam，surgeons can perform operations which .\n\n\n\n\n\n\n\n\n\nA.may make their patients suffer with negative effects\n\n\n\n\n\nB.may take their patients a long time to recover\n\n\n\n\n\nC.do little harm to their patients\n\n\n\n\n\nD.can only treat eye diseases\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】根据文章第二段最后的一句话，我们看出，激光治疗不会使患者有太大的痛苦，也不会消耗很多的时间，所以选\n\n\n\n\n\n择C\n\n\n\n\n\n55. The rapid development of laser technique indicates that .\n\n\n\n\n\n\n\n\n\nhttp://A.in future we also can\n\n\n\n\n\nB.surgery is likely to be improved considerably\n\n\n\n\n\nhttp://C.in future all the diseases can certainly be cured\n\n\n\n\n\nD.operations will be performed more complicatedly in future\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】文章主旨是强调激光在医学上的利处，而且最后一段说激光技术在过去的十年里的迅速发展，会使得它在之后可能会发展更快，所以选 B\n\n\n\n\n\nPart III Cloze (10%)\n\n\n\n\n\nPeople from different cultures sometimes do things that make each other uncomfortable, sometimes without realizing it. Most Americans 56 out of the country and have very 57 experience with foreigners. But they are usually spontaneous (朴实的)，friendly and open, and enjoy 58 new people, having guests and bringing people together formally or informally. They tend to use first names 59 most situations and speak freely 60 themselves. So if your American hosts do something that 61 you uncomfortable, try to let them know 62 you feel. Most people will 63 your honesty and try not to make you uncomfortable again. And you’ll 64 something about another culture!\n\n\n\n\n\n\n\n\n\nMany travelers find 65 easier to meet people in the U.S. 66 in other countries. They may just come 67 and introduce themselves or even invite you over 68 they really know you. Sometimes Americans are said to be 69 Perhaps it seems so, but they are probably just 70 a good time. Just like anywhere else, it 71 time to become real friends 72 people in the U.S.\n\n\n\n\n\n\n\n\n\nIf and 73 you stay with American friends, they will probably 74 introducing you to their friends and family, and if they seem proud 75 you. it，s probably because they are. Relax and enjoy it!\n\n\n\n\n\n\n\n\n\n56. A.have never been B. have been never C. has never been D. has been never\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】根据文章上下句，我们可以推断出，大部分的美国人从不走出国家，并且有和外国人很少的经历，never 总在 have\n\n\n\n\n\nbeen 中间，所以选择 A\n\n57.A. a little B B. little C.much D. a great deal\n\n【答案】B\n\n【解析】修饰经历，而且是“很少的”，所以是 B\n\n58. A. meet B. to meet C. meeting D. to have met\n\n【答案】C\n\n【解析】本题考察 enjoy doing sth.所以选择 C\n\n59.A. on B. among C. under D. in\n\n【答案】D\n\n【解析】固定搭配。situation 前用介词 in，所以选 D\n\n60.A. of B. http://onC.in D. about\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】考察句意。题目中说在大多数情况下，他们倾向于用他们的姓名，并且自由的讲关于他们的事情。关于，是 about\n\n\n\n\n\n61.A. make B. makes C. made D. making\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】本题考察 soemthing 后的谓语动词是单数形式，所以选择 makes\n\n\n\n\n\n62.A. how B. why C. when D. where\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】句意：尝试着让他们知道你的感觉怎么样，用 how\n\n\n\n\n\n63.A. praise B. judge C.appreciate D. believe\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】句意：大多数人会感激你的真诚。感激是 appreciate\n\n\n\n\n\n64.A. research B. learn C. inquire D. study\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】你将会学会关于另一种文化的东西，所以用 learn，inquire 是询问，查询\n\n\n\n\n\n65.A. it B. this C. them D. that\n\n\n\n\n\n【答案】A\n\n\n\n\n\n【解析】本题考察 it 的用法，it 指代后面的 meet people，所以选 it\n\n\n\n\n\n66.A. where B.when C. than D. why\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】许多旅行者发现在美国比在其他国家更容易遇到一些人。这里是把在美国，和在其他国家作比较，所以选择 than\n\n\n\n\n\n67.A. on B. by C. off D. up\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】考察短语意思。come on 快点，要求，跟着来，come by 从旁走过，come off 举行，成功，表现，come up 走近，上来。句意意思是：他们可能自己走上来并且介绍他们自己，甚至邀请你在他们真正认识你之前，所以选择 D\n\n\n\n\n\n68.A. when B. before C.though D. if\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】根据句意是在她们认识你之前，所以用 before，选 B\n\n\n\n\n\n69.A. superficially friend B. superficial friend\n\n\n\n\n\n\n\n\n\n\n\n\n\nC. Superficial friendly D. superficially friendly\n\n【答案】D\n\n【解析】注意：frendly 是形容词，需要用副词修饰，所以选 D\n\n70. A. having B .taking C.making D.getting\n\n【答案】A\n\n【解析】考察短语 have a good time 玩的开心\n\n71.A. spends B. gains C. takes D. gets\n\n【答案】C\n\n【解析】本题考察句型：It takes sb. to do sth.\n\n72. A. with B. among C. to D. in\n\n【答案】A\n\n\n\n\n\n【解析】句意是：与美国人民成为真正的朋友需要时间。表示和…用 with，among 在……中间，to 到，in 在……里面，所\n\n\n\n\n\n以选 A\n\n\n\n\n\n73. A. after B. though C. where D. when\n\n\n\n\n\n【答案】D\n\n\n\n\n\n【解析】考察句意。如果或者当你和美国朋友待在一起，after 在……之后，though 尽管，where 在……地方，所以用 when\n\n\n\n\n\n比较合适。\n\n\n\n\n\n74 A. hate B. forbid C. enjoy D. avoid\n\n\n\n\n\n【答案】C\n\n\n\n\n\n【解析】如果或者当你和美国朋友待在一起，他们将可能喜欢把你介绍给他们的朋友和家人。所以选择 enjoy，hate 讨厌，不喜欢，forbid 禁止，avoid 避免，所以根据句意选择 C\n\n\n\n\n\n75. A. knowing B. to know C. know D. having known\n\n\n\n\n\n【答案】B\n\n\n\n\n\n【解析】本题考察 be proud to do sth.所以选 B\n\n\n\n\n\n\n\n\n\n\n\n\n\nPart IV Writing (15%)\n\n\n\n\n\n76.你叫李明，去年考上了、学桌张强却落榜了。经过一年的复习，他今年也考上了大学。 你得知此信息后，十分写了一封贺信。信中谈到了你们三年高中学习中一些难忘的事情 以及你们之间的友谊，还可向他简单谈谈你的大学生活感受，并且给他一些忠告，以应付即将开始的大学生活。\n\n\n\n\n\n温馨提示：你只能根据上述提示写一封贺信，不可以直接将上面这段文字翻译成英语。不可以署你的真实姓名。\n\n\n\n\n\n\n\n\n\n\n\n\n\n2011 年广东省普通高等学校本科插班生招生考试\n\n\n\n\n\n英 语 试 题 答 案\n\n\n\n\n\nl.C 2. D 3.C 4.B 5. A 6. D 7. D8. C 9. A 10. B 11. A 12. D 13. B 14. C 15. B 16. D\n\n17. A 18. C 19. D 20. B 21. B 22. C 23. D 24. A 25. C 26. B 27. C 28. B 29. A 30. D\n\n31. A 32. B 33. D 34.C 35. A 36. C 37. B 38. D 39. B 40. D 41. D 42. D 43. C\n\n44. B 45. A 46. B 47. D 48.A 49.A 50. C 51. A 52.D 53.C54.C55. B\n\n56. A 57. B 58.C 59.D 60.D 61. B 62. A 63. C 64.B 65. A 66. C 67. D 68.B\n\n69.D 70. A 71. C 72. A 73D\n\n74.C 75.B\n\n\n\n\n\nPart IV Writing (15%)\n\n\n\n\n\n76.(omitted)\n\n\n\n\n\n作文评分标准：\n\n\n\n\n\n作文部分满分是 15 分，可按五档评分：2 分，5 分，8 分，11 分及 14 分。\n\n\n\n\n\n阅卷人员根据考生的作文，参照评分标准，在某分数档次（如 8 分）上进行加减， 即若认为稍优于或稍劣于该分数档则可加一分（即 9 分）或减一分（即 7 分)。但不得加或减半分。\n\n\n\n\n\n评分标准：\n\n\n\n\n\n2 分—条例不清，思路混乱，内容不明确，语言支离破碎，只有几个语句，且大部分句子有严重语言错误。5 分—基本切题，表达思想基本清楚，但连贯性差，有较多的语言错误，字数少于 80。 8 分—比较切题，但仍有些地方表达不够清楚，文字连贯，但有少量语言错误，字数多于 80。11 分—切题，表达思想清楚，文字连贯，但有少量语言错误，字数不少于 100。14 分—很切题，表达思想十分清楚，行文相当通顺，连贯性较好，基本上无语言错误， 字数不少于 100。\n\n\n\n\n\n注：（1)白卷：完全文不对题：默写的或从试卷其他地方抄来的与作文主题无关的材料：只有几个孤立的单词而未表达任何思想情况，均给 0 分。（2）字数不足应酌情扣分。"}, {"url": "https://worldofvolley.com/latest_news/turkey/15410/tur-m-kilic-fenerbahce-jersey-is-not-destined-to-anyone.html", "page_content": "\n\n\n\n“Here I will win all major achievements. Fenerbahçe jersey is not destined to anyone. It is a completely different feeling to get the jersey of the champions. By playing here I achieved important and significant things in terms of my career,” Kılıç said.\n\n“I am delighted that coach Castellani came to the team. All players that came have a great power and capacity. Emin is a strong player in the middle. Fontales is prominent name in the world of the volleyball stars. I think that he will fit in easily. I think we will all make a good team”, he added.\n\nFor more news from this country, click on Turkey.\n\nCheck out profiles of Serkan Kılıç and Fenerbahçe."}, {"url": "https://en.unionpedia.org/i/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Gündüz Kılıç \"Baba\" Gündüz Kılıç (1918–1980) was a Turkish football player and coach. [1]\n\n52 relations: Aşiyan Asri Cemetery, Ali Kılıç, Bülent Eken, Beşiktaş J.K., Beşiktaş–Galatasaray rivalry, Coşkun Özarı, Football at the 1936 Summer Olympics – Men's team squads, Football at the 1948 Summer Olympics, Football at the 1948 Summer Olympics – Men's team squads, Football records in Turkey, Galatasaray S.K. (football), Gündüz, History of Galatasaray S.K., Kılıç (surname), List of first association football internationals per country: 1940–1962, List of Galatasaray S.K. managers, List of Galatasaray S.K. records and statistics, List of Turkish people, May 17, Metin Oktay, Republic of China at the 1948 Summer Olympics, Talat Özkarslı, The Intercontinental Derby, Turkey national football team 1923–60 results, Turkish Cup, Turkish National Division, 1934–35 Galatasaray S.K. season, 1935–36 Galatasaray S.K. season, 1936–37 Galatasaray S.K. season, 1937–38 Galatasaray S.K. season, 1939–40 Galatasaray S.K. season, 1940–41 Galatasaray S.K. season, 1941–42 Galatasaray S.K. season, 1942 Istanbul Football Cup, 1942–43 Galatasaray S.K. season, 1943 Istanbul Football Cup, 1943–44 Galatasaray S.K. season, 1944–45 Galatasaray S.K. season, 1946–47 Galatasaray S.K. season, 1947 Turkish Football Championship, 1948–49 Galatasaray S.K. season, 1948–49 Istanbul Football League, 1950 FIFA World Cup qualification, 1960–61 Galatasaray S.K. season, 1961–62 Galatasaray S.K. season, 1962–63 Galatasaray S.K. season, 1963–64 Galatasaray S.K. season, 1964–65 Galatasaray S.K. season, 1965–66 Galatasaray S.K. season, 1966 Presidential Cup, ..., 1966–67 Galatasaray S.K. season, 1980 in Turkey. Expand index (2 more) » « Shrink index\n\nThe Aşiyan Asri Cemetery (Aşiyan Asri Mezarlığı) is a burial ground situated on Aşiyan between the Bebek and Rumelihisarı neighborhoods of the European part of Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and Aşiyan Asri Cemetery · See more »\n\nAli Kılıç or Kilij Ali also known as Kılıç Ali Bey (born as Suleiman Asaf, 1890; Constantinople (today-Istanbul) - July 14, 1971; Istanbul) was an officer of the Ottoman Army and Turkish Army.\n\nNew!!: Gündüz Kılıç and Ali Kılıç · See more »\n\nBülent Eken (26 October 1923 – 25 July 2016) was a Turkish footballer and coach.\n\nNew!!: Gündüz Kılıç and Bülent Eken · See more »\n\nBeşiktaş Jimnastik Kulübü (Beşiktaş Gymnastics Club), also known simply as Beşiktaş, is a Turkish sports club founded in 1903, and based in the Beşiktaş district of Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and Beşiktaş J.K. · See more »\n\nBeşiktaş–Galatasaray is a Turkish football rivalry involving two of the most successful clubs in the Süper Lig.\n\nNew!!: Gündüz Kılıç and Beşiktaş–Galatasaray rivalry · See more »\n\nCoşkun Özarı (January 4, 1931 – June 22, 2011) was a Turkish football player and coach.\n\nNew!!: Gündüz Kılıç and Coşkun Özarı · See more »\n\nHead coach: Ngan Shing Kwan 1This English club name is from The Little Red Book of Chinese Football, written by Dave Twydell.\n\nNew!!: Gündüz Kılıç and Football at the 1936 Summer Olympics – Men's team squads · See more »\n\nFootball at the 1948 Summer Olympics tournament, won by Sweden, managed by Englishman George Raynor.\n\nNew!!: Gündüz Kılıç and Football at the 1948 Summer Olympics · See more »\n\nNo description.\n\nNew!!: Gündüz Kılıç and Football at the 1948 Summer Olympics – Men's team squads · See more »\n\nThis page details football records in Turkey.\n\nNew!!: Gündüz Kılıç and Football records in Turkey · See more »\n\nGalatasaray Spor Kulübü, also known simply as Galatasaray, is a Turkish football club based on the European side of the city of Istanbul.\n\nNew!!: Gündüz Kılıç and Galatasaray S.K. (football) · See more »\n\nGündüz or Gunduz may refer to.\n\nNew!!: Gündüz Kılıç and Gündüz · See more »\n\nThe history of Galatasaray S.K. covers over 100 years of the sports from the club based in Istanbul, Turkey.\n\nNew!!: Gündüz Kılıç and History of Galatasaray S.K. · See more »\n\nKılıç is a Turkish surname meaning \"sword\".\n\nNew!!: Gündüz Kılıç and Kılıç (surname) · See more »\n\nThe following is a list of first official international association football matches for each (present or past) member of FIFA, played between 1940 and 1962.\n\nNew!!: Gündüz Kılıç and List of first association football internationals per country: 1940–1962 · See more »\n\nGalatasaray S.K. is a Turkish professional football club based in Istanbul, Turkey, who currently play in Süper Lig.\n\nNew!!: Gündüz Kılıç and List of Galatasaray S.K. managers · See more »\n\nBelow are statistics and records related to Galatasaray.\n\nNew!!: Gündüz Kılıç and List of Galatasaray S.K. records and statistics · See more »\n\nThis is a list of notable Turkish people, or the Turks, (Turkish: Türkler), who are an ethnic group primarily living in the republic of Türkiye and in the former lands of the Ottoman Empire where Turkish minorities have been established.\n\nNew!!: Gündüz Kılıç and List of Turkish people · See more »\n\nNo description.\n\nNew!!: Gündüz Kılıç and May 17 · See more »\n\nMetin Oktay (2 February 1936 -13 September 1991) nicknamed the Uncrowned King by Galatasaray fans, was a Turkish footballer and one of the most successful goal scorers in Turkey.\n\nNew!!: Gündüz Kılıç and Metin Oktay · See more »\n\nChina, as the Republic of China, competed at the 1948 Summer Olympics in London, England.\n\nNew!!: Gündüz Kılıç and Republic of China at the 1948 Summer Olympics · See more »\n\nSefer Talat Özkarslı (born 21 March 1938), nicknamed Koçero, is a Turkish former football manager and footballer who played as a defender.\n\nNew!!: Gündüz Kılıç and Talat Özkarslı · See more »\n\nThe Intercontinental Derby (Kıtalararası Derbi) is the name given to any football match between Fenerbahçe SK and Galatasaray SK (two major Turkish teams from the Asian and the European parts of Istanbul, respectively.) It is also known as the Eternal Rivalry (Turkish: Ezelî Rekabet).\n\nNew!!: Gündüz Kılıç and The Intercontinental Derby · See more »\n\nThis is a list of the Turkey national football team results from 1923 to 1960.\n\nNew!!: Gündüz Kılıç and Turkey national football team 1923–60 results · See more »\n\nThe Turkish Cup (Turkish: Türkiye Kupası) is a football cup competition in Turkish football, run by the Turkish Football Federation since 1962.\n\nNew!!: Gündüz Kılıç and Turkish Cup · See more »\n\nThe National Division or National League (Millî Küme) was a top-level football competition organised by the Turkish Football Federation, including the most successful teams from Istanbul, Ankara, and İzmir in Turkey.\n\nNew!!: Gündüz Kılıç and Turkish National Division · See more »\n\nThe 1934–35 season was Galatasaray SK's 31st in existence and the club's 23rd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1934–35 Galatasaray S.K. season · See more »\n\nThe 1935–36 season was Galatasaray SK's 32nd in existence and the club's 24th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1935–36 Galatasaray S.K. season · See more »\n\nThe 1936–37 season was Galatasaray SK's 33rd in existence and the club's 25th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1936–37 Galatasaray S.K. season · See more »\n\nThe 1937–38 season was Galatasaray SK's 34th in existence and the club's 26th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1937–38 Galatasaray S.K. season · See more »\n\nThe 1939–40 season was Galatasaray SK's 36th in existence and the club's 28th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1939–40 Galatasaray S.K. season · See more »\n\nThe 1940–41 season was Galatasaray SK's 37th in existence and the club's 29th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1940–41 Galatasaray S.K. season · See more »\n\nThe 1941–42 season was Galatasaray SK's 38th in existence and the club's 30th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1941–42 Galatasaray S.K. season · See more »\n\nThe 1942 Istanbul Football Cup season was the first season of the cup.\n\nNew!!: Gündüz Kılıç and 1942 Istanbul Football Cup · See more »\n\nThe 1942–43 season was Galatasaray SK's 39th in existence and the club's 31st consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1942–43 Galatasaray S.K. season · See more »\n\nThe 1943 Istanbul Football Cup season was the second season of the cup.\n\nNew!!: Gündüz Kılıç and 1943 Istanbul Football Cup · See more »\n\nThe 1943–44 season was Galatasaray SK's 40th in existence and the club's 32nd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1943–44 Galatasaray S.K. season · See more »\n\nThe 1944–45 season was Galatasaray SK's 41st in existence and the club's 33rd consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1944–45 Galatasaray S.K. season · See more »\n\nThe 1946–47 season was Galatasaray SK's 43rd in existence and the club's 35th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1946–47 Galatasaray S.K. season · See more »\n\nThe 1947 Turkish Football Championship was the 13th edition of the competition.\n\nNew!!: Gündüz Kılıç and 1947 Turkish Football Championship · See more »\n\nThe 1948–49 season was Galatasaray SK's 45th in existence and the club's 37th consecutive season in the Istanbul Football League.\n\nNew!!: Gündüz Kılıç and 1948–49 Galatasaray S.K. season · See more »\n\nThe 1948–49 İstanbul Football League season was the 41st season of the league.\n\nNew!!: Gündüz Kılıç and 1948–49 Istanbul Football League · See more »\n\nA total of 34 teams entered the qualification rounds of the 1950 FIFA World Cup, competing for a total of 16 spots in the final tournament.\n\nNew!!: Gündüz Kılıç and 1950 FIFA World Cup qualification · See more »\n\nThe 1960–61 season was Galatasaray's 57th in existence and the 3rd consecutive season in the Milli Lig.\n\nNew!!: Gündüz Kılıç and 1960–61 Galatasaray S.K. season · See more »\n\nThe 1961–62 season was Galatasaray's 58th in existence and the 4th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1961–62 Galatasaray S.K. season · See more »\n\nThe 1962–63 season was Galatasaray's 59th in existence and the 5th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1962–63 Galatasaray S.K. season · See more »\n\nThe 1963–64 season was Galatasaray's 60th in existence and the 6th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1963–64 Galatasaray S.K. season · See more »\n\nThe 1964–65 season was Galatasaray's 61st in existence and the 7th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1964–65 Galatasaray S.K. season · See more »\n\nThe 1965–66 season was Galatasaray's 62nd in existence and the 8th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1965–66 Galatasaray S.K. season · See more »\n\n1966 Presidential Cup was the inaugural edition of the national super cup of Turkish Football Federation.\n\nNew!!: Gündüz Kılıç and 1966 Presidential Cup · See more »\n\nThe 1966–67 season was Galatasaray's 63rd in existence and the 9th consecutive season in the 1. Lig.\n\nNew!!: Gündüz Kılıç and 1966–67 Galatasaray S.K. season · See more »\n\nEvents in the year 1980 in Turkey.\n\nNew!!: Gündüz Kılıç and 1980 in Turkey · See more »\n\nRedirects here:\n\nGuenduez Kilic, Gunduz Kilic.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Gündüz_Kılıç"}, {"url": "https://www.wikiwand.com/nl/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Gündüz \"Father\" Kılıç (Istanboel, 29 oktober 1918[1] – New York, 17 mei 1980) was een Turks voetballer en voetbalcoach. Gündüz speelde als speler maar bij één club: Galatasaray.\n\nQuick facts: Gündüz Kılıç, Persoonlijke informatie, Volled... ▼ Gündüz Kılıç Persoonlijke informatie Volledige naam Gündüz Kılıç Bijnaam \"Father\" Geboortedatum 1918 Geboorteplaats Istanboel, Turkije Positie Spits Clubinformatie Huidige club - Senioren Seizoen Club W 0 (G) Galatasaray Getrainde teams 1952/1953\n\n1954–1957\n\n1961–1967 Galatasaray Portaal Voetbal\n\nHij werd na zijn spelersloopbaan coach bij deze club: hij zou de club in totaal 9 seizoenen coachen, 306 wedstrijden lang. Dit maakt hem de langstzittende trainer bij de club ooit. Tevens was Kılıç ook de eerste trainer die Galatasaray naar een groot Europees toernooi loodste. In 1963 werd de kwartfinale van de Europacup I bereikt, waar AC Milan te sterk bleek te zijn. Kılıç was hoofdtrainer bij Galatasaray in drie periodes: in het seizoen 1952/1953, in de periode 1954-1957 en in de periode 1961-1967."}, {"url": "https://www.theguardian.com/football/2011/jul/07/turkey-match-fixing", "page_content": "A Turkish court formally charged a further 15 suspects on Thursday in an alleged match-fixing scandal that threatens to strip league the champions Fenerbahce of their title.\n\nTurkish police are said to have rounded up 60 suspects in raids to homes and club premises on suspicion of manipulating games in the Turkish league last season. Investigators obtained evidence of cheating and bribery involving 19 first and second division games, the police said.\n\nAt the centre of the scandal is Fenerbahce, and it is claimed that the club risklosing their league title in the same manner as the Italian club Juventus, who were stripped of their 2005 and 2006 Italian league titles over a similar scandal.\n\nThe Turkish football federation said it aims to decide on what measures, if any, it will take against the Istanbul club by 15 July; the cut-off date for notification to Uefa of which teams will play in European competitions. The investigation has also caused financial damage to Fenerbahce as its shares plunged in the Istanbul stock market.\n\nOn Thursday the court in Istanbul arraigned 15 more suspects, including senior Fenerbahce officials, increasing the number of suspects in jail pending trial to 22.\n\nIt is claimed the court also issued a warrant for the Fenerbahce president Aziz Yildirim, who newspaper reports say is suspected of bribing rival teams' players to play badly. Yildirim was in hospital after undergoing a cardiology check-up, the reports said, although Fenerbahce described him as being detained. Yildirim was expected to be questioned by prosecutors following his release from hospital.\n\nTurkey's prime minister Recep Tayyip Erdogan, a former football player and a Fenerbahce supporter, said on Wednesday that he backed a thorough and fair investigation and prosecution, saying the scandal was tarnishing Turkey's image.\n\nThe government has promised to be tough on match-fixing, introducing legislation three months ago to confront hooliganism and cheating in football which included a maximum 12-year prison sentence for fixing games.\n\nFenerbahce issued a statement saying: \"This morning many important sportsmen including Fenerbahçe Sports Club president Aziz Yıldırım were detained in a probe into match-fixing allegations in the Turkish football league. We would like to stress our trust in our legal system once again, wishing that the truth will come on as soon as possible.\n\n\"Everyone should know that Fenerbahce Sports Club has never been and will never be engaged in any unlawful and illegal activity. We are proud of our clean and victorious past.\""}, {"url": "https://kaoyan.eol.cn/shiti/yingyu/201605/t20160513_1397696_6.shtml", "page_content": "免责声明：\n\n① 凡本站注明“稿件来源：中国教育在线”的所有文字、图片和音视频稿件，版权均属本网所有，任何媒体、网站或个人未经本网协议授权不得转载、链接、转贴或以其他方式复制发表。已经本站协议授权的媒体、网站，在下载使用时必须注明“稿件来源：中国教育在线”，违者本站将依法追究责任。\n\n② 本站注明稿件来源为其他媒体的文/图等稿件均为转载稿，本站转载出于非商业性的教育和科研之目的，并不意味着赞同其观点或证实其内容的真实性。如转载稿涉及版权等问题，请作者在两周内速来电或来函联系。"}, {"url": "https://dbpedia.org/page/G%C3%BCnd%C3%BCz_K%C4%B1l%C4%B1%C3%A7", "page_content": "Gündüz Kılıç (Baba o \"pare\" en turc; Istanbul, 29 d'octubre de 1919 - 17 de maig de 1980) fou un futbolista turc de la dècada de 1940 i entrenador. Fou 11 cops internacional amb la selecció turca. Pel que fa a clubs, defensà els colors de Galatasaray SK. (ca)\n\nGündüz Kılıç (* 29. Oktober 1918 in Istanbul; † 17. Mai 1980 in New York City) war ein türkischer Fußballspieler und -trainer. Durch seine langjährige Tätigkeit für Galatasaray Istanbul wird er stark mit diesem Verein assoziiert. Auf Fan- und Vereinsseite wird er als einer der bedeutendsten Spieler und Trainer der Klubgeschichte aufgefasst. Sein Spitzname, unter dem er heute noch bekannt ist, lautet Baba (Vater). (de)\n\n\"Baba\" Gündüz Kılıç (29 October 1918 – 17 May 1980) was a Turkish football player and coach. He was Ali Kılıç's son and Altemur Kılıç's brother. (en)\n\nGündüz Kılıç (né le 29 octobre 1918 à Constantinople à l'époque dans l'Empire ottoman, aujourd'hui Istamboul en Turquie, et mort le 17 mai 1980 à New York aux États-Unis) est un joueur de football international turc, qui évoluait au poste d'attaquant, avant de devenir ensuite entraîneur. (fr)\n\nGündüz Kılıç, soprannominato Baba (Papà) (Istanbul, 29 ottobre 1918 – New York, 17 maggio 1980), è stato un allenatore di calcio e calciatore turco, di ruolo attaccante. Nato ad Istanbul nel 1918 in territorio Ottomano, Kılıç veste per un decennio, non consecutivo, la divisa del Galatasaray. In mezzo ai due periodi vissuti ad Istanbul una parentesi nella capitale turca con il Demirspor. Nel 1948 partecipa alle Olimpiadi di Londra con la Nazionale turca con la quale totalizza 11 presenze e 5 reti tra il 1948 e il 1953. Dopo i successi vissuti da calciatore Kılıç tenta la carriera da allenatore: in quindici anni coglie diversi importanti successi alla guida del Galatasaray, allenando anche la Turchia nel 1954, prima di passare all'Altay per poi chiudere l'esperienza manageriale al Beşiktaş. Nel 1980 si spegne a New York e le sue spoglie vengono trasportate ad Istanbul. (it)\n\nGündüz \"Father\" Kılıç (Istanboel, 29 oktober 1918 – New York, 17 mei 1980) was een Turks voetballer en voetbalcoach. Gündüz speelde als speler maar bij één club: Galatasaray. Hij werd na zijn spelersloopbaan coach bij deze club: hij zou de club in totaal 9 seizoenen coachen, 306 wedstrijden lang. Dit maakt hem de langstzittende trainer bij de club ooit. Tevens was Kılıç ook de eerste trainer die Galatasaray naar een groot Europees toernooi loodste. In 1963 werd de kwartfinale van de Europacup I bereikt, waar AC Milan te sterk bleek te zijn. Kılıç was hoofdtrainer bij Galatasaray in drie periodes: in het seizoen 1952/1953, in de periode 1954-1957 en in de periode 1961-1967. (nl)\n\nБаба Гюндюз Кылыч (тур. Baba Gündüz Kılıç, 29 октября 1918, Константинополь, Османская империя — 17 мая 1980, Нью-Йорк, Нью-Йорк, США) — турецкий футболист, нападающий, тренер. (ru)\n\nГюндюз Килич (тур. Gündüz Kılıç, 29 жовтня 1918, Стамбул — 17 травня 1980, Нью-Йорк) — турецький футболіст, що грав на позиції нападника. По завершенні ігрової кар'єри — тренер. Найбільш відомий як гравець, а потім і тренер «Галатасараю», вигравши з ним як тренер перші загальнотурецькі трофеї, а також вивівши клуб першим серед усіх турецьких до Кубка європейських чемпіонів. Крім того грав, а потім тренував, національну збірну Туреччини, з якою був учасником двох Олімпійських ігор. (uk)"}]}