{"Michael Replogle has been a leader in the field of sustainable transportation for more than four decades.": [{"url": "https://itdp.academia.edu/MichaelReplogle", "page_content": "This paper reviews typical techniques in use today for estimating the travel behavior effects of ...\n\nmore\n\nThis paper reviews typical techniques in use today for estimating the travel behavior effects of bicycle and pedestrian facilities and programs and other factors that influence use of non-motorized travel modes and offers suggestions for near-term advances in the state-of-the-art and state-of-the-practice. The principle approaches that have been used to evaluate the effects of transportation policies and infrastructure on bicycle and pedestrian travel include regression analysis, market-share diversion analysis and discrete choice analysis. In practice, inadequacies of both data and modeling frameworks have led to less than satisfactory performance for all of these methods in the American metropolitan planning context. Problems in evaluating the travel behavior effects of factors influencing walking and bicycling are compounded when conventional emission factor models are used to evaluate some of these strategies. In the past several years, some analysts have worked to develop indicators of bicycle Level of Service, bicycle friendliness, bicycle stress level, bicycle suitability of streets and the like. However, little of this work has been integrated with regional travel demand model development. The author suggests that an immediate priority should be for the demonstration of advanced state-of-the-art travel models with substantially greater inclusion of pedestrian/bicycle travel factors, working in one or more regions where data and agency interest can support rapid and efficient progress. He recommends two specific and inter-related areas of work as immediate high priorities for research, development and demonstration funding: Advanced Regional Models Integrating Non-Motorized Modes and Factors; and Quick-Response Models Sensitive to Pedestrian and Bicycle Travel Factors. Elaboration of these models is given."}, {"url": "https://www.itdp.org/board-member/michael-replogle/", "page_content": "Michael Replogle, Emeritus\n\nFounder, ITDP & Former Deputy Commissioner for Policy, NYC DOT\n\nMichael Replogle founded ITDP and has served as President, Managing Director for Policy, and now as Senior Advisor, focused on US policy. He co-organized the Bikes Not Bombs Campaign which sent 10,000 bikes to Nicaraguan teachers and health workers in the 1980s. As ITDP’s board chair, he helped the organization become a catalytic player advancing Bus Rapid Transit, bike-sharing systems, traffic safety, compact transit-oriented development initiatives, and other policy reforms world-wide. He has advised many senior national and city government officials in China, Mexico, Indonesia, the US, and Brazil. As co-founder and chair of the Partnership on Sustainable Low Carbon Transport, he fostered and monitored a $175 billion 10-year commitment for more sustainable transport from multilateral banks and campaigned to mainstream sustainable transport in global climate and sustainable development policy.\n\nAs New York City Deputy Transportation Commissioner from 2015-2021, Replogle shaped expansion of CitiBike to 40,000 shared bicycles. He accepted the International Transport Forum’s Global Award for Vision Zero policies he managed, which cut traffic deaths by 25% and pedestrian deaths by 40% in 4 years. His design of New York’s Open Restaurants program in weeks turned 10,000 parking spaces into outdoor cafes, saving 100,000 jobs during Covid. He helped secure 500 additional protected bike-lane-miles and 100 miles of Open Streets. He oversaw start-up of successful programs for electric vehicle charging, car- and scooter-sharing, and e-cargo delivery. He directed key elements of City engagement in congestion pricing, climate and resilience, air quality, parking and freight, asset management, inclusive transport, intelligent transportation, federal policy and grants, and MTA and Port Authority relations.\n\nAs Transportation Director for the Environmental Defense Fund, from 1991-2008, Replogle shaped transportation and environmental laws and advised governments on city planning, transport management and finance, and air quality/environmental analysis, working in dozens of cities across the U.S. and the world.\n\nIn the 1980s, Replogle also oversaw comprehensive planning, travel forecasting, and growth management for Montgomery County, Maryland. He holds undergraduate civil engineering and sociology degrees and an MSE in civil and urban engineering from the University of Pennsylvania. He has held faculty appointments at New York University’s Wagner School of Public Service and the China Academy of Transportation Sciences. Replogle currently serves on the EPA Mobile Source Technical Review Subcommittee of the Clean Air Act Advisory Committee."}, {"url": "https://www.elr.info/sites/default/files/article/2011/10/32.10633.htm", "page_content": "32 ELR 10633 | Environmental Law Reporter | copyright © 2002 | All rights reserved\n\nThe Roads More Traveled: Sustainable Transportation in America—Or Not\n\n[Editors' Note: In June 1992, at the United Nations Conference on Environment and Development (UNCED) in Rio de Janeiro, the nations of the world formally endorsed the concept of sustainable development and agreed to a plan of action for achieving it. One of those nations was the United States. In August 2002, at the World Summit on Sustainable Development, these nations will gather in Johannesburg to review progress in the 10-year period since UNCED and to identify steps that need to be taken next. In anticipation of the Rio + 10 summit conference, Prof. John C. Dernbach is editing a book that assesses progress that the United States has made on sustainable development in the past 10 years and recommends next steps. The book, which is scheduled to be published by the Environmental Law Institute in June 2002, comprises chapters on various subjects by experts from around the country. This Article will appear as a chapter in that book. Further information on the book will be available at www.eli.org or by calling 1-800-433-5120 or 202-939-3844.]\n\nF. Kaid Benfield is senior attorney and director of smart growth and transportation policy for the Natural Resources Defense Council (NRDC) in Washington, D.C. He is coauthor of the books Solving Sprawl: Models of Smart Growth in Communities Across America (NRDC 2001) and Once There Were Greenfields: How Urban Sprawl Is Undermining America's Environment, Economy, and Social Fabric (NRDC 1999). Michael Replogle is transportation director for Environmental Defense and author of many publications on sustainable transportation. The authors thank Hannah Stutzman of the NRDC for valuable research assistance.\n\n[32 ELR 10633]\n\nThe Challenge Before Us\n\nThere can be no sustainable development without sustainable transportation. It is an essential component not only because transportation is a prerequisite to development in general but also because transportation, especially our use of motorized vehicles, contributes substantially to a wide range of environmental problems, including energy waste, global warming, degradation of air and water, noise, ecosystem loss and fragmentation, and desecration of the landscape. Our nation's environmental quality will be sustainable only if we pursue transportation in a sustainable way.\n\nIt will be a challenge to bring this about. Over the next 25 years, the population in the United States is predicted to grow by some 60 million people; the gross domestic product is projected to approach $ 30 trillion (a 50% increase in real terms over today's levels); and annual passenger miles traveled in motor vehicles are expected to increase from 5 trillion miles in 2000 to 8.4 trillion miles in 2025. As the population and economy grow, Americans are likely to become increasingly more mobile, with increasingly larger impacts on the environment. 1\n\nThis Article explores some basic parameters of sustainability in transportation, with particular emphasis on the obligations and actions of the United States regarding the issue since the 1992 Earth Summit. It focuses primarily on the patterns and trends associated with motor vehicle use, and with the federal influence on road transportation planning and investment; for the most part, it does not address matters relating to fuel efficiency and emissions control through vehicle technology. 2\n\nIn general, the concept of \"sustainable\" transportation invokes a system that allows free movement of people and goods in perpetuity, without harm to human health or the environment, and without depletion of the resources upon which it or a healthy environment depends. The concept, in our view, also embraces a system in which citizens and government collaborate to make decisions and provide a range of mobility choices. These elements were essentially recognized and endorsed at the Earth Summit and in the official American documents on sustainability that followed. Unfortunately, recent transportation and environmental trends in the United States, revealing substantially increased rates of driving and resource consumption along with associated continuing pollution, do not appear sustainable.\n\nThe good news is that the legal and political framework for sustainability in American transportation has indeed improved since the Earth Summit, and that in many parts of the country things have begun to move in the right direction. The bad news is that we have a long, long way to go.\n\nIn the 1990s and early 21st century, federal law and policy have finally begun to improve the chances for achieving a sustainable transportation system, particularly through implementation of changes to comprehensive transportation and pollution control legislation. 3 Many states and communities have taken advantage of new programs to increase modal choice and strengthen community involvement in decisionmaking, and there are encouraging signs among some indicators of environmental performance. There is also substantial evidence, however, that we have not yet [32 ELR 10634] gone far enough to reverse pollution and consumption trends and to achieve sustainability. In some ways, the American experience contrasts with that taken in Europe, where more progressive transportation and land development policies are yielding results by making it easier for citizens to choose alternatives to driving.\n\nAs we develop environmental and transportation policies for the 21st century, there are some steps we can and must take to achieve the sustainable future envisioned at the Earth Summit. These include building upon the legal and policy reforms adopted in the last decade, establishing performance goals for sustainability, improving methods of analysis and review of project and policy alternatives, using market-based incentives, building communities to support walking, bicycling, and use of public transit, and improving vehicle efficiency standards.\n\nIt is critical to do this, for otherwise today's children and future generations will inherit a world in which increasingly their choices are curtailed, their health threatened, and the richness and beauty of their homeland diminished by transportation gridlock and associated pollution and consumption. The health and future of our nation's economy also are utterly dependent on our achievement of a more sustainable and efficient system of mobility; we cannot grow and prosper if we waste time and resources in a system that does not work. While our recent progress in achieving transportation sustainability is significant, it is not enough. We cannot afford interruption or delay in pursuing these goals.\n\nSustainability in Road Transportation\n\nThere is no single, generally accepted definition of \"sustainable transportation.\" Rather, as is the case with other aspects of sustainable development, the concept is evolving, as we learn more about the consequences of our patterns of mobility and the strategies we have on hand to address them. There are some basic elements, however, that we believe essential to any serious approach to the issue. These elements are essentially reflected in Agenda 21, the international agreement adopted at the Earth Summit, although that document is not overly articulate on the point. In the United States, the President's Council on Sustainable Development (PCSD) has also adopted some useful elaboration of its own, particularly in its working documents.\n\nSome Basic Precepts of Sustainable Transportation\n\nIn brief, sustainable transportation strategies are those that can meet the basic mobility needs of all and be continued into the foreseeable future without harm to human health or deterioration of the local or planetary resource base. The concept calls for a more holistic approach to policy and investment planning in order to achieve a diverse and balanced mix of transport modes, along with a sensible arrangement of land use that enables conservative use of energy and capital to fulfill mobility needs. 4\n\nEspecially in the United States, the concept must account for the enormous prominence of transportation in our society and economy. Since World War II, improved transportation and manufacturing technologies have contributed to steady increases in productivity in the United States and a rising standard of living that accommodated not only an increase in population of 130 million people but also a tripling of annual personal expenditures on an inflation-adjusted, per capita basis in the last half of the 20th century. 5\n\nAutomobiles, trucks, and highways became the dominant means of surface transportation in America throughout this period, contributing to the nation's growth and expansion while heavily influencing our economy, land development patterns, and culture. Use of private vehicles has become the rule rather than the exception for those of driving age and, today, over 95% of our personal trips are by personal vehicles. Truck usage now accounts for over 90% of all shipments. There are now more than 200 million vehicles traveling 5 trillion miles per year in the United States. 6\n\nBoth a cause and result of our heavy reliance on motor vehicles, the traditional paradigm for transportation planning in the United States has sought to maximize roadway capacity, travel speed, and mobility, generally within the context of large subsidies to motorized transportation. The emerging sustainable transportation paradigm, by contrast, seeks to maximize efficiency in overall resource use. Its basic components include increasing modal diversity, with more emphasis on public transit, walking, and bicycling; paying more attention to the pattern of transportation and land use; encouraging use of efficient transportation modes whenever practical; charging users the true costs of transportation; and encouraging better connectivity between modes.\n\nEcological systems are healthiest when they display great species diversity and many niches for specialization of function and resource use. So too are transportation systems healthiest when they display great modal diversity, offering opportunity for selection of the most efficient specialized mode or combination of modes to meet different functional and qualitative demands for the movement of people or goods.\n\nIn further understanding transportation sustainability, it is important to remember that, at any point in time, consumers of transportation services are typically faced with a constrained set of choices among different travel modes for a particular trip or movement of goods; whether it is convenient to drive or walk to a particular destination, for example, is a function of the transportation infrastructure and services provided by a community, the price of those services, and the arrangement of land uses that generate the need for transportation. These, in turn, are the product of historical development and investment patterns, which shape the distance and speed with which people and goods move within the community to make possible the ordinary transactions of everyday life and economy. Together, these factors determine the level of energy and resource use, pollution, cost, and ultimately the sustainability of the transport and land use pattern of cities.\n\nUnfortunately, the current pattern of metropolitan transportation and land development in the majority of countries around the world appears to be increasingly unsustainable from both an economic and environmental perspective. Many factors point to the need for a new paradigm for sustainable [32 ELR 10635] transportation and development in both high- and low-income countries—burgeoning populations, lingering or growing air pollution, limits on global petroleum reserves, limited physical and economic capacity to expand automobile-based transportation systems without unacceptable community destruction, and an urgent need to limit global carbon dioxide (CO 2 ) emissions to slow the pace of global warming.\n\nSustainable Transportation at the Earth Summit\n\nThe Agenda 21 language agreed to in Rio de Janeiro at the Earth Summit is essentially consistent with this philosophy of sustainable transportation. In particular, Agenda 21 specifies the following objective for transportation:\n\nThe basic objective of this programme area is to develop and promote cost-effective policies or programmes, as appropriate, to limit, reduce or control, as appropriate, harmful emissions into the atmosphere and other adverse environmental effects of the transport sector, taking into account development priorities as well as the specific local and national circumstances and safety aspects. 7\n\nThe document also charges signatory governments with developing and promoting \"more efficient, less polluting and safer\" transportation, and to do so by emphasizing less polluting modes and integrating transportation and land use planning, among other things. 8\n\nIn addition to this specific language on transportation, several of the broad principles adopted in the Rio Declaration on Environment and Development are of particular relevance to achieving sustainability in transportation. The issue of greenhouse gas emissions from transportation, for example, is invoked by the admonition that activities in one nation must not damage the environment of another (Principle 2); the need to incorporate environmental sensitivity into land use and transportation planning is suggested by the direction that environmental protection be an integral part of development rather than separated from it; the need for community involvement in transportation decisionmaking is invoked by the language on public awareness and participation; the need to consider environmental costs in economic analysis is raised by the direction on internalization of environmental costs and the use of market-based remedies; and environmental impact assessment of government actions is required directly. 9\n\nThe Work of the PCSD\n\nIn June 1993, President William J. Clinton established an advisory process, the PCSD, directly in response to the Earth Summit. Its purpose was to advise him on sustainable development and develop \"bold, new approaches to achieve our economic, environmental, and equity goals.\" 10 The PCSD produced a series of reports and recommendations throughout the remainder of the decade that collectively shed further light on concepts of sustainability, as well as on the response of the American government to its new international obligations.\n\nIt is fair to say that the work of the PCSD related to transportation planning and management was somewhat scattered and arbitrary, varying in emphasis and structure from one report to another. Nonetheless, it appears that the PCSD's work was well-intentioned and, taken as a whole, it seeks to move the country toward patterns of vehicle use and land development that reduce pollution and congestion.\n\nThe main report of the PCSD, in particular, did not emphasize transportation in its policy recommendations. The document did include the subject, however, in its chapter on \"strengthening communities.\" Indeed, perhaps its strongest recommendation on transportation was buried in the last of a range of actions recommended under the growth-management category, where the PCSD noted that the federal government should \"encourage shifts in transportation spending toward transit, highway maintenance and repair, and expansion of transit options other than new highway or beltway construction.\" 11\n\nIn the \"community design\" section of the same chapter, the PCSD also encouraged land development \"along transit corridors\" and \"near a range of transit alternatives,\" and it recommended that federal tax law be amended to provide the same treatment for benefits provided to employees who use alternative forms of transportation as for those provided to employees who use company-provided parking. It recommended that credit toward attainment of air quality goals under the Clean Air Act (CAA) 12 be given to communities that adopt efficient land use strategies to reduce pollution from motor vehicles. 13\n\nThe report urged all levels of government to take care that infrastructure investment, including roads, does not disproportionately favor wealthy communities over disadvantaged ones, and it recommended that the multidisciplinary, inclusive planning process that had been established in 1991 under the Intermodal Surface Transportation Efficiency Act (ISTEA) 14 be extended to local community planning generally. (We discuss ISTEA in detail below.) 15 And it urged communities to pursue alternatives to sprawling land development, including the use of \"location-efficient\" mortgages that reward homebuyers who save on transportation expenses by purchasing homes in neighborhoods that are less automobile-dependent. 16\n\nThe transportation topic was fleshed out more specifically in a separate task force report on energy and transportation, issued concurrently with the main report. The task force report established several laudable goals (\"indicators\" [32 ELR 10636] in PCSD parlance), for example, in measuring progress in sustainable transportation:\n\n. Reducing dependence on imported oil;\n\n. Decreasing traffic congestion;\n\n. Reducing greenhouse gas emissions per passenger-mile of travel 20% by 2010 and 40% by 2025;\n\n. Stabilizing vehicle miles traveled per capita while improving alternatives to driving in single-occupancy vehicles; and\n\n. Increasing the mode share of trips made by alternatives to personal motor vehicles to 30% by 2025. 17\n\nThe task force also specified its own policy recommendations, including three that relate directly to transportation planning and management: adoption of so-called congestion pricing and other market-based incentives to reduce and redistribute vehicle traffic; location-efficient mortgages, mentioned above; and a strong recommendation that the U.S. Congress reauthorize the planning and funding reforms of ISTEA. 18\n\nYet another report relating to the topic was produced by the task force on sustainable communities, which echoed the main report by including recommendations that tax policy be changed to provide equity for employee transportation options other than driving and parking, that CAA credits be given for land use strategies that can reduce automobile use, and that the federal government should shift transportation toward public transit and away from expanding highways. The sustainable communities task force also adopted a number of measures indirectly related to transportation by addressing suburban sprawl, which is linked to automobile dependence. 19\n\nThe work of the PCSD concluded with a 1999 final report, Towards a Sustainable America. That report, which at the direction of the Clinton Administration focused on certain limited issues, addressed transportation in its chapter on climate change. It recommended reducing greenhouse gas emissions from vehicles by development of cleaner fuels and engines and by reducing vehicle use. The report included 10 so-called actions that encouraged policies to favor the use of mass transit, the building of less automobile-dependent land development, pricing strategies, and research. 20\n\nThe so-called Car Talk committee that was convened by the Clinton Administration in the mid-1990s to examine approaches to reducing greenhouse gas emissions from transportation reached similar conclusions. Car Talk, like the PCSD, included representatives from a broad range of interests, including the large U.S. automobile manufacturers; several large energy companies; and a number of additional government, business, and environmental interests. Car Talk was generally less successful than the PCSD, in that it failed to reach consensus on certain key points, notably increased gasoline taxes and vehicle fuel economy standards. Nevertheless, the committee was strong in its approval of ISTEA and its recommendation that \"the flexibility, planning, public involvement and program emphases of ISTEA\" should be extended to other government programs. The committee also endorsed \"the development of a bicycle and pedestrian infrastructure in communities throughout America through continuation of ISTEA funding programs.\" 21\n\nEfforts of the United States Since the Earth Summit\n\nAs noted above, achieving sustainability in American transportation is a monumental task, given the extent to which our current transportation patterns have become entrenched in our economy and society. As we will discuss, the environmental impacts of these patterns are enormous. A number of statutory reforms are making a difference, however. We still have a long way to go, but a path is being forged. In addition, there are valuable lessons we can take from other countries that in some ways are ahead of the United States in adopting sustainable transportation practices.\n\nUnsustainable Transportation Patterns in the United States\n\nMost of the environmental impacts of transportation are directly related to the extent to which we rely on motor vehicles for personal travel and freight movement. In particular, motor vehicle miles traveled in the United States have been on an upward trend for several decades. Vehicle use in America doubled from one to two trillion miles per year between 1970 and 1990, and had climbed further to 2.6 trillion miles by 1998. 22 Over a longer span, from 1950 to 1990, total passenger vehicle miles increased at an average rate of 4.2% per year; in the 1980s, passenger-vehicle usage grew at the faster rate of 4.7% per year, and total miles traveled by all light-duty vehicles grew at a staggering rate of 5.5% per year. 23\n\nIn the 1990s, the rate of growth in vehicle miles traveled slowed somewhat. For the most recent five years of data (1996 through 2000), driving grew at an average rate of over 2% per year, ranging from a 3.1% increase in 1997 to no increase in 2000, a year of higher fuel prices and a dampened economy. 24\n\n[32 ELR 10637]\n\nA number of troubling additional trends are associated with these high volumes of vehicle use in recent decades, all pointing to increased inefficiency in travel patterns. These include an increase in average trip length, growth in the number of vehicle trips taken per person and per household per year, a decline in all modes of travel other than single-occupancy driving, and a decline in average vehicle occupancy. 25 As a result, vehicle use has been growing significantly faster than the population, over four times faster than the driving-age population over the 1980s. 26\n\nThe absolute and per-capita expansion in vehicle travel has been associated with a number of very significant environmental problems.\n\nOil Consumption\n\nTransportation is by far the largest consumer of petroleum products in the United States, accounting for some two-thirds of our overall oil consumption. 27 As of 1994, the United States was using around 11 million barrels of oil each day to support our transportation habits. 28 Slightly more than one-half of U.S. transportation energy is consumed by cars and other personal vehicles, with heavier freight trucks accounting for another 23%. 29 Transportation alone consumes more oil than the United States produces, and also more oil than we import, each year. 30\n\nOur gluttonous appetite for oil is uniquely American, at least as a matter of degree. The average American citizen uses five times as much energy for transportation as the average Japanese and nearly three times as much as the average citizen of western Europe. 31 The United States consumes more than one-third of the world's transportation energy, even though we account for only 4.7% of the world's population and less than one-fourth of its combined gross product. 32\n\nRising Carbon Emissions\n\nTransportation in the United States currently contributes some 450 million metric tons annually of CO 2 , a major greenhouse gas, to the atmosphere. This constitutes around 32% of total U.S. carbon emissions, and the amount is growing fast. Carbon emissions from transportation have been growing 20% faster than the overall rate from all sources.\n\nChanges to our climatic patterns from the greenhouse effect have already been detected by a consensus of international scientists, and the eventual damage to human health and ecosystems is predicted to be widespread and very serious. While, as of this writing, it is quite unclear what the ultimate American responses to the accords of the 1992 Earth Summit will be, or whether new agreements will be negotiated, under any scenario it will be difficult to meet our obligations if emissions from the transportation sector are not addressed.\n\nUnhealthy Air Quality\n\nIn addition, cars and other highway vehicles constitute a continuing major source of air pollution in the United States. Although in many areas of the country air is getting cleaner with better emissions technology, highway vehicles continue to emit some 60 million tons of carbon monoxide (CO) per year, about 62% of our national inventory of that pollutant. Cars and other highway vehicles continue to emit some seven million tons per year (almost 26%) of our volatile organic compounds (VOCs), and eight million tons per year (about 32%) of our nitrogen oxides (NO x ). VOCs and NO x are both precursors of ozone smog. Motor vehicles also continue to emit as much as 50% of our carcinogenic and toxic air pollutants, such as benzene and formaldehyde. And heavy vehicles, particularly diesel-powered buses and freight trucks, constitute a significant source of soot and other unhealthy fine particles that, when inhaled, lodge in and damage human tissue. 33\n\nA publication from the U.S. Environmental Protection Agency (EPA) summarizes the situation and suggests the cause:\n\nDespite considerable progress, the overall goal of clean and healthy air continues to elude much of the country. Unhealthy air pollution levels still plague virtually every major city in the United States. This is largely because development and urban sprawl have created new pollution sources and have contributed to a doubling of vehicle travel since 1970. 34\n\nEPA scientists believe that current trends in vehicle trips and miles driven, even with continuing but incremental improvementsin emission control systems, threaten to reverse the recent national trend of improving air quality by causing total emissions of not just CO 2 but also sulfur dioxide and particulate matter to increase in the near future. 35 Total NO x [32 ELR 10638] emissions from motor vehicles already are at a higher level than they were two decades ago, despite improvements in the emissions performance of individual vehicles. 36 The result is continued impairment of both human health and ecosystem health, including contributions to such recognized ecosystem threats as acid rain and excess nitrogen loading to aquatic and terrestrial systems.\n\nInfrastructure-Related Impacts\n\nIncreased driving leads to calls for increased transportation infrastructure, as we add road capacity and other facilities. In some communities, parking lots now constitute the largest single category of land use. Transportation-related pavement is a major source of runoff water pollution in many watersheds, and nonpoint source pollution remains the nation's most serious water quality problem. Although agriculture's unfortunate grip on first-place as a contributor to nonpoint source pollution nationally is not threatened, the impact of pavement on urban and suburban watersheds is immense. Highways also fragment wildlife habitat, bringing new visitors into previously pristine areas. Finally, in the eyes of many, they blemish the visual landscape. 37\n\nIn addition, it is becoming increasingly clear that new highway capacity can induce additional travel and additional land development, although the extent and workings of this dynamic are still largely to be determined. To the extent this is true, it places transportation in a vicious cycle of increased driving, highway expansion, and new land development, which leads to still more increases in driving, highway expansion, and land development, with no end in sight.\n\nSocial and Economic Impacts\n\nMoreover, with increased driving has come increased congestion: Americans now spend roughly one of every eight waking hours in our cars. Seventy percent of peak-hour travel on urban Interstate highways now occurs on congested roads operating at more than 80% capacity. Researchers put the annual cost to the American economy of lost productivity from congestion-related delays at $ 78 billion in 1999. 38 And, at current rates of population growth and urban expansion, it is prohibitively expensive to try to build our way out of congestion with more and more expensive new highway lanes, even if more roadway space constituted an adequate answer.\n\nBeyond congestion, there are substantial impacts on communities. As investment follows transportation facilities out to the fringe of metropolitan regions, existing communities in central cities and traditional towns can suffer a decline in jobs and opportunity. This can have serious consequences for populations left behind, including a disproportionate number of low-income neighborhoods and communities of color. 39\n\nU.S. Federal Transportation Policy Since the Earth Summit\n\nAmerican transportation policy has become increasingly cognizant of these problems. In particular, just as Agenda 21 was being adopted, the United States was entering the beginning stage of a fundamental change in federal transportation policy. For the preceding 50 years, the principal focus of federal influence on transportation planning and management had been the construction of the U.S. Interstate Highway System, arguably the largest and most ambitious public works project in human history. But as the 1990s began, that project, at least as conceived, was nearly complete.\n\nThe kind of expansionist philosophy that had given rise to the Interstates was becoming tempered by greater attention to environmental issues associated with transportation and a more pragmatic approach that recognized that there were limits to available federal funding for large construction projects. Even before the Earth Summit, we had begun at least some steps to incorporate the underpinnings of transportation sustainability into law and policy: a more holistic approach to policy and investment planning: a more diverse and balanced mix of transport modes; and a more sensible approach to land use that enables conservative use of energy and capital to fulfill mobility needs.\n\nThe Intermodal Surface Transportation Efficiency Act\n\nThis new approach found expression in ISTEA, enacted at the end of 1991. 40 Although the new law continued to authorize a substantial amount of federal funding for highway work, its name suggested the beginning of a new direction: a greater emphasis on all modes of travel, not just highways, and an emphasis on environmental and economic efficiency. Both, of course, are key ingredients of sustainable transportation.\n\nIndeed, in principle the new law was highly compatible with the Agenda 21 recommendations that followed it. For example, ISTEA's first sentence declared that it was the policy of the U.S. government to develop a transportation system that is \"economically efficient and environmentally sound\" and that will \"move individuals and property in an energy efficient way.\" The law's declaration of policy was expanded in subsections that included three additional references to energy-related concerns and two to reducing air pollution, along with references to providing mobility to elderly, disabled, and economically disadvantaged persons, reducing traffic congestion, and improving quality of life. 41\n\nIn general, ISTEA eschewed substantive regulatory requirements in favor of procedural ones that assured the consideration of nationally important goals, along with appropriate funding mechanisms to enable regions and states to put efficiency strategies into effect. The cornerstone of this approach was (and remains) a planning process established for metropolitan areas and states, which reiterated that it was in the national interest to promote planning that will \"minimize transportation-related fuel consumption and air pollution.\" All modes were required to be considered, including [32 ELR 10639] not just public transit but the provision of pedestrian and bicycle facilities. 42\n\nThe statute went on to require metropolitan planning organizations (MPOs) to develop long-range transportation plans and near-term transportation improvement programs in accordance with a number of criteria, including consistency with applicable federal, state, and local energy conservation programs and objectives and attention to \"the overall social, economic, energy, and environmental effects\" of transportation decisions. 43 These criteria were supported by others among the so-called 15 factors of MPO planning, including requirements to give priority to using existing transportation systems more efficiently, to consider the impacts of transportation planning on land use, to plan for the efficient movement of freight, and to consider methods to expand, enhance, and increase the use of transit services. 44 The requirements for statewide transportation planning, which took precedence outside of metropolitan areas, generally duplicated the sustainability-related factors specified for MPOs. 45\n\nTwo additional requirements were particularly important to planning for local and state transportation systems that are environmentally sustainable. First, ISTEA specified that projects may be included in plans only if full funding could reasonably be anticipated for them; this encouraged officials to strive for system efficiency by making the most of available budget resources and discouraged \"wish lists\" of expensive highway projects that could become entrenched in bureaucratic thinking. 46 Second, the U.S. Department of Transportation (DOT) interpreted the broad mandate of the law to require that, where the need for a \"major metropolitan transportation investment\" was identified, studies must be undertaken to evaluate the cost-effectiveness of alternative strategies in meeting local, state, and national objectives. 47\n\nThe federal funding mechanisms of ISTEA complemented the planning features and further enabled and encouraged regions and states to implement sustainable transportation strategies. Foremost among these were the law's flexible funding procedures, which allowed transportation managers to utilize funds that under previous statutory schemes had been available only for highway construction and maintenance and, pursuant to local discretion, apply them to public transit or other alternative modes. ISTEA's innovative Surface Transportation Program (STP), was (and, though the law has been amended, remains) available to fund not only highway projects but also transit capital assistance, carpooling initiatives, bicycle and pedestrian facilities, transportation control measures, and other projects. 48 Additional statutory authority allowing regional and state authorities to transfer funds not needed in other accounts to STP enhanced the inherent flexibility of this program. Accounts that became eligible for transfer include those for the National Highway System, Interstate highway maintenance, and highway and bridge replacement and rehabilitation. 49\n\nIn addition, ISTEA helped assure that at least some investments were made consistent with energy and environmental objectives by setting aside modest portions of overall federal transportation assistance for these purposes. In particular, 10% of a state's STP apportionment was required to be set aside for so-called transportation enhancement activities such as pedestrian and bicycle facilities, scenic and historic conservation, and mitigation of water pollution due to highway runoff. 50 And ISTEA's Congestion Mitigation and Air Quality (CMAQ) Improvement Program was established to fund transportation control measures and other projects that help localities attain compliance with national air quality standards; such measures often help save energy as well as reduce pollution. 51\n\nAlthough ISTEA was much more than an environmental or energy policy statute, these features were at its core. They entered the law with strong bipartisan support, and President George H.W. Bush signed the law without reservation on December 18, 1991. Shortly after ISTEA's enactment, the Bush Administration's transportation leadership lauded its environmental features. 52\n\nISTEA's package of goals, safeguards, and incentives also heralded a new era of environmental policy in another respect: instead of command-and-control regulation, the law established a framework for flexibility and partnership government. Standards, goals, criteria, and procedures were set at the federal level but choices about how to meet nationally important objectives were to be made at the local and state levels.\n\nThe Transportation Equity Act for the 21st Century (TEA-21)\n\nBy 1998, when Congress reauthorized federal transportation legislation, the political climate in Washington had changed considerably. Control of both the House of Representatives and the Senate had passed to the Republican party, and there was strong sentiment to reform many federal programs. Parts of the highway lobby and some lawmakers challenged whether any federal money should be set aside for environmental uses and whether required planning procedures should be retained. Indeed, some questioned whether the federal government should retain any interest in transportation investment, proposing that ISTEA's categories and safeguards be replaced by a system of block grants to be administered at state discretion. Because of the law's popularity, however, none of this came to be.\n\nInstead, TEA-21 retained ISTEA's sustainability features. 53 Gains and losses were both minor and essentially balanced each other out. In particular, the planning structure survived with only minor tweaking, the most significant changes being the consolidation of the long list of planning factors into a shorter and more general list of seven, one of [32 ELR 10640] them to \"protect and enhance the environment, promote energy conservation, and improve quality of life,\" 54 and the clarification that major investment studies were not to be undertaken separately from the planning and project review processes but integrated within them. 55 Funding for the dedicated CMAQ and enhancements programs increased in size under the new law, although some of the increase (not the base funding) is now subject to transfer at state and local option to other categories, as most highway funding has been since ISTEA. 56\n\nIn addition, the reauthorized law contains a number of additional \"green\" features relevant to sustainability:\n\n. A new pilot program to encourage states and metro areas to employ innovative land use incentives and controls to curb sprawl and reduce automobile dependence 57 ;\n\n. A new welfare-to-work program designed to strengthen the ability of public transit systems to accommodate \"reverse\" and suburb-to-suburb commuting 58 ;\n\n. Continued requirements that certain minimums be spent on system preservation rather than new highway expansion or construction; and 59\n\n. A dramatic increase in authorized spending for mass transit systems. 60\n\nOn the opposite side, a feature of the new law that has been particularly worrisome to the environmental community is the so-called streamlining provision designed to speed up review of proposed highway and other transportation projects without compromising environmental standards. 61 Congress rejected alternate versions of the provision that contained stringent features proposed by the highway lobby, but opponents fear that environmentally destructive projects could be rushed through state and federal procedures if it is interpreted liberally. The provision remains controversial and implementing regulations have been the subject of congressional hearings and a contentious rulemaking process. 62\n\nIn addition, there has been concern over the sheer amount of transportation spending authorized by the law, over $ 200 billion (40% more than authorized in ISTEA) spread over six years. Although much of this money could go to sprawl-inducing highway construction, the bulk can be used at local option not only for new highways but also for maintenance of existing ones, or for public transit. 63\n\nThe CAA\n\nBesides the major transportation statutes, the federal law with the most direct relevance to environmental sustainability in transportation is the CAA, particularly its so-called conformity provision that requires transportation plans in areas with significant air pollution to help achieve compliance with air quality goals and plans. Although added to the CAA in 1977, the conformity provision was strengthened considerably in the 1990 CAA Amendments. 64 EPA has implemented the provision with a complex scheme under which the vehicle emissions associated with highways and other new transportation projects must be estimated as precisely as possible and compared with schedules established in state implementation plans for attainment of the CAA's air quality goals. 65\n\nCompanion provisions were inserted in the transportation statutes. One requires that federal-aid highway construction be consistent with plans for assuring the attainment or maintenance of air quality goals. 66 Another, provides more specifically that in metropolitan areas classified as polluted (nonattainment) with ozone or CO, federal-aid highway projects may not increase carrying capacity for single-occupant vehicles unless they are part of approved congestion management plans. 67\n\nAs a result of these provisions, regional transportation systems in nonattainment areas must now be designed specifically to limit emissions from transportation sources to the levels set by states in their clean air implementation plans. 68 While the CAA's scheme for regulating sources of pollution is nothing if not complicated, in essence it requires that state implementation plans (SIPs) for achieving healthful air quality in polluted areas establish separate emission \"budgets\" for mobile sources (cars and trucks), stationary sources (power plants and factories), and area sources (paints, agriculture), along with control strategies limiting emissions from each. Trade offs may be negotiated among the various sources, encouraging exploration of the lowest cost means for timely attainment. The conformity provisions require both short-term (three-year) transportation-funding programs and long-term (20-year) regional transportation plans to conform to these emission budgets, so that new transportation investments will not cause violation of the SIP emission limits or delay in timely air quality attainment.\n\nMaking a Difference, but Still Far to Go\n\nThere is no question that these new initiatives in the 1990s have catalyzed new ways of thinking about transportation investments that can move the country closer to sustainability. We have adopted a framework much more conducive to holistic, inclusive planning, with greater consideration [32 ELR 10641] of environmental issues. In many respects, we have laid a foundation for achieving Agenda 21's goals of \"more efficient, less polluting and safer\" transportation, 69 with more emphasis on less polluting modes and to integrating transportation and land use planning. The journey has begun; the destination remains elusive, however, and we will have to do more to reach it.\n\nChanges in Spending and Planning\n\nWe can measure some progress on the path to sustainability. An analysis of federal transportation spending by the Surface Transportation Policy Project (STPP) found, in particular, that in the 1990s the amount of federal money spent on road repair (instead of new construction) and on modes other than driving increased: the share of federal funds going to road repair grew from 39% in 1990 to 49% in 1998. Spending on public transportation almost doubled, from about $ 3 billion in 1990 to almost $ 6 billion in 1999. 70\n\nChanges in planning have accompanied the changes in spending patterns. In the Atlanta, Georgia, region—one of the nation's most sprawling, automobile-oriented, and polluted—a new regional commission has been established to guide transportation and land use planning and management. Created by state law after years of litigation in which the region's transportation plans were found out of conformity with the CAA, the new commission has the authority to override county or local government decisions that it finds inconsistent with the region's long-range goals of reducing growth in vehicle traffic and pollution. In one of the region's bold new initiatives, some $ 350 million is slated to be spent in the next 25 years on transportation improvements specifically linked to \"smart growth\" projects—those designed to slow traffic growth by substituting compact, mixed use, transit-oriented land development for suburban sprawl. The Atlanta initiative is modeled after a similar program recently undertaken in the San Francisco Bay area. 71\n\nIn the Albany, New York, metropolitan region, planners for the first time undertook a comprehensive consensus-building process pursuant to ISTEA to choose a multimodal transportation scheme for the region's future. The process was assisted by a number of system performance indicators, including a measure of the gallons of fuel per day that are likely to be consumed in providing, maintaining, and using various alternative visions for the region. The region's \"New Visions\" plan, adopted in 1997, stresses public transit and bicycle and pedestrian facilities and movement, and focuses on managing and redesigning existing facilities, services, and ways of doing business, rather than on physically expanding the system. Planners estimate that the land use and demand management actions prescribed in New Visions will dampen the rate of growth in vehicle miles of travel by one-third to one-half when compared with rates experienced in the 1990s. 72\n\nBut perhaps no U.S. story in planning for sustainable transportation is more celebrated than that of Portland, Oregon. Assisted by the nation's strongest state land use law and a series of reforms initiated before but continued under ISTEA and TEA-21, Portland undertook an exhaustive study of transportation and land use options in the 1990s and embarked on a program of alternatives to sprawl and free-way-building. They have included an urban growth boundary beyond which new development generally may not occur, a light-rail system, and aggressive set of incentives to spur walkable, transit-oriented neighborhoods. Portland's downtown has accommodated 30,000 new jobs in the last two decades without a significant increase in the number of parking spaces or vehicle trips. 73\n\nIn addition, there has been a 50% increase in public transit trips to downtown, and 43% of all work commuting trips in Portland—many times the national average—are now made on public transit. Air quality is improving. 74 It may be telling that, despite a comparable rate of population growth in the 1990s, Portland's per capita vehicle traffic was less than two-thirds that of Atlanta; while both regions experienced growth in vehicle miles traveled, Portland's growth rate was less than one-half that of Atlanta from 1992 through 1998. 75\n\nFederal programs initiated in the 1990s have also funded a host of specific projects helpful to sustainability in communities. The Surface Transportation Program under ISTEA and TEA-21, for example, has funded an access roadway to enable more efficient intermodal freight transfers at the port of Seattle. The law's enhancements program funded an intermodal transportation center in Natchez, Mississippi, that will enable that town's many visitors to leave their cars behind and visit sites on trolleys or buses. And the CMAQ program has led to traffic signal improvements in Denver that have reduced travel times by 15 to 20%, saved nearly 1,800 gallons of fuel per day, and cut CO pollutants by more than two tons per day. CMAQ funds are being used also to help establish passenger rail service on an existing freight line serving metropolitan Chicago and to build a new intermodal freight transfer facility in Auburn, Maine. 76\n\nEnvironmental Payoffs\n\nIt is inherent in transportation planning and investment, of course, that strategies take a long time to produce benefits. As a nation, we spent some 50 years building the Interstate Highway System, and reversing the impacts we inadvertently set in motion will not happen overnight. But there are some encouraging signs that the new approaches of the last decade are making transportation patterns more sustainable.\n\nIn particular, as noted above, the growth in vehicle miles traveled per capita slowed somewhat in the 1990s from what it had been in the 1980s and, in 2000, overall vehicle miles traveled did not grow at all, the first time in 50 years that [32 ELR 10642] driving did not increase during a period of economic growth. While it is unclear whether the experience of 2000 will become a trend or an anomaly, it is encouraging that a slowing in the growth of traffic has been accompanied by strong growth in the use of public transit. From 1995 through 2000, transit use grew 21% while driving increased by just 11%. This represents a dramatic turnaround from previous decades and even in the early 1990s, when driving grew steadily and transit use plummeted 11.8%. 77\n\nThere has also been improvement in some environmental indicators. Ground-level ozone smog declined 20% between 1980 and 1999. Ozone smog has decreased in 53 metropolitan areas measured by EPA since 1980; although there has been little or no further decrease since 1994, smog pollution has not substantially increased in those areas (as a group) since then. Those metro areas classified as having extreme, severe, or serious smog pollution problems improved 10% from 1995 through 1999. 78 Particulate emissions have decreased notably in the last decade, following a trend of decreasing emissions since a high point in the 1970s. Emissions of particles smaller than 10 microns in diameter from on-road vehicles decreased from 336,000 short tons in 1990 to 282,000 in 1996 and 257,000 in 1998. Emissions of fine particles smaller than 2.5 microns followed a similar trend. 79\n\nContinuing Challenges\n\nMost of the data on environmental indicators in the 1990s suggest that the long-range trends noted in the beginning of this Article remain far from overcome, however, and that the work begun in the last decade to reform transportation policy must be intensified if the sustainable future hoped for at the Earth Summit is to be achieved. In particular, emissions of CO 2 from transportation in the United States increased steadily each year between 1991 and 2000. 80 Petroleum consumption by the transportation sector grew nearly 20% over the decade. 81 NO x emissions from on-road vehicles, which had decreased in the 1980s, experienced a significant increase in the 1990s. 82 The steady improvement nationally in ozone smog levels that had been experienced before 1994 has, as noted, come to a halt, with smog no longer decreasing in most metropolitan areas. 83\n\nIn addition, traffic congestion has continued to increase in U.S metro areas, although at a slower rate than in the 1980s. Congestion increased 9% from 1992 to 1999 in 68 metropolitan areas tracked by the Texas Transportation Institute, by their estimate wasting 6.8 billion gallons of fuel in 1999. 84 The STPP, observing that American women, especially mothers, have become \"the bus drivers of the 1990s,\" reports that women now drive an average of 29 miles per day, spending more time in their cars than the average American spends in conversation. 85\n\nMoreover, there is plenty of evidence that old transportation spending habits are returning in many places. STPP has found that, although there was a shift in funding toward sustainable practices in the 1990s as a whole, that trend was not maintained in the decade's last two years, when the portion of funds going to road expansion and new construction increased 21% and the portion going to transportation alternatives other than driving fell by 19%. Less than 7% of \"flexible\" funding under ISTEA and TEA-21 has been used to pay for new transportation alternatives. 86\n\nMore Sustainable Approaches in Europe and Japan\n\nExperience in other countries offers hope that a strengthened commitment to sustainable practices will produce stronger benefits than we have seen so far. When comparing American cities with those elsewhere, one frequently finds comparable material standards of living, but far less energy efficiency and modal diversity in the transport sector in the United States. In particular, per capita gasoline consumption in American cities is nearly twice as high as in Australian cities, more than four times that of European cities, and over 10 times greater than in such Asian cities as Hong Kong, Singapore, and Tokyo. In many American cities more than 90% of commuters drive to work, compared with 40% in European cities and 15% in Tokyo. Only 10% of total trips in American cities are by bicycle or foot, compared with 40 to 50% in European cities. 87 In an increasingly competitive global economic system, this inefficiency could well threaten the long-term health of the American economy.\n\nThe biggest factor accounting for these differences appears to be not the size of cars or the price of gasoline, but the efficiency and compactness of land use patterns, which has a major effect on average travel distance and the extent to which alternatives to the automobile are viable. 88 Indeed, northern Europe and Japan have for decades pursued significantly different transportation investment patterns and employed stronger land use controls than in the United States. This has led to more clustered development and more efficient multimodal transportation systems.\n\nRight after World War II, for example, Europe and Japan reinvested in their public transport systems. There were several reasons for this. Unlike in the United States, few citizens [32 ELR 10643] could afford cars in these early post-war years. The scarcity of land that could be made developable by highways, especially in Japan and some of the smaller European countries, provided less political impetus to favor an automobile-oriented development strategy. Although America has now depleted much of its domestic petroleum reserves, western Europe and Japan had no such reserves and thus had good reason to avoid excessive petroleum dependency.\n\nRising affluence in the 1960s and 1970s led western European countries to shift investment to favor the automobile. However, the attention to environmental and energy issues raised in the 1970s renewed the impetus to preserve modal diversity, a policy choice supported by pressure from citizens, labor unions, environmentalists, and public transport sectors that were better organized, more powerful, and less dominated by the automobile industry than in the United States. Throughout the post-war period, Japan has subsidized the extension of its railways to ever more distant compact suburban areas, while discouraging automobile use through high user charges. As a result, Japan and western Europe approached the 1992 Earth Summit better positioned in terms of transport and land use patterns than the United States to meet the challenges of sustainability.\n\nA traffic policy paper of the League of German Cities (adopted prior to the Earth Summit) notes:\n\nPublic mass transit and individual transport, either on foot, by bike, or in a car, must be seen as a holistic system. Each mode needs to be promoted where it offers the greatest advantage in economic, environmental, and social terms. With the help of development policy decisions, building and traffic regulations and associated planning measures, we must help achieve a reduction in transport that is avoidable and shape the unavoidable traffic in a manner that improves the living and environmental conditions of our citizens. 89\n\nThe Netherlands and Denmark provide particularly successful models of a multimodal approach to transportation integrated with sound land use planning. Public transport and bicycle use had fallen dramatically in both countries in the 1950s and 1960s with the building of suburbs and rising investment in roads and automobiles, although even during this period bicycles came into greater use for access to suburban rail and bus stops.\n\nStarting in 1975, it became Dutch national transport policy to devote at least 10% of the surface transportation budget to bicycle facilities as a way to reduce the expenditures for public transportation subsidies and roads, while favoring the environment and urban quality. By the mid-1980s, more than 30% of all trips in the Netherlands were made by bicycle, and 25% of all access trips to railway stations were by bicycle. 90 Over the past several decades, the Dutch have made major efforts to maintain and expand their efficient and integrated public transport network, which relies heavily on various bus and railway modes.\n\nIn the late 1980s, the Dutch Transport Minister announced a bold plan to lower automobile ownership to 3.5 million cars from the current five million, which had been projected to grow to eight million in just two more decades. With the goal of cutting CO 2 emissions by 8% by the year 2000, the proposed plan included increased taxes on automobile ownership and use along with expanded subsidies for public transportation. Although these plans have since been weakened or slowed, current national policy remains committed to reducing transport sector carbon emissions through strategies including significant pricing and demand management. 91\n\nIn Denmark, car owners pay a nearly 200% sales tax when purchasing a car, approximately $ 1,000 per year in automobile registration fees, and $ 7 per gallon for gasoline. Much of the resulting revenue benefits public and bicycle transport. The city of Copenhagen, for example, installed cycle paths along a large portion of the major arterial roads throughout the city in the late 1970s and 1980s and thus reversed the decline of bicycle use, which now accounts for 30% of all trips in the city. In the 1990s, a new network of higher quality, higher speed, limited access cycle paths was integrated into the city to attract more long trips to bicycle use, as part of the Danish government's pledge to reduce carbon emissions. 92\n\nEleven Steps to a Sustainable Transportation Future\n\nAs a nation, there is little question but that we are, in fact, moving toward sustainability in transportation. There have been measurable improvements in process, in mode shifts, and even in some environmental indicators. But, with long-term trends foretelling a dramatically growing population and a growing economy, mere motion toward the goal is not enough, because the goal is itself moving farther and farther away, becoming more difficult to achieve.\n\nIn order to achieve the kinds of changes envisioned by the Earth Summit, and to put the United States on a course in transportation that moves more purposefully and effectively toward true sustainability, Congress and the federal agencies must build upon the policy reforms of the 1990s with additional efforts. These efforts can and must begin immediately, but it is important not to think of them as short-term efforts. Achieving sustainability in transportation will require a sustained effort. Such an agenda might include the following ideas discussed below.\n\nRecognize How U.S. Public Policy Has Diminished Our Choices\n\nThe first step is simply to recognize more thoroughly that policy does have a substantial impact on travel behavior, rather than to assume passively that travel behavior is innate and must be accommodated by policy. In fact, the travel choices available to most Americans have been sharply curtailed by past policies, from highway subsidies to housing and tax policies to zoning laws, that have made it unattractive or impossible to choose more sustainable options such as walking, cycling, riding transit, living close to our jobs, and driving small, efficient motor vehicles. Moreover, even apart from the considerable influence—intentional or not—of government subsidy and law, this is an area in which the so-called free market does not work. For example, for most of the past century we have failed to reflect the real [32 ELR 10644] cost of transportation choices in the prices consumers pay for transportation, vastly diminishing nonautomotive access and increasing our energy use. The experience of other countries, as discussed above, demonstrates that our choices need not be so limited. Recognition of these issues is the first step toward correcting them.\n\nMaintain ISTEA/TEA-21/CAA Reforms\n\nWhile cleaner vehicle technologies have cut pollution per mile, these have been offset by more miles driven and by a shift to less efficient and more polluting trucks and sport utility vehicles (SUVs). In future reauthorizations, Congress should build upon the reforms of the 1990s that have established a framework for moving toward sustainability, and it should resist pressure to weaken or rework the transportation conformity requirements. It is especially important to allow conformity to operate under the framework of air quality plans that include adopted emission budgets to reach attainment; these have only taken effect during the last year in most seriously polluted regions.\n\nEstablish and Work Toward Goals for Energy Conservation and Equity\n\nIn future reauthorizations of federal transportation law, Congress should expand eligibility and incentives for federal transportation funds to encourage community-based solutions to traffic and urban livability. This should include requirements that near-term transportation improvement programs (TIPs) and 20-year regional transportation plans (RTPs) assure timely reasonable progress to achieve at least the following sustainability goals:\n\n. Reduce energy consumption and greenhouse gas emissions to meet national, state, and regional goals;\n\n. Provide equal access to jobs, public facilities, and other opportunities without undue time and cost burdens, including for those without cars; and\n\n. Provide a safe walking route to school for every child.\n\nIn Atlanta and many other metropolitan areas, the share of regional jobs reachable by those without cars is low and declining because new commercial and housing development has been approved without assuring access for transit users or pedestrians. This raises concerns under the Civil Rights Act about disparate impacts of federally approved transportation plans and programs. Ironically, Atlanta has recently proved that we can do better: during the 1996 Olympics, morning peak traffic was cut 23% by temporarily putting 1,000 more buses into service and promoting alternatives to driving. This not only expanded access to jobs but also cut traffic-related smog to the degree that hospitalizations of children for asthma dropped by 40%, according to research published in the Journal of the American Medical Association. 93\n\nIntegrate Transportation Planning and Project Reviews but Maintain Environmental Safeguards\n\nOur nation adopted a variety of environmental and historic preservation laws and regulations to inform decisionmakers and assure the public's right-to-know about the effect of decisions and alternatives before bulldozers started knocking down people's houses or paving over streams. Today, transportation and resource agencies are striving to coordinate the planning and project review processes better to reduce redundancy and unproductive bureaucratic process. There may be many opportunities, for example, for agencies to review small, low-impact projects more efficiently and quickly. This can free resources for more thorough review of proposals with more substantial environmental consequences, as contemplated by Agenda 21.\n\nIndeed, on larger transportation initiatives, community consensus will come more easily and efficiently with more effective involvement of stakeholders early in a more integrated planning and project review process that examines transportation, air quality, and land use together. Informed participation and better decisions can flow from use of best practice analytic methods to consider secondary, indirect, and cumulative impacts. These should include fuller consideration of alternatives to road capacity expansion in the planning and project development process and identification of strategies that will reduce transportation energy use. This better administrative approach, anticipated by TEA-21's environmental streamlining provision, does not require changes in the statutes.\n\nRecognize \"Induced Demand\" in Transportation Planning and Management\n\nIt is all too tempting for transportation managers and other state and local officials to implement quick-fix road expansions in attempts to solve our congestion, air pollution, and energy problems by eliminating bottlenecks in the system. Indeed, they are frequently under enormous pressure to do so. If this approach worked, however, Atlanta would be a clean-air, delay-free haven; instead it has become a poster child for sprawl, congestion, and smog. Throwing more money into road building will not solve congestion, fuel economy, or air pollution any better than buying bigger pants solves obesity.\n\nWe now know that in most cases new and wider roads bring new traffic that soon uses up the added capacity. As the saying goes: \"If you build it, they will come.\" People shift their time-of-day-of-travel, where they live and work, which shops they go to, and how they travel in response to changes in travel time and cost. Alleviating road bottlenecks without changing how we provide, manage, and price transportation choices and incentives will just leave us stuck in bigger traffic jams down the road, with more sprawl, energy use, and air pollution.\n\nAlthough better practice methods that account for induced demand are readily available, many regional, state, and local agencies have resisted their adoption, preferring to use obsolete analytic methods as they compare various project and plan alternatives and seek to meet federal planning requirements. At the federal level, the DOT and EPA have failed to press for timely improvement in analytic methods, accepting as standard practice methods that are insensitive [32 ELR 10645] to key elements of induced demand, such as time-shifts in travel. This often leads to major errors in estimating the air-pollution, energy-consumption, and congestion-related impacts of projects and plans. The DOT, EPA, and Congress should support timely adoption of best practice planning and project analysis methods.\n\nMake Commuter Choice a Typical U.S. Workplace Benefit\n\nFor most Americans, a free parking space at work has been the sole available commuter benefit, because of long-standing federal tax code preferences. But recent tax reforms are expanding commuter choice. Employers can offer their employees tax-free transit and vanpool benefits of up to $ 100 a month starting in 2001, as well as taxable cash-in-lieu-of-parking benefits. Allowing employees to buy transit passes with pre-tax dollars saves the typical transit commuter over $ 400 a year and saves their employer money as well. When federal agency employees in the Washington, D.C., metro area received employer-paid transit benefits starting in 2000, 11% of those who used to drive to work switched to transit, taking 12,500 cars off the region's crowded roads every workday. At firms in California and Minnesota, a two-to three-dollar-a-day incentive in lieu of free parking has helped motivate one out of eight who used to drive to find other ways to get to work. 94 Such benefits help employers attract and retain employees and especially help low- and moderate-wage workers who spend a large share of their incomes commuting and often ride transit to work.\n\nCongress should respond to Agenda 21's admonishment to place more emphasis on less polluting transportation modes by spurring more widespread adoption of these benefits. It should provide fully equal tax treatment for parking and transit benefits and give bicycle commuters the same financial incentives as transit users. It should copy the tax credits recently adopted by Maryland, Minnesota, Oregon, and Washington to provide incentives to employers for the cost of providing transit benefits to their employees. Cutting morning commute traffic by 5 to 10% in rural and outer suburban areas and by 10 to 20% in major urban centers—ambitious but reachable goals—would speed traffic, boost access to jobs for low- and moderate-income workers, and reduce gasoline use enough to avoid any short-term price spikes caused by limited refinery capacity, while also helping the country reduce dependence on imported oil.\n\nEncourage Road-Pricing Mechanisms Without Toll Booths\n\nAs noted above, Agenda 21 calls for more use of market-based mechanisms. For transportation, another promising option for cutting excessive vehicle use is greater use of road pricing, assisted by new nonstop electronic toll technology that allows motorists to pay tolls without slowing down. Road pricing can encourage alternative travel choices and also provide additional revenue streams essential to maintain transportation systems, expand choices, and cope with growing travel demand. For example, automated time-of-day tolls can shift highway usage away from peak periods and keep traffic flowing without wasting scarce road capacity. Already, time-of-day tolls help manage congestion and expand choices in the metropolitan New York/New Jersey region, with discounts for electronic toll payers who avoid rush hours and premium tolls for peak drivers. 95 Another innovative application is High Occupancy Toll (HOT) lanes, which allow solo drivers to pay to use high occupancy vehicle lanes while giving a free ride to buses, vans, and sometimes carpools. 96\n\nCongress should encourage states and transportation facility operators to replace annoying toll booths that cause congestion and waste gasoline with new customer-friendly tolling systems using toll transponders and image processing and billing systems, as on Toronto's Electronic Toll Road. 97 Congress should encourage states to issue toll transponders with vehicle registrations, and eliminate restrictions on tolling highways that were constructed with federal aid, which can now only be tolled under limited pilot projects authorized by TEA-21.\n\nHOT lanes have been controversial because they tend to favor those with the resources to pay to use them. This is a legitimate concern, and one way to mitigate inequitable impacts is to direct HOT-lane revenues explicitly to applications that benefit low-income citizens. If HOT-lane revenues fund new transit, for example, as on San Diego's Interstate-15 HOT lane, everyone wins. And the environmental benefits can be substantial: on California's Route 91, diversion of traffic onto HOT lanes has reduced congestion on the entire road and increased the number of passengers per car to 1.6, compared to a previous average of 1.2 per car. 98\n\nEncourage Use-Based Car Insurance\n\nAnother promising market-based mechanism is so-called pay-as-you-drive automobile insurance. Current policies are based on fixed-rate categories that typically charge very high rates per mile to those who drive little, while offering low rates per mile for those who drive significantly more than the average. This hurts those who live in cities and the poor, who effectively subsidize high-mileage suburban drivers. In August 1998, Progressive Insurance inaugurated a project in Texas assisted by global positioning system (GPS) equipment to charge drivers for insurance according to where, when, and how much they drive, rather than on a fixed price. Drivers who use their cars less pay less for insurance. Similar use-based car insurance may soon be introduced elsewhere using the GPS equipment that is now factory-installed on many cars. EPA is studying the concept under its \"Project XL,\" which is intended to spur innovative solutions to environmental problems. 99\n\n[32 ELR 10646]\n\nThe same GPS-cellular communications equipment that would facilitate use-based car insurance also supports other energy-conserving and safety services. One particularly useful application is identifying the precise location of emergencies, including those where injured drivers and passengers are unable to talk. Especially when coupled with automatic 911 calls when an airbag is deployed, this facilitates rapid response to save lives and clear accidents off congested roads quickly, which in turn saves fuel lost in traffic incident delays. Congress should require motor vehicle manufacturers to install low-cost (roughly $ 100 a unit) GPS-cellular equipment as a standard feature in all new cars. This would enable tens of millions of motorists to save hundreds of dollars a year on car insurance, reduce gasoline use and traffic, and save lives, fuel, and time. 100\n\nImprove and Expand Pedestrian and Bicycle Facilities\n\nMany transportation agencies have greatly boosted bicycle and pedestrian facility improvements in the past decade, following more than half of a century in which pedestrians and bicycles were pushed aside by automobile-oriented policies. Replacing short car trips with walking and bicycling is a particularly useful way to help achieve the sustainability goals of saving gasoline and reducing emissions per mile, because the fuel efficiency and emissions performance of the repeated engine starts and post-trip cool-downs associated with short trips is very poor. 101 Projects that restore or improve walking and biking connections between neighborhoods and to schools can also reduce chauffeuring by parents; today, lack of sidewalks and safe intersection crossings effectively prevents many children from traveling on their own power instead of spending up to several hours a day in parents' cars or riding school buses. 102\n\nTraffic calming on local streets, with narrowed streets at intersections, raised sidewalks, and other measures designed to slow motor vehicles, is frequently all that is needed to restore walkability to a neighborhood. Traffic calming alone has been shown to reduce gasoline use by 12% in some circumstances. In addition, such measures as secure, guarded bicycle parking at transit stations, as now found in California, Colorado, Oregon, Pennsylvania, and Washington, can greatly boost the area served by transit at far less cost than park-and-ride lots. Bike-and-ride trips reduce automobile use far more than park-and-ride measures. 103\n\nThe United States should strive to achieve a much greater share of trips taken by bicycle or on foot, as is the norm in many European countries. To encourage communities to seize opportunities to adopt such sustainable-transportation measures, Congress should eliminate the local funding match requirements for pedestrian and bicycle planning and improvements. Congress should also provide priority access to TEA-21 funds in the surface transportation and CMAQ programs for such improvements by local units of government, transportation service providers, school districts, and community development corporations, with simplified project review and contracting procedures for small-and low-impact projects.\n\nExpand Incentives for Affordable Housing Near Jobs and Transit\n\nThere is a growing consensus among land development and real estate experts that some of the best emerging opportunities for market-responsive growth of new housing and employment are located in existing communities, including urban and inner suburban areas that have been in decline in recent decades. Atlanta, Georgia; Trenton, New Jersey; and Portland, Oregon, for example, are all taking steps toward renewal of brownfields and older neighborhoods. 104\n\nEncouraging housing growth in older neighborhoods close to the center, rather than at the edges of metropolitan regions, has been shown in many studies to be one of the most effective strategies for reducing regional traffic growth and related pollution. Research in Toronto shows that, since 1976, for each 100 additional dwelling units in the central area of the city, there has been a reduction of about 120 inbound vehicle trips during the morning three-hour rush period. Increased housing density within central areas can often be accommodated within existing development patterns through conversion of abandoned dwelling units and warehouses to apartments and the conversion of underused basements, carriage houses, and garages in single-family homes to rental units.\n\nRental units in private homes, for example, constitute one of the most cost-effective ways to create affordable housing and to strengthen older urban neighborhoods where average household sizes have fallen dramatically in recent decades due to demographic changes. In addition, location-efficient mortgages that reward homebuyers who save transportation expenses by locating near transit are now available in a growing number of housing markets and provide an additional measure that can help reduce traffic growth and related energy use. Experience in Denver, Portland, and Vancouver, among other cities, shows that increasing housing density through incremental neighborhood measures can reduce regional traffic and energy use while spurring lively downtowns that attract business, residents, visitors, and new investment.\n\n[32 ELR 10647]\n\nTo address the sustainability goal of planning transportation and land use together, Congress should strengthen incentives and requirements for regional transportation plans and major project reviews to consider how zoning, permitting, building, parking, and site-design codes affect the availability of housing (particularly affordable housing) close to job centers, along with related transportation demand and its impacts. Such incentives and requirements should encourage identification of how changes to various land use and community design codes might better meet regional transportation, air pollution, and energy goals. Congress should provide expanded eligibility for priority access to TEA-21 and other funds for community development corporations and local governments to fund technical assistance to homeowners or landlords who are considering creating an accessory unit, along with marketing, loan guarantees, and interest subsidy programs.\n\nImprove Motor Vehicle Fuel Economy With Stronger Corporate Average Fuel Economy (CAFE) Standards\n\nFinally, although the emphasis in this Article has been on planning and investment issues rather than vehicle technology, we cannot overlook the fact that one-half of U.S. vehicle sales consist of gas-guzzling SUVs, large minivans, and personal trucks. In Europe, small, fuel-efficient, easy-to-park, often-luxurious city cars are now all the rage. American gasoline taxes are a small fraction of those in other countries, encouraging us to drive more and fueling our preference for gas-guzzlers. An increase in the Corporate Average Fuel Economy Standards would encourage carmakers to employ higher efficiency technologies to improve motor vehicle fuel economy. As a first step, Congress should make fuel efficiency standards for light-duty trucks (a category that includes minivans and SUVs) equal to that for cars, cutting our nation's dependence on imported oil and helping consumers save money.\n\nThe Path Ahead\n\nAs we noted earlier in this Article, achieving true sustainability in transportation will not come easily or quickly. The goals of Agenda 21 and the Earth Summit are especially difficult to achieve in the American transportation context, where sprawl, high rates of driving, and large personal vehicles prevail, and where decisionmaking for transportation has traditionally been dispersed among so many state and local jurisdictions. But it is our view that, increasingly, Americans are ready to take the necessary steps. Americans want more transportation choices. Americans want alternatives to sprawl that can make their lives more convenient. Where innovative measures have been applied, they have proven immensely popular.\n\nIn large part, the legal framework to support sustainable transportation has been put into place at the federal level in ISTEA, TEA-21, and the CAA. The framework should now be strengthened and filled in with strong implementation, oversight, and complementary incentives. States and localities should follow suit, as some already have. We have begun to change, but we must continue.\n\n1. See discussion in NATIONAL ACADEMY OF SCIENCES (NAS) & NATIONAL RESEARCH COUNCIL (NRC), SURFACE TRANSPORTATION ENVIRONMENTAL RESEARCH: A LONG-TERM STRATEGY (REPORT OF THE SURFACE TRANSPORTATION ENVIRONMENTAL COOPERATIVE RESEARCH PUBLIC ADVISORY BOARD (publication pending in 2002).\n\n2. This Article also does not discuss issues relating to airborne or waterborne transportation, which are beyond the authors' expertise. For a publication that does, see FEDERAL TRANSPORTATION ADVISORY GROUP, NATIONAL SCIENCE AND TECHNOLOGY COUNCIL, VISION 2050: AN INTEGRATED NATIONAL TRANSPORTATION SYSTEM (2001).\n\n3. For citations, see detailed discussion of U.S. federal transportation policy since the Earth Summit below in the text accompanying footnotes 40 to 68.\n\n4. For a more thorough explication, see Michael Replogle, Sustainability: A Vital Concept for Transportation Planning and Development, J. ADVANCED TRANSP., Spring 1991, at 3-18.\n\n5. See NAS, SURFACE TRANSPORTATION ENVIRONMENTAL RESEARCH: A LONG-TERM STRATEGY (REPORT OF THE SURFACE TRANSPORTATION ENVIRONMENTAL COOPERATIVE RESEARCH PUBLIC ADVISORY BOARD (prepublication draft 2001).\n\n6. Id.\n\n7. U.N. Conference on Environment and Development (UNCED), Agenda 21, U.N. Doc. A/CONF.151.26 (1992), P9.15 [hereinafter UNCED].\n\n8. Governments are also encouraged to pursue technology transfer and research and to hold regional conferences on transportation and the environment. Id.\n\n9. See Rio Declaration on Environment and Development, U.N. Doc. A/CONF.151/5/Rev. 1, 31 I.L.M. 874 (1992), princs. 4, 10, 16 & 17.\n\n10. See Exec. Order No. 12852, 58 Fed. Reg. 35841 (June 29, 1993), ADMIN. MAT. 45058.\n\n11. PRESIDENT'S COUNCIL ON SUSTAINABLE DEVELOPMENT (PCSD), SUSTAINABLE AMERICA: A NEW CONSENSUS 99 (1996) (from Policy Recommendation 5, Action 6 in Chapter 4) [hereinafter PCSD: A NEW CONSENSUS].\n\n12. 42 U.S.C. §§ 7401-7671q, ELR STAT. CAA §§ 101-618.\n\n13. PCSD: A NEW CONSENSUS, supra note 11, at 97-98 (Policy Recommendation 4).\n\n14. Pub. L. No. 102-240, 105 Stat. 1914 (1991).\n\n15. See discussion of ISTEA below in text accompanying footnotes 40 to 52.\n\n16. PCSD: A NEW CONSENSUS, supra note 11, at 97-99.\n\n17. PCSD, ENERGY AND TRANSPORTATION: TASK FORCE REPORT 29-36 (1996) (Chapter 3, Goal 3).\n\n18. Id. at 51-56, 64-66 (Chapter 3).\n\n19. PCSD, SUSTAINABLE COMMUNITIES: TASK FORCE REPORT 29-30 (1997).\n\n20. PCSD, TOWARDS A SUSTAINABLE AMERICA 21-22 (1999).\n\n21. POLICY DIALOGUE ADVISORY COMMITTEE TO RECOMMEND OPTIONS FOR REDUCING GREENHOUSE GAS EMISSIONS FROM PERSONAL MOTOR VEHICLES, MAJORITY REPORT TO THE PRESIDENT 49 (1995).\n\n22. BUREAU OF TRANSPORTATION STATISTICS, U.S. DEPARTMENT OF TRANSPORTATION (U.S. DOT), NATIONAL TRANSPORTATION STATISTICS tbl. 1-29 (2000). This statistic is distinguished from total passenger miles traveled, cited above.\n\n23. DON PICKRELL, U.S. DOT, DESCRIPTION OF VMT FORECASTING PROCEDURE FOR \"CAR TALK\" BASELINE FORECASTS tbl. 2 (1998). See also ENERGY INFORMATION ADMIN., U.S. DEPARTMENT OF ENERGY (U.S. DOE), ANNUAL ENERGY OUTLOOK 1996, at 24 (1996) (DOE/EIA-0383 (96)) [hereinafter ANNUAL ENERGY OUTLOOK].\n\n24. The number of miles driven nationally remained essentially the same from 1999 to 2000. While it is possible that this leveling will be sustained, nothing in the previous four years or the previous three decades indicates that the drop-off represents a trend. In 1999, miles driven increased 2.5%, the same rate of growth observed in 1998 and close to the average annual rate for the 1990s as a whole. The reasons why 2000 was different have yet to be fully explored. Lower rates of driving associated with the energy shortages of the late 1970s and early 1980s were short-lived. It is highly uncertain what effect, if any, military action and other consequences of terrorist attacks in America on September 2001 will have on American travel patterns.\n\n25. See also NATIONWIDE PERSONAL TRANSPORTATION SURVEY, BUREAU OF TRANSPORTATION STATISTICS, U.S. DOT, TRAVEL BEHAVIOR ISSUES IN THE '90s, at 11-13 (1992); see also NATIONWIDE PERSONAL TRANSPORTATION SURVEY, BUREAU OF TRANSPORTATION STATISTICS, U.S. DOT, OUR NATION'S TRAVEL: 1995 NPTS EARLY RESULTS REPORT (1997).\n\n26. PICKRELL, supra note 23, tbl. 2; see also NATIONWIDE PERSONAL TRANSPORTATION SURVEY, OUR NATION'S TRAVEL, supra note 25, at 11, 13.\n\n27. ANNUAL ENERGY OUTLOOK, supra note 23, at 48. Other recent sources have put the share as high as 72%. See STACY C. DAVIS & PATRICIA S. HU, OAK RIDGE NATIONAL LABORATORY, TRANSPORTATION ENERGY DATA BOOK 3-3 (1991).\n\n28. ANNUAL ENERGY OUTLOOK, supra note 23, at 74. In the Annual Energy Outlook, energy uses are expressed in heat content, or British thermal units (BTUs). In 1994, transportation uses accounted for 22.66 quadrillion BTUs (quads) of petroleum consumption. The DOE's standard conversion factors are 5.8 million BTUs per barrel for crude oil consumption and 5.253 million BTUs per barrel for motor gasoline. Id. at 269 (Appendix I).\n\n29. OFFICE OF TECHNOLOGY ASSESSMENT, SAVING ENERGY IN U.S. TRANSPORTATION 7-8 (1994).\n\n30. The United States produces 14.1 quads of crude oil domestically each year. Net imports amount to 17.25 quads annually. ANNUAL ENERGY OUTLOOK, supra note 23, at 70. See also OFFICE OF TECHNOLOGY ASSESSMENT, supra note 29, at 2.\n\n31. OFFICE OF TECHNOLOGY ASSESSMENT, supra note 29, at 1, 10.\n\n32. Id. at 1-2; ENVIRONMENT AND ENERGY STUDY INST., FACT SHEET: OIL AND TRANSPORTATION (1995), cited in THE ADVOCACY INSTITUTE, GETTING THERE: STRATEGIC FACTS FOR THE TRANSPORTATION ADVOCATE 14, 30 (1996).\n\n33. See discussion and sources cited in F. KAID BENFIELD ET AL., ONCE THERE WERE GREENFIELDS: HOW URBAN SPRAWL IS UNDERMINING AMERICA'S ENVIRONMENT, ECONOMY, AND SOCIAL FABRIC, ch. 2 (NRDC 1999).\n\n34. OFFICE OF MOBILE SOURCES (OMS), U.S. EPA, MOTOR VEHICLES AND THE 1990 CLEAN AIR ACT, FACT SHEET OMS-11 (1994).\n\n35. U.S. EPA, OUR BUILT AND NATURAL ENVIRONMENTS: A TECHNICAL REVIEW OF THE INTERACTIONS BETWEEN LAND USE, TRANSPORTATION, AND ENVIRONMENTAL QUALITY 26 (2001) (EPA 231-R-01-002).\n\n36. U.S. DOT, FEDERAL HIGHWAY ADMIN. (FHwA), TRANSPORTATION AIR QUALITY: SELECTED FACTS AND FIGURES 19 (1996) (FHwA-PD-96-006).\n\n37. BENFIELD ET AL., supra note 33.\n\n38. TIM LOMAX & DAVID SCHRANK, TEXAS TRANSPORTATION INST., THE 2001 URBAN MOBILITY REPORT (2001).\n\n39. BENFIELD ET AL., supra note 33.\n\n40. Pub. L. No. 102-240, 105 Stat. 1914 (1991). The ISTEA enacted, amended, or repealed over 100 separate sections throughout 10 different titles of the U.S. Code, the most important being Titles 23 and 49.\n\n41. 49 U.S.C. § 5501(a), (b)(1), (3), (6).\n\n42. 23 U.S.C. § 134(a).\n\n43. Id. § 134(f)(2), (13).\n\n44. Id. § 134(f)(1), (4), (11), (14).\n\n45. See id. § 135(c).\n\n46. Id. §§ 134(h)(5), 135(f)(2).\n\n47. 23 C.F.R. § 450.318. Although amended by subsequent legislation, the concept also was referenced in the Federal Transit Act and in subsection (h)(4) of the MPOs planning requirements, 23 U.S.C. § 134(h)(4). See U.S. DOT, Statewide Planning; Metropolitan Planning, 58 Fed. Reg. 58040, 58056 (Oct. 28, 1993).\n\n48. 23 U.S.C. § 133.\n\n49. Id. §§ 103, 104(c), 119(f), 144(g).\n\n50. Id. § 133.\n\n51. Id. § 149.\n\n52. See, e.g., FHwA, ENVIRONMENTAL PROGRAMS AND PROVISIONS (1992) (FHwA-PD-92-012); U.S. DOT, ISTEA OF 1991 (1992) (FHwA-PL-92-008).\n\n53. Pub. L. No. 105-178, 112 Stat. 107 (1998).\n\n54. 23 U.S.C. §§ 134(f)(1), 135(c)(1). The planning factors were arguably weakened by the insertion of a provision clarifying that an MPO's or state's failure to comply with them is not reviewable in court.\n\n55. Pub. L. No. 105-178, § 1308, 112 Stat. 107, 231.\n\n56. See discussion in SURFACE TRANSPORTATION POLICY PROJECT (STPP), TEA-21 USER'S GUIDE 12-26 (1998).\n\n57. 23 U.S.C. § 101 note.\n\n58. 49 U.S.C. § 5309 note.\n\n59. 23 U.S.C. §§ 104, 110, 119(a). See also STPP, TEA-21 USER'S GUIDE, supra note 56, at 12, 25-26, 55-60.\n\n60. See discussion in AMERICAN PUBLIC TRANSIT ASS'N, TRANSPORTATION EQUITY ACT FOR THE 21ST CENTURY (TEA-21), available at http//www.apta.com/govt/legis/tea21/ (last visited Jan. 28, 2002). See also STPP, TEA-21 USER'S GUIDE, supra note 56, at 55-60.\n\n61. Pub. L. No. 105-178, 112 Stat. 107, codified at 23 U.S.C. § 109 note.\n\n62. See, e.g., NRDC, COMMENTS ON FEDERAL HIGHWAY ADMINISTRATION'S DOCKET NOS. 99-5933 AND 99-5989 (2000); STPP, TEA-21 USER'S GUIDE, supra note 56, at 44-48. The rulemaking remains unsettled as this Article is being written.\n\n63. STPP, TEA-21 USER'S GUIDE, supra note 56, at 42-44.\n\n64. 42 U.S.C. § 7506(c), ELR STAT. CAA § 176(c).\n\n65. See 40 C.F.R. pt. 93.\n\n66. 23 U.S.C. § 109(j).\n\n67. Id. § 134(l).\n\n68. See 40 C.F.R. pt. 93.\n\n69. UNCED, supra note 7, at Agenda 21, P9.15(a).\n\n70. STPP, CHANGING DIRECTION: FEDERAL TRANSPORTATION SPENDING IN THE 1990s (2000).\n\n71. Transportation Funds Linked to Smart Growth, NEW URBAN NEWS, July/Aug. 2001, at 1.\n\n72. CAPITAL DISTRICT TRANSPORTATION COMMITTEE, NEW VISIONS FOR THE CAPITAL DISTRICT (1997). See also Capital District Transportation Committee, at http://www.cdtcmpo.org .\n\n73. See discussion and sources cited in BENFIELD ET AL., supra note 33, at 45-47 and 152-55.\n\n74. Id.\n\n75. CURTIS MOORE, SMART GROWTH AND THE CLEAN AIR ACT 19 (Northeast-Midwest Inst. 2001).\n\n76. See JOE DISTEFANO & MATTHEW RAIMI, FIVE YEARS OF PROGRESS: 110 COMMUNITIES WHERE ISTEA IS MAKING A DIFFERENCE (STPP 1996); METROPOLITAN TRANSPORTATION COMMISSION, THE NEXT ISTEA: WEAKER OR STRONGER BREW? (1996).\n\n77. Press Release, Surface Transportation Policy Project, Americans Flock to Transit, Ease Up on Gas Pedal (Apr. 1991).\n\n78. U.S. EPA, OFFICE OF AIR QUALITY PLANNING AND STANDARDS, NATIONAL AIR QUALITY AND EMISSION TRENDS REPORT 1999 (2001) (EPA 454/R-01-004).\n\n79. U.S. EPA, OFFICE OF AIR QUALITY PLANNING AND STANDARDS, NATIONAL AIR POLLUTANT EMISSION TRENDS 1990-1998 (2001) (EPA 454/R-00-002) (Table 3-5, Total National Emissions of Directly Emitted Particulate Matter 1940 through 1998).\n\n80. ENERGY INFORMATION ADMIN., OFFICE OF INTEGRATED ANALYSIS AND FORECASTING, U.S. DOE, U.S. CARBON DIOXIDE EMISSIONS FROM ENERGY SOURCES 2000, at EI-81 (2001) (Flash Estimate).\n\n81. ENERGY INFORMATION ADMIN., U.S. DOE, ENERGY INFORMATION ANNUAL ENERGY REVIEW, ENERGY CONSUMPTION BY SECTOR tbl. 2.1e (2000) (Transportation Sector Energy Consumption, 1949-2000).\n\n82. U.S. EPA, OFFICE OF AIR QUALITY PLANNING AND STANDARDS, NATIONAL AIR POLLUTANT EMISSION TRENDS, supra note 79.\n\n83. U.S. EPA, OFFICE OF AIR QUALITY PLANNING AND STANDARDS, NATIONAL AIR QUALITY AND EMISSION TRENDS REPORT, supra note 78.\n\n84. DAVID SCHRANK & TIM LOMAX, TEXAS TRANSPORTATION INST., THE 2001 URBAN MOBILITY REPORT (2001).\n\n85. STPP, HIGH MILEAGE MOMS (1999).\n\n86. STPP, supra note 70.\n\n87. John Pucher, Urban Travel Behavior as the Outcome of Public Policy: The Example of Modal-Split in Western Europe and North America, J. AM. PLAN. ASS'N, Aug. 1988, at 510.\n\n88. LESTER BROWN & JODI JACOBSON, WORLDWATCH INST., WORLDWATCH PAPER 77: THE FUTURE OF URBANIZATION: FACING THE ECOLOGICAL AND ECONOMIC CONSTRAINTS (1987).\n\n89. See Hans Pflaumer, Traffic Concepts for the City of Tomorrow: A German View, 68 ITE J. 47 (1988).\n\n90. See MICHAEL REPLOGLE, BICYCLES AND PUBLIC TRANSPORTATION: NEW LINKS TO SUBURBAN TRANSIT MARKETS (1984).\n\n91. Replogle, supra note 4.\n\n92. Id.\n\n93. Michael S. Friedman et al., Impact of Changes in Transportation and Commuting Behaviors During the 1996 Summer Olympic Games in Atlanta on Air Quality and Childhood Asthma, JAMA, Feb. 21, 2001, at 897.\n\n94. Donald C. Shoup, Evaluating the Effects of Cashing Out Employer-Paid Parking: Eight Case Studies, TRANSPORT POL'Y, Oct. 1997, at 201-16.\n\n95. See Wayne Arnold, Relief for Rush Hour: Pay as You Go, N.Y. TIMES, Aug. 9, 2001, at F6; Jane Gross, Electronic Tolls Are Catching On, and Commuters Are Catching Up, N.Y. TIMES, Mar. 25, 1997, at B1.\n\n96. See, e.g., ITE Task Force on High-Occupancy/Toll (HOT) Lanes, High-Occupancy/Toll (HOT) Lanes and Value Pricing: A Preliminary Assessment, 68 ITE J. 6 (1998).\n\n97. See Toronto 'Pike All Electronic, TOLL ROADS NEWSL., Apr. 1996, at 7.\n\n98. See, e.g., Donald Shoup & Jeffrey Brown, Pricing Our Way Out of Traffic Congestion: Parking Cash Out and HOT Lanes, in ANDERSON BUSINESS FORECAST AND UCLA SCHOOL OF PUBLIC POLICY AND SOCIAL RESEARCH, CALIFORNIA POLICY OPTIONS (1998).\n\n99. See, e.g., U.S. EPA, Remarks of Christie Whitman, Administrator of the U.S. Environmental Protection Agency, at the National Environmental Policy Institute, at http://www.epa.gov/projectxl/whitman_03_08_01.htm (last visited Jan. 25, 2002).\n\n100. TODD LITMAN, DISTANCE-BASED VEHICLE INSURANCE AS A TDM STRATEGY (2001).\n\n$=S\n\n101. More than half of some emissions (particularly VOCs) occur during cold-start and hot soak conditions, and so are mainly affected by the number of vehicle trips that occur, not mileage. For example, a 20-mile trip produces only 35% more emissions than a 10-mile trip.\" Reductions in the number of short trips can provide relatively large pollution emission reductions. For example, shifting 5% of automobile trips to bicycling and walking might reduce total automobile mileage by just 1-2% (since these are short trips), but it might reduce pollution emissions costs by 3-6%, due to the relatively high emission rates of the vehicle mileage foregone.\n\nVictoria Transportation Policy Inst., Energy Conservation and Emission Reduction Strategies, in TDM ENCYCLOPEDIA (updated November 2001), available at http://www.vtpi.org/tdm/tdm59.htm .\n\n102. STPP, supra note 85. See also BENFIELD ET AL., supra note 33, at 42-43.\n\n103. MICHAEL REPLOGLE & HARRIET PARCELLS, LINKING BICYCLE/PEDESTRIAN FACILITIES WITH TRANSIT, NATIONAL BICYCLE AND WALKING STUDY, CASE STUDY NO. 9 (FHWA-PD-93-012) (1992).\n\n104. See, e.g., U.S. EPA, OFFICE OF SOLID WASTE AND EMERGENCY RESPONSE, BROWNFIELDS SHOWCASE COMMUNITIES (2000) (EPA 500-F-00-240), available at http://www.epa.gov/brownfields ; F. KAID BENFIELD ET AL., SOLVING SPRAWL: MODELS OF SMART GROWTH IN COMMUNITIES ACROSS AMERICA (NRDC 2001).\n\n32 ELR 10633 | Environmental Law Reporter | copyright © 2002 | All rights reserved"}, {"url": "https://www.triplepundit.com/story/2012/driving-global-shift-sustainable-transportation/88351", "page_content": "Submitted by Guest Contributor\n\nBy Michael Replogle and Colin Hughes\n\n(In collaboration with the Worldwatch Institute)\n\nPerhaps it should come as no surprise that the commitments to sustainable transportation were some of the greatest achievements of June’s Rio+20 United Nations Conference on Sustainable Development (UNCSD).\n\nVery little could exemplify the world’s need for sustainable transport to the delegates better than the average of six cumulative hours they spent on buses in a traffic-choked commute to the exurban conference site every day. It was a clear sign that despite having adopted strong language for sustainable transport 20 years earlier at the first CSD in Rio, the transportation sector needs to shift to a more sustainable path.\n\nTransportation, after all, is a primary public good and critical to the sustainability of our economies, societies, and natural environments. Without sustainable transportation, children cannot go safely to school, goods cannot efficiently reach markets, and harmful emissions will exacerbate climate change.\n\nNeeded: A Global Shift To A Sustainable Transport Paradigm\n\nAs we discussed in our chapter, Moving Toward Sustainable Transport, in Worldwatch Institute’s State of the World 2012, the current model for transportation development – one of mismanaged motorization – is highly unsustainable: rapid growth in automobile travel and concomitant growth in fossil fuel use, traffic congestion, air pollution, greenhouse gases, and traffic fatalities is degrading the quality of life for people around the world.\n\nA global shift to a sustainable transport paradigm is desperately needed.\n\nThis new archetype must become a central part of economic, social, and environmental agendas. Sustainable transport, similar to other developmental issues, is not a problem for a single group: for urban planners or freight shippers, slum dwellers or suburbanites, the urban or rural, the rich or poor – transport is inextricably linked to the quality of life for each and every human. While momentum for sustainable transport is growing worldwide, a more broad-based and urgent campaign calling for sustainable transport policy is needed worldwide.\n\nPartnership for Sustainable Low-Carbon Transport\n\nRio+20 provided a major opportunity to coalesce governments around commitments to sustainable development, including transportation. Though there was virtually no mention of transport in the original draft of the political outcome document, Rio+20 became a major breakthrough for sustainable transportation initiatives within the global sustainable development dialogue.\n\nThis success was largely achieved by the Partnership for Sustainable Low-Carbon Transport, a coalition of over 60 diverse transport-related organizations. Through direct outreach to governments and many high profile events within the UNCSD process, the Partnership strengthened the language regarding the need for sustainable transport in Rio+20’s final outcome document.\n\nYet, historically, agreements that were supportive of sustainable transport have had little to no impact in making transport more sustainable.\n\nRio+20 broke away from tradition and was a breakthrough for sustainable transport because the Partnership coordinated 16 voluntary commitments from NGO’s and multilateral institutions.\n\nMost notably, the world’s eight largest multilateral banks (MDBs), committed to invest $175 billion over 10 years to advance more sustainable transport, with annual reporting and monitoring.\n\nThese commitments exemplify the array of stakeholders committed to achieving sustainability in the transport sector. Independent oversight will be needed to encourage effective follow-up.\n\nPushing National Governments To Create Sustainable Transport Systems\n\nDespite this, significant work remains to ensure the momentum for sustainable transport emerging from Rio+20 translates into real change. Most crucially, citizens, businesses, and environmentalists everywhere must continue to push national governments to adopt sustainable transport policies, standards, and funding strategies.\n\nTransport is a primary public good and its sustainability will be determined by the policies and investments made by national governments. Over half of the approximately one trillion dollars annually invested in transport infrastructure and operation worldwide comes from governments, which also set the policies that shape the remaining investment from the private sector.\n\nSustainable Transport Solutions\n\nSustainable transport solutions are well known and tested. They include avoiding automobile travel through denser, mixed-use urban development, shifting transport to more cost effective, low-carbon modes like bicycling and rapid bus transit, and improving the energy efficiency of vehicles.\n\nThe returns on such investments, in terms of economic, energy, health, and environmental impacts, are greater than that of automobile-focused investments. The success of these solutions is not a question of technology or effectiveness, but of generating sufficient political will and institutional capacity to implement them.\n\nMore and better-targeted investment in transport would be beneficial, but these need to be accompanied by governance reforms to facilitate improved operations of transport systems, with more accountability for performance. It is time for civil society, businesses, and environmentalists worldwide to join forces to foster lower-cost, energy efficient, universally accessible transportation investments, and to cultivate local and global leadership to advance that agenda.\n\nA growing number of cities, from Guangzhou to New York, supported by various leading businesses, are showing how sustainable transport progress can be achieved. New initiatives are coming from national governments in countries like India, Mexico, and Brazil, as well as from United Nations agencies to integrate sustainable transport as a core element of a sustainable development agenda.\n\nAs an increasingly urbanized world adds the next billion urban residents in a little more than a decade, it could not be more timely for this paradigm shift in transportation to unfold.\n\nAbout the Authors:\n\nColin K. Hughes is a Global Policy Analyst at the Institute for Transportation and Development Policy [ITDP]. Before joining ITDP full-time, Hughes worked as a consultant with ITDP and the Global Environmental Facility to develop greenhouse gas analysis methodologies, developed sustainable urbanism projects with the Asian Development Bank, and planned bike-lane networks and bike-sharing facilities in Guangzhou, China.\n\nMichael A. Replogle is the Global Policy Director and Founder of the Institute for Transportation and Development Policy, a nonprofit organization that since 1985 has worked with city governments and local advocacy groups worldwide to implement projects that reduce poverty, pollution, and oil dependence. He is a strategic advisor on transportation to the Environmental Defense Fund, where he served as transportation director from 1992 to 2009.\n\n*********************************\n\n\n\nMore from The Worldwatch Institute:\n\nMaking the Green Economy Go: Scaling Sustainable Energy For All\n\nDesperately Seeking: A Sustainable, Climate-Friendly Food System\n\nManagement Education: Planting The Seeds Of Sustainable Education"}, {"url": "https://books.google.com/books/about/Sustainable_transportation_strategies_fo.html?id=ibO2AAAAIAAJ", "page_content": "Shop for Books on Google Play\n\nBrowse the world's largest eBookstore and start reading today on the web, tablet, phone, or ereader.\n\nGo to Google Play Now »"}, {"url": "https://www.iisd.org/articles/deep-dive/road-sustainable-transport", "page_content": "Transport is at the center of many economic and social development challenges, accounting for about 64% of global oil consumption, 27% of all energy use, and 23% of the world’s energy-related carbon dioxide emissions. Rethinking and revamping transit in the post-COVID era by implementing structural changes would go a long way toward reinforcing some of the positive impacts on emission levels and air quality created by efforts to curb the pandemic.\n\nDeveloping a sustainable transport network to serve a city of 10 million people and a greater metropolitan area of more than 30 million might seem insurmountable. But the city of Jakarta, Indonesia, has undertaken this daunting task. In October 2020, it became the first Southeast Asian city to win the Sustainable Transport Award for its integrated public transportation system. Transjakarta, the city’s bus rapid transit (BRT) system, reached a milestone of serving one million passengers per day in February 2020 (ITDP, 2020). Opened in 2004, Transjakarta is the longest BRT system in the world, spanning more than 250 km (155 miles), with dedicated bus lanes that carry passengers around the city (ICCT, 2020). It also connects to smaller vehicles, including local buses and informal microbuses, allowing the system to serve a larger region and more residential areas that are inaccessible by BRT alone.\n\nBRT systems provide metro-level services through dedicated lanes, with busways and stations typically aligned to the center of the road, off-board fare collection, and fast and frequent operations (ITDP, 2020). They are more reliable, convenient, and faster than regular bus services, and avoid traffic congestion and long lines to pay fares. But sustainable transport encompasses much more.\n\nTransport is a crucial driver of economic and social development. Transport infrastructure connects people to jobs, education, health care, and each other. Transport enables global trade. Rural roads, for example, can help prevent maternal deaths through timely access to medical care, boost girls’ enrollment in school, and increase and diversify farmers’ income by connecting them to markets (World Bank, 2019).\n\nAt the same time, transportation produces emissions that contribute to air pollution and climate change. Its infrastructure has serious impacts on ecosystems. Transport accounts for about 64% of global oil consumption, 27% of all energy use, and 23% of the world’s energy-related carbon dioxide (CO2) emissions. Each year, almost 185,000 deaths can be directly attributed to vehicular pollution. More than 1.25 million people are killed and up to 50 million are injured on the world’s roads every year (World Bank, 2019).\n\nTransport is at the center of many economic and social development challenges, but, as the Jakarta example illustrates, it can be more sustainable.\n\nThe UN Secretary-General’s High-Level Advisory Group on Sustainable Transport defines sustainable transport as “the provision of services and infrastructure for the mobility of people and goods—advancing economic and social development to benefit today’s and future generations—in a manner that is safe, affordable, accessible, efficient, and resilient, while minimizing carbon and other emissions and environmental impacts” (HLAG-ST, 2016, p.10). Sustainable transport includes public transportation, such as electric buses and trains and BRT systems that can carry people far more efficiently than cars. Notably, while electric cars pollute less and reduce individual carbon footprints, they do not reduce congestion. They still “require roads and parking spaces, are susceptible to crashes, and contribute to a dispersed and unhealthy landscape” (Blue, 2013). Other modes, such as cycling and walking, have the additional advantage of improving well-being through physical activity."}, {"url": "https://sustainabledevelopment.un.org/topics/sustainabletransport", "page_content": "The role of transport in sustainable development was first recognized at the 1992 United Nation’s Earth Summit and reinforced in its outcome document – Agenda 21. In undertaking the five-year review of the implementation of Agenda 21 during its nineteenth Special Session in 1997, the UN General Assembly further noted that, over the next twenty years, transportation would be expected to be the major driving force behind a growing world demand for energy (Indeed, it is now the largest end-use of energy in developed countries and the fastest growing one in most developing countries). Further, at the 2002 World Summit on Sustainable Development, the role of transport was once again captured in the outcome document - the Johannesburg Plan of Implementation (JPOI). JPOI provided multiple anchor points for sustainable transport, in the context of infrastructure, public transport systems, goods delivery networks, affordability, efficiency and convenience of transportation, as well as improving urban air quality and health, and reduce greenhouse gas emissions.\n\nThe global attention to transport has continued in recent years. World leaders recognized unanimously at the 2012 United Nations Conference on Sustainable Development (Rio +20) that transportation and mobility are central to sustainable development. Sustainable transportation can enhance economic growth and improve accessibility. Sustainable transport achieves better integration of the economy while respecting the environment. improving social equity, health, resilience of cities, urban-rural linkages and productivity of rural areas\n\nSubsequently, the UN Secretary-General, as part of his Five-Year Action Agenda, identified transport as a major component of sustainable development. To this end, the Secretary General established and launched in August 2014 a High Level Advisory Group on Sustainable Transport (HLAG-ST), representing all modes of transport including road, rail, aviation, marine, ferry, and urban public transport providers. The policy recommendations of the Advisory Group were submitted to the Secretary-General in a global sustainable transport outlook report, entitled \"Mobilizing Sustainable Transport for Development\", released at the first Global Sustainable Transport Conference in November 2016.\n\nThe importance of sustainable transport for countries in special situations is also recognized by the international community, through the Istanbul Programme of Action for the LDCs, the Vienna Programme of Action for the LLDCs, the SAMOA Pathway for SIDS, the Sendai Framework for Disaster Risk Reduction, and the New Urban Agenda.\n\nIn the 2030 Agenda for Sustainable Development, sustainable transport is mainstreamed across several SDGs and targets, especially those related to food security, health, energy, economic growth, infrastructure, and cities and human settlements. The importance of transport for climate action is further recognized under the UNFCCC - the transport sector will be playing a particularly important role in the achievement of the Paris Agreement, given the fact close to a quarter of energy-related global greenhouse gas emissions come from transport and that these emissions are projected to grow substantially in the years to come."}, {"url": "https://www.mdpi.com/journal/sustainability/sections/Sustainable_Transportation", "page_content": "A section of Sustainability (ISSN 2071-1050).\n\nSustainable transportation studies new methodologies, techniques, and developments that identify, evaluate, and/or solve social, economic, environmental, and climate issues.\n\nFrom a social and economic point of view, accessibility, equity, social justice, and externalities produced by congestion and accidents are key issues. From an environmental and climate point of view, reduction of pollution, energy consumption, and global warming are very important problems that need to be addressed.\n\nSustainable mobility research is very dynamic and in recent times has been supported by new technologies in order to achieve even greater results and impacts. Thus, it is very important to study the impacts of current mobility and future mobility, both from the point of view of new modes of transport, as well as emerging tools and policies that are being developed. In this line, it is important to study the impacts of autonomous and connected mobility, as well as support systems that allow us to improve the efficiency and sustainability of our trips.\n\nOther important issues to study are the impacts of sustainable policies, the promotion of active mobility, the use of cleaner and more efficient transport modes, and the improvement in quality of public and other sustainable transport systems.\n\nThis section of the journal encourages the submission of articles related to:\n\n\n\n- Sustainable mobility planning, policies, and governance\n\n- Methodologies, practices, and policies for achieving behavioral change\n\n- Transport demand management\n\n- Equity, social justice, and gender equality\n\n- Traffic safety\n\n- Global warming\n\n- Carbon-neutral fuel and green mobility\n\n- Electric vehicles\n\n- Renewable energies\n\n- Public transport and transit-oriented development\n\n- Sustainable Cities\n\n- Smart mobility, Smart Cities, and Smart Grids\n\n- New traffic management systems\n\n- Maas—Mobility as a service\n\n- Green logistic\n\n- Freight transport\n\nIn this sense, both research papers and review papers on these topics are welcome. In particular, “Sustainable Transportation” welcomes contributions by early-career researchers and propositions for Special Issues on a single, interesting theme in the field of sustainable transportation."}], "Michael Replogle has been credited with helping to shape the modern urban transport landscape.": [{"url": "https://www.itdp.org/2014/09/17/a-global-high-shift-to-public-transport-walking-and-cycling-new-roadmap-for-low-carbon-inclusive-urban-transportation/", "page_content": "A Global High Shift to Public Transport, Walking, and Cycling: New Roadmap for Low Carbon Inclusive Urban Transportation\n\nBy Michael Replogle, ITDP\n\nMore than $100 trillion in cumulative public and private spending, and 1,700 megatons of annual carbon dioxide (CO 2 )—a 40 percent reduction of urban passenger transport emissions—could be eliminated by 2050 if the world expands public transportation, walking and cycling in cities, according to a new study, A Global High Shift Scenario, by Lew Fulton and myself, published by the University of California, Davis, and the Institute for Transportation and Development Policy (ITDP). This would give a major boost to the public transport mobility of the poorest half of the world’s population, expanding access to opportunities for work, education, and health services.\n\nWe are releasing the report at the United Nations in New York on September 17th, in advance of the September 23rd United Nations Secretary-General’s Climate Summit, where many nations and corporations will announce voluntary commitments to reduce greenhouse gas emissions, including new efforts focused on sustainable transportation, including a pledge by the world’s public transportation operators to double the share of trips by public transportation by 2025.\n\nTransportation, driven by rapid growth in car use, has been the fastest growing source of CO 2 in the world. Many transportation system indicators have been moving in the wrong direction in the developing world, with increasing air pollution, road crash deaths, and congestion, time and money wasted in inefficient mobility.\n\nThe overly energy focused climate policy framework of the past quarter century has led much of the world until now to overlook highly affordable strategies to slow and reduce global warming pollution by giving people clean public transportation and safe walking and cycling opportunities. This new study begins to sketch a roadmap for a brighter future.\n\nTransportation in urban areas accounted for about 2,300 megatons of CO 2 in 2010, almost one quarter of carbon emissions from all parts of the transportation sector. Absent changes in investments and policy, rapid urbanization—especially in fast developing countries like China and India—will cause these emissions to nearly double by 2050.\n\nBut what if more countries were to adopt national transport financing programs and policies like those of Mexico or Colombia, which have helped dozens of their cities to begin developing high quality Bus Rapid Transit or rail systems? What if more cities were to adopt investment programs like China’s aimed at rapidly expanding public transport and public bike infrastructure? Or to learn from best practices in countries like France and Germany that have fostered high quality mass transit and promoted safe walking and cycling networks? What if projected growth in personal mobility in the developing world were accomodated with only half the forecast growth in light duty motor vehicle use?\n\nOur new study calculates CO 2 emissions in 2050 under two scenarios, a business-as-usual scenario and a “High Shift” scenario where governments significantly increase urban rail and clean bus transport, especially Bus Rapid Transit (BRT), and ensure safe walking and bicycling. By accommodating forecast growth in personal mobilty in developing countries through these modes, less needs to be spent on road construction, parking garages and other things that encourage car ownership and use. Under this High Shift, not only would CO 2 emissions plummet, but the net financial impact of this shift would be a one-fifth savings in cumulative construction, operating, vehicle and fuel-related costs over the next 35 years. The cost of building more sustainble transport infrastructure would rise sharply in percentage terms, but overall infrastructure costs would drop by roughly 40 percent overall.\n\nPersonal mobility grows with income worldwide, but is accommodated in a variety of ways. If the availability of rapid transit (and basic bus services) is low, more growth in mobility will be handled by people buying and using cars or motorized 2-wheelers. If public transport services are more widely available and of higher quality, with safe and attractive conditions for walking and cycling, fewer people will buy and use motor vehicles. Adapting the International Energy Agency (IEA) Mobility Model (MoMo), we estimated these effects across 33 countries and regions covering the world.\n\nThe biggest difference between business-as-usual and the High Shift scenario is the quantity and quality of public rapid transport services. We defined a Rapid Transit per Resident (RTR) indicator as the number of kilometers of metro, light rail, urban commuter rail, and Bus Rapid Transit lines per million urban residents. In the 34 generally affluent, developed, democratic market economies that make up the Organization for Economic Development and Cooperation (OECD), we calculated an RTR today of 60, compared to 9 in the remainder of the world. Under a business-as-usual baseline case, we forecast the RTR would remain flat out to 2050, while under a High Shift scenario, this would grow by 50 percent (to 90) in the OECD and triple (to 30) in the rest of the world.\n\nWhile our study has not focused on further actions to boost motor vehicle fuel economy, it takes into account existing policies that, in the IEA Baseline scenario, improve average new car fuel economy by 32 percent in the OECD countries and 23 percent in the rest of the world. The High Shift scenario increases this to 36 percent and 27 percent respectively, due to improved in-use driving conditions and a slight shift to smaller vehicles. However, the Global Fuel Economy Initiative calls for much more: a 50 percent reduction in fuel use per kilometre for light-duty vehicles worldwide by 2030. Achieving the GEFI 2030 goal could reduce 700 to 1,400 megatons of CO2 annually beyond the 1,700 reduction possible from a High Shift scenario. Taken together, achieving this fuel economy goal with better public transport, walking and cycling could cut annual urban passenger transport CO2 emissions in 2050 by 55 percent from what they might otherwise be in 2050 and 10 percent below 2010 levels.\n\nFor our study, we asked the International Council on Clean Transportation (ICCT) to use their Roadmap model to evaluate how these scenarios might affect air pollution emissions and related health impacts, with and without enhanced emission control strategies. They found future growth in vehicle activity could produce a four-fold increase in associated early deaths from traffic related air pollution by 2050, even with a global shift to mass transit. But 1.4 million early deaths could be avoided annually by 2050 if national leaders commit to a global policy roadmap that requires the strongest vehicle pollution controls and ultralow-sulfur fuels.Cleaner buses alone would account for 20 percent of these benefits.\n\nOur report is the first study to examine how major changes in transport investments worldwide would affect not only urban passenger transport emissions but also the mobility of different income groups. Today and out to 2050, lower income groups will have limited access to cars in most countries under almost any scenario. Under business-as-usual, everyone will suffer more congestion, but the poor will suffer more by being robbed of access due to declining bus speeds and shrinking space for safe walking and cycling. But under the High Shift scenario, mass transit access is projected to more than triple for the lowest income quintile (i.e., the lowest income 20 percent of the population) and more than double for the second lowest quintile. Notably, the overall mobility evens out between income groups, providing those more impoverished with better access to employment and services that can improve their family livelihoods.\n\nIn 2015, the United Nations will adopt new Sustainable Development Goals (SDGs) to guide global development initiatives over the next 15 years, as the Millenium Development Goals have done for the past 14 years. The UN will also adopt a new climate policy framework. While it is urgent that we make rapid progress to cut global warming emissions, this will happen only if climate policy is built on a foundation of inclusive social and economic development. The SDGs recommended to the UN General Assembly in recent weeks include good targets for sustainable transport that should be strengthened further in coming months.\n\nEffectively limiting global warming emissions will require effective policies to reduce transportation emissions. That will take a focus on both passenger and freight transportation, especially considering how transportation shapes the sustainability of cities. To support inclusive urban social and economic development, climate change policy and related development financing, capacity building, and technology transfer initiatives will need to ensure support for countries, cities, and the private sector to adopt, implement, and mainstream High Shift transport approaches, as well as improved fuel economy and vehicle emission controls."}, {"url": "https://www.mdpi.com/2073-445X/11/2/247", "page_content": "3.1. Historical Development of Pingyao City\n\nThe natural landscape of the PAC has in the past been described as “the mountains southeast fall on top of each other and are extremely steep, the gully uneven, the rock one color” [ 40 ]. Such a poetic description reflects the ancients’ attention to the natural environment outside the city and the importance of the integrity of the cultural landscape. Additionally, the Huiji River and Liugen River, which is called the Zhongdu River in the ancient time, are located in the east and south of Pingyao and also have a coordinated spatial relationship with the PAC. The orientation and shape of the PAC largely conforms to the distribution trend of the river. The spatial pattern of the PAC is based on its relationship with the river, as described in the “record on the regulation of Zhongdu River” which was written by Lei Jie, a Chinese scholar in the Qing Dynasty: “the river (Zhongdu River), from the south of the city, goes around the city and eventually into the Fen River. The east, west and north sides of the city are linear and independent, but the south side is different from the other three sides. The city is like a turtle, close to the river” [ 41 ]. He described the relationship between the city and the river as the “turtle” before the river and the river runs to the sun. The “turtle” serves as a metaphor for the city, and the landscape outside the city is likened to a recreational place for the turtle. This anthropomorphic description of the city and the surrounding natural landscape reflects the cultural attributes of the urban space, and the natural environment as the medium for constructing this cultural emotional relationship ( Figure 4 a).\n\nFigure 4 b shows a closely interconnected pattern of the urban space inside the PAC. Taking South Street as the axis, a symmetrical urban layout is shown: the Town God’s temple is on the left, and Government office of Pingyao County is on the right; the Confucian temple on the left, and the Duke Guan temple on the right; the Qingxu Taoist temple in the east, and the Jifu temple in the west. The city as a whole is laid out in the shape of “干”, showing a strong sense of axis order [ 42 ]. The main north–south axis of the city presented a clear spatial relationship with the natural landscape outside the city in the south direction. Such a pattern strengthens the connection between the city and the southeast mountains. The building “Jinjing Tower “, located at the key point of the South Street is the landmark for establishing this connection. As written in “record of Rebuilding the Jinjing Tower” by Zhao Qiande during the Qing Dynasty [ 43 ].\n\n“Looking south from the city building, leaning against the railing, looking out at the southeast mountains, the clear river in the northwest, looking up at the changes of smoke and clouds, facing the prosperity of the city, understanding the surplus of the heavens, and observing the people’s praise, are there any people who are silent and sigh quietly? Not specifically. When you hear the flute of the mountain pasture, you will think about how the cattle and sheep can be healthy, and when you see the fishing boat in the Yuanpu, you will think about how the raging billows? Looking down at the lights and the bazaars, thinking about how to nurture and protect the people, I always cherish the General Ji Fu’s heroic martial arts, and dream about the ideology of the thinker Bu Shang. Looking around, the song is in your ears, and you are deeply touched by his teachings. Sincere love to people, burst and flourishing, artistic conception of the world and distant, this is indeed the great fortune of this building”.\n\nThis description is a high-level summary of the spatial correlation between the ancient city of Pingyao and the surrounding environment. It reflects the cultural and emotional connection of various spatial elements, e.g., natural elements, urban space, historical figures, and people’s livelihoods, which are displayed through the cultural landscape and spatial structure. This urban planning idea, which connects the physical space to a spiritual place, reflects an ancient Chinese planning and design wisdom that is rather different from modern urban planning. By enhancing the relevance of spatial elements, the spatial structure and cultural landscape, represented from the regional scale to the urban scale, even to the local scale within the city, are the essence of the historical urban landscape of Pingyao. From the ancient literature, we can see that the historical urban landscape of China’s historic cities is not the stacking and piecing together of a group of historical heritages, but the inheritance and continuation of traditional urban spaces from aspects of the natural environment, urban patterns, and human emotion."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-59047-9_12", "page_content": "The following essay focuses on the study of several specific events that led to a paradigm shift, and which even today continue to dominate the debate on urban renewal and regeneration. It sheds a contemporary light on the classic debate in favour of and against ‘urban reform’ which has existed for more than one and a half centuries. Integrated urban regeneration is now the emerging paradigm.\n\nThe initial chapters of this section show how urban renewal strategies in the years following the Second World War continued previous experiences of international urban planning culture. Theoretical and methodical reflections on urban renewal and regeneration can be better in light of the debate that has been going on for over a century half in favour and half against ‘urban reform’ . It has given rise to two strategies that antagonise supporters of ‘modernising’ and renovating central areas against those who wish to preserve them at all costs. In this discussion, certain episodes stand out as paradigmatic examples that defend opposing forms of urban renovation and regeneration: the Parisian district of Marais or London’s Covent Garden , as the antithesis of the historical centre of Bologna . These attitudes have continued to lead the debate when, after the 1970s, the resolve to act on historical centres extended towards the residential peripheral areas that were becoming abandoned and obsolete.\n\nHaussmann’s Paris , a widely disseminated model which many European and American cities have adopted since the end of the nineteenth century, becomes once again a model for complex urban development strategies. In the 1960s, dilemmas similar to Haussmann’s Paris reappeared, although the intervention strategies were now more sophisticated. Hence, two simultaneous battles were ongoing focused on two sectors in the centre of Paris. On the one hand, there was the ‘Battle of Les Halles’ with opposing viewpoints on the necessary modernisation of the central market and its environment. In parallel, there was a commitment to preserving the historical centre of the Marais (Kain 1981). The first battle ended with demolition of the market; the second, with the subsequent ‘gentrification’ of the district. As Anthony Sutcliffe points out, the results are contradictory: “Conservation and restoration could even become the most effective, cheapest and fastest way to rebuild the city centre. We could therefore say that in the centre of Paris, conservation won”. The author refers to the ‘decline of Paris city centre’ and the ‘defeat’ of modern urban planning . Instead, ‘ossification’ of the centre and the paradoxical forms of carrying out ‘reconstruction’ have triumphed: on the one hand, conserving the Marais and on the other with the more limited action at Les Halles , where it was decided to demolish the market although with the intention of renewing the district (Sutcliffe 1970).\n\nIn London , despite being a different historical and urban context, there was an important parallel episode in the debate about urban renewal and regeneration: the ‘Battle of Covent Garden’. London market underwent a process of obsolescence parallel to that of Les Halles in Paris. At the end of the sixties and early seventies, modernisation and urban renewal strategies similar to those in Paris were proposed, ultimately resolved with a proposal to move it to a more suitable site. The proposal consisted of carrying out work on a large area, affecting the residents and central activities. The opponents in the battle in this case were the residents and small shop owners, in parallel to conservationists who wanted to keep the market as it was. As in the case of Paris, there was a significant discontinuity in the discourses and strategies for the historical centres compared to the pre-war attitudes. After the sixties, there was a notable effort by preservationists against radical intervention through urban renewal. Nevertheless, we saw implementation of new versions of urban renewal that brought displacement of the local population and existing activities with them. In the end, the results were not so different from an urban planning perspective, although in the case of Paris the historical market of Les Halles disappeared, whereas in London , Convent Garden was renovated. But at both sites the local population was displaced, with the subsequent theme classification and general gentrification of the districts (Figs. 12.1 and 12.2).Footnote 1 Fig. 12.1 Paris, the ‘Battle of Les Halles’ : demolition of the market, 1972 Full size image Fig. 12.2 Paris, the ‘Battle of Les Halles’ : Urban void after demolition, 1973 Full size image\n\nAfter the decade of the eighties, with the advancement of the neoliberal outlooks of Thatcher’s ‘conservative revolution’ (1979–1997), a strong boost was given to private investment in the most depressed areas of British cities, implementing a process of deregulation based on stimulating competitiveness. The most notable episode during this period was the renovation of the London Docklands area. We must bear in mind that since the end of the nineteenth century, the high and middle classes had abandoned London’s East End, and therefore this area had become one that was exclusively inhabited by the working classes. With the industrial crisis and the relocation of port activities between 1961 and 1967, over 83,000 jobs were lost. Hence the creation of the London Docklands Development Corporation in 1981 was the catalyst for renewal of a large area covering 200 ha. The new City that was built on Canary Wharf led to the creation of 40,000 jobs, although not precisely for the local population. Such radical social changes also took place in other parts of London, particularly in central areas after residents were forced to leave as a result of the increase in housing prices (Brownill and O’Hara 2015) (Figs. 12.3, 12.4 and 12.5). Fig. 12.3 London, the ‘Convent Garden Battle’: image before renovation, photograph by Penny Saunders Full size image Fig. 12.4 London, the ‘Convent Garden Battle’: proposal for demolition and regeneration of the Covent Garden area Full size image Fig. 12.5 London, the ‘Convent Garden Battle’: demonstration against the Covent Garden demolition projects, ca. 1980 Full size image\n\nCertain similarities between the urban renewal in North American cities in the sixties can be seen. However, there were more radical processes and greater exodus of the population that led to the decentralisation of activities. In contrast, it is interesting to look at the experiences of other cities, such as Baltimore , where from the sixties to the eighties, substantial urban renewal took place parallel to a rapid process of de-industrialisation. Authors such as David Harvey or Stephen Ward believe that the transformations carried out over these decades can be described as “urban planning models” , but also as “an example of the most unfair urban degradation where brilliant mirages co-exist with mass misery not far removed from the renovated Inner Harbour” (Harvey 2000; Ward 2006) [see Chap. 13].\n\nWith all the variants stemming from the different cities and historical contexts from the sixties onwards, some significant progress can be seen in the regeneration of urban centres. The discourse and understanding of historical centres as exceptional sites to be conserved, not only physically, but also in terms of their complex sociocultural identity , had already been the recognised, particularly in Italian cities during the sixties. It is unavoidable not to refer to the Conservation Plan of the Historical Centre of Bologna (1969–1971) and the renovation and subsidised housing development plans that took place in the seventies in that historical centre (Cervellati and Scannavini 1973). The plan maintained the structural components of the urban fabric, but also renovated the housing in the centre, reversing the exodus of the population. Other plans were subsequently elaborated with truly ambitious objectives for that time, conserving the same uses, resident population and building typology. The historical centre then became a representative site, a social area, giving priority to the residents. The Bologna experience became a benchmark for the so-called comprehensive urban renewal (Figs. 12.6, 12.7 and 12.8). Fig. 12.6 London, renewal of the Docklands , 1982 plan Full size image Fig. 12.7 London, renewal of Barking Central , 2007–2010 Full size image Fig. 12.8 Bologna , historical centre recovery plan of 1973. Intervention typologies and project Full size image\n\nThe influence of the Bologna Plan was unquestionable in the development of strategies in other historical centres. In Spain, too, in Barcelona , Vitoria and many other cities this subject was engaged from the end of the seventies, although the process was delayed until the end of Franco´s dictatorship and gained intensity during the nineties. During those years, many cities started to work on their historical centres, carrying out urban remodelling operations, with the renovation of existing buildings. From the eighties onwards, other forms of integrated action in historical centres took place, such as the work carried out in Santiago de Compostela , much celebrated both in Spanish and international urban planning culture. In the last two decades, renovation has progressed towards integrated urban renewal where the scope of intervention is no longer limited to historical centres, but also includes other decayed urban areas, such as the first suburbs from over 80–100 years old, or even the growth of housing estates that were built during the industrial development of Spain (Castrillo Romón 2013) (Figs. 12.9 and 12.10). Fig. 12.9 Barcelona, Raval plan, looking over the port in 2000 Full size image Fig. 12.10 Barcelona, Special Interior Reform Plan (PERI) of 1985 Full size image\n\nPerforming these processes whilst including the physical, social and economic content has become the paradigm of integrated urban regeneration . Since the eighties, local economic development strategies have been a part of comprehensive policy, such as the Enterprise Zones in the USA or Great Britain, or the Zones Franches Urbaines (ZFU) in France (Aparicio and Di Nanni 2011). Less known are the programmes that were implemented after 1997 in the United Kingdom, under the labour government of Tony Blair, which involved reorganisation of the public machinery and the decision to assign important resources from the ordinary budgets to renewal programmes. Identifying priority zones for intervention through the use of the Index of Multiple Deprivation (IMD) has also been a major step forward for urban renewal policies, which permits identifying the most deprived or vulnerable areas. These are studies that favour another type of work, such as Barking Central Regeneration East London or Coin Street on the South Bank , worthy of mention, although they are not so relevant within the context of London explosive growth of recent years (Velázquez Valoria and Verdaguer Viana-Cárdenas 2011).\n\nIn addition to considering those exemplary episodes, it is also worth mentioning several international cases of urban renewal that have taken place in recent decades, mostly in European cities. The work carried out in Hafen City in Hamburg is an example of large scale urban regeneration and one of the most ambitious projects executed in Europe. It entailed work on obsolete port land, covering a total of 150 ha. From the early nineties, Hamburg underwent a process that is common to other river and sea ports, although without the complete disappearance of port activity in those central areas, such as was the case of London or Rotterdam . The docks were moved towards the west liberating central space that was reconverted for mixed use.\n\nIt is true that the ambiguity in defining this generic concept entails certain risks of banalising the term and using it as a theoretical support for very different actions that can even be contradictory to each other (Moya González and Díez de Pablo 2012). As with other ‘wild card’ concepts such as sustainability, compact city, etc., their indiscriminate use and even abuse as political propaganda, entails the risk of disguising simple substitution operations and radical renovation in certain urban areas. In any case, since the 1990s, this concept has been adopted in different disciplinary fields, leading to a number of studies and treaties that have been developed with notable systematisation in the international urban development culture."}, {"url": "https://link.springer.com/article/10.1007/s11186-022-09485-1", "page_content": "The primary sources for this project consist of two sets of publications by Singaporean public housing authorities distributed to public housing residents over fifty years (1972—2021) and comprising 693 issues (see Appendix A). Aside from being convenient bulletins for housing related news, these publications have also served as a platform for various socialization and community-building efforts. Importantly, public housing residents were not merely an incidental captive audience but addressed as public housing residents whose role in the state’s envisioned social order was constituted through their experience in public housing spaces.\n\nThe first series is a magazine entitled “Our Home”, published by the Housing and Development Board from 1972 to 1989 and distributed free of charge to public housing residents throughout Singapore while available to others for 50 cents per issue at newsstands. 101 out of 105 issues in the series were included for analysis. “Our Home” officially served “as an additional medium of communication to keep Board residents informed of the Board’s developments and new policies”Footnote 1; but also sought to engage readers with a wide variety of lifestyle and human interest stories.\n\nWhen the HDB relinquished the municipal management of public housing estates to the newly formed Town Councils in the late 1980s, each Town Council began producing and distributing its own newsletter to residentsFootnote 2 as part of broader efforts to promote local identityFootnote 3. My sample of Town Council newsletters ranges from 1987, when the first Town Council newsletters were printed, to 2021. Of the 592 Town Council newsletter issues included, 549 are by Town Councils run by the PAP and 43 by the opposition (see Appendix A for sources). There are generally sixteen to seventeen Town Councils in operation at any point in time. However, Town Councils are prone to various rounds of dissolution and reconstitution according to the electoral boundaries set before each General Election, which means that newsletter titles themselves have come and gone over the years. Furthermore, the archival records of older Town Council newsletters tend to be incomplete, although every Town Council now has its own website with PDF copies of recent issues. In light of these challenges, I started by reading through all publicly available issues. I then selected twenty-four unique newsletter titles of Town Councils from different geographical regions, as well as those run by the political opposition. In order to shed light on the context of their production, I consulted archival data such as newspapers and HDB annual reports and conducted interviews with the public relations managers of seven different Town CouncilsFootnote 4 between May and August of 2017.\n\nI did not use any qualitative coding software, but instead conducted many rounds of systematic read-throughs of the data, keeping tables, notes, and memos about concepts and patterns as they emerged across the various titles and over time. The analysis was guided by the following core questions: Who were the target audience and how were they conceptualized? How were elected officials represented? What kinds of lifestyles were portrayed? What implicit norms and values were communicated to readers? To answer these questions, I was attentive to the type of publication content such as editorials, articles, letters to the editor, reader-contributed essays, recipes, advertisements, photographs, and illustrations. Because of the heavily visual nature of these publications, visual analysis played a crucial role in examining the data. Inspired by the work of visual and communications scholars on the political significance of “framing” in visual images (Greenwood & Jenkins, 2015; Rodriguez & Dimitrova, 2011; Schill, 2012; Schwalbe et al., 2008), I was attentive to picture composition, particularly the physical settings represented in photographs. This emerged as a cornerstone of the main findings, presented below.\n\nPublic housing and development in post-independence Singapore\n\nSingapore’s public housing program is widely acknowledged as a resounding success, and is one of the most visible icons of the power of the ruling People’s Action Party (PAP). When the PAP won Singapore’s first election as a partially independent country in 1959, it faced the immense challenge of providing jobs and housing for a population of 1.45 million; of which a staggering 78.6% lived in overcrowded slums, villages, and tenements in the city area (Dale, 1999, p. 22). One of the PAP’s earliest rallying slogans was to “break the backbone of the housing shortage” (Liu, 2016, p. 18) through a nationwide program to build high rise public housing around the country, mostly to relocate the masses crowded within the city area. The PAP fulfilled its promise in less than three decades. By 1984, over 80% of all Singaporeans lived in an apartment built by the Housing and Development BoardFootnote 5—a figure that has held roughly constant to this dayFootnote 6. In contrast to many stigmatized and ghettoized public housing projects around the world, public housing in Singapore is “synonymous with middle-class housing rather than housing for the poor” (Yuen, 1995, p. 250), featuring heavily in narratives of Singapore as an “Asian economic miracle” (Castells et al., 1990; Soon & Tan, 1997; Yong, 1999). The mission of housing an entire nation has inevitably made public housing an important driver of urban change and development. Unsurprisingly, the success of public housing has been key to the ruling PAP’s legitimacy, and played a large role in its electoral dominance since 1959 (B. H. Chua, 1997; Chua 1995).\n\nDespite having swept to power on a platform that promised better housing, the PAP encountered tremendous resistance from residents who did not want to be removed. Some resisted through acts of open hostility against resettlement officers (Loh, 2009b), while others appealed to the Rural Dwellers’ Association or the PAP’s left-wing political rivals, the Barisan Socialis (Gamer, 1972, p. 67) for help. There was much at stake for those who were to be relocated. Resettled villagers lost their community ties, agrarian livelihoods, and the autonomy they enjoyed as independent farmers (B. H. Chua, 1997). Officials were cognizant of the disruption of existing social networks (Yeh & Tan, 1975; Yeung & Yeh, 1975), and even tacitly acknowledged the epidemic of suicide and mental illness among those who were unable to adjust to high-rise livingFootnote 7. Decades later, many elderly public housing residents would speak of “bo bian (no choice)” and “tong kor (painful bitterness)” at being forced to leave their homes, revealing the deep resentment and bitterness that underlay the resettlement project (Loh, 2009a, p. 12).\n\nIn the initial decades of development, therefore, the state desperately needed to build legitimacy for its public housing project as a whole. This would be accomplished not only by convincing new and prospective residents of the merits of public housing, but ultimately turning villagers and slum dwellers into urban citizens who envisioned themselves as natural inhabitants of this new spatial order. The New Town and the high-rise apartment emerged as key sites for the constitution of the new urban subject because they represented the most dramatic disjunctions between urban and village life while embodying complementary aspects of state power. While the New Town displayed the state’s capacity for large-scale, technocratic construction, the apartment conveyed the state’s ability to deliver a modern lifestyle right to residents’ doorsteps. The Housing and Development Board’s “Our Home” magazine played an important role in orienting readers’ attention to these two spatial scales to help imagine their lives unfolding within the densely populated and amenities-rich New Town on one hand, and the compact apartment on the other. This is not only reflected in the proportion of content dedicated to New Town- and apartment-level concerns, but also the effort the magazine expended in evoking an emotional response to the respective spaces within public housing.\n\nTable 1 Historical phases of spatial-political subject formation through public housing in Singapore Full size table\n\n“Our Home” magazine and audience\n\nThe 1972 HDB annual report announced “Our Home” as “a quarterly magazine distributed free to every family in HDB estates, primarily published to gain closer rapport with the 800,000 people who are presently living in the Board’s estates” (p.20). The circulation of the magazine continued to grow in tandem with the construction of new public housing apartments, from 200,000 copies in 1974 to 440,000 copies by the end of the magazine’s run in 1989 (see Table 2). The glossy, colorful 36-page magazine was not a perfunctory bulletin for public housing related news, but a sumptuous and expensive public relations effort: in 1975, a full-page advertisement in color cost $4,500, while the HDB subsidized each issue by around $30,000Footnote 8. Apart from news on recent public housing developments, “Our Home” appealed to a wide audience by publishing a plethora of human interest and lifestyle features on food, nutrition, health, interior design, fashion, and even travel, making it more similar to a popular magazine than an official housing publication. “Our Home” was primarily written in English, with occasional translations for policy-related features to one of Singapore’s three other official languages of Chinese, Malay, or Tamil. There were few original articles written in a non-English language, which reflected the state’s promotion of English as the language of commerce and industry.\n\nReader contributions formed a significant proportion of the magazine, which reflected the importance of “Our Home” as a platform for gathering feedback about the nascent institution of public housing. As the editors implored, “[t]ell us about your feelings…They don’t have to be profound, just entertaining or even humorous. Do you know of any interesting personalities in your estate whom we can feature? The list is endless—decor, cookery, ideas, anything that interests!”Footnote 9. Readers obliged with a variety of thoughtful and eclectic contributions. Many complained about inconsiderate neighbors, but there were also jokes, musings about life, and even suggestions for magazine content. We do not know the number of contributions received by the magazine, while those that were actually published were certainly not representative of the thoughts of the general population. Nonetheless, the frequency and range of reader contributions demonstrates that “Our Home” had a significant base of engaged readers, who provided enough material for the editors to construct an “imagined community” of public housing residents.\n\nTable 2 “Our Home” circulation, based on available data. Sources: HDB Annual Reports and “Our Home” cover pages Full size table\n\nThe New Town and the modern urban resident\n\nThe unfolding urban landscape of towering apartment blocks served as a powerful visual representation of the PAP’s political and technological capabilities (Goh, 2001; Kong & Yeoh, 2003; Ooi, 1994; Teo et al., 2004; Yuen, 1995). If the cover pages of “Our Home” were any indication of the magazine’s priorities, the HDB sought to emphasise the scale and modernity of the high-rise apartment block as the symbol of a new urban order. 60% of “Our Home” covers featured at least one apartment block on the cover. Only 8% of “Our Home” covers featured an apartment interior, while 32% depicted other locations such as playgrounds, gardens, and swimming complexes with no discernable public housing blocks in the background, plain or indeterminate backgrounds, as well as abstract artwork. The cover of the inaugural issue was one of the magazine’s most spectacular, featuring an aerial nocturnal photograph of two precincts of towering slab blocks bisected by a highway (see Fig. 1). The photograph was shot with a time-lapse technique to showcase the night-time traffic coursing through the heart of a public housing estate, epitomizing the business of modern urban life. Subsequent covers were not often as spectacular but still attempted to showcase the monumentality of public housing: a typical cover featured a single apartment block, shot in the day against a clear sky. Such images were meant to inspire awe, as seen from this evocative caption from an article featuring aerial photography:\n\n…more than just massive blocks of high-rise flats, Woodlands (above) commands a panoramic view of the Johore Straits whilst Toa Payoh (right) overlooks the majestic sweep of the flyover at Braddell Road set in landscaped grounds.”Footnote 10\n\nAs much as the state tried to impress readers and residents, however, it was important that the monumentality of public housing was not experienced by residents as an external force but internalized as part of a rational, urban order that could be easily navigated. “Our Home” accomplished this by combining technocratic explanations of planning principles with evocative scenarios of how the resident might enjoy the new amenities. Nearly every issue would feature the latest New Town construction plan, or a major renovation project at the neighborhood or precinct level. The articles would include information about the size of the development, location, date of completion, and amenities, and be accompanied by color-coded town-maps and diagrams along with photographs taken from a distance to emphasize the scale of the development. Majestic aerial photographs of New Towns under construction were not uncommon.\n\nIn the long run, the magazine’s goal was not merely to list the features of each new development but to educate readers on the underlying planning principles of their public housing estates. This enabled residents to grasp the rational planning principles that structured their everyday lives, while envisioning themselves participating in a rich program of activities unfolding with the New Town. “Our Home’s” trademark combination of pedagogy and promotion is seen in this excerpt which not only describes a New Town under construction, but also directly interpellates the reader as a savvy resident with the luxury of choice and the discernment to exercise it:\n\n“Our new housing estates, made up of neighborhoods of 2,000 to 5,000 housing units each, are built according to the “Neighborhood Principle”. This means that the resident and his family are able to conduct most of their everyday activities within walking distance of their home. Take a look around you. You’ll find that there’s a market close by so that you need only to walk a short distance to do your daily marketing for fresh food. And, if you don’t feel like cooking, the cooked food stalls are only a stone’s throw away. In fact, you’ll find shops catering to almost all of your basic needs near your flat. We have planned for at least one shop for every 60 units of flats. In fact every neighborhood has at least one market; with a few neighborhoods sharing one community center and one health clinic. Schools too are built close to the flats, so that your school-going child need only walk to school.”Footnote 11\n\nThe cumulative effect of New Town-level coverage was to create common visual and intellectual schemas for appraising public housing developments across the country, while contextualizing each new development within a larger narrative of national urban development through mass housing. Meanwhile, residents were interpellated as subjects who could easily navigate the New Town with an informed appreciation for its modern, logically organized amenities.\n\nThe apartment: Interior design, home economics and the house-proud resident\n\nAs the very title of “Our Home” suggested, the apartment was the building block of the entire New Town. Likewise, the subject’s appreciation for abstract planning principles was anchored in the home and reproduced through the modern scientific principles of domestic management. While the cover pages of “Our Home” had a clear tendency to foreground the monumentality of the apartment block, if not the entire skyline, much of the magazine’s content actually addressed the home, which contributed to the construction of a house-proud subject dedicated to the continual maintenance, optimization, and improvement of the apartment. Modernity and class were inextricably intertwined, as “Our Home” presented a distinctly middle-class image of the public housing resident and apartment. By encouraging middle-class aspirations, the HDB sought to cultivate subjects’ pride in their apartments and status as public housing residents. This committed the subject to a cycle of mass consumption and wage work in order to afford a modern, middle-class lifestyle, which in turn reproduced the state’s developmentalist ideology of home ownership within the modern New Town.\n\nAs Jacobs and Cairns note in their study of the same magazine series, “[t]he HDB’s vision of the benefit of its high-rise housing program was, from the outset, complexly entangled with cultivating individual investments in the home by way of interior design and decoration practices” (2008, p. 572). Nearly every single issue of “Our Home” featured one attractively decorated apartment in a two- to three-page article, which included a detailed write-up about the owners’ decorating process along with sumptuous photographs of the apartment interiors. Through these features, “Our Home” sought to demonstrate that public housing was not only superior to village life, but even comparable to exclusive private housing. With the right amount of effort and careful planning, a “four-room flat can be made to look as good as any condominium flat”Footnote 12. For example, one owner reproduced the “atmosphere of a house in a small town in Europe, with warm woods, porcelains, and floral fabrics as an expression the owners’ love of European culture”; while another chose a modern-oriental theme for his own HDB apartment, comprising carved blackwood furniture, a European pendulum clock, Chinese paintings and calligraphy to complement his centerpiece, and a “black Malaccan dresser…inherited from his grandfather”Footnote 13. Those on a more modest budget could still engage in Do-It-Yourself decorating projects, and embark on a “labor of love”Footnote 14 in the process of designing, sewing, and sometimes even building these decorations from scratch. The necessity of constant consideration, planning, and effort in realizing one’s dream home in turn reproduced the “bourgeois urban subject” (Jacobs & Cairns, 2008, p. 575) that the HDB sought to cultivate.\n\nIt was, however, in the everyday practice of domestic management that “Our Home” delved most intimately into the construction of the house-proud subject. “Our Home” published many articles on child care, public health, nutrition, sanitation, and household budgeting. These topics broadly corresponded to the discipline of home economics, which gained special prominence around the world around the middle of the twentieth century (Stage & Vincenti, 1997). Home economics promotes the rationalization and professionalization of household management, which “clearly position(s) the home in relation to a larger polity” (Stage & Vincenti, 1997, p. 5) by mirroring the principles of scientific management that prevail in formal employment, and establishing the home as the basis for the reproduction of daily life necessary for participating in the modern industrial economy. For the HDB’s flagship magazine, the value of home economics was clear: by providing instructional and entertaining content, the magazine could cultivate modern domestic subjects who would reproduce the developmental goals of public health and consumption through efforts that were anchored in the space of the home.\n\nThe magazine’s home economics content was inevitably gendered, as it built upon and reinforced women’s existing roles as gatekeepers of the household. Unlike major renovation and decorating features which addressed both men and women, home making and childcare content was almost exclusively addressed to women. Mothers, in particular, were addressed as the gatekeepers of their children’s health, which embedded the home within formal public health systems. The magazine featured a regular doctor’s column (sometimes titled “Doctor’s Day”) that discussed common ailments, with special emphasis on women’s and children’s health. Mothers were instructed on the dangers of home remedies, the importance of immunisation Footnote 15, how to monitor their children’s health and nutrition, and how to “[c]all for a doctor or take the child to a hospital” during emergencies Footnote 16. By invoking women as the gatekeepers of the new, high-rise household, “Our Home” therefore attempted to reproduce a modern, medically governable subject whose compliance with the public health and developmental goals of the day began with sensible practices at home.\n\nFood and nutrition was another central topic through which “Our Home” engaged the domestically-oriented, female subject. “Our Home” frequently published reader-contributed recipes, along with more detailed articles on the science of diet and nutrition. An early article, for instance, explained the importance of fruits and vegetables as a source of “body protecting (vitamins and minerals)” and meat for “body building (proteins)”Footnote 17, and taught readers how to prepare each ingredient for maximum nutritional retention. The home economics of food preparation also necessitated a thorough understanding of hygiene and modern sanitation, which was one of the key features of the HDB’s public housing project. Significantly, the sanitary practices promoted by “Our Home” required modern plumbing and appliances such as running water, a kitchen sink, a refrigerator, and even a freezerFootnote 18. Electric appliances also featured heavily in the advertisements of “Our Home”. Many of the advertisements, which easily exceeded a third of the magazine’s pages, were for household services and consumer items such as refrigerators, washing machines, and processed foods. The prominence of household products and appliances within “Our Home”, attractively marketed and sometimes quite expensive, promoted middle-class, upwardly mobile aspirations among public housing residents, reinforcing Cohen’s (2008) observation about the importance of consumption as a site for the constitution of citizens and subjects.\n\nThrough its flagship magazine, the HDB attempted to interpellate spatial-political subjects with an overall sense of upward mobility anchored by their sense of ownership over their apartments, and their sense of belonging within the new urban order. The entwinement of place, emotion, and the self is captured in this poignant excerpt from an article entitled “Happiness is…living in a flat”Footnote 19:\n\nSometimes I wish we had a small lawn but I suppose one cannot ask for everything…. I even know of some house proud HDB housewives who give their floors a daily once-over with a mop…an unheard of chore elsewhere, I’m sure. Quite apart from the easy-care aspects of flat-dwelling, I’ve always thought of my flat as equipped with convenience features. We might complain when shops ply a noisy trade downstairs but let’s look at it this way. Which housewife can boast of having her market, her cobbler, her carpenter, her hairdresser and even her doctor, dentist and banker all within easy walking distance?\n\nFig. 1 Cover page of inaugural issue of “Our Home”, July 1972 Full size image\n\n“The cessnas of our political system”—Town councils and common areas as the new site of political legitimacy\n\nBy the early 1980s, slums and villages had all but disappeared and public housing was a firmly established success. The percentage of the population living in public housing had risen from 10% to 1959 to 81% in 1984, while the remainder lived in privately-owned propertyFootnote 20. The ruling party had fulfilled its promise to provide economic development, prosperity, and near-universal public housing. However, the 1980s also saw the ruling party begin to lose support from a disaffected electorate who were chafing at growing inequality and authoritarianism under PAP rule (Mauzy & Milne, 2002; Rodan, 1989). While the PAP had swept every single parliamentary seat in each General Election since Singapore’s independence, it experienced an existential shock in 1984 when it lost two out of seventy-nine parliamentary seats to the Workers’ Party and the Singapore Democratic Party. While the opposition’s gain of two seats might appear meager by ordinary democratic standards, it “really shocked the PAP” (Mauzy & Milne, 2002, p. 149) into a wave of institutional reforms over the next few years. Reflecting on the PAP’s losses, Deputy Prime Minister Goh Chok Tong blamed “disaffected” opposition voters for being “anti-establishment” “free riders” who fundamentally wanted the ruling party in power, but were “acting on the assumption that others would vote for the PAP.” These voters did not understand that “all it takes to upset the status quo is for an additional 20 to 25 per cent of the electorate to free-ride, i.e., voting opposition and hoping other constituencies will return the PAP to power.” If that happened, Goh warned, “political instability (would) result because no alternative leadership has emerged which can effectively govern Singapore.”Footnote 21\n\nThe PAP now faced the dilemma of how to consolidate its power. While the ability to provide a middle-class lifestyle continued to be a key criterion of ruling party legitimacy, the state had to choose a different physical site to demonstrate its material provision. Previously, urban transformation through public housing had powerfully symbolized ruling party achievement; now mass construction was no longer a self-evident monument to state power. Since public housing was now a familiar feature of the landscape, and younger Singaporeans had no personal memory of the slum or village, constructing additional New Towns would not guarantee the PAP’s legitimacy. The PAP’s solution was to shift the spatial stakes of power and legitimacy towards the maintenance and regulation of common areas within public housing estates, which residents experienced more immediately than the abstract logic of the New Town. From 1986 to 1991, the PAP introduced Town Councils which devolved the HDB’s municipal responsibilities to the local elected official—almost always from the ruling party—who would in turn work closely with the PAP’s existing grassroots networks within public housing estates. This culminated in the Town Councils Bill in 1988, which empowered Town Councils throughout the country to “control, manage, maintain and improve (the) common property…in the housing estates of the Housing and Development Board”Footnote 22 such as footpaths, elevator lobbies, sheltered walkways, community gardens, precinct pavilions, and even larger facilities such as food courts, wet markets, and the retail establishments at the Town Center. By directly impacting residents’ property values and quality of life, Town Councils facilitate a “politics of quality” (Teo & Kong, 1997) in which the ruling party’s ability to provide comforts such as elevator stops on every floor, handrails and wheelchair ramps for the elderly, sheltered footpaths, effective pest control, and overall cleanliness turns residents into dependent “clients of the state” (B. H. Chua, 2000).\n\nThe PAP knewFootnote 23 that Town Councils would be an asset to the ruling party but an obstacle to the opposition. Referring directly to its losses in 1984, the PAP explained that Town Councils were a “ballast” to prevent the “political system” from being “overturned by temporary drastic swings in popular opinion”Footnote 24. Deputy Prime Minister Goh Chok Tong compared national leadership to piloting a “SIA (Singapore International Airlines) jumbo”, and running a Town Council to having “flown solo in a Cessna”, a small private aircraft, explaining that “if any party aspires to displace the PAP government, its first step must be to try and acquire some experience in a town council,” which “are the Cessnas of our political system”Footnote 25. Opposition MP Chiam See Tong of the Singapore Democratic Party (SDP) protested that Town Councils would only politicize minor municipal issues while distracting elected officials from the real work of national legislationFootnote 26. However, the PAP assured the public that Town Councils were in fact a magnanimous risk the ruling party was willing to assume, because “[i]f an opposition team voted in can do a better job…than a PAP one…then news will spread for all to see”Footnote 27, potentially resulting in the PAP’s loss.\n\nIn reality, the ruling party has consistently used municipal management to undermine the opposition, casting aspersions on the latter’s ability to manage Town Councils while reminding voters of the consequences of opposition incompetence. At the introduction of the Town Councils Bill, a minister warned that “if (voters) elect an MP who chooses a bunch of crooks to help him and they run through the coffers, leaving constituencies in the lurch, the voters have to take the consequences. The government is not going to come in and make good all the losses”Footnote 28. Before the 1997 General Election, the government-friendly Straits Times reminded voters that “your MPs will run your Town Council”, and that “PAP Town Councils have more experience and are better managed.” The PAP could provide “comprehensive upgrading and development plans” for every town, which would “directly affect the quality of life in your own neighborhood and the value of your property.”Footnote 29 Meanwhile, the PAP singled out the Singapore Democratic Party’s constituency for being in a “sad state”Footnote 30 and “putting off repairs”Footnote 31, while incumbent PAP candidates in Aljunied warned voters of the “dismal prospect” of becoming like the neighboring Workers’ Party stronghold of Hougang “in terms of upgrading, physical appearance, cleanliness, orderliness, even in terms of property prices”Footnote 32. The PAP’s rhetoric came to a head in the 2011 General Election, when the Workers’ Party had grown into a serious and credible threat in the same battleground of Aljunied. This prompted Singapore’s influential former Prime Minister Lee Kuan Yew to warn that if the PAP lost Aljunied, voters would have “five years” until the next General Election to “live and repent”Footnote 33. Lee’s “live and repent” comments backfired spectacularly and contributed to the PAP’s subsequent lossFootnote 34. The Workers’ Party made history as the first opposition party to win in a constituency as large as Aljunied, but their triumph was quickly marred by legal difficulties relating to the transition of Town Council leadershipFootnote 35. This in turn triggered fresh rounds of excoriation from the ruling party over the next few years.\n\nGiven the PAP’s long-standing reputation for authoritarianism and illiberalism, the fact that the ruling party has attempted to curtail the opposition should come as no surprise. It is, however, noteworthy how the most mundane features of the built environment have emerged as a critical site of legitimacy as a direct result of the PAP’s unilateral decision to shift the spatial stakes of legitimacy towards common areas through the institution of Town Councils. The success of this strategy is predicated, however, on residents actually understanding the political salience of every repaired sidewalk, renovated playground, and pruned tree. This called for a shift of attention away from the New Town and the apartment towards the middle ground of pedestrian space, along with the cultivation of a new kind of subject: the sociable urban citizen who would spend enough time outside his or her home to notice and care about estate improvements, while connecting with fellow residents under the auspices of state-sanctioned social networks.\n\nTown council newsletters and audience\n\nTown Council newsletters were explicitly identified as the successor to “Our Home”. In July 1989, shortly before the publication of the final issue of “Our Home”, the HDB announced that “the 17-year-old magazine for HDB residents (would be) closed down because Town Councils…are now managing the estates.” Residents would now receive newsletters from their respective Town Councils, while the HDB would continue to communicate through press releases and ad hoc factsheetsFootnote 36. Town Council newsletters did not simply imitate their predecessor, however: the similarities and differences between the two publications sheds important light on the shifting spatial stakes of state power.\n\nTown Council newsletters are markedly different from their predecessor in format, content, and tone. Where “Our Home” was a sumptuous and varied magazine, Town Council newsletters are only eight to sixteen pages long, comprising mainly captioned photo spreads of municipal works and community activities. Newsletter production is decentralized and funded by their respective Town Councils. Each title has a smaller circulation than “Our Home” in both absolute and proportional terms. While “Our Home” addressed 440,000 households, or nearly 100% of public housing residents at its peak, today’s average Town Council newsletter reaches an estimated 64,000 householdsFootnote 37, or approximately 6% of public housing residents. Despite their decentralized production and smaller audiences, however, Town Council newsletters are remarkably similar to each other across time, geographic region, and political affiliation, which underscores the common political context faced by each Town Council. Like their predecessor, Town Council newsletters are also written primarily in English, with occasional translations to Chinese, Malay, and Tamil; mostly for policy-related features.\n\nIn contrast to “Our Home”, which at least attempted to simulate a lively public forum, reader contributions have drastically diminished within Town Council newsletters. Perhaps this is due to budgetary or staffing constraints—one can only speculate. Regardless of the reasons for the change, the relative sparseness of Town Council newsletters, combined with their stagnation in format, indicates a unilateral style of communication that reveals more about the priorities of the state than those of the residents. This has implications for the analysis of reader reception and impact, which will be discussed in the final section.\n\nThe maintenance of the middle ground and the critical urban pedestrian\n\nOne of the most obvious differences between Town Council newsletters and their predecessor, “Our Home”, is the emergence of the middle ground of common pedestrian areas as the primary site of state intervention and subject construction. Where “Our Home” sought to promote the joys of high-rise apartment living through content that focused on the macro-level of the New Town and the micro-level of the apartment, Town Council newsletters are replete with captioned photo-essays that overwhelmingly emphasize the meso-level of common pedestrian space; first as a site to demonstrate the ruling party’s ability to provide, and second as a social space of state-dominated community life run by ruling party connected “Grassroots Organizations”. The near-disappearance of indoor apartment spaces, and the almost exclusive emphasis on outdoor areas further accentuates the importance of sociability in the new phase of subject-construction, as residents were now expected to leave their homes and interact with others.\n\nHowever, the Town Council newsletters’ turn to the middle ground represents a difference in emphasis rather than kind. The seeds of the Town Council newsletters had been sown in the later issues of “Our Home”. From 1980 onwards, “Our Home” began to publish short columns featuring improvements made by Grassroots Organizations to common areas such as footpathsFootnote 38 and gardensFootnote 39. Although these columns were infrequent and eclipsed by the rest of the magazine, the foreshadowing of Town Council newsletter content demonstrates the state’s constant awareness of the political implications of various locations around public housing estates, and willingness to adapt its emphasis as strategically necessary. The turn to the middle ground necessitated a new iteration of the spatial-political subject: the sociable urban citizen who inspects and appreciates the state’s street-level improvements, while regularly participating in state-sanctioned social life in common areas.\n\nIn contrast to “Our Home”, Town Council newsletters keep text and lengthy articles to a minimum, instead inundating readers with pages of captioned photographs of town life. The majestic aerial photographs of New Town developments and the intimate portraits of residents’ homes have almost completely given way to pedestrian-level views of the sidewalk. Newsletters overwhelmingly direct the reader’s gaze to their Town Council’s construction and refurbishment of playgrounds, fitness corners, sheltered footpaths, wheelchair ramps, handrails for the elderly, and so on. Meanwhile, the casual photographs and text simulate a pedestrian’s point of view, which invites the reader to imagine him- or herself as a pedestrian experiencing and appreciating the work of their Town Council.\n\nThe format and overarching strategy of the various Town Council newsletters has not changed significantly since the following example from February 1993. This issue by the “Bedok Town Council News” dedicated the front cover and a full inside page to an article headlined “Condo Style Lobbies for All”, which described the implementation of a $6 million dollar program to upgrade lift lobbies around the neighborhood. Here, the newsletter continued its predecessor’s emphasis on middle-class aspirations, but shifted the site of state provision. Where “Our Home” might have provided a sweeping description of improvements to the New Town, the “Bedok Town Council News” focused on the lift lobby, drawing close attention to the “decorative tiles” that had been “added to the lift landing walls and floor”, the “new suspended ceiling with concealed lights”, and the “two residents’ corners—each with tiled stone seats”Footnote 40. The accompanying photographs were either eye-level compositions of the lift lobby in question, or close-up photographs of the new fittings. This simulates the perspective of the pedestrian peering closely to inspect these new additions, while a quote from an actual pedestrian helped readers interpret these improvements: “Stock broker Lester Chan, 29, who was visiting a relative at the block, was impressed. ‘It looks better than the lobby of the condominium where I live.’”Footnote 41 (Fig. 2)\n\nFig. 2 Excerpt of cover page of “Bedok Town Council News”, February 1993 Full size image\n\nThe Town Councils’ work assumes even greater salience before the General Elections held every five years. In the months before a General Election, it is not uncommon for Town Councils to produce special edition bumper issues filled with photographs of works completed, and richly illustrated master plans of multi-million-dollar redevelopments if the incumbent is returned to power. Significantly, even when relying on artists’ illustrations for development proposals, election year issues continue to focus on pedestrian-level improvements; showing that even when granted full artistic license, the middle ground of common pedestrian space continues to serve as the most salient site of state provision and legitimacy.\n\nBy the same token that the ruling party showcases its resources through the maintenance of common space, however, the obstacles and difficulties faced by opposition Town Councils are also placed on full display at the pedestrian level. Opposition Town Councils, which are always in the minority, adopt the same newsletter format as their ruling party counterparts with a few telling differences. Where PAP Town Council newsletters portray a seamless process of municipal improvement, opposition Town Council newsletters are occasionally forced to address the obstacles they face. In 1992, Chiam See Tong of the Singapore Democratic Party—the same opposition MP who had objected to the implementation of Town Councils— explained on the front page of “Potong Pasir: My Kind of Town” that “(t)he Town Council is making every effort to carry out its various projects and activities. Often, this is not easy. Although we have the funds, the Town Council still has to go through the red tape at the HDB central office, and because of this, our projects are bogged down or disadvantaged, like the creche we intended to start at Block 139.”Footnote 42 Nearly a decade later, Low Thia Khiang, the Worker’s Party MP and chairman of the Hougang Town Council, wrote on the front page that he had “paid $5000.00 from his own pocket to the HDB as a deposit for the license to construct this (foot)path”—something that would be unthinkable among well-funded ruling party Town Councils—and that he “continues to pay $120 yearly for the temporary license to build this land!”Footnote 43.\n\nEven after the Worker’s Party’s landmark 2011 victory in Aljunied, the newly formed Aljunied-Hougang Town Council was quickly subjected to ruling party scrutiny, which then triggered a lengthy investigation and lawsuit alleging mismanagement and corruptionFootnote 44. In response, the embattled Worker’s Party devoted fourteen out of twenty-four pages of its June 2015 newsletter to a point-by-point rebuttal to ruling party accusations in the four official languages of English, Mandarin, Malay, and Tamil—a rare formality for Town Council newsletters. The opposition Town Council’s newsletter presented tables comparing its financial information to other PAP-run Town Councils, arguing that opposition MPs had been unfairly singled out for personal attacks by the state and mainstream media. There might have been some truth to this: when the former General Manager of the staunchly-PAP Ang Mo Kio Town Council was jailed for corruption in November 2019Footnote 45, the incident was omitted from the respective Town Council newsletter. This demonstrates the unequal burden on Opposition parties to justify and defend themselves, reinforcing their position as political outsiders.\n\nTown councils and grassroots organizations: the colonization of associational life\n\nTown Councils have not only extended the ruling party’s power over physical space, but also enabled the state’s domination of social life within common areas. This is accomplished by consolidating the municipal capacities of the Town Council with the PAP’s existing Grassroots Organizations located within public housing estates. Grassroots Organizations, or GROs as they are commonly known, are residential and interest-based groups run by volunteers but overseen by the People’s Association, a government agency founded in 1960 to mobilize the masses against what the PAP perceived to be a communist threat in rural Singapore (Chan, 1991; Hill & Lian, 1995; Seah, 1973). Armed with an official mission to serve as a channel of communication between residents and the government as well as to “build and bridge communities in achieving one people, one Singapore”Footnote 46, the People’s Association works through its Grassroots Organizations to organize recreational activities, festive celebrations, job fairs, and dialogue sessions with GRO leaders and office holders. GROs remind residents of the state’s presence in their lives at every corner. Public housing residents are never more than a short walk away from a GRO office in their neighborhood. The noticeboards at every elevator lobby are reserved for GRO flyers for upcoming activities. Despite the ruling party’s insistence that Town Councils would inaugurate a new age of participatory democracy, GROs and Town Councils effectively monopolize all legitimate channels for feedback and mobilization, serving as the government’s tool for “mass mobilization and surveillance” (Tan, 2003). Scholars have thus referred to GROs as “parapolitical organizations” (Hill & Lian, 1995; Seah, 1985; Tan, 2003) which entrench the hegemony of the ruling party.\n\nIn ruling party constituencies, Town Councils and GROs are integrated through the PAP Member of Parliament’s overlapping leadership as the chairperson of the Town Council, as well as the “Adviser” who oversees the local GROs. As the “Adviser to the GROs”, the elected official determines the overall strategic direction for programs within the constituency, while the same official, acting as the Town Council Chairperson, is responsible for everyday maintenance and renovation projects. It is also not uncommon for influential Grassroots Leaders to serve as Town Councilors, which enables them to draw on their experience as Grassroots Leaders to influence the coverage of Town Council newsletters and vice versa. In PAP constituencies, this creates important synergies when implementing projects as well as gathering and disseminating information to residents.\n\nSuch synergies do not exist in opposition-held constituencies. GROs are formally non-partisan, serving “the government” rather than the ruling party. Therefore, Grassroots Advisers across Singapore always belong to ruling party, even in opposition constituencies. This tortuous logic (See Fig. 3) means that in an opposition constituency, the elected opposition MP serves as the Town Council Chairperson, while the losing PAP candidate—as a member of the government—is made the “Grassroots Adviser!” Unsurprisingly, opposition MPs chronically complain about obstruction from GRO Advisers and leaders, whose approval is often needed for the funding and implementation of Town Council projectsFootnote 47. The government’s official explanation for this curious arrangement is that “(i)t is not possible to appoint Opposition MPs as Advisers, because we cannot ask Opposition MPs to help the Government to connect better with the people”, which is “especially true of policies which they oppose.”Footnote 48 In principle, today’s opposition stands to inherit the entire GRO apparatus if they ever formed the Government. In practice, however, Town Councils and GROs buttress the hegemony of the PAP by excluding the opposition from important social-political infrastructures. The PAP’s electoral dominance means that in most constituencies, there is no rupture between the “political” position of the Town Council chairperson and the appointed “government” role of the Grassroots Adviser, leaving the ruling-party free to govern the use and improvement of common areas without partisan interference.\n\nFig. 3 Official explanation for why opposition leaders cannot be Grassroots Advisers Full size image\n\nThe colonization of street life and the sociable urban citizen\n\nThrough the consolidation of Town Councils and Grassroots Organizations, the state has created a powerful spatial-political matrix to dominate the social life of the street. The viability of this strategy is contingent on the state’s ability to incorporate as many residents into its Grassroots networks as possible, which in turn depends on residents’ willingness to participate in GRO-organized activities. To ensure a stable base of such participants, the state has attempted to cultivate sociable, civic-minded subjects with an innate disposition towards participating in state-sanctioned public life for the well-being of the neighborhood.\n\nApart from municipal improvement reports, the second staple of Town Council newsletters involves frequent and regular depictions of vibrant town life. Nearly every Town Council newsletter issue features a photo-essay, often titled “Community Diary”, in which residents are seen mingling with each other and their elected officials around the housing estate. Common activities include festive celebrations, litter-picking, tree-planting ceremonies, and MPs’ meet-and-greet sessions. These photographs are candid and informal, attempting to capture ordinary residents interacting with each other, their MPs, and their physical surroundings. The prominence of ordinary residents in the newsletters’ scenes of town life communicates that all are welcome to participate, with the important caveat that the social gatherings represented in Town Council newsletters are always organized by state actors. The absence of spontaneous or resident-organized social activity is especially poignant given the PAP’s early claim that Town Councils represented a “major contribution to democracy”Footnote 49.\n\nThe construction of the compliant urban citizen in turn permits the state to naturalize its extension into residents’ everyday lives through the warm sociability of state actors themselves. In contrast to the HDB’s “Our Home”, both PAP and opposition Town Council newsletters anchor their depictions of community life around elected officials. Great effort is made to represent MPs as the warm and approachable face of the state. In the “Community Diaries” of many Town Council newsletters, MPs are photographed in casual attire—collared, short sleeved shirts for male MPs and smart casual attire with light makeup for female MPs—and mingling cordially with groups of smiling residents. There is often little to physically distinguish MPs from ordinary residents, except that they tend to be the center of attention. Whether officiating an opening ceremony for a new walkway, planting a tree, hosting a festive celebration, or conducting a “Walk-about” meet-and-greet session, the MPs’ ability to perform warmth and sociability is predicated on the existence of a sociable public and readily available common areas for MPs and residents to interact.\n\nAs Timothy Mitchell observed, states reproduce their power by monopolizing the right to determine the often “elusive and unstable” boundary between state and society (Mitchell, 1991, p. 90), or in the PAP’s case, the boundary between partisan “politics” and non-partisan “government”. PAP Town Council newsletters depoliticize the state’s presence within public housing not only by portraying elected officials as visually indistinguishable from residents, but also blurring the very boundaries between the ruling party, state, and society. Town Council newsletters almost always use the title of “Adviser to the Grassroots” in photograph captions and essays, which depoliticizes the MP’s role by aligning him or her squarely with the formally non-partisan “government” apparatus. The “Adviser to the Grassroots” title is also printed on the banners at GRO-organized events, which in turn appear in Town Council newsletter photographs. In the following typical example, the event banner of the “Tree Planting Day” announces the guest of honor as the “Adviser to the Grassroots”, or in one case “Minister”, a high-ranking “government” title. Meanwhile, the logos of familiar Grassroots Organizations such as the Citizens Consultative Committee, Residents’ Committee, and other People’s Association groups festoon the bottom edge of the banners, giving participants the impression of being embedded in an expansive government machinery (see Fig. 4). PAP Town Council newsletters only rarely refer to an elected official by his or her “political” title of “Member of Parliament”. While there seems to be no meaningful pattern to this occurrence, the casual elision flaunts the ruling party’s option to emphasize their party or government alignments at whim, which in turn reinforces the interchangeability of the “ruling party” and the “government” in common understanding. Conversely, opposition officials are limited to the use of their “political” titles of “Member of Parliament” and “Chairman of the Town Council”, despite otherwise indistinguishable event and newsletter formats (see Fig. 5). Opposition event banners are also more visually sparse. Whereas event banners in a PAP constituency are often embellished with long official titles for their elected officials and festooned with GRO logos, opposition event banners are typically limited to the logos of their political party and Town Council, a subtle yet stark reminder that the opposition is disconnected from the organizational resources of “the government”.\n\nFig. 4 Tree Planting Day at West Coast. Logos featured on bottom left corner of community banner, from left to right belong to: <unidentifiable>, Citizens’ Consultative Committee (apex GRO), Residents’ Committee (GRO), West Coast Town Council (West Coast Town Council. (2015, January). West Coast Town Council News, p.14.) Full size image\n\nFig. 5 Photograph of outing organized by Hougang Constituency Committee. Workers’ Party MP Png Eng Huat in the center. The only logo on the banner (top right, hammer) belongs to the Workers’ Party. Banners in ruling party constituencies never use the PAP logo; only “government” signage (Aljunied-Hougang Punggol East Town Council. (2013, September). Good Neighbours, p.11.) Full size image\n\nOpposition town council newsletters: adapted spatial-political subjectivities?\n\nThe PAP government’s distinction between “government” and “party” allows it to exclude opposition MPs from the use of important venues for community events available to the PAP. This is reflected in the greater range of event venues seen in ruling party Town Council newsletters than in their opposition counterparts. The Community CenterFootnote 50, or Community Club (CC), is one such key venue. Community Centers were introduced by the British colonial administration but developed by the People’s Action Party to “consolidat(e) PAP power by extending the party’s influence to poorer sections of the population” (Hill & Lian, 1995, p. 176). Today, CC buildings are ubiquitous landmarks, bearing the People’s Association’s iconic logo of four interlocking red circles projecting the government’s presence in over a hundredFootnote 51 locations across Singapore. CCs remain popular venues among residents for their sports facilities and courses. More importantly, they serve as a base of operations for many GROs, and a venue for GRO-organized celebrations and events.\n\nBy the same token that allows PAP officials to have access to important “government” buildings such as Community Centers by virtue of being the government, opposition MPs are systematically excluded from the use of such premises within public housing, but are instead limited to the use of venues under the jurisdiction of their Town Councils such as community gardens, fields, and void decks, the open spaces at the foot of many apartment blocks. Yet, opposition Town Council newsletters’ representations of community life in the face of spatial and institutional barriers reveal the interpellation of a spatial-political subject that adapts to constraints within the spatial-political matrix of public housing through a process of compliance and negotiation. Throughout the tenure of opposition MP Chiam See Tong, the Potong Pasir Town Council newsletter “My Kind of Town” was virtually indistinguishable from its ruling party counterparts, incorporating regular photo-essays of municipal improvements and community events with the elected official. It is only upon closer inspection that the limited range of community venues becomes apparent. “My Kind of Town” (1991–2011) featured a limited roster of three community event venues. Smaller gatherings were held at the void decks of apartment blocks 121 and 136, while large festive celebrations were held at the open field beside block 142. The open field was an important venue that frequently appeared in the newsletter, pictured with only block 142 in the background. What was routinely omitted from the opposition’s newsletter, which would have been plainly visible to residents, was the Community Club on the opposite side of the field. The opposition’s decision to omit the People’s Association building from its newsletter embodied a classic intersection of agency and structural constraint. On one hand, the fact remains that no opposition figure could use the CC even if they wanted to. On the other hand, the opposition utilized one of their few avenues of autonomy to center opposition experience and deny free publicity to an iconic government building. Here, the sociable urban citizen was interpellated through the use of the common field, albeit with virtual blinders.\n\nThe Workers’ Party-led Aljunied-Hougang Town Council newsletter entitled “Good Neighbors” (2012—present) similarly excludes buildings owned and operated by the People’s Association, with community activities held within public housing occurring in void decks, parks, and open-air activity halls. However, in contrast to the typical PAP Town Council newsletter, earlier years of “Good Neighbors” saw a distinct tendency to feature community excursions outside the public housing estate, such as domestic tourist attractions, and even day trips to MalaysiaFootnote 52. The activity in Fig. 5, for instance, was a day excursion organized by the Hougang Constituency Committee—the Workers’ Party’s counterpart to Grassroots Organizations—to the Marina Bay area, a popular tourist attraction in the city center. One could see the move out of public housing as a sign of defeat at having been obstructed in their efforts to constitute a meaningful community within their own political jurisdiction. On the other hand, the opposition has also exercised its agency by widening their spatial ambit to cultivate meaningful community life several degrees removed from the aegis of the People’s Association.\n\nThe opposition newsletter data is too sparse to ascertain the emergence of a counter-hegemonic spatial-political subject (see Appendix A), while available issues reflect the perspectives of opposition officials rather than the independent views of residents. Nonetheless, opposition Town Council newsletters provide a glimpse into the process of navigating the hegemonic spatial-political matrix from a position of political marginality, as well as the potential for the formation of alternative spatial-political subjectivities. In the examples above, the newsletters simultaneously reproduced, negotiated, and resisted the ruling party’s visions for the use of common space within the public housing estate. The fact that opposition newsletters adopt the same format as their ruling party counterparts reveals the pressures they face to abide by the ruling party’s markers of legitimacy. The reader is similarly interpellated as a sociable urban citizen who participates enthusiastically in community events organized by the opposition’s volunteer networks. Despite their lack of access to important event venues owned and operated by the People’s Association, opposition Town Council newsletters engage in a selective relocation of the spatial-political subject: sometimes willfully ignoring the Community Center right next to the Town Council-operated field, at other times even traveling outside the country. This indicates that the emergence and constitution of alternative spatial-political subjectivities must account for how subjects actively re-frame and relocate themselves within existing space, and how these efforts relate in turn to the hegemonic organization of urban space. Any in-depth attempt to understand alternative spatial-political subjectivities, however, must move outside the archives to overcome the methodological limitations which will be discussed below.\n\nTowards an urban citizen consumer? State responses to its ambiguous legacy\n\nThis paper has examined the Singaporean state’s efforts to cultivate spatial-political subjects in considerable detail. This understandably raises questions about how “Our Home” and the Town Council newsletters have actually been received by residents, as well as the state’s overall success in achieving its ideological aims. Unfortunately, assessing the impact of these publications is difficult because of a lack of independent studies on reader reception, and the fact that housing publications have themselves been part of broader state strategies to shape Singapore’s political culture over the years. Furthermore, any serious attempt to understand the perspectives of flesh-and-blood subjects must venture beyond the archives, because Singapore’s strict licensing regime for printed publicationsFootnote 53 has contributed to the lack of independent resident publications which might have offered direct counter-narratives to official publications. Study scope and methodological caveats notwithstanding, it is important to at least briefly consider the reception of the dominant ideologies represented in these publications, as this has implications not only for the relationship between residents and the state but also the future development of state strategies.\n\nThe least that can be said about “Our Home” is that it had a dedicated reader base which contributed a good variety of materials over the years. It is also safe to say that the state has succeeded in turning Singaporeans into modern urban residents who are able to navigate the spatial logic of the public housing New Town, as seen in real estate advertisements placed by HDB apartment owners which routinely describe the location of their properties in relation to major New Town amenities such as the train station, town center, wet market, sports complex, shopping centers, schools, and so on. This shows that residents not only locate themselves easily within the New Town, but also understand the economic value of a favorable location. The monumentality and symbolism of high-rise public housing has also been etched into public discourse; from state efforts to position public housing as the “heartlands” of the nation to the appropriation of “heartland” discourse by local critics (Poon, 2013). Although the description of public housing as the “heartlands” of Singapore was only popularized after 2000, “Our Home” arguably set an important precedent for the national and political symbolism of public housing.\n\nTown Council newsletters volunteer even less information about their readers. Unfortunately for the state, the circumstantial evidence indicates widespread apathy towards Town Council newsletters and the Grassroots Organization activities portrayed within them. It is common knowledge that GROs disproportionately attract older, female, majority-race Chinese Singaporeans as volunteers and participants. The PAP-government has tacitly acknowledged that GROs have been less successful in attracting ethnic minoritiesFootnote 54 and affluent private housing residentsFootnote 55, and especially unsuccessful in attracting young adultsFootnote 56. Stereotypes about GRO activities and participants are candidly captured by a popular public Facebook group entitled “A Group Where We All Pretend to be Kiasu Boomers” in which young Singaporeans parody their elders (“baby boomers”) through caricatures of the latter’s writing and speaking style. Parodied characteristics include poor English, socially regressive views, a comically “kiasu” (literally “afraid to lose”) attitude, a tendency to spread fake news and dubious health advice on WhatsApp, and a zealous involvement with one’s local Residents’ Committee—hardly a flattering stereotype of the people most closely associated with Grassroots activities. This presents a chronic problem for the People’s Association, which strives to attract as many different demographics as possible.\n\nHowever, widespread apathy towards Grassroots Organization activities belies the state’s indirect success in enmeshing residents in the spatial-political matrix of public housing, even if residents are not necessarily pliant participants. For example, elected officials and GRO leaders have wryly noted that Meet-the-People Sessions, in which residents approach their MPs for legal, financial, and administrative aid, always seem more well-attended in the weeks before a General ElectionFootnote 57, demonstrating that residents fully understand and capitalize on the ruling party’s political bargain. Furthermore, GRO leaders are often subject to public scrutiny in relation to their conduct as residents and neighbors. In 2019, a woman complained on Facebook about her abusive neighbor who happened to be the wife of a GRO leader, and mused whether her husband’s status had shielded her from consequences (Coconuts Singapore, 2019). Stories like these demonstrate that despite the state’s original intention for GROs to surveil the public housing masses (Tan, 2003), residents occasionally turn the state’s gaze back upon itself to hold the state accountable to its own regulations. The above examples demonstrate that the strategy of politicizing minor municipal incidents sometimes redounds onto the ruling party, enmeshing it in a web of its own making.\n\nYet, even as GRO-participation seems to have reached its limits, the state shows no sign of abandoning its established strategy of spatial-political domination. Instead, I suggest that the state is expanding its existing strategy of place-based incorporation through the sponsorship of mass consumption. This is epitomized by the recent introduction of Integrated Town Hubs, which are massive, multi-million-dollar complexes owned and managed by the People’s Association that host government service providers alongside shopping and recreational facilitiesFootnote 58. Although Integrated Town Hubs are not managed by Town Councils, Town Council newsletters continue to provide publicity for GRO activities held within the HubsFootnote 59. To be sure, the mobilization of mass consumption to cultivate docile consumers is nothing new in Singapore (Chua 2003; Rappa 2002) or around the world (Cohen 2003). However, Integrated Town Hubs are noteworthy for their continuation of the state’s existing strategies, and transposition of GRO domination from the common spaces of public housing to more ambitious projects that incorporate mass recreation and consumerism.\n\nThe corresponding spatial-political subject for this phase of the state’s spatial strategy is likely to be the urban citizen consumer who continues to participate in GRO activities but within the context of a hybrid consumerist setting. Aside from the construction of Integrated Town Hubs, the People’s Association has intensified its efforts to court consumers with a cornucopia of discount programs, vouchers, merchant collaborationsFootnote 60, and even a People’s Association Debit Card, once again positioning the PAP-government as the provider of middle-class material comfort. Needless to say, these initiatives continue to exclude the political opposition, who have neither access to the “government” buildings of Integrated Town Hubs, nor the resources to implement mass discount programs.\n\nThe future of the spatial-political subject\n\nThis paper began by identifying an important omission: scholars have a better understanding of how the state intervenes in the built environment to construct the compliant subject than how the subject is encouraged to internalize the material and symbolic significance of urban space as a monument to state power. The built environment is too often assigned the role of explanans and the subject that of explanandum, with little consideration for their reciprocal relationship in the reproduction of state hegemony. While it is indeed crucial to uncover the “invisible hand” of urban space on inhabitants’ personal, social, and political behaviors (Crampton & Elden, 2007; Harvey, 2006; Hou & Knierbein, 2017; Pile, 2008; Probyn, 2003), this does not explain state strategies to shape inhabitants’ reception of more overt “political pedagogies” (Mukerji, 2012) expressed through the built environment. To address this lacuna, this paper examined five decades of public housing publications in the developmental state of Singapore to reveal the ruling PAP’s strategy of cultivating spatial-political subjects corresponding to distinct phases of political and economic development: the modern urban resident during the period of nationwide urban transformation, the sociable urban citizen during the period of political consolidation in the face of growing electoral challenges, and a hypothesized urban citizen consumer of the future to reincorporate an apathetic electorate. Although it is difficult to assess the direct impact of public housing publications within the scope of this study, the very uncertainty of the state’s success testifies to the importance of state efforts to manage the inherent polysemy of the built environment and its potential for contested use. The concept of spatial-political subjectivity opens up important avenues for future research. Whichever spatial frontier the state chooses as the site to establish its legitimacy, we cannot ignore the question of how it tries to imagine and cultivate the subjects who will be its inhabitants. No less importantly, we must also examine the lived experiences of inhabitants, whose navigation of powerful structures hints at the intriguing possibility of spatial-political subjectivities of resistance."}, {"url": "https://www.hindawi.com/journals/sp/2022/1610427/", "page_content": "Abstract\n\nWith the continuous improvement of the living standards of people, the requirements of people for the environment in which they are located are gradually increasing, which makes urban landscape design work more and more important. Plant landscaping is the core component of urban landscape design. By analyzing and discussing the application of plant landscaping in urban landscape design, the quality level of urban landscape design can be further improved, thereby promoting the sustainable development of urban construction. Machine learning makes it possible to realize the intelligent processing of data and make full use of the knowledge and value contained in the data. This paper explores the way of intelligent analysis and application based on machine learning in the field of landscape architecture. First, the k-means machine learning clustering method is used to determine the types of plant landscaping required by modern urban landscape design. Experiments show that our model can be well applied to design applications of modern urban landscapes.\n\n1. Introduction\n\nMachine learning is a way to realize artificial intelligence and a key technology for processing big data. Machine learning algorithms can automatically analyze one or several types of data to obtain rules, discover the mechanism of action, and use the rules to predict unknown data. At present, it has become possible to apply machine learning (including deep learning) to the fields of landscape architecture, urban planning, and architecture to solve related problems such as human settlements. Scikit-learn, an open-source machine learning library based on Python language, integrates mainstream core algorithms in the field of machine learning, including classification, regression, and clustering algorithms, and data preprocessing methods; TensorFlow, an open-source deep-learning library based on Python language, uses computational graph, and automatic differentiation and customization are used for numerical calculations. Because of the emergence and rapid growth of machine learning open source libraries, and the gradual improvement of a large number of core algorithms, machine learning as a tool has been widely used in various fields, and landscape architecture is also in the exploratory stage.\n\nPlants are an important element in the construction of garden landscapes. Today, with the continuous emphasis on the construction of ecological civilization, people are more yearning for green space, so garden plant landscaping has received more attention and attention, and its dominant position in landscape garden design has become more and more obvious. At this stage, designers often use horizontal and vertical section drawings to analyze and deliberate plans, but relying only on artificial design limits the possibility of landscape design. Therefore, designers and industry-related personnel urgently need new technology to assist them to better complete the landscaping design of garden plants. With the development of science and technology, the application of machine learning to garden plant landscaping has become a breakthrough to solve the problem.\n\nThere are many classic machine learning algorithms that have application potential in landscape architecture design. According to the focus of solving the problem, it can be divided into algorithms with efficient data classification capabilities, such as naive Bayesian algorithm, support vector machine decision tree, regression tree, and random forest [1], which are mostly used for classification problems such as landscape land classification [2]; deep learning algorithms, such as convolutional neural networks, recurrent neural networks, and generative adversarial networks, have powerful image recognition capabilities [3–5] and are mostly used for rapid identification and information extraction of remote sensing images and street view images [6–10], in which algorithms such as generative adversarial networks also have powerful image generation capabilities [11], which are mostly used in generative design [12]; regression algorithms such as principal component analysis and logistic regression have the ability to automatically associate data and perform functions. The ability of fitting to mine the internal relationship behind the data is mostly used for correlation analysis, such as the research on the driving force of the development of landscape patterns [13–16]; tf-idf, word2vec, BERT, CRF, LSTM in the field of computer natural language processing. Such algorithms have the ability of text recognition and processing and can classify and extract sentiment and other topics from text data in a large number of networks.\n\nIn this work, the k-means algorithm is used for the first time to perform cluster analysis on the landscape principle design of the urban landscape. And the results of the model are tested by taking Hangzhou Hupao and Beijing Biyun Temple survey image clustering as examples. The results show that the model has a good performance in the application of modern urban landscape design for generating plant landscaping. In addition, this paper also analyzes the application principles of plant landscaping in the urban landscape and the application of plant landscaping in modern urban landscape design.\n\n2. Theoretical Basis of Machine Learning and Principles of Plant Landscaping\n\n2.1. Machine Learning\n\nIn the field of landscape architecture, traditional computer technology requires artificially designed computing rules, while machine learning technology has powerful rule learning ability and the ability to capture implicit rules. In landscape architecture work, it is necessary to analyze the site conditions, obtain the law of site changes, and then intervene and guide the site to develop in a specific future direction according to the means of planning and design. Therefore, machine learning has great potential in the field of landscape architecture.\n\nFrom the perspective of machine learning technology, machine learning technology includes a variety of algorithms with different functions and focuses (Table 1). However, because the design goals of the algorithms in the computer field have less overlap with the landscape architecture design, they cannot directly serve the landscape architecture design, so they are used in the landscape architecture. There are not many algorithms with relatively mature applications. The common application method at present is usually to decompose the planning and design into multiple work steps and then design the corresponding algorithm according to the work target of each step.\n\n2.2. K-Means Algorithm\n\nIn the K-means algorithm, K is the number of cluster centers, and Means is the mean. This algorithm clusters the regional data points through the iterative optimization of the mean and obtains the optimal clustering result. In this article, garden colors are divided into 7 colors. Below are the executor steps of the algorithm. (1) Set K = 7. Seven color location data are randomly selected as the initial cluster centers of the seven categories, and the Euclidean distance formula is used. where D is the distance; x 0 and y 0 is the latitude and longitude coordinates of the center point D; x i and y i , is the latitude and longitude coordinates of each noncenter point. Use this formula to calculate the distance from each noncluster center point to the cluster center point, and divide each noncluster center point to the nearest cluster center. (2) After the data are grouped by distance, the mean of the seven groups is calculated, respectively, and the mean of the seven groups is used as the new cluster center. (3) Iteratively calculate the distance from each noncenter point to the new center point using equation (1). (4) Iteratively calculate new cluster centers until each noncluster center data no longer move and the cluster centers no longer change.\n\n2.3. Application Principles of Plant Landscaping in Urban Landscape\n\n2.3.1. Ecological Principles\n\nIn the urban landscape design, the application of plant landscaping can not only create a beautiful visual environment, improve the city’s ornamental value, but also improve the material environment. In plant landscaping, it is very important to strengthen the plasticity of plants and improve the ecological beauty of the surrounding environment. On the one hand, plants purify the surrounding environment very well by releasing oxygen and absorbing carbon dioxide. At the same time, there are functions such as reducing noise and adjusting the temperature. However, different types of plants have different growth environments. Once the selected plant species is not suitable for the local ecology, it will have a great impact on its growth. On the other hand, if there is a phenomenon that the community violates the natural development law, there will be serious consequences. Therefore, it is very necessary to scientifically select plant species based on local environmental conditions.\n\n2.3.2. Principles of Practicality\n\nIn the application of plant landscaping in urban landscape design, the principle of practicality should also be followed. The so-called principle of practicality means that in the actual process of plant landscape landscaping, some practical functions such as environmental protection should be fully considered. Harmful gases play a good role in purifying the air. If the above practical conditions cannot be met, some practical plants that can play a good role in noise reduction and dust prevention can also be selected as landscaping materials. Therefore, while beautifying the urban environment space, it can also effectively weaken the sense of tension and oppression brought about by the characteristics of urban industrialization, meet people's needs to be close to nature, reduce the urban heat island effect, and enable urban plant landscaping to achieve production and integration. The combination of ornamental and ornamental can give full play to the functional value of urban plant landscape in beautifying, ecological, and environmental protection.\n\n2.3.3. The Selection of Plants Should Be Combined with the Characteristics of the City\n\nIn modern urban landscape design, the application of plant landscaping should not only repeat the application of a single plant, but should combine the characteristics of the local city and the actual situation of the landscape, and at the same time consider factors such as soil climate and environment. Therefore, designers need to consider the local plants with strong regionality and show the local characteristics through the planted plants, which can not only create a certain resource space for the local landscape but also allow the planted plants to better adapt to the environment, to further save plant landscaping.\n\n2.3.4. Make Full Use of Ground Cover Plants\n\nAmong various types of plants, ground cover plants have their own unique features, such as luxuriant branches and leaves, and strong fecundity. At the same time, they have a very strong antipollution ability, and follow-up maintenance is also more convenient. Therefore, in various designs of the modern urban landscape, planting is almost indispensable, which can give people a harmonious and comfortable look and feel. From the overall look, it also makes the layering of the whole design more prominent, making people shine. The plants above can absorb light energy, and the plants below can loosen the soil surface, adjust the ground temperature, and make the growth environment of the trees above better. In addition, ground cover plants also play an important role in the garden landscape. For example, planting ground cover plants around flower beds and on both sides of the sidewalk can form a sharp color contrast with the flowers and effectively clarify the walking routes of tourists, thereby improving the ornamental value of the landscape and at the same time alleviating people’s aesthetic fatigue.\n\n3. Judging the Plant Landscaping Style of Modern Cities Based on Machine Learning Models\n\n3.1. Model Establishment and Training\n\nThe data of this experiment are mainly images with latitude, longitude, and elevation information taken through the actual survey of mobile phones. Divided into two groups, one group came from Hangzhou Tiger Pao. The other group came from Biyun Temple in Beijing. The specific technical route is shown in Figure 1. First, the images are read in batches in the Python programming language, because the captured images are about 4 200 pixels 2 400 pixels in size, and color analysis does not require such high precision, so the image size is reduced by compressing the image to save analysis time. Then, set the number of color theme color clusters to 7, that is, obtain 7 theme colors for each image. Colors were classified using the K-means clustering algorithm.\n\n\n\n\n\n\n\nThe extraction of the theme color is shown in Figure 2. After extracting the theme color of all images, they are summarized in an array. In the aspect of data enhancement visualization, 2 forms are designed: (1) scatter point form to print the theme color, which can directly reflect the urban color impression. Through the extraction of the urban theme color, the color impression sensory presentation can be used to study the urban color, which can be aimed at different urban spaces and different research times, and to analyze the changes in color. (2) Try to project the subject color of the survey images of the two places into the three-dimensional space and observe the changes of the two sets of data in the three directions of red, green, and blue.\n\n\n\n\n\n\n\n3.2. Model Results\n\nIn machine learning clustering, sklearn integrates many clustering algorithms and compares the effects of different clustering algorithms on different data types through the actual operation of the program. In addition to applying survey photos to analyze the urban color environment, you can also use recorded video, extract images at specified frames, and perform the same analysis. In the specific data analysis, the theme color of each image can also be placed on the coordinate points of its latitude and longitude, and the clustering algorithm can be used again to cluster the areas with similar color values in the space, so that the urban color characteristic areas can be classified. And the POI data reflecting urban functions, Weibo, WeChat, and other data reflecting urban social relations are combined and analyzed to find the internal mechanism of urban color space distribution characteristics.\n\nThe clustering results of the research images of Hangzhou Hupao and Beijing Biyun Temple, and the color impression after printing the theme color in scatter form are shown in Figure 3. Hupao’s theme color is gray and dark (the color of the building), mixed with green and green vegetation and blue sky. Simple and elegant Biyun Temple because the building itself is mostly red, after interspersed with vegetation and the sky, the overall feeling is gorgeous and gorgeous. Through these data visualization methods, the urban color characteristics of the study area can be more intuitively reflected. If the number of research areas surges, automated batch processing can be achieved according to the established model, such as studying the color characteristics and distribution relationships of different areas of the city. Data containing color information (RGB) is projected into three-dimensional space. The changes in the red, green, and blue color components can be grasped by judging the distribution of the colors of the two regions in the three-dimensional space domain. The color tendency of Beijing Biyun Temple is higher in the red value, while the 3-component of Hangzhou Hupao color tends to be lower. In the analysis, the color can also be converted to HSV (hue, saturation, value) and projected into the three-dimensional space domain to analyze the relationship between hue, saturation, and lightness.\n\n\n\n(a)\n\n(b)\n\n(a)\n\n(b)\n\n4. The Application of Plant Landscaping in Modern Urban Landscape Design\n\n4.1. Tree Landscaping\n\nIn large garden scenic spots, all kinds of towering and lush trees will always bring people many different impressions. For example, the lush ginkgo, with its proud standing posture, brings people a beautiful feeling. It has long been called the Gongsun tree. The planting of ginkgo in the garden landscape not only reflects the virtues of the predecessors planting trees and the later generations enjoying the shade in traditional Chinese culture but also implies people’s yearning for a better life in the future. The willow tree is deeply loved by garden designers because of its gentle and graceful tree shape. In spring, it is praised for its willows that are drunk with spring smoke. In summer, it is called ten thousand hanging green silks. In the winter, the weak warbler with green silk strips presents the beauty of ancient charm in different seasons. Because of its tall and straight leaves and sparse branches, the king coconut tree is often used as a street tree to green roads. The curved branch shape of mountain peach, the arch branch shape of welcoming spring, the umbrella shape of acacia, and the clump shape of the Chinese rose can all bring people different visual enjoyment.\n\n4.2. Make Plant Landscaping in Combination with Different Terrains\n\nIn the actual plant landscaping, it is necessary to combine the different spatial topography of the city, so as to effectively highlight the natural characteristics of landscaping. For example, some trees can be planted around the ridgeline, and some short shrubs can be planted in the position of the hillside ravine. Through this landscaping configuration, it can not only effectively demonstrate the tall and straight posture of the mountains but also make the entire urban environment more harmonious and increase the three-dimensional sense. On this basis, the characteristics of some buildings such as urban pavilions and pavilions can also be combined, and plants can be arranged on the top of the mountain to promote the two to set off each other and complement each other. When creating a waterside flower border landscape by the water, make a good choice of aquatic plants, the more common ones are reed bamboo, water lily, barracuda, and parasol. To ensure a good reflection effect, it is not advisable to plant too many plants underwater. On the banks of the embankment, some trees can be planted, and the trees are sparsely distributed to form a beautiful reflection in the water.\n\n4.3. Follow the Aesthetic Principles of the Plants Themselves for Landscaping Design\n\nFirst of all, in some areas such as the corners of buildings and roads in the city, it is necessary to weaken the sharp corners to reduce the visual rigidity. In landscaping, the combination of flat slope and arbor and irrigation can be used to plant some beautiful plants, such as cedar, sycamore, and pentagonal maple. If the selected seedlings are plants with high branch points, try planting multiple seedlings in the same tree pond. At the same time, carry out scientific planting, let them grow together into a large canopy, and effectively weaken the corners. On the other hand, it is also possible to make a reasonable blank of the landscape with the help of the blanking technique of traditional Chinese painting. For example, in a relatively empty square, if you add a few delicate trees to embellish it, it can give people an open and comfortable look. It fully embodies the principle of balanced aesthetics.\n\n4.4. Maintaining the Stability of Native Plant Communities\n\nBefore introducing new plants, we must first ensure that the existing plant community is in a relatively stable state. Therefore, for the introduced new species, the relevant departments must do a good job in quarantine work and make a good estimate of their reproductive capacity, so as to avoid a large number of reproduction and spread after they are introduced into the urban landscape, which will cause damage to the balance of the local plant community and ecological structure very serious impact. Maintaining the stability of local plant communities can further ensure the visual effects and ecological benefits of urban plant landscaping. On the other hand, weeds should be cleaned regularly to prevent the problem of flooding due to their tenacity, and the affected areas should be restored and protected. At the same time, it is necessary to fully develop the nursery cultivation industry and market, so that plant landscaping can choose more plant varieties.\n\n4.5. Shaping the Urban Landscape in Combination with Local Urban Culture\n\nThe culture of each city is different. Nowadays, people have begun to attach great importance to the inheritance and protection of urban culture, as well as the continuation of historical development. Therefore, in the urban landscape design, it is necessary to combine the local urban history and culture, excavate the connotation, present the cultural heritage of the city to the greatest extent, and give the city the driving force for continuous development. Therefore, in the modern urban landscape plant landscaping, it is necessary to combine urban culture, conform to the current development law of our country, and avoid destroying the surrounding ecological environment.\n\n5. Conclusion and Future Prospects\n\nArtificial intelligence technology based on machine learning is gradually applied to the analysis and evaluation of landscape architecture with its efficient data processing capabilities and implicit rule capture capabilities and has initially replaced some simple repetitive labor at this stage. Algorithmic generative design based on deep learning takes the creativity of artificial intelligence a step further. The cleaning and selection of data and the manual intervention of algorithms are the core bottlenecks at present.\n\nThe cleaning and selection of data are a technical challenge. Artificial intelligence is basically the exchange of artificial intelligence for intelligence, and it is supported by a large amount of basic data work (such as manual annotation). Problems such as noise and lack of data are frequent at this stage. In this context, designers appear as data analysts, and artificial intelligence methods aimed at replacing repetitive work have brought more planning and analysis and repetitive work. However, with the improvement of technology in the future, the emergence of more excellent algorithms and data sources will gradually solve the current problems and allow designers to return to planning and design.\n\nThe manual intervention of the algorithm is a difficult problem in the application method, which directly affects the role of artificial intelligence and designers. This question is related to the question of how much artificial intelligence should be in the design. This also involves a series of questions such as whether the artificial intelligence analysis results are reliable, whether the output results are correct, and how to define correctness? As mentioned above in the planning case of Rome railway station and the case of plant configuration, the architectural form needs to conform to the form of the building base and at the same time be similar to the surrounding architectural texture. Under the constraints of these two goals, deep learning can balance the relationship between the two, aiming at approximating the base shape and searching the building database for matching, comparing, and iterative cycles. The optimal solution can be obtained only by approximating the base shape infinitely. In the plant configuration project, plants need to meet conditions that are easy to quantitatively explain such as sunshine, climate, and configuration mode. However, under this condition, attributes such as plant species, plant height, and crown width can only be constrained within an interval, so the output results are still very large. Therefore, whether the output result is correct is related to whether the target is abstract. From the computer’s point of view, it is easy for computers to calculate quantitative problems with clear standard goals and regard the goals as correct. In the face of abstract problems, it is difficult for the computer to judge whether it is correct, but for designers, this is also an open problem. To this end, different scholars have made preliminary explorations, and for example, in the case of plant configuration, the abstract plant configuration theory is quantitatively explained and constrained. In the planning case of the urban central axis, the evaluation system is used to constrain the abstract scheme selection problem; Tang Jingxian’s streetscape evaluation research combines the subjective evaluation system with the objective analysis results of streetscape information to realize the artificial correction of machine learning perception evaluation research. The above methods are currently tried by designers. Efforts to revise AI-generated results are also responses to abstractions in design.\n\nTo sum up, at present, plant landscaping has been widely used, which greatly improves the urban environment, allows people to live in a comfortable and environmentally friendly living environment, and further promotes the development of urban construction in China. At this stage, plant landscaping has become an indispensable part of urban landscape design. In the process of designing urban landscapes, designers must combine with more ecological elements and use different plant characteristics to make plant landscaping. The scenery is more suitable for city life.\n\nIn the future, with the training and learning of a large amount of data, the creativity of artificial intelligence will gradually increase. Landscape architecture is a subject highly related to human subjective aesthetics. In order to avoid over-reliance on artificial intelligence in planning and design, it leads to the patterning and standardization of output results. Future research should distinguish between the repetitive and simple labor that should be performed by artificial intelligence in the planning and design process and the part that requires the designer's experience and judgment, and let artificial intelligence technology assist the design instead of leading the design.\n\nData Availability\n\nThe raw data supporting the conclusions of this article will be made available by the authors, without undue reservation.\n\nConflicts of Interest\n\nThe authors declare that they have no conflicts of interest regarding this work."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-59047-9_4", "page_content": "Adopting modernist functional urbanism prevailed among the cities affected by World War II. London , with the two plans by Patrick Abercrombie and his team, was an exemplary model of modernity: both the County of London Plan (1943) and the Greater London Plan (1944) were key moments in the maturing process of urbanism in the post-war period (Gold 2007; van Es et al. 2014). On a different level, particularly concerning the design of new residential areas, there was a greater commitment to a functional approach. Despite criticism, the functionalist paradigms were widely imposed in the 1960s. Curiously, this coincided precisely with more widespread criticism. That was not only due to the ‘arrogance’ of some of the main players in functionalist urbanism, such as Le Corbusier (Hall 2014). But other factors also came into play, particularly those associated with the extraordinary process of construction and proliferation of mass housing estates in Europe in the 1960s and 1970s, for several reasons: first of all, owing to the critical shortage of housing and the intent to quickly solve the problem and secondly, because standardisation and prefabrication led to increasingly rapid construction. Consequently, both architects and urbanists and their respective governments believed it was correct to apply the CIAM theories. The problem arose when these principles were indiscriminately applied in a context of rapid urban growth (Monclús and Díez Medina 2016, 5) (see Chap. 7) (Fig. 4.9).\n\nFig. 4.9 Johannes Hendrik van den Broek and Jacob Berend Bakema, proposal for Lekkumerend housing in Leeuwarden, Holland, 1962 Full size image\n\nOne of the most widely debated issues in architectural historiography is that of continuity and changes of paradigm which took place after World War II in relation to the revisions of the principles defended by CIAM and the Athens Charter which had begun to emerge during the first post-war period. Of special interest were the debates on the significance of CIAM 8 , held in Hoddesdon in 1951, dedicated to ‘The Heart of the City’ illustrating a renewed attention to public urban space after the rejection and indifference to the streets and plazas of traditional urban fabric which had characterised the former approach of functionalist urbanism (Mumford 2000).\n\nOn the other hand, the counterpoint or the ‘Socialist version’ of the Athens Charter may be found in the document under the title ‘16 Grundsätze des Städtebaus’ (16 Principles of Urbanism) published in 1950, a year before the ‘Heart of the City’ congress was held. This text combined the ideas of functionalist urbanism of the thirties with Stalinist concepts of the Soviet era. Paradoxically, in spite of the principles of the Athens Charter being widely disseminated in the 1950s, the Socialist document partly added to a parallel process of review in the re-examination of traditional urban forms began to gain strength (Monclús and Díez Medina 2016, 4).\n\nIn western Europe, criticism of the CIAM proposals began to grow within the very heart of the organisation itself. Team 10 efforts to overcome the coldness of the models that had marked the beginnings of the CIAM are well known. In the 1960s, structuralist concepts dominated the field of architecture and urbanism. Although structuralism was initially introduced as a scientific method in anthropology and other human sciences, the strong reaction to the excessive radicalism of the ‘functional city’ had given rise to a profound review of its principles at CIAM 10 , held in Dubronovik in 1956. Abandonment of the CIAM spirit in favour of the proposals by Team 10 at the meeting in Otterloo in 1959 began to become evident through rejection of the four functions of the Athens Charter in favour of other more complex visions associated with ‘Urban Re-identification Grid’.Footnote 2\n\nIt is important to bear in mind that the work of Alison and Peter Smithson, including the paradigmatic project for Robin Hood Gardens (1969–72), formed part of a wider movement which included other architects. In this context, a mode of technological urbanism appeared as an alternative to the traditional city, structured around networks of ‘streets in the air’, elevated volumes and spaces, with vehicles travelling at ground level, etc. Nonetheless, it is worthwhile to recall that optimism with respect to technology formed a long tradition, with peaks in periods of accelerated urban growth, as was the case in the 60s and 70s.\n\nAs part of the heated debate on the impact of the Athens Charter, a wave of criticism has addressed urban forms generated by a system of strict zoning —that separates housing from industry and attempts to rationalise transport—which has contributed to disintegration of urban fabric. The negative effects of what was initially a bold effort to create open space have also been recognised. The causes for the loss of ‘urbanity’ are undoubtedly generalised and complex (see Chap. 7)."}, {"url": "https://www.britannica.com/topic/urban-planning", "page_content": "Early history\n\nEvidence of planning has been unearthed in the ruins of cities in China, India, Egypt, Asia Minor, the Mediterranean world, and South and Central America. Early examples of efforts toward planned urban development include orderly street systems that are rectilinear and sometimes radial; division of a city into specialized functional quarters; development of commanding central sites for palaces, temples, and civic buildings; and advanced systems of fortification, water supply, and drainage. Most of the evidence is in smaller cities that were built in comparatively short periods as colonies. Often the central cities of ancient states grew to substantial size before they achieved governments capable of imposing controls.\n\nFor several centuries during the Middle Ages, there was little building of cities in Europe. Eventually towns grew up as centres of church or feudal authority, of marketing or trade. As the urban population grew, the constriction caused by walls and fortifications led to overcrowding, the blocking out of air and light, and very poor sanitation. Certain quarters of the cities, either by custom or fiat, were restricted to different nationalities, classes, or trades, as still occurs in many contemporary cities of the developing world.\n\nThe physical form of medieval and Renaissance towns and cities followed the pattern of the village, spreading along a street or a crossroads in circular patterns or in irregular shapes, though rectangular patterns tended to characterize some of the newer towns. Most streets were little more than footpaths—more a medium for communication than for transportation—and even in major European cities paving was not widely introduced before the 12th century (1184 in Paris, 1235 in Florence, and 1300 in Lübeck). As the population of the city grew, walls were often expanded, but few cities at the time exceeded a mile in length. Sometimes sites were changed, as in Lübeck, and many new cities emerged with increasing population—frequently about one day’s walk apart. Towns ranged in population from several hundred to perhaps 40,000 (as in London in the late 14th century, although London’s population had been as high as 80,000 before the arrival of the Black Death). Paris and Venice were exceptions, reaching 100,000.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nConscious attempts to plan cities reemerged in Europe during the Renaissance. Although these efforts partly aimed at improving circulation and providing military defense, their prime objective was often the glorification of a ruler or a state. From the 16th century to the end of the 18th, many cities were laid out and built with monumental splendour. The result may have pleased and inspired the citizens, but it rarely contributed to their health, to the comfort of their homes, or to efficiency in manufacturing, distribution, and marketing.\n\nThe New World absorbed the planning concepts of European absolutism to only a limited degree. Pierre L’Enfant’s grandiose plan for Washington, D.C. (1791), exemplified this transference, as did later City Beautiful projects, which aimed for grandeur in the siting of public buildings but exhibited less concern for the efficiency of residential, commercial, and industrial development. More influential on the layout of U.S. cities, however, was the rigid grid plan of Philadelphia, designed by William Penn (1682). This plan traveled west with the pioneers, since it was the simplest method of dividing surveyed territory. Although it took no cognizance of topography, it facilitated the development of land markets by establishing standard-sized lots that could be easily bought and sold—even sight unseen.\n\nIn much of the world, city plans were based on the concept of a centrally located public space. The plans differed, however, in their prescriptions for residential development. In the United States the New England town grew around a central commons; initially a pasture, it provided a focus of community life and a site for a meetinghouse, tavern, smithy, and shops and was later reproduced in the central squares of cities and towns throughout the country. Also from the New England town came the tradition of the freestanding single-family house that became the norm for most metropolitan areas. The central plaza, place, or square provided a focal point for European city plans as well. In contrast to American residential development, though, European domestic architecture was dominated by the attached house, while elsewhere in the world the marketplace or bazaar rather than an open space acted as the cynosure of cities. Courtyard-style domiciles characterized the Mediterranean region, while compounds of small houses fenced off from the street formed many African and Asian settlements. (See atrium.)"}, {"url": "https://books.google.com/books/about/The_Modern_Urban_Landscape.html?id=cWLtWKEnq3EC", "page_content": "Why do the cities of the late twentieth century look as they do? What values do their appearance express and enfold? Their sheer scale and the durability of their materials assure that our cities will inform future generations about our era, in the same way that gothic cathedrals and medieval squares tell us something of the Middle Ages. In the meantime, our urban landscapes can tell us much about ourselves.\n\nFor E. C. Relph, the urban landscape must be envisioned as a total environment—not just streets and buildings but billboards and parking meters as well. The Modern Urban Landscape traces the developments since 1880 in architecture, technology, planning, and society that have formed the visual context of daily life. Each of these shaping influences is often viewed in isolation, but Relph surveys the ways in which they have operated independently to create what we see when we walk down a street, shop in a mall, or stare through a windshield on an expressway.\n\nTwo sets of ideas and fashions, Relph argues, have had an especially important impact on urban landscapes in the twentieth century. An \"internationalism\" made possible by new building technologies and more rapid communications has replaced regional style and custom as the dominant feature of city appearance, while a firm belief in the merits of self-consciousness has imposed logical analysis and technical manipulation on such commonplace objects as curbstones and park benches. \"As a result,\" writes Relph, \"the modern urban landscape is both rationalized and artificial, which is another way of saying that it is intensely human.\""}, {"url": "https://press.jhu.edu/books/title/11762/modern-urban-landscape", "page_content": "Why do the cities of the late twentieth century look as they do? What values does their appearance express and enfold? For E. C. Relph, the landscape of late twentieth-century cities must be envisioned as a total environment—not just streets and buildings but billboards and parking meters as well. The Modern Urban Landscape traces the developments since 1880 in architecture, technology, planning, and society that have formed the visual context of daily life. Each of these shaping influences is often viewed in isolation, but Relph surveys the ways in which they have operated independently to...\n\nWhy do the cities of the late twentieth century look as they do? What values does their appearance express and enfold?\n\n\n\nFor E. C. Relph, the landscape of late twentieth-century cities must be envisioned as a total environment—not just streets and buildings but billboards and parking meters as well. The Modern Urban Landscape traces the developments since 1880 in architecture, technology, planning, and society that have formed the visual context of daily life. Each of these shaping influences is often viewed in isolation, but Relph surveys the ways in which they have operated independently to create what we see when we walk down a street, shop in a mall, or stare through a windshield on an expressway.\n\nTwo sets of ideas and fashions, Relph argues, have had an especially important impact on urban landscapes in the twentieth century. An \"internationalism\" made possible by new building technologies and design ideologies has replaced regional style and custom as the dominant feature of city appearance, while a firm belief in the merits of self-consciousness has imposed logical analysis and technical manipulation on such commonplace objects as curbstones and park benches. \"As a result,\" writes Relph, \"the modern urban landscape is both rationalized and artificial, which is another way of saying that it is intensely human.\"\n\nThis edition features a new preface in which the author identifies the major visible changes in urban landscapes over the past thirty years, including destination architecture, coffee shops, condominium towers, revitalized downtown streets, and the creation of edge cities. He also considers the less visible yet pervasive impacts associated with the emergence of electronic technologies and sustainable development."}, {"url": "http://english.cssn.cn/focus/ubanization/202103/t20210302_5314867.shtml", "page_content": "Flexible governance vital to modern urban management\n\nAuthor : CHEN PENG Source : Chinese Social Sciences Today 2021-03-02\n\nCurrently in China, a consensus has gradually been built that modernizing urban governance is a prerequisite for advancing modernization of China’s system and capacity for governance. Urban governance is important because it is both the foundation and a testing ground for modern state governance.\n\nAll behavioral processes are products of specific temporal and spatial environments, so different contexts will normally generate different forms of urban governance. In the new era, it is urgent to explore and harness the flexible governance model in order to effectively raise urban governance levels.\n\nFlexible governance\n\nAs a policy discourse expression, “flexible governance” was first put forward by Chinese Premier Li Keqiang in the 2019 Government Work Report, when Li laid out plans for the new type of urbanization, calling for flexible governance and thoughtfully-designed services to make cities more livable and give them a more inclusive and welcoming feel. Thereafter, flexible governance became a popular phrase and has appeared in various policy texts.\n\nFlexible governance is a new concept relative to traditional urban management. In the past, urban management in China was about extensive, rigid control. The government was the principal regulator, exercising comprehensive and strict control over society with public power. This model did achieve the goal of maintaining stability in the short term, but the long-standing mindset of rigid control significantly weakened the autonomy and ability for society to self-adjust.\n\nIn particular, traditional urban management was prone to blurring the lines between public and private domains, and between public and private spaces in the process of execution. Some executors were impatient and suppressive when handling problems. Obviously, a palliative managerial model such as this cannot solve deep-seated problems, and would instead invite new problems and conflicts.\n\nThis means, the “order-obedience” mandatory model featuring the exclusionary management of public affairs can hardly meet urban governance needs in the new era. In this context, great expectations have been pinned on flexible governance, which has become a practical approach for some local governments.\n\nBased on the practices carried out by some local governments, flexible governance refers to a model in which the government, social organizations, and the public act as governance subjects, adhere to basic philosophies like people-centered principles, equality and independence, and fairness and justice, and adopt non-mandatory approaches such as rational communication and cooperation, to jointly deal with public affairs in urban life.\n\nTherefore, compared with the traditional urban management model, flexible governance aims to build a governance form characterized by the participation, friendly cooperation, and joint governance of diverse subjects. In this new form, the government’s mandatory control gradually wears off, while its role to guide friendly consultation and collaboration reveals itself. Participants are no longer connected through one-dimensional relationships, but through diversified ties of mutually beneficial cooperation and equality-based consultation. Communication is no longer about order and obedience, but about mutual benefits. All in all, flexible governance reflects the rationality of modern urban governance actions and aligns with its intrinsic requirements.\n\nVital to modern cities\n\nWith rapid economic and social modernization, flexible governance can ease problems in modern urban governance.\n\nFirst, it can cement the social foundations of urban governance. Like other behavioral processes, urban governance must be grounded upon a concrete social foundation. Social foundations not only hint at “hard” material conditions, but also include “soft” elements like public trust, support, and cooperation in governance activities.\n\nIt has been proven that positive interactions between the public and diverse subjects like the government, social organizations, and enterprises, will bring about relationships of tacit cooperation and mutual understanding, laying a strong groundwork for urban governance.\n\nFlexible governance exactly contains these factors. As founder of philosophical Taoism Laozi (Lao-tzu) said in the Tao Te Ching, “The softest substance of the world can go through the hardest.” Flexible governance, which balances hardness with softness, not only delivers a people-centered approach in terms of value orientation, but also embodies inherent features of modern urban governance, such as inclusiveness, care, flexibility, and trust.\n\nIt is evident that urban governance embodied with these features is filled with rich social capital. On this basis, people will consciously trust each other and observe rules, thus solidifying the social foundations for urban governance.\n\nFurthermore, flexible governance can create social cohesion. Deeper reforms are accompanied by dramatically changing interest patterns, divided social structures, diversified ideologies, and heterogeneous contradictions and appeals. All these have posed challenges to urban governance as they attempt to build consensuses and take unanimous action.\n\nAs one of its main functions, flexible governance can establish regular social behaviors, coordinate relationships, facilitate agreements, and encourage different subjects to act in concert by non-mandatory means like frank communication, mutual understanding, persuasion, and opinion guidance. This is a part of the process for developing social cohesion. It can unite scattered individuals, strengthen emotional exchanges, and build trust and cooperation among social members. It also inspires diverse subjects to reach agreements on public affairs, more willingly engage in urban governance by cooperating on an equal footing, and make their own contributions.\n\nFlexible governance can also cultivate the government’s authority. The government is central to any forms of governance, so fostering government authority is a key issue for urban governance.\n\nIn Chinese language, “authority” is translated into quanwei. Another phrase “quanli,” which differs from quanwei in only one single character, means power. Despite the etymological link, their meanings are not the same. Power means influence, control, and constraint. It has more apparent “hard” features. By contrast, authority is softer, referring to the ability and prestige to convince the people.\n\nIn other words, authority is a kind of voluntary respect for and support of power. In daily life, people might be forced to submit to power, but their submission to authority is a personal choice. As such, it is often said that any organization will not attain their goals or effectively carry out activities unless they are founded on certain authority.\n\nAt present, as the public increasingly cares about democracy and the rule of law, urban governance has raised a basic requirement to the government: sufficient authority. Flexible governance can enable the government and other subjects like the public and social organizations to interact on the basis of understanding and trust, and guide the public to understand government policies from multiple levels and perspectives, thereby better shaping and constantly consolidating the authority of the government.\n\nFacilitating urban governance\n\nTo make urban governance more flexible, it is essential to take multi-pronged measures in an orderly fashion on the premise of deeply understanding the basics of flexible governance.\n\nFirst, efforts should be made to exploit affective resources for the sake of emotional governance. According to basic psychological theories, emotional engagement will inspire resonance, people will feel profoundly touched, and derive a strong sense of belonging, thus contributing to concerted action.\n\nFlexible governance is distinctive largely in that it values affective interaction to build a bridge for emotional exchange between governors and the governed, cultivating harmonious relationships between the two.\n\nTherefore, the use of affective resources is critical for adherence to flexible governance. In routine governance activities, primary-level governments should connect to, touch, and serve the people sincerely, so as to cement the base for urban governance.\n\nMoreover, people-centered and democratic governance should be implemented. In light of historical materialism, people are the creators of history, and all activities should start from their appeals. Experience has proven that stronger democratic consciousness and more use of democratic strategies will generally lead to better results in urban governance. Hence it is necessary to stick to democratic philosophy and pay attention to equality among major actors in flexible governance. This means, emphasis should be placed on democratic governance in the form of democratic consultation, cooperation, and joint governance.\n\nIn recent years, cities like Nanjing have piloted democratic governance models such as the community consultation center, the “Tell the Whole Truth” workshop, and an association of respected village advisors, which could motivate the public to proactively participate in urban governance.\n\nIn addition, it is crucial to unblock channels for cooperation and implement synergic governance. Modern urban governance necessitates cooperation because the power of any independent subject is limited in the face of complex public affairs. Only by collaborating with other subjects can strong governance synergy be formed.\n\nDuring the implementation of synergic governance, priorities should be given to establishing cooperative relationships between the government and social organizations, the public, and enterprises, and to smoothing diverse channels for collaboration among various subjects to create a networked governance pattern.\n\nChen Peng is a research fellow from the Research Center for Anti-Corruption and Governance at Jiangsu Academy of Social Sciences."}]}