{"Michael Replogle has been a vocal advocate for the use of pricing mechanisms to reduce traffic congestion and air pollution.": [{"url": "https://nyu.academia.edu/MichaelReplogle", "page_content": "Comments on CEQ's NEPA Guidance on Consideration of Greenhouse Gas Emissions and Climate Change , 2022\n\nThis paper discusses why the U.S. White House Council on Environmental Quality should strengthen ...\n\nmore\n\nThis paper discusses why the U.S. White House Council on Environmental Quality should strengthen its guidance about estimating, reporting, and mitigating greenhouse gas (GHG) and climate change. The paper argues that federal transportation agencies have neglected to use their planning authority, project approvals, investments, and grant-making effectively to make significant contributions to reduce GHG emissions. The paper contends that federal agencies have made little progress in restoring healthy environments for communities that bear inequitable and excessive burdens from exposure to transport-related pollution, or in helping to promote more efficient community development patterns to achieve a zero-emission economy.\n\n\n\nThe paper offers ideas to strengthen implementation of the National Environmental Policy Act (NEPA) so that the federal role in transportation planning, development of transportation programs, approval of transportation projects, and federal investments in State and Local transportation actions contribute to solving the climate crisis, while also enhancing the quality-of-life for local communities by:\n\n\n\n1) Focusing transportation agency decisions on the urgent need to reduce total emissions from the transport sector to meet GHG reduction targets set by the U.S. “Nationally Determined Contribution” under the U.N. Framework Convention on Climate Change;\n\n2) Establishing a NEPA framework to ensure that agencies responsible for the design and operation of the nation’s transportation system develop a coherent strategy for achieving national GHG reduction targets;\n\n3) Directing the Federal Highway Administration (FHWA) together with States that prepare NEPA reviews of infrastructure investments to consider the impacts that increased highway capacity has on increasing vehicle miles traveled (VMT) that contributes to the growth in CO2 emissions from on-road vehicles, and creating vehicle-dependent development that creates barriers to a net-zero economy; and\n\n4) Providing clear NEPA criteria that recognize the critical role that transportation decisions played in creating the excessive health burden borne by more than 60 million Americans in frontline communities near heavily trafficked highways, ports, airports, railyards and intermodal facilities, and the need for corrective actions to reverse the injustices of the past to enhance and restore a healthy environment for at-risk communities.\n\n\n\nThe paper provides further examples of these failures and how they could be addressed through better planning procedures."}, {"url": "https://expertprogrammanagement.com/2012/01/pricing-mechanisms/", "page_content": "In a previous article we looked at the different revenue streams available to a company: assets sale, usage fee, subscription fee, lending, licensing, brokerage fees, and advertising. To help achieve maximum revenues different pricing mechanisms can be applied to each of these revenue streams.\n\nA pricing mechanism is a complex way of describing how buyers are matched to sellers through price. Just as there are two broad categories of revenue streams there are two broad categories of pricing mechanisms:\n\nFixed Pricing : here prices are determined in advance of any sales based on zero or more static variables.\n\n: here prices are determined in advance of any sales based on zero or more static variables. Variable Pricing: also know as dynamic pricing. Here the price of goods or services can change based on market conditions.\n\nLet’s now examine some of the more common pricing mechanisms under each of these two broad categories.\n\n1. Fixed Pricing\n\n1.1 Fixed Pricing\n\nHere prices are fixed an non-negotiable, for example, Apple sells all its products to consumers are fixed prices. You cannot walk into an Apple store and negotiate the price.\n\n1.2 Feature Dependent Pricing\n\nWith feature dependent pricing the price changes based on the number of features purchased. For example, purchasing additional premium sports TV channels from a channel provider increases your monthly cost but may bring down your cost per channel.\n\n1.3 Customer Segment Dependent Pricing\n\nHere the cost of goods changes based on the customer segment. For example, Microsoft charges a different price for its Office product for each of the following customer segments: consumer, business, and student. The student pricing is obviously the least expensive, whilst the for-profit business segment is the most expensive. Another example which came to mind whilst using Norton. Norton have different prices and products for individuals, small businesses, and families etc.\n\n1.4 Volume Dependent Pricing\n\nWith volume dependent pricing the price changes depending upon how much is purchased. Typically, the more you purchase the cheaper the price per item. For example, many supermarkets have offers along the lines of “buy 2 get a 3rd free”.\n\n2. Variable Pricing\n\n2.1 Bargaining\n\nBargaining is one of the most ancient ways for humans to conduct an exchange. Here two parties negotiate to achieve an agreed price for the product or service. The price agreed will depend on the relative power and negotiation skills of both parties. The ability to influence is a powerful tool when bargaining.\n\n2.2 Yield Management Pricing\n\nWith yield management we aim to anticipate and influence customer behavior in order to maximise revenue and thus profits. The price will fluctuate according to the inventory available and the time of purchase. A good example of yield management pricing is in the sale of hotel rooms, whereby the price is a function of the number of rooms available in the hotel and also how far in advance of the “stay date” the booking is being made. Yield management pricing is also commonly used within the commercial airline industry.\n\n2.3 Real-time-market Pricing\n\nIn real-time markets the price will change continuously and there is rarely, if ever, time to get involved in lengthy negotiations. The price will change continuously based on ever changing supply and demand. Stock markets are a classic example of real-time-market pricing.\n\n2.4 Auctions\n\nIn auctions the price is determined by the highest bidder for the product or service. In online auctions the bidding period for a particular item will have a fixed deadline, when no further bids can be placed and the winner of the auction becomes known. During the auction all bidders have instant access to see the latest highest bid and can then decide if they wish to increase their bid.\n\nSummary\n\nThere are broadly two types of pricing: fixed and variable. Within these two categories of pricing there are many options available to enable an organization to maximize its revenue as described above. If you multiple the pricing mechanisms by the different revenue streams available then its easy to see that there is a huge array of pricing options available for organizations to choose from.\n\n* Image by lalunablanca"}, {"url": "https://nyc.streetsblog.org/2015/03/27/dot-hires-sustainable-transpo-maven-michael-replogle-to-guide-policy/", "page_content": "Big hiring news from DOT today: Michael Replogle, who founded the Institute for Transportation and Development Policy and went on to tackle transportation issues at the Environmental Defense Fund, has been hired as deputy commissioner for policy at the agency.\n\nDOT's incoming policy director, Michael Replogle. Photo via Transforming Access\n\n“NYC DOT is very excited to have Michael Replogle return to New York to bring his three decades of expertise to New York’s streets in leading our Policy group,” Transportation Commissioner Polly Trottenberg said in a statement. “There are many challenges and ambitious goals ahead of us, and having Michael on the team will help shape our strategy and further define our mission moving forward.”\n\nThe position Replogle will fill has commanded broad influence over the direction of street design and the implementation of major agency programs. Previous DOT policy director Jon Orcutt held the job for seven years, during which he led the agency's strategic planning process, the deployment of Citi Bike, and the development of Vision Zero initiatives, before departing the agency last June.\n\n\"This was simply too amazing an opportunity to miss, and I am honored to work with Commissioner Trottenberg to enact Mayor de Blasio’s vision for safe, equitable, and sustainable transportation,” Replogle said in an statement ITDP sent out this morning.\n\nAdvocates have high expectations for Replogle at DOT.\n\nBefore he became executive director of Transportation Alternatives, Paul Steely White's first job out of graduate school was at ITDP. \"Michael is just one of the giants in the field. There's very few people in the world who have his experience, depth, and breadth on transportation and land use policy,\" White said. \"What he and Polly can do together, the sky's the limit. It's very good news for Vision Zero, for New York taking control of more of its destiny when it comes to transit.\"\n\nTri-State Transportation Campaign Executive Director Veronica Vanterpool said Replogle should make his mark on the city's BRT program. \"ITDP has been a world leader on Bus Rapid Transit and it's great to have that international knowledge brought into the conversation about Bus Rapid Transit in New York City, particularly as DOT embarks on Woodhaven, which is the most ambitious BRT project in the city to date,\" she said.\n\nReplogle returned to ITDP after his time at Environmental Defense, and he was managing director at the organization when it developed the Bus Rapid Transit Standard, a framework for evaluating the quality of BRT systems. New York City's Select Bus Service routes do not meet the scoring threshold to qualify as BRT.\n\nIn addition to his work on Bus Rapid Transit, Replogle has a background in active transportation. \"He really got his start in non-motorized transportation,\" White said. \"He was waving the flag for how important walking and biking were, and ultimately how that integrates with BRT.\"\n\nWhile he has extensive research, policy, and advocacy experience, Replogle's only work inside government was as transportation coordinator for the Maryland National Capital Parks and Planning Commission in Montgomery County, where he worked from 1983 to 1992, according to his LinkedIn profile.\n\nReplogle will begin work at DOT in June and plans to remain on the board of ITDP, the organization said, unless the city's Conflicts of Interest Board directs him to step down.\n\nDOT made a number of other significant personnel changes today:"}, {"url": "https://www.project-syndicate.org/commentary/dangers-of-paper-currency-by-kenneth-rogoff-2016-09", "page_content": "The world is awash in paper currency, with major country central banks pumping out hundreds of billions of dollars’ worth each year, mainly in very large denomination notes such as the $100 bill. And all this cash is facilitating growth mainly in the underground economy, not the legal one.\n\nCAMBRIDGE – The world is awash in paper currency, with major country central banks pumping out hundreds of billions of dollars’ worth each year, mainly in very large denomination notes such as the $100 bill. The $100 bill accounts for almost 80% of the US’s stunning $4,200 per capita cash supply. The ¥10,000 note (about $100) accounts for roughly 90% of Japan’s per capita cash holdings at almost $7,000. And, as I have been arguing for two decades, all this cash is facilitating growth mainly in the underground economy, not the legal one.\n\nI am not advocating a cashless society, which will be neither feasible nor desirable anytime soon. But a less-cash society would be a fairer and safer place.\n\nWith the growth of debit cards, electronic transfers, and mobile payments, the use of cash has long been declining in the legal economy, especially for medium and large-size transactions. Central bank surveys show that only a small percentage of large-denomination notes are being held and used by ordinary people or businesses.\n\nCash facilitates crime because it is anonymous, and big bills are especially problematic because they are so easy to carry and conceal. A million dollars in $100 notes fits into a briefcase, a million dollars in €500 notes (each worth about $565) fits into a purse.\n\nSure, there are plenty of ways to bribe officials, engage in financial crime, and evade taxes without paper currency. But most involve very high transaction costs (for example, uncut diamonds), or risk of detection (say, bank transfers or credit card payments).\n\nYes, new-age crypto-currencies such as Bitcoin, if not completely invulnerable to detection, are almost so. But their value sharply fluctuates, and governments have many tools with which they can restrict their use – for example, by preventing them from being tendered at banks or retail stores. Cash is unique in its liquidity and near-universal acceptance.\n\nSubscribe to PS Digital now to read all the latest insights from Kenneth Rogoff.\n\n\n\nDigital subscribers enjoy access to every PS commentary, including those by Kenneth Rogoff, plus our entire On Point suite of subscriber-exclusive content, including Longer Reads, Insider Interviews, Big Picture/Big Question, and Say More. For a limited time, save $15 with the code ROGOFF15. Subscribe Now\n\nThe costs of tax evasion alone are staggering, perhaps $700 billion per year in the United States (including federal, state, and local taxes), and even more in high-tax Europe. Crime and corruption, though difficult to quantify, almost surely generate even greater costs. Think not just of illegal drugs and racketeering, but also of human trafficking, terrorism, and extortion.\n\nMoreover, cash payments by employers to undocumented workers are a principal driver of illegal immigration. Scaling back the use of cash is a far more humane way to limit immigration than building barbed-wire fences.\n\nIf governments were not so drunk from the profits they make by printing paper currency, they might wake up to the costs. There has been a little movement of late. The European Central Bank recently announced that it will phase out its €500 mega-note. Still, this long overdue change was implemented against enormous resistance from cash-loving Germany and Austria. Yet even in northern Europe, reported per capita holdings of currency are still quite modest relative to the massive outstanding supply in the eurozone as a whole (over €3,000 per capita).\n\nSouthern European governments, desperate to raise tax revenue, have been taking matters into their own hands, even though they do not control note issuance. For example, Greece and Italy have been trying to discourage cash use by capping retail cash purchases (at €1,500 and €1,000, respectively).\n\nObviously, cash remains important for small everyday transactions, and for protecting privacy. Northern European central bankers who favor the status quo like to quote Russian novelist Fyodor Dostoevsky: “Money is coined liberty.” Of course, Dostoevsky was referring to life in a mid-nineteenth century czarist prison, not a modern liberal state. Still, the northern Europeans have a point. The question is whether the current system has the balance right. I would argue that it clearly does not.\n\nA plan for reining in paper currency should be guided by three principles. First, it is important to allow ordinary citizens to continue using cash for convenience and to make reasonable-size anonymous purchases, while undermining the business models of those engaged in large, repeated anonymous transactions on a wholesale level. Second, any plan should move very gradually (think a decade or two), to allow adaptations and mid-course corrections as unexpected problems arise. And, third, reforms must be sensitive to the needs of low-income households, especially those that are unbanked.\n\nIn my new book, The Curse of Cash, I offer a plan that involves very gradually phasing out large notes, while leaving small notes ($10 and below) in circulation indefinitely. The plan provides for financial inclusion by offering low-income households free debit accounts, which could also be used to make government transfer payments. This last step is one that some countries, such as Denmark and Sweden, have already taken.\n\nScaling back paper currency would hardly end crime and tax evasion; but it would force the underground economy to employ riskier and less liquid payment devices. Cash may seem like a small, unimportant thing in today’s high-tech financial world, but the benefits of phasing out most paper currency are a lot larger than you might think."}, {"url": "https://ops.fhwa.dot.gov/publications/congestionpricing/sec2.htm", "page_content": "II. WHAT IS CONGESTION PRICING?\n\nCongestion pricing - sometimes called value pricing - is a way of harnessing the power of the market to reduce the waste associated with traffic congestion. Congestion pricing works by shifting purely discretionary rush hour highway travel to other transportation modes or to off-peak periods, taking advantage of the fact that the majority of rush hour drivers on a typical urban highway are not commuters. By removing a fraction (even as small as 5%) of the vehicles from a congested roadway, pricing enables the system to flow much more efficiently, allowing more cars to move through the same physical space. Similar variable charges have been successfully utilized in other industries - for example, airline tickets, cell phone rates, and electricity rates. There is a consensus among economists that congestion pricing represents the single most viable and sustainable approach to reducing traffic congestion.\n\nAlthough drivers unfamiliar with the concept initially have questions and concerns, surveys show that drivers more experienced with congestion pricing support it because it offers them a reliable trip time, which is very valuable especially when they have to be somewhere on time. Transit and ridesharing advocates appreciate the ability of congestion pricing to generate both funding and incentives to make transit and ridesharing more attractive.\n\nThere are four main types of pricing strategies, each of which is discussed in more detail later in this section:\n\n\n\nEffects of Pricing on Vehicle Throughput Vehicle \"throughput\" on a freeway is the number of vehicles that get through over a short period such as an hour. Once freeway traffic exceeds a certain threshold level, both vehicle speed and vehicle throughput drop precipitously. Data show that maximum vehicle throughput occurs at free flow speeds ranging from 45 mph to 65 mph. The number of vehicles that get through per hour can drop by as much as 50 percent when severe congestion sets in. At high traffic levels, the freeway is kept in this condition of \"collapse\" for several hours after the rush of commuters has stopped. This causes further unnecessary delay for off-peak motorists who arrive after rush hour. With peak-period highway pricing, a variable toll dissuades some motorists from entering freeways at those access points where traffic demand is high, and where such surges in demand may push the freeway over the critical threshold at which traffic flow collapses. Pricing prevents a breakdown of traffic flow in the first instance, and thus maintains a high level of vehicle throughput throughout the rush hours. As shown in the graph above, each variably priced lane in the median of State Route 91 in Orange County, California, carries twice as many vehicles per lane as the free lanes during the hour with heaviest traffic. Pricing has allowed twice as many vehicles to be served per lane at three to four times the speed on the free lanes.\n\nVariably priced lanes , involving variable tolls on separated lanes within a highway, such as Express Toll Lanes or HOT Lanes, i.e. High Occupancy Toll lanes\n\n, involving variable tolls on separated lanes within a highway, such as Express Toll Lanes or HOT Lanes, i.e. High Occupancy Toll lanes Variable tolls on entire roadways - both on toll roads and bridges, as well as on existing toll-free facilities during rush hours\n\n- both on toll roads and bridges, as well as on existing toll-free facilities during rush hours Cordon charges - either variable or fixed charges to drive within or into a congested area within a city\n\n- either variable or fixed charges to drive within or into a congested area within a city Area-wide charges - per-mile charges on all roads within an area that may vary by level of congestion\n\nTechnology for Congestion Pricing\n\nWith congestion pricing, tolls typically vary by time of day and are collected at highway speeds using electronic toll collection technology. Traffic flows freely, and there are no toll booths. Vehicles are equipped with electronic devices called transponders or \"tags\", which are read by overhead antennas. Toll rates for different time periods may be set in advance, or they may be set \"dynamically\" - that is, they may be increased or decreased every few minutes to ensure that the lanes are fully utilized without a breakdown in traffic flow.\n\nTags range from simple to highly sophisticated devices. Simple tags are \"read-only,\" meaning that they can provide an identification number to overhead readers using power from incoming radio frequency energy. More sophisticated tags are battery-powered, and have processing power and memory. Tags are now the normal way tolls are collected from regular users - 70 to 80 percent of tolls are now collected this way on most urban commuter toll roads in peak hours. Simple \"sticker\" tags may be obtained for less than $10.\n\nGlobal Positioning Systems (GPS) are used to collect truck tolls in Germany on the autobahns. In tests of such systems in the United States, an in-vehicle device records charges incurred based on its location as identified by the GPS unit in the vehicle. All location and payment information remains in the vehicle, and the vehicle owner periodically uploads the summary of charges to a processing center along with payments. The costs of such systems are currently high - as much as $500 per vehicle in Germany. Their high costs can be justified by additional services provided by the systems, such as in-vehicle navigation and commercial fleet management. Also, the need for roadside equipment for toll collection is reduced.\n\nCameras are an essential complement to tags and GPS units to gain a record of the identity of vehicles that don't have a working tag or GPS unit. Cameras can be used to deter toll violators. This is known as \"video enforcement.\" In cases where a tag is required for use of a facility, camera images allow a follow-up of violators and imposition of a penalty.\n\nUse of a toll facility may be permitted without a tag or GPS unit. In this case, a camera-based system is used to collect what is termed a video toll. This toll includes the additional costs for administration. Cameras are being improved steadily in their capabilities and some believe that very soon toll operators could rely entirely on video tolling.\n\nFlat tolls, \"stepped\" variable tolls, and \"dynamic\" tolls The first roads in the United States and in many other countries were toll roads. In these cases, toll rates were fixed at a flat rate, since their purpose was to raise revenue, not to manage demand. If tolls are to be used to manage demand, they must vary by the level of demand. They may be set in advance by time of day, based on traffic volumes observed - during the past week, month, or quarter. In each case, the toll schedule may appear as a \"stepped\" form, as shown below. Tolls to manage demand may also be set \"dynamically.\" Under this approach, a maximum toll rate may be specified in advance for selected time periods (see schedule for I-15 HOT lanes shown below), but actual tolls typically vary below the maximum based on real-time traffic observed on the facility. While a driver knows the maximum rate that can be charged, actual rates (which are generally lower) are known to him or her only a few minutes in advance of approaching the priced facility. The driver can then choose to use the priced facility or continue to use toll-free facilities.\n\n\n\nVariably Priced Lanes\n\nVariably priced lanes include Express Toll lanes and HOT lanes. \"HOT\" is the acronym for \"High Occupancy Toll.\" On HOT lanes, low occupancy vehicles are charged a toll, while High Occupancy Vehicles (HOVs), public transit buses and emergency vehicles are allowed to use the lanes free of charge or at reduced rates. HOT lanes create an additional category of eligibility to use HOV lanes. People can meet the minimum vehicle passenger requirement - or they can choose to pay a toll to gain access to the HOV lane.\n\nWith citizens growing more frustrated with under-used HOV lanes, HOT lanes are increasingly being viewed as a solution that can reduce public opposition to HOV lanes. Surveys show that low-income commuters express a high level of support for having a priced express lane option. This is valuable when they absolutely must get somewhere on time. In places like San Diego, support from low-income travelers is over 70 percent. Low-income commuters also benefit from toll-financed transit improvements.\n\nExpress Toll lanes are similar to HOT lanes. The difference is that all vehicles are required to pay a toll - HOVs do not get free service. This makes enforcement of toll-cheaters much easier. However, many travelers still have an incentive to carpool. By sharing the ride, each person in a two-person carpool pays only half the price, while each commuter in a four-person carpool only pays one-fourth.\n\nVariable Tolls on Roadways\n\nWith this type of pricing, flat toll rates on existing toll roads are changed to a variable toll schedule so that the toll is higher during peak travel hours and lower during off-peak or shoulder hours. This encourages motorists to use the roadway during less congested periods, and allows traffic to flow more freely during peak times. Peak toll rates may be high enough to guarantee that traffic flow will not break down, thus offering motorists a reliable and congestion-free trip in exchange for the higher peak toll.\n\nVariable tolls can also be introduced on existing toll-free facilities to manage traffic flow. Again, tolls vary by time of day and are charged only on congested highway segments to manage traffic flow and recover the highway's capacity to carry the number of vehicles it was designed for. The most efficient way to operate our freeways is to prevent congestion and keep traffic moving freely. When traffic flow collapses under congested conditions, capacity is lost (see box at right). By preventing congestion, pricing recovers this daily waste of public investment that occurs on congested highways.\n\nReal life examples show the impacts of pricing. In Ft. Myers, Florida, a 50 percent discount on the toll was offered on the Midpoint and Cape Coral bridges for a short period of time before and after the rush hours. Survey data revealed that, among those eligible for the discount, there was an increase in traffic of as much as 20 percent during the discount period before the morning rush hours, with corresponding drops in the rush hour itself.\n\nCordon Pricing\n\nCordon pricing involves charging a fee to enter or drive within a congested area, usually a city center. Singapore introduced the first such pricing scheme in 1975 using low-tech daily charges. In 1998, the city shifted to a fully automated electronic charging system. In 2003, a cordon pricing scheme was introduced in central London. A similar scheme functioned in central Stockholm on a trial basis in 2006 from January through July.\n\nArea-wide Pricing\n\nThe State of Oregon is currently testing a pricing scheme involving per-mile charges, which it will consider using as a replacement for fuel taxes in the future. A congestion pricing component is being tested, with higher charges during congested periods on high traffic road segments. The Puget Sound Regional Council has been testing the travel behavior impacts of a similar charging system in the Seattle metropolitan area during 2005-2006. Charges are based on the type of facility being used and its level of congestion.\n\nUse of Revenues from Pricing\n\nCongestion pricing can generate substantial revenues from tolls. A portion of the revenues generated will be needed to operate the toll collection and traffic management systems. Net revenues after payment of operating costs can be used to pay for expansion of roadway facilities, to support alternatives to driving alone such as public transit, to address impacts on low-income individuals by providing toll discounts or credits, or to reduce other taxes that motorists pay for highways such as fuel taxes, vehicle registration fees or sales taxes."}, {"url": "https://www.itdp.org/presenter/michael-replogle/", "page_content": "Michael Replogle\n\nDeputy Commissioner for Policy, New York City Department of Transportation\n\nMichael Replogle, a globally recognized expert on sustainable transportation, was appointed in 2015 as Deputy Commissioner for Policy for New York City’s Department of Transportation, where he is chief strategy advisor. He shapes the City’s Vision Zero initiatives, which have cut road traffic deaths by 25% in 5 years, and the City’s bike share system, largest in the Americas, along with City policies regarding freight and curb management, for-hire vehicles, vehicle electrification, autonomous vehicles, road pricing, regional and federal transportation, and COVID-19 recovery. He led development of the 2016 NYC DOT 5-year Strategic Plan, and agency contributions to New York City’s climate action plan and OneNYC 2050 plan.\n\nReplogle co-founded Bikes Not Bombs in 1984 and led its successful effort to ship 10,000 recycled bikes to teachers and health workers in Nicaragua. In 1985, Replogle co-founded the Institute for Transportation and Development Policy (ITDP), and served as its President for more than 20 years, and later as its Managing Director for Policy. He co-founded the Partnership on Sustainable Low Carbon Transportation (SLoCaT) and served as its first board chairman. His efforts helped secured a 2012 $175 billion 10-year commitment for more sustainable transportation from the 8 largest multilateral development banks. For 17 years, Replogle was Transportation Director for the Environmental Defense Fund, promoting transportation policy reforms to improve air quality and public health in the U.S. and abroad. He guided growth management policies for Montgomery County, Maryland, from 1982-91. He holds honors degrees in civil and urban engineering and sociology from the University of Pennsylvania."}, {"url": "https://www.humanrightscareers.com/issues/artists-using-music-to-promote-human-rights/", "page_content": "As a universal language that transcends cultural barriers, music is a medium where people and artists alike can have their voices heard in a manner that words alone cannot. Music has often been used to foreground pressing political and societal issues, including the promotion and protection of human rights. These 15 artists have used their musical talent and platform to share awareness of human rights issues across the world and bring a voice to marginalized members of society.\n\nPete Townshend\n\nPete Townshend is an English musician, songwriter and vocalist of “the Who” rock band, one of the most influential rock ensembles during the 1960s and 1970s. Alongside his career in the rock music industry, Townshend has a long history of charity and philanthropic work for human rights issues, advocating for greater drug rehabilitation and activism for children’s rights. In 1979, Townshend was the first musician to perform for Amnesty International’s Human Rights Concerts and inspired other renowned rock musicians to support the human rights cause. Townshend is quoted saying, “Amnesty does things that I can’t do in my work. It deals with the specifics of injustice… It makes them public. It was 1979 that I appeared at ‘The Secret Policeman’s Ball’… It was amazing subsequently to see what ‘The Secret Policeman’s Ball’ triggered. Quite big names got involved in supporting Amnesty. And it became apparent that big names in music and Amnesty melded very well. It’s good to see that what I did kicked that off…”\n\nSting\n\nPerforming under the stage name, “Sting”, Gordon Sumner is a Grammy-Award winning guitarist, vocalist and songwriter who is renowned for his work as both a solo musician and an ensemble musician with the rock band “the Police” between 1977 – 1984. Sting is heavily involved in human rights activism, having written songs inspired by his concern for world hunger and oppressive political regimes, and has also extended his activism beyond music by writing an open letter for the decriminalization of drug possession in the United Kingdom in 2011. He has also signed several petitions against the death penalty in Belarus and has cancelled concerts in response to human rights issues in several countries. Sting’s humanitarian activism has been recognized by Amnesty International and he has performed for the NGO’s Human Rights Concerts on several occasions.\n\nBono\n\nDescribed as the world’s best known philanthropic performers and most politically effective celebrity of all time by the National Journal, Bono (Paul Hewson) has worked extensively as a rock musician in the band U2, a philanthropist and human rights activist. Focusing much of his efforts into advocating the fight against AIDS and extreme poverty in Africa, Bono has lobbied governmental entities to adopt human rights-based policies under his positions as the co-founder of ONE, a global movement campaigning to end extreme poverty. More recently, Bono raised awareness of vaccination against COVID-19 and vaccine inequality around the world and in April 2022, Bono recorded an acoustic rendition of “Walk On” by his band, U2, for the Global Citizen’s Stand Up for Ukraine livestream, urging global leaders to support Ukrainian refugees. Bono was also invited by Ukrainian president Volodymyr Zelenskyy to perform in a metro station in Kyiv, showing his solidarity to Ukraine under invasion from Russia.\n\nPeter Gabriel\n\nRising to fame as the lead singer of the rock band Genesis, Peter Gabriel has been an active rock musician, singer and producer whose music has been awarded nine MTV awards, Brit Awards and Grammy Awards throughout his musical career. Aside from his musical accomplishments, Gabriel is the co-founder of WITNESS, a human rights non-profit organization that supports local organizations document human rights issues and advocacy. In recognition of his humanitarian work, Gabriel was awarded a Nobel Peace Prize in 2006 and was named as one of the most influential people in the world in 2008 by Time Magazine.\n\nAngélique Kidjo\n\nAwarded “The Ambassador of Conscience Award” by Amnesty International in 2016, Angélique Kidjo is a Beninese singer-songwriter renowned for her creative music videos and unique musical style that integrates Afropop, Congolese rumba, jazz and Latin music genres. Within her 30-year musical career, Kidjo has been a prominent advocate for the expression of freedom, the education of girls in Africa and has expressed concerns regarding female genital mutilation and has worked as a UNICEF Goodwill Ambassador since 2002. Alongside her major ambassador roles, Kidjo is the founder of The Batonga Foundation, a non-profit organization that empowers women in Benin and upskills these women for socio-economic mobility.\n\nLang Lang\n\nDescribed as one of the most exciting and accomplished classical musicians in the world, classical pianist Lang Lang has not only revolutionized the classical music industry but has also used his music as a way to advocate for human rights globally. Appointed as a UNICEF Goodwill Ambassador and a Messenger of Peace, Lang Lang primarily advocates for children’s rights and access to education through concerts that raise funds for UNICEF and other humanitarian crises.\n\nBuffy Sainte-Marie\n\nAs an Indigenous Canadian singer-song writer and composer, Buffy Sainte-Marie’s music primarily revolves around the issues faced by the Indigenous peoples of Canada and the United States. Buffy began her advocacy efforts for the protection of Indigenous artists, performers and their intellectual property by establishing the Nihewan Foundation for Native American Education in 1966 and has moved on to founding The Creative Native Project, an initiative which seeks to empower Indigenous youth in the performing arts. More recently, Buffy was awarded the Allan Slaight Humanitarian Spirit Award and was invited to the Canadian Music Week in 2020.\n\nMaxim Vengerov\n\nHailed as one of the most talented violinists in the 21st century, Maxim Vengerov was the first classical musician to be appointed as a UNICEF Goodwill Ambassador in 1997. Alongside his musical accomplishments, Vengerov has focused much of his advocacy on the promotion of children’s education and rights and has visited countries such as Turkey, Uganda and Bosnia and Herzegovina representing UNICEF. Vengerov has also performed at #EndViolence events in Bucharest, Romania for UNICEF Romania.\n\nBruce Springsteen\n\nBruce Springsteen is an American singer-song writer, known as one of the original founders of the heartland rock genre, which combines elements of mainstream rock music with narratives of the American working class. Throughout his musical career, Springsteen has been a long advocate for LGBT rights, the empowerment of women and democracy, using his international platform to raise awareness of social issues. Springsteen was first invited to perform for Amnesty International in 1988 and has since continued his advocacy of human rights through his music.\n\nNadya Tolokonnikova\n\nAs the leader of the Russian feminist punk band Pussy Riot, Nadya Tolokonnikova uses her musical platform to spread awareness of human rights issues through her music. As a passionate feminist, Tolokonnikova delved into themes of sexism and rape culture in her newest EP, Panic Attack, and has agreed to donate a portion of the proceeds from her EP to a shelter for domestic violence in Russia. Tolokonnikova herself was recognized by a political prisoner by the Union of Solidarity with Political Prisoners and Amnesty International described her as a “prisoner of conscience” due to the “severity of the response of Russian authorities.”\n\nPiera Van de Wiel\n\nPiera Van de Wiel is a British singer and composer who uses her music as a platform for her human rights advocacy. During the COVID-19 pandemic, Van de Wiel released a single, “Used”, to raise awareness of the increase in domestic violence and abuse against women during the pandemic with the support of the United Nations Spotlight Initiative. Alongside her musical pursuits, Van de Wiel is the founder of the non-profit organization, Stronger With Music, a movement that works towards achieving the UN Sustainable Development Goals.\n\nEvan Greer\n\nEvan Greer is a trans/genderqueer artist based in Boston who composes acoustic songs that advocate technological security, LGBTQ rights and movements for justice and liberation. Alongside their musical accomplishments, Greer is the founder of a non-profit organization called Fight for the Future, which aims to secure digital rights and banning unethical technological practices.\n\nMax Richter\n\nGerman-British composer and pianist Max Richter is one of the most prominent composers of the 21st century, boasting over a billion streams of his music and a million album sales throughout his 25-year musical career. Richter has previously responded to the Iraq War, the 2005 London terrorist attacks and the Kosovo War through his music and his most recent album, “Voices” takes inspiration from the United Nations Declaration of Human Rights. All ten of the tracks (except for the final song) incorporate text from the 1948 UNDHR document and Richter himself has stated that the album is a response to the human rights abuses around the world and the need for social justice and equality of humans around the world.\n\nHans Zimmer\n\nComposer of award-winning films such as The Dark Night, The Lion King and The Rock, Hollywood composer Hans Zimmer has established himself as one of the most eminent film composers in history. Zimmer was invited to compose an anthem to celebrate Amnesty International’s 50th anniversary, titled “One More Voice for Freedom” in commemoration for International Human Rights Day. Zimmer himself is quoted saying “it was a privilege to create this piece of music for a cause which is so close to our hearts” and that it is my “hope that the anthem will inspire people to support Amnesty’s vision of a world where fundamental rights are protected for everyone. We should all join Amnesty in standing up for justice, freedom and human rights”.\n\nAlicia Keys\n\nDubbed as the “Queen of R&B”, American singer-song writer Alicia Keys has intertwined her passion for music with human rights activism through her extensive philanthropic work in her musical career. Keys is the co-founder of the non-profit organization, Keep a Child Alive, that provides treatment and social support to children and families affected by HIV in Africa and India. As part of her work in Keep a Child Alive, Keys host an annual fundraising gala called the Black Ball, where she invites major musical artists to perform at the event to raise funds for HIV and AIDS activism."}, {"url": "https://nyc.streetsblog.org/2015/03/27/dot-hires-sustainable-transpo-maven-michael-replogle-to-guide-policy/", "page_content": "Big hiring news from DOT today: Michael Replogle, who founded the Institute for Transportation and Development Policy and went on to tackle transportation issues at the Environmental Defense Fund, has been hired as deputy commissioner for policy at the agency.\n\nDOT's incoming policy director, Michael Replogle. Photo via Transforming Access\n\n“NYC DOT is very excited to have Michael Replogle return to New York to bring his three decades of expertise to New York’s streets in leading our Policy group,” Transportation Commissioner Polly Trottenberg said in a statement. “There are many challenges and ambitious goals ahead of us, and having Michael on the team will help shape our strategy and further define our mission moving forward.”\n\nThe position Replogle will fill has commanded broad influence over the direction of street design and the implementation of major agency programs. Previous DOT policy director Jon Orcutt held the job for seven years, during which he led the agency's strategic planning process, the deployment of Citi Bike, and the development of Vision Zero initiatives, before departing the agency last June.\n\n\"This was simply too amazing an opportunity to miss, and I am honored to work with Commissioner Trottenberg to enact Mayor de Blasio’s vision for safe, equitable, and sustainable transportation,” Replogle said in an statement ITDP sent out this morning.\n\nAdvocates have high expectations for Replogle at DOT.\n\nBefore he became executive director of Transportation Alternatives, Paul Steely White's first job out of graduate school was at ITDP. \"Michael is just one of the giants in the field. There's very few people in the world who have his experience, depth, and breadth on transportation and land use policy,\" White said. \"What he and Polly can do together, the sky's the limit. It's very good news for Vision Zero, for New York taking control of more of its destiny when it comes to transit.\"\n\nTri-State Transportation Campaign Executive Director Veronica Vanterpool said Replogle should make his mark on the city's BRT program. \"ITDP has been a world leader on Bus Rapid Transit and it's great to have that international knowledge brought into the conversation about Bus Rapid Transit in New York City, particularly as DOT embarks on Woodhaven, which is the most ambitious BRT project in the city to date,\" she said.\n\nReplogle returned to ITDP after his time at Environmental Defense, and he was managing director at the organization when it developed the Bus Rapid Transit Standard, a framework for evaluating the quality of BRT systems. New York City's Select Bus Service routes do not meet the scoring threshold to qualify as BRT.\n\nIn addition to his work on Bus Rapid Transit, Replogle has a background in active transportation. \"He really got his start in non-motorized transportation,\" White said. \"He was waving the flag for how important walking and biking were, and ultimately how that integrates with BRT.\"\n\nWhile he has extensive research, policy, and advocacy experience, Replogle's only work inside government was as transportation coordinator for the Maryland National Capital Parks and Planning Commission in Montgomery County, where he worked from 1983 to 1992, according to his LinkedIn profile.\n\nReplogle will begin work at DOT in June and plans to remain on the board of ITDP, the organization said, unless the city's Conflicts of Interest Board directs him to step down.\n\nDOT made a number of other significant personnel changes today:"}, {"url": "https://expertprogrammanagement.com/2012/01/pricing-mechanisms/", "page_content": "In a previous article we looked at the different revenue streams available to a company: assets sale, usage fee, subscription fee, lending, licensing, brokerage fees, and advertising. To help achieve maximum revenues different pricing mechanisms can be applied to each of these revenue streams.\n\nA pricing mechanism is a complex way of describing how buyers are matched to sellers through price. Just as there are two broad categories of revenue streams there are two broad categories of pricing mechanisms:\n\nFixed Pricing : here prices are determined in advance of any sales based on zero or more static variables.\n\n: here prices are determined in advance of any sales based on zero or more static variables. Variable Pricing: also know as dynamic pricing. Here the price of goods or services can change based on market conditions.\n\nLet’s now examine some of the more common pricing mechanisms under each of these two broad categories.\n\n1. Fixed Pricing\n\n1.1 Fixed Pricing\n\nHere prices are fixed an non-negotiable, for example, Apple sells all its products to consumers are fixed prices. You cannot walk into an Apple store and negotiate the price.\n\n1.2 Feature Dependent Pricing\n\nWith feature dependent pricing the price changes based on the number of features purchased. For example, purchasing additional premium sports TV channels from a channel provider increases your monthly cost but may bring down your cost per channel.\n\n1.3 Customer Segment Dependent Pricing\n\nHere the cost of goods changes based on the customer segment. For example, Microsoft charges a different price for its Office product for each of the following customer segments: consumer, business, and student. The student pricing is obviously the least expensive, whilst the for-profit business segment is the most expensive. Another example which came to mind whilst using Norton. Norton have different prices and products for individuals, small businesses, and families etc.\n\n1.4 Volume Dependent Pricing\n\nWith volume dependent pricing the price changes depending upon how much is purchased. Typically, the more you purchase the cheaper the price per item. For example, many supermarkets have offers along the lines of “buy 2 get a 3rd free”.\n\n2. Variable Pricing\n\n2.1 Bargaining\n\nBargaining is one of the most ancient ways for humans to conduct an exchange. Here two parties negotiate to achieve an agreed price for the product or service. The price agreed will depend on the relative power and negotiation skills of both parties. The ability to influence is a powerful tool when bargaining.\n\n2.2 Yield Management Pricing\n\nWith yield management we aim to anticipate and influence customer behavior in order to maximise revenue and thus profits. The price will fluctuate according to the inventory available and the time of purchase. A good example of yield management pricing is in the sale of hotel rooms, whereby the price is a function of the number of rooms available in the hotel and also how far in advance of the “stay date” the booking is being made. Yield management pricing is also commonly used within the commercial airline industry.\n\n2.3 Real-time-market Pricing\n\nIn real-time markets the price will change continuously and there is rarely, if ever, time to get involved in lengthy negotiations. The price will change continuously based on ever changing supply and demand. Stock markets are a classic example of real-time-market pricing.\n\n2.4 Auctions\n\nIn auctions the price is determined by the highest bidder for the product or service. In online auctions the bidding period for a particular item will have a fixed deadline, when no further bids can be placed and the winner of the auction becomes known. During the auction all bidders have instant access to see the latest highest bid and can then decide if they wish to increase their bid.\n\nSummary\n\nThere are broadly two types of pricing: fixed and variable. Within these two categories of pricing there are many options available to enable an organization to maximize its revenue as described above. If you multiple the pricing mechanisms by the different revenue streams available then its easy to see that there is a huge array of pricing options available for organizations to choose from.\n\n* Image by lalunablanca"}, {"url": "https://variety.com/2022/music/news/rap-lyrics-cant-be-used-evidence-newsom-california-new-bill-1235389803/", "page_content": "In a big win for creative expression, Gov. Gavin Newsom signed The Decriminalizing Artistic Expression Act, which restricts the use of rap lyrics as evidence in court in California.\n\nIn August, the Calif. Senate and Assembly unanimously approved the bill, AB 2799. Speaking to the importance of the legislation at a virtual bill signing ceremony were rap artists Killer Mike, Meek Mill, Too $hort, Ty Dolla $ign, YG, E-40 and Tyga, as well as CEO of the Recording Academy Harvey Mason Jr. Leaders from the Black Music Action Coalition and Songwriters of North America also joined the signing ceremony.\n\nIn a press release, the Black Music Action Coalition called the bill a “crucial step in the right direction” of not injecting racial bias into court proceedings, especially given the recent indictment of Young Thug and Gunna, whose lyrics were directly quoted and used against them in an ongoing RICO trial.\n\n“For too long, prosecutors in California have used rap lyrics as a convenient way to inject racial bias and confusion into the criminal justice process,” said Dina LaPolt, entertainment attorney and co-founder of Songwriters of North America. “This legislation sets up important guardrails that will help courts hold prosecutors accountable and prevent them from criminalizing Black and Brown artistic expression. Thank you, Gov. Newsom, for setting the standard. We hope Congress will pass similar legislation, as this is a nationwide problem.”\n\nWillie “Prophet” Stiggers, co-founder and co-chair of Black Music Action Coalition, added: “The signing of AB 2799 (The Decriminalizing Artistic Expression Act) into California law is a huge victory for the artistic and creative community, and a big step in the right direction towards our federal legislation – The RAP Act (Restorating Artistic Protection Act) – preventing the use of lyrics as the sole basis to prosecute cases. The Black Music Action Coalition applauds Governor Newsom for his willingness to stand with Artists and defend our First Amendment right to freedom of speech.”\n\nFurther advocating for legislation in the form of a Federal bill — the Restoring Artistic Protection or RAP Act, introduced in the House this summer — Rep. Hank Johnson (Georgia) and Rep. Jamaal Bowman (New York) took the stage at the RIAA offices in Washington DC on Sept. 29 ahead of a panel discussion on “Rap and the Rules of Evidence.” Moderated by Variety executive editor Shirley Halperin, the panel featured Stiggers and LaPolt along with Kevin Liles, CEO of 300 Elektra Entertainment, Prof. Jack Lerner of the University of Irvine School of Law and Attorney Shay Lawson, Esq., SONA Board member and outside counsel to BMAC, and advocacy chair of the Atlanta branch of the Recording Academy. The wide-ranging discussion addressed the dangers to the constitutional rights of free speech and to a fair trial. Liles, who testified on behalf of jailed rap artists Young Thug and Gunna during their bond hearings, connected what’s happening today to decades of systemic racism that disadvantages Black men.\n\nCourtesy of RIAA\n\nSpeaking to Variety in May, LaPolt said the use of Young Thug’s lyrics as evidence against him in court is “unprecedented racism.” Legal expert Jack Lerner pointed out the judicial system’s hypocritical focus on hip-hop as a genre, and added that this process “could really affect the way people make music.”\n\nRep. Johnson credits LaPolt with bringing the matter to his attention. “I saw the possibilities of it, but I was unaware of the scope of the problem that then existed,” he tells Variety, referring to his first conversations with the attorney about her client 21 Savage. The Atlanta rapper, who was born in the U.K., was taken into custody by U.S. Immigration and Customs Enforcement (ICE) in 2019, days after performing a song on “The Tonight Show With Jimmy Fallon” that was critical of U.S. immigration policies. “We started talking about the need for some federal legislation,” Johnson continues, “and fast forward a few years and we get to actually drafting the RAP act and introducing it at a time when the Fulton County prosecutor was bringing charges against Young Thug and Gunna based, in part, on their lyrics. … I’ve always prided myself as a politician and elected official with having a sense of timing about things, and it just so happened that the time was now and this issue was ready to explode on the national scene.”\n\nRead reactions to the new law below:\n\nHarvey Mason jr., CEO of the Recording Academy: “Today we celebrate an important victory for music creators in the state of California. Silencing any genre or form of artistic expression is a violation against all music people. The history that’s been made in California today will help pave the way forward in the fight to protect creative freedom nationwide. We extend our gratitude to Assemblymember Jones-Sawyer for his leadership on this issue and to Governor Newsom for recognizing the importance of protecting artistry and signing the Decriminalizing Artistic Expression Act into law.”\n\nMitch Glazer, RIAA Chairman & CEO: “Today we applaud Governor Newsom on this pivotal decision that will allow all creators to express themselves and follow their artistic vision without barriers of prejudice! The RIAA has been a vocal advocate for AB 2799 because all too often rap and hip-hop artists have suffered for the same kind of hyperbole and imagery other genres routinely use without consequence. With the signing of the California rap lyrics bill into law, voices that may have been stifled are now fully open to expression.”\n\nAdditional reporting by Shirley Halperin."}]}