{"Billy Burke was the first American to win the British Amateur in 1930.": [{"url": "https://www.wikiwand.com/en/Billy_Burke_(golfer)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Billy Burke (golfer)?\n\nSummarize this article for a 10 years old"}, {"url": "https://golfweek.usatoday.com/2011/06/11/2011-us-open-epic-battle-31/", "page_content": "Myths along the way may have suggested George Von Elm and Billy Burke died from exhaustion.\n\nNot so.\n\n<!—->\n\nTruth is, lung cancer got Von Elm in 1961, and Burke died in 1972 after a long illness. But decades earlier at a U.S. Open at Inverness Club in Toledo, Ohio, they had been young men playing their way into golf history . . . and playing . . . and playing . . . and playing.\n\nFive days.\n\nFour regulation rounds.\n\nOne 36-hole playoff. And then, for good measure, one more.\n\nOne-hundred-forty-four holes total.\n\nA combined 1,179 strokes.\n\nAnd when on July 6, 1931, this epic national open had come to a merciful end, the final score was tilted in Burke’s favor, 589 to Von Elm’s 590.\n\nOne meager swing. After all that work in 90-degree heat, that is all that separated the two, and it was all Burke, then 28, could do to stand up and lift the U.S. Open trophy handed to him by U.S. Golf Association President Herbert H. Ramsay.\n\n“I’m sorry it had to end this way,” Burke said, looking directly at Von Elm.\n\nThe 30-year-old Von Elm nodded his head. He, too, was sorry it had ended the way it had.\n\nChances are, however, everyone – Burke and Von Elm included – was happy that it simply had ended, because at so many times it appeared as if it never would.\n\n•••\n\nThough for duration it is No. 1 in a line of 110 U.S. Opens, the 1931 edition hardly stirs the emotions – certainly not like 1913, 1950-51, 1960, 1962, 1982 or 2000. Oh, and 1930, which remains a U.S. Open that unlocks a big part of the mystery as to why 1931 has never been warmly embraced.\n\nIn 1930, Bobby Jones commanded the golf stage.\n\nIn 1931, he sat in the audience.\n\nIt was a reality that William Richardson of The New York Times could not overlook.\n\n“The hold that Jones had on golf galleries,” Richardson wrote, “was clearly reflected by the smallness of the Toledo gallery. . . .”\n\nAnd as if he were laying a foundation for the Tiger Woods cliched storyline that is popular 80 years later, Richardson bemoaned Jones’ absence by opining, “There is no single outstanding figure in the game today.”\n\nOne year earlier, Jones had won his fourth U.S. Open as part of golf’s greatest feat, the vaunted “Grand Slam,” so his retirement had shaken the sport.\n\nYet even in retirement, Jones attracted the most attention, fans swarming him as he left Toledo’s posh Commodore Perry Hotel, paying little attention to what Burke, Von Elm and others were doing over an Inverness layout that was a severe challenge, despite being only 6,529 yards.\n\nVon Elm, at least, had been here before. A suave and talented player out of Utah who had become a celebrity of sorts in Los Angeles, Von Elm may have been regarded as the premier player in the golden age of amateur golf – if not for Jones. Von Elm lost in the 1924 U.S. Amateur final against Jones, then in the semifinals a year later. But in 1926, Von Elm gained revenge, beating Jones for the title.\n\nSouring on amateur golf – he said it had cost him $50,000 in the 1920s to chase amateur titles in France and Britain – Von Elm, at the same time Jones retired, declared himself a “businessman golfer.” Thus, Von Elm was no surprise when he fired the only sub-70 score at the 1931 U.S. Open, a second-round 69, and seized the 36-hole lead at 2-over 144. Burke was a stroke back, though dispatches focused on the marquee names well behind: Gene Sarazen, Walter Hagen and Tommy Armour.\n\nPlay the Golfweek Major Challenge\n\nClick here to enter our fantasy contest for the U.S. Open and win great prizes! Free to enter!\n\nWhat an 80-year view provides, however, is perspective on Burke’s brilliant stretch of golf that summer.\n\nThe Connecticut native played in a 72-hole competition June 18-21 at Scioto Country Club in Columbus, Ohio, for 14 invited professionals and earned one of three spots onto the U.S. Ryder Cup team. The next week, again at Scioto, Burke twice was sent out first by Hagen in the Ryder Cup – teaming with Wiffy Cox for a foursomes victory, then crushing Archie Compston, 7 and 6, in singles. In Toledo, a second-round 72 set up a head-to-head, 36-hole regulation final on the only July Fourth in U.S. Open history.\n\nLittle did anyone know the sort of historic ordeal that was about to unfold.\n\n•••\n\nSidelights to the 1931 U.S. Open were plentiful, from it being the first one to be broadcast on radio (O.B. Keeler described the action), to Burke being the first winner to use steel shafts (Von Elm employed hickory), to the one-year trial with the “balloon ball,” which measured 1.68 inches in diameter and weighed 1.55 ounces.\n\nHenry Cotton, then 24, made the first of his two U.S. Open appearances, but shot 80-82 and missed the cut, while another Brit, Compston, was disqualified for missing a 10:45 a.m. tee time. Jones drew a crowd as he left Toledo on Friday to attend the Max Schmeling-Young Stribling fight in Cleveland, but was on hand for the 36-hole regulation finale.\n\nWhat Jones saw that July Fourth Saturday was the cigarette-smoking Von Elm shooting a third-round 73 for 217 total to go up by two over the cigar-chomping Burke, who posted 74. Burke hung tough, however, and pulled ahead late in Round 4 when Von Elm bogeyed 15 and 16. With a birdie at 18, though, Von Elm pulled even with Burke, both at 8-over 292.\n\nFor the 13th time in 35 U.S. Opens, a playoff would be needed. The first 10 had been decided by 18 extra holes, but that format had been changed in spring 1928 to 36 holes. With Jones involved in 1928 (he lost to Johnny Farrell) and ’29 (he beat Al Espinosa), the longer session was favorably accepted, but 1931 would change USGA thinking yet again.\n\nFor good reason, too. It hardly was captivating golf, save for one flurry of drama in Monday’s first 36-hole playoff. Burke had shot 73 in the morning to take a two-stroke lead, built it to four, but Von Elm stormed back with four consecutive birdies to move back in front. Burke then rallied to go a stroke ahead, but Von Elm, as he had done the day before, made a clutch birdie at 18 to force another 36-hole playoff.\n\n“Neither professional nor amateur (Von Elm) is in a classification all his own – namely that of businessman golfer,” Richard wrote in the Times.\n\nPerhaps Von Elm was that good. Perhaps, too, Burke was a worthy foe. But USGA officials were disappointed so few came out to watch. Some blamed the scorching heat. Others criticized the whopping $3 admission (about $44 in today’s money). But, wrote Richardson: “You can bet\n\ndollars to doughnuts, had Jones been a contestant, neither heat nor price could have kept people away.”\n\nFor the second 36-hole playoff, on July 6, admission was cut to $2; it was reduced to $1 for the final 18.\n\nIt worked, too, because thousands more watched as the longest U.S. Open came to an end. Trailing by one after a morning 77, Burke pulled even, then went ahead when Von Elm drove wildly and bogeyed 14. Then, at 16, the former amateur champ missed a 2-foot putt for par and fell two down.\n\nBut it had gone this long because neither man had seized momentum nor quit scrapping. Huffing away on his cigars – “I had to see how the wind was blowing,” he quipped – the man who had been born Billy Burkowski and had worked as a puddler in a foundry saw his lead reduced to one at 17, which brought the players to the 18th hole for an eighth time. Von Elm had birdied it four times previously – twice to force an extra 36 holes – but he couldn’t do it again. His long putt came up just short, leaving Burke to finally draw the curtain down with\n\nhis 589th stroke, a short putt for par.\n\nFor their five days, eight rounds, 144 holes and unyielding patience, Burke was rewarded with $1,000, Von Elm with $750. USGA officials, meanwhile, had been served a dose of reality. In January 1932, Ramsay announced that U.S. Open playoffs would be 18 holes, not 36.\n\nNo one disagreed with the decision, but writing about the infamous 1931 playoff that would never end, John Kieran of the Times imagined how it might have played out had Von Elm for a third consecutive day made birdie at 18 to force a third 36-hole playoff.\n\n“They would have gone out the next day – on horseback,” Kieran wrote. “They were a footsore pair at the finish.”\n\nExhausting and historic as it may have been, the 1931 U.S. Open did not thrust Burke nor Von Elm to everlasting fame. Burke played in the 1933 Ryder Cup, but soon settled into a lengthy career as head professional at Cleveland Country Club before retiring to Clearwater, Fla. Von Elm was legendary in Southern California golf circles, reportedly counted Bob Hope and Bing Crosby among his students, then moved to Idaho, where he built and designed courses.\n\nTheir paths rarely crossed after 1931, which is perhaps fitting.\n\nThey had seen each other plenty at Inverness all those torrid days.\n\n2011 U.S. Open: Tournament preview\n\n• Play the Golfweek Major Challenge: Click here to enter our fantasy contest for the U.S. Open and win great prizes! Free to enter!\n\n• The full field: See who made the U.S. Open and how they did it.\n\n• Tee times and early-round pairings: World’s top three players will play together\n\n• 2011 U.S. Open preview: Tom Lehman’s pain relief\n\n• Defining victory: Ken Venturi was down-and-out heading into the 1964 Open. His unlikely victory turned it all around.\n\n• Celebrating anniversaries: Revisiting memorable U.S. Open moments that celebrate an anniversary this year.\n\n• Epic battle of 1931: George Van Elm and Billy Burke went 72 holes in a playoff that redefined our national championship."}, {"url": "https://www.golfcompendium.com/2020/01/billy-burke-golfer.html", "page_content": "Billy Burke was a PGA Tour winner from the 1920s into the 1940s. He's most famous because he played in, and won, the longest playoff in major championship history: 72 playoff holes.\n\nFull name: William John Burke (birth name Burkowski)\n\nDate of birth: December 14, 1902\n\nPlace of birth: Naugatuck, Connecticut\n\nDate and place of death: April 19, 1972 in Clearwater, Florida\n\nBurke's PGA Tour Wins\n\n1927 Florida Open\n\n1927 Central Florida Open\n\n1928 North and South Open\n\n1929 New York State Open\n\n1929 Glens Falls Open\n\n1930 Mid South Open\n\n1931 U.S. Open\n\n1931 Glens Falls Open\n\n1932 Florida West Coast Open\n\n1935 The Cascades Open\n\n1936 Centennial Open\n\n1939 Walter Hagen 25th Anniversary*\n\n1940 Miami Biltmore International Four-Ball*\n\nBurke is credited with wins in 13 tournaments that are now counted by the PGA Tour as official tour wins:*These two were two-man team tournaments. At the 1939 Hagen, Burke partnered with Ed Dudley . At the 1940 Miami International, his partner was Craig Wood\n\nIn the Majors\n\nHis victory in the 1931 U.S. Open (more on that to come) was Burke's lone win in a major championship. And he never played in the British Open. His best other finishes were third places in the 1934 Masters and in the 1939 Masters ; plus he reached the semifinals in the 1931 PGA Championship\n\nOverall, Burke had six Top 10s in majors. The first major he played in was the 1928 U.S. Open, and he last played in a major in the 1961 Masters.\n\nHis Epic 1931 U.S. Win\n\nNot only did Burke win the 1931 U.S. Open , he won it playing with steel-shafted golf clubs. He was the first golfer to win the U.S. Open with steel shafts.\n\nOh, and then there was that 72-hole playoff. This Open was played at Inverness in Ohio, scheduled to end on July 4. The weather was brutal with temperatures in the 90s, some days approaching 100 — the 1931 U.S. Open is sometimes remembered as \"the Inferno at Inverness.\"\n\nBurke opened with a 73, two off the lead. In the second round, he shot 72 and moved to within one of leader George Von Elm. Von Elm was the tour's leading money winner heading into this tournament.\n\nOn the third day they played 36 holes, the third and fourth rounds. Von Elm's lead over second-place Burke was two following the third round. But Burke took the lead in Round 4, until Von Elm made a 10-foot putt to tie him on the 72nd hole.\n\nFor the first time, the USGA used a 36-hole playoff to decide its Open champion. The only problem was that Burke and Von Elm ended the 36-hole playoff day tied again, and again after Von Elm made a 10-footer on the final hole to tie. They both carded 149s.\n\nSo the next day, they came back and did it all again, their third consecutive day playing 36 holes. And this 36 holes was just like the previous two: tight throughtout. In fact, Burke and Von Elm traded the lead 25 times over the final 36.\n\nIn the end, after 72 holes of regular play and 72 more playoff holes, Burke won by a single stroke. He won the second playoff 148 to 149.\n\nThe USGA reacted to this epic battle — one literally hotly contested in July — two ways: It moved the U.S. Open from July back to June to try to reduce the heat; and it eliminated 36-hole playoffs, going back to 18-hole playoffs.\n\nMore About Billy Burke\n\nBurke was the son of Polish immigrants to American from Lithuania (the family name was Burkauskas, which was polonized to Burkowski, then anglicized to Burke). Billy began playing golf at age 12 after first starting caddying.\n\nAs a teenager, Burke went to work in the same iron foundry in which his father worked. But an accident there took off Burke's ring finger on his left hand, plus part of his left pinkie. After that, he had to rebuild his golf grip to work for him despite those missing fingers.\n\nIt didn't much slow Burke's progress as a golfer. After a hard day in the foundry, Burke headed to the driving range to practice. In Connecticut golf circles, they started calling him \"the Boy Marvel\" for his golf prowess.\n\nWhen he was 18, Burke first entered the Connecticut State Amateur. The only problem was he didn't own the clothes (such as plus-fours) to meet the dress standard for that big event. His dilemma received local media attention, and two local golfers Burke caddied for stepped up to outfit him with new golf clothes and pay his fare to the tournament.\n\nIn 1923, when he was 20, Burke made it to the championship match of the Connecticut State Amateur before losing to Henry Topping. But it turned out to be a great loss for Burke: Topping was a millionaire businessman who became an ongoing benefactor for Burke's golf career, including staking him when he shortly turned pro to try the PGA Tour.\n\nBurke began winning pro tour events in the late 1920s (the 1927 Florida Open is credited as his first tour win). His final tour win was in 1940.\n\nBurke also won other tournaments that are not counted as PGA Tour events, including the Ohio Open four times: 1938, 1939, 1945 and lastly in 1955 at the age of 52.\n\nThe year of 1931 was one of three in which he won twice on tour (1927 and 1929 being the other two), but it was without question his best year. It included his only major championship win at the U.S. Open, plus he reached the semifinals in the PGA Championship. Burke made the first of two appearances on Team USA in the Ryder Cup that year, winning both matches he played. (He also played in the 1933 Ryder Cup.)\n\nAnd Burke got married that year to Marguerite, who survived him when he died at age 69 in 1972.\n\nLater in 1931, Burke and George Von Elm, off the hoopla surrounding their 72-hole playoff, went on an exhibition tour together.\n\nAlong the way, Burke also worked as a club pro and was noted as a golf instructor. He was pro for 29 years, beginning in 1934, at Cleveland (Ohio) Country Club. From 1946-62, he was the winter-season pro at Clearwater (Fla.) Country Club. Burke also taught at the 9-hole course in his hometown of Naugatuck, Conn., as well as in Dark Harbor, Maine. In addition, Burke had endorsement deals with sports equipment companies and Billy Burke-branded golf clubs and golf balls were both produced during his heyday.\n\nBurke was inducted into the PGA Hall of Fame in 1966."}, {"url": "https://www.liveabout.com/british-amateur-championship-1562637", "page_content": "The British Am, whose official title is simply The Amateur Championship, is one of the two most important amateur men's tournaments each year (the other being the U.S. Amateur Championship). It was first played in 1885, and today is run by the R&A. The tournament rotates among courses in the U.K., many of which (but not all) are also part of the British Open rota. The Amateur Championship is played a month earlier than the Open Championship each year.\n\nTournament format: After two days of stroke play, 288 golfers are cut to the 64 who continue to match play. Players advance through 18-hole, single-elimination match play until two players remain. The championship match is 36 holes each.\n\n2020 Tournament\n\nWhen: June 15-20, 2020\n\nWhere: Royal Birkdale Golf Club\n\n2019 British Amateur\n\nJames Sugrue of Ireland def. Euan Walker of Scotland, 1-up, to win the championship. Walker never led in the match, while Segrue led by as much as 5-up after the ninth hole of the match. But Walker chipped away over the second 18, and squared the match on the 33rd hole. Segrue, however, won the 37th to go 1-up, then won the title when the two players matched scores on the final hole.\n\n2018 British Amateur\n\nJovan Rebula never trailed in the 36-hole final, claiming the 2018 Amateur Championship. Rebula became the first South African since Bobby Cole in 1966 to win the trophy. Rebula defeated Ireland's Robin Dawson in the title match by a 3-and-2 score.\n\nOfficial Website\n\nBritish Amateur Championship Records\n\nMost Wins\n\n8 - John Ball (1888, 1890, 1892, 1894, 1899, 1907, 1910, 1912)\n\nMost Consecutive Wins\n\n3 - Michael Bonallack, 1968-70\n\nLargest Winning Margin in Final\n\n14 and 13 - 1934, Lawson Little def. Jimmy Wallace\n\nBritish Amateur Championship Golf Courses\n\nThe British Amateur rotates among golf courses in Great Britain and, less frequently, visits Ireland (and then Northern Ireland - only once has this tournament been played in the Republic of Ireland). There is not an established, regular rotation as there is with the British Open, but some of the Amateur courses are also part of the Open rota: Muirfield, Turnberry, Royal Lytham & St. Annes, Royal St. George's, Royal Liverpool, Royal Troon. The Amateur also visits St. Andrews, but more than just The Old Course.\n\nThe British Am also visits courses that are not part of the Open rota, such as Formby, Nairn, Royal Porthcawl in Wales and Royal Portrush in Northern Ireland.\n\nBritish Amateur Championship Facts and Trivia\n\nThe winner of the British Amateur receives exemptions to play in the same year's British Open and the following year's Masters (but only gets into The Masters if the golfer still an amateur when The Masters is played).\n\nA tournament organized by Royal Liverpool in 1885 is now recognized as the first British Amateur Championship, won by Allen MacFie. The R&A began running the tournament in 1921.\n\nJohn Ball won the most titles with eight, the first in 1888 and the last in 1912. Despite all those wins, Ball never claimed back-to-back championships.\n\nSince World War II, the player with the most wins is Sir Michael Bonallack with five.\n\nThree of Bonallack's victories were consecutive, 1968-70. Bonallack is the only golfer to win the British Am three straight years.\n\nOnly three golfers have won both the British Amateur and the British Open in their careers: Ball, Harold Hilton and Bobby Jones.\n\nJones' lone win in the British Am was in 1930, his Grand Slam year. The British Am was the first of the four major tournaments Jones won that year, followed by the British Open, the U.S. Open, and finally the U.S. Amateur.\n\nThe first American golfer to win the British Amateur was Walter Travis in 1904, but Travis emigrated to the U.S. after being born in Australia. The first golfer born in the U.S. to win the British Am was Jess Sweetser in 1926.\n\nSweetser's victory in 1926 followed a remarkable act of sportsmanship on his part. His opponent in the final, A.F. Simpson, missed the tee time after his car broke down en route to the course. The R&A was set to declare Sweetser the winner by forfeit, but Sweetser insisted they wait for Simpson to arrive. Simpson showed up an hour late (on bicycle), and Sweetser then won the championship match 6 and 5.\n\nLawson Little won both the U.S. and British amateur championships in 1934, and did it again in 1935. He's the only golfer to sweep both events in back-to-back years.\n\nThe first golfer to win both the British Amateur and U.S. Amateur in the same year was Harold Hilton, in 1911.\n\nBritish Amateur Championship Winners\n\nHere are recent winners of the British Amateur (full list here):\n\n2019 - James Sugrue def. Euan Walker, 1-up\n\n2018 - Jovan Rebula def. Robin Dawson, 3 and 2\n\n2017 - Harry Ellis def. Dylan Perry, 1-up (38 holes)\n\n2016 - Scott Gregory def. Robert MacIntyre, 2 and 1\n\n2015 - Romain Langasque def. Grant Forrest, 4 and 2\n\n2014 - Bradley Neil def. Zander Lombard, 2 and 1\n\n2013 - Garrick Porteous def. Toni Hakula, 6 and 5"}, {"url": "https://www.usga.org/articles/2010/09/museum-moment-jones-scorecard-from-1930-amateur-final-2147490252.html", "page_content": "When Bob Jones arrived at Merion Golf Club in September 1930, the three toughest hurdles in his quest to claim all four major golf championships in one year had been cleared.\n\nOnly the U.S. Amateur, which Jones had captured on four previous occasions, remained in what some in the press were calling the Impregnable Quadrilateral. This feat would later be called the Grand Slam, although the modern professional version includes the U.S. Open, British Open, Masters and PGA Championship.\n\nIn 1930, the Masters was four years from its inception and Jones could not compete in the fledgling PGA Championship because of his amateur status.\n\nSo the Atlanta native set out to accomplish the rarest of feats, win the four preeminent golf championships of his era: the U.S. Open, British Open, U.S. Amateur and British Amateur.\n\nEighty years ago, on Sept. 22, Jones defeated Eugene Homans, 8 and 7, before a crowd estimated at 18,000 to complete the quest. A scorecard of that scheduled 36-hole final is on display at the USGA Museum in Far Hills, N.J.\n\nWhile most of the U.S. – and the world for that matter – was in the throes of the Great Depression, Jones gave the public something to feel good about. No one has since been able to claim all four of golf’s major championships in a calendar year, although Tiger Woods captured four consecutive majors in 2000-2001. Ben Hogan also won three majors in 1953, but he was unable to compete in the PGA Championship due to a scheduling conflict with the British Open.\n\nJones figured 1930 was the right time to make a run at history. He had quietly thought of retiring from competitive golf to focus more on his family and law practice in Atlanta. With the biennial Walker Cup Match scheduled for the spring of 1930, Jones set sail that April as the USA’s playing captain.\n\nA USA victory at Royal St. George’s in Sandwich, England, preceded the British Amateur, which was being conducted on the Old Course at St. Andrews. This was the only major championship missing from Jones’ impressive resume. It was also one of the toughest to win because of the grueling format. The bracket featured eight rounds, although Jones was given a first-round bye, and all the matches were 18 holes until the final. Jones always felt he could beat anyone over 36 holes, but 18-hole matches offered more of a chance for an upset.\n\nJones survived a tough fourth-round match with Cyril Tolley, winning in 19 holes. He rallied from a 2-down deficit with five to play to beat George Voigt in the semifinals, 1 up. The crucial point came at the famous Road Hole, No. 17, where Jones holed a 12-foot par putt to halve the hole. He won the match at No. 18.\n\nOnce he reached the 36-hole final, he had little trouble defeating 1923 British Amateur champion Roger Wethered of England, who happened to be the Great Britain and Ireland Walker Cup captain. Jones prevailed, 7 and 6, and headed to the British Open at Royal Liverpool (Hoylake).\n\nJones spent a week in Paris with his wife to get rested for the second leg of his Grand Slam quest. He struggled in the qualifying rounds, shooting 73-77, but eventually won the title by two shots over Macdonald Smith and Leo Diegel en route to breaking Walter Hagen’s championship record by 10 shots. Jones had become the first man to win the British Amateur and Open championships in the same year since John Ball 40 years earlier.\n\nA ticker-tape parade awaited Jones when he returned to New York on the SS Europa. It was the second time Jones had received such an honor, the first coming four years earlier when he became the only amateur to have won the U.S. and British Open titles in the same year. Jones remains the only athlete and one of two individuals – astronaut John Glenn is the other – to have received two ticker-tape parades down Broadway.\n\nBut celebration aside, Jones still had plenty of work remaining. He would head to Interlachen Country Club outside of Minneapolis seeking a fourth U.S. Open title. Only Willie Anderson had managed to win four U.S. Open titles and Jones wanted to join that select fraternity.\n\nDespite sweltering heat – temperatures soared into the 100s – Jones managed to fight through the pressure and enormous expectations that were now on his shoulders. With his muscles quivering, Jones eventually held off Smith again by two strokes, holing a 40-foot birdie putt at the 72nd hole to cement the championship.\n\nNow the U.S. Amateur was the only obstacle in Jones’ path to history.\n\nFittingly, the championship was being conducted at Merion Golf Club, where Jones had first burst onto the national scene as a raw 14-year-old talent. Merion was also the site of his first U.S. Amateur title in 1924.\n\nJones preferred the format that called for 36-hole matches from the third round onward. After easily claiming medalist honors, Jones cruised through his first two 18-hole matches, defeating Canadians Ross Somerville and F.G. Hoblitzel by 5-and-4 margins. With 36-hole matches set for the quarterfinals, semis and final, Jones now was in his comfort zone.\n\nFay Coleman fell 6 and 4 in the quarterfinals, followed by a 9-and-8 romp over 1922 champion Jess Sweetser.\n\nIn the final against Homan, Jones carded the equivalent of 33 on the second nine and held a commanding 7-up lead at the break. From there, it was a mere formality as the crowds swelled to witness history. The match came to an end at the par-4 11th hole.\n\n“The most triumphant journey that any man ever travelled in sport,” wrote William Richardson in the New York Times of the 50 marines who escorted the champion back to the clubhouse.\n\nNevertheless, Jones, then only 28, shockingly announced his retirement from competitive golf. Four years later, he would play a role in the founding of the Masters Tournament at his new club, Augusta National.\n\nTo this day, Jones’ 1930 performance ranks as one of the greatest in the history of the game."}, {"url": "https://www.liquisearch.com/billy_burke_golfer", "page_content": "William John Burke, born Burkowski (December 14, 1902 – April 19, 1972) was a prominent American professional golfer of the 1920s and 1930s.\n\nBurke was born in Naugatuck, Connecticut. His greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf. Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8 over par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7 over par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used a unorthodox grip due to the loss of two fingers on his left hand. Burke died in Clearwater, Florida."}, {"url": "https://prabook.com/web/billy.burke/1754184", "page_content": "Billy Burke\n\ngolfer\n\nDecember 14, 1902 (age 69) Naugatuck, Connecticut\n\nHe was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149. Throughout Burke\"s golf career he used an unorthodox grip due to the loss of two fingers on his left hand. In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame. Burke died in Clearwater, Florida. Professional Golf Association Tour wins (13) 1927 (2) Florida Open, Central Florida Open Other wins (4) Wins (1) 1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7). Results timeline."}, {"url": "https://www.golfcompendium.com/2021/08/won-us-and-british-amateur-championships.html", "page_content": "How many golfers have won both the U.S. Amateur Championship and the British Amateur Championship? Not many! It's tough to win just one of these prestigious amateur golf titles, after all, much less both of them. But 13 golfers have managed to pull off this feat. Some of those who did it are very big names in golf history, and others are ... not.\n\nThe two biggest names, however, are both missing. Neither Jack Nicklaus nor Tiger Woods was able to win the British Amateur.\n\nThe United States Amateur Championship (usually shortened to U.S. Amateur), run by the United States Golf Association, dates to 1895. The British Amateur (officially named The Amateur Championship) dates to 1885.\n\nThe List: 13 Golfers Who Won the U.S. and British Amateurs\n\nWalter Travis :Travis (pictured above) won the U.S. Amateur three times, in 1900, 1901 and 1903. He added the British Amateur in 1904, becoming the first golfer to win both. Travis showed up to the British Amateur in 1904 with the center-shafted Schenectady putter. The British golf world was so taken aback by a center-shafted putter and Travis winning with one that a movement sprung up to get them banned. In 1910, the R&A did just that. The ban wasn't lifted until 1951.\n\n:Travis (pictured above) won the U.S. Amateur three times, in 1900, 1901 and 1903. He added the British Amateur in 1904, becoming the first golfer to win both. Travis showed up to the British Amateur in 1904 with the center-shafted Schenectady putter. The British golf world was so taken aback by a center-shafted putter and Travis winning with one that a movement sprung up to get them banned. In 1910, the R&A did just that. The ban wasn't lifted until 1951. Harold Hilton : \"Hal\" Hilton was a four-time British Am winner (1900, 1901, 1911, 1913), and won the U.S. title in 1911. He was the first golfer to win both of the biggest amateur titles in the same year. (He also won the 1892 British Open and 1897 British Open, prior to any of his national amateur championship wins, playing as an amateur.)\n\n: \"Hal\" Hilton was a four-time British Am winner (1900, 1901, 1911, 1913), and won the U.S. title in 1911. He was the first golfer to win both of the biggest amateur titles in the same year. (He also won the 1892 British Open and 1897 British Open, prior to any of his national amateur championship wins, playing as an amateur.) Jess Sweetser : Famous for handing Bobby Jones the worst defeat Jones ever suffered in either of the two amateur majors (Sweetser beat Jones 8-and-7 in the 1922 U.S. Amateur semifinals), Jess Sweetser won the U.S. Am in 1922 and the British Am in 1926.\n\n: Famous for handing Bobby Jones the worst defeat Jones ever suffered in either of the two amateur majors (Sweetser beat Jones 8-and-7 in the 1922 U.S. Amateur semifinals), Jess Sweetser won the U.S. Am in 1922 and the British Am in 1926. Bobby Jones : Jones won the U.S. Amateur five times: 1924, 1925, 1927, 1928 and 1930. He won the British Amateur \"just\" once, in 1930. But that one win helped Jones achieve the Grand Slam in 1930 (which, at the time, was winning all four of the U.S. and British amateurs and the U.S. and British opens). Jones was the second man after Hilton to win both titles in the same year.\n\n: Jones won the U.S. Amateur five times: 1924, 1925, 1927, 1928 and 1930. He won the British Amateur \"just\" once, in 1930. But that one win helped Jones achieve the Grand Slam in 1930 (which, at the time, was winning all four of the U.S. and British amateurs and the U.S. and British opens). Jones was the second man after Hilton to win both titles in the same year. Lawson Little : Little joined the short list of golfers who won both titles in the same year when he did it in 1934. And then, for good measure, he did it again in 1935: Victories in the U.S. Amateur in 1934-35, victories in the British Amateur in 1934-35.\n\n: Little joined the short list of golfers who won both titles in the same year when he did it in 1934. And then, for good measure, he did it again in 1935: Victories in the U.S. Amateur in 1934-35, victories in the British Amateur in 1934-35. Willie Turnesa : Willie Turnesa won the U.S. Amateur in 1938, the British Am in 1947, and added another U.S. Am in 1948.\n\n: Willie Turnesa won the U.S. Amateur in 1938, the British Am in 1947, and added another U.S. Am in 1948. Dick Chapman : A 1940 U.S. Amateur winner and 1951 British Am winner, Dick Chapman might be best-remembered for doing something else: He was the inventor of the Chapman System format, also known as Pinehurst System.\n\n: A 1940 U.S. Amateur winner and 1951 British Am winner, Dick Chapman might be best-remembered for doing something else: He was the inventor of the Chapman System format, also known as Pinehurst System. Harvie Ward : E. Harvie Ward Jr. won the American championship in 1955 and 1956, after already having won the British championship in 1952.\n\n: E. Harvie Ward Jr. won the American championship in 1955 and 1956, after already having won the British championship in 1952. Deane Beman : The future PGA Tour commissioner won the British Amateur first in 1959, then added two titles (1960, 1963) in the U.S. Am.\n\n: The future PGA Tour commissioner won the British Amateur first in 1959, then added two titles (1960, 1963) in the U.S. Am. Bob Dickson : Dickson won both titles in 1967, the most-recent golfer to win the U.S. and British amateur championships in the same year.\n\n: Dickson won both titles in 1967, the most-recent golfer to win the U.S. and British amateur championships in the same year. Steve Melnyk : Won the U.S. Amateur in 1969 and the British Amateur in 1971.\n\n: Won the U.S. Amateur in 1969 and the British Amateur in 1971. Vinny Giles III : Won the U.S. Amateur in 1972 and the British Amateur in 1975.\n\n: Won the U.S. Amateur in 1972 and the British Amateur in 1975. Jay Sigel: Sigel was one of the last great lifetime amateurs (well, until he turned pro to play on the Champions Tour). He won the British Am first, in 1979, then added U.S. Amateur titles in 1982 and 1983.\n\nListed in chronological order, there are the 13 golfers who've pulled off the biggest double in men's amateur golf:That's it: Those are the 13 golfers who won the United States Amateur Championship and The Amateur Championship. No new names have shown up on the list since 1982. And it might be a while before anymore do: Truth is, it's not that common anymore for the best American amateurs to play the British Amateur; and not all the top Brits still travel to play the U.S. Am.\n\nThe four golfers who won both in the same year are Harold Hilton, Bobby Jones, Lawson Little and Bob Dickson.\n\nPhoto credit: Walter Travis photographed by Bain News Service; Public domain, via Wikimedia Commons\n\nRelated articles:"}, {"url": "https://www.britannica.com/sports/British-Amateur-Championship", "page_content": "British Amateur Championship, golf tournament held annually in Great Britain for male amateurs with handicaps of 2 or less. A field of 256 players selected by qualifying play is reduced to players who, after 1957, competed for most holes won in a 36-hole final match play round.\n\nIn 1885, an Open Amateur Tournament (called open to signify that all countries might enter) was held by the Royal Liverpool Club at Hoylake, but the first official British Amateur Championship was held in 1886. Originally played at St. Andrews, and later at the Hoylake and Prestwick courses, the championship was later played at various other sites. John Ball is the leading eight-time winner (1888, 1890, 1892, 1894, 1899, 1907, 1910, and 1912). Later multiple winners include Joe Carr (1953, 1958, 1960) and Michael Bonallack (1961, 1965, 1968–70).\n\nBritannica Quiz Sports Quiz\n\nThe British Ladies Amateur Golf Championship, the first women’s golf tournament to be established, is held annually in Great Britain for female amateurs with handicaps of eight or less. There are qualifying rounds followed by the final 36 holes, which are decided by match play.\n\nThe first championship was held in 1893 at a nine-hole course at the Lytham and St. Anne’s Club, Lancashire. In the following year it was held at Littlestone in Kent and has been held at various other courses in Great Britain, including St. Andrew’s in Scotland. Lady Margaret Scott, who was the first championship winner, also won in 1894 and 1895. The only other woman to win three years successively was Enid Wilson (1931–33). Cecilia Leitch was champion four times (1914, 1920, 1921, and 1926), as was Joyce Wethered (1922, 1924, 1925, and 1929)."}, {"url": "https://www.britannica.com/biography/Billy-Mills", "page_content": "Billy Mills, byname of William Mervin Mills, (born June 30, 1938, Pine Ridge, South Dakota, U.S.), athlete who was the first American to win an Olympic gold medal in the 10,000-metre race, achieving a dramatic upset victory at the 1964 Olympic Games in Tokyo.\n\nMills, who was part Sioux, grew up on an Oglala Sioux Indian reservation and, after he was orphaned at the age of 12, attended the Haskell Institute, an Indian school in Lawrence, Kansas. There and at the University of Kansas, he excelled in track events but then abandoned them for two years. While serving in the U.S. Marine Corps, he returned to racing in 1964, qualifying for that year’s Olympic Games in Tokyo.\n\nBritannica Quiz Sports Quiz\n\nMills was a little-known entrant in the 10,000-metre run; among those favoured to win was Ron Clarke, of Australia, who held the world record. On a wet track, Mills kept pace with the leaders until the final lap, when Clarke and Mohamed Gammoudi of Tunisia forced him to the outside of a crowded field. As Clarke and Gammoudi fought for the lead, Mills, in a frantic final sprint, surged past them to win an electrifying victory by just three yards. His success continued in 1965, when he set an outdoor world record (27 minutes 11.6 seconds) in the six-mile run and set U.S. records in the 10,000-metre and indoor three-mile races. The film Running Brave (1984) was based on his Olympic victory.\n\nIn 1986 Mills cofounded Running Strong for American Indian Youth, which provides health and shelter assistance while also supporting traditional cultures and languages. In 2013 Mills was presented with the Presidential Citizens Medal by U.S. Pres. Barack Obama."}]}