{"Billy Burke died at the age of 86.": [{"url": "https://www.golfcompendium.com/2020/01/billy-burke-golfer.html", "page_content": "Billy Burke was a PGA Tour winner from the 1920s into the 1940s. He's most famous because he played in, and won, the longest playoff in major championship history: 72 playoff holes.\n\nFull name: William John Burke (birth name Burkowski)\n\nDate of birth: December 14, 1902\n\nPlace of birth: Naugatuck, Connecticut\n\nDate and place of death: April 19, 1972 in Clearwater, Florida\n\nBurke's PGA Tour Wins\n\n1927 Florida Open\n\n1927 Central Florida Open\n\n1928 North and South Open\n\n1929 New York State Open\n\n1929 Glens Falls Open\n\n1930 Mid South Open\n\n1931 U.S. Open\n\n1931 Glens Falls Open\n\n1932 Florida West Coast Open\n\n1935 The Cascades Open\n\n1936 Centennial Open\n\n1939 Walter Hagen 25th Anniversary*\n\n1940 Miami Biltmore International Four-Ball*\n\nBurke is credited with wins in 13 tournaments that are now counted by the PGA Tour as official tour wins:*These two were two-man team tournaments. At the 1939 Hagen, Burke partnered with Ed Dudley . At the 1940 Miami International, his partner was Craig Wood\n\nIn the Majors\n\nHis victory in the 1931 U.S. Open (more on that to come) was Burke's lone win in a major championship. And he never played in the British Open. His best other finishes were third places in the 1934 Masters and in the 1939 Masters ; plus he reached the semifinals in the 1931 PGA Championship\n\nOverall, Burke had six Top 10s in majors. The first major he played in was the 1928 U.S. Open, and he last played in a major in the 1961 Masters.\n\nHis Epic 1931 U.S. Win\n\nNot only did Burke win the 1931 U.S. Open , he won it playing with steel-shafted golf clubs. He was the first golfer to win the U.S. Open with steel shafts.\n\nOh, and then there was that 72-hole playoff. This Open was played at Inverness in Ohio, scheduled to end on July 4. The weather was brutal with temperatures in the 90s, some days approaching 100 — the 1931 U.S. Open is sometimes remembered as \"the Inferno at Inverness.\"\n\nBurke opened with a 73, two off the lead. In the second round, he shot 72 and moved to within one of leader George Von Elm. Von Elm was the tour's leading money winner heading into this tournament.\n\nOn the third day they played 36 holes, the third and fourth rounds. Von Elm's lead over second-place Burke was two following the third round. But Burke took the lead in Round 4, until Von Elm made a 10-foot putt to tie him on the 72nd hole.\n\nFor the first time, the USGA used a 36-hole playoff to decide its Open champion. The only problem was that Burke and Von Elm ended the 36-hole playoff day tied again, and again after Von Elm made a 10-footer on the final hole to tie. They both carded 149s.\n\nSo the next day, they came back and did it all again, their third consecutive day playing 36 holes. And this 36 holes was just like the previous two: tight throughtout. In fact, Burke and Von Elm traded the lead 25 times over the final 36.\n\nIn the end, after 72 holes of regular play and 72 more playoff holes, Burke won by a single stroke. He won the second playoff 148 to 149.\n\nThe USGA reacted to this epic battle — one literally hotly contested in July — two ways: It moved the U.S. Open from July back to June to try to reduce the heat; and it eliminated 36-hole playoffs, going back to 18-hole playoffs.\n\nMore About Billy Burke\n\nBurke was the son of Polish immigrants to American from Lithuania (the family name was Burkauskas, which was polonized to Burkowski, then anglicized to Burke). Billy began playing golf at age 12 after first starting caddying.\n\nAs a teenager, Burke went to work in the same iron foundry in which his father worked. But an accident there took off Burke's ring finger on his left hand, plus part of his left pinkie. After that, he had to rebuild his golf grip to work for him despite those missing fingers.\n\nIt didn't much slow Burke's progress as a golfer. After a hard day in the foundry, Burke headed to the driving range to practice. In Connecticut golf circles, they started calling him \"the Boy Marvel\" for his golf prowess.\n\nWhen he was 18, Burke first entered the Connecticut State Amateur. The only problem was he didn't own the clothes (such as plus-fours) to meet the dress standard for that big event. His dilemma received local media attention, and two local golfers Burke caddied for stepped up to outfit him with new golf clothes and pay his fare to the tournament.\n\nIn 1923, when he was 20, Burke made it to the championship match of the Connecticut State Amateur before losing to Henry Topping. But it turned out to be a great loss for Burke: Topping was a millionaire businessman who became an ongoing benefactor for Burke's golf career, including staking him when he shortly turned pro to try the PGA Tour.\n\nBurke began winning pro tour events in the late 1920s (the 1927 Florida Open is credited as his first tour win). His final tour win was in 1940.\n\nBurke also won other tournaments that are not counted as PGA Tour events, including the Ohio Open four times: 1938, 1939, 1945 and lastly in 1955 at the age of 52.\n\nThe year of 1931 was one of three in which he won twice on tour (1927 and 1929 being the other two), but it was without question his best year. It included his only major championship win at the U.S. Open, plus he reached the semifinals in the PGA Championship. Burke made the first of two appearances on Team USA in the Ryder Cup that year, winning both matches he played. (He also played in the 1933 Ryder Cup.)\n\nAnd Burke got married that year to Marguerite, who survived him when he died at age 69 in 1972.\n\nLater in 1931, Burke and George Von Elm, off the hoopla surrounding their 72-hole playoff, went on an exhibition tour together.\n\nAlong the way, Burke also worked as a club pro and was noted as a golf instructor. He was pro for 29 years, beginning in 1934, at Cleveland (Ohio) Country Club. From 1946-62, he was the winter-season pro at Clearwater (Fla.) Country Club. Burke also taught at the 9-hole course in his hometown of Naugatuck, Conn., as well as in Dark Harbor, Maine. In addition, Burke had endorsement deals with sports equipment companies and Billy Burke-branded golf clubs and golf balls were both produced during his heyday.\n\nBurke was inducted into the PGA Hall of Fame in 1966."}, {"url": "https://www.thecelebritydeaths.com/billie-burkes-death-cause-and-date/", "page_content": "The movie actress Billie Burke died at the age of 85. Here is all you want to know, and more!\n\nBiography - A Short Wiki\n\nShe gave an unforgettable performance as Glinda, the Good Witch, in the 1939 film The Wizard of Oz. She hosted her talk show, At Home With Billie Burke, from 1951 to 1952.\n\nShe had one daughter and four grandchildren. She was married to Broadway producer Florenz Ziegfeld, Jr. from 1914 to 1932.\n\nQuotes\n\n\" “A woman past forty should make up her mind to be young; not her face.” (Billie Burke)\n\n\" “There is no reason why marriage should necessarily compel an actress to forego her career.” (Billie Burke)\n\n\" “Age is something that doesn’t matter, unless you are a cheese.” (Billie Burke)\n\n\" “Age is of no importance unless you are a cheese.” (Billie Burke)"}, {"url": "https://deadorkicking.com/billie-burke-dead-or-alive/", "page_content": "Billie Burke Death\n\nBillie passed away on May 14, 1970 at the age of 85 in Los Angeles, California, USA. Billie's cause of death was natural causes.\n\nBillie Burke death quick facts: When did Billie Burke die? May 14, 1970\n\nHow did Billie Burke die? What was the cause of death? Natural causes\n\nHow old was Billie Burke when died? 85\n\nWhere did Billie Burke die? What was the location of death? Los Angeles, California, USA\n\nBillie Burke Birthday and Date of Death\n\nBillie Burke was born on August 7, 1884 and died on May 14, 1970. Billie was 85 years old at the time of death.\n\nBirthday: August 7, 1884\n\nDate of Death: May 14, 1970\n\nAge at Death: 85\n\nBillie Burke - Biography\n\nBillie Burke was born Mary William Ethelbert Appleton Burke on August 7, 1885 in Washington, D.C. Her father was a circus clown, and as a child she toured the United States and Europe with the circus (before motion pictures and after the stage, circuses were the biggest form of entertainment in the world). One could say that Billie was bred for show business. Her family ultimately settled in London, where she was fortunate to see plays in the city's historic West End, and decided she wanted to be a stage actress. At age 18, she made her stage debut and her career was off and running. Her performances were very well received and she became one of the most popular actresses to grace the stage. Broadway beckoned, and since New York City was now recognized as the stage capital of the world, it was there she would try her luck. Billie came to New York when she was 22 and her momentum did not stop. She appeared in numerous plays and it was only a matter of time before Hollywood came calling, which is exactly what happened. She made her film debut in the lead role in Peggy (1916). The film was a hit, but then again most films were, as the novelty of motion pictures had not worn off since The Great Train Robbery (1903) at the turn of the century. Later that year, she appeared in Gloria's Romance (1916). In between cinema work, she would take her place on the stage because not only was it her first love, but she had speaking parts. Billie considered herself more than an actress--she felt she was an artist, too. She believed that the stage was a way to personally reach out to an audience, something that could not be done in pictures. In 1921, she appeared as Elizabeth Banks in The Education of Elizabeth (1921), then she retired. She had wed impresario Florenz Ziegfeld Jr. of the famed Ziegfeld Follies and, with investments in the stock market, there was no need to work.What the Ziegfelds did not plan on was \"Black October\" in 1929. Their stock investments were wiped out in the crash, which precipitated the Great Depression, and Billie had no choice but to return to the screen. Movies had become even bigger than ten years earlier, especially since the introduction of sound. Her first role of substance was as Margaret Fairlfield in A Bill of Divorcement (1932). As an artist, she loved the fact that she had dialog, but she had to work even harder because her husband had died the same year as her speaking debut - and work she did. One of her career highlights came as Mrs. Millicent Jordan in David O. Selznick's Dinner at Eight (1933), co-starring Lionel Barrymore, Wallace Beery, John Barrymore and Jean Harlow - heady company to be sure, but Billie turned in an outstanding performance as Mrs. Jordan, the scatterbrained wife of a man whose shipping company is in financial trouble and who was trying to get someone to loan his company money to help stave off disaster. Her character loved to give dinner parties because a dinner affair at the Jordans had a reputation among New York blue-blood society as the highlight of the season. With all the drama and intrigue going on around her, her main concern is that she is one man short of having a full seating arrangement. The film was a hit and once again Billie was back on top. In 1937, she had one of her most fondly remembered roles in Topper (1937), a film that would ultimately spin off two sequels, and all three were box-office hits. In 1938, Billie received her first and only Academy Award nomination for her portrayal of Emily Kilbourne in Merrily We Live (1938). This was probably the best performance of her screen career, but she was destined to be immortalized forever in the classic The Wizard of Oz (1939). At 54 years of age - and not looking anywhere near it - she played Glinda, the Good Witch of the North. The 1940s saw Billie busier than ever--she made 25 films between 1940 and 1949. She made only six in the 1950s, as her aging became noticeable. She was 75 when she made her final screen appearance as Cordelia Fosgate in John Ford's Western Sergeant Rutledge (1960). Billie retired for good and lived in Los Angeles, California, where she died at age 85 of natural causes on May 14, 1970."}, {"url": "https://www.celebsagewiki.com/billie-burke", "page_content": "Age, Biography and Wiki\n\nBillie Burke (Mary William Ethelbert Appleton Burke) was born on 7 August, 1884 in Washington, District of Columbia, USA, is an Actress, Soundtrack. Discover Billie Burke's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of Billie Burke networth?\n\nPopular As Mary William Ethelbert Appleton Burke Occupation actress,soundtrack Age 86 years old Zodiac Sign Leo Born 7 August 1884 Birthday 7 August Birthplace Washington, District of Columbia, USA Date of death 14 May, 1970 Died Place Los Angeles, California, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 7 August. She is a member of famous Actress with the age 86 years old group.\n\nBillie Burke Height, Weight & Measurements\n\nAt 86 years old, Billie Burke height is 5' 2½\" (1.59 m) .\n\nPhysical Status Height 5' 2½\" (1.59 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Billie Burke's Husband?\n\nHer husband is Florenz Ziegfeld Jr. (11 April 1914 - 22 July 1932) ( his death) ( 1 child)\n\nFamily Parents Not Available Husband Florenz Ziegfeld Jr. (11 April 1914 - 22 July 1932) ( his death) ( 1 child) Sibling Not Available Children Not Available\n\nBillie Burke Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Billie Burke worth at the age of 86 years old? Billie Burke’s income source is mostly from being a successful Actress. She is from USA. We have estimated Billie Burke's net worth , money, salary, income, and assets.\n\nPeggy (1916) $40,000 Gloria's Romance (1916) $300,000\n\nBillie Burke Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://biographyscoop.com/billy-burke/", "page_content": "Billy Burke Biography, Age, Wife, Height, Net Worth, Children, Movies, Fire Country\n\nBilly Burke Biography\n\nBilly Burke is a former singer and actor from the United States. He is best known for his role as Charlie Swan in the 2008 romantic fantasy film ‘Twilight’ and its subsequent sequels. His television credits include appearances in Star Trek: Deep Space Nine (in the episode “Second Skin”), Party of Five, Gilmore Girls, Karen Sisco, Fringe, Monk, and The Closer (Season 4, episode 13, “Power of Attorney”), where he played Phillip Stroh, a serial rapist, and murderer, a character who was revisited in Major Crimes (see below).\n\nAdvertisements\n\nHow old is Billy Burke?- Age\n\nHe is 56 years old as of November 2022. Bourke was born William Albert Burke on November 25, 1966, in Everett, Washington, USA.\n\nBilly Burke Education\n\nHe went to Western Washington University in Bellingham to study drama.\n\nBilly Burke Height\n\nBilly stands at a height of 6’2″ (188 cm) tall.\n\nDoes Billy Burke have children?- Wife\n\nHe married actress Pollyanna Rose on June 15, 2008. Bluesy LaRue Burke is their daughter. In 2017, the couple divorced.\n\nBilly Burke Career\n\nBurke debuted as an actor in the independent film ‘Daredreamer’ in 1990. Following his guest appearances in many TV shows including ‘Party of Five’, ‘Vanishing Son’ and ‘All-American Girl’, he did the made-for-television movie ‘Gone in the Night’. In 1998, the actor starred in ‘Don’t Look Down,’ a horror film about a woman who tries to cope with the death of her sister by joining a group that helps people with acrophobia. Burke also starred in the comedy film ‘Mafia’ that year, alongside Lloyd Bridges, Christina Applegate, and Jay Mohr. He appeared in the mockumentary ‘The Independent as well as the ABC drama ‘Wonderland’ in the year 2000. Burke appeared in the neo-noir psychological thriller ‘Along Came a Spider’.\n\nHe appeared in the drama series ’24,’ ‘Gilmore Girls,’ and ‘The Jury’ from 2002 to 2004. During this time, he was also in the films Lost Junction’ and ‘Ladder 49.’ Burke’s career took off when he landed the role of Charlie Swan in the romantic fantasy film ‘Twilight’ in 2008. Later, in 2009 and 2010, he reprised his role in ‘The Twilight Saga: New Moon’ and ‘The Twilight Saga: Eclipse,’ respectively. The actor also appeared in the TV shows ‘My Boys’ and ‘The Closer’ during this time period. In 2011, he played Cesaire in the romance horror film ‘Red Riding Hood,’ and he also appeared in the Twilight sequel ‘The Twilight Saga: Breaking Dawn – Part 1’.\n\nBurke starred as Miles Matheson in the science fiction series ‘Revolution’ from 2012 to 2014. Soon after the show ended, he joined the cast of ‘Major Crimes as serial killer Phillip Stroh and also began playing Mitch Morgan in ‘Zoo’. He made his directorial debut in David F. Sandberg’s ‘Lights Out’ in 2016. The supernatural horror film was a commercial success, grossing $148.9 million against a budget of $4.9 million. He played Eddie in the thriller ‘Breaking In’ in 2018.\n\nBilly Burke’s Net Worth\n\nBilly has an estimated net worth of 5 million dollars as of 2023.\n\nBilly Burke Movies"}, {"url": "https://www.celebsagewiki.com/billy-burke-evangelist", "page_content": "Age, Biography and Wiki\n\nBilly Burke was born on 24 May, 1953 in Pittsburgh, PA, is an Evangelist. Discover Billy Burke's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 70 years old?\n\nPopular As Billy Burke Occupation Evangelist Age 70 years old Zodiac Sign Gemini Born 24 May 1953 Birthday 24 May Birthplace Pittsburgh, PA Nationality PA\n\nWe recommend you to check the complete list of Famous People born on 24 May. He is a member of famous with the age 70 years old group.\n\nBilly Burke Height, Weight & Measurements\n\nAt 70 years old, Billy Burke height not available right now. We will update Billy Burke's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBilly Burke Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Billy Burke worth at the age of 70 years old? Billy Burke’s income source is mostly from being a successful . He is from PA. We have estimated Billy Burke's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nBilly Burke Social Network\n\nTimeline"}, {"url": "https://www.celebsagewiki.com/billy-burke-golfer", "page_content": "Age, Biography and Wiki\n\nBilly Burke (golfer) (William John Burke) was born on 14 December, 1902 in Naugatuck, Connecticut, United States, is a professional. Discover Billy Burke (golfer)'s Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 70 years old?\n\nPopular As William John Burke Occupation N/A Age 70 years old Zodiac Sign Sagittarius Born 14 December 1902 Birthday 14 December Birthplace Naugatuck, Connecticut, United States Date of death (1972-04-19) Died Place N/A Nationality Connecticut\n\nWe recommend you to check the complete list of Famous People born on 14 December. He is a member of famous professional with the age 70 years old group.\n\nBilly Burke (golfer) Height, Weight & Measurements\n\nAt 70 years old, Billy Burke (golfer) height is 5 ft 11.5 in (1.82 m) and Weight 172 lb (78 kg; 12.3 st).\n\nPhysical Status Height 5 ft 11.5 in (1.82 m) Weight 172 lb (78 kg; 12.3 st) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBilly Burke (golfer) Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Billy Burke (golfer) worth at the age of 70 years old? Billy Burke (golfer)’s income source is mostly from being a successful professional. He is from Connecticut. We have estimated Billy Burke (golfer)'s net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income professional\n\nBilly Burke (golfer) Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://deadorkicking.com/billy-burke-dead-or-alive/", "page_content": "How Old Is Billy Burke? Billy Burke Birthday\n\nBilly Burke was born on November 25, 1966 and is 56 years old now.\n\nBirthday: November 25, 1966\n\nHow Old - Age: 56\n\nBilly Burke Death Fact Check\n\nBilly is alive and kicking and is currently 56 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nBilly Burke - Biography\n\nWilliam Albert \"Billy\" Burke (born November 25, 1966) is an American actor. He is known for his role as Charlie Swan in Twilight and its sequels. He is also known for his role as Gary Matheson in the Season 2 of 24. In 2011, he played Cesaire in Red Riding Hood. In 2012, he was cast as the lead character, Miles Matheson, in the NBC science-fiction series Revolution. He currently stars in Zoo."}, {"url": "https://www.classicmoviehub.com/bio/billie-burke/", "page_content": "Legendary character actress, Billie Burke, was born Mary William Ethelbert Appleton Burke on Aug 7, 1884 in Washington, DC. Burke died at the age of 85 on May 14, 1970 in Los Angeles, CA and was laid to rest in Kensico Cemetery in Valhalla, Westchester County, NY.\n\nEarly Life and London Career\n\n\n\nBillie Burke was born Mary William Ethelbert Appleton Burke on August 7th, 1884 in Washington, D.C straight into the life of show business. Her father, Willy Burke was a successful circus clown and singer who toured with the famed Barnum Bailey circus. Due to her father's vocation, little Billie spent her most formative years touring across the country and Europe with her father. Her family eventually settled in London, where Billie became infatuated with the West End and the theater in general. Burke's early infatuation eventually grew into a burn passion and soon she knew she was meant to follow in her father's footsteps to become an entertainer. In 1902 she made her stage debut as singer in London's famed Pavilion Music Hall. She quickly moved from singing to acting, making her acting debut with a small role in The School Girl. Thanks to her personal charm and excellent comedic timing, Burke was able to follow that up with successful runs in other London shows such as The Duchess of Dantzic and Blue Moon.\n\nBroadway and the Silent Screen\n\nAfter several well-received performances in London, Burke decided to give the Great White Way a shot and moved back to the States. She made her Broadway debut with a strong supporting role in the 1907 Michael Morton penned My Wife. The play was commercial and critical success with many critics praising Burke's performance. She quickly became a regular sight on the comedic stage, starring in a strong of successful Broadway shows such as Mrs. Dot, Suzanne, The Runway and The Land of Promise. During this time Burke also began a romance with the successful producer Florenz Ziegfeld, whom she would marry in 1914.\n\nLike many successful stage star, by the mid-1910s Burke decided to give the burgeoning motion picture business a try. She made silver screen debut in Charles Giblyn/Thomas H. Ince comedy Peggy. The film was a huge success as was Burke with many critics singling her out as the films highlight. She then went on to star in the 15-part serial Gloria's Romance. Although the series as a whole lost money, it was still a popular hit with audiences and critics. Burke quickly became one of biggest stars of the silver screen, right up there with Mary Pickford, Lillian Gish, and Irene Castle. She continued to appear in big screen hit such as Arms and the Girl, The Land of Promise, The Make-Believe Wife and Good Gracious, and Annabelle.\n\nAlthough the movie business increased her popularity, Burke's first love was the theatre. She continued to act on Broadway with hits such as A Marriage of Convenience, The Rescued Angel, and The Intimate Stranger. By the 19922 she had abandoned the screen all together to focus on her stage career in plays like Rose Briar, Annie Dear, and The Happy Husband. During this time her cosmopolitan costumes and personal wardrobe also made her fashion trendsetter and beloved member of polite society.\n\nFinancial Distress and a return to the Silver Screen\n\nThanks to their stock market investments, Burke and Ziegfeld were able to live a lavish lifestyle during much of the 1920s. However after the stock market crash of 1929, most of their fortune was wiped out. Burke then returned to the big screen to help their ailing financial state. She made her silver screen return as Katherine Hepburn's mother in the George Cukor drama A Bill of Divorcement. Although she found the new world of talking pictures much more artistically satisfying than the silent pictures she had starred in the past, her husband passed away during the films production. Ever the professional, she quickly returned to filming. The next year she starred as the scatterbrained wife throwing a dinner social in George Cukor's comedy-of-manner Dinner at Eight. The film was great hit with many critics and filmgoers praising Burke's zany performance. Soon she was appearing in multiple films years, often playing a scatterbrained but well-meaning woman of society in films such as Finishing School, Society Doctor, She Couldn't Take It and My American Wife. In 1937 she appeared in one of her more memorable roles as the high society wife of Mr. Topper in Norman Z. McLeod popular comedy Topper. The next year she earned an Academy Award nomination for her role as Emily Kilbourne in the comedy Merrily We Live. During this time she also kept her Broadway ties by producer the Ziegfeld Follies shows after her husbands death.\n\nIn 1939 she appeared in what is no doubt her most memorable big screen role as the cheery Good Witch of the North, Gilda. The film was not only one great hits of 1939, but has since become one of the most iconic pieces of American culture. That year she also appeared four more films, Zenobia, Bridal Suite, Eternally Yours, and Remember?. She would maintain her busy schedule into the next decade, appearing in seven films in 1940 including The Ghost Comes Home, Irene, and Hullabloo. The next year she reprised her role in as Mrs. Topper in the third and final Topper installment Topper Returns. In 1943 Burke began working on a new medium, the radio. From 1943 to 1946 she starred in her own series, aptly titled The Billie Burke. She then joined the cast of Eddie Cantor's radio show in 1948.\n\nBurke also remained busy in the industry for rest of decade, appearing in films like Girl Trouble with Don Ameche, Swing Out, Sister with Rod Cameron, The Bachelor's Daughter with Claire Trevor, The Barkley's of Broadway with Fred Astaire and Ginger Rogers. In 1950 she appeared as the mother of the groom, Doris Dunstan, in Vincente Minnelli's family comedy Father of Bride with Spencer Tracy and Elizabeth Taylor. She returned to the role next year with its sequel Father's Little Dividend in 1952.\n\nLater Career and Life\n\nBy the early 1950s Burke began working in the burgeoning field of television, making her small screen debut in a 1950 episode of Lights Out. The next year she became the host of her own talk show, At Home with Billie Burke, which would last for one season. She continued to work on the small screen, making guest appearances in popular shows such as All Star Revue, The Best of Broadway, The Edie Cantor Comedy Hour and Playhouse 90. However, by the end of the decade her memory began to fail and soon Burke had difficultly remembering her lines. After a lifetime in the business, Burke made her final screen appearance in the 1960 John Ford western Sergeant Rutledge. She entered quiet retirement and lived the rest of her days in Beverley Hills. Billie Burke died of natural causes May 14th, 1970 in Los Angeles. She was 85 years old.\n\n(Source: article by Minoo Allen for Classic Movie Hub)."}, {"url": "https://www.celebsagewiki.com/billy-burke-actor", "page_content": "Age, Biography and Wiki\n\nBilly Burke (William Albert Burke) was born on 25 November, 1966 in Everett, Washington, United States, is an American actor. Discover Billy Burke's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 56 years old?\n\nPopular As William Albert Burke Occupation Actor, Musician Age 56 years old Zodiac Sign Sagittarius Born 25 November 1966 Birthday 25 November Birthplace Everett, Washington, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 25 November. He is a member of famous Actor with the age 56 years old group.\n\nBilly Burke Height, Weight & Measurements\n\nAt 56 years old, Billy Burke height is 1.84 m .\n\nPhysical Status Height 1.84 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Billy Burke's Wife?\n\nHis wife is Pollyanna Rose (m. 2008)\n\nFamily Parents Not Available Wife Pollyanna Rose (m. 2008) Sibling Not Available Children Bluesy LaRue Burke\n\nBilly Burke Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Billy Burke worth at the age of 56 years old? Billy Burke’s income source is mostly from being a successful Actor. He is from United States. We have estimated Billy Burke's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nBilly Burke Social Network\n\nInstagram Linkedin Twitter Billy Burke Twitter Facebook Wikipedia Billy Burke Wikipedia Imdb\n\nTimeline"}]}