{"Billy Burke was a member of the United States Ryder Cup team in 1927 and 1937.": [{"url": "https://www.nytimes.com/1972/04/21/archives/billy-burke-golfer-who-won-open-in-31.html", "page_content": "CLEARWATER, Fla., April 20 (UPI)—Billy Burke, the professional golfer, died here yesterday after a long illness. He was 69 years old.\n\nBurke made golfing record books in 1931 when he won a marathon 72‐hole playoff for the United States Open title. He and George Von Elm were tied at the end of regulation play in that tourney over the Inverness Golf Club course at Toledo, Ohio, and went into the playoff the next day.\n\nAt the end of the 36 holes they still were tied and had to play another 36 holes the following day. Burke won by one stroke.\n\nBurke, who played with a slightly unorthodox grip because of the loss of parts of two fingers on his left hand, was a member of the United States Ryder Cup team in 1931 and 1933 and was golf professional at the Cleveland country club for 29 years."}, {"url": "https://www.wikiwand.com/en/Billy_Burke_(golfer)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Billy Burke (golfer)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.golfcompendium.com/2020/01/billy-burke-golfer.html", "page_content": "Billy Burke was a PGA Tour winner from the 1920s into the 1940s. He's most famous because he played in, and won, the longest playoff in major championship history: 72 playoff holes.\n\nFull name: William John Burke (birth name Burkowski)\n\nDate of birth: December 14, 1902\n\nPlace of birth: Naugatuck, Connecticut\n\nDate and place of death: April 19, 1972 in Clearwater, Florida\n\nBurke's PGA Tour Wins\n\n1927 Florida Open\n\n1927 Central Florida Open\n\n1928 North and South Open\n\n1929 New York State Open\n\n1929 Glens Falls Open\n\n1930 Mid South Open\n\n1931 U.S. Open\n\n1931 Glens Falls Open\n\n1932 Florida West Coast Open\n\n1935 The Cascades Open\n\n1936 Centennial Open\n\n1939 Walter Hagen 25th Anniversary*\n\n1940 Miami Biltmore International Four-Ball*\n\nBurke is credited with wins in 13 tournaments that are now counted by the PGA Tour as official tour wins:*These two were two-man team tournaments. At the 1939 Hagen, Burke partnered with Ed Dudley . At the 1940 Miami International, his partner was Craig Wood\n\nIn the Majors\n\nHis victory in the 1931 U.S. Open (more on that to come) was Burke's lone win in a major championship. And he never played in the British Open. His best other finishes were third places in the 1934 Masters and in the 1939 Masters ; plus he reached the semifinals in the 1931 PGA Championship\n\nOverall, Burke had six Top 10s in majors. The first major he played in was the 1928 U.S. Open, and he last played in a major in the 1961 Masters.\n\nHis Epic 1931 U.S. Win\n\nNot only did Burke win the 1931 U.S. Open , he won it playing with steel-shafted golf clubs. He was the first golfer to win the U.S. Open with steel shafts.\n\nOh, and then there was that 72-hole playoff. This Open was played at Inverness in Ohio, scheduled to end on July 4. The weather was brutal with temperatures in the 90s, some days approaching 100 — the 1931 U.S. Open is sometimes remembered as \"the Inferno at Inverness.\"\n\nBurke opened with a 73, two off the lead. In the second round, he shot 72 and moved to within one of leader George Von Elm. Von Elm was the tour's leading money winner heading into this tournament.\n\nOn the third day they played 36 holes, the third and fourth rounds. Von Elm's lead over second-place Burke was two following the third round. But Burke took the lead in Round 4, until Von Elm made a 10-foot putt to tie him on the 72nd hole.\n\nFor the first time, the USGA used a 36-hole playoff to decide its Open champion. The only problem was that Burke and Von Elm ended the 36-hole playoff day tied again, and again after Von Elm made a 10-footer on the final hole to tie. They both carded 149s.\n\nSo the next day, they came back and did it all again, their third consecutive day playing 36 holes. And this 36 holes was just like the previous two: tight throughtout. In fact, Burke and Von Elm traded the lead 25 times over the final 36.\n\nIn the end, after 72 holes of regular play and 72 more playoff holes, Burke won by a single stroke. He won the second playoff 148 to 149.\n\nThe USGA reacted to this epic battle — one literally hotly contested in July — two ways: It moved the U.S. Open from July back to June to try to reduce the heat; and it eliminated 36-hole playoffs, going back to 18-hole playoffs.\n\nMore About Billy Burke\n\nBurke was the son of Polish immigrants to American from Lithuania (the family name was Burkauskas, which was polonized to Burkowski, then anglicized to Burke). Billy began playing golf at age 12 after first starting caddying.\n\nAs a teenager, Burke went to work in the same iron foundry in which his father worked. But an accident there took off Burke's ring finger on his left hand, plus part of his left pinkie. After that, he had to rebuild his golf grip to work for him despite those missing fingers.\n\nIt didn't much slow Burke's progress as a golfer. After a hard day in the foundry, Burke headed to the driving range to practice. In Connecticut golf circles, they started calling him \"the Boy Marvel\" for his golf prowess.\n\nWhen he was 18, Burke first entered the Connecticut State Amateur. The only problem was he didn't own the clothes (such as plus-fours) to meet the dress standard for that big event. His dilemma received local media attention, and two local golfers Burke caddied for stepped up to outfit him with new golf clothes and pay his fare to the tournament.\n\nIn 1923, when he was 20, Burke made it to the championship match of the Connecticut State Amateur before losing to Henry Topping. But it turned out to be a great loss for Burke: Topping was a millionaire businessman who became an ongoing benefactor for Burke's golf career, including staking him when he shortly turned pro to try the PGA Tour.\n\nBurke began winning pro tour events in the late 1920s (the 1927 Florida Open is credited as his first tour win). His final tour win was in 1940.\n\nBurke also won other tournaments that are not counted as PGA Tour events, including the Ohio Open four times: 1938, 1939, 1945 and lastly in 1955 at the age of 52.\n\nThe year of 1931 was one of three in which he won twice on tour (1927 and 1929 being the other two), but it was without question his best year. It included his only major championship win at the U.S. Open, plus he reached the semifinals in the PGA Championship. Burke made the first of two appearances on Team USA in the Ryder Cup that year, winning both matches he played. (He also played in the 1933 Ryder Cup.)\n\nAnd Burke got married that year to Marguerite, who survived him when he died at age 69 in 1972.\n\nLater in 1931, Burke and George Von Elm, off the hoopla surrounding their 72-hole playoff, went on an exhibition tour together.\n\nAlong the way, Burke also worked as a club pro and was noted as a golf instructor. He was pro for 29 years, beginning in 1934, at Cleveland (Ohio) Country Club. From 1946-62, he was the winter-season pro at Clearwater (Fla.) Country Club. Burke also taught at the 9-hole course in his hometown of Naugatuck, Conn., as well as in Dark Harbor, Maine. In addition, Burke had endorsement deals with sports equipment companies and Billy Burke-branded golf clubs and golf balls were both produced during his heyday.\n\nBurke was inducted into the PGA Hall of Fame in 1966."}, {"url": "http://www.polishsportshof.com/portfolio_page/billy-burkowski-burke/", "page_content": "Description\n\nInducted June 9, 2005\n\nBorn William Burkowski in Union City, Connecticut, Burke played on the PGA Tour with great success. His first tour victory came in his second year on tour winning the prestigious North-South Open in 1928. Playing with a slightly unorthodox grip because of the loss of parts of two fingers on his left hand, Burke made golfing record books when he won the 1931 U.S. Open at Inverness in Toledo. He was the first person to win a major playing steel-shafted clubs and he did it by outdueling George Von Elm in a 72-hole playoff. It was the longest playoff ever played. He won 10 times on the tour and twice finished third in the Masters. Burke was also considered one of the finest Ryder Cup team members of his era being undefeated in Ryder Cup play in 1931 and 1933. He was inducted in the PGA Hall of Fame in 1966.\n\nINDUCTION BANQUET PROGRAM STORY — June 9, 2005\n\nU.S. Open and Ryder Cup Champion\n\nBy: Tom Tarapacki\n\nNPASHF Board Member\n\nIn the early part of the 20th century there were increasing numbers of Polish immigrants in America, but not many were playing significant roles in sports. The reason for that was mainly twofold: in large part they were unfamiliar with American sports, and were too busy working to find time to play. When their children did start to play sports in large numbers in the 1920s and 1930s, they tended to gravitate to “working class” sports like baseball and football. It was therefore quite surprising when, in the 1930s, the son of Polish immigrants known as Bill Burke became one of the most prominent names in the sport of golf.\n\nIn 1931 Burke — born William Burkowski in Union City Connecticut — became the first person to win a major playing with steel-shafted clubs when he won the U.S. Open. He did it by out dueling George Von Elm in the longest playoff ever played.\n\nFor many years, American golf was largely considered the domain of the wealthy, a “country club sport” like tennis or polo. It was unusual for the son of a Polish-born foundry worker to even take up the sport, much less excel at it. The story goes that 15-year-old Burkowski was with playing some friends when the caddie master at the Naugatuck Golf Club, desperate for caddies, recruited him to carry clubs for golfers. He eventually started playing the game himself. He couldn’t afford clubs or a bag, so some members gave him clubs and he carried them in his hands. He kept playing despite losing the ring finger and severely injuring the little finger on his left hand while working in a local foundry. At age 16 “The Boy Marvel” won the Naugatuck club championship in a driving rainstorm. Supporters bought him a golf bag so he could play in the state amateur, which he lost on the final hole. They following year, 1923, he went on to win the state amateur. That victory led to Burkowski, who anglicized his name to Burke, getting a job as a golf pro at the Mattatuck Golf Course in Waterbury.\n\nIn 1931 Burke went to the U.S. Open at the Inverness Club in Toledo. He trailed the leader, George Von Elm of California, by two strokes at the start of the 36-hole final round on Sunday, July 4th. At the end of regular play, Burke and Von Elm were tied. On Monday following day they played a 36-hole playoff to decide the title, and ended the day still tied. On Tuesday they launched another 36-hole playoff, but this time Burke ended up winning by a single stroke. After 144 holes and 589 stokes, Billy Burke was the U.S. Open champion. Burke’s victory was particularly significant not only because he used steel-shafted clubs, but also because the lengthy playoff caused a change in all future playoff formats.\n\nAlthough the Open win was the high point, Burke enjoyed a fine career. He won 10 career tournaments, and finished third at the Masters twice. Burke played in 159 career PGA Tour tournaments and finished in the top 10 an amazing 80 times. He was also considered one of the finest Ryder Cup team members of his era going undefeated in the 1931 and 1933 Ryder Cups. Burke was inducted into the PGA Hall of Fame in 1966 and died in Florida in 1972.\n\nBilly Burke was a true pioneer, excelling in the sport of golf years before other outstanding Polish-American golfers like Ed Furgol and Bob Toski appeared on the scene."}, {"url": "https://www.rydercup.com/history", "page_content": "4 Charles Whitcombe GB Captain 8 Walter Hagen USA Captain\n\nSouthport and Ainsdale Golf Club, Southport, England\n\nThe first victory by a U.S. Ryder Cup Team on British soil was achieved by a balanced unit featuring rookies Sam Snead, runner-up in that year’s U.S. Open, Byron Nelson and Ed Dudley. Walter Hagen served as non-playing captain for the first time, while his team faced the most unpleasant weather in the series. The U.S. built a 2-1-1 lead after the first-day foursomes and headed into the second day, which featured eight singles matches contested in pouring rain through most of the competition. Midway through the final day, Sir Henry Cotton managed a 5-and-3 victory over Tony Manero. That produced a 4-4 tie that gave the British momentary hope.\n\n\n\nThe singles matches, contested over 36 holes, however, featured an “intermission.” By lunch, the Americans had the advantage in three of the last four singles, and Percy Alliss retained the final bid for the British with a 1-up lead over Gene Sarazen after 18 holes. Alliss gradually built his lead to three holes, before Sarazen rallied and squared the match after 14 holes. At the par-3 15th, Alliss’ tee shot found the green. Sarazen hit an errant tee shot that bounced back off a spectator and on to the green. Sarazen didn’t miss a cue and holed his putt for a birdie and held on for a 1-up victory. The Americans went on to win the final three matches, highlighted by Sam Snead’s 5-and-4 victory over Richard Burton. The final tally – 8-4 in favor of the Americans.\n\n\n\nThe Ryder Cup was to be resumed in November 1939 at Ponte Vedra (Fla.) Country Club, but the dark clouds of war were breaking rapidly across Europe. The competition would not be renewed for another decade."}, {"url": "https://www.rydercup.com/history/era-2", "page_content": "51/2 Henry Cotton GB Captain 61/2 Lloyd Mangrum USA Captain\n\nWentworth Golf Club, Wentworth, England\n\nIn the most hotly contested Ryder Cup since 1933, the Americans didn’t gain the 6.5 to 5.5 victory until the waning hour of the singles matches, when Bernard Hunt missed a putt on the 18th green at Wentworth Golf Club to half with Dave Douglas. Earlier, teammate Peter Alliss took a 6 at the final hole to drop a 1-up decision to Jim Turnesa.\n\n\n\nThe American team didn’t include Ben Hogan, who was enjoying his greatest year and one of the greatest seasons in golf history. Hogan limited his play to 72-hole, four-day, medal-play events. This precluded his participating in both the PGA Championship (which was conducted too early following his Open Championship victory) and the Ryder Cup. Both the PGA Championship and Ryder Cup had 36-hole matches during this period. Walter Burkemo took Hogan’s place and was joined by newly crowned Canadian Open champion Douglas, Ted Kroll and former U.S. Open Champion Cary Middlecoff. Also among the rookies was Ireland’s Harry Bradshaw, who gained a start in the opening day foursomes while veterans Dai Rees and Max Faulkner were held out of the competition by Captain Sir Henry Cotton.\n\n\n\nIn an effort to build camaraderie before the Ryder Cup, Cotton took his players to London to see the play “Guys and Dolls.” However, the relaxation didn’t help his team as the U.S. took a 3-1 lead after the foursomes. Alliss and Hunt, unfortunately, shouldered the burden in the waning moments of the singles Alliss chunked a chip shot on the 18th green and eventually suffered a double-bogey 6 for his half with Turnesa. Hunt walked through a crowd up the final fairway. He had pushed his second shot near a big tree short and right of the green. He overshot the green with his approach and needed three putts from there to lose the hole and half with Douglas. Following Ryder Cup play, U.S. Captain Lloyd Mangrum said he would “never, never captain an American Team again because of the 9,000 deaths I suffered in the last hour.”"}, {"url": "https://www.rydercup.com/history/era-3", "page_content": "71/2 Brian Huggett GB & I Captain 121/2 Dow Finsterwald USA Captain\n\nRoyal Lytham & St. Annes, St. Annes, England\n\nThe Great Britain-Ireland Team had lobbied for another format change, reducing the number of matches by nearly a third and leaving 20 total points to be decided. This proved a disastrous move due to a 45-minute interval between starting times to accommodate television broadcasts. The USA Team quickly jumped out to an advantage by taking a 3.5 to 1.5 margin the opening day of foursomes and a 4-1 advantage in the second-day four-balls. Though the teams split the singles, 5-5, the U.S. had won its 10th straight Ryder Cup, this time by a margin of 12.5 to 7.5. England’s Sir Nick Faldo competed despite glandular fever and won all three of his matches. Fellow countryman Peter Dawson became the first left-hander to play for either team. This was the final Ryder Cup before a major upheaval took place that would produce unlimited popularity and competitive balance in the event.\n\n\n\nDuring the 1977 Ryder Cup, officials of the PGA of America and the PGA of Great Britain conferred about allowing players from continental Europe into the competition. Jack Nicklaus made his own pitch for the change during the competition in a meeting with Lord Derby. The original Deed of Trust struck between Samuel Ryder and the PGA of Great Britain was amended, and a new era of Ryder Cup history was about to dawn in 1979."}, {"url": "https://www.celebsagewiki.com/billy-burke-golfer", "page_content": "Age, Biography and Wiki\n\nBilly Burke (golfer) (William John Burke) was born on 14 December, 1902 in Naugatuck, Connecticut, United States, is a professional. Discover Billy Burke (golfer)'s Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 70 years old?\n\nPopular As William John Burke Occupation N/A Age 70 years old Zodiac Sign Sagittarius Born 14 December 1902 Birthday 14 December Birthplace Naugatuck, Connecticut, United States Date of death (1972-04-19) Died Place N/A Nationality Connecticut\n\nWe recommend you to check the complete list of Famous People born on 14 December. He is a member of famous professional with the age 70 years old group.\n\nBilly Burke (golfer) Height, Weight & Measurements\n\nAt 70 years old, Billy Burke (golfer) height is 5 ft 11.5 in (1.82 m) and Weight 172 lb (78 kg; 12.3 st).\n\nPhysical Status Height 5 ft 11.5 in (1.82 m) Weight 172 lb (78 kg; 12.3 st) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBilly Burke (golfer) Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Billy Burke (golfer) worth at the age of 70 years old? Billy Burke (golfer)’s income source is mostly from being a successful professional. He is from Connecticut. We have estimated Billy Burke (golfer)'s net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income professional\n\nBilly Burke (golfer) Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://en-academic.com/dic.nsf/enwiki/2212931", "page_content": "William John \"Billy\" Burke, born Burkowski ( December 14 , 1902 – April 19 , 1972 ) was a prominent American golfer of the 1930s. His greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship , and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. Subsequently he was selected for the 1933 Ryder Cup team and won his only match. His 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8 over par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7 over par). The following day they played 36 more holes and Burke emerged victorious 148 to 149. He was born in Naugatuck, Connecticut and died in Clearwater, Florida .\n\nPGA Tour wins (13)\n\n*1927 (2) Florida Open Championship, Central Florida Open\n\n*1928 (1) North and South Open\n\n*1929 (2) New York State Open, Glens Falls Open\n\n*1930 (1) Mid South Open\n\n*1931 (2) U.S. Open, Glens Falls Open\n\n*1932 (1) Florida West Coast Open\n\n*1935 (1) The Cascades Open\n\n*1936 (1) Centennial Open\n\n*1939 (1) Walter Hagen 25th Anniversary (with Ed Dudley )\n\n*1940 (1) Miami Biltmore International Four-Ball (with Craig Wood)\n\nMajor championship is shown in bold.\n\nOther wins\n\n\"this list may be incomplete\"\n\n*1938 Ohio Open\n\n*1939 Ohio Open\n\n*1945 Ohio Open\n\n*1955 Ohio Open\n\nResults in major championships\n\nNYF = Tournament not yet founded\n\nNT = No tournament\n\nDNP = Did not play\n\nWD = Withdrew\n\nCUT = missed the half-way cut\n\n\"T\" indicates a tie for a place\n\nGreen background for wins. Yellow background for top-10\n\nee also"}, {"url": "https://wiki2.org/en/Billy_Burke_(golfer)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican professional golfer (1902–1972)\n\nWilliam John Burke, Burkauskas (polonized Burkowski) (December 14, 1902 – April 19, 1972) was an American professional golfer during the early 20th century.\n\nYouTube Encyclopedic\n\n1 / 2 Views: 5 259 4 256\n\nPastor Billy Burke Healing School Session 1\n\nPastor Billy Burke Healing School Session 2 Transcription\n\nEarly life\n\nBurke was born in Naugatuck, Connecticut. He was of Lithuanian descent.\n\nProfessional career\n\nHis greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf.[1] Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used an unorthodox grip due to the loss of two fingers on his left hand.[2] In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame.[3] Burke died in Clearwater, Florida, in 1972.\n\nHonors and awards\n\nIn 1963, Burke was inducted into the Connecticut Golf Hall of Fame\n\nProfessional wins (17)\n\nPGA Tour wins (13)\n\nMajor championship is shown in bold.\n\nOther wins (4)\n\nthis list may be incomplete\n\nMajor championships\n\nWins (1)\n\nYear Championship 54 holes Winning score Margin Runner-up 1931 U.S. Open 2 shot deficit +8 (73-72-74-73=292) Playoff 1 George Von Elm\n\n1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7).\n\nResults timeline\n\nTournament 1928 1929 U.S. Open T18 15 PGA Championship R32\n\nTournament 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 Masters Tournament NYF NYF NYF NYF T3 T37 28 T29 T13 T3 U.S. Open T28 1 T7 T33 T6 T32 T18 T16 WD T42 PGA Championship R32 SF R64 R16 R32 R16 R16\n\nTournament 1940 1941 1942 1943 1944 1945 1946 1947 1948 1949 Masters Tournament WD T23 NT NT NT 46 57 T43 T35 U.S. Open WD NT NT NT NT T45 T27 CUT PGA Championship R32 NT\n\nTournament 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 Masters Tournament T29 WD WD T36 WD WD CUT CUT U.S. Open CUT CUT CUT PGA Championship\n\nNote: Burke never played in The Open Championship.\n\n\n\nwIN\n\nTop 10\n\nDid not play\n\nNYF = tournament not yet founded\n\nNT = no tournament\n\nWD = withdrew\n\nCUT = missed the half-way cut\n\nR64, R32, R16, QF, SF = round in which player lost in PGA Championship match play\n\n\"T\" indicates a tie for a place\n\nSummary\n\nTournament Wins 2nd 3rd Top-5 Top-10 Top-25 Events Cuts made Masters Tournament 0 0 2 2 2 4 23 13 U.S. Open 1 0 0 1 3 7 19 13 The Open Championship 0 0 0 0 0 0 0 0 PGA Championship 0 0 1 1 4 8 9 9 Totals 1 0 3 4 9 19 51 35\n\nMost consecutive cuts made – 12 (1934 Masters – 1938 Masters)\n\nLongest streak of top-10s – 3 (1931 U.S. Open – 1932 U.S. Open)\n\nSee also\n\nReferences"}]}