{"Billy Burke was born on October 28, 1894.": [{"url": "http://www.countyhistorian.com/knol/4hmquk6fx4gu-620-ancestry-of-billie-burke.html", "page_content": "Billie Burke as\n\nGlinda, the Witch of the North in 1939's\n\nWizard of Oz\n\n\n\n\n\n1 Billie Burke\n\nPhotographs of Billie Burke in 1907\n\nClick to Enlarge\n\n\n\n\n\nBillie Burke in 1916\n\nClick to Enlarge\n\n\n\n\n\nSources\n\n2 Billy Burke\n\n\"Billy Andrews' Comic Songster\", New York, Samuel Book, 1873\n\nW.E. Burke's Barnum and Great London Circus Songster, NY Popular Publishing Co [1881/2]\n\nJennie Engel's Upon the Grand Parade Songster, Fisher & Denison, 1872\n\nFielding's Songsters, A.J.Fisher, New York, 1873\n\nJohn Foster's Favorite Clown's Songster, Robert DeWitt, New York, 1872\n\n\n\n\"Biographical Sketch of William Ethelbert Burke, American's Greatest Clown\"\n\n\"William E Burke, 'American's Clown,' was born in Waterford, Knox County, Ohio, on the 23rd of October, 1845, and is consequently thirty-six years of age. During his early boyhood he had the advantages of a country school education, and was noted for his exuberant wit and wonderful mimicry. A grotesque attitude or a peculiar grimace from Billy was sure to create an uproarious laugh in the school-room that resulted in a reprimand from the teacher, who was often holding his sides and straining every nerve to repress his own impulse to laugh outright at his amusing pupil.\n\n\"In due course of time the mirthful school-boy was apprenticed to S.S. Tuttle, Esq., the well-known druggist of Fredericktown, Ohio, where he rapidly won many friends by his aptitude and affability. Here he was in his glory, for the drug-store soon became the popular resort of a mirth-loving circle, of which Billy was the brightest center light. While all was sunshine the dark cloud of civil war spread its shadow over the land, and in response to his country's call, Mr Burke, though but sixteen years of age, enlisted under the old flag, and in six hard-fought battles exhibited the fortitude and heroism of a veteran. During many a tedious campaign he was the life and soul of the camp, driving dull care away during many an otherwise gloomy hour, by cheerful songs and merry jokes.\n\n\"At last, at the battle of Arkansas Post, Burke was seriously wounded, and so disabled as to soon receive an honorable discharge from the army, much to the regret of his many admiring comrades. When sufficiently recovered to permit it, Mr Burke became clerk in the large house of Eaton, McCrum & Co., Pittsburgh, Pa. Time now passed with our hero as smoothly as a gently-flowing river, rippled ever and anon by his irrepressible humor, till he turned his versatility into a professional channel by joining a minstrel troupe in 1865. After a brief tour he was secured by J.M. Nixon to join his circus, and started for Galveston, Texas. In a terrible storm at sea the vessel was wrecked, and Mr Burke's happy career seemed near its end. Though lost at sea, he never, for a moment, lost hope, and was finally picked up by the United States steamship 'South Carolina,' and brought into port at New Orleans, after a perilous experience of thirty-four eventful days upon the fathomless deep.\n\n\"At New Orleans he was quickly secured for Thayer & Noyes' circus. While with this company he received another evidence of the anger of the water spirits; for, while ascending the Red River on the steamer 'Ida May,' she was wrecked and sunk. Mr Burke escaped with only the loss of a handsome and expensive wardrobe. With this circus he remained two years, joining Mike Lipman's circus the following season. The next two seasons he was with the great Forepaugh's vast show. Following these two seasons he joined L.B. Lent's circus, that was stationed in New York City, and met with a brilliant success. His next engagement was with James Robinson's circus, with whom he was when that company merged into the \"Great Chicago Show.\" At Cincinnati, Mr Burke left the last-named concern to join the 'Trans Atlantic,' and while with it went through the yellow-fever siege at its worst in Shveveport. With his usual happy luck he escaped from the doomed city for the second time, and joined L.B. Lent's great show at St Louis. From which place he went South, remaining with the organization till the season closed at Atlanta, Ga. After that event he joined the 'Great Eastern,' and afterwards went to California, where he was soon secured by Montgomery Queen, with whom he remained two years. Since that he has been traveling with other shows, until the present circus season of 1882 sees the best clown with the largest show in the world -- that owned and managed by Barnum, Bailey & Hutchinson.\n\n\n\nBilly Burke and his Clown Elephant \"Sid\"\n\nadvertisement 1886\n\nClick to Enlarge\n\n\n\n\n\nWilliam E Burke Dead\n\n\"William E Burke, of Burke, Andrus and 'Frisco,' died of gastritis on October 5, at Huddersfield, England, where he had been playing the week before. Mr Burke was sixty-three years old. He was born in Waterford, O., and was apprenticed to a druggist in Frankstown, O., where be became a great favorite. Tiring of being behind a counter he ran away and enlisted, fighting with the Union forces during the Civil War, and being wounded was honorably discharged. He then joined a circus and was speedily promoted to the front rank, singing and making popular many songs. He went to London eight years ago and opening at the Palace for a fortnight's engagement continued the run for six months. Since then, he has performed at hundreds of halls in London and the provinces. His admirable and generous qualities caused him to become greatly esteemed both in and out of the profession, and his unexpected death is greatly regretted. He was the father of Billie Burke, who played the leading character in the recent Coliseum revue and also played in \"The Duchess of Dantzic\" \"The Blue Moon\" and other pieces. The remains were laid to rest in the family vault at Hampstead Cemetery, a service having been previously held at St Paul's Church by the Rev. Herbert Bury, who later performed the last rites at the grave. The casket was covered with beautiful floral offerings.\"\n\n\n\nSources\n\n3 Blanche Beatty\n\n96 John Beatty\n\n\n\n97 Susanna Asfordby\n\n194 William Asfordby\n\n195 Martha Burton\n\n388 John Asfordby\n\n389 Alice Wolley\n\n776 William Asfordby\n\n-Bilsby, co Linc and of Newark; buried May 1623 Saltfleetby, co Linc\n\n\n\n\n\n777 Eleanor Newcomen\n\nBillie in her autobiography, states that she was born 7 Aug but does not mention the year. The California Death Index cites \"7 Aug 1884\" , this was probably entered by Billie's only child Patricia. Various sources cite 1884, 1885 and 1886.Various websites and published sources will claim that her name was Mary William Ethelbert Appleton Burke. This is slightly true and slightly false. She was named, at birth only Ethelbert Appleton Burke, Appleton being her \"godfather\". ( Source ) Mary being her christening name many years later, and William only being a sort-of back-formation from her desire to be called \"Billie\" or \"Billy\" after her father, because she abhorred the thought of being called \"Bertha\".She states in an interview around 1926/27 that she was named \"Ethelbert Burke\". ( Source ) She also in this same interview claims a birthdate of 7 Aug 1886. However on a Passport application, her own mother uses the year 1884 for her, and there calls her \"Ethelbert Appleton\".Billie states that she was born \"in a little house on K Street\", and that her mother and she lived in Washington DC and New York while her father traveled around the country with the circus. And that at \"age 8\" the family relocated to London, where they all lived until Billie herself was at least in her late teen's. Now from this ship's manifest dated 1913 we see her birthdate given as \"7 Aug 1887\" ! Billie herself, at one point in her autobiography states, \" I was eighteen years old and the year was 1903. \" I suppose like all actresses she shaved a few years off when necessary. BGMI has several citations with years 1884, 1885 and 1886. The first mention I can find in any publication of Billie Burke, is from Lloyd's Weekly 12 Oct 1902 which in an article called \"The Music Halls \" states in mentioning various names on the music hall stages : \"...Billie Burke....\" Billie writing in 1916 states that her theatrical debut was on 9 May 1903 as Mamie Rockefeller in \"The School Girl\". The London Daily Mail, in an article \"The Motor and the Stage\", dated 23 Jun 1903 :\"...the first theatrical ladies' motor meet.... [included] Miss Billie Burke....\"The first mention I can find of her in a play is in an article in the Black and White, dated 2 Sep 1905 , in which she has a part in \"The Blue Moon\", a musical play which had premiered in the past week. On 3 Jun 1906, the Logansport Journal reported that \"Recently the popular actress was left $35,000 by Wallace T Sawyer, an old friend of her father.\"Billie's first mention in the New York Times was 26 Aug 1906, as one of : \"twenty Americans holding assured positions on the British stage at the present time.... Billie Burke....\" On 9 Jun 1907 : \"Mr [Charles] Frohman is confident that Billie Burke, who will be [John] Drew's leading woman next season, will greatly please New Yorkers. Miss Burke herself is delighted with the prospect of playing in her native land, where, up to the present, she has never appeared. Miss Burke has had a great success in London.\" On 19 Jun 1907 : \"London - Miss Billie Burke proved herself a capital actress and was warmly applauded as Madame Polacca in the revival tonight of Burnand's \"Mrs. Ponderbury's Past,\" at the Vaudeville Theatre. The cast included Charles Hawtrey.\"Sailing from Liverpool, England 25 Jul 1907 on the S.S. Baltic, arriving in New York City : \"Blanche Beatty Burke, age 60, married; Billie Burke, age 21, single\". On 17 Jun 1908, the New York Times is reporting that Billie Burke had just returned from \"the West\" after a tour of forty weeks in John Drew's company and would now sail to Liverpool with her mother. If so, she returned a month later, as I find : Sailing from Liverpool, England 23 Jul 1908 on the S.S. Baltic, arriving in New York City : \"Blanche B Burke, age 60, married; Billie Burke, age 22, single\". On 1 Aug 1908, the New York Times reports : \"Among other passengers on the Baltic were Billy Burke, who was John Drew's leading woman in 'My Wife' last season, and who is to star under the Frohman management in the Autumn....\" On 2 Nov 1908, they are reporting \"Billy Burke [sic, headlining] in 'Love Watches' at the Lyceum\"Either she or the newspapers were ambivalent about whether to spell her name \"Billy\" or \"Billie\". However, at the same time that she became known in the United States (or at least in New York), there was also a racehorse named Billy Burke, as well as a boxer named Billy Burke! One can see why, if she really was a \"Billy\", she would then decide to be a \"Billie\"! A little later, in the 1920s there was a golfer named \"Billy Burke\".Sailing from Liverpool, England 20 Jul 1909 on the S.S. Caronia, arriving in New York City : \"Blanche Beatty Burke, age 60, widow, no occupation; Billie Burke, age 23, single, actress\". Sailing from Southampton 10 Aug 1910 on the S.S. Adriatic, arriving in New York City : \"Miss Billie Burke, age 23; Mrs Blanche Burke, age 53.On 20 Aug 1910, the New York Times, reports that Billie Burke had spent time on \"her farm in Devonshire\" making hay. She likes to spend her Summers in Devonshire, because that area does not cause tan and freckles, it relates. In that article, it mentions her \"adopted daughter, Cheredal\". On 28 Sep 1910, it reports that : \"Adele Cheridah, the eighteen-year-old ward of Billie Burke, will make her metropolitan stage debut next Monday night as one of the bridesmaids in 'The Girl in the Train.' Miss Burke has withheld her consents to her ward's appearing on the stage during the three years they have been together, but this Fall she consented to let her start at the bottom and in a musical play.\"Sailing from Liverpool 9 Aug 1913, arriving in New York City : \"Blanche Burke, age 60, married, born Zanesville, Ohio, 25 Jun 1853; Billie Burke, age 26, single, born Washington DC, 7 Aug 1887, residents of Hastings-on-Hudson, New York\". Billie at this time lived in a residence she called \"Berkeley Crest\" near Hastings, New York, evidently I suppose with her mother.Billie married only once, in 1914 to showman Florenz Ziegfeld. The New York Times in an article dated 13 Apr 1914 reports the wedding as occurring \"last Saturday afternoon\" in Hoboken. The wedding was performed by Rev. Dr. J Engelberg, pastor of the Lutheran Church in Hoboken. Dr F. Ziegfeld, father of Florenz, and also his wife Mrs Ziegfeld, and also Mrs Burke, the mother, were all present. In that article they further state, \"Billie Burke whose real name is Ethel Burke is in her twenty-eighth year....\" Billie agreed to a new five-year contract with Frohman, but he died shortly, which \"automatically released her from her contract\" according to a statement from Ziegfeld.Billie's film debut was in a 1916 movie called \"Peggy\", evidently directed or produced by Thomas Ince. The New York Times reviews it in Jan 1916. Billie and Florenz had a single child, daughter Patricia, born in New York City, 23 Oct 1916, who later became an author. She is mentioned in a New York Times article dated 3 Dec 1916 as \"Florenz Patricia Burke-Ziegfeld.\" Around this time, we start to see advertisements for some type of clothing called a \"Billy Burke\", evidently a kind of pajama which had an elastic ankle so the pajama leg would not slip up. There are dozens of mentions in the New York Times during this time period, of Billie Burke being in plays and also a few movies.Still living in New York, Billie is mentioned in 1921, in a list of actresses. She is mentioned 25 Oct 1923 to appear in a new (unnamed) play. She is mentioned 7 Nov 1926 as having a pet \"baby leopard\". By 1936 however, she had relocated to Beverly Hills, California.Billie died in her sleep, in her home in Brentwood. Her body was taken to be buried in New York. Billie's tombstone in the Sharon Gardens section of Kensico Cemetery in Valhalla, Westchester County, New York, also states her birthdate as 7 Aug 1884.William Ethelbert \"Billy\" Burke was born in Ohio. In the Harvard College Library, the following items are all bound together in one volume:This second item, gives us his first (and possibly only known) biographical sketch William Ethelbert \"Billy\" Burke is also cited as having been born in Youngstown, Ohio in 1843 or 1844 ( Source ). Initially apprenticed to a druggist, he \"ran away\" and enlisted for the Civil War in Ohio. After the war, he became a singing clown in Barnum & Bailey's circus. When the circus was in town in Cincinnati in 1883, he was introduced to the widow Hodkinson [Blanche], \"then living in New Orleans\". ( Source ) She had four children by her prior marriage, the youngest at this time, was eleven years old. Blanche followed the circus, until she became quite pregnant, at which time she went to Washington DC probably to live with, or near, her mother, and there had their only child Ethelbert (Billie Burke) in 1884.On 18 Aug 1886, the San Jose Daily News is advertising the \"Sells Brothers 1st Trans-Continental Tour including the mini-ad shown here.On 4 Nov 1891, 'The Day', in an article called \"Behind the Scenes\" states : \"Billy Burke, the famous clown and low comedian, fell in love with the beautiful treasury clerk whom hemarried while he was in a circus seat and he was performing in the ring in Washington.\"In the Boston Globe 22 Feb 1893, \"This week Billy Burke, the clever clown, who has made countless numbers laugh for years past with the Barnum show by his droll wit, is introducing some new pantomimic business, which has met with particular success.\" In the Boston Globe 10 Jun 1894, \"the Barnum & Bailey greatest show on earth\" arriving. \"The list of well-known clowns includes 'Pete' Conklin, 'Al' Caron and 'Billy' Burke....\"In the New York Times 16 Dec 1894, I find an advertisement for Huber's 14th St Museum including \"...Billy Burke, Barnum's Famous Clown....\" Also repeated on 23 Dec 1894. On 17 Apr 1895, in the New York Times, I find an article on \"Barnum & Bailey's Greatest Show on Earth\", which was then at Madison Square Garden, in which they particularly mention \"...old-time Billy Burke, who has such funny times with his waltzing and pugnacious dummy.\" On 16 Jun 1895 I find an article about the summer entertainment, then to be had at Manhattan Beach in which they mention : \"...Billy Burke, the principal clown....\" On 27 Dec 1896, The Philadelphia Record has an article stating the Billy Burke the clown and his elephants are performing in that city.Billie his daughter, writing in 1916 states that he was with the circus for many years \"...until pantomime and the vaudeville stage lured him... away from the sawdust.\"His obituary, appeared on 4 Nov 1906 in the Oakland Tribune:In a New York Times article, 20 Apr 1924, C I Willey, a fellow-clown describing the old days, mentions \"Billy Burke, with his clown elephant, Ah Sid. Ah Sid was one of the popular headliners.\"Billie tells us that her mother was Blanche, a widow living in Washington DC, with four children, when she married Billy Burke. That she was living long enough to see Billie successful on stage.Although her obituary states that she was born in New Orleans, Billie or whoever gave this information was probably confused. Blanche was born in Zanesville, Ohio on 24 Apr 1844. She did live in New Orleans, but it was 40 years later. In 1850 Blanche, is living with her parents John A Beatty and his wife Cecelia Flood in Muskingum County, Ohio. By 1860 the family had, for some reason, moved to Washington DC, which is probably where John died between 1860 and the 1870 census when Cecelia appears without him.Blanche married firstly to George Hodkinson, an Englishman. They married sometime between the 1860 census and 1864, their eldest child Florence Hodkinson was baptised at St Luke's in Marietta, Ohio on 16 Apr 1865. Their next child Blanche was baptized there 23 Nov 1867, and their third child George Flood Hodkinson on 15 Nov 1868. In the 1870 census of Marietta, George is listed as \"works in refinery\". They had one more child Grace born in 1871 or 1872, but she does not appear in the Parish Register and so perhaps the family had already moved by this time. By 1880, George was dead and Blanche was living in Washington, DC perhaps near her family who had stayed there.Between 1880 and 1883, Blanche relocated to New Orleans, probably with her children, her son George Flood Hodkinson would marry in 1897/98 to a woman from New Orleans. While visiting either in Cincinnati or Philadelphia, Blanche was invited to a party at which William \"Billy\" Burke was also present. They began spending time together and were married probably in 1883. Grant Hayter-Menzies uses the odd term \"eloped\" , which certainly at the age of 39 or 40 would not describe Blanche. He claims there, that they married in New York City, 11 Jan 1883, the ceremony being presided over by Rev George Hendric Houghton.Blanche followed the circus, evidently until she became unable to as her pregnancy developed. She probably then went to her mother, living in Washington DC, where Billie Burke was born 7 Aug 1884 \" in a little house on K Street \".Emergency Passport Applications, 7 Mar 1902, \"Blanche Burke\" application filed at Vienna, to include her child \"Ethelbert Appleton\" who was born at \"Washington, DC on 7 Aug 1884\". She states that she herself was born at \"Zanesville, Ohio\" on or about \"24 Apr 1844\". She states her permanent residence as \"New York, New York\". That she had left the United States on \"28 Dec 1901\" and was now temporarily sojourning at \"Budapest, Hungary\". She is here described as \"57 years 10 months, 5 foot 8, brown hair, black eyes\"New York Times, 8 Feb 1922 : \"Mrs Blanche Burke\", \"Mrs Blanche Burke, mother of Mrs Florenz Ziegfeld, who is known on the stage as Billie Burke, died yesterday at her home in Hastings. Mrs Burke was a talented newspaper woman and a pioneer of her sex in that profession. She was born in New Orleans. Her first husband was George Hodkinson, her second was William F Burke, an Ohioan, who died several years ago. She left four children by her first marriage. Billie Burke is the only child of her second marriage.\"6 John A Beatty7 Cecelia C Flood12 Cyrus P Beatty13 Nancy Ann Sarchet24 John Beatty25 Sarah Parkinson26 Thomas B Sarchet27 Anne Nancy Bichard48 John Beatty49 Henrietta Biggsof Ulster Co, New York; has a 1721 willmarried 7 Nov 1691 at Esopus (Kingston), New York; Will dated 20 Jun 1742, probate 30 Oct 1745192 Edward James Beatty193 Sarah Rossbap 29 Mar 1638 Saltfleetby, co Linc; heir of his father; of Staine-in-the-Marsh, co Linc; immigrated to the American colonies; Will proved 1698adult 1634; married 14 Oct 1634 at Cumberworth, co Linc; of Saltfleetby, co Linc; living 1657bap 14 Dec 1610 Cumberworth, co Linc; buried 16 Jun 1658 Saltfleetby, co Lincmarried 20 Apr 1597 Saltfleetby, co Linc; of Asfordby-inbap 10 Nov 1576 Saltfleetby, co Linc; bur 9 Jun 1634 Saltfleetby, co Linc778 William Wolley779 Anne LemyngEleanor Newcomen is of royal blood, her shortest path being twelve steps back to Edward I, King of England"}, {"url": "https://glindathemusical.com/barnum-baileys-billy-burke/", "page_content": "We can keep the “Original” Barnum & Bailey Circus …”Alive” (the circus closed on May 21, 2017 after 146 years)\n\nwith…\n\n\n\nThe Barnum & Bailey’s Greatest Show on Earth… 1882 Songster… the “Famous Clown”, Billy Burke.\n\nHe is the father of stage star, Billie Burke, who was married to the producer, Florenz Ziegfeld.\n\nBilly Burke …was a Circus Clown whose Daughter was the famous actress … Billie Burke , who played “Glinda the Good Witch”… in the Wizard of Oz…….A rare piece of Circus Ephemera.\n\nSYNOPSIS WITH MUSIC LINKS\n\nHe was the English Clown, Billy Burke ; a big name in the legendary Barnum & Bailey Circus .\n\n\n\nWilliam “Billy” Burke. toured the United States and Europe, who was a singer and clown and worked for the….\n\nBarnum & Bailey Circus\n\n……Barnum & Bailey combined both shows, in 1919 when the Barnum & Bailey’s Greatest Show on Earth, a circus created by P. T. Barnum and James Anthony Bailey, was merged with the Ringling Bros. World’s Greatest Shows. The Ringling brothers had purchased Barnum & Bailey Ltd. following Bailey’s death in 1906, but ran the circuses separately until they were merged in 1919.\n\nBarnum and Great London Circus Songster Pamphlet – 1882\n\nBy W. E. (Billy) Burke (Author)\n\nBilly Burke’s Barnum & Great London Circus Songster: Containing a Collection of the Latest and Best Songs of the Day as Sung by …”America’s Greatest Clown”…BILLY BURKES’ SONGBOOK\n\n1894 “Barnum and Bailey Greatest Show on Earth” Songster “Miss Jones Came Back”… (as sung by “Billy Burke”)\n\n\n\nBarnum and Great London Circus Songster W. E. (Billy Burke) …\n\nThe Barnum & Bailey Greatest Show on Earth Songster . It is about … Billy Burke —\n\nAnother well-known singing clown of the Civil War period was William Elhelbert Burke. Burke was born in Ohio, on October 23, 1845. His fun-making began, of all places, while working as an apprentice to a druggist in Frederickstown, Ohio. Billy became the center of a mirth loving group that headquartered at the drug store.\n\nThough only sixteen years of age he joined the Union Army. At the battle of Arkansas Post, Burke was seriously wounded, and so disabled received an honorable discharge from the Army.\n\nIn 1865 his first professional mirth-making began when he joined a minstrel troupe. This association was short lived and he left soon for employment with the J. M. Nixon Circus. He was to join the show in Galveston, Texas, and fate nearly cut short his life when the steamship carrying him to the Nixon show was wrecked at sea, and after being lost he was picked up and brought to New Orleans. In this city he was quickly secured by the Thayer and Noyes’ circus . While with this company he again had a bout with the water elements when the steamer carrying the troupe was wrecked on the Red River. In this case Mr. Burke escaped with only the loss of his handsome and expensive wardrobe. He remained with Thayer and Noyes for two seasons and then signed with the Mike Lipman show. He then moved to the great Forepaugh show for two seasons. From that show he went to the Lewis B. Lent Circus that was appearing in New York City. He met with brilliant success there. His next engagement was with the James Robinson show, and it was while he was with the show that it merged into the “Great Chicago Show.” Following this he was with the Trans-Atlantic show and then returned to Lent, and then moved to the Great Eastern and on to Montgomery Queen. He was with various other shows before becoming a feature with the… Barnum and Great London Circus in 1882.\n\nBilly Burke, Character Clown — Wm. E. Burke’s address to the public\n\nThis poster is one of many fine examples of circus posters printed by the Strobridge Lithograph Company of Cincinnati in the early 1880s… when American entrepreneur and cultural icon …P.T. Barnum first negotiated the merger of his circus to form …”P.T. Barnum’s and Great London Combined.”\n\nPoster : CP-090\n\nBilly Burke, Character Clown — Wm. E. Burke’s address to the public."}, {"url": "https://www.wikiwand.com/en/Billy_Burke_(criminal)", "page_content": "William \"Billy the Kid\" Burke was a gangster in the 19th century. Burke was born to an Irish-American family in Massachusetts on March 18, 1858.[1] By 1880 his mother had been widowed and the family had moved to Chicago and Burke had become a professional criminal. His brother, John “Fat Man” Burke, claimed he was a plumber but he also worked as a professional criminal. Two of Burke's younger brothers held positions in the telegraph office. This proved useful to him later when he needed access to messages sent by private detectives, such as the Pinkertons.[2]\n\nQuick facts: Billy Burke, Born, Died, Nationality, Other&n... ▼\n\nBurke met Sophie Lyons and they became criminal partners in the early 1880s. Lyons was an adept pickpocket and Burke's specialty was theft by subterfuge, or sneak thievery. (A sneak thief worked by distracting his victims in order to rob them without using violence.)\n\nBurke was polite and well-dressed, which put his victims at ease. Burke and Lyons were arrested for attempted bank robbery in Mt. Sterling, Kentucky in 1892. Lyons was not convicted and released, however Burke was convicted. He served his sentence in the Kentucky State Reformatory.\n\nBurke and Lyons lived together for years before getting married in 1910. He continued to work as a sneak thief in the United States and in Europe. He died of a stroke on October 25, 1919, in Detroit.[3]"}, {"url": "https://www.encyclopedia.com/women/encyclopedias-almanacs-transcripts-and-maps/burke-billie-1885-1970", "page_content": "Burke, Billie (1885–1970)\n\nAmerican actress who excelled in light comedy. Born Mary William Ethelbert Appleton Burke in Washington, D.C., on August 7, 1885; died in 1970; only daughter of William (a singing clown with Barnum and Bailey circus) and Blanche (Beatty) Hodkinson Burke (a widow with four grown children); educated in London and France; married Florenz Ziegfeld (the theatrical producer), 1914 (died, July 22, 1932); children: one daughter, Patricia Burke.\n\nFeature films:\n\nPeggy (1916); (serial) Gloria's Romance (1916); The Mysterious Miss Terry (1917); Arms and the Girl (1917); The Land of Promise (1917); Eve's Daughter (1918); Let's Get a Divorce (1918); In Pursuit of Polly (1918); The Make-Believe Wife (1918); Good Gracious Annabelle! (1919); The Misleading Widow (1919); Sadie Love (1919); Wanted—A Husband (1919); Away Goes Prudence (1920); The Frisky Mrs. Johnson (1920); The Education of Elizabeth (1921); (unbilled cameo) Glorifying the American Girl (1929); A Bill of Divorcement (1932); Christopher Strong (1933); Dinner at Eight (1933); Only Yesterday (1933); Finishing School (1934); Where Sinners Meet (1934); We're Rich Again (1934); Forsaking All Others (1934); Only Eight Hours (1935); Society Doctor (1935); After Office Hours (1935); Becky Sharp (1935); Doubting Thomas\n\n(1935); A Feather in Her Hat (1935); She Couldn't Take It (1935); Splendor (1935); My American Wife (1936); Piccadilly Jim (1936); Craig's Wife (1936); Parnell (1937); Topper (1937); The Bride Wore Red (1937); Navy Blue and Gold (1937); Everybody Sing (1938); Merrily We Live (1938); The Young in Heart (1938); Topper Takes a Trip (1939); Zenobia (1939); Bridal Suite (1939); The Wizard of Oz (1939); Eternally Yours (1939); Remember? (1939); The Ghost Comes Home (1940); And One Was Beautiful (1940); The Captain Is a Lady (1940); Irene (1940); Dulcy (1940); Hullabaloo (1940); Topper Returns (1941); One Night in Lisbon (1941); The Wild Man of Borneo (1941); The Man Who Came to Dinner (1942); What's Cookin' (1942); In This Our Life (1942); They All Kissed the Bride (1942); Girl Trouble (1942); Hi Diddle Diddle (1943); Gildersleeve on Broadway (1943); You're a Lucky Fellow Mr. Smith (1943); So's Your Uncle (1943); The Laramie Trail (1944); Swing Out Sister (1945); The Cheaters (1945); Breakfast in Hollywood (1946); The Bachelor's Daughters (1946); The Barkleys of Broadway (1949); And Baby Makes Three (1949); Father of the Bride (1950); Boy from Indiana (1950); Three Husbands (1950); Father's Little Dividend (1951); Small Town Girl (1953); The Young Philadelphians (1959); Sergeant Rutledge (1960); Pepe (1960).\n\nThanks to the cult status of the 1939 movie The Wizard of Oz, Billie Burke enjoys a once-a-year television comeback as the charming, ethereal, good witch Glinda, one of the twittery matron roles that so endeared her to audiences. Burke weathered the highs and lows of over five decades in show business, as well as a high-profile marriage to the notorious Florenz Ziegfeld. She once shared the formula for her longevity: \"To survive in Hollywood, you need the ambition of a Latin American revolutionary, the ego of a grand opera tenor and the physical stamina of a cow pony.\"\n\nBurke was born in Washington D.C. but at the age of eight followed her father's circus troupe—Billy Burke's Barnum & Great London Circus Songsters—to London, where she dutifully fulfilled her mother's wish that she become an actress. Borrowing her father's name, she made her first stage appearance in 1903 at the London Pavilion, singing \"Mamie, I Have a Little Canoe,\" in a show called The School Girl. A hit, the show ran for two years and brought Burke some celebrity and better roles, including parts in The Duchess of Dantzic, The Blue Moon, and Mrs. Ponderbury's Past. In 1907, theater impresario Charles Frohman brought her back to New York to co-star with John Drew in My Wife. The delicate-featured redhead soon became the toast of Broadway, with a string of admirers, including Mark Twain, Enrico Caruso, James Barrie and Somerset Maugham. It was Maugham who escorted her to a New Year's Eve party at the Astor Hotel where she met the renowned producer of the Follies, Florenz (Flo) Ziegfeld, who was newly divorced from actress Anna Held . Burke would later say of that first encounter: \"[E]ven if I had known then precisely what tortures and frustrations were in store for me during the next eighteen years because of this man, I should have kept right on falling in love.\" After a whirlwind courtship, the couple eloped (with Burke's mother in tow) and were married in the back room of a parsonage in Hoboken, New Jersey. After a weekend honeymoon, the newlyweds made their first home in a hotel room.\n\nIn 1915, film pioneer Thomas Ince offered Burke an unprecedented $300,000 to appear in the film Peggy. She accepted but turned down a subsequent five-year contract knowing that if she stayed in Hollywood her marriage would not survive. She finally signed on to do a number of silents with Famous Players-Lasky (Paramount) who were based in New York, where she could keep tabs on the philandering Ziegfeld.\n\nAfter the birth of their daughter in 1916, they moved into a house, Burkely Crest, in Hastings-on-Hudson, which Ziegfeld, a master of overkill, outfitted with a menagerie that included a herd of deer, two bears, two lion cubs, a variety of birds, an elephant, and later a pony that had been previously owned by the prince of Wales. The couple's lavish lifestyle included dinners for 40, nightly motion pictures, and camping trips to Canada that, according to Burke, \"closely resembled a rajah on safari with carpets, ices, cooks, and distinguished guests.\"\n\nAfter a series of silents, the best of which are considered In Pursuit of Polly, Good Gracious Annabelle!, and The Misleading Widow, Burke grew weary of the movies and returned to Broadway in such hits as Booth Tarkington's Intimate Strangers and Noel Coward's The Marquise. Mothering responsibilities and the illness of her own mother also occupied much of her time, as did continuing problems with Ziegfeld, who took up gambling and Marilyn Miller almost simultaneously. When the stock market crash of '29 and a string of failures on Broadway brought Ziegfeld close to financial disaster, Burke went back to work in earnest. Her first character role in Ivor Novello's play The Truth Game, followed by another in The Vinegar Tree, led to a new image for the actress as a scatterbrained comedienne.\n\nAfter Ziegfeld's death in 1932, the movies beckoned Burke once again, and she embarked on the second phase of her career, playing what she referred to as \"my silly women.\" \"These characters,\" she wrote, \"these bird-witted ladies whom I have characterized so often … derived from my part in The Vinegar Tree. I am neatly typed today, of course, possibly irrevocably typed, although I sincerely hope not, for I should like better parts.\"\n\nWith Bill of Divorcement considered her talkie debut, other memorable efforts of this period were Topper, its sequel Merrily We Live (which earned her an Academy Award nomination), and the role of Glinda in The Wizard of Oz. Burke cited Glinda as her favorite film part—nearest to her stage roles. In 1936, she was an advisor on the film The Great Ziegfeld, in which she was portrayed by Myrna Loy . Burke tried a straight role in The Cheaters in 1945, but audiences did not want to take her seriously, perhaps because they'd grown accustomed to her comedy, perhaps because her voice, always slightly high pitched, became more \"birdy\" with age.\n\nIn 1949, Burke wrote the first of her memoirs, With a Feather on My Nose. By that time, she had moved to a modest home in West Los Angeles, next door to her daughter and three grandchildren. Still busy, she continued to work until her retirement in 1953, after which she was lured out for only a few plays in stock, including The Solid Gold Cadillac, and some very small movie roles. Her second autobiography, With Powder on My Nose, was published in 1959, 11 years before her death in 1970.\n\nsources:\n\nBurke, Billie. With a Feather on My Nose. NY: Appleton-Century-Crofts, 1949.\n\nShipman, David. The Great Movie Stars: The Golden Years. Boston, MA: Little, Brown, 1995.\n\nBarbara Morgan , Melrose, Massachusetts"}, {"url": "https://en.geneastar.org/genealogy/burkemary/billie-burke", "page_content": "Mary William Ethelbert Appleton Burke (August 7, 1884 – May 14, 1970) was an American actress who was famous on Broadway and radio, and in silent and sound films. She is best known to modern audiences as Glinda the Good Witch of the North in the Metro-Goldwyn-Mayer movie musical The Wizard of Oz (1939).\n\nBurke was nominated for the Academy Award for Best Supporting Actress for her performance as Emily Kilbourne in Merrily We Live (1938). She is also remembered for her appearances in the Topper film series. Her unmistakable high-pitched, quivering and aristocratic voice, made her a frequent choice to play dimwitted or spoiled society types.\n\nShe was married to Broadway producer and impresario Florenz Ziegfeld Jr. from 1914 until his death in 1932.\n\n...\n\nMary William Ethelbert Appleton Burke (August 7, 1884 – May 14, 1970) was an American actress who was famous on Broadway and radio, and in silent and sound films. She is best known to modern audiences as Glinda the Good Witch of the North in the Metro-Goldwyn-Mayer movie musical The Wizard of Oz (1939).Burke was nominated for the Academy Award for Best Supporting Actress for her performance as Emily Kilbourne in Merrily We Live (1938). She is also remembered for her appearances in the Topper film series. Her unmistakable high-pitched, quivering and aristocratic voice, made her a frequent choice to play dimwitted or spoiled society types.She was married to Broadway producer and impresario Florenz Ziegfeld Jr. from 1914 until his death in 1932.Early lifeBurke was born in Washington, D.C., the daughter of Blanche (née Beatty) and her second husband, William \"Billy\" Ethelbert Burke. She toured the United States and Europe with her father, a singer and clown who worked for the Barnum & Bailey Circus. Her family settled in London where she attended plays in the West End. She began acting on stage in 1903, making her debut in London in The School Girl. Her other London shows included The Duchess of Dantzic (1903) and The Blue Moon (1904). She eventually returned to America to star in Broadway musical comedies.CareerBurke went on to play leads on Broadway in Mrs. Dot, Suzanne, The Runaway, The \"Mind-the-Paint\" Girl, and The Land of Promise from 1910 to 1913, along with a supporting role in the revival of Sir Arthur Wing Pinero's The Amazons. There she met producer Florenz Ziegfeld, marrying him in 1914. Two years later they had a daughter, author Patricia Ziegfeld Stephenson (1916–2008).Burke was signed for the movies and made her cinematic debut in the title role of Peggy (1915). Her success was phenomenal, and she was soon earning what was reputedly the highest salary of any film actress up to that time. She followed her first feature with the 15-part serial Gloria's Romance (1916), another popular and critically acclaimed vehicle. By 1917, she was a favorite with silent-movie fans, rivaling Mary Pickford, Lillian Gish, Clara Kimball Young and Irene Castle. She starred primarily in provocative society dramas and comedies, similar in theme to The \"Mind-the-Paint\" Girl, her most successful American play. Her girlish charm rivaled her acting ability, and as she dressed to the hilt in fashionable gowns, furs and jewelry, her clothes sense also won her the devotion of female audiences. Among the films in which she appeared during this period were Arms and the Girl (1917), The Mysterious Miss Terry, Let's Get a Divorce (1918), Good Gracious, Annabelle (1919), Away Goes Prudence (1920) and The Frisky Mrs. Johnson (1920). As a nod to himself for his wife appearing for Zukor and Lasky, Ziegfeld insisted on promotions for each of the films to carry the tag 'By Special Arrangement with Florenz Ziegfeld'.Burke's beauty and taste made her a major trendsetter throughout the 1910s and 20s. As early as 1909, following her Broadway performance in My Wife (1909), department stores began carrying the \"Billie Burke Dress\" with a signature flat collar and lace trim. During this time, much of Burke's on- and off-screen wardrobe was provided by the leading European couturier Lucile (in private life, Lady Duff Gordon), whose New York branch was the fashion Mecca of socialites and entertainment celebrities. Burke reflected on her reputation as \"a new kind of actress, carefree, and red-headed, and I had beautiful clothes.\"In 1916, Burke had a daughter. In 1917, Burke endorsed Pond’s Vanishing Cream.Despite her success in film, Burke eventually returned to the stage, appearing in Caesar's Wife (1919), The Intimate Strangers (1921), The Marquise (1927) and The Happy Husband (1928).When the family's investments were wiped out in the Wall Street Crash the following year, she resumed screen acting to aid her husband.Burke made her Hollywood comeback in 1932, when she starred as Margaret Fairfield in A Bill of Divorcement, which was directed by George Cukor. She played Katharine Hepburn's mother in the film, which was Hepburn's debut. Despite the death of her husband Florenz Ziegfeld during the film's production, she resumed acting shortly after his funeral.In 1933, Burke was cast as Millicent Jordan, a scatterbrained high-society woman hosting a dinner party in the comedy Dinner at Eight, directed by George Cukor, co-starring with Lionel Barrymore, Marie Dressler, John Barrymore, Jean Harlow and Wallace Beery. The movie was a great success and revitalized her career. She subsequently starred in many comedies and musicals, typecast as a ditzy, feather-brained upper-class matron, with her high-pitched voice.In 1936, Metro-Goldwyn-Mayer filmed a biopic of Florenz Ziegfeld (The Great Ziegfeld), a film that won Academy Awards for Best Picture and Best Actress (Luise Rainer as Ziegfeld's common-law wife, Anna Held). William Powell played Ziegfeld and Myrna Loy played Burke; this infuriated Burke, who was under contract to the studio and believed she could have played herself, however, MGM considered her too old to cast in the part of her younger self.Burke appeared in Topper (1937) in which she played the twittering and puritanical Clara Topper, who is married to a man haunted by socialite ghosts played by Cary Grant and Constance Bennett. She returned to the role in the film's sequels. Her next performance as Emily Kilbourne in Merrily We Live (1938) resulted in her only Oscar nomination. In 1938, she was chosen to play Glinda the Good Witch of the North in the musical The Wizard of Oz (1939), directed by Victor Fleming, starring Judy Garland. She had previously worked with Garland in the film Everybody Sing, in which she played Judy's histrionically hysterical actress-mother. Director George Cukor offered her the role of Aunt Pittypat in Gone With the Wind (1939), but she declined it. The role went to Laura Hope Crews, in a performance that Cukor wanted to be played in a \"Billie Burke-ish manner\" with \"the same zany feeling\". Another successful film series followed with Father of the Bride (1950) and Father's Little Dividend (1951), both directed by Vincente Minnelli and starring Spencer Tracy, Joan Bennett, and Elizabeth Taylor. Burke also portrayed Mrs. Ernest (Daisy) Stanley in the 1942 film The Man Who Came to Dinner.Burke wrote two autobiographies, both with Cameron Shipp, With a Feather on My Nose (Appleton 1949) and With Powder on My Nose (Coward McCann, 1959).Radio and televisionOn CBS Radio, The Billie Burke Show was heard on Saturday mornings from April 3, 1943, until September 21, 1946. Sponsored by Listerine, this situation comedy was initially titled Fashions in Rations during its first year. Portraying herself as a featherbrained Good Samaritan who lived \"in the little white house on Sunnyview Lane,\" she always offered a helping hand to those in her neighborhood. She worked often in early television, appearing in the short-lived sitcom Doc Corkle (1952). She was a guest star on several TV and radio series, including Duffy's Tavern.On television, Burke starred in her own talk show, At Home With Billie Burke, which ran on the DuMont Television Network from June 1951 through the spring of 1952. She was one of the first female talk show hosts, after the hostesses of the earlier DuMont series And Everything Nice (1949–50) and Fashions on Parade (1948–49) which both included some talk show segments.Billie Burke starred in an adaptation of Dr. Heidegger's Experiment on the TV version of Lights Out on November 20, 1950.Return to stage and final filmBurke tried to make a comeback on the New York stage. She starred in two short-lived productions: This Rock and Mrs. January and Mr. X. Although she got good reviews, the plays did not. She also appeared in several plays in California, although her mind became clouded, and she had trouble remembering lines. In the late 1950s, her failing memory led to her retirement from show business, although her explanation at the time was, \"Acting just wasn't any fun anymore.\"Burke made her final screen appearance in Sergeant Rutledge (1960), a western directed by John Ford.Personal lifeAmong Burke's early suitors was the operatic tenor Enrico Caruso.In 1910, Burke bought the Kirkham estate on Broadway in Hastings-on-Hudson, New York, and renamed the mansion, Burkeley Crest.In April 1914, Burke married Florenz Ziegfeld.In 1921, Burke retired to raise her daughter Patricia, but resumed work after the Wall Street Crash of 1929.In 1932, Burke moved from New York to Beverly Hills, California, after the death of Ziegfeld.Burke died in Los Angeles of natural causes on May 14, 1970, at the age of 85, and she was interred besideZiegfeld at Kensico Cemetery, Valhalla, Westchester County, New York.LegacyFor many years, Burke's framed photo was displayed above the exit staircase at New York City's Ziegfeld Theatre, but it disappeared after renovations. An opening-night program bearing a picture of her from her 1912 triumph The Mind The Paint Girl (Sir Arthur Wing Pinero) is displayed in the lobby of the Lyceum Theatre in Manhattan.For her contributions to the film industry, Burke was inducted into the Hollywood Walk of Fame in 1960 with a motion pictures star at 6617 Hollywood Boulevard.The Academy Film Archive houses the Florenz Ziegfeld-Billie Burke Collection, which consists primarily of home movies.On November 4, 2015, the crater Burke, near the north pole of the planet Mercury, was named after Billie Burke.Performance careerRadioThe Ziegfeld Follies of the Air – 1932Doubting Thomas - 1935Good News of 1939 – 1938The Rudy Vallee Hour – 1939The Gulf Screen Guild Theater – 1939The Rudy Vallee Sealtest Show – 1940–41The Pepsodent Show – 1941The Billie Burke Show – 1943–1946Duffy's Tavern – 1944The Sealtest Village Store – 1944Mail Call – 1944The Charlie McCarthy Show – 1944–47Tribute to Ethel Barrymore – 1945The Rudy Vallee Show – 1945Show Stoppers – 1946The Danny Kaye Show – 1946WOR 25th Anniversary – 1947Your Movietown Radio Theatre – 1948The Eddie Cantor Pabst Blue Ribbon Show – 1948Family Theater – 1948–52This Is Show Business – CBS-TV, 1949The Martin and Lewis Show – 1949The Bill Stern Colgate Sports Newsreel – 1949Stagestruck – 1954Biography in Sound – 1955–56BroadwayMy Wife – 1907Love Watches – 1908Mrs. Dot – 1910Suzanne – 1910The Philosopher in the Apple Orchard – 1911The Runaway – 1911The Amazons – 1913The Land of Promise – 1913Jerry – 1914The Rescuing Angel – 1917A Marriage of Convenience – 1918Caesar's Wife – 1919The Intimate Strangers (musical)|The Intimate Strangers – 1921Rose Briar – 1922Annie Dear – 1924The Marquise – 1927The Happy Husband – 1928Family Affairs – 1929The Truth Game – 1930Ziegfeld Follies of 1934 – 1934 (producer)Ziegfeld Follies of 1936 – 1936 (producer)This Rock – 1943Ziegfeld Follies of 1943 – 1943 (producer)Mrs. January and Mr. X - 1944FilmographySee alsoAcademy of Music/Riviera TheatreList of actors with Academy Award nominationsReferencesFurther readingAlistair, Rupert (2018). \"Billie Burke\". The Name Below the Title : 65 Classic Movie Character Actors from Hollywood's Golden Age (softcover) (First ed.). Great Britain: Independently published. pp. 57–60. ISBN 978-1-7200-3837-5.Burke, Billie. With a Feather on my Nose. (First ed.) New York: Appleton-Century-Crofts, 1948. ISBN 978-1162773513.Burke, Billie. With Powder on my Nose (First ed.) New York, Coward-McCann, Inc. 1959Hayter-Menzies, Grant (2009). Mrs. Ziegfeld: The Public and Private Lives of Billie Burke. USA: McFarland & Company, Inc. ISBN 978-1-4766-6596-2.External linksBillie Burke at IMDbBillie Burke at the Internet Broadway DatabaseAllMovie.comBillie Burke still photos from several Billie plays and lost Billie silent films Univ. of Washington Sayre collectionBillie Burke Archived March 4, 2012, at the Wayback Machine photos Univ. of Louisville Macauley CollectionFlo Ziegfeld-Billie Burke Papers, 1907-1984, held by the Billy Rose Theatre Division, New York Public Library for the Performing ArtsBillie Burke Digital Image Gallery, Billy Rose Theatre Division, New York Public Library for the Performing ArtsBillie Burke Collection, held by the Howard Gotlieb Archival Research Center, Boston UniversityLiterature on Billie BurkeBillie Burke with one of her motorcars, a Rolls-Royce\n\n\n\nBiography from Wikipedia (see original) under licence CC BY-SA 3.0"}, {"url": "https://www.ancientfaces.com/person/billy-burke-birth-1925-death-1989/68675091", "page_content": "Refresh this page to see various historical events that occurred during Billy's lifetime.\n\nIn 1925, in the year that Billy Burke was born, in July, the Scopes Trial - often called the Scopes Monkey Trial - took place, prosecuting a substitute teacher for teaching evolution in school. Tennessee had enacted a law that said it was \"unlawful to teach human evolution in any state-funded school\". William Jennings Bryan headed the prosecution and Clarence Darrow headed the defense. The teacher was found guilty and fined $100. An appeal to the Supreme Court of Tennessee upheld the law but overturned the guilty verdict.\n\nIn 1938, he was just 13 years old when on October 30th, a Sunday, The Mercury Theatre on the Air broadcast Orson Welles' special Halloween show The War of the World's. A clever take on H.G. Wells' novel, the show began with simulated \"breaking news\" of an invasion by Martians. Because of the realistic nature of the \"news,\" there was a public outcry the next day, calling for regulation by the FCC. Although the current story is that many were fooled and panicked, in reality very few people were fooled. But the show made Orson Welles' career.\n\nIn 1952, Billy was 27 years old when on July 2, Dr. Jonas E. Salk tested the first dead-virus polio vaccine on 43 children. The worst epidemic of polio had broken out that year - in the U.S. there were 58,000 cases reported. Of these, 3,145 people had died and 21,269 were left with mild to disabling paralysis.\n\nIn 1965, by the time he was 40 years old, from August 11 to 16, riots broke out in Watts, a Black section of Los Angeles. An allegedly drunk African-American driver was stopped by LA police and, after a fight, police brutality was alleged - and the riots began. 34 people died in the rioting and over $40 million in property damage occurred. The National Guard was called in to help the LA police quell rioting.\n\nIn 1989, in the year of Billy Burke's passing, on November 9th, the Berlin Wall fell. The Wall was built by the East Germans to keep East Berliners from escaping into West Berlin, separating families and friends. When the head of the East German Communist Party announced that day that East Berliners could cross whenever they pleased, happy crowds surged across the border. People brought tools and took parts of the hated wall."}, {"url": "https://happyhappybirthday.net/en/age/billy-burke-person_xyfaya", "page_content": "Billy Burke\n\nAmerican actor, musician – Billy Burke was born in Bellingham (city in, and the county seat of, Whatcom County in the State of Washington, United States) on November 25th, 1966 and is 56 years old today.\n\nAge How old is Billy Burke? 56 Billy Burke is 56 years old.\n\nBiographical data\n\nBilly Burke\n\nBirthday When was Billy Burke born? Billy Burke was born on November 25th, 1966.\n\nPlace of Birth Where was Billy Burke born? Bellingham (city in, and the county seat of, Whatcom County in the State of Washington, United States).\n\n♐ ♐ Zodiac What is the zodiac sign of Billy Burke? Billy Burke was born in the zodiac sign Sagittarius (The Centaur/Archer)."}, {"url": "https://deadorkicking.com/billie-burke-dead-or-alive/", "page_content": "Billie Burke Death\n\nBillie passed away on May 14, 1970 at the age of 85 in Los Angeles, California, USA. Billie's cause of death was natural causes.\n\nBillie Burke death quick facts: When did Billie Burke die? May 14, 1970\n\nHow did Billie Burke die? What was the cause of death? Natural causes\n\nHow old was Billie Burke when died? 85\n\nWhere did Billie Burke die? What was the location of death? Los Angeles, California, USA\n\nBillie Burke Birthday and Date of Death\n\nBillie Burke was born on August 7, 1884 and died on May 14, 1970. Billie was 85 years old at the time of death.\n\nBirthday: August 7, 1884\n\nDate of Death: May 14, 1970\n\nAge at Death: 85\n\nBillie Burke - Biography\n\nBillie Burke was born Mary William Ethelbert Appleton Burke on August 7, 1885 in Washington, D.C. Her father was a circus clown, and as a child she toured the United States and Europe with the circus (before motion pictures and after the stage, circuses were the biggest form of entertainment in the world). One could say that Billie was bred for show business. Her family ultimately settled in London, where she was fortunate to see plays in the city's historic West End, and decided she wanted to be a stage actress. At age 18, she made her stage debut and her career was off and running. Her performances were very well received and she became one of the most popular actresses to grace the stage. Broadway beckoned, and since New York City was now recognized as the stage capital of the world, it was there she would try her luck. Billie came to New York when she was 22 and her momentum did not stop. She appeared in numerous plays and it was only a matter of time before Hollywood came calling, which is exactly what happened. She made her film debut in the lead role in Peggy (1916). The film was a hit, but then again most films were, as the novelty of motion pictures had not worn off since The Great Train Robbery (1903) at the turn of the century. Later that year, she appeared in Gloria's Romance (1916). In between cinema work, she would take her place on the stage because not only was it her first love, but she had speaking parts. Billie considered herself more than an actress--she felt she was an artist, too. She believed that the stage was a way to personally reach out to an audience, something that could not be done in pictures. In 1921, she appeared as Elizabeth Banks in The Education of Elizabeth (1921), then she retired. She had wed impresario Florenz Ziegfeld Jr. of the famed Ziegfeld Follies and, with investments in the stock market, there was no need to work.What the Ziegfelds did not plan on was \"Black October\" in 1929. Their stock investments were wiped out in the crash, which precipitated the Great Depression, and Billie had no choice but to return to the screen. Movies had become even bigger than ten years earlier, especially since the introduction of sound. Her first role of substance was as Margaret Fairlfield in A Bill of Divorcement (1932). As an artist, she loved the fact that she had dialog, but she had to work even harder because her husband had died the same year as her speaking debut - and work she did. One of her career highlights came as Mrs. Millicent Jordan in David O. Selznick's Dinner at Eight (1933), co-starring Lionel Barrymore, Wallace Beery, John Barrymore and Jean Harlow - heady company to be sure, but Billie turned in an outstanding performance as Mrs. Jordan, the scatterbrained wife of a man whose shipping company is in financial trouble and who was trying to get someone to loan his company money to help stave off disaster. Her character loved to give dinner parties because a dinner affair at the Jordans had a reputation among New York blue-blood society as the highlight of the season. With all the drama and intrigue going on around her, her main concern is that she is one man short of having a full seating arrangement. The film was a hit and once again Billie was back on top. In 1937, she had one of her most fondly remembered roles in Topper (1937), a film that would ultimately spin off two sequels, and all three were box-office hits. In 1938, Billie received her first and only Academy Award nomination for her portrayal of Emily Kilbourne in Merrily We Live (1938). This was probably the best performance of her screen career, but she was destined to be immortalized forever in the classic The Wizard of Oz (1939). At 54 years of age - and not looking anywhere near it - she played Glinda, the Good Witch of the North. The 1940s saw Billie busier than ever--she made 25 films between 1940 and 1949. She made only six in the 1950s, as her aging became noticeable. She was 75 when she made her final screen appearance as Cordelia Fosgate in John Ford's Western Sergeant Rutledge (1960). Billie retired for good and lived in Los Angeles, California, where she died at age 85 of natural causes on May 14, 1970."}, {"url": "https://www.wikitree.com/wiki/Burke-2407", "page_content": "William Ethelbert (Billy) \"Billy\" Burke\n\n23 Oct 1843 in Waterford, Knox County, Ohio, USA Bornin\n\nAncestors\n\nDescendants\n\nMary William Ethelbert Appleton Burke Father of\n\n5 Oct 1906 at age 62 in Huddersfield, Metropolitan Borough of Kirklees, West Yorkshire, England Diedin\n\nProfile last modified 12 Oct 2021 | Created 20 May 2014\n\nThis page has been accessed 1,168 times.\n\n\n\n\n\nBiography\n\nAfter seeing action in the American Civil War where his 'cheerful songs and merry jokes\" made him the the \"life and soul\" of the camp. He was seriously wounded at the battle of Arkansas Post, and upon recovery honorably discharged (2). Burke began a forty-year career as a clown and minstrel singer not without many stops and starts. He worked for several troupes, and by 1882 was traveling with Barnum and Bailey's circus.\n\nBurke grandly billed himself as \"America's Greatest Clown,\" and after moving his family to Europe, produced a show called Billy Burke's Barnum & Great London Circus Songsters.\n\nThere were rumors that he was somehow \"disowned by his family\" in Ohio, but in a copy of a letter (i have the letter as a word doc, Jim Falcone) to his sister Rebecca, on Oct. 12, 1905, he makes references to wanting to know about his siblings and how they were, mentioning he writes but gets no responses except one from Rebecca 8 years earlier. He mentions that he was in ill-health with gout like his father, but recovering by adjusting his diet. He said he planned to come back to US for a tour in a year. Near the end of letter he says baby (Billie who he said was a great favorite in London, calling her the best looking woman in England) wanted a picture of her grandfather (Burke) and re-collected that Mack had a nice one (I assume McKendrie), but had not responded to a dozen requests.\n\nHe continued to perform until his death at age 62 of gastritus (1) in the Infirmary at Huddersfield, England.\n\nSpouse Blanche Beatty Burke 1844–1921 (m. 1883)\n\nChildren Billie Burke 1884–1970\n\nreference to above\n\n(1) obituary found in Oakland Tribune, 4 Nov 1906 (2) Harvard College Library contains his \"W. E. Burke's Barnum and Great London Circus Songster: Biographical Sketch of William Ethelbert Burke, American's Greatest Clown\" (New York Popular Publishing Co [1818/2])\n\nCensus\n\n1850 United States Federal Census Name: William Burk Gender: Male Age: 7 Birth Year: abt 1843 Birthplace: Ohio Home in 1850: Middlebury, Knox, Ohio, USA Attended School: Yes Line Number: 35 Dwelling Number: 169 Family Number: 172 Household Members Age J D Burk 42 B Dagan 18 Rebecca A Burk 18 Sarah Burk 15 William Burk 7 Thomas E Burk 4 McKendrie Burk 2\n\n1860 United States Federal Census Name: Wm Burke Age: 18 Birth Year: abt 1842 Gender: Male Birth Place: Ohio Home in 1860: Fredericktown, Knox, Ohio Post Office: Fredericktown Dwelling Number: 965 Family Number: 974 Household Members Age S S Tattle 42 Mary M Tattle 32 Cyrus Tattle 13 Benjamin Tattle 11 Mary A Tattle 9 Charlotte Tattle 6 Charlie Tattle 6/12 J W Savage 18 Elizabeth Vixon 35 Sally Stout 38 Wm Burke 18 Sarah Smith 22\n\n(The following English Census Info is inconsistent with Billy Burke's information on US Passport Application in Vienna in 1902) (3)\n\n1871 England Census Name: William Burke Age: 35 Estimated Birth Year: 1836 Relation: Head Gender: Male Where born: Selly Yorkshire England Civil parish: Islington St Peter County/Island: London Country: England Registration district: Islington Sub-registration district: Islington East ED, institution, or vessel: 4 Household schedule number: 402 Piece: 279 Folio: 32 Page number: 62 Household Members Age Relationship William Burke 35 Head Blanche E Burke 28 Wife Blanche Burke 2 Daughter\n\n1881 England Census Name: William Burke Age: 45 Estimated Birth Year: abt 1836 Relationship to Head: Head Spouse: Blanche E. Burke Gender: Male Where born: Selby, Yorkshire, England Civil Parish: Sunninghill County/Island: Berkshire Country: England Street Address: Bagshot Road Ayott Cott 1 Marital status: Married Occupation: Carpenter Registration District: Windsor ED, institution, or vessel: 14 Piece: 1322 Folio: 135 Page Number: 14 Household Members: Name Age William Burke 45 Blanche E. Burke 38 James Burke 14 Blanche Burke 12 Ethel E. Burke 9\n\n1891 England Census Name: William Burke Gender: Male Age: 55 Relationship: Head Birth Year: 1836 Spouse: Blanche Burke Child: James Burke Ethel Burke Birth Place: Selby, Yorkshire, England Civil Parish: Sunninghill Ecclesiastical parish: St Michael Residence Place: Sunninghill, Sunninghill, Berkshire, England Registration District: Windsor Sub registration district: Egham ED, Institution or Vessel: 15 Piece: 1010 Folio: 102 Household Members: Name Age William Burke 55 Blanche Burke 48 James Burke 24 Ethel Burke 19\n\nBurial\n\nHampstead Cemetery Hampstead, London Borough of Camden, Greater London, England Show Map PLOT WC / 738\n\nSources\n\n\n\n(3) US Passport Application of William E. Burke dated March 1, 1902 where he states he was born in Levering, Knox County, Ohio (which is in Middlebury Twp.) on 23 Oct 1843. He was out of the US from 1898 and pallned to return by 1904."}, {"url": "https://www.thefamousbirthdays.com/people/billy-burke", "page_content": "About Billy Burke\n\nBilly Burke portrayed the character of Charlie Swan in the famous television series entitled “Twilight”. He also appeared in its sequels. His talent has helped him to gain roles in other movie productions including “Revolution”, “Breaking In” and “Lights Out”.\n\nSpouse\n\nPollyanna Rose (married from 2008 to 2017)\n\nChildren\n\nBluesy LaRue Burke\n\nEducation\n\nHe studied at Sehome High School.\n\nTrivia\n\nDuring his teen years, he performed in a music band.\n\nHe started his acting career in 1990."}], "Billy Burke died on April 11, 1981.": [{"url": "https://www.ancestry.com/search/categories/bmd_death/", "page_content": "In a few of the death records collections on Ancestry, you will find the indexes that link to images of actual birth records. In other cases, there are indexes that contain information that will help you request the record. If you find your ancestor in an index, be sure to click on the database title and look at the description to learn how to request the actual death record. The full record will typically include details not found in the index. We also maintain a list of links to state vital records agencies in the Ancestry Library. Find more information.\n\nThis category includes civil, church, cemetery, obituary, and other death-related collections. In addition to details about the death, they can contain birth information, family origins, cause of death, and more.\n\nDeath records are primary resources for details about the death, since they were typically created relatively near the time of the death. This collection includes indexes that can help you request the actual record, and in some cases, actual images of the death records. Use the information you find in one type of death record to seek out other death-related records.\n\nIf you would like to view obituaries by country, state or city, please visit our Obituary pages."}, {"url": "https://www.findagrave.com/memorial/114191319/billy-burke", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.nytimes.com/1972/04/21/archives/billy-burke-golfer-who-won-open-in-31.html", "page_content": "CLEARWATER, Fla., April 20 (UPI)—Billy Burke, the professional golfer, died here yesterday after a long illness. He was 69 years old.\n\nBurke made golfing record books in 1931 when he won a marathon 72‐hole playoff for the United States Open title. He and George Von Elm were tied at the end of regulation play in that tourney over the Inverness Golf Club course at Toledo, Ohio, and went into the playoff the next day.\n\nAt the end of the 36 holes they still were tied and had to play another 36 holes the following day. Burke won by one stroke.\n\nBurke, who played with a slightly unorthodox grip because of the loss of parts of two fingers on his left hand, was a member of the United States Ryder Cup team in 1931 and 1933 and was golf professional at the Cleveland country club for 29 years."}, {"url": "https://en.necropedia.org/obituary/Billy_Burke", "page_content": "Billy Burke is dead\n\nBilly Burke, born on November 25, 1966 in Bellingham, was an American actor. He died on June 10, 2023 at the age of 56.\n\nBilly Burke was romantically involved with Neve Campbell."}, {"url": "https://deadorkicking.com/billie-burke-dead-or-alive/", "page_content": "Billie Burke Death\n\nBillie passed away on May 14, 1970 at the age of 85 in Los Angeles, California, USA. Billie's cause of death was natural causes.\n\nBillie Burke death quick facts: When did Billie Burke die? May 14, 1970\n\nHow did Billie Burke die? What was the cause of death? Natural causes\n\nHow old was Billie Burke when died? 85\n\nWhere did Billie Burke die? What was the location of death? Los Angeles, California, USA\n\nBillie Burke Birthday and Date of Death\n\nBillie Burke was born on August 7, 1884 and died on May 14, 1970. Billie was 85 years old at the time of death.\n\nBirthday: August 7, 1884\n\nDate of Death: May 14, 1970\n\nAge at Death: 85\n\nBillie Burke - Biography\n\nBillie Burke was born Mary William Ethelbert Appleton Burke on August 7, 1885 in Washington, D.C. Her father was a circus clown, and as a child she toured the United States and Europe with the circus (before motion pictures and after the stage, circuses were the biggest form of entertainment in the world). One could say that Billie was bred for show business. Her family ultimately settled in London, where she was fortunate to see plays in the city's historic West End, and decided she wanted to be a stage actress. At age 18, she made her stage debut and her career was off and running. Her performances were very well received and she became one of the most popular actresses to grace the stage. Broadway beckoned, and since New York City was now recognized as the stage capital of the world, it was there she would try her luck. Billie came to New York when she was 22 and her momentum did not stop. She appeared in numerous plays and it was only a matter of time before Hollywood came calling, which is exactly what happened. She made her film debut in the lead role in Peggy (1916). The film was a hit, but then again most films were, as the novelty of motion pictures had not worn off since The Great Train Robbery (1903) at the turn of the century. Later that year, she appeared in Gloria's Romance (1916). In between cinema work, she would take her place on the stage because not only was it her first love, but she had speaking parts. Billie considered herself more than an actress--she felt she was an artist, too. She believed that the stage was a way to personally reach out to an audience, something that could not be done in pictures. In 1921, she appeared as Elizabeth Banks in The Education of Elizabeth (1921), then she retired. She had wed impresario Florenz Ziegfeld Jr. of the famed Ziegfeld Follies and, with investments in the stock market, there was no need to work.What the Ziegfelds did not plan on was \"Black October\" in 1929. Their stock investments were wiped out in the crash, which precipitated the Great Depression, and Billie had no choice but to return to the screen. Movies had become even bigger than ten years earlier, especially since the introduction of sound. Her first role of substance was as Margaret Fairlfield in A Bill of Divorcement (1932). As an artist, she loved the fact that she had dialog, but she had to work even harder because her husband had died the same year as her speaking debut - and work she did. One of her career highlights came as Mrs. Millicent Jordan in David O. Selznick's Dinner at Eight (1933), co-starring Lionel Barrymore, Wallace Beery, John Barrymore and Jean Harlow - heady company to be sure, but Billie turned in an outstanding performance as Mrs. Jordan, the scatterbrained wife of a man whose shipping company is in financial trouble and who was trying to get someone to loan his company money to help stave off disaster. Her character loved to give dinner parties because a dinner affair at the Jordans had a reputation among New York blue-blood society as the highlight of the season. With all the drama and intrigue going on around her, her main concern is that she is one man short of having a full seating arrangement. The film was a hit and once again Billie was back on top. In 1937, she had one of her most fondly remembered roles in Topper (1937), a film that would ultimately spin off two sequels, and all three were box-office hits. In 1938, Billie received her first and only Academy Award nomination for her portrayal of Emily Kilbourne in Merrily We Live (1938). This was probably the best performance of her screen career, but she was destined to be immortalized forever in the classic The Wizard of Oz (1939). At 54 years of age - and not looking anywhere near it - she played Glinda, the Good Witch of the North. The 1940s saw Billie busier than ever--she made 25 films between 1940 and 1949. She made only six in the 1950s, as her aging became noticeable. She was 75 when she made her final screen appearance as Cordelia Fosgate in John Ford's Western Sergeant Rutledge (1960). Billie retired for good and lived in Los Angeles, California, where she died at age 85 of natural causes on May 14, 1970."}, {"url": "https://www.thefamouspeople.com/profiles/billy-burke-46556.php", "page_content": "Career\n\nBilly Burke began his acting career in 1990, appearing in the independent flick ‘Daredreamer’. Following his guest appearances in many TV shows including ‘Party of Five’, ‘Vanishing Son’ and ‘All-American Girl’, he did the made-for-television movie ‘Gone in the Night’. In 1998, the actor starred in ‘Don't Look Down’, a horror flick about a lady who struggles to cope with her sister’s death by joining a group helping those with acrophobia. That year, Burke also played Joey Cortino in the comedy movie ‘Mafia’ that starred Lloyd Bridges, Christina Applegate and Jay Mohr.\n\nThe year 2000 saw him in the mockumentary ‘The Independent’ as well as in the ABC drama ‘Wonderland’. A year later, Burke had a role in the neo noir psychological thriller 'Along Came a Spider'. Although the film received negative to mixed reviews, it became a box office success. From 2002 to 2004, he featured in the drama series ‘24’, ‘Gilmore Girls’ and ‘The Jury’. During this time, the actor also appeared in the movies ‘Lost Junction’ and ‘Ladder 49.’\n\nIn 2008, Burke’s career reached new heights when he played Charlie Swan in the romantic fantasy film ‘Twilight’. He later reprised his role in ‘The Twilight Saga: New Moon’ and ‘The Twilight Saga: Eclipse,’ which were released in 2009 and 2010, respectively. During this time period, the actor also had roles in the TV shows ‘My Boys’ and ‘The Closer’. In 2011, he portrayed the character of Cesaire in the romance horror film ‘Red Riding Hood’ and also featured in Twilight’s sequel ‘The Twilight Saga: Breaking Dawn – Part 1’. This was followed by his appearance in ‘The Twilight Saga: Breaking Dawn – Part 2’ which released a year later."}, {"url": "https://www.syracuse.com/news/2011/09/a_moment_of_terror_a_decade_of.html", "page_content": "2011-09-04-dn-Burke.JPG\n\nDr. Elizabeth Berry of Syracuse (left) and Chris Burke of Onondaga (right) at the sand sculpture in the Center of Progress Building during this month's New York State Fair. The sculpture honored the firefighters, police officers and other emergency workers who responded - often at the cost of their own lives - to the terrorist attacks of Sept. 11, 2001. Burke and Berry are siblings of Capt. Billy Burke Jr., who chose to stay in the north tower - just before it collapsed - with two stranded civilians, including a man in a wheelchair.\n\n(Dennis Nett | dnett@syracuse.com)\n\nGregg Hansson and Billy Burke met only once. That was 10 years ago this morning — Sept. 11, 2001 — near an elevator on the 27th floor of the north tower of the World Trade Center. Hansson was a lieutenant in the Fire Department of New York. He was looking for one of his firefighters, ordered by Hansson to watch over two stranded office workers from Empire Blue Cross and Blue Shield.\n\nHansson did not expect to find Burke, a captain and a superior officer, with this little group of men. They spoke for a matter of seconds. A decision was made, as much by a nod and body language as by words themselves. Burke assumed command of the civilians, while Hansson and his men resumed their harrowing journey down a stairwell. Hansson is now a captain. What he didn’t realize then is always with him now:\n\nBilly Burke, he said, sacrificed his own life to save theirs.\n\n“I have moments in the past 10 years when I tend to reflect, and I think the biggest and toughest one is me and my guys being alive, and Billy’s not,” Hansson said.\n\nThe north tower was burning. At 8:46 a.m., hijackers had steered American Airlines Flight 11 into the building, touching off a fire hot enough to make steel run like butter. Sixteen minutes later, a second plane hit the building’s twin. Most workers, at least those fortunate enough to have jobs beneath the flames, were on their way down or were already out. Refusing to leave the north tower was Abe Zelmanowitz, an employee of Blue Cross. Zelmanowitz made his own heroic decision: He would not go down without his colleague, Ed Beyea, a paraplegic whose wheelchair left him without any obvious way to escape.\n\nThe two civilians were discovered by Hansson and his men as they made their way upstairs, checking every floor. Even for veteran firefighters, Beyea presented a logistical problem: He was a big man. An elevator could become a death trap. And it would be a long and difficult walk to the bottom of the tower. Hansson, not yet worried about the building coming down, thought he had time to figure it out. He assigned a firefighter named Rich Billy to stay with the civilians on the 27th floor, and Hansson and his men kept going up.\n\nEverything changed when they reached the floors in the upper 30s. They endured a moment of sickening terror: The building — one of the tallest in the world — shook and swayed like a flimsy wooden bridge in a big wind. Abruptly, the structure seemed to steady itself.\n\nA voice on a firefighter's radio cried “Mayday!” To Hansson, that meant one thing: Get out.\n\nAmong the firefighters scattered on those floors, only a few knew what had caused the building to shake — and why they needed to evacuate, and fast.\n\nBilly Burke, at 46, fully understood. Minutes before encountering Hansson at the elevator, Burke and another fire captain, Jay Jonas, had been searching other sections of the 27th floor when the building shook. Once it stopped, the two captains ran to windows at opposite ends of the floor, then sprinted back to meet in the middle.\n\n“Is that what I thought it was?” Jonas asked.\n\n“The south tower just collapsed,” Burke replied.\n\nAs it fell, that 110-floor building sent a shock wave through its twin. Jonas called out to his men and hurried toward a stairwell. He thought Burke, an old friend, was just behind him. Roughly 28 minutes later, Jonas and the others would survive the collapse of the north tower. They were in a stairwell that formed a protective bubble against the overwhelming torrent of debris. Stunned, covered in dust and rubble, Jonas looked for Billy Burke among the survivors.\n\nHe wasn’t there. Eventually, Jonas would learn that Burke — moved by some rescuer’s intuition — never left the 27th floor. A captain with Engine 21, Burke had already ordered his own men to go downstairs to safety. Months later, firefighter Michael Byrne — one of Burke’s men — would offer testimony to the World Trade Center Task Force. Byrne would recall how Burke brought the company upstairs, a few men at a time, on one of the few working elevators. They reached the 24th floor, then climbed to the 27th.\n\nWhen the building shook, Burke commanded his men to get out. The order almost certainly saved their lives. They would survive, while Byrne recalled how his captain kept promising by radio he’d “meet (them) at the rig.”\n\nIt was Hansson, back on the 27th floor, who had one final conversation with Burke.\n\n» Complete coverage of Sept. 11 memorials and news on syracuse.com.\n\nThey met at the elevator, where Burke — in his search — had already come upon the two civilians. They spoke briefly about whether it might be safe to try the elevator. Burke, who knew the south tower was already gone, had made his way upstairs on an elevator — and undoubtedly understood they lacked the time to carry Beyea, in his wheelchair, down the stairs. Hansson, who’d seen what fireballs did to elevators on the lower floors, said using one wasn’t worth the chance.\n\nIn that instant, Burke took charge of the two civilians — freeing Hansson to gather his own men and descend.\n\n“There was an urgency in our footsteps,” Hansson recalls. Sometimes he wonders if he should have argued with Burke and tried to stay. But they had a long way to go, with no guarantee they would survive, and Burke — despite the desperate situation — never told them he had already sent his own company downstairs.\n\nA friend to many\n\nWhile Billy Burke loved his home in Manhattan, he was a regular visitor to Central New York. His older sister, Dr. Elizabeth Berry, is on the staff at Crouse Hospital. A younger brother, Chris, is a lawyer with Syracuse University. Of the many qualities Burke’s siblings admired in their brother, nothing astounded them quite as much as his gift for remaining close to his many old girlfriends without threatening the new men in their lives.\n\n“He was very outgoing, very warm, very irresistible, with a big smile and blue eyes that were hard to resist,” said Jean Traina, an art director who for two decades designed book covers in New York City, where she often shifted between romance and a profound friendship with Burke.\n\n“We never stopped loving each other,” she said, and Sept. 11 offered deep proof of that bond.\n\nAs Burke and his company responded to the fire, it was Traina whom Burke chose to call four times. He warned her repeatedly to stay in her home. He asked her to tell his family he was all right. On the last call, when she screamed at him to stay away from the trade center, he simply lied to her — saying he was outside when he must have been in the north tower. She vividly recalls his last words on the phone:\n\n“This is what I do.”\n\nFrom Burke’s perspective, he was born into the job. The second child in a family of six, he was the son of a deputy chief in New York. His father did not want his children in the same profession — he’d retired at 64, Berry said, worn down “by stress and smoke” — but Burke dreamed since childhood of fighting fires. Berry said her brother never forgot the lessons their dad offered about what to do inside a burning building: Get the civilians out, and then take care of your men.\n\nBurke saw that as a family code, even as two of the world’s tallest buildings melted down.\n\nIt would be easy, then, to portray Burke as a one-dimensional lady’s man, a kind of Hollywood version of a firefighting hero, except for how profoundly that would misrepresent his essence. Women were drawn to him, yes, but Berry said her brother’s looks were only part of the attraction. He was “multifaceted,” Berry said, “literally one of the smartest people I’ve ever met in my life.”\n\nBurke was a tremendous reader and a skilled photographer. He had written short stories, and he dreamed out loud about teaching literature at a small college. He was also an expert on the Civil War. Berry said he had enough passion and knowledge to lead informal tours of the battlefield at Gettysburg.\n\nHe gathered a vast circle of friends through loyalty and an endless willingness to share his time. During his undergraduate days at SUNY Potsdam, he worked up the nerve to ask out Gwen Webber-McLeod, now a businesswoman in Auburn. “I had an amazing relationship with Capt. William F. Burke,” she said last week. Webber-McLeod, who is African-American, describes the Irish-Catholic Burke as her “first love.” Interracial dating was hardly the norm in the early 1970s, but they stayed close even after they let go of their romance.\n\nIn 1995 — when Webber-McLeod and her husband, Tracy McLeod, learned their daughter Ashley had leukemia — Burke again became a presence. He made monthly calls to check on Ashley as the girl went through treatment and beat the disease, calls that would continue for as long as Burke lived.\n\nThat behavior was typical, said Traina, Burke’s longtime companion in New York: After Traina discovered she had breast cancer, Burke was at her side during her chemotherapy. Traina and Berry also recall a little tavern in Manhattan where Burke loved to have a beer, a place owned by an old woman named Elsie.\n\nCapt. Billy Burke: Image found on a roll of film in his locker, by his family.\n\nBurke revered her. One night, he stopped in and was told she’d grown too ill to tend bar. Burke, upset, made a few calls. He learned Elsie had been sent to a nursing home. Until she died, Burke was a regular visitor.\n\n“He was our oldest brother,” said Chris Burke, the Syracuse lawyer, “and in life he always fulfilled that role.” Chris has a twin, Michael, who lives in New York. They were 18 months younger than Billy. The boys had plenty of brawls when they were young, but when it counted, Chris said, their brother always showed up.\n\nChris recalled how Billy was a center of attention in high school, a star swimmer with head-turning good looks. He was the guy every cheerleader wanted to date, the guy every other boy wanted to be. Yet he made a point of befriending smart and quirky outcasts who otherwise would have been targets of ridicule, Chris said.\n\n“I remember he had this one friend, this little guy who didn’t fit in, and the important thing was the way Billy never made him feel that way,” Chris said. “The friendship was real. There was no contempt. He was just a guy who was always taking care of someone else.”\n\nSometimes, before Chris falls asleep at night, he thinks back to an autumn morning when he and Michael were seventh-graders, part of the youngest class at their new middle school. In the auditorium, an older kid pulled a pen from Michael’s pocket and threw it into a crowd of ninth-graders. The pen struck an older, much larger boy. Michael went to get it, and the kid gave him a hard shove. For a moment, the situation did not look good for Michael.\n\n“The next thing, all you see is Billy coming through,” Chris said. “He gives the kid a right across the jaw, and the kid goes down like a ton of bricks.”\n\nChris choked up. He could not finish the tale. This was a big brother he describes as “bigger than life,” a big brother who — in difficult moments — always did what the rest of us hope that we would do.\n\n'He saved all of us'\n\nOn the 27th floor of the north tower, Hansson and Burke parted ways. Burke had taken over with the civilians, leaving Hansson and his company to descend in a stairwell, still wearing the heavy gear they’d brought into the tower.\n\nHansson, with four of his men, began taking the stairs two at a time, checking at every door for civilian stragglers. On the fifth floor, they came upon an office worker too tired to go on under his own power. “He was a large guy,” Hansson said, “and we were literally exhausted.” The little company refused to leave the civilian behind. They used a belt to strap the man into an office chair, and they did their best to carry him downstairs.\n\nIt didn’t work. “The chair collapsed from his weight,” Hansson said. The firefighters, sensing in some primal way that their time was almost gone, grabbed the man and began pulling him down the stairs. “I’ll be honest,” Hansson said. “We gave him a rough ride.” They finally emerged at a mezzanine, where Hansson said several police officers had managed to force open a locked door.\n\nWithout that exit, the little group would have needed to find another way out. Without that exit, Hansson is sure they would be dead. He can still describe what happened, as if he sees it playing out in front of him, once they began a desperate sprint across an outdoor plaza, toward the overhang of the nearby Custom House:\n\n“They led us out that door, on the north side of the building, and we’ve still got this guy by the legs, and we look around and I think: ‘This is hell, what we’re in right now.’ There’s debris all over the place, and I hadn’t known people were jumping (from the upper floors) and we’re dodging them, and I threw down my mask and we’re just running. Then all of a sudden we hear this sound, this roar, and we feel like a plane is coming down on top of us .... I thought it was an explosion ..... and we go from whiteout to blackout just like that, in a second.\n\nEngine 21: The damaged firetruck that carried Capt. Billy Burke and his fellow firefighters to the World Trade Center serves as a permanent tribute at the National Sept. 11 Memorial Museum.\n\n“The building was coming down. It was deafening and you thought it was a shock wave and obviously it was the building forcing all the air into the hole, and I said a prayer and asked God to take me quick, and I got into a fetal position. All these rocks were hitting me — I felt like it was a machine gun of rocks — and in 10 seconds or so it was over. I opened my eyes and there were pockets of fire in the courtyard and holes all over the place and I had no mask and I was choking with all the smoke and dust. I had no idea what happened, and I just thought I’ve got to get over to my guys ...”\n\nThey had survived, as did the big man they rescued. The building, with catastrophic force, had disappeared only seconds after they ran out the door. Life or death, Hansson said, came down to one decision by a captain on the 27th floor:\n\n“Bill Burke’s presence — and his actions — saved all of us.”\n\nAs for Burke, he and the two civilians almost certainly died together. No one can be sure what was in his mind. Maybe he intended to gamble on the elevators, and he saw no reason for other firefighters to share in that risk. Maybe he understood a harsher truth: There would be no time to get a big man in a wheelchair downstairs, and Billy Burke wanted to save as many firefighters as he could — while refusing to allow Beyea and Zelmanowitz to die alone.\n\nWhat is certain is that by ordering his own men to leave the building — and by taking charge of the civilians, which set Hansson free to go — Burke saved his own company, and Hansson’s men, and the office worker they rescued on the fifth floor.\n\nBurke’s family and closest friends knew none of that in the hours after the towers fell. Burke had told Jean Traina he was safely outside the building, leaving her to nurture the hope he had survived. “This was Billy,” said Chris Burke. “You figured he’d get out, because he always did. You figured he’d rise from the void on the third day, walk out of there and ask you to buy him a beer, then ask the prettiest girl in the room for her number.”\n\nInstead, silence became finality. Traina, in a city where the dust of what was lost came down like snow, secluded herself in her apartment. It was only in the following weeks — as disconnected accounts were drawn together as one story — that she and so many others who loved Burke began to comprehend the full measure of his choice.\n\nChris Burke has spent 10 years, in quiet moments, reflecting on the deaths of thousands in the attacks. While the pain does not recede, he has come to see a hard beauty in the decision by his brother on the 27th floor.\n\n“Staying behind with civilians? Getting his men out first? You wouldn’t expect anything less,” Chris said. “That comes straight from our father, from our parents. He knew what was happening. He knew that thing had minutes left before it would collapse. He chose to stay. I think about it, and in my own life — with my wife and kids — you hope to carry on that sense of honor and devotion.”\n\nGregg Hansson, too, cannot forget. For him, at all times, the great tower falls behind him, offering a roar that chokes off air and shakes the earth. He is haunted by the idea that he should have argued about who was in charge of those civilians — even though Hansson was outranked, even though he knows what his fate would have been if he had stayed.\n\nNot long ago, he dropped off his stepson for his freshman year of college. It was the kind of day that is emotional for any family, a powerful yet typical rite of passage, but for Hansson nothing again can ever be typical. He gave the boy a fierce hug and said goodbye, and in that simple act of love he offered thanks to Billy Burke.\n\n\n\nSean Kirst is a columnist with The Post-Standard. Email him at skirst@syracuse.com or read more of his work at www.syracuse.com/kirst"}, {"url": "https://en.geneastar.org/genealogy/burkemary/billie-burke", "page_content": "Mary William Ethelbert Appleton Burke (August 7, 1884 – May 14, 1970) was an American actress who was famous on Broadway and radio, and in silent and sound films. She is best known to modern audiences as Glinda the Good Witch of the North in the Metro-Goldwyn-Mayer movie musical The Wizard of Oz (1939).\n\nBurke was nominated for the Academy Award for Best Supporting Actress for her performance as Emily Kilbourne in Merrily We Live (1938). She is also remembered for her appearances in the Topper film series. Her unmistakable high-pitched, quivering and aristocratic voice, made her a frequent choice to play dimwitted or spoiled society types.\n\nShe was married to Broadway producer and impresario Florenz Ziegfeld Jr. from 1914 until his death in 1932.\n\n...\n\nMary William Ethelbert Appleton Burke (August 7, 1884 – May 14, 1970) was an American actress who was famous on Broadway and radio, and in silent and sound films. She is best known to modern audiences as Glinda the Good Witch of the North in the Metro-Goldwyn-Mayer movie musical The Wizard of Oz (1939).Burke was nominated for the Academy Award for Best Supporting Actress for her performance as Emily Kilbourne in Merrily We Live (1938). She is also remembered for her appearances in the Topper film series. Her unmistakable high-pitched, quivering and aristocratic voice, made her a frequent choice to play dimwitted or spoiled society types.She was married to Broadway producer and impresario Florenz Ziegfeld Jr. from 1914 until his death in 1932.Early lifeBurke was born in Washington, D.C., the daughter of Blanche (née Beatty) and her second husband, William \"Billy\" Ethelbert Burke. She toured the United States and Europe with her father, a singer and clown who worked for the Barnum & Bailey Circus. Her family settled in London where she attended plays in the West End. She began acting on stage in 1903, making her debut in London in The School Girl. Her other London shows included The Duchess of Dantzic (1903) and The Blue Moon (1904). She eventually returned to America to star in Broadway musical comedies.CareerBurke went on to play leads on Broadway in Mrs. Dot, Suzanne, The Runaway, The \"Mind-the-Paint\" Girl, and The Land of Promise from 1910 to 1913, along with a supporting role in the revival of Sir Arthur Wing Pinero's The Amazons. There she met producer Florenz Ziegfeld, marrying him in 1914. Two years later they had a daughter, author Patricia Ziegfeld Stephenson (1916–2008).Burke was signed for the movies and made her cinematic debut in the title role of Peggy (1915). Her success was phenomenal, and she was soon earning what was reputedly the highest salary of any film actress up to that time. She followed her first feature with the 15-part serial Gloria's Romance (1916), another popular and critically acclaimed vehicle. By 1917, she was a favorite with silent-movie fans, rivaling Mary Pickford, Lillian Gish, Clara Kimball Young and Irene Castle. She starred primarily in provocative society dramas and comedies, similar in theme to The \"Mind-the-Paint\" Girl, her most successful American play. Her girlish charm rivaled her acting ability, and as she dressed to the hilt in fashionable gowns, furs and jewelry, her clothes sense also won her the devotion of female audiences. Among the films in which she appeared during this period were Arms and the Girl (1917), The Mysterious Miss Terry, Let's Get a Divorce (1918), Good Gracious, Annabelle (1919), Away Goes Prudence (1920) and The Frisky Mrs. Johnson (1920). As a nod to himself for his wife appearing for Zukor and Lasky, Ziegfeld insisted on promotions for each of the films to carry the tag 'By Special Arrangement with Florenz Ziegfeld'.Burke's beauty and taste made her a major trendsetter throughout the 1910s and 20s. As early as 1909, following her Broadway performance in My Wife (1909), department stores began carrying the \"Billie Burke Dress\" with a signature flat collar and lace trim. During this time, much of Burke's on- and off-screen wardrobe was provided by the leading European couturier Lucile (in private life, Lady Duff Gordon), whose New York branch was the fashion Mecca of socialites and entertainment celebrities. Burke reflected on her reputation as \"a new kind of actress, carefree, and red-headed, and I had beautiful clothes.\"In 1916, Burke had a daughter. In 1917, Burke endorsed Pond’s Vanishing Cream.Despite her success in film, Burke eventually returned to the stage, appearing in Caesar's Wife (1919), The Intimate Strangers (1921), The Marquise (1927) and The Happy Husband (1928).When the family's investments were wiped out in the Wall Street Crash the following year, she resumed screen acting to aid her husband.Burke made her Hollywood comeback in 1932, when she starred as Margaret Fairfield in A Bill of Divorcement, which was directed by George Cukor. She played Katharine Hepburn's mother in the film, which was Hepburn's debut. Despite the death of her husband Florenz Ziegfeld during the film's production, she resumed acting shortly after his funeral.In 1933, Burke was cast as Millicent Jordan, a scatterbrained high-society woman hosting a dinner party in the comedy Dinner at Eight, directed by George Cukor, co-starring with Lionel Barrymore, Marie Dressler, John Barrymore, Jean Harlow and Wallace Beery. The movie was a great success and revitalized her career. She subsequently starred in many comedies and musicals, typecast as a ditzy, feather-brained upper-class matron, with her high-pitched voice.In 1936, Metro-Goldwyn-Mayer filmed a biopic of Florenz Ziegfeld (The Great Ziegfeld), a film that won Academy Awards for Best Picture and Best Actress (Luise Rainer as Ziegfeld's common-law wife, Anna Held). William Powell played Ziegfeld and Myrna Loy played Burke; this infuriated Burke, who was under contract to the studio and believed she could have played herself, however, MGM considered her too old to cast in the part of her younger self.Burke appeared in Topper (1937) in which she played the twittering and puritanical Clara Topper, who is married to a man haunted by socialite ghosts played by Cary Grant and Constance Bennett. She returned to the role in the film's sequels. Her next performance as Emily Kilbourne in Merrily We Live (1938) resulted in her only Oscar nomination. In 1938, she was chosen to play Glinda the Good Witch of the North in the musical The Wizard of Oz (1939), directed by Victor Fleming, starring Judy Garland. She had previously worked with Garland in the film Everybody Sing, in which she played Judy's histrionically hysterical actress-mother. Director George Cukor offered her the role of Aunt Pittypat in Gone With the Wind (1939), but she declined it. The role went to Laura Hope Crews, in a performance that Cukor wanted to be played in a \"Billie Burke-ish manner\" with \"the same zany feeling\". Another successful film series followed with Father of the Bride (1950) and Father's Little Dividend (1951), both directed by Vincente Minnelli and starring Spencer Tracy, Joan Bennett, and Elizabeth Taylor. Burke also portrayed Mrs. Ernest (Daisy) Stanley in the 1942 film The Man Who Came to Dinner.Burke wrote two autobiographies, both with Cameron Shipp, With a Feather on My Nose (Appleton 1949) and With Powder on My Nose (Coward McCann, 1959).Radio and televisionOn CBS Radio, The Billie Burke Show was heard on Saturday mornings from April 3, 1943, until September 21, 1946. Sponsored by Listerine, this situation comedy was initially titled Fashions in Rations during its first year. Portraying herself as a featherbrained Good Samaritan who lived \"in the little white house on Sunnyview Lane,\" she always offered a helping hand to those in her neighborhood. She worked often in early television, appearing in the short-lived sitcom Doc Corkle (1952). She was a guest star on several TV and radio series, including Duffy's Tavern.On television, Burke starred in her own talk show, At Home With Billie Burke, which ran on the DuMont Television Network from June 1951 through the spring of 1952. She was one of the first female talk show hosts, after the hostesses of the earlier DuMont series And Everything Nice (1949–50) and Fashions on Parade (1948–49) which both included some talk show segments.Billie Burke starred in an adaptation of Dr. Heidegger's Experiment on the TV version of Lights Out on November 20, 1950.Return to stage and final filmBurke tried to make a comeback on the New York stage. She starred in two short-lived productions: This Rock and Mrs. January and Mr. X. Although she got good reviews, the plays did not. She also appeared in several plays in California, although her mind became clouded, and she had trouble remembering lines. In the late 1950s, her failing memory led to her retirement from show business, although her explanation at the time was, \"Acting just wasn't any fun anymore.\"Burke made her final screen appearance in Sergeant Rutledge (1960), a western directed by John Ford.Personal lifeAmong Burke's early suitors was the operatic tenor Enrico Caruso.In 1910, Burke bought the Kirkham estate on Broadway in Hastings-on-Hudson, New York, and renamed the mansion, Burkeley Crest.In April 1914, Burke married Florenz Ziegfeld.In 1921, Burke retired to raise her daughter Patricia, but resumed work after the Wall Street Crash of 1929.In 1932, Burke moved from New York to Beverly Hills, California, after the death of Ziegfeld.Burke died in Los Angeles of natural causes on May 14, 1970, at the age of 85, and she was interred besideZiegfeld at Kensico Cemetery, Valhalla, Westchester County, New York.LegacyFor many years, Burke's framed photo was displayed above the exit staircase at New York City's Ziegfeld Theatre, but it disappeared after renovations. An opening-night program bearing a picture of her from her 1912 triumph The Mind The Paint Girl (Sir Arthur Wing Pinero) is displayed in the lobby of the Lyceum Theatre in Manhattan.For her contributions to the film industry, Burke was inducted into the Hollywood Walk of Fame in 1960 with a motion pictures star at 6617 Hollywood Boulevard.The Academy Film Archive houses the Florenz Ziegfeld-Billie Burke Collection, which consists primarily of home movies.On November 4, 2015, the crater Burke, near the north pole of the planet Mercury, was named after Billie Burke.Performance careerRadioThe Ziegfeld Follies of the Air – 1932Doubting Thomas - 1935Good News of 1939 – 1938The Rudy Vallee Hour – 1939The Gulf Screen Guild Theater – 1939The Rudy Vallee Sealtest Show – 1940–41The Pepsodent Show – 1941The Billie Burke Show – 1943–1946Duffy's Tavern – 1944The Sealtest Village Store – 1944Mail Call – 1944The Charlie McCarthy Show – 1944–47Tribute to Ethel Barrymore – 1945The Rudy Vallee Show – 1945Show Stoppers – 1946The Danny Kaye Show – 1946WOR 25th Anniversary – 1947Your Movietown Radio Theatre – 1948The Eddie Cantor Pabst Blue Ribbon Show – 1948Family Theater – 1948–52This Is Show Business – CBS-TV, 1949The Martin and Lewis Show – 1949The Bill Stern Colgate Sports Newsreel – 1949Stagestruck – 1954Biography in Sound – 1955–56BroadwayMy Wife – 1907Love Watches – 1908Mrs. Dot – 1910Suzanne – 1910The Philosopher in the Apple Orchard – 1911The Runaway – 1911The Amazons – 1913The Land of Promise – 1913Jerry – 1914The Rescuing Angel – 1917A Marriage of Convenience – 1918Caesar's Wife – 1919The Intimate Strangers (musical)|The Intimate Strangers – 1921Rose Briar – 1922Annie Dear – 1924The Marquise – 1927The Happy Husband – 1928Family Affairs – 1929The Truth Game – 1930Ziegfeld Follies of 1934 – 1934 (producer)Ziegfeld Follies of 1936 – 1936 (producer)This Rock – 1943Ziegfeld Follies of 1943 – 1943 (producer)Mrs. January and Mr. X - 1944FilmographySee alsoAcademy of Music/Riviera TheatreList of actors with Academy Award nominationsReferencesFurther readingAlistair, Rupert (2018). \"Billie Burke\". The Name Below the Title : 65 Classic Movie Character Actors from Hollywood's Golden Age (softcover) (First ed.). Great Britain: Independently published. pp. 57–60. ISBN 978-1-7200-3837-5.Burke, Billie. With a Feather on my Nose. (First ed.) New York: Appleton-Century-Crofts, 1948. ISBN 978-1162773513.Burke, Billie. With Powder on my Nose (First ed.) New York, Coward-McCann, Inc. 1959Hayter-Menzies, Grant (2009). Mrs. Ziegfeld: The Public and Private Lives of Billie Burke. USA: McFarland & Company, Inc. ISBN 978-1-4766-6596-2.External linksBillie Burke at IMDbBillie Burke at the Internet Broadway DatabaseAllMovie.comBillie Burke still photos from several Billie plays and lost Billie silent films Univ. of Washington Sayre collectionBillie Burke Archived March 4, 2012, at the Wayback Machine photos Univ. of Louisville Macauley CollectionFlo Ziegfeld-Billie Burke Papers, 1907-1984, held by the Billy Rose Theatre Division, New York Public Library for the Performing ArtsBillie Burke Digital Image Gallery, Billy Rose Theatre Division, New York Public Library for the Performing ArtsBillie Burke Collection, held by the Howard Gotlieb Archival Research Center, Boston UniversityLiterature on Billie BurkeBillie Burke with one of her motorcars, a Rolls-Royce\n\n\n\nBiography from Wikipedia (see original) under licence CC BY-SA 3.0"}, {"url": "https://www.todaybirthdays.com/famous/billy-burke.html", "page_content": "He rose to fame for his role as Charlie Swan in the immensely popular Twilight saga film franchise. He also played roles in Ladder 49, Along Came a Spider, and Final Jeopardy.He was cast as the lead role in the upcoming J.J. Abrams-produced sci-fi series, Revolution.In his debut film, he played a role alongside Lloyd Bridges and Christina Applegate. The film was 1998's Jane Austen's Mafia!\n\nHe sang in a band during his teenage years. He made his acting debut in the 1990 film, Daredreamer.\n\nHe dated actress Neve Campbell from 2002 to 2004. He had a daughter named Bluesy Burke with actress Pollyanna Rose, whom he married.\n\nFrom The Fortress\n\nMovie Actor Billy Burke were born on Friday, birthstone is Topaz, the seaon was Fall in the Chinese year of Horse, it is 328 days until Billy Burke next birthday.\n\nNovember 25 Horoscope."}, {"url": "https://chemistry.fudan.edu.cn/chemen/a3/5a/c22421a238426/page.htm", "page_content": "Y. Liu, W. Li, J. Zhang* Chiral ligands designed in China. Natl. Sci. Rev. 2017, 4, 326–358.\n\nY. Wang, P.-C. Zhang, X. Di, Q. Dai, Z.-M. Zhang, J. Zhang* Gold-Catalyzed Asymmetric Intramolecular Cyclization of N-Allenamides for the Synthesis of Chiral Tetrahydrocarbolines. Angew. Chem. Int. Ed. 2017, 56, 15905–15909.\n\nS. Xu, Z.-M. Zhang, B. Xu, B. Liu, Y. Liu*, J. Zhang* Enantioselective Regiodivergent Synthesis of Chiral Pyrrolidines with Two Quaternary Stereocenters via Ligand-Controlled Copper(I)-Catalyzed Asymmetric 1,3-Dipolar Cycloadditions. J. Am. Chem. Soc. 2018, 140, 2272–2283.\n\nL. Wang, M. Chen, P.-C. Zhang, W. Li, J. Zhang* Palladium/PC-Phos-Catalyzed Enantioselective Arylation of General Sulfenate Anions: Scope and Synthetic Applications. J. Am. Chem. Soc. 2018, 140, 3467–3473.\n\nZ.-M. Zhang, B. Xu, Y. Qian, L. Wu, Y. Wu, L. Zhou, Y. Liu, J. Zhang* Palladium-Catalyzed Enantioselective Reductive Heck Reactions: Convenient Access to 3,3-Disubstituted 2,3-Dihydrobenzofuran. Angew. Chem. Int. Ed. 2018, 57, 10373–10377.\n\nH. Wang, L. Zhang, Y. Tu, R. Xiang, Y.-L. Guo*, J. Zhang* Phosphine-Catalyzed Difunctionalization of β-Fluoroalkyl α,β-Enones: A Direct Approach to β-Amino α-Diazo Carbonyl Compounds. Angew. Chem. Int. Ed. 2018, 57, 15787–15791.\n\nH. Wang, J. Zhan, Y. Tu, J. Zhang* Phosphine-Catalyzed Enantioselective Dearomative [3+2]-Cycloaddition of 3-Nitroindoles and 2-Nitrobenzofurans. Angew. Chem. Int. Ed. 2019, 58, 5422–5426.\n\nZ.-M. Zhang, B. Xu, L. Wu, L. Zhou, D. Ji, Y. Liu, Z. Li*, J. Zhang* Palladium/XuPhos-Catalyzed Enantioselective Carboiodination of Olefin-Tethered Aryl Iodides. J. Am. Chem. Soc. 2019, 141, 8110–8115.\n\nP.-C. Zhang, J. Han, J. Zhang* Pd/PC-Phos-Catalyzed Enantioselective Intermolecular Denitrogenative Cyclization of Benzotriazoles with Allenes and N-Allenamides. Angew. Chem. Int. Ed. 2019, 58, 11444–11448. (VIP)\n\nZ.-M. Zhang, B. Xu, L. Wu, Y. Wu, Y. Qian, L. Zhou, Y. Liu, J. Zhang* Enantioselective Dicarbofunctionalization of Unactivated Alkenes by Palladium-Catalyzed Tandem Heck/Suzuki Coupling Reaction. Angew. Chem. Int. Ed. 2019, 58, 14653–14659.\n\nC. Zhu, H. Chu, G. Li, S. Ma*, J. Zhang* Pd-Catalyzed Enantioselective Heck Reaction of Aryl Triflates and Alkynes. J. Am. Chem. Soc. 2019, 141, 19246–19251.\n\nQ. Dai, W. Li, Z. Li, J. Zhang* P-Chiral Phosphines Enabled by Palladium/Xiao-Phos-Catalyzed Asymmetric P–C Cross-Coupling of Secondary Phosphine Oxides and Aryl Bromides. J. Am. Chem. Soc. 2019, 141, 20556–20564.\n\nH. Wang, H. Luo, Z.-M. Zhang, W.-F. Zheng, Y. Yin, H. Qian*, J. Zhang*, S. Ma* Pd-Catalyzed Enantioselective Syntheses of Trisubstituted Allenes via Coupling of Propargylic Benzoates with Organoboronic Acids. J. Am. Chem. Soc. 2020, 142, 9763–9771.\n\nL. Wang, K. Zhang, Y. Wang, W. Li, M. Chen, J. Zhang* Enantioselective Synthesis of Isoxazolines Enabled by Palladium-Catalyzed Carboetherification of Alkenyl Oximes. Angew. Chem. Int. Ed.2020, 59, 4421–4427.\n\nL. Zhou, S. Li, B. Xu, D. Ji, L. Wu, Y. Liu, Z.-M. Zhang*, J. Zhang* Enantioselective Difunctionalization of Alkenes by a Palladium-Catalyzed Heck/Sonogashira Sequence. Angew. Chem. Int. Ed. 2020, 59, 2769–2775.\n\nQ. Dai, L. Liu, Y. Qian, W. Li, J. Zhang* Construction of P-Chiral Alkenylphosphine Oxides through Highly Chemo-, Regio-, and Enantioselective Hydrophosphinylation of Alkynes. Angew. Chem. Int. Ed.2020, 59, 20645–20650.\n\nH. Chu, J. Cheng, J. Yang, Y.-L. Guo*, J. Zhang * Asymmetric Dearomatization of Indole via Palladium/PC-Phos-Catalyzed Dynamic Kinetic Transformation. Angew. Chem. Int. Ed. 2020, 59, 21991–21996. (Hot Paper)\n\nT.-Y. Lin, Z. Pan, Y. S. Zhu, H.-H. Wu, Y. Liu, Z. Li*, J. Zhang* Design and Synthesis of TY-Phos and Application in Palladium-Catalyzed Enantioselective Fluoroarylation of gem-Difluoroalkenes. Angew. Chem. Int. Ed. 2020, 59, 22957−22962.\n\nD. Qian, J. Zhang* Yne–Enones Enable Diversity-Oriented Catalytic Cascade Reactions: A Rapid Assembly of Complexity. Acc. Chem. Res.2020, 53, 2358–2371.\n\nZ. Pan, W. Li, S. Zhu, F. Liu, H.-H. Wu, J. Zhang* Palladium/TY-Phos-Catalyzed Asymmetric Intermolecular α-Arylation of Aldehydes with Aryl Bromides. Angew. Chem. Int. Ed.2021, 60, 18542–18546. (Hot Paper)\n\nP.-C. Zhang, Y.-L. Li, J. He, H.-H. Wu*, Z. Li*, J. Zhang* Simultaneous construction of axial and planar chirality by gold/TY-Phos-catalyzed asymmetric hydroarylation. Nat. Commun.2021, 12, 4609.\n\nY.-L. Li, P.-C. Zhang, H.-H. Wu, J. Zhang* Palladium-Catalyzed Asymmetric Tandem Denitrogenative Heck/Tsuji–Trost of Benzotriazoles with 1,3-Dienes. J. Am. Chem. Soc. 2021, 143, 13010–13015.\n\nG. Zhao, Y. Wu, H.-H. Wu, J. Yang*, J. Zhang* Pd/GF-Phos-Catalyzed Asymmetric Three-Component Coupling Reaction to Access Chiral Diarylmethyl Alkynes. J. Am. Chem. Soc. 2021, 143, 17983–17988.\n\nQ. Dai, L. Liu*, J. Zhang* Palladium/Xiao-Phos-Catalyzed Kinetic Resolution of sec-Phosphine Oxides by P-Benzylation. Angew. Chem. Int. Ed. 2021, 60, 27247–27252."}], "Billy Burke was an American professional golfer.": [{"url": "https://www.wikiwand.com/en/Billy_Burke_(golfer)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Billy Burke (golfer)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.golfcompendium.com/2020/01/billy-burke-golfer.html", "page_content": "Billy Burke was a PGA Tour winner from the 1920s into the 1940s. He's most famous because he played in, and won, the longest playoff in major championship history: 72 playoff holes.\n\nFull name: William John Burke (birth name Burkowski)\n\nDate of birth: December 14, 1902\n\nPlace of birth: Naugatuck, Connecticut\n\nDate and place of death: April 19, 1972 in Clearwater, Florida\n\nBurke's PGA Tour Wins\n\n1927 Florida Open\n\n1927 Central Florida Open\n\n1928 North and South Open\n\n1929 New York State Open\n\n1929 Glens Falls Open\n\n1930 Mid South Open\n\n1931 U.S. Open\n\n1931 Glens Falls Open\n\n1932 Florida West Coast Open\n\n1935 The Cascades Open\n\n1936 Centennial Open\n\n1939 Walter Hagen 25th Anniversary*\n\n1940 Miami Biltmore International Four-Ball*\n\nBurke is credited with wins in 13 tournaments that are now counted by the PGA Tour as official tour wins:*These two were two-man team tournaments. At the 1939 Hagen, Burke partnered with Ed Dudley . At the 1940 Miami International, his partner was Craig Wood\n\nIn the Majors\n\nHis victory in the 1931 U.S. Open (more on that to come) was Burke's lone win in a major championship. And he never played in the British Open. His best other finishes were third places in the 1934 Masters and in the 1939 Masters ; plus he reached the semifinals in the 1931 PGA Championship\n\nOverall, Burke had six Top 10s in majors. The first major he played in was the 1928 U.S. Open, and he last played in a major in the 1961 Masters.\n\nHis Epic 1931 U.S. Win\n\nNot only did Burke win the 1931 U.S. Open , he won it playing with steel-shafted golf clubs. He was the first golfer to win the U.S. Open with steel shafts.\n\nOh, and then there was that 72-hole playoff. This Open was played at Inverness in Ohio, scheduled to end on July 4. The weather was brutal with temperatures in the 90s, some days approaching 100 — the 1931 U.S. Open is sometimes remembered as \"the Inferno at Inverness.\"\n\nBurke opened with a 73, two off the lead. In the second round, he shot 72 and moved to within one of leader George Von Elm. Von Elm was the tour's leading money winner heading into this tournament.\n\nOn the third day they played 36 holes, the third and fourth rounds. Von Elm's lead over second-place Burke was two following the third round. But Burke took the lead in Round 4, until Von Elm made a 10-foot putt to tie him on the 72nd hole.\n\nFor the first time, the USGA used a 36-hole playoff to decide its Open champion. The only problem was that Burke and Von Elm ended the 36-hole playoff day tied again, and again after Von Elm made a 10-footer on the final hole to tie. They both carded 149s.\n\nSo the next day, they came back and did it all again, their third consecutive day playing 36 holes. And this 36 holes was just like the previous two: tight throughtout. In fact, Burke and Von Elm traded the lead 25 times over the final 36.\n\nIn the end, after 72 holes of regular play and 72 more playoff holes, Burke won by a single stroke. He won the second playoff 148 to 149.\n\nThe USGA reacted to this epic battle — one literally hotly contested in July — two ways: It moved the U.S. Open from July back to June to try to reduce the heat; and it eliminated 36-hole playoffs, going back to 18-hole playoffs.\n\nMore About Billy Burke\n\nBurke was the son of Polish immigrants to American from Lithuania (the family name was Burkauskas, which was polonized to Burkowski, then anglicized to Burke). Billy began playing golf at age 12 after first starting caddying.\n\nAs a teenager, Burke went to work in the same iron foundry in which his father worked. But an accident there took off Burke's ring finger on his left hand, plus part of his left pinkie. After that, he had to rebuild his golf grip to work for him despite those missing fingers.\n\nIt didn't much slow Burke's progress as a golfer. After a hard day in the foundry, Burke headed to the driving range to practice. In Connecticut golf circles, they started calling him \"the Boy Marvel\" for his golf prowess.\n\nWhen he was 18, Burke first entered the Connecticut State Amateur. The only problem was he didn't own the clothes (such as plus-fours) to meet the dress standard for that big event. His dilemma received local media attention, and two local golfers Burke caddied for stepped up to outfit him with new golf clothes and pay his fare to the tournament.\n\nIn 1923, when he was 20, Burke made it to the championship match of the Connecticut State Amateur before losing to Henry Topping. But it turned out to be a great loss for Burke: Topping was a millionaire businessman who became an ongoing benefactor for Burke's golf career, including staking him when he shortly turned pro to try the PGA Tour.\n\nBurke began winning pro tour events in the late 1920s (the 1927 Florida Open is credited as his first tour win). His final tour win was in 1940.\n\nBurke also won other tournaments that are not counted as PGA Tour events, including the Ohio Open four times: 1938, 1939, 1945 and lastly in 1955 at the age of 52.\n\nThe year of 1931 was one of three in which he won twice on tour (1927 and 1929 being the other two), but it was without question his best year. It included his only major championship win at the U.S. Open, plus he reached the semifinals in the PGA Championship. Burke made the first of two appearances on Team USA in the Ryder Cup that year, winning both matches he played. (He also played in the 1933 Ryder Cup.)\n\nAnd Burke got married that year to Marguerite, who survived him when he died at age 69 in 1972.\n\nLater in 1931, Burke and George Von Elm, off the hoopla surrounding their 72-hole playoff, went on an exhibition tour together.\n\nAlong the way, Burke also worked as a club pro and was noted as a golf instructor. He was pro for 29 years, beginning in 1934, at Cleveland (Ohio) Country Club. From 1946-62, he was the winter-season pro at Clearwater (Fla.) Country Club. Burke also taught at the 9-hole course in his hometown of Naugatuck, Conn., as well as in Dark Harbor, Maine. In addition, Burke had endorsement deals with sports equipment companies and Billy Burke-branded golf clubs and golf balls were both produced during his heyday.\n\nBurke was inducted into the PGA Hall of Fame in 1966."}, {"url": "https://www.nytimes.com/1972/04/21/archives/billy-burke-golfer-who-won-open-in-31.html", "page_content": "CLEARWATER, Fla., April 20 (UPI)—Billy Burke, the professional golfer, died here yesterday after a long illness. He was 69 years old.\n\nBurke made golfing record books in 1931 when he won a marathon 72‐hole playoff for the United States Open title. He and George Von Elm were tied at the end of regulation play in that tourney over the Inverness Golf Club course at Toledo, Ohio, and went into the playoff the next day.\n\nAt the end of the 36 holes they still were tied and had to play another 36 holes the following day. Burke won by one stroke.\n\nBurke, who played with a slightly unorthodox grip because of the loss of parts of two fingers on his left hand, was a member of the United States Ryder Cup team in 1931 and 1933 and was golf professional at the Cleveland country club for 29 years."}, {"url": "https://www.metroleague.org/is-billy-burke-a-good-golfer_gf23/", "page_content": "Billy Burke was known as one of the distinguished figures in the world of golf in the early 20th century. With several high-profile PGA Tour wins and a remarkable victory in the longest playoff in major championship history, he has left a lasting impact on the sport.\n\nAccomplishments and Statistics\n\nBilly Burke was a prominent professional golfer who made his mark in the PGA Tour scene from the 1920s through the 1940s. Although his career was not as illustrious as some of the all-time greats, such as Bobby Jones or Walter Hagen, Burke has some impressive achievements under his belt.\n\nPGA Tour Wins\n\nBurke accumulated 17 PGA Tour victories in his career. His first win came in 1927 at the Los Angeles Open, and his final win was at the Western Open in 1946. Aside from these two victories, he also won the Miami Open twice, the Greater Greensboro Open twice, and the North and South Open four times.\n\nMajor Championship Record\n\nBurke’s most significant achievement in major championships was during the 1931 U.S. Open. He secured his only major win after outlasting George Von Elm in the longest playoff in major championship history, which took 72 holes to determine a winner. Burke finished his career with six top-10 finishes in major championships, including his win in 1931.\n\nCareer Earnings\n\nDuring his professional career, Burke earned a total of $30,302.50. Although this amount may seem paltry compared to today’s standards, it was a respectable amount in his era.\n\nIt is worth noting that prize money was comparatively lower in those days, and professional golfers relied heavily on exhibition matches to supplement their income.\n\nScoring Average\n\nBurke’s scoring average varies widely depending on the source. However, according to the PGA Tour records, his average score was 73.55. This score is not astonishingly low, but it was reasonably typical for that time. It is essential to keep in mind that courses were not as long or as challenging as they are now.\n\nBurke may not be a household name compared to some of the golfing greats, but his accomplishments and contributions to the game are noteworthy.\n\nWinning the longest playoff in major championship history and securing 17 PGA Tour victories is no small feat. Burke was a consummate professional, an accomplished golfer, and an integral part of golf’s history.\n\nStyle of Play\n\nStrengths and weaknesses\n\nBilly Burke was known for having a strong short game and phenomenal putting abilities. He was also known for his accuracy off the tee. However, his weakness was his inconsistency in long iron play. He also had a relatively low ball flight which sometimes led to difficulty in playing in windy conditions.\n\nApproach to the Game\n\nBurke had a strategic approach to the game of golf. He was known for his precision and patience on the course. He was always analyzing and evaluating each shot before making his move, and this approach paid off for him in the long run. He often played smarter than his opponents and made fewer mistakes in crucial moments.\n\nHow His Style of Play Contributed to His Success\n\nBurke’s strength in his short game and putting enabled him to save shots where other players might have lost strokes. This allowed him to stay in the game and potentially recover after hitting a poor tee shot or approach.\n\nHis precision and patience also contributed to his success in high-pressure situations, such as during the 1931 U.S. Open where he won after a grueling 72-hole playoff.\n\nOverall, Burke’s style of play focused on accuracy, precision, and smart decision-making, uniquely suited him for success on the PGA Tour. His strength in the short game and putting coupled with his strategic approach allow him to stand out as one of the tour’s most successful and memorable golfers.\n\nCompetition and Rivals\n\nNotable Competitors and Rivals\n\nDuring Billy Burke’s career on the PGA Tour, he faced several notable competitors and rivals. One of his main rivals was Gene Sarazen, who was also a top-performing golfer during the 1920s and 1930s.\n\nBurke and Sarazen consistently competed against each other in various tournaments, including major championships.\n\nAnother competitor that Burke faced was Walter Hagen, who was also considered one of the greatest golfers of all time. Hagen and Burke had several head-to-head matchups during their careers, and both golfers respected each other’s games.\n\nHead-to-Head Matchups and Records\n\nBurke had several head-to-head matchups against his competitors and rivals throughout his career. One notable record was his long playoff match against George Von Elm in the 1931 U.S. Open. The playoff match lasted a record-breaking 72 holes, and Burke ended up winning the championship.\n\nBurke also had several matchups against Gene Sarazen, who he competed against in various tournaments throughout their careers. Sarazen and Burke had several close matchups, with Sarazen ultimately coming out on top in some instances.\n\nIn his matchups against Walter Hagen, Burke had mixed success. He was able to beat Hagen in some tournaments, but Hagen also defeated Burke in several head-to-head matchups.\n\nImpact on Burke’s Career and Success\n\nThe competition and rivalries that Burke faced throughout his career had a significant impact on his success as a professional golfer. Facing tough competition and rivals pushed Burke to improve his game and become a better golfer. It also helped to solidify his legacy as a top golfer during his era.\n\nAdditionally, Burke’s long playoff match against George Von Elm in the 1931 U.S. Open helped to cement his place in golf history. Winning a major championship after such a grueling playoff match showcased Burke’s resilience and determination on the golf course.\n\nBilly Burke faced several notable competitors and rivals throughout his career on the PGA Tour. These head-to-head matchups and rivalries had a significant impact on Burke’s success and legacy as a professional golfer.\n\nLegacy and Impact on Golf\n\nInfluence on Future Golfers\n\nBilly Burke’s legacy in golf is notable for being one of the game’s pioneers during the early 20th century. Known for his exceptional skills on and off the course, Burke’s influence extended beyond his time as a player, as he inspired many future golfers for years to come.\n\nHis sporting acumen made him an excellent role model for the next generation of golfers. One of the players who took inspiration from Burke’s style of play and success was Ben Hogan, who is widely regarded as one of the greatest players in history.\n\nHogan, who won nine major championships and was known for his ball-striking abilities, admired Burke’s work ethic, approach to the game, and innovative techniques, which helped Hogan hone his skills on the golf course.\n\nContributions to the Sport\n\nBurke’s contributions to the sport of golf were immense, and he helped shape the game into what it is today. He was one of the first players to develop the crossover grip, which was a game-changing technique that helped players gain more control over the ball.\n\nApart from his contributions to playing techniques, Burke also played a significant role in golf course design. He worked on several golf courses and lent his expertise to iconic golf courses such as Cypress Point and Pebble Beach. Burke was also involved in the design of Seminole Golf Club, which hosted the 2021 Walker Cup.\n\nHow He is Remembered in Golf History\n\nBilly Burke is remembered in golf history as a trailblazer who helped elevate the game to new heights. His achievements on the course, including winning the 1931 U.S. Open, which is considered one of the most memorable in golf history, alongside Gene Sarazen’s albatross in 1935, will forever be remembered.\n\nBurke’s impact on the sport extended beyond his time on the course, as he set a high standard for professionalism and helped elevate the game in the minds of the public.\n\nHis sportsmanship and dedication to the sport contributed to the growth and popularity of golf, and his lasting legacy continues to inspire golfers around the world today.\n\nWhat Happened to Billy Hurley?\n\nBilly Hurley served in the U.S. Navy for 5 years, from 2004-2009. After leaving the Navy, he pursued a career in professional golf. Hurley has achieved success as a professional golfer. In 2016, he won his first PGA Tour event at the Quicken Loans National.\n\nHurley has also played on the Korn Ferry Tour. In 2021, he qualified for and played in the U.S. Senior Open. In addition to his golf career, Hurley has been an advocate for veterans’ issues. He has served as the chairman of the PGA Tour’s Veterans Advisory Council.\n\nHurley has also given back to the military community through his charitable foundation. Today, Billy Hurley continues to play professional golf and support veterans.\n\nWhat is John Daly Famous for?\n\nJohn Daly is famous for being a professional golfer. He turned pro in 1987 and quickly earned his first pro victory. He joined the PGA TOUR in 1991. Daly has two major championship wins on his record.\n\nDaly is known for his unorthodox swing and unconventional style. He has had a controversial career that has been both praised and criticized. Daly has battled addiction and personal struggles throughout his career.\n\nHe is often referred to as a fan favorite due to his personality and fun-loving nature. Daly has also pursued a career in music and released several albums. He remains an active golfer, regularly competing on the PGA Champions Tour.\n\nCan Pga Golfers Listen to Music?\n\nPGA golfers are not allowed to listen to music during tournaments. This rule is outlined in Rule 1.2 governing player conduct. The rule does not make exceptions for any type of music. PGA golfers may not listen to music to eliminate distractions.\n\nNor may they use music to help with the swing tempo. Virtual caddie apps that use audio are also prohibited. PGA golfers are allowed to use earplugs to protect their hearing. However, they are not allowed to wear headphones or earbuds.\n\nThe rule is in place to maintain the integrity of the game. Violating this rule can result in penalties, fines, or disqualification.\n\nCan Pga Players Have Phones?\n\n1. PGA Tour’s Mobile Device Policy\n\nThe PGA Tour has a strict mobile device policy that prohibits live streaming or real-time coverage of the tournament. Texting and data use, however, are allowed in all areas throughout the week.\n\n2. No Shot-by-Shot Coverage\n\nPGA Tour spectators are not allowed to provide shot-by-shot coverage of players using their phones. This ensures a level playing field for all players as it prevents unfair advantages.\n\n3. Designated Phone Call Areas\n\nPhone calls are only permitted in designated areas. This ensures that tournament play is not disrupted by the noise from phone calls.\n\n4. Penalty for Violations\n\nThe PGA Tour imposes penalties for violations of their mobile device policy. Spectators who take live photos or videos of the tournament or violate the no live streaming rule may have their phones confiscated.\n\n5. Exceptions for PGA Players\n\nPGA players are not subject to the same mobile device policy as spectators. They are permitted to bring their phones onto the course, but they must follow specific guidelines during play to ensure fair competition.\n\nTo Recap\n\nLooking at Billy Burke’s achievements, it is clear that he was more than just a good golfer. His remarkable success on the PGA Tour for over two decades, along with his incredible victory in the longest playoff in major championship history, solidifies his status as one of the greats.\n\nAlthough golf has evolved in the last century, Burke’s impact on the game is undeniable. He is still remembered and respected today as one of the most significant figures in the sport’s history.\n\nSimilar Posts:"}, {"url": "https://www.celebsagewiki.com/billy-burke-golfer", "page_content": "Age, Biography and Wiki\n\nBilly Burke (golfer) (William John Burke) was born on 14 December, 1902 in Naugatuck, Connecticut, United States, is a professional. Discover Billy Burke (golfer)'s Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 70 years old?\n\nPopular As William John Burke Occupation N/A Age 70 years old Zodiac Sign Sagittarius Born 14 December 1902 Birthday 14 December Birthplace Naugatuck, Connecticut, United States Date of death (1972-04-19) Died Place N/A Nationality Connecticut\n\nWe recommend you to check the complete list of Famous People born on 14 December. He is a member of famous professional with the age 70 years old group.\n\nBilly Burke (golfer) Height, Weight & Measurements\n\nAt 70 years old, Billy Burke (golfer) height is 5 ft 11.5 in (1.82 m) and Weight 172 lb (78 kg; 12.3 st).\n\nPhysical Status Height 5 ft 11.5 in (1.82 m) Weight 172 lb (78 kg; 12.3 st) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBilly Burke (golfer) Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Billy Burke (golfer) worth at the age of 70 years old? Billy Burke (golfer)’s income source is mostly from being a successful professional. He is from Connecticut. We have estimated Billy Burke (golfer)'s net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income professional\n\nBilly Burke (golfer) Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://prabook.com/web/billy.burke/1754184", "page_content": "Billy Burke\n\ngolfer\n\nDecember 14, 1902 (age 69) Naugatuck, Connecticut\n\nHe was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149. Throughout Burke\"s golf career he used an unorthodox grip due to the loss of two fingers on his left hand. In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame. Burke died in Clearwater, Florida. Professional Golf Association Tour wins (13) 1927 (2) Florida Open, Central Florida Open Other wins (4) Wins (1) 1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7). Results timeline."}, {"url": "https://thealbatross.substack.com/p/billy-burkes-singular-achievement", "page_content": "Despite the big differences between the generations in most areas of golf, achievements of one era often can be repeated at a subsequent time if talent and circumstances align. Someone could do what Bobby Jones did in 1930 (calendar year Grand Slam) or what Tiger Woods did in 2000-01 (four consecutive major wins). But the 1931 U.S. Open is a stubborn exception.\n\nNobody will ever win the national championship in the manner of Billy Burke 90 years ago this week.\n\nTournaments aren’t even decided by 18-hole playoffs anymore—it’s either sudden death or an aggregate format of a couple of holes—so the fact that Burke had to go through two 36-hole playoffs following 72 holes of medal play to defeat George Von Elm at Inverness Club in Toledo makes his achievement the ultimate outlier.\n\n“Apparently they are going on forever,” Grantland Rice wrote in his syndicated column after the first playoff. “After the most sensational 36-hole playoff in the history of golf, they are still tied up in a two-ply Gordian Knot at 149 strokes each. There were enough fireworks in this contest to make the fall of Pompeii look like a single Roman candle.”\n\nHyperbolic to be sure, but Rice had a point. There were 25 lead changes over the 72 playoff holes. After making a birdie putt on the 72nd hole of regulation, Von Elm did it again on the 36th playoff hole to force another long day.\n\nBurke’s count that early July week in Ohio: 144 holes, 589 strokes, 32 cigars, a one-stroke margin over Von Elm. The winner did it in scorching heat—there a number of heat-related deaths in the area—and on the heels of 72 holes of Ryder Cup qualifying and 72 holes of match-play competition in late June as . When Burke set out for Niagara Falls and a delayed honeymoon with his wife, Marguerite, after being the last man standing at Inverness, he had played 288 holes in 16 days.\n\nIt’s well known that Burke was the first golfer to win a major title with steel shafts in his clubs (Von Elm was still using hickory), but he also did it with a lighter, 1.55 ounce ball that the USGA had mandated for that season to put more challenge into the game. Like the 36-hole playoff format, the lighter ball was gone after 1931.\n\nBurke was born in 1902, the same year as Jones and Gene Sarazen. William John Burkowski grew up in Naugatuck, Conn., and like Eugenio Saraceni came from a working-class family. “He impresses me as a player who has learned his game through a lot of hard work,\" Jones wrote in the The American Golfer, \"as contrasted to one who has come by it easily and naturally.\" John Kiernan of The New York Times observed that Burke was “a square-shouldered stalwart who might pass as pugilist or a heavy-hitting second baseman.”\n\nBurke succeeded at golf despite a disability from an accident in an iron foundry. (The New York Daily News)\n\nBurke did wear a small glove on his left hand, an accommodation for a disability after an accident at an iron foundry as a teenager cost him parts of two fingers. Having gotten exposed to golf as a young caddie at Naugatuck Golf Club (now Hop Brook Golf Course), Burke also toiled at other jobs including an office janitor and at factories making boots and safety pins before becoming a golf pro. For Burke, playing a sport for a living—even a marathon championship in the heat—really was a “golden grind,” to use Al Barkow’s wonderful term from his important 1974 history of the tour.\n\nFollowing his U.S. Open victory, Golf Illustrated predicted Burke was “a new star who is destined long to shine.” Credited with 11 PGA Tour victories, Burke didn’t win another major title but had two third-place finishes in the Masters (1934 and 1939) and put up an admirable defense of his U.S. Open victory in 1932, tying for seventh.\n\nThe man who prevailed in a 72-hole playoff died in 1972, at age 69."}, {"url": "https://infogalactic.com/info/Billy_Burke_(golfer)", "page_content": "From Infogalactic: the planetary knowledge core\n\nWilliam John Burke, Burkauskas (polonized Burkowski) (December 14, 1902 – April 19, 1972) was a prominent Lithuanian American professional golfer of the 1920s and 1930s.\n\nBurke was born in Naugatuck, Connecticut. His greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf.[1] Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used an unorthodox grip due to the loss of two fingers on his left hand.[2] In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame.[3] Burke died in Clearwater, Florida.\n\nProfessional wins (17)\n\nPGA Tour wins (13)\n\nMajor championship is shown in bold.\n\nOther wins (4)\n\nthis list may be incomplete\n\nMajor championships\n\nWins (1)\n\nYear Championship 54 holes Winning score Margin Runner-up 1931 U.S. Open 2 shot deficit +8 (73-72-74-73=292) Playoff 1 George Von Elm\n\n1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7).\n\nResults timeline\n\nTournament 1928 1929 U.S. Open T18 15 PGA Championship R32 DNP\n\nTournament 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 Masters Tournament NYF NYF NYF NYF T3 T37 28 T29 T13 T3 U.S. Open T28 1 T7 T33 T6 T32 T18 T16 WD T42 PGA Championship R32 SF DNP DNP DNP R64 R16 R32 R16 R16\n\nTournament 1940 1941 1942 1943 1944 1945 1946 1947 1948 1949 Masters Tournament WD DNP T23 NT NT NT 46 57 T43 T35 U.S. Open DNP WD NT NT NT NT T45 T27 DNP CUT PGA Championship R32 DNP DNP NT DNP DNP DNP DNP DNP DNP\n\nTournament 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 Masters Tournament T29 DNP WD WD DNP T36 WD WD CUT CUT U.S. Open CUT CUT DNP DNP CUT DNP DNP DNP DNP DNP PGA Championship DNP DNP DNP DNP DNP DNP DNP DNP DNP DNP\n\nTournament 1960 1961 1962 Masters Tournament CUT CUT WD U.S. Open DNP DNP DNP PGA Championship DNP DNP DNP\n\nNote: Burke never played in The Open Championship.\n\nNYF = Tournament not yet founded\n\nNT = No tournament\n\nDNP = Did not play\n\nWD = Withdrew\n\nCUT = missed the half-way cut\n\nR64, R32, R16, QF, SF = Round in which player lost in PGA Championship match play\n\n\"T\" indicates a tie for a place\n\nGreen background for wins. Yellow background for top-10\n\nSummary\n\nTournament Wins 2nd 3rd Top-5 Top-10 Top-25 Events Cuts made Masters Tournament 0 0 2 2 2 4 23 13 U.S. Open 1 0 0 1 3 7 19 13 The Open Championship 0 0 0 0 0 0 1 0 PGA Championship 0 0 0 1 4 4 9 9 Totals 1 0 2 4 9 15 52 35\n\nMost consecutive cuts made – 12 (1934 Masters – 1938 Masters)\n\nLongest streak of top-10s – 3 (1931 U.S. Open – 1932 U.S. Open)\n\nSee also\n\nReferences\n\n↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found.\n\nScript error: The function \"top\" does not exist.\n\nScript error: The function \"bottom\" does not exist."}, {"url": "https://www.metroleague.org/what-happened-with-billy-burke-in-golf_gf23/", "page_content": "Billy Burke, a prominent golfer of the early 20th century, left an indelible mark on the sport of golf through his exceptional skills, remarkable achievements, and enduring legacy.\n\nFrom his early life and passion for golf to his triumphs in major championships and representation in the Ryder Cup, Burke’s journey captivated the golfing community and continues to inspire aspiring golfers today.\n\nThis article delves into the life and career of Billy Burke, highlighting his accomplishments, the impact of his untimely death, and the lasting legacy he left behind in the world of golf.\n\nJoin us as we explore the remarkable story of Billy Burke, a golfer whose skill and dedication etched his name into the annals of golf history.\n\nEarly Life and Passion for Golf\n\nBackground Information on Billy Burke’s Upbringing\n\nBilly Burke was born on November 26, 1902, in New York City. Growing up in a bustling urban environment, Burke was exposed to various sports, but it was golf that captured his heart.\n\nHe hailed from a middle-class family, and his parents encouraged his athletic pursuits. However, golf was not initially part of his life.\n\nDiscovery of His Talent and Love for Golf\n\nBurke’s introduction to golf came by chance when he was just a teenager. He accompanied his father, a baseball fan, to a golf course in the hopes of catching a glimpse of Babe Ruth, the legendary baseball player.\n\nLittle did Burke know that this visit would change the course of his life. While waiting for Ruth, Burke observed the golfers on the course and found himself captivated by the sport’s elegance and precision.\n\nIntrigued, he borrowed a club and attempted a few swings. It quickly became apparent that Burke possessed a natural talent for the game, displaying a smooth swing and a keen eye for the ball’s trajectory.\n\nEarly Achievements and Recognition in the Golfing Community\n\nBurke’s talent and passion for golf rapidly progressed, and he soon started participating in local tournaments. In 1919, at the age of 16, he won the Westchester Junior Championship, marking his first significant victory.\n\nThis triumph not only fueled Burke’s ambition but also caught the attention of the golfing community.\n\nAs Burke continued to hone his skills, his name began to gain recognition in amateur golf circles. In 1923, he reached the finals of the U.S. Amateur Championship, showcasing his potential as a formidable competitor.\n\nAlthough he did not secure the title that year, his impressive performance solidified his reputation as a rising star in the golfing world.\n\nIn the following years, Burke’s accomplishments piled up. He won the Metropolitan Amateur Championship in 1927 and 1929, further establishing himself as one of the region’s top golfers.\n\nBurke’s consistency and dedication to the game were evident in his continued success, garnering attention not only within his local golfing community but also at the national level.\n\nAs Burke’s achievements and reputation grew, he transitioned from amateur golf to the professional circuit. With his smooth swing and strategic approach, he quickly made his mark among the professionals.\n\nBurke’s strong performance on the professional circuit earned him respect and admiration from his peers and further cemented his position as a talented golfer.\n\nBilly Burke’s early life and passion for golf shaped his journey to becoming a prominent figure in the sport. Through a fortuitous encounter, he discovered his natural talent and love for golf, propelling him to pursue the game with unwavering dedication.\n\nBurke’s early achievements and recognition in the golfing community laid the foundation for his future success, paving the way for an illustrious career in golf.\n\nThe Glorious Season of 1931\n\nHighlighting Burke’s Remarkable Achievements in 1931\n\nVictory in the U.S. Open\n\nThe highlight of Billy Burke’s exceptional season in 1931 was his victory in the U.S. Open, one of the most prestigious tournaments in golf. Held at the Inverness Club in Toledo, Ohio, Burke showcased his remarkable skills and mental fortitude throughout the tournament.\n\nFacing tough competition from some of the best golfers of the era, Burke emerged as the champion, etching his name in golf history.\n\nSemi-finalist in the PGA Championship\n\nIn addition to his U.S. Open triumph, Burke made an impressive run in the PGA Championship in 1931. He battled his way to the semi-finals, displaying his consistent performance and ability to navigate the demanding match-play format.\n\nAlthough he fell short of reaching the final, his deep run in the tournament solidified his reputation as a formidable contender.\n\nSuccess in Four Professional Circuit Events\n\nAlongside his performances in major championships, Burke’s success extended to the professional circuit in 1931. He demonstrated his prowess by winning four professional events throughout the season.\n\nThese victories not only showcased his ability to excel in different tournament formats but also highlighted his consistency and adaptability.\n\nBurke’s Performance and Skill During This Season\n\nBurke’s achievements in 1931 underscored his exceptional skills and versatility as a golfer. His victory in the U.S. Open exemplified his ability to rise to the occasion in high-pressure situations, displaying a combination of technical proficiency, mental resilience, and strategic acumen.\n\nFurthermore, Burke’s strong showing in the PGA Championship demonstrated his ability to navigate match-play scenarios, where head-to-head competition and strategic decision-making play a crucial role.\n\nHis performance in this tournament showcased his competitive spirit and ability to thrive in intense matchups against other elite players.\n\nThe success Burke enjoyed in the four professional circuit events further exemplified his consistency and adaptability. Winning multiple tournaments throughout a season requires a high level of skill, focus, and the ability to perform at a consistently high level.\n\nBurke’s achievements in these events emphasized his mastery of various aspects of the game, including driving, iron play, putting, and course management.\n\nOverall, Burke’s remarkable performances in the 1931 season showcased his well-rounded skill set, competitive spirit, and ability to excel in different tournament formats.\n\nHis success in major championships, as well as professional circuit events, solidified his status as one of the premier golfers of his time.\n\nRyder Cup Success\n\nExplanation of the Ryder Cup and Its Significance in Golf\n\nThe Ryder Cup is a prestigious biennial golf tournament contested between teams representing the United States and Europe. First held in 1927, the event has since become one of the most highly anticipated and fiercely contested competitions in the world of golf.\n\nThe Ryder Cup showcases the camaraderie, sportsmanship, and national pride that make it a unique and significant event in the golfing calendar.\n\nBurke’s Selection for the Ryder Cup Teams\n\nUndefeated Matches in the 1931 Ryder Cup\n\nBilly Burke’s exceptional skills and consistent performances earned him a spot on the American Ryder Cup team in 1931. During the competition, Burke proved his mettle by remaining undefeated in his matches.\n\nHis victories contributed significantly to the American team’s overall success in the event, highlighting his ability to perform under pressure and deliver when it mattered most.\n\nSelection for the 1933 Ryder Cup Team\n\nAs a testament to his prowess as a golfer, Burke was once again selected for the American Ryder Cup team in 1933. This recognition demonstrated the confidence that the team management and his fellow players had in his abilities.\n\nWhile specific details about his involvement in the 1933 Ryder Cup are not provided in the given information, his selection underscores his consistent performance and reputation among his peers.\n\nEmphasizing Burke’s Contribution to the American Team’s Success\n\nBurke’s presence on the Ryder Cup teams undoubtedly played a significant role in the American team’s success during those years. His undefeated matches in the 1931 Ryder Cup showcased his ability to deliver crucial points for his team, contributing to their victory.\n\nHis skill, composure, and competitive spirit under the intense pressure of the Ryder Cup format made him a valuable asset to the American team.\n\nMoreover, Burke’s selection for the 1933 Ryder Cup team further solidified his reputation as a dependable and talented golfer. His inclusion in the team indicated that he was recognized for his consistent performance and contributions to the sport.\n\nBurke’s participation in the Ryder Cup not only showcased his individual abilities but also emphasized the importance of teamwork and national pride in the competition.\n\nAs a representative of his country, he embodied the spirit of the Ryder Cup, playing a crucial role in fostering camaraderie and unity among his fellow American golfers.\n\nBilly Burke’s involvement in the Ryder Cup showcased his skill, competitiveness, and ability to perform at the highest level of team golf. His undefeated matches in the 1931 Ryder Cup and subsequent selection for the 1933 team highlight his consistent contributions to the American team’s success.\n\nBurke’s achievements in the Ryder Cup further solidified his legacy as an accomplished and respected golfer on both individual and team platforms.\n\nRecognition and Legacy\n\nPosthumous Induction Into the National Polish-American Sports Hall of Fame\n\nIn 2005, long after his passing, Billy Burke received a well-deserved honor when he was posthumously inducted into the National Polish-American Sports Hall of Fame.\n\nThis recognition acknowledged his outstanding contributions to the sport of golf as well as his Polish-American heritage. It serves as a testament to his impact and lasting legacy in the golfing community.\n\nBurke’s Lasting Impact on the Sport of Golf\n\nBilly Burke’s legacy extends far beyond his individual achievements. His contributions to the sport of golf have left an indelible mark. Burke’s exceptional skills, competitive spirit, and dedication to the game continue to inspire aspiring golfers and shape the way the sport is played and appreciated.\n\nBurke’s success in major championships, including his victory in the U.S. Open, showcases the heights that can be achieved through hard work, perseverance, and a passion for the game.\n\nHis performances in the Ryder Cup demonstrate the importance of teamwork, sportsmanship, and national pride in golfing competitions.\n\nFurthermore, Burke’s consistent presence and success on the professional circuit serve as a reminder of the discipline and dedication required to excel in the sport.\n\nHis ability to adapt to different tournament formats and deliver top-notch performances highlights the versatility and versatility required to compete at the highest level.\n\nRemembering His Cultural Heritage and Representation\n\nAs a Polish-American athlete, Billy Burke’s induction into the National Polish-American Sports Hall of Fame celebrates and honors his cultural heritage.\n\nIt highlights the importance of representation in sports and recognizes the achievements of athletes from diverse backgrounds.\n\nBurke’s recognition as a Polish-American golfer serves as an inspiration for aspiring golfers with similar backgrounds. It demonstrates that talent and determination know no boundaries and that individuals from all walks of life can make significant contributions to the sport they love.\n\nBurke’s legacy also helps promote diversity and inclusion in golf, fostering an environment where athletes from various cultural backgrounds are recognized and celebrated.\n\nHis achievements serve as a reminder of the rich tapestry of talent that exists in the golfing world.\n\nBilly Burke’s posthumous induction into the National Polish-American Sports Hall of Fame, his lasting impact on golf, and his representation of his cultural heritage exemplify the significance of his recognition and legacy.\n\nHis contributions to the sport and his representation as a Polish-American athlete continue to inspire golfers and promote diversity within the golfing community.\n\nUntimely Death and Legacy\n\nDetails of Burke’s Passing in 1972\n\nTragically, Billy Burke’s life was cut short when he passed away on November 3, 1972, in Clearwater, Florida. The exact details surrounding his passing are not provided in the given information.\n\nHowever, his untimely death marked the end of a remarkable career and left a void in the golfing community.\n\nReflection on the Impact of His Death on the Golfing Community\n\nThe golfing community mourned the loss of Billy Burke, recognizing the significant impact he had made during his career. His passing was felt by fellow golfers, fans, and those who admired his talent, sportsmanship, and contributions to the sport.\n\nThe news of his death left a sense of sadness and disbelief among those who had followed his journey.\n\nBurke’s death was a reminder of the fleeting nature of life and how even the brightest stars can be extinguished too soon. The golfing community reflected on the loss of a gifted athlete and the potential for even greater achievements that were left unfulfilled.\n\nExamining Burke’s Enduring Legacy in the Sport\n\nAlthough his life was cut short, Billy Burke’s legacy continues to live on in the sport of golf. His achievements, his impact on the golfing community, and his representation as a Polish-American golfer have left an indelible mark.\n\nBurke’s exceptional performances, including his victory in the U.S. Open and his success in the Ryder Cup, have solidified his place in golf history.\n\nHis skill, talent, and dedication to the game continue to inspire golfers of all generations.\n\nFurthermore, Burke’s recognition as a Polish-American athlete serves as a reminder of the diverse backgrounds that contribute to the fabric of golf. His posthumous induction into the National Polish-American Sports Hall of Fame celebrates his cultural heritage and his accomplishments as a representative of his community.\n\nIn addition, Burke’s untimely death has further amplified his legacy, as it leaves fans and the golfing community to ponder what could have been. It serves as a reminder to cherish and appreciate the moments and achievements of athletes, knowing that their time in the spotlight can be fleeting.\n\nUltimately, Billy Burke’s enduring legacy lies in his contributions to the sport, his representation of his cultural heritage, and the inspiration he continues to provide to aspiring golfers.\n\nHis name will forever be remembered in the annals of golf history, reminding us of the remarkable talent and impact that individuals can have in their chosen fields.\n\nBilly Burke’s Golf Achievements\n\nYear Achievement 1931 Victory in the U.S. Open Semi-finalist in the PGA Championship Success in four professional circuit events 1931 Undefeated matches in the Ryder Cup 1933 Selected for the Ryder Cup team 2005 Posthumous induction into the National Polish-American Sports Hall of Fame\n\nFAQs\n\nWhat was Billy Burke’s background before becoming a professional golfer?\n\nBilly Burke was born in 1902 in Minneapolis, Minnesota, to Polish immigrant parents. He began playing golf at a young age and showed exceptional talent, quickly rising through the ranks and becoming a professional golfer.\n\nWhat made Billy Burke stand out as a golfer?\n\nBilly Burke’s success as a golfer was due to his exceptional skill set, including his technical proficiency, mental fortitude, and strategic acumen. He had a well-rounded game and could excel in various tournament formats, including major championships and match-play events.\n\nWhat was Billy Burke’s greatest achievement in golf?\n\nBilly Burke’s greatest achievement in golf was winning the U.S. Open in 1931. This victory cemented his legacy as one of the top golfers of his time and showcased his ability to perform under pressure and deliver when it mattered most.\n\nWhat was the significance of Billy Burke’s selection for the Ryder Cup teams?\n\nBilly Burke’s selection for the Ryder Cup teams demonstrated his consistent performance and reputation among his peers. His undefeated matches in the 1931 Ryder Cup highlighted his ability to deliver crucial points for his team, contributing to their victory.\n\nFurthermore, his representation as a Polish-American athlete served as an inspiration for aspiring golfers from diverse backgrounds.\n\nWhat was the impact of Billy Burke’s untimely death on the golfing community?\n\nBilly Burke’s untimely death in 1972 left a void in the golfing community and marked the end of a remarkable career. His passing was felt by fellow golfers, fans, and those who admired his talent, sportsmanship, and contributions to the sport.\n\nHowever, his legacy continues to inspire golfers of all generations and reminds us of the fleeting nature of life and the need to cherish and appreciate the moments and achievements of athletes.\n\nConclusion\n\nBilly Burke’s remarkable career in golf left an enduring legacy in the sport. From his early life and passion for golf to his remarkable achievements in 1931, Burke showcased his exceptional skills, competitive spirit, and dedication to the game.\n\nHis victory in the U.S. Open, success in professional circuit events, and undefeated matches in the Ryder Cup exemplified his talent and ability to perform at the highest level.\n\nBurke’s recognition as a Polish-American athlete and his posthumous induction into the National Polish-American Sports Hall of Fame highlights the significance of his cultural heritage and representation in the sport.\n\nHis achievements continue to inspire aspiring golfers from diverse backgrounds, promoting diversity and inclusion in golf.\n\nAlthough his life was tragically cut short in 1972, Billy Burke’s legacy lives on. His impact on the golfing community and the sport itself is evident in his lasting influence, inspiring golfers to strive for greatness, embrace sportsmanship, and cherish the moments they have on and off the course.\n\nBilly Burke’s name will forever be remembered among the greats in golf history, reminding us of the enduring legacy of exceptional athletes who leave an indelible mark on the sport they love.\n\nSimilar Posts:"}, {"url": "https://www.liquisearch.com/billy_burke_golfer", "page_content": "William John Burke, born Burkowski (December 14, 1902 – April 19, 1972) was a prominent American professional golfer of the 1920s and 1930s.\n\nBurke was born in Naugatuck, Connecticut. His greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf. Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8 over par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7 over par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used a unorthodox grip due to the loss of two fingers on his left hand. Burke died in Clearwater, Florida."}], "Billy Burke won the PGA Championship in 1938.": [{"url": "https://www.wikiwand.com/en/Billy_Burke_(golfer)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Billy Burke (golfer)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.golfmonthly.com/features/the-game/golfs-forgotten-major-winners-80671", "page_content": "Today’s top golf professionals are among the most highly paid sportspeople in the world. They enjoy global fame and a worldwide following. Hundreds of millions of people watch each of the game’s four Major men's tournaments and the winners of these most prestigious events become household names. Golf fans would recognise tens, if not hundreds, of current professional players and, even non-golfing sports fans would be able to recall a decent number.\n\nBut this wasn’t always the case and there are many great golfing champions who have been consigned to the dustbin of history.\n\nNow, winning a single Major championship is enough to set a player up for life, whereas in days gone by it might have earned them a few hundred pounds and a pat on the back at their local club.\n\nBelow we take a look at the fascinating stories of some of those Major champions whose achievements have been forgotten, or perhaps disregarded, by all but the most enthusiastic golf statisticians.\n\nRalph Guldahl (1911 – 1987)\n\nRalph Guldahl (Image credit: Getty Images)\n\nBorn the year before Ben Hogan and Sam Snead, Ralph Guldahl’s playing career peaked and troughed twice before either of those golfing legends reached their prime. The Texan turned pro in 1931 and quickly won the Santa Monica Open; he took the Arizona Open title the following season. In the 1933 US Open, the 6 foot 2 inch 21-year-old made up nine shots on Johnny Goodman in just 11 holes at the end of the final round. Guldahl faced a four-foot putt on the last green to force a playoff. He missed and effectively gave up competitive golf for three years, returning to his home in Dallas and becoming a used car salesman. But he took up the game again in 1936 and, between 1937 and 1939 Guldahl was arguably the best player in the world. He was second in the 1937 Masters before winning the US Open at Oakland Hills by two shots. He was second again in the 1938 Masters and successfully defended his US Open title, winning this time by six strokes at Cherry Hills. In 1939 he finally got his victory at Augusta and claimed three further titles that season.\n\nFor that brief spell, Guldahl was at the very pinnacle of the sport. But from 1940 onwards he lost his game and he quit tournament golf. He played his last US Open in 1949.\n\nMany believed his involvement in the writing of an instructional book was the reason for his golfing collapse – it caused him to over-analyse his game. Guldahl put it down to a lack of competitive drive and weariness because of the travelling.\n\nHe became a teaching professional at Braemar Country Club in California in 1959 where he worked until his death in 1987. Among many others, one of his students at Braemar was eccentric billionaire Howard Hughes.\n\nJack Fleck (1921 – 2014)\n\nJack Fleck - 1955 US Open champion\n\nWith Ben Hogan safely in the clubhouse two clear of little-fancied Jack Fleck, almost everyone had given “The Hawk,” the 1955 US Open title. NBC television finished their coverage before Fleck had completed his round, ending with a shot of Gene Sarazen congratulating Hogan on another US Open title.\n\nBut Fleck still had four to play. He birdied the 15th and 18th holes to fire a 67 and tie Hogan at the top. The following day, Fleck beat the great champion in an 18-hole playoff.\n\nFor many years after Fleck’s surprise victory at Olympic Club, his triumph was dismissed as a fluke. He was portrayed as a club pro or journeyman, a one-hit-wonder. It’s true he didn’t exactly become a world-beater, but he won twice more on the PGA Tour, recorded 41 top-10s on the circuit and made the cut in 261 of the 271 tournaments he entered.\n\nThe truth is Fleck was not the man the vast majority of golf fans wanted to win at Olympic Club. His triumph over Hogan could be compared to Stewart Cink’s playoff victory over Tom Watson at Turnberry in 2009: The golfing public longed for a different result.\n\nAt the presentation ceremony in 1955, Hogan announced he was, “through with competitive golf.” Many of those watching began crying. Even Fleck’s own son said to him, “I rooted for you dad but I was sorry Hogan lost.”\n\nSo, it wasn’t until recently, and particularly with the US Open returning to Olympic Club in 2012, that Fleck’s achievement was more fully appreciated.\n\nFleck drove for 49 hours from his home in Iowa to San Francisco in June 1955. He opened his US Open campaign with a 76, nine shots worse than leader Tommy Bolt.\n\nBut he bounced back with a 69 to be in contention with two rounds to play. His closing 67 was one of the great Major rounds and his playoff win over the world’s best player was a phenomenal display of ability and self-belief.\n\nDick Burton (1907 – 1974)\n\nDick Burton (Image credit: Getty Images)\n\nRichard “Dick” Burton held the title of Open Champion longer than any man in the history of the tournament. He lifted the Claret Jug at St Andrews in 1939 and the competition was not held again until 1946, after the conclusion of the Second World War.\n\nWhen sending his application to the R&A in 1946, he included a short letter - “Dear Sirs, Please find enclosed my fee of five guineas for this year’s Open. I will bring the trophy back when I come.”\n\nBurton was no flash in the pan. Club professional at Ellesmere Port (then called Hooton) Golf Club and latterly Sale Golf Club, he won his first title at the 1934 Northern Professional Championship. He won seven professional tournaments and played three times in the Ryder Cup.\n\nBut his Open victory in the home of golf was his finest moment. Needing to shoot 72 in the final round to win, Burton birdied the 18th to beat Johnny Bulla by two strokes. Just a few weeks later war broke out and Burton enlisted in the RAF.\n\nIn later life, Burton was asked if he felt regret at not being able to take advantage of his Open triumph.\n\n“I was lucky enough,” he replied. “A lot of those who watched me at St Andrews also went off to war and they never came back. Some of my friends didn’t make it either, I did.”\n\nLionel Hebert (1928 – 2000)\n\nLionel Hebert (Image credit: Getty Images)\n\nAs a young adult, Lionel Hebert had to make a decision whether to be a golfer or a musician. He was an excellent trumpet player and had gone to Louisiana State University to study music.\n\nBut, following in his brother Jay’s footsteps, Lionel decided to embark on a career as a pro golfer.\n\nThe Heberts (pronounced A-bear) were Cajuns – an ethnic group found mainly in Louisiana, descended from French speaking Acadians (now a part of Canada.)\n\nLionel and Jay are the only brothers to have won the USPGA Championship. Lionel was the last match-play winner in 1957, while Jay took the title in stroke-play format in 1960.\n\nLionel played an incredible 580 events on the PGA Tour and senior tour. He was twice chairman of the PGA tournament committee and a founding member of the senior tour. But he never travelled to play in the Open championship as he maintained the trip was, “too pricey.”\n\nHerman Keiser (1914 – 2003)\n\nHerman Keiser (Image credit: Getty Images)\n\nThe 1946 Masters marked the re-start of significant professional golf following the Second World War. The stars of the day had gathered and the Augusta patrons anticipated a great battle between Hogan, Snead and Nelson.\n\nBut, after three rounds it was a relatively unknown pro from Missouri – Herman Keiser – who held a five-shot lead.\n\nNicknamed “the Missouri Mortician” for the somber expression he wore on the golf course, Keiser had served 31 months at sea during the war, aboard the U.S.S Cincinnati.\n\nHogan caught Keiser with one hole to play at Augusta but ”The Hawk” three-putted the final green and Keiser was the champion.\n\nKeiser played in the Ryder Cup of 1947 when the US won by 11-1. That one point for Britain came courtesy of Keiser’s singles defeat by Sam King. “The Mortician” quit competitive golf in the mid 1950s and bought a driving range in Ohio.\n\nAndy North (born 1950)\n\nAndy North - Twice US Open champion\n\nBest known to golf fans as a television commentator, Andy North won three events on the PGA Tour. There’s nothing particularly unusual about that, except two of those titles were the US Open.\n\nNorth had won the 1977 Westchester Classic, but coming into the 1978 US Open at Cherry Hills he could have been fairly described as a good journeyman. He wasn’t considered a contender, but he outlasted Nicklaus, Watson, Miller and Player to win by a stroke.\n\nHe disappeared off the golfing radar again through the early 80s, recording just nine top-10 finishes on the PGA Tour between 1979 and 1984. But he reappeared in 1985 to win the US Open again, this time at Oakland Hills. After 1985, North recorded just three more top-10 finishes on the PGA Tour.\n\nBilly Burke (1902 – 1972)\n\nBilly Burke - 1931 US Open champion\n\nBilly Burke’s victory in the 1931 US Open was notable for two reasons: He was the first Major champion to use steel-shafted clubs and his triumph came after the longest playoff in Major history.\n\nAfter four rounds at the Inverness Golf Club in Toledo, Burke was tied at the top of the leaderboard with George Von Elm. They returned for a 36-hole playoff the following day and were still tied after that. Another 36-hole playoff ensued and, this time Burke won by one – 144 holes and 589 strokes, compared to Von Elm’s 590.\n\nHaving lost a finger working in a foundry as a teenager, Burke used an unorthodox grip with considerable success. He recorded 80 top-10 finishes during his PGA Tour career. The son of Polish immigrants, Burke (born Burkowski) played in the Ryder Cups of 1931 and 33 and was undefeated.\n\nOther Forgotten Major Winners\n\nThe forgotten Major winners talked about above were just some of those considered in the research for this piece. There are numerous others, and too many to cover in detail.\n\nFor example, Walter Burkemo, the 1953 USPGA champion. He had only one other PGA Tour win during his career and quit the tour in 1954 to go back to life as a club pro.\n\nDick Mayer won the 1957 US Open, and was PGA Tour player of the year. But he battled with alcoholism and it’s generally viewed this prevented him winning more. He died aged 64.\n\nDick Mayer - 1957 US Open champion\n\nAccording to Sam Snead and Ben Hogan, 1950 USPGA champion Chandler Harper was the best putter in the world. He was a great friend of Bobby Jones and, in later life, became a mentor to Curtis Strange.\n\nHow about back-to-back English winners of the Open Championship in 1935 and 1936 – Alf Perry and Alf Padgham? Perry’s best Open finish was a tie for 17th prior to winning at Muirfield in 1935 while Padgham, having left his clubs in the Hoylake pro-shop overnight, had to break a window to retrieve them in time for his third round in 1936.\n\nAlf Perry - 1935 Open Champion\n\nAll these men earned some sort of fame from golf, no matter how briefly. But none were rewarded financially to anywhere near the extent of today’s Major winners whose lives are changed for good by the endorsements and invitations that flow in. So when the green jacket is presented next April, spare a thought for Ralph Guldahl. When the Claret Jug is lofted at Royal Troon, consider Dick Burton and the two Alfs.\n\nThese great old warriors make up an important part of golf’s rich tapestry, it’s just the patch they occupy has become a touch faded."}, {"url": "https://www.golfcompendium.com/2020/01/billy-burke-golfer.html", "page_content": "Billy Burke was a PGA Tour winner from the 1920s into the 1940s. He's most famous because he played in, and won, the longest playoff in major championship history: 72 playoff holes.\n\nFull name: William John Burke (birth name Burkowski)\n\nDate of birth: December 14, 1902\n\nPlace of birth: Naugatuck, Connecticut\n\nDate and place of death: April 19, 1972 in Clearwater, Florida\n\nBurke's PGA Tour Wins\n\n1927 Florida Open\n\n1927 Central Florida Open\n\n1928 North and South Open\n\n1929 New York State Open\n\n1929 Glens Falls Open\n\n1930 Mid South Open\n\n1931 U.S. Open\n\n1931 Glens Falls Open\n\n1932 Florida West Coast Open\n\n1935 The Cascades Open\n\n1936 Centennial Open\n\n1939 Walter Hagen 25th Anniversary*\n\n1940 Miami Biltmore International Four-Ball*\n\nBurke is credited with wins in 13 tournaments that are now counted by the PGA Tour as official tour wins:*These two were two-man team tournaments. At the 1939 Hagen, Burke partnered with Ed Dudley . At the 1940 Miami International, his partner was Craig Wood\n\nIn the Majors\n\nHis victory in the 1931 U.S. Open (more on that to come) was Burke's lone win in a major championship. And he never played in the British Open. His best other finishes were third places in the 1934 Masters and in the 1939 Masters ; plus he reached the semifinals in the 1931 PGA Championship\n\nOverall, Burke had six Top 10s in majors. The first major he played in was the 1928 U.S. Open, and he last played in a major in the 1961 Masters.\n\nHis Epic 1931 U.S. Win\n\nNot only did Burke win the 1931 U.S. Open , he won it playing with steel-shafted golf clubs. He was the first golfer to win the U.S. Open with steel shafts.\n\nOh, and then there was that 72-hole playoff. This Open was played at Inverness in Ohio, scheduled to end on July 4. The weather was brutal with temperatures in the 90s, some days approaching 100 — the 1931 U.S. Open is sometimes remembered as \"the Inferno at Inverness.\"\n\nBurke opened with a 73, two off the lead. In the second round, he shot 72 and moved to within one of leader George Von Elm. Von Elm was the tour's leading money winner heading into this tournament.\n\nOn the third day they played 36 holes, the third and fourth rounds. Von Elm's lead over second-place Burke was two following the third round. But Burke took the lead in Round 4, until Von Elm made a 10-foot putt to tie him on the 72nd hole.\n\nFor the first time, the USGA used a 36-hole playoff to decide its Open champion. The only problem was that Burke and Von Elm ended the 36-hole playoff day tied again, and again after Von Elm made a 10-footer on the final hole to tie. They both carded 149s.\n\nSo the next day, they came back and did it all again, their third consecutive day playing 36 holes. And this 36 holes was just like the previous two: tight throughtout. In fact, Burke and Von Elm traded the lead 25 times over the final 36.\n\nIn the end, after 72 holes of regular play and 72 more playoff holes, Burke won by a single stroke. He won the second playoff 148 to 149.\n\nThe USGA reacted to this epic battle — one literally hotly contested in July — two ways: It moved the U.S. Open from July back to June to try to reduce the heat; and it eliminated 36-hole playoffs, going back to 18-hole playoffs.\n\nMore About Billy Burke\n\nBurke was the son of Polish immigrants to American from Lithuania (the family name was Burkauskas, which was polonized to Burkowski, then anglicized to Burke). Billy began playing golf at age 12 after first starting caddying.\n\nAs a teenager, Burke went to work in the same iron foundry in which his father worked. But an accident there took off Burke's ring finger on his left hand, plus part of his left pinkie. After that, he had to rebuild his golf grip to work for him despite those missing fingers.\n\nIt didn't much slow Burke's progress as a golfer. After a hard day in the foundry, Burke headed to the driving range to practice. In Connecticut golf circles, they started calling him \"the Boy Marvel\" for his golf prowess.\n\nWhen he was 18, Burke first entered the Connecticut State Amateur. The only problem was he didn't own the clothes (such as plus-fours) to meet the dress standard for that big event. His dilemma received local media attention, and two local golfers Burke caddied for stepped up to outfit him with new golf clothes and pay his fare to the tournament.\n\nIn 1923, when he was 20, Burke made it to the championship match of the Connecticut State Amateur before losing to Henry Topping. But it turned out to be a great loss for Burke: Topping was a millionaire businessman who became an ongoing benefactor for Burke's golf career, including staking him when he shortly turned pro to try the PGA Tour.\n\nBurke began winning pro tour events in the late 1920s (the 1927 Florida Open is credited as his first tour win). His final tour win was in 1940.\n\nBurke also won other tournaments that are not counted as PGA Tour events, including the Ohio Open four times: 1938, 1939, 1945 and lastly in 1955 at the age of 52.\n\nThe year of 1931 was one of three in which he won twice on tour (1927 and 1929 being the other two), but it was without question his best year. It included his only major championship win at the U.S. Open, plus he reached the semifinals in the PGA Championship. Burke made the first of two appearances on Team USA in the Ryder Cup that year, winning both matches he played. (He also played in the 1933 Ryder Cup.)\n\nAnd Burke got married that year to Marguerite, who survived him when he died at age 69 in 1972.\n\nLater in 1931, Burke and George Von Elm, off the hoopla surrounding their 72-hole playoff, went on an exhibition tour together.\n\nAlong the way, Burke also worked as a club pro and was noted as a golf instructor. He was pro for 29 years, beginning in 1934, at Cleveland (Ohio) Country Club. From 1946-62, he was the winter-season pro at Clearwater (Fla.) Country Club. Burke also taught at the 9-hole course in his hometown of Naugatuck, Conn., as well as in Dark Harbor, Maine. In addition, Burke had endorsement deals with sports equipment companies and Billy Burke-branded golf clubs and golf balls were both produced during his heyday.\n\nBurke was inducted into the PGA Hall of Fame in 1966."}, {"url": "https://www.golfcompendium.com/2018/12/1938-pga-championship.html", "page_content": "The 1938 PGA Championship was the 21st time this major was played.\n\nWinner: Paul Runyan\n\nWhere it was played: Shawnee Country Club in Smithfield Township, Pennsylvania\n\nTournament dates: July 10-16, 1938\n\nNotable notes: Paul Runyan defeated Sam Snead in the championship match by an 8-and-7 score. It was the largest winning margin in the tournament's match play era. ... Snead eventually won this major three times, but in this final match he won only one of 29 holes played vs. Runyan. ... Runyan also won the 1934 PGA, and this was his 27th career PGA Tour win. ... Runyan reached the final with wins over Levi Lynch, Tony Manero, Ray Mangrum, Horton Smith and Henry Picard. ... Defending champ Denny Shute, trying to win his third PGA Championship in a row, lost in the Round of 16.\n\nLate-Round Match Scores\n\nRound of 16 (36 holes)\n\nJimmy Hines def. Denny Shute, 2 and 1\n\nByron Nelson def. Harry Bassler, 11 and 10\n\nJim Foulis def. Marvin Stahl, 6 and 5\n\nSam Snead def. Felix Serafin, 4 and 3\n\nHorton Smith def. Billy Burke, 3 and 2\n\nPaul Runyan def. Ray Mangrum, 1-up (37 holes)\n\nGene Sarazen def. Jimmy Demaret, 1-up (38 holes)\n\nHenry Picard def. Dick Metz, 4 and 3\n\nQuarterfinals (36 holes)\n\nPaul Runyan def. Horton Smith, 4 and 3\n\nHenry Picard def. Gene Sarazen, 3 and 2\n\nSam Snead def. Jim Foulis, 8 and 7\n\nJimmy Hines def. Byron Nelson, 2 and 1\n\nSemifinals (36 holes)\n\nPaul Runyan def. Henry Picard, 4 and 3\n\nSam Snead def. Jimmy Hines, 1-up\n\nChampionship Match (36 holes)\n\nPaul Runyan def. Sam Snead, 8 and 7"}, {"url": "https://thealbatross.substack.com/p/billy-burkes-singular-achievement", "page_content": "Despite the big differences between the generations in most areas of golf, achievements of one era often can be repeated at a subsequent time if talent and circumstances align. Someone could do what Bobby Jones did in 1930 (calendar year Grand Slam) or what Tiger Woods did in 2000-01 (four consecutive major wins). But the 1931 U.S. Open is a stubborn exception.\n\nNobody will ever win the national championship in the manner of Billy Burke 90 years ago this week.\n\nTournaments aren’t even decided by 18-hole playoffs anymore—it’s either sudden death or an aggregate format of a couple of holes—so the fact that Burke had to go through two 36-hole playoffs following 72 holes of medal play to defeat George Von Elm at Inverness Club in Toledo makes his achievement the ultimate outlier.\n\n“Apparently they are going on forever,” Grantland Rice wrote in his syndicated column after the first playoff. “After the most sensational 36-hole playoff in the history of golf, they are still tied up in a two-ply Gordian Knot at 149 strokes each. There were enough fireworks in this contest to make the fall of Pompeii look like a single Roman candle.”\n\nHyperbolic to be sure, but Rice had a point. There were 25 lead changes over the 72 playoff holes. After making a birdie putt on the 72nd hole of regulation, Von Elm did it again on the 36th playoff hole to force another long day.\n\nBurke’s count that early July week in Ohio: 144 holes, 589 strokes, 32 cigars, a one-stroke margin over Von Elm. The winner did it in scorching heat—there a number of heat-related deaths in the area—and on the heels of 72 holes of Ryder Cup qualifying and 72 holes of match-play competition in late June as . When Burke set out for Niagara Falls and a delayed honeymoon with his wife, Marguerite, after being the last man standing at Inverness, he had played 288 holes in 16 days.\n\nIt’s well known that Burke was the first golfer to win a major title with steel shafts in his clubs (Von Elm was still using hickory), but he also did it with a lighter, 1.55 ounce ball that the USGA had mandated for that season to put more challenge into the game. Like the 36-hole playoff format, the lighter ball was gone after 1931.\n\nBurke was born in 1902, the same year as Jones and Gene Sarazen. William John Burkowski grew up in Naugatuck, Conn., and like Eugenio Saraceni came from a working-class family. “He impresses me as a player who has learned his game through a lot of hard work,\" Jones wrote in the The American Golfer, \"as contrasted to one who has come by it easily and naturally.\" John Kiernan of The New York Times observed that Burke was “a square-shouldered stalwart who might pass as pugilist or a heavy-hitting second baseman.”\n\nBurke succeeded at golf despite a disability from an accident in an iron foundry. (The New York Daily News)\n\nBurke did wear a small glove on his left hand, an accommodation for a disability after an accident at an iron foundry as a teenager cost him parts of two fingers. Having gotten exposed to golf as a young caddie at Naugatuck Golf Club (now Hop Brook Golf Course), Burke also toiled at other jobs including an office janitor and at factories making boots and safety pins before becoming a golf pro. For Burke, playing a sport for a living—even a marathon championship in the heat—really was a “golden grind,” to use Al Barkow’s wonderful term from his important 1974 history of the tour.\n\nFollowing his U.S. Open victory, Golf Illustrated predicted Burke was “a new star who is destined long to shine.” Credited with 11 PGA Tour victories, Burke didn’t win another major title but had two third-place finishes in the Masters (1934 and 1939) and put up an admirable defense of his U.S. Open victory in 1932, tying for seventh.\n\nThe man who prevailed in a 72-hole playoff died in 1972, at age 69."}, {"url": "http://www.golfmajorchampionships.com/players?player=155", "page_content": "1902-Dec-14 to 1972-Apr-19\n\nWD, DQ, and missed cuts are not displayed\n\nonly wins are displayed for the PGA Championship before 1958\n\nonly wins are displayed for the Open Championship before 1946"}, {"url": "https://www.nhregister.com/news/article/NEW-HAVEN-200-Naugatuck-s-Billy-Burke-wins-1931-11511422.php", "page_content": "In a span of 10 years, Billy Burke rose from a full-time job as a mold caster at a Naugatuck iron foundry to the 1931 U.S. Open champion. It remains as remarkable a tale today as it was 81 years ago.\n\nBurke -- born Burkowski -- was the son of a Polish immigrant blue-collar worker. He fell in love with golf when, as a frail 12-year-old, he caddied for the first time at Naugatuck Golf Club.\n\nHis teenage years were spent lugging bags for club members. When the rounds were finished, Burke would ask to borrow members' clubs so he could practice. At 16, playing in a driving rain, he won the club championship.\n\nUpon graduating Naugatuck High, he worked at a rubber factory and later the iron foundry, practicing his golf game when the 5 p.m. whistle blew. A foundry accident cost him two fingers on his left hand, leaving Burke with an awkward swing. Still, his golf game thrived. By 1923, he was the Connecticut amateur champion.\n\nIt all led to his historic victory at the '31 Open, held at the Inverness Club in Toledo, Ohio. If a scorching heat wave wasn't enough -- temperatures exceeded 100 degrees that week -- Burke had to endure a marathon playoff with George Von Elm.\n\nThe two were tied after four rounds. Playoff rules at the time required another 36 holes. Still deadlocked, officials called for an additional 36 holes. Burke burned through 32 cigars over the grueling 144 holes, but wound up winning by a single stroke to earn the grand prize -- a whopping $1,000.\n\nRules were quickly changed to avoid a similar playoff marathon. Burke, hailed as the next Bobby Jones, returned to Naugatuck a conquering hero. He was a semifinalist at the PGA Championship later that year. But he never won another major, placing third at the Masters twice (1934 and '39) and had two more top 10 finishes at the U.S. Open. He retired with 17 tour victories and played on a pair of Ryder Cup teams.\n\nBurke died in Clearwater, Fla., at age 69 in 1972."}, {"url": "https://wiki.alquds.edu/?query=Billy_Burke_(golfer)", "page_content": "American professional golfer (1902–1972)\n\nWilliam John Burke, Burkauskas (polonized Burkowski) (December 14, 1902 – April 19, 1972) was an American professional golfer during the early 20th century.\n\nEarly life [ edit ]\n\nBurke was born in Naugatuck, Connecticut. He was of Lithuanian descent.\n\nProfessional career [ edit ]\n\nHis greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf.[1] Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used an unorthodox grip due to the loss of two fingers on his left hand.[2] In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame.[3] Burke died in Clearwater, Florida, in 1972.\n\nHonors and awards [ edit ]\n\nIn 1963, Burke was inducted into the Connecticut Golf Hall of Fame\n\nProfessional wins (17) [ edit ]\n\nPGA Tour wins (13) [ edit ]\n\nMajor championship is shown in bold.\n\nOther wins (4) [ edit ]\n\nthis list may be incomplete\n\nMajor championships [ edit ]\n\nWins (1) [ edit ]\n\nYear Championship 54 holes Winning score Margin Runner-up 1931 U.S. Open 2 shot deficit +8 (73-72-74-73=292) Playoff 1 George Von Elm\n\n1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7).\n\nResults timeline [ edit ]\n\nTournament 1928 1929 U.S. Open T18 15 PGA Championship R32\n\nTournament 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 Masters Tournament NYF NYF NYF NYF T3 T37 28 T29 T13 T3 U.S. Open T28 1 T7 T33 T6 T32 T18 T16 WD T42 PGA Championship R32 SF R64 R16 R32 R16 R16\n\nTournament 1940 1941 1942 1943 1944 1945 1946 1947 1948 1949 Masters Tournament WD T23 NT NT NT 46 57 T43 T35 U.S. Open WD NT NT NT NT T45 T27 CUT PGA Championship R32 NT\n\nTournament 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 Masters Tournament T29 WD WD T36 WD WD CUT CUT U.S. Open CUT CUT CUT PGA Championship\n\nNote: Burke never played in The Open Championship.\n\n\n\nwIN\n\nTop 10\n\nDid not play\n\nNYF = tournament not yet founded\n\nNT = no tournament\n\nWD = withdrew\n\nCUT = missed the half-way cut\n\nR64, R32, R16, QF, SF = round in which player lost in PGA Championship match play\n\n\"T\" indicates a tie for a place\n\nSummary [ edit ]\n\nTournament Wins 2nd 3rd Top-5 Top-10 Top-25 Events Cuts made Masters Tournament 0 0 2 2 2 4 23 13 U.S. Open 1 0 0 1 3 7 19 13 The Open Championship 0 0 0 0 0 0 0 0 PGA Championship 0 0 1 1 4 8 9 9 Totals 1 0 3 4 9 19 51 35\n\nMost consecutive cuts made – 12 (1934 Masters – 1938 Masters)\n\nLongest streak of top-10s – 3 (1931 U.S. Open – 1932 U.S. Open)\n\nSee also [ edit ]"}, {"url": "https://www.golfcompendium.com/2018/10/1958-pga-championship.html", "page_content": "The 1958 PGA Championship was the 40th time the tournament was played. But for the first of those 40 times, stroke play, not match play, was the format.\n\nWinner: Dow Finsterwald, 276\n\nWhere it was played: Llanerch Country Club in Havertown, Pennsylvania\n\nTournament dates: July 17-20, 1958\n\nLeader after first round: Dow Finsterwald, 67\n\nLeader after second round: Dow Finsterwald and Jay Hebert, 139\n\nLeader after third round: Sam Snead, 207\n\nWhat Happened at the 1958 PGA Championship\n\nDow Finsterwald had the lowest score in the first round, and also the lowest score in the last round. On the strength of that opening and closing, Finsterwald became the first PGA Championship winner in the tournament's new stroke-play era. A year earlier, the 1957 PGA Championship , like every previous one going back to the first in 1916, used a match-play format. Finsterwald was runner-up in 1957, losing in the final to Lionel Hebert.\n\nWhen Finsterwald left the 1957 PGA, neither he nor any of the other golfers knew it was the last match-play PGA. But at the PGA of America's national meetings in November, the organization announced it was switching to stroke play, the same format used by each of the other professional majors. Finsterwald wound up being the runner-up in the last match-play PGA and the winner in the first stroke-play PGA.\n\nFinsterwald's opening 67 gave him a one-stroke lead. He was still tied for first after a 72 in the second round, but a 70 in the third round dropped him to third. Sam Snead was the leader, one stroke ahead of Billy Casper and two ahead of Finsterwald.\n\nThen Finsterwald threw another 67 on the board in the final round that included a 31 on the front nine. It was enough to give him the two-stroke win over Casper, who was making his PGA Championship debut. Snead, going for a fourth PGA Championship win, scored 73 and finished third. For Finsterwald, this was the fourth of his 11 career wins on the PGA Tour. It remained his only win in a major.\n\nThis wasn't just the first stroke-play PGA Championship, but also the first one televised. The CBS network aired the final three holes of tournament play, plus the trophy presentation.\n\nAnd it wasn't just Casper's first PGA Championship, but also Arnold Palmer's. Palmer finished tied for 40th place. Casper went on to win 51 PGA Tour titles, and Palmer won 62. But neither one ever won the PGA Championship.\n\n1958 PGA Championship Final Scores\n\nDow Finsterwald 67-72-70-67—276 Billy Casper 73-67-68-70—278 Sam Snead 73-67-67-73—280 Jack Burke Jr. 70-72-69-70—281 Tommy Bolt 72-70-73-70—285 Julius Boros 72-68-73-72—285 Jay Hebert 68-71-73-73—285 Buster Cupit 71-74-69-73—287 Ed Oliver 74-73-71-69—287 Mike Souchak 75-69-69-74—287 Doug Ford 72-70-70-76—288 Bob Rosburg 71-73-76-68—288 Art Wall 71-78-67-72—288 Fred Hawkins 72-75-70-73—290 Dick Mayer 69-76-69-76—290 John Barnum 75-69-74-73—291 Walter Burkemo 76-73-66-76—291 Lionel Hebert 69-73-74-75—291 Bo Wininger 76-73-69-73—291 Ted Kroll 69-74-75-74—292 Cary Middlecoff 71-73-76-72—292 Eric Monti 73-71-73-75—292 Bob Toski 79-70-71-72—292 Ken Venturi 72-73-74-73—292 Pete Cooper 74-77-73-69—293 George Fazio 72-74-73-74—293 Bob Gajda 75-70-75-73—293 Billy Maxwell 75-69-74-75—293 Dick Shoemaker 79-72-73-70—294 Don Whitt 71-72-73-78—294 Mike Fetchick 74-76-71-74—295 Frank Stranahan 76-76-74-69—295 Errie Ball 79-72-72-73—296 Tom Talkington 75-73-73-75—296 Herman Barron 75-71-75-76—297 Dick Cline 75-72-77-73—297 Bill Collins 71-70-77-79—297 Mike Dietz 77-70-74-76—297 Felice Torza 69-72-75-81—297 Henry Castillo 75-76-75-72—298 Bill Ezinicki 76-70-80-72—298 Arnold Palmer 76-71-77-74—298 Skee Riegel 76-77-74-71—298 Eddie Burke 75-75-77-72—299 Bob Crowley 70-76-73-80—299 Bill Johnston 75-72-77-75—299 Dave Marr 72-79-74-74—299 Ed Furgol 78-76-72-74—300 Jackson Bradley 77-77-73-74—301 Jack Isaacs 74-75-78-74—301 Chuck Klein 78-75-74-74—301 Henry Williams 75-74-77-75—301 Mike Krak 74-78-74-76—302 Toby Lyons 75-73-74-80—302 Thorne Wood 77-75-70-80—302 Brien Charter 72-75-80-76—303 Vic Ghezzi 75-74-76-78—303 Claude Harmon 77-75-76-75—303 Al Brosch 75-79-74-78—306 James Gantz 76-76-75-79—306 Gus Salerno 79-75-74-78—306 Larry Bartosek 75-79-74-79—307 Ewing Pomeroy 80-74-74-82—310 George Griffin 74-76-78-83—311\n\nPrevious and next:\n\n1957 PGA Championship - 1959 PGA Championship"}, {"url": "https://wiki2.org/en/Billy_Burke_(golfer)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican professional golfer (1902–1972)\n\nWilliam John Burke, Burkauskas (polonized Burkowski) (December 14, 1902 – April 19, 1972) was an American professional golfer during the early 20th century.\n\nYouTube Encyclopedic\n\n1 / 2 Views: 5 259 4 256\n\nPastor Billy Burke Healing School Session 1\n\nPastor Billy Burke Healing School Session 2 Transcription\n\nEarly life\n\nBurke was born in Naugatuck, Connecticut. He was of Lithuanian descent.\n\nProfessional career\n\nHis greatest season was 1931, when he won the U.S. Open, reached the semi-finals of the PGA Championship, and won four events on the professional circuit, plus appeared on the Ryder Cup team where he was undefeated in two matches. He was also selected for the 1933 Ryder Cup team but not before some agitation by Gene Sarazen was done on his behalf.[1] Burke won his only match in the 1933 competition.\n\nBurke's 1931 U.S. Open win came in a marathon playoff. He and George Von Elm were tied at 292 (8-over-par) after regulation play. They played a 36-hole playoff the next day and tied again at 149 (7-over-par). The following day they played 36 more holes and Burke emerged victorious 148 to 149.\n\nThroughout Burke's golf career he used an unorthodox grip due to the loss of two fingers on his left hand.[2] In 2005, Burke was inducted into the National Polish-American Sports Hall of Fame.[3] Burke died in Clearwater, Florida, in 1972.\n\nHonors and awards\n\nIn 1963, Burke was inducted into the Connecticut Golf Hall of Fame\n\nProfessional wins (17)\n\nPGA Tour wins (13)\n\nMajor championship is shown in bold.\n\nOther wins (4)\n\nthis list may be incomplete\n\nMajor championships\n\nWins (1)\n\nYear Championship 54 holes Winning score Margin Runner-up 1931 U.S. Open 2 shot deficit +8 (73-72-74-73=292) Playoff 1 George Von Elm\n\n1 Defeated George Von Elm in a playoff. First 36-hole playoff - Burke 73-76=149 (+7), Von Elm 75-74=149 (+7). Second 36-hole playoff - Burke 71-77=148 (+6), Von Elm 76-73=149 (+7).\n\nResults timeline\n\nTournament 1928 1929 U.S. Open T18 15 PGA Championship R32\n\nTournament 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 Masters Tournament NYF NYF NYF NYF T3 T37 28 T29 T13 T3 U.S. Open T28 1 T7 T33 T6 T32 T18 T16 WD T42 PGA Championship R32 SF R64 R16 R32 R16 R16\n\nTournament 1940 1941 1942 1943 1944 1945 1946 1947 1948 1949 Masters Tournament WD T23 NT NT NT 46 57 T43 T35 U.S. Open WD NT NT NT NT T45 T27 CUT PGA Championship R32 NT\n\nTournament 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 Masters Tournament T29 WD WD T36 WD WD CUT CUT U.S. Open CUT CUT CUT PGA Championship\n\nNote: Burke never played in The Open Championship.\n\n\n\nwIN\n\nTop 10\n\nDid not play\n\nNYF = tournament not yet founded\n\nNT = no tournament\n\nWD = withdrew\n\nCUT = missed the half-way cut\n\nR64, R32, R16, QF, SF = round in which player lost in PGA Championship match play\n\n\"T\" indicates a tie for a place\n\nSummary\n\nTournament Wins 2nd 3rd Top-5 Top-10 Top-25 Events Cuts made Masters Tournament 0 0 2 2 2 4 23 13 U.S. Open 1 0 0 1 3 7 19 13 The Open Championship 0 0 0 0 0 0 0 0 PGA Championship 0 0 1 1 4 8 9 9 Totals 1 0 3 4 9 19 51 35\n\nMost consecutive cuts made – 12 (1934 Masters – 1938 Masters)\n\nLongest streak of top-10s – 3 (1931 U.S. Open – 1932 U.S. Open)\n\nSee also\n\nReferences"}]}