{"Ted Childs worked at Microsoft, Oracle, Sun Microsystems, Apple, and currently at Google.": [{"url": "https://thenewstack.io/sun-microsystems-a-look-back-at-a-tech-company-ahead-of-its-time/", "page_content": "Sun Microsystems is a Silicon Valley legend. Ten years after it was acquired by Oracle, the company’s past employees still have fond feelings for their former home — and a historic reunion happened two weeks ago at the Hyatt Regency by the San Francisco airport. Over 1,000 former Sun employees reunited for an evening to re-connect and to reminisce.\n\n“It was really fun,” former Sun CEO and co-founder Scott McNealy told us with a laugh. “I don’t know, there’s something crazy about the team we put together and the culture. Everybody had a fun attitude, and when people got together…”\n\nThe days that followed found Sun employees sharing nostalgic memories online and expressing their feelings of geek camaraderie, both past and present. But the reunion also offered a chance for Scott McNealy, along with everybody else, to reflect on what it all had meant. And how do you measure the legacy that a technology company — and its workers — are leaving behind?\n\n‘A Bigger Impact Than We Realized’\n\nSo how was the reunion? “It was actually kind of weird,” McNealy told us. “I felt like it was some sort of rock concert where everybody was a celebrity to everybody else. People were just laughing, having a great time catching up, reminiscing, remembering. It’s sort of like you’d expect a reunion to be, only better.”\n\nThe event’s official website notes that over 150 senior executives attended, and “The attendee list included people from all years of Sun’s existence, from employee #1 to some of the last pre-Oracle hires.”\n\nMcNealy jokes that when he got married there were only 400 people at the wedding, and even then he’d worried about meeting everybody. But after taking lots of selfies, “Fortunately they gave me the microphone and I got a chance to talk a bit about what we did and what it meant to me and the industry…”\n\nBut before the formal event, there was also a kind of “summit” where the four original co-founders met with the press, according to InfoWorld. Bill Joy, Andreas Bechtolsheim, and Vinod Khosla sat with Scott McNealy for what he describes as one of the memorable moments of the night — “to hear everybody’s perspectives… Sometimes you need to get a little distance to really understand what’s going on.”\n\n“Looking back now you can see who really did have an impact and change things,” McNealy told us. He cites the example of Adam Osborne. While Osborne’s company sold the first commercially successful portable computers back in 1981, it went bankrupt within 29 months. “Adam Osborne was very famous back then, but he didn’t impact the industry. There are many others that are just footnotes in the industry.\n\n“I don’t think anybody thinks SPARC, Solaris, Java, the network as virtual computer, virtualization, all of the kind of things we did at Sun — are footnotes. They’re bedrocks. So I think it was fun to actually get together and look back and say ‘Yeah, we probably had a bigger impact than we realized at the time.'”\n\nHanging out with the founders of Sun Microsystems, an amazing company that gave a lot to tech. pic.twitter.com/0g1umEdYYb — Joseph Menn (@josephmenn) September 29, 2019\n\nMcNealy remains proud of everything Sun accomplished, and later in the evening shared some of his feelings with his former employees. “I remember standing up and saying, ‘You know, they’re all doing this diversity and inclusion thing. We did it 30 years ago without even thinking about it. That wasn’t the goal, we just were inclusive and diverse…\n\n“And then I said, the other thing is we did all of this crazy innovation. We were light years ahead of our time. Sun was always way too early, whether it was doing cloud computing or open source or whatever. We were way ahead of our time, too far ahead of our time, because of the brilliant people we had that could look over the horizon…”\n\nInfoWorld reported that before the formal event, Bill Joy said mobile data networks had now transformed society, which got him remembering specific times when Sun had made early attempts at technologies that others later perfected. The site credited Sun with “a range of open source software technologies still popular today,” including the Java programming language and the Jenkins CI/CD platform. Sun had tried both natural language processing and, with Java ME, even programmable smartphones. “But the hardware was just really nascent at the time,” Joy said.\n\nAnd McNealy remembered how Sun had shared the Network File System (NFS) protocol for storing and retrieving files over a network, back in 1984. InfoWorld quotes him as saying “We didn’t invent open source but we [made it] happen. We were the leader of that parade.”\n\n“Asked if Sun should have moved from Sparc RISC processors and Solaris Unix to Intel processors and Linux, McNealy said he did not want to talk about mistakes he had made as Sun CEO but such a switch was not what Sun should have done.”\n\nPay It Forward\n\nThe event also featured a thoughtful attempt to pass on some of that expertise, according to the reunion’s official site. “We used this rare opportunity to pay it forward by sharing the expertise of some of our most knowledgeable alumni with the next generation of entrepreneurs.” The Sun Reunion committee invited 100 MBA candidates from five local universities to hear a series of 20-minute “SunTalks” covering the future of education, work, technology, money, innovation, and thought. (“Special guest” speaker James Gosling, identified as “the father of Java,” handled “the future of innovation.”) The talks were followed by a 20-minute Q&A session.\n\nAnd the reunion also featured another panel titled “Celebrating Success: Outstanding Women@Sun,” featuring “women who built on their experience at Sun to go on and have great accomplishments in the industry.” Panelists included:\n\nLinda Popky (moderator) — Founder and President, Leverage2Market Associates\n\nEva Sage Gavin — Senior Managing Director, Accenture’s Talent & Organization Consulting Practice\n\nNeha Sampat — CEO, Contentstack\n\nDenise Peck — Executive Advisor, Ascend\n\nNancy Hauge — CHRO, Automation Anywhere\n\nAnd all of the reunion’s events were organized on Facebook, with a team of nearly two dozen former employees volunteering to help make it happen.\n\nWhat You Always Remember\n\nMcNealy still remembers the heartfelt memo he’d sent on the eve of Sun’s acquisition by Oracle. The memo’s subject line was “Thanks for a great 28 years.” In the emotional good-bye, McNealy had remembered how they’d made it into the Fortune 200 while generating over $200 billion in revenue over the years, writing that Sun “innovated like crazy… And though we did not monetize our inventions as well as we could have, few companies have the track record in R&D that we had over the last 28 years.”\n\nAnd nine years later, he paraphrases what he’d written in that memo. “One of the biggest thrills was to be able to accomplish all that we accomplished without worrying about being embarrassed when my son read the newspaper the next morning. We broke the rules of business without breaking the law. We changed business in a big-time way, and we did it ethically, honestly, in an open and diverse and inclusive way.”\n\nSo what’s the feeling now? “I think a lot of us are very — not remorseful or sad, but just — I think we all feel very blessed to have been at a magical moment with the company…”\n\nSteve Evans, a Sun engineer who was there for the company’s first 13 years, from 1982 until 1995, created a poignant exhibit for the reunion. He took a low-resolution LED panel from his recent Burning Man art project, then used it to commemorate some iconic images from Sun’s first 10 years.\n\nAs to the feeling at the reunion, Evans seems to have found a sense of continuity. “Most of the folks I talked to were old co-workers and most were still working at Oracle in the Java group. Gosling had worked as part of my team for much of the time before the development of Java. I believe that those that stayed and continued after the Oracle deal enjoy being part of this successful and historically significant technology, and enjoy working with James, even if indirectly.”\n\nThere’s also something about a reunion that raises the question: whatever happened to those people who moved on to other companies? A page on the Sun Reunion site features the logos of companies where former Sun employees ended up. It includes major tech companies like Google, Amazon, Facebook, Netflix, as well as enterprise heavyweights like IBM and Hewlett Packard, and big-name internet companies like Yahoo, eBay, Twitter, and Slack. There are cloud companies like Docker, Joyent, and Cloudera, disruptive transportation companies like Uber, Lyft, and Tesla, major consumer technology companies like Dell, Lenovo, Ericsson, and several Linux vendors (including Red Hat and Canonical). And of course, Oracle.\n\nAnd there’s also a second page for new companies founded by Sun alumni. Mixed in with cloud companies like Cloudera and CloudBees, there’s a logo for Nvidia — whose 1993 co-founders included two former Sun engineers.\n\nIn 1992 Sun even gave future Microsoft CEO Satya Nadella one of his jobs in the world of tech — and that’s just one example of what McNealy described as “a stunning genealogy” of Sun employees moving on to other parts of the technology world. “We added it up at one point many years ago and found that there were a couple hundred minimum of former Sun employees who became CEOs. There’s just been unbelievable numbers and companies that have gotten started as a result of Sun. ”\n\nMcNealy also shared one of the most underappreciated secrets of Sun’s success. “I probably used HR more heavily, and I’m guessing more effectively than most companies, which is why you saw what you see at that reunion — the culture and the way people felt treated… I think sometimes people forget that a major asset in a tech company is the people. It’s not the brands. Brands have the shelf life of a banana…”\n\nHere in 2019, “I didn’t see anybody who wasn’t thrilled,” McNealy said of the event. “The only sad part was the little poster board where they had all the people who are no longer with us.” The Sun Reunion site has reproduced that poster board on a special “In Memoriam” page — and after its 300 names, a footnote remembers former vice president Phil Rosenzweig, who’d been a passenger on one of the airplanes which hit the World Trade Center on Sept. 11, 2001. The list stretches back into the 1980s, “All the way back to our first CFO Bob Smith, who died at his desk when we were a really young company,” McNealy says. “And a lot of others. That’s tough.\n\n“You sit there and you look and understand that good things do come to an end.”\n\nBut maybe that was one more reason to gather together and celebrate the vibrant community of former Sun Microsystems employees. “It was a big love-in. It was Woodstock…” McNealy says. “I guess it went on until 4:30 in the morning. That’s not unusual….”\n\nAnd what’s McNealy up to these days? “I’m living the dream. I still am and I wouldn’t change a thing,” he told us this week.\n\nAnd then he added, “Well, I would’ve changed a couple decisions I made, but I don’t fault myself… I think we made more good decisions than most companies did,” he said."}, {"url": "https://www.cnbc.com/2020/02/21/microsoft-senior-leadership-team-under-satya-nadella.html", "page_content": "Microsoft President and Chief Legal Officer Brad Smith, CEO Satya Nadella, Executive Vice President and Chief Financial Officer Amy Hood and Chairman John Thompson pictured at the Microsoft annual meeting of shareholders in Bellevue, Washington, on November 30, 2016. Jason Redmond | AFP | Getty Images)\n\nSatya Nadella has almost completely changed the group of top Microsoft executives who make key decisions and iron out issues since taking the company's CEO title from Steve Ballmer in 2014. Today's senior leadership team includes the leader of LinkedIn, Microsoft's biggest acquisition yet, but has no single person who's responsible for all of Windows. From the Ballmer years, only finance chief Amy Hood and legal head Brad Smith have stuck around with Nadella. In 2014, Nadella asked each person on the senior leadership team to make an \"'all in' commitment as we embark on the next chapter for the company,\" he wrote in a memo to employees. He announced at the same time that Skype executive Tony Bates, who had been a candidate for Microsoft CEO, was leaving. In the years since, a handful of other leaders have left, including Windows chief Terry Myerson, Nokia leader Stephen Elop (also once a CEO candidate) and business solutions executive Kirill Tatarinov. Most recently, artificial intelligence and research head Harry Shum left the leadership team recently after 23 years at the company, a spokesperson confirmed. But the departures haven't resulted in deep institutional knowledge going away. Eight of the 14 people on the current SLT, as the executive group is known at Microsoft, have been at the company for at least two decades. The group gathers each Friday, and meetings can span as long as seven hours, as Fast Company reported in 2017. Here are the current members of Microsoft's SLT:\n\nSatya Nadella: The boss\n\nMicrosoft CEO Satya Nadella Sean Gallup | Getty Images\n\nNadella grew up in Hyderabad, India, and joined Microsoft from Sun Microsystems in 1992 as a program manager in the company's Windows developer relations group. In the years to come he worked on advertising, search, commerce and public cloud, among other areas. At one point in the early 2000s, Jeff Bezos tried to recruit him to Amazon, but then-executive Doug Burgum (now the governor of North Dakota) convinced him to stay, Burgum told Fast Company in 2017. It turned out to be a good career move. After Steve Ballmer announced plans to step down as CEO in 2013, Nadella became Microsoft's third CEO on February 4, 2014, and immediately set out transforming the company. He emphasized areas like cloud where Microsoft was a challenger rather than a leader, and formed partnerships with rivals like Red Hat and SAP. Nadella has insisted that Microsoft loves open-source software despite Microsoft's past attacks on Linux, and he has made it clear that the Windows operating system, the historical core of Microsoft, was no longer the top priority. Nadella also set about changing Microsoft's cutthroat and bureaucratic culture. He encouraged employees to have a so-called \"growth mindset\" — the belief that people can develop new skills and knowledge with enough effort — after his wife, Anu, introduced him to the book \"Mindset\" by Carol Dweck years ago. Soon after becoming CEO, he asked top Microsoft executives to read \"Nonviolent Communication\" by Marshall Rosenberg. It \"was the first clear indication that Satya was going to focus on transforming not just the business strategy but the culture as well,\" legal chief Brad Smith has said. Nadella received $42.9 million in total compensation in the 2019 fiscal year. Microsoft's independent board members recognized Nadella's efforts to improve the company's culture in the most recent fiscal year, and they felt that his engagement with customers, partners and investors was \"exceptional.\" They credited him for leading the company to record financial results. Many people have observed that Nadella is especially present when he meets with people in person. \"He has a hugely proactive and incredibly connected listening [style]. So he's with you,\" executive vice president Jean-Philippe Courtois has said. \"You can feel it. You can see the body language. And it doesn't matter if you're a top executive or a first-line seller, he has exactly the same quality of listening.\"\n\nJudson Althoff: The salesman\n\nJudson Althoff, Microsoft's executive vice president for worldwide commercial business, at Microsoft's 2017 Inspire conference in Washington. Microsoft\n\nAs executive vice president of Microsoft's Worldwide Commercial Business, Althoff is in charge of commercial business strategy for enterprise, public sector, small and medium-sized businesses and other areas. He joined Microsoft in 2013 from Oracle to become president of Microsoft's North American business, reporting to Microsoft's then-operating chief, Kevin Turner. Turner left in 2016, opening the way for Althoff, among others, to take more responsibility. Prior to joining Microsoft, Althoff had spent 11 years at Oracle , most recently as senior vice president for worldwide alliances and channels and embedded sales. He had worked at EMC prior to that. Althoff led the development of a major sales reorganization in 2017 that saw Microsoft go deeper in key industries like retail and health care.\n\nChris Capossela: The marketer\n\nChris Capossela, chief marketing officer of Microsoft, poses for a photograph following an early access event at the new Microsoft flagship store in London on July 9, 2019. Chris J. Ratcliffe | Bloomberg | Getty Images\n\nCapossela, Microsoft's chief marketing officer and executive vice president for marketing and consumer business, wears several hats. He's in charge of Microsoft's marketing and communications, the consumer and device sales teams, along with advertising, sales and physical stores. In 1991 Capossela, known inside Microsoft as ChrisCap, graduated with a bachelor's degree from Harvard University, which Bill Gates had dropped out of in 1975, and went to work at Microsoft as a marketing manager. In the late 1990s he spent two and a half years as Bill Gates' speech assistant, and was corporate vice president for Office marketing for more than seven years, according to his LinkedIn profile. A 2011 Microsoft statement described Capossela as being \"instrumental in ushering Office into the cloud with Office Web Apps and Office 365.\" Nadella made him marketing chief in 2014. He delegated everything, one former Microsoft marketing executive told AdAge in 2014. \"Marketing at Microsoft includes building a profitable business, so understanding the flow of money is crucial,\" Capossela said in a 2014 interview.\n\nJean-Philippe Courtois: The international businessman\n\nMassimo Lapucci, right, and Jean-Philippe Courtois, left, attend a meeting between OGR and Microsoft to support startups at OGR Officine Grandi Riparazioni on Dec. 9, 2019, in Turin, Italy. Giorgio Perottino | Getty Images | OGR\n\nCourtois, known by his initials JPC, is an executive vice president and president of Microsoft global sales, marketing and operations. He heads up Microsoft's commercial business across Microsoft's many subsidiaries. He joined Microsoft as a channel sales representative in 1984, before the company's 1986 initial public offering, and in 1994 he became general manager of Microsoft France. In the early 2000s he was CEO of Microsoft's Europe, Middle East and Africa branch, then became president of Microsoft's international business until July 2016, when Kevin Turner left. Then he became executive vice president and president for global sales, marketing and operations. Courtois received $15.1 million in total compensation in the 2019 fiscal year. Microsoft board members gave him kudos for having a \"customer-obsessed\" approach and pushing for more conversations about diversity and inclusion in the most recent fiscal year.\n\nKurt DelBene: The strategist\n\nRep. John Boehner, R-Ohio, left, conducts a ceremonial swearing-in with Rep.-Elect Suzan DelBene, D-Wash., as her husband Kurt looks on in the Capitol on Nov. 13, 2012. Tom Williams | CQ Roll Call\n\nDelBene is Microsoft's chief digital officer and executive vice president of corporate strategy and the Core Services Engineering and Operations group. He looks after Microsoft's internal technology and its strategy, keeps track of competitive issues and explores potential business opportunities. He joined Microsoft in 1992 from McKinsey, where he had been a management consultant, and eventually rose to be president of Microsoft's Office division. DelBene is considered a founder of Office 365, a core part of Microsoft's modern cloud push. He was previously general manager for Outlook and group program manager for Exchange. The BBC once described DelBene as \"the man behind the PowerPoint presentations.\" In 2013 he retired from Microsoft as part of a Microsoft reorganization. Months later President Obama asked him to help fix Healthcare.gov. In 2015 DelBene returned to Microsoft on Nadella's request. He led Office when Microsoft was building the software to make Office apps work on Apple's iPad -- an initiative that Ballmer was lukewarm about, but that Nadella brought to fruition when he took over. \"It came to a point where I had discussions with Steve [Ballmer], and Steve was really kind of conflicted about it,\" DelBene said at a company event in 2015. \"He thought of us as the Windows company first and foremost, and would Office be strong if Windows wasn't strong? And my perspective was both need to be strong and Office will not be able to fundamentally be the thing that changes that equation one way or the other. But what it could do, if we didn't have cross-platform, is it could reduce the value of Office and the value proposition for Office very substantially. And so we went back and forth a couple of times. He finally said, 'Nope, I don't want to ship it.' And one of the very first things that Satya did when he became CEO is he shipped the iPad version of Office.\" In 2012 his wife, Suzan DelBene, a former Microsoft executive herself, became a U.S. representative for Washington's 1st Congressional district.\n\nScott Guthrie: The cloud chief\n\nScott Guthrie, executive vice president for Microsoft's Cloud and AI group, speaks at the company's Build conference in Seattle in May 2019. Microsoft\n\nGuthrie, known by his email handle ScottGu, is executive vice president in charge of the company's Cloud and AI group. In 2018 Guthrie gained more power when Microsoft divvied up the Windows and Devices Group and moved a good chunk of it — the Windows platform team — into his organization. He joined Microsoft immediately after taking his bachelor's degree from Duke University in 1997. He was a founding member of the team that developed Microsoft's .NET, a set of technologies for software developers to write applications. He's also the father of ASP.NET, for building web applications. For many years he has shown up at events in solid red polo shirts, the closest Microsoft comes to having a person with a regular uniform like former Apple CEO Steve Jobs, who often wore black turtlenecks. In 2011 he took control of the application platform team for Azure, Microsoft's cloud infrastructure offering that competes with Amazon Web Services, to get developers building on Azure. Back then Azure was not the company's biggest priority, and it wasn't the easiest thing to use. Even some Microsoft executives had trouble with it, Business Insider reported. The day before Nadella became CEO, he asked Guthrie to take over for him as head of Microsoft's Cloud and Enterprise business that includes Azure. \"We've worked so closely together, so it was a pretty quick conversation,\" Guthrie said in a 2019 interview.\n\nKathleen Hogan: HR\n\nKathleen Hogan speaks at the @Work event in New York City on April 2, 2019. Cindy Ord | CNBC\n\nHogan is Microsoft's executive vice president of human resources and chief people officer. She led the charge on an overhaul of the employee performance review process. She worked on the company's paid-leave policy, and under her Microsoft has made inclusion a higher priority. She's also addressed questions about harassment complaints within the company. She earned a bachelor's degree from Harvard in 1988, according to her LinkedIn profile, then joined Microsoft from McKinsey in 2003 as vice president of customer and partner experience and worldwide field operations. She later took responsibility for technical support as well. She became chief people officer in 2014 after Nadella called her while she was on a road trip during a sabbatical and asked her to take the job. \"I think Satya really had a vision for making this a purpose-driven place and also an exceptional place for people to work, and so I thought, 'What a great chance to go do that,'\" she said in a conversation with Capossela. Hogan is Nadella's \"partner in transforming our culture,\" he wrote in his 2017 book \"Hit Refresh.\" She became a bigger supporter of Nadella after seeing how he handled criticism for saying in 2014 that women shouldn't ask for raises but instead have faith in the system. \"He didn't blame anybody,\" she said. \"He owned it. He came out to the entire company, and he said, 'We're going to learn, and we're going to get a lot smarter.'\"\n\nAmy Hood: The money master\n\nAmy Hood, executive vice president and chief financial officer of Microsoft, speaks at a climate initiative event at the company's campus in Redmond, Wash., on Jan. 16, 2020. David Ryder | Bloomberg | Getty Images\n\nAs Microsoft's chief financial officer, Hood runs the finance group, giving her responsibility for acquisitions, tax planning, treasury activities, accounting, internal audits and investor relations. Hood graduated from Harvard Business School in 1999 and worked as an investment banker at Goldman Sachs. She joined Microsoft in 2002, initially working in the company's investor relations team. Later she was chief of staff of Microsoft's Server and Tools group, and in 2010 she became finance chief of the Microsoft Business Division. She helped lead the transition to Office 365, and oversaw the acquisitions of Skype and Yammer. When Hood stepped up to replace Peter Klein as finance chief in 2013, becoming the first woman to hold that role in company history, the strategy seemed to be less about growing revenue than cutting costs. \"Peter has built a world-class finance team, and I am set up well to continue the company's strong discipline around costs and focus on driving shareholder value,\" she said. By 2015, as executives were planning the company's briefing for financial analysts, Hood felt that the company should show investors how Microsoft could become more relevant, according to a 2017 Harvard Business School case study. At that meeting, Nadella introduced an ambitious new goal focused on growth rather than costs: The company aimed to achieve a $20 billion annualized revenue run rate from commercial cloud services including Azure, Office 365, Dynamics and enterprise mobility services in the 2018 fiscal year. Microsoft achievedthat goal. She received $20.2 million in total compensation in the 2019 fiscal year. Board members gave Hood credit for \"record year financial performance and management\" and cost cutting across multiple departments in the most recent fiscal year.\n\nRajesh Jha: The Office guru\n\nRajesh Jha, executive vice president for experiences and devices at Microsoft, speaks at the company's Build conference in Seattle in May 2019. Microsoft\n\nAs Microsoft's executive vice president of experiences and devices, Jha leads one of the major groups of engineers in the company. Most of his time at Microsoft he's worked on software for business use, and he's worked on the Office suite for many years. A 2018 reorganization gave him purview over more products, including devices and the Windows client. Jha has a say in the planning process for where Microsoft's data centers should be, alongside Scott Guthrie. Jha joined Microsoft in 1990 as a software design engineer immediately after receiving a master's degree from the University of Massachusetts, Amherst. He contributed to five releases of the Microsoft Works suite and later developed multimedia technologies. \"I said, 'Wow, I can't believe they're actually trusting me to ship stuff,'\" he recalled in a 2018 conversation with Dharmesh Thakker of Battery Ventures. \"And sure enough, you know, I had some hideous bugs that went out in the first release, and I was incredibly down on myself.\" He remembered being conflicted about whether he wanted to be a developer or a manager, and he flip-flopped between the roles before his ascent to the top tiers of management at the company. \"Outside of work, you will often find me playing sports with my two sons. I am an avid sports fan and love to watch and play football, soccer, golf — sometimes more than my wife appreciates. ;),\" he wrote in a 2008 blog post. Jha speaks in bullet points, his former administrative assistant, Genise Dawson, has said.\n\nPeggy Johnson: The dealmaker\n\nPeggy Johnson, executive vice president of business development at Microsoft, speaks during the Wall Street Journal D.Live global technology conference in Laguna Beach, Calif., on Oct. 17, 2017. Patrick T. Fallon | Bloomberg | Getty Images\n\nAs executive vice president of business development, Johnson oversees Microsoft's business partnerships and corporate venture capital program, M12. She also has considerable influence on the company's M&A strategy. She was Nadella's first big hire as CEO, joining from Qualcomm. Her first assignment was to improve Microsoft's relationship with Samsung, which was upset that Microsoft had entered the smartphone space by buying Nokia in 2013. At Qualcomm she had leadership roles in engineering, sales and marketing, as well as business development. Prior to that, she had worked on anti-submarine warfare as an engineer at GE. She was one of 15 kids. Her total compensation for the 2019 fiscal year exceeded $10.4 million. Microsoft board members credited her for efforts to promote diversity and inclusion in the most recent fiscal year, noting that she helped to launch the inaugural Female Founders Competition alongside partners EQT Ventures and SVB Financial Group. \"Over the course of my career, I've spent thousands of hours in pitch meetings, often as the only woman in the room. I still can't hold back a smile when a woman founder walks through the door, because I know the obstacles she's overcome just to get there,\" she wrote in a blog post announcing the contest.\n\nKevin Scott: Technical mind\n\nKevin Scott, executive vice president and chief technology officer of Microsoft, speaks during the GeekWire Cloud Summit in Bellevue, Wash., on June 5, 2019. David Ryder | Bloomberg | Getty Images\n\nScott, Microsoft's chief technology officer, works on the company's technical vision, and in November Microsoft said he would take on Shum's responsibilities, giving him leadership of people focused on research and AI. He's a remote executive, and lives in Los Gatos, California, in Silicon Valley. He's typically spent a few days a week at headquarters in Redmond, Washington. \"I will in all honesty say it's not my favorite thing in the world,\" he said on a podcast in 2018. \"I've sort of been shocked that I've been able to do as much of this job as I have been able to do remotely.\" He arrived at Microsoft through the acquisition of LinkedIn, where he had been a senior vice president, and was named Microsoft's technology chief in 2017, less than two months after the acquisition closed. He reports to Nadella. Scott initially wanted to be a computer-science professor. He spent time as a summer intern at Microsoft in 2001 while working on his Ph.D. at the University of Virginia, which he did not end up completing. His Ph.D. advisor, professor Jack Davidson, spent a sabbatical at Microsoft Research at corporate headquarters and got Scott a spot as an intern on the team where he worked, the programming language systems group. He also spent time at Google and AdMob, which Google later acquired. In 2018 he said the work he was proudest of was writing \"a bunch of software that people still use, you know, to this day, to do research in this very arcane, dark alley of computer science.\"\n\nBrad Smith: The lawyer\n\nBrad Smith, president of Microsoft, right, speaks as Christopher Eisgruber, president of Princeton University, left, and Princeton Graduate Maria De La Cruz Perales Sanchez listen during a news conference outside the Supreme Court in Washington, D.C. on Nov. 12, 2019. Al Drago | Bloomberg | Getty Images\n\nSmith, Microsoft's president and chief legal officer, regularly speaks about Microsoft's positions on government policy, immigration, intellectual property, privacy, security and sustainability. He led Microsoft's negotiations with governments and companies, including antitrust agreements, and helped Microsoft build up a large collection of patents. Smith directed Microsoft lawyers to figure out the degree to which open-source software infringed on Microsoft's patents. And he saw Microsoft's U.S. antitrust trial play out in person. He joined Microsoft in 1993 from the law firm Covington & Burling to head up European corporate and legal affairs, and he became the company's general counsel in 2002. In 2015 he was named president. He arrives at work at 6:30 a.m. and leaves at 6:45 p.m., and at 9:30 p.m. he logs on to handle work email, according to the Puget Sound Business Journal. Mark Zuckerberg once tried to recruit him, but he told the young CEO that he was not interested in leaving Microsoft, the Information reported in 2018. He received $17.4 million in total compensation in the 2019 fiscal year. Board members recognized Smith's policy efforts related to the General Data Protection Regulation and the Paris Call for Trust and Security in Cyberspace in the most recent fiscal year. Smith has been on the Netflix board since 2015.\n\nPhil Spencer: The gamer\n\nPhil Spencer, executive vice president at Microsoft, speaks at the company's Xbox One X reveal event ahead of the E3 Electronic Entertainment Expo in Los Angeles on June 11, 2017. Patrick T. Fallon | Bloomberg | Getty Images\n\nSpencer is executive vice president for gaming, where he's in charge of gaming devices like the upcoming Xbox Series X console, as well as services like the xCloud streaming service. Spencer interned at Microsoft in 1988, two years after the company's initial public offering. After graduating from the University of Washington in 1990 he returned to Microsoft for a spot in the company's multimedia group. He led Microsoft's game studios and, later, all of Xbox. Spencer had presented Microsoft with a chance to buy Mojang, the developer of the game Minecraft, before Nadella's 2014 CEO appointment, Nadella wrote in his 2017 book \"Hit Refresh.\" Spencer's boss chose not to move forward with a deal, Nadella wrote. Spencer kept in touch with Mojang and one day received a text saying the company was again for sale. This time Spencer brought the opportunity to Nadella who by then was CEO, and Microsoft bought Mojang for $2.5 billion. He's well liked by the gaming public. He shares his online ID, P3, making it possible for people to play games like racing title Forza with him over the Xbox Live service. tweet In 2017 Spencer, Microsoft's executive vice president of gaming, joined the SLT, a sign of the company's commitment to gaming. Microsoft has bought several game-development studios under Spencer's supervision, including Compulsion Games, Double Fine Productions, InXile, Ninja Theory, Obsidian, Playground Games and Undead Labs. In November Spencer made it clear that Microsoft's buying spree is not over. \"We're running a good business today, so we've earned the right to continue to look,\" he said in an interview with Eurogamer.\n\nJeff Weiner: Socialite\n\nJeff Weiner, chief executive officer of LinkedIn Corp., speaks during a Studio 1.0 interview in San Francisco, California, U.S. Bloomberg | Getty Images\n\nWeiner is CEO of LinkedIn, a social network for professionals, with more than 675 million members. But in June he'll be replaced by Ryan Roslansky, currently senior vice president of product. Weiner has more than 10 million followers on LinkedIn, and he regularly likes and comments on users' posts. And from time to time he does post, generating hundreds of comments. \"Very late to the Peloton craze (have a number of colleagues who have sworn by it for years) but have quickly become a huge fan,\" he wrote last fall. \"Absolutely nailed the value proposition.\" Before joining LinkedIn in 2008 he had held several leadership positions at Yahoo, and before that he had spent five years at Warner Bros., according to his LinkedIn profile. He was 24 when he got to Warner Bros., and he carried with him a report showing how the company could move forward in digital. \"I was just this little pisher, a nobody. But they liked the report,\" he told Forbes in 2012. WATCH: Microsoft shares reach record highs after posting strong quarter"}, {"url": "https://www.infoworld.com/article/2624986/oracle-s-open-source-missteps-continue-with-hudson-project.html", "page_content": "Oracle hasn't won many friends in open source communities since its acquisition of Sun Microsystems and Sun's array of open source assets, including MySQL, Java, and OpenOffice. Oracle seems bent on continuing this trend with the growing Hudson open source project.\n\nOracle controls the Hudson project trademark\n\nThe Hudson open source project delivers a leading continuous integration server along with more than 300 plug-ins to support the building and testing of a wide variety of software projects.\n\n[ Keep up with the latest open source trends and news in InfoWorld's Technology: Open Source newsletter. ]\n\nThen-Sun employee Kohsuke Kawaguchi and now a key member of CloudBees, which aims to bring Hudson to the cloud, founded the Hudson project. Kawaguchi worked on Hudson as part of his Sun duties. As such, Sun, and now Oracle, retained ownership of the Hudson trademark and intellectual property.\n\nKawaguchi remains co-owner of the project, along with Winston Prakash, an Oracle engineer assigned to replace Kawaguchi after his departure from Oracle.\n\nThe tension between community and company over project decision making\n\nThe Hudson project hosted its developer and user mailing lists and source code on Java.net. However, downtime and reliability issues at Java.net encouraged the Hudson developer community to propose moving the mailing lists to Google Groups. In parallel, Oracle, also unhappy with reliability issues with Java.net, decided to upgrade the Java.net infrastructure and migrate the Hudson project to the new Java.net infrastructure.\n\nUnfortunately, an Oracle email notifying Hudson users and developers of this migration was not received as the sender was not subscribed to the mailing lists in question. As a result, Hudson developers have been locked out of the mailing lists and unable to access or update the source code for more than a week.\n\nFrustrated by the inability to access the Hudson source code, Kawaguchi proposed moving the source code to GitHub. Others supported the proposal on the developer mailing list, with no major objections raised for nearly a week. Then, Oracle's senior VP of tools and middleware, Ted Farrell, wrote the Hudson mailing list to express Oracle's concerns:"}, {"url": "https://tedium.co/2018/04/12/larry-ellison-network-computer-history/", "page_content": "Today in Tedium: Oracle has a few reasons to hate Google. The search company built a significant chunk of its empire, the Android operating system, based on Java, a programming language created by one of Oracle’s largest acquisitions, Sun Microsystems. As a result, the two companies have been going at it in court for years now. Google won a few rounds, but Oracle, more importantly, won the latest, likely ensuring a Supreme Court showdown. But I wonder if this battle is a proxy war of sorts—reflecting the fact that Google pulled off the big dream that Oracle once wanted for itself. Today’s Tedium highlights the tale of the Network Computer, the big idea that fell out of Larry Ellison’s fingers. — Ernie @ Tedium Today’s GIF is Ellison from “Triumph of the Nerds,” talking about how much he hates Microsoft.\n\n“The NC is clearly part of our strategy to dethrone Microsoft.” — Larry Ellison, speaking about the Network Computer in a 1997 interview with The Independent. Ellison was a prominent, wealthy man at the time, a guy who held a lot of power in the software industry due to Oracle’s focus on relational databases—products that make the business world go round, but don’t necessarily make one a household name. Ellison also harbored what the article called a “monomania” about Bill Gates, who always seemed to get more attention for Microsoft than Ellison did for Oracle. The Network Computer, essentially a ‘90s take on the dumb terminal, was directly inspired by his battle with Microsoft.\n\n(Oracle PR/Flickr) The Network Computer’s biggest success may be in making Larry Ellison a household name When it comes down to it, Larry Ellison’s big idea was one that failed to change the world until someone else tried the idea. It was a far-reaching vision that reflected the thinking of someone who knew how effective databases had gotten and how sophisticated computer networks really were, but the timing of his concept was a bit off. You could argue that there were more successful historic attempts to do what Oracle was doing elsewhere; France’s Minitel comes to mind, as does the University of Illinois’ PLATO system. But as a promotion strategy for Larry Ellison and Oracle, it was downright brilliant. This is not a knock on Ellison so much as simply stating fact—he simply did not have much of a profile outside of the world of technology before he started making the case for the Network Computer. That idea came to prominence in direct response to the success of Microsoft, a company whose fortunes had always shone brighter in comparison to Oracle’s. There was a clear reason for this, of course: Oracle worked higher up in the corporate food chain. Relational databases weren’t exactly something consumers directly dealt with on a regular basis, at least with their knowledge, and Oracle couldn’t exactly pull an “Intel Inside” with their product. Oracle was a vendor; by 1995, Microsoft was effectively a consumer business. No vendor would put a Weezer video on their installation CD. Microsoft Bob has a better ring to it than Oracle Bob. The seeds of the Network Computer started in a somewhat altruistic place. Per the 2003 book Everyone Else Must Fail: The Unvarnished Truth About Oracle and Larry Ellison, an unauthorized biography about the Oracle CEO by author Karen Southwick, Ellison had the idea in 1994 while meeting with President Bill Clinton and a number of Silicon Valley CEOs, including the heads of Sun Microsystems and Apple. He made the case that Clinton should push the computer industry to make a machine for less than $500, much as John Kennedy pushed America to go to the moon. That idea didn’t win over a lot of fans, but the cheap computer idea gained momentum within Oracle after the company wed the idea to the internet, specifically the then-new World Wide Web. And it gained momentum outside of Oracle thanks to a well-timed media appearance on the part of Ellison. In September 1995, at the International Data Corp.’s European IT Forum in Paris, Ellison made the case for the Network Computer concept—and against the PC model, which he derided as not being a good choice for most consumers. “A PC is a ridiculous device; the idea is so complicated and expensive,” Ellison was quoted as saying in a ComputerWorld article. “What the world really wants is to plug into a wall to get electronic power and plug in to get data.” This was the introduction of a new vision—and Bill Gates was there to defend the old one. “You’ll still need a way of storing the applications that you download from the network and your personal data,” Gates said at the time. Microsoft, which had just released Windows 95, had appeared to vanquish most of its enemies by this point. Apple, still without Steve Jobs, was in dire straits; IBM’s PC business was a shrinking violet in the era of clones. In Paris that week, a new challenger appeared. Ellison’s comments pinpointed a problem with computers—they cost too much for the average person—and he had a solution. He wanted to create machines that leverage the computing resources accessible through the network, rather than requiring the user to pay up front for those resources. By treating the computer as an appliance rather than a beefy machine in its own right, Ellison introduced a different image of the computer industry—one that gave large players on the sidelines in the Windows era, like Oracle and Sun, a way to stand out. It was the perfect way for a guy like Larry Ellison to boost his company’s name recognition.\n\n46M The number of Network Computers that Oracle Senior Director Jim Lynch suggested in 1996 that there could be on the market by the year 2000, according to an estimate by CNET. (And that was the low end of his estimate—he suggested it could go as high as 100 million.) There was a lot of momentum behind the concept for a time, with Ellison’s pitch winning over firms like IBM and Netscape—firms that admittedly felt a little isolated by Microsoft’s dominance.\n\n“We believe there will be a category of networked computers in many different forms, in portable versions and desktop versions. They will exist and they will be very successful, and not just from Sun and Oracle. The price points are going to be pretty low, and they’ll look more like consumer electronics.” — Eric Schmidt, then the chief scientist at Sun Microsystems and later Google’s CEO and Executive Chairman, discussing the value that Sun saw in the Network Computer concept in a 1995 New York Times article that questioned whether the concept would actually work. Schmidt, as Google’s chairman and CEO, would oversee a company behind the Chromebook, the closest thing we have to the Network Computer concept today."}, {"url": "http://tedchilds.com/", "page_content": "-- Keith H. Hammonds\n\nFast Company Magazine\n\n… Since 1995, though, IBM has acquired a different look, largely because of Childs’ strategic campaign to overhaul the company’s practices pertaining to hiring and promoting women, ethnic minorities, and other groups that are underrepresented at IBM."}, {"url": "https://zhuanlan.zhihu.com/p/41136751", "page_content": "10个TED演讲\n\n1. 每个孩子都需要一个冠军\n\n2. 教师需要真正的反馈\n\n3. 关于乐高的新解读与实践\n\n4. 影响教育改革的视频\n\n5. 学校是如何孩子们的创造力的\n\n6. 儿童驱动力型的教育\n\n7. 学习方式的变革\n\n8. 关于学习的三个规则\n\n9. 利用计算机教孩子数学\n\n10. 关于英国的Studio School\n\n（一）什么是TED TALKS （TED演讲）\n\nTED（指technology, entertainment, design在英语中的缩写，即技术、娱乐、设计）是美国的一家私有非营利机构，该机构以它组织的TED大会著称，这个会议的宗旨是“值得传播的创意”。TED诞生于1984年，其发起人是里理查德·索·乌曼。2001年起，克里斯·安德森接管TED，创立了种子基金会（The Sapling Foundation），并运营TED大会。对于自己的“义举”，安德森解释道：“我是学哲学的，总是生活在自己的想法中。我之前就隐约地觉得，有很多好的想法如果能进行全球传播，是很好的事情。我当时有一点钱，很想做出一些贡献。我发现，TED是很好的工具。” 他还说过: “曾经，知识经济中的人说，你要保护如黄金般的知识，这是你唯一的价值。但是，当全球都联系在一起时，游戏规则改变了，每个人都互相关联，一切都会快速发展。当知识传播出去后，会以最快速度到达全球各地，得到反馈，得以传播，而它的潜在价值是无形的。”\n\n\n\n\n\n\n\n网址：https://www.ted.com/talks?language=zh-cn\n\n\n\n\n\n1、Every Kid Needs a Champion ， Rita Pierson\n\nRita Pierson，一位有40年教龄的老师，一次听到一个同事说，“我的职责不是喜欢学生。”她回应道：“孩子们不会跟他们不喜欢的人学习。” 这个充满激情的演讲号召教育者们相信他们的学生并且从个人角度上真正建立起和孩子们的联系。她坚持每个孩子都需要一个相信他（她）的成年人。她认为，教学是严格的非个人的从9到5的努力，并不是用教师的号召力来塑造下一代的生活。\n\n\n\n\n\n2、Teachers Need Real Feedback，Bill Gates\n\nBill Gates提出了一个令人信服的案例告诉大家关于教育的改变。他认为，“令人满意”这一反馈是不足以鼓励教师成为他们行业中最好的从业者的。然而事实上，“满意”这个词实际上是90%的老师得到的唯一反馈。Gates坚持，如果要在教育质量上领先，可以采用与中国类似的模式来反馈给教师（中国在科学、阅读、数学的教学领域遥遥领先）。\n\n\n\n\n\n\n\n3、Building Blocks That Blink, Beep, and Teach，Ayah Bdeir\n\n1968，LEGO乐高通过其简单的可连接的玩具砌块设计，设计出可以模仿孩子们的混凝土砖块。Ayah Bdeir把乐高的想法带进了一步，使建筑晶体管成为可能，而对于那些没有使用“小比特”的电子学知识的人来说，这是一个可以用磁铁把它们结合在一起的单个部件。创造小电子设备（如纸屑鼓风机）。Ayah希望她的小点能够鼓励孩子和成年人一样学习电子技术和电路的工作方式。鼓励孩子们去思考和发掘生活中更多有趣的事物。\n\n\n\n\n\n4、Let’s Use Video to Reinvent Education， Salman Khan\n\n观看地址：\n\nhttps://www.ted.com/talks/salman_khan_let_s_use_video_to_reinvent_education\n\nSalman Khan描述了他的网站Khan Academy 对于教育的意义。Khan Academy网站中提供的视频让数以百万计的学生已经能够以自己的速度学习和掌握一些较为理解困难的概念。从那时起，Salman 放弃了他的职业生涯来经营他的非盈利性全职业务。\n\n\n\n\n\n5、How Schools Kill Creativity， Ken Robinson\n\n观看地址：https://v.qq.com/x/page/w0153erl9t4.html\n\nKen Robinson认为，教育体系试图使学生们成为一个同质性的群体。他认为，只有注定要成为大学教授的孩子才会从这样的模式中受益，而那些未来想成画家、舞蹈家、音乐家和木工的孩子的才能才容易被扼杀。而且现今这个时代，大学学历由于教育通货膨胀而变得没有那么有价值。我们现在是需要的不仅仅是学位，更重要的是创造力，我们需要帮助下一代成为多样化人才，而不是压制他们的创造与想象力。\n\n\n\n\n\n6、The Child-Driven Education， Sugata Mitra\n\n观看地址：\n\nhttps://www.ted.com/talks/sugata_mitra_the_child_driven_education\n\nSugata Mitra指出，通常最有能力的教师在最需要他们的领域里是非常少的。他建议通过互联网的力量解决这个问题。比如，在新德里、南非和意大利等地区都有一系列的飞行员培训，但这些培训也不需要教师身体当面授课。孩子们学习的能力。\n\n\n\n\n\n7、Bring on The Learning Revolution， Ken Robinson\n\n观看地址：\n\nhttps://www.ted.com/talks/sir_ken_robinson_bring_on_the_revolution\n\n这是Ken Robinson爵士第二次在TED的演讲，通过有趣的笑话和轶事。 认为学校的工作方式需要发生根本性的改变。他深信，我们学校采用的标准化、一刀切的做法会导致教育的失败。解决方案是坚持孩子们的个性化学习，每个孩子都可以自由发展自己的天赋和兴趣。这也会是一场教育革命。\n\n\n\n\n\n8、Three Rules to Spark Learning，Ramsey Musallam\n\n观看地址：\n\nhttps://v.qq.com/x/page/w0167y00ccd.html\n\n由于生命威胁的紧迫性，化学老师Ramsey Musallam开始重新思考他的教学方式（他称之前的教学方式为“伪教学”）。现在，他致力于激励其他教育工作者重新定义他们的工作，并使教师成为培养好奇心的首要目标。他给出了三条规则：重视好奇心，积极面对问题，实践反思。\n\n\n\n\n\n9、Teaching Kids Real Math with Computers， Conrad Wolfram\n\n观看地址：\n\nhttps://www.ted.com/talks/conrad_wolfram_teaching_kids_real_math_with_computers\n\n\n\n\n\n很多人看起来都会讨厌数学。沃尔夫拉姆研究的负责人Conrad Wolfram认为，很多想法只是我们教数学的方式，而不是数学本身。他认为，传统的数学教学方法，比如死记硬背和计算，不是数学在现实世界中最好的方式，而且它是枯燥的。他建议我们通过计算机编程教学生数学。这也是现今技术时代所需要的。真正的数学是用概念作为解决问题的工具，而不是简单地知道所有的乘法表。\n\n\n\n\n\n10、A Short Intro to the Studio School， Geoff Mulgan\n\n观看地址：\n\nhttps://www.ted.com/talks/geoff_mulgan_a_short_intro_to_the_studio_school\n\n研究表明，各人有各人好的学习方式。有些人通过阅读学习，有些人通过听，有些人通过看，还有一些通过做。在公立学校，人们把重点放在观看、阅读和听力上，而不太重视做。英国的一所学校Studio School，就是鼓励学生们通过做来学习，而且也取得了很好的效果。值得我们去了解学习。\n\n每个分享者都有很多有趣的想法和建议，我们不用照搬，只需要思考和学习。或者说是对于自己教育理念和方式的实践和反思。\n\n我始终坚信教育是这个世界上最伟大的事业之一，值得我们每个人各自和共同的努力。\n\n\n\n\n\n感谢阅读，欢迎您的分享及交流~\n\n如有兴趣，请分享转发喔~\n\n如需要转载，请留言，谢谢！"}, {"url": "https://www.yourtechstory.com/2021/08/03/sun-microsystems-a-famous-american-it-company-currently-operating-under-oracle-corporation/", "page_content": "Sun Microsystems is an American IT company that was established in 1982 and is based in California, US. The company became very famous over a short time because it created Java (programming language) whose applications are very wide in today’s IT sector. The company mainly sold computer components, IT services, software but set itself apart by rolling out products like Java, ZFS, SPARC microprocessors, VirtualBox, etc. Sun Microsystems offers a wide range of software products like the Java platform, operating system, Office Suite, database management system, etc. It also offers storage as one of its primary products as well.\n\nAbout Sun Microsystems\n\nThe founders of Sun Microsystems are Scott McNealy, Vinod Khosla, Andy Bechtolsheim, and Bill Joy. Sun Microsystems is a company that has always supported open systems like Unix and contributed to open-source software. In 2008, the company acquired MySQL for $1 billion. After a year, Oracle Corporation announced that it would acquire Sun Microsystems for $7.4 billion. The company made plenty of acquisitions and expanded to Newark, Oregon, Scotland, Hillsboro, and many other places before it became a part of Oracle Corporation.\n\nImage source: zimbio.com\n\nHistory Of The Company And The Dot-Com Bubble\n\nThe first Unix workstation of Sun Microsystem, Sun1 is the original idea of Andy Bechtolsheim. When he was a graduate student at Stanford University, he started working on the designs of the workstation for his communications project. He designed it using the Motorola 68000 processors and an advanced memory management unit. His first design was completely built out of what he got from his college’s computer science department and Silicon Valley supply houses. As the design of the workstation became a success, two other graduate students, Scott McNealy and Vinod Khosla from the same university joined in and founded Sun Microsystems. Bill Joy worked at Berkeley Software Division and joined the company soon.\n\nIn the first year of its establishment, Sun Microsystems turned out to be profitable. After four years, the company filed its first IPO under the stock symbol SUNW. This symbol was changed to JAVA in 2007 as the company became more famous as the creator of the Java platform. Soon, the situation of the dot-com bubble made an impact on every Silicon Valley business. Sun Microsystem’s business rose dramatically and the share prices as well. The company started hiring more employees and building the company until the bubble burst in 2000. None of the companies were prepared for this and thus it was followed by layoffs and cost-cutting. Sun tried its best to get to the pre-cash scenario as early as possible but had to shut down their Newark, California facility.\n\nPost-Crash Scenario\n\nAfter the bubble burst, there were changes in the strategies of Sun Microsystems. The company started focusing more on processor optimization for multi-threading and multiprocessing. In 2004, the company collaborated with Fujitsu, a Japanese business, to use their processor chips and Sun servers. Eventually, Sun Microsystems stabilized itself and in 2005 gained a net profit of $19 million. The year before it was acquired by Oracle, the value of Sun Microsystems fell from 2007 to 2008 and its valuation came down to $3 billion.\n\nAcquisitions\n\nSun Microsystems has a big list of acquisitions from the year 1987 to 2009, just before Oracle acquired it. In the 1980s it acquired Transept Systems, Sitka Corp, Centrum System West, and Folio Inc. The company acquired a lot of businesses in the late 1990s. Some of them are Lighthouse Design, Encore Computer, LongView Technologies, etc. Out of all the companies it acquired, MySQL was the biggest acquisition in the company’s history. Q-Layer was the last company that it acquired before Oracle bought it off.\n\nAbout The Founders\n\nScott McNealy is an alumni of Harvard and Stanford University. Mostly famous as co-founding Sun Microsystems, he also founded Curriki which is a free e-learning service. He founded Wayin in 2011 and served as its CEO for quite some time. In 2018, he joined the Advisory Board of Redis Labs.\n\nVinod Khosla is an Indian American businessman who graduated from IIT Delhi. He also went to Carnegie Mellon University followed by Stanford. Apart from Sun Microsystems, he founded Khosla Ventures. Last year, he was featured on the Forbes 400 list.\n\nApart from being an investor and an entrepreneur, Andy’s career started as an electrical engineer. He was very talented as a student as he graduated from Carnegie Mellon University with the help of the Fulbright Scholarship. Later, he went to Stanford to complete his Ph.D. He is also a Google investor. Before co-founding Sun Microsystems, Bill Joy worked at Fabry’s Computer Systems Research Group. He is an electrical engineer and also acquired a degree in computer science."}, {"url": "https://www.cnet.com/tech/tech-industry/sun-microsoft-settle-java-suit/", "page_content": "Under the settlement, Microsoft will pay Sun $20 million and is permanently prohibited from using \"Java compatible\" trademarks on its products, according to Sun. Sun also gets to terminate the licensing agreement it signed with Microsoft.\n\nFor its part, Microsoft is permitted to use a version of Java in Microsoft products that already contain it, or that already are in the testing phase, for the next seven years, according to the company.\n\nJava is a software technology that allows a program to run on a multitude of computers without having to be rewritten for each one. Sun sued Microsoft for $35 million in 1997, saying Microsoft breached its contract by trying to extend Java so it would work differently, and presumably better, on Windows computers. Consequently, one of Sun's main arguments in the case was that Microsoft wrongfully advertised that its products were Java-compatible because, in Sun's eyes, they were not. Those changes broke the universality of Java, Sun argued.\n\n\"It's pretty simple: This is a victory for our licensees and consumers,\" Sun CEO Scott McNealy said in a statement. \"The community wants one Java technology: one brand, one process and one great platform. We've accomplished that, and this agreement further protects the authenticity and value of Sun's Java technology.\"\n\nMicrosoft was equally upbeat.\n\n\"This settlement is great news for the industry and Microsoft, as it means we can focus all our resources to help enable the next generation of software with Web services,\" said Sanjay Parthasarathy, vice president of platform strategy at Microsoft.\n\nShares in both companies were up in after-hours trading on the Island electronic communications network, with Sun rising from $31.56 to $32.37 and Microsoft going from $60.56 to $61.94.\n\nJava emerged in the mid-1990s and was immediately hailed as a technology that could greatly affect Microsoft's future, as it allowed developers to create desktop applications that could run on any operating system. As a result, developers ideally would not have to dedicate themselves to writing Windows programs to survive.\n\nAlthough hype outpaced actual Java implementation, the technology has steadily caught on.\n\nThe germ of the suit began when Microsoft took out a Java license in 1996. Sun contended that Microsoft quickly began to run afoul of the licensing terms and filed the initial lawsuit in October 1997.\n\n\"Microsoft has proven time and again that it is unwilling to abide by the common rules of the Internet,\" Patricia Sueltz, Sun's executive vice president for the software systems group, said in a statement. \"Its behavior with regard to the Java technology was just one instance. And when presented with the choice of compatibility or termination, Microsoft chose termination.\"\n\nIn a news conference, Sun executives said they were able to use Microsoft as a distribution tool to get Java into the hands of users when the software was in its infancy. Then Sun's lawsuit froze Microsoft's plans to modify Java for its own benefit, and Java became established in the meantime.\n\n\"I don't think we gave away anything. They're writing a check for $20 million. They're continuing to distribute an outdated version of the technology, but they can't use it for .Net,\" Sueltz said. \"All in all, it's a very good day for Sun.\"\n\nMicrosoft.Net is the company's software plan in which programs run on a multitude of servers instead of a central machine or a desktop computer. Microsoft is advocating its own Java-like language, C# (pronounced \"C-sharp\"), for the task.\n\nAnalysts say C# offers many features similar to Java. With C#, Microsoft aims to make it easier and faster for software developers to build Web-based software and services, as envisioned in the Microsoft.Net strategy.\n\nAnalysts say C# gives programmers using Microsoft's C++ and Visual Basic languages an alternative to Java. Microsoft's new language includes a universal engine that will allow software developers to use many types of programming languages to write Windows applications, analysts said.\n\nThough Microsoft may clone Java, it won't be allowed to say its products are Java-compatible.\n\n\n\nGartner analysts David Smith, Daryl Plummer and Mark Driver say enterprises should not view the recent legal settlement as an official declaration of peace between Microsoft and Sun but rather as a cease-fire on the Java legal front. see commentary\n\nMicrosoft still has power, however. Sun's Rich Green, general manager of Java Software at Sun, said the company could have prohibited Microsoft from distributing even an older version of Java. But the company chose not to because that would hurt Java programmers. In other words, they wouldn't be able to assume Windows machines had Java capability.\n\nAllowing Microsoft to ship the older version is just a crutch until the widespread distribution for the latest version is a reality. Having version 1.1.4 shipping on new Windows computers \"allows (the transition) to proceed gracefully,\" Green said.\n\nMeanwhile, Sun and IBM will continue to release the newest versions of Java for Microsoft operating systems, Sun executives said. Moving Java features to the servers instead of Web browsers has allowed Sun to advance Java despite the problems with Microsoft, they said.\n\nIronically, the Java battleground has shifted away from the desktop, where Sun and Microsoft are most fiercely pitted against each other. In the years since the lawsuit was filed, Sun has succeeded in spreading Java to servers and has begun adding it to gadgets such as Palm handheld computers and cell phones.\n\nA Microsoft representative said the dispute lingered for too long. \"We don't think anyone wins, but considering the lawsuit has been ongoing for three years, this is a good conclusion to this controversy,\" said Microsoft spokesman Jim Cullinan.\n\nWith the deal struck, Cullinan said Microsoft will be allowed to continue to offer its existing Java products, including its popular J++ development tool, for the next seven years. Microsoft product manager Tony Goodhew said the company will include J++ as a separate CD with the next version of Visual Studio.\n\nCullinan, however, blamed Sun for the lawsuit and maintained Microsoft's stance that Sun was trying to stop Microsoft's innovative work with Java.\n\n\"They have harmed consumers and developers by trying to reduce choice and the availability of technology,\" he said. \"They decided to go to court and try to compete on the issue.\"\n\n\"There isn't really a clear winner or loser in this settlement,\" said Gartner Group analyst David Smith, \"but when one company pays the other money, the payee has more of a legitimate claim to victory.\"\n\nSmith noted that in the long term, developers will be the ultimate winner. \"This is a cease-fire, but not peace,\" he said. \"Microsoft has been feeling increasingly strong pain for not having a Java plan.\"\n\nSmith said he believes it is unlikely that Microsoft will strike a new agreement with Sun for the latest version of Java, called J2EE. But Gartner believes that Microsoft will come around to support some of the new technologies that are part of J2EE, such as JSP (Java Server Pages) servlets, said Smith. Staff writer Mary Jo Foley contributed to this report."}, {"url": "https://news.microsoft.com/exec/satya-nadella/", "page_content": "Satya Nadella is Chairman and Chief Executive Officer of Microsoft. Before being named CEO in February 2014, Nadella held leadership roles in both enterprise and consumer businesses across the company.\n\nJoining Microsoft in 1992, he quickly became known as a leader who could span a breadth of technologies and businesses to transform some of Microsoft’s biggest product offerings.\n\nMost recently, Nadella was executive vice president of Microsoft’s Cloud and Enterprise group. In this role he led the transformation to the cloud infrastructure and services business, which outperformed the market and took share from competition. Previously, Nadella led R&D for the Online Services Division and was vice president of the Microsoft Business Division. Before joining Microsoft, Nadella was a member of the technology staff at Sun Microsystems.\n\nOriginally from Hyderabad, India, Nadella lives in Bellevue, Washington, with his family. He earned a bachelor’s degree in electrical engineering from Mangalore University, a master’s degree in computer science from the University of Wisconsin – Milwaukee and a master’s degree in business administration from the University of Chicago. Nadella serves on the board of trustees to his alma mater the University of Chicago, as well as the Starbucks board of directors."}, {"url": "https://www.theladders.com/career-advice/microsoft-ceo-satya-nadella", "page_content": "Satya Nadella took over the reins of Microsoft in 2014 during a time of turmoil for the company. Since then, Nadella has implemented a variety of changes to the company, which has seen a massive improvement in stock position since the change of power. Through open-source software projects, partnering with competitors, scaling back on first-party mobile ambitions, and centering the company around one main mission, Microsoft has held its spot as major tech competitor.\n\nLearn all about Microsoft CEO Satya Nadella, the engineer and businessman behind the company’s resurgence.\n\nWhere is Satya Nadella from?\n\nSatya Nadella was born in Hyderabad, India on Aug. 19, 1967. In 1984, Nadella traveled to the United States to study at the University of Wisconsin-Milwaukee.\n\nHe now lives in Bellevue, Washington, which is a city located across Lake Washington from Seattle. Microsoft’s headquarters is in Redmond, Washington, but the company also has offices in Bellevue.\n\nWhat is Satya Nadella’s net worth?\n\nIn February, CNBC estimated Nadella’s networth to be a little over $320 million.\n\nSatya Nadella’s career path\n\nSun Microsystems\n\nNadella began his post-college career at Sun Microsystems, a company that sold computers, software, and information technology services. The company was acquired by the Oracle Corporation on Jan. 7, 2010 for $7.4 billion.\n\nMicrosoft\n\nNadella joined Microsoft in 1992 as a young engineer when Bill Gates was still CEO. His first projects at the company included the unsuccessful interactive-TV product and the Windows NT operating system.\n\nNadella secured his first executive role in 2000 as vice president of Microsoft bCentral, which was a set of web services for small businesses that included hosted website-hosting and email.\n\nIn 2001 Nadella got a promotion to corporate Vice President of Microsoft Business Solutions. This group was formed through a number of acquisitions, including Great Plains, a company that made accounting software for small and midsize businesses. The group was also working on a project to build a cloud-based CRM. These products were eventually rebranded as “Dynamics.”\n\nBy 2007 Nadella was the senior Vice President of Microsoft Online Services, which not only put him in charge of Bing but the early versions of Microsoft Office and Xbox Live as well.\n\nIn February 2011 Nadella was promoted to president of the Server and Tools Division, which oversaw products for companies’ data centers like Windows Server and the SQL Server database. This department also oversaw the Azure cloud platform. When he took over this area it was doing $16.6 billion in revenue. In two years, by 2013, Nadella raised that number to $20.3 billion.\n\nNadella officially became CEO of the company on Feb. 4, 2014, after the previous head, Steve Ballmer, announced his resignation in August 2013. Ballmer and Bill Gates picked Nadella to pull the company up from the hard times that had hit.\n\nNadella swept in and enacted swift changes to the company. Examples of big changes include:\n\nEmbracing Linux operating system (a rival) on the Azure cloud Releasing Microsoft Office for Apple’s iPad Buying Mojang (the company that created Minecraft) Releasing iPhone and Android apps like Microsoft Outlook Skipping Windows 9 and releasing an extremely improved Windows 10 Introducing the company’s first laptop (Microsoft Surface Book) Aligning the company behind one mission, which is to empower companies and individuals to achieve more\n\nNadella is a board member of Fred Hutch and Starbucks and a member of the board of trustees at the University of Chicago.\n\nSatya Nadella’s education history\n\nNadella attended the Hyderabad Public School, Begumpet before going on to the Manipal Institute of Technology, which was then part of Mangalore University, in Karnataka. He received his bachelor’s degree in electrical engineering from the university in 1988.\n\nNadella then earned his master’s of science in computer science at the University of Wisconsin-Milwaukee in 1990. He later received his MBA from University of Chicago Booth School of Business.\n\nSatya Nadella’s family\n\nNadella married his wife, Anupama, in 1992. Anupama is the daughter of Nadella’s father’s Indian Administrative Service batchmate. The couple has three children, one son named Zain and two daughters.\n\n“Hit Refresh” by Satya Nadella\n\nIn 2017 Nadella released his first book, “Hit Refresh.” The book’s descriptions states that it’s about “the quest to rediscover Microsoft’s soul and imagine a better future for everyone.”\n\n“At the core, ‘Hit Refresh,’ is about us humans and the unique quality we call empathy, which will become ever more valuable in a world where the torrent of technology will disrupt the status quo like never before,” Nadella wrote in the book.\n\n“Satya has charted a course for making the most of the opportunities created by technology while also facing up to the hard questions,” wrote Bill Gates in the foreword of the book.\n\nSatya Nadella’s list of recommended books\n\n“AI Superpowers: China, Silicon Valley, and the New World Order” by Kai-Fu Lee\n\n“Nonviolent Communication” by Marshall B. Rosenberg\n\n“The Great Convergence” by Richard Baldwin\n\n“Deep Learning” by Ian Goodfellow, Yoshua Bengio, Aaron Courville\n\n“The Great Transformation” by Karl Polanyi\n\n“The Rise and Fall of American Growth: The U.S. Standard of Living since the Civil War” by Robert J. Gordon\n\n“The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics” by Daniel James Brown\n\n“Leonardo da Vinci” by Walter Isaacson\n\n“Dawn of the New Everything: Encounters with Reality and Virtual Reality” by Jaron Lanier\n\n“Evicted: Poverty and Profit in the American City” by Matthew Desmond\n\n“Mindset: The New Psychology of Success” by Carol S. Dweck\n\nBest Satya Nadella quotes\n\nAbout being a leader\n\n“There is something only a CEO uniquely can do, which is set that tone, which can then capture the soul of the collective.”\n\n“A leader must see the external opportunities and the internal capability and culture, and all of the connections among them and respond to them before they become obvious parts of the conventional wisdom.”\n\nAbout innovation\n\n“If you don’t have a real stake in the new, then just surviving on the old – even if it is about efficiency – I don’t think is a long-term game.”\n\n“Longevity in this business is about being able to reinvent yourself or invent the future.”\n\nAbout success\n\n“Success can cause people to unlearn the habits that made them successful in the first place.”\n\n“Always keep learning. You stop doing useful things if you don’t learn. So the last part to me is the key, especially if you have had some initial success. It becomes even more critical that you have the learning ‘bit’ always switched on.”\n\nAbout life\n\n“The view you adopt for yourself profoundly affects the way you lead your life.”\n\n“We needed to convert Nietzsche’s courage in the face of reality, into courage in the face of opportunity.”\n\nAbout technology\n\n“We needed to build deeper empathy for our customers and their unarticulated and unmet needs. It was time to hit refresh.”\n\n“Technologies will come and go, so you need to be able to both ask and answer the question: What do you do as a company, why do you exist?”"}], "Ted Childs left Microsoft in 1989": [{"url": "https://learn.microsoft.com/en-us/shows/history/history-of-microsoft-1989", "page_content": "Episode\n\nFor Microsoft, 1989 brings the availability of Office for the Macintosh, Steve Ballmer is promoted to Senior Vice President and we announce the availability of Microsoft Flash File System, a file system for Intel's flash memory technology.\n\nPrevious Episodes: The History of Microsoft - 1975 The History of Microsoft - 1976\n\nThe History of Microsoft - 1977\n\nThe History of Microsoft - 1978\n\nThe History of Microsoft - 1979\n\nThe History of Microsoft - 1980 The History of Microsoft - 1981\n\nThe History of Microsoft - 1982\n\nThe History of Microsoft - 1983\n\nThe History of Microsoft - 1984\n\nThe History of Microsoft - 1985 The History of Microsoft - 1986\n\nThe History of Microsoft - 1987\n\nThe History of Microsoft - 1988\n\n1989 Revenue/Headcount\n\nThe 1989 fiscal year-end sales total $804,530,000. The 1989 fiscal Year employee headcount totals 4,037people.\n\nOfficial Subsidiaries Launched:\n\nMicrosoft Informatica Limitada (Brazil), Microsoft Israel, Ltd., Microsoft AG (Switzerland), Microsoft N.V. (Belgium), Microsoft Taiwan Corporation, Microsoft Puerto Rico, Inc.\n\nSales Office established: Microsoft Hong Kong, Israel (Tel Aviv)\n\nJanuary 20, 1989\n\nThe Microsoft Road Show opens in Seattle, Washington, the first of 10 stops around the country. Dealers and corporate executives have a chance to try nine different applications, get a peek at three unreleased products and attend specialty seminars on Excel and Word. *I think there is a video*\n\nJanuary 25, 1989\n\nMicrosoft unveils the promotional campaign for Excel for Windows, targeting users who are considering purchasing or upgrading to future releases of Lotus 1-2-3. The campaign includes an exchange offer for 1-2-3 users, free evaluation copies, and nationwide Excel seminars.\n\nFebruary 15, 1989 Microsoft and The Santa Cruz Operation, Inc. announce that Microsoft will make a minority investment of less than 20 percent in SCO, the world's leading developer and publisher of UNIX System software. Since 1981 the two companies have worked together to develop and market XENIX, the first commercial version of the UNIX operating system.\n\nMarch 27, 1989\n\nMicrosoft hosts the Fourth International Conference on CD-ROM, \"Seeing Is Believing,\" in Anaheim, California. Among the innovations this year are an on-site electronic mail system; simultaneous translation of all sessions into Japanese via a wireless headset system; and a CD-ROM Industry Yearbook.\n\nMay 3, 1989\n\nMicrosoft and Ashton-Tate announce the shipment of the Microsoft SQL Server 1.0. The product is the result of a joint development effort of Ashton-Tate, Microsoft, and Sybase. SQL Server is a powerful, relational database server for PC-based Local Area Networks (LANs).\n\nMay 3, 1989\n\nSteve Ballmer is promoted to Senior Vice President. He had been Vice President of Systems Software since 1984. He will report to Jon Shirley, President.\n\nJune 5, 1989\n\nMicrosoft forms the Multimedia Division, dedicated to the development and marketing of multimedia systems software and consumer products.\n\nJune 19, 1989 Office for the Macintosh is available. Macintosh applications include: Word 4.00, Excel 2.20, PowerPoint 2.01, and Mail 1.37. The four applications provide the tools to perform essential business tasks of most business professionals. *this is first version of Office*\n\nJune 26, 1989\n\nMicrosoft Mouse sales surpass two million units, twice the number sold less than one year ago. It took Microsoft five years to ship the first million units, but it has taken only one year to ship the second million. In August, Microsoft introduced a re-designed product that has accounted for 1.5 million of the total units.\n\nJuly 18, 1989\n\nThe Usability Group opens its new in-house testing facilities with an open house to demonstrate usability procedures and showcase a range of new data-collection equipment. The usability group tests interfaces, documentation, and instructional materials.\n\nJuly 25, 1989\n\nThe first Financial Analyst Meeting is hosted at the Corporate Campus. Speakers include: Jon Shirley, Bill Gates, Frank Gaudette, Mike Maples, Jeremy Butler, and Scott Oki.\n\nAugust 1, 1989 Microsoft announces OnLine Plus, a comprehensive software support service that gives corporations priority access to senior technical support staff. The service includes unlimited telephone access through a private phone number and electronic access to high-level support personnel and an extensive database of product information.\n\nAugust 18, 1989 The Microsoft Velvet Sweatshop logo sweatshirts are created in response to a Seattle Times cover article intended to reveal the true working environment at Microsoft. The article alleges that employees are working long and dedicated hours that preclude any personal life.\n\nAugust 31, 1989 A complete Chinese MS-DOS® version 3.21 will be provided to licensed OEMs and shipped in the future by representatives in Taiwan. As a service to users in Taiwan, a retail version of the Chinese MS-DOS operating system will be made available to end users on a temporary basis. This will be the first time a retail version of MS-DOS had been made available directly to customers.\n\nSeptember, 1989\n\nBuilding 11, which will house all of MIS and Corporate Systems, will be finished and occupied during the first two weeks of September 1989. This 83,000-square-foot. structure will feature state-of-the-art equipment, including an uninterruptable power system for those systems housed within it. *First DATA CENTER*\n\nOctober 3, 1989\n\nMicrosoft announces the availability of Microsoft Flash File System, a file system for Intel's flash memory technology. This system allows MS-DOS to support new memory storage devices as well as traditional storage media. It allows the MS-DOS end-user to use flash memory in exactly the same way as a conventional disk drive. Microsoft will license the Flash File System in binary form to OEMs.\n\nDecember 27, 1989\n\nMicrosoft announces that Jon Shirley will retire as president and chief operating officer on June 30, 1990. Shirley, president since August of 1983, will continue to play a role in the management of the company as a member of the Board of Directors and as a consultant for strategic projects.\n\nOther Products Released in 1989:\n\nQuick C Compiler 2.0, OS/2 LAN Manager 1.21, Programmer’s Library 1.10, Word 4.0 for Mac, QuickC Compiler with QuickAssembler 2.01, Quick PASCAL Compiler 1.0, FORTRAN Optimizing Compiler 5.0, Word 5.0 for MS-DOS & OS/2, OS/2 Presentation Manager Toolkit 1.0, Excel Mac 2.2, Microsoft Mail 2.0, Software Development Kit for Gateways (MS Mail), Software Development Kit for Applications (MS Mail), Software Development Kit for HyperCard (MS Mail), Works 2.0 for PC, MS-DOS ROM 2.0, Flight Simulator 4.0 for PC, Excel 1.0 for OS/2, Microsoft BASIC Professional Development System 1.0, OS/2 Presentation Manager SDK 2.0.\n\nNotable New Hires: Mike Brown\n\nIn the World:\n\n· End of the Cold War: The New York Times declared the Cold War over as the Berlin Wall came down, East and West Germany discussed reunification, Poland and Czechoslovakia installed non-Communist governments, Lithuania nullified its annexation to the Soviet Union, and the Romanian dictator Nicolae Ceausescu was killed in a violent uprising.\n\n· Bush: George H.W. Bush sworn in as the 41st president of the United States.\n\n· Milli Vanilli: Milli Vanilli won the 1989 Grammy for Best New Artist. The award was later revoked when it was discovered that their entire album was lip-synched.\n\n· Tiananmen: China imposed martial law as pro-democracy demonstrators occupied Tiananmen Square in Beijing.\n\n· New chip: Intel introduced the 80486 microprocessor.\n\n· Earthquake: The 6.9 magnitude Loma Prieta earthquake hit the Bay Area, setting the Marina district of San Francisco ablaze, collapsing double-deck roadways on I-880 and the Oakland-Bay Bridge, and delaying Game 3 of the Oakland-San Francisco World Series.\n\n· Panama: American troops invaded Panama and ousted dictator Manuel Noriega.\n\n· Afghanistan: The Soviet Union withdrew its last troops from Afghanistan, after a nine-year attempt to impose a Communist government.\n\n· Today at Microsoft: The Today Show taped in Seattle and featured Microsoft. Bill Gates discussed the role of CD-ROMs and graphics in personal computers.\n\n· Exxon Valdez: The tanker Exxon Valdez ran aground in Prince William Sound, Alaska, causing the largest oil spill in North American history. 11 million gallons of crude oil contaminated over 1,200 miles of shoreline.\n\n· Steroids: Canadian Ben Johnson, gold medal sprinter at the 1988 Seoul Olympics, admitted that he had used steroids and was stripped of his medal.\n\n· Hirohito: Emperor Hirohito of Japan died at age 87. He was succeeded by his son, Akihito.\n\n· Rushdie Condemned: Iran’s Ayatollah Khomeini declared Salman Rushdie’s novel “The Satanic Verses” blasphemous and offered a $1 million bounty for his death. Rushdie went into hiding in England.\n\n· Hurricane Hugo hits Carolinas: With winds up to 160 MPH and a 20 foot storm surge, Hugo killed 82 and was one of the costliest hurricanes in US history.\n\n· Peace: The Dalai Lama won the Nobel Peace prize.\n\n· Movies: Top grossing movies of the year included “Batman,” “Indiana Jones and the Last Crusade,” “Look Who's Talking,” and “Honey, I Shrunk the Kids.” “Rain Man” netted Oscars for Best Movie, Best Actor (Dustin Hoffman), and Best Director (Barry Levinson).\n\n· The COMPAQ LTE family of personal computers are the first notebook-sized portables to offer full functionality.\n\n\"Wheel of Fortune\" is the top syndicated TV show"}, {"url": "https://www.thehistorymakers.org/biography/ted-childs-jr", "page_content": "Diversity strategist J.T. (Ted) Childs, Jr. was born on November 26, 1944 in Springfield, Massachusetts to John and Clara Childs. He graduated from Classical High School in 1962, and received his B.A. degree in psychology from West Virginia State University in 1967.\n\n\n\nUpon graduation, Childs joined IBM as a personnel administration trainee. He went on to work in several staff and managerial positions at IBM, including program manager of personnel operations. He was subsequently appointed IBM's vice president of global workforce diversity, where he oversaw the company's diversity programs and policies. From March of 1983 to September of 1984, Childs served as executive assistant to Dr. Benjamin L. Hooks, executive director of the NAACP, on an IBM Social Service Leave. In 1989, he was appointed by Governor Mario Cuomo to the New York State Governor’s Advisory Council on Child Care; and, in 1995, Childs was appointed as an official delegate to the White House Conference on Aging. In 1997, U.S. Treasury Secretary, Robert E. Rubin, appointed Childs as an advisor to the Secretary’s Working Group on Child Care. In 2006, Childs retired from IBM and founded the consulting firm, Ted Childs, LLC, where he serves as a strategic diversity advisor.\n\n\n\nChilds is a member of the board of trustees, and past chair of the West Virginia State University Foundation. He is a member of the Executive Leadership Council (ELC); The Families and Work Institute board of directors; was installed as a Fellow of The National Academy of Human Resources in 2001; and has served as co-chair of the National Council of Jewish Women’s Work Family Advisory Board. Childs holds life memberships in the National Association of African Americans in Human Resources, The National Council of Negro Women, Inc., The National Organization of Women (NOW), Omega Psi Phi Fraternity, Inc., the NAACP, the Sierra Club, and the Bass Anglers Sportsmen Society.\n\n\n\nIn 1997, Childs was named by Working Mother magazine as one of the 25 Men Friends of the Family who have made it easier for working parents to raise and nurture children. In 1998, the National Association of Child Care Resource and Referral Agencies presented Joan Lombardi, U.S. Senators Ted Kennedy and Orrin Hatch, and Childs with its Lifetime Achievement Award. Childs also received the Corporate Leadership Award from the Human Rights Campaign in 2003, the Work/Life Legacy Award from the Families and Work Institute in 2004, and the Trailblazers in Diversity Award from the Chief Diversity Officer’s Forum in 2006. In addition, Working Mother Media announced The Ted Childs Life / Work Excellence Award to be given annually to the individual who by their distinctive performance has contributed to the field of Life / Work in the business community. Childs has received Honorary Doctorate of Humane Letters degrees from Pace University, West Virginia State University and Our Lady of the Elms College.\n\n\n\nTed Childs was interviewed by The HistoryMakers on March 20, 2014."}, {"url": "https://learn.microsoft.com/zh-cn/shows/history/history-of-microsoft-1989", "page_content": "剧集\n\n对于 Microsoft 来说， 1989 年为 Macintosh 带来了 Office 的可用性，Steve Ballmer 被提升为高级副总裁，我们宣布推出 Microsoft 闪存文件系统，这是 Intel 闪存技术的文件系统。\n\n以前的情节：Microsoft 的历史 - 1975Microsoft 的历史 - 1976\n\nMicrosoft 的历史 - 1977\n\nMicrosoft 的历史 - 1978\n\nMicrosoft 的历史 - 1979\n\nMicrosoft 的历史 - 1980Microsoft 的历史 - 1981\n\nMicrosoft 的历史 - 1982\n\nMicrosoft 的历史 - 1983\n\nMicrosoft 的历史 - 1984\n\nMicrosoft 的历史 - 1985 Microsoft 的历史 - 1986\n\nMicrosoft 的历史 - 1987\n\nMicrosoft 的历史 - 1988\n\n1989 年收入/员工人数\n\n1989财年年终销售额总计804，530，000美元。 1989财政年度雇员总数为4 037人。\n\n正式子公司推出：\n\nMicrosoft Informatica Limitada (巴西) 、Microsoft 以色列有限公司、Microsoft AG (瑞士) 、Microsoft N.V. (比利时) 、Microsoft 台湾公司、Microsoft 波多黎各公司。\n\n已建立销售办公室： Microsoft 香港、以色列 (特拉维夫)\n\n1989 年 1 月 20 日\n\nMicrosoft 路演在华盛顿州西雅图开幕，这是全国 10 个车站中的第一站。 经销商和企业高管有机会尝试九种不同的应用程序，了解三个未发布的产品，并参加有关 Excel 和Word的专业研讨会。 *我认为有视频*\n\n1989 年 1 月 25 日\n\nMicrosoft 推出了 Excel for Windows 的促销活动，面向正在考虑购买或升级到 Lotus 1-2-3 未来版本的用户。 该活动包括面向 1-2-3 个用户的交换优惠、免费评估副本和全国性的 Excel 研讨会。\n\n1989 年 2 月 15 日微软和圣克鲁斯行动公司宣布，微软将在SCO（世界领先的 UNIX 系统软件开发商和发行商）进行不到20%的少数投资。 自 1981 年以来，两家公司一起开发和销售 XENIX，这是 UNIX 操作系统的第一个商业版本。\n\n1989年3月27日\n\nMicrosoft 在加利福尼亚州阿纳海姆主办了第四届 CD-ROM 国际会议，“看到是相信”。 今年的创新包括现场电子邮件系统：通过无线耳机系统将所有会话同时翻译成日语;和 CD-ROM 行业年鉴。\n\n1989年5月3日\n\nMicrosoft 和 Ashton-Tate 宣布交付 Microsoft SQL Server 1.0。 该产品是 Ashton-Tate、Microsoft 和 Sybase 联合开发的结果。 SQL Server 是一个功能强大的关系数据库服务器，适用于基于 PC 的局域网 (LAN) 。\n\n1989年5月3日\n\n史蒂夫·鲍尔默晋升为高级副总裁。 自 1984 年以来，他一直担任系统软件副总裁。 他将向总统乔恩·雪利报告。\n\n1989 年 6 月 5 日\n\nMicrosoft 组成多媒体部门，致力于多媒体系统软件和消费产品的开发和营销。\n\n1989 年 6 月 19 日 Office for macintosh 可用。 Macintosh 应用程序包括：Word 4.00、Excel 2.20、PowerPoint 2.01 和 Mail 1.37。 这四个应用程序提供了执行大多数业务专业人员的基本业务任务的工具。 *这是 Office 的第一个版本*\n\n1989 年 6 月 26 日\n\nMicrosoft 鼠标销量超过 200 万台，是不到一年前销量的两倍。 Microsoft 花了五年时间才交付第一百万个单位，但只花了一年时间就交付了第二百万个单位。 8月，Microsoft 推出了一款经过重新设计的产品，已占总单位的 150 万台。\n\n1989年7月18日\n\n可用性组使用开放中心打开其新的内部测试设施，以展示可用性过程并展示一系列新的数据收集设备。 可用性组测试接口、文档和教学材料。\n\n1989年7月25日\n\n第一次财务分析师会议在企业校园举行。 演讲者包括：Jon Shirley、Bill Gates、Frank Gaudette、Mike Maples、Jeremy Butler 和 Scott Oki。\n\n1989 年 8 月 1 日 Microsoft 宣布推出 OnLine Plus，这是一项全面的软件支持服务，可让公司优先访问高级技术支持人员。 服务包括通过专用电话号码进行无限制的电话访问，以及通过电子方式访问高级支持人员和广泛的产品信息数据库。\n\n1989 年 8 月 18 日 Microsoft Velvet Sweatshop 徽标运动衫是针对西雅图时报封面文章创建的，旨在揭示 Microsoft 真实工作环境。 文章声称，员工工作时间长，敬业，排除了任何个人生活。\n\n1989 年 8 月 31 日 完整的中文 MS-DOS® 版本 3.21 将提供给获得许可的 OEM，将来由台湾的代表发货。 作为对台湾用户的服务，中国MS-DOS操作系统的零售版本将临时提供给最终用户。 这是首次直接向客户提供 MS-DOS 的零售版本。\n\n1989年9月\n\n11号楼将容纳所有MIS和企业系统，将在1989年9月的前两周内完工并占用。 这83，000平方英尺。 结构将具有最先进的设备，包括一个不间断的电力系统，用于其中容纳的系统。 *First DATA CENTER*\n\n1989 年 10 月 3 日\n\nMicrosoft 宣布推出 Microsoft 闪存文件系统，这是 Intel 闪存技术的文件系统。 此系统允许 MS-DOS 支持新的内存存储设备以及传统的存储媒体。 它允许 MS-DOS 最终用户以与传统磁盘驱动器完全相同的方式使用闪存。 Microsoft 将以二进制形式将闪存文件系统许可给 OEM。\n\n1989年12月27日\n\nMicrosoft 宣布 Jon Shirley 将于 1990 年 6 月 30 日辞去总裁兼首席运营官一职。 雪莉，自1983年8月以来的总裁，将继续在公司的管理中扮演一个角色，作为董事会成员和战略项目的顾问。\n\n1989 年发布的其他产品：\n\nQuick C Compiler 2.0，OS/2 LAN Manager 1.21，程序员库 1.10，Word 4.0 for Mac，QuickC Compiler with QuickAssembler 2.01， Quick PASCAL Compiler 1.0、FORTRAN Optimizing Compiler 5.0、Word 5.0 for MS-DOS & OS/2、OS/2 Presentation Manager Toolkit 1.0、Excel Mac 2.2、Microsoft Mail 2.0、用于网关的软件开发工具包 (MS Mail) 、Software Development Kit for Applications (MS Mail) ， 适用于 HyperCard 的软件开发工具包 (MS Mail) 、Works 2.0 for PC、MS-DOS ROM 2.0、Flight Simulator 4.0 for PC、Excel 1.0 for OS/2、Microsoft BASIC Professional Development System 1.0、OS/2 Presentation Manager SDK 2.0。\n\n值得注意的新员工：迈克·布朗\n\n在世界：\n\n·冷战结束：《纽约时报》宣布冷战结束，柏林墙倒下，东德和西德讨论统一问题，波兰和捷克斯洛伐克建立了非共产主义政府，立陶宛宣布放弃对苏联的吞并，罗马尼亚独裁者尼古拉·乔塞斯库在暴力起义中丧生。\n\n·布什：乔治·布什宣誓就任美国第41任总统。\n\n·米莉·瓦尼利：米莉·瓦尼利获得1989年格莱美最佳新艺术家奖。 后来，当发现他们的整张专辑都嘴唇同步时，该奖项被撤销了。\n\n·天安门：中国实行戒严，因为民主示威者占领了北京的天安门广场。\n\n·新芯片：Intel 引入了 80486 微处理器。\n\n·地震：里氏6.9级的洛玛·普里埃塔地震袭击了湾区，使旧金山滨海区起火，I-880和Oakland-Bay桥的双层道路坍塌，并推迟了Oakland-San弗朗西斯科世界系列赛的第三场比赛。\n\n·巴拿马：美军入侵巴拿马，推翻独裁者曼努埃尔·诺列加。\n\n·阿富汗：苏联在九年试图建立共产主义政府之后，从阿富汗撤出了最后一支军队。\n\n·今天在 Microsoft：今日秀在西雅图录音，并特别推荐 Microsoft。 比尔·盖茨讨论了CD-ROMs和图形在个人电脑中的作用。\n\n·埃克森·巴尔德斯：油轮埃克森·巴尔德斯在阿拉斯加的威廉王子湾搁浅，造成北美历史上最大的漏油事件。 1100万加仑原油污染了1200多英里的海岸线。\n\n·类固醇：1988年汉城奥运会金牌短跑运动员加拿大人本·约翰逊承认自己曾使用过类固醇，并被剥夺了奖牌。\n\n·裕仁：日本裕仁天皇去世，享年87岁。 他由他的儿子明仁接替。\n\n·拉什迪谴责：伊朗的阿亚图拉·霍梅尼宣布萨勒曼·拉什迪的小说《撒旦诗句》是亵渎的，并为他的死提供100万美元的赏金。 拉什迪躲在英国。\n\n·雨果飓风袭击卡罗来纳州：风速高达每小时160英里，风暴潮20英尺，雨果造成82人死亡，是美国历史上最贵的飓风之一。\n\n·和平：达赖喇嘛获得诺贝尔和平奖。\n\n·电影： 年度票房最高的电影包括“蝙蝠侠”，“印第安纳琼斯和最后的十字军东征”，“看谁在说话”和“亲爱的，我缩水的孩子”。 《雨人》获得奥斯卡最佳电影奖、最佳男主角 (达斯汀·霍夫曼·) 和最佳导演 (巴里·莱文森) 。\n\n·COMPAQ LTE 系列个人计算机是第一款提供完整功能的笔记本大小的便携式计算机。\n\n《财富之轮》是顶级联合电视节目"}, {"url": "https://learn.microsoft.com/en-us/shows/history/history-of-microsoft-1988", "page_content": "Episode\n\nFor Microsoft, 1988 announces Microsoft OnLine a two-way electronic support service, offering a complete package of technical support and service solutions. Microsoft Mouse sales top the one million mark, less than one year after hitting the ½ million mark and the \"Making It All Make Sense\" advertising campaign is launched.\n\nPrevious Episodes: The History of Microsoft - 1975 The History of Microsoft - 1976\n\nThe History of Microsoft - 1977\n\nThe History of Microsoft - 1978\n\nThe History of Microsoft - 1979\n\nThe History of Microsoft - 1980 The History of Microsoft - 1981\n\nThe History of Microsoft - 1982\n\nThe History of Microsoft - 1983\n\nThe History of Microsoft - 1984\n\nThe History of Microsoft - 1985 The History of Microsoft - 1986 The History of Microsoft - 1987\n\n1988 Revenue/Headcount\n\nThe 1988 fiscal year-end sales total $590,827,000. The 1988 fiscal Year employee headcount totals 2,793people.\n\nOfficial Subsidiaries Launched: Microsoft CH (Korea, sales office was established in 1983)\n\nJanuary 13, 1988\n\nMicrosoft and Ashton-Tate announce Microsoft SQL Server, a relational database server software product for Local Area Networks (LANs) based on a relational database management system licensed from Sybase.\n\nApril 8, 1988\n\nManufacturing and Distribution move to the new Canyon Park industrial complex, a 245,000-square foot facility in Bothell, Washington.\n\nJune 14, 1988\n\nMicrosoft hires Mike Maples, previously with IBM, as vice president of the Applications Software Division.\n\nJune 15, 1988\n\nMicrosoft announces Microsoft OnLine, a two-way electronic support service, offering a complete package of technical support and service solutions. Users can send questions or requests for service directly to Microsoft support engineers, take part in discussions, and access a special Microsoft database that contains answers to previously solved problems.\n\nJune 20, 1988\n\nMicrosoft Mouse sales top the one million mark, less than one year after hitting the ½ million mark.\n\nAugust 19, 1988\n\nA new Out-Of-Office notification feature for XENIX e-mail is offered to Microsoft employees. Anyone who sends e-mail will receive an automatic message that the employee is out of the office, plus any instructions the employee may wish to include in the message.\n\nSeptember 1, 1988\n\nMicrosoft restructures the Applications Division into five business units, designed to streamline product development and prepare the Applications Division for its expected growth into the next five years. Each business unit will have an assigned product mission, with responsibility for its products from conception and development through introduction and on-going marketing.\n\nOctober 11, 1988\n\nMicrosoft and five other major software companies announce the formation of the Business Software Association to combat international software piracy, promote strong intellectual property protection, and reduce international trade barriers.\n\nOctober 25, 1988\n\nAn extensive new education program is announced to cover every level of the education market: K-12, colleges and universities, educators, and education software dealers. This major new partnership includes a cooperative hardware/software packaging promotion with IBM; special-priced, academic versions of selected Microsoft software and a new dealer program.\n\nOctober 31, 1988\n\nMicrosoft and IBM release the jointly developed OS/2 1.1 with Presentation Manager.\n\nNovember 1, 1988\n\nThe \"Making It All Make Sense\" advertising campaign is launched. It will stress: vision, technical brilliance, business practicality, and commitment to customers.\n\nDecember 6, 1988\n\nA new Microsoft Product Support Center opens in Bellevue, Washington. The 49,000-square-foot facility, located at Lincoln Plaza in Bellevue, incorporates the latest technology and design features. The new facility is completely dedicated to and houses 250 staff members of the Product Support Services Division of Microsoft.\n\nDecember 6, 1988\n\nMicrosoft to Package Software Specially for Education.\n\nMicrosoft announces plans to release Academic Editions of Works, Word, Excel and PowerPoint for the Macintosh that will sell at a reduced rate through the Authorized Education Dealer Program.\n\nDecember 9, 1988\n\nMike Maples and Steve Ballmer swim \"Lake Bill\" as a result of a challenge Mike issued to Steve during the 1988 United Way campaign to see whose group could raise the most money. The competition between the Applications and Systems divisions raised $152,506 for United Way. Applications won the contest on the basis of the highest percentage of participation, but Systems was the big money winner of the two, so both were required to swim. Ballmer jumped into the lake wearing swim trunks, while Maples jumped into the lake in his suit and tie, which covered a wet suit.\n\nOther Product Released in 1988: Learning DOS 2.0, Microsoft Stat Pack on CD-ROM, MS-DOS 4.01, Small Business Consultant 1.0 on CD-ROM, SQL Server Network Developers Kit 1.0, Excel for OS/2, Word 5.0 for PC, Quick Basic 4.5, Excel for Windows 2.1, OS/2 Software Development kit 1.2, Microsoft Programmer’s Library on CD-ROM, Quick Basic 1.0 for Mac, MS-DOS CD-ROM Extensions 2.0, COBOL Optimizing Compiler 3.0, Flight Simulator 3.0 for PC, PowerPoint 2.01 for Mac, Learning DOS 2.0, Stat Pack 1.0\n\nNotable New Hires: David Cutler\n\nIn the World:\n\n· Voyager: The experimental airplane Voyager, piloted by Dick Rutan and Jeana Yeager, completes the first nonstop, round-the-world flight without landing for refueling.\n\n· Gorbachev: Mikhail Gorbachev introduces his domestic policy called glasnost, allowing greater freedoms of information and speech in the Soviet Union.\n\n· \"Phantom of the Opera\" opened at the Majestic Theater in New York City for more than 4,000 performances.\n\n· Whales: Two grey whales freed from frozen Arctic in Barrow, Alaska, thanks to the efforts of a US-Soviet rescue team.\n\n· Israel: PLO proclaims State of Palestine and recognized Israeli existence.\n\n· Cease Fire: Cease fire between Iran and Iraq takes effect after 8 years of war.\n\n· Peace: United Nations peacekeeping forces win the Nobel Peace prize.\n\n· Ted Turner: Ted Turner starts Turner Network Television (TNT) and buys MGM's film library.\n\n· CDs: Compact discs outsell vinyl records for the first time.\n\n· Election: George Bush beats Michael Dukakis in the US presidential election, sweeping 40 states in the Electoral College.\n\n· Olympics: The Summer Olympic Games are held in Seoul, South Korea.\n\n· Undersea Tunnel: The longest traffic tunnel in the world opens between Aomori on the Honshu Island and Hakidate in Hokkaido, Japan. The railroad tunnel, called \"Seikan,\" is 33.44 miles long and is as deep as 787 feet below water at one point.\n\n· Aloha Flight 243: On a flight between Hilo and Honolulu, Hawaii, an Aloha Airlines Boeing 737 loses several yards of its upper fuselage. The craft lands with only one fatality.\n\n· World Expo ‘88: World Expo ’88 opens in Brisbane Queensland, Australia. The exhibition runs for 6 months, hosting pavilions from over 70 countries.\n\n· Baseball: The LA Dodgers defeat the Oakland A’s, 4-1, in the World Series.\n\n· Sonny Bono: Former pop singer Sonny Bono is elected mayor of Palm Springs, California.\n\n· Free-Trade Agreement: Canadian Prime Minister Brian Mulroney and President Reagan signed the Canada-US free trade agreement.\n\n· Academy Awards: “The Last Emperor,” directed by Bernardo Bertolucci, wins nine Oscars, including awards for Best Picture and Best Director\n\n· The Business Software Association (BSA) is founded to combat software piracy through education and legislation.\n\n· A computer virus developed by a 23-year-old attacks more than 6,000 computers on the Internet Network.\n\n· The \"Bill Cosby Show\" is America’s favorite TV program."}, {"url": "https://www.hbs.edu/faculty/Pages/item.aspx?num=31782", "page_content": "Abstract\n\nExplores how IBM incorporated diversity into its business strategy, making the case that workforce diversity is critical to marketing its products and services to its customers. In the early 1990s, Ted Childs, vice-president of Workforce Diversity, proposed to CEO Lou Gerstner the creation of eight diversity task forces. Delves into the organizational and cultural impediments to starting a diversity task force initiative and how IBM overcame these obstacles to implement an effective diversity strategy. After the task forces were established, they underwent tremendous growth and became global in scope. Childs also faces the challenge of taking a U.S.-based diversity strategy and applying it to IBM's global organization. Teaching Purpose: To demonstrate how a company can implement an effective diversity strategy and integrate it into its overall business strategy.\n\nKeywords\n\nCitation"}, {"url": "https://www2.bfi.org.uk/films-tv-people/4ce2b9ee8ade9", "page_content": "Executive Producer Series created by\n\n1997\n\nThe Woman in White\n\nWith thanks to"}, {"url": "https://www.howold.co/person/ted-childs", "page_content": "Ted Childs British television director and producer\n\nTed Childs is a 88 years old British television director and producer from Metropolitan Borough of Hackney. He was born on December 26, 1934 in Metropolitan Borough of Hackney as Edward Samuel Childs.\n\nAbout\n\nBiography\n\nEdward Samuel Ted Childs is an English television producer screenwriter and director whose notable works include The Sweeney Kavanagh QC Soldier Soldier Making Waves Inspector Morse and its spin-off Lewis. In 2001 he was the recipient of the Harvey Lee award for outstanding contribution to broadcasting at the 2000 Broadcasting Press Guild awards.\n\nRead full biography\n\nHis real name:\n\nBirth name of Ted Childs is Edward Samuel Childs\n\nYes, Ted Childs is still alive Last check: 1 year ago\n\nWorks\n\nTed Childs Movies (5)\n\nThere are 5 movies of Ted Childs.\n\nHis first feature film was The Woman in Black (1989). He was 54 when he starred in this movie. Since 1989, he has appeared in 5 feature films. The last one is The Waiting Time (1999). .\n\nTed Childs movie characters\n\nView all Ted Childs movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTed Childs TV Shows (8)\n\nHis first TV Show was Van der Valk (1972).\n\nView all Ted Childs TV shows\n\nTed Childs zodiac sign is capricorn.\n\nWhen is Childs's next birthday?\n\nTed Childs was born on the 26th of December 1934 , which was a Wednesday. He will be turning 89 in only 200 days from today (09 June, 2023).\n\nOther facts about Ted Childs"}, {"url": "https://www.imdb.com/seen/nm0157595/", "page_content": "Some parts of this page won't work property. Please reload or try later.\n\nJavaScript Required To use this feature please enable JavaScript or use a browser that supports it.\n\nIMDb Seen: Ted Childs\n\nHow many of these titles with Ted Childs have you seen?\n\nShow: All Roles\n\nDirector Additional Crew Producer Self Sound Department Writer in All Title Types TV episodes TV movies TV series movies TV mini-series TV specials Go"}, {"url": "https://www.imdb.com/filmosearch/?role=nm0157595", "page_content": "45. The Grasscutter (1988 TV Movie)\n\n102 min | Crime\n\n6.5 Rate this 1 2 3 4 5 6 7 8 9 10 6.5 / 10 X\n\nA middle-aged landscaper (the grasscutter) pursues a quiet life in New Zealand, but soon the life he left behind -- in Belfast -- catches up to him in a fast-paced and violent conclusion, all his prior convictions ripped to shreds.\n\nDirector: Ian Mune | Stars: Terence Cooper, Joel Tobeck, Martin Maguire, James Coyle\n\nVotes: 64"}, {"url": "https://sites.psu.edu/jmc7765/2019/10/24/ted-talk-the-windows-and-mirrors-of-your-childs-bookshelf/", "page_content": "Recently, the importance of diversity in entertainment has been broadcast across the country. Movies like Blank Panther and Crazy Rich Asians garnered acclaim for showing non-white stories to be complex and marketable in a historically racist industry.\n\nLike the entertainment field, the book industry has been dominated by white stories. The majority of novels read in school were written by white people about white people. In “The Windows and Mirrors of Your Child’s Bookshelf,” Grace Lin says that people of color lack novels that reflect themselves, or mirrors. Mirrors teach children that they are important. And without these mirrors, people of color are left feeling unvalued. Lost. But books, Lin argues, aren’t only mirrors. They are also windows. Books, like windows, provide views into new, unknown worlds. They teach us not only how to respect but how to appreciate the incredible diversity that exists between us.\n\nI will admit that Lin sounds a bit patronizing at the beginning of her Ted Talk, and I chalk that down to her job as a children’s book writer. But she quickly rebounded, finding herself on stage, and delivered an eloquent, meaningful talk, one that not only calls out a problem but provides an easy, immediate solution.\n\nThroughout the talk, Lin tells the story about grappling with her Taiwanese identity, unable to recognize herself in the books she read nor the mirrors she looked in. And when she mentioned auditioning for Dorothy to her friend for the school play, she was told she couldn’t, because she was Asian. But eventually, when she wrote her own book, Where the Mountain Meets the Moon, children across the country wanted to be the Asian protagonist. Though what sticks with me most from the Ted Talk is words she chooses to use, specifically those used to end her talk: “When you go home, please, look at your child’s bookshelf. Are all the books mirrors, or are all of them windows? Make sure that you have both, because if you do, you’re setting the path for self-worth and empathy, and that is a brick road worth following.”\n\nFrom the Ted Talk, my main takeaways are the following:"}]}