{"Ted Childs was born in San Francisco, California.": [{"url": "https://www.wikiwand.com/en/Ted_Childs", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Ted Childs?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.thehistorymakers.org/biography/ted-childs-jr", "page_content": "Diversity strategist J.T. (Ted) Childs, Jr. was born on November 26, 1944 in Springfield, Massachusetts to John and Clara Childs. He graduated from Classical High School in 1962, and received his B.A. degree in psychology from West Virginia State University in 1967.\n\n\n\nUpon graduation, Childs joined IBM as a personnel administration trainee. He went on to work in several staff and managerial positions at IBM, including program manager of personnel operations. He was subsequently appointed IBM's vice president of global workforce diversity, where he oversaw the company's diversity programs and policies. From March of 1983 to September of 1984, Childs served as executive assistant to Dr. Benjamin L. Hooks, executive director of the NAACP, on an IBM Social Service Leave. In 1989, he was appointed by Governor Mario Cuomo to the New York State Governor’s Advisory Council on Child Care; and, in 1995, Childs was appointed as an official delegate to the White House Conference on Aging. In 1997, U.S. Treasury Secretary, Robert E. Rubin, appointed Childs as an advisor to the Secretary’s Working Group on Child Care. In 2006, Childs retired from IBM and founded the consulting firm, Ted Childs, LLC, where he serves as a strategic diversity advisor.\n\n\n\nChilds is a member of the board of trustees, and past chair of the West Virginia State University Foundation. He is a member of the Executive Leadership Council (ELC); The Families and Work Institute board of directors; was installed as a Fellow of The National Academy of Human Resources in 2001; and has served as co-chair of the National Council of Jewish Women’s Work Family Advisory Board. Childs holds life memberships in the National Association of African Americans in Human Resources, The National Council of Negro Women, Inc., The National Organization of Women (NOW), Omega Psi Phi Fraternity, Inc., the NAACP, the Sierra Club, and the Bass Anglers Sportsmen Society.\n\n\n\nIn 1997, Childs was named by Working Mother magazine as one of the 25 Men Friends of the Family who have made it easier for working parents to raise and nurture children. In 1998, the National Association of Child Care Resource and Referral Agencies presented Joan Lombardi, U.S. Senators Ted Kennedy and Orrin Hatch, and Childs with its Lifetime Achievement Award. Childs also received the Corporate Leadership Award from the Human Rights Campaign in 2003, the Work/Life Legacy Award from the Families and Work Institute in 2004, and the Trailblazers in Diversity Award from the Chief Diversity Officer’s Forum in 2006. In addition, Working Mother Media announced The Ted Childs Life / Work Excellence Award to be given annually to the individual who by their distinctive performance has contributed to the field of Life / Work in the business community. Childs has received Honorary Doctorate of Humane Letters degrees from Pace University, West Virginia State University and Our Lady of the Elms College.\n\n\n\nTed Childs was interviewed by The HistoryMakers on March 20, 2014."}, {"url": "https://prabook.com/web/ted.childs/1842074", "page_content": "Ted Childs\n\ndirector producer\n\nDecember 26, 1934 Greater London, England, United Kingdom\n\nHe went on to produce and direct a wide variety of factual programmes and documentary films, including episodes of This Week, then the Independent Television current affairs flagship and also contributed to the acclaimed World At War Series. He was one of the founding fathers of Euston Films, the film production company established by Thames Television in the early 1970s. Whilst there he produced The Sweeney, Special Branch and Quatermass Series, together with a number of theatrical and television films, as well as writing and/or directing films and series episodes for both Independent Television and the British Broadcasting Corporation. In 1984, he was appointed Controller of Drama at Central Television and, subsequently, Managing Director of Central Films. In this dual role, he acted as executive producer on an extensive range of films and series for Independent Television. These included Inspector Morse, Soldier Soldier, Peak Practice, Sharpe, Brother Cadfael, Chancer, Gone to The Dogs, Kavanagh Queen's Counsel and Thieftakers. Following the acquisition of Central Television by Carlton Communications, he opted to assume a freelance role. He continued to write and develop new television drama and films as an executive producer. As such, he was responsible for the Heat Of The Sun Series, the Morse film The Wench Is Dead, the television films: Into the Blue, Goodnight Mr. Tom and The Waiting Time, together with a Kavanagh Queen's Counsel film special, the Monsignor Renard Series and The Remorseful Day, the final episode in the Morse canon. In 2004/5 he was responsible for developing The Brief, a legal series. He acted as executive producer on two series of The Brief. He also acted as executive producer on Lewis, a television format derived from the Morse Series. He was elected a Fellow of the Royal Television Society (RTS) in 1992. He was Chairman of the British Academy of Film and Television Arts (British Academy of Film and Television Arts) in 1994 and 1995. In the same year he was awarded the RTS Baird Medal for outstanding contribution to British Regional Television. In the 1997 New Year’s Honours List, he was made an Officer of the Most Excellent Order of the British Empire for services to Broadcast Television. In July, 2015, the University of Nottingham awarded him the honorary degree of doctor of letters."}, {"url": "https://www.stbons.org/TED-CHILDS-OBE/", "page_content": "TV & FILM PRODUCER\n\nFORMER CHAIR OF BAFTA\n\nTed was born in Hackney in 1934.\n\nThroughout the 1970s, 1980s and 1990s he was responsible for some of the most iconic and famous TV programmes.\n\nThe Sweeney, Minder, Sharpe, Soldier Soldier, Inspector Morse, Lewis, Kavanagh QC, Goodnight Mister Tom are just a sample of the programmes that he produced.\n\nHe had a long working relationship with John Thaw\n\nTed was the chair of BAFTA from 1993 – 1995\n\nTed last visited his old school in 2012 with his friend Terrence\n\nTed On IMDB Nottingham Alumni Laureate Award Video"}, {"url": "https://www.howold.co/person/ted-childs", "page_content": "Ted Childs British television director and producer\n\nTed Childs is a 88 years old British television director and producer from Metropolitan Borough of Hackney. He was born on December 26, 1934 in Metropolitan Borough of Hackney as Edward Samuel Childs.\n\nAbout\n\nBiography\n\nEdward Samuel Ted Childs is an English television producer screenwriter and director whose notable works include The Sweeney Kavanagh QC Soldier Soldier Making Waves Inspector Morse and its spin-off Lewis. In 2001 he was the recipient of the Harvey Lee award for outstanding contribution to broadcasting at the 2000 Broadcasting Press Guild awards.\n\nRead full biography\n\nHis real name:\n\nBirth name of Ted Childs is Edward Samuel Childs\n\nYes, Ted Childs is still alive Last check: 1 year ago\n\nWorks\n\nTed Childs Movies (5)\n\nThere are 5 movies of Ted Childs.\n\nHis first feature film was The Woman in Black (1989). He was 54 when he starred in this movie. Since 1989, he has appeared in 5 feature films. The last one is The Waiting Time (1999). .\n\nTed Childs movie characters\n\nView all Ted Childs movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTed Childs TV Shows (8)\n\nHis first TV Show was Van der Valk (1972).\n\nView all Ted Childs TV shows\n\nTed Childs zodiac sign is capricorn.\n\nWhen is Childs's next birthday?\n\nTed Childs was born on the 26th of December 1934 , which was a Wednesday. He will be turning 89 in only 200 days from today (09 June, 2023).\n\nOther facts about Ted Childs"}, {"url": "http://tedchilds.com/", "page_content": "-- Keith H. Hammonds\n\nFast Company Magazine\n\n… Since 1995, though, IBM has acquired a different look, largely because of Childs’ strategic campaign to overhaul the company’s practices pertaining to hiring and promoting women, ethnic minorities, and other groups that are underrepresented at IBM."}, {"url": "https://prabook.com/web/theodore_francis.childs/646163", "page_content": "Theodore Francis Childs Edit Profile\n\nbiologist educator\n\nTheodore Francis Childs, American biologist, retired educator. Candidate for New York State Senate, 1968. With United States Army, 1944-1946, lieutenant colonel United States Army Reserve, 1946-1981. Member American Physical Therapy Association, Athletic Trainers Association.\n\nBackground Childs, Theodore Francis was born on February 17, 1921 in Jamaica, New York, United States. Son of Andrew W. and Maude (Thompson) Childs.\n\nEducation Bachelor of Science in Biology, Shaw University, 1944. Doctor of Philosophy (honorary), Shaw University, 1964. B.Phys. Therapy, State University Iowa, 1948.\n\n\n\nMaster of Arts, Doctor of Education, Columbia University, 1967.\n\nCareer Director physical theraphy VA, Brooklyn, 1950-1964. Professor health science Long Island University, 1964-1976. Chair School Allied Health Tuskegee (Ala) University, 1976-1981.\n\n\n\nChair department education, professor Talladage (Alabama) College, from 1981. Director United States Committee for Indiana Rehabilitation.\n\nAchievements Theodore Francis Childs has been listed as a noteworthy biologist, educator by Marquis Who's Who.\n\nMembership Candidate for New York State Senate, 1968. With United States Army, 1944-1946, lieutenant colonel United States Army Reserve, 1946-1981. Member American Physical Therapy Association, Athletic Trainers Association."}, {"url": "https://www.britannica.com/place/San-Francisco-California", "page_content": "San Francisco , city and port, coextensive with San Francisco county, northern California , U.S., located on a peninsula between the Pacific Ocean and San Francisco Bay . It is a cultural and financial centre of the western United States and one of the country’s most cosmopolitan cities. Area 46 square miles (120 square km). Pop. (2010) 805,235; San Francisco–San Mateo–Redwood City Metro Division, 1,776,095; San Francisco–Oakland–Fremont Metro Area, 4,335,391; (2020) 873,965; San Francisco–San Mateo–Redwood City Metro Division, 1,638,407; San Francisco–Oakland–Berkeley Metro Area, 4,749,008.\n\nCharacter of the city\n\nSan Francisco holds a secure place in the United States’ romantic dream of itself—a cool, elegant, handsome, worldly seaport whose steep streets offer breathtaking views of one of the world’s greatest bays. According to the dream, San Franciscans are sophisticates whose lives hold full measures of such civilized pleasures as music, art, and good food. Their children are to be pitied, for, as the wife of publishing magnate Nelson Doubleday once said, “They will probably grow up thinking all cities are so wonderful.” To San Franciscans their city is a magical place, almost an island, saved by its location and history from the sprawl and monotony that afflicts so much of urban California.\n\nSince World War II, however, San Francisco has had to face the stark realities of urban life: congestion, air and water pollution, violence and vandalism, and the general decay of the inner city. San Francisco’s makeup has been changing as families, mainly white and middle-class, have moved to its suburbs, leaving the city to a population that, viewed statistically, tends to be older and to have fewer married people. Now more than one of every two San Franciscans is “nonwhite”—in this case African American, East Asian, Filipino, Samoan, Vietnamese, Latin American, or Native American. Their dreams increasingly demand a realization that has little to do with the romantic dream of San Francisco. But both the dreams and the realities are important, for they are interwoven in the fabric of the city that might be called Paradox-by-the-Bay.\n\nAlthough San Franciscans complain of the congestion, homelessness, and high cost of living that plague the city and talk endlessly of the good old days, the majority still think of San Francisco the way poet George Sterling did, as “the cool grey city of love,” one of America’s most attractive, colourful, and distinctive places to live."}, {"url": "https://www.insider.com/julia-child-surprising-facts-2020-8", "page_content": "Julia Child later worked as a central intelligence assistant during World War II and developed a shark repellant used in war.\n\nAfter graduating, moving to New York, and being fired from her job in the advertising department of home furnishings company W. & J. Sloane, Child moved to Washington, DC.\n\nOnce she arrived, she began volunteering as a research assistant for the Office of Strategic Services (OSS), a newly formed government intelligence agency that would eventually become the Central Intelligence Agency (CIA). According to History.com, in her interview notes, the following was written about her: \"Good impression, pleasant, alert, capable, very tall.\"\n\nDuring her time at the OSS, Child developed a shark repellant and facilitated the communication of important, top-secret documents between US government officials and their intelligence officers."}]}