{"Edward Synge was appointed Archbishop of Tuam in 1781.": [{"url": "https://www.dib.ie/biography/synge-edward-a8427", "page_content": "Synge, Edward (1659–1741), clergyman, was born 5 April 1659 at Inishannon, Co. Cork, second son of Edward Synge (qv), later bishop of Cork, Cloyne, and Ross, and his wife Barbara Latham. Edward's elder brother was Samuel Synge (d. 1708), who became dean of Kildare. Synge was educated at the diocesan school, Cork, and in 1674 he went to Christ Church, Oxford. At Oxford he met William Wake, later archbishop of Canterbury, with whom he remained in correspondence throughout his life. He graduated BA in 1677.\n\nSynge's first incumbency was as rector of Laracor, Co. Meath (1682–6). In 1686 he became vicar of Holy Trinity and prebendary of Christ Church, Cork, which he held until 1706. He was also (1691–1714) rector of Rathclarin, Co. Cork, and held other parishes in the diocese of Cloyne. In 1695 William King (qv), then bishop of Dublin, put Synge's name forward for the diocese of Limerick. Synge expressed surprise that he had been considered, but he did not get Limerick, and when he was offered the deanery of Derry in 1699 he refused it on the grounds that his elderly mother could not accompany him. About four years later, the lord lieutenant, the 2nd duke of Ormond (qv) offered him the deanery of St Patrick's on behalf of the crown. However, a dispute between the crown and the chapter as to the right of presentation was only resolved when John Stearne (qv) was appointed dean and Edward Synge became chancellor of St Patrick's and vicar of St Werburgh's, where he was installed in April 1705. In 1714 King recommended Synge for the diocese of Raphoe, and he was consecrated in November that year. He remained at Raphoe for only eighteen months, and in June 1716 he was appointed archbishop of Tuam.\n\nInitially, Synge had resisted his removal from Raphoe, where he was engaged in disputes about presbyterian marriages and a campaign of conversion through education. He saw that there was a great deal of work and expense in Tuam, and there was nowhere to live, as the archbishop's palace had been burnt during the civil war. Tuam had other drawbacks: there were few resident clergy and many parishes were impropriate. Further, there was a long-running problem about the quarta pars episcopalis, that part of the tithes that had augmented the income of the archbishop, and not the parish clergy. It had been proposed to abolish this custom in Tuam, but before the necessary legislation was enacted the documents were lost in the 1641 rebellion. Synge was advised to encourage the Tuam clergy to petition for the abolition of the quarta pars, to supplement the incomes of clergy who were prepared to resign from pluralities, and to provide for parishes that had not been served since the reformation.\n\nOn the growing constitutional crisis arising from the Annesley v. Sherlock case (over the appellate jurisdictions of the Irish house of lords and its British counterpart) Synge told Wake that Ireland was ‘a kingdom (not a county Palatine) exactly formd [sic] according to the model of England . . . ’ (Synge to Wake, 1 Nov. 1717 (Dublin City Library, Gilbert MS 28, f. 100)). With Archbishop King, he opposed actively but unsuccessfully the enactment by the Irish parliament of a toleration act for protestant dissenters. Here again Synge was said to have conducted himself ‘with the greatest warmth and zeal for the nation's honour’ (William Nicholson to Wake, 11 July 1719 (ibid., f. 236). In his speech on the bill, Synge observed that although he had always believed in limited toleration for dissenters, he saw that religion was a continuing cause of strife, wars, and rebellions. Citing the existence of 180 sects in England which had flourished during the civil war, he warned that it should be not thought that these ‘wild sects and parties’ had gone. If the bill were passed, he said, not only the Church of Ireland, but the civil state and even Christianity itself would be put at risk (Edward Synge speech on toleration, MS in private possession). Both Synge and King were out of favour as a result of their opposition to the bill.\n\nSynge acknowledged the difficulty that catholics had in taking the oaths of allegiance and abjuration, excluding them from full rights in a civil society. He believed that catholics and dissenters should be prosecuted only if they posed a real danger to the state, and proposed an oath of allegiance to meet the objections of both Roman Catholics and quakers. During his life, Synge published nearly sixty volumes of sermons and religious tracts, and he is now seen as one of the most influential religious commentators of his time. The Appendix to his Gentleman's religion (1698) is thought by Berman to have been written in answer to John Toland's (qv) Christianity not mysterious (1696). To some extent Synge shared Toland's rationalism and deism, but he rebutted Toland's case that religion possessed no mysteries. With William King, George Berkeley (qv), and Francis Hutcheson (qv), Synge discussed the problem of innate perception, using the analogy of a blind man's understanding of shape and form. In October 1714 he preached a sermon at St Werburgh's which was attacked for advocating deism and which resulted in a sharp exchange of pamphlets. Synge died in Tuam on 24 July 1741, where he was buried.\n\nHe married (1690) Anne, daughter of Nicholas Proude, dean of Clonfert. They had five children, two of whom became bishops. The eldest, Edward Synge (d. 1762), was given (1719) the living of St Audoen's, Dublin, which carried with it a prebendal stall in St Patrick's cathedral. Like his father, Synge took a robust view of the penal laws, which he criticised on the grounds that they encouraged a ‘furious and blind zeal for religion’ which could disturb the civil state, and in 1725 he preached on religious toleration to members of both houses of parliament. Made provost of Tuam in 1726, he was consecrated bishop of Clonfert in 1730, and in 1731 was translated to Cloyne. In 1733 he was translated to Ferns and Leighlin, and in 1740 he went to Elphin, where he remained until his death. He was a close friend of Francis Hutcheson the philosopher, who acknowledged his debt to Synge's critique of the text of his An inquiry into the original of our ideas of beauty and virtue (1726). In 1749 Synge organised a census of the diocese of Elphin, which covers most of Co. Roscommon, and parts of south-east Co. Sligo and north-east Co. Galway. It was a remarkable undertaking: forms were specially designed and printed and clergy and churchwardens were persuaded to act as enumerators. The census is housed in the NAI (NAI, MS 2466). Synge married (1725) Jane Curtis and it is through his letters to their daughter Alicia that he is best known."}, {"url": "https://www.dib.ie/biography/synge-edward-a8426", "page_content": "Synge, Edward (c.1614–1678), clergyman, was baptised 14 August 1614 in Bridgnorth, Shropshire, England, second son of Richard Synge, tanner, and bailiff of Bridgnorth, and his wife Alice Rowley of Rowley, Shropshire. The original family name was Millington; it was apparently changed due to the singing abilities of the family. Synge came to Ireland at the suggestion of his elder brother George, Church of Ireland dean of Dromore and later bishop of Cloyne (1638–41), and was educated in Drogheda and at TCD , where he graduated MA .\n\nOrdained into the Church of Ireland, he was appointed rector of Killary in Meath (1638–60) and Drumully in Clogher (1640–60), and prebendary of Aghadowny, Co. Londonderry (1640–61). At some point he married Barbara Latham (d. 22 December 1677) of New Place, Co. Londonderry; they had at least three sons and five daughters. Noted as a preacher, Synge was chaplain general to the royalist forces in Leinster during the 1640s, and in July 1647 was one of a number of Dublin clergymen to sign a declaration stating their adherence to the Book of Common Prayer. Synge was appointed as a minor canon of St Patrick's cathedral (1647–60), and as vicar of Lusk, Co. Dublin (1648–61), and Inishannon, Co. Cork (1648–61), dean of Elphin (1648–60), and archdeacon of Cloyne (1648–61). Soon after, he may have been appointed chancellor of Christ Church cathedral by James Butler (qv), marquess of Ormond, but this remains uncertain. However, the potential privileges of these positions were offset by the parlous condition of the Church of Ireland at this time. After 1647 Synge had removed himself to his benefice in Donegal and spent most of the 1650s there. However, he occasionally ministered to Richard Boyle (qv), 2nd earl of Cork. He remained an episcopalian, continuing to use the Book of Common Prayer in the north-west throughout the 1650s. This prompted numerous complaints, but an association with Robert Gorges (qv), clerk of the Irish council, ensured that these were disregarded.\n\nSynge enjoyed good relations with many figures in the ruling elites of Ireland during the interregnum and after the restoration, a fact testified to by his plethora of appointments. His eldest son, Samuel, married a daughter of Archbishop Michael Boyle (qv). In 1660 Edward Synge was nominated to serve on the presidency council of Munster, and on 6 August 1660 was nominated as bishop of Limerick, being consecrated on 27 January 1661; he held the see in tandem with that of Ardfert and Aghadoe. In 1661 he also graduated DD from TCD. Of the ten bishops and two archbishops appointed in 1660, Synge was one of only three who had served in Ireland during the 1650s. In his new position, he was involved in a dispute with Ormond over the ownership of church lands in Limerick. On 21 December 1663 Synge was made bishop of Cork. As with his previous post, he held the sees in tandem. Synge's elder brother, George, who held Cloyne prior to 1641, had been ordered by the then viceroy, Thomas Wentworth (qv), earl of Strafford, to regain diocesan lands lost to figures such as Richard Boyle (qv), 1st earl of Cork, since the sixteenth century. The see was divided in two to facilitate this, but little progress was made prior to 1641; consequently more lands were lost during the interregnum, and the sees were reunited after the restoration. Throughout the 1660s Synge embarked on what became an acrimonious campaign via the acts of settlement and explanation, and the exchequer court, to regain these lands. A good relationship with the Boyle interest ensured that Roger Boyle (qv), earl of Orrery, acted as arbitrator in a number of the ensuing disputes. Synge's exertions were strongly opposed by Murrough O'Brien (qv), earl of Inchiquin, who now occupied some of the holdings; indeed, at one point Inchiquin's men assaulted Synge's son George. However, he succeeded in obtaining much of the outstanding diocesan land; by 1668 his income was calculated at £1,400, and in 1677 he was still receiving leases under the terms of the act of explanation.\n\nIn October 1675 Synge was appointed to a commission dealing with the outstanding arrears of the ’49 officers. He died 22 December 1678, and after his death the sees were divided. In 1679 Synge's eldest son Samuel attempted to transfer diocesan lands into the possession of the family, but in 1697 this was contested and reversed by the then bishop of Cloyne, Edward Jones. Two of Synge's sons entered the Church of Ireland: Samuel became dean of Kildare, and Edward (qv) enjoyed a distinguished career as archbishop of Tuam."}, {"url": "https://www.libraryireland.com/biography/ArchbishopEdwardSynge.php", "page_content": "An American widow’s account of her travels in Ireland in 1844–45 on the eve of the Great Famine:\n\nIreland’s Welcome to the Stranger\n\nSailing from New York, she set out to determine the condition of the Irish poor and discover why so many were emigrating to her home country.\n\nMrs Nicholson’s recollections of her tour among the peasantry are still revealing and gripping today.\n\nThe author returned to Ireland in 1847–49 to help with famine relief and recorded those experiences in the rather harrowing:Annals of the Famine in Ireland.\n\nSee more of our books »"}, {"url": "https://en.wikisource.org/wiki/Dictionary_of_National_Biography,_1885-1900/Synge,_Edward", "page_content": "​SYNGE, EDWARD (1659–1741), archbishop of Tuam, second and younger son of Edward Synge, bishop of Cork, Cloyne, and Ross, was born on 6 April 1659 at Inishannon in co. Cork, of which parish his father was at the time vicar.\n\nThe family belonged to Bridgnorth in Shropshire, where the name appears originally to have been Millington. According to tradition, they acquired the name of Sing or Synge from the sweetness of voice of one of the family.\n\nGeorge Synge (1594–1653), uncle of the younger Edward, born at Bridgnorth in 1594. was educated at Balliol College, Oxford, whence he matriculated on 16 Feb. 1610, graduated B.A. on 21 Oct. 1613, and M.A. on 12 June 1616. Subsequently he went to Ireland, where he found a warm patron in Christopher Hampton [q. v.], archbishop of Armagh, who constituted him vicar-general of his diocese and dean of Dromore; in which capacity his ‘so eloquent, so godly, so very leaud, railing, cursing censure’ of James Croxton’s attempts at auricular ​confession had, but for the generally disturbed state of the kingdom in 1638, drawn down upon him the vengeance of Archbishop Laud (see Prynne, Canterburies Doom, p. 195; Strafford, Letters, ii. 185, 212, 249). On 11 Nov. 1638 he was consecrated bishop of Cloyne at Drogheda; but on the breaking out of the rebellion in October 1641 he fled for safety to Dublin. In February 1644 he was sworn of the Irish privy council, and on the death of Dr. John Maxwell (1590?–1647) [q. v.] in February 1646–7 was nominated to the archbishopric of Tuam; but, failing to obtain possession on account of the war, he returned in the following year to Bridgnorth, where he died in 1653, and was buried on 31 Aug. in the church of St. Mary Magdalene. He was the author of a learned reply to the Jesuit Malone’s answer to Archbishop Ussher, entitled ‘A Rejoinder to the Reply, published by the Jesuits under the name of William Malone,’ Dublin, 1632.\n\nIt was at his suggestion that his younger brother, Edward Synge (d. 1678), then a mere boy, but destined for the church, likewise repaired to Ireland. Having received a sound education at the school at Drogheda and Trinity College, Dublin, he was, after taking orders, preferred to the rectory of Killary in the barony of Lower Slane, co. Meath. In 1647 he was appointed a minor canon of St. Patrick’s, Dublin, and shortly afterwards vicar of Inishannon in co. Cork, and dean of Elphin. During the rule of the Commonwealth he persisted in using the English liturgy in all the public offices of his ministry, being secured from prosecution by his interest with Dr. Gorge, the then auditor-general. He was consecrated bishop of Limerick on 27 Jan. 1661, and on 21 Dec. 1663 translated to the united sees of Cork, Cloyne, and Ross. He died on 22 Dec. 1678, having acquired a reputation as a singularly able preacher. Of his two sons, Samuel the elder, having graduated B.A. from Christ Church College, Oxford, on 26 Nov. 1674, proceeding M.A. on 3 July 1677, became dean of Kildare on 17 April 1679, and, dying on 30 Nov., was buried in the family vault in St. Patrick’s churchyard, near Archbishop Marsh’s library, on 2 Dec. 1708.\n\nEdward, the younger son, after being educated at the grammar school at Cork, was admitted a commoner at Christ Church, Oxford, in 1674, and graduated B.A. in 1677, but on his father’s death returned to Ireland, finishing his studies at Trinity College, Dublin, where he was admitted ad eundem, and took the degree of M.A. Having been ordained priest and deacon, he was preferred to the two small parishes of Laracor and Augher in the diocese of Meath, being both together of about the yearly value of 100l. These he afterwards exchanged for the vicarage of Christ Church, Cork, of the same value, but one of the heaviest cures in Ireland. Here he remained for more than twenty years, his income having been in the meantime increased to about 400l. a year by the gift of certain small benefices tenable with his cure. In 1699 he was offered the deanery of Derry, but declined it out of regard for his mother, who was unwilling to leave Cork. He was chosen proctor for the chapter in the convocation summoned in 1703, and was shortly afterwards nominated by the lord-lieutenant, the Duke of Ormonde, to the deanery of St. Patrick’s, Dublin. But the right of election being claimed by the chapter, a compromise was effected through the mediation of Archbishop William King [q. v.]; John Sterne [q. v.] (afterwards bishop of Clogher) succeeding to the deanery and Synge to the chancellorship, with the parish of St. Werburgh annexed. He was installed on 2 April 1705, and during the next eight years that he resided in Dublin he established a reputation for himself as one of the most industrious clergymen and popular preachers in the city. At the same time he took his degree of D.D., and on Sterne’s promotion to the see of Dromore, having been appointed by Archbishop King his vicar-general, he was chosen to represent the chapter of St. Patrick’s in the convocation that met in 1713. On 7 Nov. 1714 he was consecrated bishop of Raphoe in the church of Dunboyne, co. Meath, by the archbishop of Cashel, and on 8 June 1716 was translated to the archbishopric of Tuam, including the ancient sees of Enaghdune and Kilfenora, together with the wardenship of Galway. He was enthroned at Kilfenora on 7 Nov., and one of his earliest actions, and that which gained him the goodwill of his clergy, was the resignation, in pursuance of an old scheme of the Earl of Strafford for improving the livings in his diocese, of the ‘quarta pars episcopalis’ or fourth part of the tithes, which his immediate predecessors had nevertheless enjoyed [see Vesey, John, archbishop of Tuam, and for a full discussion of the subject Ware’s Works, ed. Harris, i. 619]. To this end he procured an act of parliament in 1717 settling it permanently on such rectors, vicars, and curates as personally discharged their cures. In 1716 he was admitted a privy councillor, and in that and the two following years was one of the keepers of the great seal in the absence of the lord high chancellor. Like King himself, he ​fell into disfavour with the government owing to his opposition to the Toleration Bill in 1719, which he thought calculated to promote the growth of popery (Report of his speech, Addit. MS. 6117, ff. 107–21), and, in consequence of having in the following spring alluded to the act as a reason for greater zeal in preaching against popery, he was charged with stirring up disaffection against the state. But from this charge he ‘acquitted himself so well that it dropped of itself,’ and in 1721 he was again included in the commission for administering the great seal. He died at Tuam on 24 July 1741, and was buried in the churchyard of his cathedral at the east end of the church. He desired that no monument should be erected to his memory; but the capital of the ancient cross of Tuam placed over his grave testifies to the universal respect in which he was held.\n\nSynge was a man of considerable learning, but his writings, consisting of short tracts and sermons, of which there is a full if not complete list in Nichols’s ‘Literary Anecdotes’ (i. 378), were chiefly devoted to the promotion of practical piety. A number of them (some thirty-four) were after his death collected and published in 4 vols. 12mo, London, 1744. Of these, several, having passed through many editions during his lifetime, have since been adopted, and frequently reprinted for general distribution, by the Society for the Promotion of Christian Knowledge. It has been said of Synge that his life was as exemplary as his writings were instructive; that what he wrote he believed, and what he believed he practised. As the son of one bishop, the nephew of another, himself an archbishop, and the father of two other bishops, his position in ecclesiastical biography is probably unique.\n\nSynge’s two sons, Edward and Nicholas, were both graduates of Trinity College, Dublin; the former proceeding M.A. in 1712 and D.D. in 1728; the latter M.A. in 1715 and D.D. in 1734. Edward, from being chancellor of St. Patrick’s, Dublin, was on 28 May 1730 elevated to the bishopric of Clonfert, being consecrated by his father in St. Werburgh’s Church, Dublin, on 7 June. Subsequently he was translated to Cloyne on 21 March 1731, to Ferns on 8 Feb. 1733, and to Elphin on 15 May 1740. He died at Dublin on 27 Jan. 1762, and was buried in St. Patrick’s churchyard on 1 Feb. Nicholas, having been collated to the archdeaconry of Dublin in 1743, was on 26 Jan. 1746 consecrated bishop of Killaloe. He died in December 1770, the fifth and last prelate of the family, and was buried in St. Patrick’s churchyard on 1 Jan. 1771.\n\n[Biographia Britannica based on a memoir contributed by the archbishop’s son Edward and practically reprinted in Chalmers’s Biographical Dictionary; Wood’s Athenæ Oxon. ed. Bliss, iii. 347, iv. 812; Ware’s Works, ed. Harris, i. 283, 619–21, ii. 297; Cotton’s Fasti Eccles. Hib. passim; Mant’s Hist. of the Church in Ireland, ii. 282, 286, 311–12, 355, 381, 506, 550; Monck Mason’s Hist. and Antiquities of St. Patrick’s, Dublin, App. pp. lxii, lxxii; Foster’s Alumni Oxon.; Cat. of Graduates in Trinity College, Dublin; Notes and Queries, 1st ser. viii. 423, xi. 240, 3rd ser. x. 203, 317; Addit. MSS. 6116 f. 299, 6117 ff. 1–186, with letters to Abp. Wake, 1703–26.]"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F37413", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://www.irishphilosophy.com/2013/06/24/middle-edward-synge/", "page_content": "Writing about Bishop Edward Synge requires some care. There were three of them, all related. The Edward Synge who is the subject of this post was the son of Edward Synge, bishop of Cork, Cloyne and Ross. He was also the nephew of George Synge (1594–1653), bishop of Cloyne; and the father of Bishops Edward Synge (1691–1762) and Nicholas Synge (1693–1771).\n\nEdward Synge the Elder, as we will distinguish him from his father and son, was born in Inishannon, Cork on 6 April 1659. After his education in Cork, Oxford and Dublin he was rector in Laracor, Co. Meath (1682–6) and then vicar of Holy Trinity and prebendary of Christ Church, Cork (1686-1706). In that period he wrote his first major work A Gentleman’s Religion (1693), originally published anonymously.\n\nAfter the challenge of John Toland’s Christianity Not Mysterious (1696), Edward Synge added an appendix to later editions of Gentleman’s Religion (David Berman suggests as a direct response.) Toland had argued that religious mysterious such as the Holy Trinity could not be properly part of Christianity since they could not be believed, since they were contrary to or above reason.\n\n\n\nWhile Synge shares Toland’s rationalism, he disagrees that there can be no mysteries in religion. Synge says that, though mysteries cannot be contrary to reason, they can be “above reason” when the “proposition is in itself true, but we are unable to clearly to apprehend or form a Notion or Conception of the things contained under the Terms of it.” Such things a person may have sufficient reason to give assent to. Synge cites a conversation with a blind man, who had no memory of sight whatsoever. Synge asked him if he had any idea of colour or light at all; the blind man replied that he had often tried to gain such an idea, but had failed. He had theorised, says Synge, that others were attempting to fool him by speaking of colours and sight, but their ability to do things that the blind man could not eventually convinced him that they could indeed see. So, concludes Synge, in the same way Scripture can indicate truths that human reason cannot grasp itself.\n\nIn making a defence along these lines, Synge joined others such as Peter Browne. After recommendations from William King Archbishop of Dublin, Synge was promoted, becoming Chancellor of St Patrick’s Cathedral, Dublin (1705–1714) and then Bishop of Raphoe (1714–1716).\n\nHe wrote his second major work in 1715 A Plain and Easy Method whereby a Man of Moderate Capacity may arrive at Full Satisfaction in all Things that concern his Everlasting Salvation. This book aimed to present the Christian faith in an accessible and rational manner – so rational in fact that Browne attacked it as too close to Toland, since it left no room for faith. This suggestion that Synge had deistic leanings was sharply replied to by Synge. It didn’t affect his career, since he was then elevated to Archbishop of Tuam (1716–1741).\n\nSynge argued for toleration in religion, despite joining Archbishop King in resisting the Toleration Act (1719) which gave rights to protestant dissenters. Synge believed that Catholics and Dissenters should not be prosecuted unless they were a real danger to the state and put forward an oath of allegiance that he hoped Catholics would be able to take, allowing them rights in civil society. This was supported with reservations by Cornelius Nary, a Catholic priest who replied to Synge’s A Charitable Address to the Catholics of Ireland resulting in a series of printed tracts back and forth. In the introduction to Synge’s last pamphlet in the debate, he put forward the following theory: “That men may live virtuously and holily in this life, and be eternally happy in the next, and that God may thereby be glorified in their salvation, is the only end and design of religion” .\n\nLecky says that Synge had great influence with the gentry of Ireland, even more than Archbishop King. Modern commentators would agree he was one of the most influential religious commentators of his time, publishing nearly sixty volumes of sermons and religious tracts in his lifetime. Edward Synge bishop of Tuam died on 24th July, 1741.\n\nReferences"}, {"url": "https://alchetron.com/Edward-Synge-%28archbishop-of-Tuam%29", "page_content": "Edward Synge, D.D., M.A., B.A. (1659–1741) was an Anglican clergyman who served in the Church of Ireland as Chancellor of St Patrick's Cathedral, Dublin (1705–1714), Bishop of Raphoe (1714–1716), and Archbishop of Tuam (1716–1741).\n\nBorn on 6 April 1659 at Inishannon in County Cork, he was the second son of Edward Synge, Bishop of Cork, Cloyne and Ross. He was educated at Christ Church, Oxford and Trinity College, Dublin. He was nominated the bishop of Raphoe on 7 October and consecrated on 7 November 1714. He was translated to archbishopric of Tuam by letters patent on 8 June 1716.\n\nA renowned preacher, his works were frequently published and included an exhortation to frequent communion translated into Welsh. Amongst other achievements he established a dynasty of prominent ecclesiastics and literary figures closely integrated into the Protestant squirearchy in the west of Ireland.\n\nHe died in office on 23 July 1741, aged 82. His sons were Edward Synge (bishop of Elphin) and Nicholas Synge, (bishop of Killaloe)."}, {"url": "https://wiki2.org/en/Edward_Synge_(archbishop_of_Tuam)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nFor other people with the same name, see Edward Synge\n\nEdward Synge, D.D., M.A., B.A. (1659–1741) was an Anglican clergyman who served in the Church of Ireland as Chancellor of St Patrick's Cathedral, Dublin (1705–1714), Bishop of Raphoe (1714–1716), and Archbishop of Tuam (1716–1741).\n\nPart of a long line of clergy, Synge is also an ancestor of famous playwright John Millington Synge and the composer Mary Helena Synge.\n\nBiography\n\nBorn on 6 April 1659 at Inishannon in County Cork, he was the second son of Edward Synge, Bishop of Cork, Cloyne and Ross. He was educated at Christ Church, Oxford and Trinity College, Dublin.\n\nIn the late 1600s he was made the rector of Holy Trinity Church, Rathclaren. He was nominated the bishop of Raphoe on 7 October and consecrated on 7 November 1714.[1] He was translated to archbishopric of Tuam by letters patent on 8 June 1716.[2] Synge built a new bishop's palace in Tuam in the late 1710s.\n\nA renowned preacher, his works were frequently published and included an exhortation to frequent communion translated into Welsh. Amongst other achievements he established a dynasty of prominent ecclesiastics and literary figures closely integrated into the Protestant squirearchy in the west of Ireland.[citation needed]\n\nHe died in office on 23 July 1741, aged 82.[2]\n\nFamily\n\nHis father, also named Edward, was the Bishop of Cork, Cloyne, and Ross.[4] He had two sons were Edward and Nicholas, both of whom became bishops in their own right. Edward Synge is a direct ancestor of playwright John Millington Synge.\n\nReferences\n\nBibliography\n\nFryde, E. B.; Greenway, D. E.; Porter, S.; Roy, I., eds. (1986). Handbook of British Chronology (3rd, reprinted 2003 ed.). Cambridge: Cambridge University Press. ISBN 0-521-56350-X .\n\nClesham, Brigid (2013). \"The Province of Armagh: Tuam, Killala and Achonry\". In McAuley, Alicia; Costecalde, Dr. Claude; Walker, Prof. Brian (eds.). The Church of Ireland: An illustrated history. Dublin: Booklink. p. 262. ISBN 978 1 906886 56 1 ."}, {"url": "https://www.findagrave.com/memorial/190257245/edward-synge", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.wikizero.com/www//Edward_Synge_(Archbishop_of_Tuam)", "page_content": "For other people with the same name, see Edward Synge\n\nEdward Synge, D.D., M.A., B.A. (1659–1741) was an Anglican clergyman who served in the Church of Ireland as Chancellor of St Patrick's Cathedral, Dublin (1705–1714), Bishop of Raphoe (1714–1716), and Archbishop of Tuam (1716–1741).\n\nPart of a long line of clergy, Synge is also an ancestor of famous playwright John Millington Synge and the composer Mary Helena Synge.\n\nBiography [ edit ]\n\nBorn on 6 April 1659 at Inishannon in County Cork, he was the second son of Edward Synge, Bishop of Cork, Cloyne and Ross. He was educated at Christ Church, Oxford and Trinity College, Dublin.\n\nIn the late 1600s he was made the rector of Holy Trinity Church, Rathclaren. He was nominated the bishop of Raphoe on 7 October and consecrated on 7 November 1714.[1] He was translated to archbishopric of Tuam by letters patent on 8 June 1716.[2] Synge built a new bishop's palace in Tuam in the late 1710s.\n\nA renowned preacher, his works were frequently published and included an exhortation to frequent communion translated into Welsh. Amongst other achievements he established a dynasty of prominent ecclesiastics and literary figures closely integrated into the Protestant squirearchy in the west of Ireland.[citation needed]\n\nHe died in office on 23 July 1741, aged 82.[2]\n\nFamily [ edit ]\n\nHis father, also named Edward, was the Bishop of Cork, Cloyne, and Ross.[4] He had two sons were Edward and Nicholas, both of whom became bishops in their own right. Edward Synge is a direct ancestor of playwright John Millington Synge.\n\nReferences [ edit ]\n\nBibliography [ edit ]"}], "Edward Synge held the post of Archbishop of Tuam until his death in 1798.": [{"url": "https://www.libraryireland.com/biography/ArchbishopEdwardSynge.php", "page_content": "An American widow’s account of her travels in Ireland in 1844–45 on the eve of the Great Famine:\n\nIreland’s Welcome to the Stranger\n\nSailing from New York, she set out to determine the condition of the Irish poor and discover why so many were emigrating to her home country.\n\nMrs Nicholson’s recollections of her tour among the peasantry are still revealing and gripping today.\n\nThe author returned to Ireland in 1847–49 to help with famine relief and recorded those experiences in the rather harrowing:Annals of the Famine in Ireland.\n\nSee more of our books »"}, {"url": "https://www.dib.ie/biography/synge-edward-a8427", "page_content": "Synge, Edward (1659–1741), clergyman, was born 5 April 1659 at Inishannon, Co. Cork, second son of Edward Synge (qv), later bishop of Cork, Cloyne, and Ross, and his wife Barbara Latham. Edward's elder brother was Samuel Synge (d. 1708), who became dean of Kildare. Synge was educated at the diocesan school, Cork, and in 1674 he went to Christ Church, Oxford. At Oxford he met William Wake, later archbishop of Canterbury, with whom he remained in correspondence throughout his life. He graduated BA in 1677.\n\nSynge's first incumbency was as rector of Laracor, Co. Meath (1682–6). In 1686 he became vicar of Holy Trinity and prebendary of Christ Church, Cork, which he held until 1706. He was also (1691–1714) rector of Rathclarin, Co. Cork, and held other parishes in the diocese of Cloyne. In 1695 William King (qv), then bishop of Dublin, put Synge's name forward for the diocese of Limerick. Synge expressed surprise that he had been considered, but he did not get Limerick, and when he was offered the deanery of Derry in 1699 he refused it on the grounds that his elderly mother could not accompany him. About four years later, the lord lieutenant, the 2nd duke of Ormond (qv) offered him the deanery of St Patrick's on behalf of the crown. However, a dispute between the crown and the chapter as to the right of presentation was only resolved when John Stearne (qv) was appointed dean and Edward Synge became chancellor of St Patrick's and vicar of St Werburgh's, where he was installed in April 1705. In 1714 King recommended Synge for the diocese of Raphoe, and he was consecrated in November that year. He remained at Raphoe for only eighteen months, and in June 1716 he was appointed archbishop of Tuam.\n\nInitially, Synge had resisted his removal from Raphoe, where he was engaged in disputes about presbyterian marriages and a campaign of conversion through education. He saw that there was a great deal of work and expense in Tuam, and there was nowhere to live, as the archbishop's palace had been burnt during the civil war. Tuam had other drawbacks: there were few resident clergy and many parishes were impropriate. Further, there was a long-running problem about the quarta pars episcopalis, that part of the tithes that had augmented the income of the archbishop, and not the parish clergy. It had been proposed to abolish this custom in Tuam, but before the necessary legislation was enacted the documents were lost in the 1641 rebellion. Synge was advised to encourage the Tuam clergy to petition for the abolition of the quarta pars, to supplement the incomes of clergy who were prepared to resign from pluralities, and to provide for parishes that had not been served since the reformation.\n\nOn the growing constitutional crisis arising from the Annesley v. Sherlock case (over the appellate jurisdictions of the Irish house of lords and its British counterpart) Synge told Wake that Ireland was ‘a kingdom (not a county Palatine) exactly formd [sic] according to the model of England . . . ’ (Synge to Wake, 1 Nov. 1717 (Dublin City Library, Gilbert MS 28, f. 100)). With Archbishop King, he opposed actively but unsuccessfully the enactment by the Irish parliament of a toleration act for protestant dissenters. Here again Synge was said to have conducted himself ‘with the greatest warmth and zeal for the nation's honour’ (William Nicholson to Wake, 11 July 1719 (ibid., f. 236). In his speech on the bill, Synge observed that although he had always believed in limited toleration for dissenters, he saw that religion was a continuing cause of strife, wars, and rebellions. Citing the existence of 180 sects in England which had flourished during the civil war, he warned that it should be not thought that these ‘wild sects and parties’ had gone. If the bill were passed, he said, not only the Church of Ireland, but the civil state and even Christianity itself would be put at risk (Edward Synge speech on toleration, MS in private possession). Both Synge and King were out of favour as a result of their opposition to the bill.\n\nSynge acknowledged the difficulty that catholics had in taking the oaths of allegiance and abjuration, excluding them from full rights in a civil society. He believed that catholics and dissenters should be prosecuted only if they posed a real danger to the state, and proposed an oath of allegiance to meet the objections of both Roman Catholics and quakers. During his life, Synge published nearly sixty volumes of sermons and religious tracts, and he is now seen as one of the most influential religious commentators of his time. The Appendix to his Gentleman's religion (1698) is thought by Berman to have been written in answer to John Toland's (qv) Christianity not mysterious (1696). To some extent Synge shared Toland's rationalism and deism, but he rebutted Toland's case that religion possessed no mysteries. With William King, George Berkeley (qv), and Francis Hutcheson (qv), Synge discussed the problem of innate perception, using the analogy of a blind man's understanding of shape and form. In October 1714 he preached a sermon at St Werburgh's which was attacked for advocating deism and which resulted in a sharp exchange of pamphlets. Synge died in Tuam on 24 July 1741, where he was buried.\n\nHe married (1690) Anne, daughter of Nicholas Proude, dean of Clonfert. They had five children, two of whom became bishops. The eldest, Edward Synge (d. 1762), was given (1719) the living of St Audoen's, Dublin, which carried with it a prebendal stall in St Patrick's cathedral. Like his father, Synge took a robust view of the penal laws, which he criticised on the grounds that they encouraged a ‘furious and blind zeal for religion’ which could disturb the civil state, and in 1725 he preached on religious toleration to members of both houses of parliament. Made provost of Tuam in 1726, he was consecrated bishop of Clonfert in 1730, and in 1731 was translated to Cloyne. In 1733 he was translated to Ferns and Leighlin, and in 1740 he went to Elphin, where he remained until his death. He was a close friend of Francis Hutcheson the philosopher, who acknowledged his debt to Synge's critique of the text of his An inquiry into the original of our ideas of beauty and virtue (1726). In 1749 Synge organised a census of the diocese of Elphin, which covers most of Co. Roscommon, and parts of south-east Co. Sligo and north-east Co. Galway. It was a remarkable undertaking: forms were specially designed and printed and clergy and churchwardens were persuaded to act as enumerators. The census is housed in the NAI (NAI, MS 2466). Synge married (1725) Jane Curtis and it is through his letters to their daughter Alicia that he is best known."}, {"url": "https://www.dib.ie/biography/synge-edward-a8426", "page_content": "Synge, Edward (c.1614–1678), clergyman, was baptised 14 August 1614 in Bridgnorth, Shropshire, England, second son of Richard Synge, tanner, and bailiff of Bridgnorth, and his wife Alice Rowley of Rowley, Shropshire. The original family name was Millington; it was apparently changed due to the singing abilities of the family. Synge came to Ireland at the suggestion of his elder brother George, Church of Ireland dean of Dromore and later bishop of Cloyne (1638–41), and was educated in Drogheda and at TCD , where he graduated MA .\n\nOrdained into the Church of Ireland, he was appointed rector of Killary in Meath (1638–60) and Drumully in Clogher (1640–60), and prebendary of Aghadowny, Co. Londonderry (1640–61). At some point he married Barbara Latham (d. 22 December 1677) of New Place, Co. Londonderry; they had at least three sons and five daughters. Noted as a preacher, Synge was chaplain general to the royalist forces in Leinster during the 1640s, and in July 1647 was one of a number of Dublin clergymen to sign a declaration stating their adherence to the Book of Common Prayer. Synge was appointed as a minor canon of St Patrick's cathedral (1647–60), and as vicar of Lusk, Co. Dublin (1648–61), and Inishannon, Co. Cork (1648–61), dean of Elphin (1648–60), and archdeacon of Cloyne (1648–61). Soon after, he may have been appointed chancellor of Christ Church cathedral by James Butler (qv), marquess of Ormond, but this remains uncertain. However, the potential privileges of these positions were offset by the parlous condition of the Church of Ireland at this time. After 1647 Synge had removed himself to his benefice in Donegal and spent most of the 1650s there. However, he occasionally ministered to Richard Boyle (qv), 2nd earl of Cork. He remained an episcopalian, continuing to use the Book of Common Prayer in the north-west throughout the 1650s. This prompted numerous complaints, but an association with Robert Gorges (qv), clerk of the Irish council, ensured that these were disregarded.\n\nSynge enjoyed good relations with many figures in the ruling elites of Ireland during the interregnum and after the restoration, a fact testified to by his plethora of appointments. His eldest son, Samuel, married a daughter of Archbishop Michael Boyle (qv). In 1660 Edward Synge was nominated to serve on the presidency council of Munster, and on 6 August 1660 was nominated as bishop of Limerick, being consecrated on 27 January 1661; he held the see in tandem with that of Ardfert and Aghadoe. In 1661 he also graduated DD from TCD. Of the ten bishops and two archbishops appointed in 1660, Synge was one of only three who had served in Ireland during the 1650s. In his new position, he was involved in a dispute with Ormond over the ownership of church lands in Limerick. On 21 December 1663 Synge was made bishop of Cork. As with his previous post, he held the sees in tandem. Synge's elder brother, George, who held Cloyne prior to 1641, had been ordered by the then viceroy, Thomas Wentworth (qv), earl of Strafford, to regain diocesan lands lost to figures such as Richard Boyle (qv), 1st earl of Cork, since the sixteenth century. The see was divided in two to facilitate this, but little progress was made prior to 1641; consequently more lands were lost during the interregnum, and the sees were reunited after the restoration. Throughout the 1660s Synge embarked on what became an acrimonious campaign via the acts of settlement and explanation, and the exchequer court, to regain these lands. A good relationship with the Boyle interest ensured that Roger Boyle (qv), earl of Orrery, acted as arbitrator in a number of the ensuing disputes. Synge's exertions were strongly opposed by Murrough O'Brien (qv), earl of Inchiquin, who now occupied some of the holdings; indeed, at one point Inchiquin's men assaulted Synge's son George. However, he succeeded in obtaining much of the outstanding diocesan land; by 1668 his income was calculated at £1,400, and in 1677 he was still receiving leases under the terms of the act of explanation.\n\nIn October 1675 Synge was appointed to a commission dealing with the outstanding arrears of the ’49 officers. He died 22 December 1678, and after his death the sees were divided. In 1679 Synge's eldest son Samuel attempted to transfer diocesan lands into the possession of the family, but in 1697 this was contested and reversed by the then bishop of Cloyne, Edward Jones. Two of Synge's sons entered the Church of Ireland: Samuel became dean of Kildare, and Edward (qv) enjoyed a distinguished career as archbishop of Tuam."}, {"url": "https://en.wikisource.org/wiki/Dictionary_of_National_Biography,_1885-1900/Synge,_Edward", "page_content": "​SYNGE, EDWARD (1659–1741), archbishop of Tuam, second and younger son of Edward Synge, bishop of Cork, Cloyne, and Ross, was born on 6 April 1659 at Inishannon in co. Cork, of which parish his father was at the time vicar.\n\nThe family belonged to Bridgnorth in Shropshire, where the name appears originally to have been Millington. According to tradition, they acquired the name of Sing or Synge from the sweetness of voice of one of the family.\n\nGeorge Synge (1594–1653), uncle of the younger Edward, born at Bridgnorth in 1594. was educated at Balliol College, Oxford, whence he matriculated on 16 Feb. 1610, graduated B.A. on 21 Oct. 1613, and M.A. on 12 June 1616. Subsequently he went to Ireland, where he found a warm patron in Christopher Hampton [q. v.], archbishop of Armagh, who constituted him vicar-general of his diocese and dean of Dromore; in which capacity his ‘so eloquent, so godly, so very leaud, railing, cursing censure’ of James Croxton’s attempts at auricular ​confession had, but for the generally disturbed state of the kingdom in 1638, drawn down upon him the vengeance of Archbishop Laud (see Prynne, Canterburies Doom, p. 195; Strafford, Letters, ii. 185, 212, 249). On 11 Nov. 1638 he was consecrated bishop of Cloyne at Drogheda; but on the breaking out of the rebellion in October 1641 he fled for safety to Dublin. In February 1644 he was sworn of the Irish privy council, and on the death of Dr. John Maxwell (1590?–1647) [q. v.] in February 1646–7 was nominated to the archbishopric of Tuam; but, failing to obtain possession on account of the war, he returned in the following year to Bridgnorth, where he died in 1653, and was buried on 31 Aug. in the church of St. Mary Magdalene. He was the author of a learned reply to the Jesuit Malone’s answer to Archbishop Ussher, entitled ‘A Rejoinder to the Reply, published by the Jesuits under the name of William Malone,’ Dublin, 1632.\n\nIt was at his suggestion that his younger brother, Edward Synge (d. 1678), then a mere boy, but destined for the church, likewise repaired to Ireland. Having received a sound education at the school at Drogheda and Trinity College, Dublin, he was, after taking orders, preferred to the rectory of Killary in the barony of Lower Slane, co. Meath. In 1647 he was appointed a minor canon of St. Patrick’s, Dublin, and shortly afterwards vicar of Inishannon in co. Cork, and dean of Elphin. During the rule of the Commonwealth he persisted in using the English liturgy in all the public offices of his ministry, being secured from prosecution by his interest with Dr. Gorge, the then auditor-general. He was consecrated bishop of Limerick on 27 Jan. 1661, and on 21 Dec. 1663 translated to the united sees of Cork, Cloyne, and Ross. He died on 22 Dec. 1678, having acquired a reputation as a singularly able preacher. Of his two sons, Samuel the elder, having graduated B.A. from Christ Church College, Oxford, on 26 Nov. 1674, proceeding M.A. on 3 July 1677, became dean of Kildare on 17 April 1679, and, dying on 30 Nov., was buried in the family vault in St. Patrick’s churchyard, near Archbishop Marsh’s library, on 2 Dec. 1708.\n\nEdward, the younger son, after being educated at the grammar school at Cork, was admitted a commoner at Christ Church, Oxford, in 1674, and graduated B.A. in 1677, but on his father’s death returned to Ireland, finishing his studies at Trinity College, Dublin, where he was admitted ad eundem, and took the degree of M.A. Having been ordained priest and deacon, he was preferred to the two small parishes of Laracor and Augher in the diocese of Meath, being both together of about the yearly value of 100l. These he afterwards exchanged for the vicarage of Christ Church, Cork, of the same value, but one of the heaviest cures in Ireland. Here he remained for more than twenty years, his income having been in the meantime increased to about 400l. a year by the gift of certain small benefices tenable with his cure. In 1699 he was offered the deanery of Derry, but declined it out of regard for his mother, who was unwilling to leave Cork. He was chosen proctor for the chapter in the convocation summoned in 1703, and was shortly afterwards nominated by the lord-lieutenant, the Duke of Ormonde, to the deanery of St. Patrick’s, Dublin. But the right of election being claimed by the chapter, a compromise was effected through the mediation of Archbishop William King [q. v.]; John Sterne [q. v.] (afterwards bishop of Clogher) succeeding to the deanery and Synge to the chancellorship, with the parish of St. Werburgh annexed. He was installed on 2 April 1705, and during the next eight years that he resided in Dublin he established a reputation for himself as one of the most industrious clergymen and popular preachers in the city. At the same time he took his degree of D.D., and on Sterne’s promotion to the see of Dromore, having been appointed by Archbishop King his vicar-general, he was chosen to represent the chapter of St. Patrick’s in the convocation that met in 1713. On 7 Nov. 1714 he was consecrated bishop of Raphoe in the church of Dunboyne, co. Meath, by the archbishop of Cashel, and on 8 June 1716 was translated to the archbishopric of Tuam, including the ancient sees of Enaghdune and Kilfenora, together with the wardenship of Galway. He was enthroned at Kilfenora on 7 Nov., and one of his earliest actions, and that which gained him the goodwill of his clergy, was the resignation, in pursuance of an old scheme of the Earl of Strafford for improving the livings in his diocese, of the ‘quarta pars episcopalis’ or fourth part of the tithes, which his immediate predecessors had nevertheless enjoyed [see Vesey, John, archbishop of Tuam, and for a full discussion of the subject Ware’s Works, ed. Harris, i. 619]. To this end he procured an act of parliament in 1717 settling it permanently on such rectors, vicars, and curates as personally discharged their cures. In 1716 he was admitted a privy councillor, and in that and the two following years was one of the keepers of the great seal in the absence of the lord high chancellor. Like King himself, he ​fell into disfavour with the government owing to his opposition to the Toleration Bill in 1719, which he thought calculated to promote the growth of popery (Report of his speech, Addit. MS. 6117, ff. 107–21), and, in consequence of having in the following spring alluded to the act as a reason for greater zeal in preaching against popery, he was charged with stirring up disaffection against the state. But from this charge he ‘acquitted himself so well that it dropped of itself,’ and in 1721 he was again included in the commission for administering the great seal. He died at Tuam on 24 July 1741, and was buried in the churchyard of his cathedral at the east end of the church. He desired that no monument should be erected to his memory; but the capital of the ancient cross of Tuam placed over his grave testifies to the universal respect in which he was held.\n\nSynge was a man of considerable learning, but his writings, consisting of short tracts and sermons, of which there is a full if not complete list in Nichols’s ‘Literary Anecdotes’ (i. 378), were chiefly devoted to the promotion of practical piety. A number of them (some thirty-four) were after his death collected and published in 4 vols. 12mo, London, 1744. Of these, several, having passed through many editions during his lifetime, have since been adopted, and frequently reprinted for general distribution, by the Society for the Promotion of Christian Knowledge. It has been said of Synge that his life was as exemplary as his writings were instructive; that what he wrote he believed, and what he believed he practised. As the son of one bishop, the nephew of another, himself an archbishop, and the father of two other bishops, his position in ecclesiastical biography is probably unique.\n\nSynge’s two sons, Edward and Nicholas, were both graduates of Trinity College, Dublin; the former proceeding M.A. in 1712 and D.D. in 1728; the latter M.A. in 1715 and D.D. in 1734. Edward, from being chancellor of St. Patrick’s, Dublin, was on 28 May 1730 elevated to the bishopric of Clonfert, being consecrated by his father in St. Werburgh’s Church, Dublin, on 7 June. Subsequently he was translated to Cloyne on 21 March 1731, to Ferns on 8 Feb. 1733, and to Elphin on 15 May 1740. He died at Dublin on 27 Jan. 1762, and was buried in St. Patrick’s churchyard on 1 Feb. Nicholas, having been collated to the archdeaconry of Dublin in 1743, was on 26 Jan. 1746 consecrated bishop of Killaloe. He died in December 1770, the fifth and last prelate of the family, and was buried in St. Patrick’s churchyard on 1 Jan. 1771.\n\n[Biographia Britannica based on a memoir contributed by the archbishop’s son Edward and practically reprinted in Chalmers’s Biographical Dictionary; Wood’s Athenæ Oxon. ed. Bliss, iii. 347, iv. 812; Ware’s Works, ed. Harris, i. 283, 619–21, ii. 297; Cotton’s Fasti Eccles. Hib. passim; Mant’s Hist. of the Church in Ireland, ii. 282, 286, 311–12, 355, 381, 506, 550; Monck Mason’s Hist. and Antiquities of St. Patrick’s, Dublin, App. pp. lxii, lxxii; Foster’s Alumni Oxon.; Cat. of Graduates in Trinity College, Dublin; Notes and Queries, 1st ser. viii. 423, xi. 240, 3rd ser. x. 203, 317; Addit. MSS. 6116 f. 299, 6117 ff. 1–186, with letters to Abp. Wake, 1703–26.]"}, {"url": "https://www.irelandxo.com/ireland-xo/history-and-genealogy/ancestor-database/bishop-edward-synge", "page_content": "Edward Synge (1691–1762) was the Anglican Bishop of the Diocese of Elphin from 1740 until his death in 1762. He was descended from a long line of Archbishops of the Church of Ireland.\n\nHe was educated at Trinity College, Dublin, obtaining a Doctorate of Divinity in 1728. He was briefly Provost of Tuam and Chancellor of St Patrick's Cathedral, Dublin, before he was consecrated the Bishop of Clonfert and Kilmacduagh in 1730. He was subsequently translated to Cloyne in 1732, then to Ferns and Leighlin in 1734, and finally to Elphin on 15 May 1740.\n\nSynge is particularly well known for his 221 letters to his daughter Alicia (1733-1807) and the 1749 Census of Elphin.\n\nPHOTO CREDIT: The Episcopal Throne at Elphin Cathedral © Vox Hiberionacum"}, {"url": "https://www.irishphilosophy.com/2013/06/24/middle-edward-synge/", "page_content": "Writing about Bishop Edward Synge requires some care. There were three of them, all related. The Edward Synge who is the subject of this post was the son of Edward Synge, bishop of Cork, Cloyne and Ross. He was also the nephew of George Synge (1594–1653), bishop of Cloyne; and the father of Bishops Edward Synge (1691–1762) and Nicholas Synge (1693–1771).\n\nEdward Synge the Elder, as we will distinguish him from his father and son, was born in Inishannon, Cork on 6 April 1659. After his education in Cork, Oxford and Dublin he was rector in Laracor, Co. Meath (1682–6) and then vicar of Holy Trinity and prebendary of Christ Church, Cork (1686-1706). In that period he wrote his first major work A Gentleman’s Religion (1693), originally published anonymously.\n\nAfter the challenge of John Toland’s Christianity Not Mysterious (1696), Edward Synge added an appendix to later editions of Gentleman’s Religion (David Berman suggests as a direct response.) Toland had argued that religious mysterious such as the Holy Trinity could not be properly part of Christianity since they could not be believed, since they were contrary to or above reason.\n\n\n\nWhile Synge shares Toland’s rationalism, he disagrees that there can be no mysteries in religion. Synge says that, though mysteries cannot be contrary to reason, they can be “above reason” when the “proposition is in itself true, but we are unable to clearly to apprehend or form a Notion or Conception of the things contained under the Terms of it.” Such things a person may have sufficient reason to give assent to. Synge cites a conversation with a blind man, who had no memory of sight whatsoever. Synge asked him if he had any idea of colour or light at all; the blind man replied that he had often tried to gain such an idea, but had failed. He had theorised, says Synge, that others were attempting to fool him by speaking of colours and sight, but their ability to do things that the blind man could not eventually convinced him that they could indeed see. So, concludes Synge, in the same way Scripture can indicate truths that human reason cannot grasp itself.\n\nIn making a defence along these lines, Synge joined others such as Peter Browne. After recommendations from William King Archbishop of Dublin, Synge was promoted, becoming Chancellor of St Patrick’s Cathedral, Dublin (1705–1714) and then Bishop of Raphoe (1714–1716).\n\nHe wrote his second major work in 1715 A Plain and Easy Method whereby a Man of Moderate Capacity may arrive at Full Satisfaction in all Things that concern his Everlasting Salvation. This book aimed to present the Christian faith in an accessible and rational manner – so rational in fact that Browne attacked it as too close to Toland, since it left no room for faith. This suggestion that Synge had deistic leanings was sharply replied to by Synge. It didn’t affect his career, since he was then elevated to Archbishop of Tuam (1716–1741).\n\nSynge argued for toleration in religion, despite joining Archbishop King in resisting the Toleration Act (1719) which gave rights to protestant dissenters. Synge believed that Catholics and Dissenters should not be prosecuted unless they were a real danger to the state and put forward an oath of allegiance that he hoped Catholics would be able to take, allowing them rights in civil society. This was supported with reservations by Cornelius Nary, a Catholic priest who replied to Synge’s A Charitable Address to the Catholics of Ireland resulting in a series of printed tracts back and forth. In the introduction to Synge’s last pamphlet in the debate, he put forward the following theory: “That men may live virtuously and holily in this life, and be eternally happy in the next, and that God may thereby be glorified in their salvation, is the only end and design of religion” .\n\nLecky says that Synge had great influence with the gentry of Ireland, even more than Archbishop King. Modern commentators would agree he was one of the most influential religious commentators of his time, publishing nearly sixty volumes of sermons and religious tracts in his lifetime. Edward Synge bishop of Tuam died on 24th July, 1741.\n\nReferences"}, {"url": "https://library.villanova.edu/Find/Record/743056", "page_content": "Search Tips\n\nPhrase Searching\n\nYou can use double quotes to search for a series of words in a particular order.\n\nFor example, \"World war II\" (with quotes) will give more precise results than World war II (without quotes).\n\nWildcard Searching\n\nIf you want to search for multiple variations of a word, you can substitute a special symbol (called a \"wildcard\") for one or more letters.\n\nYou can use * to represent 0 or many characters.\n\nYou can use ? to represent 1 single character.\n\nFor example, econom* will find both economics as well as economies, and organi?e will find both organise and organize.\n\nAdvanced Searching\n\nOur Advanced Search tool lets you easily search multiple fields at the same time and combine terms in complex ways. See the help page for more details.\n\nWant to get more out of the basic search box? Read about Search Operators for some powerful new tools."}, {"url": "https://alchetron.com/Edward-Synge-%28archbishop-of-Tuam%29", "page_content": "Edward Synge, D.D., M.A., B.A. (1659–1741) was an Anglican clergyman who served in the Church of Ireland as Chancellor of St Patrick's Cathedral, Dublin (1705–1714), Bishop of Raphoe (1714–1716), and Archbishop of Tuam (1716–1741).\n\nBorn on 6 April 1659 at Inishannon in County Cork, he was the second son of Edward Synge, Bishop of Cork, Cloyne and Ross. He was educated at Christ Church, Oxford and Trinity College, Dublin. He was nominated the bishop of Raphoe on 7 October and consecrated on 7 November 1714. He was translated to archbishopric of Tuam by letters patent on 8 June 1716.\n\nA renowned preacher, his works were frequently published and included an exhortation to frequent communion translated into Welsh. Amongst other achievements he established a dynasty of prominent ecclesiastics and literary figures closely integrated into the Protestant squirearchy in the west of Ireland.\n\nHe died in office on 23 July 1741, aged 82. His sons were Edward Synge (bishop of Elphin) and Nicholas Synge, (bishop of Killaloe)."}, {"url": "https://www.findagrave.com/memorial/190257245/edward-synge", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.howold.co/person/edward-synge-archbishop-of-tuam/biography", "page_content": "Edward Synge Biography\n\nFor other people with the same name, see Edward Synge.\n\nChristianity portal\n\nEdward Synge, D.D., M.A., B.A. (1659–1741) was an Anglican clergyman who served in the Church of Ireland as Chancellor of St Patrick's Cathedral, Dublin (1705–1714), Bishop of Raphoe (1714–1716), and Archbishop of Tuam (1716–1741).\n\nPart of a long line of clergy, Synge is also an ancestor of famous playwright John Millington Synge and the composer Mary Helena Synge.\n\nBiography\n\nBorn on 6 April 1659 at Inishannon in County Cork, he was the second son of Edward Synge, Bishop of Cork, Cloyne and Ross. He was educated at Christ Church, Oxford and Trinity College, Dublin.\n\nIn the late 1600s he was made the rector of Holy Trinity Church, Rathclaren. He was nominated the bishop of Raphoe on 7 October and consecrated on 7 November 1714. He was translated to archbishopric of Tuam by letters patent on 8 June 1716. Synge built a new bishop's palace in Tuam in the late 1710s.\n\nA renowned preacher, his works were frequently published and included an exhortation to frequent communion translated into Welsh. Amongst other achievements he established a dynasty of prominent ecclesiastics and literary figures closely integrated into the Protestant squirearchy in the west of Ireland.\n\nHe died in office on 23 July 1741, aged 82.\n\nFamily\n\nHis father, also named Edward, was the Bishop of Cork, Cloyne, and Ross. He had two sons were Edward and Nicholas, both of whom became bishops in their own right. Edward Synge is a direct ancestor of playwright John Millington Synge.\n\nReferences\n\nBibliography"}]}