{"Torry Castellano has been involved in other musical projects.": [{"url": "https://www.musicradar.com/news/drums/musicradar-podcast-torry-castellano-142129", "page_content": "Since forming in 1993 to perform for an eighth-grade lunchtime talent show, The Donnas (Brett Anderson, vocals; Maya Ford, bass; Allison Robertson, guitar; and Torry Castellano, drums) have been handing it back to the boys big-time with their kick-ass, let's-party brand of rock and roll.\n\nBig breaks came easy for the California-based band. Before they graduated high school, they had toured Japan. A deal with Lookout! Records led to the band signing to Atlantic in 2001. Albums such as 2002's Spend The Night and 2004's Gold Medal garnered critical raves and won the band fans at all points on the globe, but not enough of them to maintain a major-label deal. Unbowed, The Donnas formed their own Purple Feather Records label, and in 2007 released their most bracing album yet, Bitchin'.\n\nThrough it all, the driving force behind The Donnas is Torry Castellano. The petite powerhouse rocks her Pearl kit with an almost tectonic force. Perhaps the reason she plays with such passion is the fact that she's lucky to be playing at all: In 2003 an acute case of wrist tendinitis (caused by holding her sticks wrong) almost ended her musical career. But through surgery, physical therapy, and a new approach to drumming, Castellano is back on the throne, and better than she's ever been.\n\nMusicRadar caught up with Torry Castellano backstage for a podcast interview before a recent Donnas show in New York City. Listen to the podcast below, and there's more information on The Donnas' official website.\n\nPart one - Torry discusses the band's formation, growing pains, and being tagged as 'punk.'\n\nPart two - She talks about maturing musically, her almost career-ending tendinitis, and future plans."}, {"url": "https://www.wikiwand.com/en/Torry_Castellano", "page_content": "Torrance Heather Castellano (born January 8, 1979) is an American percussionist and the former drummer of The Donnas. She announced her retirement from drumming in July 2010.\n\nAmerican drummer\n\nQuick facts: Torry Castellano, Background information, Bir... ▼\n\nMusical artist"}, {"url": "https://infofair24.com/torry-castellano/", "page_content": "Torry Castellano was born in Brooklyn, New York City. Her musical influences include jazz, gospel, pop, noise, folk and even classical music. She is a founding member of the band Toto. In her younger years, she was a substitute dancer for the cast of Broadway’s “Jesus Christ Superstar” and as a teenager, she appeared in the movie “A Midsummer Night’s Dream.”\n\nTorry Castellano has been described as a “popular musician” due to her versatile talents as a percussionist, singer/songwriter and actress. Torry began playing drums when she was young and continued playing them until she was twenty-one years old. Torry then played bass in many early rock bands before going solo and discovering her true singing talent. She has been described as a very talented “folk artist” due to her interesting vocal style which incorporates a range of tones and pitch variations. Torry has also opened for numerous popular musicians including George Harrison, Eric Clapton and Johnny Jenkins.\n\nTorry Castellano has made twenty-four studio albums and twelve self-written songs. One of her most popular songs “Donna Jane” from her album “Troublemaker” was inspired by the death of her friend and fellow musician Patti LaBelle. This song became a huge hit for Torry and is still currently being used in many schools and churches to this day. Torry Castellano also appeared in the movie “The Social Network” as an attractive and sexy lead character.\n\nTorry Castellano was previously a professional volleyball player. As a player, she was known for her powerful forearms, arm swings, and powerful knees. She lost her ability to play volleyball due to carpal tunnel syndrome, but she has retained her love of sports and is still as passionate as ever. Torry has also drummed for some of the best known American percussionists such as Les Claypool, Paul McCartney, Pino Palladino, Flea of the Red Hot Chili Peppers, Flea of the Bluegrass, Dave Matthews and Yngwie Malmsteen. Torry states that she currently plays drums professionally for about four hours each day.\n\nTorry states that she is presently working as a freelance writer and internet marketer. Her most recent endeavor has been developing a website and blog for her personal financial and career growth as an artist and musician. The website and blog features articles on topics such as how to make money as a musician and what type of music licensing she holds. It also features a section on her views on the global economics and power structures that are currently affecting the world of music today. In addition, she also states that she intends to develop her own music distribution company and offers her musicians and publishers songwriting and recording deals through her company.\n\nTorry states that she is not exactly sure how old she is since at this time in her life she is in the early twenties, but she feels that since she is only a few years older than my son, she might be a few decades older. She states that she has always had long brown hair that is tied back. During our online interview, I noticed that Torry wears glasses and has light skin. This is typical for a musician that has achieved worldwide recognition."}, {"url": "https://www.moderndrummer.com/2008/01/torry-castellano-2/", "page_content": "Torry Castellano: The Grip Of Death\n\nAlthough Donnas drummer Torry Castellano still encourages the idea of being a self-taught musician, she’s quick to admit that she had to learn the hard way that improper technique can cause serious problems. A few years ago after a bout with tendinitis rendered Torry out of commission for several months. After touring for over a year on her pop-punk band’s 2002 release, Spend The Night, Castellano’s problems became so severe that she had to undergo surgery and physical rehabilitation.\n\n“When I got to physical therapy, they called it ‘the grip of death,’” Torry recalls. “They were like, ‘Oh no, you do that?’ But it all ended up being really good. I learned a different technique, and I think I’m a better drummer because of it. It’s all about letting the stick do the work. That way you’re not going crazy, holding the stick so tightly that you’re hurting yourself.”\n\nBesides applying the new technique, Torry began doing warm-up exercises and reconfigured her four-piece Pearl kit. Since then she’s successfully (read: pain-free) recorded and toured behind two more Donnas albums, including 2004’s Gold Medal and their latest, the arena rock–flavored Bitchin’.\n\nCastellano credits producer Jay Ruston (Meatloaf, Polyphonic Spree) for helping to shape her performance on this latest recording. “He definitely encouraged that four-on-the-floor type beat,” she says, “which was a really good direction because I love that beat. But I was asking, ‘Should I really put it in more than one song?’ He was like, ‘It sounds great.’ And when we play those songs live, the rhythm really gets into people.”\n\nWaleed Rashidi"}, {"url": "https://wiki2.org/en/Torry_Castellano", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican drummer\n\nMusical artist\n\nTorrance Heather Castellano (born January 8, 1979) is an American percussionist and the former drummer of The Donnas. She announced her retirement from drumming in July 2010.\n\nAbout\n\nCastellano was born in San Francisco, California. She met future bandmates Maya Ford, Brett Anderson and Allison Robertson in junior high school.[2] They formed a band in 8th grade called Ragady Anne, later calling themselves The Electrocutes at Palo Alto High School.[3]\n\nBefore the release of The Donnas' sixth studio album Gold Medal, Castellano developed tendonitis and in October 2003, she had surgery for it. During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way.[4] For Gold Medal, she recorded with her recovering wrists, but could only play for short periods of time.\n\nA shoulder problem forced Castellano to withdraw from The Donnas' tour following a show on December 27, 2008 at the House Of Blues in Anaheim, California. Amy Cesari of the band The Demonics filled in on future tour dates. On July 9, 2010, Castellano announced on the band's website that due to her shoulder she would have to retire from drumming and performing with The Donnas. Castellano still attended events the band was involved with as well as promoted the last album she recorded with the band, Greatest Hits Vol. 16.\n\nShe attended Santa Monica College before transferring to Stanford University, majoring in political science.[5] Castellano graduated from Stanford with distinction and attended Harvard Law School.[6] While at Harvard, she interned for Adalah,[7] Habeas Corpus Research Center, and Article 36. [8] As a Frederick Sheldon Traveling Fellow at Harvard, she designed a legal research project on the way cracks in domestic and international legal frameworks lead to a deprivation of rights for the residents of areas that are de facto no man’s land, created by protracted conflicts, focusing on East Jerusalem and eastern Ukraine. She interviewed key human rights attorneys working to protect human and civil rights, Israeli government officials, and local residents in the Kafr Aqab neighborhood.[8]\n\nReferences\n\n\n\n"}, {"url": "https://networthpost.org/net-worth/torry-castellano-net-worth/", "page_content": "Torrance Heather Castellano net worth is\n\n$14 Million\n\nTorrance Heather Castellano Wiki: Salary, Married, Wedding, Spouse, Family\n\nStructural Info\n\nFacts\n\nFilmography Full Name Torrance Heather Castellano Net Worth $14 Million Date Of Birth January 8, 1979 Place Of Birth San Francisco, California, USA Height 5' 3\" (1.6 m) Profession Soundtrack, Actress Nicknames Torry Castellano, Castellano, Torry Star Sign Capricorn # Fact 1 She's of Italian origin. 2 Drummer of the rock band, The Donnas. She shares the exact same birthday (month, day and year) as band-mate and bassist Maya Ford. 3 Her cousin is actress Laura San Giacomo. Soundtrack Title Year Status Character The Hangover 2009 writer: \"Take It Off\" - as Torrance Castellano Spring Breakdown 2009 writer: \"Here for the Party\" - as Torrance Castellano Air Guitar Nation 2006 Documentary writer: \"Take It Off\" - as Torrance Castellano Man of the House 2005/I writer: \"Who Invited You\" - as Torrance Castellano Gran Turismo 4 2004 Video Game writer: \"I Don't Want To Know\" - as Torrance Castellano Dodgeball: A True Underdog Story 2004 writer: \"Take It Off\" - as Torrance Castellano New York Minute 2004/I writer: \"Please Don't Tease\" - as Torrance Castellano D.E.B.S. 2004 writer: \"Take Me To The Backseat\" - as Torrance Castellano Grind 2003 writer: \"Too Bad About Your Girl\" - as Torrance Castellano Freaky Friday 2003 writer: \"Backstage\" - as Torrence Costellano What a Girl Wants 2003 writer: \"Who Invited You\" - as Torrance Castellano What's New, Scooby-Doo? 2003 TV Series writer - 1 episode Daria 2000 TV Series writer - 1 episode Actress Title Year Status Character Charmed 2004 TV Series The Donnas Player$ 2003 TV Series Donna C. Drive Me Crazy 1999 Electrocutes Drums (as Torrance Castellano) Jawbreaker 1999 Donna C. Self Title Year Status Character Down & Dirty 2008 TV Series Herself I Love the '70s: Volume 2 2006 TV Series Herself (as The Donnas) I Love the 80's 3-D 2005 TV Series documentary Herself (as The Donnas) MADtv 2005 TV Series Herself I Love the '90s: Part Deux 2005 TV Series documentary Herself (as The Donnas) The Late Late Show with Craig Ferguson 2005 TV Series Herself - Musical Guest I Love the '80s Strikes Back 2003 TV Series documentary Herself (as The Donnas) MTV Video Music Awards 2003 2003 TV Special Herself (as The Donnas) Last Call with Carson Daly 2003 TV Series Musical Guest\n\nKnown for movies\n\nThe Hangover (2009)\n\nas Soundtrack Dodgeball: A True Underdog Story (2004)\n\nas Soundtrack Freaky Friday (2003)\n\nas Soundtrack What a Girl Wants (2003)\n\nas Soundtrack\n\nTorrance Heather \"Torry\" Castellano (born January 8, 1979, in San Francisco, California ) is the former drummer of The Donnas, announcing her retirement in July 2010. She is the cousin of actress Laura San Giacomo.Early in her childhood, she moved to Palo Alto, California, where she met her bandmates. She was asked to be part of the band by Allison Robertson, and agreed even though she did not have any experience. The band rehearsed every day in her garage.Before the release of The Donnas' album Gold Medal, Castellano developed tendonitis. In October 2003, she had surgery for it. During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way. For Gold Medal, she recorded with her recovering wrists, but could only play for short periods of time.A shoulder problem forced Castellano to withdraw from The Donnas' tour following a show on December 27, 2008 at the House Of Blues in Anaheim, CA. Amy Cesari of the band The Demonics filled in on future tour dates. On July 9, 2010, Castellano announced on the band's website that due to her shoulder she would have to retire from drumming and performing with The Donnas. Castellano still attended events the band was involved with as well as promoted the last album she recorded with the band, Greatest Hits Volume 16.She attended Santa Monica College before transferring to Stanford University, where she is in the Class of 2013 and majoring in political science. Torry graduated from Stanford with distinction and will attend Harvard Law School starting in the Fall of 2013.﻿﻿﻿﻿﻿﻿"}, {"url": "https://www.stereogum.com/1968443/brett-anderson-talks-life-since-the-donnas-scoring-commercials-and-shooting-tv-pilots-that-never-aired/interviews/tracking-down/", "page_content": "Welcome to the latest installment of “Tracking Down,” a new Stereogum franchise in which we talk to artists who have been out of the spotlight for a minute.\n\nThe Donnas’ greatest song, “Get Rid Of That Girl” was released two decades ago, and it’s still charming as ever in its ramshackle garage-pop way. In under two minutes these expert Ramone clones figure out how they’re gonna dispatch a “fine” boy’s girlfriend (“I’m gonna drag her by the hair all over town”) and sum up one teenage jealousy dilemma in its most compact form: “Her hair’s so blonde and her nails so long / So I put my Maybellines record on.” The whole thing is perfect brat-pop down to the off-beat “kill kill kill” backing vocals and endearingly DIY cardboard-robot video.\n\nBut they definitely advanced from there, as 1999’s Get Skintight amped up the songcraft and originality more than a bit, finding the quartet at a crossroads of Brill Building (“You Don’t Wanna Call”), hopped-up post-Runaways glam (“Hook It Up”) and hair metal (literally Mötley Crue’s “Too Fast For Love”). The Donnas Turn 21 in 2001 jacked up the AC/DC quotient and the tunes increasingly left behind headlong pop-punk for arena-rock nuggets with guitar solos, which culminated in a major-label debut, Spend The Night and an actual MTV hit, “Take It Off,” the next year. By now, as one of their best early songs put it, the Donnas were unquestionably a “Rock ‘N’ Roll Machine.”\n\nIt’s been 10 years since the last Donnas album, the Jett-black Aquanet tribute Bitchin’, and Stereogum caught up with singer Brett Anderson (aka Donna A.) about what she and her bandmates have been doing over the last decade, and how they headed off the social-media boom at the pass.\n\nSTEREOGUM: Sorry if my voice, like, randomly creaks. I started getting sick yesterday.\n\nANDERSON: Oh no! Well, I’m the last person who would ever judge anyone on their voice. I’ve had a nodule since I was six years old. Of course, I ended up in a career that depended completely on the most defective part of my body.\n\nSTEREOGUM: Did it ever actually hinder you singing?\n\nANDERSON: It constantly hindered my singing! In all our reviews it was like, “Her nicotine-tinged voice…” and I was like, ‘No, I don’t smoke, I just have a fucked-up voice.’ [Laughs.] I had to do rock ‘n’ roll. There’s no way I was gonna be any kind of singer.\n\nSTEREOGUM: How long have the Donnas been inactive? Was it a formal hiatus?\n\nANDERSON: I think our last show was in 2012. And no, we just started playing fewer shows and people started doing other stuff gradually, and after a while it was like… hmm, we haven’t played a show in a long time.\n\nSTEREOGUM: I know you’re studying psychology now.\n\nANDERSON: I just saw Torry [Castellano, drummer], she just moved to Israel to do some kind of fellowship. She also went to Stanford, and then to Harvard. I think she had not taken the bar yet…I think she’s doing this fellowship before she takes the bar. I’m inspired by her path; I came to Stanford after her. Our band has a 100% yield rate so that would look good on my application. “If you admit us, we come! So that would look good for your numbers!”\n\nIt really wasn’t a conscious decision, just a confluence of many, many cultural and economic and political factors combining, which just made it harder and harder to be a working musician. When we started, it was like, you could put songs on the radio, you could have videos on MTV, and we did all those things and it was super exciting. And then Napster happened, and in a way it was really cool because it evened the playing field so that other people could get exposure, and you didn’t need, like, a record label to get your song on the radio. But it didn’t technically turn out like that.\n\nThe reality is that there’s alliances between media conglomerates, so I don’t think that happened quite as much as it could or should have. And it made selling our music — making money off the thing that we make — impossible, so our sales went down. So we had to start trying to earn money in all these peripheral ways, like selling merchandise or the experience of a live show: all just much more difficult, more labor-intensive ways to make money than on the thing you create.\n\nSTEREOGUM: Nothing sucks more than having an artist you like who can’t afford to create.\n\nANDERSON: Yeah, it’s frustrating. And then social media and that component started becoming really central to being successful, so you have to constantly provide content…I don’t want to speak for the other people in my band but I think none of us want to put our whole lives out there, I think we all value privacy. And it just seemed very against my nature to have to be constantly updating all that shit.\n\nSTEREOGUM: Your first album turned 20 this year, how does it feel to look back on two decades of being a successful band?\n\nANDERSON: It’s surreal, I kind of don’t believe it in a way. We were like 13 when we started, and you never think it’s going to turn into anything real, and then when we signed to Lookout! it was like, oh my god, we’re on a record label! And then when we signed to Atlantic it was like, holy shit, this is real! I still feel as surprised about that as the day it happened. So now the fact it’s like history is surreal.\n\nSTEREOGUM: What was your major-label experience like?\n\nANDERSON: I think Atlantic is a great label. Obviously they have a great history in rock ‘n’ roll: Zeppelin, AC/DC. The problem is, when we signed, we had a great team that we got to know, and we chose to work with that label because of those people and the amount of control we were offered versus the advance. And then all those people left and a whole new group of people came in and we’re like, “Who are you guys?” And they’re like “Who are you?”\n\nSTEREOGUM: I get why creative control was so important to the Donnas; I can only try and imagine some of the things men would try to impose on you guys.\n\nANDERSON: [Laughs.] We made a couple pilots for reality shows where we were like, [whispers] “OK, we’re just gonna make this pilot so we seem willing, but we’re not gonna do it, right? We’re gonna bail out, right?” One of them we’re like, looking for Halloween costumes at this Halloween store. I don’t know if you have to do this but every once in a while in your career you have to do something really degrading. Doing a reality show is like the most degrading thing I can imagine.\n\nThere was one really cool one we did, by the guys who did [the animated show] Dr. Katz, and they just taped us talking for a couple hours and were able to have enough material to splice it together. There were songs and psychedelic stuff and rabbits, and it was funny, plus, best of all, I wouldn’t have to be in it.\n\nSTEREOGUM: I think a lot of writers hate doing things like “The Top 10 Miley Cyrus Songs” or something, but I love them, they’re like brain exercises for me and they give me an excuse to do a deep dive on an artist I hardly know sometimes.\n\nANDERSON: That’s how I feel about making music for commercials, which I did for a few years toward the end of the band. [For example, Anderson provided music for Fitbit’s “It’s All Fit” clip. See below. –ed.] I think a lot of people would feel degraded by that, but for me it felt exactly like a brain exercise. Like, “OK, we have these constraints, we have to do this and this and this in that much time, and have to match with this picture.” It’s like a little puzzle.\n\nSTEREOGUM: Liz Phair is, like, an award-winning scorer of soap operas on daytime TV now.\n\nANDERSON: Wow! I would love to spend a whole day with her doing that. I love scores. The new music I’ve made in the last couple years has been really inspired by the scores Nick Cave and Warren Ellis did, like the Assassination Of Jesse James soundtrack, and the music from Twin Peaks and Angelo Badalamenti. Music really is the score for your life. You put on the Donnas and you’re gonna feel empowered and excited and hopefully not feel like things are as heavy as they are. Like day’s over, we’re gonna have fun. But I also like the idea of putting something on and making your day seem more intense or dramatic.\n\nSTEREOGUM: Did you ever struggle with trying to bring in musical ideas that didn’t fit the image the Donnas had been cultivating?\n\nANDERSON: I think part of what kept the band going for so long is that our sound did change a lot. When you look at each record, there is a different thing we’re doing on each record: “Take It Off” is more straightforward and high-energy, and Gold Medal, we just explored more organic sounds with that record, which was really fulfilling and exciting for all of us. And then we went more metal after that. It was exciting seeing what we could get away with, within the constraints of our identity, that wouldn’t seem inauthentic. “Could I play piano on a song?”\n\nSTEREOGUM: Re-listening to all the records within the last few days, I could see the amount of guitar soloing goes up over time.\n\nANDERSON: [Allison Robertson, guitarist] is so good! It was so fun being in a band where, during a solo, I could just turn onstage and be the audience, too.\n\nSTEREOGUM: How intentional was it, politically, that the Donnas’ songwriting perspective seemed to try to even the score by objectifying men?\n\nANDERSON: Yay, you got it! [Laughs.] I can’t tell you how many fucking morning interview shows we’d go to on the radio and they’d be like, [affects dudebro voice] “Sooo, when are you gonna take it off?” And we’d be like, “Can you speak your own fucking language? That is an imperative statement, from us, to other people!”\n\nIt wasn’t like we sat down and strategized intentionally, it just permeated our every conversation, just being an all-female band in a very male-dominated genre and industry. The bands that we loved and were emulating, their lyrics tended to be about objectifying. So what are your options? Either take on that persona and give back what they’re giving, or are you gonna try and be like, the female in that scenario? I just can’t even imagine why anyone would want to do that or how you’d even pull it off.\n\nSTEREOGUM: But it still backfired with, say, morning show radio hosts, too?\n\nANDERSON: That’s just ’cause people are sooooooooooooooooooooooooooooooooo stupidddddddddddddd.\n\nWhen we go to Europe on tour or Australia or Japan, even people for whom English is their second language, get it because they’re actually listening to the lyrics and value musicians as a valuable member of society. When you’re in Europe on tour with your band, they treat you like a doctor or lawyer, the backstage room is decked out when you get to a club, and it may not be the nicest club in the world but they give you all they have because they really value having music and art in their culture. I just don’t think people here, as a whole… it’s just more commercial here.\n\nSTEREOGUM: Did fans often tell you that the Donnas empowered them?\n\nANDERSON: Not explicitly making statements but I feel like we led with our actions more than our words, and I feel that was really motivating for people who’d never seen a female band onstage playing rock ‘n’ roll, both girls and boys! “I saw you guys play and I never felt that was something I could do.”\n\nSTEREOGUM: On a technical, personal level, if I try to play the “Take It Off” riff, there’s like a first-to-fourth finger stretch that I physically cannot do, like my hands are too small for it.\n\nANDERSON: Sometimes we would dumb down the lyrics a little bit, we didn’t want to be too highbrow but more fun and accessible. But musically, we’re all big nerds across the board who’d get down to the details of all the people that we love.\n\nSTEREOGUM: Is there a record you’re particularly proud of that you consider your artistic peak?\n\nANDERSON: I don’t know about everybody, but Gold Medal was really fulfilling. We met PJ Harvey the week we released that record, and it felt like an omen, like we were getting good feedback from the universe at that point in time. I grew up playing piano and I would love to have something to play and hide behind once in a while.\n\nSTEREOGUM: I love the emphasis on harmonies on that record, and these almost psychedelic elements. But Get Skintight is probably my favorite.\n\nANDERSON: Yeah, and it’s probably the one that’s…most like the Donnas, in a way.\n\nSTEREOGUM: After Bitchin’, did you guys continue to write songs and just not want to put something out?\n\nANDERSON: No, we wrote a bunch more songs and recorded some, but I think it just dissipated. We do have a bunch more songs that I think are really awesome.\n\nSTEREOGUM: Do you have any plans to do anything with those in the future?\n\nANDERSON: Not particularly; for me, I’m just struggling to keep up with the minimum I have to do in this one thing I’m doing, so I can’t even imagine trying to keep up with something else.\n\nSTEREOGUM: What’s the biggest misconception about the band?\n\nANDERSON: People constantly thought we didn’t write our own songs or play our instruments. There were literally rumors that there was a guy behind the stage playing the solos. Right now, I’m surrounded by 18 and 19-year-olds all the time, and some are familiar with the band and some aren’t. If they are, it’s usually through Rock Band or Guitar Hero. I don’t feel like we were really misunderstood, but I guess I’m not sure if people were aware of how much we cared about the songwriting.\n\nSTEREOGUM: Have you guys gotten big offers to reunite for festivals or things you’ve had to turn down?"}, {"url": "https://en-academic.com/dic.nsf/enwiki/5107275", "page_content": "Infobox Musical artist\n\nName = Torry Castellano\n\n\n\n\n\nImg_capt = Castellano performing with The Donnas in Finland.\n\nBackground = non_vocal_instrumentalist\n\nBirth_name = Torrance Heather Castellano\n\nBorn = birth date and age|1979|01|08\n\nOrigin = San Francisco, California , U.S.\n\nGenre = Rock\n\nOccupation = Drummer\n\nYears_active = 1993–present\n\nLabel = Lookout!, Atlantic, Purple Feather Records [ [ http://www.allmusic.com/cg/amg.dll?p=amg&sql=11:kbfpxq8hld6e~T20 \"The Donnas > Discography > Main Albums\" ] . Allmusic . Retrieved April 14 , 2007 .]\n\nAssociated_acts = The Donnas\n\nURL = [ http://www.thedonnas.com/ www.thedonnas.com ]\n\nTorrance Heather Castellano fact|date=March 2008 (born January 8 , 1979 , in San Francisco, California [ imdb name|id=0144716|name=Torry Castellano ] ) is the drummer of The Donnas . Her birthday is the same as bandmate Maya Ford month, day, and year. She is the cousin of actress Laura San Giacomo .\n\nEarly in her childhood, she moved to Palo Alto, California , where she met her bandmates. She was asked to be part of the band by Allison Robertson , and agreed even though she did not have any experience. The band rehearsed everyday in her garage.\n\nShe used to date Tre Cool , the drummer of Green Day , and she has made several appearances as herself in episodes of the \"I Love the…\" series on VH1 .\n\nBefore the release of The Donnas ' album \" Gold Medal \", Torry developed tendinitis . On October 2003, she had surgery for it. During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way. For \"Gold Medal\", she recorded with her recovering wrists, but could only play for short periods of time.\n\nTorry is on the Artist Roster for Pearl Drums and uses Vic Firth American Custom SD2 drumsticks.\n\nReferences\n\nExternal links"}, {"url": "https://prabook.com/web/torry.castellano/1793915", "page_content": "Torry Castellano\n\nmusician\n\nJanuary 8, 1979 San Francisco, California, United States of America\n\nShe met future bandmates Maya Ford, Brett Anderson and Allison Robertson in junior high school. They formed a band in 8th grade called Ragady Anne, later calling themselves The Electrocutes at Palo Alto High School. Before the release of The Donnas\" album Gold Medal, Castellano developed tendonitis. In October 2003, she had surgery for lieutenant During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way. Foreign Gold Medal, she recorded with her recovering wrists, but could only play for short periods of time. A shoulder problem forced Castellano to withdraw from The Donnas\" tour following a show on December 27, 2008 at the House Of Blues in Anaheim, California. Amy Cesari of the band The Demonics filled in on future tour dates. On July 9, 2010, Castellano announced on the band\"s website that due to her shoulder she would have to retire from drumming and performing with The Donnas. Castellano still attended events the band was involved with as well as promoted the last album she recorded with the band, Greatest Hits Volume 16. She attended Santa Monica College before transferring to Stanford University, where she is in the Class of 2013 and majoring in political science. Castellano graduated from Stanford with distinction and will attend Harvard Law School starting in the Fall of 2013. Castellano is a cousin of actress Laura San Giacomo."}, {"url": "https://stanfordmag.org/contents/drummer-hits-the-books", "page_content": "When the day arrived last summer for new transfer students to visit Stanford, the sense of anticipation grew. \"I am looking forward to meeting the former rock star,\" an admissions staffer told Sally Mentzer, who coordinates the advising program for transfers.\n\nAs Mentzer notes, that was perfectly accurate, yet someone still could have gotten the wrong impression. To meet Torry Castellano, whose career as a drummer has spanned recording studios, the set of Saturday Night Live and stages in Barcelona, Paris and Tokyo, is to realize how unconcerned she is with popular acclaim.\n\nIn fact, Castellano, '13, was somewhat intimidated by her new surroundings, and she recognized similar feelings among the other 18 transfers. To help cope, she tried to bring them together for karaoke, but then found a better lure: dinner at Mom's. \"Pasta and meatballs,\" explains Castellano. \"About 15 of them were there.\"\n\nMom is a Palo Altan, as was Castellano when she was growing up with the three female friends who became her bandmates, the Donnas. A pop-punk act reminiscent of the Runaways, an all-girl band of the 1970s, the Donnas have been recording and touring since the mid '90s. Plans were announced at the start of the year for a new album, but it will have to be made without Castellano. The victim of uncorrectable shoulder pain from tendonitis and repetitive strain injury, Castellano became one of rock's most youthful retirees last year. She turned 32 in January.\n\nShe didn't surrender her drumsticks easily. But months of rest hadn't worked. Over time, another part of her Los Angeles-based life grew in importance. She had enrolled at Santa Monica College—she took one final online when the band was on tour in Brazil—and began giving serious thought to full-time studies at a university, where she could reinvent herself. She applied to various schools that seemed like reasonable objectives, plus Stanford.\n\n\"I really didn't think I was going to get in,\" says Castellano. \"When I got the acceptance email, I was shaking. And I didn't totally trust it, because it was email. I was crying. I had my mom read it.\"\n\nNo matter how accomplished transfers are before arriving on the Farm—Castellano's contingent includes a former Green Beret, a former radio DJ and a former professional dancer—there's enormous apprehension that comes with entering such an imposing environment. \"That's particularly true,\" says Mentzer, \"if they are transferring from a community or junior college,\" as Castellano did.\n\nWith the Donnas (www.thedonnas.com), Castellano shared a juicy image: \"Pabst-swilling, sex-crazed party animals\" was how a Los Angeles Times writer once distilled it. In reality, the article went on to disclose, they appeared to be \"just regular girls\" who liked iced tea, candy and watching TV.\n\nLooking back, Castellano says, \"There have been many crazy nights, many crazy tours. I don't want to kill the fantasy image of rock 'n' roll life. But there's also a lot of work that goes into being successful, and I was always involved in the business decisions.\"\n\nThe fall quarter at Stanford was partly about solitary nights of keeping up with assignments. But the rest of the experience, in class or almost any conversation on campus, played to her like an intellectual concert. \"Politics, or religion, or philosophy. Everything!\" Her first set of grades: an A and two A-minuses.\n\nBy winter quarter, she had declared a major in political science. That made sense, she said, because she now is thinking ahead—drum roll, please—about possibly applying to law school."}], "Torry Castellano's other musical projects include The Frustrators and The Coverups.": [{"url": "https://www.musicradar.com/news/drums/musicradar-podcast-torry-castellano-142129", "page_content": "Since forming in 1993 to perform for an eighth-grade lunchtime talent show, The Donnas (Brett Anderson, vocals; Maya Ford, bass; Allison Robertson, guitar; and Torry Castellano, drums) have been handing it back to the boys big-time with their kick-ass, let's-party brand of rock and roll.\n\nBig breaks came easy for the California-based band. Before they graduated high school, they had toured Japan. A deal with Lookout! Records led to the band signing to Atlantic in 2001. Albums such as 2002's Spend The Night and 2004's Gold Medal garnered critical raves and won the band fans at all points on the globe, but not enough of them to maintain a major-label deal. Unbowed, The Donnas formed their own Purple Feather Records label, and in 2007 released their most bracing album yet, Bitchin'.\n\nThrough it all, the driving force behind The Donnas is Torry Castellano. The petite powerhouse rocks her Pearl kit with an almost tectonic force. Perhaps the reason she plays with such passion is the fact that she's lucky to be playing at all: In 2003 an acute case of wrist tendinitis (caused by holding her sticks wrong) almost ended her musical career. But through surgery, physical therapy, and a new approach to drumming, Castellano is back on the throne, and better than she's ever been.\n\nMusicRadar caught up with Torry Castellano backstage for a podcast interview before a recent Donnas show in New York City. Listen to the podcast below, and there's more information on The Donnas' official website.\n\nPart one - Torry discusses the band's formation, growing pains, and being tagged as 'punk.'\n\nPart two - She talks about maturing musically, her almost career-ending tendinitis, and future plans."}, {"url": "https://stanfordmag.org/contents/drummer-hits-the-books", "page_content": "When the day arrived last summer for new transfer students to visit Stanford, the sense of anticipation grew. \"I am looking forward to meeting the former rock star,\" an admissions staffer told Sally Mentzer, who coordinates the advising program for transfers.\n\nAs Mentzer notes, that was perfectly accurate, yet someone still could have gotten the wrong impression. To meet Torry Castellano, whose career as a drummer has spanned recording studios, the set of Saturday Night Live and stages in Barcelona, Paris and Tokyo, is to realize how unconcerned she is with popular acclaim.\n\nIn fact, Castellano, '13, was somewhat intimidated by her new surroundings, and she recognized similar feelings among the other 18 transfers. To help cope, she tried to bring them together for karaoke, but then found a better lure: dinner at Mom's. \"Pasta and meatballs,\" explains Castellano. \"About 15 of them were there.\"\n\nMom is a Palo Altan, as was Castellano when she was growing up with the three female friends who became her bandmates, the Donnas. A pop-punk act reminiscent of the Runaways, an all-girl band of the 1970s, the Donnas have been recording and touring since the mid '90s. Plans were announced at the start of the year for a new album, but it will have to be made without Castellano. The victim of uncorrectable shoulder pain from tendonitis and repetitive strain injury, Castellano became one of rock's most youthful retirees last year. She turned 32 in January.\n\nShe didn't surrender her drumsticks easily. But months of rest hadn't worked. Over time, another part of her Los Angeles-based life grew in importance. She had enrolled at Santa Monica College—she took one final online when the band was on tour in Brazil—and began giving serious thought to full-time studies at a university, where she could reinvent herself. She applied to various schools that seemed like reasonable objectives, plus Stanford.\n\n\"I really didn't think I was going to get in,\" says Castellano. \"When I got the acceptance email, I was shaking. And I didn't totally trust it, because it was email. I was crying. I had my mom read it.\"\n\nNo matter how accomplished transfers are before arriving on the Farm—Castellano's contingent includes a former Green Beret, a former radio DJ and a former professional dancer—there's enormous apprehension that comes with entering such an imposing environment. \"That's particularly true,\" says Mentzer, \"if they are transferring from a community or junior college,\" as Castellano did.\n\nWith the Donnas (www.thedonnas.com), Castellano shared a juicy image: \"Pabst-swilling, sex-crazed party animals\" was how a Los Angeles Times writer once distilled it. In reality, the article went on to disclose, they appeared to be \"just regular girls\" who liked iced tea, candy and watching TV.\n\nLooking back, Castellano says, \"There have been many crazy nights, many crazy tours. I don't want to kill the fantasy image of rock 'n' roll life. But there's also a lot of work that goes into being successful, and I was always involved in the business decisions.\"\n\nThe fall quarter at Stanford was partly about solitary nights of keeping up with assignments. But the rest of the experience, in class or almost any conversation on campus, played to her like an intellectual concert. \"Politics, or religion, or philosophy. Everything!\" Her first set of grades: an A and two A-minuses.\n\nBy winter quarter, she had declared a major in political science. That made sense, she said, because she now is thinking ahead—drum roll, please—about possibly applying to law school."}, {"url": "https://www.wikiwand.com/en/Torry_Castellano", "page_content": "Torrance Heather Castellano (born January 8, 1979) is an American percussionist and the former drummer of The Donnas. She announced her retirement from drumming in July 2010.\n\nAmerican drummer\n\nQuick facts: Torry Castellano, Background information, Bir... ▼\n\nMusical artist"}, {"url": "https://www.moderndrummer.com/2008/01/torry-castellano-2/", "page_content": "Torry Castellano: The Grip Of Death\n\nAlthough Donnas drummer Torry Castellano still encourages the idea of being a self-taught musician, she’s quick to admit that she had to learn the hard way that improper technique can cause serious problems. A few years ago after a bout with tendinitis rendered Torry out of commission for several months. After touring for over a year on her pop-punk band’s 2002 release, Spend The Night, Castellano’s problems became so severe that she had to undergo surgery and physical rehabilitation.\n\n“When I got to physical therapy, they called it ‘the grip of death,’” Torry recalls. “They were like, ‘Oh no, you do that?’ But it all ended up being really good. I learned a different technique, and I think I’m a better drummer because of it. It’s all about letting the stick do the work. That way you’re not going crazy, holding the stick so tightly that you’re hurting yourself.”\n\nBesides applying the new technique, Torry began doing warm-up exercises and reconfigured her four-piece Pearl kit. Since then she’s successfully (read: pain-free) recorded and toured behind two more Donnas albums, including 2004’s Gold Medal and their latest, the arena rock–flavored Bitchin’.\n\nCastellano credits producer Jay Ruston (Meatloaf, Polyphonic Spree) for helping to shape her performance on this latest recording. “He definitely encouraged that four-on-the-floor type beat,” she says, “which was a really good direction because I love that beat. But I was asking, ‘Should I really put it in more than one song?’ He was like, ‘It sounds great.’ And when we play those songs live, the rhythm really gets into people.”\n\nWaleed Rashidi"}, {"url": "https://infofair24.com/torry-castellano/", "page_content": "Torry Castellano was born in Brooklyn, New York City. Her musical influences include jazz, gospel, pop, noise, folk and even classical music. She is a founding member of the band Toto. In her younger years, she was a substitute dancer for the cast of Broadway’s “Jesus Christ Superstar” and as a teenager, she appeared in the movie “A Midsummer Night’s Dream.”\n\nTorry Castellano has been described as a “popular musician” due to her versatile talents as a percussionist, singer/songwriter and actress. Torry began playing drums when she was young and continued playing them until she was twenty-one years old. Torry then played bass in many early rock bands before going solo and discovering her true singing talent. She has been described as a very talented “folk artist” due to her interesting vocal style which incorporates a range of tones and pitch variations. Torry has also opened for numerous popular musicians including George Harrison, Eric Clapton and Johnny Jenkins.\n\nTorry Castellano has made twenty-four studio albums and twelve self-written songs. One of her most popular songs “Donna Jane” from her album “Troublemaker” was inspired by the death of her friend and fellow musician Patti LaBelle. This song became a huge hit for Torry and is still currently being used in many schools and churches to this day. Torry Castellano also appeared in the movie “The Social Network” as an attractive and sexy lead character.\n\nTorry Castellano was previously a professional volleyball player. As a player, she was known for her powerful forearms, arm swings, and powerful knees. She lost her ability to play volleyball due to carpal tunnel syndrome, but she has retained her love of sports and is still as passionate as ever. Torry has also drummed for some of the best known American percussionists such as Les Claypool, Paul McCartney, Pino Palladino, Flea of the Red Hot Chili Peppers, Flea of the Bluegrass, Dave Matthews and Yngwie Malmsteen. Torry states that she currently plays drums professionally for about four hours each day.\n\nTorry states that she is presently working as a freelance writer and internet marketer. Her most recent endeavor has been developing a website and blog for her personal financial and career growth as an artist and musician. The website and blog features articles on topics such as how to make money as a musician and what type of music licensing she holds. It also features a section on her views on the global economics and power structures that are currently affecting the world of music today. In addition, she also states that she intends to develop her own music distribution company and offers her musicians and publishers songwriting and recording deals through her company.\n\nTorry states that she is not exactly sure how old she is since at this time in her life she is in the early twenties, but she feels that since she is only a few years older than my son, she might be a few decades older. She states that she has always had long brown hair that is tied back. During our online interview, I noticed that Torry wears glasses and has light skin. This is typical for a musician that has achieved worldwide recognition."}, {"url": "https://genius.com/artists/Torry-castellano", "page_content": "Popular Torry Castellano songs\n\nCheckin' It Out\n\nYou’ve Got a Crush on Me\n\nDo You Wanna Hit It?\n\nFall Behind Me\n\nTake It Off\n\nTorry Castellano Q&A\n\nWhat is the most popular song by Torry Castellano?"}, {"url": "https://en-academic.com/dic.nsf/enwiki/5107275", "page_content": "Infobox Musical artist\n\nName = Torry Castellano\n\n\n\n\n\nImg_capt = Castellano performing with The Donnas in Finland.\n\nBackground = non_vocal_instrumentalist\n\nBirth_name = Torrance Heather Castellano\n\nBorn = birth date and age|1979|01|08\n\nOrigin = San Francisco, California , U.S.\n\nGenre = Rock\n\nOccupation = Drummer\n\nYears_active = 1993–present\n\nLabel = Lookout!, Atlantic, Purple Feather Records [ [ http://www.allmusic.com/cg/amg.dll?p=amg&sql=11:kbfpxq8hld6e~T20 \"The Donnas > Discography > Main Albums\" ] . Allmusic . Retrieved April 14 , 2007 .]\n\nAssociated_acts = The Donnas\n\nURL = [ http://www.thedonnas.com/ www.thedonnas.com ]\n\nTorrance Heather Castellano fact|date=March 2008 (born January 8 , 1979 , in San Francisco, California [ imdb name|id=0144716|name=Torry Castellano ] ) is the drummer of The Donnas . Her birthday is the same as bandmate Maya Ford month, day, and year. She is the cousin of actress Laura San Giacomo .\n\nEarly in her childhood, she moved to Palo Alto, California , where she met her bandmates. She was asked to be part of the band by Allison Robertson , and agreed even though she did not have any experience. The band rehearsed everyday in her garage.\n\nShe used to date Tre Cool , the drummer of Green Day , and she has made several appearances as herself in episodes of the \"I Love the…\" series on VH1 .\n\nBefore the release of The Donnas ' album \" Gold Medal \", Torry developed tendinitis . On October 2003, she had surgery for it. During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way. For \"Gold Medal\", she recorded with her recovering wrists, but could only play for short periods of time.\n\nTorry is on the Artist Roster for Pearl Drums and uses Vic Firth American Custom SD2 drumsticks.\n\nReferences\n\nExternal links"}, {"url": "https://prabook.com/web/torry.castellano/1793915", "page_content": "Torry Castellano\n\nmusician\n\nJanuary 8, 1979 San Francisco, California, United States of America\n\nShe met future bandmates Maya Ford, Brett Anderson and Allison Robertson in junior high school. They formed a band in 8th grade called Ragady Anne, later calling themselves The Electrocutes at Palo Alto High School. Before the release of The Donnas\" album Gold Medal, Castellano developed tendonitis. In October 2003, she had surgery for lieutenant During her recovery, she had to take drum lessons to re-learn to hold drum sticks the correct way. Foreign Gold Medal, she recorded with her recovering wrists, but could only play for short periods of time. A shoulder problem forced Castellano to withdraw from The Donnas\" tour following a show on December 27, 2008 at the House Of Blues in Anaheim, California. Amy Cesari of the band The Demonics filled in on future tour dates. On July 9, 2010, Castellano announced on the band\"s website that due to her shoulder she would have to retire from drumming and performing with The Donnas. Castellano still attended events the band was involved with as well as promoted the last album she recorded with the band, Greatest Hits Volume 16. She attended Santa Monica College before transferring to Stanford University, where she is in the Class of 2013 and majoring in political science. Castellano graduated from Stanford with distinction and will attend Harvard Law School starting in the Fall of 2013. Castellano is a cousin of actress Laura San Giacomo."}]}