{"Albert I, Margrave of Meissen was born around 1240.": [{"url": "https://zhuanlan.zhihu.com/p/437421882", "page_content": "Henry III, Margrave of Meissen\n\nMargrave of Meissen\n\nReign 1221–1288\n\nPredecessor Theodoric I\n\nSuccessor Albert II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nMargrave of Lusatia\n\nReign 1221–1288\n\nPredecessor Theodoric II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nLandgrave of Thuringia,\n\nCount Palatine of Saxony\n\nReign 1242–1265\n\nPredecessor Henry Raspe\n\nSuccessor Albert II\n\nBorn 1215\n\nMeissen, Duchy of Saxony, Holy Roman Empire\n\nDied 15 February 1288 (aged 72–73)\n\nDresden, Duchy of Saxony, Holy Roman Empire\n\nSpouse Constance of Babenberg\n\nAgnes of Bohemia\n\nElisabeth von Maltitz\n\nIssue Albert II, Margrave of Meissen\n\nTheodoric of Landsberg\n\nHouse House of Wettin\n\nFather Theodoric I, Margrave of Meissen\n\nMother Jutta of Thuringia\n\nHenry III, called Henry the Illustrious (Heinrich der Erlauchte) (c. 1215 – 15 February 1288) from the House of Wettin was Margrave of Meissen and last Margrave of Lusatia (as Henry IV) from 1221 until his death; from 1242 also Landgrave of Thuringia.\n\n\n\n\n\nLife\n\nBorn probably at the Albrechtsburg residence in Meissen, Henry was the youngest son of Margrave Theodoric I, Margrave of Meissen and his wife Jutta, daughter of Landgrave Hermann I of Thuringia. In 1221 he succeeded his father as Margrave of Meissen and Lusatia, at first under guardianship of his maternal uncle, Landgrave Louis IV of Thuringia, and after his death in 1227, under that of Duke Albert I of Saxony. In 1230 he was legally proclaimed an adult.\n\nHenry had his first combat experience in sometime around 1234, while on crusade in Prussia, fighting against the Pomesanians. His pilgrimage and company is well-documented by Peter of Dusburg, and it resulted in the construction of Balga castle, an important administrative centre for the Teutonic http://Knights.In 1245 after many years of conflict with the Ascanian margraves of Brandenburg, he was forced to cede the fortresses of Köpenick, Teltow and Mittenwalde north of Lower Lusatia. In 1249 however, the Silesian duke Bolesław II the Bald granted him the eastern area around Schiedlo Castle at the Oder river, where Henry founded the town of Fürstenberg.\n\n\n\n\n\nIn the struggle between the Hohenstaufen Emperor Frederick II and Pope Gregory IX, Henry took the side of the Emperor. In consideration, Frederick II in 1242 promised him the heritage of Henry Raspe as Landgrave of Thuringia and Count palatine of Saxony. In 1243 the Emperor also betrothed his daughter Margaret of Sicily to Henry's son Albert II.\n\n\n\n\n\nHenry remained a loyal supporter of the Hohenstaufens and not before the departure of Frederick's son Conrad IV from Germany did he recognise the antiking William of Holland. After the death of Henry Raspe in 1247, he enforced his rights in Thuringia by military means in the War of the Thuringian Succession against the claims raised by Sophie of Thuringia, daughter of late Landgrave Louis IV, and her husband Duke Henry II of Brabant, as well as by Prince Siegfried I of Anhalt-Zerbst. After a long drawn-out war he detached the Landgraviate of Hesse in the west and gave it to Sophie's younger son Henry, but kept Thuringia, which he granted to his son Albert II together with the Palatinate of Saxony. The Thuringian acquisition significantly increased the Wettin territorial possessions, which now reached from the Silesian border at the Bóbr river in the east up to the Werra in the west, and from the border with Bohemia along the Erzgebirge in the south to the Harz range in the north.\n\n\n\n\n\nFrom 1273 Henry was an important support to the newly elected Rex Romanorum Rudolph of Habsburg in his struggle against rivaling King Ottokar II of Bohemia. Against Bohemia he won, among other places, Sayda and Purschenstein Castle near Neuhausen,\n\n\n\n\n\nHe was known throughout the whole empire as a glittering prince, famous as a patron of the arts and a model knight, and as a significant minnesinger (not to be confused with Heinrich Frauenlob), poet and composer. Henry was patron of many tournaments and singing competitions, in which he also took part himself, and commissioned the famous Christherre-Chronik. He set to music hymns to be sung in the churches, by express permission of the pope.\n\nFamily\n\nIn 1234 Henry married Constance of Babenberg, the daughter of Duke Leopold VI of Austria. Together they had two sons:\n\n\n\n\n\nAlbert II, Margrave of Meissen (1240–1314)\n\nTheodoric of Landsberg (1242–1285)\n\nAs early as 1265 he attached the Imperial Pleissnerland around Altenburg, the dowry of his daughter-in-law Margaret, to the Landgraviate of Thuringia and gave both to his elder son Albert II, otherwise Albert the Degenerate. For his younger son Theodoric, Henry had created – though without imperial consent – the smaller Margraviate of Landsberg in the western part of the Lusatian lands around Leipzig. Henry kept for himself only the Margraviate of Meissen, the remaining Lower Lusatian lands, and a formal power of oversight. Only domestic disorders, caused by the unworthiness of his son Albert, clouded the later years of his reign and indeed, long after his death in 1288, led to the loss of Lusatia and Thuringia.\n\n\n\n\n\nAfter the death of Constance in 1243 Henry took as his second wife Agnes (d. 1268), a daughter of King Wenceslaus I of Bohemia, and in his third marriage the daughter of a ministerialis, or serving knight, Elisabeth von Maltitz, who bore him Friedrich Clem (whose only daughter Elisabeth married Otto II, Prince of Anhalt-Aschersleben) and Hermann the Long.\n\n亨利三世\n\n迈森藩侯\n\n1221-1288年\n\n前任 西奥多里克一世\n\n继任者 阿尔伯特二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n卢萨蒂亚藩侯\n\n1221-1288年\n\n前任 西奥多里二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n图林根方伯，\n\n萨克森行宫伯爵\n\n1242-1265年\n\n前任 亨利·拉斯佩\n\n继任者 阿尔伯特二世\n\n生于1215年\n\n迈森，萨克森公爵领地，神圣罗马帝国\n\n1288年2月15日去世（72-73岁）\n\n德累斯顿，萨克森公国，神圣罗马帝国\n\n配偶\n\n巴本堡的康斯坦斯\n\n波希米亚的阿格尼斯\n\n伊丽莎白·冯·马尔蒂兹\n\n阿尔伯特二世，迈森藩侯\n\n兰德斯伯格的西奥多里克\n\n家族 韦廷\n\n父亲 迈森藩侯狄奥多里克一世\n\n母亲 图林根的朱塔\n\n亨利三世，被称为显赫的亨利（海因里希·德尔洛赫特）（约1215年至1288年2月15日），来自韦廷家族，1221年起成为迈森藩侯、卢萨蒂亚藩侯（亨利四世）直到去世；从1242年起也开始担任图林根方伯。\n\n生活\n\n亨利可能出生在迈森的阿尔布雷希茨堡住宅，他是迈森藩侯西奥多里克一世和他的妻子尤塔（图林根方伯赫尔曼一世的女儿）的最小儿子。1221年，他接替父亲成为迈森和卢萨蒂亚藩侯，最初由他的外祖父图林根方伯路易四世监护，他在1227年去世后，由萨克森的阿尔伯特一世公爵监护。1230年，他被依法宣布为成年人。\n\n亨利在1234年左右的某个时候有了第一次战斗经历，当时他正在普鲁士参加十字军东征，与波美拉尼亚人作战。杜斯堡的彼得详细记录了他的朝圣和陪伴，并建造了巴尔加城堡，这是条顿骑士团的一个重要行政中心。1245年，在与勃兰登堡的阿斯坎尼藩侯多年的冲突后，他被迫割让科佩尼克的堡垒，下卢萨蒂亚北部的泰尔托和米特瓦尔德。然而，1249年，西里西亚公爵博尔斯瓦二世授予他奥德河希德洛城堡周围的东部地区，亨利在那里建立了弗尔斯滕贝格镇。\n\n在霍亨斯陶芬皇帝腓特烈二世和教皇格里高利九世之间的斗争中，亨利站在皇帝一边。考虑到这一点，弗雷德里克二世在1242年承诺将亨利·拉斯佩的遗产作为图林根方伯和萨克森行宫伯爵。1243年，皇帝还将女儿西西里的玛格丽特许配给亨利的儿子阿尔伯特二世。\n\n亨利仍然是霍亨斯陶芬家族的忠实支持者，在弗雷德里克的儿子康拉德四世离开德国之前，他还没有承认荷兰的反国王威廉。1247年亨利·拉斯普去世后，他在图林根继承权战争中以军事手段强制执行了自己在图林根的权利，反对已故兰德格雷夫·路易斯四世的女儿图林根的苏菲及其丈夫布拉班特的亨利二世公爵以及安哈尔特·泽布斯特的西格弗里德一世王子提出的主张。在一场旷日持久的战争之后，他将西部黑森的土地割让给了苏菲的小儿子亨利，但保留了图林根州，并将图林根与萨克森的行宫一起授予了他的儿子阿尔伯特二世。图林根的收购极大地增加了韦廷的领土占有，现在从东部的Bóbr河的西里西亚边界延伸到西部的韦拉，从南部的埃尔兹格比热与波希米亚的边界延伸到北部的哈尔茨山脉。\n\n从1273年起，亨利成为哈布斯堡新当选的罗马国王鲁道夫与波希米亚国王奥托卡二世抗争的重要支持者。在与波希米亚的比赛中，他赢得了赛义达和纽豪森附近的珀申斯坦城堡。他是整个帝国闻名的闪亮王子，以艺术赞助人和模范骑士而闻名，也是一位重要的明尼苏达歌手（不要与海因里希·弗劳恩洛布混淆），诗人和作曲家。亨利是许多锦标赛和歌唱比赛的赞助人，他自己也参加了这些比赛，并委托著名的克里斯瑟尔·克罗尼克参加。经教皇明确许可，他开始在教堂唱圣歌。\n\n家庭\n\n1234年，亨利与奥地利公爵利奥波德六世的女儿巴本堡的康斯坦斯结婚。他们共有两个儿子：\n\n阿尔伯特二世，迈森侯爵（1240-1314）\n\n兰德斯伯格的西奥多里克（1242-1285）\n\n早在1265年，他就将阿尔滕堡周围的帝国普列斯内兰（他的儿媳玛格丽特的嫁妆）附属于图林根州的土地墓穴，并将这两样东西都送给了他的长子堕落的阿尔伯特二世。亨利为他的小儿子西奥多里克在莱比锡附近的卢萨蒂安土地西部创建了一个较小的兰德斯伯格侯国。亨利只为自己保留了迈森的边疆区，其余的下卢萨蒂亚土地，以及正式的监督权。只有由于儿子阿尔伯特的堕落而导致的家庭混乱才给他统治的后期蒙上了阴影，事实上，在他于1288年去世后不久，卢萨蒂亚和图林根就失去了。\n\n1243年康斯坦丝去世后，亨利娶了波希米亚国王温塞斯劳斯一世的女儿阿格尼斯（公元1268年）为第二任妻子，第三次结婚时娶了一位部长或现役骑士伊丽莎白·冯·马尔蒂兹的女儿，后者为亨利生下了弗里德里希·克莱姆（他的唯一女儿伊丽莎白嫁给了安哈尔特·阿斯切勒本王子奥托二世）还有赫尔曼。"}, {"url": "https://www.findagrave.com/memorial/238318263/albrecht-ii-von_meissen", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.wikiwand.com/en/Albert_the_Degenerate,_Margrave_of_Meissen", "page_content": "Albert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nMargrave of Meissen\n\nQuick facts: Albert II, Margrave of Meissen, Reign, Predec... ▼\n\nHe was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria."}, {"url": "https://wiki.alquds.edu/?query=Albert_I,_Margrave_of_Meissen", "page_content": "Albert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife [ edit ]\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors [ edit ]\n\nSee also [ edit ]"}, {"url": "https://wiki2.org/en/Albert_I,_Margrave_of_Meissen", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors\n\nSee also\n\nNotes and references"}, {"url": "https://pantheon.world/profile/person/Albert_I,_Margrave_of_Meissen/", "page_content": "Albert I, Margrave of Meissen\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Albert I, Margrave of Meissen has received more than 21,096 page views. His biography is available in 18 different languages on Wikipedia (up from 17 in 2019) . Albert I, Margrave of Meissen is the 10,792nd most popular politician (down from 10,124th in 2019)."}, {"url": "https://www.biographies.net/people/en/albert_ii_margrave_of_meissen", "page_content": "Who was Albert II, Margrave of Meissen?\n\nAlbert II, the Degenerate was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry the Illustrious, Margrave of Meissen by his first wife, Constantia of Austria."}, {"url": "https://dbpedia.org/resource/Albert_II,_Margrave_of_Meissen", "page_content": "dbo: abstract Albrecht II. Míšeňský zvaný Nezdárný (německy Albrecht der Entartete, 1240 Míšeň – 20. listopadu 1314/1315?, Erfurt) byl lantkrabě durynský a markrabě míšeňský. Svými současníky byl popisován jako neschopný muž proslulý svou zuřivostí. (cs)\n\nΟ Αλβέρτος Β΄ o έκφυλος (γερμ.: Albrecht II., der Entartete, 1240 - 20 Νοεμβρίου 1314) από τον Οίκο των Βέττιν ήταν μάργραβος του Μάισσεν, λάντγκραβος της Θουριγγίας και παλατινός κόμης της Σαξονίας. (el)\n\nAlbrecht II., der Entartete, auch der Unartige (* 1240; † 13. November 1314 – nach anderen Quellen am 20. November 1314 bzw. im Jahre 1315 – in Erfurt), aus dem Geschlecht der Wettiner, war zunächst Landgraf von Thüringen und später auch Markgraf von Meißen. (de)\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin. He was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria. (en)\n\nAlberto II el Malvado (en alemán Albrecht der Unartige (der Entartete), Erfurt, ? 1240 - 13 de noviembre de 1314) fue un noble alemán, Margrave de Meissen y Landgrave de Turingia. Era hijo de Enrique III el Ilustre y (hija del duque de Austria Leopoldo VI Babenberg). (es)\n\nAlbert II le Dégénéré, aussi appelé le Dénaturé en allemand der Entartete ou der Unartige (né en 1240 et mort en 1314) est un margrave de Misnie de 1288 à 1291, landgrave de Thuringe de 1265 à 1307 date de son abdication, comte palatin de Saxe de 1265 à 1281. Il est le fils de Henri III de Misnie et de Constance d'Autriche. (fr)\n\nAlbrecht II, yang Merosot (Bahasa Jerman: Albrecht II der Entartete) (1240 – 20 November 1314) merupakan seorang , dan Comte Palatinus Sachsen. Ia berasal dari Wangsa Wettin. Ia adalah putra sulung Heinrich III dari Meißen dan istri pertamanya, Konstanze dari Babenberg. Albrecht meninggal pada tahun 1314 di Erfurt pada usia tujuh puluh empat tahun. (in)\n\nアルブレヒト2世（Albrecht II., 1240年 - 1314年11月13/20日（一説に1315年ともいう））は、テューリンゲン方伯（在位：1265年 - 1294年）、マイセン辺境伯（在位：1288年 - 1292年）。後妻及びその息子を偏愛して先妻の息子とのお家騒動を招いてしまった為、堕落伯（der Entartete）の不名誉な渾名が付けられた。マイセン辺境伯ハインリヒ3世（貴顕伯）とオーストリア公レオポルト6世の娘コンスタンツェとの間の長男として誕生した。 (ja)\n\nAlberto II di Meißen detto il Degenerato (1240 – Erfurt, 20 novembre 1314) fu margravio di Meißen, langravio di Turingia e conte palatino di Sassonia. Era membro della casata di Wettin. (it)\n\nAlbrecht (Albert) II Wyrodny, Albrecht Zwyrodniały niem. Albrecht II. der Entartete (ur. ok. 1240, zm. 20 listopada 1314 lub w 1315) – landgraf Turyngii od 1265 do 1294, palatyn saski od 1265 do 1281 i margrabia Miśni od 1288 do 1292 z dynastii Wettinów. (pl)\n\nAlbrecht II van Meißen bijgenaamd de Ontaarde (Meißen, 1240 - Erfurt, 20 november 1314) was van 1288 tot 1291 markgraaf van Meißen, van 1265 tot 1291 paltsgraaf van Saksen en van 1265 tot 1294 landgraaf van Thüringen. Hij behoorde tot het huis Wettin. (nl)\n\nAlbrekt II \"den vanartige\", född 1240, död 13 november 1314 i Erfurt, son till Henrik den upplyste, som han efterträdde som markgreve av Meissen, 1288-1314. Han skall hela sitt liv legat i strider med fader, maka, söner och broder. Av hat till sina söner i första giftet med Fredrik II:s dotter Margareta, sålde han Thüringen till den tyske kungen, men utan påföljd. Barn: * Fredrik den frejdige * Diezmann (sv)\n\nА́льбрехт II Него́дный (нем. Albrecht II. der Entartete; 1240 — 20 ноября 1314, Эрфурт) — пфальцграф Саксонии в 1265—1281 годах, ландграф Тюрингии в 1265—1294 годах, маркграф Мейсена в 1265—1293 годах, сын маркграфа Генриха III Светлейшего и Констанции, дочери Леопольда VI, герцога Австрии. (ru)\n\nAlberto II, o Degenerado (em alemão: Albrecht II., der Entartete) (Meissen, 1240 – Erfurt, 20 de novembro de 1314) foi , e conde palatino da Saxônia. Foi membro da Dinastia Wettin, filho mais velho de Henrique III de Meissen com sua primeira esposa, . (pt)\n\nАльбрехт II Вироджений або Неслухняний (нім. Albrecht II. der Entartete auch der Unartige; нар. 1240 — пом. 13 листопада 1314 року) — 23-й в 1265—1293 роках, 8-й в 1265—1294 роках (як Альбрехт I), 21-й пфальцграф Саксонії у 1265—1294 роках. (uk)\n\ndbp: fullName Albert the Degenerate (en)\n\ndbp: name Albert II (en)\n\ndbp: reign 1265 (xsd:integer)\n\n1288 (xsd:integer)\n\nrdfs: comment Albrecht II. Míšeňský zvaný Nezdárný (německy Albrecht der Entartete, 1240 Míšeň – 20. listopadu 1314/1315?, Erfurt) byl lantkrabě durynský a markrabě míšeňský. Svými současníky byl popisován jako neschopný muž proslulý svou zuřivostí. (cs)\n\nΟ Αλβέρτος Β΄ o έκφυλος (γερμ.: Albrecht II., der Entartete, 1240 - 20 Νοεμβρίου 1314) από τον Οίκο των Βέττιν ήταν μάργραβος του Μάισσεν, λάντγκραβος της Θουριγγίας και παλατινός κόμης της Σαξονίας. (el)\n\nAlbrecht II., der Entartete, auch der Unartige (* 1240; † 13. November 1314 – nach anderen Quellen am 20. November 1314 bzw. im Jahre 1315 – in Erfurt), aus dem Geschlecht der Wettiner, war zunächst Landgraf von Thüringen und später auch Markgraf von Meißen. (de)\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin. He was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria. (en)\n\nAlberto II el Malvado (en alemán Albrecht der Unartige (der Entartete), Erfurt, ? 1240 - 13 de noviembre de 1314) fue un noble alemán, Margrave de Meissen y Landgrave de Turingia. Era hijo de Enrique III el Ilustre y (hija del duque de Austria Leopoldo VI Babenberg). (es)\n\nAlbert II le Dégénéré, aussi appelé le Dénaturé en allemand der Entartete ou der Unartige (né en 1240 et mort en 1314) est un margrave de Misnie de 1288 à 1291, landgrave de Thuringe de 1265 à 1307 date de son abdication, comte palatin de Saxe de 1265 à 1281. Il est le fils de Henri III de Misnie et de Constance d'Autriche. (fr)\n\nAlbrecht II, yang Merosot (Bahasa Jerman: Albrecht II der Entartete) (1240 – 20 November 1314) merupakan seorang , dan Comte Palatinus Sachsen. Ia berasal dari Wangsa Wettin. Ia adalah putra sulung Heinrich III dari Meißen dan istri pertamanya, Konstanze dari Babenberg. Albrecht meninggal pada tahun 1314 di Erfurt pada usia tujuh puluh empat tahun. (in)\n\nアルブレヒト2世（Albrecht II., 1240年 - 1314年11月13/20日（一説に1315年ともいう））は、テューリンゲン方伯（在位：1265年 - 1294年）、マイセン辺境伯（在位：1288年 - 1292年）。後妻及びその息子を偏愛して先妻の息子とのお家騒動を招いてしまった為、堕落伯（der Entartete）の不名誉な渾名が付けられた。マイセン辺境伯ハインリヒ3世（貴顕伯）とオーストリア公レオポルト6世の娘コンスタンツェとの間の長男として誕生した。 (ja)\n\nAlberto II di Meißen detto il Degenerato (1240 – Erfurt, 20 novembre 1314) fu margravio di Meißen, langravio di Turingia e conte palatino di Sassonia. Era membro della casata di Wettin. (it)\n\nAlbrecht (Albert) II Wyrodny, Albrecht Zwyrodniały niem. Albrecht II. der Entartete (ur. ok. 1240, zm. 20 listopada 1314 lub w 1315) – landgraf Turyngii od 1265 do 1294, palatyn saski od 1265 do 1281 i margrabia Miśni od 1288 do 1292 z dynastii Wettinów. (pl)\n\nAlbrecht II van Meißen bijgenaamd de Ontaarde (Meißen, 1240 - Erfurt, 20 november 1314) was van 1288 tot 1291 markgraaf van Meißen, van 1265 tot 1291 paltsgraaf van Saksen en van 1265 tot 1294 landgraaf van Thüringen. Hij behoorde tot het huis Wettin. (nl)\n\nAlbrekt II \"den vanartige\", född 1240, död 13 november 1314 i Erfurt, son till Henrik den upplyste, som han efterträdde som markgreve av Meissen, 1288-1314. Han skall hela sitt liv legat i strider med fader, maka, söner och broder. Av hat till sina söner i första giftet med Fredrik II:s dotter Margareta, sålde han Thüringen till den tyske kungen, men utan påföljd. Barn: * Fredrik den frejdige * Diezmann (sv)\n\nА́льбрехт II Него́дный (нем. Albrecht II. der Entartete; 1240 — 20 ноября 1314, Эрфурт) — пфальцграф Саксонии в 1265—1281 годах, ландграф Тюрингии в 1265—1294 годах, маркграф Мейсена в 1265—1293 годах, сын маркграфа Генриха III Светлейшего и Констанции, дочери Леопольда VI, герцога Австрии. (ru)\n\nAlberto II, o Degenerado (em alemão: Albrecht II., der Entartete) (Meissen, 1240 – Erfurt, 20 de novembro de 1314) foi , e conde palatino da Saxônia. Foi membro da Dinastia Wettin, filho mais velho de Henrique III de Meissen com sua primeira esposa, . (pt)\n\nАльбрехт II Вироджений або Неслухняний (нім. Albrecht II. der Entartete auch der Unartige; нар. 1240 — пом. 13 листопада 1314 року) — 23-й в 1265—1293 роках, 8-й в 1265—1294 роках (як Альбрехт I), 21-й пфальцграф Саксонії у 1265—1294 роках. (uk)\n\nrdfs: label Albrecht II. Míšeňský (cs)\n\nAlbrecht II. (Meißen) (de)\n\nΑλβέρτος Β΄ του Μάισσεν (el)\n\nAlbert II, Margrave of Meissen (en)\n\nAlberto II de Meissen (es)\n\nAlbert II le Dégénéré (fr)\n\nAlbrecht II dari Meißen (in)\n\nAlberto II di Meißen (it)\n\nアルブレヒト2世 (マイセン辺境伯) (ja)\n\nAlbrecht II van Meißen (nl)\n\nAlbrecht II Wyrodny (pl)\n\nAlberto II de Meissen (pt)\n\nАльбрехт II (маркграф Мейсена) (ru)\n\nAlbrekt II av Meissen (sv)\n\nАльбрехт II (маркграф Майсену) (uk)"}, {"url": "https://pantheon.world/profile/person/Albert_II,_Margrave_of_Meissen/", "page_content": "Albert II, Margrave of Meissen\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Albert II, Margrave of Meissen has received more than 243,701 page views. His biography is available in 20 different languages on Wikipedia (up from 18 in 2019) . Albert II, Margrave of Meissen is the 4,957th most popular politician (up from 5,222nd in 2019), the 1,361st most popular biography from Germany (up from 1,474th in 2019) and the 409th most popular German Politician."}, {"url": "https://infogalactic.com/info/Albert_II,_Margrave_of_Meissen", "page_content": "From Infogalactic: the planetary knowledge core\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry the Illustrious, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nFile:Dresden Fürstenzug 083.JPG Albert II, Margrave of Meissen (1288–1307) and Frederick I, Margrave of Meissen (1307–1324); Fürstenzug, Dresden, Germany\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269,[1] and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert —suffering financial difficulties— was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless.[2] Elisabeth died on 28 September 1293.[3] Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth.[4] This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four.\n\nAncestors\n\nSee also"}], "Albert I, Margrave of Meissen died on July 13, 1307.": [{"url": "https://theodora.com/encyclopedia/a/albert_the_degenerate.html", "page_content": "ALBERT, surnamed THE Degenerate (c. 1240-1314), land grave of Thuringia, was the eldest son of Henry III., the Illustrious, margrave of Meissen. He married Margaret, daughter of the emperor Frederick II., in 1254, and in 1265 received from his father Thuringia and the Saxon palatinate. His infatuation for Kunigunde of Eisenberg caused his wife to leave him, a.nd after her death in 1270 he married Kunigunde, who had already borne him a son, Apitz or Albert. He wished to make Apitz his successor in Thuringia, a plan which was resisted by his two elder sons, and a war broke out which lasted until 1307, when he abandoned Thuringia, in return for a yearly payment, but retained the title of landgrave (see Thuringia). Albert, who had married Elizabeth, daughter of Hermann III., count of Orlamiinde, after the death of his second wife in 1286, died on the 13th of November 1314.\n\n- Please bookmark this page (add it to your favorites)\n\n- If you wish to link to this page, you can do so by referring to the URL address below.\n\nhttps://theodora.com/encyclopedia/a/albert_the_degenerate.html\n\nThis page was last modified 29-SEP-18\n\nCopyright © 2021 ITA all rights reserved."}, {"url": "https://wiki2.org/en/Albert_I,_Margrave_of_Meissen", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors\n\nSee also\n\nNotes and references"}, {"url": "https://zhuanlan.zhihu.com/p/437421882", "page_content": "Henry III, Margrave of Meissen\n\nMargrave of Meissen\n\nReign 1221–1288\n\nPredecessor Theodoric I\n\nSuccessor Albert II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nMargrave of Lusatia\n\nReign 1221–1288\n\nPredecessor Theodoric II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nLandgrave of Thuringia,\n\nCount Palatine of Saxony\n\nReign 1242–1265\n\nPredecessor Henry Raspe\n\nSuccessor Albert II\n\nBorn 1215\n\nMeissen, Duchy of Saxony, Holy Roman Empire\n\nDied 15 February 1288 (aged 72–73)\n\nDresden, Duchy of Saxony, Holy Roman Empire\n\nSpouse Constance of Babenberg\n\nAgnes of Bohemia\n\nElisabeth von Maltitz\n\nIssue Albert II, Margrave of Meissen\n\nTheodoric of Landsberg\n\nHouse House of Wettin\n\nFather Theodoric I, Margrave of Meissen\n\nMother Jutta of Thuringia\n\nHenry III, called Henry the Illustrious (Heinrich der Erlauchte) (c. 1215 – 15 February 1288) from the House of Wettin was Margrave of Meissen and last Margrave of Lusatia (as Henry IV) from 1221 until his death; from 1242 also Landgrave of Thuringia.\n\n\n\n\n\nLife\n\nBorn probably at the Albrechtsburg residence in Meissen, Henry was the youngest son of Margrave Theodoric I, Margrave of Meissen and his wife Jutta, daughter of Landgrave Hermann I of Thuringia. In 1221 he succeeded his father as Margrave of Meissen and Lusatia, at first under guardianship of his maternal uncle, Landgrave Louis IV of Thuringia, and after his death in 1227, under that of Duke Albert I of Saxony. In 1230 he was legally proclaimed an adult.\n\nHenry had his first combat experience in sometime around 1234, while on crusade in Prussia, fighting against the Pomesanians. His pilgrimage and company is well-documented by Peter of Dusburg, and it resulted in the construction of Balga castle, an important administrative centre for the Teutonic http://Knights.In 1245 after many years of conflict with the Ascanian margraves of Brandenburg, he was forced to cede the fortresses of Köpenick, Teltow and Mittenwalde north of Lower Lusatia. In 1249 however, the Silesian duke Bolesław II the Bald granted him the eastern area around Schiedlo Castle at the Oder river, where Henry founded the town of Fürstenberg.\n\n\n\n\n\nIn the struggle between the Hohenstaufen Emperor Frederick II and Pope Gregory IX, Henry took the side of the Emperor. In consideration, Frederick II in 1242 promised him the heritage of Henry Raspe as Landgrave of Thuringia and Count palatine of Saxony. In 1243 the Emperor also betrothed his daughter Margaret of Sicily to Henry's son Albert II.\n\n\n\n\n\nHenry remained a loyal supporter of the Hohenstaufens and not before the departure of Frederick's son Conrad IV from Germany did he recognise the antiking William of Holland. After the death of Henry Raspe in 1247, he enforced his rights in Thuringia by military means in the War of the Thuringian Succession against the claims raised by Sophie of Thuringia, daughter of late Landgrave Louis IV, and her husband Duke Henry II of Brabant, as well as by Prince Siegfried I of Anhalt-Zerbst. After a long drawn-out war he detached the Landgraviate of Hesse in the west and gave it to Sophie's younger son Henry, but kept Thuringia, which he granted to his son Albert II together with the Palatinate of Saxony. The Thuringian acquisition significantly increased the Wettin territorial possessions, which now reached from the Silesian border at the Bóbr river in the east up to the Werra in the west, and from the border with Bohemia along the Erzgebirge in the south to the Harz range in the north.\n\n\n\n\n\nFrom 1273 Henry was an important support to the newly elected Rex Romanorum Rudolph of Habsburg in his struggle against rivaling King Ottokar II of Bohemia. Against Bohemia he won, among other places, Sayda and Purschenstein Castle near Neuhausen,\n\n\n\n\n\nHe was known throughout the whole empire as a glittering prince, famous as a patron of the arts and a model knight, and as a significant minnesinger (not to be confused with Heinrich Frauenlob), poet and composer. Henry was patron of many tournaments and singing competitions, in which he also took part himself, and commissioned the famous Christherre-Chronik. He set to music hymns to be sung in the churches, by express permission of the pope.\n\nFamily\n\nIn 1234 Henry married Constance of Babenberg, the daughter of Duke Leopold VI of Austria. Together they had two sons:\n\n\n\n\n\nAlbert II, Margrave of Meissen (1240–1314)\n\nTheodoric of Landsberg (1242–1285)\n\nAs early as 1265 he attached the Imperial Pleissnerland around Altenburg, the dowry of his daughter-in-law Margaret, to the Landgraviate of Thuringia and gave both to his elder son Albert II, otherwise Albert the Degenerate. For his younger son Theodoric, Henry had created – though without imperial consent – the smaller Margraviate of Landsberg in the western part of the Lusatian lands around Leipzig. Henry kept for himself only the Margraviate of Meissen, the remaining Lower Lusatian lands, and a formal power of oversight. Only domestic disorders, caused by the unworthiness of his son Albert, clouded the later years of his reign and indeed, long after his death in 1288, led to the loss of Lusatia and Thuringia.\n\n\n\n\n\nAfter the death of Constance in 1243 Henry took as his second wife Agnes (d. 1268), a daughter of King Wenceslaus I of Bohemia, and in his third marriage the daughter of a ministerialis, or serving knight, Elisabeth von Maltitz, who bore him Friedrich Clem (whose only daughter Elisabeth married Otto II, Prince of Anhalt-Aschersleben) and Hermann the Long.\n\n亨利三世\n\n迈森藩侯\n\n1221-1288年\n\n前任 西奥多里克一世\n\n继任者 阿尔伯特二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n卢萨蒂亚藩侯\n\n1221-1288年\n\n前任 西奥多里二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n图林根方伯，\n\n萨克森行宫伯爵\n\n1242-1265年\n\n前任 亨利·拉斯佩\n\n继任者 阿尔伯特二世\n\n生于1215年\n\n迈森，萨克森公爵领地，神圣罗马帝国\n\n1288年2月15日去世（72-73岁）\n\n德累斯顿，萨克森公国，神圣罗马帝国\n\n配偶\n\n巴本堡的康斯坦斯\n\n波希米亚的阿格尼斯\n\n伊丽莎白·冯·马尔蒂兹\n\n阿尔伯特二世，迈森藩侯\n\n兰德斯伯格的西奥多里克\n\n家族 韦廷\n\n父亲 迈森藩侯狄奥多里克一世\n\n母亲 图林根的朱塔\n\n亨利三世，被称为显赫的亨利（海因里希·德尔洛赫特）（约1215年至1288年2月15日），来自韦廷家族，1221年起成为迈森藩侯、卢萨蒂亚藩侯（亨利四世）直到去世；从1242年起也开始担任图林根方伯。\n\n生活\n\n亨利可能出生在迈森的阿尔布雷希茨堡住宅，他是迈森藩侯西奥多里克一世和他的妻子尤塔（图林根方伯赫尔曼一世的女儿）的最小儿子。1221年，他接替父亲成为迈森和卢萨蒂亚藩侯，最初由他的外祖父图林根方伯路易四世监护，他在1227年去世后，由萨克森的阿尔伯特一世公爵监护。1230年，他被依法宣布为成年人。\n\n亨利在1234年左右的某个时候有了第一次战斗经历，当时他正在普鲁士参加十字军东征，与波美拉尼亚人作战。杜斯堡的彼得详细记录了他的朝圣和陪伴，并建造了巴尔加城堡，这是条顿骑士团的一个重要行政中心。1245年，在与勃兰登堡的阿斯坎尼藩侯多年的冲突后，他被迫割让科佩尼克的堡垒，下卢萨蒂亚北部的泰尔托和米特瓦尔德。然而，1249年，西里西亚公爵博尔斯瓦二世授予他奥德河希德洛城堡周围的东部地区，亨利在那里建立了弗尔斯滕贝格镇。\n\n在霍亨斯陶芬皇帝腓特烈二世和教皇格里高利九世之间的斗争中，亨利站在皇帝一边。考虑到这一点，弗雷德里克二世在1242年承诺将亨利·拉斯佩的遗产作为图林根方伯和萨克森行宫伯爵。1243年，皇帝还将女儿西西里的玛格丽特许配给亨利的儿子阿尔伯特二世。\n\n亨利仍然是霍亨斯陶芬家族的忠实支持者，在弗雷德里克的儿子康拉德四世离开德国之前，他还没有承认荷兰的反国王威廉。1247年亨利·拉斯普去世后，他在图林根继承权战争中以军事手段强制执行了自己在图林根的权利，反对已故兰德格雷夫·路易斯四世的女儿图林根的苏菲及其丈夫布拉班特的亨利二世公爵以及安哈尔特·泽布斯特的西格弗里德一世王子提出的主张。在一场旷日持久的战争之后，他将西部黑森的土地割让给了苏菲的小儿子亨利，但保留了图林根州，并将图林根与萨克森的行宫一起授予了他的儿子阿尔伯特二世。图林根的收购极大地增加了韦廷的领土占有，现在从东部的Bóbr河的西里西亚边界延伸到西部的韦拉，从南部的埃尔兹格比热与波希米亚的边界延伸到北部的哈尔茨山脉。\n\n从1273年起，亨利成为哈布斯堡新当选的罗马国王鲁道夫与波希米亚国王奥托卡二世抗争的重要支持者。在与波希米亚的比赛中，他赢得了赛义达和纽豪森附近的珀申斯坦城堡。他是整个帝国闻名的闪亮王子，以艺术赞助人和模范骑士而闻名，也是一位重要的明尼苏达歌手（不要与海因里希·弗劳恩洛布混淆），诗人和作曲家。亨利是许多锦标赛和歌唱比赛的赞助人，他自己也参加了这些比赛，并委托著名的克里斯瑟尔·克罗尼克参加。经教皇明确许可，他开始在教堂唱圣歌。\n\n家庭\n\n1234年，亨利与奥地利公爵利奥波德六世的女儿巴本堡的康斯坦斯结婚。他们共有两个儿子：\n\n阿尔伯特二世，迈森侯爵（1240-1314）\n\n兰德斯伯格的西奥多里克（1242-1285）\n\n早在1265年，他就将阿尔滕堡周围的帝国普列斯内兰（他的儿媳玛格丽特的嫁妆）附属于图林根州的土地墓穴，并将这两样东西都送给了他的长子堕落的阿尔伯特二世。亨利为他的小儿子西奥多里克在莱比锡附近的卢萨蒂安土地西部创建了一个较小的兰德斯伯格侯国。亨利只为自己保留了迈森的边疆区，其余的下卢萨蒂亚土地，以及正式的监督权。只有由于儿子阿尔伯特的堕落而导致的家庭混乱才给他统治的后期蒙上了阴影，事实上，在他于1288年去世后不久，卢萨蒂亚和图林根就失去了。\n\n1243年康斯坦丝去世后，亨利娶了波希米亚国王温塞斯劳斯一世的女儿阿格尼斯（公元1268年）为第二任妻子，第三次结婚时娶了一位部长或现役骑士伊丽莎白·冯·马尔蒂兹的女儿，后者为亨利生下了弗里德里希·克莱姆（他的唯一女儿伊丽莎白嫁给了安哈尔特·阿斯切勒本王子奥托二世）还有赫尔曼。"}, {"url": "https://wiki.alquds.edu/?query=Albert_I,_Margrave_of_Meissen", "page_content": "Albert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife [ edit ]\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors [ edit ]\n\nSee also [ edit ]"}, {"url": "https://prabook.com/web/albert.albert_i_margrave_of_meissen/2557865", "page_content": "Albert Albert I, Margrave of Meissen\n\n1158 (age 37)\n\nIn 1188, he even took his father prisoner. Under the orders of Frederick I, he had to set him free but he was able to obtain the title. After Albert died in 1195 with no children to succeed him. Meissen, with its rich mines, was seized by the emperor Henry VI as a vacant fief of the empire. Dietrich finally came into possession of his inheritance in 1198, following Henry\"s death in 1197."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1474740", "page_content": "Albert II, the Degenerate (de: \"Albrecht II der Entartete\") (b. 1240 – d. Erfurt , 20 November 1314 ), was a Margrave of Meissen , Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin .\n\nHe was the eldest son of Henry the Illustrious, Margrave of Meissen by his first wife, Constantia of Austria .\n\nLife\n\nIn 1265 the Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept from himself the Margraviates of Meissen and Lausitz as a formal power over his sons.\n\nIn June 1255 Albrecht married with Margaret of Sicily , the daughter of Emperor Frederick II. As a dowry the Pleissnerland was pledged to the house of Wettin. They had five children:\n\n# Henry (b. 21 March 1256 - d. 25 January / 23 July ? 1282), inherited the Pleissnerland in 1274.\n\n#Frederick (b. 1257 - d. Wartburg, 16 November 1323 ), Margrave of Meissen.\n\n#Dietrich, called Dietzmann (b. 1260 - murdered Leipzig, 10 December 1307 ), Margrave of Lausitz.\n\n#Margaret (d. young, aft. 17 April 1273 ).\n\n#Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Heinrich I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albrecht turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg . She bore him two children: a daughter, Elisabeth in 1264, and a son, Albrecht (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Dietzmann were looked after by their uncle, Dietrich, Margrave of Landsberg . Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbrecht married with Kunigunde in 1274 and legitimised their children. When Albrecht intended leave to Apitz the Landgraviate of Thuringia and compensating his sons from his first marriage only with the Osterland (who included the inheritance of their mother) and the Palatinate County of Saxony, they began the war against their father. Frederick was captured by his father and was locked on Wartburg; however, he could escape one year later and continue the war against his father together with Dietzmann. During this time, in 1284, their uncle Dietrich of Landsberg died, and four years later, in 1288, also died Heinrich the Illustrious, Albrecht's father. These deaths tightened the family disputes.\n\nBy the death of his father Albrecht became a Margrave of Meissen, while his nephew Frederick Tuta -son of Dietrich of Landsberg- inherited the Margraviate of Lausitz, who was lost by Albrecht's son Dietzmann in that year. Shortly after Frederick capture his father Albrecht in battle. By the Treaty of Rochlitz ( 1 January 1289 ) Albrecht obtain his freedom after the renunciation of big parts of his lands. He retain for himself Meissen, but he finally sold it to Frederick Tuta. When after his death (1291) his cousins Frederick and Dietzmann arbitrarily took possession of his lands, Albrecht -with financial difficulties- was compeled to sell Thuringia in 1293 to the German King Adolf of Nassau ; in the contract, was estipulated the king could take possession of the lands after Albrecht's death. In the sell, Albrecht included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albrecht I of Habsburg was able to take possession of these lands, claimed the contract of sell was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286 . Four years later, on 1 October 1290 , Albrecht married thirdly with Elisabeth of Orlamünde , heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albrecht's son by Kunigunde, was formally legitimazed by the Emperor and created \"Herr of Tenneberg\".\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married with Heinrich III of Frankenstein; the marriage was short-living and childless; Elisabeth died on 28 September 1293 [ [ http://www.thepeerage.com/p10684.htm#i106838 ThePeerage.com ] . In this site Elisabeth's death is cited after 23 April 1326 and her husband is named Heinrich II, not III. Also, the death of Elisabeth's brother Apitz is cited on 27 June 1301 , four years before of the current date of the article.] . Three years later ( 9 October 1296 ), Apitz married with another member of the Frankenstein family. These marriage, like his sister, was childless.\n\nFour years later ( 24 August 1300 ) Albrecht's eldest surviving son, Frederick, married with Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later ( 27 June 1305 ) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albrecht. He was never recovered by the lost.\n\nTwo years later, in 1307, Albrecht finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt , aged seventy-four.\n\nee also\n\n* List of Margraves of Meißen\n\n* Wettin (dynasty)\n\nReferences"}, {"url": "https://infogalactic.com/info/Albert_II,_Margrave_of_Meissen", "page_content": "From Infogalactic: the planetary knowledge core\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry the Illustrious, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nFile:Dresden Fürstenzug 083.JPG Albert II, Margrave of Meissen (1288–1307) and Frederick I, Margrave of Meissen (1307–1324); Fürstenzug, Dresden, Germany\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269,[1] and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert —suffering financial difficulties— was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless.[2] Elisabeth died on 28 September 1293.[3] Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth.[4] This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four.\n\nAncestors\n\nSee also"}, {"url": "http://www.worldheritage.org/articles/Albert,_Margrave_of_Meissen_(1934%E2%80%932012)", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://peoplepill.com/people/albert-ii-margrave-of-meissen/", "page_content": "Albert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albert and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274; he married Hedwig, daughter of Henry III the White. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269, and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert - suffering financial difficulties - was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg. He wished to make Apitz his successor in Thuringia, but the plan was resisted by his two elder sons.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless. Elisabeth died on 28 September 1293. Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth. This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this caused the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four.\n\nAncestors"}, {"url": "https://everything.explained.today/Albert_I%2c_Margrave_of_Meissen/", "page_content": "Albert I, Margrave of Meissen explained\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.His father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.\n\nSee also\n\nNotes and References"}], "Albert I, Margrave of Meissen was German.": [{"url": "https://infogalactic.com/info/Albert_I,_Margrave_of_Meissen", "page_content": "From Infogalactic: the planetary knowledge core\n\nAlbert I, the Proud (de: Albrecht I der Stolze) (1158 – 24 June 1195), was the Margrave of Meissen from 1190 until his death in 1195. His father was Otto II, his mother Hedwig of Brandenburg. He was a member of the House of Wettin.\n\nHis father did not intend to let Albert succeed him, preferring his younger brother Dietrich. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of Frederick I, he had to set him free but he was able to obtain the title. Nevertheless, the conflict with his brother continued as he tried to regain the margraviate.[1][2]\n\nFile:Dresden Fürstenzug 081.JPG Otto II, Margrave of Meissen (1156–1190) and Albert, Margrave of Meissen (1190–1195); Fürstenzug, Dresden, Germany\n\nAfter Albert died in 1195 with no children to succeed him. Meissen, with its rich mines, was seized by the emperor Henry VI as a vacant fief of the empire. Dietrich finally came into possession of his inheritance in 1198, following Henry's death in 1197.[2]\n\nAncestors\n\nSee also"}, {"url": "https://zhuanlan.zhihu.com/p/437421882", "page_content": "Henry III, Margrave of Meissen\n\nMargrave of Meissen\n\nReign 1221–1288\n\nPredecessor Theodoric I\n\nSuccessor Albert II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nMargrave of Lusatia\n\nReign 1221–1288\n\nPredecessor Theodoric II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nLandgrave of Thuringia,\n\nCount Palatine of Saxony\n\nReign 1242–1265\n\nPredecessor Henry Raspe\n\nSuccessor Albert II\n\nBorn 1215\n\nMeissen, Duchy of Saxony, Holy Roman Empire\n\nDied 15 February 1288 (aged 72–73)\n\nDresden, Duchy of Saxony, Holy Roman Empire\n\nSpouse Constance of Babenberg\n\nAgnes of Bohemia\n\nElisabeth von Maltitz\n\nIssue Albert II, Margrave of Meissen\n\nTheodoric of Landsberg\n\nHouse House of Wettin\n\nFather Theodoric I, Margrave of Meissen\n\nMother Jutta of Thuringia\n\nHenry III, called Henry the Illustrious (Heinrich der Erlauchte) (c. 1215 – 15 February 1288) from the House of Wettin was Margrave of Meissen and last Margrave of Lusatia (as Henry IV) from 1221 until his death; from 1242 also Landgrave of Thuringia.\n\n\n\n\n\nLife\n\nBorn probably at the Albrechtsburg residence in Meissen, Henry was the youngest son of Margrave Theodoric I, Margrave of Meissen and his wife Jutta, daughter of Landgrave Hermann I of Thuringia. In 1221 he succeeded his father as Margrave of Meissen and Lusatia, at first under guardianship of his maternal uncle, Landgrave Louis IV of Thuringia, and after his death in 1227, under that of Duke Albert I of Saxony. In 1230 he was legally proclaimed an adult.\n\nHenry had his first combat experience in sometime around 1234, while on crusade in Prussia, fighting against the Pomesanians. His pilgrimage and company is well-documented by Peter of Dusburg, and it resulted in the construction of Balga castle, an important administrative centre for the Teutonic http://Knights.In 1245 after many years of conflict with the Ascanian margraves of Brandenburg, he was forced to cede the fortresses of Köpenick, Teltow and Mittenwalde north of Lower Lusatia. In 1249 however, the Silesian duke Bolesław II the Bald granted him the eastern area around Schiedlo Castle at the Oder river, where Henry founded the town of Fürstenberg.\n\n\n\n\n\nIn the struggle between the Hohenstaufen Emperor Frederick II and Pope Gregory IX, Henry took the side of the Emperor. In consideration, Frederick II in 1242 promised him the heritage of Henry Raspe as Landgrave of Thuringia and Count palatine of Saxony. In 1243 the Emperor also betrothed his daughter Margaret of Sicily to Henry's son Albert II.\n\n\n\n\n\nHenry remained a loyal supporter of the Hohenstaufens and not before the departure of Frederick's son Conrad IV from Germany did he recognise the antiking William of Holland. After the death of Henry Raspe in 1247, he enforced his rights in Thuringia by military means in the War of the Thuringian Succession against the claims raised by Sophie of Thuringia, daughter of late Landgrave Louis IV, and her husband Duke Henry II of Brabant, as well as by Prince Siegfried I of Anhalt-Zerbst. After a long drawn-out war he detached the Landgraviate of Hesse in the west and gave it to Sophie's younger son Henry, but kept Thuringia, which he granted to his son Albert II together with the Palatinate of Saxony. The Thuringian acquisition significantly increased the Wettin territorial possessions, which now reached from the Silesian border at the Bóbr river in the east up to the Werra in the west, and from the border with Bohemia along the Erzgebirge in the south to the Harz range in the north.\n\n\n\n\n\nFrom 1273 Henry was an important support to the newly elected Rex Romanorum Rudolph of Habsburg in his struggle against rivaling King Ottokar II of Bohemia. Against Bohemia he won, among other places, Sayda and Purschenstein Castle near Neuhausen,\n\n\n\n\n\nHe was known throughout the whole empire as a glittering prince, famous as a patron of the arts and a model knight, and as a significant minnesinger (not to be confused with Heinrich Frauenlob), poet and composer. Henry was patron of many tournaments and singing competitions, in which he also took part himself, and commissioned the famous Christherre-Chronik. He set to music hymns to be sung in the churches, by express permission of the pope.\n\nFamily\n\nIn 1234 Henry married Constance of Babenberg, the daughter of Duke Leopold VI of Austria. Together they had two sons:\n\n\n\n\n\nAlbert II, Margrave of Meissen (1240–1314)\n\nTheodoric of Landsberg (1242–1285)\n\nAs early as 1265 he attached the Imperial Pleissnerland around Altenburg, the dowry of his daughter-in-law Margaret, to the Landgraviate of Thuringia and gave both to his elder son Albert II, otherwise Albert the Degenerate. For his younger son Theodoric, Henry had created – though without imperial consent – the smaller Margraviate of Landsberg in the western part of the Lusatian lands around Leipzig. Henry kept for himself only the Margraviate of Meissen, the remaining Lower Lusatian lands, and a formal power of oversight. Only domestic disorders, caused by the unworthiness of his son Albert, clouded the later years of his reign and indeed, long after his death in 1288, led to the loss of Lusatia and Thuringia.\n\n\n\n\n\nAfter the death of Constance in 1243 Henry took as his second wife Agnes (d. 1268), a daughter of King Wenceslaus I of Bohemia, and in his third marriage the daughter of a ministerialis, or serving knight, Elisabeth von Maltitz, who bore him Friedrich Clem (whose only daughter Elisabeth married Otto II, Prince of Anhalt-Aschersleben) and Hermann the Long.\n\n亨利三世\n\n迈森藩侯\n\n1221-1288年\n\n前任 西奥多里克一世\n\n继任者 阿尔伯特二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n卢萨蒂亚藩侯\n\n1221-1288年\n\n前任 西奥多里二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n图林根方伯，\n\n萨克森行宫伯爵\n\n1242-1265年\n\n前任 亨利·拉斯佩\n\n继任者 阿尔伯特二世\n\n生于1215年\n\n迈森，萨克森公爵领地，神圣罗马帝国\n\n1288年2月15日去世（72-73岁）\n\n德累斯顿，萨克森公国，神圣罗马帝国\n\n配偶\n\n巴本堡的康斯坦斯\n\n波希米亚的阿格尼斯\n\n伊丽莎白·冯·马尔蒂兹\n\n阿尔伯特二世，迈森藩侯\n\n兰德斯伯格的西奥多里克\n\n家族 韦廷\n\n父亲 迈森藩侯狄奥多里克一世\n\n母亲 图林根的朱塔\n\n亨利三世，被称为显赫的亨利（海因里希·德尔洛赫特）（约1215年至1288年2月15日），来自韦廷家族，1221年起成为迈森藩侯、卢萨蒂亚藩侯（亨利四世）直到去世；从1242年起也开始担任图林根方伯。\n\n生活\n\n亨利可能出生在迈森的阿尔布雷希茨堡住宅，他是迈森藩侯西奥多里克一世和他的妻子尤塔（图林根方伯赫尔曼一世的女儿）的最小儿子。1221年，他接替父亲成为迈森和卢萨蒂亚藩侯，最初由他的外祖父图林根方伯路易四世监护，他在1227年去世后，由萨克森的阿尔伯特一世公爵监护。1230年，他被依法宣布为成年人。\n\n亨利在1234年左右的某个时候有了第一次战斗经历，当时他正在普鲁士参加十字军东征，与波美拉尼亚人作战。杜斯堡的彼得详细记录了他的朝圣和陪伴，并建造了巴尔加城堡，这是条顿骑士团的一个重要行政中心。1245年，在与勃兰登堡的阿斯坎尼藩侯多年的冲突后，他被迫割让科佩尼克的堡垒，下卢萨蒂亚北部的泰尔托和米特瓦尔德。然而，1249年，西里西亚公爵博尔斯瓦二世授予他奥德河希德洛城堡周围的东部地区，亨利在那里建立了弗尔斯滕贝格镇。\n\n在霍亨斯陶芬皇帝腓特烈二世和教皇格里高利九世之间的斗争中，亨利站在皇帝一边。考虑到这一点，弗雷德里克二世在1242年承诺将亨利·拉斯佩的遗产作为图林根方伯和萨克森行宫伯爵。1243年，皇帝还将女儿西西里的玛格丽特许配给亨利的儿子阿尔伯特二世。\n\n亨利仍然是霍亨斯陶芬家族的忠实支持者，在弗雷德里克的儿子康拉德四世离开德国之前，他还没有承认荷兰的反国王威廉。1247年亨利·拉斯普去世后，他在图林根继承权战争中以军事手段强制执行了自己在图林根的权利，反对已故兰德格雷夫·路易斯四世的女儿图林根的苏菲及其丈夫布拉班特的亨利二世公爵以及安哈尔特·泽布斯特的西格弗里德一世王子提出的主张。在一场旷日持久的战争之后，他将西部黑森的土地割让给了苏菲的小儿子亨利，但保留了图林根州，并将图林根与萨克森的行宫一起授予了他的儿子阿尔伯特二世。图林根的收购极大地增加了韦廷的领土占有，现在从东部的Bóbr河的西里西亚边界延伸到西部的韦拉，从南部的埃尔兹格比热与波希米亚的边界延伸到北部的哈尔茨山脉。\n\n从1273年起，亨利成为哈布斯堡新当选的罗马国王鲁道夫与波希米亚国王奥托卡二世抗争的重要支持者。在与波希米亚的比赛中，他赢得了赛义达和纽豪森附近的珀申斯坦城堡。他是整个帝国闻名的闪亮王子，以艺术赞助人和模范骑士而闻名，也是一位重要的明尼苏达歌手（不要与海因里希·弗劳恩洛布混淆），诗人和作曲家。亨利是许多锦标赛和歌唱比赛的赞助人，他自己也参加了这些比赛，并委托著名的克里斯瑟尔·克罗尼克参加。经教皇明确许可，他开始在教堂唱圣歌。\n\n家庭\n\n1234年，亨利与奥地利公爵利奥波德六世的女儿巴本堡的康斯坦斯结婚。他们共有两个儿子：\n\n阿尔伯特二世，迈森侯爵（1240-1314）\n\n兰德斯伯格的西奥多里克（1242-1285）\n\n早在1265年，他就将阿尔滕堡周围的帝国普列斯内兰（他的儿媳玛格丽特的嫁妆）附属于图林根州的土地墓穴，并将这两样东西都送给了他的长子堕落的阿尔伯特二世。亨利为他的小儿子西奥多里克在莱比锡附近的卢萨蒂安土地西部创建了一个较小的兰德斯伯格侯国。亨利只为自己保留了迈森的边疆区，其余的下卢萨蒂亚土地，以及正式的监督权。只有由于儿子阿尔伯特的堕落而导致的家庭混乱才给他统治的后期蒙上了阴影，事实上，在他于1288年去世后不久，卢萨蒂亚和图林根就失去了。\n\n1243年康斯坦丝去世后，亨利娶了波希米亚国王温塞斯劳斯一世的女儿阿格尼斯（公元1268年）为第二任妻子，第三次结婚时娶了一位部长或现役骑士伊丽莎白·冯·马尔蒂兹的女儿，后者为亨利生下了弗里德里希·克莱姆（他的唯一女儿伊丽莎白嫁给了安哈尔特·阿斯切勒本王子奥托二世）还有赫尔曼。"}, {"url": "https://everything.explained.today/Albert_I%2c_Margrave_of_Meissen/", "page_content": "Albert I, Margrave of Meissen explained\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.His father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.\n\nSee also\n\nNotes and References"}, {"url": "https://everything.explained.today/%5C/Albert%2C_Margrave_of_Meissen_(1934%E2%80%932012)/", "page_content": "Albert, Margrave of Meissen (1934–2012) explained\n\nPrince Albert Joseph Maria Franz-Xaver of Saxony, Duke of Saxony, Margrave of Meissen[2] (30 November 1934[3] – 6 October 2012)[4] was the head of the Royal House of Saxony and a German historian. The fourth child and youngest son of Friedrich Christian, Margrave of Meissen and his wife Princess Elisabeth Helene of Thurn and Taxis, he was the younger brother of Maria Emanuel, Margrave of Meissen, who was his predecessor as head of the Royal House of Saxony. Had he been King he would have been known as Albert II\n\nLife\n\nAlbert received his secondary education at the Federal Gymnasium in Bregenz, Austria. He passed his matura in 1954. His parents and their children then moved to Munich, with support from his mother's relatives from the Thurn und Taxis dynasty. In Munich, Albert studied at the Ludwig Maximilian University. He initially studied macroeconomics, and later switched to history and ethnography. On 13 February 1961, he received his PhD for a thesis on his great-great-grandfather, King John of Saxony, and his reform of Saxon commercial law.\n\nOn 30 January 1960 the German: Studiengruppe für Sächsische Geschichte und Kultur e.V. (\"Study group for Saxon history and culture\") was founded by Albert together with his parents, his elder brother Maria Emanuel, some other Saxon nobles, the Chapter of the Military Order of St. Henry, the chapter of the association of people from Dresden, and the association of Heimatvertriebene in the history department of the University of Munich. This study group became one of the largest historical societies in West Germany. After completing his studies, Albert worked as a historian and referent. He studied the history of the Duchy of Saxony and the Kingdom of Saxony, in particular the relationship of Saxony to Bavaria.\n\nAt times, he was vice president of the German: Bund der Mitteldeutschen (\"Association of Central Germans\"). In 1972, he joined the German: Mitteldeutschen Kulturrat e.V. (\"Central German Culture Council\"), where he represented the interests of the Free State of Saxony.\n\nIn the summer of 1982, he was allowed to visit Saxony for the first time since his youth. He visited again in 1983 and 1985. He was then not allowed to enter the German Democratic Republic again, for unknown reasons, until 1989/1990. On 22 January 1990, he participated in a Monday demonstration in Dresden and was unexpectedly asked to address the crowd. He told his audience about their task to rebuild Saxony and ended with the words \"Long live Saxony, Germany, Europe and the western-Christian culture.\"\n\nIn the subsequent elections for the Saxon parliament, he ran as a DSU candidate; he was not elected, nor did the newly elected government of Saxony employ him as an advisor. After the German reunification, he has tried to reclaim some of his family's former possessions.\n\nMarriage\n\nAlbert morganatically wed Elmira Henke in a civil ceremony on 10 April 1980 in Munich, and in a religious ceremony on 12 April 1980, in the Theatine Church, also in Munich.[5] Elmira assisted Albert with his scientific and historical studies; she specialized in ethnographic topics. Albert and Elmira had no children.[3]\n\nSuccession\n\nThe headship of the Royal House of Saxony is a matter of dispute in the Saxon Royal Family. The conflict stems from the fact that the last undisputed head of the house Maria Emanuel, Margrave of Meissen, and the other princes of his generation either had no children or, in the case of Prince Timo, had children (including Prince Rüdiger of Saxony) who were deemed not to be members of the Royal House of Saxony.[5] [6]\n\nThe first designated dynastic heir of Maria Emanuel was his and Albert's nephew Prince Johannes of Saxe-Coburg and Gotha, only son of their youngest sister Princess Mathilde of Saxony by her marriage to Prince Johannes Heinrich of Saxe-Coburg and Gotha, dynast of a ducal branch of the House of Wettin senior patrilineally to the royal branch.[6] After the early death of Prince Johannes, the heirless Maria Emanuel then considered as potential heir another nephew, Alexander Afif, the eldest son of Princess Anna of Saxony and her husband Roberto Afif, despite the Afif-Saxony marriage being contrary to the traditional laws of the House of Saxony which required equal marriages for descendants to inherit dynastic rights.[6] [7] On 14 May 1997 the Margrave of Meissen proposed his nephew Alexander Afif as heir and drew up a document that was signed by the other male and female members of the Royal House (including previously non-dynastic spouses of princes) setting out that Alexander would succeed on his death. The document was signed by: Anastasia, Margravine of Meissen, Prince Albert and his wife, née Elmira Henke, Prince Dedo (for himself, for his brother Prince Gero and for their stepmother née Virginia Dulon – his brother Prince Timo had died in 1982), the Princesses Maria Josepha, Anna and Mathilde, and Prince Timo's third wife, née Erina Eilts.[8] Two years later on 1 July 1999 the Margrave adopted his nephew Alexander Afif, who had used the title Alexander, Prince of Saxe-Gessaphe since 1972,[9] based on his patrilineal descent from the once-sovereign Lebanese \"Afif\" (or Gessaphe) dynasty.[6] [10]\n\nThe 1997 agreement proved to be controversial and in the summer of 2002 three of the signatories, Princes Albert, Dedo and Gero (the latter consented via proxy but had not personally signed the document)[11] retracted their support for the agreement.[12] [13] The following year Prince Albert wrote that it is through Prince Rüdiger and his sons that the direct line of the Albertine branch of the House of Wettin will continue, and thus avoid becoming extinct.[14] Until his death, however, the Margrave, as head of the former dynasty, continued to regard his nephew and adopted son, Prince Alexander, as the contractual heir entitled to succeed.[15]\n\nImmediately following the death of Maria Emanuel in July 2012, Prince Albert assumed the position of head of the Royal House of Saxony.[13] According to the Eurohistory Journal prior to the Margrave's funeral Albert met with his nephew, Alexander, and recognised him as Margrave of Meissen.[13] [16] However this claim is contradicted by Albert himself in his final interview, given after the funeral, where he states that he needs recognition as Margrave of Meissen.[17] Prince Alexander, citing the 1997 agreement, has also assumed the headship.[13] [18] Albert, Margrave of Meissen died at a hospital in Munich on 6 October 2012 at the age of 77.\n\nPrior to the requiem for Margrave Maria Emanuel, Rüdiger, who had sought to be recognised by his cousin as a dynastic member of the House of Saxony but was refused, conducted a demonstration outside the cathedral with Saxon royalists in protest against the late Margrave Maria Emanuel's decision to appoint Alexander as heir.[13] [19] The family website of Prince Rüdiger states that, prior to his death, Albert determined Rüdiger to be his successor and instituted a clear succession plan.[20] On this basis following Albert's death Prince Rüdiger assumed the headship of the house.[21]\n\nPublications by Prince Albert\n\nDie Reform der sächsischen Gewerbegesetzgebung (1840–1861) , PhD thesis, University of Munich, 1970\n\n, PhD thesis, University of Munich, 1970 Dresden , Weidlich, Frankfurt 1974,\n\n, Weidlich, Frankfurt 1974, Leipzig und das Leipziger Land , Weidlich, Frankfurt 1976,\n\n, Weidlich, Frankfurt 1976, Die Albertinischen Wettiner — Geschichte des Sächsischen Königshauses (1763–1932) , 1st ed., St.-Otto-Verlag, Bamberg, 1989, ; 2d ed., Gräfelfing, 1992,\n\n, 1st ed., St.-Otto-Verlag, Bamberg, 1989, ; 2d ed., Gräfelfing, 1992, Weihnacht in Sachsen , Bayerische Verlagsanstalt, Munich, 1992,\n\n, Bayerische Verlagsanstalt, Munich, 1992, Die Wettiner in Lebensbildern , Styria-Verlag, Vienna, Graz and Cologne, 1995,\n\n, Styria-Verlag, Vienna, Graz and Cologne, 1995, Die Wettiner in Sachsen und Thüringen , König-Friedrich-August-Institut, Dresden, 1996\n\n, König-Friedrich-August-Institut, Dresden, 1996 Das Haus Wettin und die Beziehungen zum Haus Nassau-Luxemburg , Bad Ems, 2003\n\n, Bad Ems, 2003 Bayern & Sachsen — gemeinsame Geschichte, Kunst, Kultur und Wirtschaft (with Elmira of Saxony and Walter Beck), Universitas, Munich, 2004,\n\n(with Elmira of Saxony and Walter Beck), Universitas, Munich, 2004, Königreich Sachsen: 1806–1918; Traditionen in Schwarz und Gelb, Verlagsgesellschaft Marienberg, 2007,\n\nExternal links\n\nNotes and References"}, {"url": "https://pantheon.world/profile/person/Albert_I,_Margrave_of_Meissen/", "page_content": "Albert I, Margrave of Meissen\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Albert I, Margrave of Meissen has received more than 21,096 page views. His biography is available in 18 different languages on Wikipedia (up from 17 in 2019) . Albert I, Margrave of Meissen is the 10,792nd most popular politician (down from 10,124th in 2019)."}, {"url": "https://en.unionpedia.org/i/Albert_I,_Margrave_of_Meissen", "page_content": "Albert I, Margrave of Meissen Albert I (1158 – 24 June 1195), called the Proud (Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death. [1]\n\n16 relations: Adelaide of Meissen, Albert, Margrave of Meissen, Conrad II, Margrave of Lusatia, Dagmar of Bohemia, Dedi III, Margrave of Lusatia, Erbreichsplan, Fürstenzug, Frederick, Duke of Bohemia, Halsbrücke, Hedwig of Brandenburg, Henry VI, Holy Roman Emperor, List of margraves of Meissen, List of margravines of Meissen, Ludmilla of Bohemia, Otto II, Margrave of Meissen, Theodoric I, Margrave of Meissen.\n\nAdelaide of Meissen (Adléta Míšeňská, Adelheid von Meißen; – 2 February 1211), a member of the House of Wettin, was Queen of Bohemia from 1198 to 1199 as the first wife of King Ottokar I. When her husband declared their marriage null and void, she began a longstanding legal dispute that involved numerous religious and secular dignitaries of her time.\n\nNew!!: Albert I, Margrave of Meissen and Adelaide of Meissen · See more »\n\nAlbert, Margrave of Meissen may refer to.\n\nNew!!: Albert I, Margrave of Meissen and Albert, Margrave of Meissen · See more »\n\nMargrave Conrad II of Lusatia, also known as Margrave Konrad II of Landsberg (before 1159 – 6 May 1210), was a member of the House of Wettin.\n\nNew!!: Albert I, Margrave of Meissen and Conrad II, Margrave of Lusatia · See more »\n\nDagmar of Bohemia (also known as Margaret of Bohemia; 1186 – 24 May 1212 in Ribe) was queen consort of Denmark as the first spouse of King Valdemar II of Denmark.\n\nNew!!: Albert I, Margrave of Meissen and Dagmar of Bohemia · See more »\n\nDedi III (Dedo), nicknamed the Fat (– 16 August 1190), a member of the House of Wettin, was Margrave of Lusatia from 1185 until his death.\n\nNew!!: Albert I, Margrave of Meissen and Dedi III, Margrave of Lusatia · See more »\n\nThe Erbreichsplan (German for Plan for a Hereditary Empire) was a plan formed by the Emperor Henry VI to change the Holy Roman Empire from an elective to a hereditary monarchy.\n\nNew!!: Albert I, Margrave of Meissen and Erbreichsplan · See more »\n\nThe Fürstenzug (English: Procession of Princes) in Dresden, Germany, is a large mural of a mounted procession of the rulers of Saxony.\n\nNew!!: Albert I, Margrave of Meissen and Fürstenzug · See more »\n\nFrederick (Bedřich) (– 25 March 1189), a member of the Přemyslid dynasty, was Duke of Bohemia from 1172 to 1173 and again from 1178 to his death.\n\nNew!!: Albert I, Margrave of Meissen and Frederick, Duke of Bohemia · See more »\n\nHalsbrücke is a municipality in the district of Mittelsachsen, in Saxony, Germany.\n\nNew!!: Albert I, Margrave of Meissen and Halsbrücke · See more »\n\nHedwig of Brandenburg, also called Hedwig of Ballenstedt (– end of March 1203), a member of the House of Ascania, was Margravine of Meissen from 1156 until 1190 by her marriage with Margrave Otto II.\n\nNew!!: Albert I, Margrave of Meissen and Hedwig of Brandenburg · See more »\n\nHenry VI (Heinrich VI) (November 1165 – 28 September 1197), a member of the Hohenstaufen dynasty, was King of Germany (King of the Romans) from 1190 and Holy Roman Emperor from 1191 until his death.\n\nNew!!: Albert I, Margrave of Meissen and Henry VI, Holy Roman Emperor · See more »\n\nThis article lists the margraves of Meissen, a march and territorial state on the eastern border of the Holy Roman Empire.\n\nNew!!: Albert I, Margrave of Meissen and List of margraves of Meissen · See more »\n\nThe Margraviate of Meissen was a territorial state on the border of the Holy Roman Empire.\n\nNew!!: Albert I, Margrave of Meissen and List of margravines of Meissen · See more »\n\nLudmilla of Bohemia (died 14 August 1240) was a daughter of Frederick, Duke of Bohemia, and his wife, Elizabeth of Hungary.\n\nNew!!: Albert I, Margrave of Meissen and Ludmilla of Bohemia · See more »\n\nOtto II, the Rich (Otto der Reiche; 1125 – 18 February 1190), a member of the House of Wettin, was Margrave of Meissen from 1156 until his death.\n\nNew!!: Albert I, Margrave of Meissen and Otto II, Margrave of Meissen · See more »\n\nTheodoric I (11 March 1162 – 18 January 1221), called the Oppressed, was the Margrave of Meissen from 1198 until his death.\n\nNew!!: Albert I, Margrave of Meissen and Theodoric I, Margrave of Meissen · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Albert_I,_Margrave_of_Meissen"}, {"url": "https://wiki2.org/en/Albert,_Margrave_of_Meissen_(1934%E2%80%932012)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nMargrave of Meissen\n\nPrince Albert Joseph Maria Franz-Xaver of Saxony, Duke of Saxony, Margrave of Meissen[2] (30 November 1934[3] – 6 October 2012)[4] was the head of the Royal House of Saxony and a German historian. The fourth child and youngest son of Friedrich Christian, Margrave of Meissen and his wife Princess Elisabeth Helene of Thurn and Taxis, he was the younger brother of Maria Emanuel, Margrave of Meissen, who was his predecessor as head of the Royal House of Saxony. Had he been King he would have been known as Albert II\n\nLife\n\nAlbert received his secondary education at the Federal Gymnasium in Bregenz, Austria. He passed his matura in 1954. His parents and their children then moved to Munich, with support from his mother's relatives from the Thurn und Taxis dynasty. In Munich, Albert studied at the Ludwig Maximilian University. He initially studied macroeconomics, and later switched to history and ethnography. On 13 February 1961, he received his PhD for a thesis on his great-great-grandfather, King John of Saxony, and his reform of Saxon commercial law.\n\nOn 30 January 1960 the Studiengruppe für Sächsische Geschichte und Kultur e.V. (\"Study group for Saxon history and culture\") was founded by Albert together with his parents, his elder brother Maria Emanuel, some other Saxon nobles, the Chapter of the Military Order of St. Henry, the chapter of the association of people from Dresden, and the association of Heimatvertriebene in the history department of the University of Munich. This study group became one of the largest historical societies in West Germany. After completing his studies, Albert worked as a historian and referent. He studied the history of the Duchy of Saxony and the Kingdom of Saxony, in particular the relationship of Saxony to Bavaria.\n\nAt times, he was vice president of the Bund der Mitteldeutschen (\"Association of Central Germans\"). In 1972, he joined the Mitteldeutschen Kulturrat e.V. (\"Central German Culture Council\"), where he represented the interests of the Free State of Saxony.\n\nIn the summer of 1982, he was allowed to visit Saxony for the first time since his youth. He visited again in 1983 and 1985. He was then not allowed to enter the German Democratic Republic again, for unknown reasons, until 1989/1990. On 22 January 1990, he participated in a Monday demonstration in Dresden and was unexpectedly asked to address the crowd. He told his audience about their task to rebuild Saxony and ended with the words \"Long live Saxony, Germany, Europe and the western-Christian culture.\"\n\nIn the subsequent elections for the Saxon parliament, he ran as a DSU candidate; he was not elected, nor did the newly elected government of Saxony employ him as an advisor. After the German reunification, he has tried to reclaim some of his family's former possessions.\n\nMarriage\n\nThe Margrave and Margravine of Meissen\n\nAlbert morganatically wed Elmira Henke in a civil ceremony on 10 April 1980 in Munich, and in a religious ceremony on 12 April 1980, in the Theatine Church, also in Munich.[5] Elmira assisted Albert with his scientific and historical studies; she specialized in ethnographic topics. Albert and Elmira had no children.[3]\n\nSuccession\n\nThe headship of the Royal House of Saxony is a matter of dispute in the Saxon Royal Family. The conflict stems from the fact that the last undisputed head of the house Maria Emanuel, Margrave of Meissen, and the other princes of his generation either had no children or, in the case of Prince Timo, had children (including Prince Rüdiger of Saxony) who were deemed not to be members of the Royal House of Saxony.[5] [6]\n\nThe first designated dynastic heir of Maria Emanuel was his and Albert's nephew Prince Johannes of Saxe-Coburg and Gotha, only son of their youngest sister Princess Mathilde of Saxony by her marriage to Prince Johannes Heinrich of Saxe-Coburg and Gotha, dynast of a ducal branch of the House of Wettin senior patrilineally to the royal branch.[6] After the early death of Prince Johannes, the heirless Maria Emanuel then considered as potential heir another nephew, Alexander Afif, the eldest son of Princess Anna of Saxony and her husband Roberto Afif, despite the Afif-Saxony marriage being contrary to the traditional laws of the House of Saxony which required equal marriages for descendants to inherit dynastic rights.[6][7] On 14 May 1997 the Margrave of Meissen proposed his nephew Alexander Afif as heir and drew up a document that was signed by the other male and female members of the Royal House (including previously non-dynastic spouses of princes) setting out that Alexander would succeed on his death. The document was signed by: Anastasia, Margravine of Meissen, Prince Albert and his wife, née Elmira Henke, Prince Dedo (for himself, for his brother Prince Gero and for their stepmother née Virginia Dulon – his brother Prince Timo had died in 1982), the Princesses Maria Josepha, Anna and Mathilde, and Prince Timo's third wife, née Erina Eilts.[8] Two years later on 1 July 1999 the Margrave adopted his nephew Alexander Afif, who had used the title Alexander, Prince of Saxe-Gessaphe since 1972,[9] based on his patrilineal descent from the once-sovereign Lebanese \"Afif\" (or Gessaphe) dynasty.[6][10]\n\nThe 1997 agreement proved to be controversial and in the summer of 2002 three of the signatories, Princes Albert, Dedo and Gero (the latter consented via proxy but had not personally signed the document)[11] retracted their support for the agreement.[12][13] The following year Prince Albert wrote that it is through Prince Rüdiger and his sons that the direct line of the Albertine branch of the House of Wettin will continue, and thus avoid becoming extinct.[14] Until his death, however, the Margrave, as head of the former dynasty, continued to regard his nephew and adopted son, Prince Alexander, as the contractual heir entitled to succeed.[15]\n\nImmediately following the death of Maria Emanuel in July 2012, Prince Albert assumed the position of head of the Royal House of Saxony.[13] According to the Eurohistory Journal prior to the Margrave's funeral Albert met with his nephew, Alexander, and recognised him as Margrave of Meissen.[13][16] However this claim is contradicted by Albert himself in his final interview, given after the funeral, where he states that he needs recognition as Margrave of Meissen.[17] Prince Alexander, citing the 1997 agreement, has also assumed the headship.[13][18] Albert, Margrave of Meissen died at a hospital in Munich on 6 October 2012 at the age of 77.\n\nPrior to the requiem for Margrave Maria Emanuel, Rüdiger, who had sought to be recognised by his cousin as a dynastic member of the House of Saxony but was refused, conducted a demonstration outside the cathedral with Saxon royalists in protest against the late Margrave Maria Emanuel's decision to appoint Alexander as heir.[13][19] The family website of Prince Rüdiger states that, prior to his death, Albert determined Rüdiger to be his successor and instituted a clear succession plan.[20] On this basis following Albert's death Prince Rüdiger assumed the headship of the house.[21]\n\nAncestry\n\nPublications by Prince Albert\n\nDie Reform der sächsischen Gewerbegesetzgebung (1840–1861) , PhD thesis, University of Munich, 1970\n\n, PhD thesis, University of Munich, 1970 Dresden , Weidlich, Frankfurt 1974, ISBN 3-8035-0474-0\n\n, Weidlich, Frankfurt 1974, ISBN 3-8035-0474-0 Leipzig und das Leipziger Land , Weidlich, Frankfurt 1976, ISBN 3-8035-8511-2\n\n, Weidlich, Frankfurt 1976, ISBN 3-8035-8511-2 Die Albertinischen Wettiner — Geschichte des Sächsischen Königshauses (1763–1932) , 1st ed., St.-Otto-Verlag, Bamberg, 1989, ISBN 3-87693-211-4; 2d ed., Gräfelfing, 1992, ISBN 3-87014-020-8\n\n, 1st ed., St.-Otto-Verlag, Bamberg, 1989, ISBN 3-87693-211-4; 2d ed., Gräfelfing, 1992, ISBN 3-87014-020-8 Weihnacht in Sachsen , Bayerische Verlagsanstalt, Munich, 1992, ISBN 3-87052-799-4\n\n, Bayerische Verlagsanstalt, Munich, 1992, ISBN 3-87052-799-4 Die Wettiner in Lebensbildern , Styria-Verlag, Vienna, Graz and Cologne, 1995, ISBN 3-222-12301-2\n\n, Styria-Verlag, Vienna, Graz and Cologne, 1995, ISBN 3-222-12301-2 Die Wettiner in Sachsen und Thüringen , König-Friedrich-August-Institut, Dresden, 1996\n\n, König-Friedrich-August-Institut, Dresden, 1996 Das Haus Wettin und die Beziehungen zum Haus Nassau-Luxemburg , Bad Ems, 2003\n\n, Bad Ems, 2003 Bayern & Sachsen — gemeinsame Geschichte, Kunst, Kultur und Wirtschaft (with Elmira of Saxony and Walter Beck), Universitas, Munich, 2004, ISBN 3-8004-1462-7\n\n(with Elmira of Saxony and Walter Beck), Universitas, Munich, 2004, ISBN 3-8004-1462-7 Königreich Sachsen: 1806–1918; Traditionen in Schwarz und Gelb, Verlagsgesellschaft Marienberg, 2007, ISBN 978-3-931770-67-9\n\nReferences"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=34227128&lang=en", "page_content": "Albert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate. Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.\n\nAncestors\n\nSee also\n\nList of Margraves of Meißen\n\nWettin (dynasty)"}, {"url": "https://www.wikiwand.com/en/Egbert_I,_Margrave_of_Meissen", "page_content": "Egbert I (German: Ekbert) (died 11 January 1068) was the Margrave of Meissen from 1067 until his early death the next year. Egbert was the Count of Brunswick from about 1038, when his father, Liudolf, Margrave of Frisia, died. His mother was Gertrude, the sister of Pope Leo IX.\n\nQuick facts: Egbert I, Died, Noble family, Spouse(s), Issu... ▼\n\nEgbert was the scion of the influential Eastphalian family of the Brunonen. He inherited the familial lands in Brunswick and from about 1051 he shared the chief authority in the region with the Bishop of Hildesheim. Egbert also extended his authority and estates into Frisia under the suzerainty of the Archbishop of Hamburg-Bremen.\n\nAlthough closely related to the Salian dynasty, Egbert participated in the coup d'état of Kaiserswerth in 1062, whereat a group of nobles acting under Anno II, Archbishop of Cologne, tried to seize authority in the kingdom from King Henry IV and his regent mother, the Empress Agnes.\n\nIn 1058, Egbert married Immilla, the daughter of Ulric Manfred II of Turin, and widow of Otto of Schweinfurt. Egbert tried to repudiate Immilla shortly before his death in 1068.[1] His only son, Egbert II, succeeded him in Meissen. His daughter Gertrude later brought Meissen to her husband, Henry von Eilenburg."}, {"url": "https://alchetron.com/Frederick-I,-Margrave-of-Meissen", "page_content": "Frederick I, called the Brave or the Bitten (German: Friedrich der Freidige or Friedrich der Gebissene; 1257 – 16 November 1323) was Margrave of Meissen and Landgrave of Thuringia.\n\nLife\n\nBorn in Eisenach, Frederick was the son of Albert II, Margrave of Meissen and Margaret of Germany. According to legend, his mother, fleeing her philandering husband in 1270, was overcome by the pain of parting and bit Frederick on the cheek: therefore he became known as the Bitten.\n\nAfter the death of Conradin in 1268, he became the legitimate heir to the Hohenstaufen claims, and claimed the Kingdom of Sicily, briefly taking the titles of King of Jerusalem and Sicily and Duke of Swabia. (While not descended from the Kings of Jerusalem, his grandfather Frederick II, Holy Roman Emperor, had claimed the kingdom for himself.)\n\nHowever, these claims met with little favor. Swabia, pawned by Conradin before his last expedition, was disintegrating as a territorial unit. He went unrecognized in Outremer, and Charles of Anjou was deeply entrenched in power in Southern Italy. Margrave Frederick proposed an invasion of Italy in 1269, and attracted some support from the Lombard Ghibellines, but his plans were never carried out, and he played no further part in Italian affairs. From 1280, he was count palatine of Saxony.\n\nBecause his father preferred their half-brother Apitz, Frederick and his brother Diezmann waged war upon him. Frederick was captured in 1281, but after a long war his father recognized the rights of the brothers in 1289. After the death of their cousin Frederick Tuta (1291), both brothers took possession of his lands and Frederick received the Margraviate of Meissen, leaving to their father only the Margraviate of Landsberg. However, King Adolf of Nassau-Weilburg thought that Meissen and the Eastern March should return to the crown after Tuta's death, and bought Thuringia from the debt-laden Albert. The brothers were again called to arms in the defense of their inheritance, but had to give up the land. Frederick stayed away from home until the death of Adolf returned his land to him. By now his father had also been reconciled with him. Soon afterwards, however, King Albert I claimed Thuringia and was supported by the cities, which longed to become independent (reichsunmittelbar). The landgrave's family was besieged on the Wartburg by the Eisenach forces; however, Frederick succeeded in liberating them. But only the victory at Lucka on 31 May 1307 gave the two brothers relief, and before the king could gather new forces, he died.\n\nAfter Diezmann's death (1307) the vassals rendered homage to Frederick only, because Albert had renounced rule for an annuity. Only the cities were still opposed to Frederick. But Erfurt was subjected by force, and he was also reconciled with Emperor Henry VII, to whom Frederick had originally refused to submit. In 1310, the Emperor granted him his lands as fiefs.\n\nHowever, the fight with Brandenburg still continued and when Frederick was captured by Margrave Waldemar, he had to buy his freedom with 32,000 marks of silver and the cession of Lower Lusatia in the Treaty of Tangermünde of 1312. The feuds were renewed in 1316, but ended in 1317 with the Magdeburg Peace. Through the extinction of the Ascanian house, Frederick regained all lost lands except for Landsberg and Lower Lusatia. Now he was able to install a general Landfrieden (peace).\n\nParalyzed by a stroke since 1321, Frederick died on 16 November 1323 at Eisenach. His bones were later moved to Grimmenstein Castle in Gotha and after its demolition were buried in Friedenstein Castle; however, his tomb was erected in Reinhardsbrunn. In 1285, he married Agnes, the daughter of Count Meinhard II of Gorizia-Tyrol and Elisabeth of Bavaria, widowed mother of Conradin, and after her death he married Elizabeth of Arnshaugk, the daughter of his stepmother, in 1303. Only two children survived him, Elizabeth, who was married to Henry II, Landgrave of Hesse, in 1322, and Frederick, his successor.\n\nFamily\n\nFrederick married Agnes of Gorizia-Tyrol (d. 14 May 1293) in 1286, daughter of Meinhard, Duke of Carinthia and Elisabeth of Bavaria. They had one son:\n\nFrederick the Lame (9 May 1293 – 13 January 1315, Zwenkau), married Anna (d. 22 November 1327, Wismar), daughter of Albert II, Duke of Saxe-Wittenberg\n\nHe married Elizabeth of Lobdeburg-Arnshaugk (1286 – 22 August 1359, Gotha) on 24 August 1300 and they had two children:"}]}