{"Albert I, Margrave of Meissen was succeeded by his son Dietrich III.": [{"url": "https://zhuanlan.zhihu.com/p/437421882", "page_content": "Henry III, Margrave of Meissen\n\nMargrave of Meissen\n\nReign 1221–1288\n\nPredecessor Theodoric I\n\nSuccessor Albert II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nMargrave of Lusatia\n\nReign 1221–1288\n\nPredecessor Theodoric II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nLandgrave of Thuringia,\n\nCount Palatine of Saxony\n\nReign 1242–1265\n\nPredecessor Henry Raspe\n\nSuccessor Albert II\n\nBorn 1215\n\nMeissen, Duchy of Saxony, Holy Roman Empire\n\nDied 15 February 1288 (aged 72–73)\n\nDresden, Duchy of Saxony, Holy Roman Empire\n\nSpouse Constance of Babenberg\n\nAgnes of Bohemia\n\nElisabeth von Maltitz\n\nIssue Albert II, Margrave of Meissen\n\nTheodoric of Landsberg\n\nHouse House of Wettin\n\nFather Theodoric I, Margrave of Meissen\n\nMother Jutta of Thuringia\n\nHenry III, called Henry the Illustrious (Heinrich der Erlauchte) (c. 1215 – 15 February 1288) from the House of Wettin was Margrave of Meissen and last Margrave of Lusatia (as Henry IV) from 1221 until his death; from 1242 also Landgrave of Thuringia.\n\n\n\n\n\nLife\n\nBorn probably at the Albrechtsburg residence in Meissen, Henry was the youngest son of Margrave Theodoric I, Margrave of Meissen and his wife Jutta, daughter of Landgrave Hermann I of Thuringia. In 1221 he succeeded his father as Margrave of Meissen and Lusatia, at first under guardianship of his maternal uncle, Landgrave Louis IV of Thuringia, and after his death in 1227, under that of Duke Albert I of Saxony. In 1230 he was legally proclaimed an adult.\n\nHenry had his first combat experience in sometime around 1234, while on crusade in Prussia, fighting against the Pomesanians. His pilgrimage and company is well-documented by Peter of Dusburg, and it resulted in the construction of Balga castle, an important administrative centre for the Teutonic http://Knights.In 1245 after many years of conflict with the Ascanian margraves of Brandenburg, he was forced to cede the fortresses of Köpenick, Teltow and Mittenwalde north of Lower Lusatia. In 1249 however, the Silesian duke Bolesław II the Bald granted him the eastern area around Schiedlo Castle at the Oder river, where Henry founded the town of Fürstenberg.\n\n\n\n\n\nIn the struggle between the Hohenstaufen Emperor Frederick II and Pope Gregory IX, Henry took the side of the Emperor. In consideration, Frederick II in 1242 promised him the heritage of Henry Raspe as Landgrave of Thuringia and Count palatine of Saxony. In 1243 the Emperor also betrothed his daughter Margaret of Sicily to Henry's son Albert II.\n\n\n\n\n\nHenry remained a loyal supporter of the Hohenstaufens and not before the departure of Frederick's son Conrad IV from Germany did he recognise the antiking William of Holland. After the death of Henry Raspe in 1247, he enforced his rights in Thuringia by military means in the War of the Thuringian Succession against the claims raised by Sophie of Thuringia, daughter of late Landgrave Louis IV, and her husband Duke Henry II of Brabant, as well as by Prince Siegfried I of Anhalt-Zerbst. After a long drawn-out war he detached the Landgraviate of Hesse in the west and gave it to Sophie's younger son Henry, but kept Thuringia, which he granted to his son Albert II together with the Palatinate of Saxony. The Thuringian acquisition significantly increased the Wettin territorial possessions, which now reached from the Silesian border at the Bóbr river in the east up to the Werra in the west, and from the border with Bohemia along the Erzgebirge in the south to the Harz range in the north.\n\n\n\n\n\nFrom 1273 Henry was an important support to the newly elected Rex Romanorum Rudolph of Habsburg in his struggle against rivaling King Ottokar II of Bohemia. Against Bohemia he won, among other places, Sayda and Purschenstein Castle near Neuhausen,\n\n\n\n\n\nHe was known throughout the whole empire as a glittering prince, famous as a patron of the arts and a model knight, and as a significant minnesinger (not to be confused with Heinrich Frauenlob), poet and composer. Henry was patron of many tournaments and singing competitions, in which he also took part himself, and commissioned the famous Christherre-Chronik. He set to music hymns to be sung in the churches, by express permission of the pope.\n\nFamily\n\nIn 1234 Henry married Constance of Babenberg, the daughter of Duke Leopold VI of Austria. Together they had two sons:\n\n\n\n\n\nAlbert II, Margrave of Meissen (1240–1314)\n\nTheodoric of Landsberg (1242–1285)\n\nAs early as 1265 he attached the Imperial Pleissnerland around Altenburg, the dowry of his daughter-in-law Margaret, to the Landgraviate of Thuringia and gave both to his elder son Albert II, otherwise Albert the Degenerate. For his younger son Theodoric, Henry had created – though without imperial consent – the smaller Margraviate of Landsberg in the western part of the Lusatian lands around Leipzig. Henry kept for himself only the Margraviate of Meissen, the remaining Lower Lusatian lands, and a formal power of oversight. Only domestic disorders, caused by the unworthiness of his son Albert, clouded the later years of his reign and indeed, long after his death in 1288, led to the loss of Lusatia and Thuringia.\n\n\n\n\n\nAfter the death of Constance in 1243 Henry took as his second wife Agnes (d. 1268), a daughter of King Wenceslaus I of Bohemia, and in his third marriage the daughter of a ministerialis, or serving knight, Elisabeth von Maltitz, who bore him Friedrich Clem (whose only daughter Elisabeth married Otto II, Prince of Anhalt-Aschersleben) and Hermann the Long.\n\n亨利三世\n\n迈森藩侯\n\n1221-1288年\n\n前任 西奥多里克一世\n\n继任者 阿尔伯特二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n卢萨蒂亚藩侯\n\n1221-1288年\n\n前任 西奥多里二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n图林根方伯，\n\n萨克森行宫伯爵\n\n1242-1265年\n\n前任 亨利·拉斯佩\n\n继任者 阿尔伯特二世\n\n生于1215年\n\n迈森，萨克森公爵领地，神圣罗马帝国\n\n1288年2月15日去世（72-73岁）\n\n德累斯顿，萨克森公国，神圣罗马帝国\n\n配偶\n\n巴本堡的康斯坦斯\n\n波希米亚的阿格尼斯\n\n伊丽莎白·冯·马尔蒂兹\n\n阿尔伯特二世，迈森藩侯\n\n兰德斯伯格的西奥多里克\n\n家族 韦廷\n\n父亲 迈森藩侯狄奥多里克一世\n\n母亲 图林根的朱塔\n\n亨利三世，被称为显赫的亨利（海因里希·德尔洛赫特）（约1215年至1288年2月15日），来自韦廷家族，1221年起成为迈森藩侯、卢萨蒂亚藩侯（亨利四世）直到去世；从1242年起也开始担任图林根方伯。\n\n生活\n\n亨利可能出生在迈森的阿尔布雷希茨堡住宅，他是迈森藩侯西奥多里克一世和他的妻子尤塔（图林根方伯赫尔曼一世的女儿）的最小儿子。1221年，他接替父亲成为迈森和卢萨蒂亚藩侯，最初由他的外祖父图林根方伯路易四世监护，他在1227年去世后，由萨克森的阿尔伯特一世公爵监护。1230年，他被依法宣布为成年人。\n\n亨利在1234年左右的某个时候有了第一次战斗经历，当时他正在普鲁士参加十字军东征，与波美拉尼亚人作战。杜斯堡的彼得详细记录了他的朝圣和陪伴，并建造了巴尔加城堡，这是条顿骑士团的一个重要行政中心。1245年，在与勃兰登堡的阿斯坎尼藩侯多年的冲突后，他被迫割让科佩尼克的堡垒，下卢萨蒂亚北部的泰尔托和米特瓦尔德。然而，1249年，西里西亚公爵博尔斯瓦二世授予他奥德河希德洛城堡周围的东部地区，亨利在那里建立了弗尔斯滕贝格镇。\n\n在霍亨斯陶芬皇帝腓特烈二世和教皇格里高利九世之间的斗争中，亨利站在皇帝一边。考虑到这一点，弗雷德里克二世在1242年承诺将亨利·拉斯佩的遗产作为图林根方伯和萨克森行宫伯爵。1243年，皇帝还将女儿西西里的玛格丽特许配给亨利的儿子阿尔伯特二世。\n\n亨利仍然是霍亨斯陶芬家族的忠实支持者，在弗雷德里克的儿子康拉德四世离开德国之前，他还没有承认荷兰的反国王威廉。1247年亨利·拉斯普去世后，他在图林根继承权战争中以军事手段强制执行了自己在图林根的权利，反对已故兰德格雷夫·路易斯四世的女儿图林根的苏菲及其丈夫布拉班特的亨利二世公爵以及安哈尔特·泽布斯特的西格弗里德一世王子提出的主张。在一场旷日持久的战争之后，他将西部黑森的土地割让给了苏菲的小儿子亨利，但保留了图林根州，并将图林根与萨克森的行宫一起授予了他的儿子阿尔伯特二世。图林根的收购极大地增加了韦廷的领土占有，现在从东部的Bóbr河的西里西亚边界延伸到西部的韦拉，从南部的埃尔兹格比热与波希米亚的边界延伸到北部的哈尔茨山脉。\n\n从1273年起，亨利成为哈布斯堡新当选的罗马国王鲁道夫与波希米亚国王奥托卡二世抗争的重要支持者。在与波希米亚的比赛中，他赢得了赛义达和纽豪森附近的珀申斯坦城堡。他是整个帝国闻名的闪亮王子，以艺术赞助人和模范骑士而闻名，也是一位重要的明尼苏达歌手（不要与海因里希·弗劳恩洛布混淆），诗人和作曲家。亨利是许多锦标赛和歌唱比赛的赞助人，他自己也参加了这些比赛，并委托著名的克里斯瑟尔·克罗尼克参加。经教皇明确许可，他开始在教堂唱圣歌。\n\n家庭\n\n1234年，亨利与奥地利公爵利奥波德六世的女儿巴本堡的康斯坦斯结婚。他们共有两个儿子：\n\n阿尔伯特二世，迈森侯爵（1240-1314）\n\n兰德斯伯格的西奥多里克（1242-1285）\n\n早在1265年，他就将阿尔滕堡周围的帝国普列斯内兰（他的儿媳玛格丽特的嫁妆）附属于图林根州的土地墓穴，并将这两样东西都送给了他的长子堕落的阿尔伯特二世。亨利为他的小儿子西奥多里克在莱比锡附近的卢萨蒂安土地西部创建了一个较小的兰德斯伯格侯国。亨利只为自己保留了迈森的边疆区，其余的下卢萨蒂亚土地，以及正式的监督权。只有由于儿子阿尔伯特的堕落而导致的家庭混乱才给他统治的后期蒙上了阴影，事实上，在他于1288年去世后不久，卢萨蒂亚和图林根就失去了。\n\n1243年康斯坦丝去世后，亨利娶了波希米亚国王温塞斯劳斯一世的女儿阿格尼斯（公元1268年）为第二任妻子，第三次结婚时娶了一位部长或现役骑士伊丽莎白·冯·马尔蒂兹的女儿，后者为亨利生下了弗里德里希·克莱姆（他的唯一女儿伊丽莎白嫁给了安哈尔特·阿斯切勒本王子奥托二世）还有赫尔曼。"}, {"url": "https://www.geni.com/people/Albrecht-I-der-Stolze-Markgraf-von-Mei%C3%9Fen/6000000007462278739", "page_content": "About Albrecht I 'der Stolze' Markgraf von Meißen\n\nhttp://de.wikisource.org/wiki/ADB:Albrecht_I._der_Stolze\n\n------------------------------------------\n\nAlbrecht Markgraf von Meißen (1)\n\nM, #113945, b. 1158, d. 25 June 1195\n\nLast Edited=22 Jun 2003\n\nAlbrecht Markgraf von Meißen was born in 1158. (1)\n\nHe was the son of Otto Markgraf von Meißen and Hedwig von Brandenburg.\n\nHe married Sophie of Bohemia, daughter of Friedrich, King of Bohemia and Elisabeth Arpád, on 23 April 1186 at Aussig.\n\nHe died on 25 June 1195.\n\nAlbrecht Markgraf von Meißen also went by the nick-name of Albrecht 'the Proud'. He succeeded to the title of Markgraf von Meißen in 1190. (1)\n\nChild of Albrecht Markgraf von Meißen and Sophie of Bohemia\n\n-1. Christine von Meißen d. a 1251\n\nForrás / Source:\n\nhttp://www.thepeerage.com/p11395.htm#i113945"}, {"url": "https://infogalactic.com/info/Albert_II,_Margrave_of_Meissen", "page_content": "From Infogalactic: the planetary knowledge core\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry the Illustrious, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nFile:Dresden Fürstenzug 083.JPG Albert II, Margrave of Meissen (1288–1307) and Frederick I, Margrave of Meissen (1307–1324); Fürstenzug, Dresden, Germany\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269,[1] and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert —suffering financial difficulties— was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless.[2] Elisabeth died on 28 September 1293.[3] Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth.[4] This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four.\n\nAncestors\n\nSee also"}, {"url": "https://www.unofficialroyalty.com/albert-margrave-of-meissen/", "page_content": "by Scott Mehl\n\n© Unofficial Royalty 2021\n\nAlbert, Margrave of Meissen was briefly one of the disputed Heads of the House of Saxony, and pretender to the former throne of the Kingdom of Saxony.\n\nAlbert Joseph Maria Franz-Xaver, Prince of Saxony was born in Bamberg, Bavaria on November 30, 1934. He was the younger son of Prince Friedrich Christian of Saxony, Margrave of Meissen and Princess Elisabeth Helene of Thurn und Taxis, and had four siblings:\n\nPrince Maria Emanuel, Margrave of Meissen (1926) – married Princess Anastasia of Anhalt, no issue\n\nPrincess Maria Josepha (1928) – unmarried\n\nPrincess Anna (1929) – married Roberto de Afif, had issue\n\nPrincess Mathilde (1936) – married Prince Johannes Heinrich of Saxe-Coburg and Gotha, had issue\n\nAfter finishing secondary school in Bregenz, Austria, the family moved to Munich where Albert studied history and ethnography at the Ludwig Maximilian University, receiving his Ph.D. in 1961. He worked as a historian, particularly studying the history of the Duchy and then the Kingdom of Saxony and their relationship to Bavaria.\n\nIn a civil ceremony on April 10, 1980 and a religious ceremony two days later at the Theatinerkirche in Munich, Albert married Elmira Henke. She had been his assistant for many years. They had no children.\n\nUpon the death of his elder brother, Maria Emanuel, in July 2012, Albert assumed the Headship of the House of Saxony. This was disputed as Maria Emanuel had named, and adopted, his nephew, Prince Alexander of Saxe-Gessaphe as his rightful heir. (More on the succession dispute below). However, Albert’s role in the dispute was short-lived, as he passed away in Munich just three months later, on October 6, 2012. He is buried in the Old Catholic Cemetery in Dresden along with his wife.\n\nSUCCESSION DISPUTE\n\nHaving no children, in May 1977 Maria Emanuel named his nephew, Prince Alexander of Saxe-Gessaphe, as his heir. Alexander was the son of the Margrave’s eldest sister Anna. A document was drafted and agreed to, and signed by, all the other members of the former royal house. And two years later, in September 1999, Maria Emanuel legally adopted Alexander. However, in 2002, three of the family members retracted their agreement. One of them was Maria Emanuel’s younger brother, Albert, who stated that the headship of the family should eventually pass to Prince Rüdiger – the son of their late cousin, Prince Timo of Saxony. Despite this disagreement, Maria Emanuel continued to assert that Prince Alexander was his rightful heir. Following his death in July 2012, both Albert and Alexander claimed the headship of the family. When Albert died just three months later, the dispute intensified. Prince Rüdiger claimed that he was the rightful heir, and assumed the title Margrave of Meissen, just as Prince Alexander had done upon Maria Emanuel’s death.\n\nIn 2015, the heads of three Ernestine branches of the House of Wettin – Michael, Prince of Saxe-Weimar-Eisenach, Andreas, Prince of Saxe-Coburg and Gotha, and Konrad, Prince of Saxe-Meiningen – issued a statement stating that they did not recognize Prince Alexander as Head of the House of Saxony, nor as Margrave of Meissen. It is notable that their statement did not specifically recognize Prince Rüdiger either.\n\n* * * * * * * * * *\n\nSaxony Resources at Unofficial Royalty\n\n* * * * * * * * * *\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty."}, {"url": "https://www.geni.com/people/Konrad-I-the-Pious-Great-Margrave-of-Mei%C3%9Fen/6000000003827305543", "page_content": "About Konrad I \"the Pious, Great,\" Margrave of Meißen\n\nSummary for Konrad I \"der Grosse\" Markgraf von Meissen\n\nParents:\n\nFather: Thiemo II, Graf von Wettin (b. 1010/1015 or c. 1034 - d. after 1099/1101) or Thimo III \"der Jungere\" (the Brave), Graf von Brehna (c. 1055 - d. 1118/1124)\n\nMother: Ida von Northeim or Bertha von Groitzsch (a.k.a. Berta von Morungen) (b. ? - d. 1144)\n\nSiblings:\n\n1. Dedo IV (d. 16 December 1124) Graf von Wettin, Graf von Groitzsch. m. Berta von Morungen (d. 16 June 1144), daughter of WIPRECHT [II] Graf von Groitzsch, Markgraf von Meissen and Judith of Bohemia.\n\n3. Mathilde (d. 22 January 1155), m1. Gero, Graf von Seeburg, m2. Ludwig II von Wippra.\n\nSpouse:\n\nLuitgard von Elchingen (d. 19 June 1145 at Kloster Geberstedt, daughter of Adalbert, Graf von Elchingen-Ravenstein, and Bertha)\n\nChildren:\n\n1. Heinrich (died young).\n\n2. Otto \"der Reiche\" (c1125 - 18 February 1190), Markgraf von Meissen, zu Colditz und Lausick (present Leipzig, 1156-1190)\n\n3. Oda (d. 2 June, unknown year), Abbess of Gerbstedt in 1137.\n\n4. Berta, Abbess of Gerbstedt in 1190.\n\n5. Dietrich (d. 9 February 1185), Markgraf der Niederlausitz und Graf von Eilenburg (1156-1185), m. in 1142 Dobronega Ludgarda of Poland. Had mistress Kunigunde from Bayern after October 1147.\n\n6. Posibly Gertrud. m. Hermann von Stahleck (d. 2 October 1156), Graf von Stahleck and Pfalzgraf von Lothringen (1138-1155), brother of Konrad III, King of Germany.\n\n7. Adelheid (d. after 6 December 1172), m1. in 1152, Svend III Erikssen \"Grade\", King of Denmark, repudiated 1153, m2. at the end of 1157 Albrecht, Graf von Ballenstedt.\n\n8. Heinrich I (b. before 27 February 1142, d. 30 August 1181), Graf von Wettin (1156-1181) m. Sophie.\n\n9. Dedo V \"der Feiste\" (d. 16 August 1190), Graf von Groitzsch (1144-1190)\n\n10. Agnes (d. 21 January 1203) Abbess of Quedlinburg (1184-1203)\n\n11. Sophie (d. 16 April after 1190) m. Gebhard I, Graf von Burghausen.\n\n12. Friedrich I (27 February 1142 / 19 May 1145 - 4 January 1191), Graf von Brehna (1156-1191)\n\nBasic information\n\nBirth: c. 1097 - Probably Wettin, Neletize, Mark Lusiza, Herzogtum Sachsen, Heiliges Römisches Reich. (FMG suggests 1097/1098, English Wikipedia suggests c1097, while Peerage suggests c1098.)\n\nBaptism: Unknown.\n\nMarriages: before 1119 with Liutgard von Elchingen (FMG)\n\nDeath: 5 February 1157 - Kloster Petersberg, Petersburg bei Halle, Mark Merseburg, Herzogtum Sachsen, Heiliges Römisches Reich (FMG and Peerage, according to the German Wikipedia page for Petersberg, the Lauterberg name was not attached to the monastery until the 14th century, though it appears in other Wikipedia pages and FMG)\n\nBurial: FMG says Kloster Petersberg. At the time that he died, the Stiftskirche St. Petrus was under construction at the monastery (work began in 1142 and was completed in 1184). It would be reasonable to assume that burials for Kloster Petersberg would have begun in the church yard sometime before his death.\n\nOccupation:\n\nGraf von Wettin\n\nGraf von Brehna und Camburg (before 1116 to 1156)\n\nGraf von Eilenburg (1123 - 1156)\n\nMarkgraf von Meissen in (1123 - 1156)\n\nResident of Kloster Petersberg (1156-1157)\n\nAlternate name: Konrad \"der Grosse\", Conrad \"the Great\" (the \"von Meissen\" was apparently taken from his most highest title, and may or may not have been used by his contemporaries to refer to him)\n\nFrom the Foundation for Medieval Genealogy Medlands Project page on Meissen (covering his birth family):\n\nhttp://fmg.ac/Projects/MedLands/MEISSEN.htm#KonradIdied1157A\n\nTHIMO, son of DIETRICH Graf in Eilenburg, Graf im Hassegau und Siusli [Wettin] & his wife Mathilde von Meissen (-after [1099/1101]).\n\nThe Genealogica Wettinensis names \"filios: Fridericum, Dedonem, Thiemonem, Geronem, Conradum, Riddagum, et filiam Hiddam\" as children of \"comes Tidericus\"[280]. The Chronicon Montis Serreni names \"Thiemonem\" as son of \"Tidericus comes\" & his wife[281].\n\nGraf von Brehna .\n\n. Vogt of Stift Gerbstedt.\n\nCo-founder of Naumburg cathedral.\n\nm ([1086]%29 IDA von Northeim, daughter of OTTO [II] Graf von Northeim Duke of Bavaria & his wife Richenza of Swabia [Ezzonen].\n\nThe Annales Stadenses refers to the four daughters of Otto, specifying that \"una mater fuit Conradi de Witin marchionis\" without naming her[282]. The Annales Magdeburgenses name \"secunda [filia Ottonis ducis de Northeim] Ida\" as wife of \"Thiemoni comiti de Witin\"[283]. The Genealogica Wettinensis names \"Idam filiam Othonis ducis de Northeim\" as wife of \"Thiemo comes\"[284].\n\nGraf Thimo & his wife had three children:\n\n1. DEDO [IV] (-16 Dec 1124).\n\nThe Annales Magdeburgenses name \"Dedum comitem et Cuonradum marchionem\" as the two sons of \"Thiemoni comiti de Witin\" and his wife Ida von Northeim[285]. The Genealogica Wettinensis names \"Dedonem comitem et Conradum et filiam nomine Machthildem\" as the children of \"Thiemo comes\" & his wife[286].\n\nGraf von Wettin.\n\nGraf von Groitzsch by right of his wife. The Genealogica Wettinensis specifies that \"Dedo filius Thiemonis\" founded \"ecclesiam in honore beati Petri apostolorum\" but that its consecration was left because of the death of his brother Konrad[287].\n\nFounded Kloster Petersberg bei Halle in der Saale, of which he was Vogt.\n\nm (repudiated) BERTA von Morungen, daughter of WIPRECHT [II] Graf von Groitzsch [later Markgraf von Meissen] & his first wife Judith of Bohemia (-Monte Serreno 16 Jun 1144). The Chronicon Montis Serreni names \"Berta filia Wiperti marchionis de Groitz\" as wife of \"Dedo comes filius Thiemonis comitis\"[288]. The Genealogica Wettinensis names \"Bertham filiam Wiperti de Groitz\" as wife of \"Dedo filius Thiemonis\", specifying that she was repudiated by her husband and found refuge at Monte Serreno where she died[289]. The same source in a later passage records the death \"1144 XVII Kal Iun\" of \"Berta comitissa filia Wiperti, uxor Dedonis comitis\"[290]. Heiress of Burg Groitzsch. The Annales Pegavienses record the death in 1143 of \"Berchta de Morunham, filia Wicperti marchionis\"[291]. The Chronicon Montis Serreni records the death \"1144 XVII Kal Iun\" of \"Berta comitissa, uxor Dedonis comitis\"[292].\n\nGraf Dedo [IV] & his wife had one child: Mathilde (d. 1152, m. Rapoto II, Graf von Abensberg)\n\n2. KONRAD [I] \"der Grosse\" ([1097/98]-Kloster Petersberg 5 Feb 1157, bur Kloster Petersberg).\n\nThe Annales Magdeburgenses name \"Dedum comitem et Cuonradum marchionem\" as the two sons of \"Thiemoni comiti de Witin\" and his wife Ida von Northeim[294]. The Genealogica Wettinensis names \"Dedonem comitem et Conradum et filiam nomine Machthildem\" as the children of \"Thiemo comes\" & his wife[295].\n\nGraf von Wettin.\n\nGraf von Brehna und Camburg before 1116.\n\nGraf von Eilenburg 1123.\n\nMarkgraf von Meissen in 1123.\n\n3. MATHILDE (-22 Jan 1155, bur Kloster Petersberg).\n\nThe Gesta Archiepiscoporum Magdeburgensium names \"Mechildis, soror Conradi comitis de Misen\" as wife of \"Gero comes de Seborch\"[296]. The Genealogica Wettinensis names \"Dedonem comitem et Conradum et filiam nomine Machthildem\" as the children of \"Thiemo comes\" & his wife, naming \"Gero comes de Bavaria\" as first husband of Mathilde and \"Ludowicus comes de Bavaria, pater Ludowici abbatis Merseburgensis et Ludowicis comitis, patris Conradi prepositi\" as her second husband[297].\n\nAssuming that her first marriage is correct, she was the first cousin of her husband's maternal grandfather, which seems surprising.\n\nm firstly GERO Graf von Seeburg, son of WICHMANN Graf von Seeburg & his second wife Bertha von Camburg (12 Jul 1097-19 Sep 1133, bur Kloster Kaldenborn). m secondly LUDWIG [II] von Wippra, son of --- (-1151).\n\nReferences\n\n[280] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\n[281] Chronicon Montis Serreni 1171, MGH SS XXIII, p. 155.\n\n[282] Annales Stadenses 1105, MGH SS XVI, p. 318.\n\n[283] Annales Magdeburgenses 1110 5, MGH SS XVI, p. 181.\n\n[284] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\n[285] Annales Magdeburgenses 1110 5, MGH SS XVI, p. 181.\n\n[286] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\n[287] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[288] Chronicon Montis Serreni 1124, MGH SS XXIII, p. 139.\n\n[289] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[290] Genealogica Wettinensis, MGH SS XXIII, p. 229.\n\n[291] Annales Pegavienses 1148, MGH SS XVI, p. 258.\n\n[292] Chronicon Montis Serreni 1144, MGH SS XXIII, p. 140.\n\n[293] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[294] Annales Magdeburgenses 1110 5, MGH SS XVI, p. 181.\n\n[295] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\n[296] Gesta Archiepiscoporum Magdeburgensium Continuatio Prima 29, MGH SS XIV, p. 416.\n\n[297] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\nFrom the Foundation for Medieval Genealogy Medlands Project page on Meissen (covering his marriage family):\n\nKONRAD [I] von Wettin \"der Grosse\", son of THIMO Graf von Brehna & his wife Ida von Northeim ([1097/98]-Kloster Petersberg 5 Feb 1157, bur Kloster Petersberg).\n\nThe Annales Magdeburgenses name \"Dedum comitem et Cuonradum marchionem\" as the two sons of \"Thiemoni comiti de Witin\" and his wife Ida von Northeim[323]. The Genealogica Wettinensis names \"Dedonem comitem et Conradum et filiam nomine Machthildem\" as the children of \"Thiemo comes\" & his wife[324].\n\nGraf von Wettin\n\nGraf von Brehna und Camburg before 1116.\n\nbefore 1116. Graf von Eilenburg 1123.\n\n1123. Lothar von Süpplingenburg Duke of Saxony appointed Konrad as KONRAD Markgraf von Meissen in 1123, challenging the rights of Emperor Heinrich V, who had appointed Wiprecht von Groitsch as Markgraf[325].\n\nin 1123, challenging the rights of Emperor Heinrich V, who had appointed Wiprecht von Groitsch as Markgraf[325]. Markgraf der Ober- und Niederlausitz mit Gau Nisani in 1136. \"Conradus…marchio…coniugis nostre…et filiorum nostrorum Ottonis, Heinrici, Theoderici\" donated property to Magdeburg Unser Liebe Frau by charter dated [end-May/early Jun] 1142[326].\n\nin 1136. \"Conradus…marchio…coniugis nostre…et filiorum nostrorum Ottonis, Heinrici, Theoderici\" donated property to Magdeburg Unser Liebe Frau by charter dated [end-May/early Jun] 1142[326]. Graf von Groitzsch und Rochlitz , Vogt von Kloster Chemnitz 1143.\n\n, 1143. Vogt of Naumburg cathedral .\n\n. Founder of St Peter auf dem Lauterberg (Petersberg) . He abdicated and retired to Kloster Petersberg 30 Nov 1156.\n\n. He abdicated and retired to Kloster Petersberg 30 Nov 1156. The Annales Erphesfurdenses record the death in 1157 of \"Counradus marchio\"[327]. The Chronicon Montis Serreni records his death \"1157 Non Feb\" aged 59, specifying his burial \"in medio ecclesie, in dextera ipsius uxor eius [et] soror eius Machtildis\"[328].\n\nm (before 1119) LUITGARD von Elchingen, daughter of ADALBERT Graf von Elchingen-Ravenstein & his wife Bertha --- (-Kloster Gerbstedt 19 Jun 1145, bur Kloster Gerbstedt).\n\nThe Chronicon Montis Serreni names \"Lucardis filia Alberti nobilissimi de Suevia\" as wife of \"Conradus comes de Witin\"[329]. The Genealogica Wettinensis names \"Lucardem filiam cuiusdam nobilissimi de Suevia nomine Alberti\" as wife of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\"[330]. The Annales Magdaburgenses record the death in 1145 of \"Luthgart marchionissa\"[331].\n\nMarkgraf Konrad [I] & his wife had [twelve] children:\n\n1. HEINRICH (-young).\n\nThe Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife, specifying that Heinrich died in boyhood[332].\n\n2. OTTO ([1125]-18 Feb 1190, bur Kloster Altzelle).\n\nThe Chronicon Montis Serreni names (in order) brothers \"Othonis Misniensis marchionis, Tiderici Orientalis marchionis, Heinrici comitis de Witin, Dedonis comitis de Rochelez, Friderici comitis de Brene\"[333].\n\nHe succeeded in 1156 as OTTO \"der Reiche\" Markgraf von Meissen, zu Colditz und Lausick.\n\n3. ODA (-2 Jun ----).\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[334].\n\nAbbess of Gerbstedt 1137.\n\n4. BERTA .\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[335].\n\nAbbess of Gerbstedt 1190.\n\n5. DIETRICH (-Petersberg 9 Feb 1185, bur Petersberg).\n\nThe Chronicon Montis Serreni names (in order) brothers \"Othonis Misniensis marchionis, Tiderici Orientalis marchionis, Heinrici comitis de Witin, Dedonis comitis de Rochelez, Friderici comitis de Brene\"[336]. \"Conradus…marchio…coniugis nostre…et filiorum nostrorum Ottonis, Heinrici, Theoderici\" donated property to Magdeburg Unser Liebe Frau by charter dated [end-May/early Jun] 1142[337].\n\nMarkgraf der Niederlausitz und Graf von Eilenburg 1156. The Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[338]. The Chronicon Montis Serreni records the death \"1184 V Id Feb\" of \"Tidericus Orientalis marchio, filius Conradi marchione defuncti\"[339]. The Genealogica Wettinensis records the death in 1184 of \"Tidericus Orientalis marchio\"[340].\n\n1156. The Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[338]. The Chronicon Montis Serreni records the death \"1184 V Id Feb\" of \"Tidericus Orientalis marchio, filius Conradi marchione defuncti\"[339]. The Genealogica Wettinensis records the death in 1184 of \"Tidericus Orientalis marchio\"[340]. m ([1142]%29 DOBRONEGA LUDGARDA of Poland, daughter of BOLESŁAW III \"Krzywousty/Wrymouth\" Prince of Poland & his second wife Salome von Berg-Schelklingen (before 1129-after 26 Oct 1147). The Genealogica Wettinensis names \"sororem Meseconis ducis Polonie, Dobernegam…que etiam Lukardis dicta est\" as wife of \"Tidericus Orientalis marchio\"[341]. The Chronicon Montis Serreni names \"soror…Mesoconis ducis Polonie Dobergana que et Lucardis vocabatur\" as the wife of \"Tidericus Orientalis marchio, filius Conradi marchione defuncti\"[342].\n\nMistress (1): (after Oct 1147) KUNIGUNDE from Bavaria, widow of BERNHARD Graf von Plötzkau, daughter of --- (-after 1185). The Chronicon Montis Serreni names \"Conigundam comitissam viduam Bernhardi de Plozke\" as \"aliam [uxorem]\" of \"Tidericus Orientalis marchio, filius Conradi marchione defuncti\"[343].\n\nMarkgraf Dietrich & his wife had two children: Konrad (killed in a tournament 17 February 1175) and Gertrud, nun at Gerbstedt.\n\nMarkgraf Dietrich had one illegitimate child by Mistress (1): Dietrich, Bishop of Merseburg.\n\n6. [GERTRUD .\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife, specifying that Gertrud married \"palatino Reni\" and founded \"ecclesiam in honore beati Theodori Bavenberg\" after her husband died[349]. However, this supposed parentage of the wife of Pfalzgraf Hermann appears disproved by the charter dated 1138 under which \"Heremannus palatinus comes de Stahelekke\" assumed the Vogtei of Kloster Lorch, at the request of \"domne Gertrudis…contoralis nostre fratrisque sui Friderici…ducis Swevie\"[350].\n\nm HERMANN von Stahleck Graf von Stahleck, son of GOSWIN Graf von Stahleck & his wife Luitgard von Heimbach (-Ebrach 2 Oct 1156, bur Ebrach, transferred to Bildhausen). He was installed in [1138] as HERMANN III Pfalzgraf von Lothringen by his brother-in-law Konrad III King of Germany, resigned in 1155.]\n\n7. ADELHEID (-after 6 Dec 1172).\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife, specifying that Adela married firstly \"regi Danorum Suenoni\" and secondly \"Albertus comes Alberti marchionis filius\"[351]. A 13th century genealogy names \"Adelam\" as daughter of \"marchio Conradus\" and her first husband as \"regi Dacie\" and her second \"de Saxonia\"[352].\n\nm firstly ([1152], repudiated 1153) SVEND III Erikssen \"Grade\" King of Denmark, son of ERIK II \"Emun\" King of Denmark & his wife Malmfred Mstislavna of Kiev (-murdered 23 Oct 1157).\n\nm secondly (end 1157) ALBRECHT Graf von Ballenstedt, son of ALBRECHT \"der Bär\" Markgraf von Brandenburg [Ballenstedt] & his wife Sophie von Winzenburg ([1131/40]-after 6 Dec 1172).\n\n8. HEINRICH [I] (before 27 Feb 1142-30 Aug 1181, bur Petersberg).\n\nThe Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[353]. The Chronicon Montis Serreni names (in order) brothers \"Othonis Misniensis marchionis, Tiderici Orientalis marchionis, Heinrici comitis de Witin, Dedonis comitis de Rochelez, Friderici comitis de Brene\"[354]. \"Conradus…marchio…coniugis nostre…et filiorum nostrorum Ottonis, Heinrici, Theoderici\" donated property to Magdeburg Unser Liebe Frau by charter dated [end-May/early Jun] 1142[355].\n\nGraf von Wettin 1156. The Genealogica Wettinensis records the death in 1181 of \"Heinricum comes senior de Witin\"[356].\n\n1156. The Genealogica Wettinensis records the death in 1181 of \"Heinricum comes senior de Witin\"[356]. m as her first husband, SOPHIE, daughter of --- (-1189, bur Reinhardsbrunn). The Genealogica Wettinensis names \"Sophiam filiam cuiusdam nobilis de Austria\" as wife of \"Heinricus comes de Witin\", specifying that she married secondly \"Hermannus tunc comes palatinus Saxonie, postmodem etiam comes provincialis Thuringie\"[357]. She married secondly ([1182]) as his first wife, Hermann von Thüringen Pfalzgraf of Saxony, who succeeded in 1190 as Hermann I Landgraf of Thuringia.\n\nGraf Heinrich [I] & his wife had four children: Heinrich II (d. 28 December 1187), Konrad (d.y.), Ulrich (d. 28 September 1206), and Sophie (d. 1195)\n\n9. DEDO [V] \"der Feiste\" (-16 Aug 1190, bur Kloster Zschillen).\n\nThe Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[370].\n\nGraf von Groitzsch 1144.\n\n10. AGNES (-21 Jan 1203, bur Quedlinburg).\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[371].\n\nThe Annales Pegavienses name \"Agnes soror marchionis Ottonis de Misna\" when recording her appointment as Abbess of Quedlinburg in 1184[372].\n\nin 1184[372]. Nun at Gerbstedt.\n\n11. SOPHIE (-16 Apr [after 1190]).\n\nThe Genealogica Wettinensis names (in order) \"Odam et Bertam abbatissam Gerbestadensem, Agnetam Quidelingenburgensem abbatissam, quarta…Gerdrudis…quinta Adela…sexta Sophia\" as the six daughters of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife, naming \"Gebehardo comiti de Bavaria, filio sororis Luderi imperatoris\" as husband of Sophie[373]. The necrology of Michaelbeuern records the death \"XVI Kal May\" of \"Sophia com de Burchusen\"[374].\n\nm ([1144]%29 GEBHARD [I] Graf von Burghausen, son of SIEGHARD [X] Graf von Tengling [Sieghardinger] & his wife Ida von Süpplingenburg (-4 Dec [1163], bur Michaelsbeuern).\n\n12. FRIEDRICH [I] ([27 Feb 1142/19 May 1145]-4 Jan 1191, bur Petersberg).\n\nThe Genealogica Wettinensis names (in order) \"Heinricum…Othonem Misnensem marchionem, Tidericum Orientalem marchionem, Dedonem comitem de Rochelitz, Heinricum comitem de Witin, Fridericum comitem de Brene\" as sons of \"Conradus Misnensis et Orientalius marchio [filius Thiemonis]\" & his wife[375]. The Chronicon Montis Serreni names (in order) brothers \"Othonis Misniensis marchionis, Tiderici Orientalis marchionis, Heinrici comitis de Witin, Dedonis comitis de Rochelez, Friderici comitis de Brene\"[376].\n\nGraf von Brehna 1156.\n\nReferences:\n\n[323] Annales Magdeburgenses 1110 5, MGH SS XVI, p. 181.\n\n[324] Genealogica Wettinensis, MGH SS XXIII, p. 227.\n\n[325] Fuhrmann, H., trans. Reuter, T. (1995) Germany in the high middle ages c.1050-1200 (Cambridge University Press), p. 122, and Jordan (1986), p. 15.\n\n[326] Hertel, G. (ed.) (1878) Urkundenbuch des Klosters unser lieben Frauen zu Magdeburg, Geschichtsquellen der Provinz Sachsen, Band X (Halle) (\"Magdeburg Unser Liebe Frau\"), 10, p. 10.\n\n[327] Annales Sancti Petri Erphesfurdenses 1157, MGH SS XVI, p. 21.\n\n[328] Chronicon Montis Serreni 1157, MGH SS XXIII, p. 150.\n\n[329] Chronicon Montis Serreni 1125, MGH SS XXIII, p. 139.\n\n[330] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[331] Annales Magdaburgenses 8, 1145, MGH SS XVI, p. 187.\n\n[332] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[333] Chronicon Montis Serreni 1152, MGH SS XXIII, p. 150.\n\n[334] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[335] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[336] Chronicon Montis Serreni 1152, MGH SS XXIII, p. 150.\n\n[337] Magdeburg Unser Liebe Frau, 10, p. 10.\n\n[338] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[339] Chronicon Montis Serreni 1184, MGH SS XXIII, p. 159.\n\n[340] Genealogica Wettinensis, MGH SS XXIII, p. 229.\n\n[341] Genealogica Wettinensis, MGH SS XXIII, p. 229.\n\n[342] Chronicon Montis Serreni 1184, MGH SS XXIII, p. 159.\n\n[343] Chronicon Montis Serreni 1184, MGH SS XXIII, p. 159.\n\n[349] Genealogica Wettinensis, MGH SS XXIII, p. 228, footnote 38 specifying that her husband was \"Hermanno de Stahleck\".\n\n[350] Wirtembergisches Urkundenbuch, Band III (Stuttgart, 1871) (\"Württembergisches Urkundenbuch\"), Nachtrag, 6, p. 466.\n\n[351] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[352] Cod Giessensis Nr. 176, fol. 234, included as Genealogiæ Comitum et Marchionum sæc XII et XIII, in MGH SS XXIV, p. 78.\n\n[353] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[354] Chronicon Montis Serreni 1152, MGH SS XXIII, p. 150.\n\n[355] Magdeburg Unser Liebe Frau, 10, p. 10.\n\n[356] Genealogica Wettinensis, MGH SS XXIII, p. 230.\n\n[357] Genealogica Wettinensis, MGH SS XXIII, p. 230, footnote 76 stating that this is an error as the wife of Heinrich was \"Sophia…filia Friderici comitis palatini de Sommerschenburg\" although no primary source is cited for this statement.\n\n[370] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[371] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[372] Annales Pegavienses 1184, MGH SS XVI, p. 265.\n\n[373] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[374] Necrologium Michaelburanum, Salzburg Necrologies, p. 212.\n\n[375] Genealogica Wettinensis, MGH SS XXIII, p. 228.\n\n[376] Chronicon Montis Serreni 1152, MGH SS XXIII, p. 150.\n\nFrom Darryl Lundy's Peerage page on Conrad, Markgraf von Meissen:\n\nhttp://www.thepeerage.com/p11287.htm#i112867\n\nConrad Markgraf von Meißen\n\nb. circa 1098, d. 5 February 1157\n\nConrad Markgraf von Meißen was born circa 1098. He is the son of Thimo Markgraf von Kistritz and Ida von Nordheim. He died on 5 February 1157.\n\nConrad Markgraf von Meißen was also known as Conrad von Wettin. He gained the title of Graf von Wettin. He gained the title of Markgraf von Meißen. (1)\n\nChildren of Conrad Markgraf von Meißen and Luitgarde von Swabia\n\n-1. Dedo V Markgraf von Unter-Lausitz+ d. 16 Aug 1190\n\n-2. Oda von Meißen d. 2 Jun\n\n-3. Bertha von Meißen\n\n-4. Heinrich von Meißen\n\n-5. Dietrich I Markgraf von Landsberg und Niederlausitz+ d. 9 Feb 1185\n\n-6. Gertrude von Meißen\n\n-7. Sophie von Meißen\n\n-8. Agnes von Meißen d. 21 Jan 1203\n\n-9. Adelheid von Meißen (1)\n\n-10. Otto Markgraf von Meißen+ b. c 1125, d. 18 Feb 1190\n\n-11. Friedrich I Graf von Brehna+ b. bt 1142 - 1145, d. c 1266/67\n\n-12. Heinrich I Graf von Wettin+ b. b 27 Feb 1142, d. 30 Aug 1181\n\n---------------------------\n\nFrom English Wikipedia:\n\nConrad the Great (ca. 1097 – 5 February 1157) was the Margrave of Meissen from 1123 until his retirement in 1156. He was the son of Thimo, Count of Brehna, of the House of Wettin, and Ida, daughter of Otto of Nordheim. He was also Count of Wettin, Brehna, and Camburg from before 1116.\n\nIn 1123, he became Count of Eilenburg. That same year, Lothair of Supplinburg, Duke of Saxony, appointed him Margrave of Meissen in opposition to Wiprecht von Groitzsch, the appointee of the Emperor Henry V. Lothair also named Albert the Bear Margrave of Lusatia, while Henry named Wiprecht to that march also.\n\nWiprecht was unable to hold his own against his two opponents and in 1124 Conrad was securely in power in Meissen. In 1136, Lothair, then emperor, appointed him to Lusatia as well. Thereafter, Upper Lusatia remained a part of Meissen and the march of Lusatia was reduced to Lower Lusatia alone.\n\nIn 1143, Conrad became Count of Groitzsch and Rochlitz and Vogt of Chemnitz and Naumburg. In 1147, while Conrad III of Germany was away on the Second Crusade, Conrad the Great joined Henry the Lion, Adalbert of Salzwedel, Albert the Bear, and the Archbishops of Magdeburg and Bremen to organise a Crusade against the Obodrites and Wagri. In August, Conrad and Albert, with the bishops of Magdeburg, Havelburg, and Brandenburg, massed their forces at Magdeburg. The Obodrite prince Niklot and his fortressess of Dubin and Dimin were besieged. Both he and Pribislav, another Obodrite prince, were forced to accept Christianity and make peace.\n\nIn the following years, he founded the monastery of St Peter auf dem Lauterberg (Petersberg), to which he retired on 30 November 1156. He died and was buried there next to his wife, Luitgard (Lucarda) von Elchingen-Ravenstein, daughter of Adalbert, Count of Elchingen-Ravenstein and Bertha of Hohenstaufen, daughter of Frederick I, Duke of Swabia and Agnes of Germany.\n\nMarriage and issue\n\nLuitgard of Elchingen-Ravenstein, whom he had married before 1119, had blessed him with many children. His eldest surviving son, Otto II, Margrave of Meissen, succeeded him in Meissen, while his second surviving son, Dietrich I, succeeded in Lusatia. His son Henry I, Count of Wettin married Sophia of Sommerschenburg, Countess Palatine of Saxony, daughter of Count Fredrick II of Sommerschenburg and Countess Liutgard of Stade, queen dowager of Denmark.\n\n1. Heinrich (i.e. Henry; died young)\n\n2. Otto II\n\n3. Dietrich I\n\n4. Dedo V. der Feiste\n\n5. Henry I, Count of Wettin, married (1) Sophia of Sommerschenburg (d. 1189 or 1190), daughter of Count Fredrick II of Sommerschenburg, Count Palatine of Saxony and his wife Countess Liutgard of Stade (later queen of Denmark).\n\n6. Friedrich I von Brehna\n\n7. Oda\n\n8. Adela, Queen consort of Denmark\n\n9. Bertha\n\n10. Sophie\n\n11. Gertrud\n\n12. Agnes II, Princess-Abbess of Quedlinburg\n\nReferences\n\nThompson, James Westfall. Feudal Germany, Volume II. New York: Frederick Ungar Publishing Co., 1928.\n\n...\n\nFrom German Wikipedia:\n\nEhe und Kinder [Bearbeiten]\n\nEhe mit Luitgard von Ravenstein († 19. Juni 1146 im Kloster Gerbstedt, umgebettet zum Augustinerchorherrenstift auf dem Lauterberg bei Halle), Gräfin von Elchingen-Irrenberg, Tochter Adalberts von Ravenstein, Graf von Elchingen und Irrenberg und der Bertha von Staufen, Tochter Friedrichs I. von Schwaben. Gründerin des Klosters Elchingen\n\n-1. Heinrich († jung)\n\n-2. Otto der Reiche (* um 1116; † 18. Februar 1190), Markgraf von Meißen\n\n-3. Dietrich von Landsberg und Eilenburg (* um 1118; † 9. Februar 1184)\n\n-4. Dedo V. der Feiste (* um 1121; † 16. August 1190)\n\n-5. Heinrich I. von Wettin (* um 1123; † 30. August 1181)\n\n-6. Friedrich von Brehna (* um 1126; † 4. Januar 1182)\n\n-7. Oda, Äbtissin in Gerbstedt († um 1190)\n\n-8. Bertha, Äbtissin in Gerbstedt\n\n-9. Adela († 23. Oktober 1181), verheiratet in erster Ehe 1152 mit Sven III. König von Dänemark († 1157) (Haus Estridsson), in zweiter Ehe mit Graf Adalbert von Ballenstedt\n\n10. Sophie († um 1191), verheiratet mit Graf Gebhard von Burghausen\n\n-11. Gertrud († um 1191), verheiratet mit Graf Günther II. von Schwarzburg\n\n-12. Agnes († 21. Januar 1203), 1184 Äbtissin von Quedlinburg\n\n...\n\nAncestors of Conrad, Margrave of Meissen\n\n1. Konrad 'der Große' Markgraf von Meißen = Himself\n\n2. Thimo von Wettin = Father\n\n3. Ida of Nordheim = Mother\n\n4. Dietrich II von Wettin = Father's Father\n\n5. Mathilde von Meissen = Father's Mother\n\n6. Otto of Nordheim = Mother's Father\n\n7. Richenza ?Billung? = Mother's Mother\n\n8. Dedo I von Wettin = Father's Father's Father\n\n9. Thietberga von Nordmark = Father's Father's Mother\n\n10. Eckard I, Margrave von Meissen = Father's Mother's Father\n\n11. Suanehild Billung = Father's Mother's Mother\n\n12. ??= Mother's Father's Father\n\n13. ??= Mother's Father's Mother\n\n14. ??= Mother's Mother's Father\n\n15. ??= Mother's Mother's Mother\n\n16. Dietrich I von Wettin=Father's Father's Father's Father\n\n17. Jutta von Merseburg=Father's Father's Father's Mother\n\n18. Dietrich von Haldensleben=Father's Father's Mother's Father\n\n19. ??= Father's Father's Mother's Mother\n\n20. Gunther, Margrave von Merseburg=Father's Mother's Father's Father\n\n21. ??= Father's Mother's Father's Mother\n\n22. Hermann III, Graf von Weimar-Orlamude=Father's Mother's Mother's Father\n\n23. ??= Father's Mother's Mother's Mother\n\n24. Hermann Billung = Mother's Father's Father's Father\n\nForrás / Source:\n\nhttp://en.wikipedia.org/wiki/Conrad,_Margrave_of_Meissen\n\nhttp://de.wikipedia.org/wiki/Konrad_I._(Meißen)"}, {"url": "https://en.wikisource.org/wiki/1911_Encyclop%C3%A6dia_Britannica/Wettin", "page_content": "​WETTIN, the name of a family from which several of the royal houses of Europe have sprung, derived from a castle which stood near the small town of that name on the Saale. Attempts to trace the descent to the Saxon chief Widukind or Wittekind, who died about 807, or to Burchard, margrave of Thuringia (d. 908), have failed, and the earliest known ancestor is one Dietrich, who was count of Hassegau or Hosgau, a district on the left bank of the Saale. Dietrich was killed in 982 fighting the Hungarians, and his sons Dedo I. (d. 1009) and Frederick (d. 1017) received lands taken from the Wends, including the county or Gau of Wettin on the right bank of the Saale. Dedo's son Dietrich II. inherited these lands, distinguished himself in warfare against the Poles, and married Matilda, daughter of Ekkard I., margrave of Meissen. Their son Dedo 11. obtained the Saxon east mark and lower Lusatia on the death of his uncle Ekkard II., margrave of Meissen, in 1046, but in 1069 he quarrelled with the emperor Henry IV. and was compelled to surrender his possessions. He died in 1075, and his lands were granted to his son Henry I., who in 1089 was invested with the mark of Meissen. In 1103 Henry was succeeded by his cousin Thimo (d. 1104), who built a castle at Wettin, and was called by this name. Henry II., son of Henry I., followed, but died childless in 1123; his cousin, Conrad I., son of Thimo, claimed Meissen, of which he secured possession in 1130, and in 1135 the emperor Lothair II. added lower Lusatia to his possessions. Abdicating in 1156, Conrad's lands were divided between his five sons, when the county of Wettin fell to his fourth son Henry, whose family died out in 1217. Wettin then passed to the descendants of Conrad's youngest son Frederick, and in 1288 the county, town and castle of Wettin were sold to the archbishop of Magdeburg. They were retained by the archbishop until the peace of Westphalia in 1648, when they passed to the elector of Brandenburg, and afterwards became incorporated in the kingdom of Prussia.\n\nConrad I. and his successors had added largely to their possessions, until under Henry I., the Illustrious, margrave of Meissen, the lands of the Wettins stretched from the Oder to the Werra, and from the Erzgebirge to the Harz mountains. The subsequent history of the family is merged in that of Meissen, Saxony and the four Saxon dukedoms. In June 1889 the 800th anniversary of the rule of the Wettins in Meissen and Saxony was celebrated with great splendour at Dresden.\n\nSee G. E. Hofmeister, Das Haus Wettin (Leipzig, 1889); C. W. Bottiger, Geschichte des Kurstaates mid Konigreichs Sachsen (Gotha, 1867–1873), O . Posse, Die Markgrafen von Meissen und das Haus Wettin (Leipzig, 1881), K . Wenck, Die Wettiner im 14ten Jahrhundert (Leipzig, 1877); Kammel, Festschrift zur 800 jahrigen Jubelfeier des Houses Wettin (Leipzig, 1889), and H. B. Meyer, Hof- und Zentralverwaltung der Wettiner (Leipzig, 1902)."}, {"url": "https://dbpedia.org/page/Theodoric_I,_Margrave_of_Meissen", "page_content": "dbo: abstract Dětřich Míšeňský (německy Dietrich der Bedrängte, 1162 – 18. února 1221) byl míšeňský a markrabě z rodu Wettinů. Jeho sestra Adléta Míšeňská byla první manželkou Přemysla Otakara I. a právě Dětřich hájil práva Adlétina syna Vratislava na český trůn. (cs)\n\nΟ Θεοδώριχος Α΄ (γερμ.: Dietrich der Bedrängte, 11 Μαρτίου 1162 - 18 Ιανουαρίου 1221) από τον Οίκο των Βέττιν ήταν μάργραβος του Μάισσεν (1198-1221). (el)\n\nDietrich, genannt der Bedrängte (* 1162; † 18. Februar 1221), war ab 1198 Markgraf von Meißen und ab 1210 als Dietrich III. Markgraf der Lausitz. (de)\n\nTeodorico I (11 de marzo de 1162 - 18 de enero de 1221), llamado el Oprimido, fue el margrave de Meissen desde 1198 hasta su muerte. Fue el segundogénito de Otón II de Meissen y Eduvigis de Brandeburgo. (es)\n\nThierry Ier l'Exilé (en allemand : Dietrich der Bedrängte), né en 1162 et mort le 17 février 1221, fut margrave de Basse-Lusace (Thierry III), margrave de Misnie de 1195 à 1221. Fils de Othon Ier le Riche et de Hedwige de Brandebourg, Thierry Ier l'Exilé appartint à la première branche de la Maison de Wettin, Il est l'ascendant direct des différentes Maisons de Saxe, les électeurs de Saxe puis rois de Saxe appartiennent à la sixième branche de la Maison de Wettin, ils ont pour ascendant Albert de Saxe fils de Frédéric II de Saxe, lui-même issu de la première branche de la maison de Wettin. Thierry Ier l'Exilé est également un des ancêtres des familles royales du Royaume-Uni, de Bulgarie, du Portugal et de Belgique (maison de Saxe-Cobourg et Gotha). (fr)\n\nDietrich yang Diasingkan, (dalam bahasa Jerman: Dietrich der Bedrängte), (lahir pada tahun 1162 dan meninggal pada tanggal 17 Februari 1221) merupakan seorang (Dietrich III) dan dari tahun 1195 hingga 1221. Dietrich adalah putra Otto II dari Meißen dan Hedwig dari Ballenstedt, Dietrich berasal dari cabang pertama wangsa Wettin, ia adalah keturunan langsung dari wangsa-wangsa Sachsen yang berbeda, para elektor Sachsen kemudian para raja Sachsen menjadi anggota cabang keenam wangsa Wettin, mereka adalah leluhur Albert dari Sachsen, putra Friedrich II dari Sachsen, yang berasal dari cabang pertama wangsa Wettin. Dietrich juga merupakan leluhur keluarga kerajaan Britania Raya, Bulgaria, Portugal dan Belgia (wangsa Sachsen-Coburg dan Gotha). (in)\n\nTheodoric I (11 March 1162 – 18 February 1221), called the Oppressed (Dietrich der Bedrängte), was the Margrave of Meissen from 1198 until his death. He was the second son of Otto II, Margrave of Meissen and Hedwig of Brandenburg. (en)\n\nTeodorico I di Meißen detto l'Oppresso (11 marzo 1162 – 18 febbraio 1221) fu margravio di Meißen dal 1198 sino alla propria morte. Fu anche vescovo di Merseburg dal 1201 al 1215. (it)\n\nディートリヒ（Dietrich, 1162年 - 1221年2月18日）は、マイセン辺境伯（在位：1198年 - 1221年）。マイセン辺境伯オットーとブランデンブルク辺境伯アルブレヒト1世の娘ヘ－トヴィヒの次男。マイセン辺境伯アルブレヒト1世の弟。苦境伯（der Bedrängte）の渾名を持つ。 (ja)\n\nDiederik I van Meißen, bijgenaamd Diederik de Onderdrukte (11 maart 1162 — 18 januari 1221) was van 1198 tot aan zijn dood markgraaf van Meißen. Hij behoorde tot het Huis Wettin. (nl)\n\nDytryk I Zgnębiony, niem. Dietrich der Bedrängte (ur. ok. 1170 r., zm. 17 lutego 1221 r.) – margrabia Miśni od 1197 r. i margrabia Łużyc od 1210 r. z dynastii Wettinów. (pl)\n\nДитрих Угнетённый (нем. Dietrich der Bedrängte; ок. 1162 — 18 февраля 1221) — с 1190, маркграф Мейсена (Дитрих I) с 1198, маркграф Нидерлаузица и и (Дитрих III) с 1210, второй сын маркграфа Оттона Богатого и Гедвиги фон Балленштедт. (ru)\n\nDidrik den beträngde, född 1162, död 18 februari 1221, son till Otto den rike, efterträdde han sin bror Albrekt den stolte som markgreve av Meissen, 1190–1221. (sv)\n\nTeodorico I (11 de março de 1162 - 18 de janeiro de 1221), chamado o Oprimido, foi o de 1198 até sua morte. Foi o segundogênito de Otão II de Meissen e Eduvigis de Brandeburgo. (pt)\n\ndbp: issue Jutta (en)\n\nHeinrich (en)\n\nOtto (en)\n\nKonrad (en)\n\nSophia (en)\n\nHedwig (en)\n\nDietrich II of Meissen (en)\n\nHenry III, Margrave of Meissen (en)\n\ndbp: name Theodoric I (en)\n\ndbp: reason Royal domain (en)\n\ndbp: reign 1198 (xsd:integer)\n\n1210 (xsd:integer)\n\ndbp: years 1198 (xsd:integer)\n\n1210 (xsd:integer)\n\nrdfs: comment Dětřich Míšeňský (německy Dietrich der Bedrängte, 1162 – 18. února 1221) byl míšeňský a markrabě z rodu Wettinů. Jeho sestra Adléta Míšeňská byla první manželkou Přemysla Otakara I. a právě Dětřich hájil práva Adlétina syna Vratislava na český trůn. (cs)\n\nΟ Θεοδώριχος Α΄ (γερμ.: Dietrich der Bedrängte, 11 Μαρτίου 1162 - 18 Ιανουαρίου 1221) από τον Οίκο των Βέττιν ήταν μάργραβος του Μάισσεν (1198-1221). (el)\n\nDietrich, genannt der Bedrängte (* 1162; † 18. Februar 1221), war ab 1198 Markgraf von Meißen und ab 1210 als Dietrich III. Markgraf der Lausitz. (de)\n\nTeodorico I (11 de marzo de 1162 - 18 de enero de 1221), llamado el Oprimido, fue el margrave de Meissen desde 1198 hasta su muerte. Fue el segundogénito de Otón II de Meissen y Eduvigis de Brandeburgo. (es)\n\nThierry Ier l'Exilé (en allemand : Dietrich der Bedrängte), né en 1162 et mort le 17 février 1221, fut margrave de Basse-Lusace (Thierry III), margrave de Misnie de 1195 à 1221. Fils de Othon Ier le Riche et de Hedwige de Brandebourg, Thierry Ier l'Exilé appartint à la première branche de la Maison de Wettin, Il est l'ascendant direct des différentes Maisons de Saxe, les électeurs de Saxe puis rois de Saxe appartiennent à la sixième branche de la Maison de Wettin, ils ont pour ascendant Albert de Saxe fils de Frédéric II de Saxe, lui-même issu de la première branche de la maison de Wettin. Thierry Ier l'Exilé est également un des ancêtres des familles royales du Royaume-Uni, de Bulgarie, du Portugal et de Belgique (maison de Saxe-Cobourg et Gotha). (fr)\n\nTheodoric I (11 March 1162 – 18 February 1221), called the Oppressed (Dietrich der Bedrängte), was the Margrave of Meissen from 1198 until his death. He was the second son of Otto II, Margrave of Meissen and Hedwig of Brandenburg. (en)\n\nTeodorico I di Meißen detto l'Oppresso (11 marzo 1162 – 18 febbraio 1221) fu margravio di Meißen dal 1198 sino alla propria morte. Fu anche vescovo di Merseburg dal 1201 al 1215. (it)\n\nディートリヒ（Dietrich, 1162年 - 1221年2月18日）は、マイセン辺境伯（在位：1198年 - 1221年）。マイセン辺境伯オットーとブランデンブルク辺境伯アルブレヒト1世の娘ヘ－トヴィヒの次男。マイセン辺境伯アルブレヒト1世の弟。苦境伯（der Bedrängte）の渾名を持つ。 (ja)\n\nDiederik I van Meißen, bijgenaamd Diederik de Onderdrukte (11 maart 1162 — 18 januari 1221) was van 1198 tot aan zijn dood markgraaf van Meißen. Hij behoorde tot het Huis Wettin. (nl)\n\nDytryk I Zgnębiony, niem. Dietrich der Bedrängte (ur. ok. 1170 r., zm. 17 lutego 1221 r.) – margrabia Miśni od 1197 r. i margrabia Łużyc od 1210 r. z dynastii Wettinów. (pl)\n\nДитрих Угнетённый (нем. Dietrich der Bedrängte; ок. 1162 — 18 февраля 1221) — с 1190, маркграф Мейсена (Дитрих I) с 1198, маркграф Нидерлаузица и и (Дитрих III) с 1210, второй сын маркграфа Оттона Богатого и Гедвиги фон Балленштедт. (ru)\n\nDidrik den beträngde, född 1162, död 18 februari 1221, son till Otto den rike, efterträdde han sin bror Albrekt den stolte som markgreve av Meissen, 1190–1221. (sv)\n\nTeodorico I (11 de março de 1162 - 18 de janeiro de 1221), chamado o Oprimido, foi o de 1198 até sua morte. Foi o segundogênito de Otão II de Meissen e Eduvigis de Brandeburgo. (pt)\n\nDietrich yang Diasingkan, (dalam bahasa Jerman: Dietrich der Bedrängte), (lahir pada tahun 1162 dan meninggal pada tanggal 17 Februari 1221) merupakan seorang (Dietrich III) dan dari tahun 1195 hingga 1221. (in)\n\nrdfs: label Dětřich Míšeňský (cs)\n\nDietrich der Bedrängte (de)\n\nΘεοδώριχος Α΄ του Μάισσεν (el)\n\nTeodorico I de Meissen (es)\n\nDietrich (1162-1221) (in)\n\nThierry Ier l'Exilé (fr)\n\nTeodorico I di Meißen (it)\n\nディートリヒ (マイセン辺境伯) (ja)\n\nDiederik van Meißen (nl)\n\nDytryk I Zgnębiony (pl)\n\nTeodorico I de Meissen (pt)\n\nTheodoric I, Margrave of Meissen (en)\n\nДитрих I (маркграф Мейсена) (ru)\n\nDidrik den beträngde (sv)"}, {"url": "https://www.findagrave.com/memorial/150237873/dedi_i,-margrave-of_the_saxon_ostmark", "page_content": "He was the Margrave of the Saxon Ostmark (also called Lower Lusatia) from 1046 and a claimant for the title of Margrave of Meissen from 1069. He was the second son Dietrich II of Wettin and Matilda, daughter of Eckard I of Meissen.\n\nDedi inherited the Ostmark from its last dynast, the childless Odo II, because he had married his sister, Oda (died before 1068). Oda was herself the widow of William III of Weimar and mother of William and Otto, margraves of Meissen successively. When Otto his stepson died, Dedi married his widow, Adela of Louvain, and in her name claimed the Meissen March.\n\nOtto died in 1067 and was succeeded by Egbert I, but Dedi married his widow in 1069 and rebelled. In claiming the Meissen March through his wife, Dedi was challenging the royal prerogative in the marches. With him in his revolt was Albert II of Ballenstedt, who raided the monastery of Nienburg, a foundation of the family of Dedi's first wife. Adela of Louvain for her part aggressively supported her husband, so much so that Lambert of Hersfeld was compelled to call her a saevissima uxor (rough meaning \"raging wife\"). Adalbert of Bremen, one of the regents of the young king Henry IV, frustrated the Thuringian rebels and preserved the peace in Thuringia and Meissen. Dedi was confined to Lusatia, where he was succeeded by his eldest son, Dedi II.\n\nDedi left a daughter, Adelaide, by his first wife Oda, who married Ernest, Margrave of Austria. By Adela of Louvain, Dedi had two sons: Henry, who later ruled both Lusatia and Meissen, and Conrad, who died in battle with the Wends.\n\n\n\nHe was the Margrave of the Saxon Ostmark (also called Lower Lusatia) from 1046 and a claimant for the title of Margrave of Meissen from 1069. He was the second son Dietrich II of Wettin and Matilda, daughter of Eckard I of Meissen.\n\nDedi inherited the Ostmark from its last dynast, the childless Odo II, because he had married his sister, Oda (died before 1068). Oda was herself the widow of William III of Weimar and mother of William and Otto, margraves of Meissen successively. When Otto his stepson died, Dedi married his widow, Adela of Louvain, and in her name claimed the Meissen March.\n\nOtto died in 1067 and was succeeded by Egbert I, but Dedi married his widow in 1069 and rebelled. In claiming the Meissen March through his wife, Dedi was challenging the royal prerogative in the marches. With him in his revolt was Albert II of Ballenstedt, who raided the monastery of Nienburg, a foundation of the family of Dedi's first wife. Adela of Louvain for her part aggressively supported her husband, so much so that Lambert of Hersfeld was compelled to call her a saevissima uxor (rough meaning \"raging wife\"). Adalbert of Bremen, one of the regents of the young king Henry IV, frustrated the Thuringian rebels and preserved the peace in Thuringia and Meissen. Dedi was confined to Lusatia, where he was succeeded by his eldest son, Dedi II.\n\nDedi left a daughter, Adelaide, by his first wife Oda, who married Ernest, Margrave of Austria. By Adela of Louvain, Dedi had two sons: Henry, who later ruled both Lusatia and Meissen, and Conrad, who died in battle with the Wends.\n\n"}, {"url": "https://www.liquisearch.com/albert_ii_margrave_of_meissen/life", "page_content": "Life\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nHenry (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269, and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert —suffering financial difficulties— was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless. Elisabeth died on 28 September 1293. Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth. This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four."}, {"url": "https://alchetron.com/Conrad,-Margrave-of-Meissen", "page_content": "Conrad the Great (c. 1097 – 5 February 1157) was the Margrave of Meissen from 1123 until his retirement in 1156. He was the son of Thimo, Count of Brehna, of the House of Wettin and Ida, daughter of Otto of Nordheim. He was also Count of Wettin, Brehna, and Camburg from before 1116.\n\nIn 1123, he became Count of Eilenburg. That same year, Lothair of Supplinburg, Duke of Saxony, appointed him Margrave of Meissen in opposition to Wiprecht von Groitzsch, the appointee of the Emperor Henry V. Lothair also named Albert the Bear Margrave of Lusatia, while Henry named Wiprecht to that march also. Wiprecht was unable to hold his own against his two opponents and in 1124 Conrad was securely in power in Meissen. In 1136, Lothair, then emperor, appointed him to Lusatia as well. Thereafter, Upper Lusatia remained a part of Meissen and the march of Lusatia was reduced to Lower Lusatia alone.\n\nIn 1143, Conrad became Count of Groitzsch and Rochlitz and Vogt of Chemnitz and Naumburg. In 1147, while Conrad III of Germany was away on the Second Crusade, Conrad the Great joined Henry the Lion, Adalbert of Salzwedel, Albert the Bear, and the Archbishops of Magdeburg and Bremen to organise a Crusade against the Obodrites and Wagri. In August, Conrad and Albert, with the bishops of Magdeburg, Havelburg, and Brandenburg, massed their forces at Magdeburg. The Obodrite prince Niklot and his fortresses of Dubin and Dimin were besieged. Both he and Pribislav, another Obodrite prince, were forced to accept Christianity and make peace.\n\nIn the following years, he founded the monastery of St Peter auf dem Lauterberg (Petersberg), to which he retired on 30 November 1156. He died and was buried there next to his wife, Luitgard (Lucarda) of Elchingen-Ravenstein, daughter of Adalbert, Count of Elchingen-Ravenstein and Bertha of Hohenstaufen, daughter of Frederick I, Duke of Swabia and Agnes of Germany."}], "Albert I, Margrave of Meissen died in 1307.": [{"url": "https://zhuanlan.zhihu.com/p/437421882", "page_content": "Henry III, Margrave of Meissen\n\nMargrave of Meissen\n\nReign 1221–1288\n\nPredecessor Theodoric I\n\nSuccessor Albert II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nMargrave of Lusatia\n\nReign 1221–1288\n\nPredecessor Theodoric II\n\nRegent Louis IV of Thuringia (until 1217)\n\nAlbert I of Saxony (until 1230)\n\nLandgrave of Thuringia,\n\nCount Palatine of Saxony\n\nReign 1242–1265\n\nPredecessor Henry Raspe\n\nSuccessor Albert II\n\nBorn 1215\n\nMeissen, Duchy of Saxony, Holy Roman Empire\n\nDied 15 February 1288 (aged 72–73)\n\nDresden, Duchy of Saxony, Holy Roman Empire\n\nSpouse Constance of Babenberg\n\nAgnes of Bohemia\n\nElisabeth von Maltitz\n\nIssue Albert II, Margrave of Meissen\n\nTheodoric of Landsberg\n\nHouse House of Wettin\n\nFather Theodoric I, Margrave of Meissen\n\nMother Jutta of Thuringia\n\nHenry III, called Henry the Illustrious (Heinrich der Erlauchte) (c. 1215 – 15 February 1288) from the House of Wettin was Margrave of Meissen and last Margrave of Lusatia (as Henry IV) from 1221 until his death; from 1242 also Landgrave of Thuringia.\n\n\n\n\n\nLife\n\nBorn probably at the Albrechtsburg residence in Meissen, Henry was the youngest son of Margrave Theodoric I, Margrave of Meissen and his wife Jutta, daughter of Landgrave Hermann I of Thuringia. In 1221 he succeeded his father as Margrave of Meissen and Lusatia, at first under guardianship of his maternal uncle, Landgrave Louis IV of Thuringia, and after his death in 1227, under that of Duke Albert I of Saxony. In 1230 he was legally proclaimed an adult.\n\nHenry had his first combat experience in sometime around 1234, while on crusade in Prussia, fighting against the Pomesanians. His pilgrimage and company is well-documented by Peter of Dusburg, and it resulted in the construction of Balga castle, an important administrative centre for the Teutonic http://Knights.In 1245 after many years of conflict with the Ascanian margraves of Brandenburg, he was forced to cede the fortresses of Köpenick, Teltow and Mittenwalde north of Lower Lusatia. In 1249 however, the Silesian duke Bolesław II the Bald granted him the eastern area around Schiedlo Castle at the Oder river, where Henry founded the town of Fürstenberg.\n\n\n\n\n\nIn the struggle between the Hohenstaufen Emperor Frederick II and Pope Gregory IX, Henry took the side of the Emperor. In consideration, Frederick II in 1242 promised him the heritage of Henry Raspe as Landgrave of Thuringia and Count palatine of Saxony. In 1243 the Emperor also betrothed his daughter Margaret of Sicily to Henry's son Albert II.\n\n\n\n\n\nHenry remained a loyal supporter of the Hohenstaufens and not before the departure of Frederick's son Conrad IV from Germany did he recognise the antiking William of Holland. After the death of Henry Raspe in 1247, he enforced his rights in Thuringia by military means in the War of the Thuringian Succession against the claims raised by Sophie of Thuringia, daughter of late Landgrave Louis IV, and her husband Duke Henry II of Brabant, as well as by Prince Siegfried I of Anhalt-Zerbst. After a long drawn-out war he detached the Landgraviate of Hesse in the west and gave it to Sophie's younger son Henry, but kept Thuringia, which he granted to his son Albert II together with the Palatinate of Saxony. The Thuringian acquisition significantly increased the Wettin territorial possessions, which now reached from the Silesian border at the Bóbr river in the east up to the Werra in the west, and from the border with Bohemia along the Erzgebirge in the south to the Harz range in the north.\n\n\n\n\n\nFrom 1273 Henry was an important support to the newly elected Rex Romanorum Rudolph of Habsburg in his struggle against rivaling King Ottokar II of Bohemia. Against Bohemia he won, among other places, Sayda and Purschenstein Castle near Neuhausen,\n\n\n\n\n\nHe was known throughout the whole empire as a glittering prince, famous as a patron of the arts and a model knight, and as a significant minnesinger (not to be confused with Heinrich Frauenlob), poet and composer. Henry was patron of many tournaments and singing competitions, in which he also took part himself, and commissioned the famous Christherre-Chronik. He set to music hymns to be sung in the churches, by express permission of the pope.\n\nFamily\n\nIn 1234 Henry married Constance of Babenberg, the daughter of Duke Leopold VI of Austria. Together they had two sons:\n\n\n\n\n\nAlbert II, Margrave of Meissen (1240–1314)\n\nTheodoric of Landsberg (1242–1285)\n\nAs early as 1265 he attached the Imperial Pleissnerland around Altenburg, the dowry of his daughter-in-law Margaret, to the Landgraviate of Thuringia and gave both to his elder son Albert II, otherwise Albert the Degenerate. For his younger son Theodoric, Henry had created – though without imperial consent – the smaller Margraviate of Landsberg in the western part of the Lusatian lands around Leipzig. Henry kept for himself only the Margraviate of Meissen, the remaining Lower Lusatian lands, and a formal power of oversight. Only domestic disorders, caused by the unworthiness of his son Albert, clouded the later years of his reign and indeed, long after his death in 1288, led to the loss of Lusatia and Thuringia.\n\n\n\n\n\nAfter the death of Constance in 1243 Henry took as his second wife Agnes (d. 1268), a daughter of King Wenceslaus I of Bohemia, and in his third marriage the daughter of a ministerialis, or serving knight, Elisabeth von Maltitz, who bore him Friedrich Clem (whose only daughter Elisabeth married Otto II, Prince of Anhalt-Aschersleben) and Hermann the Long.\n\n亨利三世\n\n迈森藩侯\n\n1221-1288年\n\n前任 西奥多里克一世\n\n继任者 阿尔伯特二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n卢萨蒂亚藩侯\n\n1221-1288年\n\n前任 西奥多里二世\n\n摄政 图林根的路易四世（1217年前）\n\n萨克森的阿尔伯特一世（直到1230年）\n\n图林根方伯，\n\n萨克森行宫伯爵\n\n1242-1265年\n\n前任 亨利·拉斯佩\n\n继任者 阿尔伯特二世\n\n生于1215年\n\n迈森，萨克森公爵领地，神圣罗马帝国\n\n1288年2月15日去世（72-73岁）\n\n德累斯顿，萨克森公国，神圣罗马帝国\n\n配偶\n\n巴本堡的康斯坦斯\n\n波希米亚的阿格尼斯\n\n伊丽莎白·冯·马尔蒂兹\n\n阿尔伯特二世，迈森藩侯\n\n兰德斯伯格的西奥多里克\n\n家族 韦廷\n\n父亲 迈森藩侯狄奥多里克一世\n\n母亲 图林根的朱塔\n\n亨利三世，被称为显赫的亨利（海因里希·德尔洛赫特）（约1215年至1288年2月15日），来自韦廷家族，1221年起成为迈森藩侯、卢萨蒂亚藩侯（亨利四世）直到去世；从1242年起也开始担任图林根方伯。\n\n生活\n\n亨利可能出生在迈森的阿尔布雷希茨堡住宅，他是迈森藩侯西奥多里克一世和他的妻子尤塔（图林根方伯赫尔曼一世的女儿）的最小儿子。1221年，他接替父亲成为迈森和卢萨蒂亚藩侯，最初由他的外祖父图林根方伯路易四世监护，他在1227年去世后，由萨克森的阿尔伯特一世公爵监护。1230年，他被依法宣布为成年人。\n\n亨利在1234年左右的某个时候有了第一次战斗经历，当时他正在普鲁士参加十字军东征，与波美拉尼亚人作战。杜斯堡的彼得详细记录了他的朝圣和陪伴，并建造了巴尔加城堡，这是条顿骑士团的一个重要行政中心。1245年，在与勃兰登堡的阿斯坎尼藩侯多年的冲突后，他被迫割让科佩尼克的堡垒，下卢萨蒂亚北部的泰尔托和米特瓦尔德。然而，1249年，西里西亚公爵博尔斯瓦二世授予他奥德河希德洛城堡周围的东部地区，亨利在那里建立了弗尔斯滕贝格镇。\n\n在霍亨斯陶芬皇帝腓特烈二世和教皇格里高利九世之间的斗争中，亨利站在皇帝一边。考虑到这一点，弗雷德里克二世在1242年承诺将亨利·拉斯佩的遗产作为图林根方伯和萨克森行宫伯爵。1243年，皇帝还将女儿西西里的玛格丽特许配给亨利的儿子阿尔伯特二世。\n\n亨利仍然是霍亨斯陶芬家族的忠实支持者，在弗雷德里克的儿子康拉德四世离开德国之前，他还没有承认荷兰的反国王威廉。1247年亨利·拉斯普去世后，他在图林根继承权战争中以军事手段强制执行了自己在图林根的权利，反对已故兰德格雷夫·路易斯四世的女儿图林根的苏菲及其丈夫布拉班特的亨利二世公爵以及安哈尔特·泽布斯特的西格弗里德一世王子提出的主张。在一场旷日持久的战争之后，他将西部黑森的土地割让给了苏菲的小儿子亨利，但保留了图林根州，并将图林根与萨克森的行宫一起授予了他的儿子阿尔伯特二世。图林根的收购极大地增加了韦廷的领土占有，现在从东部的Bóbr河的西里西亚边界延伸到西部的韦拉，从南部的埃尔兹格比热与波希米亚的边界延伸到北部的哈尔茨山脉。\n\n从1273年起，亨利成为哈布斯堡新当选的罗马国王鲁道夫与波希米亚国王奥托卡二世抗争的重要支持者。在与波希米亚的比赛中，他赢得了赛义达和纽豪森附近的珀申斯坦城堡。他是整个帝国闻名的闪亮王子，以艺术赞助人和模范骑士而闻名，也是一位重要的明尼苏达歌手（不要与海因里希·弗劳恩洛布混淆），诗人和作曲家。亨利是许多锦标赛和歌唱比赛的赞助人，他自己也参加了这些比赛，并委托著名的克里斯瑟尔·克罗尼克参加。经教皇明确许可，他开始在教堂唱圣歌。\n\n家庭\n\n1234年，亨利与奥地利公爵利奥波德六世的女儿巴本堡的康斯坦斯结婚。他们共有两个儿子：\n\n阿尔伯特二世，迈森侯爵（1240-1314）\n\n兰德斯伯格的西奥多里克（1242-1285）\n\n早在1265年，他就将阿尔滕堡周围的帝国普列斯内兰（他的儿媳玛格丽特的嫁妆）附属于图林根州的土地墓穴，并将这两样东西都送给了他的长子堕落的阿尔伯特二世。亨利为他的小儿子西奥多里克在莱比锡附近的卢萨蒂安土地西部创建了一个较小的兰德斯伯格侯国。亨利只为自己保留了迈森的边疆区，其余的下卢萨蒂亚土地，以及正式的监督权。只有由于儿子阿尔伯特的堕落而导致的家庭混乱才给他统治的后期蒙上了阴影，事实上，在他于1288年去世后不久，卢萨蒂亚和图林根就失去了。\n\n1243年康斯坦丝去世后，亨利娶了波希米亚国王温塞斯劳斯一世的女儿阿格尼斯（公元1268年）为第二任妻子，第三次结婚时娶了一位部长或现役骑士伊丽莎白·冯·马尔蒂兹的女儿，后者为亨利生下了弗里德里希·克莱姆（他的唯一女儿伊丽莎白嫁给了安哈尔特·阿斯切勒本王子奥托二世）还有赫尔曼。"}, {"url": "https://wiki2.org/en/Albert_I,_Margrave_of_Meissen", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors\n\nSee also\n\nNotes and references"}, {"url": "http://sites.rootsmagic.com/DeepRoots/individual.php?p=14699", "page_content": "Individual Details\n\n(1240 - 20 Nov 1314)\n\nAccording to Wikipedia:\n\n\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife[edit]\n\n\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albert and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nAlbert II, Margrave of Meissen (1288–1307) and Frederick I, Margrave of Meissen (1307–1324); Fürstenzug, Dresden, Germany\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274; he married Hedwig, daughter of Henry III the White.\n\nFrederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen.\n\nDietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia.\n\nMargaret (b. 1262 - d. young, aft. 17 April 1273).\n\nAgnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269,[1] and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert - suffering financial difficulties - was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg. He wished to make Apitz his successor in Thuringia, but the plan was resisted by his two elder sons.[2]\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless.[3] Elisabeth died on 28 September 1293.[4] Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth.[5] This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this caused the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity.[2] He died seven years later in Erfurt, aged seventy-four.\n\nReferences[edit]\n\n\n\n^ \"E-Familytree.net\". Archived from the original on 2009-07-07. Retrieved 2008-11-03.\n\n^ Jump up to:a b Chisholm, Hugh, ed. (1911). \"Albert\" . Encyclopædia Britannica. 1 (11th ed.). Cambridge University Press. p. 498.\n\n^ Genealogy data by Herbert Stoyan. According to this site Elisabeth and her husband had seven children.\n\n^ ThePeerage.com. In this site Elisabeth's death is cited after 23 April 1326 and her husband is named Henry II, not III. Also, the death of Elisabeth's brother Apitz is cited on 27 June 1301, four years before the current date of the article.\n\n^ Genealogy data by Herbert Stoyan[permanent dead link]\n\n\n\n\n\nEvents\n\nBirth 1240 Death 20 Nov 1314\n\nFamilies"}, {"url": "https://wiki.alquds.edu/?query=Albert_I,_Margrave_of_Meissen", "page_content": "Albert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife [ edit ]\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.\n\nFürstenzug, Dresden Otto the Rich and his son and Albert;, Dresden\n\nHis father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1][2] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.[2]\n\nAncestors [ edit ]\n\nSee also [ edit ]"}, {"url": "https://www.wikiwand.com/en/Albert,_Margrave_of_Meissen_(1934%E2%80%932012)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Albert, Margrave of Meissen (1934–2012)?\n\nSummarize this article for a 10 years old"}, {"url": "https://everything.explained.today/Albert_I%2c_Margrave_of_Meissen/", "page_content": "Albert I, Margrave of Meissen explained\n\nAlbert I (1158 – 24 June 1195), called the Proud (German: Albrecht der Stolze), a member of the House of Wettin, was the Margrave of Meissen from 1190 until his death.\n\nLife\n\nAlbert was the eldest son of Margrave Otto the Rich (1156–1190) with his consort Hedwig of Brandenburg, a daughter of the Ascanian margrave Albert the Bear. In 1186 in Ústí nad Labem he married the Přemyslid princess Sophia, a daughter of Duke Frederick of Bohemia.His father did not intend to let Albert succeed him in Meissen, openly preferring his younger brother Theodoric. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of the Hohenstaufen emperor Frederick Barbarossa, he had to set him free but in 1190 he was able to obtain the margravial title upon Otto's death.\n\nAlbert accompanied Barbarossa's son Henry VI on his campaign to Sicily; nevertheless, he quickly abandoned the Imperial forces and returned to Meissen when his brother tried to regain the margraviate.[1] Theodoric, with the support of his father-in-law Landgrave Hermann of Thuringia, took up arms and defeated Albert's forces in a battle near Röblingen. The Margrave, in disguise as a monk, narrowly escaped to Leipzig and tried in vain to gain the support of furious Emperor Henry.\n\nThe fratricidal war ended when Albert suddenly died in June 1195, presumably poisoned, with no children to succeed him. He was buried in the Cistercian monastery of Altzella, established by his father in 1162. Meissen, with its rich mines, was seized by Emperor Henry VI as a princeless Imperial Estate. Not until 1198, Theodoric finally came into possession of his inheritance, following Henry's death in 1197.\n\nSee also\n\nNotes and References"}, {"url": "https://www.webot.org/info/en/?search=Albert_II,_Margrave_of_Meissen", "page_content": "Margrave of Meissen\n\nAlbert II, the Degenerate (de: Albrecht II der Entartete) (1240 – 20 November 1314) was a Margrave of Meissen, Landgrave of Thuringia and Count Palatine of Saxony. He was a member of the House of Wettin.\n\nHe was the eldest son of Henry III, Margrave of Meissen by his first wife, Constantia of Austria.\n\nLife\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albert and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nAlbert II, Margrave of Meissen (1288–1307) and Frederick I, Margrave of Meissen (1307–1324); Fürstenzug, Dresden, Germany\n\nHenry, Lord of Pleissnerland (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274; he married Hedwig, daughter of Henry III the White. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. They had two children: a daughter, Elisabeth in 1269, [1] and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert - suffering financial difficulties - was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg. He wished to make Apitz his successor in Thuringia, but the plan was resisted by his two elder sons. [2]\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless. [3] Elisabeth died on 28 September 1293. [4] Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth. [5] This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this caused the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. [2] He died seven years later in Erfurt, aged seventy-four.\n\nAncestors\n\nSee also"}, {"url": "https://www.liquisearch.com/albert_ii_margrave_of_meissen/life", "page_content": "Life\n\nIn 1265 Margrave Henry III granted the Landgraviate of Thuringia and the Palatinate to Albrecht and the Margraviate of Landsberg in the Osterland to his younger brother Dietrich. Henry III kept for himself the Margraviates of Meissen and Lusatia as a formal power over his sons.\n\nIn June 1255 Albert married Margaret of Sicily, the daughter of Emperor Frederick II, who was also King of Sicily, and Isabella of England. Margaret, also known as Margaret of Schwaben was a sister of Henry Otto, also known as Carlotto. As a dowry the Pleissnerland was pledged to the House of Wettin. Albert and Margaret had five children:\n\nHenry (b. 21 March 1256 - d. 25 January/23 July? 1282), inherited the Pleissnerland in 1274. Frederick (b. 1257 - d. Wartburg, 16 November 1323), Margrave of Meissen. Dietrich, called Diezmann (b. 1260 - murdered Leipzig, 10 December 1307), Margrave of Lusatia. Margaret (b. 1262 - d. young, aft. 17 April 1273). Agnes (b. 1264 - d. September 1332), married before 21 July 1282 to Henry I, Duke of Brunswick-Grubenhagen.\n\nAfter what was at first a happy rule and marriage, Albert turned away from Margaret and began a passionate love affair with Kunigunde of Eisenberg. She bore him two children: a daughter, Elisabeth in 1269, and a son, Albert (\"Apitz\") in 1270.\n\nWhen she discovered the adultery and the illegitimate births, Margaret left Wartburg on 24 June 1270 and went to Frankfurt am Main where she died on 8 August of the same year. The two younger sons, Frederick and Diezmann were looked after by their uncle, Theodoric of Landsberg. Henry, the oldest, disappeared in Silesia in 1282.\n\nAlbert married Kunigunde in 1274 and legitimised their children. When Albert intended to leave the Landgraviate of Thuringia to Apitz and compensate his sons from his first marriage with only the Osterland (which included the inheritance from their mother) and the County Palatine of Saxony, they began a war against their father. Frederick was captured by his father and was locked up in Wartburg castle; however, he escaped one year later and continued the war against his father together with Diezmann. During this time, in 1284, their uncle Theodoric of Landsberg died, and four years later, in 1288, Henry the Illustrious, Albert's father, also died. These deaths heightened the family disputes.\n\nAt the death of his father, Albert became Margrave of Meissen, while his nephew Frederick Tuta - son of Theodoric of Landsberg - inherited the Margraviate of Lusatia, which was sold off by Albert's son Diezmann in 1303. Shortly after, Frederick captured his father Albert in battle. By the Treaty of Rochlitz (1 January 1289), Albert obtained his freedom after the renunciation of large parts of his lands. He retained Meissen for himself, but later sold it to Frederick Tuta. When, after his death (1291) his cousins Frederick and Diezmann arbitrarily took possession of his lands, Albert —suffering financial difficulties— was compelled to sell Thuringia in 1293 to the German King Adolf of Nassau; in the contract, it was stipulated that the king could take possession of the lands after Albert's death. In the sale, Albert included Meissen and Osterland as his fiefs, despite the fact they were in the hands of his sons. Thanks to this, Adolf's successor Albert I of Habsburg was able to take possession of these lands, claiming that the contract of sale was legitimate and lawful.\n\nKunigunde of Eisenberg died on 31 October 1286. Four years later, on 1 October 1290, Albert married thirdly Elisabeth of Orlamünde, heiress of Nordhalben and widow of Hartmann XI of Lobdeburg-Arnshaugk. The same year, Apitz, Albert's son by Kunigunde, was formally legitimized by the Emperor and created Herr of Tenneberg.\n\nOn 11 April 1291 Apitz's younger full-sister, Elisabeth, married Henry III of Frankenstein; the marriage was short-lived and childless. Elisabeth died on 28 September 1293. Three years later (9 October 1296), Apitz married a sister of his brother-in-law Henry III, apparently also called Elisabeth. This marriage, like his sister's, was childless.\n\nFour years later (24 August 1300) Albert's eldest surviving son, Frederick, married Elisabeth of Lobdeburg-Arnshaugk, daughter of his stepmother; this make the final reconciliation between father and son. Five years later (27 June 1305) Apitz of Tenneberg died, aged thirty-five. The death of his favorite son was a terrible blow to Albert. He never recovered from the loss.\n\nTwo years later, in 1307, Albert finally resigned the Landgraviate of Thuringia and the County Palatine of Saxony to his son Frederick in exchange for an annuity. He died seven years later in Erfurt, aged seventy-four."}, {"url": "https://www.wikiwand.com/en/Egbert_I,_Margrave_of_Meissen", "page_content": "Egbert I (German: Ekbert) (died 11 January 1068) was the Margrave of Meissen from 1067 until his early death the next year. Egbert was the Count of Brunswick from about 1038, when his father, Liudolf, Margrave of Frisia, died. His mother was Gertrude, the sister of Pope Leo IX.\n\nQuick facts: Egbert I, Died, Noble family, Spouse(s), Issu... ▼\n\nEgbert was the scion of the influential Eastphalian family of the Brunonen. He inherited the familial lands in Brunswick and from about 1051 he shared the chief authority in the region with the Bishop of Hildesheim. Egbert also extended his authority and estates into Frisia under the suzerainty of the Archbishop of Hamburg-Bremen.\n\nAlthough closely related to the Salian dynasty, Egbert participated in the coup d'état of Kaiserswerth in 1062, whereat a group of nobles acting under Anno II, Archbishop of Cologne, tried to seize authority in the kingdom from King Henry IV and his regent mother, the Empress Agnes.\n\nIn 1058, Egbert married Immilla, the daughter of Ulric Manfred II of Turin, and widow of Otto of Schweinfurt. Egbert tried to repudiate Immilla shortly before his death in 1068.[1] His only son, Egbert II, succeeded him in Meissen. His daughter Gertrude later brought Meissen to her husband, Henry von Eilenburg."}, {"url": "https://alchetron.com/Albert-I%2C-Margrave-of-Meissen", "page_content": "Albert I, the Proud (de: Albrecht I der Stolze) (1158 – 24 June 1195), was the Margrave of Meissen from 1190 until his death in 1195. His father was Otto II, his mother Hedwig of Brandenburg. He was a member of the House of Wettin.\n\nHis father did not intend to let Albert succeed him, preferring his younger brother Dietrich. Albert did not accept this and started a war against his father and brother. In 1188, he even took his father prisoner. Under the orders of Frederick I, he had to set him free but he was able to obtain the title. Nevertheless, the conflict with his brother continued as he tried to regain the margraviate.\n\nAfter Albert died in 1195 with no children to succeed him. Meissen, with its rich mines, was seized by the emperor Henry VI as a vacant fief of the empire. Dietrich finally came into possession of his inheritance in 1198, following Henry's death in 1197."}]}