{"Sirið Stenberg was born in Tórshavn.": [{"url": "https://da.wikipedia.org/wiki/Siri%C3%B0_Stenberg", "page_content": "Sirið Stenberg (født 26. maj 1968 i Vágur) er en færøsk sundhedsplejerske og politiker (Tjóðveldi).\n\nHun er uddannet sygeplejerske fra 1994, og har videreuddannelse indenfor neonatalogi fra 1998 og som sundhedsplejerske fra Danmarks Sygeplejehøjskole fra 2001.[1] Stenberg er derudover internationalt certificeret ammevejleder (IBLC) fra 2005. Hun var sygeplejerske ved Hvidovre Hospital i 1990'erne, hjemmesygeplejerske 1999–2002 og fungerende leder ved Social- og sundhedsskolen (Heilsuskúli Føroya) 2006–2008. Fra 2001 er hun ansat som sundhedsplejerske i Suðuroy.\n\nPolitisk karriere [ redigér | rediger kildetekst ]\n\nStenberg har været kommunestyremedlem i Vágs Kommune siden 2009, hvor hun var formand for Socialudvalget 2009-2012[2] og formand for Kulturudvalget fra 2013 til september 2015, da hun blev minister og derfor måtte fratræde som byrådsmedlem.[3] I oktober 2011 blev hun indvalgt i Lagtinget. Hun var formand i Lagtingets kontroludvalg og medlem af Lagtingets velfærdsudvalg fra 2011 til 2015.\n\nVed lagtingsvalget 2015 fik hun 755 personlige stemmer, som var næstflest for Tjóðveldi.[4] Den 15. september 2015 blev hun sundheds- og indenrigsminister i Aksel V. Johannesens regering.[5][6]"}, {"url": "https://peoplepill.com/people/sirid-stenberg/", "page_content": "Sirið Stenberg (born 26 May 1968 in Vágur) is a Faroese politician. She finished her education as a nurse in 1994 and as a nurse in neonatalalogy in 1998 and as a nurse with special knowledge of children from 0-7 (Heilsufrøðingur in Faroese, Sundhedsplejerske in Danish, a health care visitor who attends to and gives advice to the mothers and their small children in their homes). Since 2001 she has worked in the children's health care in Suðuroy. She took leave from this employment shortly after assuming office as a member of the Faroese parliament, the parliament is located in Tórshavn, two hours away by ferry from Suðuroy. From 2006-08 she was head master of the Health School of the Faroe Islands, which is located in Suðuroy. She is married to Jón Pauli Olsen, who was football manager of the Faroese women's national football team and social and health assistant, together they have three children.\n\nPolitical career\n\nShe was elected to the Løgting representing Republic (Tjóðveldi) at the 2011 general election with 320 votes. She is also a member of the town council of Vágur since 2009.\n\nMember of standing committees of the Løgting"}, {"url": "https://prabook.com/web/sirid.stenberg/1861596", "page_content": "Sirid Stenberg Edit Profile\n\nassistant Faroese politician\n\nSirið Stenberg is a Faroese politician.\n\nEducation She finished her education as a nurse in 1994 and as a nurse in neonatalalogy in 1998 and as a nurse with special knowledge of children from 0-7 (Heilsufrøðingur in Faroese, Sundhedsplejerske in Danish, a health care visitor who attends to and gives advice to the mothers and their small children in their homes).\n\nCareer Since 2001 she has worked in the children\"s health care in Suðuroy. From 2006-2008 she was head master of the Health School of the Faroe Islands, which is located in Suðuroy. She was elected to the Løgting representing Republic (Tjóðveldi) at the 2011 general election with 320 votes.\n\n\n\n2011: Chairman of the Committee on Governmental Affairs."}, {"url": "https://www.celebrity-birthday.uk/bio/Siri%C3%B0-Stenberg", "page_content": "All Genders ♀️ Female ♂️ Male Transgender\n\nAll Genres Performers Musicians Artists Sports Footballers Writers Scholars Business Politicians Hoi Polloi\n\nAll Countries 🇬🇧 United Kingdom 🇺🇸 United States 🇦🇫 Afghanistan 🇦🇱 Albania 🇩🇿 Algeria 🇦🇸 American Samoa 🇦🇩 Andorra 🇦🇴 Angola 🇦🇮 Anguilla 🇦🇬 Antigua and Barbuda 🇦🇷 Argentina 🇦🇲 Armenia 🇦🇼 Aruba 🇦🇺 Australia 🇦🇹 Austria 🇦🇿 Azerbaijan 🇧🇸 Bahamas 🇧🇭 Bahrain 🇧🇩 Bangladesh 🇧🇧 Barbados 🇧🇾 Belarus 🇧🇪 Belgium 🇧🇿 Belize 🇧🇯 Benin 🇧🇲 Bermuda 🇧🇹 Bhutan 🇧🇴 Bolivia 🇧🇦 Bosnia and Herzegovina 🇧🇼 Botswana 🇧🇷 Brazil 🇻🇬 British Virgin Islands 🇧🇳 Brunei Darussalam 🇧🇬 Bulgaria 🇧🇫 Burkina Faso 🇧🇮 Burundi 🇰🇭 Cambodia 🇨🇲 Cameroon 🇨🇦 Canada 🇨🇻 Cape Verde 🇰🇾 Cayman Islands 🇨🇫 Central African Republic 🇹🇩 Chad 🇨🇱 Chile 🇨🇳 China 🇨🇴 Colombia 🇰🇲 Comoros 🇨🇰 Cook Islands 🇨🇷 Costa Rica 🇨🇮 Côte d'Ivoire 🇭🇷 Croatia 🇨🇺 Cuba 🇨🇾 Cyprus 🇨🇿 Czech Republic 🇩🇰 Denmark 🇩🇯 Djibouti 🇩🇲 Dominica 🇩🇴 Dominican Republic 🇪🇨 Ecuador 🇪🇬 Egypt 🇸🇻 El Salvador 🇬🇶 Equatorial Guinea 🇪🇷 Eritrea 🇪🇪 Estonia 🇪🇹 Ethiopia 🇫🇴 Faroe Islands 🇫🇯 Fiji 🇫🇮 Finland 🇫🇷 France 🇬🇫 French Guiana 🇵🇫 French Polynesia 🇬🇦 Gabon 🇬🇲 Gambia 🇬🇪 Georgia 🇩🇪 Germany 🇬🇭 Ghana 🇬🇮 Gibraltar 🇬🇷 Greece 🇬🇱 Greenland 🇬🇩 Grenada 🇬🇵 Guadeloupe 🇬🇺 Guam 🇬🇹 Guatemala 🇬🇬 Guernsey 🇬🇳 Guinea 🇬🇼 Guinea-Bissau 🇬🇾 Guyana 🇭🇹 Haiti 🇭🇳 Honduras 🇭🇰 Hong Kong 🇭🇺 Hungary 🇮🇸 Iceland 🇮🇳 India 🇮🇩 Indonesia 🇮🇷 Iran 🇮🇶 Iraq 🇮🇪 Ireland 🇮🇲 Isle of Man 🇮🇱 Israel 🇮🇹 Italy 🇯🇲 Jamaica 🇯🇵 Japan 🇯🇪 Jersey 🇯🇴 Jordan 🇰🇿 Kazakhstan 🇰🇪 Kenya 🇰🇮 Kiribati 🇰🇵 Korea (North) 🇰🇷 Korea (South) 🇰🇼 Kuwait 🇰🇬 Kyrgyzstan 🇱🇦 Lao PDR 🇱🇻 Latvia 🇱🇧 Lebanon 🇱🇸 Lesotho 🇱🇷 Liberia 🇱🇾 Libya 🇱🇮 Liechtenstein 🇱🇹 Lithuania 🇱🇺 Luxembourg 🇲🇰 Macedonia 🇲🇬 Madagascar 🇲🇼 Malawi 🇲🇾 Malaysia 🇲🇻 Maldives 🇲🇱 Mali 🇲🇹 Malta 🇲🇭 Marshall Islands 🇲🇶 Martinique 🇲🇷 Mauritania 🇲🇺 Mauritius 🇲🇽 Mexico 🇲🇩 Moldova 🇲🇨 Monaco 🇲🇳 Mongolia 🇲🇪 Montenegro 🇲🇸 Montserrat 🇲🇦 Morocco 🇲🇿 Mozambique 🇲🇲 Myanmar 🇳🇦 Namibia 🇳🇷 Nauru 🇳🇵 Nepal 🇳🇱 Netherlands 🇦🇳 Netherlands Antilles 🇳🇨 New Caledonia 🇳🇿 New Zealand 🇳🇮 Nicaragua 🇳🇪 Niger 🇳🇬 Nigeria 🇲🇵 Northern Mariana Islands 🇳🇴 Norway 🇴🇲 Oman 🇵🇰 Pakistan 🇵🇼 Palau 🇵🇸 Palestinian Territory 🇵🇦 Panama 🇵🇬 Papua New Guinea 🇵🇾 Paraguay 🇵🇪 Peru 🇵🇭 Philippines 🇵🇱 Poland 🇵🇹 Portugal 🇵🇷 Puerto Rico 🇶🇦 Qatar 🇷🇪 Réunion 🇷🇴 Romania 🇷🇺 Russian Federation 🇷🇼 Rwanda 🇰🇳 Saint Kitts and Nevis 🇱🇨 Saint Lucia 🇼🇸 Samoa 🇸🇲 San Marino 🇸🇦 Saudi Arabia 🇸🇳 Senegal 🇷🇸 Serbia 🇸🇨 Seychelles 🇸🇱 Sierra Leone 🇸🇬 Singapore 🇸🇰 Slovakia 🇸🇮 Slovenia 🇸🇧 Solomon Islands 🇸🇴 Somalia 🇿🇦 South Africa 🇬🇸 South Georgia 🇸🇸 South Sudan 🇪🇸 Spain 🇱🇰 Sri Lanka 🇵🇲 St Pierre and Miquelon 🇸🇩 Sudan 🇸🇷 Suriname 🇸🇿 Swaziland 🇸🇪 Sweden 🇨🇭 Switzerland 🇸🇾 Syria 🇹🇼 Taiwan 🇹🇯 Tajikistan 🇹🇿 Tanzania 🇹🇭 Thailand 🇹🇬 Togo 🇹🇴 Tonga 🇹🇹 Trinidad and Tobago 🇹🇳 Tunisia 🇹🇷 Turkey 🇹🇲 Turkmenistan 🇹🇨 Turks and Caicos Islands 🇹🇻 Tuvalu 🇺🇬 Uganda 🇺🇦 Ukraine 🇦🇪 United Arab Emirates 🇬🇧 United Kingdom 🇺🇸 United States of America 🇺🇾 Uruguay 🇺🇿 Uzbekistan 🇻🇪 Venezuela 🇻🇳 Vietnam 🇪🇭 Western Sahara 🏳️ World 🇾🇪 Yemen 🇿🇲 Zambia 🇿🇼 Zimbabwe\n\nAll Signs Aries Taurus Gemini Cancer Leo Virgo Libra Scorpio Sagittarius Capricorn Aquarius Pisces\n\nAll Animals Rat Ox Tiger Dragon Snake Horse Goat Monkey Rooster Dog Pig\n\nReset"}, {"url": "https://www.norden.org/en/person/sirid-stenberg", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://www.tjodveldi.fo/?page_id=379", "page_content": "Ver vælkomin á mína síðu!\n\nMíni hjartamál eru millum annað\n\nTað skal vera liviligt allastaðni í Føroyum, góð samferðsla er ein av grundarsteinunum undir hesum\n\nFøroyska familjan skal hava betri livikor, kostnaðarstøðið er ov høgt og familjur eru í fátakraváða\n\nBarnsburðarfarloyvi eigur at vera longt, og málið eigur at vera eitt ár\n\nAlmenna umsitingin eigur at vera endurskoða, og laga til føroysk viðurskifti so vit fáa føroyskar loysnir\n\nMannarættindi og barnarættindi skulu vera vird, og førd út í lívið\n\nFólkaskúlin og serøkið skal styrkjast so børnini fáa tað hjálp teimum tørvar\n\nEldrapolitikkur má orðast við støði í røktarheimsfyribyrging, heldur enn bara stóvnsbygging\n\nSkattaskipanin skal vera samhaldsføst. Finnast má ein leistur har øll eru við til at gjalda\n\nPartafelagslógin eigur at vera endurskoða\n\nVinnan skal hava karmar at virka undir um allar Føroya\n\nHeilsuverkið eigur ikki at vera centralisera, men skal samstarva fyri at betra um tænastuna og raksturin\n\nKommunal útjavnan er ein fortreyt fyri at økir vera løgd út til kommununar at umsita\n\nFólkaræðisligar tilgongdir eru neyðugar í øllum lutum\n\nOrku og umhvørvismál eiga at vera raðfest so vit m.a ikki eru so tengd at dyru oljuni\n\nFari at heita á teg um at stuðla mær so eg kann arbeiða víðari við hesum ætlanum, og arbeiða móti einum frælsum samhaldsføstum samfelag, har tað skal vera gott hjá okkum øllum at búgva.\n\nVinarliga\n\nSirið Stenberg, valevnið fyri Tjóðveldi\n\nUm meg\n\nNavn: Sirið Stenberg\n\nFøðingardagur: 26.05.68\n\nBústaður: Skálavegur 3, 900 Vágur\n\nMaki: Jón Pauli Olsen\n\nBørn: Tóra 15 ár, Fríði 13 ár, Ásgerð 5 ár\n\nForeldur: Ásgerð og Flemming Stenberg\n\nÚtbúgving\n\nSjúkrarøktarfrøðingur 1994 á Bispebjerg Hospital.\n\nNeonatalur sjúkrarøktarfrøðingur 1998 á Hvidovre Hospital.\n\nHeilsufrøðingur 2001 á Danmarks Sygeplejerskehøjskole.\n\nAltjóða ráðgevi í bróstageving IBCLC 2005.\n\nVaralimur í høvuðsbarnaverndini 2006-2009\n\nStørv\n\nVirkandi leiðari á Heilsuskúla Føroya frá nov. 2007.\n\nHeilsufrøðingur í Suðuroynni frá 2001.\n\nHeimasjúkrarøktarfrøðingur frá 1999 – 2002.\n\nSjúkrarøktarfrøðingur á Hvidovre Hospital.\n\nHarumframt undirvísari á ymiskum deildum og skeiðshaldari, serliga við atliti til børn, barnakonur og eldraøkið.\n\nVaralimur í Høvuðsbarnaverndini fyri Føroyar frá 2006.\n\nÁhugamál\n\nVirkin í kórarbeiði í Kirkjukórinum Ljómi.\n\nSamfelagsviðurskifti, serliga á barna og familjuøkinum, útbúgvingar og mentanarøkið.\n\nPolitikkur\n\nUppstillað til løgtingsvalið í 2007. Uppstillað og vald í Vágs Býráð í 2009. Forkvinna í sosialu nevnd. Limur í mentanarnevndini. Somuleiðis limur í umhvørvisbólkinum hjá Vágs Kommunu."}, {"url": "https://popularbio.com/siri-stenberg/", "page_content": "Updated On April 30, 2023\n\nSirið Stenberg estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Sirið Stenberg in 2019-2020? Scroll below and check more detailed information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nSirið Stenberg was born in Vágur, Faroe Islands on May 26, 1968.\n\nOn Popular Bio, She is one of the successful Politicians. She has ranked on the list of famous people who were born on May 26, 1968. She is one of the Richest Politicians who was born in the Faroe Islands. She also has a position among the list of Most popular Politicians. Sirið Stenberg is 1 of the famous people in our database with the age of 51 years old.\n\nShort Profile First Name Sirið Last Name Stenberg Profession Politician Age 51 years old Birth Sign Gemini Birth Date May 26, 1968 Birth Place Vágur, Faroe Islands Country Faroe Islands\n\nSirið Stenberg Net Worth\n\nSirið Stenberg estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Sirið Stenberg in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Politician Sirið Stenberg’s net worth is $1-5 Million at the age of 51 years old. She earned the money being a Professional Politician. She is from the Faroe Islands.\n\nSirið Stenberg’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 $1-3million Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Politician (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nSirið Stenberg currently ages 51 years old. Sirið Stenberg’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Sirið Stenberg Dating?\n\nSirið Stenberg keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Sirið Stenberg’s past relationships, ex-girlfriends, and previous hookups. Sirið Stenberg prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Sirið Stenberg"}, {"url": "https://www.ammr.fo/fo/kunning/tidindi/sirid-stenberg-vitjad-beran/", "page_content": "Landsstýriskvinnan í almanna- og mentamálum, Sirið Stenberg, hevur verið á gátt hjá Beranum í vikuni.\n\nBerin er ein hjálparfelagsskapur, sum hevur 20 ár á baki, og stuðlar børnum og ungum, sum hava mist ella hava álvarsliga sjúk foreldur ella systkin, og foreldur, ið hava mist barn.\n\nUndir vitjanini fekk landsstýriskvinnan kunning um virksemið hjá Beranum.\n\nHøvuðsendamálið hjá Beranum er at geva børnum og ungum, ið antin hava mist ella sum hava álvarsama sjúk foreldur ella systkin, eitt stað, har tey kunnu hittast og práta við onnur í somu støðu. Berin skipar eisini fyri bólkum fyri foreldur, sum hava mist børn, og veitir umframt bólkasamrøður eisini einstaklinga- og familjusamrøður við sálarfrøðing.\n\nBerin skipar harumframt fyri kunnandi og fyribyrgjandi virksemi og luttekur í verkætlanum, ið hava til endamáls at hjálpa teimum, sum hava mist.\n\nBerin ger ein stórt og umráðandi arbeiðið, og tað hevur verið sera áhugavert at hoyra um nógva og fjølbroytta virksemi hjá Beranum, sigur Sirið Stenberg, landsstýriskvinna.\n\nJáttanina til Beran hækkaði við 400 tús. kr. á fíggjarlógini fyri 2023. Undir vitjanini varð víst á, at hendan raðfesting ger tað møguligt hjá Beranum at møta tí alsamt vaksandi tørvinum eftir virkseminum hjá Beranum, eins og at gera tilboðið til børn og ung, sum hava álvarsama sjúk foreldur ella systkin til eitt varandi tilboð.\n\nÁ myndini: Gunnvá Højgaard Mohr, Oddvør Poulsen, Sirið Stenberg og Frida Poulsen."}, {"url": "https://www.in.fo/news-detail/republikanskur-forvirringur-svar-til-sirid-stenberg", "page_content": "Sohvørt sum politiski landsmyndugleikin seinru nógvu árini hevur kastað ábyrgd og ræði frá sær í fleiri av vitalu stórmálum samfelagsins, eru kommunurnar vorðnar ein stjórnarberandi meginfaktorur í landinum. Á Vaglinum er parlamentariska øðin og trongdin, eftir at hava ein fingur við í spælinum - í at kalla øllum - kortini ikki viknað, heldur hinvegin, áhaldandi ger landspolitiski geirin royndina at disponera yvir fænum í kommunalu kassunum, og tað ber til, tá hesi eiga eksklusiva leikin fyri borgaran, at sita við lóggevandi valdi landsins. Tí er umráðandi at kommunali geirin er væl skipaður, og ger vart við seg, tá ólíkindini gerast í meira lagi herskin.\n\nKom einaferð á tal við ein eldri fiskimann, sum helt óvanliga lítið um fólkið í eini ávísari bygd í Føroyum. Spurdi hví hann generaliseraði soleiðis, og hann var ikki seinur at kvittera: “Eg var einaferð til skips saman við einum manni haðani, - tí kenni eg slagið(!)”\n\nSirið Stenberg hevur verið á einum republikanskum ressingarmøti á Finsen í Havn hin 9. mars. Har hoyrdi hon éin mann, ið hevur verið avvarðandi, finnast at gongdini og viðurskiftunum á eldraøkinum hesi seinru árini í mun til støðuna sum hevði verið, sum skilst, tá høpið lá undir landsmyndugleikanum. Vit eru farin frá nærleiðslu til fjarstýring, endurgevur hon mannin fyri at hava sagt. Eftir tað guvar bara svávilroykur úr grein hennara, republikanskur forvirringur, við støði í eini subjektivari viðmerking á einum hissini konventi, sum Tjóðveldisflokkurin hevði sett á pall miðskeiðis í høvuðsborgini.\n\nÚr illa laðaða varða (grein) hennara bert hesi brot: “Undarligt at man ikki hevur hugt at starvsfólkabygnaðinum í dag........vit hoyra javnan um fleiri leiðsluløg og tungan og stirvnan bygnað.........partur av leiðslubygnaðinum kundi farið til starvsfólkaorku “á gólvinum”........dagliga samskiftið við leiðsluna hvørvur ígjøgnum fleiri løg av fólki, og nærleikin verður burtur..........tí mugu vit áhaldandi seta spurnartekn við, hvussu vit skapa bestu umstøður fyri tey, sum vit skulu hjálpa.”\n\nLandspolitikararnir tveittu byrðuna av herðunum fyri góðum 7 árum síðan, táið tað snýr seg um eldraøkið. Sum á so mongum økjum maktaðu teir ikki meiri, megin sveik, ella vóru ov fáar atkvøður í heinta, og tá má onkur annar taka um endan. Tað gjørdu kommunurnar, sum veruliga taka ábyrgd fyri sínum borgarum líkamikið hvussu víkur og vendur. Yvirhøvur er fatanin millum manna, at høpið í allar mátar er væl betri rikið nú enn frammanundan og at tænastustøðið er munandi hækkað.\n\nRoðin er næststørsta eldraøki í landinum, og sum stýrisformaður í 5-6 ár fái eg bert sagt nakað burturúr okkara egnu royndum á økinum, og lat meg sláa fast, at eg als ikki kenni meg aftur í hesum svarta tosinum hjá Sirið Stenberg. Sjóvar, Nes- og Runavíkar kommunur hava lagt nógva orku í, saman við leiðsluni í Roðanum, at menna tænasturnar á eldraøkinum, og kommunurnar hava, umvegis stýrið og bý- og bygdaráðini, ikki verið pírnar, táið tað snýr seg um at leggja rygg og kollektiv lógvatøk til rakstur og um- og nýbyggingar. Roðin hevur staðið í rúkandi menning hesi seinru árini.\n\nRoðin eigur 5 bygningar. Vesturskin á Toftum, Sjóvarlon á Strondum, Vistarheimið í Runavík, Dagtilhaldið fyri minnisveik á Skála og Eysturoyar Røktar- og Ellisheim í Runavík. Viðvíkjandi uppáhaldinum hjá frúnni Stenberg, um at man er farin frá nærleiðslu til fjarstýring, er at viðmerkja, at Roðin er skipaður við einum ovasta leiðara (samtaksovasta) og deildarleiðarum á øllum deildum (nærleiðsla). Deildarleiðararnir á røktareindunum, á demenstænastuni og heimatænastuni eru sjúkrarøktarfrøðingar. Deildarleiðarin á terapieindini er fysioterapeutur. Eitt av endamálunum við hesum er at tryggja sambandið og tryggleikan millum starvsfólk, búfólk og tey avvarðandi. Orsøkin til, at hildið verður fast við eitt høgt støði á økinum, við vælútbúnum deildarleiðarum, liggur í ætlan um at tryggja fakligu dygdina á eldraøkinum, sum vit varða av. Kann ætla at støðan er á leið hin sama aðrar staðir í landinum.\n\nHví Sirið Stenberg er farin at høsnast við eldraøkið, góð 7 ár eftir at løgting og landsstýri av ómegd tveittu ábyrgdina frá sær, kann bara gitast um – kanska er tíðin komin til at blása í illa trevsaða valbjølgin – nú tann tíðin nærkast. Tá plaga summi at tosa um alt annað enn tað, sum krevst fyri at stjórna danska heimastýrinum í Føroyum - ella um tað skuldi verið - at sitið fyri endanum á eini føroyskari republikk.\n\nFyri Roðan kann eg sum stýrisformaður siga, at vit hava ikki brúk fyri, at landspolitikarar tosa eldraøkið niður og norður í eitt svart hol. Meðan aðrir flokkar hava verið so frægir, at teir hava vitjað Roðan – leiðslu og stýrisovasta – hava vit ikki hoyrt tað látið úr Tjóðveldisflokkinum, helst tí at teinurin av Vaglinum er ov drúgvur, og tí at lagaliga metrosexuella huglagið viknar - sohvørt sum tú flytir teg burtur frá eingjargørðunum kring um høvuðsborgina.\n\nAnnars kann samanumtikið sigast, at Roðin ongan bíðilista hevur í løtuni, allar deildir eru virknar og manning er á øllum postum. Tað einasta vit ikki hava brúk fyri í løtuni er ørkemlandi republikanskum forvirringi, sum kann bumba økið aftur í tíðina, táið landspolitikarar okkara høvdu ábyrgdina av eldraøkinum.\n\nFrið, arbeiðsfrið, - tað er tað einasta vit ynskja okkum. Takk."}, {"url": "https://da.wikipedia.org/wiki/Siri%C3%B0_Stenberg", "page_content": "Sirið Stenberg (født 26. maj 1968 i Vágur) er en færøsk sundhedsplejerske og politiker (Tjóðveldi).\n\nHun er uddannet sygeplejerske fra 1994, og har videreuddannelse indenfor neonatalogi fra 1998 og som sundhedsplejerske fra Danmarks Sygeplejehøjskole fra 2001.[1] Stenberg er derudover internationalt certificeret ammevejleder (IBLC) fra 2005. Hun var sygeplejerske ved Hvidovre Hospital i 1990'erne, hjemmesygeplejerske 1999–2002 og fungerende leder ved Social- og sundhedsskolen (Heilsuskúli Føroya) 2006–2008. Fra 2001 er hun ansat som sundhedsplejerske i Suðuroy.\n\nPolitisk karriere [ redigér | rediger kildetekst ]\n\nStenberg har været kommunestyremedlem i Vágs Kommune siden 2009, hvor hun var formand for Socialudvalget 2009-2012[2] og formand for Kulturudvalget fra 2013 til september 2015, da hun blev minister og derfor måtte fratræde som byrådsmedlem.[3] I oktober 2011 blev hun indvalgt i Lagtinget. Hun var formand i Lagtingets kontroludvalg og medlem af Lagtingets velfærdsudvalg fra 2011 til 2015.\n\nVed lagtingsvalget 2015 fik hun 755 personlige stemmer, som var næstflest for Tjóðveldi.[4] Den 15. september 2015 blev hun sundheds- og indenrigsminister i Aksel V. Johannesens regering.[5][6]"}]}