{"Sirið Stenberg joined Týr in 2004.": [{"url": "https://da.wikipedia.org/wiki/Siri%C3%B0_Stenberg", "page_content": "Sirið Stenberg (født 26. maj 1968 i Vágur) er en færøsk sundhedsplejerske og politiker (Tjóðveldi).\n\nHun er uddannet sygeplejerske fra 1994, og har videreuddannelse indenfor neonatalogi fra 1998 og som sundhedsplejerske fra Danmarks Sygeplejehøjskole fra 2001.[1] Stenberg er derudover internationalt certificeret ammevejleder (IBLC) fra 2005. Hun var sygeplejerske ved Hvidovre Hospital i 1990'erne, hjemmesygeplejerske 1999–2002 og fungerende leder ved Social- og sundhedsskolen (Heilsuskúli Føroya) 2006–2008. Fra 2001 er hun ansat som sundhedsplejerske i Suðuroy.\n\nPolitisk karriere [ redigér | rediger kildetekst ]\n\nStenberg har været kommunestyremedlem i Vágs Kommune siden 2009, hvor hun var formand for Socialudvalget 2009-2012[2] og formand for Kulturudvalget fra 2013 til september 2015, da hun blev minister og derfor måtte fratræde som byrådsmedlem.[3] I oktober 2011 blev hun indvalgt i Lagtinget. Hun var formand i Lagtingets kontroludvalg og medlem af Lagtingets velfærdsudvalg fra 2011 til 2015.\n\nVed lagtingsvalget 2015 fik hun 755 personlige stemmer, som var næstflest for Tjóðveldi.[4] Den 15. september 2015 blev hun sundheds- og indenrigsminister i Aksel V. Johannesens regering.[5][6]"}, {"url": "https://www.norden.org/en/person/sirid-stenberg", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://www.in.fo/news-detail/stenberg-er-st-rin", "page_content": "Sirið Stenberg, forkvinna í Landsstýrismálanevndini er ikki trygg við støðuna, tá løgtingsformaðurin, Jógvan á Lakjuni, hevur sett Anfinn V. Hansen, advokat, at kanna leiklutin hjá løgmanni og Kára P. Højgaard, landsstýrismanni. Hetta tí, at fleiri spurningar kunnu setast við trúvirðið hjá kanningarstjóranum.\n\n\n\nNógvir leiklutir\n\nAnnfinn V. Hansen hevur nevniliga sitið á Løgtingi eitt skifti sum varamaður fyri Fólkaflokkin.\n\nHann er eisini formaður í stýrinum fyri Samhaldsfasta, sum var upp á tal at seta pening í Eysturoyartunnilin. Og so førdi Sirið Stenberg eisini fram, at Annfinn V. Hansen er formaður í Gjaldsstovuráðnum og so er spurningurin um hann sostatt er ein partur í fyrisitingini, sum kanningarstjórin ikki skal vera. Staðfest er tó, at hetta ikki ger Annfinn V. Hansen sum part av fyrisitingini.\n\nSirið Stenberg leggur dent á, at hon kennir ikki kanningarstjóran og hevur onga meining um hann sum løgfrøðing. Men hon heldur, at tað er heilt ómetaliga óheppið, at ivi verður sáddur um trúvirðið hjá kanningarstjóranum, longu áðrenn kanningin er farin ígongd.\n\nHon staðfestir, at ein orsøk til at Landsstýrismálanevndin vildi hava kanningarstjóra, var fyri at kanna um nakað ólógligt var farið fram.\n\n- Men ætlanin við kanningini var avgjørt eisini at fáa eina óhefta kanning við tí endamáli at endurvinna álitið á politisku skipanina, sum vit føldu, var fokið, hevur Sirið Stenberg sagt við in.fo.\n\nTí er tað, sambært henni, ógvuliga óheppið, at ivi verður sáddur um trúðvirðið hjá kanninginarstjóranum longu áðrenn kanningin er farin í gongd, tí tá er vandi fyri, at ivi eisini fer at verða sáddur um úrslitið av kanningini, sama, hvat tað verður.\n\n- Og so eru vit aftur í somu støðu, sum vit ætlaðu, at kanningin skuldi sleppa okkum burtur úr, nevniliga, at misálit er á politisku skipanina, hevur Sirið Stenberg sagt."}, {"url": "https://www.norden.org/en/node/19205", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://prabook.com/web/sirid.stenberg/1861596", "page_content": "Sirid Stenberg Edit Profile\n\nassistant Faroese politician\n\nSirið Stenberg is a Faroese politician.\n\nEducation She finished her education as a nurse in 1994 and as a nurse in neonatalalogy in 1998 and as a nurse with special knowledge of children from 0-7 (Heilsufrøðingur in Faroese, Sundhedsplejerske in Danish, a health care visitor who attends to and gives advice to the mothers and their small children in their homes).\n\nCareer Since 2001 she has worked in the children\"s health care in Suðuroy. From 2006-2008 she was head master of the Health School of the Faroe Islands, which is located in Suðuroy. She was elected to the Løgting representing Republic (Tjóðveldi) at the 2011 general election with 320 votes.\n\n\n\n2011: Chairman of the Committee on Governmental Affairs."}, {"url": "https://www.in.fo/news-detail/republikanskur-forvirringur-svar-til-sirid-stenberg", "page_content": "Sohvørt sum politiski landsmyndugleikin seinru nógvu árini hevur kastað ábyrgd og ræði frá sær í fleiri av vitalu stórmálum samfelagsins, eru kommunurnar vorðnar ein stjórnarberandi meginfaktorur í landinum. Á Vaglinum er parlamentariska øðin og trongdin, eftir at hava ein fingur við í spælinum - í at kalla øllum - kortini ikki viknað, heldur hinvegin, áhaldandi ger landspolitiski geirin royndina at disponera yvir fænum í kommunalu kassunum, og tað ber til, tá hesi eiga eksklusiva leikin fyri borgaran, at sita við lóggevandi valdi landsins. Tí er umráðandi at kommunali geirin er væl skipaður, og ger vart við seg, tá ólíkindini gerast í meira lagi herskin.\n\nKom einaferð á tal við ein eldri fiskimann, sum helt óvanliga lítið um fólkið í eini ávísari bygd í Føroyum. Spurdi hví hann generaliseraði soleiðis, og hann var ikki seinur at kvittera: “Eg var einaferð til skips saman við einum manni haðani, - tí kenni eg slagið(!)”\n\nSirið Stenberg hevur verið á einum republikanskum ressingarmøti á Finsen í Havn hin 9. mars. Har hoyrdi hon éin mann, ið hevur verið avvarðandi, finnast at gongdini og viðurskiftunum á eldraøkinum hesi seinru árini í mun til støðuna sum hevði verið, sum skilst, tá høpið lá undir landsmyndugleikanum. Vit eru farin frá nærleiðslu til fjarstýring, endurgevur hon mannin fyri at hava sagt. Eftir tað guvar bara svávilroykur úr grein hennara, republikanskur forvirringur, við støði í eini subjektivari viðmerking á einum hissini konventi, sum Tjóðveldisflokkurin hevði sett á pall miðskeiðis í høvuðsborgini.\n\nÚr illa laðaða varða (grein) hennara bert hesi brot: “Undarligt at man ikki hevur hugt at starvsfólkabygnaðinum í dag........vit hoyra javnan um fleiri leiðsluløg og tungan og stirvnan bygnað.........partur av leiðslubygnaðinum kundi farið til starvsfólkaorku “á gólvinum”........dagliga samskiftið við leiðsluna hvørvur ígjøgnum fleiri løg av fólki, og nærleikin verður burtur..........tí mugu vit áhaldandi seta spurnartekn við, hvussu vit skapa bestu umstøður fyri tey, sum vit skulu hjálpa.”\n\nLandspolitikararnir tveittu byrðuna av herðunum fyri góðum 7 árum síðan, táið tað snýr seg um eldraøkið. Sum á so mongum økjum maktaðu teir ikki meiri, megin sveik, ella vóru ov fáar atkvøður í heinta, og tá má onkur annar taka um endan. Tað gjørdu kommunurnar, sum veruliga taka ábyrgd fyri sínum borgarum líkamikið hvussu víkur og vendur. Yvirhøvur er fatanin millum manna, at høpið í allar mátar er væl betri rikið nú enn frammanundan og at tænastustøðið er munandi hækkað.\n\nRoðin er næststørsta eldraøki í landinum, og sum stýrisformaður í 5-6 ár fái eg bert sagt nakað burturúr okkara egnu royndum á økinum, og lat meg sláa fast, at eg als ikki kenni meg aftur í hesum svarta tosinum hjá Sirið Stenberg. Sjóvar, Nes- og Runavíkar kommunur hava lagt nógva orku í, saman við leiðsluni í Roðanum, at menna tænasturnar á eldraøkinum, og kommunurnar hava, umvegis stýrið og bý- og bygdaráðini, ikki verið pírnar, táið tað snýr seg um at leggja rygg og kollektiv lógvatøk til rakstur og um- og nýbyggingar. Roðin hevur staðið í rúkandi menning hesi seinru árini.\n\nRoðin eigur 5 bygningar. Vesturskin á Toftum, Sjóvarlon á Strondum, Vistarheimið í Runavík, Dagtilhaldið fyri minnisveik á Skála og Eysturoyar Røktar- og Ellisheim í Runavík. Viðvíkjandi uppáhaldinum hjá frúnni Stenberg, um at man er farin frá nærleiðslu til fjarstýring, er at viðmerkja, at Roðin er skipaður við einum ovasta leiðara (samtaksovasta) og deildarleiðarum á øllum deildum (nærleiðsla). Deildarleiðararnir á røktareindunum, á demenstænastuni og heimatænastuni eru sjúkrarøktarfrøðingar. Deildarleiðarin á terapieindini er fysioterapeutur. Eitt av endamálunum við hesum er at tryggja sambandið og tryggleikan millum starvsfólk, búfólk og tey avvarðandi. Orsøkin til, at hildið verður fast við eitt høgt støði á økinum, við vælútbúnum deildarleiðarum, liggur í ætlan um at tryggja fakligu dygdina á eldraøkinum, sum vit varða av. Kann ætla at støðan er á leið hin sama aðrar staðir í landinum.\n\nHví Sirið Stenberg er farin at høsnast við eldraøkið, góð 7 ár eftir at løgting og landsstýri av ómegd tveittu ábyrgdina frá sær, kann bara gitast um – kanska er tíðin komin til at blása í illa trevsaða valbjølgin – nú tann tíðin nærkast. Tá plaga summi at tosa um alt annað enn tað, sum krevst fyri at stjórna danska heimastýrinum í Føroyum - ella um tað skuldi verið - at sitið fyri endanum á eini føroyskari republikk.\n\nFyri Roðan kann eg sum stýrisformaður siga, at vit hava ikki brúk fyri, at landspolitikarar tosa eldraøkið niður og norður í eitt svart hol. Meðan aðrir flokkar hava verið so frægir, at teir hava vitjað Roðan – leiðslu og stýrisovasta – hava vit ikki hoyrt tað látið úr Tjóðveldisflokkinum, helst tí at teinurin av Vaglinum er ov drúgvur, og tí at lagaliga metrosexuella huglagið viknar - sohvørt sum tú flytir teg burtur frá eingjargørðunum kring um høvuðsborgina.\n\nAnnars kann samanumtikið sigast, at Roðin ongan bíðilista hevur í løtuni, allar deildir eru virknar og manning er á øllum postum. Tað einasta vit ikki hava brúk fyri í løtuni er ørkemlandi republikanskum forvirringi, sum kann bumba økið aftur í tíðina, táið landspolitikarar okkara høvdu ábyrgdina av eldraøkinum.\n\nFrið, arbeiðsfrið, - tað er tað einasta vit ynskja okkum. Takk."}, {"url": "https://wiki.alquds.edu/?query=Siri%C3%B0_Stenberg", "page_content": "Faroese politician\n\nSirið Stenberg (born 26 May 1968 in Vágur) is a Faroese politician. She finished her education as a nurse in 1994 and as a nurse in neonatalalogy in 1998 and as a nurse with special knowledge of children from 0-7 (Heilsufrøðingur in Faroese, Sundhedsplejerske in Danish, a health care visitor who attends to and gives advice to the mothers and their small children in their homes). Since 2001 she has worked in the children's health care in Suðuroy. She took leave from this employment shortly after assuming office as a member of the Faroese parliament, the parliament is located in Tórshavn, two hours away by ferry from Suðuroy. From 2006-08 she was head master of the Health School of the Faroe Islands, which is located in Suðuroy. She is married to Jón Pauli Olsen, who was football manager[1] of the Faroese women's national football team[2] and social and health assistant, together they have three children.[3]\n\nPolitical career [ edit ]\n\nShe was elected to the Løgting representing Republic (Tjóðveldi) at the 2011 general election with 320 votes. She was a member of the town council of Vágur from 2009 - 2015. At the general elections of 2015 she was reelected to the Løgting. Her party formed government together with the Social Democratic Party and Progress and they chose Sirið Stenberg as the minister of health of the Faroe Islands.\n\nMember of standing committees of the Løgting [ edit ]\n\n2011: Chairman of the Committee on Governmental Affairs [4]\n\n2011: Member of the Welfare Committee[5]"}, {"url": "https://peoplepill.com/people/sirid-stenberg/", "page_content": "Sirið Stenberg (born 26 May 1968 in Vágur) is a Faroese politician. She finished her education as a nurse in 1994 and as a nurse in neonatalalogy in 1998 and as a nurse with special knowledge of children from 0-7 (Heilsufrøðingur in Faroese, Sundhedsplejerske in Danish, a health care visitor who attends to and gives advice to the mothers and their small children in their homes). Since 2001 she has worked in the children's health care in Suðuroy. She took leave from this employment shortly after assuming office as a member of the Faroese parliament, the parliament is located in Tórshavn, two hours away by ferry from Suðuroy. From 2006-08 she was head master of the Health School of the Faroe Islands, which is located in Suðuroy. She is married to Jón Pauli Olsen, who was football manager of the Faroese women's national football team and social and health assistant, together they have three children.\n\nPolitical career\n\nShe was elected to the Løgting representing Republic (Tjóðveldi) at the 2011 general election with 320 votes. She is also a member of the town council of Vágur since 2009.\n\nMember of standing committees of the Løgting"}, {"url": "https://www.in.fo/news-detail/sirid-stenberg-er-ogvuliga-sturin", "page_content": "Hetta er ómetaliga órógvandi og óheppið!\n\nSirið Stenberg, forkvinna í Landsstýrismálanevndini er ikki trygg við støðuna, nú Løgtingsformaðurin hevur sett Anfinn V. Hansen, løgfrøðing, at kanna leiklutin hjá løgmanni og Kára P. Højgaard, landsstýrismanni.\n\nSíðani eru fleiri spurningar settir við trúvirðið hjá kanningarstjóranum.\n\nÍ hesum sambandi hevur verið nevnt, at hann hevur sitið á Løgtingi eitt skifti sum varamaður fyri Fólkaflokkin.\n\nHann er eisini formaður í stýrinum fyri Samhaldsfasta, sum var upp á tal at seta pening í Eysturoyartunnilin.\n\nSirið Stenberg vísir somuleiðis á, at Annfinn V. Hansen eisini formaður í Gjaldsstovuráðnum og so er spurningurin um hann sostatt er ein partur í fyrisitingini, sum kanningarstjórin ikki skal vera.\n\nSirið Stenberg leggur dent á, at hon kennir ikki kanningarstjóran og hevur onga meining um hann sum løgfrøðing.\n\nMen hon heldur, at tað er heilt ómetaliga óheppið, at ivi verður sáddur um trúvirðið hjá kanningarstjóranum, longu áðrenn kanningin er farin ígongd, sigur hon.\n\nHon staðfestir, at ein orsøk til at Landsstýrismálanevndin vildi hava kanningarstjóra, var fyri at kanna um nakað ólógligt var farið fram.\n\n- Men ætlanin við kanningini var avgjørt eisini at fáa eina óhefta kanning við tí endamáli at endurvinna álitið á politisku skipanina, sum vit føldu, var fokið.\n\nMen nú ivi er sáddur um trúvirðið hjá kanningarstjóranum longu áðrenn kanningin er farin ígongd, er vandi fyri, at ivi eisini fer at verða sáddur um úrslitið av kanningini, sama, hvat tað verður.\n\n- Og so eru vit aftur í somu støðu, sum vit ætlaðu, at kanningin skuldi sleppa okkum burtur úr, nevniliga, at misálit er á politisku skipanina.\n\nSkuldi mannagongdin havt verið øðrvísi, tá ið kanningarstjórin varð settur?\n\n- Løgtingsformaðurin hevur heimild at seta kanningarstjóran. Hinvegin er tað ógvuliga viðbrekið, tá ið eitt fólk setir kanningarstjóran einsamøll. Men tað setir so enn størri krøv til løgtingsformannin, at hann ger sær ómak at finna rætta kanningarstjóran.\n\nSkuldi kanningarstjórin verið funnin uttanlands?\n\n- Tað hava vit sæð í onkrum føri, sigur Sirið Stenberg."}, {"url": "https://popularbio.com/siri-stenberg/", "page_content": "Updated On April 30, 2023\n\nSirið Stenberg estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Sirið Stenberg in 2019-2020? Scroll below and check more detailed information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nSirið Stenberg was born in Vágur, Faroe Islands on May 26, 1968.\n\nOn Popular Bio, She is one of the successful Politicians. She has ranked on the list of famous people who were born on May 26, 1968. She is one of the Richest Politicians who was born in the Faroe Islands. She also has a position among the list of Most popular Politicians. Sirið Stenberg is 1 of the famous people in our database with the age of 51 years old.\n\nShort Profile First Name Sirið Last Name Stenberg Profession Politician Age 51 years old Birth Sign Gemini Birth Date May 26, 1968 Birth Place Vágur, Faroe Islands Country Faroe Islands\n\nSirið Stenberg Net Worth\n\nSirið Stenberg estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Sirið Stenberg in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Politician Sirið Stenberg’s net worth is $1-5 Million at the age of 51 years old. She earned the money being a Professional Politician. She is from the Faroe Islands.\n\nSirið Stenberg’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 $1-3million Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Politician (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nSirið Stenberg currently ages 51 years old. Sirið Stenberg’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Sirið Stenberg Dating?\n\nSirið Stenberg keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Sirið Stenberg’s past relationships, ex-girlfriends, and previous hookups. Sirið Stenberg prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Sirið Stenberg"}], "Sirið Stenberg has become an integral part of the band's sound.": [{"url": "https://www.frontiersin.org/articles/10.3389/fphy.2022.911711/full", "page_content": "We report the numerical and experimental realization of a type of ultrathin planar wall with low-frequency dual-band sound absorption. The proposed planar wall is constructed by a periodic subwavelength unit cell (with a thickness of λ/19) which consists of two different multiple-cavity resonators embedded into a plate structure with a groove. The sound absorption of the wall exists in two working bands (IandII) below 600 Hz which are created by two different mechanisms. In addition to the band I created by a conventional resonance coupling of the two multiple-cavity resonators, it is worth noting that the band II is realized by a mutual resonance coupling between the resonators and groove structure. The fractional bandwidths of the bands I and II can reach about 34.1 and 10.4%, respectively. Furthermore, the application of the proposed ultrathin planar wall in the design of a barrier-free anechoic room with omnidirectional low-frequency dual-band sound absorption is further discussed in detail. The proposed planar wall has the advantages of ultrathin planar structure and omnidirectional low-frequency dual-band sound absorption, which provides diverse routes to design advanced sound-absorption structures in noise control and architectural acoustics.\n\nIntroduction\n\nLow-frequency sound absorption has always been a research hotspot due to its wider applications in several important fields, including noise control, environmental protection, and architectural acoustics. In the recent years, the rapid development of metamaterial [1–10] and metasurface [11–18] structures have provided alternative ways to design advanced acoustic absorbers which effectively overcome the limitation of a relatively large size for conventional low-frequency sound absorbers [19–21].\n\nBy designing resonance-type unit cells with a subwavelength size, external sound energy can be absorbed in the unit cell based on different types of mechanisms, and part of energy is dissipated during its propagation inside the unit cell. So far, the previously demonstrated unit cells of sound absorbers mainly include Helmholtz resonators [22–26], Fabry-Perot resonators [27, 28], membrane resonators [29–31], split-ring resonators [32–34], coherent perfect absorbers [35, 36], and metasurface-based absorbers [37–42], and these types of sound absorbers can realize high-performance sound absorption with a subwavelength structure. However, most of these sound absorbers generally work in a single working band, and there still exist some difficulties in designing multiband sound absorbers.\n\nTo overcome this, by constructing a type of double-channel Mie resonator backed with a rigid wall [43], a multi-band sound absorber based on multi-order monopolar and dipolar resonances have been proposed. Additionally, a perforated composite Helmholtz-resonator [44] is designed by inserting several plates with a small hole into the interior of a Helmholtz resonator, and a multi-order sound absorption has been realized. Beyond that, other types of absorber structures, such as coiling-up space metasurfaces [45] by two nesting subchannels with a circular hole in series, checkerboard absorbers [46] composed of alternate distributions of inhomogeneous Helmholtz resonators with extended necks, and metaporous composite structures [47] by porous materials with Helmholtz and Fabry–Pérot resonances, can also be applied to the realization of dual- or multi-band sound absorption. In these demonstrated structures, dual- or multi-band sound absorption with high performance are realized. However, most of them are usually designed to be attached outside the wall, which greatly limits the use of space. Therefore, the design of low-frequency ultrathin planar wall with multi-band sound absorption becomes an urgent problem to be solved.\n\nIn this work, we propose an ultrathin planar wall with low-frequency dual-band sound absorption which is composed of a periodic unit cell designed by two different multiple-cavity resonators embedded into a plate structure with a groove. The designed wall can realize sound absorption in two working bands (I and II) below 600 Hz based on two different mechanisms. Besides the band I created by a conventional resonance coupling of the two multiple-cavity resonators, we here introduce a mutual resonance coupling between the resonators and groove structure to realize the band II. The fractional bandwidth of both bands can reach about 34.1 and 10.4%. The measured results agree well with the simulated ones. Finally, we simulate the sound absorption of the unit cell created by different incident angles, and discuss the application of the proposed wall in the design of a barrier-free anechoic room with omnidirectional low-frequency dual-band sound absorption in detail.\n\nDesign of Model\n\nAs schematically shown in Figure 1A, we propose a type of ultrathin planar wall composed of periodic unit cells, and the cross section of a unit cell with the width of D is shown in Figure 1B. We can see that the unit cell consists of two multiple-cavity resonators (denoted as MRs I and II) with the distance of a embedded into a plate structure with a groove. The multiple-cavity resonator is composed of a central circular cavity surrounded by 8 interconnected identical cavities which are separated by 4 channels with the width of w. Here, the thickness of cavity walls, the open width and the radial length of 8 inner cavities, the outer and inner radii of resonators, and the distances between the resonator and the bottom, left and top surfaces of the plate are t, b, d, R, r, l 1 , l 2 and l 3 , respectively. In addition to the parameters d and r of the MRs I (d 1 and r 1 ) and II (d 2 and r 2 ), the other parameters of both MRs are the same. The unit cell is made of epoxy resin based on the 3D printing technology, and its photograph is shown in Figure 1C. Here, we introduce the software of COMSOL Multiphysics to numerically design sound absorbers. Due to the sound absorption created by the thermoviscous energy loss in the unit cell, the module of Thermoviscous Acoustic-Solid Interaction is used inside the unit cell, and that of Acoustic Pressure module is adopted in the other parts of the model. Beyond that, the surfaces inside the unit cell are set as the thermoviscous acoustic boundary layers, and the thickness of the thermoviscous acoustic boundary layer is d υ = 2 μ / ρ ω [37], in which the parameters µ, ρ and ω are the coefficient of dynamic viscosity, the density of air, and the angular frequency, respectively. In the simulations, the parameters R, r 1 , r 2 , d 1 , d 2 , t, b, w, a, l 1 , l 2 , l 3 and D are selected as 5.0 cm, 5.0 mm, 7.0 mm, 38.8 mm, 36.8 mm, 1.6 mm, 3.0 mm, 1.0 mm, 4.0 mm, 1.0 mm, 2.0 mm, 3.0 mm, and 31.0 cm, respectively, and the material parameters of air and epoxy resin are shown in Table 1.\n\nFIGURE 1\n\nFIGURE 1. (A) Schematic of an ultrathin planar wall with sound absorption, which is composed of periodic unit cells. (B) Cross section of the unit cell, (C) and sample photograph.\n\nTABLE 1\n\nTABLE 1. Material parameters.\n\nPerformances and Mechanisms of Low-Frequency Dual-Band Sound Absorption\n\nHere, we conduct an experiment to measure the performance of the design ultrathin planar wall. As shown in Figure 2A, the experiment is carried out in a straight waveguide with a size of 2 × 0.33 × 0.06 m3 which is fabricated with acrylic plates to satisfy the condition of sound hard boundary. The sample of the unit cell is made of epoxy resin by a 3D printing technology, which is placed at the right side of the waveguide. Additionally, a loudspeaker with the size of 4 × 4 cm2 driven by a power amplifier is placed at the left side of the waveguide to obtain incident sound signals. Two 0.25-inch microphones (Brüel and Kjær type-4954, marked as Microphones 1 and 2) are inserted into the waveguide from two holes with the same size to experimentally detect sound signals. The measured data is recorded by the module of Brüel and Kjær 3160-A-022, and is analyzed by the software of PULSE Labshop.\n\nFIGURE 2\n\nFIGURE 2. (A) Experimental set-up. (B) Measured and simulated sound absorption spectra, and black shaded regions are two working bands of the unit cell (I: 145–203 Hz, II: 490–544 Hz). (C) Simulated pressure amplitude eigenfunctions of the unit cell at 163 Hz, 182 Hz, and 517 Hz. (D) Simulated distributions of pressure amplitude in the unit cell created by a normal incidence of sound (red solid arrows) at 170 and 518 Hz.\n\nFigure 2B shows the measured absorption spectra (red open circles) created by the sample, in which the corresponding simulated ones with the same conditions are also provided for comparison (black solid lines), and the parameters of the sample are the same as those in Figure 1. We can see that, there exist two absorption peaks around 170 and 518 Hz, and their maximum absorption coefficients can reach about 0.99 and 0.98, respectively, showing a typical characteristic of low-frequency dual-band sound absorption. Additionally, in the two black shaded regions (denoted as the bands I and II), the absorption coefficients are larger than 0.5, and thus the corresponding fractional bandwidths (the ratio of the bandwidth to the center frequency) can reach about 34.1 and 10.4%, respectively. The measured and simulated absorption spectra match well with each other. Moreover, the thickness of the unit cell is 104 mm, which is equal to λ/19 (λ is the wavelength), exhibiting a characteristic of ultrathin structure for the proposed wall.\n\nTo provide a further insight into its mechanism, we simulate pressure amplitude eigenfunctions of the unit cell around 170 and 518 Hz. As shown in Figure 2C, 3 types of eigenmodes exist at 163 Hz, 182 and 517 Hz. We can see that the distributions of pressure amplitude for the eigenmodes at 163 and 182 Hz are almost the same, and most of sound energy is concentrated into the cavities of the two MRs, showing that both eigenmodes are related to a resonance coupling of both MR structures. However, for the eigenmode at 517 Hz, the sound energy is mainly concentrated into the space between the MRs and groove structure, and little energy exists inside the cavity of both MRs. Thus, this eigenmode is determined by a mutual resonance coupling between the MRs and groove structure, which is different from the eigenmodes at 163 and 182 Hz. Figure 2D shows the pressure amplitude distributions in the unit cell created by the normal incidence of sound at the frequencies of both absorption peaks (170 and 518 Hz). We can see that the sound energy is mainly concentrated into the cavities of both MRs at 170 Hz, in which its distribution of pressure amplitude is the same as that of the eigenmodes at 163 and 182 Hz. It is therefore deduced that the absorption peak in the band I is created by the resonance coupling of both MRs. Additionally, the characteristics of the pressure amplitude distributions at 518 Hz are almost the same as those of the eigenmode at 517 Hz, indicating that the absorption peak in the band II is attributed to the mutual resonance coupling between the resonators and groove structure. Therefore, the observed dual-band sound absorption of the wall arises from two different mechanisms.\n\nMoreover, we discuss the influences of the parameters r 1 and l 3 on the sound absorption of the unit cell in detail (see Supplementary Material), and the results show that the sound absorption in the band II can be modulated by simply adjusting both parameters r 1 and l 3 , but that in the band I is only closely related to the parameter r 1 , which provides the feasibility of modulating both working bands.\n\nApplication of Ultrathin Planar Wall in Barrier-Free Anechoic Room\n\nFigures 3A,B show the simulated sound absorption spectra of the unit cell created by the incident waves with θ = 0°, 45° and 60° in the bands I and II, respectively, in which θ is defined as the angle between the incident direction and the normal line (shown in the inset in Figure 3A). We can see that, with the increase of the angle θ, the frequency of the absorption peak almost remains unchanged in the band I (Figure 3A), and that slightly moves to the high-frequency region in the band II (Figure 3B). Additionally, the absorption coefficients of these peaks are larger than 0.9, showing a high-performance sound absorption of the designed unit cell for different incident angles. Such a phenomenon provides a feasibility for constructing a barrier-free anechoic room.\n\nFIGURE 3\n\nFIGURE 3. Simulated absorption spectra of the unit cell in the bands (A) I and (B) II with the incident angle θ = 0°, 45° and 60°.\n\nFinally, we discuss the application of the designed unit cell in a barrier-free anechoic room. As shown in Figure 4A, the proposed structure of barrier-free anechoic room with the size of 3.41 × 3.41 m2 is composed of 40 unit cells, in which the parameters of each unit cell (shown in the inset in Figure 4A) are the same as those in Figure 1B. Moreover, the module of Thermoviscous Acoustic-Solid Interaction is used inside the unit cells, while the module of Acoustic Pressure is adopted in the other parts of the model. Figures 4B,C show the simulated sound absorption spectra created by the barrier-free anechoic room, in which a cylindrical sound source is placed at the center (point O) of the room. We can see that, the absorption coefficients are larger than 0.5 in the black shaded regions around the bands I (149–194 Hz) and II (490–543 Hz). The maximum values of absorption coefficients are 0.98 and 0.96 at 173 and 519 Hz, respectively, and the corresponding fractional bandwidths can reach about 26.0 and 10.2%, showing a typical characteristic of omnidirectional low-frequency dual-band sound absorption.\n\nFIGURE 4\n\nFIGURE 4. (A) Schematic of a barrier-free anechoic room with omnidirectional low-frequency dual-band sound absorption. A cylindrical sound source is located at the point O. Simulated absorption spectra created by the barrier-free anechoic room around the bands (B) I and (C) II. The absorption coefficients are larger than 0.5 in the black shaded regions.\n\nTo further present the performance of sound absorption, we also simulate the total pressure distributions and their corresponding reflected sound intensity distributions in the barrier-free anechoic room at 173 and 519 Hz, which are shown in Figures 5A–D. We can see that the total pressure distributions in the barrier-free anechoic room at both frequencies are obviously different from those in the room with hard boundaries (see Supplementary Material), but are similar to those in the free space (see Supplementary Material). Beyond that, the reflected sound intensity distributions created by the anechoic room are very weak, indicating that the sound energy are almost absorbed by the unit cell in all directions of the room, showing a typical characteristic of omnidirectional low-frequency dual-band sound absorption.\n\nFIGURE 5\n\nFIGURE 5. Simulated total pressure distributions in the barrier-free anechoic room at (A) 173 Hz and (B) 519 Hz, and its corresponding reflected intensity distributions at (C) 173 Hz and (D) 519 Hz. White points at the center of the room are the positions of cylindrical sound source.\n\nTo verify the robustness of the barrier-free anechoic room, we simulate the sound absorption spectra created by the anechoic room with a cylindrical sound source placed at the point O' (shown in Figure 6A), in which all parameters of the anechoic room remain unchanged. As shown in Figures 6B,C, the absorption coefficients are larger than 0.5 around the bands I (156–185 Hz) and II (501–534 Hz), which are shown in the black shaded regions, in which the maximum values of absorption coefficient can reach about 0.97 at 171 Hz and 0.96 at 519 Hz, and the corresponding fractional bandwidths are about 16.9 and 6.3%, respectively, showing high-robustness dual-band sound absorption of the designed room structure.\n\nFIGURE 6\n\nFIGURE 6. (A) Schematic of a barrier-free anechoic room with a cylindrical sound source placed at the point O'. Simulated absorption spectra created by the barrier-free anechoic room around the (B) bands I and (C) II. The absorption coefficients are larger than 0.5 in the black shaded regions.\n\nFigure 7 shows the simulated total pressure distributions and their corresponding reflected sound intensity distributions created by the barrier-free anechoic room at 171 and 519 Hz. We can see that the characteristics of total pressure distributions and corresponding reflected intensity distributions are almost the same as that in Figure 5. Therefore, the proposed ultrathin planar wall with omnidirectional low-frequency dual-band sound absorption shows great potential for applications in architectural acoustics and noise control.\n\nFIGURE 7\n\nFIGURE 7. Simulated total pressure distributions created by the barrier-free anechoic room at (A) 171 Hz and (B) 519 Hz, and their corresponding reflected intensity distributions at (C) 171 Hz and (D) 519 Hz. White points represent the positions of cylindrical sound source.\n\nConclusion\n\nIn conclusions, we have demonstrated an ultrathin planar wall with low-frequency dual-band sound absorption. The results show that the sound absorption of the wall exists in two frequency bands (I: 145–203 Hz and II: 490–544 Hz) based on two different mechanisms. The band I is created by the conventional resonance coupling of the two multiple-cavity resonators, but it is worth noting that the band II is realized by the mutual resonance coupling between the resonators and groove structure. The corresponding fractional bandwidth of both bands can reach about 34.1 and 10.4%, and the measured and simulated results agree well with each other. Additionally, the influences of incident angles on the sound absorption of unit cell are simulated, and the characteristics of sound absorption almost remains unchanged with different incident angles. Finally, the application of the proposed ultrathin planar wall in the design of a barrier-free anechoic room is discussed in detail. The proposed ultrathin planar wall with the characteristic of omnidirectional low-frequency dual-band sound absorption has wide prospects in noise control and architectural acoustics.\n\nData Availability Statement\n\nThe original contributions presented in the study are included in the article/Supplementary Material, further inquiries can be directed to the corresponding authors.\n\nAuthor Contributions\n\nY-WX and Y-JG contributed equally to this work.\n\nFunding\n\nThis work was supported by the National Key Research and Development Program of China (Grant No. 2020YFC1512403), the National Natural Science Foundation of China (Grant Nos. 12174159 and 11834008), and the Practice Innovation Training Program Projects of Jiangsu Province (Grant No. 202110299082Z).\n\nConflict of Interest\n\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nPublisher’s Note\n\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.\n\nSupplementary Material\n\nThe Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fphy.2022.911711/full#supplementary-material\n\nReferences\n\n4. Cummer SA, Christensen J, Alù A. Controlling Sound with Acoustic Metamaterials. Nat Rev Mater (2016) 1:16001. doi:10.1038/natrevmats.2016.1 CrossRef Full Text | Google Scholar\n\n6. Gao N, Lu K. An Underwater Metamaterial for Broadband Acoustic Absorption at Low Frequency. Appl Acoust (2020) 169:107500. doi:10.1016/j.apacoust.2020.107500 CrossRef Full Text | Google Scholar\n\n7. Tsang L, Liao T-H, Tan S. Calculations of Bands and Band Field Solutions in Topological Acoustics Using the Broadband Green's Function-kkr-Multiple Scattering Method. Prog Electromagn Res (2021) 171:137–58. doi:10.2528/PIER21081706 CrossRef Full Text | Google Scholar\n\n8. Jia D, Wang Y, Ge Y, Yuan S-Q, Sun H-X. Tunable Topological Refractions in Valley Sonic Crystals with Triple Valley Hall Phase Transitions. Prog Electromagn Res (2021) 172:13–22. doi:10.2528/PIER21102002 CrossRef Full Text | Google Scholar\n\n9. Yan Q, Chen H, Yang Y. Non-Hermitian Skin Effect and Delocalized Edge States in Photonic Crystals with Anomalous Parity-Time Symmetry. Prog Electromagn Res (2021) 172:33–40. doi:10.2528/PIER21111602 CrossRef Full Text | Google Scholar\n\n10. Gao N, Zhang Z, Deng J, Guo X, Cheng B, Hou H. Acoustic Metamaterials for Noise Reduction: A Review. Adv Mater Technol (2022) 2100698 [Epub ahead of print]. doi:10.1002/admt.202100698 CrossRef Full Text | Google Scholar\n\n11. Li Y, Liang B, Gu Z-M., Zou X-Y, Cheng J-C. Reflected Wavefront Manipulation Based on Ultrathin Planar Acoustic Metasurfaces. Sci Rep (2013) 3:2546. doi:10.1038/srep02546 PubMed Abstract | CrossRef Full Text | Google Scholar\n\n12. Mei J, Wu Y. Controllable Transmission and Total Reflection through an Impedance-Matched Acoustic Metasurface. New J Phys. (2014) 16:123007. doi:10.1088/1367-2630/16/12/123007 CrossRef Full Text | Google Scholar\n\n13. Tang K, Qiu C, Ke M, Lu J, Ye Y, Liu Z. Anomalous Refraction of Airborne Sound through Ultrathin Metasurfaces. Sci Rep (2014) 4:6517. doi:10.1038/srep06517 PubMed Abstract | CrossRef Full Text | Google Scholar\n\n14. Zhang H, Xiao Y, Wen J, Yu D, Wen X. Ultra-Thin Smart Acoustic Metasurface for Low-Frequency Sound Insulation. Appl Phys Lett (2016) 108:141902. doi:10.1063/1.4945664 CrossRef Full Text | Google Scholar\n\n15. Assouar B, Liang B, Wu Y, Li Y, Cheng J-C, Jing Y. Acoustic Metasurfaces. Nat Rev Mater (2018) 3:460–72. doi:10.1038/s41578-018-0061-4 CrossRef Full Text | Google Scholar\n\n17. Hu Z, He N, Sun Y, Jin Y, He S. Wideband High-Reflection Chiral Dielectric Metasurface. Prog Electromagn Res (2021) 172:51–60. doi:10.2528/PIER21121903 CrossRef Full Text | Google Scholar\n\n18. Li Z, Cao G, Li C, Dong S, Deng Y, Liu X, et al. Non-Hermitian Electromagnetic Metasurfaces at Exceptional Points. Prog Electromagn Res (2021) 171:1–20. doi:10.2528/PIER21051703 CrossRef Full Text | Google Scholar\n\n19. Zarek JHB. Sound Absorption in Flexible Porous Materials. J Sound Vib (1978) 61:205–34. doi:10.1016/0022-460X(78)90004-4 CrossRef Full Text | Google Scholar\n\n20. Maa D-Y. Potential of Microperforated Panel Absorber. J Acoust Soc Am (1998) 104:2861–6. doi:10.1121/1.423870 CrossRef Full Text | Google Scholar\n\n21. García-Chocano VM, Cabrera S, Sánchez-Dehesa J. Broadband Sound Absorption by Lattices of Microperforated Cylindrical Shells. Appl Phys Lett (2012) 101:184101. doi:10.1063/1.4764560 CrossRef Full Text | Google Scholar\n\n22. Jiménez N, Huang W, Romero-García V, Pagneux V, Groby J-P. Ultra-Thin Metamaterial for Perfect and Quasi-Omnidirectional Sound Absorption. Appl Phys Lett (2016) 109:121902. doi:10.1063/1.4962328 CrossRef Full Text | Google Scholar\n\n23. Li J, Wang W, Xie Y, Popa B-I, Cummer SA. A Sound Absorbing Metasurface with Coupled Resonators. Appl Phys Lett (2016) 109:091908. doi:10.1063/1.4961671 CrossRef Full Text | Google Scholar\n\n24. Romero-García V, Theocharis G, Richoux O, Merkel A, Tournat V, Pagneux V. Perfect and Broadband Acoustic Absorption by Critically Coupled Sub-wavelength Resonators. Sci Rep (2016) 6:19519. doi:10.1038/srep19519 PubMed Abstract | CrossRef Full Text | Google Scholar\n\n25. Long H, Cheng Y, Liu X. Asymmetric Absorber with Multiband and Broadband for Low-Frequency Sound. Appl Phys Lett (2017) 111:143502. doi:10.1063/1.4998516 CrossRef Full Text | Google Scholar\n\n27. Zhang C, Hu X. Three-Dimensional Single-Port Labyrinthine Acoustic Metamaterial: Perfect Absorption with Large Bandwidth and Tunability. Phys Rev Appl (2016) 6:064025. doi:10.1103/PhysRevApplied.6.064025 CrossRef Full Text | Google Scholar\n\n29. Mei J, Ma G, Yang M, Yang Z, Wen W, Sheng P. Dark Acoustic Metamaterials as Super Absorbers for Low-Frequency Sound. Nat Commun (2012) 3:756. doi:10.1038/ncomms1758 PubMed Abstract | CrossRef Full Text | Google Scholar\n\n31. Yang M, Li Y, Meng C, Fu C, Mei J, Yang Z, et al. Sound Absorption by Subwavelength Membrane Structures: A Geometric Perspective. Comptes Rendus Mécanique (2015) 343:635–44. doi:10.1016/j.crme.2015.06.008 CrossRef Full Text | Google Scholar\n\n32. Wu X, Fu C, Li X, Meng Y, Gao Y, Tian J, et al. Low-Frequency Tunable Acoustic Absorber Based on Split Tube Resonators. Appl Phys Lett (2016) 109:043501. doi:10.1063/1.4959959 CrossRef Full Text | Google Scholar\n\n33. Long H, Cheng Y, Tao J, Liu X. Perfect Absorption of Low-Frequency Sound Waves by Critically Coupled Subwavelength Resonant System. Appl Phys Lett (2017) 110:023502. doi:10.1063/1.4973925 CrossRef Full Text | Google Scholar\n\n34. Gao N, Hou H, Zhang Y, Wu JH. Sound Absorption of a New Oblique-Section Acoustic Metamaterial with Nested Resonator. Mod Phys Lett B (2018) 32:1850040. doi:10.1142/s0217984918500409 CrossRef Full Text | Google Scholar\n\n35. Wei P, Croënne C, Tak Chu S, Li J. Symmetrical and Anti-Symmetrical Coherent Perfect Absorption for Acoustic Waves. Appl Phys Lett (2014) 104:121902. doi:10.1063/1.4869462 CrossRef Full Text | Google Scholar\n\n36. Song JZ, Bai P, Hang ZH, Lai Y. Acoustic Coherent Perfect Absorbers. New J Phys (2014) 16:033026. doi:10.1088/1367-2630/16/3/033026 CrossRef Full Text | Google Scholar\n\n37. Li Y, Assouar BM. Acoustic Metasurface-Based Perfect Absorber with Deep Subwavelength Thickness. Appl Phys Lett (2016) 108:063502. doi:10.1063/1.4941338 CrossRef Full Text | Google Scholar\n\n38. Chang H, Liu L, Zhang C, Hu X. Broadband High Sound Absorption from Labyrinthine Metasurfaces. AIP Adv (2018) 8:045115. doi:10.1063/1.5024303 CrossRef Full Text | Google Scholar\n\n39. Wang X, Luo X, Zhao H, Huang Z. Acoustic Perfect Absorption and Broadband Insulation Achieved by Double-Zero Metamaterials. Appl Phys Lett (2018) 112:021901. doi:10.1063/1.5018180 CrossRef Full Text | Google Scholar\n\n40. Long H, Shao C, Liu C, Cheng Y, Liu X. Broadband Near-Perfect Absorption of Low-Frequency Sound by Subwavelength Metasurface. Appl Phys Lett (2019) 115:103503. doi:10.1063/1.5109826 CrossRef Full Text | Google Scholar\n\n41. Donda K, Zhu Y, Merkel A, Fan S-W, Cao L, Wan S, et al. Ultrathin Acoustic Absorbing Metasurface Based on Deep Learning Approach. Smart Struct (2021) 30:085003. doi:10.1088/1361-665X/ac0675 CrossRef Full Text | Google Scholar\n\n42. Liu H, Wu JH, Ma F. High-efficiency Sound Absorption by a Nested and Ventilated Metasurface Based on Multi-Slit Synergetic Resonance. J Phys D Appl Phys (2021) 54:205304. doi:10.1088/1361-6463/abe6cd CrossRef Full Text | Google Scholar\n\n43. Long H, Gao S, Cheng Y, Liu X. Multiband Quasi-Perfect Low-Frequency Sound Absorber Based on Double-Channel Mie Resonator. Appl Phys Lett (2018) 112:033507. doi:10.1063/1.5013225 CrossRef Full Text | Google Scholar\n\n44. Liu CR, Wu JH, Chen X, Ma F. A Thin Low-Frequency Broadband Metasurface with Multi-Order Sound Absorption. J Phys D Appl Phys (2019) 52:105302. doi:10.1088/1361-6463/aafaa3 CrossRef Full Text | Google Scholar\n\n45. Chen S, Fan Y, Yang F, Jin Y, Fu Q, Zheng J, et al. Engineering Coiling‐Up Space Metasurfaces for Broadband Low‐Frequency Acoustic Absorption. Phys Status Solidi RRL (2019) 13:1900426. doi:10.1002/pssr.201900426 CrossRef Full Text | Google Scholar\n\n46. Guo J, Fang Y, Jiang Z, Zhang X. Acoustic Characterizations of Helmholtz Resonators with Extended Necks and Their Checkerboard Combination for Sound Absorption. J Phys D Appl Phys (2020) 53:505504. doi:10.1088/1361-6463/abb5d8 CrossRef Full Text | Google Scholar"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/has+become+an+integral+part.html", "page_content": "With the implementation of the IT in Education Strategy, the use [...] of computers has become an integral part of learning and [...] teaching in schools. legco.gov.hk legco.gov.hk of compuearning and 的一環 。 legco.gov.hk legco.gov.hk 隨着當 局實施資訊科技教育策略，電腦應用已成 為學校學與教中 必 不可少\n\nThe Arab Peace [...] Initiative, with the vigorous support of Russia, has become an integral part of the international legal basis for progress [...] towards genuine peace in the region. daccess-ods.un.org daccess-ods.un.org Initiative, with the vigorous support of Rushe international legal basis for progress ，已成为 促进推动实现该地区真正和平的国际法律基础的有 机组成部分。 daccess-ods.un.org daccess-ods.un.org 阿拉伯和平倡议”在俄罗斯的积极支持下促进推动实现该地区真正和平的国际法律基础的有\n\nAlthough the Dominican Republic has not been able to eradicate poverty, it has implemented important [...] programmes in this area, such as “Eating Comes First” (Comer [...] es Primero), which has become an integral part of the Solidarity [...] Programme. daccess-ods.un.org daccess-ods.un.org es Primero), whe Solidarity 尽管多米尼加共和国尚未铲除贫困，但多米尼加在此领域推行了 一 些重要 方案，诸如“温饱第一”计划已成为 “互 助方案”的一个组 成部 分。 daccess-ods.un.org daccess-ods.un.org 尽管多米尼加共和国尚未铲除贫困，但多米尼加在此领域推行了要 方案，诸如“温饱第助方案”的一个组\n\nTraining on the use of ICT by National Commissions for better interface with the [...] UNESCO Secretariat has become an integral part of the training programme. unesdoc.unesco.org unesdoc.unesco.org UNESCO Secretahe training programme. 通 已经 成为 整个培训计 划 的一个组 成 部 分。 unesdoc.unesco.org unesdoc.unesco.org 培训全国委员会通过信息 传播技术与教科文秘书处保持更好的沟整个培训计\n\nOver the years, security sector [...] reform (SSR) has become an integral part of the efforts [...] of the international community to [...] holistically address various post-conflict situations around the world, especially in Africa. daccess-ods.un.org daccess-ods.un.org reform (he efforts 部门改革已经成为国 际社会全面解决世界各地、特别 是非洲各种冲突后局势的努力的组成部分。 daccess-ods.un.org daccess-ods.un.org 多年来，安全际社会全面解决世界各地、特别 是非洲各种冲突后局势的努力的组成部分。\n\nThat is a strategic choice that was [...] taken at the time of [...] independence in 1956 and which has become an integral part of my country’s national [...] development policy. daccess-ods.un.org daccess-ods.un.org independence in 1956 and wy country’s national ，已成为我 国的国家发展政策的组 成部 分。 daccess-ods.un.org daccess-ods.un.org 这是在1956年独立时作出 的战略性选择国的国家发展政策的组\n\nDisarmament, [...] demobilization and reintegration (DDR) has become an integral part of post-conflict peace consolidation, [...] featuring [...] prominently in the mandates of peacekeeping operations over the last twenty years. un.org un.org demobilization and reintegration (ost-conflict peace consolidation, 解除武装，复员和重返社会已成为冲 突后 巩固和平 的 一个 组成 部分， 在过 去二十年的维和行动任务中表现突出。 un.org un.org ，复员和重巩固和平去二十年的维和行动任务中表现突出。\n\nRegarding the request of the United Kingdom for elaboration on measures taken to raise public awareness of [...] human rights, Israel [...] indicated that human rights education has become an integral part of the school curriculum and that [...] continuing education [...] on human rights issues is an important part of the training of the State’s law enforcement authorities. daccess-ods.un.org daccess-ods.un.org indicated that human rights educahe school curriculum and that ，以色列指出，人权教 育 是 学 校课程中的必 要组成部分 ， 而 人权进修 教育是 政府执 法 当局培训的一个重 要部分。 daccess-ods.un.org daccess-ods.un.org 关于联合王国建议采取措施提高公 众的人权认识出，人权教 育 是 学 校课程中的人权进修 教育是 政府执 法 当局培训的一个重 要部分。\n\nOver the past decade, art has become an integral part of the Sunbrella brand as we’ve infused design into fabrics that are beautiful, soft to the touch and high performing. glenraven.com glenraven.com Over the past decade,he Sunbrella brand as we’ve infused design into fabrics that are beautiful, soft to the touch and high performing. 过去十年里，我们将各种设计理念注入美观、手感柔软和 高性能的织物中，因此艺术已经成为 Sunbrella 品牌不可或缺的 部分。 glenraven.com glenraven.com 过去十年里，我们将各种设计理念注入美观、手感柔软和 高性能的织物中，因此艺术已经成为 Sunbrella 品牌不可或缺的 部分。\n\nIt is also important to engage the private sector through various industry outreach programmes to keep them informed of the need for and progress in establishing controls on the export of dual-use items, in order that they understand [...] that such measures do not hamper export [...] promotion, but have become an integral part of today’s international [...] trade regime. daccess-ods.un.org daccess-ods.un.org promotion,oday’s international 同样重要的是，通过各种行业外联方案促使私营部门参与，让他们随时了解 [...] 建立两用物品出口管制的必要性和进展，以期他们认识到，这些措施不会妨碍出 口发展，而可成为当今国际贸易制度 的组成部 分。 daccess-ods.un.org daccess-ods.un.org 建立两用物品出口管制的必要性和进展，以期他们认识到，这些措施不会妨碍出 口发展，而可成为当今国际贸易制度\n\nThe station purchased a Soundcraft Vi4 digital console that has become an integral part of the station's news broadcasts in more ways than one – the console is located right behind [...] [...] the TV reporter during Citytv newscasts and is visible on TV. acehk.com acehk.com The station purchased a Soundcraft Vi4 digital consolehe station's news broadcasts in more ways than one – the console is located right behind 该台购买了So undcraft Vi4数字调音台，被放置Citytv新闻广播播音员的右后方，提供了更多的播出方式，已成为新闻节目不可 分割的一部分。 acehk.com acehk.com 该台购买undcraft Vi4数字调音台，被放置Citytv新闻广播播音员的右后方，提供了更多的播出方式，已成为新闻节目不可 分割的一部分。\n\nSR has become an integral part of peacebuilding strategies for countries on its agenda. daccess-ods.un.org daccess-ods.un.org eacebuilding strategies for countries on its agenda. 革已经成为 列入建设和平委员会议 程国家的建设和平战略不可或缺的一 部分。 daccess-ods.un.org daccess-ods.un.org 安全部门改列入建设和平委员会议 程国家的建设和平战略不可或缺的一\n\ntion had become an integral part of certain types of [...] civil proceedings. legco.gov.hk legco.gov.hk DLA added that mediaertain types of 調解已成為若干 類民事訴訟程序的 一個重要環節。 legco.gov.hk legco.gov.hk 法 援 署 署 長 補充，類民事訴訟程序環節。\n\n, it has become an integral part of our policy planning and formulation [...] processes in that all proposals put to [...] the Executive Council must also explain and justify their long-term sustainability. legco.gov.hk legco.gov.hk From April this yearur policy planning and formulation 制 度 已 成 為 政 府 規劃和 制訂政策 的 重 要部分， 各 政 策 局 和 部 門 向行政會議提出 建 議時，必 須同時 解釋和闡 [...] 明 建 議 與可持續 發 展 的 原 則 相 符 。 legco.gov.hk legco.gov.hk 由 本 年 4 月 起，這 個府 規劃和 制訂政策 的 重 要政 策 局 和 部 門 向行政會議提出 建 議時，必 須同時 解釋和闡\n\nIn a few countries, mainly in Latin [...] America, the Declaration has become an integral part of constitutional reform [...] processes. daccess-ods.un.org daccess-ods.un.org America, the Declaraonstitutional reform 在少数国家，主要在拉丁美洲，这项《宣 言 》已经成 为宪 政改革进程 的 一个 构成部分。 daccess-ods.un.org daccess-ods.un.org 在少数国家，主要在拉丁美洲，这项《宣政改革进程\n\nWith more than 80 per cent of Australians living within 50 kilometres [...] of the coast, the beach has become an integral part of our famous laid-back [...] lifestyle. australia.com australia.com of the coast, the bur famous laid-back 80％以上的澳大利亚人居住在离海岸50公里的范围内，海 滩 已成 为我 们悠闲生活方式中不可或缺 的 一部 分。 australia.com australia.com 80％以上的澳大利亚人居住在离海岸50公里的范围内，海们悠闲生活方式中不可或缺\n\nIn this digital age, web-based learning and research on [...] the Internet have become an integral part of education. legco.gov.hk legco.gov.hk the Inteducation. 料 已成 為教 育的基本元 素。 legco.gov.hk legco.gov.hk 在 這個數碼年代，網上學習和搜尋資育的基本元 素。\n\nThe promotion of justice and [...] the rule of law has become an integral part of peacebuilding [...] strategies for countries on the [...] PBC’s agenda, such as Liberia and Sierra Leone. daccess-ods.un.org daccess-ods.un.org the rule ofeacebuilding 促进司法与法治已成为利比 里亚和 塞拉利昂等建设和平委员会议程所列国家建设和平 战略的组成部分。 daccess-ods.un.org daccess-ods.un.org 促进司法与里亚和 塞拉利昂等建设和平委员会议程所列国家建设和平 战略的组成部分。\n\nHe then referred to the holding on 5 [...] October next of the Partners Forum, which had become an integral part of the General Conference and would be attended [...] by the “extended” UNESCO family. unesdoc.unesco.org unesdoc.unesco.org October next of the Partners Forum, whe General Conference and would be attended 接着他还提到将于 10 月 5 日举行的合作伙伴论坛，今后此 类论坛将成为大会的组成部分，将把 教科文组织的大“家庭”聚 集 到一 起。 unesdoc.unesco.org unesdoc.unesco.org 接着他还提到将于 10 月 5 日举行的合作伙伴论坛，今将成为大会的组成教科文组织的大“家庭”聚起。\n\nIn the United States, many people grew up [...] with \"Sesame Street\", and this hugely successful [...] children programme has become an integral part of its public [...] broadcasting. legco.gov.hk legco.gov.hk children progrts public 美國很多小孩都 是看“芝麻街”長大的，“芝麻街”便是公共廣播的 其 中一個重 要 部 分， 做得那麼成功。 legco.gov.hk legco.gov.hk 美國很多小孩都 是看“芝麻街”長大的，“芝麻街”便是公共廣播的\n\nCTs have become an integral part of educational strategies, policies and practices, [...] providing greater flexibility in learning [...] situations, promoting increased connectivity between learners and learning resources and broadening the outreach to the unreached. unesdoc.unesco.org unesdoc.unesco.org ducational strategies, policies and practices, 息与传播技术已经成为教育 战略、政策和实践不可分割组成 部分， 使学 习环境更加灵活，学习者和学习资源的联系更加 紧密，并扩大教育范围，让没有学习机会者也能接受教育。 unesdoc.unesco.org unesdoc.unesco.org 育 战略、政策和实践习环境更加灵活，学习者和学习资源的联系更加 紧密，并扩大教育范围，让没有学习机会者也能接受教育。\n\nNo matter people are working, studying or having fun, [...] the Internet has become an integral part of their activities. [...] This is a sufficient proof [...] that the cyber world, albeit virtual, has actually become part of our life. legco.gov.hk legco.gov.hk the Inteheir activities. 王國興議員：代理主席，近年，互聯網發 展一日 千里 ，資訊流通速度迅速提 高，市民不論工作、學習、娛樂，都離不開互聯網，足證網上的世界雖為虛 [...] 擬，但已切實地成為了生活的一部分。 legco.gov.hk legco.gov.hk 王國興議員：代理主席，近年，互聯網發，資訊流通速度迅速提 高，市民不論工作、學習、娛樂，都離不開互聯網，足證網上的世界雖為虛\n\nSince web-based learning and research on the Internet have become an integral part of learning, we plan to give a subsidy for Internet access charges in the 2010/11 school [...] year to each low-income family with [...] children studying in primary or secondary schools. legco.gov.hk legco.gov.hk Since web-based learning and research on the Inteearning, we plan to give a subsidy for Internet access charges in the 2010/11 school 另外，鑑於網上學習和搜尋資 料已成為 學習 的一 部 份， 我 們計劃在二○一○/一一學年，一方面為低收入家庭的中小學生提 供上網津貼，另一方面 則透過一間非牟利機構，提供既切合學習 需要又價錢相宜的互聯網服務，給經濟上有困難的家庭。 legco.gov.hk legco.gov.hk 另外，鑑於網上學習和搜尋的一我 們計劃在二○一○/一一學年，一方面為低收入家庭的中小學生提 供上網津貼，另則透過一間非牟利機構，提供既切合學習 需要又價錢相宜的互聯網服務，給經濟上有困難的家庭。\n\ntion has practically become an integral part of basic education for all children. legco.gov.hk legco.gov.hk Many experts have pointed out that enlightening pre-primary education is of vital importance to the growth of children and, given Hong Kong's actual circumstances, kindergarten educaticasic education for all children. 部 份， 以保 障教 育質素。 legco.gov.hk legco.gov.hk 許多專家曾經指出，在學前時期進行的啟發性教育，對兒童的成長極為重要，加㆖ 在香港的現實環境裏，幼稚園教育根本已是所有兒童必經的基礎教育的㆒部份，因此， 政府資助範圍，應將幼兒教育納入，使它成為整個教育的㆒育質素。\n\n(a) the Bill sought to provide a regulatory framework for the conduct of mediation in Hong Kong and it was hoped that the Bill could be enacted by the end of [...] the current legislative session [...] as mediation had already become an integral part of the civil [...] proceedings following the implementation [...] of Practice Direction 31 on mediation (\"PD 31\") under which legal representatives had a duty to advise their clients to explore the use of mediation in resolving their disputes legco.gov.hk legco.gov.hk as mediahe civil (a) 條例草案旨在為香港進行調解 事宜訂立規管框架，而因為在 [...] 《實務指示31 ⎯⎯ 調解》(下稱 \" 實務指示\")實施後，調解已成 為民事訴訟程序中不可或缺的 一部分，故希望條例草案可於 本立法會期結束前制定。 legco.gov.hk legco.gov.hk 《實務指示31 ⎯⎯ 調解》(下稱 \" 實務指示\")實施後，調訴訟程序中部分，故希望條例草案可於 本立法會期結束前制定。\n\nAlthough in some [...] printing company has been the realization of PDF workflow system and become an integral part of business activities, [...] but the majority [...] of print providers, the technology is still experimental. oapdf.com oapdf.com printing comthe realization of PDF workflow systemusiness activities, 虽然在某些印刷公司现已实现P DF工作流程系统并使之成为商务活动的组 成 部分, 但大 多数印刷品提供者仍在实验这项技术。 oapdf.com oapdf.com 虽然在某些印刷公司DF工作流程系统并使之成为商务活动的组多数印刷品提供者仍在实验这项技术。\n\nCapacity-building in awareness-raising and in [...] community preparedness has been an integral part of the activities. unesdoc.unesco.org unesdoc.unesco.org community preparedhe activities. 一直是各项活动不可分割的组成部分。 unesdoc.unesco.org unesdoc.unesco.org 培养宣传方面的能力以及提高社区灾害防范能力各项活动不可组成\n\nThe increased number of States capable of launching satellites, the work of international crews in outer space, and common interest in promoting and expanding its [...] exploration and [...] use for peaceful purposes have become a reality and form an integral part of international cooperation [...] and of everyday life. daccess-ods.un.org daccess-ods.un.org use for peaceful purpality andnternational cooperation 些皆已成为现实 ，并且构成国际合作和日常生活的 一个组成部分。 daccess-ods.un.org daccess-ods.un.org 有能力发射卫星的国家数目的增多、国际宇航小 组在外层空间开展的工作、各方对促进和扩大为和平 目的探索和利用外层空间所表现出的共同兴趣，所有 这，并且构成国际合作和日常生活"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/has+become+an+integral.html", "page_content": "With the implementation of the IT in Education Strategy, the use [...] of computers has become an integral part of learning [...] and teaching in schools. legco.gov.hk legco.gov.hk of compuof learning 的一環 。 legco.gov.hk legco.gov.hk 隨着當 局實施資訊科技教育策略，電腦應用已成 為學校學與教中 必 不可少\n\nThe Arab [...] Peace Initiative, with the vigorous support of Russia, has become an integral part of the international legal basis for progress towards [...] genuine peace in the region. daccess-ods.un.org daccess-ods.un.org Peace Initiative, with the vigorous support of Rusof the international legal basis for progress towards ，已成为 促进推动实现该地区真正和平的国际法律基础的有 机组成部分。 daccess-ods.un.org daccess-ods.un.org 阿拉伯和平倡议”在俄罗斯的积极支持下促进推动实现该地区真正和平的国际法律基础的有 机分。\n\nAlthough the Dominican Republic has not been able to eradicate poverty, it has implemented important [...] programmes in this [...] area, such as “Eating Comes First” (Comer es Primero), which has become an integral part of the Solidarity Programme. daccess-ods.un.org daccess-ods.un.org area, such as “Eating Comes First” (Comer es Primero), wof the Solidarity Programme. 尽管多米尼加共和国尚未铲除贫困，但多米尼加在此领域推行了 一 些重要 方案，诸如“温饱第一”计划已成为 “互 助方案”的一个组 成部分。 daccess-ods.un.org daccess-ods.un.org 尽管多米尼加共和国尚未铲除贫困，但多米尼加在此领域推行了要 方案，诸如“温饱第助方案”的一个组\n\nTraining on the use of ICT by National Commissions for better interface with [...] the UNESCO Secretariat has become an integral part of the training [...] programme. unesdoc.unesco.org unesdoc.unesco.org the UNESCO Secretaof the training 通 已经 成为 整个培训计 划 的一个组 成 部分。 unesdoc.unesco.org unesdoc.unesco.org 培训全国委员会通过信息 传播技术与教科文秘书处保持更好的沟整个培训计\n\nOver the years, security sector [...] reform (SSR) has become an integral part of the efforts [...] of the international community to [...] holistically address various post-conflict situations around the world, especially in Africa. daccess-ods.un.org daccess-ods.un.org reform (of the efforts 部门改革已经成为国 际社会全面解决世界各地、特别 是非洲各种冲突后局势的努力的组成部分。 daccess-ods.un.org daccess-ods.un.org 多年来，安全际社会全面解决世界各地、特别 是非洲各种冲突后局势的努力的组成部分。\n\nThat is a strategic choice that was [...] taken at the time of [...] independence in 1956 and which has become an integral part of my country’s [...] national development policy. daccess-ods.un.org daccess-ods.un.org independence in 1956 and wof my country’s ，已成为我 国的国家发展政策的组 成部 分。 daccess-ods.un.org daccess-ods.un.org 这是在1956年独立时作出 的战略性选择国的国家发展政策的组\n\nDisarmament, [...] demobilization and reintegration (DDR) has become an integral part of post-conflict peace consolidation, [...] featuring [...] prominently in the mandates of peacekeeping operations over the last twenty years. un.org un.org demobilization and reintegration (of post-conflict peace consolidation, 解除武装，复员和重返社会已成为冲 突后 巩固和平 的 一个 组成 部分 ，在 过去二十年的维和行动任务中表现突出。 un.org un.org ，复员和重巩固和平过去二十年的维和行动任务中表现突出。\n\nRegarding the request of the United Kingdom for elaboration on [...] [...] measures taken to raise public awareness of human rights, Israel indicated that human rights education has become an integral part of the school curriculum and that continuing education on human rights issues is an important part [...] [...] of the training of the State’s law enforcement authorities. daccess-ods.un.org daccess-ods.un.org measures taken to raise public awareness of human rights, Israel indicated that human rights educaof the school curriculum and that continuing education on human rights issues is an important part ，以色列指出，人权教 育 是 学 校课程中的必 要组成部分 ， 而 人权进修 教育是 政府执 法 当局培训的一个重 要部分。 daccess-ods.un.org daccess-ods.un.org 关于联合王国建议采取措施提高公 众的人权认识出，人权教 育 是 学 校课程中的而 人权进修 教育是 政府执 法 当局培训的一个重 要部分。\n\nOver the past decade, art has become an integral part of the Sunbrella brand as we’ve infused design into fabrics that are beautiful, soft to the touch and high performing. glenraven.com glenraven.com Over the past decade,of the Sunbrella brand as we’ve infused design into fabrics that are beautiful, soft to the touch and high performing. 过去十年里，我们将各种设计理念注入美观、手感柔软和 高性能的织物中，因此艺术已经成为 Sunbrella 品牌不可或缺的 部分。 glenraven.com glenraven.com 过去十年里，我们将各种设计理念注入美观、手感柔软和 高性能的织物中，因此艺术已经成为 Sunbrella 品牌不可或缺的 部分。\n\nThe station purchased a Soundcraft Vi4 digital console that has become an integral part of the station's news broadcasts in more ways than one – the console is located right behind [...] [...] the TV reporter during Citytv newscasts and is visible on TV. acehk.com acehk.com The station purchased a Soundcraft Vi4 digital consoleof the station's news broadcasts in more ways than one – the console is located right behind 该台购买了So undcraft Vi4数字调音台，被放置Citytv新闻广播播音员的右后方，提供了更多的播出方式，已成为新闻节目不可 分割的一部分。 acehk.com acehk.com 该台购买undcraft Vi4数字调音台，被放置Citytv新闻广播播音员的右后方，提供了更多的播出方式，已成为新闻节目不可 分割的一部分。\n\nSR has become an integral part of peacebuilding strategies for countries on its agenda. daccess-ods.un.org daccess-ods.un.org of peacebuilding strategies for countries on its agenda. 革已经成为 列入建设和平委员会议 程国家的建设和平战略不可或缺的一 部 分。 daccess-ods.un.org daccess-ods.un.org 安全部门改列入建设和平委员会议 程国家的建设和平战略不可或缺的一\n\nIt is also important to engage the private sector through various industry outreach programmes to keep them informed of the need for and progress in establishing controls on the export of dual-use items, in order that they understand [...] that such measures do not hamper export [...] promotion, but have become an integral part of today’s [...] international trade regime. daccess-ods.un.org daccess-ods.un.org promotion,of today’s 同样重要的是，通过各种行业外联方案促使私营部门参与，让他们随时了解 [...] 建立两用物品出口管制的必要性和进展，以期他们认识到，这些措施不会妨碍出 口发展，而可成为当今国际贸易制度 的组成部分。 daccess-ods.un.org daccess-ods.un.org 建立两用物品出口管制的必要性和进展，以期他们认识到，这些措施不会妨碍出 口发展，而可成为当今国际贸易制度\n\nIn a few countries, mainly in Latin [...] America, the Declaration has become an integral part of constitutional [...] reform processes. daccess-ods.un.org daccess-ods.un.org America, the Declaraof constitutional 在少数国家，主要在拉丁美洲，这项《宣 言 》已经成 为宪 政改革进程 的 一个 构成部分。 daccess-ods.un.org daccess-ods.un.org 在少数国家，主要在拉丁美洲，这项《宣政改革进程\n\n, it has become an integral part of our policy planning and formulation [...] processes in that all proposals [...] put to the Executive Council must also explain and justify their long-term sustainability. legco.gov.hk legco.gov.hk From April this yearof our policy planning and formulation 制 度 已 成 為 政 府 規劃和 制訂政策 的 重 要部分， 各 政 策 局 和 部 門 向行政會議提出 建 議時，必 須同時 [...] 解釋和闡 明 建 議 與可持續 發 展 的 原 則 相 符 。 legco.gov.hk legco.gov.hk 由 本 年 4 月 起，這 個府 規劃和 制訂政策 的 重 要部分， 各 政 策 局 和 部 門 向行政會議提出 建 議時，必 須同時\n\nWith more than 80 per cent of Australians living within 50 [...] kilometres of the coast, the beach has become an integral part of our famous laid-back [...] lifestyle. australia.com australia.com kilometres of the coast, the bof our famous laid-back 80％以上的澳大利亚人居住在离海岸50公里的范围内，海 滩 已成 为我 们悠闲生活方式中不可或缺 的 一部分。 australia.com australia.com 80％以上的澳大利亚人居住在离海岸50公里的范围内，海们悠闲生活方式中不可或缺\n\ntion had become an integral part of certain types [...] of civil proceedings. legco.gov.hk legco.gov.hk DLA added that mediaof certain types 調解已成為若干 類民事訴訟程序的 一個重要環節。 legco.gov.hk legco.gov.hk 法 援 署 署 長 補充，類民事訴訟程序環節。\n\nThe promotion of justice and [...] the rule of law has become an integral part of peacebuilding [...] strategies for countries on the [...] PBC’s agenda, such as Liberia and Sierra Leone. daccess-ods.un.org daccess-ods.un.org the rule ofof peacebuilding 促进司法与法治已成为利比 里亚和 塞拉利昂等建设和平委员会议程所列国家建设和平 战略的组成部分。 daccess-ods.un.org daccess-ods.un.org 促进司法与里亚和 塞拉利昂等建设和平委员会议程所列国家建设和平 战略的组成部分。\n\nSupply chain management has become an integral management tool over the [...] last decade. fedex.com fedex.com Supply chain managegement tool over the 供应链管理」在过去十年来已成为 必需的管理工具。 fedex.com fedex.com 供应链管理」在过去十年来必需的管理工具。\n\nIn this digital age, web-based learning and research on [...] the Internet have become an integral part of education. legco.gov.hk legco.gov.hk the Inteof education. 料 已成 為教 育的基本元 素。 legco.gov.hk legco.gov.hk 在 這個數碼年代，網上學習和搜尋資育的基本元 素。\n\nAs one of the most popular paid destinations in Hong Kong, HKDL has become an integral component in supporting Hong Kong’s position as one of the world’s top cities [...] [...] for leisure tourists and business visitors. legco.gov.hk legco.gov.hk As one of the most popular paid destinations in Hong Kong,onent in supporting Hong Kong’s position as one of the world’s top cities 作為香港最受歡迎的消費 旅遊勝地之一，香港迪士尼致力鞏固香港作為全球首屈一指的消閒及商務旅遊國 際城市的地位。 legco.gov.hk legco.gov.hk 作為香港最受歡迎的消費 旅遊勝地之一，香港迪士尼致力鞏固香港作為全球首屈一指的消閒及商務旅遊國 際城市的地位。\n\nIn the United States, many people grew up [...] with \"Sesame Street\", and this hugely successful [...] children programme has become an integral part of its public [...] broadcasting. legco.gov.hk legco.gov.hk children progrof its public 美國很多小孩都 是看“芝麻街”長大的，“芝麻街”便是公共廣播的 其 中一個重 要 部分， 做得那麼成功。 legco.gov.hk legco.gov.hk 美國很多小孩都 是看“芝麻街”長大的，“芝麻街”便是公共廣播的\n\nPolio eradication was one of the first priorities identified by the Children’s Health [...] programme of [...] the United Nations Foundation and UNFIP, and has become an integral partner in the WHO-led fund-raising team for [...] the Global Polio Eradication Initiative. daccess-ods.un.org daccess-ods.un.org the United Nations Foundation and UNFIP,ner in the WHO-led fund-raising team for 消除脊灰炎行动是联合国基金会和伙伴基金儿童保健方案确定的首批优先 事项之一，已成为世卫 组织领导的全球消除脊灰炎倡议筹款团队不 可或缺的伙 伴。 daccess-ods.un.org daccess-ods.un.org 消除脊灰炎行动是联合国基金会和伙伴基金儿童保健方案确定的首批优先 事组织领导的全球消除脊灰炎倡议筹款团队不伴。\n\nHe then referred to the holding on 5 October next of the Partners Forum, which had become an integral part of the General Conference and would be attended by the “extended” UNESCO family. unesdoc.unesco.org unesdoc.unesco.org He then referred to the holding on 5 October next of the Partners Forum, wof the General Conference and would be attended by the “extended” UNESCO family. 接着他还提到将于 10 月 5 日举行的合作伙伴论坛，今后此 类论坛 将成为大会的组成部分，将把教科文组织的大“家庭”聚 集 到一 起。 unesdoc.unesco.org unesdoc.unesco.org 接着他还提到将于 10 月 5 日举行的合作伙伴论坛，今将成为大会的组成部分，将把教科文组织的大“家庭”聚起。\n\nNo matter people are working, studying or having fun, [...] the Internet has become an integral part of their [...] activities. This is a sufficient proof [...] that the cyber world, albeit virtual, has actually become part of our life. legco.gov.hk legco.gov.hk the Inteof their 王國興議員：代理主席，近年，互聯網發 展一日 千里 ，資訊流通速度迅速提 高，市民不論工作、學習、娛樂，都離不開互聯網，足證網上的世界雖為虛 [...] 擬，但已切實地成為了生活的一部分。 legco.gov.hk legco.gov.hk 王國興議員：代理主席，近年，互聯網發，資訊流通速度迅速提 高，市民不論工作、學習、娛樂，都離不開互聯網，足證網上的世界雖為虛\n\nCTs have become an integral part of educational strategies, policies and [...] practices, providing greater flexibility in learning [...] situations, promoting increased connectivity between learners and learning resources and broadening the outreach to the unreached. unesdoc.unesco.org unesdoc.unesco.org of educational strategies, policies and 息与传播技术已经成为教育 战略、政策和实践不可分割组成部 分， 使学习环境更加灵活，学习者和学习资源的联系更加 紧密，并扩大教育范围，让没有学习机会者也能接受教育。 unesdoc.unesco.org unesdoc.unesco.org 育 战略、政策和实践使学习环境更加灵活，学习者和学习资源的联系更加 紧密，并扩大教育范围，让没有学习机会者也能接受教育。\n\nSince web-based learning and research on the Internet have become an integral part of learning, we plan to give a subsidy for Internet access charges in the 2010/11 school [...] year to each low-income family with [...] children studying in primary or secondary schools. legco.gov.hk legco.gov.hk Since web-based learning and research on the Inteof learning, we plan to give a subsidy for Internet access charges in the 2010/11 school 另外，鑑於網上學習和搜尋資 料已成為 學習 的一部份，我 們計劃在二○一○/一一學年，一方面為低收入家庭的中小學生提 供上網津貼，另一方面 則透過一間非牟利機構，提供既切合學習 需要又價錢相宜的互聯網服務，給經濟上有困難的家庭。 legco.gov.hk legco.gov.hk 另外，鑑於網上學習和搜尋的一部份，我 們計劃在二○一○/一一學年，一方面為低收入家庭的中小學生提 供上網津貼，另則透過一間非牟利機構，提供既切合學習 需要又價錢相宜的互聯網服務，給經濟上有困難的家庭。\n\n(a) the Bill sought to provide a regulatory framework for the conduct of mediation in Hong Kong and it was hoped that the Bill could be enacted by the end of [...] the current legislative [...] session as mediation had already become an integral part of the civil [...] proceedings following the [...] implementation of Practice Direction 31 on mediation (\"PD 31\") under which legal representatives had a duty to advise their clients to explore the use of mediation in resolving their disputes legco.gov.hk legco.gov.hk session as mediaof the civil (a) 條例草案旨在為香港進行調解 事宜訂立規管框架，而因為在 《實務指示31 [...] ⎯⎯ 調解》(下稱 \" 實務指示\")實施後，調解已成 為民事訴訟程序中不可或缺的 一部分，故希望條例草案可於 本立法會期結束前制定。 legco.gov.hk legco.gov.hk ⎯⎯ 調解》(下稱 \" 實務指示\")實施後，調訴訟程序中部分，故希望條例草案可於 本立法會期結束前制定。\n\nAlthough in some [...] printing company has been the realization of PDF workflow system and become an integral part of business [...] activities, but [...] the majority of print providers, the technology is still experimental. oapdf.com oapdf.com printing comthe realization of PDF workflow systemof business 虽然在某些印刷公司现已实现P DF工作流程系统并使之成为商务活动的组 成 部分 ,但 大多数印刷品提供者仍在实验这项技术。 oapdf.com oapdf.com 虽然在某些印刷公司DF工作流程系统并使之成为商务活动的组大多数印刷品提供者仍在实验这项技术。"}, {"url": "https://windbandhistory.neocities.org/rhodeswindband_11_instrumentation", "page_content": "The symphonic band, as it exists today, is a monolithic monster, the unfortunate result of the attempt to equate the symphonic band with the symphony orchestra.\n\n\n\nRobert Milano (1963)1\n\nAs with any type of musical ensemble, the wind band has undergone periods of growth, development, and evolution. Throughout music history, there have been a variety of factors that have affected the size of ensembles, instrumentation and timbre, and literature, both original and transcribed.\n\n\n\n18th-century & modern clarinets 2\n\nThe formative years of orchestral music were naturally influenced by the formative years of the instruments that make up the modern orchestra. And, of course they all did not develop at the same time. Interesting studies of this phenomenon and how it has affected composition through the years have been explored through the scholarship of musicians such as Adam Carse and Gardner Reed. The whole concept of melding composition with instrumentation has been studied and compiled by a variety of scholars through the years. Hector Berlioz and Nikolai Rimsky-Korsakov wrote books that are classic studies in orchestration.\n\nFrom its inception in the Baroque opera pit to the contemporary concert stage, the string section has benefited from an earlier maturation than the woodwinds and brass. While the number of wind instruments has fluctuated from one piece to the next, the strings, with their consistent timbre and sheer enormity of numbers, provided a consistency that made them the foundation of the orchestra. By contrast, the identity of the wind band has been more divergent, being influenced by historical period, culture, and composer. This has made a generic description difficult at best. In early 17th century Germany the band might be described as an ensemble of cornettos and sackbuts which signaled the changing of the hour from the tower in the center of town. Or in 18th century England one might refer to Handel's Music for the Royal Fireworks, scored for nine trumpets, nine horns, twenty-four oboes, twelve bassoons, side drums, and three kettle drums. Or consider the United States Marine Band of 1792: this group consisted of two oboes, two clarinets, bassoon, and two horns , an instrumentation based on those military bands found in England and the European continent, and similar to the decidedly non-military Harmoniemusik of Vienna.\n\nWhile the timbre of the 19th century band became more diverse, it also became more consistent, as the instruments were refined to more or less their present state. Due to the efforts of inventors and refiners such as Wilhelm Wieprecht (tuba, baritone), Johanne Stoelzel (valve), Theobald Boehm (flute), Adolph Sax (valve, saxhorn, saxophone), and Hyacinth Klose (clarinet key system), bands could enjoy all the instruments utilized today in a more or less contemporary state of development.\n\nIn America, from the middle of the nineteenth century through the Civil War, bands were predominantly brass bands, generally consisting of cornets, saxhorns, and drums. Afterward, due to the influence of legendary bandmasters such as Patrick Gilmore, the popularity of the military band rose. In 1878, the instrumentation of the 22nd Regiment Band of New York City, directed by Gilmore, included:\n\n2 piccolos\n\n2 flutes\n\n4 oboes\n\n1 A-flat clarinet\n\n3 E-flat clarinets\n\n16 B-flat clarinets\n\nalto & bass clarinets\n\n6 bassoons\n\n4 contrabassoons\n\nsoprano saxophone\n\nalto saxophone\n\ntenor saxophone\n\nbaritone saxophone\n\nbass saxophone E-flat cornet\n\n4 cornets\n\n2 trumpets\n\n2 fluegelhorns\n\n4 horns\n\n3 trombones\n\n2 alto horns\n\n2 tenor horns\n\n2 euphoniums\n\n5 double-B-flat tubas\n\nBy 1892, Sousa's first professional band (formed after his retirement from the Marine Band) consisted of:\n\n2 flutes\n\n2 oboes\n\n2 E-flat clarinets\n\n14 B-flat clarinets\n\n1 alto clarinet\n\n1 bass clarinet\n\n2 bassoons\n\n3 saxophones 4 cornets\n\n2 trumpets\n\n4 horns\n\n3 trombones\n\n2 euphoniums\n\n4 basses\n\n3 percussion\n\nThis instrumentation has a startling resemblance to contemporary practice, especially when contrasted to the instrumentation of bands performing many years later such as the 1938 University of Illinois Concert Band:\n\n10 flutes and piccolos\n\n4 oboes\n\n2 English Horns\n\n1 baritone oboe\n\n1 heckelphone*\n\n1 sarrusophone**\n\n5 bassoons\n\n1 contra-bassoon\n\n24 B-flat clarinets\n\n5 alto clarinets\n\n5 bass clarinets\n\n3 contrabass clarinets\n\n1 basset horn\n\n7 saxophones 7 cornets\n\n2 fluegelhorns\n\n1 alto fluegelhorn\n\n4 trumpets\n\n10 horns\n\n5 trombones\n\n2 bass trombones\n\n3 euphoniums\n\n2 baritones\n\n1 E-flat tuba\n\n5 double-B-flat tuba\n\n1 double-E-flat tuba\n\n2 string basses\n\n1 harp 2 marimbas\n\n5 percussion *Heckelphone: a baritone oboe pitched an octave lower than the oboe.\n\n**Sarrusophone: family of double reed instruments invented by Sarrus\n\nin 1856, and made in eight sizes from sopranino to subcontrabass.\n\nThis instrument was probably a contrabass in C.\n\nWhile acknowledging that the Illinois band is approximately two and one half times the size of the Sousa Band, the timbre possibilities of the Illinois band under A. A. Harding were also more numerous and exotic. Notice the addition of a variety of double reeds, the inclusion of the basset horn and contrabass clarinets, along with the use of fluegel-horns and 3 types of tubas plus string bass. By 1956 Mark Hindsley had dropped the baritone oboe, heckelphone, basset horn, bass saxophone, fluegel-horns, and alto fluegel-horn from the instrumentation.2\n\n\n\nContrabass sarrusophone 3\n\nSince the music of the orchestra has enjoyed international acceptance, the standards of instrumentation are more or less consistent throughout the world. Band repertoire, in contrast, has not enjoyed the same stature. Although standards for instrumentation have been suggested numerous times by various authorities, no common standard has ever been totally achieved. One reason is that band music differs from one country to the next. Since much of the music does not enjoy an international reputation, instrumentation has reflected the styles and customs of individual countries, with less regard for an international market. Music from one country often has to be arranged to fit the accepted instrumentation of another country before it can be performed. This is true both in types of instruments used and in the balance between various sections within the band. The following chart suggests the wide variety of instruments available to the contemporary concert band:\n\nFlute Double\n\nReeds Clarinet Saxophone Cylindrical\n\nBrass Conical\n\nBrass Saxhorns Soprano flute\n\npiccolo oboe E-flat sop.\n\nB-flat sop. sop. tpt. cor. flglhn. Alto alto oboe B-flat sop.\n\nE-flat alto alto tpt. Fr. hn. alto hn. Tenor - Eng. hn. E-flat alto\n\nB-flat bass tenor tbn. Fr. hn. tenor hn.\n\nbaritone Bass - bsn. B-flat bass baritone tbn. - euph. Contrabass - ctrabsn. E-flat contra\n\nB-flat contra bass bass tbn. - F,E-flat,C,double-B-flat tuba\n\nTypically, not every country has used all the wind instruments potentially available. For instance, writing in the Music Journal Annual in 1962, William Revelli explained that French and Italian bands use the complete family of saxhorns, providing a full spectrum of conical brass sound not found in British and American bands, which usually employ only the baritone and bass horns. In contrast to American bands, British bands emphasize cornets over trumpets. The bassoon is fundamental in English and German bands while American bands frequently double or supplant the bassoon with the saxophone. E-flat soprano clarinet and soprano saxophone are staples of the French and Italian bands not always accepted in American bands.3\n\n\n\nWilliam D. Revelli 4\n\nBalance between woodwinds and brass also differs from one country to the next. This is a direct reflection of past history, arrangers, publishers, composers, and individual directors. William Revelli described the balance as follows:\n\nGermany advocates one-third woodwinds; France and Italy recommend one-half woodwinds, including saxophones; English bands are approximately one-half woodwinds; America recommends two-thirds woodwinds for concert bands, with the reverse for military or gridiron and parade bands.\n\nRevelli continues:\n\nThe French and Italian bands maintain two separate and complete brass sections; hence, the woodwind sections must be augmented in order to balance the instrumentation properly. If sufficient woodwinds are not available, the brasses predominate, as they frequently do in all such instrumented groups.4\n\nThe result is that at times composers have been frustrated by the lack of standards, concerned that there would be a wide disparity in performances of their music. Today, with the growing international market for wind band literature, the disparity is not as great, though some European publishers still provide extra parts to fit the demands of divergent instrumentations.\n\nOne weakness in instrumentation has been the inherent doubling which thickens the quality of the band sound. The prevalent attitude in school bands in the past has seemed to be that everyone should play as much of the time as possible so at to not become bored. Thus many opaque sounds are destroyed by the addition of unlike voices playing the same line. All too frequently tenor sax, bass clarinet, and baritone horn played essentially the same part--or one finds that the 3rd B-flat clarinet, alto clarinet, and alto sax doubled what could have been a solo line for alto clarinet or alto saxophone. This emphasis in the middle register de-emphasizes the potential for the upper and lower registers--areas that often lack adequate personnel, such as piccolo and E-flat soprano clarinet, or bassoon and contra-alto or contrabass clarinet.\n\nOn occasion some instrument families are missing from the color spectrum, such as the frequently absent double reeds. Another problem is incomplete sections. Few bands utilize the full clarinet or saxophone section from soprano to contrabass voices, for example.\n\n\n\nGustav Holst 5\n\nSince instrumentation and bandstration are by necessity integrally meshed in the creative process, some advocate that instrumentation should be the composer's prerogative so as not to limit the creative process.5 In fact, Gustav Holst, considering the study of orchestration to be an artificial exercise, made the following comment concerning Berlioz' concept of orchestration:\n\nOrchestration? What do you mean? That's a question I cannot answer. You see, I'm not able to dissociate orchestration from the material which is being orchestrated. So Berlioz is no good to me. Once I tried to teach orchestration at the College (Royal College of Music), but I found it was impossible. The whole thing goes together, the material indicating the orchestration. If a drawing is bad, you can't show a student how to colour it.6\n\nObviously composers have to work within some pragmatic bounds, but to allow no additions or subtractions from instrumentation, or to insert certain doubling (such as resulted when Holst's Suite in E-flat arrived in America) is frustrating to a composer and potentially compromises the music's original intent.\n\nIn the United States, instrumentation was particularly inconsistent in early school bands. After the initial National School Band Contest in 1923, discussion ensued during subsequent years to address this problem so as to provide a working standard for all band programs interested in entering the contest. In 1927 the School Band Contests booklet listed the following acceptable instrumentation for a 68-piece band:\n\n2 flutes or 4 piccolos\n\n(interchangeable)\n\n2 E-flat clarinets\n\n2 oboes\n\n1 English horn\n\n24 B-flat clarinets\n\n2 alto clarinets\n\n1 bass clarinet\n\n2 alto saxophones\n\n(or 1 sop., 1 alto)\n\n1 tenor saxophone\n\n1 baritone saxophone\n\n1 bass saxophone\n\n2 bassoons 2 B-flat cornets\n\n2 B-flat trumpets\n\n2 B-flat fluegelhorns\n\n4 French horns\n\n3 trombones\n\n2 baritones\n\n2 E-flat tubas\n\n2 B-flat tubas\n\ntimpani\n\ndrums\n\nPromoting Saxophones American instrument manufacturers were ardent in their preference for bands make up of a majority of saxophones. As evidence of their tenacity, a 100-piece professional saxophone band, financed by the manufacturers, performed at the Music Educators National Convention in Chicago in 1928. Given his devotion to the saxophone, one wonders what Percy Grainger would have thought of such a performance! 1\n\nIt was the committee's intention to replace the strings of the orchestra with a full complement of clarinets. This seemed appropriate due to the wide pitch range which is accessible and the perception that clarinets could play for longer periods of time with less fatigue than some other instrument families.7\n\nThis instrumentation met opposition not only from directors, but also from school administrators, instrument manufacturers, and music publishers. Although the committee held its ground, it secured the additional services of John Philip Sousa, Frederick A. Stock, Edwin Franco Goldman, Captain Taylor Branson (U. S. Marine Band director), and Herbert L. Clarke to work out a standard instrumentation to be published in the 1928 edition of State and National School Band Contests. The result was fundamentally the same as the previous year's, with the exception of allowing a slightly larger number of players and slightly enhancing the flexibility of numbers within sections. The 1928 booklet further allowed:\n\n\n\nJay C. Easton with saxophones:\n\ncontrabass, bass, baritone, tenor, C tenor, alto,\n\nF mezzo-soprano, soprano, C soprano, sopranino 6\n\nLarge bands may double the number of saxophones. Additional instruments suggested for special effects or for additions to large bands: Harp, contra-bassoon, sarrusophone, 2 string basses, heckelphone, alto flute, E-flat trumpet, tenor horns . . . It is the desire of the Committee to encourage experimentation in instrumentation by large and well-developed bands in the hope that the above standard may be improved in the future, and for this reason no band will be penalized for \"overinstrumentation\" either as it applies to sections or additional instruments.8\n\nSchool band directors were concerned by the demand for alto and bass clarinet players, citing the inability of such players ever to find professional employment. School administrators cited the Committee as being in camp with the manufacturers by creating a market for the sale of more instruments. Instrument manufacturers felt the Committee was de-emphasizing those instruments that were the moneymakers in regard to sales - cornets and saxophones. They felt that by limiting the number of these two instruments, while supposedly promoting the use of clarinets, bassoons, oboes, low clarinets, and French horns that were primarily of European manufacture, they were put at an unfair disadvantage. Eventually, manufacturers began to make those instruments previously made only in Europe, but not without protest. They would have preferred that the new instrumentation consist of up to fifty percent saxophones, but had to settle for the clause, which only allowed their numbers to be doubled!\n\nMusic publishers were concerned that their entire catalogues would be rendered obsolete. Their argument was not unfounded. Music catalogues of the early 1920s listed the following instrumentation as standard for military band:9\n\nE-flat (D-flat) piccolo\n\nE-flat clarinet\n\n1st, 2nd, 3rd B-flat clarinet\n\nalto saxophone\n\ntenor saxophone\n\nE-flat cornet\n\nSolo, 1st, 2nd B-flat cornet\n\n1st, 2nd, 3rd alto horn\n\n1st, 2nd B-flat tenor horn\n\n1st, 2nd B-flat trombone (treble clef)\n\n1st, 2nd B-flat trombone (bass clef)\n\nbaritone (bass clef)\n\nB-flat baritone (treble)\n\nbasses (bass clef)\n\nB-flat bass (treble clef) 10\n\ndrums\n\nPublishers demanded the Committee draw up instrumentation that would fit existing publications. Meanwhile new publishers using the prescribed guidelines provided the needed literature to bide the time until the established publishers gave in to progress. Had the instrument manufacturers and more established music publishers had their way today's wind band movement might have a radically different appearance.\n\nEvery few years someone rediscovers, then publishes in a journal, the \"novel\" idea that the key to effective band instrumentation is to create a clarinet choir as substitute for the strings of the orchestra. In the United States the idea was practiced in the professional bands of the late 19th century and early 20th century (refer to Sousa's instrumentation as one example). This approach was pragmatic, since the bulk of the early repertoire came from orchestral literature. The Committee focused on this matter when considering instrumentation for the National School Band Contest.\n\n\n\nClarinet section of the Southwestern University Band, 1938 7\n\nA clarinet section as a substitute for the string section created two concerns. First, there must be a large enough number of clarinets to provide a dominant sound, and second, a full complement from at least the E-flat soprano down to the B-flat contrabass is necessary to allow for a full harmonic spectrum. Through the years noted experts in bandstration such as Alfred Reed and Lucien Calliet have advocated this method both in print and in personal practice.\n\nAt least two elements have kept this from becoming a universally pervasive practice. First, many advocates of the wind band maintain that this practice sets up the band to function as an inferior copy of the orchestra. Consequently, while desiring a full pitch complement from high to low, composers and conductors may not want the clarinets to be the dominant sound in the band. Others have argued that the E-flat soprano is hard to tune, and that the E-flat alto is an inferior instrument both in pitch and tone quality. The rationale continues that since flutes and saxophones already cover these two registers, these particular clarinets are unnecessary. As a result, the strength of the wind band is that in lieu of a single dominant color (as in the orchestra) there are several choirs within the tonal picture.\n\nThe second concern focuses on the repertoire written for orchestral winds, which is similar to a band without saxophones and euphoniums. This literature, substantial as it may be, cannot always be adapted for the concert band. This resulted in the formation of the Eastman Wind Ensemble by Frederick Fennell in 1952. Fennell created an ensemble with mostly one player to a part, and flexible instrumentation that allowed him to play both the literature of the wind band and the orchestral winds. It also gave the wind band an opaque quality in which individual timbres were not covered up by excessive doubling.\n\nEver since its inception, conductors and composers have argued the merits of the wind ensemble vs. the symphonic band. One concern is the doubling of parts. The elimination of doubling creates added clarity and precision. Also, when fewer parts are doubled, individual timbres project, in contrast to larger ensembles with a more homogeneous sound. Some pieces, such as Stravinsky's Symphonies of Wind Instruments written for wind ensemble or chamber winds, are best left alone. Lincolnshire Posey, while having been played successfully by groups of many different sizes, understandably takes on different qualities when played by a group of forty as opposed to a group of seventy or ninety. Balance becomes a factor when solo parts within the music have to play above a large ensemble. On the other hand, George Washington Bridge by William Schuman takes on striking differences when played by a large, rather than small, ensemble. The dissonance so common throughout the work takes on an edgy, almost brittle quality when played by a smaller group, while a large ensemble provides a depth of sonority establishing a quality of strength and foundation. The symphonic band also has the added advantage of greater dynamic contrast. An eighty-piece band playing a true pianissimo is a breathtaking experience. On the other hand, the wind ensemble has the jump on precision. Three trumpets playing a fast articulation, or three clarinets playing a demanding melodic sequence will play with more coordination than nine or twelve players trying to play in unison.\n\nSince there are advantages to both, ultimately the decision as to which size of ensemble is more acceptable has been largely a matter of taste. Unfortunately, a bit of snobbery has been manifested on both sides of this argument, which has not served the cause of music education. Increasingly, flexibility has become the order of the day, allowing each director to promote the composer's true intent no matter what size ensemble is used.\n\nCONCLUSION\n\nFinally, because a reasoned approach to instrumentation and bandstration has been increasingly adopted, the aesthetic potential for the wind band is stronger than ever. Composers have demonstrated that the power and sonority of the wind band is not an element of composition that needs to be over-emphasized to the detriment of musical taste. Compositions with continual, massive, homogeneous sounds have been increasingly replaced by works that provide variety through solo and small ensemble passages, and that promote opportunities for more imaginative color groupings, contrast in mood, and melodic development. Also, by limiting the amount of doubling, players are provided the opportunity to rest, which, in time, allows them to regain their endurance, especially in overly demanding works.\n\nThe color possibilities of the band, when compared to the orchestra, are limited only by the absence of the string section. Despite the lack of this fundamental sound of the orchestra, the wind band compensates with possibilities not regularly available to the orchestra. The orchestra generally does not use a full component of clarinets, while the saxophone family and the euphonium are seldom used. In the band, however, the general enlargement of flute, clarinet, and trumpet sections allows for harmonic possibilities within one timbre not possible in the generic orchestral instrumentation. This provides adequate power for a section not only to carry the melodic line above the rest of the ensemble, but also allows for harmonic support within the same section. With careful use of all sections it has become possible for the band to include not only a powerful sound, but also to escape the stereotype of a thick, dull homogeneous sound for one of clarity, refinement, and grace.\n\nDuring the 20th century eminent composers have written many new works for the wind band that fit these criteria. The result is a sophistication of sound both exciting and intriguing.\n\nENDNOTES\n\n1Robert Milano, \"Symphonic Band: A Monolithic Monster\", Music Journal Annual (1963), p. 32.\n\n2Harry I. Phillips, \"The Development of the Concert Band\", The Instrumentalist 15:11 (August 1961), pp. 28, 31-32.\n\n3William Revelli, \"Next in Orbit: A Common Market for Band Instrumentation\", Music Journal Annual (1962), p.151 - 152.\n\n4Ibid., p. 152\n\n5Wilson, Keith. \"Instrumentation is the Composer's Prerogative\", The Instrumentalist 18:3 (October 1963) p. 84-85.\n\n6Clifford Bax, \"Recollections of Gustav Holst\", Music and Letters, XX, No. 1 (January, 1939, p. 4.\n\n7Joseph E. Maddy, \"The Battle of Band Instrumentation\", Music Educators Journal 44:1 (September-October 1957), p. 30, 32.\n\n8Ibid., p. 32.\n\n9Loc. cit.\n\n10This instrumentation has the appearance of being a blend of the military band and the brass band. If the treble clef brass parts seem peculiar, understand that all players in a British brass band read treble clef parts.\n\nSIDEBAR NOTE\n\n1Maddy, p. 32, 35.\n\nPICTURE CREDITS\n\n1Excerpt from Edwin Franko Goldman photograph (c. 1945), photographer unknown, Goldman Collection IV.24. From the Edwin Franko Goldman Collection, American Bandmasters Association Research Center, Special Collections in Performing Arts, Michelle Smith Performing Arts Library, University of Maryland. Used by permission.\n\nSource: http://www.lib.umd.edu/PAL/SCPA/ABA/Goldman/4.html.\n\n2Composite of photographs:\n\n\n\n(Left) Photograph of 4-key boxwood C clarinet (English c. 1760?), taken by Richard Holmes, 2006, at the Bate Collection, University of Oxford. Used by permission.\n\nSource: http://commons.wikimedia.org/wiki/Image:Clarinet_4_key_anon_Bate.jpg.\n\n\n\n(Right) Photograph of modern Boehm-system Bb clarinet, photographer unknown. Used by permission.\n\nSource: http://commons.wikimedia.org/wiki/Image:Clarinet.jpg.\n\n3Photograph of a contrabass sarrusophone, taken by Matthias Kabel, 2005. Used by permission.\n\nSource: http://commons.wikimedia.org/wiki/Image:Sarrusophone.jpg.\n\n4Photograph of William D. Revelli, photographer unknown, 1969. William Revelli papers, box 6, \"Conducting\", Bentley Historical Library, University of Michigan. Used by permission.\n\nSource: http://bentley.umich.edu/bhl/myumich/images/revelli.jpg.\n\n5Photograph of Gustav Holst, photographer unknown. Public domain.\n\nSource: http://commons.wikimedia.org/wiki/Image:Holst.jpg.\n\n6Photograph of Seattle musician Jay C. Easton with saxophones, taken by Adrienne Easton. From the web site www.jayeaston.com. Used by permission.\n\nhttp://en.wikipedia.org/wiki/Image:JayCEastonSaxFamily.jpg.\n\n7Photograph of clarinet section of the Southwestern University Band, taken by Lee Russell, 1938. From the American Memory Project, Library of Congress, Prints & Photographs Division, FSA-OWI Collection, LC-USF33- 011717-M2.\n\nSource: http://memory.loc.gov/pnp/fsa/8a24000/8a24000/8a24001r.jpg."}, {"url": "http://www.liftersrock.com/about-us/", "page_content": "We are proud to announce the release of our new recording!\n\nPlease purchase it here right now:\n\nwww.itunes.com"}, {"url": "https://polyend.com/whats-up/noir-the-tracker-has-become-an-integral-part-of-my-sound/", "page_content": "The Polyend Tracker was released more than two years back. We could see a large community of Tracker’s fans, which makes us very happy and proud that the scene is still attractive and inspiring for musicians. Many of you are still trying to figure out whether it is suitable for your music style. Quick answer: yes, it is. It doesn’t matter if you’re a techno producer, jungle creator, ambient enthusiast, or guitarist.\n\nToday we’re visiting Noir to find out what’s new. What are his Tracker’s inspirations? Noir: In this period, I am dedicating myself mainly to two things: a techno live set (the tech sketches that I am publishing on my YouTube channel) built solely on the Tracker. I’m working on my new album, which could be released by the end of the year, or early 2023. Also composed solely in the Tracker and performed with Tracker & which is my standard setup these days, some examples on my YouTube Channel also).\n\nPolyend: What is the most crucial device used throughout your career? Presently? Noir: I have two crucial tools, which are Polyend Tracker and Elektron Octatrack. Usually in my standard setup, the compositional is created in the Tracker, to then be performed with the performative effects of the Tracker itself and the Octatrack, which is used as FX box, manual samples launching, and live resampling. They are two machines that work great together!\n\nPolyend: Can you reveal one sound design or music production secret to us? Noir: One of my favorite things to do with the Tracker, in terms of sound design, is to use a high pass filter, with a good resonance notch, to “pump” kicks and bass. It’s like taking advantage of a single band eq. Another creative “trick” with the Tracker is to write the parts of the track, without going into too much detail of the transitions from one section of the track to another. You can do the transitions live, using the Perform section of the Tracker, creating the necessary transitions, always different, directly live.\n\nI am a musician with a “traditional” background (guitar, bass and vocals), so I NEED to be able to play these instruments. With the Tracker this is possible, and for me it is CRUCIAL.\n\nPolyend: Why do you choose Polyend devices? Noir: The choice of the Tracker came by chance. I was citing new solutions to have a portable and complete setup. After a few days of use, I practically fell in love with it. The ease with which you can get ideas out of your head is absolutely mind blowing. In no time you have the song in hands! Now I couldn’t do without it anymore. The Tracker has become an integral part of MY sound.\n\nNoir prepared and published a new instruments pack for Tracker/Play. Noir: Most of the sounds on this track, come from my new instruments pack, specific for genres such as Techno (all declensions), IDM, house. This New pack for Tracker/Play contains: basses, techno rumble, drum kit (single shots and chain + bonus chain kit coming from my first pack), techno chords, up to 50 instruments in .pti format for Polyend Tracker, 1 kit for Polyend Play, and wav files. New instrument pack for Tracker/Play download\n\nWatch the demo, see how these sounds can inspire you!\n\nJust recently Noir prepared a new Polyend Tacker – “The Freak” pack: more than 500 files, PTI instruments, WAV files (each patch samples 3 times over 3 octaves), project files for the Tracker, and more! Basses, leads, pads, you are all covered! Polyend Tacker – “The Freak” pack download"}, {"url": "https://www.frontiersin.org/articles/10.3389/fpsyg.2020.01246/full", "page_content": "and Evangelos Himonides1\n\nEditorial on the Research Topic\n\nThe Impact of Music on Human Development and Well-Being\n\nMusic is one of the most universal ways of expression and communication for humankind and is present in the everyday lives of people of all ages and from all cultures around the world (Mehr et al., 2019). Hence, it seems more appropriate to talk about musics (plural) rather than in the singular (Goble, 2015). Furthermore, research by anthropologists as well as ethnomusicologists suggests that music has been a characteristic of the human condition for millennia (cf. Blacking, 1976; Brown, 1999; Mithen, 2005; Dissanayake, 2012; Higham et al., 2012; Cross, 2016). Nevertheless, whilst the potential for musical behavior is a characteristic of all human beings, its realization is shaped by the environment and the experiences of individuals, often within groups (North and Hargreaves, 2008; Welch and McPherson, 2018). Listening to music, singing, playing (informally, formally), creating (exploring, composing, improvising), whether individually and collectively, are common activities for the vast majority of people. Music represents an enjoyable activity in and of itself, but its influence goes beyond simple amusement.\n\nThese activities not only allow the expression of personal inner states and feelings, but also can bring about many positive effects in those who engage in them. There is an increasing body of empirical and experimental studies concerning the wider benefits of musical activity, and research in the sciences associated with music suggests that there are many dimensions of human life—including physical, social, educational, psychological (cognitive and emotional)—which can be affected positively by successful engagement in music (Biasutti and Concina, 2013). Learning in and through music is something that can happen formally (such as part of structured lessons in school), as well as in other-than-formal situations, such as in the home with family and friends, often non-sequentially and not necessarily intentional, and where participation in music learning is voluntary, rather than mandated, such as in a community setting (cf. Green, 2002; Folkestad, 2006; Saether, 2016; Welch and McPherson, 2018).\n\nSuch benefits are evidenced across the lifespan, including early childhood (Gerry et al., 2012; Williams et al., 2015; Linnavalli et al., 2018), adolescence (McFerran et al., 2018), and older adulthood (Lindblad and de Boise, 2020). Within these lifespan perspectives, research into music's contribution to health and well-being provides evidence of physical and psychological impacts (MacDonald et al., 2013; Fancourt and Finn, 2019; van den Elzen et al., 2019). Benefits are also reported in terms of young people's educational outcomes (Guhn et al., 2019), and successful musical activity can enhance an individual's sense of social inclusion (Welch et al., 2014) and social cohesion (Elvers et al., 2017).\n\nThis special issue provides a collection of 21, new research articles that deepen and develop our understanding of the ways and means that music can impact positively on human development and well-being. The collection draws on the work of 88 researchers from 17 different countries across the world, with each article offering an illustration of how music can relate to other important aspects of human functioning. In addition, the articles collectively illustrate a wide range of contemporary research approaches. These provide evidence of how different research aims concerning the wider benefits of music require sensitive and appropriate methodologies.\n\nIn terms of childhood and adolescence, for example, Putkinen et al. demonstrate how musical training is likely to foster enhanced sound encoding in 9 to 15-year-olds and thus be related to reading skills. A separate Finnish study by Saarikallio et al. provides evidence of how musical listening influences adolescents' perceived sense of agency and emotional well-being, whilst demonstrating how this impact is particularly nuanced by context and individuality. Aspects of mental health are the focus for an Australian study by Stewart et al. of young people with tendencies to depression. The article explores how, despite existing literature on the positive use of music for mood regulation, music listening can be double-edged and could actually sustain or intensify a negative mood.\n\nA Portuguese study by Martins et al. shifts the center of attention from mental to physical benefits in their study of how learning music can support children's coordination. They provide empirical data on how a sustained, 24-week programme of Orff-based music education, which included the playing of simple tuned percussion instruments, significantly enhanced the manual dexterity and bimanual coordination in participant 8-year-olds compared to their active control (sports) and passive control peers. A related study by Loui et al. in the USA offers insights into the neurological impact of sustained musical instrument practice. Eight-year-old children who play one or more musical instruments for at least 0.5 h per week had higher scores on verbal ability and intellectual ability, and these correlated with greater measurable connections between particular regions of the brain related to both auditory-motor and bi-hemispheric connectivity.\n\nYounger, pre-school children can also benefit from musical activities, with associations being reported between informal musical experiences in the home and specific aspects of language development. A UK-led study by Politimou et al. found that rhythm perception and production were the best predictors of young children's phonological awareness, whilst melody perception was the best predictor of grammar acquisition, a novel association not previously observed in developmental research. In another pre-school study, Barrett et al. explored the beliefs and values held by Australian early childhood and care practitioners concerning the value of music in young children's learning. Despite having limited formal qualifications and experience of personal music learning, practitioners tended overall to have positive attitudes to music, although this was biased toward music as a recreational and fun activity, with limited support for the notion of how music might be used to support wider aspects of children's learning and development.\n\nEngaging in music to support a positive sense of personal agency is an integral feature of several articles in the collection. In addition to the Saarikallio team's research mentioned above, Moors et al. provide a novel example of how engaging in collective beatboxing can be life-enhancing for throat cancer patients in the UK who have undergone laryngectomy, both in terms of supporting their voice rehabilitation and alaryngeal phonation, as well as patients' sense of social inclusion and emotional well-being.\n\nOne potential reason for these positive findings is examined in an Australian study by Krause et al.. They apply the lens of self-determination theory to examine musical participation and well-being in a large group of 17 to 85-year-olds. Respondents to an online questionnaire signaled the importance of active music making in their lives in meeting three basic psychological needs embracing a sense of competency, relatedness and autonomy.\n\nThe use of public performance in music therapy is the subject of a US study by Vaudreuil et al. concerning the social transformation and reintegration of US military service members. Two example case studies are reported of service members who received music therapy as part of their treatment for post-traumatic stress disorder, traumatic brain injury, and other psychological health concerns. The participants wrote, learned, and refined songs over multiple music therapy sessions and created song introductions to share with audiences. Subsequent interviews provide positive evidence of the beneficial psychological effects of this programme of audience-focused musical activity.\n\nRelatedly, McFerran et al. in Australia examined the ways in which music and trauma have been reported in selected music therapy literature from the past 10 years. The team's critical interpretive synthesis of 36 related articles led them to identify four different ways in which music has been used beneficially to support those who have experienced trauma. These approaches embrace the use of music for stabilizing (the modulation of physiological processes) and entrainment (the synchronization of music and movement), as well as for expressive and performative purposes—the fostering of emotional and social well-being.\n\nThe therapeutic potential of music is also explored in a detailed case study by Fachner et al.. Their research focuses on the nature of critical moments in a guided imagery and music session between a music therapist and a client, and evidences how these moments relate to underlying neurological function in the mechanics of music therapy.\n\nAt the other end of the age span, and also related to therapy, an Australian study by Brancatisano et al. reports on a new Music, Mind, and Movement programme for people in their eighties with mild to moderate dementia. Participants involved in the programme tended to show an improvement in aspects of cognition, particularly verbal fluency and attention. Similarly, Wilson and MacDonald report on a 10-week group music programme for young Scottish adults with learning difficulties. The research data suggest that participants enjoyed the programme and tended to sustain participation, with benefits evidenced in increased social engagement, interaction and communication.\n\nThe role of technology in facilitating access to music and supporting a sense of agency in older people is the focus for a major literature review by Creech, now based in Canada. Although this is a relatively under-researched field, the available evidence suggests that that older people, even those with complex needs, are capable of engaging with and using technology in a variety of ways that support their musical perception, learning and participation and wider quality of life.\n\nRelated to the particular needs of the young, children's general behavior can also improve through music, as exampled in an innovative, school-based, intensive 3-month orchestral programme in Italy with 8 to 10-year-olds. Fasano et al. report that the programme was particularly beneficial in reducing hyperactivity, inattention and impulsivity, whilst enhancing inhibitory control. These benefits are in line with research findings concerning successful music education with specific cases of young people with ADHD whose behavior is characterized by these same disruptive symptoms (hyperactivity, inattention, and impulsivity).\n\nExtra-musical benefits are also reported in a study of college students (Bachelors and Masters) and amateur musicians in a joint Swiss-UK study. Antonini Philippe et al. suggest that, whilst music making can offer some health protective effects, there is a need for greater health awareness and promotion among advanced music students. Compared to the amateur musicians, the college music students evaluated their overall quality of life and general and physical health more negatively, as did females in terms of their psychological health. Somewhat paradoxically, the college students who had taken part in judged performances reported higher psychological health ratings. This may have been because this sub-group were slightly older and more experienced musicians.\n\nMusic appears to be a common accompaniment to exercise, whether in the gym, park or street. Nikol et al. in South East Asia explore the potential physical benefits of synchronous exercise to music, especially in hot and humid conditions. Their randomized cross-over study (2019) reports that “time-to-exhaustion” under the synchronous music condition was 2/3 longer compared to the no-music condition for the same participants. In addition, perceived exertion was significantly lower, by an average of 22% during the synchronous condition.\n\nComparisons between music and sport are often evidenced in the body of existing Frontiers research literature related to performance and group behaviors. Our new collection contains a contribution to this literature in a study by Habe et al.. The authors investigated elite musicians and top athletes in Slovenia in terms of their perceptions of flow in performance and satisfaction with life. The questionnaire data analyses suggest that the experience of flow appears to influence satisfaction with life in these high-functioning individuals, albeit with some variations related to discipline, participant sex and whether considering team or individual performance.\n\nA more formal link between music and movement is the focus of an exploratory case study by Cirelli and Trehub. They investigated a 19-month-old infant's dance-like, motorically-complex responses to familiar and unfamiliar songs, presented at different speeds. Movements were faster for the more familiar items at their original tempo. The child had been observed previously as moving to music at the age of 6 months.\n\nFinally, a novel UK-based study by Waddington-Jones et al. evaluated the impact of two professional composers who were tasked, individually, to lead a 4-month programme of group composing in two separate and diverse community settings—one with a choral group and the other in a residential home, both funded as part of a music programme for the Hull City of Culture in 2017. In addition to the two composers, the participants were older adults, with the residential group being joined by schoolchildren from a local Primary school to collaborate in a final performance. Qualitative data analyses provide evidence of multi-dimensional psychological benefits arising from the successful, group-focused music-making activities.\n\nIn summary, these studies demonstrate that engaging in musical activity can have a positive impact on health and well-being in a variety of ways and in a diverse range of contexts across the lifespan. Musical activities, whether focused on listening, being creative or re-creative, individual or collective, are infused with the potential to be therapeutic, developmental, enriching, and educational, with the caveat provided that such musical experiences are perceived to be engaging, meaningful and successful by those who participate.\n\nCollectively, these studies also celebrate the multiplicity of ways in which music can be experienced. Reading across the articles might raise a question as to whether or not any particular type of musical experience is seen to be more beneficial compared with another. The answer, at least in part, is that the empirical evidence suggests that musical engagement comes in myriad forms along a continuum of more or less overt activity, embracing learning, performing, composing and improvising, as well as listening and appreciating. Furthermore, given the multidimensional neurological processing of musical experience, it seems reasonable to hypothesize that it is perhaps the level of emotional engagement in the activity that drives its degree of health and well-being efficacy as much as the activity's overt musical features. And therein are opportunities for further research!\n\nAuthor Contributions\n\nThe editorial was drafted by GW and approved by the topic Co-editors. All authors listed have made a substantial, direct and intellectual contribution to the Edited Collection, and have approved this editorial for publication.\n\nConflict of Interest\n\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nAcknowledgments\n\nWe are very grateful to all the contributing authors and their participants for their positive engagement with this Frontiers Research Topic, and also for the Frontiers staff for their commitment and support in bringing this topic to press.\n\nReferences\n\nBiasutti, M., and Concina, E. (2013). “Music education and transfer of learning,” in Music: Social Impacts, Health Benefits and Perspectives, eds P. Simon and T. Szabo (New York, NY: Nova Science Publishers, Inc Series: Fine Arts, Music and Literature), 149–166. Google Scholar\n\nBlacking, J. (1976). How Musical Is Man? London: Faber & Faber. Google Scholar\n\nBrown, S. (1999). “The ‘musilanguage’ model of music evolution,” in The Origins of Music, eds N. L. Wallin, B. Merker, and S. Brown (Cambridge: The MIT Press), 271–301. doi: 10.7551/mitpress/5190.003.0022 CrossRef Full Text\n\nCross, I. (2016). “The nature of music and its evolution,” in Oxford Handbook of Music Psychology, eds S. Hallam, I. Cross, and M. Thaut (New York, NY: Oxford University Press), 3–18. doi: 10.1093/oxfordhb/9780198722946.013.5 CrossRef Full Text | Google Scholar\n\nElvers, P., Fischinger, T., and Steffens, J. (2017). Music listening as self-enhancement: effects of empowering music on momentary explicit and implicit self-esteem. Psychol. Music 46, 307–325. doi: 10.1177/0305735617707354 CrossRef Full Text | Google Scholar\n\nFancourt, D., and Finn, S. (2019). What Is the Evidence on the Role of the Arts in Improving Health and Well-Being? A Scoping Review. Copenhagen: World Health Organisation. Google Scholar\n\nFolkestad, G. (2006). Formal and informal learning situations or practices vs formal and informal ways of learning. Br. J. Music Educ. 23, 135–145. doi: 10.1017/S0265051706006887 CrossRef Full Text | Google Scholar\n\nGoble, J. S. (2015). Music or musics?: an important matter at hand. Act. Crit. Theor. Music Educ. 14, 27–42. Available online at: http://act.maydaygroup.org/articles/Goble14_3.pdf Google Scholar\n\nGreen, L. (2002). How Popular Musicians Learn. Aldershot: Ashgate Press. Google Scholar\n\nGuhn, M., Emerson, S. D., and Gouzouasis, P. (2019). A population-level analysis of associations between school music participation and academic achievement. J. Educ. Psychol. 112, 308–328. doi: 10.1037/edu0000376 CrossRef Full Text | Google Scholar\n\nHigham, T., Basell, L., Jacobi, R., Wood, R., Ramsey, C. B., and Conard, N.J. (2012). Testing models for the beginnings of the Aurignacian and the advent of figurative art and music: the radiocarbon chronology of GeißenklÃsterle. J. Hum. Evol. 62, 664-676. doi: 10.1016/j.jhevol.2012.03.003 PubMed Abstract | CrossRef Full Text | Google Scholar\n\nLindblad, K., and de Boise, S. (2020). Musical engagement and subjective wellbeing amongst men in the third age. Nordic J. Music Therapy 29, 20–38. doi: 10.1080/08098131.2019.1646791 CrossRef Full Text | Google Scholar\n\nMcFerran, K. S., Hense, C., Koike, A., and Rickwood, D. (2018). Intentional music use to reduce psychological distress in adolescents accessing primary mental health care. Clin. Child Psychol. Psychiatry 23, 567–581. doi: 10.1177/1359104518767231 PubMed Abstract | CrossRef Full Text | Google Scholar\n\nSaether, M. (2016). Music in informal and formal learning situations in ECEC. Nordic Early Childhood Educ. Res. J. 13, 1–13. doi: 10.7577/nbf.1656 CrossRef Full Text | Google Scholar\n\nWelch, G.F., and McPherson, G. E., (eds.). (2018). “Commentary: Music education and the role of music in people's lives,” in Music and Music Education in People's Lives: An Oxford Handbook of Music Education (New York, NY: Oxford University Press), 3–18. doi: 10.1093/oxfordhb/9780199730810.013.0002 CrossRef Full Text | Google Scholar"}, {"url": "https://dictionary.cambridge.org/example/english/integral-part", "page_content": "collocation in English\n\nmeanings of integral and part\n\nThese words are often used together. Click on the links below to explore the meanings. Or, see other collocations with part\n\nsome but not all of ...\n\nnecessary and important as a part of ...\n\n(Definition of integral and part from the Cambridge English Dictionary © Cambridge University Press)\n\nThese examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors.\n\nAmniotic -uid volume is an integral part of the assessment. From the Cambridge English Corpus\n\nIt should be an integral part of phonological training. From the Cambridge English Corpus\n\nThis ideological overtone became an integral part of organization theory. From the Cambridge English Corpus\n\nNotably, it is an integral part of engineering practice. From the Cambridge English Corpus\n\nThe yard represented an integral part of the internal space. From the Cambridge English Corpus\n\nUnarguably, language is an integral part of culture. From the Cambridge English Corpus\n\nIt arises from the 'integral part' of the -expansion. From the Cambridge English Corpus\n\nThese songs became an integral part of the production. From the Cambridge English Corpus\n\nA vibrating membrane is an integral part of the cell. From the Cambridge English Corpus\n\nThe negotiation of status and power are an integral part of the research relationship. From the Cambridge English Corpus\n\nQuality assurance must be an integral part of contracts between providers and payers. From the Cambridge English Corpus\n\nIn other sciences, controlled experiments are used as an integral part of the scientific method. From the Cambridge English Corpus\n\nThis indicates that active visual imagery is an integral part of active visual perception. From the Cambridge English Corpus\n\nIn both perspectives, violence seemed an integral part of this indoctrination. From the Cambridge English Corpus\n\nIt has also ensured that monitoring and evaluation are an integral part of the project. From the Cambridge English Corpus\n\nAn integral part of institution-building during the interregnum was the movement for education in democracy. From the Cambridge English Corpus\n\nDetermination of this value, therefore, is another integral part of the investigation. From the Cambridge English Corpus\n\nSelf-evaluation and assessment is an integral part of responsible management. From the Cambridge English Corpus\n\nThe importance of multimodal interaction was emphasised as an integral part of this technique. From the Cambridge English Corpus\n\nFrom this perspective, the creative context becomes an integral part of the work. From the Cambridge English Corpus\n\nIt thus seems reasonable to see ethical aspects as an integral part of all care activities. From the Cambridge English Corpus\n\nThis suggests that active visual imagery is an integral part of active visual perception. From the Cambridge English Corpus\n\nThe tool will thus become an integral part of a signed listening process. From the Cambridge English Corpus\n\nThe area was never an integral part of an undivided empire that ruled its territory. From the Cambridge English Corpus\n\nHe now includes audition practice as an integral part of his teaching. From the Cambridge English Corpus\n\nThese examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors."}, {"url": "https://ideas.repec.org/a/brc/brccej/v3y2018i1p59-78.html", "page_content": "In a world in which the number of Internet users is steadily increasing,Social Media has become a phenomenon, being an integral part of modern society.Starting from the fact that online activities that have earned percentages inthe last 5 years include the use of social networks, making simple or videophone calls and sending / receiving emails, this paper aims to present a seriesof Social Media issues and the impact it has on society.\n\nCorrections\n\nAll material on this site has been provided by the respective publishers and authors. You can help correct errors and omissions. When requesting a correction, please mention this item's handle: RePEc:brc:brccej:v:3:y:2018:i:1:p:59-78. See general information about how to correct material in RePEc.\n\nFor technical questions regarding this item, or to correct its authors, title, abstract, bibliographic or download information, contact: . General contact details of provider: http://www.univcb.ro/ .\n\nIf you have authored this item and are not yet registered with RePEc, we encourage you to do it here. This allows to link your profile to this item. It also allows you to accept potential citations to this item that we are uncertain about.\n\nWe have no bibliographic references for this item. You can help adding them by using this form .\n\nIf you know of missing items citing this one, you can help us creating those links by adding the relevant references in the same way as above, for each refering item. If you are a registered author of this item, you may also want to check the \"citations\" tab in your RePEc Author Service profile, as there may be some citations waiting for confirmation.\n\nFor technical questions regarding this item, or to correct its authors, title, abstract, bibliographic or download information, contact: Cristina GANESCU (email available below). General contact details of provider: http://www.univcb.ro/ .\n\nPlease note that corrections may take a couple of weeks to filter through the various RePEc services."}]}