{"In addition to her work with Týr, Stenberg has released two solo albums, and has collaborated with various other Faroese and international artists.": [{"url": "http://www.katestenberg.com/short-biography", "page_content": "Short Biography (253 words)\n\nKate Stenberg’s solo violin playing has been described by NewMusicBox as “highly virtuosic and deeply communicative…full of character and presence.” Her acclaimed CD, “Scenes from a New Music Séance” with pianist Eva-Maria Zimmermann, released by Other Minds in 2012, includes several world premieres and assorted new music – a genre to which she has been deeply committed.\n\nFormally as first violinist in the renowned Del Sol String Quartet, with whom she toured nationally and internationally for the past two decades, Kate performed premieres of hundreds of new works and recorded numerous CDs. She was a founding member of the Left Coast Chamber Ensemble and the Real Vocal String Quartet. In addition to her recordings with Del Sol String Quartet, she has recorded with many other ensembles, including the San Francisco Contemporary Music Players, New Music Works and with the late Maestro Ustad Ali Akbar Khan.\n\nKate has Stenberg has performed at San Francisco Performances with Bill T. Jones / Arnie Zane Dance Company, the music of Daniel Bernard Roumain alongside cellist Joan Jeanrenaud. In addition, she has performed with the San Francisco Ballet and Opera Orchestras as well as the San Francisco Symphony. She has lectured and performed at numerous conservatories and universities throughout the country including the Manhattan School of Music. MIT and the San Francisco and Peabody Conservatories of Music.\n\nKate was raised in a dynamic family of professional musicians and received her degrees from the San Francisco Conservatory of Music and the Eastman School of Music."}, {"url": "https://genius.com/artists/Tyr", "page_content": "About Tyr\n\nTaking their name from the Norse god of justice, Tyr is a power metal band hailing from the Faroe islands north of Norway, and their musical themes revolve around Norse mythology and viking culture.\n\nThe story of the Týr begins in January 1998 when Heri Joensen met his friend Kári Streymoy at a party in Copenhagen in Denmark and proposed to found a new group. Despite his initial refusal, he later accepted his proposal, and bassist Gunnar Thomsen was soon added to the two.\n\nThe band’s name derives from Týr, a Norse deity (the equivalent of Mars for Roman mythology). Before Týr Joensen and Thomsen played together at seventeen in a band called Cruiser, as well as the same Stremoy, even if the latter only for a short time. This band then changed its name to Wolfgang and according to some rumors Joensen is still active and ready to publish new records\n\nAt the beginning of his career the band made use of the Faroese label Tutl for the production of their own CDs, including the debut How Far to Asgaard, but, after six years on tour for Europe, between Fær Øer, Iceland, Denmark, Russia, Finland, Latvia, Norway, Germany and Poland and some television appearances, their album Eric the Red, dedicated to Erik the Red, becomes the best-selling Faroese album, thanks to a particular sound that will become their trademark, attracting the attention of the record label Napalm Records who decided to redistribute it in 2006 and spread it all over the world. From this moment on the Austrian label decided to take care of all the albums of the group, thus renewing the graphics of the covers and re-proposing the first CDs of the group.\n\nIn the same year comes Ragnarok, the best album of the band under the creative and compositional point of view. The tracks are divided among them by short interludes (sound and / or effects) that guarantee the identification of the listener in the epic war scenario – the Ragnarǫk, in fact – proposed by the group, and the pieces (thanks to the union of singular sounds folk with powerful prog trends) with a very distinctive sound of their kind.\n\nAfter the release of the album Land in early 2008, which continues in the sounds of the previous albums, the group began its tour in Europe and the United States for the Paganfest, along with Ensiferum, Eluveitie, Turisas, Moonsorrow and Korpiklaani bands, and during 2009 he will return to the United States first and then to Europe.\n\nAt the end of 2008 the band was voted band of the year by the TV and the Faroese National radio, through online voting procedure.\n\nThe following year, the By the Light of the Northern Star album was released. As usual, the Faroese re-propose key national viking metal melodies, but here the songs become engaging hymns; examples of this musical translation are presented in anthemic pieces such as Tróndur í Gøtu, By the Sword in My Hand and Turið Torkilsdóttir.\n\nIn May 2011 comes The Lay of Thrym, an album in which the epic / progressive sounds of the first works and the recent viking / heavy breakthrough were merged. This process can be detected by listening to songs like Evening Star, almost a Viking ballad, and others like Take Your Tyrant and Fields of the Fallen, simpler, direct and in-your-face.\n\nIn September 2012, during the American tour with Moonsorrow and Korpiklaani, they signed a contract with the label Metal Blade Records.\n\nIn September 2013 Valkyrja comes out, the first album recorded under the US label. The plot of the concept album revolves around a Viking warrior, who abandons homeland and wife to join a battle in which he eventually perishes. The reward for his sacrifice comes with the Valkyries that accompany him at the Fólkvangr, or the home of the goddess Freyja, associated with love, beauty, fertility, gold, magic, war and death. The last two tracks are the cover of “Where eagles give” by Iron Maiden and “Cemetery Gates” by the Pantera. Both great inspirations of Týr, the songs are performed with the characteristic sound of the Faroese band."}, {"url": "https://www.nytimes.com/2018/09/11/movies/amandla-stenberg-the-hate-u-give.html", "page_content": "WEST HOLLYWOOD, Calif. — There are roles certain actors seem born to play — an echo of facial symmetry, a rhyming of demeanor — and then there is Starr Carter, the high school junior of “The Hate U Give,” and Amandla Stenberg, the young actress who seems to embody her almost from sense memory, as if the performance is actually self portraiture.\n\nIn a way, it is. Both Ms. Stenberg and her fictional counterpart shuttled between a lower-income black neighborhood and a wealthy white private school, beginning at the age of 10. Both were shaped by the mental gymnastics of traversing the two worlds, each of which seemed to require a distinct conception of self. And both were eventually jolted out of their youthful naïveté by the same grimly modern rite of passage — the killing of an unarmed black man at the hands of a white police officer.\n\nIn the novel on which the film is based, which dramatizes some of the events that galvanized the Black Lives Matter movement, Starr’s seamless shifting between identities, or code switching, masks an internal sense of isolation and chaos that particularly moved Ms. Stenberg, 19, who grew up in black and Latino South Los Angeles and attended school in a white Westside neighborhood.\n\n“There was this barrier that was always going to prevent me from being a part of that community in the same way that those kids were,” she recalled in a recent interview. “I learned to be silent about certain factors of my life, like struggles with money. While other kids talked about all the things they did and places they traveled over summer break, my friends and I mostly kept to ourselves.”"}, {"url": "https://www.last.fm/music/Kate+Stenberg/+wiki", "page_content": "Kate Stenberg’s violin playing has been described as “highly virtuosic and deeply communicative…full of character and presence” (NewMusicBox), as heard in performances in a dozen countries and on numerous CDs from New World Records, Sono Luminous, Newport Classics, Decca Records, Other Minds and New Albion labels. She is a leading interpreter of contemporary chamber music having premiered over a hundred works, including pieces incorporating multi-media and improvisation. As a \"Bay Area new-music luminary” (San Francisco Chronicle) Stenberg has commissioned, recorded and premiered new works by Tania Leon, Jack Body, Peter Sculthorpe, Chinary Ung, Per Nørgård, Kui Dong and many others. Stenberg’s CD Scenes from a New Music Séance with virtuoso pianist Eva-Maria Zimmermann has received special notice and features groundbreaking, innovative works by Pelle Gudmundsen-Holmgreen, Ruth Crawford Seeger and George Antheil. Composers who have dedicated work to her include Charles Amirkhanian, Robert Honstein, Amy X Neuburg, Aaron Gervais and Ronald Bruce Smith.\n\nKate Stenberg developed and commissioned new chamber music as co-founder of the Left Coast Chamber Ensemble (1993-1998) and Real Vocal String Quartet (2004-2006) and from 1995-2015 she served as the first violinist of the award winning Del Sol String Quartet - where she fostered the string quartet repertoire through collaboration and the commissioning of established and emerging composers. She worked closely with many composers including Joan Tower, Mason Bates, Mohammed Fairouz and Gabriela Lena Frank performing at such prestigious venues as the Kennedy Center, Library of Congress, Symphony Space, National Gallery of Art and on KQED public television. Hailed by Gramophone Magazine as “masters of all musical things they survey”, Del Sol Quartet was a two time top winner of the Chamber Music America/ASCAP Award for Adventurous Programming. The quartet expanded its outreach to numerous educational institutions including the Manhattan School of Music, Dartmouth, MIT, Chapman University, University of California Berkeley and Santa Cruz, and the San Francisco and Peabody Conservatories of Music.\n\nStenberg has recorded work primarily by 20th and 21st century composers, including John Cage, Marc Bliztstein, Robert Erickson, Lou Harrison, Gabriela Lena Frank, Reza Vali and Kui Dong. During her two decade tenure with Del Sol String Quartet, she recorded numerous world premieres as well as established contemporary works. On the CD The Complete String Quartets with Didjeridu by Peter Sculthorpe, the quartet was hailed for their “luminous performance” and “sumptuous sound” (San Francisco Chronicle). Stenberg can also be heard on recordings with the San Francisco Contemporary Music Players, New Music Works, Stratos and with tabla virtuoso Zakir Hussain and the late sarod master, Ustad Ali Akbar Khan.\n\nStenberg’s festival performances include Other Minds, Opera Santa Fe, Chautauqua, Ojai, Cabrillo, Nirmita Composer’s Institute (Cambodia), Davos Festival (Switzerland), Tanglewood, Music Academy of the West, Centre Acanthes (France), Banff (Canada), and the Chengdu Contemporary Music Festival (China). Alongside cellist Joan Jeanrenaud, she has premiered the music of Daniel Bernard Roumain for San Francisco Performances in work with Bill T. Jones / Arnie Zane Dance Company. In addition to her festival appearances, Stenberg has performed with the San Francisco Symphony, San Francisco Opera and Ballet Orchestras, West Edge Opera, Earplay, New Century Chamber Orchestra, Bay Area Women's Philharmonic, Rochester Philharmonic, and as concertmaster of Kammeroper Frankfurt.\n\nCurrently, Stenberg collaborates with composers and musicians from around the world and performs regularly with \"sterling pianist\" Sarah Cahill. Newly formed in 2016, the Stenberg|Cahill Duo is dedicated to promoting the American experimental tradition and expanding it through the commissioning of new work. “It’s difficult to believe that the Stenberg|Cahill Duo was formed in 2016: These two musicians sound as though they have been collaborating with one another much longer. Contemporary music fans are fortunate to have this simultaneously authoritative and approachable pair…” San Francisco Classical Voice. Recent appearances include performances at the San Francisco Performances PIVOT Series with percussionist William Winant, Cal State Fullerton New Music Festival, Berkeley Museum of Art and Pacific Film Archive, Music by the Mountain Festival, Other Minds New Music Séance, Garden of Memory at the Julia Morgan Chapel of the Chimes.\n\nRaised in a dynamic family of professional musicians and performing artists, Bay Area native Kate Stenberg holds degrees from the San Francisco Conservatory and the Eastman School of Music. She maintains and active teaching schedule and when she is not immersed in her music scores, she can be found enjoying Taiji or hiking trails in her beloved Sierra Nevada."}, {"url": "https://www.pastemagazine.com/music/double-albums/10-artists-who-released-two-albums-on-the-same-day", "page_content": "Four years have passed since Rhode Island roots rockers Deer Tick unveiled their fifth album, Negativity. But before anyone can accuse them of slacking, the band returns today with not just one, but two full-length studio efforts, imaginatively titled Vol. 1 and Vol. 2. Of course, Deer Tick aren’t the only act to have inadvertently burned a hole in their most ardent fans’ pockets. From cult drone rockers to chart-topping rappers, here’s a look at 10 acts who released two entirely separate records on the very same day.\n\n10. Islands, Should I Remain, Here at Sea? and Taste\n\nTen years after first showcasing their hook-laden brand of indie-rock on Return to the Sea, Canadian outfit Islands did indeed do just that for a spiritual, and questioning, sequel. It perhaps explains why Should I Remain, Here at Sea? sounds strangely familiar, something which even frontman Nick Thorburn appears to acknowledge on opener “Back Into It” (Those songs we used to sing / We haven’t sung them in so long / I’ll sing one with you now”). Also released through their own Manqué label on May 13, 2016, Taste is a much more adventurous listen, adding space age synths and electronic bleeps into the mix on twelve vibrant tracks which drew comparisons with French dance-rock maestros Phoenix.\n\n9. Juliana Hatfield, Juliana’s Pony: Total System Failure and Beautiful Creature\n\nAround the time of its release in 2000, Juliana Hatfield described Juliana’s Pony: Total System Failure (by far the most abrasive of the two records she put out) as, “A not-at-all attractive reaction to the ugly side of humanity, specifically American culture.” Tune-free, aimless and entirely unnecessary were just some of the more succinct terms other less charitable listeners used instead. Formerly of Blake Babies, Some Girls and The Lemonheads, the alt-rock journeywoman has always been a rather contradictory figure, and nowhere was this more apparent than on these dual releases. While Juliana’s Pony appeared designed to confuse and confront, Beautiful Creature was a relatively simple, introspective and melodic affair which gained some of the most glowing reviews of Hatfield’s career.\n\nCheck out Juliana Hatfield’s Paste Studio Session from April 2017 here.\n\n8. Bright Eyes, I’m Wide Awake, It’s Morning and Digital Ash in a Digital Urn\n\nBright Eyes’ Conor Oberst certainly took full advantage of the two albums/same day concept. Home to his signature hit (“The First Day of My Life”), I’m Wide Away, It’s Morning saw the singer-songwriter embrace his more typical country-folk sound to enchanting effect, with none other than Emmylou Harris providing harmonies on three tracks. The electronic noodlings of Digital Ash in a Digital Urn, meanwhile, were more akin to Kid A-era Radiohead, with Yeah Yeah Yeahs’ Nick Zinner, Azure Ray’s Maria Taylor and Tilly and the Wall’s Nick White just some of the hipster-friendly providing support. Of course, it was the more conventional record which elevated Oberst to cult hero status, but its wonderfully weird companion remains the more intriguing.\n\n7. Elvis Costello, The Delivery Man and Il Sogno\n\nThe Delivery Man is credited to Elvis Costello and The Imposters, while Il Sogno sees Costello take sole billing. But for all intents and purposes, both records are the work of the same bespectacled singer-songwriter. Based on a conceptual story intended for Johnny Cash, The Delivery Man is an impassioned blend of alt-country and roots rock featuring guest appearances from the seemingly ubiquitous Emmylou Harris and Lucinda Williams. Il Sogno, meanwhile, is an ambitious ballet score composed for an Italian dance company’s loose adaptation of A Midsummer Night’s Dream. Thankfully Costello proved to be far more convincing than fellow pop icon-turned-occasional composer Paul McCartney, but it’s The Delivery Man which is widely regarded as the late-Costello classic.\n\n6. Bruce Springsteen, Human Touch and Lucky Town\n\nBruce Springsteen had put out a double album, The River, in 1980, but opted for a different approach in 1992, separating the folksier, more reflective output of Lucky Town from the relatively generic love songs of Human Touch. His first new material since the E Street Band disbanded was met with contrasting responses. The former was widely praised for its personal outlook, with songs exploring his life-post divorce (“Better Days”) and the birth of his son (“Living Proof”). However, in a 2012 poll the latter was voted fans’ least favourite Springsteen album, and The Boss himself has admitted that writing such happy songs wasn’t his forte. Nevertheless, both records still managed to peak at No. 2 and 3, respectively, in the U.S., while Human Touch’s title track remains one of his final few Top 20 hits.\n\n5. Guns N’ Roses, Use Your Illusion and Use Your Illusion II\n\nHaving conquered the world with the unashamedly sleazy glam rock of Appetite for Destruction, Guns N’ Roses subscribed to the bigger-is-better theory for its follow-up. Sunset Strip’s finest didn’t just drop two single discs on September 17, 1991—they also ensured that each one ran as close as possible to their maximum playing time. Indeed, fans who bought both Use Your Illusion volumes had a whopping 30 tracks to get through, with songs like “Estranged” and “November Rain” approaching the 10-minute mark. Despite spawning the bigger hit (“November Rain”), Vol.1 had to settle for second place on the Billboard 200 behind Vol.2, although both records eventually achieved sales of more than five million copies. In contrast to this prolific phase, it then took another 17 years for Axl Rose and co. to record another album of original material.\n\n4. Nelly, Suit and Sweat\n\nSt. Louis’s finest hip-hop export, Nelly, also achieved an impressive 1-2 on the U.S. album charts with Suit and Sweat in 2005. Featuring samples of New Romantics Spandau Ballet, doo-wop veterans The Del-Vikings and classic girl group LaBelle, not to mention a strangely pioneering country/hip-hop collaboration with Tim McGraw, the former record proved to be the unlikely victor. Indeed, even guest appearances from Missy Elliott and Christina Aguilera couldn’t save the latter more energetic and uptempo affair from finishing a distant second. However, the only No. 1 hit from the whole project (“Grillz”) came from Sweatsuit, a compilation of the two releases featuring four new tracks.\n\n3. Tom Waits, Blood Money and Alice\n\nForget the double whammy of Guns N’ Roses and Nelly, Tom Waits achieved a far trickier feat of reaching No. 32 and No. 33 in the same week with two brand new albums back in May 2002. And these were no ordinary albums either: Both were co-written with wife Kathleen Brennan specifically for stage productions by dramatist Robert Wilson. The suitably grim Blood Money provided the soundtrack to Woyzeck, the influential Georg Büchner play about a soldier driven to lunacy by various bizarre army experiments. While the equally macabre Alice—which first appeared in bootleg form thanks to some opportunistic car thieves —was penned for a brand-new tale based on Lewis Carroll’s Alice in Wonderland. The former charted higher, by the narrowest of margins, although both are considered his finest latter-day work.\n\n2. Boris, Urban Dance and Warpath and Asia\n\nJapanese sludge metal outfit Boris might not be the most familiar name on this list, but it would be impossible not to include them The experimental trio released two albums on the same day in 2006 (the second and third volumes of The Thing Which Overlooked Solomon) before going one better and dropping three on May 2, 2015. Renowned for their ridiculously long song structures—1996 debut Absolutego consists of just one 65-minute track—the band’s triple-pronged attack only features twelve numbers in total, but still clocks in well over the two-hour mark. Only two feature any vocals or drums (“Surrender,” “Endless”), with the rest of Urban Dance, Warpath and Asia serving up more of the instrumental drone music for which Atsuo, Wata and Takeshi are known."}, {"url": "https://stacker.com/music/ranking-beatles-solo-albums", "page_content": "Already one of history's greatest rock bands, The Beatles were even more than the sum of their parts. In the wake of the band's legendary 1960s run came a number of high-profile solo releases from each individual member. That includes Ringo, whose eponymous 1973 album peaked at #2 on the U.S. charts and yielded two #1 singles … with a little help from his friends, of course.\n\nWhat's no less striking than the substantial output of each respective Beatle is the evolution of their signature sounds and styles. From George Harrison's idiosyncratic slide guitar to John Lennon's raw candor, certain albums were nearly as groundbreaking as the group efforts that preceded them. Acclaimed releases such as \"All Things Must Pass\" and \"Plastic Ono Band\" also helped redefine the personas of their creators.\n\nThen there's Paul McCartney, or Macca, which is his English nickname, who arguably carried the torch of Beatles-style melodies into each of the subsequent decades. At the same time, he tirelessly explored an assortment of production styles and peripheral genres, including classical and electronic. As a solo artist or with Wings, Macca has released over 20 top 10 singles to date, putting his post-Beatles career in the same ranks as some of music's bestselling acts.\n\nStacker collected data from Best Ever Albums—which ranks albums according to their appearance and performance on 40,000 editorial and data-based charts like Rolling Stone, Pitchfork, and Billboard—on all solo albums from John Lennon, Paul McCartney, George Harrison, and Ringo Starr, and ranked them according to their Best Ever Albums score. Live albums and compilation albums were not included."}, {"url": "https://consequence.net/2021/02/alex-somers-debut-solo-albums-siblings/", "page_content": "Alex Somers, the multimedia artist known for his work with Jónsi of Sigur Ros, has announced not one, but two debut solo albums, Siblings and Siblings 2. In anticipation of the March 19th release date, Somers has also shared a pair of lead singles, “Deathbed” and “Sooner”.\n\nSomers is no stranger to the art of composition, having cut his teeth on projects like Riceboy Sleeps and Jónsi & Alex. He’s also put in a fair bit of work on film scores, including the well-received Honey Boy soundtrack. His solo double-debut has been a long time coming, with much of the work starting more than half a decade ago. As he explained in a statement,\n\n“I’ve carried this music for a long time — so long that it’s become two albums. I wrote most of it between 2014 and 2016, but I abandoned it at different stages, thinking nobody else would want to hear it…. I don’t know any artist who doesn’t struggle with creativity. But friends who heard it, especially Jónsi, encouraged me to finish it. I’m really excited about making music that’s more relevant to where I am now. But first, I’m really excited to finally let Siblings go.”\n\nBoth of the lead singles are atmospheric electronica, though as the titles suggest, they capture very different moods. “Deathbed” is dark and foreboding, while “Sooner” is built around lightly expectant pianos. They each come with a visualizer showing a young child in black-and-white, and you can check them out below.\n\nAdvertisement\n\nRelated Video\n\nSiblings and Siblings 2 are out March 19th via Krunk, and pre-orders are available here and here. Last year, Somers and Jónsi contributed to Trayer Tryon’s track “cul de sac”.\n\nSiblings Artwork:\n\nSiblings Tracklist:\n\n01. Weeping Willow\n\n02. Oh Willow I Die\n\n03. Deathbed\n\n04. Between Us\n\n05. Tell Star (for Joe Meek)\n\n06. Dim\n\n07. Oh No\n\n08. Kimblings\n\n09. Dreaming Boys\n\n10. Avalanche\n\n11. One\n\n12. Whirlpool\n\n13. Looking After\n\nSiblings 2 Artwork:\n\nSiblings2 Tracklist:\n\n01. Following After\n\n02. Blown\n\n03. Woven\n\n04. Locket\n\n05. Patterning\n\n06. Never Ending\n\n07. Window Way\n\n08. Flutter\n\n09. Kimblings 2\n\n10. Hiddenness\n\n11. Sooner\n\n12. Oella\n\n13. Atlas"}, {"url": "https://www.starsinsider.com/music/454267/artists-who-have-released-two-albums-in-the-same-year", "page_content": "For most artists, a typical album cycle is about two years. A studio-length album takes a lot of work, from creation to recording, sample clearances to shipping deadlines, and more. It can take months, even years, for an artist to get an album done. That’s why very few artists have ever attempted putting out two albums in the same year.\n\nIt's a feat that requires dedication and drive, and the reasons for attempting it could range from an apology for making fans wait so long since the last album, or a way to get out of a record label, or even just striking while the iron is hot.\n\nFans of Taylor Swift recently learned not to trust the singer when she says there’s “not a lot going on at the moment,” as that has been the preface to the releases of both of her surprise albums this year, the latest of which is called 'Evermore.'\n\nBut she's not alone. Click through to see which artists have released two or more albums in less than 12 months."}, {"url": "https://genius.com/artists/Niall-horan", "page_content": "About Niall Horan\n\nNiall James Horan (born September 13th, 1993) is an Irish singer-songwriter, musician, and founder of Modest! Golf Management company. He auditioned on The X Factor at 16 years of age as a solo act and he came to worldwide prominence when he and four other boys were joined together to form pop boy band One Direction, which became one of the biggest boy bands in the world. Since the band’s hiatus in 2015, Horan has released two solo albums, has collaborated with the likes of Maren Morris, Julia Michaels and Ashe and has created a track for animated comedy film Smallfoot.\n\nIn September 2016, it was revealed that Niall had signed a solo contract with Capitol Records.\n\nFollowing this news, Horan released his debut solo single “This Town”, becoming the first One Direction member to release solo music. “This Town” showcases his songwriting skills and vocals, as Horan strips everything down to him and his guitar. In support of the single, he also uploaded a one-take acoustic version of the single. The song peaked at No. 20 on the Billboard Hot 100 Chart on January 14th, 2017.\n\nIn May 2017, “Slow Hands”, a homage to Horan’s ‘70s and '80s classic rock influences, was released. This track peaked at No. 7 on the Billboard Hot 100 Chart on September 30th, 2017. Horan’s debut solo album Flicker was released on October 20th, 2017. It debuted on the Billboard 200 at #1, selling 152,000 copies in its first official week of sales.\n\nThree years later, Horan released his sophomore album Heartbreak Weather, which produced four singles: “Nice to Meet Ya”, “Put a Little Love on Me”, “No Judgement” and “Black and White”. The album debuted at the top of the Irish Albums Chart and UK Albums Chart. It also opened at number four on the US Billboard 200 with 59,000 album-equivalent units and 42,000 pure album sales. Niall held a show at Royal Albert Hall with Ashe for We Need Crew later that year."}, {"url": "https://abbasite.com/articles/the-agnetha-faltskog-solo-albums/", "page_content": "The world will always recognise Agnetha Fältskog primarily for her contributions as one of two amazing lead singers in ABBA. But her recording career started in 1967, and despite 17 years when she made no recordings at all, her solo albums actually out-number ABBA’s studio albums.\n\nShe was so in love\n\nAgnetha Fältskog became a recording artist in 1967, when she was only 17 years old. A prolific songwriter for many years even at that tender age, her début single featured one of her own songs, ‘Jag var så kär’ (“I Was So In Love”). The single shot to number one on the Swedish sales chart in early 1968, kicking off Agnetha’s recording career with a bang. Four years later, when ABBA recorded their first single in the spring of 1972, Agnetha had four albums and a slew of hit singles to her credit, all of them released on the Cupol label; for the first few years of ABBA’s career, Agnetha would remain signed to that label. Her fifth album – Elva kvinnor i ett hus (“Eleven Women In One House”), released in 1975 – was the only of her albums to consist only of tunes she had written herself (except for her Swedish-language version of ABBA’s ‘SOS’), and seemed to usher in a new phase in her career: the female singer/songwriter, firmly in control of her recorded output. However, by the time of the album’s release ABBA had exploded on the international scene, so instead Elva kvinnor i ett hus constituted Agnetha’s farewell to the Cupol label. After that she became a full-time Polar Music recording artist and the remainder of the decade was almost exclusively devoted to her work with ABBA.\n\nHer first release as a solo artist on the Polar label came towards the end of the ABBA era, in October 1981, and the album in question was no straightforward pop creation either. Agnetha had wanted to record something with her and Björn’s daughter, Linda, for a long time. In November 1980, mother and child finally entered Polar Music Studio in Stockholm, Sweden to record a collection of Swedish-language Christmas songs. Linda was seven years old at the time. The original intention was that the album should be rush-released in time for Christmas in 1980, but it was soon realised that the deadline wouldn’t be met. Therefore, Nu tändas tusen juleljus (“Now A Thousand Christmas Candles Are Being Lit”), as the album was entitled, wasn’t issued until October 1981. Upon release it reached number 6 on the Swedish album chart and has remained a consistent seller each Christmas since then.\n\nWrap your arms around her\n\nThe next time Agnetha had the opportunity to release an album under her own name was in May 1983. The previous year had seen the ABBA era grinding to a halt, with the group making what turned out to be their very last recordings. At the time, the intention was merely to take a break, so that Björn and Benny would have the time to collaborate with Tim Rice on writing and recording the musical Chess. In the meantime, Frida and Agnetha would concentrate on their solo careers. Frida had released her first English-language album, Something’s Going On, in 1982, and now it was Agnetha’s turn to make her début solo album for an international market.\n\nHer choice of producer was Mike Chapman, who’d enjoyed a highly successful career during the 1970s as songwriter and producer for the likes of The Sweet, Mud, Smokie and Suzi Quatro, and producer for acts such as Blondie and The Knack. After Agnetha had trawled through hundreds of demo tracks in late 1982, she and Chapman met up at Polar Music Studio in January 1983 to record the best of those songs. She also asked singer Tomas Ledin – a very popular artist in Sweden, who had been afforded a solo spot on ABBA’s 1979 tour – to write something for her album, the resulting track being the reggae-flavoured ‘Take Good Care Of Your Children’. Mike Chapman collaborated with Holly Knight on what ultimately became the title track of the album, the seductive ‘Wrap Your Arms Around Me’. However, the most popular song to emerge from the recording sessions was the jubilant, calypso-styled ‘The Heat Is On’. It was the first single from the album and reached number one on the Swedish chart. The track was indicative of Agnetha’s overall intention for the album. “We wanted good songs with strong melodies, a positive spirit. Not just tragic ballads about someone having left you, or that life is difficult,” she explained in an interview.\n\nWhen the Wrap Your Arms Around Me album was released it shot to number one on the Swedish album chart, becoming one of the biggest albums of 1983. In international terms, alongside Frida’s Something’s Going On, it is the most successful solo album ever released by an ABBA member, reaching quite respectable chart positions and selling a reported 1.2 million copies worldwide. Agnetha herself has said that it’s her favourite among her 1980s output. Another major single from the album was ‘Can’t Shake Loose’, written by Russ Ballard who’d penned the previous year’s Frida hit ‘I Know There’s Something Going On’. ‘Can’t Shake Loose’ gave Agnetha her biggest solo success in the United States, where it reached the Top 30.\n\nStewarded by Stewart\n\nThe period 1982–1986 was a highly prolific period for Agnetha as a recording artist, mirrored by the slew of bonus tracks included on the 2005 CD version of Wrap Your Arms Around Me. For example, her 1982 duet with Tomas Ledin on ‘Never Again’ was also recorded in a Spanish version, ‘Ya Nunca Más’, while the songs on her 1983 hit single ‘It’s So Nice To Be Rich’/’P&B’ – released shortly after Wrap Your Arms Around Me – were taken from the Swedish movie P&B.\n\nAgnetha’s final album for Polar Music, Eyes Of A Woman, originally released in 1985, was also re-released with bonus tracks in 2005. Recorded in Stockholm in the autumn of 1984, with Eric Stewart of 10cc in the producer’s chair, the album project is notable for producing the last two Agnetha Fältskog compositions to be made public for almost three decades. One of them, ‘You’re There’, was not included on the album, but used for a single B-side (it is one of the bonus tracks on the Eyes Of A Woman CD). However, the second tune, ‘I Won’t Let You Go’, was not only included on the album but was also released as the incredibly catchy first single from the project. For Agnetha, though, this artistic triumph came at a price, as she found that it had become a battle for her to write songs. “I was struggling alone with ’I Won’t Let You Go’ for the whole of last summer,” she told a reporter. “It’s only a matter of hard work, no glamour at all.” The pressure she placed on herself to come up with high-quality tunes probably explains why she gave up songwriting altogether soon afterwards.\n\nThe way she is\n\nThe Eyes Of A Woman album was released in March 1985, reaching number two on the Swedish album chart and achieving respectable positions on other European charts. The album contained two tracks written by Eric Stewart, and also a contribution from Justin Hayward of The Moody Blues. The second major single release from the album, ‘One Way Love’, had been written by Jeff Lynne of Electric Light Orchestra. However, the next time Agnetha achieved a significant single hit in her home country was in 1986, when she teamed up with singer Ola Håkansson for the duet single ‘The Way You Are’ / ‘Fly Like The Eagle’. Both sides of this single are bonus features on the Eyes Of A Woman CD.\n\nIn 1987, Agnetha signed with Warner Music and released two more solo albums, the first of which was a children’s album with her son Christian, entitled Kom följ med i vår karusell (“Come Join Us In Our Carousel”). That was followed by the international pop LP I Stand Alone, recorded in Los Angeles and produced by former Chicago member Peter Cetera, entering the Swedish charts at number one. But after that, Agnetha’s motivation at remaining in the music business sank drastically. She had been a recording artist for 20 years and had barely stopped to take a stock of her life after ABBA’s final recordings. As she admitted recently, “I was so tired … and just wanted to be calm and be with my children.” It would be 17 years before she released another album. My Colouring Book, issued in 2004, featured a selection of covers of favourite songs, most of them from the 1960s. However, all soon went quiet again and most people, including Agnetha herself, concluded that this was probably her final album.\n\nBack on our radios\n\nBut Agnetha also likes saying that she’s the kind of person that never closes any doors, and she did indeed prove true to her word when she was approached by the team of songwriter/producer Jörgen Elofsson, who’d written hits for artists such as Britney Spears, Westlife and Kelly Clarkson, and arranger/producer Peter Nordahl. Presented with a handful of songs that Elofsson and Nordahl thought might suit her and which might constitute the first step towards a new album, her reaction was instant and positive. “I just couldn’t say no,” she recalled. “I really loved the songs from the beginning.” The team were soon ensconced in the recording studio, working out a brand new album, which even featured a newly written tune from Agnetha, ‘I Keep Them On The Floor Beside My Bed’ (with lyrics by Jörgen Elofsson). Released by Universal Music in May 2013, A has become Agnetha’s most successful solo album, featuring in the higher regions of the charts in many countries.\n\nWhether this success will be followed by further albums remains to be seen. But at the very least one more chapter has been written in the story of Agnetha’s solo career, enabling us to yet again enjoy her voice in a context quite different from ABBA: Agnetha Fältskog on her own."}]}