{"Thomas Harriot was an astronomer.": [{"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz Faces of Science\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://encyclopediavirginia.org/entries/hariot-thomas-ca-1560-1621/", "page_content": "Oxford and Durham House Hariot enters the historical record with his matriculation at Oxford in 1577 at the age of seventeen. His tentative date of birth is based on this information. Notes written at the time indicate that he was raised in Oxfordshire and his father was a commoner. Nothing else for certain is known about his early life. Hariot arrived at Oxford with exceptional talents in mathematics and the sciences, but at a time when these subjects were not particularly valued. This was beginning to change, however, as English adventurers began to recognize the connection between mathematics and the navigational arts necessary to further the nation’s developing interests in colonization, piracy, privateering, and trade, especially in North America. At Oxford, Hariot met Richard Hakluyt (the younger), who went on to edit the influential Principall Navigations of the English Nation (1589), a polemic on behalf of future English colonization disguised as a history of past English successes. Hariot also probably knew Thomas Allen, an Oxford faculty member who collected the latest manuscripts, books, and instruments connected with mathematics and astronomy. After receiving a BA from Oxford in 1580, Hariot relocated to London, where his interest in applying mathematics and astronomy to questions of navigation brought him to the attention of Walter Raleigh. A favorite of Queen Elizabeth I, Raleigh had obtained permission to establish English colonies in North America. By 1583, Hariot was serving Raleigh at his London residence, Durham House, by focusing on open-sea navigation. The Portuguese and Spanish understood how to cross the Atlantic Ocean to the New World, but the English, with notable exceptions such as Sir Francis Drake, did not and were forced to hug the coasts. Before he could teach it, Hariot needed to master the subject himself, and he set about collecting, building, and learning to use standard navigational instruments, including the astrolabe, cross staff, and sextant. He studied the mathematics required to determine one’s position in the open ocean, collected the best sea charts and maps, and learned the basics of astronomy necessary to navigate by the stars, moon, and sun. He then began lecturing to Raleigh’s sea captains on these subjects in his room at Durham House and collected the knowledge in the now-lost Arcticon. Raleigh was planning to attempt a colony on the mid-Atlantic coast of North America and in 1584 sent a reconnaissance voyage that landed on Roanoke Island. There, commanders Philip Amadas and Arthur Barlowe met and returned to England with two Virginia Indians, Manteo and Wanchese. Recognizing that communication with the Indians would be crucial for a successful colony, Hariot worked with the two men and learned to speak their form of the Algonquian language. Hariot even developed his own phonetic alphabet, which allowed him to record the sounds of Algonquian words and to create a now-lost English-Algonquian dictionary. Hariot’s work in this area made him one of the most advanced linguists of the day and recommended him as a member of Raleigh’s Roanoke expedition in 1585.\n\nRoanoke and A briefe and true report A briefe and true report of the new found land of Virginia The Roanoke colonists were mostly military men, the most prominent exceptions being Hariot and the artist John White, who had served as expedition artist on one of Martin Frobisher’s voyages to Greenland. The colonists arrived at Roanoke late in June 1585, but one of their ships ran aground and they lost much of their provisions. After the departure in August of the colony’s two commanders, Sir Richard Grenville and Thomas Cavendish, Ralph Lane assumed governorship, and his relations with the local Indians were friendly at first. The situation deteriorated, however, as the Englishmen failed to find reliable sources of food, and when Sir Francis Drake arrived in June 1586, Lane decided to return the surviving colonists to England. The year had not been a waste for Hariot, though. With the help of Manteo and Wanchese, and in the company of John White, he had explored the area surrounding Roanoke and, with White, joined a party that sailed north to the Chesapeake Bay and up the Elizabeth and Nansemond rivers, even encountering the Chesapeake Indians at their principal town of Skicoac. He and White used these travels to collaborate on the first accurate maps of the east coast of North America. Using angle-measuring tools to establish latitude and longitude, Hariot mapped out triangle-shaped areas and either recorded these angles in a notebook for later use or, while in the field, sketched these triangles directly onto a sheet of paper attached to a plane table. White, an accomplished painter and illustrator, then finished the maps. While some of the White-Hariot maps remained in manuscript form and did not receive wide circulation, others—such as the small map of Roanoke Island and the large map of the entire Outer Banks region—appeared in Theodor de Bry’s illustrated edition of Hariot’s A briefe and true report of the new found land of Virginia, becoming models for their time of accurate cartography in the New World. A briefe and true report was, perhaps, Hariot’s most important contribution to England’s colonization efforts. First published in 1588, it appeared again the next year as part of Richard Hakluyt (the younger’s) Principall Navigations. Hakluyt then convinced de Bry to publish a third version as the initial volume in his America series. This last includes etchings of the White-Hariot maps as well as etchings based on White’s watercolor portraits of Virginia Indians and scenes of Indian life. Published in English, French, German, and Latin, the de Bry version enjoyed a wide European audience. While the Report is sometimes considered scientific, it is more accurately viewed as commercial discourse. Throughout, Hariot argues four related points. First, the 1585 colony failed because many members of the colony were unprepared for the rigors of colonization. Although these men slandered the colony and its leaders upon arriving home, in Hariot’s view Raleigh’s colonization program should be allowed to continue. Second, the Roanokes and other Indian tribes are not to be feared by the English, who possess superior technology and culture. Third, the land in Virginia is abundant enough to provide future colonists with adequate food and building materials. And fourth, Virginia offers a less expensive source for a wide range of trade goods, including shipping supplies, dyes for the cloth industry, and wine.\n\nLater Years In 1595, Hariot received land from Henry Percy, ninth earl of Northumberland, to allow him to continue his scientific and mathematical work. Percy was imprisoned in 1605 for his connection to the Gunpowder Plot, an attempt on the life of King James I on behalf of greater freedom for English Catholics. Hariot’s connection to Percy also landed him in prison, but only briefly. (Percy’s younger brother George was one of the original Jamestown colonists.) Sir Walter Raleigh also ran afoul of the king and was beheaded in 1618. In the meantime, Hariot pursued his interest in astronomy. His unpublished notes on the appearance of Halley’s Comet in 1607 were later used to accurately calculate its orbit. In 1609, he used a telescope of his own making to sketch the moon—four months before the Italian astronomer Galileo Galilei more famously accomplished the same feat. In 1610, he was the first to observe sunspots, and in 1611, he produced the first map of the moon. Hariot died in London on July 2, 1621, of cancer of the nose, probably caused by heavy tobacco use. A posthumous work, Artis Analyticae Praxis, published in 1631, helped to establish the English school of algebra."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://www.nature.com/articles/d41586-019-01174-x", "page_content": "A portrait believed to be of Thomas Harriot, painted around 1602.Credit: The Picture Art Collection/Alamy\n\nThomas Harriot: A Life in Science Robyn Arianrhod Oxford University Press (2019)\n\nThe phrase ‘publish or perish’ came into use in the twentieth century to encapsulate academic pressures. It is also a lesson from the life of Thomas Harriot, who lived when there were no academic journals, and who never taught at a university.\n\nA contemporary of William Shakespeare, Harriot was an English mathematician, astronomer and natural philosopher whose original work bears comparison with that of Johannes Kepler and Galileo Galilei. Yet, outside the enthusiastic circle of historians of early modern science who call themselves Harrioteers, his name is almost unknown: he never published his mathematical work. In Thomas Harriot: A Life in Science, mathematician Robyn Arianrhod sets out to explain how historians have nevertheless been able to place him, almost four centuries after his death in 1621, among the founders of modern science.\n\nHarriot is elusive. The earliest known document concerning him lists him as a “plebeian” scholar registering to study at the University of Oxford in 1577. He never married and left no children. By 1583, he was employed by Walter Raleigh, naval commander, explorer and favourite of Queen Elizabeth I, to teach astronomy and navigation — a field he greatly improved — to sea captains. He was celebrated in his lifetime by the writer Gabriel Harvey as among the “profound mathematicians”, alongside Thomas Digges and John Dee. Afterwards, he was largely forgotten.\n\nHe has a higher profile in the United States, thanks to the one work he did publish. A Brief and True Report of the New Found Land of Virginia is a first-person account of a 1585–86 voyage sent by Raleigh to survey what is now part of North Carolina. The party landed on Roanoke Island and surveyed it and the nearby mainland; almost all its members returned to England in June 1586. Harriot was “employed in discovering”. His report, published in 1588, includes the first detailed English description of the language and customs of the Algonquian people, and of the region’s natural resources and climate. Arianrhod shows that his interest in local people was far from typical: he learnt their language, admired how they interplanted beans, squashes and maize (corn), and respected their religion. Meanwhile, the military expedition leaders fatally soured relations by overreacting to perceived wrongdoing and making unreasonable demands.\n\nPrevious biographers — the US authors Henry Stevens in 1900 and John Shirley in 1983 — were prompted by the Brief and True Report. Neither fully addressed Harriot’s scientific contributions, as Arianrhod tries to do. Harriot’s will mentioned a trunk full of mathematical papers. A few were circulated and partly published by friends such as the mathematician Walter Warner after his death, but what became of the collection was unknown until 1784, when it turned up in some disorder at Petworth House, home to heirs of the ninth Earl of Northumberland, Harriot’s patron after Raleigh. Only since the mid-twentieth century have scholars made sense of the thousands of manuscript sheets.\n\nWhat they reveal is astonishing. To mention only a portion of Harriot’s work, he discovered Snell’s law of refraction two decades before mathematician Willebrord Snell; formulated laws of motion and falling bodies independently of Galileo and decades before Isaac Newton; produced the first drawing of the Moon through a telescope and made important observations of sunspots, again independently of Galileo; played with binary arithmetic nearly a century before Gottfried Wilhelm Leibniz; and was the first to develop fully symbolic algebra. There are well-grounded suspicions that René Descartes saw some of Harriot’s papers before publishing The Geometry in 1637.\n\nWhere Harriot falls down, say some scholars, is that he did not draw his observations into coherent theory. It’s possible he just never got round to it. Harriot spent his adult life in the households of Raleigh and Northumberland. They paid him generously, and all appearances suggest that he was a friend rather than a servant. However, both were players on the volatile political scene, and malicious rumours of atheism and necromancy did the rounds. Soon after James I succeeded Elizabeth I in 1603, Raleigh was convicted of treason, and Northumberland of lesser charges when a cousin was involved in the Gunpowder Plot to murder the king. Both were imprisoned in the Tower of London; Raleigh was executed in 1618.\n\nHarriot spent an anxious few weeks in prison because of his association with Northumberland; he might have felt the need to keep his head down over the years. He died aged about 60 from cancer of the nose, possibly caused by his enthusiasm for tobacco after his American adventure.\n\nThe lack of finished work makes evaluating his contribution complex. Arianrhod does not hesitate to call him a genius, and the evidence she presents is impressive. Yet she fully explores his rightful position in the pantheon only in a page-long endnote; I think this shortchanges the “general reader” she seeks to enlighten. Some might find her technical passages challenging, although they are necessary to her argument. And it is irksome to see diagrams relating to Harriot’s navigational work in an appendix, rather than with the text they illustrate.\n\nHas Arianrhod, as she intended, “put a human face to scientific inquiry in the Elizabethan and Jacobean worlds”? She has revealed a scientific mind, but the face is more elusive: the one supposed portrait of Harriot is of unknown provenance and, because of a discrepancy in dates, some historians doubt it is him.\n\nThis black-clad, driven, sceptical man, “contented with a private life for the love of learning” as he wrote to his captors, still declines wholly to step into the light."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-97707-2_1", "page_content": "Rumors have been circulated since the mid-16th century that the telescope was not invented in early 17th century Holland but in Elizabethan England, some half a century before. A telescopic device appears to have been constructed by the noted English polymath Leonard Digges (1515–c. 1559) as early as the first half of the 1500s and later reiterated by his son, Thomas Digges, in a communication dated to 1571:\n\n[H]is divine mind aided with this science of Geometrical mensurations, found out the quantities, distances, courses, and strange intricate miraculous motions of these resplendent heavenly Globes of Sun, Moon , Planets and Stares fixed, leaving the rules and precepts thereof to his posterity. Archimedes also (as some suppose) with a glass framed by revolution of a section Parabolicall, fired the Roman navy in the sea coming to the siege of Syracuse. But to leave these celestial causes and things done of antiquity long ago, my father by his continual painful [painstaking] practices, assisted with demonstrations Mathematical, was able, and sundry times hath by proportional Glasses duly situate in convenient angles, not only discovered things far off, read letters, numbered pieces of money with the very coin and superscription thereof, cast by some of his friends of purpose upon downs in open fields, but also seven miles off declared what hath been done at that instant in private places.\n\nThis intriguing tract, which appears on page 5 of the preface to his posthumously published book Pantometria (1571), provides the modern reader with an intriguing glimpse of a telescopic device made with lenses and mirrors. In a lively debate that took place in March 1993 organized by the Scientific Instrument Society (SIS) and held at Burlington House, London, Colin Ronan spoke in favor of the existence of such an early telescope, while the late Professor Gerard Turner, based at the Museum for the History of Science, Oxford, UK, provided a robust counterpoint. During the debate, a replica of the alleged Digges telescope was presented to all in attendance.\n\nThe device consisted of a simple biconvex objective lens, the light of which was incident to a focusing mirror that relayed the image to the eye. Mounted inside a wooden tube, the device magnified 11 times and did produce an enlarged image, but with a very narrow field of view, and was additionally plagued by chromatic aberration – a consequence of using a singlet lens as an objective. There is, as yet, no consensus on whether such a telescope ever saw the light of day.\n\nHarriot and his assistant, Christopher Tooke, set up a telescope magnifying 6 times on the grounds of Syon Park, and on the clement evening of July 26, 1609, turned it on a five-day-old crescent Moon, immediately sketching what he saw. Various lunar ‘seas’ are included in these lunar portraits, including the Mare Crisium, Tranquilitatis and Fecunditatis, as well as some rugged lunar features situated along the terminator, which modern scholars have identified as Theophilus and Cyrillus. Curiously, this first sketch does not record any craters, although 6× is certainly large enough to resolve several of the more prominent ones.\n\nOut of sheer curiosity, in a separate investigation, this author used a modern spyglass with an uncoated, 1-inch diameter object glass, also having a magnification of 6×, in the wee small hours (01:30 h UT) of January 1, 2016, to record observations of the last quarter Moon and Jupiter, as they cleared the treetops in the eastern sky. Like Harriot’s telescope, the spyglass gave an erect, correctly orientated image but enjoyed a much larger field of view (approximately 4 angular degrees). Nonetheless, this author could confirm that many lunar craters can indeed be observed with a steady hand, as well as clearly showing various maria . Turning to Jupiter, then just a few degrees above the Moon, the telescope could clearly reveal four Galilean satellites all to one side of the planet (Fig. 1.3).\n\nFig. 1.3 The author’s 6× achromatic spyglass used to corroborate Harriot’s observations. (Image by the author) Full size image\n\nIt will come as somewhat of a surprise to the contemporary reader not acquainted with a Galilean telescope that, despite its very low magnifying power, its field of view was very restrictive – typically just over half the diameter of the full Moon! As a result, Harriot could not have seen the entire countenance of the lunar crescent even at the low magnifications his telescopes delivered. Incredibly, though, Harriot made many more drawings of the Moon, some of which display finer cartographic details than Galileo’s later drawings, but they were frustratingly left undated. When we take into account the radically different personalities of both Galileo (explored in the next chapter) and Harriot, we can see that both men had entirely different modi operandi. Harriot, having spent time in Virginia, was a draughtsman and well acquainted with mapmaking. His methods were slow and methodical. Harriot was categorically not seeking fame and fortune in the same way that Galileo was, and, according to Dr. Chapman , because Harriot had two high profile friends on ‘death row’ in the Tower, he had little desire to make himself conspicuous.\n\nBy the closing weeks of 1609, Harriot dispatched Tooke, his able technician, to the residence of Sir William Lower at Trefenti, Carmarthenshire, South Wales, instructing him to fashion several other Galilean cylinders in order that he and his philosophical chums, a one Mr. Vaughan and Mr. Protheroe (and possibly a few others), could begin their own telescopic investigations of the Moon and other celestial bodies. The surviving exchanges between Harrriot and the ‘Carmartenshire philosophers,’ clearly unveil their avowed acceptance of the Copernican system, as well as Kepler’s elliptical theory of planetary orbits. This meeting may well be first known record of an astronomical society, the members of which were to confirm Galileo’s monumental telescopic work by observing the large Jovian satellites and the erstwhile “invisible” stars in the Pleiades.\n\nOver the next few years, Harriot was to complete his now famous Moon maps, as well as embarking on a detailed study of the Sun. His method involved observing the intensely bright solar disk, when it was near the horizon and veiled behind mist and thin cloud (the reader should, under no circumstances, attempt such an observation!). Harriot is credited as the co-discover of sunspots, recording them at or about the same time as Galileo, and possibly earlier than Christopher Scheiner (1573–1650) and Johannes Fabricius (1587–1616), who themselves yielded additional evidence against the time-honored cosmology of Ptolemy (Fig. 1.4).\n\nFig. 1.4 Christoph Scheiner (1573–1650), the Jesuit priest and astronomer, with his telescope shown on his left. (Image courtesy of Wiki Commons. https://en.wikipedia.org/wiki/Christoph_Scheiner#/media/File:Scheiner_christoph.gif) Full size image\n\nOver the next 2 years, Harriot was to carry out some 450 observations of the Sun and its dark spots, never once claiming their discovery for himself, studying how they moved across its otherwise brilliant face, breaking up and sometimes even disappearing. Indeed, modern scholars were able to establish a solar rotation period of 27.154 days from Harriot’s drawings – uncannily close to the modern accepted value of 27.2753 days. This affirms the accuracy and attention to detail so central to Harriot’s methodology.\n\nAccording to Dr. Chapman , Tooke may have made improvements to the basic Dutch trunke, and referring to a study conducted by the distinguished historian of astronomy and cosmology, the late Professor John North (1934–2008) identified no less than six telescopes associated with Harriot and the ‘Trefentine’ philosophers, which ranged in power from 6× up to 50×. Tooke is likely to be among the first bona fide telescope makers in Britain, a tradition that was to be continued over the following centuries.\n\nAlthough Harriot embraced the Christian message from his youth, even writing the Lord’s Prayer in the Algonquin language , some scholars have suggested that he may have experienced a brief religious hiatus as he approached middle age. Doubtless, the revolution heralded by the application of the telescope to the celestial realm had raised new questions in the minds of his learned contemporaries. Why were the astronomical bodies puckered and imperfect? How did God create everything from nothing? Was His divine hand needed at every stage, from the formation of atoms to the completion of worlds? Was the allegory of the universe even attributed to a personal God or was it merely blind chance? These questions weighed heavily in the mind of Thomas Harriot.\n\nDr. Chapman acknowledges that nothing firm can be adduced from Harriot’s surviving notes and correspondences, but he is inclined to the view that the world’s first telescopic astronomer re-embraced his Christian heritage in the final decade of his life, as evidenced by his 1615 correspondence with the king’s physician, Sir Theodore Mayerne, who assured Harriot of the certainty of the existence of one all-powerful God. From his days in Virginia, Harriot had taken to ‘drinking’ tobacco smoke, as his contemporaries had referred to it. Earlier physicians had hailed the new wonder drug as an effective remedy to counter the “dangerous moist humors of the body.” But three decades of heavy inhalation of tobacco smoke was to take its toll on Harriot’s health, and he developed a cancerous lesion on his nose.\n\nBecause many tumors of this sort have a tendency to metastasize, spreading to other organs of the body via the lymph nodes, Harriot was arguably history’s first clearly attested tobacco-induced cancer victim, dying on July 2, 1621. He was laid to rest at his local Parish Church of St. Christopher-le-Stocks, located in the heart of the city of London. And while the church was razed to the ground by the Great Fire of 1666 and another resurrected on the original site by none other than Sir Christopher Wren (1632–1723), this too was eventually demolished in 1781 in order to make way for a grand new building that would became the headquarters of the Bank of England. In the 1970s, however, the gravestone dedicated to Thomas Harriot was recovered, and, in his honor, a new plaque carrying his gravestone inscription was unveiled inside the bank.\n\nIt is difficult to crystallize the legacy of Thomas Harriot, being so far removed from him in time, but these words come to mind; learned, diligent, enterprising, kind, loyal, uncompetitive, humble and God-fearing. Despite not marrying and raising children, he lived a fulfilled life without a bad word to say about his fellow men, rendered all the more remarkable owing to his great wealth and lifelong connection with the rich and powerful."}, {"url": "https://www.wikiwand.com/en/Sir_Thomas_Herriott", "page_content": "Thomas Harriot ( ;[2] c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques,[3] working closely with John White to create advanced maps for navigation.[3] While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it,[4] namely only The Briefe and True Report of the New Found Land of Virginia (1588).[3] This book includes descriptions of English settlements and financial issues in Virginia at the time.[3] He is sometimes credited with the introduction of the potato to the British Isles.[5] Harriot invented binary notation and arithmetic several decades before Gottfried Wilhelm Leibniz, but this remained unknown until the 1920's.[6] He was also the first person to make a drawing of the Moon through a telescope, on 5 August 1609, about four months before Galileo Galilei.[7]\n\nThomas Harriot observing the Moon through his telescope from the roof of Syon House.\n\nEnglish astronomer, mathematician, ethnographer and translator\n\nQuick facts: Thomas Harriot, Born, Died, Nationality, Alma... ▼\n\nAfter graduating from St Mary Hall, Oxford, Harriot traveled to the Americas, accompanying the 1585 expedition to Roanoke island funded by Sir Walter Raleigh and led by Sir Ralph Lane. He learned the Carolina Algonquian language from two Native Americans, Wanchese and Manteo, and could translate it, making him a vital member of the expedition. On his return to England, he worked for the 9th Earl of Northumberland."}, {"url": "https://thatsmaths.com/2015/08/27/thomas-harriot-mathematician-astronomer-and-navigator/", "page_content": "Thomas Harriot: Mathematician, Astronomer and Navigator\n\nSir Walter Raleigh, adventurer, explorer and privateer, was among most colourful characters of Tudor times. He acquired extensive estates in Waterford and Cork, including Molana Abbey near Youghal, which he gave to his friend and advisor, the brilliant mathematician and astronomer Thomas Harriot.\n\nRaleigh needed an excellent navigator on his transatlantic voyages, and he brought along Harriot, who had earlier been his mathematics tutor. Harriot had written a text, Archicon, on navigation after graduating from Oxford.\n\nHarriot accompanied Raleigh on his expedition to Virginia in 1585, and carried out surveys and studies of local Indian languages while there. In preparation for the voyage, Rayleigh asked him about the most efficient means of stacking cannon balls on a ship deck. Harriot came up with the solution known to all grocers used to stacking oranges. He later corresponded with famed astronomer Johannes Kepler, who conjectured that the usual packing method was the most efficient. It was some four centuries before a rigorous proof of Kepler’s conjecture was produced in 1998.\n\nHarriot’s main contribution to navigation was in finding a mathematical formula for drawing lines of latitude on a chart so that a route with constant compass bearing would be a straignt line on the map. The resulting map is the projection discovered earlier by the Flemish cartographer Gerardus Mercator.\n\nHarriot also discovered an important result for geometry on the sphere. The sum of the angles of a spherical triangle is always larger than two right angles. The amount E by which it exceeds 180° is called the spherical excess. The 16th century French mathematician Albert Girard showed that this excess determines the surface area of the triangle: the radius squared by the excees gives the area (in symbols, A=R²E). This result was discovered earlier, but not published, by Harriot.\n\nIn 1607 Harriot observed and sketched what was later called Halley’s Comet, using an early telescope. In addition, he is credited with producing the first map of the Moon. His only published work is a text in algebra, which includes a treatment of negative and complex roots of polynomial equations. In his writing on algebra, Harriot introduced several novel symbols, some of which, like “<” and “>” for ‘less than’ and ‘greater than’, are still in use today.\n\nIn his report on the Virginia expedition, Harriot described how Indians dried and shredded tobacco leaves and smoked them in pipes. He recommended smoking as medicinally beneficial, ideal for ‘purging superfluous phlegm and other gross humours’. His own end came as a result of a cancerous tumour of the nose, probably resulting from his use of tobacco."}, {"url": "https://pantheon.world/profile/person/Thomas_Harriot/", "page_content": "Thomas Harriot\n\nThomas Harriot (; c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques, working closely with John White to create advanced maps for navigation. While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it, namely only The Briefe and True Report of the New Found Land of Virginia (1588) . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Thomas Harriot has received more than 295,590 page views. His biography is available in 33 different languages on Wikipedia . Thomas Harriot is the 97th most popular mathematician (up from 102nd in 2019), the 448th most popular biography from United Kingdom (up from 482nd in 2019) and the 6th most popular British Mathematician.\n\nThomas Harriot is most famous for his contributions to the study of optics and astronomy."}, {"url": "https://theconversation.com/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on-163167", "page_content": "Four hundred years ago, on July 2 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8,000 pages of scientific research, but it is only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of famous pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea: he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo were not the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries: the law of refraction, and why the rainbow has its magical colours and its unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens or why your leg looks wobbly when you dip it in a swimming pool.\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right: Ibn Sahl is a notable pioneer whose geometrical diagram of light focussed by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did: his derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was the controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters and sailing the high seas as Raleigh’s navigational advisor.\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s USA before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted\n\nto live a private life for the love of learning that I might study freely.\n\nConclusion\n\nIn the late 1590s Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot did not need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They are now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no-one knows much about him as a person – not even his birthday. Nevertheless, he has fascinated scholars for the past half century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour."}, {"url": "https://link.springer.com/article/10.1007/s00283-019-09904-9", "page_content": "Thomas Harriot (1560-1621). Who was he? From somewhere deep in our granular memories of historical figures we recall that he might have been a scientist, or a mathematician, or perhaps a philosopher. It turns out he was all three and more. Add astronomer, navigational researcher, cartographer, linguist, and explorer to his CV and you have a strikingly notable figure. Add mapping the moon’s surface, telescopic studies of sunspots, calculating the periods of revolution of Jupiter’s moons, and discovering the laws of free fall to his lifetime achievements, and you have a picture of a major biography. He corresponded with Johannes Kepler, discovered Snell’s law before Willebrord Snellius (Snell) did, and discovered properties of the prism and the nature of the rainbow long before Newton was born. So why do we know so little about him?\n\nHarriot never published his work, except for one 48-page booklet, A Briefe and True Report of the New Found Land of Virginia.Footnote 1 He worked on a large number of manuscripts that were never published. Publishing was just not his thing. Rather, he followed his intellectual passions wherever they led, with a humble indifference to deserved credit. Perhaps that is why his contributions to mathematics, physics, and astronomy were so forgotten, until now with Robyn Arianrhod’s publication of Thomas Harriot: A Life in Science. On April 9, 1585, a three-masted sailing ship named the Tiger left the safety of Plymouth on the southwest coast of England and headed for the open ocean.\n\nRight there, from that first sentence, and on through the next 265 pages, the extraordinary portrait of Thomas Harriot expands like the vast unexplored sea between England and Roanoke Island to take us on a journey through an adventurous life of geographic and scientific exploration.\n\nWhen Harriot was just a boy, English explorers were searching the northernmost parts of North America for quick routes from England to the riches of silks and spices of Asia. Then, in 1580, Francis Drake circumnavigated the globe, plundering some Spanish treasure ships en route. But North America was still just a watering hole and trading stop, and so Sir Walter Raleigh planned other quests. He sent a fleet of seven ships under the command of his cousin Sir Richard Grenville to America, expecting to establish a base, form a colony, and found an English settlement. Only four ships made it to that long, thin series of islands we now call the Outer Banks of North Carolina. Harriot, at the age of twenty-five, along with 160 passengers and crew, was on the overcrowded Tiger. He was often up on deck acting as navigational consultant, taking astronomical readings, and experimenting with ways to improve his instruments for navigating. When he was not required for these activities, he used the time to observe the ship itself, recording the technical terms for its various parts, noting details of ropes and rigging, mulling over the ideal ratio between a ship’s dimensions and the height of its masts, and generally taking note of the day-to-day work of the crew.\n\nNavigating across vast expanses of ocean was often a trial-and-error enterprise confounded by unexpected winds and storms. In 1569, the Flemish cartographer Gerardus Mercator created a conformal map projection of the world that later became the standard for nautical navigation. The map locally preserved angles with the meridians while distorting the sizes of objects as latitudes increased from the equator toward the poles. Mercator was not the first to project the curved world onto a plane. Fourteen centuries earlier, the Greco-Roman mathematician astronomer Ptolemy had done something similar, but not with a world that circled the entire spherical globe. The so-called Mercator projection was a cylindrical projection: wrap the globe in a cylinder meeting at the equator, and from that globe’s center, project the points of the surface of the globe onto the wrapped cylinder. Then uncurl the cylinder. Once it is lying flat, you have a Mercator map of the globe. That idea solved a significant problem. If a ship kept its bearing as if it were to sail straight according to a compass, let’s say making an angle α northeast with respect to the lines of longitude, the ship would actually follow a spiral path on its course toward the North Pole without ever getting there. To help sailors adjust navigation, Mercator created a corrective chart that represented the spiral path as the straight line it intuitively seemed to be, using straight lines on the flat map to represent longitudes that are not evenly spaced; rather, they increase in spacing as one moves northward. It seemed a strange spacing to be used for navigational purposes, a spacing that, it appeared, no one other than Mercator understood mathematically, until Harriot figured it out using clever tools of trigonometry to provide the first full mathematical solution. Later, he was the first to mathematically find the length of the spiral curve itself, which is today called a loxodrome, or rhumb line. It was the first ever calculation of the exact length of a curve.\n\nAlmost nothing is known about Harriot’s early life. Even the exact date of his birth is not recorded where it should be. Records show that he was a commoner, so he must have been quite intelligent as a young lad to be admitted to Oxford at seventeen years of age and attain a degree in 1580. Yet Thomas Harriot is a biography of an enigmatic character whose mind was filled with both intellectual and geographical adventure when he arrived in London with an Oxford bachelor of arts degree and little else… and soon attracted a wealthy patron: the tall and dashing Walter Raleigh. Thanks to Robyn Arianrhod and her careful research, we now have a brilliant picture of the man brought to life through his accomplishments, from the moment he sailed to the Outer Banks and spent time on Roanoke Island creating a thirty-six-letter phonetic alphabet to record the native Algonquian language.\n\nThe one part of Harriot’s mathematical work for which he is best known is his work on algebra, in which he did fundamental research on the theory of equations and solutions of equations having negative or imaginary roots. For this he concocted new symbols, and used them to their full advantage. Arianrhod tells us: He was arguably the best algebraist of the early seventeenth century, in the decades between Viète’s death in 1603 and the rise of Descartes in the late 1630s.\n\nHarriot was living at a time when mathematical symbols were beginning to find their way into conventional mathematics. He was just twelve years old when Rafael Bombelli’s 1572 L’Algebra was published with symbols representing exponents indexed by numerals. Five years later he was admitted to Oxford. Even by that time, Simon Stevin’s L’Arithmétique, with its sophisticated use of symbols, had not yet appeared.\n\nAs late as the early seventeenth century, mathematics writing in Europe was still essentially rhetorical, although in some countries, certain frequently used words had already been abbreviated. Later, those abbreviated words became further abbreviated, and by the 1630s, through the writings of François Viète, Simon Stevin, and eventually Harriot and Descartes, the abbreviations became so compacted that all the once-apparent connections to their origins became lost forever.\n\nToday we have the symbolic expression x2 − 2x + 1, which draws the mind from the special circumstance to the general form ax2 + bx + c, so we can conceive of x2 − 2x + 1 as merely a representative of the species. In Harriot’s time, some writers would still write what we know to be (x + a)2 = x2 + 2ax + a2 as The square of the sum of the unknown quantity and a number equals the sum of the squares of the unknown and the number, augmented by twice the product of the unknown and the number.\n\nBut symbolic notation had already taken form in the writing of powers of a variable as repeated letters, so that, for instance, an would be written as a juxtaposition of n copies of the letter a. Just imagine what the mind had to transcend in order to process natural language with all its ambiguities while manipulating words in order to convince oneself of how true the equation is! As late as 1591, Viète would have written the polynomial x2 − 3x + 9 as A quad − 3 in A+9 plano. Harriot would have written that same polynomial as xx − 3x + 9. Like Viète, Harriot manipulated algebraic equations without the use of power indexing, which came only later. Until that point in time, mathematicians were interested in the zeros of polynomials—that is, in the numbers that would make the polynomial equal to zero.\n\nHarriot had the ingenious idea of first setting the polynomial equal to zero, thereby setting up an equation, a polynomial equation, and asking for the numbers that satisfy the equation, something we now do naturally. It was not just a grammatical difference. It opened a door to a whole new way of thinking about polynomials. Harriot saw that a polynomial could be built up from a product of its factors, just as a compound number could. For example, because x4 − 4x3 − 19x2 + 106x − 120 = 0 factors into linear polynomials as (x − 2)(x − 3)(x − 4)(x + 5), the polynomial can equal zero only for the values of x that make one of the factors equal to zero, namely 2, 3, 4, and –5.\n\nIt was a game-changer—the problem of finding zeros of polynomials quickly became the problem of factoring polynomials. It was a slight grammatical maneuvering that advanced the possibility that every polynomial equation has a root, possibly a real number or a complex number. Proving this fact generally with satisfactory rigor was beyond seventeenth-century means.\n\nSuch a general proof would have to wait almost two hundred years, when it would take on the general form that we now know as the fundamental theorem of algebra. Setting polynomials to zero gave mathematicians a sense of proper algebraic form. By putting all terms to the left side of an equation and leaving an isolated zero on the right, the form comes to the forefront, that is, the equation x2 + 3x + 2 = 0 falls into a category recognizably distinct from, say, 3x + 2 = 0, and the equation 5x3 + 2x2 + 3x + 2 = 0 falls into a third category. Algebra was not just about equations, but also about forms.\n\nAlgebra was just one of Harriot’s many interests and talents. On the pages of Thomas Harriot you get a mathematician with a probing mind who sees the world as his laboratory. When coming to refraction, for example, Harriot looked at the printed works of others and found errors. So he took his own measurements one day, then the next, then the next days for ten days. He would repeat his measurements for months and years before accepting them as true gauges of nature that were somewhat independent of atmospheric and geological variables. He was aware of the possibility of hidden variables and waited to have enough repetitions to be satisfied that his data were sufficiently accurate.\n\nHe immersed a staff in water and marked off the positions of the images as they appeared when viewed through the water. He was surely not the first to perform such an experiment; curious Babylonians must have done the same. Arianrhod’s book reads smoothly through the more technical arguments, so that the reader feels that everything is visual and easy. We might not know exactly how Harriot got his refraction data, but Arianrhod tells us that we can perform the experiment at home. “You can get the idea by immersing a straw in a flat-bottomed glass of water,” she tells us before giving the details of how to collect the data. “Harriot marked off these points carefully, and repeated the process as he changed the angle of the staff.” She illustrates this with a diagram (Figure A). Figure A The path of a light ray passing from air to water. (Redrawn from Figure 16b of the book under review, adapted from Harriot’s manuscript BL Add MS 6789 f406r. Courtesy of Robyn Arianrhod.) Full size image\n\nIn the figure, the light ray is traveling from air to water (a denser medium) contained in the rectangle bcd. Harriot is tracing the ray from the water to the air (from d to a) when i < r. The immersed segment of the staff appears bent upward (segment bf) compared with the actual immersed portion of the staff (bd). The line abf is the line of sight to the refracted image as the ray passes from water to air (and to the observer’s eye). Harriot measured bd, cd, and bf. Since sin r = bc/bf and tan i = bc/cd, one can find i and r from trigonometric tables.\n\nHarriot had access to such tables. The first trig table was compiled as far back as the second century b.c.e. by Hipparchus of Nicaea and extended by Ptolemy in the second century c.e. It was done by tabulating the corresponding values of the arcs and chords of a series of angles. Al-Khwarizmi also produced tables of sines, cosines, and tangents in the ninth century, and new versions by Viète and Clavius were published in the 1580s, so Harriot was well aware that he could convert all of his markings into trigonometric quantities. Without measuring any angles directly, he was able to make a table of angles of incidence and refraction from his linear measurements. He knew that sin r = bc/bf and tan i = bc/dc, and from this he deduced the sine law of refraction. He also showed that each pair of refractive media has a particular ratio of sines, or as we say today, every medium has a characteristic index of refraction.\n\nThroughout every mathematical and scientific explanation, Arianrhod keeps us well informed and interested, as if she were talking directly to us. She says: you will notice by experimenting with a straw, it takes a skilled and patient experimenter to take reasonably accurate measurements giving one pair of angles, let alone for the large number needed to uncover the law of refraction. That is likely why few, if any, of Harriot’s peers had studied refraction in this meticulous way. She is inviting us to perform the simple experiment ourselves. What a wonderful experiment this is for middle-school math students to learn Snell’s law as n 1 sin i = n 2 sin r, where n 1 and n 2 are the respective indices of refraction.\n\nWe now know the law from the Fermat principle, which tells us that light travels on whatever path takes the least time. By that principle, it is relatively easy to see the beautiful formula that ties refraction angle i to incidence angle r. However, Harriot did not know of Fermat’s principle, since Pierre de Fermat had not yet been born when Harriot was performing his light experiments in 1597. So he had to approach the problem another way. Arianrhod tells us that many scientists before Harriot carried out similar experiments and came upon inaccurate or invalid results. Ptolemy somehow believed, incorrectly, that the angle of refraction has a direct, essentially proportional, relationship with the angle of incidence. This is approximately true for small angles, but hardly true, even approximately, in general. And back in the thirteenth century, Roger Bacon wrote a treatise on refraction through lenses. But those experiments were, for the most part, understood to be thought experiments, not “rigorous, repeated practical ones.”\n\nThe beauty of this biography is that it gives us the whole person on balance, with almost equal attention to extensively varied exploits. The first third of the book is adventurous, with an expedition to Virginia and lively glimpses into Harriot’s teachings of astronomy and navigation in the era of European exploration of the Americas. Then we come to his infatuations with algebra and rainbows, and his correspondence in Latin with Johannes Kepler on elliptical planetary motion, the atomic theory of matter, and the different ways in which cannonballs could be stacked to fill space. In 1591, Harriot worked out a formula giving the number of spheres that could be stacked on a given area and height, a formula that had become useful in models of atomic packing. He mentioned the packing problem to Kepler, pointing out that the most stable way to stack cannonballs on ships was also the densest packing of spheres, accomplished by placing each layer so that the centers of the spheres were above the centers of the holes in the layer below. That was an intuitive conjecture, but Kepler could not prove it. Five years after his correspondence with Harriot, he wrote an essay, The Six-Cornered Snowflake, on why snowflakes always have sixfold symmetry, which includes Harriot’s principle of the best way to stack cannonballs on ships.Footnote 2 For the next 410 years it was known as Kepler’s conjecture. It even found its way into a part of Hilbert’s eighteenth problem. In 1998, Thomas Callister Hales, of the University of Michigan, provided evidence of its validity by a computer analysis of all possible individual cases, and a formal proof was accepted in 2017.Footnote 3\n\nBesides delicately describing Harriot’s treatments of polynomials, refractions, notational innovations, and sphere packing, Arianrhod deftly communicates to us Harriot’s interests in language, analytic geometry, binomial coefficients, the binomial theorem, projectile motion, spherical triangles, solar rotation, the orbit of Halley’s comet, the shape of a rainbow, compound interest, quantitative analysis of population growth, sunspots, and moon mapping. Woven through all this math and science is a dynamic history, including the tale of Harriot’s brief imprisonment for his coincidental connection with Guy Fawkes and Thomas Percy, coconspirators of the Gunpowder Plot to assassinate King James I, and a discussion of the work of many renowned scientists, mathematicians, and thinkers of the time.\n\nI learned much from the many enjoyable hours I spent reading this captivating book. In embarking on this well-crafted literary work you will soon develop a confident sense that either Harriot is with you in the room, or you are with him on the high seas on Sir Walter Raleigh’s Tiger. The elegant writing gracefully guides us past mathematical and scientific hurdles in a joyful time-traveling page-turner that never slows down."}], "Thomas Harriot was an ethnographer.": [{"url": "https://www.wikiwand.com/en/Sir_Thomas_Herriott", "page_content": "Thomas Harriot ( ;[2] c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques,[3] working closely with John White to create advanced maps for navigation.[3] While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it,[4] namely only The Briefe and True Report of the New Found Land of Virginia (1588).[3] This book includes descriptions of English settlements and financial issues in Virginia at the time.[3] He is sometimes credited with the introduction of the potato to the British Isles.[5] Harriot invented binary notation and arithmetic several decades before Gottfried Wilhelm Leibniz, but this remained unknown until the 1920's.[6] He was also the first person to make a drawing of the Moon through a telescope, on 5 August 1609, about four months before Galileo Galilei.[7]\n\nThomas Harriot observing the Moon through his telescope from the roof of Syon House.\n\nEnglish astronomer, mathematician, ethnographer and translator\n\nQuick facts: Thomas Harriot, Born, Died, Nationality, Alma... ▼\n\nAfter graduating from St Mary Hall, Oxford, Harriot traveled to the Americas, accompanying the 1585 expedition to Roanoke island funded by Sir Walter Raleigh and led by Sir Ralph Lane. He learned the Carolina Algonquian language from two Native Americans, Wanchese and Manteo, and could translate it, making him a vital member of the expedition. On his return to England, he worked for the 9th Earl of Northumberland."}, {"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz Faces of Science\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://historynewsnetwork.org/article/172001", "page_content": "5/19/19\n\ntags: history of science\n\nRobyn Arianrhod is Adjunct Research Fellow at the School of Mathematical Sciences at Monash University. Her previous works include Seduced by Logic and Einstein's Heroes.\n\nThomas Harriot was the English contemporary and peer of Galileo Galilei and Johannes Kepler, although he’s unknown to most people. That’s because his busy and dramatic life meant that he never got around to publishing his mathematical and scientific work, which is a pity for history: his manuscripts show that he was one of the most brilliant forerunners of modern science and mathematics. In this UN International Year of Indigenous Languages, however, it is especially significant that he was also a pioneering linguist and ethnographer.\n\nHe worked for Sir Walter Ralegh as an astronomer and navigational theorist – his first job was to train Ralegh’s sea captains and pilots so that they could make their way safely across the uncharted Atlantic to America. Then, in 1585-86, he spent a year in “Virginia” (today’s North Carolina), with Ralegh’s First Colony on Roanoke Island.\n\nHis job in America included a remarkable innovation by Ralegh: that of a kind of diplomat. Harriot had already learned some of the local language – North Carolina Algonquian dialects – from two indigenous men, Manteo and Wanchese. They had spent six months living in Ralegh’s home after sailing to England with his initial reconnaissance fleet in late 1584. Harriot lived in Ralegh’s mansion, too, and had plenty of opportunity to exchange language lessons with the two Americans, who returned home with the First Colony fleet.\n\nFortunately, Harriot had the right temperament for his diplomatic role – he was open, curious, and notably non-judgmental. He made friends with the people, and clearly enjoyed much about their way of life. We know this because he left a remarkable record, A brief and true report of the new found land of Virginia. It was the only work he published.\n\nAlthough Ralegh had commissioned this report in order to show the commercial benefits of a trading colony in America, Harriot’s personal empathy and interest in the people and their way of life shines through. He doesn’t just offer a detached list of plants, foods, and so on; he describes the way the people went about their agriculture, hunting, and fishing, noting their abundant crops and their clever ways of building fishing weirs. Their staple crop, corn – called pagatowr in their language – yielded “a very white and sweet flour [that] makes a very good bread”. The people also roasted or boiled the corn for use in stews, for which purpose they used earthenware pots. Harriot commented, “Their women know how to make [these] vessels […] so large and fine that our potters with their wheels can make no better.”\n\nHe listed many other native foods, giving details of the way they were cooked and how they tasted. He was quite at home with their Algonquian names, which he didn’t obliterate by using Anglicized terms instead. And he was impressed that amid all this abundant food the people ate moderately, while at the same time “making good cheer together”.\n\nIt’s these kinds of little details of daily life – of shared meals, festivals, making of canoes and pots, planting and hunting – that bring to life a thriving, fascinating, and relatively harmonious community. So much so that when A brief and true report was published in a deluxe illustrated edition in 1590, it became a best-seller, published in four languages. It’s a landmark in American ethnology – a remarkable record of a remarkable way of life, in which Harriot’s report is accompanied by his captions to engravings of John White’s illustrations. Harriot and White had worked together in America: White sketched the people as they went about their daily lives, while Harriot’s knowledge of the language enabled him to converse with the people themselves.\n\nHe had a gift for languages, both verbal and mathematical. He later acted as a Greek language consultant to his friend George Chapman while Chapman was making the first English translation of Homer’s Iliad, and he produced the first fully symbolic algebra. But the exotic Algonquian language opened up a whole new world of sounds and expressions.\n\nHarriot was so inspired by these new sounds that he created the world’s first complete phonetic alphabet. Four centuries before today’s global telecommunications revolution, he envisaged a different kind of globalism: the sharing of languages via a phonetic system designed to represent all the possible sounds of human speech. To make his system truly universal, he expressed it in unique trans-cultural symbols.\n\nOnce again, he didn’t publish his discovery, and the manuscript of his alphabet was lost for many centuries. Fortunately, he’d used Latin letters to represent Algonquian words in his report on Virginia, which includes one of the earliest written records of indigenous North American words.\n\nNeither Harriot nor Ralegh foresaw the disastrous consequences that followed their initial attempts to found a trading base in America – the diseases, the greed, the racism and rapaciousness of many English setters and administrators. It is a tragic, heartbreaking story that began to unfold even in the First Colony. The way of life brought so vividly to light in the illustrated Brief and true report no longer exists, and the particular North Carolina dialects that Harriot knew have not survived.\n\nIn 2014, however, historian Scott Dawson turned to Harriot’s work (and that of John Lawson a century later) when he wrote a paper, “The Vocabulary of Croatoan Algonquian”, which was published in the Southern Quarterly. Dawson is a descendant of the Croatoan people of Hatteras Island, which was also Manteo’s homeland – it is not far from Roanoke Island, and it is the last known destination of the famous Lost Colony, which vanished in the year or so after its establishment in 1587. Dawson noted that “a substantial portion” of what we know today about the Croatoan communities and their language comes from Harriot.\n\nDawson’s paper includes a list of 120 Croatoan words and phrases, which, together with Harriot’s notes and White’s illustrations, offer a precious link to his people’s past. It’s something to celebrate, although this Year of Indigenous Languages also reminds us of how much was needlessly lost."}, {"url": "https://pantheon.world/profile/person/Thomas_Harriot/", "page_content": "Thomas Harriot\n\nThomas Harriot (; c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques, working closely with John White to create advanced maps for navigation. While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it, namely only The Briefe and True Report of the New Found Land of Virginia (1588) . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Thomas Harriot has received more than 295,590 page views. His biography is available in 33 different languages on Wikipedia . Thomas Harriot is the 97th most popular mathematician (up from 102nd in 2019), the 448th most popular biography from United Kingdom (up from 482nd in 2019) and the 6th most popular British Mathematician.\n\nThomas Harriot is most famous for his contributions to the study of optics and astronomy."}, {"url": "https://en-academic.com/dic.nsf/enwiki/404776", "page_content": "Thomas Harriot (c. 1560 – 2 July 1621 ) was an English astronomer, mathematician , ethnographer , and translator . Some sources give his surname as Harriott or Hariot. He is sometimes credited with the introduction of the potato to Great Britain and Ireland [ [ http://www.btinternet.com/~richard.towers/jim/raleigh1.html Sir Walter Raleigh - American colonies ] ]\n\nAfter graduating from the Oxford University , Harriot traveled to the Americas on expeditions funded by Raleigh, and on his return he worked for the 9th Earl of Northumberland. At the Earl's house, he became a prolific mathematician and astronomer to whom the theory of refraction is attributed.\n\nBiography"}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://encyclopediavirginia.org/entries/hariot-thomas-ca-1560-1621/", "page_content": "Oxford and Durham House Hariot enters the historical record with his matriculation at Oxford in 1577 at the age of seventeen. His tentative date of birth is based on this information. Notes written at the time indicate that he was raised in Oxfordshire and his father was a commoner. Nothing else for certain is known about his early life. Hariot arrived at Oxford with exceptional talents in mathematics and the sciences, but at a time when these subjects were not particularly valued. This was beginning to change, however, as English adventurers began to recognize the connection between mathematics and the navigational arts necessary to further the nation’s developing interests in colonization, piracy, privateering, and trade, especially in North America. At Oxford, Hariot met Richard Hakluyt (the younger), who went on to edit the influential Principall Navigations of the English Nation (1589), a polemic on behalf of future English colonization disguised as a history of past English successes. Hariot also probably knew Thomas Allen, an Oxford faculty member who collected the latest manuscripts, books, and instruments connected with mathematics and astronomy. After receiving a BA from Oxford in 1580, Hariot relocated to London, where his interest in applying mathematics and astronomy to questions of navigation brought him to the attention of Walter Raleigh. A favorite of Queen Elizabeth I, Raleigh had obtained permission to establish English colonies in North America. By 1583, Hariot was serving Raleigh at his London residence, Durham House, by focusing on open-sea navigation. The Portuguese and Spanish understood how to cross the Atlantic Ocean to the New World, but the English, with notable exceptions such as Sir Francis Drake, did not and were forced to hug the coasts. Before he could teach it, Hariot needed to master the subject himself, and he set about collecting, building, and learning to use standard navigational instruments, including the astrolabe, cross staff, and sextant. He studied the mathematics required to determine one’s position in the open ocean, collected the best sea charts and maps, and learned the basics of astronomy necessary to navigate by the stars, moon, and sun. He then began lecturing to Raleigh’s sea captains on these subjects in his room at Durham House and collected the knowledge in the now-lost Arcticon. Raleigh was planning to attempt a colony on the mid-Atlantic coast of North America and in 1584 sent a reconnaissance voyage that landed on Roanoke Island. There, commanders Philip Amadas and Arthur Barlowe met and returned to England with two Virginia Indians, Manteo and Wanchese. Recognizing that communication with the Indians would be crucial for a successful colony, Hariot worked with the two men and learned to speak their form of the Algonquian language. Hariot even developed his own phonetic alphabet, which allowed him to record the sounds of Algonquian words and to create a now-lost English-Algonquian dictionary. Hariot’s work in this area made him one of the most advanced linguists of the day and recommended him as a member of Raleigh’s Roanoke expedition in 1585.\n\nRoanoke and A briefe and true report A briefe and true report of the new found land of Virginia The Roanoke colonists were mostly military men, the most prominent exceptions being Hariot and the artist John White, who had served as expedition artist on one of Martin Frobisher’s voyages to Greenland. The colonists arrived at Roanoke late in June 1585, but one of their ships ran aground and they lost much of their provisions. After the departure in August of the colony’s two commanders, Sir Richard Grenville and Thomas Cavendish, Ralph Lane assumed governorship, and his relations with the local Indians were friendly at first. The situation deteriorated, however, as the Englishmen failed to find reliable sources of food, and when Sir Francis Drake arrived in June 1586, Lane decided to return the surviving colonists to England. The year had not been a waste for Hariot, though. With the help of Manteo and Wanchese, and in the company of John White, he had explored the area surrounding Roanoke and, with White, joined a party that sailed north to the Chesapeake Bay and up the Elizabeth and Nansemond rivers, even encountering the Chesapeake Indians at their principal town of Skicoac. He and White used these travels to collaborate on the first accurate maps of the east coast of North America. Using angle-measuring tools to establish latitude and longitude, Hariot mapped out triangle-shaped areas and either recorded these angles in a notebook for later use or, while in the field, sketched these triangles directly onto a sheet of paper attached to a plane table. White, an accomplished painter and illustrator, then finished the maps. While some of the White-Hariot maps remained in manuscript form and did not receive wide circulation, others—such as the small map of Roanoke Island and the large map of the entire Outer Banks region—appeared in Theodor de Bry’s illustrated edition of Hariot’s A briefe and true report of the new found land of Virginia, becoming models for their time of accurate cartography in the New World. A briefe and true report was, perhaps, Hariot’s most important contribution to England’s colonization efforts. First published in 1588, it appeared again the next year as part of Richard Hakluyt (the younger’s) Principall Navigations. Hakluyt then convinced de Bry to publish a third version as the initial volume in his America series. This last includes etchings of the White-Hariot maps as well as etchings based on White’s watercolor portraits of Virginia Indians and scenes of Indian life. Published in English, French, German, and Latin, the de Bry version enjoyed a wide European audience. While the Report is sometimes considered scientific, it is more accurately viewed as commercial discourse. Throughout, Hariot argues four related points. First, the 1585 colony failed because many members of the colony were unprepared for the rigors of colonization. Although these men slandered the colony and its leaders upon arriving home, in Hariot’s view Raleigh’s colonization program should be allowed to continue. Second, the Roanokes and other Indian tribes are not to be feared by the English, who possess superior technology and culture. Third, the land in Virginia is abundant enough to provide future colonists with adequate food and building materials. And fourth, Virginia offers a less expensive source for a wide range of trade goods, including shipping supplies, dyes for the cloth industry, and wine.\n\nLater Years In 1595, Hariot received land from Henry Percy, ninth earl of Northumberland, to allow him to continue his scientific and mathematical work. Percy was imprisoned in 1605 for his connection to the Gunpowder Plot, an attempt on the life of King James I on behalf of greater freedom for English Catholics. Hariot’s connection to Percy also landed him in prison, but only briefly. (Percy’s younger brother George was one of the original Jamestown colonists.) Sir Walter Raleigh also ran afoul of the king and was beheaded in 1618. In the meantime, Hariot pursued his interest in astronomy. His unpublished notes on the appearance of Halley’s Comet in 1607 were later used to accurately calculate its orbit. In 1609, he used a telescope of his own making to sketch the moon—four months before the Italian astronomer Galileo Galilei more famously accomplished the same feat. In 1610, he was the first to observe sunspots, and in 1611, he produced the first map of the moon. Hariot died in London on July 2, 1621, of cancer of the nose, probably caused by heavy tobacco use. A posthumous work, Artis Analyticae Praxis, published in 1631, helped to establish the English school of algebra."}, {"url": "https://www.geni.com/people/Thomas-Harriot/6000000046292363854", "page_content": "About Thomas Harriot\n\nThomas Harriot (Oxford, ca. 1560 – London, 2 July 1621) — or spelled Harriott, Hariot, or Heriot — was an English astronomer, mathematician, ethnographer, and translator. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo. He is described by Fauvel and Goulding as \"the greatest mathematician that Oxford has produced\".\n\n\"We know very little of Harriot's youth. In fact all that is known is that on Friday 20 December 1577 he matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to be 1560 and we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been found (although a number of possible relatives have been identified).\"\n\nSources"}, {"url": "https://plus.maths.org/content/thomas-harriot-lost-pioneer", "page_content": "It's International Year of Astronomy and all eyes are on Galileo Galilei, whose astronomical observations 400 years ago revolutionised our understanding of the Universe. But few people know that Galileo wasn't the first to build a telescope and turn it on the stars. That honour falls to a little-known mathematician called Thomas Harriot, who might have become a household name, had he bothered to publish his results. This article is a tour of his work.\n\nThis portrait was once believed to be of Thomas Harriot, but modern evidence indicates that it is probably not him.\n\nWhen the prestigious Royal Society was established in 1660, it quickly launched a seven year search for the lost papers of Thomas Harriot, a London mathematician and empirical scientist who had died decades before. The quest failed, but when the papers finally came to light a century later, they included a system of symbolic algebra, workable binary numbers, the sine law of refraction and detailed telescopic observations of the Moon and sunspots: all mathematical and scientific firsts. While Harriot's intellectual achievements had been gathering dust, much of his pioneering work was discovered by others, so his name never made it into the history books.\n\nWe know little of Thomas Harriot's background and early life and we can't even be sure of what he looked like — the authenticity of the portrait on the right is disputed. He was born around 1560, four years before Galileo and a lifetime ahead of Newton. Soon after graduating from Oxford University in 1580, he was living and working in the London home of Walter Raleigh, then one of Queen Elizabeth's favoured courtiers. Acting as Raleigh's accountant, Harriot tutored sea captains in navigation and gained early fame as an anthropologist and ethnographer.\n\nFinding his way in the world\n\nAt Raleigh's instruction, the twenty-five year old Harriot spent a year in present-day North Carolina on the first, and ill-fated, expedition to set up a New World British colony, on Roanoke Island. Charged with mapping and surveying the new country, Harriot also documented the area's natural history and the customs of the local Algonquin peoples. He viewed the indigenous inhabitants as rightful owners of their land and was probably the first Englishman to communicate with them in their own language, even inventing an alphabet to represent their unique range of linguistic sounds. On his return home he published A briefe and true account of the new found land of Virginia with John White, the first English-language publication on the Americas and one that's still studied on early American literature courses. Harriot also promoted the new habit of smoking tobacco, recommending it as it \"purgeth superfluous fleame and ... openeth all the pores and passages of the body\".\n\nMercator's projection enlarges areas close to the poles. The red circles indicate the level of distortion. The spacing between the lines of latitude increases as you move towards the poles. Image courtesy Stefan Kuhn.\n\nDuring his time with Raleigh, Harriot focused his mathematical efforts on navigational matters. The map of the Flemish cartographer Gerardus Mercator was already revolutionising marine navigation, and even today is still the most familiar representation of our world. The Mercator projection was so valuable to marine navigation because it transforms lines of constant bearing on the surface of the Earth (the paths traced out when following a fixed direction as given by a compass) into straight line segments on the map. But like all projections of the spherical Earth onto a two-dimensional map, the Mercator projection comes with some distortion, in this case enlarging the areas near the poles. A measure of this distortion is the spacing between the lines of latitude, which increases towards the poles.\n\nUnfortunately, Mercator had not explained how to calculate the spacing of the lines of latitude on his chart, leaving future map makers none the wiser about the exact distortion of dimensions. In the 1580s Harriot gave a mathematical explanation of the progressive increase of distances between them, and some years later he computed tables of these meridional parts. It was left to Harriot's contemporary, English Cartographer Edward Wright, however, to publish the first table of latitudes in 1599. Some years later the Scottish mathematician John Napier invented the logarithm, enabling us to express the height on the map of a line of latitude with angle on the globe as\n\nGetting light right\n\nwhereis the radius of the Earth, and the equator is given by the line\n\nWhen Raleigh fell out of favour with the Queen for secretly marrying one of her ladies-in-waiting, he was imprisoned in the Tower and Harriot fell under the patronage of Sir Henry Percy, the ninth Earl of Northumberland. Known as the \"wizard\" earl for his free-thinking interest in science, Northumberland provided Harriot with a handsome pension of £80 a year, spacious rooms at his London home, Syon House (where Harriot lived for over twenty years) and the services of a talented technical assistant. Harriot was now free to pursue a range of scientific interests, but his focus remained on the mathematics relating to seafaring, navigation, surveying and astronomy.\n\nThe law of refraction relates the angle at which a ray of light meets the medium (θ 1 ) to the angle of refraction (θ 2 ).\n\nInspired by his own observations at sea, he developed techniques for correcting errors in navigational tools such as the cross staff, an instrument used to determine a ship's latitude by measuring the altitude of the Sun or pole star. His consideration of the effect of the refraction of light in the atmosphere on these observations may have been what drove him to embark on a systematic experimental and mathematical study of how light is bent by different media.\n\nFrom the updated table he scrawled in a published book on optics, it's probable these experiments resulted in Harriot calculating the sine law of refraction, which relates the angle at which a ray of light hits the surface of a medium to the angle by which the ray is bent by the medium. Although the law, stated below, had already been mentioned in a tenth century manuscript by the Arab mathematician Ibn Sahl, Harriot and his contemporaries were unaware of this. Harriot's notes do not state the law explicitly, but the table of angles he derived is too exact to be a result of experiment. His faith in the power of mathematics to describe physical laws must have encouraged him to interpret the results geometrically, and he must have been aware that the ratio of the sines of the two angles remains constant. In fact, it is equal to the ratio of the speed at which light travels through air and the speed at which light travels through the medium:\n\nWith applications for lens design, this relationship would have been of interest for Harriot's later work developing perspective trunckes or telescopes. The Dutch mathematician Willebrord Snellius shared his own discovery of the sine law with friends twenty years after Harriot's work but, though the law is now named after Snellius (also called Snell), it was actually René Descartes who formally published it another decade later.\n\nBallistics, cannonballs and fireworks\n\nWith seafaring comes warfare, and in the early 17th century Harriot correctly depicted the path of a projectile as a tilted parabola, where the descending segment is shorter and steeper than the ascending one, by taking into account gravity acting on the vertical component and air resistance on the horizontal. Galileo experimented with projectiles a few years later, but the parabolic theory was actually published by Bonaventura Cavalieri, one of Galileo's disciples.\n\nOn November 4th 1605, Harriot had the misfortune to dine at Syon with his patron, Northumberland, and a distant cousin of the Earl, Thomas Percy, who turned out to be a key conspirator in the gunpowder plot to blow up the Houses of Parliament. Three days later, Percy was dead and both Northumberland and Harriot were arrested. Harriot spent a month in the Gatehouse Prison in Westminster, accused by King James I, who distrusted mathematicians as astrologers and magicians, of secretly casting a horoscope on him. Harriot wrote to the Privy Council protesting his innocence, denying any meddling in matters of state and describing himself as \"contented with a private life for the love of learning that I may study freely.\" He was released a few weeks later. Northumberland was sentenced to life imprisonment in the Tower, where Harriot regularly visited both him and Raleigh, now sentenced to death for high treason.\n\nThe face-centred cubic packing (left) consists of layers of spheres. Each layer is positioned so that the spheres rest on the 'holes' of the layer below. This arrangement is not unique, the hexagonal close packing (right) is constructed in a similar way and is equally efficient.\n\nHarriot remained at Syon and soon entered into correspondence with the German mathematician Johannes Kepler, discussing, among other things, the problem of stacking spheres. Harriot had previously drawn up charts showing the ground space needed to store stacks of cannonballs on board Raleigh's ships, and had become intrigued by the question of how to stack the balls most efficiently. This was no doubt the prompter for Kepler's suggestion in 1611 that the most efficient arrangements of equally sized spheres in space are given by the so-called face-centred cubic packing and the hexagonal close packing, shown in the image on the left. This fact is familiar to greengrocers around the world, but as a mathematical statement that requires proof it turned out to be fiendishly difficult. It wasn't until nearly 400 years later, in 1998, that the mathematician Thomas Hales announced a proof which relied on a vast number of computer calculations. No human could possibly check all the calculations within a lifetime, so the validity of the proof has remained controversial to this day. (You can find out more about Kepler's conjecture and the controversy in the Plus article Welcome to the maths lab.)\n\nThe two mathematicians also discussed Harriot's work on rainbows and his investigation of refraction. Harriot thought that a light ray hitting the surface of a transparent medium was partially reflected and partially refracted because the medium contained solid parts, akin to atoms (which resist the ray), and empty spaces (which the rays penetrate). He even invited Kepler to imagine entering into an atom with him to see what wonders they would find in \"Nature's House\". To Harriot's amazement, Kepler declined.\n\nPerhaps inspired by the idea of matter being comprised by either points or empty space, Harriot developed a binary number system almost a century before the German mathematician Gottfried Leibniz, who is usually credited with being the first to describe the modern binary number system, which underlies the workings of all our computers. Harriot manipulated the numbers by addition, subtraction and multiplication. His papers even show him experimenting with ternary, quaternary, quinternary and higher number systems.\n\nReaching for the stars and venturing into abstraction\n\nBy the summer of 1609, Harriot had acquired a magnifying \"truncke\" or telescope, which could magnify objects by a factor of six. His observations of the moon are the first ever recorded astronomical observations using a telescope. As ever, he didn't publish, and Galileo gained the credit when he made his own observations six months later. Harriot used telescopes which could magnify up to a factor of 32 to draw detailed lunar maps, follow Jupiter's satellites, track comets and catalogue nearly 500 sunspot observations.\n\nThe Hubble Space Telescope: Astronomy has come a long way since the time of Harriot. Image courtesy NASA.\n\nDespite the impressive list of achievements above, Harriot is actually best-known for his work in algebra and, in his will, it was only his mathematical papers that he requested be collected and published. There is much debate about how important Harriot's algebraic work was, mostly due to the disorganised structure of his papers and the badly edited collection produced after his death. But his symbolic system of algebra, which dispensed with wordy descriptions and represented unknowns with letters and operations with symbols, could be manipulated independently from what it represented, according to its own rules and axioms. If this seems familiar to anyone who's studied algebra at school, it is. Like his earlier representation of the Algonquin language, Harriot's visual symbolism made mathematics accessible in a totally new way.\n\nHarriot wasn't just responsible for developing new representations of mathematics, though. He tackled equations by carrying all the terms containing a power of the unknown to the left side of the equation, with the constant term on the right. He used algebraic zero and the concepts of greater than and less than, expressing them as symbols.He worked on cubic equations, coming up with symbolic solutions and noting that a cubic with roots , and factorises as\n\nAnd he derived negative and even complex roots of equations, at a time when others viewed these as \"impossible\".\n\nFor the last eight years of his life, Harriot was plagued by a cancerous tumour on his nostril, almost certainly caused by smoking. He died aged 61 while visiting the City of London. His grave in the Chancel of St Christopher le Stocks was destroyed in the Great Fire of 1666 but a modern plaque stands on the site, now part of the Bank of England.\n\nPublish or perish?\n\nIn accordance with his will, the Artis Analyticae Praxis, a collection of Harriot's work on the theory of equations and the solution of numerical polynomial equations, was published ten years after his death. His reputation for many years relied on this edited volume which included many mistakes and discrepancies from his original papers.\n\nWhy didn't he publish any of the 7000 manuscript pages in his lifetime? No one is quite sure. Perhaps the security of his annual pension meant he had no need to establish a reputation for himself. Perhaps he considered his discoveries the property of his patrons. Perhaps he just wasn't interested. His lifelong friend, Sir William Lower, wrote in 1610 that \"too great reservedness hath rob'd you of those glories\" and urged Harriot to let his \"countrie and frinds injoye the comforts they would have in the true and greate honor you would purchase your selfe by publishing some of your choise works\", but to no avail.\n\nWhen Harriot's papers were finally unearthed in the late 18th century, among the stable accounts of Northumberland's country home, Petworth House in Sussex, they were disorganised and muddled, with few descriptions to help interpret them. Many were obviously written for Harriot's own personal entertainment, including acrostics, anagrams, hieroglyphics and puzzles. In among his major investigations were diversions to calculate the optimum size for the mast of a ship, the maximum supportable population of the world and the gaseous yield of a burning candle, as well as plans for the redesign of Syon House's drainage systems.\n\nThe German astronomer who discovered the papers, Frans Xavier Zach, was quick to promote Harriot's great work to the world, but there is still much debate about the level of his achievements. While descriptions of Harriot as an English Galileo or Kepler may be misplaced, there is no doubt that he committed his life to finding mathematical descriptions of observations of the natural world and applied himself to an amazingly broad range of practical problems. If he had published in his day, perhaps his contribution could have been greater, and his name would be much more familiar to us all.\n\nFurther reading\n\nA more extensive biography, along with details of Harriot's work on binary numbers and the story of his lost papers can be found in the MacTutor History of Mathematics archive.\n\nYou can also read Harriot's only published works, A Briefe and True Report of the New Found Land of Virginia and Artis Analyticae Praxis.\n\nAbout the author\n\nAnna Faherty read physics at Cambridge before working in publishing for fifteen years. She commissioned the Modular Mathematics Series and recently worked on 50 Mathematical Ideas You Really Need to Know. Anna is now a freelance writer and consultant working with a diverse range of clients including the Science Museum, the National Maritime Museum and Time Out London Guides."}, {"url": "https://id.loc.gov/authorities/names/n50026495", "page_content": "His A briefe and true report of the new found land of Virginia, 1903:\n\nfound : His A briefe and true report of the new found land of Virginia, 1903: t.p. (Thomas Hariot)\n\n(Hariot, Thomas SEE Harriot, Thomas; b. 1560 Oxford; d. July 2, 1621 London; astronomer, mathematician; f. of the English school of algebra)\n\nfound : Brittanica, Macropedia, 15th ed. (Hariot, Thomas SEE Harriot, Thomas; b. 1560 Oxford; d. July 2, 1621 London; astronomer, mathematician; f. of the English school of algebra)"}], "Thomas Harriot was a translator.": [{"url": "https://www.wikiwand.com/en/Sir_Thomas_Herriott", "page_content": "Thomas Harriot ( ;[2] c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques,[3] working closely with John White to create advanced maps for navigation.[3] While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it,[4] namely only The Briefe and True Report of the New Found Land of Virginia (1588).[3] This book includes descriptions of English settlements and financial issues in Virginia at the time.[3] He is sometimes credited with the introduction of the potato to the British Isles.[5] Harriot invented binary notation and arithmetic several decades before Gottfried Wilhelm Leibniz, but this remained unknown until the 1920's.[6] He was also the first person to make a drawing of the Moon through a telescope, on 5 August 1609, about four months before Galileo Galilei.[7]\n\nThomas Harriot observing the Moon through his telescope from the roof of Syon House.\n\nEnglish astronomer, mathematician, ethnographer and translator\n\nQuick facts: Thomas Harriot, Born, Died, Nationality, Alma... ▼\n\nAfter graduating from St Mary Hall, Oxford, Harriot traveled to the Americas, accompanying the 1585 expedition to Roanoke island funded by Sir Walter Raleigh and led by Sir Ralph Lane. He learned the Carolina Algonquian language from two Native Americans, Wanchese and Manteo, and could translate it, making him a vital member of the expedition. On his return to England, he worked for the 9th Earl of Northumberland."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz Numbers and Mathematics\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://www.encyclopedia.com/people/science-and-technology/mathematics-biographies/thomas-harriot", "page_content": "Harriot, Thomas\n\nA Brief and True Report of the New Found Land of Virginia\n\nReprinted in Major Problems in American Colonial History\n\nPublished in 1999\n\nEdited by Karen Ordahl Kupperman\n\n\"...some people could not tell whether to think us gods or men...\"\n\nE nglish exploration of North America began with the voyages of Italian-born navigator John Cabot (c.1450–c.1499), who reached the region that eventually became known as New England in 1497. By 1502 fishermen were sending cod (a type of fish used for food) from Labrador, Canada, and New England to the port of Bristol, England. As early as 1508–1509 Cabot's son Sebastian (c. 1476–1557) had explored the Atlantic coast, but the English did not establish a permanent presence on the continent for another hundred years. Although Bartholomew Gosnold (d. 1607) briefly attempted to colonize New England in 1602, the English settlers were not prepared for life in the New World. Nevertheless published reports of Gosnold's venture described North America as \"the goodliest continent that ever we saw, promising more by farre than we any way did expect.\" Eager investors formed business ventures in the hopes of exploiting the bountiful resources in the wilderness.\n\nEnglish explorers were also trying to find a northwest passage, a natural waterway between the Atlantic Ocean and the Pacific Ocean, which would provide more direct access to Asia. In 1576 Martin Frobisher (c.1535–1594) undertook a series of voyages to Greenland to search for a water route, but each time his ships were stopped by ice in the Canadian Arctic. In 1578 English navigator Humphrey Gilbert (c.1539–1583) was given a patent (contract granting specific rights) by Queen Elizabeth I (1533–1603) to explore and colonize North America. On his second expedition, in 1585, he reached Newfoundland and claimed the region for England. Discovering some fishermen living on the site of present-day St. John's, Gilbert appointed himself governor of the settlement. According to a few scholars, Gilbert established the first English colony in the New World, although most historians give that distinction to Jamestown, Virginia (see \"The Founding of Jamestown\").\n\nDuring the return trip to England, Gilbert was lost at sea. The North America patent was then transferred to his half brother, Walter Raleigh (1554–1618), who secured the support of influential noblemen and navigators for another attempt to establish a settlement. In 1584 Raleigh appointed Philip Amadas (1550–1618) and Arthur Barlowe to head an expedition to explore the mid-Atlantic coast of North America. Reaching the outer banks of present-day North Carolina, the expedition party came in contact with the Roanokes, Native Americans who inhabited Roanoke Island and the surrounding region. After a brief stay the Englishmen took two Native Americans, Manteo and Wachese, back to England. Amadas and Barlowe gave enthusiastic reports about Roanoke, claiming the island offered favorable trading prospects and an excellent location for a military fort. Impressed by the success of the mission, Elizabeth I knighted Raleigh and named the region Virginia in honor of herself (she was called the \"Virgin Queen\" because she refused to marry).\n\nRaleigh immediately organized a venture to establish a permanent colony at Roanoke. He assembled five ships and two boats, which he placed under the command of English navigator Richard Grenville (1542–1591). Among the party of 108 men—mainly soldiers and servants—was Thomas Harriot (1560–1621), a mathematician and Raleigh's tutor, who was given the task of surveying Virginia. (Surveying is a branch of mathematics that involves determining the area of any portion of the Earth's surface, the lengths and directions of bounding lines, and the contour of the surface.) Manteo and Wachese were to serve as interpreters, and artist John White (?–1593) planned to make drawings of animal and plant life in North America. Upon arriving at Roanoke in July 1585, the expedition got off to a bad start. First, Grenville determined that the island was not appropriate for a permanent military base. Then he ordered the burning of a Native American village when he discovered a silver cup was missing.\n\nLater the next month Grenville departed Roanoke for the Caribbean. Before leaving he placed colonist Ralph Lane (1530–1603) in charge of one hundred men. He then ordered the men to find a better site for the settlement and construct a fort and other buildings. In spite of Grenville's earlier aggression toward the Native Americans, the Englishmen had a good relationship with the Roanoke (also called Wiroan) people and their chief, Wingina. Lane freely explored the area, White sketched plants and animals, and Harriot conducted a detailed survey of the land. Harriot also recorded his observations of Native American life, language, and customs. As spring approached, the colonists ran out of food, so Lane took the drastic step of demanding corn from Wingina. Although the chief offered some land and seeds, Lane over-looked his generosity and concluded that the Native Americans were planning an attack. Lane therefore decided to strike first, and in the conflict Wingina and several of his people were killed.\n\nThe murder of Wingina and other Roanokes only made the food shortage at Roanoke worse because neighboring Native American groups avoided contact with the Europeans. The struggling colony was in desperate straits by June 1586, when English seaman Francis Drake (1540?–1596) paid a surprise visit on his way back from the Caribbean. Anxious to go home, all but three of the settlers boarded Drake's ship and set sail for England. About a year after their return Harriot published A Brief and True Report of the New Found Land of Virginia.\n\nThings to Remember While Reading A Brief and True Report of the New Found Land of Virginia:\n\nHarriot published A Brief and True Report of the New Found Land of Virginia primarily to encourage English colonization in North America. Many consider it to be the first description of Native Americans to be written in English. In the report Harriot also included a survey of the geographic features of Roanoke, nearby islands, and portions of the mainland. It is one of the earliest known statistical land surveys.\n\nprimarily to encourage English colonization in North America. Many consider it to be the first description of Native Americans to be written in English. In the report Harriot also included a survey of the geographic features of Roanoke, nearby islands, and portions of the mainland. It is one of the earliest known statistical land surveys. When the English initially organized the Roanoke expeditions they were motivated by the prospect of making profits on precious metals and trade in North America. Nevertheless, like the Spanish and French, they were also intent on converting Native American \"savages\" to Christianity (see \"New Mexico Indians Eager for Conversion\" and \"Jolliet and Marquette Explore the Mississippi\"). Note Harriot's statement that \"Some religion they [Native Americans] have already, which although it be far from the truth, yet being as it is, there is hope it may be the easier and sooner reformed.\" Later he observed that the Native Americans kept no written records. This was because they had a rich oral tradition, whereby master storytellers passed myths and legends down from generation to generation (see \"The Coming of the First White Man\").\n\nHarriot commented that \"some of the people [the Wiroans] could not tell whether to think us gods or men.\" Compare the Wiroans' confusion to the reactions of the Tlingits of Southeast Alaska (see \"The Coming of the First White Man\") and the Tainos in the Caribbean (see \"Christopher Columbus Reports to Ferdinand and Isabella\") upon meeting Europeans for the first time.\n\nHistorians maintain that Harriot showed unusual insight into problems that would eventually develop between Native Americans and European colonists. For instance, he wrote that native peoples \"are not to be feared, but that they shall have cause both to fear and love us, that shall inhabit with them.\" Later he observed, \"If there fall out any wars between us & them,\" the English would have \"advantages against them in so many manner of ways.\"\n\nHarriot described the friendly relations the English enjoyed with Wingina and the Wiroans. Although the situation changed drastically after Lane initiated the attack that resulted in the deaths of the chief and several other Wiroans.\n\nThe Wiroans died in great numbers after the Englishmen visited their towns, a \"marvelous accident\" that puzzled both Harriot and the Wiroans. Since none of the Englishmen were stricken, the deaths were undoubtedly caused by diseases they had carried with them from Europe. Disease was a major factor in the near-extermination of the Native American population during the seventeenth and eighteenth centuries.\n\nKeep in mind that Harriot wrote A Brief and True Report for a sixteenth-century audience. Since his language and writing style are unfamiliar to twentieth-century readers, explanatory notes are included in the following excerpts from the document.\n\nA Brief and True Report of the New Found Land of Virginia\n\nHarriot opened his report with a detailed description of the appearance and customs of Native Americans, whom he called \"natural inhabitants.\" He remarked that native peoples did not have sophisticated tools, nor did they have any weapons except bows and arrows for fighting against the English settlers (\"to offend us withal\"):\n\nIt resteth I [I pause to] speak a word or two of the natural inhabitants, their natures and manners, . . as that you know, how that they in respect of troubling our inhabiting and planting, are not to be feared, [they pose no threat to our settlement] but that they shall have cause both to fear and love us, that shall inhabit with them.\n\nThey are a people clothed with loosemantles made of Deer skins, & aprons of the same round about their middles; all else naked; . . having no edge tools or weapons of iron or steel to offend us withal, neither know they how to make any: those weapons that they have,\n\nMantles\n\nMantles: Cloaks\n\nare only bows made ofWitch hazel, & arrows of reeds, flat edgedtruncheons also of wood about a yard long, neither have they anything to defend themselves but targets made of barks, and somearmours made of stickswickered together with thread. . . .\n\nHarriot observed that the Native Americans admired English customs (\"our manner of knowledges and crafts\"), which they found superior to their own. Consequently they wanted to please and cooperate with the English (\"and have greater respect for pleasing and obeying us\"). He went on to describe Native Americans' wars with one another, observing that battle strategy (\"set battles\") was rare, except when there happened to be (\"it fall out\") fighting in the forest. At this point Harriot made his prediction about the Native Americans' lack of preparation for wars with Europeans. Since they could not defend themselves against superior battle plans and weaponry, they could be expected to run away from confrontation. Yet he praised their \"excellence of wit,\" and he predicted that the English could eventually civilize them and convert them to Christianity (the \"true religion\"):\n\nTheir manner of wars amongst themselves is either by sudden surprising one another most commonly about the dawning of the day, or moonlight, or else byambushes, or some subtle devices [secretive methods]. Set battles are very rare, except it fall out where there are many trees, where either part may have some hope of defence, after the delivery of every arrow, in leaping behind some [tree] or other.\n\nIf there fall out any wars between us & them, what their fight is likely to be, we having advantages against them so many manner of ways, as by our discipline, our strange weapons and devices else [other devices], especially byordinance great and small, it may be easily imagined; by the experience we have had in some places, the turning up of their heels against us in running away was their best defence. In respect of us they are a people poor, and for want of skill and judgment in the knowledge and use of our things, do esteem ourtrifles before things of greater value: Notwithstanding in their proper manner considering the want of such means as we have [in spite of not having our advantages], they seem veryingenious; For although they have no such tools, nor any such crafts, sciences and arts as we. . . they should desire our friendships & love, and have the greater respect for pleasing and obeying us. Whereby may be hoped if means of good government be used, [if we govern them properly] that they may in short time be brought to civility and embracing of true religion.\n\nWitch hazel\n\nWitch hazel: Shrub or tree with slender-petaled yellow flowers borne in late fall or early spring\n\nTruncheons\n\nTruncheons: Clubs\n\nArmours\n\nArmours: Hand-held weapons\n\nWickered\n\nWickered: Woven\n\nAmbushes\n\nAmbushes: Surprise attacks\n\nOrdinance\n\nOrdinance: Weapons and ammunition\n\nTrifles\n\nTrifles: Things of little value\n\nIngenious\n\nIngenious: Clever, resourceful\n\nHarriot reported that the Native Americans believed in an eternal god who created other gods. Nevertheless he dismissed their views as simply \"some religion\" that was \"far from the truth\" and would make the task of conversion easier for the English. Notice that Native Americans, like Christians, believed in immortality, heaven, and hell:\n\nSome religion they have already, which although it be far from the truth, yet being as it is, there is hope it may be the easier and sooner reformed.\n\nThey believe that there are many Gods which they call Montóac, but of different sorts and degrees; one only chief and great God, which hath been from all eternity. Who as they affirm when he purposed to make the world, made first other gods of a principal order to be as means and instruments to be used in the creation and government to follow; and after the Sun, Moon, and Stars as petty gods. . . . First they say were made waters, out of which by the gods was made all diversity of creatures that are visible or invisible.\n\nFor mankind they say a woman was made first, which by the working of one of the gods, conceived and brought forth children: And in such sort [in this manner] they say they had their beginning. But how many years or ages have passed since, they say they can make no relation, having no letters nor other such means as we to keep records of the particularities of times past, but only tradition from father to son. . . .\n\nThey believe also theimmortality of the soul, that after this life as soon as the soul is departed from the body, according to the works it hath done, it is either carried to heaven thehabitacle of gods, there to enjoy perpetual bliss and happiness, or else to a great pit or hole, which they think to be in the furthest parts of their part of the world toward the sunset, there to burn continually: the place they call Popogusso. . . .\n\nImmortality\n\nImmortality: The state of being free from death\n\nHabitacle\n\nHabitacle: Dwelling place\n\nIn this final excerpt Harriot described the Wiroans' reactions to Christianity. They accepted the Englishmen's faith, eventually rejecting their own. They grew to fear the Christian God. For instance, the Wiroans blamed illness or crop failure on the wrath of the Englishmen's god. In fact, whenever the Englishmen encountered hostility or resentment in Native American villages, the inhabitants began dying within a few days after they left. Both Harriot and the Wiroans seemed to make a connection between the mysterious deaths and offenses toward the Englishmen. The Wiroans therefore concluded that the Englishmen were gods, especially since they had no women with them. (The earliest Virginia expeditions were comprised only of men.) The true reason for the illnesses, however, was that the Native Americans were not immune to the diseases that the Europeans often carried.\n\nWiroans with whom we dwelt called Wingina, and many of his people would be glad many times to be with us at our prayers, and many times call upon us both in his own town, as also in others whither he sometimes accompanied us, to pray and singPsalms; hoping thereby to be partaker of the same effects which we by that means also expected [hoping to gain the same benefits from our religion].\n\nTwice this Wiroans [Wingina] was sogrievously sick that he was like to die, and as he laylanguishing, doubting of any help by his own priests, and thinking he was in such danger for offending [because he had offended] us and thereby our god, sent for some of us to pray and be a means [connection] to our God that it would please him either that he [Wingina] might live, or after death dwell with him [God] in bliss, so likewise were the requests of many others in the like case.\n\nOn a time also when their corn began to wither by reason of adrought which happened extraordinarily, fearing [they feared] that it had come to pass by reason that in something they had displeased us, many would come to us & desire us to pray to our God of England, that he would preserve their corn, promising that when it was ripe we also should be partakers of the fruit.\n\nThere could at no time happen any strange sickness, losses, hurts, or any other cross [misfortune] unto them, but that they wouldimpute to us the cause or means thereof for offending or not pleasing us. . . .\n\nPsalms\n\nPsalms: A book in the Old Testament containing sacred songs and poems\n\nGrievously\n\nGrievously: Terribly\n\nLanguishing\n\nLanguishing: Suffering\n\nDrought\n\nDrought: A period of prolonged dryness that causes extensive damage to crops or prevents their successful growth\n\nImpute\n\nImpute: Attribute\n\nThere was no town where we had any subtle device practiced against us [the inhabitants showed hostility], we leaving it unpunished or not revenged (because we sought by all means possible to win them by gentleness) but that within a few days after our departure from every such town, the people began to die very fast, and many in short space; in some towns about twenty, in some forty, in some sixty, & in one six score [one hundred twenty], which in truth was very many in respect of their numbers. This happened in no place that we could learn but where we had been where they used some practice against us, and after such time; The disease also was sostrange, that they neither knew what it was, nor how to cure it; the like by report of the oldest men in the country never happened before, time out of mind. A thing specially observed by us, as also by the natural inhabitants themselves. . . .\n\nThis marvelous accident in all the country wrought so strange opinions of us, that some people could not tell whether to think us gods or men . . . because . . . there was no man of ours known to die, or that was especially sick: they noted also that we had no women among us, neither that we did care for any of theirs.\n\nSome therefore were of opinion that we were not born of women, and therefore notmortal, but that we were men of an old generation many years past then risen again to immortality.\n\nMortal\n\nMortal: Human\n\nWhat happened next . . .\n\nSoon after the departure of the colonists Grenville returned to Roanoke with a new load of supplies and six hundred additional men. He found the colony deserted—no one knows what happened to the three men who had remained on the island. Eventually Grenville decided to return to England and recruit more settlers. He left fifteen men at Roanoke to plant crops and build dwellings in preparation for the new colonists. By that time, however, Raleigh had lost interest in colonizing Virginia. John White, the artist who accompanied Grenville in 1585, therefore took over the project and acquired the backing of several investors for another expedition.\n\nWhite's plan was to start a new colony called the City of Raleigh, which would be located north of Roanoke in the Chesapeake Bay area. White would be the governor of the new colony. Since this settlement would be devoted to families and farming instead of military defense, the party included seventeen women, nine children, and ninety-four men. When the ships reached North America in late 1587, the pilot refused to go any farther than Roanoke. Forced to remain at the old settlement, the colonists discovered that the fifteen men left by Grenville were gone, possibly driven out by Native Americans. Consequently crops had not been planted and there was no suitable housing. The only solution was for White to go back to England for more supplies and additional men. Before departing he told the colonists to move to another location if they had any problems and to leave a message telling him where to find them.\n\nThe \"lost\" colony\n\nAfter a three-year absence John White returned from England in 1591, only to find Roanoke deserted. The fate of the inhabitants of the \"lost colony\" remains a mystery. These excerpts from White's journal describe what he found at the site.\n\nAugust 17 . . . we espied [spied] toward the north end of the island the light of a great fire through the woods, to which we presently rode. When we came right over against it, we let fall our grapnel [anchor] near the shore and sounded with a trumpet a call, and afterwards many familiar English tunes of songs, and called to them friendly. But we had no answer. We therefore landed at daybreak, and coming to the fire, we found the grass and sundry [numerous] rotten trees burned about the place.... In all this way we saw in the sand the print of the savages' feet of two or three sorts trodden the night, and as we entered up the sandy bank, upon a tree, in the very brow thereof, were curiously carved these fair Roman letters CRO; which letters presently we knew to signify the place where I should find the planters seated, according to a secret token agreed upon between them and me at my last departure from them, which was that they should not fail to write or carve on the tree or posts of the doors the name of the place where they should be seated; for at my coming away they were prepared to remove from Roanoke 50 miles in the main. Therefore at my departure from them in 1587 I willed them that if they should happen to be distressed in any of those places, that then they should carve over the letters or name a cross; but we found no such sign of distress. And having well considered of this, we passed towards the place where they were left in sundry houses, but we found the houses taken down, and the place very strongly enclosed with a high palisade [fence] of great trees . . . and one of the chief trees or posts at the right side of the entrance had the bark taken off, and five foot from the ground in fair capital letters was graven [carved] CROATOAN without any cross or sign of distress. . . . This could be no other but the deed of the savages our enemies.\n\nReprinted in: Colbert, David, ed. Eyewitness to America. New York: Pantheon Books, 1997, pp. 11–12.\n\nIn the meantime, war had been brewing between England and Spain. When the conflict erupted in 1588—as White was about to sail from England back to North America—contact between England and Roanoke was cut off. In 1591, after the English defeated the Spanish Armada, White was finally able to return to Roanoke. By that time the settlers had all vanished without a trace, and White found only two clues to their whereabouts: the word \"Croatan\" carved on a fence post and the letters \"Cro\" etched into a tree trunk. The English suspected that the colonists' disappearance was somehow linked with the Croatoans, a friendly Native American tribe who lived on Croatoan Island about fifty miles south of Roanoke.\n\nThe Roanoke settlers were never found, and the fate of the \"lost colony\" remains a mystery. Numerous theories about their disappearance have evolved over the centuries. They could have died as the result of a natural disaster such as disease, starvation, hurricane, flood, or tornado. They could have tried to return to England and their ship sank at sea. More outlandish explanations include pirates coming ashore and kidnapping all the inhabitants. The most reassuring conclusion is that the colonists joined a nearby Native American tribe, with whom they intermarried and prospered.\n\nAfter the dismal failure of the Roanoke colony the English made no other attempts to colonize North America for nearly twenty years. They realized they had neither the skills nor the money to establish permanent settlements in a strange and hostile land. One modern historian has noted that venturing into the wilderness of North America in the sixteenth century was similar to landing on the moon in the twentieth century. Moreover, the English, like the Spanish, were primarily interested in conquering Native American empires that would yield instant wealth with such treasures as precious metals and jewelry. Yet by the late 1590s Europeans had seized most of the available riches in the New World.\n\nDid you know . . .\n\nA Brief and True Report of the New Found Land of Virginia was immensely popular among Englishmen who entertained visions of an exciting and prosperous life in the New World. By 1610 the book had been reprinted seventeen times.\n\nwas immensely popular among Englishmen who entertained visions of an exciting and prosperous life in the New World. By 1610 the book had been reprinted seventeen times. Harriot may have performed some of the earliest scientific experiments in North America. In addition to conducting a survey of Virginia, he helped another member of the 1585 expedition, German scientist Joachim Ganz, search for copper and other precious metals. Archaeologists excavating the Roanoke site have found equipment that Harriot and Ganz probably used to test metals and ores.\n\nJohn White was the grandfather of Virginia Dare (1587–?), the first European reported to be born in America. Nine days before White's departure from Roanoke, Virginia was born to his daughter Eleanor and his son-in-law Ananais Dare. All three Dares disappeared with the other Roanoke colonists, and White died without ever knowing what happened to his family.\n\nEvidence discovered in 1998 has led historians to speculate that the Roanoke colonists may have been driven out by a drought (a period of prolonged dryness that causes damage to crops). Scientists studying the rings of a bald cypress in southeastern Virginia found that a seven-year drought was occurring at the same time the second group of settlers arrived at Roanoke in 1587. In fact, it was the most severe period of dryness in more than eight hundred years. Thus a food shortage could have forced the colonists to seek another location for their community.\n\nFor more information\n\n\"The Cabot Dilemma: John Cabot's 1497 Voyage & the Limits of Historiography\" in Documents Relevant to the United States Before 1700.http://www.geocities.com/Athens/Forum/9061/USA/colonial/bef1700.html Available September 30, 1999.\n\nCampbell, Elizabeth A. The Carving in the Tree. New York: Little, Brown, 1968.\n\nKupperman, Karen Ordahl, ed. Major Problems in American Colonial History. Lexington, Mass.: D. C. Heath, 1993, pp. 12–15.\n\nMiddleton, Richard. Colonial America: A History, 1585–1776. Second edition. Malden, Mass.: Blackwell Publishers, 1996, pp. 9–12.\n\nQuinn, David Beers. Set Fair for Roanoke: Voyages and Colonies, 1584–1606.\n\nChapel Hill, N.C.: University of North Carolina Press, 1985.\n\nSteven, William K. \"Drought May Have Doomed the Lost Colony.\" TheNew York Times. April 14, 1998, pp. A1, A14."}, {"url": "https://pantheon.world/profile/person/Thomas_Harriot/", "page_content": "Thomas Harriot\n\nThomas Harriot (; c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques, working closely with John White to create advanced maps for navigation. While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it, namely only The Briefe and True Report of the New Found Land of Virginia (1588) . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Thomas Harriot has received more than 295,590 page views. His biography is available in 33 different languages on Wikipedia . Thomas Harriot is the 97th most popular mathematician (up from 102nd in 2019), the 448th most popular biography from United Kingdom (up from 482nd in 2019) and the 6th most popular British Mathematician.\n\nThomas Harriot is most famous for his contributions to the study of optics and astronomy."}, {"url": "https://link.springer.com/book/10.1007/978-0-387-49512-5", "page_content": "From the reviews:\n\n\"The Praxis contains Harriot’s most significant contribution to the theory of equations, the discovery that polynomials can be constructed as products of linear, or sometimes quadratic, factors. … The notes that follow the translation (70 pages) offer a great deal of fine textual detail. They also contain some beautiful reproductions of the original manuscripts … . Seltman and Goulding’s translation is a welcome addition to this growing body of work.\" (Jackie Stedall, MathDL, September, 2007)\n\n\"The book under review is a useful English translation of a mathematically ‘clean’ copy … by Robert Goulding that is enriched by a competent commentary by Muriel Seltman: it makes the mathematical content accessible to the modern reader. To that end, Harriot’s notation has rightly been modernized. … The reader finds a comparative table of equations solved, a list of textual emendations, additional information about the Harriot papers (kept in the British Library), and a select bibliography.\" (Eberhard Knobloch, Mathematical Reviews, Issue 2008 j)\n\n\"Seltman’s and Goulding’s Introduction, Commentary, and Tables are all interesting and useful. … The book contains just three reproductions of Harriot’s original work, each a full-page photograph of one of Harriot’s manuscript sheets on algebra. These are interesting and give the reader a good sense of what it is like to read Harriot’s work in the manuscripts themselves.\"(Janet Beery, British Society for the History of Mathematics, Vol. 24 March, 2009)"}, {"url": "https://www.maa.org/press/maa-reviews/thomas-harriots-artis-analyticae-praxis-an-english-translation-with-commentary", "page_content": "Thomas Harriot’s Artis analyticae praxis was published in 1631, ten years after his death, edited from the manuscripts that Harriot left to his executors. No editor’s name appears on the title page or elsewhere in the book, but there is no reason to question what was regarded as common knowledge at the time, that the editor was Harriot’s longstanding friend and colleague Walter Warner.\n\nThe Praxis contains Harriot’s most significant contribution to the theory of equations, the discovery that polynomials can be constructed as products of linear, or sometimes quadratic, factors. This was not an early version of the fundamental theorem of algebra: Harriot never claimed that all polynomials could be generated in this way, but he constructed useful lists of many that could, and called them ‘canonical’. In multiplying out factors he also developed a number of further insights into the number and nature (positive or negative) of the roots of such equations. All this is in the first part of the Praxis. The second part contains examples of the numerical method of solution first taught in Europe by François Viète, whose work Harriot studied closely. The Praxis, as was usual at the time, was written in Latin. Seltman and Goulding have now produced for the first time a translation into English.\n\nThe translation is preceded by a brief (16-page) introduction, which analyses the book’s mathematical content. It is perhaps to be regretted that the authors did not also provide some historical analysis of the circumstances under which the book was written and published, and of its subsequent influence. I am more inclined to think now than I was the past, for instance, that Warner may have edited at least some of the book from papers no longer extant, but if so one must ask why such papers were separated from the rest of Harriot’s manuscripts, and what happened to them afterwards? When did Warner begin the work and when did he finish? Did Harriot’s mathematical colleague Nathaniel Torporley make any contribution to it? Why is no bookseller mentioned on the title page? Was this a privately printed edition, and if so how many copies were made and who would have bought or acquired them? What, if anything, do we know of the readers of the Praxis? To a historian, these and similar questions are as important as an analysis of the book’s contents and I would have valued the authors’ opinion on them.\n\nThe notes that follow the translation (70 pages) offer a great deal of fine textual detail. They also contain some beautiful reproductions of the original manuscripts, though hidden so far into the book that they may go unnoticed by any but the most intrepid reader.\n\nThe appendix is a little puzzling. The authors pursue a long and detailed analysis of three volumes of Harriot’s manuscripts only to infer that his system(s) of page-numbering did not necessarily imply his intentions as to future publications, a conclusion with which no-one could disagree. Harriot’s pagination can give useful information only in relation to specific topics. In his algebra, for instance, it confirms his close and systematic reading, here as elsewhere, of the treatises of Viète. I believe it also give clues to the development of his thinking on the nature of roots (whether positive, negative, or imaginary) and on his use of the term ‘canonical’ which, it seems to me, he uses differently in different circumstances. The authors of the present volume take the contrary view on this last point, and suppose that Harriot uses the word in essentially the same way each time. Since modern English editions of both the Praxis and the related manuscripts are now available, readers will be able to take up this and other intriguing questions about Harriot’s work for themselves.\n\nHarriot studies are now moving steadily apace. Closer scrutiny of the British Library manuscripts and the opening up of the Macclesfield Collection at Cambridge has dispelled some of the confusions sown by Cicely Tanner in the 1970s. The Oxford Harriot lectures have produced a steady flow of scholarship of a high standard, and more and more analysis of Harriot’s work in his various fields of interest is now becoming available. Seltman and Goulding’s translation is a welcome addition to this growing body of work.\n\nJackie Stedall is Junior Research Fellow in mathematics at The Queen’s College, Oxford. She is the author of several books, including A Discourse Concerning Algebra: English Algebra to 1685 and The Greate Invention of Algebra: Thomas Harriot's Treatise on Equations ."}, {"url": "https://www.geni.com/people/Thomas-Harriot/6000000046292363854", "page_content": "About Thomas Harriot\n\nThomas Harriot (Oxford, ca. 1560 – London, 2 July 1621) — or spelled Harriott, Hariot, or Heriot — was an English astronomer, mathematician, ethnographer, and translator. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo. He is described by Fauvel and Goulding as \"the greatest mathematician that Oxford has produced\".\n\n\"We know very little of Harriot's youth. In fact all that is known is that on Friday 20 December 1577 he matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to be 1560 and we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been found (although a number of possible relatives have been identified).\"\n\nSources"}, {"url": "https://kids.britannica.com/students/article/Thomas-Harriot/325789", "page_content": "(1560–1621). English mathematician, astronomer, and natural scientist Thomas Harriot introduced some of the symbols used in algebra today. He published very little but left thousands of pages of manuscripts, which scholars did not closely study until the mid-20th century.\n\nHarriot was born in 1560 in Oxford, England. He lived at Sir Walter Raleigh’s home in London, England—Durham House—which was a center for Raleigh’s preparations to sponsor a colony on Roanoke Island in “Virginia” (now in North Carolina). Harriot was deeply involved. While living at Durham House, he worked out mathematical solutions to various navigational problems, devised navigational instruments, helped organize and raise funds for the expeditions, and kept Raleigh’s accounts. He may have gone on the first expedition Raleigh sent to Roanoke Island in 1584. Harriott was certainly on the next one, from April 1585 to July 1586, which he described in 1588 in A Briefe and True Report of the New Found Land of Virginia—Harriot’s only book published in his lifetime. By 1589 Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nIn the 1590s the political tide in England began to turn against Raleigh. Harriot found a new patron in Henry Percy, the 9th earl of Northumberland, who gave him an estate in Durham, England, in 1595. Percy also gave Harriot the use of a house near London as a residence and scientific laboratory for his studies in astronomy, meteorology, optics, chemistry, and mathematics. Harriot applied mathematics to the bending of light and to the path of a cannonball shot from a gun (ballistics). He was the first to discover the principle of the refraction of light now called Snell’s law, which the Dutch scientist Willebrord Snell discovered independently 20 years after Harriot.\n\nAfter Queen Elizabeth’s death in 1603, Raleigh was arrested and charged with treason. In the course of his trial, both he and Harriot were accused of atheism, although there is nothing in Harriot’s writings to substantiate the charge. In the turmoil following the discovery of the Gunpowder Plot of 1605, Harriot was arrested on suspicion of having cast King James’s horoscope; his patron, Percy, was also arrested. Harriot was soon released, but Percy remained in the Tower of London until 1621.\n\nWith both of his former patrons in prison, Harriot returned his attention to his studies of optics and astronomy. His reputation reached the German astronomer Johannes Kepler, who initiated an exchange of letters. Harriot observed Halley’s comet and, like his Italian contemporary Galileo, used a telescope to observe sunspots and the moons of Jupiter. In 1609 and 1610 Harriot drew sketches of the Moon as viewed through a telescope.\n\nHarriot’s last eight years were marred by having cancer of the nose and by Raleigh’s execution, which Harriot was present to witness. Harriot died in London on July 2, 1621. His Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (“Application of Analytical Art to Solving Algebraic Equations”) was published posthumously in 1631. Both the editor and Harriot himself introduced some of the mathematical symbols used in algebra today. Harriot was among the first to solve mathematical equations involving negative and complex roots and imaginary numbers."}, {"url": "https://books.google.com/books/about/Thomas_Harriot_s_Artis_Analyticae_Praxis.html?id=fFUrAAAAYAAJ", "page_content": "The present work is the first ever English translation of the original text of Thomas Harriot's Artis Analyticae Praxis, first published in 1631 in Latin. Thomas Harriot's Praxis is an essential work in the history of algebra. Even though Harriot's contemporary, Viete, was among the first to use literal symbols to stand for known and unknown quantities, it was Harriott who took the crucial step of creating an entirely symbolic algebra. This allowed reasoning to be reduced to a quasi-mechanical manipulation of symbols. Although Harriot's algebra was still limited in scope (he insisted, for example, on strict homogeneity, so only terms of the same powers could be added or equated to one another), it is recognizably modern.\n\nWhile Harriot's book was highly influential in the development of analysis in England before Newton, it has recently become clear that the posthumously published Praxis contains only an incomplete account of Harriot's achievement: his editor substantially rearranged the work before publishing it, and omitted sections that were apparently beyond comprehension, such as negative and complex roots of equations.\n\nThe commentary included with this translation attempts to restore the Praxis to the state of Harrios draft. The authors based their work on manuscripts in the British Library, Pentworth House, and Lambeth Palace, and the commentary explores some of Harriot's most novel and advanced mathematics, very little of which has been published in the past. This publication will become an important contribution to the history of mathematics, and it will provide the basis for a reassessment of the development of algebra.\n\nThe present work is the first ever English translation of the original text of Thomas Harriot’s Artis Analyticae Praxis, first published in 1631 in Latin. Thomas Harriot’s Praxis is an essential work in the history of algebra. Even though Harriot’s contemporary, Viete, was among the first to use literal symbols to stand for known and unknown quantities, it was Harriott who took the crucial step of creating an entirely symbolic algebra. This allowed reasoning to be reduced to a quasi-mechanical manipulation of symbols. Although Harriot’s algebra was still limited in scope (he insisted, for example, on strict homogeneity, so only terms of the same powers could be added or equated to one another), it is recognizably modern.\n\nWhile Harriot’s book was highly influential in the development of analysis in England before Newton, it has recently become clear that the posthumously published Praxis contains only an incomplete account of Harriot’s achievement: his editor substantially rearranged the work before publishing it, and omitted sections that were apparently beyond comprehension, such as negative and complex roots of equations.\n\nThe commentary included with this translation relates the contents of the Praxis to the corresponding pages in his manuscript papers, which enables much of Harriot's most novel and advanced mathematics to be explored. This publication will become an important contribution to the history of mathematics, and it will provide the basis for a reassessment of the development of algebra."}]}