{"Sir Walter Raleigh employed Thomas Harriot.": [{"url": "https://encyclopediavirginia.org/entries/hariot-thomas-ca-1560-1621/", "page_content": "Oxford and Durham House Hariot enters the historical record with his matriculation at Oxford in 1577 at the age of seventeen. His tentative date of birth is based on this information. Notes written at the time indicate that he was raised in Oxfordshire and his father was a commoner. Nothing else for certain is known about his early life. Hariot arrived at Oxford with exceptional talents in mathematics and the sciences, but at a time when these subjects were not particularly valued. This was beginning to change, however, as English adventurers began to recognize the connection between mathematics and the navigational arts necessary to further the nation’s developing interests in colonization, piracy, privateering, and trade, especially in North America. At Oxford, Hariot met Richard Hakluyt (the younger), who went on to edit the influential Principall Navigations of the English Nation (1589), a polemic on behalf of future English colonization disguised as a history of past English successes. Hariot also probably knew Thomas Allen, an Oxford faculty member who collected the latest manuscripts, books, and instruments connected with mathematics and astronomy. After receiving a BA from Oxford in 1580, Hariot relocated to London, where his interest in applying mathematics and astronomy to questions of navigation brought him to the attention of Walter Raleigh. A favorite of Queen Elizabeth I, Raleigh had obtained permission to establish English colonies in North America. By 1583, Hariot was serving Raleigh at his London residence, Durham House, by focusing on open-sea navigation. The Portuguese and Spanish understood how to cross the Atlantic Ocean to the New World, but the English, with notable exceptions such as Sir Francis Drake, did not and were forced to hug the coasts. Before he could teach it, Hariot needed to master the subject himself, and he set about collecting, building, and learning to use standard navigational instruments, including the astrolabe, cross staff, and sextant. He studied the mathematics required to determine one’s position in the open ocean, collected the best sea charts and maps, and learned the basics of astronomy necessary to navigate by the stars, moon, and sun. He then began lecturing to Raleigh’s sea captains on these subjects in his room at Durham House and collected the knowledge in the now-lost Arcticon. Raleigh was planning to attempt a colony on the mid-Atlantic coast of North America and in 1584 sent a reconnaissance voyage that landed on Roanoke Island. There, commanders Philip Amadas and Arthur Barlowe met and returned to England with two Virginia Indians, Manteo and Wanchese. Recognizing that communication with the Indians would be crucial for a successful colony, Hariot worked with the two men and learned to speak their form of the Algonquian language. Hariot even developed his own phonetic alphabet, which allowed him to record the sounds of Algonquian words and to create a now-lost English-Algonquian dictionary. Hariot’s work in this area made him one of the most advanced linguists of the day and recommended him as a member of Raleigh’s Roanoke expedition in 1585.\n\nRoanoke and A briefe and true report A briefe and true report of the new found land of Virginia The Roanoke colonists were mostly military men, the most prominent exceptions being Hariot and the artist John White, who had served as expedition artist on one of Martin Frobisher’s voyages to Greenland. The colonists arrived at Roanoke late in June 1585, but one of their ships ran aground and they lost much of their provisions. After the departure in August of the colony’s two commanders, Sir Richard Grenville and Thomas Cavendish, Ralph Lane assumed governorship, and his relations with the local Indians were friendly at first. The situation deteriorated, however, as the Englishmen failed to find reliable sources of food, and when Sir Francis Drake arrived in June 1586, Lane decided to return the surviving colonists to England. The year had not been a waste for Hariot, though. With the help of Manteo and Wanchese, and in the company of John White, he had explored the area surrounding Roanoke and, with White, joined a party that sailed north to the Chesapeake Bay and up the Elizabeth and Nansemond rivers, even encountering the Chesapeake Indians at their principal town of Skicoac. He and White used these travels to collaborate on the first accurate maps of the east coast of North America. Using angle-measuring tools to establish latitude and longitude, Hariot mapped out triangle-shaped areas and either recorded these angles in a notebook for later use or, while in the field, sketched these triangles directly onto a sheet of paper attached to a plane table. White, an accomplished painter and illustrator, then finished the maps. While some of the White-Hariot maps remained in manuscript form and did not receive wide circulation, others—such as the small map of Roanoke Island and the large map of the entire Outer Banks region—appeared in Theodor de Bry’s illustrated edition of Hariot’s A briefe and true report of the new found land of Virginia, becoming models for their time of accurate cartography in the New World. A briefe and true report was, perhaps, Hariot’s most important contribution to England’s colonization efforts. First published in 1588, it appeared again the next year as part of Richard Hakluyt (the younger’s) Principall Navigations. Hakluyt then convinced de Bry to publish a third version as the initial volume in his America series. This last includes etchings of the White-Hariot maps as well as etchings based on White’s watercolor portraits of Virginia Indians and scenes of Indian life. Published in English, French, German, and Latin, the de Bry version enjoyed a wide European audience. While the Report is sometimes considered scientific, it is more accurately viewed as commercial discourse. Throughout, Hariot argues four related points. First, the 1585 colony failed because many members of the colony were unprepared for the rigors of colonization. Although these men slandered the colony and its leaders upon arriving home, in Hariot’s view Raleigh’s colonization program should be allowed to continue. Second, the Roanokes and other Indian tribes are not to be feared by the English, who possess superior technology and culture. Third, the land in Virginia is abundant enough to provide future colonists with adequate food and building materials. And fourth, Virginia offers a less expensive source for a wide range of trade goods, including shipping supplies, dyes for the cloth industry, and wine.\n\nLater Years In 1595, Hariot received land from Henry Percy, ninth earl of Northumberland, to allow him to continue his scientific and mathematical work. Percy was imprisoned in 1605 for his connection to the Gunpowder Plot, an attempt on the life of King James I on behalf of greater freedom for English Catholics. Hariot’s connection to Percy also landed him in prison, but only briefly. (Percy’s younger brother George was one of the original Jamestown colonists.) Sir Walter Raleigh also ran afoul of the king and was beheaded in 1618. In the meantime, Hariot pursued his interest in astronomy. His unpublished notes on the appearance of Halley’s Comet in 1607 were later used to accurately calculate its orbit. In 1609, he used a telescope of his own making to sketch the moon—four months before the Italian astronomer Galileo Galilei more famously accomplished the same feat. In 1610, he was the first to observe sunspots, and in 1611, he produced the first map of the moon. Hariot died in London on July 2, 1621, of cancer of the nose, probably caused by heavy tobacco use. A posthumous work, Artis Analyticae Praxis, published in 1631, helped to establish the English school of algebra."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz Faces of Science\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://www.ncpedia.org/biography/harriot-hariot-or", "page_content": "Harriot (Hariot or Harriott), Thomas\n\nby John W. Shirley, 1988\n\n1560–2 July 1621\n\nThomas Harriot (Hariot or Harriott), explorer, navigational expert, mathematician, scientist, and astronomer, participated in Sir Walter Raleigh's early expeditions to America. His parentage or ancestry are unknown. Records of his matriculation at Oxford University show him to have been born and reared in Oxford, England, and to be of plebeian stock. He entered St. Mary's Hall (a subsidiary of Oriel College) on 20 Dec. 1577, at age seventeen, and was graduated with a bachelor of arts at the Easter Convocation of 1580. Acquisition of this degree gave Harriot the right to call himself \"Master Harriot,\" a title he carefully used for the rest of his life.\n\nShortly after leaving the university, Harriot entered the household of Walter Raleigh, where, according to Richard Hakluyt, he not only instructed Raleigh in the mathematics of navigation but also conducted instructional programs for Raleigh's sea captains, that they might \"very profitably unite theory with practice\" in their explorations. This teaching (resulting in a navigational text called the Arcticon, which has not survived) further stimulated young Raleigh to follow in the footsteps of his half brother, Sir Humphrey Gilbert, in attempting to explore and colonize the New World.\n\nOn Gilbert's death in 1583, Raleigh purchased a new ship, renamed it the Bark Ralegh, and began to prepare for an exploratory visit to America to seek a site for colonization. Helping to plan this expedition was Thomas Harriot working closely with two other young sea captains in Raleigh's household, Philip Amadas and Arthur Barlowe. Raleigh hoped to command the 1584 voyage himself, but he was by this time a courtier rising in the eyes of Queen Elizabeth and she would not permit him to accept the danger of an ocean crossing where Sir Francis Drake and the Spaniards were still fighting. Possibly Harriot may have gone on this voyage. Though he is not listed among the ten names signing the report, there is some evidence that it was at this time that he learned the Algonquin language, perhaps on the return voyage with the two Indians, Manteo and Wanchese. John White is not listed either, though he later indicates that he was a member of this exploratory party. The return of the first voyage was most successful: Manteo and Wanchese made a great impression on the queen and on the court. Their friendliness and the reports of extensive economic potential in the new land appeared so favorable that the queen granted Raleigh a patent for colonizing, knighted him in January 1585, appointed him governor of the new colonies, and permitted him to name his proposed colony \"Virginia\" (in her honor as Virgin Queen) rather than the Indian name of Wingandacoa it had previously borne.\n\nDuring the winter of 1584–85, Raleigh and Harriot made extensive preparations for a colonizing effort in Virginia. Seven ships were assembled with nearly six hundred men, half of them sailors and the other half soldiers and colonists who were prepared to spend at least a year in the New World. On 9 Apr. 1585, under the command of Sir Richard Grenville, this flotilla sailed from Plymouth. Because he could not go himself, Raleigh named Harriot as his official representative and charged him with assessing the economic potential of Virginia and reviewing the nature and inclinations of the natives. John White was assigned to help with the making of maps and to bring back drawings and sketches of the new land and its inhabitants. Both men, along with Grenville as general of the expedition, Ralph Lane as high marshall and later governor of the colony, Simon Fernándes as chief pilot of the fleet, and a number of other gentlemen who were to make up the council, sailed on the flagship, The Tiger.\n\nDuring the long sea crossing, Harriot made a number of scientific observations. He tested the traditional and crude dead reckoning against the more accurate celestial navigation, probably using the backstaff he had developed for better observation by his sea captains. He noted the variation of the compass, measuring the magnetic north against the position of the pole star. On 19 April, ten days after leaving Plymouth, he must have observed the eclipse of the sun, though the eclipse was not total where he then was, so it could not be used for an accurate calculation of longitude as he had hoped. As the flotilla proceeded through the islands, Harriot gathered fruits and vegetables, sugar, ginger, tobacco, and pearls to be returned to Raleigh, along with White's drawings of many of the same things, as samples of the richness to be obtained by colonization.\n\nOn 26 June, after repeatedly searching navigable waters with extreme difficulty and much loss of vessels, the fleet anchored at Wococon Island, approximately where modern Ocracoke is, and began negotiating with the natives. On 3 July an expedition was sent to Roanoke Island, the site that had been chosen by the 1584 expedition for colonization, to notify the Indian chief Wingina of their arrival. On 11 July Grenville, Lane, Harriot, White, and a few others crossed to the mainland on a voyage of exploration through a number of Indian towns which took them as far as Lake Mattamuskeet, which the natives called Paquype. Within the next month the settlers had been moved to Roanoke, had unloaded their provisions, and were building a fort and houses and beginning to function like a colonial outpost. Harriot and White began in earnest to survey the land resources, and to draw for a permanent record what they could observe of the people and products of the New World.\n\nDuring the whole of the year they spent at Roanoke Island, Harriot and White kept busy at their recording assignments. In addition to studying the people, they took careful notes on commercially profitable plants and mineral resources that might lead to further investment in colonial ventures. So successful was their publicity that more than two decades later, Harriot was working with Raleigh to prevent the importation of Virginia sassafras roots from glutting the market.\n\nIn his contacts with the natives, Harriot did not ignore his scientific bent. He exploited the science and technology of his day in such a way that he should undoubtedly be recognized as the first scientist of the New World—not only in his scientific study of the land and its people, but also in introducing scientific artifacts into Virginia. According to him, the native Americans were most impressed with the scientific instruments they first saw in Harriot's possession. Yet with all his frightening guns, magnets, clocks, and \"wildefire works\" (a compound used in warfare that was difficult to extinguish once set afire), Harriot earned the confidence and affection of the Indians, including Chief Wingina's, whereas Lane, using force to punish any observed unconformity, attracted only their hatred and distrust.\n\nBy the next spring, the new colonists were in dire straits; they badly needed the promised relief supplies, and they counted the days until the arrival of Raleigh's second-year colonists who would bring them. The Indians, too, were uneasy. On 10 June, Lane, suspecting an uprising, struck on the mainland, killing Chief Wingina. Additional search actions scattered his men and left them vulnerable to further attack. On the same day, however, Sir Francis Drake, sailing north from his battles with the Spaniards, anchored at Port Ferdinando. The next day he met with Lane, offering him one of his larger ships for reconnoitering the Chesapeake Bay area to seek a safer and more healthful colonial site. Transfer of the vessel had just begun when, on 13 June, a violent storm grounded some of Drake's vessels and blew others, including the one offered to Lane, out to sea where their only safe action was to set sail for England. The remaining ships were too large for Lane's use; and, because their supplies had been depleted, Lane decided that the colonists still at Roanoke should board Drake's ships and return home. The severe weather made boarding difficult, and, as Lane told the story, Drake \"sending immediately his pinnaces vnto our Island for the fetching away of fewe that there were left with our baggage, the weather was so boysterous, and the pinnaces so often on ground, that the most of all wee had, with all our Cardes, Bookes and writings, were by the Sailers cast ouer boord.\" There can be little doubt that the great portion of Harriot's notes and White's drawings were thus lost in the frantic boarding on that day.\n\nWhen he returned home, Harriot learned that Raleigh was unable to send relief to Virginia because of the Spanish threat to England; moreover, he was already engaged in a new colonial venture, this time in southern Ireland. Harriot, posing as one of the colonists, joined him there and was given for his use the Abbey of Molanna in the county of Waterford, near Youghal. Here, Harriot gathered his remaining notes and prepared for publication the first English treatise on the New World. This book, published in February 1588 under the title A briefe and true report of the new found land of Virginia: of the commodities there found and to be raysed, as well marchantable, as other for victuall, building and other necessarie uses for those that are and shalbe the planters there; and of the nature and manners of the naturall inhabitants . . . By Thomas Hariot; seruant to . . . Sir Walter, a member of the Colony, and there imployed in discouering . . ., exists in only eight copies but remains one of the most important early accounts of the country as it was first seen by the English settlers. It attracted immediate attention and was included by Hakluyt in his Principall navigations of 1589. The following year, Theodore de Bry issued elaborate editions in Latin, English, French, and German, adding plates of twenty-one of John White's drawings of the new land and the Indians, for which Harriot wrote headnotes. Though this was the only work Harriot ever published, it was enough to establish Harriot and White as among the foremost authorities on early colonial America.\n\nHarriot was also involved in the preparations for the invasion of the Spanish Armada. Though he was living in Ireland, he frequently visited London, and many of his extant manuscript notes indicate that he was preparing seamen for more scientific approaches to their craft. It is true that superior seamanship (and God's weather) gave England the victory, and Harriot must have felt some satisfaction in his new science of navigation. Among other activities, he collected for Raleigh and government officials a large number of maps and rutters (sets of sailing directions, tide tables, and carefully drawn profiles of ports or entrances to harbors as seen from the sea, usually the first thing seized from a captured ship), particularly those dealing with Virginia; worked with Emery Molyneaux to improve terrestrial globes; and assisted Gerard Mercator in developing more accurate map projections than had been used before this time. But increasingly his interests turned to theoretical and mathematical subjects. Harriot was one of the first of the new scientists to seek a mathematical solution to natural phenomena. His study of the piling of bullets led him to examine the possible atomic structure of matter as one of the earliest of the new atomists. His investigation of the trajectory of bullets and cannonballs led him to consider the laws of motion and falling bodies. In fact, he was performing the same experiments in England that were occupying Galileo in Italy. Both atomic theory and the laws of motion led Harriot to study refraction; he discovered the law of sines many years before Wilebrord Snel (whose name the law bears) and began work on mirrors and lenses that may have resulted in his independent discovey of a telescope some years later.\n\nDuring this period, Sir Walter Raleigh's fortunes began to decline. His colonization attempts in the New World had yielded only trouble and high costs. The relief vessels for the 1585–86 colony had arrived two weeks too late, and had returned to England leaving only a small contingent at Roanoke Island. The 1587 colonial effort with John White as governor had been extremely difficult to finance, and once landed could not be supplied or rescued. In all, these projects had cost Raleigh at least £40,000 and denied him the possibility of ever visiting Virginia himself. His Irish colonies were disastrous, too. The lands were poor, the settlers unhappy, the natives vicious, and English import duties on Irish products prevented any profit from his plantations. His popularity with Elizabeth, the source of his wealth, had been jeopardized by his courtship of one of the queen's ladies-in-waiting, Elizabeth Throckmorton, whom he married secretly in late 1591 or early 1592, an act that prompted the queen to confine him in the Tower of London and strip him of many of his honors.\n\nIn light of Raleigh's predicament, Harriot sought a new patron, and found one in Raleigh's longtime friend, Henry Percy, ninth earl of Northumberland. Percy was a quiet, retiring, serious-minded young man, intensely interested in the new science of which Harriot was an outstanding exponent. Percy himself was known as \"The Wizard Earl,\" and was beginning to gather about him men with similar interests. During much of Raleigh's imprisonment, Harriot was, according to the kitchen accounts of the ninth earl that still exist, dining regularly at the Wizard Earl's table. Though he continued to be one of Raleigh's closest friends and worked with him to find financial support for Raleigh's ventures, Harriot gradually rose in favor with Percy. In 1593, when Percy received the Order of the Garter, he gave Harriot a handsome gift of money. Two years later he granted him a lifetime interest in his landholdings at Brampton in County Durham (now called Barmpton, a rural suburb of Darlington) and established him in a house adjacent to his London residence, Syon House, Isleworth, though Harriot was still using his rooms in Durham House (Raleigh's London residence) when in the city.\n\nBy 1597, Harriot was listed as a regular pensioner of the ninth earl at £80 per annum—the same amount received by Percy's younger brothers. In the same year, in a will drawn by Raleigh on 10 July just before he sailed with Robert Devereux, earl of Essex, to intercept the Spanish fleet in the Azores in a dangerous attempt to recoup their fortunes, Raleigh named Harriot as one of the overseers of the will, left him \"all my bookes & the furniture in his own Chamber and in my bedchamber in Durham House Togeather with all such blacke suites of apparell as I have in the same house,\" and arranged for Harriot to be paid an annual pension of £100 from his royal grants. Though this will was never probated, the sums mentioned indicate the kind of support that Raleigh must have been giving Harriot. From these incomes, Harriot could live like a gentleman, keep his own house and servants, and indulge his every whim in the pursuit of scientific knowledge without the worry of income, fame, or reputation.\n\nShortly after his accession to the throne, King James had Raleigh accused of treason on trumped-up charges, convicted by a hand-picked jury, and again thrown into the Tower of London at the sovereign's pleasure. Two years later, Henry Percy followed him to the Tower because James suspected a remote connection with the Gunpowder Plot. Harriot, who was questioned about the plot and accused by James of having cast his horoscope, was imprisoned for a time, but then released to pursue his scientific research at Syon House. Nevertheless, he remained the main link between Raleigh and Percy in the Tower and the outside world, visited them often, assisted Raleigh in the writing of his History of the World, and instructed young Algernon, Percy's heir, in the elements of mathematics and navigation, both of which would stand him in good stead in later life when, as the tenth earl of Northumberland, he was Admiral of the Fleet.\n\nBetween 1606 and 1608 Harriot corresponded with Johannes Kepler; the two men compared notes on their experiments in the refraction of light, explaining, for the first time, the refraction within a sphere and providing a scientific explanation for the dispersion of light in the rainbow. By 1609, Harriot had in his possession a six-power telescope and began a series of observations of the moon. During the next four years he developed at least eight new telescopes, ranging in power from eight to fifty magnifications. With these telescopes (called by Harriot \"perspective truncks\") he observed the phases of Venus which proved the validity of Copernican over Ptolemaic astronomy, recorded more than thirty drawings of the moon leading to the first telescopic moon map, and determined the time of quadrature so that he could calculate the distance of the moon from the sun. In December 1610, almost simultaneously with Galileo, he discovered sunspots; during the next four years he made and recorded 199 observations. A few months earlier, in October, he first saw the satellites surrounding Jupiter and after two years of observation was able to calculate the distance of the moons from the planet and to compute the periods of their rotation. He also observed, using a cross-staff, the comets of 1607 (Halley's comet) and 1618, observing their orbits and determining that they followed an ellipitical orbit.\n\nDuring these later years, Harriot suffered from cancer of the nose. Theodore Turquet de Mayerne, the king's physician, was called in as a consultant on 28 May 1615. His notebooks still survive to record his impressions of this visit. He saw Harriot as a very melancholy man, about age sixty (actually Harriot was fifty-five, so his illness must have aged him). He noted that Harriot was the man who first brought tobacco out of Virginia and recorded, for the first time, the possible connection between smoking and cancer. His indication that Harriot had had cancer for about two years appears to be borne out by Harriot's own manuscripts, for except for the comet of 1618 his notes are sparse after 1612. Harriot was able, however, to attend the execution of his old friend and patron, Sir Walter Raleigh, at West-minister on 29 Oct. 1618, and his notes of Raleigh's final speech on the scaffold are among his papers.\n\nHarriot died at the home of Thomas Buckner, a mercer who lived on Threadneedle Street near the Royal Exchange. He may have been on his way to visit Henry Percy, who was still in the Tower, or he may have been visiting an old friend, as \"Thomas Bookener\" had been with Harriot on Roanoke Island in 1585–86. Harriot was buried in the chancel of St. Christopher le Stocks, on the site of the present Bank of England. His grave, and the monument erected there by Percy, were destroyed in the Great Fire of 1666.\n\nIn his will, Harriot left his telescopes and scientific instruments to his executors and his mathematical and scientific papers to his patron, Henry Percy. He requested Nathaniel Torporley, a retired clergyman whom he had known for a long time, to edit and publish his papers. But the records of his visit to the New World are not mentioned. A canvas bag of Irish accounts, \"the persons whom they concerne are dead many yeares since in the Raigne of Queene Elizabeth,\" and another bag of \"divers wast papers . . . of my Accomptes to Sir Walter Rawley\" he asked be burned. Thus died any additional traces beyond his published book of the personal observer of Raleigh and the author of the first English book about \"the new found land of Virginia.\""}, {"url": "https://lens.monash.edu/@science/2021/07/26/1383475/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on", "page_content": "Four hundred years ago, on 2 July, 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8000 pages of scientific research, but it’s only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of renowned pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nThomas Harriot’s 1609 map of the Moon, drawn by observing through a telescope. Image: Wikimedia\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance, all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea – he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: Our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo weren’t the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries – the law of refraction, and why the rainbow has its magical colours and unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens, or why your leg looks wobbly when you dip it in a swimming pool.\n\nA diagram from Ibn Sahl’s 10th-century treatise on optics showing the path of light refracted by a lens. Image: Wikimedia\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right – Ibn Sahl is a notable pioneer whose geometrical diagram of light focused by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers, even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did. His derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters, and sailing the high seas as Raleigh’s navigational advisor.\n\nThomas Harriot published only one work in his lifetime – a report on his stay in North America in the 1580s. Image: Wikimedia\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s US before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted ...\n\n“... to live a private life for the love of learning that I might study freely”.\n\nConclusion\n\nIn the late 1590s, Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot didn’t need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost-finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They’re now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no one knows much about him as a person – not even his birthday. Nevertheless, he’s fascinated scholars for the past half-century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour.\n\nThis article originally appeared on The Conversation."}, {"url": "https://www.nps.gov/fora/learn/education/thomas-hariots-a-brief-and-true-report.htm", "page_content": "(Note: The following text is a modernization of the English language used from the original source, printed in 1590.)\n\nA briefe and true report of the new found land of Virginia\n\nof the commodities and of the nature and manners of the natural inhabitants. Discovered by the English Colony there seated by Sir Richard Grenvile, Knight in the year 1585. Which remained under the government of twelve months, at the special charge and direction of the Honorable Sir Walter Raleigh, Knight, Lord Warden of the Stanneries who therein had been favored and authorized by her Majesty and her letters patents.\n\nBy Thomas Hariot, Servant to the abovenamed Sir Walter, a member of the Colony, and there employed in discovering.\n\ndirected to the investors, farmers, and well-wishers\n\nof the project of colonizing and planting there.\n\nImprinted at London in 1588\n\nINTRODUCTION BY THEODORE DE BRY, THE PUBLISHER\n\nALTHOUGH, Dear Reader, on account of Adam's disobedience man was deprived of those good gifts with which he was endowed at the Creation, yet, as will be seen in the following account of the life of savage tribes, he still retained wit to provide for himself and to make whatever was necessary for his life and health — except in the matter of his soul's health. For although these savages have no knowledge of the true God or of His holy word and are without any learning, yet they surpass us in many things. Their way of eating is far more wise and moderate than ours, and they show the greatest ingenuity in making, without the aid of any metal tool, such fine and delicate articles as could hardly be believed if the Englishmen had not brought back the proofs from their travels in that country.\n\nAdmiring, as I did, the paintings made of these people, I wished to offer them to the public. This I have been able to do by the help of Master Richard Hakluyt of Oxford, a minister of God's word, who first encouraged me to publish the work. I copied exactly from the originals themselves, which were made by Master John White, an English painter who was sent to the New World by Her Majesty the Queen especially to make exact drawings of the country and its inhabitants, their way of dressing, their manner of living, and their several habits. This he did under the direction of Sir Walter Raleigh, the worthy knight who from 1584 to the end of 1588 spent large sums of money in the discovery and exploration of that country.\n\nAt the request of my friends, and because the memory of that recent feat is so fresh, I am publishing first the account of that part of the New World which the English call Virginia. If I were to regard the order of events, the history of Florida (which I already have in hand) should have first been published, since the French discovered and conquered that land in a notable victory long before the discovery of Virginia. However, I hope shortly to publish this work also. I obtained both of them in London and brought them here to Frankfurt, where I and my sons have taken the most earnest pains in engraving them carefully on copper, since the subject is one of great importance. I have had the text of both narratives translated into excellent French and Latin by a very learned friend of mine. In conclusion, I ask most earnestly that if anyone else should be found attempting to pirate this book of mine (for nowadays there are many dishonest people who try to get the benefit of another's work), that no credit should be given to the counterfeit copy, for I have put many secret marks in my drawings which will certainly cause confusion if they are omitted.\n\nFOREWORD BY GOVERNOR RALPH LANE\n\nGENTLE READER, the truth of the reports contained in this treatise can little be furthered by the testimony of one like myself, judged to be partial, though without desert, because of my affection for the land. Nevertheless, at the request of some of my particular friends, who conceive more rightly of me, I have decided to write freely what I know of it. I do this not only to satisfy them but also for the true information of anyone else who comes without a prejudiced mind to its reading. This much upon my reputation I do affirm, that everything is truly set down in this treatise by its author, a member of the Colony and a man no less commended for his honesty than for his learning. I dare boldly avouch its truth will compare favorably with that of even the most true relations of this age. For my own part, I give my word it is true, assured of its certainty by my own experience, and I make this assertion publicly. Farewell in the Lord.\n\nHARIOT'S REPORT\n\nTO THE INVESTORS, WELL-WISHERS, AND FRIENDS\n\nOF THE SETTLING AND PLANTING OF VIRGINIA\n\nSINCE Sir Walter Raleigh first undertook the exploration of the country now known as Virginia, many voyages have been made there at different times at his expense. The first was in the year 1584; others followed in 1585 and 1586 and more recently, last year, in 1587. A number of reports about this land, some of them slanderous and shameful, were put in circulation by travellers who returned. These rumors were spread in particular about the voyage of 1 5 8 5, when Sir Richard Grenville established a Colony in the New World. This was the most important of the enterprises, because the Colony stayed in Virginia a whole year, whereas the first settlers remained there only six weeks; all the later trips were made only for purposes of carrying supplies, and on these voyages nothing more was discovered.\n\nThese reports about Virginia have done much harm to many people who might otherwise have favored and invested in the project, thus honoring and benefiting the nation, besides making financial profit for themselves. I hope future events will bring shame to these tellers of tales; they will if you, the supporters and friends of the enterprise, increase in number, overcome any doubts you may have had, and renew your interest in the undertaking. I well understand that the various rumors have unsettled the minds of many among you concerning the worthiness of the Virginia enterprise, even of some of those most well disposed toward it.\n\nSince I have been active in the discovery, had much experience in dealing with the native inhabitants and have therefore seen and known more than others, I thought it a good thing to acquaint you publicly with the fruits of our labors that you may see how wrongfully the enterprise has been slandered. I have two reasons for doing so: first, that those of you who are still ignorant or doubtful of conditions in Virginia may know that Sir Walter Raleigh, with the favor of Her Majesty, has seen good cause to proceed with the settlement. Not only has he sent ships there again and replanted the Colony during this last year, but also he is ready to continue further as means afford.\n\nMy second reason is that you may get a general idea of what the country is and of how you can profit from supporting it, either by settling there and planting or by furthering it in other ways.\n\nLest you should doubt the substance of my report, since it will differ from others, I will first say why it is different.\n\nOf our company that returned from Virginia, some were deservedly punished there for dishonesty and bad behavior. In their ill nature they have spoken maliciously not only of their governors but also of the country itself, and they have been borne out in their tales by their companions.\n\nSome of them were ignorant of the country. When they returned to their friends and acquaintances, they pretended to know more than other men, especially when there was no one in the gathering who could disprove them. They made themselves out to have suffered greater hardships than anyone ever suffered before. They put such great value on their reputations that they would have thought themselves disgraced if, after living in Virginia a year, they had not had a great deal to say, true or false. Some of them spun tales of things they never saw. Others shamefully denied happenings which they did not see, but which nevertheless were known to have occurred. Still others made difficulties of simple things because they did not understand them.\n\nThe cause of their ignorance was mainly that they never left the island where we had our settlement, at least not to go far from it, during the whole time we were there and therefore had seen little. Or they had lost interest when they did not immediately find gold and silver and spent their time in pampering their bellies. And there were others who had not much understanding, less discretion, and more tongue than was necessary.\n\nSome of them had been nicely brought up, living in cities or towns, and had never seen the world before. Because they could not find in Virginia any English cities, or fine houses, or their accustomed dainty food, or any soft beds of down or feathers the country was to them miserable, and they reported accordingly.\n\nMy purpose in these remarks is merely to give a brief explanation of the opinions of these men. I do not mean to trouble you with details of these judgments and their envious, malicious, and slanderous reports; they are trifles not worthy of consideration. But I shall pass to a description of the marketable commodities of the country, which are the subjects of this discussion.\n\nI will divide my treatise on the commodities into three separate parts, so that it may be easily read and understood. In the first I will enumerate commodities already found there, or which could be raised there to serve the ordinary needs of you who will be the planters and inhabitants of that country. A surplus of these can be provided by experienced men for trade and exchange with our own nation of England. It will enrich you, the providers, and those who will deal with you and will greatly profit our own countrymen by supplying them with many things which they have had to procure in the past either from strangers or from our enemies. These commodities, for distinction's sake, I call marketable.\n\nIn the second, I will set down all the goods that we know grow naturally there for food and sustenance of life, such as were commonlv eaten by the inhabitants of the country as well as by us while we were in Virginia.\n\nIn the last part I will list such other general commodities as I am able to remember. Here I shall also give a brief description of the nature and manners of its inhabitants.\n\nGo to The First Part of the report\n\nGo to The Second Part of the report\n\nGo to The Third Part of the report"}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-1-4419-9917-7_583", "page_content": "Born Oxford, England, 1560\n\nDied London, England, 2 July 1621\n\nGalileo Galilei was not the first to grasp the potential of the telescope for astronomical investigations; in England, Thomas Harriot made the first telescopic sketch of the Moon. Harriot was strongly identified with Sir Walter Raleigh’s free-thinking “School of Atheisme” and had once served as Raleigh’s onetime mathematical tutor and scientific advisor. Another associate was the poet and dramatist Christopher Marlowe (1564–1593). But unlike his colorful poet-companions, Harriot seems to have been personally reserved and quiet, a perfectionist whose knowledge of mathematics was extensive but who published little during his lifetime.\n\nIn 1585, when he was in his early 20s, Harriot accompanied Raleigh as surveyor and cartographer on an expedition to Virginia. Although he planned an encyclopedic account of the New World, he actually produced only “A brief and true report of the new-found land of Virginia,” which became widely known through Richard Hakluyt’s Principal Navigations (1598–1600), a collection of the voyages made by English adventurers like Raleigh.\n\nBut these had been the adventures of a younger man. Harriot was already 50 when he first turned a telescope toward the 5-day-old Moon on the evening of 26 July 1609 (5 August). Though magnifying 6×, his “trunke,” as he called it, must have been of very poor optical quality, since it showed very little detail. For that matter, Harriot seems to have had very little insight into the true nature of what he was seeing-about as little as was shown on a slightly later occasion by his friend Sir William Lower , who used one of Harriot’s telescopes to make his own observations of the Moon from Kidwelly in Wales. Lower wrote memorably to Harriot on February 6, 1610 (O.S.).\n\nAccording as you wished I have observed the moone in all his changes. In the new I discover manifestlie the earthshine, a little before the dichotomie that spot which represents unto me the man in the moone (but without a head) …. A little after neare the brimme of the gibbous parts like starres, much brighter then the rest and the whole brimme along, lookes like unto the description of coasts, in the dutch bookes of voyages. In the full she appeares like a tarte that my cooke made me the last weeke. Here a vaine of bright stuffe, and there of darke, and so confused lie al over."}, {"url": "https://spartacus-educational.com/Thomas_Harriot.htm", "page_content": "Thomas Harriot\n\nThomas Harriot was born in about 1560. All that is known for certain of his family is that his father was a commoner. Harriot entered the University of Oxford and became a student at St Mary Hall. He was awarded a BA degree in 1580. He was described during this period as \"a reticent, intense young man who wore only black\". (1)\n\nAccording to his biographer, J. J. Roache: \"Harriot soon developed a high reputation for the mathematical and instrumental skills necessary for astronomical navigation, stimulated in these studies, perhaps, by the prevailing enthusiasm for exploration and colonies in America\". (2)\n\nIn about 1584 he was employed by Sir Walter Raleigh to teach his sea captains at Durham House in London the sciences of navigation. Mathew Lyons has argued that he was the most brilliant Englishman in the field: \"Raleigh paid him an exceptionally generous salary to teach his sea-captains navigational theory, the practical application of mathematics and astronomy\". (3)\n\nThomas Harriot and Roanoke Island In 1584 Raleigh obtained a patent for the formation of an American colony. (4) The following year Raleigh sent out an expedition of four ships and two pinnaces, with 600 men, under Sir Richard Grenvill. This included Thomas Harriot. Although Raleigh himself never went to Virginia, he was the mastermind behind this expedition. (5) A settlement was established on Roanoke Island. Grenville returned to England to obtain supplies for the colonists. During this period the colonists relied heavily upon a local Algonquian tribe. However, after a raid led by Ralph Lane, this food source came to an end. This created serious problems for the colonists and many died from starvation. (6) Sir Francis Drake arrived at Roanoke on 9th June 1586. According to John Sugden, the author of Sir Francis Drake (1990) he discovered that there were only 105 colonists left alive: \"Lane's men were largely soldiers, not artisans and farmers. They were interested in exploring, but lacked the skills and knowledge to form a sustainable community, and to provide for themselves they badgered the natives for food... Understandably, the Indians had begun to resent the colonists.\" Drake agreed to take the colonists back to England. (7)\n\nTobacco Smoking Thomas Harriot returned to England with Drake later that year. In 1588 he published A Brief and True Report of the New Found Land of Virginia. During his time in America he became addicted to tobacco. \"You will observe sailors and all others who come back from the New World smoking tobacco... By this they say their strength is restored and their spirits refreshed... We have discovered nothing from the New World that is more valuable than this plant... It is a remedy for sores, wounds, infections of the throat and chest and the plague.\" (8) Spartacus E-Books (Price £0.99 / $1.50) Mary Tudor Henry VIII Henry VII Anne Boleyn Harriot's biographer, J. J. Roache, has pointed out: \"At a time of brutal violence between colonists and native inhabitants the text is remarkable for its sympathy towards Algonquian beliefs and customs. It also contains what may be the first printed promotional literature in English for tobacco by an English writer, and Harriot and Ralegh were subsequently credited with the introduction of pipe tobacco smoking into England from Virginia. The Report was much published subsequently.\" (9) Harriot provided detailed information on the people who lived on Roanoke Island. \"The Indians have no weapons of iron or steel... They have only bows made of witch-hazel, and arrows of reeds, flat truncheons also of wood about a yard long... If there are any wars between us and them... we have advantages against them in our discipline and in our weapons... They may in a short time be brought to the true religion. They have some religion already, although it be far from the truth.\" (10)\n\nWalter Raleigh Group According to Paul Hyland, Harriot was a member of \"a collection of thinkers, tightly knit or loosely grouped, whose passion was to explore the world and the mind\". The group included Walter Raleigh, the geographers, Richard Hakluyt and Robert Hues, the mathematician, Walter Warner, and the writers, Christopher Marlowe, Thomas Kyd, George Chapman and Matthew Roydon. The men would either meet at the homes of Raleigh, Edward de Vere, 17th Earl of Oxford, and Henry Percy, 9th Earl of Northumberland. (11) In 1590 Harriot is reported as being at work examining existing navigational tables for Ralegh. To help him do this Harriot constructed the largest astronomical instrument in sixteenth-century England, a 12 foot device which may have been an astronomer's cross-staff. \"The observations and calculations which he carried out between 1590 and 1594... his innovations in mathematical cartography, and his improved instruments and observing practices provided Ralegh with the best navigational expertise then available in Europe, which he made use of during his voyage in 1596 to Guiana in search of El Dorado.\" (12) Walter Raleigh was released from the Tower of London on 19th March 1616, and at once set about planning his expedition. The planning was, of course, extensive, and little he said or did comforted those at court who were determined on a lasting peace with Spain. He discussed with Sir Francis Bacon, attorney-general, the possibility of seizing Spanish ships carrying treasure. Bacon warned him against this action as it would be an act of piracy. Historians have dismissed Raleigh's final voyage to the Orinoco River to try to find El Dorado as the hopeless pursuit of fantasy. However, Raleigh appeared certain that his trip would be a financial success. Raleigh's fleet sailed from Plymouth on 12th June 1617, but storms and adverse winds detained it off the southern coast of Ireland for nearly two months. Never comfortable at sea, Raleigh succumbed to fever, and was unable to face solid food for nearly a month. The fleet did not arrive in harbour, at the mouth of the Cayenne River, until 14th November. An expedition under Lawrence Keymis, with Raleigh's nephew George Raleigh in command of the land forces, sailed up the Orinoco in five ships on 10th December. (13) Carrying provisions for one month, the three vessels that survived the shoals of the delta battled against strong currents and arrived at the settlement San Thomé on 2nd January 1618. Keymis attacked the Spanish outpost in violation of peace treaties with Spain. In the initial attack on the settlement, Raleigh's son, Walter, was fatally shot. Keymis, who broke to Sir Walter the news of his son's death, begged for forgiveness. \"Raleigh, fully aware of the implications of these events, confronted him with the bitter statement that Keymis had ruined him by his actions, and refused to support the latter in his report to the English backers. Keymis left Raleigh's cabin, saying that he knew what action to take, and went back to his ship. Raleigh then heard a pistol shot, and sent his servant to enquire what was happening, to which Keymis, lying on his bed, replied that he was just discharging a previously loaded pistol. Half an hour later Keymis's boy entered the cabin and found him dead. The ball had only grazed a rib, and after Raleigh's servant had left he stabbed himself to the heart with a long knife.\" (14) Raleigh planned another expedition to discover the El Dorado. He also considered plundering the Spanish treasure fleet. However, his men refused to follow him and the rest of his fleet sailed north leaving Raleigh in his own ship, The Destiny. With a rebellious crew he sailed towards Newfoundland, then across the Atlantic to Ireland. Several members of his crew deserted and Raleigh, with the remnant of his force, sailed on to Plymouth. On his return he wrote to his wife: ‘My brains are broken and tis a torment to me to write… as Sir Francis Drake and Sir John Hawkins died heart-broken when they failed of their enterprise, I could willingly die.\" (15) Raleigh was placed under arrest by order of Charles Howard of Effingham soon after his landing and conveyed to London by his cousin Sir Lewis Stucley, vice-admiral of Devon and was imprisoned on his arrival on 10th August. Raleigh and the surviving members of his crew were interrogated. On 18th October the commissioners reported their findings to King James. As the evidence against Raleigh was not strong the King issued a warrant for executing the sentence of 1603. Raleigh was taken to be executed at Whitehall on 29th October 1618. (16)"}, {"url": "https://viva.pressbooks.pub/amlit1/chapter/author-introduction-thomas-harriot-1560-1621/", "page_content": "14 Author Introduction-Thomas Harriot (1560-1621) Wendy Kurant\n\nThomas Harriot began his professional life working for Sir Walter Raleigh (1552– 1618) as ship designer, navigational instructor, and accountant. In 1585, he extended his professional activities from England to America, where he served as cartographer and surveyor for Raleigh’s second expeition to Virginia which was based at the ill‑fated Roanoke, site of the infamous Lost Colony. Named after the English sovereign Queen Elizabeth I, Virginia and Roanoke is now modern day North Carolina. Harriot also served as the expedition’s historian, keeping a remarkably‑detailed account he later published as A Briefe and True Report of the New Found Land of Virginia. In it, he offered a firsthand account written by an Englishman for an English audience. He detailed crops and building materials both as commodities and as means to support colonists. He also offered some details of the culture and lives of the Native Americans he encountered.\n\nFigure 1. Portrait Believed to Be of Thomas Harriot\n\nHis last stint with Raleigh was as manager of Raleigh’s estates in Waterford, Ireland. Harriot then worked for Henry Percy, the Ninth Earl of Northumberland (1564–1632). From Percy, Harriot received extensive lands and a substantial pension. He devoted the remainder of his life working for himself, so to speak, conducting experiments with the refraction of light and the trajectory of projectiles. His astronomical drawings recorded what later become known as Halley’s Comet, and his invention of the perspective trunk led to the invention of the telescope. Harriot’s scientific objectivity, observational powers, and notice of concrete particulars contribute to the valuable record of his A Briefe and True Report. This work had an impact not only in England but also the Continent.\n\nFigure 2. Tiltle Page of A Briefe and True Report of the Newfound Land of Virginia\n\nSource:\n\nBecoming America, Wendy Kurant, ed., CC-BY-SA\n\nImage Credits:\n\nFigure 1. “Portrait Believed to Be of Thomas Harriot,” unknown, Wikimedia, Public Domain.\n\nFigure 2. “Tiltle Page of A Briefe and True Report of the Newfound Land of Virginia,” Livinncary, Wikimedia, Public Domain."}, {"url": "https://sirwalterraleigh.org/", "page_content": "Sunday, October 23 Most of us will depart as a group from Washington DC on a flight that will take us to Ireland where Sir Walter Raleigh's meteoric public career began in 1580 in the aftermath of the gory massacre of hundreds of Irish patriots and their collaborators who sought to expel hated English overlords from their sacred homeland. We'll pick up on his notable heritage and formative years later. But there's no better place to begin than on the island where Raleigh's crushing of an Irish rebellion brought him to the attention of Queen Elizabeth and the royal court in London. Ireland was also where Raleigh assigned Thomas Harriot to survey and map a vast estate awarded to him by Queen Elizabeth for his services in quelling Irish aspirations and in launching an English empire in North America.\n\nDay 1 Depart from Washington DC (and other connecting cities)\n\nMonday, October 24 We will land at Dublin's international airport on our way to the land of Youghal (pronounced y’all)—where Raleigh lived as he surveyed his Irish estate. Although most of us will be bleary-eyed from overnight journeys, we'll begin our discussions of Raleigh's many adventures in Ireland as we bus from Dublin to the historic site of Castlemartyr (near Youghal) where we will lodge while in Ireland. Castlemartyr and nearby Youghal are Sadly, the windy bluff of Smerwick where Raleigh and the poet Edmund Spenser celebrated the bloody execution of Irish rebels in 1580 is above Dingle Bay on the west coast of Irelandtoo far off our journey route. But as we travel, we will recount the saga of how Raleigh made his mark in Ireland and won his vast estate along the Blackwater River in County Cork and how Harriot used his mastery of geometry to chart both the Carolina coast where Raleigh conducted his first American explorations and Raleigh’s Irish estates. We'll arrive in County Cork for lunch at the cozy Castlemartyr Resort where we will be welcomed by the local leaders of a vibrant movement to preserve and promote Youghal’s deep history and the story of Sir Walter’s residence there. After a long day of travel and our safe arrival at Castlemartyr we can spend the rest of our day relaxing at this glamorous resort and its charming environs.\n\nDay 2 Arrive in Dublin\n\nTransfer via motor coach to Castlemartyr\n\nWelcome and Lunch at hotel\n\nFree time to explore on own or rest from travel\n\nOvernight Castlemartyr Resort\n\nTuesday, October 25 We’ll spend most of this day in the historic walled town of Youghal--the epicenter of Raleigh's Irish estate. He was, in fact, the Lord Mayor of the town during the reign of Elizabeth and he managed both the town and his estate from a manor house still standing and nestled in a corner of Youghal. On the first full day of our journey, we'll focus on the rich historic landmarks of the town. We’ll begin with a walking tour through Youghal's narrow streets where we will encounter buildings, walls, and gardens that predated even Raleigh's residency there. A Benedictine monastery dating from the 12th century; a water gate from the 13th century; a collegiate chapel established in the 13th century and expanded in the 14th; a Norman tower known as Tynte's Castle from the 15th century; and a host of other buildings and ruins from Raleigh's era in the 16th century. At the center of the town is the Georgian landmark Clock Gate Tower completed in 1777, almost a mirror of Philadelphia's Independence Hall. After lunch we will tour, hear heavenly music, and bow our heads in reverence at St. Mary's Collegiate Church as the ornate chapel celebrates its 801st year as a place of worship and shrine for the ancestors of Youghal. We will conclude our town visit with a private tour (thanks to its present owners) into Myrtle Grove, the 16th century residence and offices of Sir Walter Raleigh. After this unique experience we will savor our experiences of the day over a festive welcome dinner and more Irish welcomes from our host Irish friends in County Cork.\n\nDay 3 Full Breakfast at hotel\n\nMotorcoach to Youghal\n\nYoughal Guided Walking Tour\n\nLunch in Village\n\nPrivate Tour of St. Mary's Collegiate Church\n\nPrivate Tour of Myrtle Grove (not open to public)\n\nWelcome Dinner\n\nOvernight in Castlemartyr Resort\n\nWednesday, October 26 Having watched the dramatic ebb and flow of the tidal washes that occur twice daily on the coast of Ireland, we will on this day take an excursion up the scenic and historic Blackwater River. We will gander at many a natural wonder and what can be seen of the historic castle homes of Thomas Harriot at Molena Abbey, the poet Edmund Spenser at Kilcolman Castle, and Raleigh (who was also himself a much-noted poet) at Lismore Castle. We'll debark for a visit to Raleigh's impressive “third” home at Lismore. Much of the territory we will observe from Molena Abbey to Lismore were parts of Raleigh’s estate which were carefully surveyed and mapped by Harriot following his return from North America where he mapped the barrier islands of North Carolina. From Lismore we'll get on a bus that will take us for an unforgettable lunch at Ballymaloe House (a facility operated by the award winning Ballymaloe Cookery School, Organic Farm and Gardens). As we ease back toward Castlemartyr after a scrumptious meal, we'll make a stop at William Penn's Irish residence Shannengary Castle just west of Youghal. After a brief afternoon rest, we will be treated to an authentic Irish pub crawl and traditional music and entertainments through the evening streets of Youghal. We'll take our cues from some of our local hosts.\n\nDay 4 Full Breakfast at hotel\n\nGuided private boat excursion up Blackwater River viewing Molena Abbey, Kilcolman Castle, Lismore Castle\n\nLunch at Ballymaloe House (operated by the award winning Ballymaloe Cookery School, Organic Farm and Gardens)\n\nWilliam Penn Irish Residence in Shannengary\n\nEvening Pub Crawl with Irish Entertainment\n\nOvernight in Castlemartyr Resort\n\nThursday, October 27 This will be a day of travel to take us from Raleigh's Ireland to the West Country and Salisbury Plain of England where Raleigh spent his richest years at the principal English estate awarded to him by Queen Elizabeth. If flights from Cork to Bristol, England, have been restored in 2021, we'll scurry from Youghal to Cork where we will take an Aer Lingus flight from there to Bristol. Our itinerary won't allow us to linger in Bristol which was one of the greatest of the English slave trade centers. Instead, we will make a bee line to Sherborne where lies Raleigh's beloved Sherborne Castle and Garden. The impressive house today is smaller than Raleigh’s grand edifice, but it is still privately owned by the family that took over the place from the absentee Raleigh while he lived at the Tower of London. But in preparation for our tour of Sherborne, we will this day visit the impressive Montacute House located in the village of Yeovil, a few miles from Sherborne. Built by a prickly neighbor, Sir Edward Phelips, a prominent lawyer in Parliament, this unaltered architectural gem rose in 1598 just as Raleigh's financial situation was sinking toward bankruptcy. How ironic it was that Phelips became one of the leading prosecutors of the ringleaders in the Gunpowder Plot of 1605 in which both Raleigh and Harriot were implicated. Despite all of these connecting links to Raleigh's fall from grace, we will be at Montacute also because some of the greatest Elizabethan portraits from the National Portrait Gallery are displayed here while the NPG is being rebuilt over a five-year period of time. After our tour of Montacute we will repair to the renowned Eastbury Hotel in Sherborne for dinner and rest.\n\nDay 5 Full Breakfast at hotel\n\nTravel to Cork International Airport by motor coach for Aer Lingus flight\n\nArrival in Bristol UK\n\nLunch in Bristol\n\nTravel Bristol to Sherborne\n\nPrivate tour of Montacute House\n\nArrive The Eastbury Hotel\n\nDinner at The Eastbury Hotel\n\nOvernight at The Eastbury Hotel\n\nFriday, October 28 We'll saunter by bus over to Sherborne Castle and Gardens for the morning. Here we will be treated to one of the greatest highlights of our entire tour. We have arranged for the veteran archivist and curator of Sherborne, Ann Smith, to provide us with a “bespoke tour” that will enable us to confront a wide diversity of documents and artifacts from Raleigh's rough and tumble life. If you could never conceive of Raleigh from his numerous suave and well-dressed portraits as a pipe-smoker, you'll get to see here the impressive pipe from which he probably took his last puff as he walked to the scaffold and his execution. We’ll also see rare or even one of a kind Thomas Harriot wax seal on a document intended to preserve Sherborne for Bess should Raleigh face execution. These are a few of the numerous Raleigh treasures preserved in this still surviving house that Raleigh and Bess and their children considered home. We'll enjoy lunch in the town of Sherborne and then dinner there too. For those who have not been to Stonehenge or who would like to go again, we will provide an optional afternoon jaunt to this mysterious monument that has attracted millions of visitors—including Benjamin Franklin who hypothesized about its astrophysical purpose and function when he visited there with his son William in 1757. While Franklin sashayed Lord Pembroke’s palatial Wilton House (14 minutes by auto today) for dinner, we’ll have our evening meal together in Sherborne.\n\nDay 6 Full breakfast at hotel\n\nPrivate tour of Sherborne Castle & Gardens\n\nLunch in Sherborne\n\nOptional group visit to Stonehenge or free time to explore Sherborne\n\nDinner in Sherborne\n\nOvernight at The Eastbury Hotel\n\nSaturday, October 29 We will now resume our journey on the trail of Raleigh from Sherborne Castle to London. But with a very important stop in Winchester where Raleigh's political and legal problems turned from threat into imprisonment. After the death of Queen Elizabeth in 1603, Raleigh lost many of his special preferments and means of support when James VI of Scotland was crowned as James I of England. A few of his many enemies implicated both Raleigh and Harriot in a supposed plot to kidnap the new king on his triumphal parade from Scotland to London. Immediately Raleigh was escorted to the Tower of London. He was held there awaiting trial. Meanwhile, when plague threatened London, his trial was moved to Winchester. In November he came before a jury of four knights, four esquires, and four gentlemen in the same Great Hall of Winchester Castle built by William the Conqueror and which still houses the legendary great Round Table of King Arthur. We will here receive a lively rendering of Raleigh's dramatic defense of his words and threats against King James and wonder how it was that he was found guilty of treason and sentenced to be hanged and, like all traitors at the time, drawn and quartered. We will enjoy a lunch in Winchester and will then proceed to London and our lodgings at Radisson Blu Edwardian Kenilworth Hotel, our cozy base for the next six nights. Indeed, we will open our stay in London with a celebratory dinner at Radisson Blu Edwardian Kenilworth Hotel where we can memorialize our experiences in Ireland and the West Country or talk about our forthcoming experiences in London and its environs.\n\nDay 7 Full breakfast at hotel\n\nDepart Sherborne by motor coach to Winchester\n\nTour and talk at the Great Hall of Winchester Castle on King Arthur and Raleigh\n\nLunch in Winchester\n\nFree time to shop and enjoy Winchester\n\nDepart Winchester by motor coach to London\n\nLondon Welcome Dinner at hotel\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nSunday, October 30 A visit to Greenwich is always a wonderful day—if the weather cooperates. We will have faith that the gods will cooperate. From previous tours we know that our travelers like to take a leisurely boat down the Thames to Greenwich directly to a unique lunch at Trafalgars Tavern. White bait is the most popular item on the menu here and even if you don't like to see little eyes on the tiny fish you are eating, we guarantee that you'll love a dish of white bait or something else from their varied menu. You then have your choice of great venues where you can take your own tour. The National Maritime Museum is filled with maritime treasures ranging from the days of Raleigh explorations, the Spanish Armada, and England's predominance on the world's oceans from then through the Second World War. We will discuss two aspects of Thomas Harriot’s career: (1) His role as instructor of English ship captains in the theory and crafts of navigation; and (2) the maps of Ireland he drew for Raleigh among the collections of the Museum. Greenwich was the safe down river place where Henry VIII's two daughters, Mary I and Elizabeth I, were born and grew up in this lush haven. Probably the tourist favorite here is the Royal Observatory which was established in 1675 and where since 1833 atop one of its turrets a ball is lifted up an iron rod every day to drop precisely at 1 p.m. Mariners departing to cross the world's seas have since that time been able to set chronometers to determine correct positioning at nearly any point on earth. As a location where precise time has been a supreme value for hundreds of years, the Observatory was chosen in 1884 as ground zero for global time known as Greenwich Mean Time. Our travelers will be able to return via boat to our dock near Radisson Blu Edwardian Kenilworth Hotel whenever each person has finished exploring the historic sites of Greenwich and also enjoy the down town shops that are always great places for finding choice memorabilia and gifts from our tour of Raleigh's England.\n\nDay 8 Full breakfast at hotel\n\nBoat to Greenwich\n\nLunch at Trafalgar Tavern\n\nFree time to shop in Greenwich or to join a group that will hoof around to the National Maritime Museum, The Queen's House, and The Royal Observatory\n\nReturn to London by boat at leisure\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nMonday, October 31 No combined Raleigh and Harriot tour would be complete without a trip to Oxford where both of them studied at what is now Oriel College. Moreover, Harriot was a local boy who was born and grew up in the town of Oxford. We will bus from London in the morning and will tour Oriel College where our two subjects are among the large galaxy of intellects, scientists, and world leaders who have made their mark around the world. We will get a private look behind the curtain here and be able to view some of the College's Raleigh and Harriot treasures. We will also take a look at a portrait at Trinity College said to be of Harriot. Whether it is or not, it has been accepted as Harriot by scholars and publishers for many years. Since Oxford is the home of some of the greatest scholars on Raleigh and the Elizabethan era, we will meet and converse with a few of these stars. We will also enjoy lunch in the town and take a walk around pausing at such renowned landmarks as the Radcliffe Camera (1748, a reading room), the Bodleian Library (1320,”Old Bodley”), and the Old Ashmolean (1683), which now houses the Museum of the History of Science. We'll also saunter by some of Oxford's historic colleges which have made the University a center of learning, competition, and contemplation for almost a millennium. After our tour, we'll bus back to London in time for those travelers wanting more to venture out to London's vibrant and magnetic West End for an early group dinner and the opportunity for theatre goers to select a play that they might wish to see on their own. Since our hotel is only a few short blocks from the West End theaters, we can stroll at our leisure among the theaters and even buy tickets onsite.\n\nDay 9 Full breakfast at hotel\n\nDepart London by motor coach to Oxford\n\nPrivate tour of Oriel College, a constituent college of Oxford University\n\nView of Raleigh and Harriet treasures\n\nLunch in town\n\nGuided walking tour of Oxford\n\nReturn by motor coach to Radisson Blu Edwardian Kenilworth Hotel\n\nGroup dinner in the West End for theatre goers\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nTuesday, November 1 Although the National Portrait Gallery is closed for rebuilding over the next five years, we will be treated on this day with a unique seminar arranged for us at the NPGs conservation laboratory. The NPG has been examining all of its Elizabethan portraiture during the last decade and the unanticipated findings in portraits including of Elizabeth and Raleigh are astonishing. Our guide will be Dr. Charlotte Bolland, Senior Curator of Research and of 16th Century Collections at the NPG. We will then stroll down St. Martin's Street through Trafalgar Square taking note of Raleigh and American historic corners along the way. We'll swing by Benjamin Franklin's House on Craven Street (the only Franklin home still standing) and then pause at the Sherlock Holmes Tavern for lunch. Both Franklin’s residence and the Sherlock Holmes Tavern are very close to the site of the grand Durham House which was provided to Raleigh as a London residence. It was at the Durham House where Harriot conducted his school on navigation and where Harriot lived while he worked with Raleigh to explore and colonize the Carolina coast and Virginia. After lunch we'll bus over to the British Museum—one of the great museums of the world. Among other things relating to our central figure in the Museum are the original watercolors sketched and colored by the artist John White when he and Harriot were sent by Raleigh to Virginia in 1585. These small, but powerful drawings have defined the way we envision American Indians from the 16th century to the present. It takes almost a special dispensation from Elizabeth II to see these fragile gems of art. But our viewing has been permitted by the Museum's curator Kim Sloan, Curator of British Drawings and Watercolours, who will be our guide and notable authority. There will be time afterward for us either to spend the afternoon in the engrossing galleries of the British Museum, take a walk around the entertaining Bloomsbury neighborhood or return to Radisson Blu Edwardian Kenilworth to rest up for your own evening of dining, revelry, or theatre in the West End or elsewhere.\n\nDay 10 Full breakfast at hotel\n\nDepart hotel for St. Martin's Place\n\nPrivate talk at the National Portrait Gallery Conservation Laboratory on Elizabethan Portraits\n\nStrolling walking tour (Trafalgar Square, National Gallery—George Washington Statue, St. Martin-in-the-Fields, Benjamin Franklin House)\n\nLunch at Sherlock Holmes Tavern\n\nPrivate showing of John White Watercolors and tour of British Museum\n\nReturn by motor coach to Radisson Blu Edwardian Kenilworth Hotel or stay and explore on your own\n\nFree time\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nWednesday, November 2 We visit two places on this day where doom surrounded Raleigh. It was at the grand mansion house owned by the Duke of Northumberland known as Syon where Raleigh was said to help formulate the 1603 plan (Bye Plot) to kidnap King James VI of Scotland before he could be crowned King James I of England. Harriot lived at Syon throughout these stormy years. Once the storm blew over for Harriot, he used Syon as his laboratory and observatory for two decades. It was here that Harriot observed the Sun and mapped its spots; the Moon of which he drew a map; and identified moons circling Jupiter and Saturn. Both Raleigh and the Duke of Northumberland were found guilty of treason against the King. Both also were imprisoned at the Tower of London for the rest of their lives. Since Harriot continued his residence at Syon House, he was able to serve both Northumberland and Raleigh as purveyor of books, clothes, food, and anything else they needed while imprisoned. We will have lunch at Syon or nearby where we will be able to pause and talk about plight of Harriot and his two imprisoned patrons—Raleigh and Northumberland. Given this background, we will next proceed to the Tower of London itself for a special guided tour of the spaces where Raleigh and Northumberland lived during some of the saddest, but most productive periods of their lives. We will leave the Tower with bowed heads for the fate of these great figures of the Elizabethan era. But we will also understand that the Tower of London was always a very special prison—used almost always to confine prominent, even knighted political prisoners until the government could decide what to do with them. We'll head back to Radisson Blu Edwardian Kenilworth from which we can all, once again, choose a play or some other entertainment for the evening in London.\n\nDay 11 Full breakfast at hotel\n\nTransfer by motor coach to Brentford, England\n\nPrivate tour of Syon House\n\nTransfer by motor coach to Central London\n\nLunch\n\nSpecial tour of the Tower of London\n\nTransfer by motor coach hotel\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nThursday, November 3 The culminating events of our Raleigh tour will occur on this day. When King James I decided the time had come in 1618 for Raleigh to be executed, he gave two exceptions to the directive of the 1603 court that had declared Raleigh a traitor. The first deviation was to declare that Raleigh would only lose his head at the hands of an axeman! There would be no need to draw and quarter his body as was normal in the case of traitors. The second modification was that Raleigh's head was to be handed over to his widow Bess who would be awaiting nearby after it was severed. Thus ordered, Raleigh was removed from the Tower of London on October 28, 1618 and held in a guard house adjacent to St. Margaret Church which is still today in the shadow of Westminster Abbey where kings and queens are crowned and married and funeralized. We will go to St. Margaret Church on the 402nd anniversary of Raleigh's execution. We will get all of the particulars from a colorful denizen of the Church, one Jeremy Fairhead. He'll describe to us the events of that day, where the scaffold was located, and how bodies and remains were scurried from one place to another. After this solemn commemoration, we'll hear a rendering of Raleigh's memorable speech from the scaffold. We’ll distribute copies of the notes taken by Thomas Harriot of the speech as he witnessed both the speeches and the bloody execution. Travelers will have the option of touring the adjacent Westminster Abbey afterword. We will be free for some last-minute shopping or sight-seeing during the rest of the afternoon. For the evening, we will venture out to our journey organizers' favorite newly discovered restaurant. It's called Browns' and it's located in the St. Martins area. We favor this place for our celebratory Farewell Dinner because it has wonderful food in a courtroom setting. In fact, it was formerly a courthouse. Here we will be subpoenaed one and all to give testimony to our gathered travelers as to the fast friends and good memories we will take from our Raleigh pilgrimage forever.\n\nDay 12 Full breakfast at hotel\n\nTransfer by motor coach to Central London\n\nPrivate, guided tour of St. Margaret Church\n\nSelf-guided tour Westminster Abbey\n\nTransfer to by motor coach to Radisson Blu Hotel or explore on own\n\nFree Afternoon\n\nFarewell Dinner at Browns Brasserie & Bar Covent Garden\n\nOvernight at Radisson Blu Edwardian Kenilworth Hotel\n\nFriday, November 4 We'll get a timely start to London Heathrow from which we will depart to Dulles International Airport (and other destinations)"}]}