{"Thomas Harriot was a friend of the mathematician and astronomer Johannes Kepler.": [{"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz Numbers and Mathematics\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://lens.monash.edu/@science/2021/07/26/1383475/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on", "page_content": "Four hundred years ago, on 2 July, 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8000 pages of scientific research, but it’s only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of renowned pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nThomas Harriot’s 1609 map of the Moon, drawn by observing through a telescope. Image: Wikimedia\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance, all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea – he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: Our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo weren’t the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries – the law of refraction, and why the rainbow has its magical colours and unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens, or why your leg looks wobbly when you dip it in a swimming pool.\n\nA diagram from Ibn Sahl’s 10th-century treatise on optics showing the path of light refracted by a lens. Image: Wikimedia\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right – Ibn Sahl is a notable pioneer whose geometrical diagram of light focused by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers, even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did. His derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters, and sailing the high seas as Raleigh’s navigational advisor.\n\nThomas Harriot published only one work in his lifetime – a report on his stay in North America in the 1580s. Image: Wikimedia\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s US before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted ...\n\n“... to live a private life for the love of learning that I might study freely”.\n\nConclusion\n\nIn the late 1590s, Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot didn’t need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost-finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They’re now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no one knows much about him as a person – not even his birthday. Nevertheless, he’s fascinated scholars for the past half-century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour.\n\nThis article originally appeared on The Conversation."}, {"url": "https://encyclopediavirginia.org/entries/hariot-thomas-ca-1560-1621/", "page_content": "Oxford and Durham House Hariot enters the historical record with his matriculation at Oxford in 1577 at the age of seventeen. His tentative date of birth is based on this information. Notes written at the time indicate that he was raised in Oxfordshire and his father was a commoner. Nothing else for certain is known about his early life. Hariot arrived at Oxford with exceptional talents in mathematics and the sciences, but at a time when these subjects were not particularly valued. This was beginning to change, however, as English adventurers began to recognize the connection between mathematics and the navigational arts necessary to further the nation’s developing interests in colonization, piracy, privateering, and trade, especially in North America. At Oxford, Hariot met Richard Hakluyt (the younger), who went on to edit the influential Principall Navigations of the English Nation (1589), a polemic on behalf of future English colonization disguised as a history of past English successes. Hariot also probably knew Thomas Allen, an Oxford faculty member who collected the latest manuscripts, books, and instruments connected with mathematics and astronomy. After receiving a BA from Oxford in 1580, Hariot relocated to London, where his interest in applying mathematics and astronomy to questions of navigation brought him to the attention of Walter Raleigh. A favorite of Queen Elizabeth I, Raleigh had obtained permission to establish English colonies in North America. By 1583, Hariot was serving Raleigh at his London residence, Durham House, by focusing on open-sea navigation. The Portuguese and Spanish understood how to cross the Atlantic Ocean to the New World, but the English, with notable exceptions such as Sir Francis Drake, did not and were forced to hug the coasts. Before he could teach it, Hariot needed to master the subject himself, and he set about collecting, building, and learning to use standard navigational instruments, including the astrolabe, cross staff, and sextant. He studied the mathematics required to determine one’s position in the open ocean, collected the best sea charts and maps, and learned the basics of astronomy necessary to navigate by the stars, moon, and sun. He then began lecturing to Raleigh’s sea captains on these subjects in his room at Durham House and collected the knowledge in the now-lost Arcticon. Raleigh was planning to attempt a colony on the mid-Atlantic coast of North America and in 1584 sent a reconnaissance voyage that landed on Roanoke Island. There, commanders Philip Amadas and Arthur Barlowe met and returned to England with two Virginia Indians, Manteo and Wanchese. Recognizing that communication with the Indians would be crucial for a successful colony, Hariot worked with the two men and learned to speak their form of the Algonquian language. Hariot even developed his own phonetic alphabet, which allowed him to record the sounds of Algonquian words and to create a now-lost English-Algonquian dictionary. Hariot’s work in this area made him one of the most advanced linguists of the day and recommended him as a member of Raleigh’s Roanoke expedition in 1585.\n\nRoanoke and A briefe and true report A briefe and true report of the new found land of Virginia The Roanoke colonists were mostly military men, the most prominent exceptions being Hariot and the artist John White, who had served as expedition artist on one of Martin Frobisher’s voyages to Greenland. The colonists arrived at Roanoke late in June 1585, but one of their ships ran aground and they lost much of their provisions. After the departure in August of the colony’s two commanders, Sir Richard Grenville and Thomas Cavendish, Ralph Lane assumed governorship, and his relations with the local Indians were friendly at first. The situation deteriorated, however, as the Englishmen failed to find reliable sources of food, and when Sir Francis Drake arrived in June 1586, Lane decided to return the surviving colonists to England. The year had not been a waste for Hariot, though. With the help of Manteo and Wanchese, and in the company of John White, he had explored the area surrounding Roanoke and, with White, joined a party that sailed north to the Chesapeake Bay and up the Elizabeth and Nansemond rivers, even encountering the Chesapeake Indians at their principal town of Skicoac. He and White used these travels to collaborate on the first accurate maps of the east coast of North America. Using angle-measuring tools to establish latitude and longitude, Hariot mapped out triangle-shaped areas and either recorded these angles in a notebook for later use or, while in the field, sketched these triangles directly onto a sheet of paper attached to a plane table. White, an accomplished painter and illustrator, then finished the maps. While some of the White-Hariot maps remained in manuscript form and did not receive wide circulation, others—such as the small map of Roanoke Island and the large map of the entire Outer Banks region—appeared in Theodor de Bry’s illustrated edition of Hariot’s A briefe and true report of the new found land of Virginia, becoming models for their time of accurate cartography in the New World. A briefe and true report was, perhaps, Hariot’s most important contribution to England’s colonization efforts. First published in 1588, it appeared again the next year as part of Richard Hakluyt (the younger’s) Principall Navigations. Hakluyt then convinced de Bry to publish a third version as the initial volume in his America series. This last includes etchings of the White-Hariot maps as well as etchings based on White’s watercolor portraits of Virginia Indians and scenes of Indian life. Published in English, French, German, and Latin, the de Bry version enjoyed a wide European audience. While the Report is sometimes considered scientific, it is more accurately viewed as commercial discourse. Throughout, Hariot argues four related points. First, the 1585 colony failed because many members of the colony were unprepared for the rigors of colonization. Although these men slandered the colony and its leaders upon arriving home, in Hariot’s view Raleigh’s colonization program should be allowed to continue. Second, the Roanokes and other Indian tribes are not to be feared by the English, who possess superior technology and culture. Third, the land in Virginia is abundant enough to provide future colonists with adequate food and building materials. And fourth, Virginia offers a less expensive source for a wide range of trade goods, including shipping supplies, dyes for the cloth industry, and wine.\n\nLater Years In 1595, Hariot received land from Henry Percy, ninth earl of Northumberland, to allow him to continue his scientific and mathematical work. Percy was imprisoned in 1605 for his connection to the Gunpowder Plot, an attempt on the life of King James I on behalf of greater freedom for English Catholics. Hariot’s connection to Percy also landed him in prison, but only briefly. (Percy’s younger brother George was one of the original Jamestown colonists.) Sir Walter Raleigh also ran afoul of the king and was beheaded in 1618. In the meantime, Hariot pursued his interest in astronomy. His unpublished notes on the appearance of Halley’s Comet in 1607 were later used to accurately calculate its orbit. In 1609, he used a telescope of his own making to sketch the moon—four months before the Italian astronomer Galileo Galilei more famously accomplished the same feat. In 1610, he was the first to observe sunspots, and in 1611, he produced the first map of the moon. Hariot died in London on July 2, 1621, of cancer of the nose, probably caused by heavy tobacco use. A posthumous work, Artis Analyticae Praxis, published in 1631, helped to establish the English school of algebra."}, {"url": "https://www.nature.com/articles/d41586-019-01174-x", "page_content": "A portrait believed to be of Thomas Harriot, painted around 1602.Credit: The Picture Art Collection/Alamy\n\nThomas Harriot: A Life in Science Robyn Arianrhod Oxford University Press (2019)\n\nThe phrase ‘publish or perish’ came into use in the twentieth century to encapsulate academic pressures. It is also a lesson from the life of Thomas Harriot, who lived when there were no academic journals, and who never taught at a university.\n\nA contemporary of William Shakespeare, Harriot was an English mathematician, astronomer and natural philosopher whose original work bears comparison with that of Johannes Kepler and Galileo Galilei. Yet, outside the enthusiastic circle of historians of early modern science who call themselves Harrioteers, his name is almost unknown: he never published his mathematical work. In Thomas Harriot: A Life in Science, mathematician Robyn Arianrhod sets out to explain how historians have nevertheless been able to place him, almost four centuries after his death in 1621, among the founders of modern science.\n\nHarriot is elusive. The earliest known document concerning him lists him as a “plebeian” scholar registering to study at the University of Oxford in 1577. He never married and left no children. By 1583, he was employed by Walter Raleigh, naval commander, explorer and favourite of Queen Elizabeth I, to teach astronomy and navigation — a field he greatly improved — to sea captains. He was celebrated in his lifetime by the writer Gabriel Harvey as among the “profound mathematicians”, alongside Thomas Digges and John Dee. Afterwards, he was largely forgotten.\n\nHe has a higher profile in the United States, thanks to the one work he did publish. A Brief and True Report of the New Found Land of Virginia is a first-person account of a 1585–86 voyage sent by Raleigh to survey what is now part of North Carolina. The party landed on Roanoke Island and surveyed it and the nearby mainland; almost all its members returned to England in June 1586. Harriot was “employed in discovering”. His report, published in 1588, includes the first detailed English description of the language and customs of the Algonquian people, and of the region’s natural resources and climate. Arianrhod shows that his interest in local people was far from typical: he learnt their language, admired how they interplanted beans, squashes and maize (corn), and respected their religion. Meanwhile, the military expedition leaders fatally soured relations by overreacting to perceived wrongdoing and making unreasonable demands.\n\nPrevious biographers — the US authors Henry Stevens in 1900 and John Shirley in 1983 — were prompted by the Brief and True Report. Neither fully addressed Harriot’s scientific contributions, as Arianrhod tries to do. Harriot’s will mentioned a trunk full of mathematical papers. A few were circulated and partly published by friends such as the mathematician Walter Warner after his death, but what became of the collection was unknown until 1784, when it turned up in some disorder at Petworth House, home to heirs of the ninth Earl of Northumberland, Harriot’s patron after Raleigh. Only since the mid-twentieth century have scholars made sense of the thousands of manuscript sheets.\n\nWhat they reveal is astonishing. To mention only a portion of Harriot’s work, he discovered Snell’s law of refraction two decades before mathematician Willebrord Snell; formulated laws of motion and falling bodies independently of Galileo and decades before Isaac Newton; produced the first drawing of the Moon through a telescope and made important observations of sunspots, again independently of Galileo; played with binary arithmetic nearly a century before Gottfried Wilhelm Leibniz; and was the first to develop fully symbolic algebra. There are well-grounded suspicions that René Descartes saw some of Harriot’s papers before publishing The Geometry in 1637.\n\nWhere Harriot falls down, say some scholars, is that he did not draw his observations into coherent theory. It’s possible he just never got round to it. Harriot spent his adult life in the households of Raleigh and Northumberland. They paid him generously, and all appearances suggest that he was a friend rather than a servant. However, both were players on the volatile political scene, and malicious rumours of atheism and necromancy did the rounds. Soon after James I succeeded Elizabeth I in 1603, Raleigh was convicted of treason, and Northumberland of lesser charges when a cousin was involved in the Gunpowder Plot to murder the king. Both were imprisoned in the Tower of London; Raleigh was executed in 1618.\n\nHarriot spent an anxious few weeks in prison because of his association with Northumberland; he might have felt the need to keep his head down over the years. He died aged about 60 from cancer of the nose, possibly caused by his enthusiasm for tobacco after his American adventure.\n\nThe lack of finished work makes evaluating his contribution complex. Arianrhod does not hesitate to call him a genius, and the evidence she presents is impressive. Yet she fully explores his rightful position in the pantheon only in a page-long endnote; I think this shortchanges the “general reader” she seeks to enlighten. Some might find her technical passages challenging, although they are necessary to her argument. And it is irksome to see diagrams relating to Harriot’s navigational work in an appendix, rather than with the text they illustrate.\n\nHas Arianrhod, as she intended, “put a human face to scientific inquiry in the Elizabethan and Jacobean worlds”? She has revealed a scientific mind, but the face is more elusive: the one supposed portrait of Harriot is of unknown provenance and, because of a discrepancy in dates, some historians doubt it is him.\n\nThis black-clad, driven, sceptical man, “contented with a private life for the love of learning” as he wrote to his captors, still declines wholly to step into the light."}, {"url": "https://kids.britannica.com/students/article/Thomas-Harriot/325789", "page_content": "(1560–1621). English mathematician, astronomer, and natural scientist Thomas Harriot introduced some of the symbols used in algebra today. He published very little but left thousands of pages of manuscripts, which scholars did not closely study until the mid-20th century.\n\nHarriot was born in 1560 in Oxford, England. He lived at Sir Walter Raleigh’s home in London, England—Durham House—which was a center for Raleigh’s preparations to sponsor a colony on Roanoke Island in “Virginia” (now in North Carolina). Harriot was deeply involved. While living at Durham House, he worked out mathematical solutions to various navigational problems, devised navigational instruments, helped organize and raise funds for the expeditions, and kept Raleigh’s accounts. He may have gone on the first expedition Raleigh sent to Roanoke Island in 1584. Harriott was certainly on the next one, from April 1585 to July 1586, which he described in 1588 in A Briefe and True Report of the New Found Land of Virginia—Harriot’s only book published in his lifetime. By 1589 Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nIn the 1590s the political tide in England began to turn against Raleigh. Harriot found a new patron in Henry Percy, the 9th earl of Northumberland, who gave him an estate in Durham, England, in 1595. Percy also gave Harriot the use of a house near London as a residence and scientific laboratory for his studies in astronomy, meteorology, optics, chemistry, and mathematics. Harriot applied mathematics to the bending of light and to the path of a cannonball shot from a gun (ballistics). He was the first to discover the principle of the refraction of light now called Snell’s law, which the Dutch scientist Willebrord Snell discovered independently 20 years after Harriot.\n\nAfter Queen Elizabeth’s death in 1603, Raleigh was arrested and charged with treason. In the course of his trial, both he and Harriot were accused of atheism, although there is nothing in Harriot’s writings to substantiate the charge. In the turmoil following the discovery of the Gunpowder Plot of 1605, Harriot was arrested on suspicion of having cast King James’s horoscope; his patron, Percy, was also arrested. Harriot was soon released, but Percy remained in the Tower of London until 1621.\n\nWith both of his former patrons in prison, Harriot returned his attention to his studies of optics and astronomy. His reputation reached the German astronomer Johannes Kepler, who initiated an exchange of letters. Harriot observed Halley’s comet and, like his Italian contemporary Galileo, used a telescope to observe sunspots and the moons of Jupiter. In 1609 and 1610 Harriot drew sketches of the Moon as viewed through a telescope.\n\nHarriot’s last eight years were marred by having cancer of the nose and by Raleigh’s execution, which Harriot was present to witness. Harriot died in London on July 2, 1621. His Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (“Application of Analytical Art to Solving Algebraic Equations”) was published posthumously in 1631. Both the editor and Harriot himself introduced some of the mathematical symbols used in algebra today. Harriot was among the first to solve mathematical equations involving negative and complex roots and imaginary numbers."}, {"url": "https://theconversation.com/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on-163167", "page_content": "Four hundred years ago, on July 2 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8,000 pages of scientific research, but it is only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of famous pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea: he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo were not the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries: the law of refraction, and why the rainbow has its magical colours and its unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens or why your leg looks wobbly when you dip it in a swimming pool.\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right: Ibn Sahl is a notable pioneer whose geometrical diagram of light focussed by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did: his derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was the controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters and sailing the high seas as Raleigh’s navigational advisor.\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s USA before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted\n\nto live a private life for the love of learning that I might study freely.\n\nConclusion\n\nIn the late 1590s Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot did not need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They are now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no-one knows much about him as a person – not even his birthday. Nevertheless, he has fascinated scholars for the past half century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour."}, {"url": "https://thatsmaths.com/2015/08/27/thomas-harriot-mathematician-astronomer-and-navigator/", "page_content": "Thomas Harriot: Mathematician, Astronomer and Navigator\n\nSir Walter Raleigh, adventurer, explorer and privateer, was among most colourful characters of Tudor times. He acquired extensive estates in Waterford and Cork, including Molana Abbey near Youghal, which he gave to his friend and advisor, the brilliant mathematician and astronomer Thomas Harriot.\n\nRaleigh needed an excellent navigator on his transatlantic voyages, and he brought along Harriot, who had earlier been his mathematics tutor. Harriot had written a text, Archicon, on navigation after graduating from Oxford.\n\nHarriot accompanied Raleigh on his expedition to Virginia in 1585, and carried out surveys and studies of local Indian languages while there. In preparation for the voyage, Rayleigh asked him about the most efficient means of stacking cannon balls on a ship deck. Harriot came up with the solution known to all grocers used to stacking oranges. He later corresponded with famed astronomer Johannes Kepler, who conjectured that the usual packing method was the most efficient. It was some four centuries before a rigorous proof of Kepler’s conjecture was produced in 1998.\n\nHarriot’s main contribution to navigation was in finding a mathematical formula for drawing lines of latitude on a chart so that a route with constant compass bearing would be a straignt line on the map. The resulting map is the projection discovered earlier by the Flemish cartographer Gerardus Mercator.\n\nHarriot also discovered an important result for geometry on the sphere. The sum of the angles of a spherical triangle is always larger than two right angles. The amount E by which it exceeds 180° is called the spherical excess. The 16th century French mathematician Albert Girard showed that this excess determines the surface area of the triangle: the radius squared by the excees gives the area (in symbols, A=R²E). This result was discovered earlier, but not published, by Harriot.\n\nIn 1607 Harriot observed and sketched what was later called Halley’s Comet, using an early telescope. In addition, he is credited with producing the first map of the Moon. His only published work is a text in algebra, which includes a treatment of negative and complex roots of polynomial equations. In his writing on algebra, Harriot introduced several novel symbols, some of which, like “<” and “>” for ‘less than’ and ‘greater than’, are still in use today.\n\nIn his report on the Virginia expedition, Harriot described how Indians dried and shredded tobacco leaves and smoked them in pipes. He recommended smoking as medicinally beneficial, ideal for ‘purging superfluous phlegm and other gross humours’. His own end came as a result of a cancerous tumour of the nose, probably resulting from his use of tobacco."}, {"url": "https://euro-math-soc.eu/review/thomas-harriot", "page_content": "As a young mathematician and astronomer, Thomas Harriot (c. 1560-1621), was hired by Sir Walter Ralegh, to train the captains of the ships ready to cross the Atlantic and claim some territory for England in the New World. Ralegh was a poet, politician, and frequenter of the court of Queen Elisabeth I. The faith of the two man was entangled since. A first expedition brought two native Americans back to England and Harriot learned their language and invented a phonetic alphabet to write it down. He even crossed the ocean himself to visit their home land during a second expedition. After his return, he wrote the only book published during his life: The Briefe and True Report of the New Found Land of Virginia (Virginia named after Elisabeth, the virgin queen). He continued working for Ralegh as a land surveyor. Later Harriot got employed by Henry Percy, 9th Earl of Northumberland. With observations and tedious computations he improved his skills as an astronomer, a mathematician, and a physicist.\n\nElisabeth, the short tempered virgin queen, depended on trusted advisors like Ralegh and Percy, but when Ralegh got married without her consent, she considered it treason. The period was turbulent with many political en religious tensions for example with the catholic Queen Mary of Scots, and hence also with France and Spain resulting in naval battles. Privateering was a lucrative pastime for the crew of the ships that were exploring the New World. Political compromises and treason, spying and conspiracies, were common games for Queen Elisabeth and her successor King James. Take on top of that the emergence of the scientific revolution of the 17th century, and the exploration of the North and South Americas, and Arianrhod has all the ingredients to write a thrilling and adventurous novel about it, and so he did. Only it is all based on true and well documented facts.\n\nArianrhod has found a good balance between explaining the mathematical and astronomical work of Harriot, and sketching what happened on a political and personal level of the main characters that he describes in the turmoil of events at the end of the 16th and the early 17th century. These main characters whose fortunes and misfortunes are told, are besides Harriot mainly Ralegh and to some extend also Percy but there are many others as well. Too many to keep track of if this were a fiction novel, but real life is not that simple. A name list in the appendix with one line description per name might have been welcome for a reader not so familiar with the period, its politics and its science.\n\nIt is characteristic of many biographers that they bring an idolatrous glorification of their subject. Somehow this struck me in this book too. It is clear that Arianrhod describes Harriot and Ralegh as the worthy heroes with almost sacred virtues. For example the attitude that Harriot and Ralegh have towards the native Americans, considering them as friends and treating them with respect, leaving their dignity is unusual for that time. The devotion of Ralegh for his queen, even when she locked him up in the Tower of London for many years (as she also did with Percy) is outspoken. His continued attempts to colonise parts of North and South America to flatter the Queen (which both turned out to be disastrous) and the noble way he behaved on the scaffold when he was beheaded under King James I are almost beyond human limits.\n\nHarriot fell under the bad faith of his employers when they were accused of treason, and that shone on him and his work and ideas were scrutinized for possible atheistic elements. He was even imprisoned for a short while on the charge that he had cast an horoscope on King James during the Gunpowder Plot. However, he always tried to stay somewhat in the shadow, concentrating on his scientific work, and so he escaped most of the misfortunes that befell on his employers and could have been his faith too. This is one element of excitement, but the whole book is a thriller: will the pioneers survive crossing the ocean, will they survive in the midst of unknown tribes, will the prisoners of the Tower be executed, will the catholic Gunpowder Plot or the courtier's Main Plot against King James be a success, will the war at sea with Spain be won, will the money be raised for yet a new expedition,... all components that can bring some tension in an engaging story told with brio. That is why, besides Harriot, Ralegh, and Percy, many other (mostly political and scientific) characters are staged in this complicated interplay of intrigues. And Arianrhod is not the first to use these elements in a book. He suggests that Shakespeare has used some of the events described here as scenes in his plays.\n\nWhen it comes to Harriot himself, these parts of the book are mainly about his scientific achievements. The reader is instructed about how Harriot explained the seamen what they should know to find the position of his ship, and how they could compute it in an efficient way. We learn about his study of the loxodromic curve and the equiangular spiral, how he unravelled the secret of the Mercator projection, how he measured the acceleration of free falling objects to study gravitation and how he computed the trajectory of a canon ball (that was before Newton formulated his laws of motion). Harriot studied the precession of the Earth and the Gregorian calendar, the refraction of light and gave an explanation for the rainbow. We read about his atomistic views, his exploration of probability theory, and of course his astronomical computations and his study of sunspots. He produced a map of the moon and he had some correspondence with Kepler. He was also one of the first to simplify algebra by introducing symbolic notation: he used letters for variables, he had a notation for exponents, a variant of our equal sign,... Arianrhod places all his discoveries in context, sometimes going back to Greek antiquity or by discussing contemporaries or scientists who came after Harriot who discovered the same things independently, and whose name became attached to these results.\n\nIt is a shame that Harriot did not publish more because that would certainly have given him a reputation comparable to Galileo, Kepler, and cartographers and mathematicians of his time. When at the age of sixty he seemed to be ready to start rounding up his work and publish it, he got health problems. It might have been a kind of cancer that started with his nose that finally killed him. It is not unlikely that it was caused by excessively smoking tobacco. Allegedly he, and his employer Ralegh, are responsible for introducing pipe smoking in England. He made his testament and asked some friend to order his notes and publish them posthumously. However not much came out of that. His notes got lost until they were rediscovered at the end of the 18th century, but again, it took a long time before it was recognized that Harriot had a lot of results that we now know by the name of other scientists, while Harriot had these already much earlier. Slowly Harriot's achievements were realized by historians analysing his notes that are now fully digitized and made available through the European Cultural Heritage Online.\n\nTo conclude: this is a marvelous book because of the engaging way it is told, very much unlike a dull biography with an enumeration of facts. Moreover it is also well documented by additional material to be found in the last 100 pages of the book. There you can find a number of graphic illustrations that are needed to understand some of the mathematics that are discussed. These are moved to the appendix probably to allow the reader to skip some of the mathematics if he or she is not interested. Many of these extra pages are filled with notes that explain some background or give the origin of a quote or a justification for a statement in the text. Of course the list of primary and secondary sources used are there too, and a well stuffed index of names and subjects. A warmly recommended read about England in the period of Shakespeare, shortly before Newton, with in the background a turbulent dance of politics, when war could still be avoided by marriage, but fighting over colonizing the Americas, and over religious controversies never ceased. On this canvas Arianrhod paints the bubbling emergence of the Scientific Revolution to which Harriot was a silent contributor."}, {"url": "https://www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/thomas-harriot", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}], "Thomas Harriot was a member of the scientific circle of the Virginia Company of London.": [{"url": "https://encyclopediavirginia.org/entries/hariot-thomas-ca-1560-1621/", "page_content": "Oxford and Durham House Hariot enters the historical record with his matriculation at Oxford in 1577 at the age of seventeen. His tentative date of birth is based on this information. Notes written at the time indicate that he was raised in Oxfordshire and his father was a commoner. Nothing else for certain is known about his early life. Hariot arrived at Oxford with exceptional talents in mathematics and the sciences, but at a time when these subjects were not particularly valued. This was beginning to change, however, as English adventurers began to recognize the connection between mathematics and the navigational arts necessary to further the nation’s developing interests in colonization, piracy, privateering, and trade, especially in North America. At Oxford, Hariot met Richard Hakluyt (the younger), who went on to edit the influential Principall Navigations of the English Nation (1589), a polemic on behalf of future English colonization disguised as a history of past English successes. Hariot also probably knew Thomas Allen, an Oxford faculty member who collected the latest manuscripts, books, and instruments connected with mathematics and astronomy. After receiving a BA from Oxford in 1580, Hariot relocated to London, where his interest in applying mathematics and astronomy to questions of navigation brought him to the attention of Walter Raleigh. A favorite of Queen Elizabeth I, Raleigh had obtained permission to establish English colonies in North America. By 1583, Hariot was serving Raleigh at his London residence, Durham House, by focusing on open-sea navigation. The Portuguese and Spanish understood how to cross the Atlantic Ocean to the New World, but the English, with notable exceptions such as Sir Francis Drake, did not and were forced to hug the coasts. Before he could teach it, Hariot needed to master the subject himself, and he set about collecting, building, and learning to use standard navigational instruments, including the astrolabe, cross staff, and sextant. He studied the mathematics required to determine one’s position in the open ocean, collected the best sea charts and maps, and learned the basics of astronomy necessary to navigate by the stars, moon, and sun. He then began lecturing to Raleigh’s sea captains on these subjects in his room at Durham House and collected the knowledge in the now-lost Arcticon. Raleigh was planning to attempt a colony on the mid-Atlantic coast of North America and in 1584 sent a reconnaissance voyage that landed on Roanoke Island. There, commanders Philip Amadas and Arthur Barlowe met and returned to England with two Virginia Indians, Manteo and Wanchese. Recognizing that communication with the Indians would be crucial for a successful colony, Hariot worked with the two men and learned to speak their form of the Algonquian language. Hariot even developed his own phonetic alphabet, which allowed him to record the sounds of Algonquian words and to create a now-lost English-Algonquian dictionary. Hariot’s work in this area made him one of the most advanced linguists of the day and recommended him as a member of Raleigh’s Roanoke expedition in 1585.\n\nRoanoke and A briefe and true report A briefe and true report of the new found land of Virginia The Roanoke colonists were mostly military men, the most prominent exceptions being Hariot and the artist John White, who had served as expedition artist on one of Martin Frobisher’s voyages to Greenland. The colonists arrived at Roanoke late in June 1585, but one of their ships ran aground and they lost much of their provisions. After the departure in August of the colony’s two commanders, Sir Richard Grenville and Thomas Cavendish, Ralph Lane assumed governorship, and his relations with the local Indians were friendly at first. The situation deteriorated, however, as the Englishmen failed to find reliable sources of food, and when Sir Francis Drake arrived in June 1586, Lane decided to return the surviving colonists to England. The year had not been a waste for Hariot, though. With the help of Manteo and Wanchese, and in the company of John White, he had explored the area surrounding Roanoke and, with White, joined a party that sailed north to the Chesapeake Bay and up the Elizabeth and Nansemond rivers, even encountering the Chesapeake Indians at their principal town of Skicoac. He and White used these travels to collaborate on the first accurate maps of the east coast of North America. Using angle-measuring tools to establish latitude and longitude, Hariot mapped out triangle-shaped areas and either recorded these angles in a notebook for later use or, while in the field, sketched these triangles directly onto a sheet of paper attached to a plane table. White, an accomplished painter and illustrator, then finished the maps. While some of the White-Hariot maps remained in manuscript form and did not receive wide circulation, others—such as the small map of Roanoke Island and the large map of the entire Outer Banks region—appeared in Theodor de Bry’s illustrated edition of Hariot’s A briefe and true report of the new found land of Virginia, becoming models for their time of accurate cartography in the New World. A briefe and true report was, perhaps, Hariot’s most important contribution to England’s colonization efforts. First published in 1588, it appeared again the next year as part of Richard Hakluyt (the younger’s) Principall Navigations. Hakluyt then convinced de Bry to publish a third version as the initial volume in his America series. This last includes etchings of the White-Hariot maps as well as etchings based on White’s watercolor portraits of Virginia Indians and scenes of Indian life. Published in English, French, German, and Latin, the de Bry version enjoyed a wide European audience. While the Report is sometimes considered scientific, it is more accurately viewed as commercial discourse. Throughout, Hariot argues four related points. First, the 1585 colony failed because many members of the colony were unprepared for the rigors of colonization. Although these men slandered the colony and its leaders upon arriving home, in Hariot’s view Raleigh’s colonization program should be allowed to continue. Second, the Roanokes and other Indian tribes are not to be feared by the English, who possess superior technology and culture. Third, the land in Virginia is abundant enough to provide future colonists with adequate food and building materials. And fourth, Virginia offers a less expensive source for a wide range of trade goods, including shipping supplies, dyes for the cloth industry, and wine.\n\nLater Years In 1595, Hariot received land from Henry Percy, ninth earl of Northumberland, to allow him to continue his scientific and mathematical work. Percy was imprisoned in 1605 for his connection to the Gunpowder Plot, an attempt on the life of King James I on behalf of greater freedom for English Catholics. Hariot’s connection to Percy also landed him in prison, but only briefly. (Percy’s younger brother George was one of the original Jamestown colonists.) Sir Walter Raleigh also ran afoul of the king and was beheaded in 1618. In the meantime, Hariot pursued his interest in astronomy. His unpublished notes on the appearance of Halley’s Comet in 1607 were later used to accurately calculate its orbit. In 1609, he used a telescope of his own making to sketch the moon—four months before the Italian astronomer Galileo Galilei more famously accomplished the same feat. In 1610, he was the first to observe sunspots, and in 1611, he produced the first map of the moon. Hariot died in London on July 2, 1621, of cancer of the nose, probably caused by heavy tobacco use. A posthumous work, Artis Analyticae Praxis, published in 1631, helped to establish the English school of algebra."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/", "page_content": "20\n\n1577\n\n1560\n\n(\n\n)\n\n1580\n\n1583\n\n1587\n\n(\n\n)\n\n1584\n\n1585\n\n86\n\n9\n\n1585\n\n19\n\n(\n\n)\n\n1586\n\n1586\n\n1588\n\n1589\n\n1590\n\n(\n\n)\n\n(\n\n)\n\n1590\n\n1595\n\n(\n\n)\n\n1597\n\n1597\n\n1601\n\n(\n\n)\n\n1621\n\n20\n\n1637\n\n1590\n\n1590\n\n1607\n\n1600\n\n1599\n\n1600\n\n24\n\n1603\n\n(\n\n)\n\n4\n\n1605\n\n27\n\n1621\n\n1605\n\n1605\n\n1606\n\n(\n\n)\n\n17\n\n1607\n\n(\n\n)\n\n26\n\n1609\n\n9\n\n5\n\n6\n\n17\n\n1610\n\n10\n\n20\n\n1611\n\n32\n\n17\n\n1610\n\n26\n\n1612\n\n199\n\n8\n\n1610\n\n18\n\n1613\n\n(\n\n)\n\n1614\n\n1618\n\n(\n\n)\n\n1618\n\n1603\n\n29\n\n1618\n\n1613\n\n1615\n\n(\n\n)\n\n12\n\n1591\n\n(\n\n)\n\n1998\n\n(\n\n)\n\n4\n\n(\n\n)\n\na , b , c a, b, c a , b , c\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n(1631)\n\n10\n\nwas a mathematician and astronomer who founded the English school of algebra. He is described inby Fauvel and Goulding as:-yet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.We know very little of Harriot's youth. In fact all that is known is that on FridayDecemberhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to beand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been foundalthough a number of possible relatives have been identifiedAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated inand went to London. It is not clear exactly what he did in his first few years there but, probably from late, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February, wrotesee for example:-Harriot wrote a text called Arcticon which was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote Arcticon:-As Roche notes in:-It was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.Raleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in. Although there is no direct evidence that Harriot made this voyage, Quinn inargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in. He sailed from Plymouth onAprilon board the Tiger and his observations of a solar eclipse onApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customsparticularly the eating habitsof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.Drake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in Junethere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in Julyand he went immediately to Raleigh to report on the expedition. He published A Briefe and True Report of the New Found Land of Virginia in, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.By the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.Already in thes there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with John Dee who also felt that the charges might relate to him. There is no reason to believe that Harriotor Raleighwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations, Dee and Harriot discussed scientific and mathematical matters in thes.Harriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. Inthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syonnear Kew outside Londonwhich Harriot used both as a residence and as a scientific laboratory.We certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by. Although init states that he had discovered the sine law of refraction of light before, in fact we now know that the precise date of Harriot's important discovery was July. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that Snell to whom the discovery of this law is now attributedwas not the first to publish the result. Snell 's discovery was in, aboutyears after Harriot's discovery, but the result was not published until Descartes put it in print inOne of the optical problems which Harriot did study in thes was Alhazen 's problem. He gave a solution to Alhazen 's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author ofconjectures that Harriot may have used infinitesimal techniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by Barrow Optics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the earlys to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by Aristotle 's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by, he came to the conclusion that the path of the projectile was a tilted parabola . He made one error, however,:-Other topics which Harriot began to work on beforewere problems of chemistry. He worked intensively on chemistry for almost exactly a year from Mayto Mayand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.Raleigh had been a particular favourite of Elizabeth I and, when she died onMarch, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.Raleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principlesto which undoubtedly he adheredbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.Another plot was to lead to further trouble. OnNovemberGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. OnNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained untilwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end ofAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by Kepler had heard of the remarkable results on optics achieved by Harriot. Kepler wrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he didas he claimed to Kepler ) still intend to publish his results if his health permitted. still intend to publish his results if his health permitted.\n\n\n\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on The appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on 17 September September 1607 from Ilfracombe which would later be identified as from Ilfracombe which would later be identified as Halley's Comet. 's Comet. Kepler had discovered the comet six days earlier but it would be the observations of Harriot and his friend had discovered the comet six days earlier but it would be the observations of Harriot and his friend ( and student and student ) William Lower which eventually were used by William Lower which eventually were used by Bessel to compute its orbit. to compute its orbit.\n\n\n\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On His astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On 26 July July 1609 at at 9 p.m. he sketched the Moon which was at that time p.m. he sketched the Moon which was at that time 5 days old, viewing it through a telescope with a magnification of days old, viewing it through a telescope with a magnification of 6 . He sketched the Moon again a year later on . He sketched the Moon again a year later on 17 July July 1610 , by this time he had a telescope giving him a magnification of , by this time he had a telescope giving him a magnification of 10 . Soon he had constructed a telescope with a magnification of . Soon he had constructed a telescope with a magnification of 20 , then by April , then by April 1611 he had a he had a 32 magnification telescope. magnification telescope.\n\n\n\nHarriot observed the moons of Jupiter, although since his first sighting states:- Harriot observed the moons of Jupiter, although since his first sighting states:-\n\nMy first observation of the new planets. I saw but one and that alone\n\nhe must have already been aware of\n\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n\n17\n\nOctober\n\n1610\n\nand\n\n26\n\nFebruary\n\n1612\n\n.\n\nHe was the first to discover sunspots, making\n\n199\n\nobservations between\n\n8\n\nDecember\n\n1610\n\nand\n\n18\n\nJanuary\n\n1613\n\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n\n(\n\nwhich had brought him much trouble despite his lack of publications\n\n)\n\n.\n\nOf the few pieces of work done by Harriot after\n\n1614\n\n, one was his observation of another comet in\n\n1618\n\n(\n\nthere were three visible comets that year and Harriot observed the third\n\n)\n\nfrom Syon House. In\n\n1618\n\nRaleigh, who had been shown the clemency of imprisonment in\n\n1603\n\nrather than death, was put to death. Raleigh was executed on\n\n29\n\nOctober\n\n1618\n\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\n\nThe cancer seems to have started around\n\n1613\n\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n\n1615\n\nwho wrote report on the consultation. He described Harriot as\n\n(\n\nsee for example\n\n)\n\n:-\n\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\n\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\n\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\n\nof a\n\non a sphere, a projection he proved to be\n\n. The loxodromes are the straight lines on the\n\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\n\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n\n12\n\nDecember\n\n1591\n\n(\n\nSunday\n\n)\n\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\n\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\n\nof matter which he believed in. Later, in his correspondence with\n\nabout atomic theory, Harriot mentioned the packing problem.\n\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n\n1998\n\nwhen Thomas Hales of the University of Michigan\n\n(\n\nwith the help of hours of computer generated data\n\n)\n\nfinally proved the conjecture.\n\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n\n4\n\n. The example in question is in his own handwriting and reproduced in\n\n.\n\naaaa - 6aa + 136a = 1155 ------------------------------------ aaaa -2aa + 1 = 4aa -136a + 1156 aa - 1 = 2a - 34 33 = 2a - aa aa - 2a = -33 aa - 2a + 1 = +1 - 33 a - 1 = √-32 1 - a = √-32 a = 1 + √-32 a = 1 - √-32 ------------------------------------ aa - 1 = 34 - 2a aa + 2a = 35 aa + 2a + 1 = 1 + 35 a + 1 = √36 a = √36 - 1 = 5 ------------------------------------ -a - 1 = √36 a = -√36 - 1 = -7\n\n.\n\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n\n(\n\nas is often claimed\n\n)\n\n, but were introduced by the editor of Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\nⓉ ( The analytical art by which algebraic equations can be resolved )\n\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\n\n, or whether notation and ideas introduced by\n\nwere learnt by him from Harriot.\n\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\n\na , b , c a, b, c a , b , c\n\nare the roots of a\n\nthen the cubic is\n\n( x − a ) ( x − b ) ( x − c ) = 0 (x - a)(x - b)(x - c) = 0 ( x − a ) ( x − b ) ( x − c ) = 0\n\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\n\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\n\n(1631)\n\nwas published\n\n10\n\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.\n\nReferences (show)\n\nJ A Lohne, Biography in Dictionary of Scientific Biography ( New York 1970 - 1990) .\n\nSee THIS LINK. Biography in Encyclopaedia Britannica.\n\nhttp://www.britannica.com/biography/Thomas-Harriot J N Crossley, The emergence of number ( Singapore, 1980) . J W Shirley, Thomas Harriot : a biography ( Oxford, 1983) . J W Shirley ( ed. ) , A Source book for the study of Thomas Harriot ( New York, 1981) . J W Shirley ( ed. ) , Thomas Harriot : renaissance scientist ( Oxford, 1974) . T F Bloom, Borrowed perceptions : Harriot's maps of the Moon, Journal for the history of astronomy 9 (1978) , 117 - 122 . P C Fenton, An extremal problem in Harriot's mathematics, Historia Math. 16 (2) (1989) , 154 - 163 . P C Fenton, Events in the life of the mathematician Thomas Harriot (1560 - 1621) , Austral. Math. Soc. Gaz. 12 (4) (1985) , 85 - 93 . Thomas Harriot, in J Fauvel, R Flodd and R Wilson ( eds. ) , Oxford figures : 800 years of the mathematical sciences ( Oxford, 2000) , 56 - 59 . J Jacquot, Harriot, Hill, Warner and the new philosophy, in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 107 - 128 . M Kalmar, Thomas Hariot's 'De reflexione corporum rotundorum' : an early solution to the problem of impact, Arch. History Exact Sci. 16 (3) (1976 / 77) , 201 - 230 . J A Lohne, Dokumente zur Revalidierung von Thomas Harriot als Algebraiker, Arch. History Exact Sci. 3 (1966) , 185 - 205 . J A Lohne, Essays on Thomas Harriot. I. Billiard balls and laws of collision. II. Ballistic parabolas. III. A survey of Harriot's scientific writings, Arch. Hist. Exact Sci. 20 (3 - 4) (1979) , 189 - 312 . J A Lohne, Thomas Harriot als Mathematiker, Centaurus 11 (1) (1965 / 66) , 19 - 45 . J A Lohne, T Harriot, Centaurus 6 (1959) , 113 - 121 . J North, Thomas Harriot and the first telescopic observations of sunspots, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 129 - 165 . J V Pepper, Harriot's earlier work on mathematical navigation : theory and practice. With an appendix, 'The early development of the Mercator chart', in Thomas Harriot : Renaissance scientist ( Oxford, 1974) , 54 - 90 . J V Pepper, Harriot's manuscript on the theory of impacts, Ann. Of Sci. 33 (2) (1976) , 131 - 151 . J V Pepper, Harriot's work on the true sea-chart, 1971 Actes XIIe Congrès Internat. d'Histoire des Sciences IV ( Histoire des Mathématiques et de la Mécanique ) ( Paris, 1968) , 135 - 138 . J V Pepper, Some clarifications of Harriot's solution of Mercator's problem, Hist. of Sci. 14 (4) (1976) , 235 - 244 . J V Pepper, The study of Thomas Harriot's manuscripts. II. Harriot's unpublished papers, History of science 6 ( Cambridge, 1967) , 17 - 40 . D B Quinn, Thomas Harriot and the new world, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 36 - 53 . J J Roche, Harriot's 'Regiment of the Sun' and its background in sixteenth-century navigation, British J. Hist. Sci. 14 (48) (1981) , 245 - 261 . J J Roche, Harriot, Galileo, and Jupiter's satellites, Arch. Internat. Hist. Sci. 32 (108) (1982) , 9 - 51 . E Rosen, Harriot's science: the intellectual background, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 1 - 15 . C J Scriba, Wallis und Harriot, Centaurus 10 (1965) , 248 - 257 . M Seltman and E Mizzi, Thomas Harriot: father of English algebra?, Math. Intelligencer 19 (1) (1997) , 46 - 49 . J W Shirley, Sir Walter Ralegh and Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 16 - 35 . B J Sokol, Thomas Harriot - Sir Walter Raleigh's tutor - on population, Ann. of Sci. 31 (1974) , 205 - 212 . R C H Tanner, Henry Stevens and the associates of Thomas Harriot, in Thomas Harriot: Renaissance scientist ( Oxford, 1974) , 91 - 106 . R C H Tanner, Nathaniel Torporley's 'Congestor analyticus' and Thomas Harriot's 'De triangulis laterum rationalium', Ann. of Sci. 34 (4) (1977) , 393 - 428 . R C H Tanner, The ordered regiment of the minus sign : off-beat mathematics in Harriot's manuscripts, Ann. of Sci. 37 (2) (1980) , 127 - 158 . R C H Tanner, The study of Thomas Harriot's manuscripts. I. Harriot's will, History of science 6 ( Cambridge, 1967) , 1 - 16 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. I, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 235 - 247 . R C H Tanner, Thomas Harriot as mathematician. A legacy of hearsay. II, Physis-Riv. Internaz. Storia Sci. 9 (1967) , 257 - 292 . D T Whiteside, In search of Thomas Harriot, History of Science 13 (1975) , 61 - 62 .\n\nAdditional Resources (show)\n\nHonours (show)"}, {"url": "https://www.britannica.com/biography/Thomas-Harriot", "page_content": "Thomas Harriot, also spelled Hariot, (born 1560, Oxford, Eng.—died July 2, 1621, London), mathematician, astronomer, and investigator of the natural world.\n\nLittle is known of him before he received his bachelor’s degree from the University of Oxford in 1580. Throughout his working life, he was supported by the patronage, at different times, of Sir Walter Raleigh and Henry Percy, the 9th earl of Northumberland; he was never, after his student years, affiliated with an academic institution or commercial organization. From 1585 to 1586 he participated in Raleigh’s colony on Roanoke Island, and he may have visited Virginia as early as 1584; upon his return, he published A Briefe and True Report of the New Found Land of Virginia (1588). This was his only work published during his lifetime. Very soon after the Virginia sojourn, Harriot was living on and surveying Raleigh’s estates in Ireland.\n\nBritannica Quiz All About Astronomy\n\nIn 1595 Percy settled upon Harriot an estate in Durham, England, and soon provided him with a house near London, which he also used as a scientific laboratory to pursue original research in astronomy, meteorology, optics, and what are now characterized as pure and applied mathematics. In particular, he performed experiments in ballistics and the refraction of light. He was one of the first, if not the first, to consider the imaginary roots of equations. Much of his earliest as well as latest mathematical work bore on questions of navigation, including such issues as the construction of rhumb lines (or loxodromes) on sailing charts. He also devised a novel form of cross-staff, an early navigational instrument. (See navigation: latitude measurements.) Although, after his early voyages, he pursued a life of research, it was not a life free of turmoil, since his principal patron, Raleigh, was imprisoned in 1603 in the Tower of London on orders of King James I of England. Harriot witnessed Raleigh’s execution in 1618. In the turmoil following the discovery of the Gunpowder Plot in 1605, Harriot was arrested upon suspicion of having cast the king’s horoscope, though he was soon released. (Percy, as a co-conspirator in the plot, joined Raleigh in the Tower of London.) From the early 1590s, Harriot had developed a reputation for atheism and was referred to rather obliquely as a conjurer by Raleigh’s enemies. However, there is nothing in Harriot’s writings or those of his friends to substantiate any non-Christian beliefs; the accusations may merely reflect his likely belief in atomism, which at the time was considered by some to obviate the necessity for the existence of God.\n\nConcurrently with Galileo Galilei’s introduction of telescopic observations of the heavens in 1609, Harriot commenced telescopic observations, some systematic, others not. He drew charts of the Moon, followed the paths of the moons of Jupiter, and observed sunspots. He also observed comets.\n\nDuring his lifetime Harriot was known in England among the philosophically inclined, and his reputation extended to the continent to the extent that the astronomer Johannes Kepler initiated a correspondence with him. His only other book, however, was the posthumously published Artis Analyticae Praxis ad Aequationes Algebraicas Resolvendas (1631; “Application of Analytical Art to Solving Algebraic Equations”). (The editor of this work introduced the signs ∙ for multiplication, > for greater than, and < for less than.) Although Harriot published little and kept some of his studies secret, such as the discovery of the sine law of refraction (now known as Snell’s law), his work was not done in isolation; he drew around himself a group of admiring scholars, at least some of whom were cognizant of some of his discoveries. In subsequent centuries Harriot was never forgotten, but it has been mainly since the mid-20th century that scholars have made close and systematic studies of his thousands of pages of manuscripts and uncovered the full extent of his investigations."}, {"url": "https://theconversation.com/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on-163167", "page_content": "Four hundred years ago, on July 2 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8,000 pages of scientific research, but it is only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of famous pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea: he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo were not the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries: the law of refraction, and why the rainbow has its magical colours and its unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens or why your leg looks wobbly when you dip it in a swimming pool.\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right: Ibn Sahl is a notable pioneer whose geometrical diagram of light focussed by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did: his derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was the controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters and sailing the high seas as Raleigh’s navigational advisor.\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s USA before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted\n\nto live a private life for the love of learning that I might study freely.\n\nConclusion\n\nIn the late 1590s Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot did not need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They are now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no-one knows much about him as a person – not even his birthday. Nevertheless, he has fascinated scholars for the past half century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour."}, {"url": "https://www.ncpedia.org/biography/harriot-hariot-or", "page_content": "Harriot (Hariot or Harriott), Thomas\n\nby John W. Shirley, 1988\n\n1560–2 July 1621\n\nThomas Harriot (Hariot or Harriott), explorer, navigational expert, mathematician, scientist, and astronomer, participated in Sir Walter Raleigh's early expeditions to America. His parentage or ancestry are unknown. Records of his matriculation at Oxford University show him to have been born and reared in Oxford, England, and to be of plebeian stock. He entered St. Mary's Hall (a subsidiary of Oriel College) on 20 Dec. 1577, at age seventeen, and was graduated with a bachelor of arts at the Easter Convocation of 1580. Acquisition of this degree gave Harriot the right to call himself \"Master Harriot,\" a title he carefully used for the rest of his life.\n\nShortly after leaving the university, Harriot entered the household of Walter Raleigh, where, according to Richard Hakluyt, he not only instructed Raleigh in the mathematics of navigation but also conducted instructional programs for Raleigh's sea captains, that they might \"very profitably unite theory with practice\" in their explorations. This teaching (resulting in a navigational text called the Arcticon, which has not survived) further stimulated young Raleigh to follow in the footsteps of his half brother, Sir Humphrey Gilbert, in attempting to explore and colonize the New World.\n\nOn Gilbert's death in 1583, Raleigh purchased a new ship, renamed it the Bark Ralegh, and began to prepare for an exploratory visit to America to seek a site for colonization. Helping to plan this expedition was Thomas Harriot working closely with two other young sea captains in Raleigh's household, Philip Amadas and Arthur Barlowe. Raleigh hoped to command the 1584 voyage himself, but he was by this time a courtier rising in the eyes of Queen Elizabeth and she would not permit him to accept the danger of an ocean crossing where Sir Francis Drake and the Spaniards were still fighting. Possibly Harriot may have gone on this voyage. Though he is not listed among the ten names signing the report, there is some evidence that it was at this time that he learned the Algonquin language, perhaps on the return voyage with the two Indians, Manteo and Wanchese. John White is not listed either, though he later indicates that he was a member of this exploratory party. The return of the first voyage was most successful: Manteo and Wanchese made a great impression on the queen and on the court. Their friendliness and the reports of extensive economic potential in the new land appeared so favorable that the queen granted Raleigh a patent for colonizing, knighted him in January 1585, appointed him governor of the new colonies, and permitted him to name his proposed colony \"Virginia\" (in her honor as Virgin Queen) rather than the Indian name of Wingandacoa it had previously borne.\n\nDuring the winter of 1584–85, Raleigh and Harriot made extensive preparations for a colonizing effort in Virginia. Seven ships were assembled with nearly six hundred men, half of them sailors and the other half soldiers and colonists who were prepared to spend at least a year in the New World. On 9 Apr. 1585, under the command of Sir Richard Grenville, this flotilla sailed from Plymouth. Because he could not go himself, Raleigh named Harriot as his official representative and charged him with assessing the economic potential of Virginia and reviewing the nature and inclinations of the natives. John White was assigned to help with the making of maps and to bring back drawings and sketches of the new land and its inhabitants. Both men, along with Grenville as general of the expedition, Ralph Lane as high marshall and later governor of the colony, Simon Fernándes as chief pilot of the fleet, and a number of other gentlemen who were to make up the council, sailed on the flagship, The Tiger.\n\nDuring the long sea crossing, Harriot made a number of scientific observations. He tested the traditional and crude dead reckoning against the more accurate celestial navigation, probably using the backstaff he had developed for better observation by his sea captains. He noted the variation of the compass, measuring the magnetic north against the position of the pole star. On 19 April, ten days after leaving Plymouth, he must have observed the eclipse of the sun, though the eclipse was not total where he then was, so it could not be used for an accurate calculation of longitude as he had hoped. As the flotilla proceeded through the islands, Harriot gathered fruits and vegetables, sugar, ginger, tobacco, and pearls to be returned to Raleigh, along with White's drawings of many of the same things, as samples of the richness to be obtained by colonization.\n\nOn 26 June, after repeatedly searching navigable waters with extreme difficulty and much loss of vessels, the fleet anchored at Wococon Island, approximately where modern Ocracoke is, and began negotiating with the natives. On 3 July an expedition was sent to Roanoke Island, the site that had been chosen by the 1584 expedition for colonization, to notify the Indian chief Wingina of their arrival. On 11 July Grenville, Lane, Harriot, White, and a few others crossed to the mainland on a voyage of exploration through a number of Indian towns which took them as far as Lake Mattamuskeet, which the natives called Paquype. Within the next month the settlers had been moved to Roanoke, had unloaded their provisions, and were building a fort and houses and beginning to function like a colonial outpost. Harriot and White began in earnest to survey the land resources, and to draw for a permanent record what they could observe of the people and products of the New World.\n\nDuring the whole of the year they spent at Roanoke Island, Harriot and White kept busy at their recording assignments. In addition to studying the people, they took careful notes on commercially profitable plants and mineral resources that might lead to further investment in colonial ventures. So successful was their publicity that more than two decades later, Harriot was working with Raleigh to prevent the importation of Virginia sassafras roots from glutting the market.\n\nIn his contacts with the natives, Harriot did not ignore his scientific bent. He exploited the science and technology of his day in such a way that he should undoubtedly be recognized as the first scientist of the New World—not only in his scientific study of the land and its people, but also in introducing scientific artifacts into Virginia. According to him, the native Americans were most impressed with the scientific instruments they first saw in Harriot's possession. Yet with all his frightening guns, magnets, clocks, and \"wildefire works\" (a compound used in warfare that was difficult to extinguish once set afire), Harriot earned the confidence and affection of the Indians, including Chief Wingina's, whereas Lane, using force to punish any observed unconformity, attracted only their hatred and distrust.\n\nBy the next spring, the new colonists were in dire straits; they badly needed the promised relief supplies, and they counted the days until the arrival of Raleigh's second-year colonists who would bring them. The Indians, too, were uneasy. On 10 June, Lane, suspecting an uprising, struck on the mainland, killing Chief Wingina. Additional search actions scattered his men and left them vulnerable to further attack. On the same day, however, Sir Francis Drake, sailing north from his battles with the Spaniards, anchored at Port Ferdinando. The next day he met with Lane, offering him one of his larger ships for reconnoitering the Chesapeake Bay area to seek a safer and more healthful colonial site. Transfer of the vessel had just begun when, on 13 June, a violent storm grounded some of Drake's vessels and blew others, including the one offered to Lane, out to sea where their only safe action was to set sail for England. The remaining ships were too large for Lane's use; and, because their supplies had been depleted, Lane decided that the colonists still at Roanoke should board Drake's ships and return home. The severe weather made boarding difficult, and, as Lane told the story, Drake \"sending immediately his pinnaces vnto our Island for the fetching away of fewe that there were left with our baggage, the weather was so boysterous, and the pinnaces so often on ground, that the most of all wee had, with all our Cardes, Bookes and writings, were by the Sailers cast ouer boord.\" There can be little doubt that the great portion of Harriot's notes and White's drawings were thus lost in the frantic boarding on that day.\n\nWhen he returned home, Harriot learned that Raleigh was unable to send relief to Virginia because of the Spanish threat to England; moreover, he was already engaged in a new colonial venture, this time in southern Ireland. Harriot, posing as one of the colonists, joined him there and was given for his use the Abbey of Molanna in the county of Waterford, near Youghal. Here, Harriot gathered his remaining notes and prepared for publication the first English treatise on the New World. This book, published in February 1588 under the title A briefe and true report of the new found land of Virginia: of the commodities there found and to be raysed, as well marchantable, as other for victuall, building and other necessarie uses for those that are and shalbe the planters there; and of the nature and manners of the naturall inhabitants . . . By Thomas Hariot; seruant to . . . Sir Walter, a member of the Colony, and there imployed in discouering . . ., exists in only eight copies but remains one of the most important early accounts of the country as it was first seen by the English settlers. It attracted immediate attention and was included by Hakluyt in his Principall navigations of 1589. The following year, Theodore de Bry issued elaborate editions in Latin, English, French, and German, adding plates of twenty-one of John White's drawings of the new land and the Indians, for which Harriot wrote headnotes. Though this was the only work Harriot ever published, it was enough to establish Harriot and White as among the foremost authorities on early colonial America.\n\nHarriot was also involved in the preparations for the invasion of the Spanish Armada. Though he was living in Ireland, he frequently visited London, and many of his extant manuscript notes indicate that he was preparing seamen for more scientific approaches to their craft. It is true that superior seamanship (and God's weather) gave England the victory, and Harriot must have felt some satisfaction in his new science of navigation. Among other activities, he collected for Raleigh and government officials a large number of maps and rutters (sets of sailing directions, tide tables, and carefully drawn profiles of ports or entrances to harbors as seen from the sea, usually the first thing seized from a captured ship), particularly those dealing with Virginia; worked with Emery Molyneaux to improve terrestrial globes; and assisted Gerard Mercator in developing more accurate map projections than had been used before this time. But increasingly his interests turned to theoretical and mathematical subjects. Harriot was one of the first of the new scientists to seek a mathematical solution to natural phenomena. His study of the piling of bullets led him to examine the possible atomic structure of matter as one of the earliest of the new atomists. His investigation of the trajectory of bullets and cannonballs led him to consider the laws of motion and falling bodies. In fact, he was performing the same experiments in England that were occupying Galileo in Italy. Both atomic theory and the laws of motion led Harriot to study refraction; he discovered the law of sines many years before Wilebrord Snel (whose name the law bears) and began work on mirrors and lenses that may have resulted in his independent discovey of a telescope some years later.\n\nDuring this period, Sir Walter Raleigh's fortunes began to decline. His colonization attempts in the New World had yielded only trouble and high costs. The relief vessels for the 1585–86 colony had arrived two weeks too late, and had returned to England leaving only a small contingent at Roanoke Island. The 1587 colonial effort with John White as governor had been extremely difficult to finance, and once landed could not be supplied or rescued. In all, these projects had cost Raleigh at least £40,000 and denied him the possibility of ever visiting Virginia himself. His Irish colonies were disastrous, too. The lands were poor, the settlers unhappy, the natives vicious, and English import duties on Irish products prevented any profit from his plantations. His popularity with Elizabeth, the source of his wealth, had been jeopardized by his courtship of one of the queen's ladies-in-waiting, Elizabeth Throckmorton, whom he married secretly in late 1591 or early 1592, an act that prompted the queen to confine him in the Tower of London and strip him of many of his honors.\n\nIn light of Raleigh's predicament, Harriot sought a new patron, and found one in Raleigh's longtime friend, Henry Percy, ninth earl of Northumberland. Percy was a quiet, retiring, serious-minded young man, intensely interested in the new science of which Harriot was an outstanding exponent. Percy himself was known as \"The Wizard Earl,\" and was beginning to gather about him men with similar interests. During much of Raleigh's imprisonment, Harriot was, according to the kitchen accounts of the ninth earl that still exist, dining regularly at the Wizard Earl's table. Though he continued to be one of Raleigh's closest friends and worked with him to find financial support for Raleigh's ventures, Harriot gradually rose in favor with Percy. In 1593, when Percy received the Order of the Garter, he gave Harriot a handsome gift of money. Two years later he granted him a lifetime interest in his landholdings at Brampton in County Durham (now called Barmpton, a rural suburb of Darlington) and established him in a house adjacent to his London residence, Syon House, Isleworth, though Harriot was still using his rooms in Durham House (Raleigh's London residence) when in the city.\n\nBy 1597, Harriot was listed as a regular pensioner of the ninth earl at £80 per annum—the same amount received by Percy's younger brothers. In the same year, in a will drawn by Raleigh on 10 July just before he sailed with Robert Devereux, earl of Essex, to intercept the Spanish fleet in the Azores in a dangerous attempt to recoup their fortunes, Raleigh named Harriot as one of the overseers of the will, left him \"all my bookes & the furniture in his own Chamber and in my bedchamber in Durham House Togeather with all such blacke suites of apparell as I have in the same house,\" and arranged for Harriot to be paid an annual pension of £100 from his royal grants. Though this will was never probated, the sums mentioned indicate the kind of support that Raleigh must have been giving Harriot. From these incomes, Harriot could live like a gentleman, keep his own house and servants, and indulge his every whim in the pursuit of scientific knowledge without the worry of income, fame, or reputation.\n\nShortly after his accession to the throne, King James had Raleigh accused of treason on trumped-up charges, convicted by a hand-picked jury, and again thrown into the Tower of London at the sovereign's pleasure. Two years later, Henry Percy followed him to the Tower because James suspected a remote connection with the Gunpowder Plot. Harriot, who was questioned about the plot and accused by James of having cast his horoscope, was imprisoned for a time, but then released to pursue his scientific research at Syon House. Nevertheless, he remained the main link between Raleigh and Percy in the Tower and the outside world, visited them often, assisted Raleigh in the writing of his History of the World, and instructed young Algernon, Percy's heir, in the elements of mathematics and navigation, both of which would stand him in good stead in later life when, as the tenth earl of Northumberland, he was Admiral of the Fleet.\n\nBetween 1606 and 1608 Harriot corresponded with Johannes Kepler; the two men compared notes on their experiments in the refraction of light, explaining, for the first time, the refraction within a sphere and providing a scientific explanation for the dispersion of light in the rainbow. By 1609, Harriot had in his possession a six-power telescope and began a series of observations of the moon. During the next four years he developed at least eight new telescopes, ranging in power from eight to fifty magnifications. With these telescopes (called by Harriot \"perspective truncks\") he observed the phases of Venus which proved the validity of Copernican over Ptolemaic astronomy, recorded more than thirty drawings of the moon leading to the first telescopic moon map, and determined the time of quadrature so that he could calculate the distance of the moon from the sun. In December 1610, almost simultaneously with Galileo, he discovered sunspots; during the next four years he made and recorded 199 observations. A few months earlier, in October, he first saw the satellites surrounding Jupiter and after two years of observation was able to calculate the distance of the moons from the planet and to compute the periods of their rotation. He also observed, using a cross-staff, the comets of 1607 (Halley's comet) and 1618, observing their orbits and determining that they followed an ellipitical orbit.\n\nDuring these later years, Harriot suffered from cancer of the nose. Theodore Turquet de Mayerne, the king's physician, was called in as a consultant on 28 May 1615. His notebooks still survive to record his impressions of this visit. He saw Harriot as a very melancholy man, about age sixty (actually Harriot was fifty-five, so his illness must have aged him). He noted that Harriot was the man who first brought tobacco out of Virginia and recorded, for the first time, the possible connection between smoking and cancer. His indication that Harriot had had cancer for about two years appears to be borne out by Harriot's own manuscripts, for except for the comet of 1618 his notes are sparse after 1612. Harriot was able, however, to attend the execution of his old friend and patron, Sir Walter Raleigh, at West-minister on 29 Oct. 1618, and his notes of Raleigh's final speech on the scaffold are among his papers.\n\nHarriot died at the home of Thomas Buckner, a mercer who lived on Threadneedle Street near the Royal Exchange. He may have been on his way to visit Henry Percy, who was still in the Tower, or he may have been visiting an old friend, as \"Thomas Bookener\" had been with Harriot on Roanoke Island in 1585–86. Harriot was buried in the chancel of St. Christopher le Stocks, on the site of the present Bank of England. His grave, and the monument erected there by Percy, were destroyed in the Great Fire of 1666.\n\nIn his will, Harriot left his telescopes and scientific instruments to his executors and his mathematical and scientific papers to his patron, Henry Percy. He requested Nathaniel Torporley, a retired clergyman whom he had known for a long time, to edit and publish his papers. But the records of his visit to the New World are not mentioned. A canvas bag of Irish accounts, \"the persons whom they concerne are dead many yeares since in the Raigne of Queene Elizabeth,\" and another bag of \"divers wast papers . . . of my Accomptes to Sir Walter Rawley\" he asked be burned. Thus died any additional traces beyond his published book of the personal observer of Raleigh and the author of the first English book about \"the new found land of Virginia.\""}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-97707-2_1", "page_content": "Rumors have been circulated since the mid-16th century that the telescope was not invented in early 17th century Holland but in Elizabethan England, some half a century before. A telescopic device appears to have been constructed by the noted English polymath Leonard Digges (1515–c. 1559) as early as the first half of the 1500s and later reiterated by his son, Thomas Digges, in a communication dated to 1571:\n\n[H]is divine mind aided with this science of Geometrical mensurations, found out the quantities, distances, courses, and strange intricate miraculous motions of these resplendent heavenly Globes of Sun, Moon , Planets and Stares fixed, leaving the rules and precepts thereof to his posterity. Archimedes also (as some suppose) with a glass framed by revolution of a section Parabolicall, fired the Roman navy in the sea coming to the siege of Syracuse. But to leave these celestial causes and things done of antiquity long ago, my father by his continual painful [painstaking] practices, assisted with demonstrations Mathematical, was able, and sundry times hath by proportional Glasses duly situate in convenient angles, not only discovered things far off, read letters, numbered pieces of money with the very coin and superscription thereof, cast by some of his friends of purpose upon downs in open fields, but also seven miles off declared what hath been done at that instant in private places.\n\nThis intriguing tract, which appears on page 5 of the preface to his posthumously published book Pantometria (1571), provides the modern reader with an intriguing glimpse of a telescopic device made with lenses and mirrors. In a lively debate that took place in March 1993 organized by the Scientific Instrument Society (SIS) and held at Burlington House, London, Colin Ronan spoke in favor of the existence of such an early telescope, while the late Professor Gerard Turner, based at the Museum for the History of Science, Oxford, UK, provided a robust counterpoint. During the debate, a replica of the alleged Digges telescope was presented to all in attendance.\n\nThe device consisted of a simple biconvex objective lens, the light of which was incident to a focusing mirror that relayed the image to the eye. Mounted inside a wooden tube, the device magnified 11 times and did produce an enlarged image, but with a very narrow field of view, and was additionally plagued by chromatic aberration – a consequence of using a singlet lens as an objective. There is, as yet, no consensus on whether such a telescope ever saw the light of day.\n\nHarriot and his assistant, Christopher Tooke, set up a telescope magnifying 6 times on the grounds of Syon Park, and on the clement evening of July 26, 1609, turned it on a five-day-old crescent Moon, immediately sketching what he saw. Various lunar ‘seas’ are included in these lunar portraits, including the Mare Crisium, Tranquilitatis and Fecunditatis, as well as some rugged lunar features situated along the terminator, which modern scholars have identified as Theophilus and Cyrillus. Curiously, this first sketch does not record any craters, although 6× is certainly large enough to resolve several of the more prominent ones.\n\nOut of sheer curiosity, in a separate investigation, this author used a modern spyglass with an uncoated, 1-inch diameter object glass, also having a magnification of 6×, in the wee small hours (01:30 h UT) of January 1, 2016, to record observations of the last quarter Moon and Jupiter, as they cleared the treetops in the eastern sky. Like Harriot’s telescope, the spyglass gave an erect, correctly orientated image but enjoyed a much larger field of view (approximately 4 angular degrees). Nonetheless, this author could confirm that many lunar craters can indeed be observed with a steady hand, as well as clearly showing various maria . Turning to Jupiter, then just a few degrees above the Moon, the telescope could clearly reveal four Galilean satellites all to one side of the planet (Fig. 1.3).\n\nFig. 1.3 The author’s 6× achromatic spyglass used to corroborate Harriot’s observations. (Image by the author) Full size image\n\nIt will come as somewhat of a surprise to the contemporary reader not acquainted with a Galilean telescope that, despite its very low magnifying power, its field of view was very restrictive – typically just over half the diameter of the full Moon! As a result, Harriot could not have seen the entire countenance of the lunar crescent even at the low magnifications his telescopes delivered. Incredibly, though, Harriot made many more drawings of the Moon, some of which display finer cartographic details than Galileo’s later drawings, but they were frustratingly left undated. When we take into account the radically different personalities of both Galileo (explored in the next chapter) and Harriot, we can see that both men had entirely different modi operandi. Harriot, having spent time in Virginia, was a draughtsman and well acquainted with mapmaking. His methods were slow and methodical. Harriot was categorically not seeking fame and fortune in the same way that Galileo was, and, according to Dr. Chapman , because Harriot had two high profile friends on ‘death row’ in the Tower, he had little desire to make himself conspicuous.\n\nBy the closing weeks of 1609, Harriot dispatched Tooke, his able technician, to the residence of Sir William Lower at Trefenti, Carmarthenshire, South Wales, instructing him to fashion several other Galilean cylinders in order that he and his philosophical chums, a one Mr. Vaughan and Mr. Protheroe (and possibly a few others), could begin their own telescopic investigations of the Moon and other celestial bodies. The surviving exchanges between Harrriot and the ‘Carmartenshire philosophers,’ clearly unveil their avowed acceptance of the Copernican system, as well as Kepler’s elliptical theory of planetary orbits. This meeting may well be first known record of an astronomical society, the members of which were to confirm Galileo’s monumental telescopic work by observing the large Jovian satellites and the erstwhile “invisible” stars in the Pleiades.\n\nOver the next few years, Harriot was to complete his now famous Moon maps, as well as embarking on a detailed study of the Sun. His method involved observing the intensely bright solar disk, when it was near the horizon and veiled behind mist and thin cloud (the reader should, under no circumstances, attempt such an observation!). Harriot is credited as the co-discover of sunspots, recording them at or about the same time as Galileo, and possibly earlier than Christopher Scheiner (1573–1650) and Johannes Fabricius (1587–1616), who themselves yielded additional evidence against the time-honored cosmology of Ptolemy (Fig. 1.4).\n\nFig. 1.4 Christoph Scheiner (1573–1650), the Jesuit priest and astronomer, with his telescope shown on his left. (Image courtesy of Wiki Commons. https://en.wikipedia.org/wiki/Christoph_Scheiner#/media/File:Scheiner_christoph.gif) Full size image\n\nOver the next 2 years, Harriot was to carry out some 450 observations of the Sun and its dark spots, never once claiming their discovery for himself, studying how they moved across its otherwise brilliant face, breaking up and sometimes even disappearing. Indeed, modern scholars were able to establish a solar rotation period of 27.154 days from Harriot’s drawings – uncannily close to the modern accepted value of 27.2753 days. This affirms the accuracy and attention to detail so central to Harriot’s methodology.\n\nAccording to Dr. Chapman , Tooke may have made improvements to the basic Dutch trunke, and referring to a study conducted by the distinguished historian of astronomy and cosmology, the late Professor John North (1934–2008) identified no less than six telescopes associated with Harriot and the ‘Trefentine’ philosophers, which ranged in power from 6× up to 50×. Tooke is likely to be among the first bona fide telescope makers in Britain, a tradition that was to be continued over the following centuries.\n\nAlthough Harriot embraced the Christian message from his youth, even writing the Lord’s Prayer in the Algonquin language , some scholars have suggested that he may have experienced a brief religious hiatus as he approached middle age. Doubtless, the revolution heralded by the application of the telescope to the celestial realm had raised new questions in the minds of his learned contemporaries. Why were the astronomical bodies puckered and imperfect? How did God create everything from nothing? Was His divine hand needed at every stage, from the formation of atoms to the completion of worlds? Was the allegory of the universe even attributed to a personal God or was it merely blind chance? These questions weighed heavily in the mind of Thomas Harriot.\n\nDr. Chapman acknowledges that nothing firm can be adduced from Harriot’s surviving notes and correspondences, but he is inclined to the view that the world’s first telescopic astronomer re-embraced his Christian heritage in the final decade of his life, as evidenced by his 1615 correspondence with the king’s physician, Sir Theodore Mayerne, who assured Harriot of the certainty of the existence of one all-powerful God. From his days in Virginia, Harriot had taken to ‘drinking’ tobacco smoke, as his contemporaries had referred to it. Earlier physicians had hailed the new wonder drug as an effective remedy to counter the “dangerous moist humors of the body.” But three decades of heavy inhalation of tobacco smoke was to take its toll on Harriot’s health, and he developed a cancerous lesion on his nose.\n\nBecause many tumors of this sort have a tendency to metastasize, spreading to other organs of the body via the lymph nodes, Harriot was arguably history’s first clearly attested tobacco-induced cancer victim, dying on July 2, 1621. He was laid to rest at his local Parish Church of St. Christopher-le-Stocks, located in the heart of the city of London. And while the church was razed to the ground by the Great Fire of 1666 and another resurrected on the original site by none other than Sir Christopher Wren (1632–1723), this too was eventually demolished in 1781 in order to make way for a grand new building that would became the headquarters of the Bank of England. In the 1970s, however, the gravestone dedicated to Thomas Harriot was recovered, and, in his honor, a new plaque carrying his gravestone inscription was unveiled inside the bank.\n\nIt is difficult to crystallize the legacy of Thomas Harriot, being so far removed from him in time, but these words come to mind; learned, diligent, enterprising, kind, loyal, uncompetitive, humble and God-fearing. Despite not marrying and raising children, he lived a fulfilled life without a bad word to say about his fellow men, rendered all the more remarkable owing to his great wealth and lifelong connection with the rich and powerful."}, {"url": "https://link.springer.com/article/10.1007/s00407-019-00228-w", "page_content": "Appendices: Harriot’s use of symbolic algebra\n\nBy the end of the sixteenth century Algebra had been evolving over many centuries. Thomas Harriot’s ‘greate invention’ was the symbolic notation that is now universal. There are many examples scattered throughout his manuscripts, some of them used to solve problems that are purely algebraic, such as the solution of quadratic and cubic equations. But he also applied his methods to illuminate subjects of a more mundane kind, such as the financial problems discussed in this article.\n\nIn some cases, such as his study of Alligation, the algebraic symbolism is explicit in the surviving manuscripts. In others, we can only infer from the arithmetical calculations that algebraic rules were used. Harriot may have made rough notes to guide his calculations; but, even if there were no notes, it is clear that his thinking was guided by rules that were essentially algebraic in form. In these appendices we shall use modern algebraic notation (which is very similar to Harriot’s) to elucidate his methods.\n\nAppendix 1: The implied ratio and its adjustment\n\nFor any metal M, denote the value of an amount of M that weighs x by \\(V_M(x)\\). In arithmetical calculations the units of value and weight must be specified, but the principles can be understood without them. The weight–value relationship implies that the value of x units is x times the value of one unit, so \\(V_M(x) = x V_M(1)\\). Denoting the constant \\(V_M(1)\\) by \\(v_M\\), we have the formula \\(V_M(x) = x v_M\\). Consequently, for two metals M and N, and any given weight x, the fraction \\(V_M(x) / V_N(x)\\) is just \\(v_M/v_N\\). This is the ratio for M and N, and will be denoted here by r(M, N).\n\nWe consider two metals, coined gold cG and coined silver cS. The fineness of both metals is given, as is the declared ratio \\(r(cG, cS) = v_{cG}/v_{cS}\\). Our aim is to obtain an expression for the implied ratio r(G, S) of the pure metals, based on these data.\n\nSuppose that one weight-unit of coined gold contains proportions a of gold and \\(1-a\\) of silver, and one weight-unit of coined silver contains proportions b of silver and \\(1-b\\) of a cheap metal C. Here a and b are numbers between 0 and 1. It follows that\n\n$$\\begin{aligned} v_{cG} = a v_{G} + (1-a) v_{S} , \\qquad v_{cS} = b v_S + (1-b) v_C . \\end{aligned}$$\n\nThe term \\((1-a) v_S\\) is significant, because silver is a valuable metal, but the term \\((1-b) v_C\\) is conventionally ignored, because C is cheap.\n\nLet r denote the declared ratio r(cG, cS) . Since \\(v_{cG} = r v_{cS}\\), it follows from the two equations displayed above that\n\n$$\\begin{aligned} a v_G + (1-a) v_S = r b v_S. \\end{aligned}$$\n\nDividing by \\(av_S\\) and rearranging, we have\n\n$$\\begin{aligned} v_G/ v_S = r(b/a) - (1-a)/a. \\end{aligned}$$\n\nHence, the implied ratio for the pure metals, if the silver in coined gold is taken into account, is\n\n$$\\begin{aligned} r^{**} = r^*- (1-a)/a, \\end{aligned}$$\n\nwhere \\(r^* = r(b/a)\\) is the ratio if it is ignored. Note that the final adjustment, \\((1-a)/a\\), depends only on the fineness of the coined gold, not the coined silver. For crown gold (\\(a = 11/12\\)) it is 1/11, and for angel gold (\\(a = 191/192\\)) it is 1/191.\n\nAppendix 2: Harriot’s method of accounting for the alloy\n\nHarriot’s approach to the problem was different from the one described in the previous section, and no explanation of it has been found in his papers. The present writer was initially mystified, and was only convinced of its correctness after comparing the method with the formula for \\(r^{**}\\) displayed above.\n\nHarriot based his calculations on the weight of an amount of metal M having a given value y, which we shall denote here by \\(W_M(y)\\). The relationship between Harriot’s \\(W_M\\) and the \\(V_M\\) employed in Sect. 1 is simple. When M is such that an amount with value y has weight x, Harriot would say that \\(W_M(y) = x\\), while our statement is \\(V_M(x) = y\\). So we have what mathematicians now call a pair of inverse functions. We saw that the weight-value principle implies that \\(V_M(x) = x v_M\\), from which it follows that \\(W_M(y) = y w_M\\), where \\(w_M = 1/v_M\\). The corresponding formula for the ratio r(M, N), as used by Harriot, also follows: \\(r(M, N) = w_N / w_M\\). The fact that the formula is ‘upside-down’ is really just common sense.\n\nIn his calculations (folio 6788/112v) Harriot takes the unit of value to be 60 shillings, and the unit of weight to be one grain (one troy pound = 5760 grains). He is concerned with coined gold cG in the form of angels, 191/192 parts fine, with the ‘old’ value of 10 shillings for a coin weighing 80 grains. Thus, the weight of 60 shillings-worth is 480 grains. The coined silver cS is sterling silver, 37/40 fine, with its post-1601 value of 62 shillings for a troy pound. Hence, the weight of 60 shillings-worth is \\((60/62) \\times 5760 = 5574.193\\) grains. In the notation defined above,\n\n$$\\begin{aligned} w_{cG} = 480, \\qquad w_{cS} = 5574.193. \\end{aligned}$$\n\nHarriot’s first calculation is the ratio \\(r = r(cG, cS)\\) for the coined metals:\n\n$$\\begin{aligned} r = \\frac{w_{cS}}{w_{cG}} = \\frac{5574.193}{480} = 11.6129. \\end{aligned}$$\n\nNext he calculates the implied ratio for the pure metals, with the assumption that ‘both the alloys be deemed of no value’:\n\n$$\\begin{aligned} r^* = \\frac{(37/40) \\times 5574.193}{(191/192) \\times 480} = \\frac{5156.129}{477.5} = 10.7981. \\end{aligned}$$\n\nThe multipliers 37/40 and 191/192 are the finenesses b and a, respectively, so 5156.129 grains is the weight of pure silver in 60 shillings-worth of sterling silver, and 477.5 grains is the weight of pure gold in angel gold of the same value. In algebraic terms the formula is\n\n$$\\begin{aligned} r^* = \\frac{b w_{cS}}{a w_{cG}} = r (b/a), \\end{aligned}$$\n\nso this is clearly just another way of expressing the relationship obtained in the previous section.\n\nFinally, he considers what happens when the value of the silver in the gold is taken into account. His calculation is:\n\n$$\\begin{aligned} r^{**} = \\frac{5156.129 - 2.500}{477.5} = 10.7924. \\end{aligned}$$\n\nAs usual, he gives no explanation. At first sight it is not obvious why, by subtracting the 2.500 grains of silver in the angel gold from the 5156.129 grains in the sterling silver, the correct result has been has been obtained. However, in algebraic terms his formula is\n\n$$\\begin{aligned} r^{**} = \\frac{b w_{cS} - (1-a) w_{cG}}{a w_{cG}}, \\end{aligned}$$\n\nwhich is equivalent to the formula displayed at the end of the previous section. Given Harriot’s great insight into matters mathematical, we must credit him with a mental picture of the situation which made it obvious (to him).\n\nAppendix 3: Harriot on Alligation\n\nHarriot’s work on Alligation can be found in 6783/312r, 313v. The first of these folios contains notes on Stevin’s L’arithmetique (1585), specifically the third part of that work, La Practique d’arithmetique, pages 45–47.Footnote 39 In order to explain the underlying problem, we can do no better than use the notation that appears in Harriot’s next folio, 313v, entitled ‘Of Alligation’ (Fig. 5).\n\nThe basic problem is to produce an amount q of standard gold, with fineness c carats, given that two sorts of non-standard gold are available. One sort has fineness b carats and is worse than the standard, and the other has fineness d carats and is better. The solution is to combine \\(d-c\\) parts (by weight) of the worse sort with \\(c-b\\) parts of the better sort. This rule is easily verified in algebraic terms. The mixture will weigh \\( w = (d-c) + (c-b)\\) units in all, and its fineness will be f carats, where\n\n$$\\begin{aligned} wf = (d-c)b + (c-b)d. \\end{aligned}$$\n\nElementary algebra tells us that\n\n$$\\begin{aligned} w = (d-c) + (c-b) = d-b \\quad \\mathrm{and} \\quad (d-c)b + (c-b)d = (d-b)c = wc, \\end{aligned}$$\n\nso \\(f= c\\), as required. Although we now call this argument ‘elementary’, it must be stressed that, at the time Harriot wrote his notes, the use of algebra for this purpose was entirely original.\n\nStevin had given an example of the basic problem, and the following example of the more general problem where more than two sorts of gold are available.\n\nEXEMPLE III\n\nUn maistre de monnaies à cinq sortes d’or, la premiere de 2 Karats, la seconde de 3 Karats, la troisiesme de 4, la quatriesme de 11, la cinquiesme de 12; et veut masse de 20 marcqs à 5 Karats. Combien se prendre de l’or de chacune sorte?\n\nStevin’s solution is to combine the sorts in pairs so that each combination has the required fineness. Since the mixtures produced by the pairings all have the right fineness, they can be combined in any way to produce the total amount required. Indeed, as Stevin points out, whenever more than two sorts are available there are infinitely many solutions to the general problem. In his example there are three sorts (2, 3, 4 carats) that are worse than the required standard (5 carats), and two sorts (11, 12 carats) that are better, so there are six possible pairs. For reasons that he does not explain, Stevin chooses to use just three of them. Applying the simple rule for combining a worse sort (b carats) and a better sort (d carats), he works out the amounts needed in these cases, given that the required standard is \\(c=5\\).\n\nFor the pair \\(b= 2\\) and \\(d=11\\) use the proportions \\(d-c = 6\\) and \\(c-b= 3\\).\n\nFor the pair \\(b= 3\\) and \\(d=12\\) use the proportions \\(d-c = 7\\) and \\(c-b = 2\\).\n\nFor the pair \\(b= 4\\) and \\(d=11\\) use the proportions \\(d-c = 6\\) and \\(c-b = 1\\).\n\nSo the rule for the first pair is to combine 6 parts of 2-carat gold and 3 parts of 11-carat gold. Applying the same rule to the other pairs, and putting the mixtures together, it follows that a solution is obtained by combining 6 parts of 2-carat gold, 7 parts of 3-carat gold, 6 parts of 4-carat gold, 3+1 = 4 parts of 11-carat gold, and 2 parts of 12-carat gold. This produces a total of 25 parts of metal of the required fineness. The required amount is actually 20 marks, which must be divided in the proportions 6:7:6:4:2. Specifically, the amount of 2-carat gold required is \\((6/25) \\times 20 = 4 \\frac{4}{5}\\) marks, and so on.\n\nFig. 5 Harriot’s algebraic treatment of Alligation. ©British Library Board BL Add MS 6783 f.313v Full size image\n\nHarriot made a note of Stevin’s solution in 6783/312r, together with other jottings of the same kind. In the next folio (Fig. 5) he set out the rule for pairing in algebraic terms, including the determination of the actual quantities required in terms of the total amount q.\n\nAppendix 4: Analysis of mixtures by the hydrostatic method\n\nOne of Harriot’s significant innovations was his application of the hydrostatic method to the analysis of coined gold (Fig. 4). We recall that, in ancient times, irregular lumps of gold or silver were often used as money. Because it was difficult to determine accurately the volume of such objects, they were usually measured by weighing them. The same was true for coined money, since the weight of a coin could be controlled much more effectively than its shape and thickness. One consequence of this fact was that mixtures of metals were (and still are) described in terms of the proportions of the constituents by weight. Another consequence was the inaccuracy of direct measurements of density (because both weight and volume had to be measured).\n\nAn alternative method of measuring density, which requires weighing only, goes back to Archimedes. The method is explained in Sect. 4 of the main article, together with evidence suggesting that it was not until the end of the sixteenth century that the hydrostatic method was taken seriously.\n\nIn general, the application of hydrostatic weighing to the assay of mixtures can be described as follows. A mixture is formed by combining n substances in proportions \\(p_1, p_2, \\ldots , p_n\\), where \\(p_i \\; (1 \\le i \\le n)\\) is a number between 0 and 1. The substances have densities \\(d_1, d_2, \\ldots , d_n\\), and the mixture has density D. It follows that one weight-unit of the mixture has volume 1 / D, and \\(p_i\\) weight-units of substance i have volume \\(p_i/D_i\\). Thus\n\n$$\\begin{aligned} \\frac{1}{D} = \\frac{p_1}{d_1} + \\frac{p_2}{d_2} + \\quad \\cdots \\quad + \\frac{p_n}{d_n} \\quad \\mathrm{where} \\quad p_1 + p_2 + \\cdots + p_n = 1. \\end{aligned}$$\n\nThe application of this formula depends on the circumstances. Suppose the mixture is composed of just two substances, and their densities \\(d_1, d_2\\) are known (from a table, say). Then an experimental determination of the density of the mixture D gives the proportions, by solving the equations\n\n$$\\begin{aligned} \\frac{p_1}{d_1} + \\frac{p_2}{d_2} = \\frac{1}{D}, \\qquad p_1 + p_2 = 1. \\end{aligned}$$\n\nThis is the situation if coined gold is actually composed of gold and silver only. But if there are three components, gold, silver, and copper, then we have only two equations for three unknowns, and the proportions cannot be found. However, with coined gold, the proportion of pure gold was allegedly fixed, so the proportions of silver and copper can be calculated. The calculation shown in Fig. 4 was Harriot’s attempt to test his experimental results against the official prescriptions."}, {"url": "https://lens.monash.edu/@science/2021/07/26/1383475/the-scientific-genius-who-eschewed-fame-remembering-thomas-harriot-400-years-on", "page_content": "Four hundred years ago, on 2 July, 1621, a remarkable Englishman named Thomas Harriot died in London. He left behind some 8000 pages of scientific research, but it’s only in recent decades that scholars have uncovered their treasures.\n\nAnd what they show is that Harriot independently made many significant discoveries now attributed to other, more famous scientists. Some scholars have called him “the English Galileo” and “the greatest British mathematical scientist before Newton”.\n\nYet Harriot died without publishing a single word of this extraordinary output. His tale reminds us that, while we may sometimes think science progresses through a series of renowned pioneers who single-handedly overturn entrenched beliefs, the story is rarely so simple.\n\nWhat did Harriot discover?\n\nFor instance, we learn in school that Galileo Galilei initiated telescopic astronomy and discovered the law of falling motion. But Harriot independently did both of these things.\n\nThomas Harriot’s 1609 map of the Moon, drawn by observing through a telescope. Image: Wikimedia\n\nHe also deduced fledgling general laws governing the motion of everyday objects, again independently of Galileo, and before René Descartes. (Half a century later, Isaac Newton developed the definitive laws of motion.)\n\nHarriot studied light, too, discovering the secret of colour and the nature of the rainbow before Newton, and finding the law of refraction (which we know today as Snell’s law) before the Dutch astronomer Willebrord Snell.\n\nHe also made a mathematical study of population growth before Thomas Malthus, developed a completely symbolic form of sophisticated algebra before Descartes, discovered binary arithmetic before Gottfried Leibniz, and took steps on the road to calculus with his work on infinite series.\n\nThe law of falling bodies\n\nIt wasn’t until 2008 that Harriot’s work on gravity was fully reconstructed, by the German scholar Matthias Schemmel.\n\nAs Schemmel pointed out, Harriot and his contemporary Galileo were heirs to essentially the same body of knowledge. It’s perhaps not so surprising, then, that they made some of the same breakthroughs. There are plenty of examples of independent co-discoveries in history, most famously that of calculus by Newton and Leibniz.\n\nThe law of falling motion says that without air resistance, all objects, no matter their size or mass, fall from the same height at the same rate.\n\nLegend has it Galileo dropped balls from the Leaning Tower of Pisa to study how they fell. Nobody knows if this is true, but Harriot had the same idea – he recorded the time, in pulse beats, that it took for different objects falling from as high as 55½ feet (about 17 metres) to reach the ground.\n\nRead more: Copernicus' revolution and Galileo's vision: Our changing view of the universe in pictures\n\nBoth Harriot and Galileo devised more accurate experiments, however, from which they derived a mathematical understanding of how things fall.\n\nThis combination of experiment and mathematics is now the accepted way to derive a law of nature. Quantifying observations means others can test the results, and use them to make useful predictions.\n\nHarriot and Galileo weren’t the first to understand the role of observation and mathematics in this context, of course. But they were among the most successful of the pre-Newtonian pioneers.\n\nGalileo didn’t publish his work on gravity until after Harriot had died, and there’s no evidence that the two men ever met or corresponded.\n\nThe law of refraction and the shape of the rainbow\n\nThe German astronomer Johannes Kepler, however, did correspond briefly with Harriot. Kepler had been working on the nature of light and vision when word reached him that Harriot had unravelled two mysteries – the law of refraction, and why the rainbow has its magical colours and unique shape.\n\nThe law of refraction describes how light bends when it passes from one medium into another, which explains how an image can be focused by a glass lens, or why your leg looks wobbly when you dip it in a swimming pool.\n\nA diagram from Ibn Sahl’s 10th-century treatise on optics showing the path of light refracted by a lens. Image: Wikimedia\n\nHarriot derived this law 20 years before Snell, but there’s a popular belief that the 10th-century Baghdad-based scholar Abū Saʿd al-ʿAlāʾ ibn Sahl beat even Harriot. This is not quite right – Ibn Sahl is a notable pioneer whose geometrical diagram of light focused by a lens gives, in hindsight, the correct refractive path. But there’s no evidence he deduced his result from experiment, or that he understood the general properties of refraction.\n\nJudging from his surviving papers, even Snell failed to generalise his result, which he, like Ibn Sahl, never wrote as the neat trigonometric equation we use today. Harriot, by contrast, did. His derivation of the general law of refraction is another example of his rigorous blend of experiment and mathematics.\n\nRead more: Curious Kids: Why are rainbows round?\n\nHarriot’s other adventures\n\nIf only Harriot had published! In the early stage of his career, though, he was bound by commercial secrecy, for his first patron was controversial statesman and entrepreneur Sir Walter Raleigh. Harriot was also busy dodging heretic hunters, and sailing the high seas as Raleigh’s navigational advisor.\n\nThomas Harriot published only one work in his lifetime – a report on his stay in North America in the 1580s. Image: Wikimedia\n\nRaleigh had delusions of empire and glory, and wanted to establish a trading colony in today’s US before the Spanish beat him to it. The one work Harriot did publish in his lifetime was “a brief and true report” on the economic potential of Raleigh’s chosen American site.\n\nHarriot’s contribution to colonialism has justly attracted its share of criticism. Nonetheless, his report is still widely praised for its sympathetic depiction of the way of life of the North Carolina Algonquian people, as it was when Europeans first set foot on their land. Harriot learned the local language, and enjoyed much about the year he spent living with the Algonquians.\n\nWhat he loved doing most, though, was mathematics and physics. He was neither flamboyant nor ambitious, and when he was wrongfully imprisoned through an unlucky connection with the Gunpowder Plot (a failed attempt to assassinate King James I), he told his jailers he just wanted ...\n\n“... to live a private life for the love of learning that I might study freely”.\n\nConclusion\n\nIn the late 1590s, Harriot had found a second patron, Henry Percy, the ninth earl of Northumberland. It was then that he was able to study the mysteries of nature and the marvels of mathematics for their own sakes, rather than the “applied” work he had done for Raleigh.\n\nHaving two generous patrons meant Harriot didn’t need to publicise his discoveries to attract funding, the way Galileo did. Nor did he care about fame, despite being urged by friends to claim his priority. His manuscripts do contain several almost-finished treatises, but it seems he was so busy doing science that he never managed to put his results together for the printer.\n\nAfter his death, well-meaning scholars carved up his manuscripts in an attempt to study and publish them. In the process, however, all the papers disappeared, seemingly lost forever. Then, 150 years later, the Hungarian astronomer Franz Xaver Zach discovered them, locked safely away in Northumberland’s castle.\n\nMost of the papers were then given to the British Museum. They’re now in the British Library, where I had the privilege of studying them. (They’re also available online.)\n\nAs for Harriot, no one knows much about him as a person – not even his birthday. Nevertheless, he’s fascinated scholars for the past half-century (as I discovered some years ago when I set out to bring his story to a wider, non-specialist readership).\n\nThat’s because despite the lack of biographical data, those precious manuscripts show that what mattered most to Harriot himself was mathematics and science. Four hundred years on, his mix of genius and dedication is something to honour.\n\nThis article originally appeared on The Conversation."}, {"url": "https://www.wikiwand.com/en/Sir_Thomas_Herriott", "page_content": "Thomas Harriot ( ;[2] c. 1560 – 2 July 1621), also spelled Harriott, Hariot or Heriot, was an English astronomer, mathematician, ethnographer and translator to whom the theory of refraction is attributed. Thomas Harriot was also recognized for his contributions in navigational techniques,[3] working closely with John White to create advanced maps for navigation.[3] While Harriot worked extensively on numerous papers on the subjects of astronomy, mathematics and navigation, he remains obscure because he published little of it,[4] namely only The Briefe and True Report of the New Found Land of Virginia (1588).[3] This book includes descriptions of English settlements and financial issues in Virginia at the time.[3] He is sometimes credited with the introduction of the potato to the British Isles.[5] Harriot invented binary notation and arithmetic several decades before Gottfried Wilhelm Leibniz, but this remained unknown until the 1920's.[6] He was also the first person to make a drawing of the Moon through a telescope, on 5 August 1609, about four months before Galileo Galilei.[7]\n\nThomas Harriot observing the Moon through his telescope from the roof of Syon House.\n\nEnglish astronomer, mathematician, ethnographer and translator\n\nQuick facts: Thomas Harriot, Born, Died, Nationality, Alma... ▼\n\nAfter graduating from St Mary Hall, Oxford, Harriot traveled to the Americas, accompanying the 1585 expedition to Roanoke island funded by Sir Walter Raleigh and led by Sir Ralph Lane. He learned the Carolina Algonquian language from two Native Americans, Wanchese and Manteo, and could translate it, making him a vital member of the expedition. On his return to England, he worked for the 9th Earl of Northumberland."}, {"url": "https://euro-math-soc.eu/review/thomas-harriot", "page_content": "As a young mathematician and astronomer, Thomas Harriot (c. 1560-1621), was hired by Sir Walter Ralegh, to train the captains of the ships ready to cross the Atlantic and claim some territory for England in the New World. Ralegh was a poet, politician, and frequenter of the court of Queen Elisabeth I. The faith of the two man was entangled since. A first expedition brought two native Americans back to England and Harriot learned their language and invented a phonetic alphabet to write it down. He even crossed the ocean himself to visit their home land during a second expedition. After his return, he wrote the only book published during his life: The Briefe and True Report of the New Found Land of Virginia (Virginia named after Elisabeth, the virgin queen). He continued working for Ralegh as a land surveyor. Later Harriot got employed by Henry Percy, 9th Earl of Northumberland. With observations and tedious computations he improved his skills as an astronomer, a mathematician, and a physicist.\n\nElisabeth, the short tempered virgin queen, depended on trusted advisors like Ralegh and Percy, but when Ralegh got married without her consent, she considered it treason. The period was turbulent with many political en religious tensions for example with the catholic Queen Mary of Scots, and hence also with France and Spain resulting in naval battles. Privateering was a lucrative pastime for the crew of the ships that were exploring the New World. Political compromises and treason, spying and conspiracies, were common games for Queen Elisabeth and her successor King James. Take on top of that the emergence of the scientific revolution of the 17th century, and the exploration of the North and South Americas, and Arianrhod has all the ingredients to write a thrilling and adventurous novel about it, and so he did. Only it is all based on true and well documented facts.\n\nArianrhod has found a good balance between explaining the mathematical and astronomical work of Harriot, and sketching what happened on a political and personal level of the main characters that he describes in the turmoil of events at the end of the 16th and the early 17th century. These main characters whose fortunes and misfortunes are told, are besides Harriot mainly Ralegh and to some extend also Percy but there are many others as well. Too many to keep track of if this were a fiction novel, but real life is not that simple. A name list in the appendix with one line description per name might have been welcome for a reader not so familiar with the period, its politics and its science.\n\nIt is characteristic of many biographers that they bring an idolatrous glorification of their subject. Somehow this struck me in this book too. It is clear that Arianrhod describes Harriot and Ralegh as the worthy heroes with almost sacred virtues. For example the attitude that Harriot and Ralegh have towards the native Americans, considering them as friends and treating them with respect, leaving their dignity is unusual for that time. The devotion of Ralegh for his queen, even when she locked him up in the Tower of London for many years (as she also did with Percy) is outspoken. His continued attempts to colonise parts of North and South America to flatter the Queen (which both turned out to be disastrous) and the noble way he behaved on the scaffold when he was beheaded under King James I are almost beyond human limits.\n\nHarriot fell under the bad faith of his employers when they were accused of treason, and that shone on him and his work and ideas were scrutinized for possible atheistic elements. He was even imprisoned for a short while on the charge that he had cast an horoscope on King James during the Gunpowder Plot. However, he always tried to stay somewhat in the shadow, concentrating on his scientific work, and so he escaped most of the misfortunes that befell on his employers and could have been his faith too. This is one element of excitement, but the whole book is a thriller: will the pioneers survive crossing the ocean, will they survive in the midst of unknown tribes, will the prisoners of the Tower be executed, will the catholic Gunpowder Plot or the courtier's Main Plot against King James be a success, will the war at sea with Spain be won, will the money be raised for yet a new expedition,... all components that can bring some tension in an engaging story told with brio. That is why, besides Harriot, Ralegh, and Percy, many other (mostly political and scientific) characters are staged in this complicated interplay of intrigues. And Arianrhod is not the first to use these elements in a book. He suggests that Shakespeare has used some of the events described here as scenes in his plays.\n\nWhen it comes to Harriot himself, these parts of the book are mainly about his scientific achievements. The reader is instructed about how Harriot explained the seamen what they should know to find the position of his ship, and how they could compute it in an efficient way. We learn about his study of the loxodromic curve and the equiangular spiral, how he unravelled the secret of the Mercator projection, how he measured the acceleration of free falling objects to study gravitation and how he computed the trajectory of a canon ball (that was before Newton formulated his laws of motion). Harriot studied the precession of the Earth and the Gregorian calendar, the refraction of light and gave an explanation for the rainbow. We read about his atomistic views, his exploration of probability theory, and of course his astronomical computations and his study of sunspots. He produced a map of the moon and he had some correspondence with Kepler. He was also one of the first to simplify algebra by introducing symbolic notation: he used letters for variables, he had a notation for exponents, a variant of our equal sign,... Arianrhod places all his discoveries in context, sometimes going back to Greek antiquity or by discussing contemporaries or scientists who came after Harriot who discovered the same things independently, and whose name became attached to these results.\n\nIt is a shame that Harriot did not publish more because that would certainly have given him a reputation comparable to Galileo, Kepler, and cartographers and mathematicians of his time. When at the age of sixty he seemed to be ready to start rounding up his work and publish it, he got health problems. It might have been a kind of cancer that started with his nose that finally killed him. It is not unlikely that it was caused by excessively smoking tobacco. Allegedly he, and his employer Ralegh, are responsible for introducing pipe smoking in England. He made his testament and asked some friend to order his notes and publish them posthumously. However not much came out of that. His notes got lost until they were rediscovered at the end of the 18th century, but again, it took a long time before it was recognized that Harriot had a lot of results that we now know by the name of other scientists, while Harriot had these already much earlier. Slowly Harriot's achievements were realized by historians analysing his notes that are now fully digitized and made available through the European Cultural Heritage Online.\n\nTo conclude: this is a marvelous book because of the engaging way it is told, very much unlike a dull biography with an enumeration of facts. Moreover it is also well documented by additional material to be found in the last 100 pages of the book. There you can find a number of graphic illustrations that are needed to understand some of the mathematics that are discussed. These are moved to the appendix probably to allow the reader to skip some of the mathematics if he or she is not interested. Many of these extra pages are filled with notes that explain some background or give the origin of a quote or a justification for a statement in the text. Of course the list of primary and secondary sources used are there too, and a well stuffed index of names and subjects. A warmly recommended read about England in the period of Shakespeare, shortly before Newton, with in the background a turbulent dance of politics, when war could still be avoided by marriage, but fighting over colonizing the Americas, and over religious controversies never ceased. On this canvas Arianrhod paints the bubbling emergence of the Scientific Revolution to which Harriot was a silent contributor."}]}