{"Tadeusz Szeligowski taught Witold Lutosławski.": [{"url": "https://www.britannica.com/biography/Witold-Lutoslawski", "page_content": "Witold Lutosławski, (born Jan. 25, 1913, Warsaw, Pol.—died Feb. 7, 1994, Warsaw), outstanding Polish composer of the 20th century who attempted to create a new musical language by incorporating elements of folk songs, 12-tone serialism, atonal counterpoint, and controlled improvisations reminiscent of aleatory (chance, see aleatory music) compositions while retaining elements of conventional harmony and melody.\n\nLutosławski studied mathematics at the University of Warsaw and received diplomas in piano (1936) and composition (1937) from the Warsaw Conservatory. During the Nazi occupation of Poland, he performed in clandestine concerts that included proscribed music. His prewar works (most notably the Symphonic Variations, 1938) were primarily conventional neoclassical pieces, often infused with traditional folk tunes. When his Symphony No. 1 (begun in 1941) had its premiere in 1948, however, the new communist government denounced the piece as “formalist” and banned Lutosławski’s increasingly avant-garde works from public performance. He earned a living writing children’s songs and scores for motion pictures until those restrictions were eased in the mid-1950s. He was honoured with the first of his many government prizes in 1955, soon after composing his Concerto for Orchestra, based on folk themes.\n\nLutosławski spoke of his Funeral Music for string orchestra (1958) as marking a turning point in his style; a 12-tone work, it is dedicated to the memory of the Hungarian composer Béla Bartók. This he followed with an experimental piece in which he first used aleatory operations in combination with conventional effects: Venetian Games, written for the Venice Festival of 1961. In this work Lutosławski used unconventional visual notation to guide the performer in the various improvisatory operations.\n\nAlthough Lutosławski is best known for his orchestral works, he also wrote piano pieces, children’s songs, choral works, and a string quartet (1964). His later works include Concerto for Cello and Orchestra (1970), Chain 2: Dialogue for Violin and Orchestra (1985), Piano Concerto (1988), and Symphony No. 4 (1992)."}, {"url": "https://www.encyclopedia.com/people/literature-and-arts/music-history-composers-and-performers-biographies/witold-lutoslawski", "page_content": "Witold Lutoslawski\n\nWitold Lutoslawski (1913-1994) was the leader of the group of Polish composers who came into prominence in the 1950s. His work was performed and honored worldwide throughout his lifetime.\n\nWitold Lutoslawski was born in Warsaw, Poland, and spent all of his formative years there. He received his musical education at the Warsaw Conservatory and also attended the university as a mathematics student. During World War II he served in the military radio section of the occupying German army in Warsaw.\n\nLutoslawski was active in reorganizing Polish cultural life after the war. He formed the Union of Polish Composers and the Society for the Publication of Polish Music, and he helped to organize the first Warsaw Festival in 1956. These annual festivals served as a showcase for Poland's young composers, whose number and originality astounded the musical world. Before the war Poland had not been strong in creative musicians, and during the war it had been cut off from the rest of Europe.\n\nMusical Work and Influence\n\nLutoslawski's early compositions show the influences that helped to form his style. His Symphonic Variations on a Theme by Paganini (1938) for two pianos is a brilliant piece, strongly influenced by Igor Stravinsky's neoclassicism in its sharp dissonance and use of jazz. Lutoslawski's First Symphony (1947) is also a neoclassic work. His Concerto for Orchestra (1954) shows a new influence: the music of Béla Bartók. It has a strong folk-music basis, not in the manner of the 19th-century nationalists but in Bartók's forthright dissonant manner. The brilliance of the orchestral writing equals that found in Bartók's Concerto for Orchestra. Lutoslawski acknowledged his debt to Bartók in one of his most powerful compositions, Trauermusik (1958; Mourning Music). In this piece he uses a modified twelve-tone technique, showing his awareness of Arnold Schoenberg and the second Viennese school of composers, but this was not to be a permanent influence. \"My music,\" Lutoslawski said, \"has no direct relationship to the traditions of the Viennese school. I am much more strongly tied to Claude Debussy, Stravinsky, Bartók, and Varèse.\"\n\nIn Venetian Games (1961), Three Poems by Henri Michaux (1963), and the Second Symphony (1969) Lutoslawski uses controlled aleatory effects, giving the individual orchestra members freedom to play some passages as they choose with respect to notes and rhythm. In Poems, written for 23 instruments and a chorus of 20, each singer has an individual part, which they speak, whisper, moan, and shout as well as sing. Lutoslawski's use of such devices is always for expressive purposes. No matter how experimental and advanced these works are, his musical vitality, combined with his discipline of traditional craftsmanship, gives his compositions a seriousness, dignity, and power of communication rarely found among contemporary composers.\n\nAward and Honors\n\nLutoslawski won a UNESCO prize in composition in 1959 and was elected to the presidency of the International Society for Contemporary Music that year. He taught at the Berkshire Music Center in Lenox, Massachusetts, the Dartmouth Congregation of the Arts in Hanover, New Hampshire, the Dartington Summer School in England, and in Stockholm, Sweden. In 1985 he was invited to the dedication ceremony of the Polish Music Reference Center at the University of Southern California at Los Angeles. During his two-week stay there, he presented five original manuscripts to the Center.\n\nHe and his work were recognized many times in his lifetime. Lutoslawski's awards included the University of Louisville Grawemeyer Award in 1985 for his Third Symphony; the 1993 Kyoto (Japan) Prize in Creative Arts and Moral Sciences; the Grammy Award, Cecilia Prize, Koussevitsky Award and Grammaphone Award, all in 1986, for the Los Angeles Philharmonic Recording of his Third Symphony, and Britain's Classical Music Award in January, 1997, for his Fourth Symphony. He also received several honorary degrees.\n\nUpon presenting the Kyoto Prize, the Inamori Foundation said, \"His works have had a powerful effect on the postwar musical world. A new method of atonality, the distinctive aleatoric music, and development of contemporary forms of musical expression have made him a master of music in the 20th century.\"\n\nLutoslawski died Feb. 7, 1994, in Warsaw, at the age of 81. He is survived by his wife, Danuta.\n\nFurther Reading\n\nOve Nordwall, ed., Lutoslawski (1968), contains analyses of each of Lutoslawski's compositions up to 1967 as well as a biographical sketch, a complete catalog of his works, and an essay by the composer; see also David Ewen, The World of Twentieth-century Music (1968); and Peter S. Hansen, An Introduction to Twentieth Century Music (3d ed. 1971).\n\nAdditional Sources\n\nWilk, Wanda, \"Poland Loses a Great Son, A Great Loss to the World,\" Polish-American Journal. April 1, 1994.\n\nKaczynski, Tadeusz, Conversations with Witold Lutoslawski, London: Chester Music, c1984.\n\nStucky, Steven, Lutoslawski and His Music, New York: Cambridge University Press, c1981. □"}, {"url": "https://www.npr.org/sections/deceptivecadence/2012/03/06/148038598/witold-lutoslawski-always-searching-for-a-new-sound", "page_content": "Witold Lutoslawski: Always Searching For A New Sound\n\nEnlarge this image toggle caption L. Kowalski/Wikimedia Commons L. Kowalski/Wikimedia Commons\n\nIt wasn't always easy for Polish composer Witold Lutosławski to find his musical voice.\n\nHis Symphonic Variations, which opens this third disc in a series of Lutosławski's music, was shunned by a Warsaw Conservatory professor in the late 1930s. Not understanding the young student's score, the teacher, Witold Maliszewski, said, \"For me your work is ugly.\"\n\nThe piece might have turned heads at the strait-laced conservatory, but listening to it now, in this sparkling new recording by the BBC Symphony and conductor Edward Gardner, you hear music solidly in the early 20th-century European tradition. Ironically, you can trace the whiffs of Stravinsky, sweeping post-Romantic gestures and bright bursts of color directly back to Maliszewski's own teacher, Nikolai Rimsky-Korsakov.\n\nIn 1939, Lutosławski was set to study in Paris, but the German invasion of Poland put an end to that, and he was asked to serve his country. Lutosławski was captured by the Germans but escaped after eight days, making his way 100 miles back to Warsaw. There he eked out a living playing piano in cafes and cabaret bands. He also wrote his Variations on a Theme by Paganini for two pianos, which appears on this album in a later version he created for piano and orchestra. Again, Lutosławski shows off his ability to make an orchestra shine. The jazzy rhythms, the score's few tender moments and a digitally crisp performance by pianist Louis Lortie make for an irresistible nine minutes of music.\n\nThe Paganini Variations mark another grim milestone for Lutosławski. In 1944, as the doomed Warsaw uprising was about to break out, he grabbed only a handful of manuscripts (including the Paganini piece) as he and his mother fled for safety. The remainder of his compositions burned during the destruction of the city.\n\nEven as Lutosławski's music began to reach more ears, he searched for new paths of expression — not an easy task while under the thumb of Soviet cultural apparatchiks. In 1949, his First Symphony was denounced as \"formalist\" and banned. After Stalin died in 1953, things started looking up, especially when the Concerto for Orchestra (recorded for the first volume in this series) won several prizes and cemented Lutosławski's status as Poland's preeminent composer.\n\nEnlarge this image toggle caption L. Kowalski/Wikimedia Commons L. Kowalski/Wikimedia Commons Hear The Music Song: Symphony No. 4 [Quarter note = c. 55 - Eighth note = c. 160 - Tempo 1 (Quarter note = c. 55) - Eighth note = c. 160]\n\nSymphony No. 4 [Quarter note = c. 55 - Eighth note = c. 160 - Tempo 1 (Quarter note = c. 55) - Eighth note = c. 160] from Witold Lutoslawski: Orchestral Works, Vol. 2\n\nWitold Lutoslawski: Orchestral Works, Vol. 2 by Louis Lortie\n\nStill, Lutosławski was searching for something. He found part of his answer in the late 1950s when he began to formulate building blocks comprised of 12-note chords. This wasn't the serialism developed by Arnold Schoenberg. Instead, these were blocks of sounds divided into registers and groupings of pitches. At the same time, Lutosławski began to riff on John Cage's ideas of chance and randomness, creating his own formula of \"controlled\" chance elements.\n\nBy the 1980s, Lutosławski's reputation reached worldwide, but again the restless composer discovered yet another type of musical language. He shifted towards clearer harmonies and more lyricism in works like the Piano Concerto from 1988, which is also on this new disc in a performance with plenty of detail and dexterity from Lortie. It contains nods to Rachmaninov's romanticism and, in the finale, the Baroque chaconne.\n\nLutosławski's last major work, the Symphony No. 4, closes the album. Had he finally found his sound? Again, large doses of lyricism prevail, especially in the dark and ruminative opening where a passionate clarinet line blossoms from a haze of strings. Lutosławski conducted the premiere with the Los Angeles Philharmonic in 1993. A year later, he died of cancer.\n\nLutosławski wasn't overly prolific, leaving us 120 pieces. Yet his output stands as a huge testament to a major pioneering spirit — one that helped raise the prestige of Polish music and inspired the following generations of musicians."}, {"url": "https://pwm.com.pl/en/sklep/publikacja/bukoliki,witold-lutoslawski,520,ksiegarnia.htm", "page_content": "Oświadczam, iż zapoznałem się z regulaminem świadczenia usługi Newsletter i go akceptuję.\n\nWyrażam zgodę na przesyłanie na podany powyżej adres email wiadomości zawierających informacje handlowe Polskiego Wydawnictwa Muzycznego\n\n\n\nAdministratorem dobrowolnie podanych danych osobowych jest Polskie Wydawnictwo Muzyczne z siedzibą w Krakowie (31-111) przy Al. Krasińskiego 11A. Twoje dane osobowe będą przetwarzane w celu wysyłki Newslettera zawierającego informacje marketingowe administratora danych. Posiada Pani/Pan prawo dostępu do treści oraz poprawiania swoich danych osobowych. Informujemy, iż poza podmiotami uprawnionymi na podstawie przepisów prawa, zebrane dane osobowe nie będą udostępniane."}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/szeligowski-tadeusz", "page_content": "Szeligowski, Tadeusz\n\nSzeligowski, Tadeusz, notable Polish composer and pedagogue; b. Lemberg, Sept. 12, 1896; d. Poznan, Jan. 10, 1963. He studied piano with Kurz in Lemberg (1910-14) and composition with Wallek-Walewski in Krakow, where he also took a doctorate in law at the Univ.; after further studies with Boulenger in Paris (1929-31), he taught in Poznan (1932-39; 1947-62) and in Warsaw (1951-62). From 1951 to 1954 he served as president of the Polish Composers’ Union.\n\nWorks\n\ndramatic: Opera: Bunt Zaków (Rebellion of Clerks; Wroclaw, July 14, 1951); Krakatuk, after E.T.A. Hoffmann (1955; Gdansk, Dec. 30, 1956); Theodor gentleman (1960; Wroclaw, 1963). Ballet: Paw i dziewczyna (The Peacock and the Maiden; 1948; Wroclaw, Aug. 2, 1949); Mazeppa (1957; Warsaw, 1959). ORCH.: Kaziuki, suite (1928); Concerto for Orchestra (1932); Clarinet Concerto (1932); Epitaph for Kami Szymanowski for Strings (1937); Piano Concerto (1941; Krakow, May 17, 1946); Suita lubelska for Small Orch. (1945); Nocturne (1947); Burlesque Overture (1952). CHAMBER: 2 string quartets (1929, 1934); Nocturne for Cello and Piano (1945); Orientale for Cello and Piano (1945); Wind Quintet (1950); Flute Sonata (1953); Air grave et air gai for English Horn and Piano (1954); Piano Trio (1956). Piano: Sonatina (1940); Sonata (1949). VOCAL: Triptych for Soprano and Orch. (1946); Kantata o sporcie for Voice, Chorus, and Orch. (1947); Wesele lubelskie (Lublin Wedding), suite for Soprano, Chorus, and Small Orch. (1948); Rapsod for Soprano and Orch. (1949); Paniez i dziewczyna (The Young Squire and the Country Girl), musical dialogue for Soprano, Baritone, Chorus, and Orch. (1949); Karta sere (The Charter of Hearts), cantata (1952); Renegade, ballad for Bass and Orch. (1953); songs.\n\nBibliography\n\nT. S.: W 10 rocznice smierci (T. S.: On the 10thAnniversary of His Death; Gdansk, 1973).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "https://catalog.lib.uchicago.edu/vufind/Record/758241/Details", "page_content": "245\n\n1\n\n0\n\n|a Conversations with Witold Lutoslawski / |c by Tadeusz Kaczyński ; translated from the Polish by Yolanta May."}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/rudzinski-witold-0", "page_content": "Rudziński, Witold\n\nRudziński, Witold Polish composer and pedagogue; b. Sebezh, Lithuania, March 14, 1913. He studied composition with Tadeusz Szeligowski and piano with Stanislaw Szpinalski at the Cons., and Slavonic philology at the Stefan Batory Univ. (graduated, 1936) in Vilnius. In 1938–39 he completed his training in composition with Nadia Boulanger and Charles Koechlin in Paris, where he also studied Dom André Mocquereau’s theory of rhythm at the Gregorian Inst. From 1939 to 1942 he was prof. of theory at the Vilnius Cons. After residing in Warsaw (1943–5), he was a prof. at the Lodz Cons. (1945–47). He then returned to Warsaw and served as director of the music dept. of the Ministry of Culture and Art (1947–48) and of the State Phil, and Central Opera (1948–49). In 1957 he became a lecturer in composition and theory at the State Higher School of Music, where he also was vice-rector (1967–69). In 1965 he won 1st prize in the Grieg Competition for Composers in Bergen. He received various Polish state honors and was awarded an honorary doctorate by the Warsaw Academy of Music in 1998. Among his important Writings are a monograph on Moniuszko (Krakow, 1954), Warsztat kompozytorski Beli Bartóka (The Composing Technique of Bela Bartók; Krakow, 1964), and Nauka o rytmie muzycznym (The Study of Musical Rhythm; Kraków, 1987).\n\nWorks\n\nDRAMATIC: Janko muzykant (Janko the Fiddler), opera (1951; Bytom, June 20, 1953); Komendant Paryia Qaroslaw Dqbrowski) (The Commandant of Paris [Jarostaw Dabrowski]), opera (1958; Poznań, March 27, 1960); Odprawa postów greckich (The Dismissal of the Greek Envoys), opera (1962; Kraków, Nov. 14, 1966); Sulamita, opera (1964); Żótta szlafmyca (The Yellow Nightcap), comic opera (1969; Gdynia, Jan. 25, 1970); Chtopi (The Peasants), opera (1972; Warsaw, June 30, 1974); Pierścień i róża (The Ring and the Rose), children’s opera (1982; Wroclaw, Oct. 13, 1984); Jakub i Rachel (Jacob and Rachel), ballet (1991). ORCH.: Piano Concerto (1936; rev. 1947); 2 syms. (1938, 1944); Divertimento for Strings (1940); Parady (Parades), suite (1958); Muzyka koncertujqca (Musique concertante) for Piano and Chamber Orch. (1958; Warsaw, Sept. 20, 1961); Obrazy Świetokrzyskie (Pictures from the Holy Cross Mountains; 1965); Moniuszkiana, suite (1965); Concerto Grosso for Percussion and 2 String Orchs. (1970; also for Percussion and 2 Pianos, 1992); Uivertura góralska (Highlander Overture; 1970); Capriccio-Impromptu-Hommage à Bizet for Violin and Small Orch. (1986; also for Violin and Piano, 1980). CHAMBER: lute Sonatina (1934); Viola Sonata (1946); Nonet (Prague, May 1947); Quintet with Flute (1954; Warsaw, Feb. 1955); Wariacje i fuga (Variations and Fugue) for Percussion (1966); Preludia for Clarinet, Viola, Harp, and Percussion (1967; Warsaw, May 26, 1969); Largo, aria e toccata for Harp (1968; Warsaw, May 26, 1969); Burleska for Clarinet and Piano (1969); Polonaise-rapsodie for Cello and Piano (1969; Warsaw, April 29, 1970); Fantazja góralska (Highlander Fantasia) for Guitar (1970); Sonata pastorale for Violin and Piano (1978); Capriccio-Impromptu-Hommage à Bizet for Violin and Piano (1980; also for Violin and Small Orch., 1986); Ricercar sopra “Roman Lasocki” for Violin (1981; Barcelona, Dec. 9, 1982); Pobudka (Reveille) for 4 Violins (1985); Dialog, alto saxophone sonata (1987); Plejadi/ (Pleiades), clarinet sonata (1987; Warsaw, March 9, 1988); Kasjopea (Cassiope), violin sonata (1987); Concerto grosso for Percussion and 2 Pianos (1992; also for Percussion and 2 String Orchs., 1970); Serenata for Violin, Viola, and Cello (1993); Etude-Fantaisie for Flute and Piano (1994); Capriccio for Clarinet (1995); Passacaglia for Violin (1996). KEYBOARD: Piano: Suita polska (Polish Suite; 1950); Quasi una sonata (1975). Harpsichord: Sonata (1977–78). Clavichord: Proverbia latina (1974). VOCAL: Ballada o fanosiku (Ballad of Janosik) for Voice and Piano (1941; also for Chorus and Small Orch., 1955); Pieć lat (Five Years) for Chorus (1945); 7 Folk Songs for Chorus (1945); Pieśni kurpiowskie (Songs from Kurpie) for Chorus or 2 Solo Voices and Small Orch. (1947); Chlopska droga (Peasants’s Road), cantata for Soprano, Tenor, Baritone, Chorus, and Orch. (1952; Bydoszcz, May 1, 1953); Przewodnik liryczny po Warszawie (A Lyrical Guide to Warsaw) for Soprano and Piano (Warsaw, Nov. 1953); Deux portraits des femmes for Soprano and String Quartet (1960; Warsaw, May 1961); Dach świata (The Roof of the World) for Reciter and Orch. (1960; Warsaw, May 1961); Gaude Mater Polonia for Reciter, Soprano, Alto, Tenor, Chorus, and Orch. (Warsaw, Oct. 7, 1966); Lipce for Chorus and Orch. (1968); Do obywatela Johna Browna (To the Citizen John Brown), concertino for Soprano, Flute, Horn, Cello, Piano, and Percussion (1972); Gdziekolunek ziemia jest snem (Wherever the Earth is a Dream) for Soprano and Piano (1975); Chleba powszedniego (Our Daily Bread), motet for Man’s Voice, Chorus, and Organ (1987); Trzy pieśni starohebrajskie (Three Old Hebrew Songs) for Voice and Piano (1987); W kregu psalmów (The Circle of Psalms) for Soprano, Tenor, Baritone, Boy’s Chorus, 2 Mixed Choruses, and 6 Percussion Groups (1987; Wroclaw, Sept. 3, 1990); Trzy liturgie etiopskie (Three Ethiopian Liturgies) for 6 Men’s Voices (Warsaw, July 1988); Gadanki-piewanki (Speaking-Singing) for Speaking Chorus (1989); Madonna, 5 songs for Soprano, Flute or Clarinet ad libitum, and Piano (1991); Psalmus VI “Domine, ne in furore tuo arguas me” for 5 Voices or Chorus and Organ (1992); Slowa Panny Maryji (The Words of the Virgin Mary) for Chorus and Small Orch. (1992); Litania Ostrobramska (Litany to the Holy Virgin of Ostra Brama) for Soprano, 2 Trumpets, 4 Timpani, and Organ (1994).\n\nBibliography\n\nL. Bielawski and H. Kowalczyk, eds., W. R. ω 80-lecie urodzin (Studies Presented to W. R. on the Occasion of his 80th Birthday; Warsaw, 1993).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "https://books.google.com/books/about/Conversations_with_Witold_Lutos%C5%82awski.html?id=PzQDAwAAQBAJ", "page_content": "Tadeusz Kaczynski Chester Music , 5 Nov 2012 - Biography & Autobiography - 152 pages 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified Witold Lutosławski (1913-1994), who claimed that 'talking was not his speciality', emerges during a series of conversations with the music critic Tadeusz Kaczynski as a most lucid and articulate commentator, not only on his own compositions, but on every aspect of twentieth-century music and musicianship.\n\n\n\n\n\n\n\nThis revised and expanded edition of Conversations with Witold Lutosławski makes for compelling and thought-provoking reading, offering a fascinating insight into the mind of this great composer. Of the sixteen conversations collected here, ten refer to Lutosławski’s own creative works, with the rest dealing with various issues of contemporary music.\n\n\n\nIllustrated throughout with musical examples, these conversations are a rich source of information on both the music and personality the artist. Preview this book »"}, {"url": "https://www.theguardian.com/music/tomserviceblog/2013/jan/15/contemporary-music-guide-witold-lutoslawski", "page_content": "Now, we're perilously close to the boundaries of our self-imposed criteria for this whole series with the Polish composer Witold Lutosławski, since his centenary is celebrated next week (on the 25th, to be precise), but unlike that other prospective centennial this year, one Britten, B (who won't be in this series for reasons of sufficient exposure here and elsewhere). Lutosławski's output is, I think, neither well-known nor well understood enough. It will be, of course, by the end of this 'ere exposition! Or at least, you will have found, I hope, some ear-opening avenues into the work of a composer whose output is among the most complete and coherent of the 20th century.\n\nSo let's start, obviously, at the end. Listen to this: Lutosławski's Fourth Symphony, his last major work before his death in 1994, and a piece that symbolises and cements the achievement of his musical language. This is astonishingly eloquent music: a piece that creates a genuinely symphonic discourse through a revivification of some classical principles of achieving unity through diversity, but which is also open and adventurous enough to admit the existence of doubt, conflict, and melancholy – listen to the final few minutes to hear what I mean. It's all a long way from this music, the sophisticated Stravinskyisms and Bartokerie of his First Symphony, composed nearly 50 years earlier, just after the second world war.\n\nLutosławski's compositional journey involved him finding unique answers to the big existential and musical questions that the 20th century opened up, and his solution, eventually, was to rethink those hoarily old-fashioned ideas of harmony, melody and how you create large-scale musical structures, and he did so in a way that created new kinds of texture, sound, and feeling. (Don't believe me? Try this for size: the opening of Lutosławski's Third Symphony, premiered by the Chicago Symphony and George Solti in 1983; a visceral contrast between vertical violence and sensual but chaotic melody, a juxtaposition that propels the whole half-hour piece.)\n\nBut this wasn't a serene progress to musical maturity carried out in an artistic vacuum. Far from it. Lutosławski's life was as enmeshed as any 20th century composer's in the terrifying warp and weft of history and politics. One of his first memories was his father being taken away for execution in Moscow in 1918; his brother didn't survive the second world war, and he spent his war away from his military duties playing in a piano duet with his fellow composer Andrzej Panufnik. Every time they played could have been their last, as they risked performing music banned by the Nazis – like Chopin! – but in their improvisations together, Lutosławski also laid the foundations for some of his later music, like the Variations on a Theme by Paganini.\n\nAfter the war, Lutosławski had to play a delicate game of creative cat-and-mouse with the communist regime in Poland. As part of the Composers' Union, he paid lip service to the socialist-realist demands of the government, working for Polish Radio and composing jingles, patriotic mass songs, and radio dramas. Even music like his First Symphony did not escape censure, but by the mid 1950s and Poland's political thaw, and the establishment of the Warsaw autumn festival of contemporary music in 1956, Lutosławski was able to begin to compose the music he wanted to. (His Concerto for Orchestra, completed in 1954, is still his most popular piece with orchestras, but Lutosławski said that that brilliant, vital piece did not represent his unadulterated compositional voice; something he only recognised with the music he composed after his Musique Funèbre, from 1958.) But Lutosławski's search for musical truth isn't quite as simple as it seems: under a pseudonym, he wrote pop tunes that were hits in Poland in the late 1950s and early 1960s, something only discovered a decade later; it's still controversial whether his motives were musical or financial in writing these tunes.\n\nFrom the 1960s, Lutosławski was able to explore the musical terrain that he would make his own. It's a paradoxical combination of compositional freedom with structural rigour that finds a sometimes subtle, sometimes sensual, and occasionally visceral poetry in pieces like Jeux Venitiens, his Livre pour Orchestre, or the Second Symphony. If you listen to what Lutosławski said in interviews and public statements, you'll understand these pieces, just like all those that came after, as purely abstract investigations of the things that music can say that nothing else can: ie that there's no connection between the social, political, or personal dimensions of Lutosławski's life and the music he wrote.\n\nMstislav Rostropovich didn't agree, though. He regarded the Cello Concerto that Lutosławski wrote for him in 1970 as an epic confrontation between an individual and an oppressive mass, in which the cello's voice is symbolically squashed by outbursts in the brass and orchestral explosions, a staging of the essential tensions of living in a communist system. Not so, said Lutosławski. Then there's Lutosławski's distinctive but misunderstood technique of \"controlled aleatoricism\", a magnificently obfuscatory term for something incredibly simple: basically, giving orchestral players material to play without precise rhythmic co-ordination, so you can create textures in which you know what pitches you're going to hear, but not exactly in what combination or at what speed. It's an easy way of conjuring a controlled chaos and a complex but relatively static texture, and you hear it in the Ad Libitum sections of his Chain II for violin and orchestra, or passages in nearly every work he composed since the 1960s, starting with Jeux Venitiens. It's misunderstood because it's not at all a way of giving musicians license to improvise, and it's far too simplistic to equate this delicate musical freedom with any social or political agenda. Nonetheless, it was one of the ways that Lutosławski found to open up his music to a more unpredictable soundworld, while retaining an essential compositional control.\n\nIt's a technique that's also used throughout the Third Symphony, a piece composed during Poland's period of martial law in the early 1980s, and work that creates an irresistible lyricism in some of the most powerfully melodic string writing of the late 20th century, a song that sings with a completely convincing but utterly novel expressivity. And Lutosławski at last admitted that although it wasn't his intention that this piece should reflect Poland's and Solidarity's contemporary struggle for greater freedoms, if people chose to interpret it that way, he wouldn't tell them not to. Sounds a pretty small aesthetic change? It's important, I think. I've been in Poland recording interviews for Radio 3's Music Matters, which is dedicated to Lutosławski on Saturday 19 January, and I met Grzegorz Michalski, president of the Lutosławski Society, who told me something that contradicted everything I've read about Lutosławski's supposed lack of direct political engagement. He was affiliated, albeit in secret, to one of Solidarity's committees, and was the only musician to hold such a position. And he refused to play ball with the government in the early 1980s, withdrawing from his public activities. (Lutosławski had a telling metaphor for all this: he said that working with the regime had been like wearing shoes that were too small, and that once they had come off, once he stopped trying to play games with his public persona and the government, he couldn't put them on again.) It was also around this time that he started giving grants to young composers so that they could study abroad, and paying for essential medical operations; work he often did unacknowledged and without any public fanfare.\n\nThere's always a debate to be had around the relationship between a composer's life and their music, and if the composer says there's no connection, we need to listen to them. But it's more complicated that Lutosławski suggests. You don't have to look for clues in the communist regime to find the foundations of Lutosławski's harmonic language, but the concentration, ravishment, and refinement of his music could not have been written by anyone else at any other time. Lutosławski the man was as immaculate, fastidious, and restrained as his music. And just as his works don't contain any extra notes, Lutosławski was someone who only spoke when he had something to say, according to Marcin Bogusławski, his stepson.\n\nAnd there's something else too. Lutosławski's attitude to life – his unswerving fealty to a daily regimen of work, work, and more work, his sharing of his talents and the material wealth he earned, and his insistence on absolute silence in his home and the study where he worked – has an almost monastic quality. And according to Michalski, Lutosławski was a religious man, even if he didn't write any explicitly religious or liturgical works. Because his wife Danuta (to whom he was devoted, and who died of a broken heart just weeks after his death) had divorced before marrying him, Witold could not take communion in the Polish church. That mattered to him, Michalski said, and to compensate, every year he would stay for a week with his cousin at his monastery to \"clean his soul\". That spiritual dimension, I think, is what's behind the transcendent refinement you hear in his music: it's there throughout the Fourth Symphony, it's present in the radiant, deceptive simplicity of his late song-cycle Chantefleurs et Chantefables, and in the limpid drama of the Piano Concerto, composed for Krystian Zimerman. Lutosławski said that to write music was to go \"fishing for souls\", searching for listeners like him, for whom his music would resonate somewhere deep inside them. It's a strikingly spiritual way of describing his supposedly abstract art – see if he has caught yours …\n\n\n\nThird Symphony\n\n\n\nConcerto for Orchestra\n\nCello Concerto\n\n\n\nChantefleurs et Chantefables\n\n\n\nFourth Symphony"}, {"url": "https://books.google.com/books/about/Witold_Lutos%C5%82awski.html?id=_O3vT1NUWMMC", "page_content": ": A Bio-Bibliography Stanislaw Bedkowski , Stanislaw Hrabia Greenwood Publishing Group , 2001 - 323 pages , 2001 - Biography & Autobiography 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified This volume in the Greenwood Press series, Bio-Bibliographies in Music, provides new details about the life and works of Polish composer Witold Lutoslawski. It includes a detailed catalogue of the composer's works and performances, including his film music, incidental music for the theatre, music for radio plays, and songs he composed under a pseudonym, as well as a bibliography, discography, and brief biographical sketch. His unique style was distinguished by an individual harmonic system controlled aleatory technique that he developed more fully during the 1960s and 1970s. The discography includes over 300 recordings and the bibliography includes writings the composer and a separate section for the writings about him, including concert and recording reviews, books, articles, dissertations, and interviews.\n\n\n\nThis research tool will appeal to Lutoslawski fans and to musicologists. Each section is cross-referenced throughout. An appendix provides an alphabetical list of all of the composer's works. Preview this book »"}], "Tadeusz Szeligowski taught Andrzej Panufnik.": [{"url": "https://www.britannica.com/biography/Andrzej-Panufnik", "page_content": "Sir Andrzej Panufnik, (born Sept. 24, 1914, Warsaw, Pol.—died Oct. 27, 1991, Twickenham, Greater London, Eng.), Polish-born British composer and conductor, who created compositions in a distinctive contemporary Polish style though he worked in a wide variety of genres.\n\nPanufnik’s father was an instrument maker, and his mother a violinist and his first teacher. He began composing at age nine, studied composition at the Warsaw Conservatory (1932–36), and studied conducting with Felix Weingartner at the Vienna Academy (1937–38). He then completed his studies in Paris and London and returned to Warsaw, where, during World War II, he had to lie low, performing occasionally as a pianist in underground concerts. All his early works were destroyed in the Warsaw Uprising (1944), but he was able to reconstruct some of them.\n\nBritannica Quiz Composers & Their Music\n\nPanufnik conducted the Kraków Philharmonic (1945–46) and the Warsaw Philharmonic (1946–47) and from 1947 was guest conductor with a number of European orchestras. His compositions were gaining attention also and won a number of awards; the Polish communist officials, however, began criticizing the style and content of his works, and he defected to Britain in 1954. (He became a naturalized British subject in 1961.) Panufnik was musical director of the City of Birmingham Symphony Orchestra (1957–59) and then devoted himself to his own compositions, which included 10 symphonies, various other orchestral works, concerti, chamber works, and choral and vocal works. In September 1990, after the overthrow of communism, Panufnik returned to Poland for the first time in 36 years and conducted the European premiere of his last symphony.\n\nPanufnik’s autobiography, Composing Myself, was published in 1987, and he was knighted in 1991."}, {"url": "http://panufnik.com/further-reading/", "page_content": "\n\n\n\nAndrzej Panufnik Manuscript Collection. British Library. Catalogue nos.72097-72241.\n\nPanufnik Manuscript collection on microfilm. Warsaw University Library, ‘Gabinet Zbiorów Muzycznych – Archiwum Kompozytorów Polskich XX wieku’.\n\nBooks, booklets and doctoral theses\n\nAndrzej Panufnik. Impulse and Design in my Music. London: Boosey & Hawkes, 1974.\n\nAndrzej Panufnik. Composing Myself. (Autobiography), 1987, Methuen London.\n\nAndrzej Panufnik. Panufnik o Sobie, Polish translation of Panufnik’s autobiography, Composing Myself. 1990 tr. Marta Glińska with Professor Ludwig Erhardt, published by Nowa.\n\nBeata Bolesławska. Panufnik, biography, published by PWM, 2001.Translation for Ashgate Academic Publishers currently in progress.\n\nBeata Bolesławska-Lewandowska. Symphony and Symphonic Thinking in Polish Music after 1956. Doctoral thesis Cardiff University. 2010.\n\nBeata Bolesławska-Lewandowska, Lech Dzierżanowski. Andrzej Panufnik 1914-1991. CD-rom in English and Polish. Â Noyamundi, Poland\n\nTadeusz Kaczyński. Andrzej Panufnik i jego muzyka [A. Panufnik and his Music]. Warszawa: Państwowe Wydawnictwo Naukowe, 1994.\n\nBernard Jacobson. A Polish Renaissance (20th Century Composers): Panufnik, Lutosławski, Penderecki and Górecki. Phaidon Press, 1996.\n\nJadwiga Paja-Stach. Andrzej Panufnik’s Music and Its Reception. Edited Papers for international conference in Krakow November 2001.\n\nEwa Siemdaj. Twórczość symfoniczna [Andrzej Panufnik’s Symphonic Works] 2003; this book was nominated for the Długosz Prize);\n\nEwa Siemdaj. Pomiędzy uczuciem a intelektem: Geneza autoreflekcji muzycznej Andrzeja Panufnika, in Muzyka polska 1945-1995:i. Akademia Muzyczna, 1996.\n\nKrystyna Jaraczewska-Mockałło. Andrzej Panufnik: Katalog dzieł i bibliografia [Catalogue of Works and Bibliography]. Series: Prace Biblioteki Głównej. no. 21. Akademia Muzyczna im. Fryderyka Chopina, 1997.\n\nDr. Krzysztof Stasiak. An Analytical Study of the Music of Andrzej Panufnik, Queen’s University, Belfast, 1990 .\n\nKatarzyna Szymańska-Stułka. Idiom polski w Twórczości Andrzeja Panufnika. Akadamia Muzyczna im. Fryderyka Chopina Warszawa 2006.\n\nObituaries\n\nMeiron Bowen. Music of the Spheres .The Guardian, London, 28.x.91.\n\n\n\nUnsigned. Sir Andrzej Panufnik. The Times, London, 28.x.91.\n\n\n\nUnsigned. Sir Andrzej Panufnik. The Telegraph, London, 28.x.91.\n\n\n\nNorman Lebrecht. Sir Andrzej Panufnik. The Independent London, 28.x.1991.\n\n\n\nNorman Lebrecht. Tribute to Sir Andrzej Panufnik. Panorama Magazine of Panasonic, 1991.\n\n\n\nMark Stephenson. Hommage. Panorama Magazine of Panasonic, 1991\n\nArticles in Tempo Magazine, published by Boosey & Hawkes\n\nBeata Bolesławska. Andrzej Panufnik and the Pressures of Stalinism in Post-war Poland. Tempo: A Quarterly Review of Modern Music no. 220, April 2002\n\nHarold Truscott. The Achievement of Andrzej Panufnik. Tempo: 1987\n\nAndrzej Panufnik. About my Autumn Music and Universal Prayer. Tempo no.96, Spring 1971: 11-15.\n\nCalum MacDonald. Recordings. Tempo no. 99, April 1972: 31-34.\n\nNigel Osborne. Panufnik at 70. Tempo. 1984.\n\nAndrzej Panufnik. Homage to Béla Bartók. Tempo no. 136, March 1981: 3-5.\n\nArticles in Ruch Muzyczny\n\nBohdan Pociej. Opus pośmiertne Andrzeja Panufnika. Ruch Muzyczny no. 3, 1992.\n\nCalum MacDonald. O muzyce Andrzeja Panufnika.Ruch Muzyczny 20, October 1983.\n\nTadeusz Zieliński. Sinfonia di sfere: Andrzeja Panufnika. Ruch Muzyczny 28 no. 20 1984.\n\nBarbara Smoleńska. Concerto festivo Andrzeja Panufnika. Ruch Muzyczny no. 20, 1984.\n\nTadeusz Kaczyński. Sinfonia Votiva – trzy zbliżenia. Ruch Muzyczny 19, September 1983: 3-5.\n\nZygmunt Mycielski. Na krańcach dyscypliny: Universal Prayer Andrzeja Panufnika. Ruch Muzyczny No.21 (1977).\n\nZygmunt Mycielski. I Symfonia Panufnika. Ruch Muzyczny no.6 (1945)\n\nStefan Kisielewski. Życie muzyczne pod okupacją [Musical Life during the Nazi German Occupation]. Ruch Muzyczny No.1, 1945.\n\nZygmunt Mycielski. Panufnik – 5 Pieśni Ludowych [Panufnik – 5 Folk Songs]. Ruch Muzyczny no.13/14 (1946).\n\nFurther articles\n\nBohdan Pociej. Odejście Andrzeja Panufnika. Notatki o muzyce. Tygodnik Powszechny no. 47, 1991.\n\nJillian White. By Invitation: Panufnik’s return to Warsaw after 37 years. The Independent. London. 1990\n\nAndrzej Panufnik. Szymanowski. Talk for the BBC. 1962. To go with performance of Stabat Mater w. BBC Symphony Orch conducted by AP. published British Institute of Recorded Sound.\n\nJohn Rockwell. Panufnik conducts his music. New York Times. 25.vi.88.\n\nAndrew Porter. Musical Events: Arboresque. The New Yorker. 10.12.84.\n\nAndrew Porter. Musical Events: Festival fare. The New Yorker. 8.viii.88.\n\nAndrew Porter. Musical Events. Harmonious. The New Yorker 15.i.90.\n\nJadwiga Paja-Stach. Panufnik’s Autumn Music. Transfiurations of Microstructures & Expression of the work.Studien zur Wertungsforschung no. 40\n\nJadwiga Paja-Stach. Motywy religijne i narodowe w twórczości Andrzeja Panufnika : Donum Natalicum. Studia Thaddaeo Przybylski octogenario dedicata, ed. A. Jarzębska, Z. Fabiańska, A. Sitarz,\n\nJadwiga Paja-Stach. “Hommage a Chopin” of Andrzej Panufnik in the context of his works based on Polish folk music, in: Chopin and His Work, 2003 Mus.Iagellonica.\n\nRobert Maycock. Lines of Approach. Interview. Classical Music, 23 September 1989.\n\nJerzy Peterkiewicz and Andrzej Panufnik. Three Conversations. New Literary History 15 ,1984.\n\nJames Helme Sutcliffe. Panufnik: Poland’s Musical Citizen of the World. International Herald Tribune, September 27, 1989.\n\nFiona Maddocks. Tomorrow, the Polish-born composer Andrzej Panufnik is 75 years old. Interview.. The Independent, 29 September 1989.\n\nAndrzej Panufnik. Pre-Prom Talk for Promenade Concert, Royal Albert Hall, July 27, 1989, typescript.\n\nStephen Walsh. Small is excellent. The Observer. London 19Conrad Wilson. Panufnik Conjures up his Arboreal Magic. The Scotsman, November 13, 1989.\n\nJawiga Paja-Stach. Kompozytorzy polscy 1918-2000, t. II Biogramy: section “Kompozytorzy XX wieku urodzeni przed 1900” [Polish composers born through 1900], in: Encyklopedia Muzyczna PWM, tom 8 i 9 Kraków 2007.Zdzisław Broncell. Jubileusz Andrzeja Panufnika. [The Jubilee of A. P.]. Kultura, Paris, No.12,1984.\n\nAndrzej Panufnik. Po hitlerowskim wstrząsie i ożywczej atmosferze Paryża… Interview. [After the Shock of Hitler and the Revitilizing Atmosphere of Paris]. Wiadomości Codzienne, 22.vii.1939.,\n\nAndrzej Panufnik. Abstrakcja w muzyce współczesnej. Refleksje i uwagi. [Abstraction in Contemporary Music: Reflections and Remarks]. Muzyka Polska 78, 1937: 365-369.\n\nFelicjan Szopski. “Popis Konserwatorium.” [A Display of the Conservatory]. Kurier Warszawski 18.vi.1936.\n\nMaklakiewicz, Jan. Kompozytorskie orlęta z Warszawy. [Compositional Eaglets From Warsaw]. Kurier Poranny, 11 April 1936."}, {"url": "https://www.valueyourmusic.com/items/134006471257-tadeusz-szeligowski-andrzej-panufnik-andrzej-koszewski-piano-trios-poznanskie", "page_content": "The Poznan Piano Trio play three 20th-century Polish works on this 2011 Acte Prealable CD. The 1950 trio of Andrzej Koszewski (1922 - 2015) comes first and is the most old-fashioned, though it has a multiple personality, opening in a warm Brahmsian mode but later bringing in both impressionistic and neoclassical elements. The 1957 trio of Tadeusz Szeligowski (1896-1963) is a brittle work, not quite atonal but very much a reaction to the post-Stalin-era opening of Western musical developments to Eastern Bloc composers. Andrzej Panufnik's 1936 trio is a student work but even here you clearly hear his fondness for staccato melodies and short rhythmic cells, though there's a greater reliance on tonality and even folk-flavorings than in his mature works.\n\nFrom the MusicWeb review:\n\nThis disc is one of a clutch that I have had the good fortune to review recently. They have come from the stable of Acte Préalable, a Polish CD company that describes itself as the “Leading label promoting Polish music and musicians”. If what I have seen so far is anything to go by the claim is valid. As noted above this disc includes two world première recordings which show the label’s commitment to its aims. In fact it was the musicians that found those two compositions and the label’s Artistic Director and Producer Jan Jarnicki was only too pleased to record them. Andrzej Koszewski is pictured in the booklet at the piano surrounded by the three trio members so, since he wrote his trio in 1950, he must be pleased to have it recorded at last. It’s surprising that it hasn’t been recorded before because it is an excellent work. The trio opens with a movement marked Adagietto. Allegro patetico which is quite animated even agitated. The second, Andantino con moto, is a rocking lullaby by comparison. Its central motif is a memorable and beautiful little tune that sits well between the two outer movements. The final Sostenuto. Allegro giusto is a complete contrast which embodies elements of each of the preceding two plus a passing reference to Chopin. The booklet states that this trio is among “... the relatively modest group of instrumental pieces that Koszewski wrote” since he is known principally for his choral music and that it was treated as “practice of the styles of the past eras”. When you hear this you will I’m sure feel as sad as I did that he did not write more. Tadeusz Szeligowski was a lawyer who turned to music only in his thirties and yet was proficient enough to also teach Koszewski among others. Szeligowski was yet another pupil of Nadia Boulanger during which time he took to heart the spirit of the French tradition. This was the same tradition that had as its motto that music should give pleasure to the composer for a job well done and then to the listener who could admire the ability of the composer and the performing musicians. Szeligowski’s piano trio was written in 1955-56 towards the end of his life - later then than his pupil Koszewski’s. It was an attempt to experiment with twelve-tone technique but not in such a wholesale way that the overall impression is not more neo-classical than anything else. It does have a more “modern” sound than his pupil’s but that’s as far as it goes. The work as a whole is generally one full of lyricism and good tunes. The final work on the disc is by one of Poland’s best known and well respected composers, Andrzej Panufnik. Though born in 1914 between the two other composers, he wrote his trio when only 22 and fresh from the Conservatory. It was given its première in 1936 with no less a person at the piano than Mieczyslaw Weinberg. The booklet states that contemporary reviewers considered it so romantic in feel that they associated it with Brahms and it’s not hard to see why. I wonder what those same reviewers had to say about Panufnik’s potential because this work promises much for the young composer’s future, a promise thoroughly fulfilled throughout his life. The trio is extremely beautiful and abounds in brilliance. We are fortunate that despite being burnt along with much else during the Warsaw Uprising of 1944 he managed to reconstruct it afterwards. It was not published until 1977. The booklet poses an interesting couple of questions: if the listener played the disc in the order the works were written would they find the work written last more difficult to understand than the earlier ones. Would the fact that two were written by “students” and one by a teacher be obvious? Well my response is no to both. To me the disc is of three highly successful and enjoyable piano trios that show that the great Polish musical tradition that reached its zenith with Chopin was still alive and well in the twentieth century as evidenced further by the likes of Lutoslawski, Penderecki, Weinberg, Szymanowski, Tansman, Gorecki, Baird and many more and that it continues today. These works have been very well recorded and are beautifully played by this young trio who have launched their recording career with this disc. I wish them every success. I look forward to more discoveries from Acte Préalable. --Steve Arloff\n\nDisc, booklet, and case are in near-mint condition.\n\nShipping rates:\n\nUS customers: Options are Media Mail at $3 for the first CD, $1 for each additional disc mailed at the same time; or First Class Mail at $3.50 for the first CD, $1.25 for each additional disc mailed at the same time.\n\nThe USPS no longer offers cheap international shipping of thin envelopes with merchandise, BUT if you order many discs together the new rate is about the same as it was before. Therefore...\n\n\n\nCanadian customers: Options are Economy shipping, which is First Class but *without* the plastic \"jewel\" cases, at $11 for ONE TO SEVEN CDs, $17 for EIGHT OR MORE CDs; or First Class *with* the plastic cases included, at $11 for the first CD and $2 for each additional disc mailed at the same time.\n\nCustomers in other countries: Options are Economy shipping, which is First Class but *without* the plastic \"jewel\" cases, at $15 for ONE TO SEVEN CDs, $25 for EIGHT OR MORE CDs; or First Class *with* the plastic cases included, at $15 for the first CD and $4 for each additional disc mailed at the same time.\n\nYou may wait as long as you wish before paying, to combine auction wins and save on shipping -- especially important for International customers. Please check out my\n\nI sell high-quality, little-known works, mostly 19th- and 20th-century. Many of the CDs are used, some are still-sealed, and most are the only one of that disc I have to offer. I sell a low volume of CDs, but that way I can listen to each (except the sealed ones :-) and describe the music to give you a better idea of what you're in for before you plunge into the unknown!-Jim Moskowitz"}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/szeligowski-tadeusz", "page_content": "Szeligowski, Tadeusz\n\nSzeligowski, Tadeusz, notable Polish composer and pedagogue; b. Lemberg, Sept. 12, 1896; d. Poznan, Jan. 10, 1963. He studied piano with Kurz in Lemberg (1910-14) and composition with Wallek-Walewski in Krakow, where he also took a doctorate in law at the Univ.; after further studies with Boulenger in Paris (1929-31), he taught in Poznan (1932-39; 1947-62) and in Warsaw (1951-62). From 1951 to 1954 he served as president of the Polish Composers’ Union.\n\nWorks\n\ndramatic: Opera: Bunt Zaków (Rebellion of Clerks; Wroclaw, July 14, 1951); Krakatuk, after E.T.A. Hoffmann (1955; Gdansk, Dec. 30, 1956); Theodor gentleman (1960; Wroclaw, 1963). Ballet: Paw i dziewczyna (The Peacock and the Maiden; 1948; Wroclaw, Aug. 2, 1949); Mazeppa (1957; Warsaw, 1959). ORCH.: Kaziuki, suite (1928); Concerto for Orchestra (1932); Clarinet Concerto (1932); Epitaph for Kami Szymanowski for Strings (1937); Piano Concerto (1941; Krakow, May 17, 1946); Suita lubelska for Small Orch. (1945); Nocturne (1947); Burlesque Overture (1952). CHAMBER: 2 string quartets (1929, 1934); Nocturne for Cello and Piano (1945); Orientale for Cello and Piano (1945); Wind Quintet (1950); Flute Sonata (1953); Air grave et air gai for English Horn and Piano (1954); Piano Trio (1956). Piano: Sonatina (1940); Sonata (1949). VOCAL: Triptych for Soprano and Orch. (1946); Kantata o sporcie for Voice, Chorus, and Orch. (1947); Wesele lubelskie (Lublin Wedding), suite for Soprano, Chorus, and Small Orch. (1948); Rapsod for Soprano and Orch. (1949); Paniez i dziewczyna (The Young Squire and the Country Girl), musical dialogue for Soprano, Baritone, Chorus, and Orch. (1949); Karta sere (The Charter of Hearts), cantata (1952); Renegade, ballad for Bass and Orch. (1953); songs.\n\nBibliography\n\nT. S.: W 10 rocznice smierci (T. S.: On the 10thAnniversary of His Death; Gdansk, 1973).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "https://www.europeana.eu/en/blog/polish-composer-andrzej-panufnik", "page_content": "Marriage and family\n\nHis high position and handsomeness drew the attention of a young and beautiful Irish woman, Marie Elizabeth O’Hanney, nicknamed Scarlett after the heroine of Gone with the Wind. She came to Poland after World War II as an army officer's widow and seduced many men, before eventually becoming Andrzej's wife and encouraging him to lead a rich social life.\n\nAt the same time, the communist authorities needed Panufnik to establish their new order and legitimise it abroad. He became the vice-chairman of the Polish Composers Union and took part in countless conferences and foreign missions, for example to China in 1953.\n\nDuring this last journey, he received the message that his daughter Oonagh drowned in a bathtub, apparently because of Scarlett having an epileptic attack. Furthermore, the attitude of the ministry's deputies towards the composer was ambiguous. Many of his praised works were banned from concert halls (for example Sinfonia Rustica), which was a sign of the times. All that – together with limited time for composing and restrictions on artistic freedom – drove Panufnik to desperate measures in 1954.\n\nIt is not easy for a man to cut himself from his country and his people. It is perhaps even more difficult for one who, like myself, has made a certain name there and received recognition as a creative artist. But freedom counts for much, and indeed is so important, particularly for the artist, that life without it becomes almost unbearable. This is the case in Poland today. (…) The worker is asked only to use his lathe and peasant his plough; but the artist must subordinate his imagination and individuality to the demands of the Communist Party and create – if he wants to live at all – in a manner that serves the ends of the Communist State.\n\nAndrzej Panufnik, A Composer's View of Life in Modern Poland. I – Hatred of Russian Control, in The Times, 12 August 1954.\n\nAt first, Scarlett was reluctant to give up the privileges (including an apartment and a car) granted to them in Poland, but ultimately played a crucial role in the escape plan. Officially, she left to visit her family living in the UK, but the main purpose of her journey was to make arrangements with the Foreign Office and contact composer Konstanty Regamey in Switzerland.\n\nEscape and exile\n\nHe arranged an official invitation from the Swiss Radio Orchestra for Panufnik to conduct and record his own pieces – a letter which Polish authorities couldn't ignore. The composer had to leave almost all of his belongings behind (including his father's instrument collection) in order to avoid arousing suspicion. Also, he couldn't share his motives with the people closest to him (including his beloved niece, the daughter of his late brother).\n\nWhen Panufnik came to Switzerland, he was under the surveillance of Polish embassy workers. On the second day, he managed to shake them off by leaving a restaurant through the back door and rushing to the hotel in a taxi. Regamey succeeded in delivering a plane ticket to London and drove the composer to the airport. At last, Andrzej Panufnik joined Scarlett on 14 July 1954.\n\nAlthough he became quite recognisable after several interviews and newspaper articles describing cultural life behind the Iron Curtain, it soon became clear that he had to start over once again. Year after year, he slowly – but consequently – established his position in British musical life, mostly thanks to his conducting skills and new acquaintances."}, {"url": "http://panufnik.com/", "page_content": "“In all my works, I attempt to achieve a true balance between feeling and intellect, heart and brain, impulse and design.”\n\nAndrzej Panufnik is one of the most important and original symphonic composers of the 2nd half of the 20th century. His output includes ten symphonies, with Centenary commissions from Sir Georg Solti for the Chicago Symphony Orchestra and Seiji Ozawa for Boston. The London Symphony Orchestra commissioned three works from him, and recorded many more of his works under the direction of Jascha Horenstein and then of the composer himself. Leopold Stokowski premièred several of his works in the USA and England. Gennady Rozhdestvensky recorded his Hommage à Chopin in Leningrad. The young Evelyn Glennie first came to prominence winning the Shell-LSO Scholarship with his Concertino for Timpani, Percussion & Strings; this work later received its US première conducted by André Previn. Yehudi Menuhin commissioned his Violin Concerto for the Windsor Festival and recorded it with Panufnik conducting. Mstislav Rostropovich premièred and recorded his Cello Concerto with the LSO, and the Royal Philharmonic Society commissioned his Ninth Symphony, which was premiered by the BBC Symphony Orchestra conducted by the composer. In addition to four concertos, he composed three string quartets, three cantatas and many works for chamber and string ensembles. His works are probably as much recorded as any classical composer’s of that period. Choreographers of his music have included Martha Graham, Kenneth MacMillan, Krzysztof Pastor, Robert Cohan, David Bintley, Gerald Arpino, Emil Wesołowski and Paul Mejia.\n\nBorn in Warsaw on 24th September 1914, Panufnik started to compose at the age of nine. He graduated from the Warsaw Conservatoire with Distinction in both composition and conducting, developing his classical conducting skills as a favourite pupil of Felix Weingartner at the Vienna Academy, and then studying French Impressionist composers with Philippe Gaubert in Paris, with further music explorations in London. Just before the outbreak of World War II Panufnik returned to Warsaw to look after his parents.\n\nIn Nazi-occupied Poland, with public concerts banned, he arranged a massive amount of classical music for two pianos which he played as a duo in “artistic cafés” with his friend and contemporary Witold Lutosławski; also performing with his Jewish violinist friend Tadeusz (known post-war as Thadé Geisler). Despite the Nazi terror in Warsaw, at great personal risk he conducted illegal concerts and composed patriotic resistance songs, including the still-famous Warszawskie Dzieci. During the war he lost most of his closest relatives, as well as every note of music he had composed in his first 30 years, including two symphonies, destroyed by fire during the 1944 Warsaw Uprising.\n\nIn 1945 the 31-year-old Panufnik, eager to help the revival of classical music post-war, was appointed chief conductor of the Kraków Philharmonic Orchestra, having to seek out instrumentalists, old and young, scattered all over Poland. Then, in 1946 he was similarly asked to restore the Warsaw Philharmonic to life.\n\nIn those early post-war years, he began to reconstruct his lost symphonies and other works, but soon decided he must bury the past and start afresh. He kept only three restorations, his Five Polish Peasant Songs, the Piano Trio (his Opus 1) and Tragic Overture (dedicated to his courageous brother Mirek, a radio operator in the Polish Underground). He won international admiration and honours in his own country, the originality of those mid-1940s works establishing him as the “father” of the Polish avant-garde.\n\nAfter 1948, with the imposition of Soviet Socialist Realism, Panufnik’s situation changed dramatically. As Poland’s leading composer, greatly respected throughout Europe, he was under much more intense pressure than his compatriots, bullied to write according to the Soviet imposition of Socialist Realism, artificially “positive” music composed according to the dictates of the authorities. Everything he composed of value was condemned as “western, bourgeois, decadent”. In 1949, the centenary of Chopin’s death, he was elected Vice-President of the Music Council of UNESCO, though the Polish authorities never allowed him to attend any connected ceremonies or concerts. He worked tirelessly to try to obtain better financial and other help for his fellow composers and cared deeply about the future of Polish music; however, creatively stultified by criticism, restrictions and intolerable political pressures, he ceased to be able to compose, the driving force of his life thus extinguished. In 1954 he made a dramatic escape from Poland as a protest against Communist control over creative artists, and this resulted in a raft of vicious propaganda and lies put out about him followed by total censorship of his name and his music in Poland for 23 years.\n\nPanufnik was a shy man, disliking public life, and his greatest desire was to live quietly and compose in peace. He settled in England, Boosey & Hawkes became his publishers, and from 1957 to 1959 he served as Chief Conductor of the City of Birmingham Symphony Orchestra, his last official position before deciding to dedicate his life entirely to composition. He took British nationality in 1961.\n\nLife in England was not easy for him. He was independent from the current fashion in composition which dominated the BBC, Paris and New York in the ’60s and ’70s, and stuck to his own aesthetic of constantly seeking new forms and “the perfect balance between intellect and emotion, heart and mind” in his works. Avoiding publicity (disastrous financially) he managed to disappear almost entirely from the musical scene; at last, however, unfettered by politics or conducting, the subsequent years became the most freely creative of his life. In 1963 Panufnik won the coveted Monaco composition prize for his still most widely loved and admired work, Sinfonia Sacra. In the same year he married the author and photographer Camilla Jessel; they settled in her grandmother’s old house by the Thames in Twickenham with a peaceful studio at the end of their garden where he could compose uninterrupted. His two children, Roxanna, also a classical composer and Jem, graphic artist, DJ and composer of electronica, both grew up influenced by his joy in his creative work. By the 1970s Panufnik, though still shy of publicity and deep in his work, was very much part of British musical life and his music was performed by most of Britain’s leading orchestras, with performances at the BBC Proms and at many LSO concerts.\n\nEventually, from 1977, Panufnik works were gradually performed in the ever-innovatory Warsaw Autumn Festival thanks to the insistence of his fellow Polish composers. Having left as a protest, he refused to return to Poland while the Communists were still in power. In 1990, when democracy was restored, he made a momentous return to the city of his birth for the performance of eleven of his works at the Festival. He was greeted on the airport tarmac by a crowd carrying red roses and brass players performing his Fanfare.\n\nPanufnik’s autobiography, Composing Myself, was published in 1987. He received a knighthood for services to British Music in January 1991, the year of his death, and a posthumous Order of Polonia Restituta from President Lech Wałęsa in Poland.\n\nReferences to further reading can be found in the Extras sub-menu or by clicking here.\n\n"}, {"url": "https://sonichits.com/artist/Tadeusz_Szeligowski", "page_content": "Tadeusz Szeligowski (13 September 1896 - 10 January 1963) was a Polish composer, educator, lawyer and music organizer. His works include the operas The Rise of the Scholars, Krakatuk and Theodor Gentlemen, the ballets The Peacock and the Girl and Mazepa ballets, two violin concertos, chamber and choral works.\n\n\n\nAs a music teacher he was very well established in Vilnius, Lublin, Poznań and Warsaw. He was also a respected music writer who frequently wrote for journals and magazines specialized in music such as the Kurier Wileński\n\nTadeusz Szeligowski (13 September 1896 - 10 January 1963) was a Polish composer, educator, lawyer and music organizer. His works include the operas The Rise of the Scholars, Krakatuk and Theodor Gentlemen, the ballets The Peacock and the Girl and Mazepa ballets, two violin concertos, chamber and choral works.\n\n\n\nAs a music teacher he was very well established in Vilnius, Lublin, Poznań and Warsaw. He was also a respected music writer who frequently wrote for journals and magazines specialized in music such as the Kurier Wileński, Tygodnik Wileński, Muzyka and the Kurier Poznański. His achievements include the creation of the Poznan´ Philharmonic, where he served as its first director between the years 1947-1949, and the founding of the Poznań Musical Spring, one of the most important festivals of contemporary music at the time."}, {"url": "https://www.prestomusic.com/classical/products/8815994--100-for-100-musical-decades-of-freedom-recordings", "page_content": "About\n\n100 for 100 Musical Decades of Freedom Recordings is a unique 36 CD box curated with care and presented here for the first time outside of Poland.\n\nPresented as a luxury box set, the collection contains not only 36 CDs of Polish music, but is accompanied by detailed programme notes in the form of score-sized booklets in a premium drawer section contained within the main box. Endorsed by the National Patronage of the President of the Republic of Poland Andrzej Duda to mark the Centenary of Regaining Independence, the project was financed by the Ministry of Culture and National Heritage of the Republic of Poland as part of the Multi-Annual Programme “Niepodlegla” 2017-2022.\n\nThe recordings are performed by a ‘who’s who’ of Polish musicians, including the Warsaw Philharmonic Choir and Orchestra and the Polish National Opera amongst a plethora of others. Each CD represents a decade of music relevant to the era so the resulting 36 CD box is a wonderful exploration of Polish music. Composers include Szymanowski, Sikorski, Rogowski, Tansman, Morawski, Wiechowicz, Kondracki and Laks, the music represented is within all styles - ballet, opera, orchestral and chamber works. The last disc ends with, as you’d expect, Krzysztof Penderecki ‘Fanfare for the Independent Poland’."}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/szeligowski-tadeusz", "page_content": "Szeligowski, Tadeusz\n\nSzeligowski, Tadeusz, notable Polish composer and pedagogue; b. Lemberg, Sept. 12, 1896; d. Poznan, Jan. 10, 1963. He studied piano with Kurz in Lemberg (1910-14) and composition with Wallek-Walewski in Krakow, where he also took a doctorate in law at the Univ.; after further studies with Boulenger in Paris (1929-31), he taught in Poznan (1932-39; 1947-62) and in Warsaw (1951-62). From 1951 to 1954 he served as president of the Polish Composers’ Union.\n\nWorks\n\ndramatic: Opera: Bunt Zaków (Rebellion of Clerks; Wroclaw, July 14, 1951); Krakatuk, after E.T.A. Hoffmann (1955; Gdansk, Dec. 30, 1956); Theodor gentleman (1960; Wroclaw, 1963). Ballet: Paw i dziewczyna (The Peacock and the Maiden; 1948; Wroclaw, Aug. 2, 1949); Mazeppa (1957; Warsaw, 1959). ORCH.: Kaziuki, suite (1928); Concerto for Orchestra (1932); Clarinet Concerto (1932); Epitaph for Kami Szymanowski for Strings (1937); Piano Concerto (1941; Krakow, May 17, 1946); Suita lubelska for Small Orch. (1945); Nocturne (1947); Burlesque Overture (1952). CHAMBER: 2 string quartets (1929, 1934); Nocturne for Cello and Piano (1945); Orientale for Cello and Piano (1945); Wind Quintet (1950); Flute Sonata (1953); Air grave et air gai for English Horn and Piano (1954); Piano Trio (1956). Piano: Sonatina (1940); Sonata (1949). VOCAL: Triptych for Soprano and Orch. (1946); Kantata o sporcie for Voice, Chorus, and Orch. (1947); Wesele lubelskie (Lublin Wedding), suite for Soprano, Chorus, and Small Orch. (1948); Rapsod for Soprano and Orch. (1949); Paniez i dziewczyna (The Young Squire and the Country Girl), musical dialogue for Soprano, Baritone, Chorus, and Orch. (1949); Karta sere (The Charter of Hearts), cantata (1952); Renegade, ballad for Bass and Orch. (1953); songs.\n\nBibliography\n\nT. S.: W 10 rocznice smierci (T. S.: On the 10thAnniversary of His Death; Gdansk, 1973).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "https://britishmusiccollection.org.uk/composer/andrzej-panufnik", "page_content": "Andrzej Panufnik was born in 1914 in Warsaw and grew up in a musical family, beginning to compose at the age of nine. He gained his diploma at the Warsaw State Conservatoire and travelled to Vienna to study conducting with Felix Weingartner, and to Paris and London for further composition studies. At the outbreak of war he returned to Warsaw where he remained throughout the Nazi occupation. Under a pseudonym he wrote patriotic songs, also playing the piano in underground and charity concerts (often piano duets with Witold Lutoslawski). All his compositions were destroyed in the 1944 Warsaw Uprising, though he reconstructed three scores in the following years.\n\nAfter the war, Panufnik held conducting positions with the Krakow Philharmonic and the Warsaw Philharmonic, also appearing as a guest conductor with many of the leading European orchestras such as the Berlin Philharmonic, the Orchestre National, Paris, and the London Philharmonic. In 1950 he was elected vice-chairman, with Arthur Honegger, of the International Music Council of UNESCO; and as head of a Polish cultural delegation to China in 1953, he was personally received by Chairman Mao.\n\nIn 1954 Panufnik left Poland as a protest against political control over creative artists, resulting in the total supression of his name and music. He settled in England and subsequently gained British nationality. From 1957-59 he was musical director of the City of Birmingham Symphony Orchestra, his last official position before deciding to concentrate on composing. In 1977, after a 23-year long silence, Panufnik's music was once again heard in Poland, and in 1990 the composer made a momentous return to his native country to conduct a programme of his works to open the Warsaw Autumn Festival. Panufnik's autobiography, Composing Myself, was published in 1987 by Methuen (UK). The composer received a British knighthood in January 1991, and following his death nine months later was awarded a Polish knighthood by President Lech Walesa.\n\nPanufnik's oeuvre is dominated by a series of large-scale orchestral works, including commissioned scores for the Boston, Chicago and London Symphony Orchestras. As well as the ten symphonies, his output includes concertos for piano, violin, bassoon and cello, three string quartets, vocal and choral music, works for young people, and transcriptions of old Polish music. Panufnik's compositions have been performed by many leading musical interpreters, including Stokowski, Horenstein, Solti, Ozawa, Previn, Menuhin and Rostropovich.\n\nAndrzej Panufnik is published exclusively by Boosey & Hawkes.\n\nReprinted by kind permission of Boosey & Hawkes"}], "Tadeusz Szeligowski taught Roman Palester.": [{"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/szeligowski-tadeusz", "page_content": "Szeligowski, Tadeusz\n\nSzeligowski, Tadeusz, notable Polish composer and pedagogue; b. Lemberg, Sept. 12, 1896; d. Poznan, Jan. 10, 1963. He studied piano with Kurz in Lemberg (1910-14) and composition with Wallek-Walewski in Krakow, where he also took a doctorate in law at the Univ.; after further studies with Boulenger in Paris (1929-31), he taught in Poznan (1932-39; 1947-62) and in Warsaw (1951-62). From 1951 to 1954 he served as president of the Polish Composers’ Union.\n\nWorks\n\ndramatic: Opera: Bunt Zaków (Rebellion of Clerks; Wroclaw, July 14, 1951); Krakatuk, after E.T.A. Hoffmann (1955; Gdansk, Dec. 30, 1956); Theodor gentleman (1960; Wroclaw, 1963). Ballet: Paw i dziewczyna (The Peacock and the Maiden; 1948; Wroclaw, Aug. 2, 1949); Mazeppa (1957; Warsaw, 1959). ORCH.: Kaziuki, suite (1928); Concerto for Orchestra (1932); Clarinet Concerto (1932); Epitaph for Kami Szymanowski for Strings (1937); Piano Concerto (1941; Krakow, May 17, 1946); Suita lubelska for Small Orch. (1945); Nocturne (1947); Burlesque Overture (1952). CHAMBER: 2 string quartets (1929, 1934); Nocturne for Cello and Piano (1945); Orientale for Cello and Piano (1945); Wind Quintet (1950); Flute Sonata (1953); Air grave et air gai for English Horn and Piano (1954); Piano Trio (1956). Piano: Sonatina (1940); Sonata (1949). VOCAL: Triptych for Soprano and Orch. (1946); Kantata o sporcie for Voice, Chorus, and Orch. (1947); Wesele lubelskie (Lublin Wedding), suite for Soprano, Chorus, and Small Orch. (1948); Rapsod for Soprano and Orch. (1949); Paniez i dziewczyna (The Young Squire and the Country Girl), musical dialogue for Soprano, Baritone, Chorus, and Orch. (1949); Karta sere (The Charter of Hearts), cantata (1952); Renegade, ballad for Bass and Orch. (1953); songs.\n\nBibliography\n\nT. S.: W 10 rocznice smierci (T. S.: On the 10thAnniversary of His Death; Gdansk, 1973).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "http://musicweb-international.com/classrev/2022/Sep/Moniuszko-competition-1857.htm", "page_content": "\n\nSupport us financially by purchasing from Second Stanisław Moniuszko International Competition of Polish Music\n\nrec. 2021, Concert Hall of the Artur Malawski Podkarpacka Philharmonic in Rzeszów, Poland\n\nDUX 1857-1858 [76 + 79]\n\nThe booklet notes open with the line Polish music is not only Chopin. In these days of easily accessible recordings and musicians delving deeper into unknown territory many composers have been uncovered – I cannot believe the music I have in my collection that I never dreamed would be recorded – but in the concert hall it is harder to hear Polish composers beyond Chopin and, to a lesser extent Szymanowski. In an attempt to right this imbalance the Stanisław Moniuszko International Competition of Polish Music was set up in 2019 attracting competitors from beyond Poland – the piano winners in this years festival were from Canada and the Ukraine – but the music played was strictly home-grown; only Polish composers allowed. The pandemic put the second competition on hold but it eventually took place between 11th and 18th September 2021. Prizes are awarded in two categories, piano solo and chamber ensemble and this double CD features performances from the top three winners in each category. The second CD contains performances by musicians who received honourable mentions or special prizes.\n\n\n\nCanadian pianist Carter Johnson won first prize. Like second prize winner Ivan Shemchuk he opens with one of the Moniuszko's three Chopinesque valses, the charming A major Valse. Next is the elegant Mazurka in F minor by Chopin pupil Karl Mikuli, previously unrecorded which, like the other works of his that I have heard, is stylish and melodious. The high wire act that is Leschetizky's etude La Piccola, sparklingly played is followed by the brief, colourful miniatures by Arthur Malawski, somewhat reminiscent of the miniatures of Prokofiev; the lullaby is particularly evocative. To close Johnson plays the final movement of Bacewicz's second Sonata, the toccata, in which he easily captures the skittish, volatile character. Ivan Shemchuk's Moniuszko Valse is in E minor and is also very Chopin-like in its sinuous melancholy. Zygmunt Stojowski's fiery Orientale is next, a work played so memorably by Josef Hofmann; Shemchuk's reading is full of character and atmosphere especially in the middle section. He rounds off with Szymanowski's über-romantic Etude in E flat minor. In third place was another Szymanowski, this time Michał Karol Szymanowski who is represented by his performance of the Polish Triptych by composer-pianist Miłosz Magin, written in 1967 though its colourful, folkloric and dance elements coupled with the tonal harmony could be from an earlier generation. The first is a vigorous triple time dance while the gorgeous second opens like a mazurka played by a music-box. A finger-twisting toccata-like piece ends this entertaining set. Staying with pianists and indeed Magin I was bowled over by the Chorale and fugue from his Toccata, Chorale and Fugue played by Adam Mikołaj Gożdziewski (honourable mention). The chorale has a slowly unfolding chromatic theme and is a descendant of the chorale from Franck's Prelude, chorale and fugue while the fugue is highly virtuosic with a subject based on a very short motif. Neither the back-sleeve or the inner notes mention the fact that the Toccata is missing here though Gożdziewski did play it in the competition. Second prize winner Shemchuk also won the special prize for the best performance of a composition by Henryk Pachulski – now there's a sentence I never thought I would write. He plays the first Sonata whose three movements run to just over 14 minutes; it is passionately romantic in mood with a first movement dominated by the semiquaver figure heard in the first bar. The second movement is based around an eight-bar theme that repeats several times with increasing fervour interspersed with lighter triplet motifs. The finale is for me the most satisfying, a mix of high flying virtuosity, heavy on the octaves and heady lyricism. More Pachulski can be heard in four of his eight Fantastic tales (legends), the first three and the agile final number. These tales are quite short and are more like a set of romantic preludes than anything with a real narrative element to them though they are undeniably attractive. They are played Ruslan Kazakov (honourable mention) and the same award was given to Krzysztof Kozłowski who plays an excerpt from Godowsky's Java Suite, the atmospheric In the Kraton whose gamelan effects disguise the piece's intricate difficulties handled seamlessly by Kozłowski. The music critic prize went to Martyna Kubik who plays a sad little prelude by Roman Statkowski with echoes of Liadov and Rachmaninov. The prize for the best performance of a composition by Władysław Żeleński was taken by Jakub Cetnarowski who gives a blistering account of the Thème varié, a beautiful set with ten gloriously varied and idiomatic variations ranging from a mazurka, a fugue, a scherzando sicilienne and several showy variations that keep the pianist very busy. This is something of a winner it must be said.\n\n\n\nTurning to the ensemble prizes and we don't leave the piano just yet; first prize went to the Książek piano duo who I reviewed favourably in Rachmaninov and Arensky not too long ago (Dux 1720 review). Their selection opens with the suave Reverie from Zarębski's Deux morceaux en forme de Mazurka, a piece that goes beyond simple dance It opens with an urbane waltz that sounds somewhat French and has a faster middle section that reinforces that impression with hints of Chabrier's infectiousness. I am very impressed by the three Negro Spirituals arranged by Roman Maciejewski, a pupil of Nadia Boulanger and Kazimierz Sikorski, names that crop up again in this line up of composers. From age 24 he lived outside of Poland, moving between the UK, the US and Sweden where he died in 1998. Apart from his many original compositions he made arrangements for two pianos of works ranging from Bach and Clérambault to Ravel and Kreisler as well as several of Ignacy Jan Paderewski's piano solos. These sparkling transcriptions of the spirituals Listen to the lamb, I want to be ready and a sympathetic version of Sometimes I feel like a motherless child are given thrilling performances as is the familiar set of Paganini Variations by Witold Lutosławski. Second ensemble prize went to the wind ensemble Kwintofonia who played wind quintets by Tadeusz Szeligowski and Antoni Szałowski, both of whom studied with Nadia Boulanger which goes some way to explaining the very Gallic sound world we hear. The vivacious opening movement of Szeligowski's quintet has elements of a tarantella and is bright and colourful in its use of the instruments while there is considerable beauty in the second movement's melodic contours. It is a delightful and very approachable work especially for a piece written as late as 1953. The third movement of the quintet by Szałowski is again very tonal and French sounding, playful and effervescent in its clever use of rhythm, articulation and timbre. Before Boulanger he studied with Kazimierz Sikorski who also taught Roman Palester whose ballet The Song of Earth provides the polish dance for violin and piano that was part of the programme that gave Aleksandra Kuls and Marcin Koziak third prize. Vigorous and folk like it opens with a recitative for solo violin before the dance proper. With some of the vibrancy and energy of Bartok's Roumanian Dances its outer sections frame a slower brooding passage where the violin takes to the higher register with some vaguely blues like touches. The Dance Preludes for clarinet and piano by Witold Lutosławski comprise two slow and three faster pieces; the faster numbers are mainly concerned with rhythm, especially in the complex fifth prelude. The third is distinctive for the spiky clarinet grace notes in the third and the sparse melody of the fourth is accompanied by an equally barren piano part, staccato bass and the odd flourish of notes. We have heard quite approachable piano works by Miłosz Magin but his String Quartet in two movements is a different matter, played here by the winners of the Margot Magin special prize for the performance of a chamber composition by Miłosz Magin, Kwartet Smyczkowy Op.1 who discovered the manuscript and gave the premiere in this competition. Its mood and temperament are caustic and the textures are polyphonic; it makes for uneasy listening in its almost unerringly jagged rhythm and harmony. The second movement moderato seems to speak of pain and grief, restless and tormented. Tadeusz Baird's Caprices for clarinet and piano were the choice of the Dobrowolski Słapiński Duo (honourable mention); similar in style to the Lutosławski Dance Preludes with the emphasis on rhythm and energy both are full of ebullience and virtuosity with a great sense of conversation between the performers. The final honourable mention goes to Trio Legend who play the finale of Andrzej Panufnik's Piano Trio which he wrote as a student and reconstructed in 1946 after it was lost during the war. It's mix dance and contrapuntal elements have a great deal of humour peeping from behind its sometimes gruff exterior.\n\n\n\nExtensive notes in Polish and English are given in the booklet. I would mention that the print is quite small on a rich blue paper and while the Polish text is in white font the black font chosen for the English makes it a little difficult to read – maybe just my old eyes but I definitely had to get it in the right light to read. The performers are all strong and committed and there is no sense that the restriction in the choice of composers has been a hindrance; indeed the performers all seem to rise to the challenge and are evidently enjoying the rich choice of music that is available within that remit. It is wonderful to find a festival that is doing so much for the music of its homeland both familiar and unfamiliar. Hopefully the performers will take this music with them and spread it far and wide and continue to explore beyond the familiar. There is some high quality music at this competition much of which could hold its own on the world's stages and Dux have given us an excellent taste of this extraordinary festival, one that will hopefully grow in strength and recognition. Would that every country had such an event.\n\n\n\nRob Challinor\n\n\n\nContents\n\nAll piano solo unless marked\n\nStanisław Moniuszko (1819-1872)\n\nWaltz in A major\n\nWaltz in E flat minor\n\nKarol Mikuli (1819-1897)\n\nMazurka in F minor op.4\n\nTheodore Leschetizky (1830-1915)\n\nLa Piccola – etude from deux morceaux Op.43 No.2\n\nArtur Malawski (1904-1957)\n\nFive Miniatures\n\nGrażyna Bacewicz (1909-1969)\n\nPiano Sonata No.2 – Toccata\n\nJuliusz Zarębski (1854-1885)\n\nRéverie from Deux morceaux en forme de Mazurka Op.5 No.1 for piano duet\n\nRoman Maciejewski (1910-1998)\n\nThree Negro Spirituals for 2 pianos\n\nWitold Lutosławski (1913-1994)\n\nVariations on a theme by Paganini for 2 pianos\n\nDance Preludes for clarinet and piano\n\nZygmunt Stojowski (1870-1946)\n\nOrientales from Deux morceaux Op.10 No.2\n\nKarol Szymanowski (1882-1937)\n\nEtude Op.4 No.1\n\nTadeusz Szeligowski (1896-1963)\n\nQuintet for wind instruments, Movements 1 and 2\n\nAntoni Szałowski (1907-1973)\n\nQuintet for flute, oboe, clarinet, bassoon and horn, 3rd movement\n\nMiłosz Magin (1929-1999)\n\nPolish Triptych\n\nChorale and fugue from Toccata, chorale and fugue\n\nString quartet\n\nRoman Palester (1907-1989)\n\nPolish dance from The Song of Earth for violin and piano\n\nHenryk Pachulski (1859-1921)\n\nPiano Sonata in C minor Op.10\n\nPhantastische Märchen Op.12 excerpts\n\nLeopold Godowsky (1870-1938)\n\nIn the Kraton, No.10 from Java Suite\n\nRoman Statkowski (1859-1925)\n\nPrelude in B minor Op.37 No.6\n\nWładysław Żeleński (1837-1921)\n\nThème Varié Op.62\n\nTadeusz Baird (1928-1981)\n\nTwo Caprices for clarinet and piano\n\nAndrzej Panufnik (1914-1991)\n\nPiano Trio Op.1, 3rd movement\n\n\n\nPerformers\n\nCarter Johnson (piano) Ivan Shemchuk (piano) Michał Karol Szymanowski (piano) Krzysztof Kozłowski (piano) Adam Mikołaj Gożdziewski (piano) Ruslan Kazakov (piano) Martyna Kubik (piano) Jakub Cetnarowski (piano)\n\nKsiążek piano duo (pianos) Kwintofonia (wind quintet) Aleksandra Kuls and Marcin Koziak (violin and piano) Piotr Dinh Tieu-Quang and Paweł Popko (clarinet and piano) Kwartet Smyczkowy Op.1 (string quartet) Bartłomiej Dobrowolski and Maciej Słapiński (clarinet and piano) Trio legend (piano trio)\n\n"}, {"url": "https://pwm.com.pl/en/kompozytorzy_i_autorzy/5227/tadeusz-szeligowski/index.html", "page_content": "Born on September 13th, 1896 in Lviv, died January 10th, 1963 in Poznań, Polish composer and teacher from a family of Polish musicians. He studied piano with V. Kurz and theory with S. Niewiadomski at the Conservatory of the Galician Music Society in Lviv. From 1918-22 he studied law at the Jagiellonian University in Krakow, at the same time he learned harmony and counterpoint with B. Wallek-Walewski and piano with H. Peters and 1921-22, he studied musicology with Z. Jachimecki. In 1923 he moved to Vilnius, where until 1927 he worked as Legal Counsel with the Attorney General. In 1926 he was vice president of the Vilnius Philharmonic Society. In the years 1929-31, with a MWRiOP scholarship, he studied composition with N. Boulanger and instrumentation with P. Dukas in Paris; at that time he worked in the Association of Young Polish Musicians as secretary and vice president.\n\nIn 1931 he taught music theory and composition at the State Conservatory of Music in Poznań and led the S. Moniuszko choir. In 1931 he married in Vilnius with Stanisława Harasowska, musicologist, with whom he undertook a lot of work in the field of education and dissemination of music. In 1932 he returned to live in Vilnius, where he taught theory at the Conservatory of Music, and from 1935-39 he was deputy director of the private M. Karłowicz Conservatory. He also lectured at the University of Vilnius. In 1932 he founded the Pro Arte vocal group and initiated the creation of The Vilnius Council of Artists’ Associations. During the war he was organist at St. Casimir’s Church in Vilnius. In 1945 he became director of the Secondary Music School in Lublin and together with his wife organized a ‘musicalising’ school. Between 1947-50 he was director of the State Academy of Opera in Poznań and the director and artistic director of the Poznań Philharmonic. Between 1948-63 he taught composition at the Academy of Music in Poznań (from 1950 as a professor); in the years 1951-63 he was professor of composition at the Academy of Music in Warsaw (from 1957 as Head of the Department). Szeligowski’s pupils included: A. Bloch, H. Czyż, J. Fotek, A. Koszewski, W. Kotoński, Z. Krauze, B. Matuszczak, W. Rudziński, W. Słowiński. Between 1951-54, the composer served as president of the Polish Composers’ Union. In 1958 he was president of the Poznań branch of the Polish Composers’ Union, in 1960, Chairman of the Council of COPSA (Central Pedagogical Office for Arts Education), in 1960-62, research manager of musical activists for CPARA (Central Advisory for the Amateur Artistic Movement), in 1961-62 president of the H. Wieniawski Music Society in Poznań. In 1961 Szeligowski was one of the initiators of the Poznań Spring Music Festival. In 1965 he was buried in the Poznań Skalka crypt of Merit.\n\nAwards: 1950 - State Prize II degree, 1951 - prize of the first degree, 1957 - Prime Minister's Award for work for children, 1963 - Award of the PCU (posthumous), 1963 - Award of PR and ZAiKS (posthumous). Honours: 1952 - Officer's Cross of the Order of Polonia Restituta.\n\n\n\nAdam Mrygoń, Encyklopedia Muzyczna PWM, vol. 10 \"Sm-Ś\""}, {"url": "https://polishmusiccompetition.pl/composers/tadeusz-szeligowski/", "page_content": "Composer and teacher, born in Lwów (now Lviv in Ukraine), died in Poznań. At the age of 18, he graduated with distinction from classical secondary school and Galicia Music Conservatory in Lviv, where he studied piano under Vilem Kurz and music theory under Stanisław Niewiadomski. In 1918-1922 he srudied law at the Jagiellonian University in Kraków. In 1921-1928 he studied musicology at the Jagiellonian University in Kraków (on extramural basis). In 1923 he moved to Vilnius. In 1925-1927 he taught history of music at the Vilnius Conservatory. In 1929 he got a scholarship from the Ministry for Religion and Public Education to travel to Paris for further studies. He was a pupil of Nadia Boulanger and Paul Dukas (instrumentation). After return, in 1931 he taught composition and music theory in Music Conservatory in Poznań. During the World War II he lived in Vilnius and worked as organist at the St. Casimir church.\n\nIn 1945 he became director of the Secondary Music School in Lublin. In 1947 he organised the State Academy of Opera in Poznań and became its director. At the same time he was a director and artistic director of the Poznań Philharmonic. In 1948-1963 he taught composition at the Academy of Music in Poznań (from 1950 as a professor); between 1951 and 1963 he was professor of composition at the Academy of Music in Warsaw (from 1957 as Head of the Department). In 1951-1954, Tadeusz Szeligowski was a president of the Polish Composers’ Union. He was an initiator the Poznań Spring Music festival (organised by PC’U, for the fist time in 1961).\n\nTadeusz Szeligowski was awarded in many composers’ competitions, including: honorable mention in 1930, in Henryk Melcer Composers’ Competition in Warsaw, for Archaic Suite for orchestra (1930); honorable mention in 1932, in Wielkopolska Association of Song Clubs in Poznań for Psalm XVI (1931); 1st prize in the Małopolska Association of Song and Music Societies in Lviv, in 1934, for Regina coeli laetare for choir (1934); two 1st awards for Joyful Psalm in memoriam Guillaume Dufay for mixed choir (1938) and Sailors’ Song for mixed choir (1938) in a competition of the “Śpiewak” [“Singer”] monthly; 2nd prize for “100 m” Cantata about Sport for solo voice, choir and orchestra (1948), in 1948, in the Olympic Competition of the Polish Composers’ Union; in 1949: 2nd prize (the 1st has been not awarded) for The Young Squire and Country Girl, musical dialogue for soprano, baritone, mixed choir and orchestra or piano (1948-49) in the Polish Radio and the Ministry of Culture and Arts competition (to compose a song to Adam Mickiewicz’s words); 3rd prize for Sonata in d-minor for piano (1949) in the Fryderyk Chopin Composers’ Competition; honorable mention for Arion, song for tenor and piano (1949) in the competition to cpompose a song to Aleksander Puszkin’s words.\n\nHe was also awarded: in 1950 the State Prize – 2nd degree for Lublin Wedding for soprano, mixed choir and small string orchestra (1948), The Peacock and the Maiden, suite from the ballet (1948) and the song Arion; in 1951 the State Prize – 1st degree for the opera The Scholars’ Revolt; in 1952 the Officer’s Cross of the Order of Polonia Restitutain; in 1957 the Prime Minister’s Award for the opera Krakatuk (1954), in 1963 (posthumous) Award of the Polish Composers’ Union for his output and the Polish Radio award for his radio opera-oratorio Odysseus Weeping for reciting voices, choir and symphony orchestra (1962).\n\nSource: www.polmic.pl, Małgorzata Kosińska, updated: April 2004."}, {"url": "https://www.prestomusic.com/sheet-music/composers/21352--szeligowski", "page_content": "Tadeusz Szeligowski was a Polish composer, educator, lawyer and music organizer. His works include the operas The Rise of the Scholars, Krakatuk and Theodor Gentlemen, the ballets The Peacock and the Girl and Mazepa ballets, two violin concertos, chamber and choral works.\n\nAs a music teacher, Szeligowski was very well established in Vilnius, Lublin, Poznań and Warsaw. He was also a respected music writer who frequently wrote for journals and magazines specialized in music such as the Kurier Wileński, Tygodnik Wileński, Muzyka and the Kurier Poznański. His achievements include the creation of the Poznan´ Philharmonic, where he served as its first director between the years 1947-1949, and the founding of the Poznań Musical Spring, one of the most important festivals of contemporary music at the time.\n\nRead more at https://en.wikipedia.org/wiki/Tadeusz_Szeligowski"}, {"url": "https://polishmusiccompetition.pl/rules-and-regulations/", "page_content": "Rules and Regulations\n\nThe following regulations take into account the amendment of the regulations introduced by the Order of the Competition Director dated February 6, 2023 (concerns item 15).\n\nThe 3rd International Competition of Polish Music\n\nThe International Competition of Polish Music promotes the vast legacy of the nineteenth and twentieth century Polish music. One of the main objectives of the Competition is to disseminate the works of Polish composers, especially those that rarely feature in the programmes performed by Polish and foreign artists. The Competition strives to present rediscovered repertoire to the general public and provide this unjustly neglected legacy with appropriate analyses and new editions.\n\nThe Competition equally endeavours to promote talented musicians who are willing to include lesser-known works written by Polish composers in their concert programmes.\n\nThe Competition is held every other year and its successive editions may feature different sets of musicians and ensembles.\n\nRULES AND REGULATIONS\n\nORGANISER\n\n1. The Competition is organised by the National Institute of Music and Dance.\n\n2. The Director of the National Institute of Music and Dance acts as the Director of the Competition.\n\n3. The Director of the Competition appoints the Artistic Director of the Competition.\n\nPLACES AND DATES\n\n4. The Competition will take place from 2 to 9 July 2023 at the Artur Malawski Podkarpacka Philharmonic Hall in Rzeszów.\n\n5. The Laureates Concert and the Awards Ceremony will be held at the Artur Malawski Podkarpacka Philharmonic Hall in Rzeszów. The Laureates Concert will be repeated at the National Philharmonic Hall in Warsaw. The exact date of the repeated Laureates Concert held in Warsaw will be announced at a later time.\n\n6. All the prize winners and recipients of honourable mentions are obliged to take part in the awards ceremony, and the winners of the main prizes in both categories to perform in both Laureates Concerts.\n\nPRELIMINARY PROVISIONS\n\n\n\n7. Whenever the provisions of the Rulebook mention:\n\na) the Competition website – they refer to the official website of the Competition at www.polishmusiccompetition.pl (or else: www.polishmusiccompetition.pl);\n\nb) the e-mail address of the Competition Office – they refer to the following address: office@polishmusiccompetition.pl (or else: biuro@konkursmuzykipolskiej.pl);\n\nc) the medical services of the Competition – they refer to the doctor employed by the Organiser to provide medical care for the participants, jury members, and organisational and technical personnel of the Competition.\n\n8. If the provisions of the Rulebook mention dates or documents which will be announced publicly before or during the Competition, their publication will appear in the form of separate announcements on the website of the Competition.\n\nCOMPETITION FORMULA\n\n\n\n9. The Competition allows the performance of works written by the composers listed below. They may be selected\n\nby the participants in accordance with the provisions stipulated hereinafter and in the Annex hereto:\n\nGrażyna Bacewicz\n\nTadeusz Baird\n\nFryderyk Chopin\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nHenryk Mikołaj Górecki\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nWojciech Kilar\n\nStefan Kisielewski\n\nRaul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nSzymon Laks\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński\n\nWitold Lutosławski\n\nRoman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nTadeusz Paciorkiewicz\n\nIgnacy Jan Paderewski\n\nRoman Palester\n\nEugeniusz Pankiewicz\n\nAndrzej Panufnik\n\nKrzysztof Penderecki\n\nPiotr Perkowski\n\nKarol Rathaus\n\nLudomir Różycki\n\nKazimierz Serocki\n\nMichał Spisak\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nMaria Szymanowska\n\nKarol Szymanowski\n\nJózef Świder\n\nAleksander Tansman\n\nMieczysław Wajnberg\n\nJózef Wieniawski\n\nBolesław Woytowicz\n\nAdam Wroński\n\nJuliusz Zarębski\n\nAleksander Zarzycki\n\nWładysław Żeleński\n\n10. Furthermore, the Competition provisions stipulated hereinafter and in the Annex hereto allow the performance of a work selected by the participant from the legacy of a deceased Polish composer whose name is not featured on the list above.\n\n11. The Competition is divided into two distinct categories:\n\na) Category I – intended for pianists;\n\nb) Category II – intended for chamber ensembles (only instrumental, two to six musicians; neither the number of the musicians in the ensemble nor the individual instrumental parts may be changed during the course of the Competition).\n\n12. The Competition accepts instrumental musicians applying as soloists (Category I) or chamber ensembles (Category II).\n\n13. The winners of the main prizes (first, second or third place) from a previous edition of the Competition may not take part again, but this provision only applies to the category in which they had won before.\n\n14. There are no age or citizenship restrictions.\n\nHOW TO APPLY AND BE ACCEPTED\n\n15. Applications must be submitted no later than on 28 February 2023.\n\n16. The application process consists in filling out one of the application forms to be found under the correct category at muvac.com. The chosen application form must be filled out in either Polish or English. After the candidate fills out and confirms the application, he or she will be contacted by the Competition Office by e-mail at the address that he or she had provided in his or her application. Should the Competition Office find that the information provided in the application form is not complete and therefore must be amended or supplemented, the application shall only be accepted after it has been amended or supplemented. If the application is not accepted as complete by the Competition Office, it will not count as a Competition application under these Rules and Regulations.\n\n17. The applicant should include the following information and materials in the appropriate fields on the form mentioned above:\n\na) a detailed programme for all the stages (rounds) of the Competition, including the full name of the composer, the title of each composition (or its selected movements, if applicable) and the duration of each composition (or its selected movements); if the applicant has taken part in the previous edition(s) of the Competition, the submitted programme may not contain the same compositions that he or she performed in the previous edition(s); however, the applicant may repeat, in full or in part, the programmes intended for the stages for which he or she did not qualify in the previous edition(s) of the Competition;\n\nb) a biographical note on the Participant (pianist or ensemble) as an attachment in the form of an editable document having up to 3,000 characters including spaces, providing a description of the applicant’s music education and an outline of the previous artistic activities (such as important concerts, prizes and awards from competitions, recordings etc.);\n\nc) two photographs of the Participant (in Category I – including at least one portrait-style photograph), with the resolution of at least 300 dpi, in JPG or TIFF format, and a mention of the full name of the photographer; the title of the file must specify the full name of the pianist or the ensemble;\n\nd) one link to a video recording, pursuant to section 20 hereunder;\n\ne) powers of attorney or declarations, if applicable, pursuant to section 24 hereunder.\n\n18. By submitting the application, the Participant gives consent to the Organiser to use, edit and publish the attached biographical note and the photographs in the informational, promotional and press materials of the Competition.\n\n19. If the Participant intends to include a composition (compositions) mentioned in section 10 hereinabove (i.e. a composition by a deceased Polish composer whose name is not listed in section 9 hereinabove), he or she may enquire whether the proposed composition fulfils the criteria stipulated in these Rules and Regulations by sending a message to the e-mail address of the Competition Office no later than a month before the deadline for the Competition applications. If the enquired composition has not appeared in print, the Participant should attach a legible score of the entire composition. The Artistic Director of the Competition will immediately answer the query through the agency of the Competition Office, no later than two weeks after its submission; the answer shall be construed as binding and final. If the application contains a composition that does not fulfil the criteria of these Rules and Regulation, the application may be rejected by the Qualification Committee.\n\n20. The application documents must be attached with a video recording which includes:\n\na) in Category I – the repertoire specified by the Participant in the application form plus one mandatory etude by Fryderyk Chopin selected by the Participant;\n\nb) in Category II – one or more compositions specified by the Participant in the application form.\n\nThe duration of the recorded presentation must be from 20 to 25 minutes. Excerpts from compositions shall also be accepted. The order of recorded compositions may be random. The respective compositions may be recorded in different locations, on different dates and with the use of multiple technical devices.\n\n21. The video recording attachment included in the Application shall be uploaded onto one of the following online video-sharing platforms: YouTube, Vimeo or Youku. The video shall be uploaded in a mode that does not require registration or password to view it. The link to the video, previously uploaded onto one of the video-sharing platforms mentioned above, shall be provided in the required field of the Muvac application form (video files section).\n\n22. The website of the Competition provides the link to the information about the Competition at muvac.com. In order to fill out the application forms, as stipulated in section 16 of the Rulebook, the candidates will need to set up an account at muvac.com.\n\n23. The video recordings specified in section 20 hereinabove shall only be used for the Competition qualification purposes and shall not be disseminated by the Organiser in any shape or form.\n\n24. Application for Category I of the Competition can be submitted on one’s own behalf or through a representative holding a necessary power of attorney (which must be submitted alongside). The persons with a limited capacity to legal transactions shall attach an appropriate declaration signed by their statutory representative or guardian.\n\n25. Application for Category II of the Competition must be submitted by a person authorised to represent the ensemble. It is presumed that the person signing the application is authorised to do so by the necessary powers of attorney from the other members of the ensemble. If the ensemble has the status of a legal person, the application must be submitted by the person(s) authorised to represent it.\n\n26. The submitted application for the Competition is construed as a contract made between the Organiser and the applicant. It provides for all the matters stipulated in the Rules and Regulations, including the copyright on the artistic performances at the Competition and the Laureates Concerts, as well as the use of the image, comments and interviews recorded during, or in relation to, the Competition and the Laureates Concerts.\n\nThe contract is made on a conditional basis; it is concluded as soon as a given application is accepted by the Qualification Committee. As regards the ensembles without the status of a legal person, the contracts are entered into with all the persons specified in the application documents, pursuant to the presumed powers of attorney held by the person who submits the application on behalf of the ensemble.\n\n27. Applications submitted after the deadline or otherwise failing to meet the requirements stipulated in the Rulebook and its Annexes shall be rejected.\n\n28. The Director of the Competition shall appoint a three-member Qualification Committee, whose members’ names and rules will be publicly announced on the Competition website.\n\n29. The Qualification Committee:\n\na) makes decisions with regard to the rejection of applications, as stipulated in section 27 herein;\n\nb) evaluates the applications and the attached recordings;\n\nc) qualifies up to thirty (30) Participants in Category I and up to thirty (30) Participants in Category II.\n\n30. Each Participant shall be notified of his or her qualification for the Competition in a special message sent to the e-mail address provided in the submitted application. The list of the qualifiers shall also be announced on the Competition website.\n\n31. The qualifiers shall pay the following entry fees:\n\na) in Category I – PLN 450 (or EUR 100) paid by each pianist;\n\nb) in Category II – PLN 700 (or EUR 150) paid by each ensemble.\n\n32. Each qualifier shall be informed where (the number of the bank account) and when (the deadline) to pay the relevant entry fee in the notification message specified in section 30 herein. The payments shall not be refundable. Anyone failing to pay the entry fee by the specified deadline shall be deemed to have withdrawn from the Competition. The confirmation of the entry fee should be sent as soon as it has been paid, to the e-mail address of the Competition Office. Any and all bank fees that may be incurred by the transaction shall be paid by the participant.\n\nSTAGES OF THE COMPETITION\n\n33. The Competition is divided into stages (rounds), each having its own set of rules, which are specified hereinafter with regard to each category. The audition performances at the Competition are open to the public, pursuant to the rules set forth by the Organiser.\n\n34. The order of the participants’ performances shall be drawn.\n\n35. Category I:\n\na) Stage I: The participants perform musical works selected from the list of composers to be found in Part I of the Annex (attached to the Rulebook). Composers included on the list are divided into four groups; the selection shall be made in accordance with the rules stipulated therein. The maximum total time of the musical presentation may not be shorter than 20 minutes or longer than 25 minutes. Stage II shall be reached, in principle, by up to 15 pianists.\n\nb) Stage II: The participants perform musical works selected from the list of composers to be found in Part I of the Annex (attached to the Rulebook). Composers included on the list are divided into two groups; the selection shall be made in accordance with the rules stipulated therein. It is acceptable to perform one work (or its individual movements) by a deceased Polish composer whose name is not listed in section herein, but the duration of this composition may not exceed 10 minutes. The maximum total time of the musical presentation may not be shorter than 35 minutes or longer than 40 minutes. The finals shall be\n\nreached, in principle, by up to 8 pianists.\n\nc) Finals – the participant performs a piano concerto selected from the list to be found in Part I of the Annex (attached to the Rulebook). The pianist is accompanied by an orchestra.\n\n36. Category II:\n\na) Stage I: The participants perform at least two stylistically and expressively different works by two different composers selected from the list to be found in Part II of the Annex (attached to the Rulebook). It is acceptable to perform individual movements if the works comprise multiple movements. The maximum total time of the musical presentation may not be shorter than 20 minutes or longer than 25 minutes. Stage II shall be reached, in principle, by up to 15 ensembles.\n\nb) Stage II: The participants perform at least two stylistically and expressively different works by the composers selected from the list to be found in Part II of the Annex (attached to the Rulebook). It is acceptable to perform individual movements if the works comprise multiple movements. The participants may also perform one work (or its individual movements) by a deceased Polish composer whose name is not listed in section 9 herein. The maximum total time of the musical presentation may not be shorter than\n\n30 minutes or longer than 35 minutes. The finals shall be reached, in principle, by up to 8 ensembles.\n\nc) Finals: The participants perform one or more works by a composer selected from the list to be found in Part II of the Annex (attached to the Rulebook). It is acceptable to perform individual movements if the works comprise multiple movements. The participants may also perform one work (or its individual movements) by a deceased Polish composer whose name is not listed in section 9 herein. In such an instance, the participant must also perform a work (or its component movements) written by composers selected from the list below. The maximum total time of the musical presentation may not be shorter than 35 minutes or\n\nlonger than 40 minutes\n\n37. The presentation times specified above shall be construed as binding; however, depending on the form of musical works, exceptions may be accepted. In such an event, the total time of the musical presentation may exceed the limit specified above by up to 5 minutes. If the selection of the works suggests the need to make an exception to the rule specified previously, it must be explicitly stated in the appropriate part of the application form (in the section dedicated to the lengths of time of the musical works).\n\n38. If the presentation exceeds the acceptable 5 minutes of extra time, the Jury may stop the participant’s performance. Likewise, if the participant who had not requested the need to extend his or her performance is playing beyond the time limit prescribed in the Rules and Regulations, the Jury may stop such a performance after the maximum statutory time has expired.\n\n39. The Jury may not stop any presentation with the exception of the situation described in section 38 hereinabove.\n\n40. The applications for the Competition shall include a projected programme of the full musical presentation in all the stages. Changes to this programme must be accepted by the Director of the Competition upon the Participant’s written application sent to the e-mail address of the Competition Office before the deadline separately announced by the Organiser on the Competition website. Such an application may only be submitted once and should contain a complete list of all the works to be performed by the participant, pursuant to section 17 (a) herein.\n\n41. The musical works selected for performance during all the stages of the Competition, in Category I and in Category II, shall be performed in their original instrumental scoring. Performances of instrumental arrangements are only allowed if they are original arrangements made by the composers of the works themselves or if they were authorised by the composers. Performances of transcriptions (such as paraphrases, fantasias, variations etc.) of works originally written by other composers are also allowed, provided they were made by the composers listed in section 9 herein.\n\n42. Every musical work selected for performance during all the stages of the Competition in Category I shall be performed in its entirety, whereas selected movements of works of a cyclic form may be performed in Category II. Furthermore, the Category I participants shall perform their entire programmes from memory.\n\n43. For reasons concerning the organisation and schedule, and because of unpredictable eventualities, the Organiser reserves the right to make alterations with regard to the order of performances during the Competition. A participant may obtain the consent of the Director of the Competition to reschedule his or her performance for the end of the respective stage if the medical services of the Competition assert that he or she cannot perform his or her programme at the time that had been initially set forth by the Organiser.\n\n44. The Organiser shall see to it that each participant has the same rights with regard to the conditions during practice, rehearsals and audition performances at each stage of the Competition.\n\n45. Each participant is allowed to have one, 15-minute-long acoustic rehearsal before Stage I of the Competition in both categories. The Organiser shall determine the date and time of said rehearsal for each Participant.\n\n46. The finalists of Category I are allowed to have one rehearsal with an orchestra before their competitive performance.\n\n47. The participants of the Competition shall be reimbursed the documented travel costs incurred for the purposes of the Competition, to and from its venue, based on an invoice or ticket bearing the participant’s name. If the incurred and documented expenses significantly exceed the costs that the Organiser finds reasonable (such as a detour, a last-minute reservation, an upgraded travel class etc.), the Organiser reserves the right to reimburse only a portion of such costs, with the final decision to be made by the Director of the Competition.\n\n48. Provided the Participant makes use of the accommodation and board at the place suggested by the Organiser, he or she will have these costs covered by the Organiser, from the day of the Participant’s acoustic rehearsal until the end of his or her participation in the Competition.\n\nJURY OF THE COMPETITION\n\n49. The Director of the Competition appoints, separately for each category, a Jury of the Competition consisting of distinguished Polish and foreign musical artists and musical personalities. The Jury is only authorised to make decisions with regard to the results of the successive stages of the Competition, select the qualifiers as well as award main prizes and honourable mentions.\n\n50. The names of the jury members as well as the rules governing the work of the jury shall be publicly announced at the Competition website.\n\n51. The decisions of the Jury are final and non-appealable.\n\nPRIZES\n\n52. The following main prizes shall be separately awarded to the finalists of each category:\n\nFirst Prize – 20 000 euros\n\nSecond Prize – 10 000 euros\n\nThird Prize – 8 000 euros\n\nFourth Prize – 6 000 euros\n\nFifth Prize – 4 000 euros\n\nSixth Prize – 2 000 euros\n\n53. The other finalists shall be awarded equal honourable mentions worth 500 euros each.\n\n54. The winners of the six main prizes in both categories shall be awarded the title of the Competition Laureate.\n\n55. Moreover, special prizes shall be awarded separately in each category:\n\na) in Category I, a prize of 1000 euros for the best performance of a work by one of the following composers to be selected by the Participant:\n\nAntoni Stolpe\n\nEugeniusz Pankiewicz\n\nRaul Koczalski\n\nb) in Category II, a prize of 1000 euros for the best performance of a work by one of the following composers to be selected by the Participant:\n\nAntoni Stolpe\n\nWitold Maliszewski\n\nAntoni Szałowski\n\n56. The Jury may alter the number and arrangement of the main prizes and honourable mentions provided that the total prize money dedicated for the main prizes and honourable mentions is not higher than originally intended and the amounts prescribed for each individual prize or honourable mention are not changed.\n\n57. The Jury has the right to abstain from awarding some of the main prizes or special prizes.\n\n58. There shall also be additional special prizes, e.g. in the form of concerts held by philharmonic, cultural or artistic institutions, media support as well as financial and material benefits. The definitive list of all these prizes shall be announced before the start of the Competition. The decision with regard to these additional prizes shall be made by the Director of Competition on behalf of the sponsors of the individual prizes.\n\n59. The financial prizes are subject to tax deduction, pursuant to the relevant laws governing them on the day of the awards. The taxes shall be paid by the Organiser.\n\n60. Each laureate of the Competition shall also be awarded a laureate’s diploma, while the remaining finalists shall be awarded finalist’s diplomas. Those participants who fail to qualify for the finals shall be awarded diplomas of participation in the Competition.\n\n61. Following the announcement of the results, the Director of the Competition shall name the laureates of the Competition, who will take part in both Laureates Concerts, and discuss the repertoire to be performed in these concerts. Failure on the part of the laureates to appear in the awards ceremony or on the part of the laureates named by the Director of the Competition to perform in both Laureates Concerts shall result in forfeiting their rights to all the prizes and, in particular, freeing the Organiser from the obligation to pay them the main prizes.\n\n62. The participants of the repeated Laureates Concert held at the National Philharmonic Hall shall be reimbursed the documented travel costs incurred for the purposes of this concert, to and from Warsaw, based on an invoice or ticket bearing the participant’s name. If the incurred and documented expenses significantly exceed the costs that the Organiser finds reasonable (such as a detour, a last-minute reservation, an upgraded travel class etc.), the Organiser reserves the right to reimburse only a portion of such costs, with the final decision to be made by the Director of the Competition.\n\n63. Furthermore, the Organiser shall cover accommodation costs of the participants performing at the repeated Laureates Concert held in Warsaw at a place indicated by the Organiser for as long as it is necessary for them to stay in Warsaw for the concert.\n\n64. The participants shall not be additionally compensated for their performance at the Laureates Concert in Warsaw.\n\nCOPYRIGHT\n\n65. The candidates submitting their applications in person or through an authorised representative:\n\na) allow the Organiser to record the sound and vision of their artistic performances in the Competition and the Laureates Concerts, and transfer their economic rights to these performances to the Organiser;\n\nb) allow the Organiser to record the sound and vision of their image, comments and interviews expressed during the Competition and the Laureates Concerts or in relation to the Competition and the Laureates Concerts, and transfer to the Organiser their economic rights to these statements and interviews, and also allow the Organiser to disseminate their image recorded for the purposes of appearing at the Competition and the Laureates Concerts;\n\nc) transfer to the Organiser the exclusive right, not limited by time or place, to give permission for the use of dependent copyright with regard to the musical works specified above, particularly permission to dispose of and make use of arrangements of these works, including translations into other languages; the participants also undertake not to attempt to restrict this right in the future;\n\nd) authorise the Organiser to exercise personal rights with regard to the musical works and artistic performances specified above, and undertake not to exercise their personal rights in such a way that would restrict the Organiser’s acquired rights pursuant to the rule stipulated in this section;\n\ne) allow the Organiser to make use of their artistic performances, interviews, comments and image, as a whole or as randomly selected fragments, or to make adaptations, cuts and alterations, as well as translations, and declare that the said use will not be construed as a violation of their reputation; the participants also allow the Organiser to use their first and last names, or their ensemble names, whenever the said artistic performances, comments, interviews or image are shown.\n\n66. The transfer and grant of the rights (including the permissions) specified above is not limited by time or place, and covers all the fields of exploitation as known at the time of the announcement of the Rules and Regulations.\n\n67. The transfer and grant of the rights (including the permissions) specified above is effective at the moment of recording the artistic performances, comments or interviews, and is non-refundable. Whenever permitted by law, the participants shall waive their right to financial compensation with regard to the dissemination of the said artistic performances, comments and interviews on the Internet, television or radio.\n\n68. In respect of the acquired rights pursuant to the provisions stipulated herein, the Organiser may, without limitations, transfer these rights to further entities or grant licences and other authorisations. The participants of the Competition may not claim financial compensation relating to these actions.\n\nDATA PROTECTION\n\n69. The personal data provided in the application documents shall be administered by the Organiser for a period of two years of the date of its provision. The data of the persons being awarded financial prizes shall be additionally administered for a period of five years of the date of the payment of the prize, and shall only be processed during this period for tax and accounting purposes.\n\n70. The personal data shall only be processed for the purposes directly related to the Competition itself, and in particular:\n\na) announcements of the order of auditions and the results of consecutive stages published on the website of the Competition;\n\nb) printed and electronic publication of informational and promotional materials regarding the Competition, along with an image and a biographical note edited by the Organiser.\n\n71. The provision of personal data is non-compulsory; nevertheless it is indispensable for the qualification process to be effective. Each person whose personal data is administered by the Organiser shall have the right to access the contents of this data and edit it, and may also request to limit its processing scope or to remove it; such a request may however have its relevant consequences, such as, in extreme cases, the termination of the participant’s right to remain in the Competition.\n\n72. The personal data shall not be used for automated decision-making.\n\nFINAL PROVISIONS\n\n73. The Organiser shall not help the participants of the Competition obtain their visas; however, a relevant certification confirming participation in the Competition may be issued upon request.\n\n74. The Organiser shall not help the Participants obtain a health insurance covering the duration of their stay in Poland; obtaining such an insurance, however, is advisable.\n\n75. For matters not provided for herein, which are related to the Competition but not authorised by the Jury, decisions made by the Director of the Competition shall apply. These decisions shall not be appealable.\n\n76. Any doubts resulting from the construction of the provisions stipulated herein shall be resolved under the Polish version of the text.\n\n77. Any disputes arising from the agreements stipulated herein shall be resolved in accordance with the Polish law before the court competent for the Organiser’s registered office.\n\nANNEX TO THE RULEBOOK\n\nPROGRAMME\n\nPART I\n\nCATEGORY I – PIANIST\n\nStage I\n\nThe programme should contain compositions from each of the following four groups of composers – at least four compositions in total (at least one composition from each group).\n\nThe total time of the musical presentation may not be less than 20 minutes or more than 25 minutes.\n\nThe precise order of performance of the compositions from the respective groups is not fixed (it depends on the performer).\n\nGroup I\n\nOne or more etudes selected from the oeuvre of the following composers:\n\nIgnacy Friedman\n\nMaurycy Moszkowski\n\nTeodor Leszetycki\n\nJuliusz Zarębski\n\nLeopold Godowski\n\nGroup II\n\nOne or more works selected from the oeuvre of the following composers:\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nJoachim Kaczkowski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nAntoni Kątski\n\nFranciszek Lessel\n\nKarol Lipiński\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nMaria Szymanowska\n\nGroup III\n\nOne or more works selected from the oeuvre of the following composers:\n\nMieczysław Karłowicz\n\nRaul Koczalski\n\nTeodor Leszetycki\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nZygmunt Noskowski\n\nHenryk Pachulski\n\nEugeniusz Pankiewicz\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nJózef Wieniawski\n\nAdam Wroński\n\nAleksander Zarzycki\n\nJuliusz Zarębski\n\nWładysław Żeleński\n\nGroup IV\n\nOne or more works selected from the oeuvre of the following composers:\n\nTadeusz Baird\n\nHenryk Mikołaj Górecki\n\nWojciech Kilar\n\nStefan Kisielewski\n\nSzymon Laks\n\nMiłosz Magin\n\nRoman Maciejewski\n\nTadeusz Paciorkiewicz\n\nRoman Palester\n\nAndrzej Panufnik\n\nPiotr Perkowski\n\nKarol Rathaus\n\nLudomir Różycki\n\nKazimierz Serocki\n\nMichał Spisak\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nJózef Świder\n\nAleksander Tansman\n\nBolesław Woytowicz\n\nStage II\n\nThe programme should contain works from each of the following two groups of composers – at least two compositions in total (at least one from each group).\n\nIt is acceptable to perform one work, considered to be a work of classical music, selected by the participant from the legacy of a deceased Polish composer whose name is not featured on the list below. The duration of this composition may not exceed 10 minutes.\n\nThe total time of the musical presentation may not be less than 35 minutes or more than 40 minutes.\n\nThe precise order of performance of the compositions from both groups is not fixed (it depends on the performer).\n\nThe works performed in this stage may not be the same as those performed in Stage I.\n\nGroup I\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nRaul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nIgnacy Jan Paderewski\n\nEugeniusz Pankiewicz\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nMaria Szymanowska\n\nKarol Szymanowski\n\nJózef Wieniawski\n\nAdam Wroński\n\nJuliusz Zarębski\n\nAleksander Zarzycki\n\nWładysław Żeleński\n\nGroup II\n\nGrażyna Bacewicz\n\nTadeusz Baird\n\nHenryk Mikołaj Górecki\n\nWojciech Kilar\n\nStefan Kisielewski\n\nSzymon Laks\n\nWitold Lutosławski\n\nRoman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nTadeusz Paciorkiewicz\n\nRoman Palester\n\nAndrzej Panufnik\n\nPiotr Perkowski\n\nKarol Rathaus\n\nLudomir Różycki\n\nKazimierz Serocki\n\nMichał Spisak\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nJózef Świder\n\nAleksander Tansman\n\nMieczysław Wajnberg\n\nBolesław Woytowicz\n\nFinal Stage\n\nIn the finals, the participant performs a piano concerto selected from the list below.\n\nThe concerto is performed alongside an orchestra.\n\n1. Franciszek Lessel – Piano Concerto in C major, op. 14\n\n2. Miłosz Magin – Piano Concerto No. 2 for piano, strings and timpani\n\n3. Artur Malawski – Symphonic Studies for piano and orchestra\n\n4. Henryk Melcer-Szczawiński – Piano Concerto No. 1 in E minor\n\n5. Kazimierz Serocki – Romantic Concerto for piano and orchestra\n\n6. Aleksander Tansman – Piano Concerto No. 1\n\n7. Józef Wieniawski – Piano Concerto in G minor, op. 20\n\n8. Władysław Żeleński – Piano Concerto in E flat major, op. 60\n\nPART II\n\nCATEGORY II – CHAMBER ENSEMBLES\n\nStage I\n\nThe programme should contain at least two stylistically and expressively different works written by at least two composers selected from the list below – at least two works in total. If the works have multiple movements, their selected individual movements may also be performed.\n\nThe total time of the musical presentation may not be less than 20 minutes or more than 25 minutes.\n\nGrażyna Bacewicz\n\nTadeusz Baird\n\nFryderyk Chopin\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nHenryk Mikołaj Górecki\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nWojciech Kilar\n\nStefan Kisielewski\n\nRaul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nSzymon Laks\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński\n\nWitold Lutosławski\n\nRoman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nTadeusz Paciorkiewicz\n\nIgnacy Jan Paderewski\n\nRoman Palester\n\nEugeniusz Pankiewicz\n\nAndrzej Panufnik\n\nKrzysztof Penderecki\n\nPiotr Perkowski\n\nStage II\n\nThe programme should contain at least two stylistically and expressively different works written by at least two composers selected from the list below – at least two works in total, different from those performed in Stage I.\n\nIf the works have multiple movements, their selected individual movements may also be performed (the compositions may not be the same as those performed in Stage I).\n\nIt is acceptable to perform one work (or its component movements), considered to be a work of classical music, selected by the participant from the legacy of a deceased Polish composer whose name is not featured on the list below.\n\nThe total time of the musical presentation may not be less than 30 minutes or more than 35 minutes.\n\nGrażyna Bacewicz\n\nTadeusz Baird\n\nFryderyk Chopin\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nHenryk Mikołaj Górecki\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nWojciech Kilar\n\nStefan Kisielewski\n\nRaul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nSzymon Laks\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński\n\nWitold Lutosławski\n\nRoman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nTadeusz Paciorkiewicz\n\nIgnacy Jan Paderewski\n\nRoman Palester\n\nEugeniusz Pankiewicz\n\nAndrzej Panufnik\n\nKrzysztof Penderecki\n\nPiotr Perkowski\n\nKarol Rathaus\n\nLudomir Różycki\n\nKazimierz Serocki\n\nMichał Spisak\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nMaria Szymanowska\n\nKarol Szymanowski\n\nJózef Świder\n\nAleksander Tansman\n\nMieczysław Wajnberg\n\nJózef Wieniawski\n\nBolesław Woytowicz\n\nAdam Wroński\n\nJuliusz Zarębski\n\nAleksander Zarzycki\n\nWładysław Żeleński\n\nFinal Stage (Finals)\n\nThe programme should contain one or more works written by composer(s) selected from the list below.\n\nIf the works have multiple movements, their selected individual movements may also be performed (the compositions may not be the same as those performed in previous stages).\n\nThe selected compositions (or their component movements) may not be the same as those performed in Stages I and II.\n\nIt is acceptable to perform one work (or its component movements), considered to be a work of classical music, selected by the participant from the legacy of a deceased Polish composer whose name is not featured on the list below; the work may be by the composer selected for Stage II or by another composer whose name is not featured on the list below. In such an instance, the participant must also perform a work (or its component movements) written by composers selected from the list below.\n\nThe total time of the musical presentation may not be less than 35 minutes or more than 40 minutes.\n\nGrażyna Bacewicz\n\nTadeusz Baird\n\nFryderyk Chopin\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nHenryk Mikołaj Górecki\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nWojciech Kilar\n\nStefan Kisielewski\n\nRaul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nSzymon Laks\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński\n\nWitold Lutosławski\n\nRoman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nTadeusz Paciorkiewicz\n\nIgnacy Jan Paderewski\n\nRoman Palester\n\nEugeniusz Pankiewicz\n\nAndrzej Panufnik\n\nKrzysztof Penderecki\n\nPiotr Perkowski\n\nKarol Rathaus\n\nLudomir Różycki\n\nKazimierz Serocki\n\nMichał Spisak\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nMaria Szymanowska\n\nKarol Szymanowski\n\nJózef Świder\n\nAleksander Tansman\n\nMieczysław Wajnberg\n\nJózef Wieniawski\n\nBolesław Woytowicz\n\nAdam Wroński\n\nJuliusz Zarębski\n\nAleksander Zarzycki\n\nWładysław Żeleński"}, {"url": "https://peoplepill.com/people/tadeusz-szeligowski/", "page_content": "Tadeusz Szeligowski (13 September 1896 - 10 January 1963) was a Polish composer, educator, lawyer and music organizer. His works include the operas The Rise of the Scholars, Krakatuk and Theodor Gentlemen, the ballets The Peacock and the Girl and Mazepa ballets, two violin concertos, chamber and choral works.\n\nAs a music teacher, Szeligowski was very well established in Vilnius, Lublin, Poznań and Warsaw. He was also a respected music writer who frequently wrote for journals and magazines specialized in music such as the Kurier Wileński, Tygodnik Wileński, Muzyka and the Kurier Poznański. His achievements include the creation of the Poznan´ Philharmonic, where he served as its first director between the years 1947-1949, and the founding of the Poznań Musical Spring, one of the most important festivals of contemporary music at the time.\n\nLife and work\n\nMusical education\n\nTadeusz Szeligowski was born on 13 September 1896 in Lvov, then in Austro-Hungarian Galicia. Szeligowski’s first music and piano teacher was his mother. Later he began studying music at the Conservatory of Music of the Polish Society in L'vov in the years 1910-1914, where he studied piano under the direction of Vilem Kurz, and then from 1918-1923 in Kraków, where he studied piano with H. Peters, and composition with Bolesław Wallek-Walewski. Szeligowski's further education included musicology with Zdzisław Jachimecki and law at the Jagiellonian University in Kraków, where he received his doctorate in 1922. There he found work as repetiteur at the Kraków Opera House, allowing him to become well acquainted with the opera repertoire.\n\nHe complemented his studies in music in the years 1929-1931 in Paris, where he met many composers of his time such as Sergei Prokofiev, George Enesco and Arthur Honegger. There he studied composition with Nadia Boulanger and orchestration with Paul Dukas. There he attended many concerts and intensely experienced the latest compositions by Darius Milhaud, Francis Poulenc, ballet productions of many famous companies, as well as highly acclaimed performances by Jascha Heifetz, Vladimir Horowitz, Arthur Rubinstein and Ignacy Jan Paderewski.\n\nMusical career\n\nIn 1923 Szeligowski worked in Vilnius, Lithuania, as lawyer and lecturer at the Conservatory of Music. There he met Karol Szymanowski and became a great admirer of his music. He also worked with a dramatic theatre called Reduta, composing music for many of its productions. Shortly after his return to Poland in 1931, he began teaching music in Poznań until 1939, and then moved to Lublin for a little while after the World War II. From 1947-1962 he worked for The State Higher School Of Music (Państwowa Wyzsza Szkoła Muzyczna) in Poznań, and from 1947-1950 he became director of the National Opera Academy, when on his own initiative the Poznań Philharmonic was created. In addition, he was the initiator of the festival of contemporary music, the \"Poznań Musical Spring\", where modern music was then presented in all its glory, and one of the organizers of the H. Wieniawski International Violin Competition. From 1951-1962 Szeligowski worked in Warsaw, first for the faculty of the Fryderik Chopin University of Music in Warsaw, and later as director of the Polish Society of Composers.\n\nA large group of his graduates on composition include: Zbigniew Bargielski, Augustyn Bloch, Joanna Bruzdowicz, Wojciech Lukaszewski, Tadeusz Wojciech Maklakiewicz, Boleslaw Ocias, Witold Rudzinski, Marek Sart, Aleksander Szeligowski and Antoni Szuniewicz. See: List of music students by teacher: R to S#Tadeusz Szeligowski.\n\nAs a music writer\n\nLvov’s musical scene at that time included a city opera, a symphonic orchestra, a music society and also a conservatory of music, and there Szeligowski was very active as a social organizer. Musicians such as Felix Weingartner and Oscar Nedbal usually visited the city and frequently performed works by Giuseppe Verdi and Richard Wagner. From 1951-1954 he served as chairman of the Polish Composers Union, and from 1953 he worked for the Board of Polish Music Publishers and the Central Pedagogical Office for Arts Education (COPSA). Tadeusz Szeligowski died in Poznań on 10 January 1963 and since 1965 he has been buried in the Poznań Skalka crypt of Merit.\n\nAwards\n\nJózef Kopczyński's 1966 commemorative plaque for Polish composer Tadeusz Szeligowski. Józef Kopczyński's 1966 commemorative plaque for Polish composer Tadeusz Szeligowski.\n\nSzeligowski received numerous awards, among them:\n\n1949 ( ) : Third prize at the Second Composers' Competition for Chopin's Piano Sonata d-moll\n\n1949 ( ) : Second prize at the Polish Radio Competition for the song The Prince and the girl\n\n1950 ( ) : State prize of the second degree for The peacock and the girl , Arion , and the Lublin Wedding\n\n1951 ( ) : State prize of the first degree for the opera stage Rise of the scholars\n\n1963 ( ) : Prize Prime Minister of Poland for his music for children and youth\n\n1963 ( ) : Music Award of the PCU, awarded every 17 January by the Polish Composers Union (ZKP — Zwiazek Kompozytorow Polskich) for lifetime achievement (posthumous)\n\nAlso, he received numerous prizes and awards, including:\n\nThe City of Poznań Music Prize\n\n1952 ( ) : Gold Cross of Merit ( ZŁOTYM KRZYZEM ZASŁUGI )\n\n1952 ( ) : Medal Order of Polonia Restituta\n\n1966 ( ) : A commemorative plaque designed by Józef Kopczyński and placed at House 22, Chełmoński street, in Poznań, where he lived from 1947.\n\nCompositions\n\nInstrumental\n\nOrchestral works\n\nThe Peasant King - Overture to the comedy of Piotr Baryka for orchestra (1926)\n\n- Overture to the comedy of Piotr Baryka for orchestra (1926) Kaziuki - St. Casimir's Day, suite for orchestra (1928–29)\n\nsuite for orchestra (1928–29) Concerto for Orchestra (1930)\n\nfor Orchestra (1930) Archaic Suite for orchestra (1930)\n\nfor orchestra (1930) Little Suite for orchestra (1931)\n\nfor orchestra (1931) Clarinet Concerto (1933)\n\n(1933) Andante for clarinet and orchestra (1933)\n\nfor clarinet and orchestra (1933) Blue Bird - suite for orchestra (1936)\n\n- suite for orchestra (1936) Epitaph on the death of Karol Szymanowski for string orchestra (1937)\n\nfor string orchestra (1937) Carol Suite for string orchestra (1939)\n\nfor string orchestra (1939) Piano Concerto (1941)\n\n(1941) Suite for small orchestra of Lublin (1945)\n\nfor small orchestra of Lublin (1945) Kupałowa night - suite for orchestra (1945)\n\n- suite for orchestra (1945) Nocturno for orchestra (1947)\n\nfor orchestra (1947) Comedy Overture for small symphony orchestra (1952)\n\nfor small symphony orchestra (1952) The peacock and girl ballet suite for orchestra (1953)\n\nballet suite for orchestra (1953) Four Polish Dances for symphony orchestra (1954)\n\nChamber music\n\nA musical score of Tadeusz Szeligowski's Sonata for flute and piano. A musical score of Tadeusz Szeligowski's\n\nLithuanian Song for violin and piano (1928)\n\nfor violin and piano (1928) String Quartet No. 1 (1928–29)\n\nNo. 1 (1928–29) Ricercar for 4 voices, instrumental or vocal (1931)\n\nfor 4 voices, instrumental or vocal (1931) String Quartet No. 2 (1934-1935)\n\nNo. 2 (1934-1935) Trio for oboe, viola and cello (1935)\n\nfor oboe, viola and cello (1935) Fish ball , song for children's team (1937)\n\n, song for children's team (1937) Air grave et gai air for English horn and piano (1940)\n\nfor English horn and piano (1940) Nocturno for cello and piano (1943)\n\nfor cello and piano (1943) Dance for cello and piano (1943–45)\n\nfor cello and piano (1943–45) Poem for cello and piano (1943–45)\n\nfor cello and piano (1943–45) Pastorale for cello and organ (1943–45)\n\nfor cello and organ (1943–45) Sarabande for cello and organ (1943–45)\n\nfor cello and organ (1943–45) Orientale for Cello and Piano (1945)\n\nfor Cello and Piano (1945) Quintet for wind instruments (1953)\n\nfor wind instruments (1953) Sonata for flute and piano (1953)\n\nfor flute and piano (1953) On the meadow , suite for 2 pianos (1955)\n\n, suite for 2 pianos (1955) Trio for violin, cello and piano (1955-1956)\n\nfor violin, cello and piano (1955-1956) Polish love songs for recorders (1959)\n\nSolos (Pianoforte)\n\nVariations on a folk song for piano (1927)\n\nfor piano (1927) Guitars of Zalamea , for piano (1938–39)\n\n, for piano (1938–39) Sonatina for piano (1940–41)\n\nfor piano (1940–41) Russian Dance , for piano (1942)\n\n, for piano (1942) Sonata in d minor for piano (1949)\n\nin d minor for piano (1949) Two etudes on double sounds for piano (1952)\n\nfor piano (1952) Small pieces for piano (1952)\n\nfor piano (1952) Odds and ends for four hands, for piano (1952)\n\nVocal Score\n\nFor solo voices\n\nNos qui sumus - motet for two male voices (1929)\n\n- for two male voices (1929) O vos omnes - motet for three female voices (1929)\n\n- motet for three female voices (1929) Timor et tremor - motet for contralto and tenor (1929)\n\n- motet for contralto and tenor (1929) Missa de Angelis for 3 female voices (1942)\n\nfor 3 female voices (1942) Ave Maria for three female voices (1943 )\n\nfor three female voices (1943 ) Regina Coeli Laetare for 3 female voices (1943)\n\nfor 3 female voices (1943) Populations meus for 3 female voices (1943)\n\nfor 3 female voices (1943) Veni Creator for 3 female voices (1943)\n\nFor choir a cappella\n\nTwo Belarusian songs for mixed choir (1930)\n\nfor mixed choir (1930) Under the canopy of snow - Christmas carol for mixed choir (1933–34)\n\n- Christmas carol for mixed choir (1933–34) Angela sang sweetly - motet for mixed choir (1934)\n\n- motet for mixed choir (1934) Quail - Belarusian folk song for male choir (1934)\n\n- Belarusian folk song for male choir (1934) Regina Coeli Laetare for mixed choir (1934)\n\nfor mixed choir (1934) Already we have time for male choir (1935)\n\nfor male choir (1935) Song of the sailors , for mixed choir (1938)\n\n, for mixed choir (1938) Psalm Joyful in memoriam of Guillaume Dufay for mixed choir (1938)\n\nfor mixed choir (1938) Mass for choir (1942)\n\nfor choir (1942) Stabat Mater for mixed choir (1943)\n\nfor mixed choir (1943) Pange lingua in mixed choir (1943)\n\nin mixed choir (1943) Five folk songs from Lublin region for choir female or child (1945)\n\nfor choir female or child (1945) Five folk songs from the Lublin region for 3 mixed choir (1945)\n\nfor 3 mixed choir (1945) Four wedding songs from the Lublin region for mixed choir (1945)\n\nfor mixed choir (1945) Koszalka - Opałka , scherzo for male choir (1946)\n\n, scherzo for male choir (1946) A wyjrzyjcież , youths, song for mixed choir (1948)\n\n, youths, song for mixed choir (1948) Song of the 10th anniversary [version II] for mixed choir a cappella (1955)\n\n[version II] for mixed choir a cappella (1955) Psalm CXVI \"Laudate Dominum\" for mixed choir and boys' (1960)\n\nVocal and instrumental\n\nFor voice and piano\n\nWanda , song for voice and piano (1927)\n\n, song for voice and piano (1927) Lithuanian folk songs for voice and piano (1927)\n\nfor voice and piano (1927) Song of the green for voice and piano (1929)\n\nfor voice and piano (1929) Lilies - ballad for voice and piano (1929)\n\n- ballad for voice and piano (1929) Oaks - elegy for voice and piano (1929)\n\n- elegy for voice and piano (1929) In alder - idyll for voice and piano (1929)\n\n- idyll for voice and piano (1929) Hops - wedding song for voice and piano (1929)\n\n- wedding song for voice and piano (1929) Floral allegories for voice and piano (1934)\n\nfor voice and piano (1934) Songs to the words of Jarosław Iwaszkiewicz for voice and piano (1945)\n\nfor voice and piano (1945) Green brzózko , song for voice and piano (1947)\n\n, song for voice and piano (1947) My Girl , song for voice and piano (1947)\n\n, song for voice and piano (1947) The Rose Highway , song for voice and piano (1947)\n\n, song for voice and piano (1947) Arion for tenor and piano (1949)\n\nfor tenor and piano (1949) Demon for tenor and piano (1949)\n\nfor tenor and piano (1949) Doves for soprano and piano (1949)\n\nfor soprano and piano (1949) The Ballad of Kostka Napierski for voice and piano (1951)\n\nfor voice and piano (1951) With three Mauretankach , song for voice and piano (1953)\n\n, song for voice and piano (1953) Soledad for voice and piano (1960)\n\nFor various vocal and instrumental ensembles\n\nPsalm XVI - oratorio (1931)\n\n- oratorio (1931) Latin Mass for mixed choir and organ (1932)\n\nfor mixed choir and organ (1932) Cherry Blues for voice, cello and piano (1934)\n\nfor voice, cello and piano (1934) Ave Maria for soprano, female choir and organ (1943)\n\nfor soprano, female choir and organ (1943) Aria for soprano and organ (1943)\n\nfor soprano and organ (1943) Sit down everybody around us , suite 12 popular songs from the years 1810 to 1875 for mixed choir (or soprano and alto) and piano (1945)\n\n, suite 12 popular songs from the years 1810 to 1875 for mixed choir (or soprano and alto) and piano (1945) Triptych for soprano and orchestra (1946)\n\nfor soprano and orchestra (1946) Cantata for sport \"100 m\" for solo voice, choir and orchestra (1948)\n\nfor solo voice, choir and orchestra (1948) Wedding Suite for soprano, tenor, female chorus, mixed chorus and piano (1948)\n\nfor soprano, tenor, female chorus, mixed chorus and piano (1948) Wedding in Lublin for soprano, mixed choir and small orchestra (1948)\n\nfor soprano, mixed choir and small orchestra (1948) The young master and a girl , musical dialogue for soprano, baritone, mixed choir and orchestra or piano (1948-1949)\n\n, musical dialogue for soprano, baritone, mixed choir and orchestra or piano (1948-1949) Rhapsody for soprano and orchestra (1949)\n\nfor soprano and orchestra (1949) Of hearts card , cantata for soprano, mixed choir and symphony orchestra (1952)\n\n, cantata for soprano, mixed choir and symphony orchestra (1952) Sophie , suite for choir and orchestra (1952)\n\n, suite for choir and orchestra (1952) Renegade , ballad for bass and orchestra or piano (1953)\n\n, ballad for bass and orchestra or piano (1953) Song of the 10th anniversary [version] for choir\n\nStage works\n\nThe peacock and the girl , ballet in 3 acts (1948)\n\n, ballet in 3 acts (1948) Bunt żaków (Student Rebellion), opera in 4 acts (1951)\n\n(Student Rebellion), opera in 4 acts (1951) Krakatuk , opera in 3 acts with a prologue (1954)\n\n, opera in 3 acts with a prologue (1954) Mazepa , ballet in 3 acts (1958)\n\n, ballet in 3 acts (1958) Theodore Gentleman, opera in 2 acts ( 1960)\n\n^\n\nMagocsi, Paul Robert. A history of Ukraine. University of Toronto Press. p. 240. ISBN 0-8020-7820-6.\n\nSelected bibliography"}, {"url": "https://edycja2021.konkursmuzykipolskiej.pl/en/article/programme-ensembles", "page_content": "CATEGORY II ? CHAMBER ENSEMBLES\n\nProgramme for Stage I\n\nThe programme should contain at least two stylistically and expressively different works (or their component movements) by at least two different composers to be selected from the list below. The maximum total time of the musical presentation may not exceed 30 minutes. Depending on the form of the works, the time of the presentation may exceptionally exceed the limit specified above by up to 10 minutes (see section 28 of the Rulebook).\n\nTadeusz Baird\n\nIgnacy Feliks Dobrzyński\n\nJózef Ksawery Elsner\n\nIgnacy Friedman\n\nLeopold Godowski\n\nJoachim Kaczkowski\n\nMieczysław Karłowicz\n\nAntoni Kątski\n\nStefan Kisielewski\n\nRaoul Koczalski\n\nJózef Władysław Krogulski\n\nKarol Kurpiński\n\nSzymon Laks\n\nFranciszek Lessel\n\nTeodor Leszetycki\n\nKarol Lipiński Roman Maciejewski\n\nMiłosz Magin\n\nArtur Malawski\n\nWitold Maliszewski\n\nHenryk Melcer-Szczawiński\n\nKarol Mikuli\n\nStanisław Moniuszko\n\nMaurycy Moszkowski\n\nZygmunt Noskowski\n\nJózef Nowakowski\n\nMichał Kleofas Ogiński\n\nHenryk Pachulski\n\nTadeusz Paciorkiewicz\n\nRoman Palester Eugeniusz Pankiewicz\n\nPiotr Perkowski\n\nLudomir Różycki\n\nMichał Spisak\n\nRoman Statkowski\n\nZygmunt Stojowski\n\nAntoni Stolpe\n\nAntoni Szałowski\n\nTadeusz Szeligowski\n\nMaria Szymanowska\n\nJózef Wieniawski\n\nBolesław Woytowicz\n\nAdam Wroński\n\nJuliusz Zarębski\n\nAleksander Zarzycki\n\nWładysław Żeleński\n\nProgramme for Stage II ? Final\n\nThe final stage shall include the performance of one or more works (or their component movements) written by the composer(s) from group 2. In addition, the participant is allowed to perform one work (or its component movements) written by a composer from group 1, however the musical presentation of this work (or its component movements) may not exceed 20 minutes.\n\nThe maximum total time of the presentation may not exceed 40 minutes but may not be shorter than 35 minutes. Depending on the form of the works, the time of the presentation may exceptionally exceed the limit specified above by up to 10 minutes (see section 28 of the Rulebook).\n\nThe works performed in this stage may not be the same as those performed in Stage I.\n\nGroup 1:\n\nGrażyna Bacewicz\n\nFryderyk Chopin\n\nHenryk Mikołaj Górecki Wojciech Kilar\n\nWitold Lutosławski\n\nStanisław Moniuszko\n\nKarol Szymanowski Ignacy Jan Paderewski\n\nKrzysztof Penderecki\n\nAleksander Tansman\n\n\n\nGroup 2:"}, {"url": "https://polishmusic.usc.edu/newsletter/polish-manuscript-exhibition-concert/", "page_content": "Overview\n\nOn 21 October 2000, the PMC presented its new additions to the Manuscript Collection (over 100 manuscripts by Polish composers, including manuscripts scores and sketches by Grażyna Bacewicz, Roman Maciejewski, Zygmunt Krauze, Zbigniew Bujarski, and many others). For more information visit the Manuscript Collection. The exhibit was accompanied by a Chamber Music Concert performed by Polish musicians from the USC Thornton School of Music as well as others active in Los Angeles. The Concert was recorded and the CD includes chamber music by Kazimierz Serocki, Marta Ptaszyńska, Tadeusz Szeligowski, Tadeusz Baird, and others.\n\nEvent Review\n\nby Radosław Materka\n\nManuscript Exhibition And Concert\n\nAmong the many political, economic and social organizations related to Poland, the Polish Music Center at the University of Southern California occupies a unique position. This center, founded in 1985 by Dr. and Mrs. Wilk (and still improperly seen by many members of Californian Polonia as their private concern) is the only institution dedicated to the promotion of and research about Polish music in North America. Moreover, it is the only academic institution dedicated to Polish culture in Southern California. The Center was designed to last in perpetuity (thanks to its permanent Endowment Fund) and is a part of one of the best music schools in the country, the Thornton School of Music (ranked in the top 1% of music schools in the U.S. and as no. 1 west of Mississippi).\n\nThe main part of the program was the most unique: a display of over 100 manuscripts by 33 composers who donated their music to the Polish Music Center. What is a “manuscript?” Something hand-written—and during the exhibit we had a chance of seeing a whole range of writing, from pencil to ink and marker, the composers used different means to record their thoughts. Each set of manuscripts (from 1 to 8 per composer) was accompanied by a display with the composers’ biography, titles of the works presented, photographs, concert programs, books, and quotations from their statements.\n\nThe displays were assembled on 36 white three-panel boards providing the backdrop for the manuscripts. The most precious of those were, of course, three of the manuscripts donated to the Center by Witold Lutoslawski—the total value of the set of five original Lutoslawski manuscripts in the PMC collection exceeds $1,000,000. No wonder two security guards were needed and present on the premises through the whole exibition. Other precautions included distributing gloves among the attendees, who could turn the pages but would not damage the precious old paper.\n\nIn addition to the Lutosławski originals, the display included also rare scores from mid-30s (by Grażyna Bacewicz and Stanisław Skrowaczewski), manuscripts by Tadeusz Baird (over 50 years old), Aleksander Tansman, Roman Maciejewski, Szymon Laks, Roman Palester, and many of their younger colleagues. The manuscripts were accompanied by printed scores and recordings—so people in attendance could learn about the music and listen to what they saw. The whole collection is not complete yet, it continues to grow through new donations made by other composers contacted by Dr. Trochimczyk. This stage in donations drive will end in April 2000, when another, smaller exhibition of recent gifts will be held.\n\nChamber Music Concert\n\nLet me start with describing some examples—young musicians, graduate students in the Thornton School of Music, who volunteered to perform in the Concert of 20th Century Polish Music. Ladies first: Adrianna Lis has played the flute since childhood and won numerous prizes in international competitions. After being accepted to study at USC, she became the member of the most elite group of wind players, the “Scholarship Quintet” where she played for one year. It was a very special recognition of her talent as the best flutist in the whole School (her GPA? 4.0, perfect!). Her version of two lively movements from Szeligowski’s Sonata for Flute and Piano amazed the audience with the dexterity of her fingers. Marzena Wolna (who because of a hand injury could not perform in the concert)—the first bassoon in USC Thornton Orchestra, first bassoon in Debut orchestra, winner of every orchestral competition for her instrument that she ever entered. I hope that Polish-Americans in California will have an opportunity of listening to her music in the future.\n\nNow the gentlemen: Jan Jakub Bokun, clarinetist and conductor whose graduation concert in April 2001 will feature Polish music, and for whom a professorship of clarinet in the Wroclaw Academy of Music is already waiting. Bokun’s two solo CDs have received rave reviews in international music press. His “stint” as the clarinetist for Krystian Zimerman’s Polish Festival Orchestra (traveling around the world and recording the two Chopin Piano Concerti) is yet another proof of his amazing talents (GPA? Of course, 4.0).\n\nFor the concert he selected a piece by Tadeusz Baird, the most romantic of Polish modernist composers, an artist whose talent was and is, not known well enough in the U.S. 2 Kaprysy delighted with their “capricious” nature and the virtuosity of performance.\n\nMichaż Sobus (double bass) and Krzysztof Szmanda (percussion) have just been accepted to the Thornton School and will have to prove their talents. Already both musicians play the “first” parts in the Thornton ensembles and perform in other orchestras based in Los Angeles. During the concert Mr. Sobus performed a difficult and engaging work by Tadeusz Wielecki (the current director of the Warsaw Autumn Contemporary Music Festival). Mr. Szmanda was accompanied by a pianist in 4 Preludes for vibraphone and piano, and by another percussionist in Scintilla for two marimbas. Both works were composed by Marta Ptaszynska, Poland’s most eminent woman composer who is now full professor of composition at the University of Chicago. Ptaszynska is a percussionist herself and understands the nature of her instruments. The two marimbas at one point quoted some music from Chopin – so that the greatest Polish composer could be present in this concert as well.\n\nI have not forgotten, but left for later, two names of wonderful Polish musicians who are not connected to the Thornton School but instead are active in Los Angeles: Yolanta Tensor, soprano (who moved here from Chicago, interrupting a budding solo career) and Roza Kostrzewska-Yoder (who studied in Harvard and other prestigious institutions) and now devotes most of her time to teaching and nurturing young talents.\n\nMs. Tensor sang two songs, one by Grażyna Bacewicz and one by Szymon Laks (a Polish Jewish composer who survived Auschwitz and continued to write music). These “recital-like” musical gems required attention and reflection of the listeners who could enjoy the beautiful Polish poetry and the poignant settings. Ms. Kostrzewska – Yoder started the concert with a piece written for Dr. and Mrs. Wilk by Henryk Górecki during his visit here in 1997 and explained the significance of this miniature portraying both musical benefactors. Two of Ms. Kostrzewska-Yoder’s students played Polish music – 6 years old James Lee and 12 years old Daniel Lee. Both have won competitions for young musicians and it was easy to see why -they were excellent!\n\nExhibition of Polish Manuscripts\n\nThe concert was just one of the aspects of the program of this event (it was recorded and a CD will be available). As a musician, music student (doctoral program in piano at USC) and music teacher, I am delighted to find such a resource for Polish music as the Polish Music Center on USC campus. I did not base my decision to apply to this school on this fact, but rather on the excellence of the piano department. I am proud, as a Polish American, that the Center presents such high quality projects dedicated to Polish music and that I am involved in some of them (my previous appearance was at the International Conference on Polish Jewish Music in 1998).\n\nMy sincere hope is that more people in the Polish American community would take pride in their musical heritage and helped the Center in its activities. During the concert and the exhibition I saw the representatives of the Polish government, with Consul General Krzysztof Kasprzyk and Consul for Commercial Affairs, Boleslaw Meluch, as well as members of some Polish American organizations, such as the Polish American Historical Association, the Polish American Cultural Network, and the Helena Modjeska Club for Polish Arts and Culture.\n\nLet us all hope, for the benefit of all Poles, that more organizations will take pride in actively supporting the Center and its programs in the future."}, {"url": "https://www.prestomusic.com/classical/composers/7352--szeligowski", "page_content": "Tadeusz Szeligowski was a Polish composer, educator, lawyer and music organizer. His works include the operas The Rise of the Scholars, Krakatuk and Theodor Gentlemen, the ballets The Peacock and the Girl and Mazepa ballets, two violin concertos, chamber and choral works.\n\nAs a music teacher, Szeligowski was very well established in Vilnius, Lublin, Poznań and Warsaw. He was also a respected music writer who frequently wrote for journals and magazines specialized in music such as the Kurier Wileński, Tygodnik Wileński, Muzyka and the Kurier Poznański. His achievements include the creation of the Poznan´ Philharmonic, where he served as its first director between the years 1947-1949, and the founding of the Poznań Musical Spring, one of the most important festivals of contemporary music at the time.\n\nRead more at https://en.wikipedia.org/wiki/Tadeusz_Szeligowski"}]}