{"Gordon David Strachan is a Scottish football manager and former player.": [{"url": "https://www.thefamouspeople.com/profiles/gordon-david-strachan-1535.php", "page_content": "Before he professionally started playing football, he was offered a contract by Eddie Turnbull to play for a club, but his father opposed the decision by stating that the club did not cover sufficient expenses.\n\nGeorge David Strachan was born to Jim and Catherine in Muirhouse, Edinburgh. He started playing for Dundee at the age of 14. The following year, he lost vision in his right eye when a pen in his pocket accidentally poked his eye during a football match on the school playground.\n\nRecommended Lists:\n\nCareer\n\nAt the age of 18, he outplayed Alan Ball in a friendly match with Arsenal. His outstanding performance won him the seat of a regular player for the 1975-1976 season, which also happened to be the inaugural season for the Scottish Premier Division.\n\nHe became the team captain for the 1976-1977 First Division campaign, but he lost his position soon, after a drinking incident with Jimmy Johnstone.\n\nHe quit Dundee and signed a contract with Aberdeen in 1977. Poor form and injuries crippled the 1977-78 season for him. However, he was selected for the 1979 League Cup where the team recorded two wins at the Celtic Park. His brilliant performance on the field earned him the SFWA Footballer of the Year.\n\nIn 1980, he was awarded his first cap in the British Home Championship, against Northern Island. Two years later, he was instrumental in getting his home team to qualify for the FIFA World Cup in 1982.\n\nThe 1982-1983 seasons were the most successful runs for the club and he made his mark by striking four goals in a 5-1 victory with Dundee in the League Cup. His team then went on to win the European Cup Winners’ Cup. They also defeated Hamburg in the 1983 European Super Cup Final.\n\nIn the 1984-1985 season, he took four goals in a total of seven games and even though he did not participate in the 1985 FA Cup Final at Wembley, the team went on to win the opening ten league games in the 1985-1986 season.\n\nAfter accepting a contract by Ron Atkinson, he led the Leeds United Club to the Second Division title in the 1989-1990 season. They finished fourth overall, but managed to secure a place in the semi-finals of the League Cup.\n\nHe signed a two-year contract with Leeds and captained them to record a victory in the league title of 1991-1992. However, due to poor health and back problems, he started missing a number of games and thus, became unable to build on the success of Leeds Untied.\n\nOn April 10, 1993, despite his downfalls and tough seasons, he scored a hat-trick against the Blackburn Rovers and then moved to Coventry City to serve as an assistant to the manager, Ron Atkinson.\n\nContinue Reading Below\n\nHe coached the team and trained them and also appeared in the seasons 1994-1995 and 1995-1996. The club struggled at the start of the 1996-1997 season, which resulted in Atkinson being asked to step down from the managerial position.\n\nAfter Strachan was appointed as manager, he helped his team reach the quarter-finals of the FA Cup in 1997-1998.\n\nIn 2001, he was appointed as the manager of Premier League Southampton, succeeding Stuart Gray. Under his leadership, the Southampton team earned their place for the UEFA Cup.\n\nAfter a brief hiatus, he returned to manage the team, Celtic, on June 1, 2005. Although he had a very shaky start as a manager, the team eventually began to do well under his management and started winning tournaments.\n\nOn October 26, 2009, he was signed on as the manager for Middlesbrough. However, after a series of defeats, he voluntarily stepped down as the manager during the 2010-2011 season."}, {"url": "https://www.bbc.com/sport/football/21023913", "page_content": "Last updated on .From the section Football\n\nGordon Strachan has been confirmed as the new manager of Scotland.\n\nThe former Celtic and Middlesbrough boss replaces Craig Levein, who was sacked in November.\n\nStrachan has signed a contract that will cover the remainder of the current World Cup qualifying campaign and the Euro 2016 qualifiers.\n\n\"I'm very proud but also my family are proud. The time is right for me to be able to take a job like this,\" he said after his appointment was announced.\n\nMedia conference: Gordon Strachan unveiled as Scotland manager\n\n\"There'll be rough times but I hope there'll be good times too.\n\n\"Every club you go to there's always challenges but this is the first time the challenge is on behalf of a nation.\n\n\"If you can be successful you can make a nation happy and make a nation proud and that is the priority for me to be able to do that with help from other people.\n\n\"I have the experience, I like working with people, I like dealing with people and I like trying to make people better.\"\n\nThe 55-year-old has been out of management since leaving Boro in October 2010.\n\nCapped 50 times, Strachan featured in Scotland's 1982 and 1986 World Cup finals campaigns.\n\nAfter playing spells at Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, the winger moved into management with the Sky Blues in November 1996.\n\nGordon Strachan Began playing career at Dundee before joining Aberdeen in 1977\n\nWon two Premier Division titles, three Scottish Cups, European Cup Winners' Cup and European Super Cup with the Dons\n\nJoined Manchester United in 1984, winning FA Cup the following year\n\nEnjoyed six-year spell at Leeds, contributing to promotion and top flight title victory\n\nEnded playing career at Coventry and moved into management with same club, having almost five years in the job\n\nReached FA Cup final during three years as Southampton boss\n\nWon three SPL titles and made two Champions League last 16 appearances as Celtic manager after joining in 2005\n\nSpent year in charge of Middlesbrough\n\nAfter keeping Coventry in the Premier League for several seasons, they suffered relegation at the end of season 2000-01 and Strachan departed a few games into the following season.\n\nHe returned to the dugout when Southampton brought him in to replace Stuart Gray and the appointment helped Saints stave off relegation before they reached the FA Cup final in 2003.\n\nBut Strachan left the club the following year and took a break from football.\n\nHis move to Celtic in June 2005 followed Martin O'Neill's decision to leave Glasgow.\n\nStrachan recovered from a 5-0 Champions League qualifying defeat by Artmedia Bratislava in his opening match - a tie that finished 5-4 on aggregate - to win the Scottish Premier League title three years in succession.\n\nHe also led the side to two appearances in the last 16 of the Champions League, the club having never reached the knock-out stages prior to Strachan's arrival.\n\nHowever, Rangers won the SPL in 2009 and Strachan left Glasgow shortly after.\n\nA year in charge of Boro followed but, after missing out on promotion in 2010, a poor start to the season led to Strachan leaving the club by mutual consent.\n\nLevein's three-year spell in charge of Scotland came to an end after a poor start to the 2014 World Cup qualifying campaign.\n\nMedia conference - Stewart Regan\n\nHaving missed out on qualification to Euro 2012, the Scots began their pursuit of a place in next year's finals in Brazil with successive home draws against Serbia and Macedonia.\n\nScotland then lost from a winning position in Wales before defeat in Belgium consigned Levein's side to the bottom of their group.\n\nAfter Levein was sacked, Scotland Under-21 coach Billy Stark was placed in caretaker charge of the senior team for the friendly win in Luxembourg.\n\nStrachan's first match in charge will be the February friendly against Estonia at Pittodrie Stadium, the venue where he enjoyed success as an Aberdeen player.\n\n\"I really want the squad and the staff to give something back to the country and the fans who support us because the fans are probably more famous than the squad now,\" Strachan added.\n\n\"So what we want to try and do is to give back something and make them turn up for a major finals competition.\n\n\"If we work together as a group and a set of fans I know for a fact we'll be successful.\n\n\"What I know is that these guys, for all they might get criticised, are the best at what they do.\n\n\"They play for Scotland and we have to find a system that suits these players to win games of football.\""}, {"url": "https://www.bbc.co.uk/sport/football/52951616", "page_content": "Gordon Strachan's career began at Dundee in the mid-1970s and after successful spells with Aberdeen, Manchester United and Leeds United, he was still playing English top-flight football for Coventry at 40.\n\nHe put his longevity down to a diet of porridge, bananas and seaweed tablets, and relied on fitness, acupressure and afternoon naps to extend his playing days.\n\nHere Strachan has chosen his \"basically unbeatable\" XI of former club team-mates.\n\nGoalkeeper: Jim Leighton\n\nThanks to Sportscene, I've been watching some Aberdeen and Scotland games recently. When you look back you think: \"What a good goalkeeper Jim was, making big saves at the right times.\" He was making good hits by good players look simple, when they were bouncing in front of him. The only time he embarrassed himself was when he started running.\n\nCentre-backs: Paul McGrath, Willie Miller & Alex McLeish\n\nStrachan describes his former Manchester United team-mate Paul McGrath, plus Brian Robson and Norman Whiteside, as \"first-class people\"\n\nI couldn't leave Paul McGrath out. He is probably one of the best players I ever played with, considering he was injured and all the problems he had throughout his career. He was a truly magnificent football player. On top of that he was a great lad, always good fun, never a bad word about anybody.\n\nWith those three, the rest of the team could just go out and attack. Any one of them coming forward with the ball to make it eight attacking players with two left behind, I'd have no problems whatsoever. Miller and McLeish could have played for any team in Britain at the time. They just enjoyed defending.\n\nSix of Strachan's greatest XI are in this Aberdeen squad photo from 1983-84\n\nCentre-midfielders: Norman Whiteside, Gary McAllister, Bryan Robson\n\nBryan Robson is the best player I ever played with. He had everything. You could put him in any position. He could score goals and defend. Like Willie Miller, he was a fantastic captain who would put the players first. The only negative was if he asked you if you wanted to go for a night out - it would be three days on the go never leaving a pub!\n\nGary McAllister and I played together at Leeds. He was a wonderful footballer but Leeds made him into a player. A footballer can play sometimes in the conditions that suit them. Gary turned into a player - he could play anywhere, any time, any game, any condition.\n\nRemi Moses, Arnold Muhren, David Batty, Neil Simpson, Neale Cooper, it's unbelievable the players I played with. Dougie Bell was a fantastic player. But Norman Whiteside could score wonder goals, tackle, header. He wasn't the fastest but he was a powerful runner.\n\nStrachan appointed Mark McGhee and Gary McAllister to his coaching team when he was Scotland manager\n\nWide midfielders: Stuart Kennedy & Peter Weir\n\nIf it wasn't for Stuart, I wouldn't be where I was later in my career. Stuart gave us the width and pace and I did the intricate things. We worked well together. Stuart would be at right wing-back.\n\nStrikers: Mark Hughes & Mark McGhee\n\nMark Hughes used to drive you crazy when he was a kid because you'd hit the ball up to him and he'd keep touching it. If you went to support him, you'd run by him because he'd have so many touches. But then he got older and got better and better and he could do anything.\n\nMark McGhee did something every game that was outrageous. He played in every game, he took knocks, he made runs, he held the ball up, he could jump, he was never unfit. Sir Alex [Ferguson, former Aberdeen and Manchester United manager] described him as one of the most important people in that [Aberdeen] team. He and Steve Archibald were absolutely magnificent."}, {"url": "https://pantheon.world/profile/person/Gordon_Strachan/", "page_content": "Gordon Strachan\n\nGordon David Strachan ( born 9 February 1957) is a Scottish former football coach and player. He played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Gordon Strachan has received more than 1,389,848 page views. His biography is available in 35 different languages on Wikipedia (down from 36 in 2019) . Gordon Strachan is the 2,689th most popular soccer player (down from 2,641st in 2019), the 3,710th most popular biography from United Kingdom (down from 3,507th in 2019) and the 112th most popular British Soccer Player."}, {"url": "https://peoplepill.com/people/gordon-strachan/", "page_content": "Gordon David Strachan ( or ; born 9 February 1957) is a Scottish football coach and former player. Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has since managed Coventry City, Southampton, Celtic, Middlesbrough and Scotland.\n\nIn club football, he played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football Strachan earned 50 caps, scoring five goals and playing in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nA right-sided midfielder, Strachan made his senior debut in 1974 with Dundee before moving on within Scotland, to spend seven seasons at Aberdeen. He first played for the Scotland national team in 1980. While at Aberdeen Strachan won multiple domestic league and cup honours in the early 1980s, as well as the 1982–83 European Cup Winners' Cup and 1983 European Super Cup. Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United. He spending the next seven seasons as club captain at Leeds, winning the 1989–90 Second Division and 1991–92 First Division league titles. He played his last game for Scotland in 1992. He moved to Coventry in 1995 for a final three seasons, as a player-coach.\n\nStrachan became full-time manager of Coventry when the incumbent Ron Atkinson was appointed as director of football. After five years as Coventry manager, he was sacked in 2001 after the club was relegated from the top-flight for the first time in 34 years. He returned to the Premier League as Southampton manager and guided the \"Saints\" to the 2003 FA Cup Final, where they lost 1–0 to Arsenal. Strachan resigned from Southampton in 2004 and took a 16-month break from management. He returned to Scotland to become manager of Celtic, where he achieved three successive league titles and other domestic cup wins. Strachan left Celtic in May 2009 after failing to win a fourth title. He then became manager of Middlesbrough in the English Championship, but left the club after an unsuccessful 12 months in the job. Strachan then managed the Scotland national team for five years, but was unable to secure qualification for a major tournament.\n\nStrachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds. He was also named Manager of the Year in Scotland several times by writers and players while at Celtic. In 2007, Strachan was inducted into the Scottish Football Hall of Fame. He is the father of Craig Strachan and Gavin Strachan, also footballers.\n\nClub career\n\nBorn and raised in Muirhouse, Edinburgh, Strachan supported Hibernian as a boy. His father, Jim, worked as a scaffolder, and his mother, Catherine, worked at a whisky distillery. At age 15, he damaged his vision playing football on the school playground when a pen in his pocket became lodged in his right eye; the pen came within \"a thousandth of an inch\" of permanently costing him the vision in his eye. He was offered a contract by Hibernian manager Eddie Turnbull, but his father decided against the offer after stating the club did not pay sufficient expenses for footwear.\n\nDundee\n\nStrachan began his career with Dundee, having decided to sign with the Scottish club at age 14. In joining the club, he rejected an approach from Manchester United, reasoning he had a better chance to establish himself in the first team at Dens Park. His natural talent was immediately apparent and he quickly earned a reputation as an outstanding player in the second team, twice winning the Scottish Reserve Player of the Year Award. He made his mark as an 18-year-old when he outplayed Alan Ball in a friendly with Arsenal in August 1975; The Sunday Post compared him to a young Billy Bremner. Strachan became a regular player in the 1975–76 season, the inaugural season of the Scottish Premier Division, featuring in 17 of the club's 36 league matches. However David White's \"Dee\" were relegated on the last day of the season after rivals Dundee United edged ahead on goal average with an unlikely draw with champions Rangers.\n\nNew boss Tommy Gemmell handed 19-year-old Strachan the captaincy for the 1976–77 First Division campaign, and he remains the youngest player to have captained Dundee. However, the club failed to shine in the lower divisions, and Strachan lost his first team place early in the 1977–78 season following a drinking session with Jimmy Johnstone; Gemmell was also concerned that Strachan was \"getting kicked a lot\" after opposition teams worked out that the way to stop Dundee was to take out their playmaker. Strachan decided to leave Dundee as the club seemed unlikely to win back their top-flight status; the Dundee chairman was also keen on cashing in his most prized asset, and told Gemmell that \"we need £50,000 by Friday or the banks are closing the gate\". His last match for Dundee was on 26 October 1977 in a 6–0 defeat in the League Cup to Queen of the South at Palmerston Park, which Strachan described in his autobiography as \"embarrassing\".\n\nAberdeen\n\nStrachan was signed by Aberdeen manager Billy McNeill in November 1977 for a fee of £50,000 plus Jim Shirra. Poor form and niggling injuries made 1977–78 a poor season for Strachan, though the \"Dons\" went on to finish second in the Scottish Premier Division. He was not picked for the 1978 Scottish Cup Final defeat to Rangers.\n\nMcNeill left the Pittodrie Stadium for Celtic in summer 1978, and Alex Ferguson was appointed as the new manager. Strachan played at Hampden Park in the 1979 League Cup defeat to Rangers, and set up Duncan Davidson for the game's opening goal. Though the 1978–79 campaign was a disappointment, Aberdeen went on to win the league title in 1979–80 after closing a ten-point deficit over Celtic with a late run that included two victories at Celtic Park. They again reached the League Cup Final, beating both Old Firm sides en route, where they lost 3–0 to Dundee United at Dens Park. At the end of the season, Strachan was elected SFWA Footballer of the Year. After gaining assurance Alex McLeish would also stay with the club, Strachan signed a new contract to keep him at Pittodrie until 1984.\n\nThe \"Reds\" could only manage a second-place finish in 1980–81, as Celtic regained the league title. They exited the European Cup in the second round with defeat to eventual champions Liverpool; manager Bob Paisley said Strachan would become \"Britain's first £2 million player\", in what was a (successful) early attempt at mind games. He missed the second half of the season with a muscle tear in his stomach. With fit-again Strachan on the right flank – supported by full-back Stuart Kennedy – and record signing Peter Weir on the left-flank, Aberdeen mounted a genuine title challenge in 1981–82, but had to settle for second place to Celtic. They did though lift the Scottish Cup with a 4–1 extra-time victory over Rangers, with Strachan contributing one assist and one goal.\n\nThe 1982–83 campaign was the greatest in the history of the club, and Strachan made his mark early on with four goals in a 5–1 victory at former club Dundee in the League Cup. Despite only finishing third in the league (albeit only one point behind champions and New Firm rivals Dundee United) and exiting the League Cup in the quarter-finals, Aberdeen won the Scottish Cup and the European Cup Winners' Cup. The club's European success came with a 2–1 after-extra-time victory over Spanish giants Real Madrid at Ullevi in Gothenburg. The Scottish Cup came with a 1–0 win over Rangers. The \"Dons\" continued their success by delivering the league title and Scottish Cup in 1983–84, with Strachan setting up Mark McGhee for the winning goal in the cup final win over Celtic. This completed a unique treble, as they defeated Hamburger SV in the 1983 European Super Cup.\n\nManchester United\n\nIn August 1984, Manchester United spent £500,000 to take Strachan to Old Trafford. However, because Strachan had previously signed a pre-contract agreement with Bundesliga side 1. FC Köln, United paid £75,000 compensation to resolve the row – teammate Mark McGhee had also signed a contract with Hamburger SV on the understanding that Strachan would also be playing in Germany. Strachan opened the 1984–85 campaign with four goals in seven matches, though the \"Red Devils\" could only manage a fourth-place finish in the First Division. He featured at Wembley Stadium in the 1985 FA Cup Final, as United ran out 1–0 winners over Everton; his lung-bursting run off-the-ball helped Norman Whiteside to find the space for his extra-time winner.\n\nAfter winning their opening ten league matches of the 1985–86 season, United had to cope without Strachan, who was sidelined for much of the season with injury. They proved unable to cope with their injuries – another key player facing extended time in the treatment room was Bryan Robson – and limped to another fourth-place finish. Atkinson was replaced by Alex Ferguson in November 1986, and Strachan mocked sobbing as he told his teammates, \"I never thought he'd follow me this far south!\" After his arrival, Ferguson speculated that no longer being the star player had negatively affected Strachan's form. United finished a disappointing 11th in 1986–87, before rising to second place in 1987–88. Strachan's form was again patchy in 1988–89, as United slipped back down to 11th.\n\nLeeds United\n\nIn March 1989, Sheffield Wednesday manager Ron Atkinson had a bid of £200,000 accepted by Manchester United, and he offered Strachan a contract paying more money than anyone in the club's history. However likely a move to Sheffield seemed, Leeds United manager Howard Wilkinson matched the offer and convinced Strachan to drop down into the Second Division. He quickly became a popular figure at Elland Road, earning comparisons to former favourites Bobby Collins and Johnny Giles. Signing a two-year contract, he was awarded with the captain's armband. He formed an unlikely midfield partnership with hard-man Vinnie Jones and led the club to the Second Division title in 1989–90.\n\nWith the \"Whites\" now in the First Division, Wilkinson secured a midfield quartet of Strachan, Gary McAllister, David Batty and Gary Speed. They achieved a commendable fourth-place finish in 1990–91, and also reached the semi-finals of the League Cup. Strachan was voted FWA Footballer of the Year for his performances during the campaign, becoming the first player to win the award both in Scotland and in England.\n\nStrachan signed a new two-year contract, before captaining Leeds to the league title in 1991–92. In so doing, he denied former boss Alex Ferguson and Leeds' hated rivals Manchester United the title. However, Strachan (now nearing age 35) was beginning to feel the effects of his sciatica and missed a number of matches due to his bad back. Following the club's success, Strachan was appointed an OBE for his services to sport.\n\nHowever, Leeds were unable to build on their success, and finished the 1992–93 season down in 17th place in what was newly re-branded as the Premier League. Strachan continued to impress though, and was given the club's Player of the Year award. He scored a hat-trick against Blackburn Rovers on 10 April 1993. This was his second hat-trick for Leeds, the first having come in September 1989 when he found the net three times in a 4–0 win over promotion rivals Swindon Town in the Second Division at Elland Road.\n\nStrachan managed 37 starts in 1993–94, and Leeds rose to fifth. He was rarely selected in the 1994–95 season, which would prove to be the end of his spell at Elland Road, where he had spent six years.\n\nCoventry City\n\nIn March 1995, Strachan moved to Coventry City to work as assistant manager under new manager Ron Atkinson, the man who had brought him south of the border to Manchester United 11 years earlier. It was also agreed he would replace Atkinson as manager in summer 1997. Strachan coached the team and led training sessions while learning the finer points of management from Atkinson. He also took to the field at Highfield Road, playing 26 Premier League matches for the Sky Blues over the next two years before finally hanging up his boots in his 40th year. Atkinson signed Aberdeen midfielder Eoin Jess in 1996 purely on the basis of Strachan's recommendation. However, Isaías left the club after falling-out with Strachan. Coventry signed Gary McAllister for £3 million on wages of £20,000 per week; the deal was done by McAllister's former teammate and friend Strachan, while Atkinson was largely opposed to the deal. The club struggled at the start of the 1996–97 campaign, and the club's board of directors asked Atkinson to step aside in November 1996, some months earlier than first agreed, and Strachan was appointed manager.\n\nInternational career\n\nStrachan won his first cap for Scotland on 16 May 1980, in a British Home Championship defeat to Northern Ireland at Windsor Park. Strachan helped Scotland qualify for the 1982 FIFA World Cup and scored a crucial goal in qualifying by scoring the only goal against Sweden at the Råsunda Stadium in Stockholm. He did not feature in the 1982 British Home Championship, as Jock Stein wanted to rest him for the World Cup, held in Spain. The Scots cruised to a 5–2 victory over New Zealand at La Rosaleda Stadium, Málaga; Strachan was named Man of the Match. Scotland then lost 4–1 to a world-class Brazil side at the Estadio Benito Villamarín, Seville. In the third match, a 2–2 draw with the Soviet Union back in Málaga saw Scotland exit the tournament on goal difference.\n\nScotland also qualified for the 1986 FIFA World Cup. However, shortly after the draw with Wales at Ninian Park on 10 September 1985, Jock Stein died of a heart attack, and his assistant Alex Ferguson took charge for the World Cup campaign. To complete their qualification, they had to beat Australia in a play-off. Strachan played in the first leg at Hampden Park, but did not travel to Melbourne for the second leg. The Scots faced a tough draw in Mexico and lost their opening match 1–0 at the Estadio Neza 86 in the Mexico City suburb of Nezahualcóyotl to the unseeded – but highly fancied – Denmark. Strachan then scored in a 2–1 defeat to West Germany at the Estadio Corregidora in Queretaro; his goal celebration was memorable, as he tried to climb the advertising hoardings, but was thwarted by his short stature and so merely rested his leg on the hoarding before he was joined by his teammates. In the third and final group match back in Nezahualcóyotl, Scotland drew 0–0 with Uruguay despite their opponents going down to ten men after less than a minute of play when José Batista attempted to take Strachan out of the game.\n\nStrachan fell out of the first team picture under Andy Roxburgh, and was omitted from the squad for the 1990 World Cup. Nevertheless, he enjoyed a national team revival between 1990 and 1992, and captained his country in qualification for UEFA Euro 1992. However, he did not travel to Sweden as a member of the squad, as he announced his retirement due to long-term back troubles. He won 50 full caps, and scored five international goals.\n\nManagerial career\n\nCoventry City\n\nWhen Ron Atkinson became Coventry City's director of football in November 1996, Strachan was promoted to the manager's seat. He appointed Alex Miller as his assistant. After an upturn in results, Strachan was named Manager of the Month in December. However, 1 win in 12 matches in the New Year left the \"Sky Blues\" in the relegation zone. Late wins over Liverpool, Chelsea and Tottenham Hotspur saved their season though, and relegation was avoided by a one-point margin. Strachan played in the win over Chelsea at Highfield Road at age 40, in what was at the time a record age for an outfield player in the Premier League.\n\nStrachan signed Swedish goalkeeper Magnus Hedman and defender Roland Nilsson, Dutch midfielder George Boateng, and Romanian striker Viorel Moldovan – all of whom would win international caps. Coventry rose to 11th place in 1997–98, and also reached the quarter-finals of the 1997–98 FA Cup. After Miller left the club, Strachan replaced him with Garry Pendrey, who would go on to spend many years as his assistant at various clubs. Strachan was again named Manager of the Month in February 1998.\n\nThe club finished 15th in 1998–99 and 14th in 1999–2000, as Strachan spent £6 million on Irish striker Robbie Keane and £5 million on Moroccans Mustapha Hadji and Youssef Chippo, while selling Dion Dublin to Midlands rivals Aston Villa. Coventry were relegated at the end of the 2000–01 season, making Strachan unpopular with fans. New signing Craig Bellamy proved disappointing, while Robbie Keane was sold and Gary McAllister departed for Liverpool. Strachan attempted to launch a promotion campaign by signing striker Lee Hughes, but in the face of increasing supporter unrest, he was sacked five matches into the 2001–02 First Division campaign. His replacement, Roland Nilsson, took the club to an 11th-place finish.\n\nSouthampton\n\nStrachan returned to management within weeks, taking the manager's job at Premier League Southampton, who had sacked manager Stuart Gray after a terrible start to their first season at the new St Mary's Stadium. Most pundits had already written off their survival chances by the time of Strachan's appointment in October 2001, but he turned round their fortunes and they finished 11th in the Premier League. The Saints progressed further in 2002–03 when they finished eighth and reached the FA Cup Final, where they lost 1–0 to Arsenal. As Arsenal had already qualified for the 2003–04 UEFA Champions League, Southampton won a place in the UEFA Cup.\n\nIn February 2004, Strachan announced his resignation as Southampton manager after his decision not to stay on at the club in the summer was leaked to the press. He wanted to take a break from football, but was forced to resign earlier than initially intended due to the speculation surrounding his and the club's future following the leak.\n\nCeltic\n\nAfter a 16-month break, Strachan returned to management on 1 June 2005, when he succeeded Martin O'Neill as manager of Celtic in the Scottish Premier League (SPL). For 2005–06, his stated aim was to regain the SPL title from rivals Rangers. He had an embarrassing start to his campaign as Celtic manager, losing 5–0 to Slovakian champions Artmedia Bratislava on 27 July 2005 and three days later, drawing 4–4 with Motherwell in his first SPL match in charge of the Glasgow club. The loss against Artmedia meant Celtic suffered an early exit from European competition, despite winning the return match 4–0. After this disastrous start, Celtic started to improve under Strachan. A low-point was the shock defeat in the third round of the Scottish Cup to First Division Clyde on 8 January 2006. However, the following month his team made history when they defeated Dunfermline Athletic 8–1, a record victory margin for the SPL at the time. Strachan's first season was ultimately successful as he coached Celtic to victory in the League Cup and, on 5 April 2006, his side clinched the SPL title in record time and with six matches remaining. Reflecting this achievement, Strachan was voted Manager of the Year by the Scottish Football Writers' Association eight days later.\n\nStrachan ahead of Celtic's Champions League qualifier against Spartak Moscow, August 2007\n\nThe following year, Strachan restructured the team and made a series of signings, bringing in players such as Hibernian's Derek Riordan; Chelsea's Jiří Jarošík; Kenny Miller and Lee Naylor from Wolverhampton Wanderers; Jan Vennegoor of Hesselink from PSV; Thomas Gravesen from Real Madrid; and Paul Hartley and Steven Pressley from Hearts. Celtic flourished and by mid-January 2007 held a 17-point lead in the SPL table. UEFA Champions League football again returned to Celtic Park, the team having automatically qualified for the group stages and drawn alongside Benfica, Copenhagen and Manchester United. Home victories against all three Group F members saw the team progress to the round of 16 of the Champions League for the first time since the competition was re-formatted in 1993. Celtic lost the tie, against eventual winners Milan in extra time, missing out on a place in the quarter-finals. On 22 April 2007, Strachan guided Celtic to their 41st league championship, and second in succession. A 2–1 victory against Kilmarnock left Celtic 13 points clear of Rangers with four matches remaining. Later that day, Strachan was recognised as the inaugural PFA Scotland Manager of the Year for 2007. Celtic went on to win the Scottish Cup, beating Dunfermline Athletic.\n\nIn the 2007–08 season, Strachan led Celtic into the round of 16 of the UEFA Champions League again after defeating Milan, Benfica and Shakhtar Donetsk. However, by April, there was significant criticism from the press and the fans after a 1–0 loss to Aberdeen in the Scottish Cup quarter-final and a 1–0 loss to ten-man Motherwell in the SPL. However, after defeating Rangers twice at home, on 22 May 2008 Strachan became only the third ever Celtic manager to guide the club to three consecutive Scottish league titles.\n\nDespite winning the League Cup after extra time against Rangers, after failing to lead Celtic to another league title in the 2008–09 season, he resigned as manager on 25 May 2009.\n\nMiddlesbrough\n\nStrachan signed a four-year contract with English Championship team Middlesbrough on 26 October 2009, succeeding Gareth Southgate. He had been linked with the Middlesbrough manager's job 15 years earlier, when still a Leeds United player. His first match in charge was on 31 October, a 1–0 defeat to Plymouth Argyle, with Adam Johnson missing a penalty. On 5 December, Middlesbrough won their first match under Strachan, 5–1 away to Queens Park Rangers. After a poor run of results, including a 3–0 loss at home to Blackpool and a 1–0 loss at home to Cardiff City, Strachan earned his first home win after his team beat Scunthorpe United 3–0.\n\nAfter a poor start to the 2010–11 season meant Middlesbrough were down in 20th place, Strachan left the club by mutual consent on 18 October. He voluntarily tore up his contract and left without compensation.\n\nScotland\n\nStrachan was appointed manager of the Scotland national team on 15 January 2013, succeeding Craig Levein. His first match in charge was at Pittodrie Stadium in a friendly match against Estonia on 6 February. The game ended 1–0 to Scotland, with Charlie Mulgrew getting his first international goal. Scotland suffered defeats to Wales and Serbia in Strachan's first two competitive matches, which ended the Scots' slim chances of qualification for the 2014 World Cup. After this, Scotland had an upturn in form, winning both matches against Croatia and away against Macedonia. Scotland finished fourth in qualifying Group A.\n\nIn Euro 2016 qualifying, Scotland appeared to have a better chance of qualification as the finals tournament was expanded from 16 teams to 24, but were drawn in a tough group with Germany, Poland and the Republic of Ireland. After losing their opening match in Germany, Scotland recorded home wins against Georgia, Ireland and Gibraltar, and away draws against Poland and Ireland. In their following match, Scotland produced an \"insipid\" performance, as they lost 1–0 in Georgia. A home defeat by Germany left Scotland four points behind third-placed Ireland, with two matches to play. In the penultimate matches of the group, Scotland needed to beat Poland, or hope that Ireland would lose to Germany. Scotland came from behind to lead 2–1 in their match, but Ireland had scored the only goal of their match, leaving the Scots needing a win to stay alive. A late scrambled goal by Robert Lewandowski gave Poland a draw that eliminated Scotland from contention. Strachan bemoaned what he perceived to be bad luck. After a win against Gibraltar in the last qualifier, Strachan agreed to a new contract with the Scottish Football Association. After failing to qualify for the 2018 FIFA World Cup, Strachan resigned from his position on 12 October 2017.\n\nManagement style\n\nTypically playing a traditional 4–4–2 formation, and very occasionally 4–5–1, Strachan is widely known for his rigorous management style, and states that he watches video replays of his club's matches two, sometimes three, times. He also places great emphasis on player health and fitness, forbidding his players to drink alcohol excessively or regularly, and often giving dietary advice to his players, attributing his own longevity as a player to a strict and somewhat unusual diet involving seaweed. Players such as Scotland international Gary Caldwell have attributed their success at Celtic to lifestyle changes enforced by Strachan.\n\nRenowned for his deadpan humour in media interviews, quotes attributed to Strachan have become part of popular football culture.\n\nEnmity with Alex Ferguson\n\nDespite playing for Alex Ferguson at two clubs, the pair had an ongoing public feud during Strachan's managerial career. In his 1999 autobiography, the former Manchester United manager said, \"I decided this man could not be trusted an inch – I would not want to expose my back to him in a hurry.\" In his own 2006 autobiography, in response to Ferguson's comments, Strachan said he was \"surprised and disappointed\". The rivalry dates from Strachan's time playing under Ferguson, first at Aberdeen and later Manchester United. In August 2006, after his Celtic team was drawn to play Ferguson's Manchester United in the Champions League, Strachan said that there was no longer any enmity between the two managers.\n\nOther work\n\nStrachan has analysed football matches for the media, including alongside Adrian Chiles on BBC Sport's Match of the Day 2. He has worked as a regular pundit for ITV's coverage of the FA Cup and the UEFA Champions League. During the 2014 World Cup, he worked as a pundit for ITV. In April 2019, Strachan apologised for remarks he made during The Debate on Sky Sports. Following the release of convicted sex offender Adam Johnson from prison, Strachan had appeared to suggest that abusing Johnson for that offence was comparable with racial abuse.\n\nFor the 2006 World Cup, Strachan was appointed as the official FIFA Ambassador for Scotland, joining 50 others in fundraising for SOS Children's Villages, the official charity of the tournament.\n\nStrachan and his two sons started their own football school in the Coventry area in August 2009.\n\nIn July 2019, Strachan was appointed to a technical director position with Dundee.\n\nPersonal life\n\nStrachan married Lesley Scott in 1977; George Mackie was his best man. Together, they had three children: Craig and Gavin Strachan, also footballers, and Gemma Strachan.\n\nCareer statistics\n\nClub\n\nClub performance League Cup League Cup Continental Total Season Club League Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Scotland League Scottish Cup League Cup Europe Total 1974–75 Dundee Division One 1 0 1975–76 Premier Division 23 6 1976–77 Division One 36 7 1977–78 Division One 9 0 1977–78 Aberdeen Premier Division 12 1 4 0 0 0 0 0 16 1 1978–79 31 5 4 0 8 0 3 1 46 6 1979–80 33 10 5 1 11 4 2 0 51 15 1980–81 20 6 0 0 6 3 4 0 30 9 1981–82 30 7 6 4 8 6 6 3 50 20 1982–83 32 12 3 0 7 7 10 1 52 20 1983–84 25 13 7 2 6 0 9 3 47 18 England League FA Cup League Cup Europe Total 1984–85 Manchester United First Division 41 15 7 2 2 0 6 2 56 19 1985–86 28 5 5 0 1 0 0 0 34 5 1986–87 34 4 2 0 2 0 0 0 38 4 1987–88 36 8 3 0 5 1 0 0 44 9 1988–89 21 1 6 0 3 0 0 0 30 1 1988–89 Leeds United Second Division 11 3 0 0 0 0 0 0 11 3 1989–90 46 16 1 0 2 1 0 0 49 17 1990–91 First Division 34 7 6 1 7 1 0 0 47 9 1991–92 36 4 0 0 4 1 0 0 40 5 1992–93 Premier League 31 4 4 0 3 1 5 1 43 6 1993–94 33 3 3 1 2 0 0 0 38 4 1994–95 6 0 0 0 1 0 0 0 7 0 1994–95 Coventry City Premier League 5 0 1995–96 12 0 1996–97 9 0 Total Scotland 252 68 England 383 70 Career total 635 138\n\nInternational appearances\n\nAs of 29 October 2018\n\nNational team Year Apps Goals Scotland 1980 7 1 1981 2 0 1982 8 0 1983 9 1 1984 2 0 1985 5 0 1986 6 2 1987 2 0 1989 2 0 1991 5 1 1992 2 0 Total 50 5\n\nInternational goals\n\nAs of 29 October 2018\n\nNo. Date Venue Cap Opponent Score Result Competition 1 10 September 1980 Råsunda Stadium, Stockholm 6 Sweden 1–0 1–0 1982 FIFA World Cup qualification 2 12 June 1983 Empire Stadium, Vancouver 22 Canada 1–0 2–0 Friendly match 3 26 March 1986 Hampden Park, Glasgow 34 Romania 1–0 3–0 Friendly match 4 8 June 1986 Estadio La Corregidora, Queretaro 36 West Germany 1–0 1–2 1986 FIFA World Cup 5 1 May 1991 Stadio Olimpico, Serravalle 46 San Marino 1–0 2–0 UEFA Euro 1992 qualifying\n\nManagerial record\n\nAs of 8 October 2017 (competitive club matches and all international matches)\n\nTeam From To Record G W D L Win % Coventry City 5 November 1996 10 September 2001 215 70 56 89 0 32.56 Southampton 22 October 2001 13 February 2004 110 39 32 39 0 35.45 Celtic 1 June 2005 25 May 2009 182 122 28 32 0 67.03 Middlesbrough 26 October 2009 18 October 2010 46 13 13 20 0 28.26 Scotland 15 January 2013 12 October 2017 40 19 9 12 0 47.50 Total 593 263 138 192 0 44.35\n\nHonours\n\nPlayer\n\nAberdeen\n\nScottish Premier Division: 1979–80, 1983–84\n\nScottish Cup: 1981–82, 1982–83, 1983–84\n\nEuropean Cup Winners' Cup: 1982–83\n\nEuropean Super Cup: 1983\n\nManchester United\n\nFA Cup: 1984–85\n\nLeeds United\n\nFootball League Second Division: 1989–90\n\nFootball League First Division: 1991–92\n\nFA Charity Shield: 1992\n\nIndividual\n\nIOC European Footballer of the Season: 1982–83\n\nSFWA Footballer of the Year: 1979–80\n\nPFA Team of the Year Second Division: 1989–90\n\nPFA Team of the Year First Division: 1990–91\n\nFWA Footballer of the Year: 1990–91\n\nScotland national football team roll of honour: 1992\n\nLeeds United Player of the Year: 1993\n\nPFA Merit Award: 1995\n\nEnglish Football Hall of Fame inductee: 2016\n\nManager\n\nSouthampton\n\nFA Cup runner-up: 2002–03\n\nCeltic\n\nScottish Premier League: 2005–06, 2006–07, 2007–08\n\nScottish Cup: 2006–07\n\nScottish League Cup: 2005–06, 2008–09\n\nIndividual"}, {"url": "https://www.goodreads.com/author/show/16906.Gordon_Strachan", "page_content": "Gordon Strachan\n\nGenre\n\nGordon David Strachan OBE (pronounced /ˈstræxən/; born 9 February 1957 in Edinburgh) is a Scottish football manager and former player.\n\n\n\nAs a footballer, he played for Dundee, Aberdeen, Manchester United, Leeds United and finally Coventry City.\n\n\n\nHe also won 50 international caps for Scotland and is a member of the Scotland Football Hall of Fame. Strachan was an aggressive, skilful, right-sided midfield player. He is the father of Craig Strachan and Gavin Strachan, also footballers.\n\n\n\nHe was manager of Celtic from 1 June 2005 until 25 May 2009, when he announced his resignation. At Celtic, he won the Scottish Premier League title in three of his four seasons in charge. Earlier in his managerial career he had spells with Coventry City and then Southa\n\nGordon David Strachan OBE (pronounced /ˈstræxən/; born 9 February 1957 in Edinburgh) is a Scottish football manager and former player.\n\n\n\nAs a footballer, he played for Dundee, Aberdeen, Manchester United, Leeds United and finally Coventry City.\n\n\n\nHe also won 50 international caps for Scotland and is a member of the Scotland Football Hall of Fame. Strachan was an aggressive, skilful, right-sided midfield player. He is the father of Craig Strachan and Gavin Strachan, also footballers.\n\n\n\nHe was manager of Celtic from 1 June 2005 until 25 May 2009, when he announced his resignation. At Celtic, he won the Scottish Premier League title in three of his four seasons in charge. Earlier in his managerial career he had spells with Coventry City and then Southampton in England."}, {"url": "https://www.bbc.co.uk/sport/football/58165761", "page_content": "Last updated on .From the section Celtic\n\nGordon Strachan managed Celtic between 2005 and 2009\n\nGordon Strachan will re-join Celtic for a \"three-month consultancy project\" - but will continue as technical director at Dundee.\n\nStrachan - who managed Celtic between 2005 and 2009 - will have a remit that will include the academy, 'B' team, and the women's side \"with a view to providing recommendations\".\n\nThe former Scotland manager will not be working in a director of football role.\n\n\"I am really looking forward to returning,\" the 64-year-old said.\n\n\"The development of young players is a real passion for me and I will do anything I can to support the club in these areas.\n\n\"I also look forward to continuing my work at Dundee, where I have established a great working relationship and close bond with the manager, managing director, staff and coaches.\"\n\nStrachan had been linked with a return to Celtic in recent months and is a close confidant of owner Dermot Desmond.\n\nHe will report to chief executive Dominic McKay as part of \"wider work ongoing across the club\".\n\n\"Like all high performance environments we never stand still and always seek development and improvement,\" said McKay.\n\n\"I look forward to working with Gordon, utilising the extensive expertise and knowledge he has to the benefit of the club\".\n\nIn a statement of their own, Dundee said they had been in constant communication with Celtic and Strachan throughout and reiterated that the move would \"not affect his role\" at Dens."}, {"url": "https://football-speakers.com/football-speaker/gordon-strachan", "page_content": "Gordon Strachan OBE is a Scottish football manager and former player. Strachan was the manager of the Scotland national team. Strachan played for Dundee , Aberdeen , Manchester United , Leeds United and Coventry City , as well as the Scotland national team.\n\nHe has managed Coventry City , Southampton , Celtic and Middlesbrough . In club football, he played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football, Strachan earned 50 caps, scoring five goals and playing in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nA right-sided midfielder, Strachan made his senior debut in 1974 with Dundee before moving on within Scotland, to spend seven seasons at Aberdeen. He first played for the Scotland national team in 1980. Whilst at Aberdeen, Strachan won multiple domestic league and cup honours in the early 1980s, as well as the 1982–83 European Cup Winners' Cup and 1983 European Super Cup . Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United , before spending the next seven seasons as club captain at Leeds, winning the 1989–90 Second Division and 1991–92 First Division league titles.\n\nHe played his last game for Scotland in 1992 while still at Leeds, and then moved to Coventry in 1995 for a final three seasons, as a player-coach. Strachan became full-time manager of Coventry when the incumbent Ron Atkinson was appointed as Director of Football . After five years in the job, he was sacked in 2001, when Coventry were relegated from the top-flight for the first time in 34 years. However, he immediately returned to the Premier League with Southampton and guided the \"Saints\" to the 2003 FA Cup Final – where they lost 1–0 to Arsenal.\n\nStrachan resigned from Southampton in 2004 and took a 16-month break from management before returning to Scotland to become manager of Celtic in the Scottish Premier League . With Celtic he achieved three successive league titles and other domestic cup wins, before resigning in May 2009 after failing to win a fourth title. Strachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds."}, {"url": "https://www.bbc.com/sport/football/19555877", "page_content": "Last updated on .From the section Football\n\nFormer Celtic and Middlesbrough boss Gordon Strachan has told BBC Scotland he turned down the opportunity to be an international manager.\n\nThe Scot said the offer came \"not in this country, but somewhere else\".\n\nStrachan remains involved in coaching, as well as working as a television pundit, and is open to offers of work.\n\nGordon Strachan Began playing career at Dundee and joined Aberdeen in 1977\n\nWon four domestic and two European trophies at Pittodrie\n\nMoved to Manchester United, winning FA Cup in 1985\n\nWon top flight title with Leeds United before ending playing career with Coventry City\n\nWon 50 Scotland caps and scored five international goals over a 12-year period\n\nMoved into management with Coventry and also had spell in charge of Southampton before becoming Celtic boss\n\nWon six trophies, including three league titles, at Celtic\n\nWas most recently in management with Middlesbrough\n\n\"If somebody feels my talents are good enough to help their team - coaching, director of football, management - then I'll look at it,\" he said.\n\n\"Someday, somewhere there'll be a job that pops up. I'm quite happy doing what I'm doing just now.\"\n\nStrachan watched Scotland's 0-0 draw with Serbia on Saturday and defended his country and coach Craig Levein after the players were booed at full-time.\n\n\"I travel round Britain watching football games. If the home team doesn't win, everybody boos,\" he added.\n\n\"That's nothing new so I don't know why we're making a big deal about 50, 60 people shouting or booing. It happens everywhere.\n\n\"In international football now, there's very few chances made because there's not many crosses going into the box, it's all built up.\n\n\"Scotland made four or five chances. If they take one, it's a terrific performance. It's called 'controlled', it's called 'defensively great'.\n\n\"I played in many World Cups where we didn't play as well as that and scraped through and it was hailed as a 'great victory'. No it wasn't, we were a wee bit lucky on the night.\n\n\"I agree with Craig to a certain extent, there is a mass hysteria but that's Scotland. We're hysterical about anything, that's the way we are as people. Craig knows that, it comes with the territory.\n\n\"All you have to do as Scotland manager, or any manager, is win the game of football.\""}, {"url": "https://www.thescottishsun.co.uk/sport/football/7225758/what-happened-strachan-scotland-manager/", "page_content": "OH MY GORD\n\nTHE journey to FINALLY end 23 years of tournament-less football has been a long one for Scotland.\n\nThere have been some highs but even more lows.\n\n3 Former Scotland boss Gordon Strachan\n\n3 Current Scotland boss Steve Clarke\n\nRightly, there has been some praise handed out to Steve Clarke’s predecessors for the job they did in getting the foundations right.\n\nOne of those men is Gordon Strachan, who so nearly secured qualification during his tenure.\n\nBETTING SPECIAL - BACK SCOTLAND AT HUGE 60/1 ODDS BOOST TO WIN OPENING MATCH AGAINST CZECH REPUBLIC\n\nWhen was Gordon Strachan in charge of Scotland?\n\nStrachan took the national team job following Craig Levein’s departure in January 2013.\n\nHe had previously been Middlesbrough boss for a year.\n\nThat job followed four years as manager of Celtic.\n\nHow did he do at Scotland?\n\n3 Strachan taking Scotland training\n\nStrachan got off to a winning start as national team boss with a 1-0 friendly win over Estonia.\n\nHis first two competitive games were in World Cup qualifying, where Scotland had slim chances of qualification anyway.\n\nDefeats to Wales and Serbia essentially killed the small hope.\n\nThe European finals had been increased to 24 teams from Euro 16 and anticipation was high that a long hiatus would come to an end.\n\nWIN £50,000 with Dream Team Euros Dream Team Euros is HERE! The best fantasy football game to accompany Euro 2020 has arrived. And you can play absolutely FREE for your chance to win the £50,000 jackpot. CLICK HERE TO SIGN UP FOR FREE! Dream Team Euros £50,000 jackpot\n\nThe best fantasy football game this summer\n\nPlay in mini-leagues against your mates, colleagues, family members - and some hand-picked celebrities\n\nFREE to play\n\nA 1-0 defeat in Georgia midway through the group undone the early good work.\n\nThough on the final day, Robery Lewandowski netted a late equaliser which ended any hope.\n\nAfter failing again to qualify for the World Cup in 2018, Strachan resigned from his post.\n\nWhat was his win percentage at Scotland?\n\nDespite failing to get Scotland to a major tournament, his win percentage was actually not too bad.\n\nIn total he managed 40 games, winning just shy of half of them at 19 wins.\n\nGames managed – 40\n\nGames won – 19\n\nGames drawn – 9\n\nGames lost – 12\n\nWin percentage – 47.50%\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}]}