{"Gordon David Strachan managed Coventry City, Southampton, Celtic and Middlesbrough.": [{"url": "https://www.theguardian.com/football/2013/jan/14/gordon-strachan-scotland-manager", "page_content": "The Scottish Football Association has called a news conference for midday on Tuesday, when Gordon Strachan is expected to be named the new manager of the national team.\n\nThe 55-year-old, who has been out of work since leaving Middlesbrough in October 2010, has been in negotiation with the SFA with regards to his salary and contract length since the turn of the year. Although those conditions remain unclear, Strachan will be handed at least the remainder of Scotland's failed 2014 World Cup qualification campaign plus the country's attempt to make it to the 2016 European Championship.\n\nScotland have not appeared at a major finals since 1998, a matter which has had a negative impact on public confidence towards the SFA and the governing body's financial position. The SFA has also been heavily criticised for its role in the deeply unpopular reforms of Scotland's domestic set-up.\n\nStrachan was immediately the favoured choice of senior figures within the SFA and among the country's international football support after the inevitable sacking of Craig Levein. Under Levein, Scotland failed to qualify for last summer's European Championship and made an abysmal start to the 2014 campaign; they lie bottom of Group A with two points from four matches.\n\nStrachan was the country's outstanding candidate, with Joe Jordan, who has joined Harry Redknapp at Queens Park Rangers, and Owen Coyle only tentatively mentioned as alternatives. Alex McLeish was briefly quoted, but distanced himself from a return to the Scotland role and has been appointed as the manager of Nottingham Forest.\n\nStrachan, when asked directly about the Scotland job, which will be his first in international management, said in November: \"It's quite simple really – it would be an honour to be asked to be the manager of your own national side; it's terrific.\"\n\nLevein remains in a legal dispute with the SFA in relation to the remainder of his contract. The association has been seeking to retain Levein on its payroll but the 48-year-old wants the balance of his contract paid up.\n\nStrachan has been employed as a pundit by ITV since leaving Middlesbrough. His 12-month spell in the north-east was less than distinguished, with Boro 20th in the Championship when he left, their lowest position for two decades. Of 46 games in charge after he succeeded Gareth Southgate, Strachan won only 13 and, according to the chairman, Steve Gibson, was so chastened by the experience he refused any compensation, despite having two and a half years left on his contract.\n\nBefore that, Strachan managed Coventry City, Southampton and Celtic. He was relegated with Coventry but bounced back with Southampton, whom he took to the 2003 FA Cup final where they lost 1–0 to Arsenal.\n\nStrachan took a 16-month break after resigning from Southampton in 2004 before becoming manager of Celtic, where he won three successive league titles before resigning in May 2009 after failing to win a fourth title."}, {"url": "https://warwick.ac.uk/newsandevents/pressreleases/coventry_scotland_football", "page_content": "The Strachan Football Foundation, one of the UK’s most successful football education programmes, has announced today, Wednesday 31st March 2021, that it is to move its growing programme of sporting and educational support for young people to the extensive and world class sports facilities at the University of Warwick.\n\nThe Foundation was founded in 2011 by football icon Gordon Strachan. Gordon played for Dundee, Aberdeen, Manchester United, Leeds United, Coventry City, and also represented Scotland 50 times (appearing in two World Cups). He has managed Coventry City and Southampton in the Premier League, Celtic in the Champions League, and Middlesbrough. Gordon described his five years managing Scotland’s national team as his “dream job” and “an absolute honour”. Despite his continuing commitments to professional football Gordon is a regular face at the Strachan Football Foundation’s training sessions.\n\nCraig Strachan, the Strachan Football Foundation’s Assistant Director of Football, said:\n\n“We are incredibly proud of the opportunities we provide young people to reach their potential in the classroom and on the football pitch. We are constantly looking at ways to further enhance the programme and we are so excited what the move to the University of Warwick will mean for our students”:\n\nThe Strachan Football Foundation (SFF) offers:\n\nA bespoke programme of full time education suited to each learner’s needs, ability and desired career path\n\nA football programme, with an extensive training and games programme based at a state of the art training facility.\n\nFull time education from Level 1 to Level 3 in variety of football / sport / coaching related qualifications.\n\nDegree Courses (working with Nottingham University and Loughborough College).\n\nOpportunities to work towards of a scholarship at one of eleven colleges and universities in the United States.\n\nSince SFF’s creation in 2011 in Rugby by its Director and founder Gordon Strachan, it has quadrupled in size and now works with over 80 young people, many of whom come from the Coventry and North Warwickshire area. SFF’s development in size and shape has now led to its move from Rugby to the University of Warwick Campus.\n\nGeorge Mackie, Director of Football at the Strachan Football Foundation said:\n\n“I want to thank Rugby Borough Football club and their junior team for hosting us and enabling us to provide this support for a great many young people over the last decade. However, the continuing success of the Foundation means that we have now outgrown our Rugby home.”\n\n“Our new base at the University of Warwick will give us access to more facilities and pitches on site, which will enable further growth, and will allow our program to be more accessible to a greater number of students.”\n\nSFF’s founder and Director Gordon Strachan said:\n\n“Pandemic restrictions permitting, our young students will begin training and studying in our new University of Warwick base in September. I look forward to being there myself to see the first ball kicked by one our fantastic young people in this fabulous new home right on the edge of Coventry, a city I know so well.”\n\nLisa Dodd-Mayne, Director of Sport and Active Communities at the University of Warwick said:\n\n“We are delighted that the Strachan Football Foundation have chosen to bring their academy to the world class sports facilities here at the University of Warwick. Our facilities have helped train, support and host many Olympic, Commonwealth, and UK professional athletes; and professional football players.”\n\n“The young people who will access the Foundation’s programmes on our campus will benefit from support, training, and access to qualifications that will bring huge benefits to them and their future careers. It is a fantastic opportunity for the University, our region and our local community in Coventry and Warwickshire to host this Foundation, led by an international football figure with such close connections to Coventry, which will benefit many of our local young people.”\n\nNotes for Editors\n\nThe Strachan Football Foundation is a not for profit company. The Foundation was started in 2011 in Rugby, by its Director and founder Gordon Strachan alongside son Gavin Strachan, who both wanted to bring together education and football for young aspiring students/footballers. The Foundation is committed to creating a learning environment to enable students to develop their personal growth through education, football and experiences at the foundation. It has worked closely with schools, students, parents and education providers to create a leading football education academy. For further information see: http://www.strachanfootballfoundation.co.uk/\n\n\n\nFor further information and interview opportunities with SFF please contact:\n\nPeter Dunn, Director of Press and Media Relations, University of Warwick\n\nEmail: p.j.dunn@warwick.ac.uk\n\nTel: +44 (0)7767 655860\n\n31st March 2021 PJD"}, {"url": "https://www.besoccer.com/player/biography/strachan-266097", "page_content": "No microphone has been detected in the system x\n\nYou need to give permission for the microphone to be used to be able to use it x\n\nError while trying to use the microphone, the browser may not be compatible x"}, {"url": "https://www.bbc.co.uk/sport/football/20215124", "page_content": "Alex McLeish has tipped Gordon Strachan to succeed Craig Levein as Scotland manager after distancing himself from a return to the role.\n\nLevein was sacked on Monday following a poor start to Scotland's 2014 World Cup qualifying campaign.\n\nMcLeish, who led Scotland to seven wins in 10 games in 2007, said: \"Gordon could be the guy to galvanise them.\n\n\"I have already been the manager and enjoyed it tremendously [but] I want to get back into club management.\"\n\nMcLeish, who was sacked by Aston Villa at the end of last season after just 11 months in charge, is, along with Strachan and another former national manager Walter Smith, among the favourites to succeed Levein.\n\nGordon Strachan factfile: 1971-77: Begins playing career at Dundee\n\n1977-84: Aberdeen\n\n1980-92: Scotland (50 apps)\n\n1984-89: Manchester United\n\n1989-95: Leeds United\n\n1995-97: Coventry City\n\n1996-2001: Begins managerial career at Coventry City\n\n2001-04: Southampton\n\n2005-09: Celtic\n\n2009-2010: Middlesbrough\n\nHowever, the 53-year-old Scot said he sees his future in the \"day-to-day business\" of club football.\n\n\"Walter Smith has monstrous experience, but maybe it is Gordon's turn due to where he has been,\" McLeish told BBC Radio 5 live.\n\nStrachan, a former Scottish international who played for Aberdeen, Manchester United and Leeds United amongst others, has managed Coventry City, Southampton and Celtic, responsible for steering the Glasgow giants to the last 16 of the Champions League for the first time in their history.\n\nHis last management job was as boss of Championship side Middlesbrough. He quit in October 2010 after just a year in charge and now works as a football pundit on television.\n\n\"He has a very good television job, but maybe he is too much in a comfort zone and wants to get back in among the players again,\" said McLeish.\n\nFormer Scotland striker Kevin Gallacher is another who believes Strachan could resurrect the nation's football fortunes. \"He's a younger manager and his enthusiasm could rejuvenate us,\" he said.\n\nHowever, Gallacher was quick to highlight other candidates, among them former Scottish internationals Kenny Dalglish and Joe Jordan.\n\nHe also thinks Smith, who was Scotland boss from December 2004 to January 2007, would be a good option.\n\n\"Walter Smith has unfinished business,\" said Gallagher. \"He's experienced and done it before. Bring him in and give him another shot.\"\n\nJordan, 60, has been out of work since Harry Redknapp's surprise sacking by Tottenham Hotspur in the summer. The Scot spent four years as a member of the first-team coaching staff at White Hart Lane.\n\n\"For my name to be mentioned, yes, it's nice to be linked with the national job,\" said Jordan, who has managed Hearts, Stoke City and Bristol City.\n\nAlex McLeish's Scotland reign: Managed Scotland in 2007\n\nGames: 10\n\nWon: 7\n\nLost: 3\n\n\"What that job entails is not easy because of the situation the new man would find himself in. He's halfway through a campaign and he would need snookers. He would need results elsewhere to go for him. He would want to go into the job with a prospect of qualifying.\"\n\nTwo draws and two defeats from their opening four World Cup qualifying games have left the Scots bottom of Group A, eight points behind joint leaders Belgium and Croatia with just six games remaining.\n\nLevein took over in December 2009 and was in charge for 12 games, winning three, drawing four and losing five.\n\nUnder-21 coach Billy Stark has been put in temporary charge ahead of next week's friendly against Luxembourg. SFA chief executive Stewart Regan said they would give themselves \"time\" in finding a replacement.\n\nFormer Scotland midfielder Craig Burley thinks not all the candidates would be interested - or suitable - for the vacancy.\n\n\"People are putting their reputations on the line by taking this Scotland job,\" he said. \"It's a tough job.\n\n\"What you're looking for is someone who doesn't want to use this job as a launchpad back into the Premier League. It needs to be done over a long period. Whoever gets the job needs to see it through.\n\n\"For 10 years-plus, this generation of players has not been able to get Scotland anywhere near a major championship. I'm not saying it's impossible, but it's pretty difficult.\n\n\"The group didn't help this time. Because of the co-efficient, we were always going to be in a tough group.\""}, {"url": "https://www.usefulsports.com/gordon-strachan/", "page_content": "Gordon is a successful football manager and a former player admired for his skill and passion for the game. In his time as a manager he was named Manager of the Year in Scotland multiple times by writers and players whilst at Celtic. He is also seen regularly on ITV working as a pundit.\n\nGordon Strachan (Gordon David Strachan OBE) played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. Prior to Middlesbrough, Strachan managed Coventry City, Southampton and Celtic.\n\nStrachan came to prominence at the age of 20 when he was signed by Aberdeen on 1 November 1977. With the famous Aberdeen team of the 1980s, managed by Alex Ferguson and one of the few sides to break the traditional dominance of the Old Firm in Scottish football, he won two Scottish League titles, three Scottish Cups, the European Cup Winners’ Cup and the European Super Cup.\n\nIn August 1984, Manchester United spent £500,000 to take him to Old Trafford in August.\n\nIn club football, he played 626 games scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top flight. In international football Strachan earned 50 caps, scoring 5 goals and playing in two FIFA World Cup final tournaments, Spain 82 and Mexico 86.\n\nGordon first played for the Scotland national team in 1980. Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United, before spending the next seven seasons as club captain at Leeds, winning the 1991–92 First Division league title. He played his last game for Scotland in 1992 while still at Leeds, and then moved to Coventry in 1995 for a final three seasons, as a player-coach.\n\nStrachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds. He was also named Manager of the Year in Scotland multiple times by writers and players while at Celtic.\n\nAfter resigning as manager of Southampton in 2004, Strachan took a 16 month break from management before returning to Scotland to become manager of Celtic in the Scottish Premier League. With Celtic he achieved three successive league titles and other domestic cup wins.\n\nIn 2007, Strachan was inducted into the Scottish Football Hall of Fame.\n\nStrachan has also analysed football matches for the media, most notably alongside Adrian Chiles on BBC Sport’s Match of the Day 2.\n\nFor the 2006 FIFA World Cup, Strachan was appointed as the official FIFA Ambassador for Scotland, joining fifty others in fund raising for SOS Children’s Villages, the official charity of the tournament.\n\nHe currently works as a regular pundit for ITV’s coverage of the FA Cup. His face is still a familiar addition to the television and football scene and his powerful motivational speeches are in demand at company seminars nationwide."}, {"url": "https://www.celebsagewiki.com/gordon-strachan", "page_content": "Age, Biography and Wiki\n\nGordon Strachan was born on 9 February, 1957 in Edinburgh, United Kingdom. Discover Gordon Strachan's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 66 years old?\n\nPopular As N/A Occupation N/A Age 66 years old Zodiac Sign Aquarius Born 9 February 1957 Birthday 9 February Birthplace Edinburgh, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 9 February. He is a member of famous with the age 66 years old group.\n\nGordon Strachan Height, Weight & Measurements\n\nAt 66 years old, Gordon Strachan height is 1.68 m .\n\nPhysical Status Height 1.68 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Gordon Strachan's Wife?\n\nHis wife is Lesley Strachan (m. 1977)\n\nFamily Parents Not Available Wife Lesley Strachan (m. 1977) Sibling Not Available Children Not Available\n\nGordon Strachan Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Gordon Strachan worth at the age of 66 years old? Gordon Strachan’s income source is mostly from being a successful . He is from United Kingdom. We have estimated Gordon Strachan's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nGordon Strachan Social Network\n\nInstagram Linkedin Twitter Gordon Strachan Twitter Facebook Wikipedia Gordon Strachan Wikipedia Imdb\n\nTimeline"}, {"url": "https://football-speakers.com/football-speaker/gordon-strachan", "page_content": "Gordon Strachan OBE is a Scottish football manager and former player. Strachan was the manager of the Scotland national team. Strachan played for Dundee , Aberdeen , Manchester United , Leeds United and Coventry City , as well as the Scotland national team.\n\nHe has managed Coventry City , Southampton , Celtic and Middlesbrough . In club football, he played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football, Strachan earned 50 caps, scoring five goals and playing in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nA right-sided midfielder, Strachan made his senior debut in 1974 with Dundee before moving on within Scotland, to spend seven seasons at Aberdeen. He first played for the Scotland national team in 1980. Whilst at Aberdeen, Strachan won multiple domestic league and cup honours in the early 1980s, as well as the 1982–83 European Cup Winners' Cup and 1983 European Super Cup . Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United , before spending the next seven seasons as club captain at Leeds, winning the 1989–90 Second Division and 1991–92 First Division league titles.\n\nHe played his last game for Scotland in 1992 while still at Leeds, and then moved to Coventry in 1995 for a final three seasons, as a player-coach. Strachan became full-time manager of Coventry when the incumbent Ron Atkinson was appointed as Director of Football . After five years in the job, he was sacked in 2001, when Coventry were relegated from the top-flight for the first time in 34 years. However, he immediately returned to the Premier League with Southampton and guided the \"Saints\" to the 2003 FA Cup Final – where they lost 1–0 to Arsenal.\n\nStrachan resigned from Southampton in 2004 and took a 16-month break from management before returning to Scotland to become manager of Celtic in the Scottish Premier League . With Celtic he achieved three successive league titles and other domestic cup wins, before resigning in May 2009 after failing to win a fourth title. Strachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds."}, {"url": "https://fleekloaded.com/football-player-born-1960-score-premier-league-hat-trick-football/", "page_content": "Gordan Strachan\n\nGordon David Strachan was born 9 February 1957. He is a Scottish football coach and former player. He played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has since managed Coventry City, Southampton, Celtic, Middlesbrough and Scotland.\n\nIn club football, Strachan played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football Strachan earned 50 caps, scoring five goals and played in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nSheringham is also the Premier League’s oldest goalscorer, scoring his final time at 40 years and 266 days old. Ronaldo’s hat-trick brought him past Gordon Strachan, who is the only player in Premier League history born before 1960 to score a hat-trick."}, {"url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-gordon-strachan-16000551", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet Sky Blues transfer latest, team news, match updates and analysis delivered straight to your inbox\n\nGordon Strachan had five years in charge of Coventry City from 1996 to 2001, during which he managed some hugely talented players.\n\nThe former Manchester United star joined Highfield Road in 1995 as a player/assistant manager under 'Big Ron' Atkinson with a view to taking the managerial reins.\n\nAlthough it was often tough trying to maintain the club's top flight status with relegation battles in the first two seasons, City held their own in the Premier League with a creditable 11th place finish in 1997/98 thanks, in part, to an impressive 32-goal partnership between Dion Dublin (18) and Darren Huckerby (14).\n\nThe Sky Blues finished 15th the following year and 14th in 1999/2000 when supporters enjoyed midfield maestro Gary McAllister pulling the strings for Robbie Keane (12) while wading in with 11 himself as Moustapha Hadji (6) and Youssef Chippo sprinkled a bit of Moroccan magic to the side dubbed 'The Entertainers'.\n\nSadly, Keane's departure signalled the beginning of the end to City's proud 34 years at the highest level as eight goals from his replacement Craig Bellamy and six from the late arriving John Hartson couldn't save the club from the drop in 2001.\n\nThe former Sky Blues boss effectively had two impressive and exciting teams over the course of his tenure, during which good players inevitably moved on and were replaced.\n\nThe likes of Peter Ndlovu, Noel Whelan, George Boateng, Steve Froggatt, Gary Breen, Mo Konjic, Swedish internationals Roland Nilsson and Magnus Hedman, Paul Williams and Richard Shaw, to name just a few, all pulled on the shirt and served the club well.\n\nBut of all the players Strachan managed during his five year spell, what is his best XI?\n\nHere the 62-year-old explains his starting side and names seven subs to fill the bench.\n\n“We had to change the team a few times because people were buying our good players,\" said the former boss, who went on to manage Southampton, Celtic, Middlesbrough and Scotland.\n\nStarting in goal, Strachan was blessed with the talents of Steve Ogrizovic who was later replaced by Sweden international Magnus Hedman before Academy star Chris Kirkland broke through towards the end of his tenure.\n\nBut there's only one man for the job, Strachan saying: \"In goals I'd have to pick Oggy who is the best goalkeeper I have ever worked with, and that’s from the age of 15 to now!\"\n\nThe right-back slot was occupied by a number of players including the immaculate Brian Borrows early on, the classy Swede Roland Nilsson, Marc Edworthy, the versatile Paul Telfer and Barry Quinn - both of whom were midfielders by trade.\n\n“Roland Nilsson at right-back, that’s for sure,\" he said, without hesitation.\n\nThe central defensive partnership proved a little more problematic for the ex-boss who took his time to ponder the options that included the likes of Gary Breen, Big Mo Konjic, Frenchman Jean-Guy Wallemme, Liam Daish and Scottish international Colin Hendry.\n\nBut two players who stayed the distance get the nod.\n\n“I’d probably go for Williams and Shaw,\" said Strachan, breaking into a chuckle.\n\n\"They were good together and just because neither of them would play with anyone else!\n\n\"They just liked to play with each other.\"\n\nThe left-back berth proved somewhat controversial.\n\nThe options include the excellent former Liverpool star David Burrows and home grown Marcus Hall who took over from him while a number of players filled in out of position.\n\nHe initially went for George Boateng, just to get him in the side after his initial midfield selection, but then changed his mind and went for a versatile option.\n\n“I have missed Paul Telfer, by the way,\" he said.\n\nAsked if Telfer could go on the bench, he replied: “You tell him he’s going on the bench!\n\n\"I tell you what, put him at left-back and put George in midfield instead of Youssef Chippo.\"\n\nHe added: “Kevin Richardson was a good player but put Gary McAllister in midfield.\"\n\npoll loading What's your favourite Sky Blues goal of the season so far? 0+ VOTES SO FAR Amadou Bakayoko's diving header at Charlton Conor Chaplin's free-kick against Plymouth Jordy Hiwula's solo run and super strike against Fleetwood Something else\n\nAsked about Noel Whelan who could play in midfield or up front, the Scot quipped: “I forgot about him.\n\n\"He’d be a substitute in my house and he could go from my house to the game.\"\n\nThe strikers/winger options include the likes of John Aloisi, Cedric Roussel, Steve Froggatt, Moustapha Hadji, Craig Bellamy, Ysael Zuniga, Viorel Moldovan and John Salako.\n\n“Darren Huckerby, Dion Dublin, Robbie Keane, that would be a front three,\" he said.\n\n\"I'd like to get Froggatt in there but I can't put Hadji on the bench. Tell you what, put Hadji in midfield and Froggy can go on the bench.\"\n\nClearly having not lost his sense of humour, he added: “Can I get Robert Jarni in there? Stick him on the bench!\"\n\nJarni, of course, a Croatian left wing-back and World Cup star, joined the club for £2.4 million from Real Betis but, infamously, never pulled on the shirt after being swiftly sold to Real Madrid for £3.4m.\n\nSome believed this was a joint Coventry City and Real Madrid tactic, as Betis refused to sell him to the Madrid giants, while the official line at the time was that the player changed his mind after he and his wife saw Coventry.\n\nIn conclusion, Strachan said: “I had some amazing players over my time there and they were a good bunch to work with as well. I am still friends with many now.\n\n“I had five good years and a desperate one at the end, but there you go.”\n\nGordon Strachan's best Sky Blues XI:\n\nSteve Ogrizovic; Roland Nilsson, Richard Shaw, Paul Williams, Paul Telfer; Darren Huckerby, George Boateng, Gary McAllister, Moustapha Hadji; Dion Dublin, Robbie Keane.\n\nSubstitutes: Magnus Hedman (GK), Noel Whelan, Kevin Richardson, Youssef Chippo, Steve Froggatt, Gary Breen, Robert Jarni.\n\nGordon Strachan is a Paddy Power ambassador, read his columns at news.paddypower.com\n\nDownload the CoventryLive app Click here for iPhone and here for Android\n\nVisit our Facebook pages for Coventry and Nuneaton or visit our Twitter pages for Coventry and Nuneaton\n\nWatch our videos on YouTube and see our photos on Instagram\n\nFor all your latest Sky Blues news, opinion, analysis and transfer gossip, click here"}, {"url": "https://alchetron.com/Gordon-Strachan", "page_content": "Gordon David Strachan, OBE (; born 9 February 1957) is a Scottish football manager and former player, who is currently the manager of the Scotland national team.\n\nStrachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has managed Coventry City, Southampton, Celtic and Middlesbrough. In club football, he played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football Strachan earned 50 caps, scoring five goals and playing in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nA right-sided midfielder, Strachan made his senior debut in 1974 with Dundee before moving on within Scotland, to spend seven seasons at Aberdeen. He first played for the Scotland national team in 1980. While at Aberdeen Strachan won multiple domestic league and cup honours in the early 1980s, as well as the 1982–83 European Cup Winners' Cup and 1983 European Super Cup. Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United, before spending the next seven seasons as club captain at Leeds, winning the 1989–90 Second Division and 1991–92 First Division league titles. He played his last game for Scotland in 1992 while still at Leeds, and then moved to Coventry in 1995 for a final three seasons, as a player-coach.\n\nStrachan became full-time manager of Coventry when the incumbent Ron Atkinson was appointed as director of football. After five years in the role, he was sacked in 2001 when Coventry were relegated from the top-flight for the first time in 34 years. However, he immediately returned to the Premier League with Southampton and guided the \"Saints\" to the 2003 FA Cup Final, where they lost 1–0 to Arsenal. Strachan resigned from Southampton in 2004 and took a 16-month break from management before returning to Scotland to become manager of Celtic in the Scottish Premier League. With Celtic, he achieved three successive league titles and other domestic cup wins, before resigning in May 2009 after failing to win a fourth title. Five months later, he became manager of Middlesbrough in the English Championship, but left the club after an unsuccessful 12 months in the job.\n\nStrachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds. He was also named Manager of the Year in Scotland several times by writers and players while at Celtic. In 2007, Strachan was inducted into the Scottish Football Hall of Fame. He is the father of Craig Strachan and Gavin Strachan, also footballers.\n\nClub career\n\nBorn and raised in Muirhouse, Edinburgh, Strachan supported Hibernian as a boy. His father, Jim, worked as a scaffolder, and his mother, Catherine, worked at a whisky distillery. At age 15, he damaged his vision playing football on the school playground when a pen in his pocket became lodged in his right eye; the pen came within \"a thousandth of an inch\" of permanently costing him the vision in his eye. He was offered a contract by Hibernian manager Eddie Turnbull, but his father decided against the offer after stating the club did not pay sufficient expenses for footwear.\n\nDundee\n\nStrachan began his career with Dundee, having decided to sign with the Scottish club at age 14. In joining the club, he rejected an approach from Manchester United, reasoning he had a better chance to establish himself in the first team at Dens Park. His natural talent was immediately apparent and he quickly earned a reputation as an outstanding player in the second team, twice winning the Scottish Reserve Player of the Year Award. He made his mark as an 18-year-old when he outplayed Alan Ball in a friendly with Arsenal in August 1975; The Sunday Post compared him to a young Billy Bremner. Strachan became a regular player in the 1975–76 season, the inaugural season of the Scottish Premier Division, featuring in 17 of the club's 36 league matches. However David White's \"Dee\" were relegated on the last day of the season after rivals Dundee United edged ahead on goal average with an unlikely draw with champions Rangers.\n\nNew boss Tommy Gemmell handed 19-year-old Strachan the captaincy for the 1976–77 First Division campaign, and he remains the youngest player to have captained Dundee. However, the club failed to shine in the lower divisions, and Strachan lost his first team place early in the 1977–78 season following a drinking session with Jimmy Johnstone; Gemmell was also concerned that Strachan was \"getting kicked a lot\" after opposition teams worked out that the way to stop Dundee was to take out their playmaker. Strachan decided to leave Dundee as the club seemed unlikely to win back their top-flight status; the Dundee chairman was also keen on cashing in his most prized asset, and told Gemmell that \"we need £50,000 by Friday or the banks are closing the gate\". His last match for Dundee was on 26 October 1977 in a 6–0 defeat in the League Cup to Queen of the South at Palmerston Park, which Strachan described in his autobiography as \"embarrassing\".\n\nAberdeen\n\nStrachan was signed by Aberdeen manager Billy McNeill in November 1977 for a fee of £50,000 plus Jim Shirra. Poor form and niggling injuries made 1977–78 a poor season for Strachan, though the \"Dons\" went on to finish second in the Scottish Premier Division. He was not picked for the 1978 Scottish Cup Final defeat to Rangers.\n\nMcNeill left the Pittodrie Stadium for Celtic in summer 1978, and Alex Ferguson was appointed as the new manager. Strachan played at Hampden Park in the 1979 League Cup defeat to Rangers, and set up Duncan Davidson for the game's opening goal. Though the 1978–79 campaign was a disappointment, Aberdeen went on to win the league title in 1979–80 after closing a ten-point deficit over Celtic with a late run that included two victories at Celtic Park. They again reached the League Cup Final, beating both Old Firm sides en route, where they lost 3–0 to Dundee United at Dens Park. At the end of the season, Strachan was elected SFWA Footballer of the Year. After gaining assurance Alex McLeish would also stay with the club, Strachan signed a new contract to keep him at Pittodrie until 1984.\n\nThe \"Reds\" could only manage a second-place finish in 1980–81, as Celtic regained the league title. They exited the European Cup in the second round with defeat to eventual champions Liverpool; manager Bob Paisley said Strachan would become \"Britain's first £2 million player\", in what was a (successful) early attempt at mind games. He missed the second half of the season with a muscle tear in his stomach. With fit-again Strachan on the right flank – supported by full-back Stuart Kennedy – and record signing Peter Weir on the left-flank, Aberdeen mounted a genuine title challenge in 1981–82, but had to settle for second place to Celtic. They did though lift the Scottish Cup with a 4–1 extra-time victory over Rangers, with Strachan contributing one assist and one goal.\n\nThe 1982–83 campaign was the greatest in the history of the club, and Strachan made his mark early on with four goals in a 5–1 victory at former club Dundee in the League Cup. Despite only finishing third in the league (albeit only one point behind champions and New Firm rivals Dundee United) and exiting the League Cup in the quarter-finals, Aberdeen won the Scottish Cup and the European Cup Winners' Cup. The club's European success came with a 2–1 after-extra-time victory over Spanish giants Real Madrid at Ullevi in Gothenburg. The Scottish Cup came with a 1–0 win over Rangers. The \"Dons\" continued their success by delivering the league title and Scottish Cup in 1983–84, with Strachan setting up Mark McGhee for the winning goal in the cup final win over Celtic. This completed a unique treble, as they defeated Hamburger SV in the 1983 European Super Cup.\n\nManchester United\n\nIn August 1984, Manchester United spent £500,000 to take Strachan to Old Trafford. However, because Strachan had previously signed a pre-contract agreement with Bundesliga side 1. FC Köln, United paid £75,000 compensation to resolve the row – teammate Mark McGhee had also signed a contract with Hamburger SV on the understanding that Strachan would also be playing in Germany. Strachan opened the 1984–85 campaign with four goals in seven matches, though the \"Red Devils\" could only manage a fourth-place finish in the First Division. He featured at Wembley Stadium in the 1985 FA Cup Final, as United ran out 1–0 winners over Everton; his lung-bursting run off-the-ball helped Norman Whiteside to find the space for his extra-time winner.\n\nAfter winning their opening ten league matches of the 1985–86 season, United had to cope without Strachan, who was sidelined for much of the season with injury. They proved unable to cope with their injuries – another key player facing extended time in the treatment room was Bryan Robson – and limped to another fourth-place finish. Atkinson was replaced by Alex Ferguson in November 1986, and Strachan mocked sobbing as he told his teammates, \"I never thought he'd follow me this far south!\" After his arrival, Ferguson speculated that no longer being the star player had negatively affected Strachan's form. United finished a disappointing 11th in 1986–87, before rising to second place in 1987–88. Strachan's form was again patchy in 1988–89, as United slipped back down to 11th.\n\nLeeds United\n\nIn March 1989, Sheffield Wednesday manager Ron Atkinson had a bid of £200,000 accepted by Manchester United, and he offered Strachan a contract paying more money than anyone in the club's history. However likely a move to Sheffield seemed, Leeds United manager Howard Wilkinson matched the offer and convinced Strachan to drop down into the Second Division. He quickly became a popular figure at Elland Road, earning comparisons to former favourites Bobby Collins and Johnny Giles. Signing a two-year contract, he was awarded with the captain's armband. He formed an unlikely midfield partnership with hard-man Vinnie Jones and led the club to the Second Division title in 1989–90.\n\nWith the \"Whites\" now in the First Division, Wilkinson secured a midfield quartet of Strachan, Gary McAllister, David Batty and Gary Speed. They achieved a commendable fourth-place finish in 1990–91, and also reached the semi-finals of the League Cup. Strachan was voted FWA Footballer of the Year for his performances during the campaign, becoming the first player to win the award both in Scotland and in England.\n\nStrachan signed a new two-year contract, before captaining Leeds to the league title in 1991–92. In so doing, he denied former boss Alex Ferguson and Leeds' hated rivals Manchester United the title. However, Strachan (now nearing age 35) was beginning to feel the effects of his sciatica and missed a number of matches due to his bad back. Following the club's success, Strachan was appointed an OBE for his services to sport.\n\nHowever, Leeds were unable to build on their success, and finished the 1992–93 season down in 17th place in what was newly re-branded as the Premier League. Strachan continued to impress though, and was given the club's Player of the Year award. He scored a hat-trick against Blackburn Rovers on 10 April 1993.\n\nStrachan managed 37 starts in 1993–94, and Leeds rose to fifth. He was rarely selected in the 1994–95 season, which would prove to be the end of his spell at Elland Road, where he had spent six years.\n\nCoventry City\n\nIn March 1995, Strachan moved to Coventry City to work as assistant manager under new manager Ron Atkinson, the man who had brought him south of the border to Manchester United 11 years earlier. It was also agreed he would replace Atkinson as manager in summer 1997. Strachan coached the team and led training sessions while learning the finer points of management from Atkinson. He also took to the field at Highfield Road, playing 26 Premier League matches for the Sky Blues over the next two years before finally hanging up his boots in his 40th year. Atkinson signed Aberdeen midfielder Eoin Jess in 1996 purely on the basis of Strachan's recommendation. However, Isaías left the club after falling-out with Strachan. Coventry signed Gary McAllister for £3 million on wages of £20,000 per week; the deal was done by McAllister's former teammate and friend Strachan, while Atkinson was largely opposed to the deal. The club struggled at the start of the 1996–97 campaign, and the club's board of directors asked Atkinson to step aside in November 1996, some months earlier than first agreed, and Strachan was appointed manager.\n\nInternational career\n\nStrachan won his first cap for Scotland on 16 May 1980, in a British Home Championship defeat to Northern Ireland at Windsor Park. Strachan helped Scotland qualify for the 1982 FIFA World Cup and scored a crucial goal in qualifying by scoring the only goal against Sweden at the Råsunda Stadium in Stockholm. He did not feature in the 1982 British Home Championship, as Jock Stein wanted to rest him for the World Cup, held in Spain. The Scots cruised to a 5–2 victory over New Zealand at La Rosaleda Stadium, Málaga; Strachan was named Man of the Match. Scotland then lost 4–1 to a world-class Brazil side at the Estadio Benito Villamarín, Seville. In the third match, a 2–2 draw with the Soviet Union back in Málaga saw Scotland exit the tournament on goal difference.\n\nScotland also qualified for the 1986 FIFA World Cup. However, shortly after the draw with Wales at Ninian Park on 10 September 1985, Jock Stein died of a heart attack, and his assistant Alex Ferguson took charge for the World Cup campaign. To complete their qualification, they had to beat Australia in a play-off. Strachan played in the first leg at Hampden Park, but did not travel to Melbourne for the second leg. The Scots faced a tough draw in Mexico and lost their opening match at Estadio Neza 86 1–0 to the unseeded – but highly fancied – Denmark. Strachan then scored in a 2–1 defeat to West Germany at the Estadio Corregidora; his goal celebration was memorable, as he tried to climb the advertising hoardings, but was thwarted by his short stature and so merely rested his leg on the hoarding before he was joined by his teammates. In the third and final group match back in Ciudad Nezahualcóyotl, Scotland drew 0–0 with Uruguay despite their opponents going down to ten men almost from the first whistle after José Batista attempted to take Strachan out of the game.\n\nStrachan fell out of the first team picture under Andy Roxburgh, and was omitted from the squad for the 1990 World Cup. Nevertheless, he enjoyed a national team revival between 1990 and 1992, and captained his country in qualification for UEFA Euro 1992. However, he did not travel to Sweden as a member of the squad, as he announced his retirement due to long-term back troubles. He won 50 full caps, and scored five international goals.\n\nCoventry City\n\nWhen Ron Atkinson became Coventry City's director of football in November 1996, Strachan was promoted to the manager's seat. He appointed Alex Miller as his assistant. After an upturn in results, Strachan was named Manager of the Month in December. However, 1 win in 12 matches in the New Year left the \"Sky Blues\" in the relegation zone. Late wins over Liverpool, Chelsea and Tottenham Hotspur saved their season though, and relegation was avoided by a one-point margin. Strachan played in the win over Chelsea at Highfield Road at age 40, in what was at the time a record age for an outfield player in the Premier League.\n\nStrachan signed Swedish goalkeeper Magnus Hedman and defender Roland Nilsson, Dutch midfielder George Boateng, and Romanian striker Viorel Moldovan – all of whom would win international caps. Coventry rose to 11th place in 1997–98, and also reached the quarter-finals of the 1997–98 FA Cup. After Miller left the club, Strachan replaced him with Garry Pendrey, who would go on to spend many years as his assistant at various clubs. Strachan was again named Manager of the Month in February 1998.\n\nThe club finished 15th in 1998–99 and 14th in 1999–2000, as Strachan spent £6 million on Irish striker Robbie Keane and £5 million on Moroccans Mustapha Hadji and Youssef Chippo, while selling Dion Dublin to Midlands rivals Aston Villa. Coventry were relegated at the end of the 2000–01 season, making Strachan unpopular with fans. New signing Craig Bellamy proved disappointing, while Robbie Keane was sold and Gary McAllister departed for Liverpool. Strachan attempted to launch a promotion campaign by signing striker Lee Hughes, but in the face of increasing supporter unrest, he was sacked five matches into the 2001–02 First Division campaign. His replacement, Roland Nilsson, took the club to an 11th-place finish.\n\nSouthampton\n\nStrachan returned to management within weeks, taking the manager's job at Premier League Southampton, who had sacked manager Stuart Gray after a terrible start to their first season at the new St Mary's Stadium. Most pundits had already written off their survival chances by the time of Strachan's appointment in October 2001, but he turned round their fortunes and they finished 11th in the Premier League. The Saints progressed further in 2002–03 when they finished eighth and reached the FA Cup Final, where they lost 1–0 to Arsenal. As Arsenal had already qualified for the 2003–04 UEFA Champions League, Southampton won a place in the UEFA Cup.\n\nIn February 2004, Strachan announced his resignation as Southampton manager after his decision not to stay on at the club in the summer was leaked to the press. He wanted to take a break from football, but was forced to resign earlier than initially intended due to the speculation surrounding his and the club's future following the leak.\n\nCeltic\n\nAfter a 16-month break, Strachan returned to management on 1 June 2005, when he succeeded Martin O'Neill as manager of Celtic in the Scottish Premier League (SPL). For 2005–06, his stated aim was to regain the SPL title from rivals Rangers. He had an embarrassing start to his campaign as Celtic manager, losing 5–0 to Slovakian champions Artmedia Bratislava on 27 July 2005 and three days later, drawing 4–4 with Motherwell in his first SPL match in charge of the Glasgow club. The loss against Artmedia meant Celtic suffered an early exit from European competition, despite winning the return match 4–0. After this disastrous start, Celtic started to improve under Strachan. A low-point was the shock defeat in the third round of the Scottish Cup to First Division Clyde on 8 January 2006. However, the following month his team made history when they defeated Dunfermline Athletic 8–1, a record victory margin for the SPL at the time. Strachan's first season was ultimately successful as he coached Celtic to victory in the League Cup and, on 5 April 2006, his side clinched the SPL title in record time and with six matches remaining. Reflecting this achievement, Strachan was voted Manager of the Year by the Scottish Football Writers' Association eight days later.\n\nThe following year, Strachan restructured the team and made a series of signings, bringing in players such as Hibernian's Derek Riordan; Chelsea's Jiří Jarošík; Kenny Miller and Lee Naylor from Wolverhampton Wanderers; Jan Vennegoor of Hesselink from PSV; Thomas Gravesen from Real Madrid; and Paul Hartley and Steven Pressley from Hearts. Celtic flourished and by mid-January 2007 held a 17-point lead in the SPL table. UEFA Champions League football again returned to Celtic Park, the team having automatically qualified for the group stages and drawn alongside Benfica, Copenhagen and Manchester United. Home victories against all three Group F members saw the team progress to the round of 16 of the Champions League for the first time since the competition was re-formatted in 1993. Celtic lost the tie, against eventual winners Milan in extra time, missing out on a place in the quarter-finals. On 22 April 2007, Strachan guided Celtic to their 41st league championship, and second in succession. A 2–1 victory against Kilmarnock left Celtic 13 points clear of Rangers with four matches remaining. Later that day, Strachan was recognised as the inaugural PFA Scotland Manager of the Year for 2007. Celtic went on to win the Scottish Cup, beating Dunfermline Athletic.\n\nIn the 2007–08 season, Strachan led Celtic into the round of 16 of the UEFA Champions League again after defeating Milan, Benfica and Shakhtar Donetsk. However, by April, there was significant criticism from the press and the fans after the 1–0 loss to Aberdeen in the Scottish Cup quarter-final and the 1–0 loss to ten-man Motherwell in the SPL. But he proved the critics wrong again and, after defeating Rangers twice at home, on 22 May 2008 Strachan became only the third ever Celtic manager to guide the club to three consecutive Scottish league titles.\n\nAfter failing to lead Celtic to another league title in the 2008–09 season, he resigned as manager on 25 May 2009.\n\nMiddlesbrough\n\nStrachan signed a four-year contract with English Championship team Middlesbrough on 26 October 2009, succeeding Gareth Southgate. He had been linked with the Middlesbrough manager's job 15 years earlier, when still a Leeds United player. His first match in charge was on 31 October, a 1–0 defeat to Plymouth Argyle, with Adam Johnson missing a penalty. On 5 December, Middlesbrough won their first match under Strachan, 5–1 away to Queens Park Rangers. After a poor run of results, including a 3–0 loss at home to Blackpool and a 1–0 loss at home to Cardiff City, Strachan earned his first home win after his team beat Scunthorpe United 3–0.\n\nAfter a poor start to the 2010–11 season meant Middlesbrough were down in 20th place, Strachan left the club by mutual consent on 18 October. He voluntarily tore up his contract and left without compensation.\n\nScotland\n\nStrachan was appointed manager of the Scotland national team on 15 January 2013, succeeding Craig Levein. His first match in charge was at Pittodrie Stadium in a friendly match against Estonia on 6 February. The game ended 1–0 to Scotland, with Charlie Mulgrew getting his first international goal. Scotland suffered defeats to Wales and Serbia in Strachan's first two competitive matches, which ended the Scots' slim chances of qualification for the 2014 World Cup. After this, Scotland had an upturn in form, winning both matches against Croatia and away against Macedonia. Scotland finished fourth in qualifying Group A.\n\nIn Euro 2016 qualifying, Scotland appeared to have a better chance of qualification as the finals tournament was expanded from 16 teams to 24, but were drawn in a tough group with Germany, Poland and the Republic of Ireland. After losing their opening match in Germany, Scotland recorded home wins against Georgia, Ireland and Gibraltar, and away draws against Poland and Ireland. In their following match, Scotland produced an \"insipid\" performance, as they lost 1–0 in Georgia. A home defeat by Germany left Scotland four points behind third-placed Ireland, with two matches to play. In the penultimate matches of the group, Scotland needed to beat Poland, or hope that Ireland would lose to Germany. Scotland came from behind to lead 2–1 in their match, but Ireland had scored the only goal of their match, leaving the Scots needing a win to stay alive. A late scrambled goal by Robert Lewandowski gave Poland a draw that eliminated Scotland from contention. Strachan bemoaned what he perceived to be bad luck. After a win against Gibraltar in the last qualifier, Strachan agreed to a new contract with the Scottish Football Association.\n\nManagement style\n\nTypically playing a traditional 4–4–2 formation, and very occasionally 4–5–1, Strachan is widely known for his rigorous management style, and admits to watching video replays of his club's matches two, sometimes three, times. He also places great emphasis on player health and fitness, forbidding his players to drink alcohol excessively or regularly, and often giving dietary advice to his players, attributing his own longevity as a player to a strict and somewhat unusual diet involving seaweed. Players such as Scotland international Gary Caldwell have attributed their success at Celtic to lifestyle changes enforced by Strachan.\n\nRenowned for his deadpan humour in media interviews, quotes attributed to Strachan have become part of popular football culture.\n\nEnmity with Alex Ferguson\n\nDespite playing for Alex Ferguson at two clubs, the pair had an ongoing public feud during Strachan's managerial career. In his 1999 autobiography, the former Manchester United manager said, \"I decided this man could not be trusted an inch – I would not want to expose my back to him in a hurry.\" In his own 2006 autobiography, in response to Ferguson's comments, Strachan said he was \"surprised and disappointed\". The rivalry dates from Strachan's time playing under Ferguson, first at Aberdeen and later Manchester United. The hostilities between the two men are widely recognised to have decreased especially since they were seen on cordial terms during Celtic and Manchester United UEFA Champions League fixtures in 2006 and 2008.\n\nOther work\n\nStrachan has analysed football matches for the media, notably alongside Adrian Chiles on BBC Sport's Match of the Day 2. He has worked as a regular pundit for ITV's coverage of the FA Cup and the UEFA Champions League. During the 2014 World Cup, he worked as a pundit for ITV.\n\nFor the 2006 World Cup, Strachan was appointed as the official FIFA Ambassador for Scotland, joining 50 others in fundraising for SOS Children's Villages, the official charity of the tournament.\n\nPersonal life\n\nStrachan married Lesley Scott in 1977; George Mackie was his best man. Together, they had three children: Craig and Gavin Strachan, also footballers, and Gemma Strachan.\n\nManager\n\nPlayer\n\nAberdeen\n\nScottish Premier Division winner: 1979–80, 1983–84\n\nScottish Cup winner: 1982, 1983, 1984\n\nEuropean Cup Winners' Cup winner: 1983\n\nEuropean Super Cup winner: 1983\n\nManchester United\n\nFA Cup winner: 1985\n\nLeeds United\n\nFootball League First Division winner: 1991–92\n\nFA Charity Shield winner: 1992\n\nManager\n\nSouthampton\n\nFA Cup runner-up: 2003\n\nCeltic\n\nScottish Cup winner: 2007\n\nScottish League Cup winner: 2006, 2009\n\nIndividual\n\nPlayer\n\nIOC European Footballer of the Season: 1982–83\n\nPFA Team of the Year Second Division: 1989–90\n\nFWA Footballer of the Year: 1990–91\n\nLeeds United F.C. Player of the Year: 1993\n\nPFA Merit Award: 1995\n\nEnglish Football Hall of Fame inductee: 2016\n\nManager\n\nPremier League Manager of the Month: December 1996, February 1998, January 2002, December 2002\n\nPFA Scotland Manager of the Year: 2005–06\n\nPFA Scotland Manager of the Year: 2006–07, 2008–09\n\nScotland national football team roll of honour: 1992"}]}