{"Gordon David Strachan led Coventry City to the 1997 FA Cup Final.": [{"url": "https://www.coventrytelegraph.net/sport/football/football-news/city-premier-league-tottenham-hotspur-18235094", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet Sky Blues transfer latest, team news, match updates and analysis delivered straight to your inbox\n\nToday marks 23 years since Coventry City pulled off one of their greatest ever escapes.\n\nOn May 11, 1997, the Sky Blues beat Tottenham Hotspur 2-1 at White Hart Lane against all the odds to preserve their Premier League status.\n\nIt was the tenth time in the club’s stint in the top flight that CCFC avoided relegation on the last day of the season - and it was arguably the best of them all.\n\nAnd they were faced with a mountain to climb from the get-go, needing other teams to lose and to secure a win themselves to make the seemingly impossible dream a reality.\n\nTraffic problems on the M25 and M1 caused the Tottenham game to kick off late, meaning supporters faced an agonising 15 minutes knowing their team had to avoid conceding.\n\nThen player-manager Gordon Strachan has since revealed that he was too nervous to take to the field that day.\n\nStrachan said : “That game Dion and big Willo scored, and it was the longest 15 minutes of my life at the end.\n\n“We were 15 minutes behind the other games and I was a sub that day. I’d played the week before and was rubbish, so I dropped myself.\n\n“It was 2-1 and in the last 10 minutes the guys in the dug out were saying ‘get yourself on, get the ball, calm the game down’.\n\n“They were saying ‘look, Hucks in knackered’, so I shouted to Hucks to ask how he was doing and he said ‘I’m f*****’.\n\n“The guys on the bench asked me what he said, and I told them ‘he’s fine, he’s good to play on’.\n\n“I was too nervous to go on! But what a day that was.”\n\nCity had spent big across the two seasons that preceded this final day nail-biter and took the lead through one of those marquee signing, Dion Dublin.\n\nAnd just before the break Paul Williams doubled their lead sending City fans into hysteria.\n\nTottenham pulled one back through Paul McVeigh to set up a nervous second-half that saw a string of stellar Steve Ogrizovic saves keep Coventry in the lead and in the top flight.\n\nAt full-time, the scoreboard read six minutes past six as the rest of the Premier League awaited news.\n\nThe club’s captain at the time was Scotland legend Gary McAllister, who said it was the best game he experienced during two spells and six years at the club, setting up both goals.\n\nHe said: “It was just an amazing game. For me, the thing about that game was just seeing the belief on the faces on the supporters who came in their thousands that day.\n\n“But it was also the kit man and the bus driver, the emotion showed by those people that day when we survived was something I’ll never forget.”"}, {"url": "https://www.ccfc.co.uk/news/2020/may/great-escapes-spurs-1997/", "page_content": "During Coventry City’s proud years as a top flight club, the Sky Blues developed a reputation for their last-gasp Houdini escapes from relegation.\n\nDuring Coventry City’s proud years as a top flight club, the Sky Blues developed a reputation for their last-gasp Houdini escapes from relegation.\n\nSome suggested that if the Titanic was painted Sky Blue, it would never have gone down.\n\nWhile ideally you’d never leave it that late, those occasions bring their own enjoyment (eventually) and memories as City’s players demonstrated the courage and determination to get the required result.\n\nIn this series we’ll be looking at some of those escapes from relegation - starting with events from on this day in 1997…\n\nTOTTENHAM HOTSPUR 1-2 COVENTRY CITY, 11th May 1997\n\nWATCH HIGHLIGHTS FROM THE GAME ON OUR YOUTUBE CHANNEL HERE\n\nIn all of the final day escapes the Sky Blues had over their top-flight days, there are not many that compare in tension to this Sunday at White Hart Lane.\n\nA week before, a dreadful defeat to Derby seemed to have condemned City to relegation. Gordon Strachan’s side lost 2-1 and relegation rivals Sunderland, Southampton and West Ham had all won. The Sky Blues would have to win on the final day and rely on defeat for Sunderland and Middlesbrough not getting a result at the same time to stay up. The odds were stacked against them.\n\nThe tension of the occasion and the day was immense and unrelenting.\n\nKick-off was scheduled for 4pm, with coverage of all the action around the grounds across Sky Sports. In an echo of the past, traffic problems led to a delayed kick-off for a Coventry City game – the M1 and M25 were clogged with Sky Blues supporters making their way to North London, and the start of the fixture was put back by 15 minutes.\n\nDespite impressive performances in recent weeks Strachan was on the bench, opting for an attacking line up that included Darren Huckerby, Dion Dublin, Peter Ndlovu and Noel Whelan – the intent was clear – plus a recall for the experience of Kevin Richardson.\n\nWhile nerves and tension flowed through the 4,500 City fans at White Hart Lane, the Sky Blues team seemed up for the occasion and nerveless. Tackles flew in thick and fast, with David Burrows booked after only two minutes and Noel Whelan fortunate not to get early marching orders too.\n\nCity took the lead with 13 minutes on the clock. After a short corner, the ball was returning to Gary McAllister who swung a delightful cross into the Spurs box. Dublin leaped highest on the edge of the six-yard box to head past Espen Baardsen in the Tottenham goal.\n\nAfter Steve Ogrizovic had to make a smart save from Ruel Fox, the Sky Blues doubled their lead. McAllister’s corner, this time a deep one from the right, reached the swinging boot of Paul Williams around the penalty spot and the ball flew into the net.\n\nHowever, with 39 minutes gone Spurs pulled one back. Teddy Sheringham’s free-kick came back off the crossbar and fell kindly for Paul McVeigh to prod home. McVeigh almost brought things level before half-time, but Ogrizovic was brave to dive at the striker’s feet and bring his mazy run to an end.\n\nThe second-half was unbelievably tense – just one goal for Tottenham would see City relegated.\n\nOgrizovic made a terrific diving save from a Jason Dozzell header, and City fans were still in a world of nerves.\n\nBefore the days of smart phones and apps, the radio was king on days like this and thankfully the news it was bringing was good news, with the traffic delays meaning the full time scores elsewhere were know before the final whistle at White Hart Lane.\n\nMiddlesbrough and their continental stars such as Juninho and Ravanelli could only draw at Leeds – they were down. After a seemingly endless wait, Sunderland’s defeat at Wimbledon was confirmed.\n\nCity just had to hold on to their lead.\n\nOgrizovic pulled off a point-blank stop from Neil Fenn’s low shot – from the resulting corner, another Dozzell header was saved by Oggy. The pressure from Tottenham was immense, and City seemed camped in their own half as pressure told.\n\nThen the final whistle blew, and survival was confirmed. Tears of joy and relief flowed, and City’s ‘Great Escape’ was complete sparking jubilant scenes.\n\nOgrizovic was named man of the match, and years later the Sky Blues legend shared his memories of the day:\n\n\"Take the FA Cup final out and that was the best day I had in football. People had written us off and we had to rely on a number of other results.\n\n\"We started 20 minutes later than everyone else, so the results had filtered through and the last 15 minutes were precarious.\"\n\n\"It was one of those days when the Coventry fans were unbelievable, it felt like a home game.”\n\nSpeaking after the game, Strachan said: “They said ‘we have won nothing’ but they have won something. They have won their pride back. They can look people in the eye again.”\n\nGoals: Dublin (12) Williams (38) 0-2; McVeigh (43).\n\nTottenham Hotspur (3-5-2): Bardsen; Vega, Scales, Campbell; Carr, Fox, Dozzell, Sinton (Clapham, 22), Edinburgh; McVeigh (Fenn, 73), Sheringham.\n\nSubstitutes not used: Brown (gk), Brady, Arber.\n\nCoventry City (4-4-2): Ogrizovic; Telfer, Shaw, Williams, Burrows; Whelan (Jess, 33), McAllister, Richardson, Ndlovu; Huckerby, Dublin.\n\nSubstitutes not used: Filan (gk), Eustace, Breen, Strachan.\n\nReferee: M Bodenham (Cornwall).\n\nBooked: Tottenham: Edinburgh, Sheringham. Coventry: Burrows, Richardson, Williams, Whelan.\n\nAttendance: 33,029."}, {"url": "https://www.thecelticwiki.com/managers/strachan-gordon/", "page_content": "Personal\n\nFullname: Gordon David Strachan\n\naka: Gordon Strachan, WGS (Wee Gordon Strachan)\n\nHeight: 5.06\n\nWeight: 10.06\n\nBorn: 9 Feb 1957\n\nBirthplace: Muirhouse, Edinburgh, Scotland\n\nPosition (as a player): RHS Midfielder (attacking)\n\nInternationals (as a player): Scotland\n\nInternational Caps (as a player): 50 caps\n\nInternational Goals (as a player): 5 goals\n\nManager: 1 June 2005 – 25 May 2009\n\nSucceeding: Martin O’Neill\n\nSuccessor: Tony Mowbray\n\n“I don’t know if there is another big club where the supporters have a love like the supporters have a love for this club.”\n\nWGS on the Celtic fans (quote taken from “Celtic Minded 2” (book), 2006)\n\nPlayer\n\nDuring his playing career he played for\n\nDundee (1974-1977),\n\nAberdeen (1977-1984),\n\nManchester United (1984-1989),\n\nLeeds United (1989-1995) and\n\nCoventry City (1995-1997).\n\nHe won 50 international caps for Scotland and is in the Scotland Football Hall of Fame.\n\nGordon Strachan was an aggressive, skilful right-sided midfield player. He never played for Celtic as a player, and generally was not the most popular opposition player. Nippy and aggressive, he irked some of the Celtic support but mostly it was due to his ability as being just a great player for Aberdeen during a golden period for them.\n\nOverall, he was a great entertaining Scottish player and the Celtic support appreciated that at least.\n\nManagement\n\nWGS became Coventry City’s Director of Football in November 1996.\n\nHe finally retired as a player at the end of the season after making his last appearance at the age of 40, a record in the English Premiership.\n\nStrachan kept Coventry in the Premiership until 2001, when they finally went down after 34 years of top division football. He was sacked shortly after the start of the 2001-02 Division One campaign.\n\nGordon Strachan returned to management within weeks, taking the manager’s job at Southampton – after Strachan’s appointment in October 2001, they finished 11th in the Premiership.\n\nIn 2002-03 when they finished eighth and reached the FA Cup final, where they lost 1-0 to Arsenal, but since Arsenal had qualified for the UEFA Champions League, Southampton qualified for the 2003-04 UEFA Cup.\n\nIn March 2004, Gordon Strachan announced his resignation as Southampton manager, earlier than intended because he wanted to spend time with his family.\n\nWhen Berti Vogts stepped down as Scottish national coach, Strachan was widely tipped to take over until Walter “Wattie” Smith got the job, and he was even linked with the manager’s job at Portsmouth, but turned down the offer to take over. He later took on the Scotland role from January 2013 as the popular choice amongst the Scotland support, resigning in October 2017 after failing to get Scotland through to at least the play-offs of the 2018 World Cup, and having not qualified to Euro 2016.\n\nGordon Strachan has also been an analyst of football matches for the media, most notably on the BBC’s Match of the Day 2 show. Renowned for his deadpan humour as much as his shrewd tactical awareness, quotes attributed to Strachan have become legendary among football supporters.\n\nAs Celtic Manager\n\nGordon Strachan finally returned to management on 1 June 2005, when he succeeded Martin O’Neill as manager of Celtic in the Scottish Premier League (SPL).\n\nHe resigned on 25 May 2009, after 4 years in charge having won the league three times in a row, with a lot to look on to be proud on, both domestically and in European competition.\n\nPREMIER LEAGUE CIS LEAGUE CUP SCOTTISH CUP EUROPE TOTALS SEASON P W D L F A PTS P W D L F A P W D L F A P W D L F A P W D L F A 2005-06 38 28 7 3 93 37 91 4 4 0 0 9 2 1 0 0 1 1 2 2 1 0 1 4 5 45 33 7 5 107 46 2006-07 38 26 6 6 65 34 84 2 1 1 0 3 1 5 5 0 0 13 3 8 3 1 4 9 10 53 35 8 10 90 48 2007-08 38 28 5 5 84 26 89 2 1 0 1 2 3 4 2 1 1 9 3 8 3 0 5 7 10 52 34 6 12 102 42 2009-09 38 24 10 4 80 33 82 4 4 0 0 9 1 3 2 0 1 4 3 6 1 2 3 4 7 51 31 12 8 97 44 TOTALS 152 106 28 18 322 130 346 12 10 1 1 23 7 13 9 1 3 27 11 24 8 3 13 24 32 201 133 33 35 396 180\n\nFirst season (2005-06)\n\nFor 2005/06, his stated aim was to regain the SPL title off current holders (Rangers).\n\nThings didn’t exactly get off swimmingly, and an embarrassing start to his campaign as Celtic manager losing 5-0 to Slovakian champions Artmedia Bratislava on 27 July 2005 and 3 days later only managing to draw 4-4 away to Motherwell in his first SPL match in charge of the Glasgow club. A few days later he recorded his first win in charge as Celtic won 4-0 in the return leg of the Champions League qualifier.\n\nHowever, that was not enough to avoid being put out of Europe before the season had got started in earnest. For many Celtic fans, these set of matches set the tone (for both WGS and the supporters) on how the mentality on governing the side’s tactics was to be for future matches. It was a huge psychological blow, and some fans never seemed to forgive him. It was too regularly brought up in seasons to come.\n\nNevertheless, Celtic improved under Strachan, leading the SPL by as much as 20 points at one point despite playing with a defence that came under regular criticism from the media and fans. Rangers were in turmoil as Alex McLeish lurched from one disaster to another. Two notable victories over Rangers in November (scoring 5 goals and conceding none) was a gem of a time, and saw the emergence of Shaun Maloney as a front runner for the team.\n\nNot all went Celtic’s way, and another low-point was the shock defeat in the third-round of the Scottish Cup to First Division Clyde on 8 January 2006. However, the following month his team made history when they beat Dunfermline Athletic 8-1, a record victory margin for the SPL. Over the period after beating Rangers twice in November, the First Team went through a poor spell for two months where the First Team went behind in too many games, but thankfully fought back in to recover.\n\nWorse was that the First Team kept on conceding goals in all the games. It was not until Celtic played against Rangers in mid-February that the first team had a game that they didn’t concede a goal in.Celtic were winning games but the weaknesses of the side were beginning to be seen, and in many ways they were the weaknesses that were to begin to haunt Celtic for over the next couple of seasons.\n\nAn important point that has to be made is that this was a season of transition, and anyone taking over from Martin O’Neill as manager was going to have a hard task in front of them (a lot to live up to). Spats with Sutton and Agathe, saw both leave prematurely yet both could have contributed more. On the other hand, the players have to take in that the old regime was over and you have to understand and work with the new regime. With the less than stellar playing achievements of both after leaving Celtic, maybe WGS was right. Sutton in particular can be a prickly character and not predictable, so maybe it was best to move him on.\n\nOverall, Strachan’s first season was ultimately successful as he coached Celtic to victory in the Scottish League Cup and, on 5 April 2006, his side clinched the SPL title in record time with six matches remaining. A difficult year of transition, but he’d won most over to his side at this point.\n\nReflecting this achievement, Strachan was voted ‘Manager of the Year‘ by the Scottish Football Writers’ Association eight days after the title was clinched.\n\nThis was just the beginning, and much better was expected of both him and the team in the next season in terms of entertainment and results (goals conceded, scored etc).\n\nSecond season (2006-07)\n\nHis second season was even more of a roller coaster compared to his first, with excuses out the window for many, and the arrival of Paul le Guen (PLG) seen by the press as leading “Le Revolution” at Rangers to challenge Celtic. To the surprise of practically everyone, there was no actual domestic challenge. Rangers went comedic from failure to tragic farce, and Celtic simply took advantage going over 20 points ahead of them at one point in the season. In games v Rangers, the best PLG did was one draw. The ‘Hearts Revolution’ was also a joke with their challenge petering out before it had even began.\n\nKnocked out early in the league cup was no issue, and WGS easily made it up with winning the Scottish Cup to wrap up a cup and league double. Overall, WGS was having a respite domestically from any strong challenge, but nobody should understate the level of his achievement. Whilst others floundered, he ensured that Celtic did not, and the players were building up a fair reputation as a unit.\n\nThe Champions League was where it’s at, and there he excelled. Despite a tough group, Celtic won all three home games, with a special victory against Man Utd which led Celtic to qualify from the Group stages for the first time. You can’t understate the work done by Gordon Strachan in this. He galvanised the players and had set them out correctly to push further than they expected. Not a unit of players as highly rated together as the best under Martin O’Neill yet they achieved what they did not. The players were fit and able, and were pushing to the last minute of matches. It made a whole difference. Strachan was able to utilise players like Nakamura to his best and it was paying out.\n\nOn the other hand,Celtic were poor away from home and lost all 3 games, with WGS stating that he knew the problem and would have it resolved. The next round v AC Milan was very special for the Support, and WGS held to what he said and the first team didn’t concede in 180mins of football, but sadly didn’t score either. Ultimately,Celtic were outdone by a classic goal by Kaka in extra time. A sad way to go out, but a great achievement by WGS and he deserves all the credit in the world.\n\nRegardless of the European achievements, some criticism must also be put at WGS for his second season domestically. The quality of football in the last third of the season in particular was appalling, and the player effort by too many of the squad was deemed non-existent. Rangers’ new manager (Walter Smith) had the better of WGS with a very comfortable win in the last game v Rangers in the season, and Celtic lost in some very drab games. People pay to enjoy the product on the pitch, it really was not good at Celtic. It wasn’t ‘The Celtic Way’.\n\nA number of the signings were disappointing that season, Gravesen, Miller and Jarosik in particular, whilst Jan Venegoor of Hasselink was injured too often. A spat with Maloney over new contracts saw the club lose a great new wee player (transferred to Aston Villa) and the defence was as bad at the end of the season as at the start. The manager appeared to bamboozle and patronise fans on many occasions with his team selections, and what appeared to be a continuing spat with Derek Riordan saw the player play few games and being overshadowed by the far less productive Kenny Miller. A round of boos as Riordan was taken off in one match late in the season was evidence of this. It was a sorry situation.\n\nMany fans were simply disillusioned by WGS at the end despite the successes, and simply couldn’t see where he was taking the team. The fear was that the club was moving backwards despite what had been accomplished in the last year. This should have put an end to the rubbish that the fans didn’t like him as he wasn’t a “Celtic man” (lazy journalism), it was all because of the criticisms as said above. A real roller coaster of a season, and after all the achievements in the season it’s sad to have to have to summarise it all in a negative tone.\n\nThird season (2007-08)\n\nFor WGS, this season had seen him lose the support of most of the fans. However the death of Tommy Burns and his near breakdown after his loss (a close friend and work colleague) showed a side of WGS which many had not seen before in his time here.\n\nThe Support all felt for him and just how much the job and the club really did mean to him. Winning the league against the odds (big odds at that) appeared to have moved the fans and split the fans opinion on him whether to stay or go at the end of it all.\n\nThis season for WGS can be termed a success on paper. To quote him, the team achieved what he set out at the start of the year to do. On paper, Celtic won the league (three in a row) and got through the Champs League group stages again (two in a row) which cemented the club as being more than just a flash in the pan side as others in the past have been cynically referred as being.\n\nCeltic sold hapless Kenny Miller to Derby County for £3m (amazing!), brought in a few quality players like Barry Robson, beat Rangers twice at home in very entertaining games and so on. Adding in that Celtic were seven points (plus a game played more) behind Rangers going into the end of the season, WGS must be given his due, even by his harshest critic, for leading the team to somehow comeback and win the league. The first team won the last seven games (which included 2 wins v Rangers) and got much pride back. That can’t be smirked at by anyone, and the last win came just a week after Tommy Burns death (not an easy time).\n\nAt the end of the day, his style of football was uninspiring and unentertaining, and he seemed to stick with some players in his squad way beyond what he should have and then moved them on (e.g. Caldwell, Donati, JVoH), demonstrating an inability to accept criticism and that he had been wrong. A public rift with Derek Riordan depicted an unsettled atmosphere in the changing room although other comments by players, like Mark Wilson, Pressley and Venegoor, said otherwise praising WGS for his man management skills.\n\nBringing in Barry Robson into the Celtic team seemed to show admission that he needed steel in a lightweight side (and what a change he made to the team), whilst Hartley was a revelation this season and deserved all the praise in the world. Boruc as ever was great, but a kick up the back side was needed as it took him a year to manage a game where he didn’t lose a goal away from home.\n\nAllegations were thrown at the Celtic support that they were spoilt (see this story) and that the support didn’t like WGS as he wasn’t a ‘Celtic man‘. Complete balderdash and it was simply sloppy & cheapshot journalism. The fans pay up good money to watch Celtic, and many a time the performances were dreadful to watch with the manager unwilling to admit change was needed and seemed to anger many, especially when he criticised the fans for not understanding what he was trying to do. The zonal defensive play was not working, the formations weren’t working and certain players needed a kick up the backside.\n\nThe First Team lost v Inv Caley when they were two ahead, lost against Hibs, Motherwell and even struggled in games v Gretna. The First Team lost the first two games v Rangers, with poor tactics amongst other points to blame for it. Transfers weren’t working out, especially the enigma that was Donati. Taking in the club had spent more money than Rangers, it was embarrassing to go behind in the league and watching Rangers going to the end for a very undeserved potential quadruple (which thankfully they didn’t achieve).\n\nAdding all this up, WGS has to take flak. However, as said, his emotions after Tommy Burns showed his real self to everyone and all felt for him. This season may probably have shown him to be more of a coach than a great manager, but unlike the other pundits on television at least he puts his money where his mouth is and takes up the challenge of football management. Moving on to next season he should have learnt from what had happened to become a more complete rounded manager.\n\nMust be said, any manager who wins three league titles in a row must be doing something right, so maybe the critics amongst the fans are wrong. A late find in Barry Robson was a revelation, whilst bringing Lennon into the coaching staff seemed to freshen things up.\n\nWGS can be quite an enigma but moving into the next season, more entertaining football really was a requirement.\n\nFourth Season (2008-2009)\n\nSo, was WGS to cement his name as a legend at Celtic by achieving the coveted “4-in-a-row” of league titles? But more importantly, it was questioned on how was his relationship with the fans going to develop this year? It was a (near) clean sheet for many on WGS after the emotional end to the last season.\n\nBefore the season had even begun, rumblings (as usual) had restarted about WGS and his transfers. Few buys to excite the fans made many apprehensive about the hope for greater entertainment, but in general the mood was that, despite all else, Celtic were going to win the league (confidence was high).\n\nThe season started off rather easily until the first game v Rangers where basically Celtic were turned over (at home) 4-2 and lucky not to have lost by more. The first team were hopeless, and the daggers were out for the manager. The pent up frustration from sections of the crowd was released in one big explosion, and the tone was decidedly frosty for the rest of the season with respect to the manager’s relationship with the fans. Not a good start.\n\nNevertheless following on from there was a cracking set of games which saw Celtic take advantage and overhaul Rangers to go top of the league. There was some great football in the first third of the season, and this was the best to watch Celtic for a few seasons at least.\n\nAnyhow, the big headaches of the season began with injuries besetting the manager in his aim to overhaul Rangers. Credit to WGS as his policy of squad numbers above single big signings did pay off which enabled Celtic to be able to squad rotate players to cover for gaps in the side and keep their nose in front. Amazingly Celtic went 7pts ahead at the end of November, and December became the brightest time of the season and it was capped off with a Scott McDonald inspired 1-0 victory at Ibrox against Rangers. Great! Everyone thought Celtic were set up for the rest of the campaign. How the support were to be disappointed.\n\nDuring all this was the Champions league escapade. A poor final set of results saw Celtic finish bottom of their group and again fail to win any of the away games (see link for full write-up). After 4 years, WGS still hadn’t managed an away win in Europe, something that can’t be put down to bad luck alone, and something that was noticeable to all. Celtic got the breaks last season in Europe, this time they didn’t.\n\nBack to the league, when did it all begin to go wrong? Basically from the turn of the new year, yet WGS seemed to do little.\n\nWhat was going on? To everyone’s surprise, WGS himself summarised the situation well in a post-match interview:\n\n“You have to determine your own destiny. The eyes of the football world are upon us all. The question being asked is, ‘Are you a team that plays just when everything is right for you?’ That can’t happen. The best way for us to recover is to get back on form as quickly as possible.” (Mar 09)\n\nHowever, he quickly turned back to old irritating ways by stating in an interview a few weeks later: “If anyone can find a negative – and I’m sure they will – then they are warped!” after a Dundee Utd game in April where Celtic drew 2-2. Clearly and sadly showed a dividing line between the management and the fans. An unnecessary dig and it was an unworkable relationship. This post-match comment was very insulting and patronising to the support (and uncalled for). Difficult to see how things were going to be mended easily for many. Why exactly did WGS have to patronise and insult the support? Only he could answer this question, but best left to the end of the season.\n\nAdd to that, complaints about the lack of entertaining football were being swatted away with abandonment: “In terms of entertainment, yes, we do have responsibilities at Celtic and Rangers, because we have greater resources than most clubs up here to entertain, But most of the songs that the supporters sing are all about winning trophies — they don’t sing nice wee ditties about the beautiful game. No one remembers the beautiful football, but they do remember the defeats.” This line again seemed to show his distance from the Celtic ideal.\n\nOne nice break was the league cup final, beating Rangers 2-0 after extra-time, with both goals scored by two Irish internationals (O’Dea & McGeady).\n\nFrom then on in, little went right for Celtic again, and after dropping points, Celtic were up against Rangers to see who was to win the league. The final league game v Rangers was a failure, losing one-nil and from then on the writing was on the wall.\n\nCeltic had lost the league to a poor Rangers side. The Celtic players did not perform, and the apathy around the club was heart-breaking. It was overall a poor season with under-performing players.\n\nThe football was generally poor to watch and it had been a continual complaint over the past few years. For many who were tired of the turgid football on display this was a bit much, and swathes of empty seats at Celtic matches became the norm rather than exception. With the global credit crunch beginning and hitting one and all, it was not a time to alienate the support. Yet WGS did, so why? Who knows? It doesn’t require much to get on the side of the fans.\n\nThere are many reasons for the loss, but the manager has to take the flak and he was not one to ever take criticism lightly, being self-admittedly easily irritated. In fairness there were mitigating points, e.g. the loss of Barry Robson to injury was probably more costly to the First Team than anyone realised, as he was a strong driving force to the title run-in last season.\n\nWGS handed in his resignation with little surprise the day after the league defeat, and he left rightly with his head held high for his achievements over the past four seasons with uncharacteristically no smart remarks from him (thankfully). There was actually some sadness to see him go as there had been many good memories over his time. He had been the creator of his own downfall this last season, and in his own reflection on this last season will have to admit, to himself at least, where he went wrong.\n\nReview\n\nSo after all that, how should anyone take and look back on WGS? His predecessor is still lauded to this day, and in reflection Martin O’Neill’s achievements were hanging over WGS during his whole tenure at the club. Regardless, he had to deal with them, and if truth be said, then WGS can argue that on paper at least he has exceeded on par with what Martin O’Neill achieved. Not that WGS would but the argument of who was the better manager (WGS or MoN) was a never ending debate which is all academic now. Martin O’Neill was blessed to have had Henrik Larsson at hand so comparisons for WGS aren’t easy or likely entirely fair.\n\nForgetting his predecessor, WGS had a few tasks to fulfill. Firstly, was to regenerate the squad and lower the cost base after the more spendthrift MoN years, win the league back and get Celtic further in Europe. On that score, he more than achieved what was set out. Wage costs were reduced, Celtic won the league back and in time achieved getting past the group stages in the Champions League twice in a row. Brilliant stuff.\n\nWinning the league three times in a row, as well as outliving two Rangers managers is surely a sign of success, especially after the hoo-haa over Paul Le Guen’s management signing. Add in some incredible achievements in Europe (e.g. in beating European Cup holders AC Milan, the Naka winner v Manchester Utd, qualifying twice out of the Champions League group stages etc), and he can easily hold his head up high. The support were spoilt with success at many points.\n\nWhen Celtic won the league for the third time with him as manager, there is no denying that he had silenced all the doomsayers who were worrying that Celtic were out of the league title race. That last seven game winning run to win the league title against the odds will be spoken about for many a year. It was a phenomenal achievement to pick the players up and get them motivated. No matter what else can be said of his managerial ability, that was exceptional. The First Team came so close to reaching the quarter-finals of the European Cup in one season and what a mark that would have been. This was all done without the sublime talents of Larsson, Petrov and Sutton.\n\nEurope had been a sore bugbear for predecessor Martin O’Neill, and Gordon Strachan achieved what Martin O’Neill failed to achieve by qualifying past the group stages (and did it twice). It put Celtic on the pedestal with the premier clubs in Europe, and it was a great place to be.\n\nGordon Strachan was the architect for the high points, and when they came off they were exceptional, and WGS deserves all the credit in the world. Post-match interviews could also be enlivened by some of his emotive witticisms, which on a number of occasions lightened the mood and made everyone smile.\n\nThe most exciting game? Well there were many. WGS himself said that the Spartak Moscow win in 2007 was the most exciting and many would agree but defeating Manchester Utd 1-0 to reach the KO stages of the Champions League was also very special.\n\nHe also helped to foster the careers of some of the younger players, such as Maloney, McManus, McGeady & Wilson, and in reflection they will be thankful for the role that WGS has played in their careers. Some will succeed (at Celtic or elsewhere) whilst others inevitably won’t but at least he gave them the opportunity. WGS likely was the best developer of youngsters we’d had for the past twenty years or so. Billy McNeil was the last to have done well with youngsters in the squad.\n\nSo why in reflection, is the mood relatively more sombre over WGS than an outsider would expect? Much of it has been reflected above in the season reviews. The fans can be said to have been very patient with him, but the truth is that the football in general was too often poor to watch and after four years of that, what are the fans to say? He failed with a number of big transfers, and many players seemed to have declined under him rather than improved.\n\nMany fans take the belief that he couldn’t coach well; confusing squad rotations and team selections baffled players as much as fans, and the last season was woeful in so many ways, throwing away major leads. Tackling Rangers in his last two seasons shouldn’t have been as difficult as it was as Celtic were far better resourced, yet tripped up in both seasons and only got out of jail the first time.\n\nHe never helped himself with a number of his post-match remarks either, the “warped” comment in his last season in particular was particularly poor judgement. He readily admits that he is easily irritated, but he’d been in football for over twenty years and worked in the media for some time, so he should have been able to know how to deal with it. Yet he couldn’t or wouldn’t!\n\nMany would agree that “ned-culture” had been on the rise, and WGS in particular had been very vocal on this issue, taking journalists to task on occasion as well. However, when you give a flippant remark to a question or a thinly veil snide remarks to others, then how really is anyone to see him in a different light to those he criticised? Bit extreme but the point stands and he could end up making things worse for himself. All are irked by neds but he made too much of a crusade of it at times, and at Celtic it was the wrong place for his campaign.\n\nCeltic is a social community club, and thefore reflects a cross-section of society. So admittedly the support can have a small share of nefarious characters, but the support does push and emphasise the roots of the club in terms of charity and community, and this in turn is reflected by the good nature and reputation of the support. Winning is not the only aim, it’s also about the ineffable “to play the Celtic Way”. WGS did not seem to comprehend this, and dismissed any criticism of his tactics stating that others didn’t understand what he was trying to do. That was simply nonsense.\n\nHis “win at the cost of entertainment” style may find favour in the cut-throat English championship but not at Celtic. That in itself had been what has been the crux of the friction between the support and WGS, and that was what created his downfall. He did things by the training manual but that is never sufficient, and he could be quite robotic with his decisions (such as always subbing on players in matches at an exact certain time) so leaving little room for flexibility or showing that he was able to be experimental in matches.\n\nFrom the outside, everything appeared to be rosy as Celtic won trophies but it’s about more than that with the Celtic support. The supporters weren’t most often enjoying the play on the pitch, reflected in the falling attendances.\n\nWGS is actually a very decent man. The players all spoke very highly of him, and there was little if any dissent at the time (McGeady and Riordan apart) even from those who left prematurely, although one or two (e.g. Sutton & Gravesen) have been quite critical of Strachan since leaving but much later on. All Celtic fans who have met him have generally commented well on him. Away from it all, a long one-on-one interview in December 2008 with Radio Scotland brought out his good side and there was a general amount of respect for him from this.\n\nHowever, that’s not the full qualification to be a successful football manager, and WGS’ natural managerial ability was below that level which all wish he was at. Maybe if he had spent some time with some great managers learning their skill, he could have been a far better manager. He was a player with Manchester Utd and Aberdeen under Alex Ferguson but his coaching began at Leeds (under the dour Howard Wilkinson) and then Coventry, and sadly it’s those latter clubs that his coaching philosophy stems from. Ex-Celt Gravesen in an interview in 2018 commented on Strachan’s extreme fear of losing games, noting criticisms made to Gravesen on defending the lead when he had scored a hat-trick after the game in question.\n\nAn important point must be noted that WGS is the first Celtic manager to have to grapple with the new media. Martin O’Neill was manager when the internet got going, but it was in its infancy throughout most of MoN’s reign, and the scale and importance in which the internet had taken in WGS’ time had meant that he had another task to take on.\n\nIt’s not easy anymore. Replays and events are dissected more thoroughly and for longer than ever before. There are cameras to capture everything, statisticians to tally up the most mundane of figures and heated wipe-spread discussions begin on the matches before they’re even over (on the forums & social media) and not hours later in the pub as it all used to be. Sky Sports & its peers are everywhere, and unconscious comparisons with richer foreign leagues had been rising, which doesn’t help with the club’s limited resources. Sadly, that was the future, and WGS was the first Celtic manager to deal with it and few seemed to sit back and notice. Maybe if they did then he’d have been cut more slack.\n\nHis biggest mistake? Should have left at the end of 2007/08 season as many fans were calling for. He stayed 12 months longer than he should have, and that set in the rot which accelerated over time. At the end of it all, most fans wanted him gone, and it’s sad to see him have to leave in that kind of atmosphere. Much of it had been of his own creation, and his successor had the unenviable task to rebuild the squad in much the same way that WGS himself had to when he himself began.\n\nFor those who still believe that the Celtic support were irrational, they should take the following comment from Middlesborough legend & ex-player Bernie Slaven on Gordon Strachan’s brief reign at Middlesborough after leaving Celtic, as there are parallels from his comment to the Celtic supporters’ criticisms of Strachan’s time at Celtic:\n\n“After a year in charge, we [Middlesborough] had not improved one iota – the football was average, away results were abysmal, the worst league position in 20 years and he still doesn’t know his best team. It wasn’t just on the field that Strachan let himself down, off the field during post-match interviews he became an embarrassment to himself, the club and the fans. He was arrogant, obnoxious, sarcastic, cutting and rude. He came across to me like a man who was on the borderline of insanity.”\n\nWe hoped WGS all the very best in the future, in whatever direction he was to take. Everyone knows from his honest comments that he grew to love the club, just at times his daft side too often got in the way. He is a good man, and for the great memories all will forever be thankful for them and there were a number of them along the way. In time, all at least missed his sense of humour from his interviews [see Quotes by and on Gordon Strachan].\n\nHe signed off from Celtic with a wonderful speech which contained the following great quote (from the Tommy Burn’s tribute match, full wording below):\n\n“I wasn’t going to pretend I came here as a Celtic supporter. I don’t believe in kissing badges to get your support. I didn’t know the words of ‘Fields of Athenry’…. [but] From today, I’ve become a Celtic supporter.”\n\nGordon Strachan (May 2009)\n\nPost-Celtic & Scotland management\n\nSince leaving Celtic, he had a relatively unsuccessful time as manager at Middlesborough. He took over a set of former Celtic (& Rangers) players to his new club making it dubbed by some as some kind of Glasgow old boys team. It didn’t work out at all, and his time as a club side manager was over.\n\nHe returned to football analysis on TV & Radio, and to the joy of every Celtic fan, he has been incredible towards Celtic. Never hides his sympathy, and talks up the club at every opportunity. Really puts to shame some former players who have taken pot-shots. Without the pressure of management, Strachan has shown his knowledge of the game on TV and applied it in an easy accessible manner for the viewer and is very popular. A very different character to the fish-bowl like environment that a Celtic manager has to endure in Glasgow.\n\nThe support was very much warming to him, and possibly it’s an indication that he may have regretted not having shown this more amiable side during his time at Celtic. Sometimes you don’t know what you have until it’s gone, and maybe only once he was at a distance that he was able to admire what Celtic had offered and given him. The affection that Strachan now has with the support was increasingly mutual as was shown on his frequent trips back to Celtic Park.\n\nMust add that he had acted as a mentor in part for Neil Lennon. At one point there were stories of bringing Strachan back as a paid mentor for Neil Lennon but this didn’t materialise. However, he has still acted as such and Neil Lennon publicly paid his respect to Strachan once after advise given by him which helped Celtic win a vital game against Rangers (and helped keep Neil Lennon in his job).\n\nCuriously, Strachan has claimed that there was no bias against Celtic in his time as manager of the club, but then again Rangers were so bad during much of the spell, bias wouldn’t have made a difference (as it was to do so during Lennon’s reign).\n\nScotland Managerial Tenure\n\nOver his entire time as a manager, his name was continually brought up as a possible future Scotland manager, and with the lack of candidates putting themselves forward for the role, Strachan in January 2013 was announced the new manager. Interestingly, one of the first questions he was posed at his initial press conferences was: “Is this the biggest job in your career so far?”, to which Strachan retorted: “I was manager of Celtic, there’s no bigger job than that!”. Bless him, the support loved him more now than ever.\n\nThere was to be added spice for the Celtic fans. In 2013, Martin O’Neill was announced as the Republic of Ireland manager with ex-Celtic player Roy Keane as his assistant. If you ever read back to the old match threads, reports and reviews by Celtic fans from the 2000’s, a common argument was “MoN v WGS“, as who was the better manager: Martin O’Neill or Gordon Strachan?\n\nThe comparisons were difficult, and the arguments at times nauseating, but in 2014 both Martin O’Neill and Gordon Strachan were drawn to face each other in competitive matches for the Euro Championships. The first match was ironically played at Celtic Park as Hampden was being renovated, and Scotland triumphed 1-0, and the return leg ended 1-1 with ex-Celt Maloney (who had played under both at Celtic) the scorer for Scotland in both games. Nobody was going to truly believe this would settle any old arguments. Time has now passed by for the old debaters, and both managers should be respected for their time at Celtic.\n\nStrachan’s second run at qualification had certain parallels to his time at Celtic, as in the roller-coaster aspect. A grim start to the qualification for the 2018 World Cup was compounded by his stubbornness where he opted to remain loyal to old stalwarts rather than new players or those regarded as currently on form in the Scottish league. Many also argued he had a bias against those based in the Scottish leagues in preference to the English leagues.\n\nThe qualifying campaign for Strachan to the 2018 World Cup was a roller coaster mirroring that of his time at Celtic. Having begun the campaign very poorly, his head was on the block, only to incredibly recover but then fell at the final hurdle. Part of the problem was his initial intransigence to play Celtic players who were then by far the best in the country, publicly rebuking calls for more Celtic players, most notably Griffiths.\n\nA 3-0 loss to Lithuania at the start of the campaign featured no Celtic players, but the turnaround featured a number. His fall at the final hurdle was in part due to the loss of two key Celtic central midfielders (Brown & Armstrong) to injury. The biggest issue was to be his patter, and a post-match comment about Scot’s lacking height & genetics made him lampooned across the footballing circuits and infuriated everyone. He was still rubbing everyone up the wrong way.\n\nOn the other hand, Scotland were again a fighting side under his management. As at Celtic, last minute goals were notable event, e.g. crucial winner v Slovakia in Oct 2017, it was a great attribute. The amount of times his Celtic and Scotland teams have done it is remarkable. There comes a point where you can no longer say it’s luck or fortune, and he genuinely does instil a belief and winning mentality into his teams. Fair enough the football wasn’t always free-flowing and the mentality didn’t necessarily always turn into victories, but the winning belief was a great trait to have.\n\nHe resigned in Oct 2017 after failing to get Scotland through to at least the play-offs of the 2018 World Cup, and having not qualified to the 2016 Euros.\n\nFew were bemoaning the decision, but he had made a rod for his own back. His positives and negatives again came very much to the forefront in this role as it did at his time at Celtic. Sadly he would leave with little to write home about with Scotland (despite some progress) whilst his Celtic tenure had many wonderful highs. If anything, it vindicated the often ambivalent opinion the Celtic fans had of Gordon Strachan over his time at the club.\n\nPost-Football Management\n\nIn a curious twist of fate, his son Gavin Strachan was on the Celtic coaching staff in 2020/21 during the Covid-19 pandemic, and after a trip to Dubai due to Covid-19 isolation of 13 players and the manager & assistant manager, Gavin Strachan was the de facto acting manager for a couple of games. This meant the first father & their son to have managed Celtic.\n\nThere were reports he would join his son at Celtic, with Gordon Strachan given a role as director of football following Neil Lennon’s departure. This was though was shot down by a number in the support, and the board likely backed away from it as at that point there was a lot of friction between the board & the support. Gordon Strachan did eventually return to Celtic for a short consultancy role in 2021.\n\n[….]\n\nWe wished Gordon Strachan the best.\n\nHonours as Celtic Manager\n\nScottish Premier League winner:\n\nScottish Cup winner:\n\nScottish League Cup winner:\n\nSPFA Manager of the Year:\n\n2005–06, 2006–07, 2008-09\n\nSPL Manager of the Year:\n\nPictures\n\nQuotes\n\nForums\n\nArticles"}, {"url": "https://www.thefamouspeople.com/profiles/gordon-david-strachan-1535.php", "page_content": "Before he professionally started playing football, he was offered a contract by Eddie Turnbull to play for a club, but his father opposed the decision by stating that the club did not cover sufficient expenses.\n\nGeorge David Strachan was born to Jim and Catherine in Muirhouse, Edinburgh. He started playing for Dundee at the age of 14. The following year, he lost vision in his right eye when a pen in his pocket accidentally poked his eye during a football match on the school playground.\n\nRecommended Lists:\n\nCareer\n\nAt the age of 18, he outplayed Alan Ball in a friendly match with Arsenal. His outstanding performance won him the seat of a regular player for the 1975-1976 season, which also happened to be the inaugural season for the Scottish Premier Division.\n\nHe became the team captain for the 1976-1977 First Division campaign, but he lost his position soon, after a drinking incident with Jimmy Johnstone.\n\nHe quit Dundee and signed a contract with Aberdeen in 1977. Poor form and injuries crippled the 1977-78 season for him. However, he was selected for the 1979 League Cup where the team recorded two wins at the Celtic Park. His brilliant performance on the field earned him the SFWA Footballer of the Year.\n\nIn 1980, he was awarded his first cap in the British Home Championship, against Northern Island. Two years later, he was instrumental in getting his home team to qualify for the FIFA World Cup in 1982.\n\nThe 1982-1983 seasons were the most successful runs for the club and he made his mark by striking four goals in a 5-1 victory with Dundee in the League Cup. His team then went on to win the European Cup Winners’ Cup. They also defeated Hamburg in the 1983 European Super Cup Final.\n\nIn the 1984-1985 season, he took four goals in a total of seven games and even though he did not participate in the 1985 FA Cup Final at Wembley, the team went on to win the opening ten league games in the 1985-1986 season.\n\nAfter accepting a contract by Ron Atkinson, he led the Leeds United Club to the Second Division title in the 1989-1990 season. They finished fourth overall, but managed to secure a place in the semi-finals of the League Cup.\n\nHe signed a two-year contract with Leeds and captained them to record a victory in the league title of 1991-1992. However, due to poor health and back problems, he started missing a number of games and thus, became unable to build on the success of Leeds Untied.\n\nOn April 10, 1993, despite his downfalls and tough seasons, he scored a hat-trick against the Blackburn Rovers and then moved to Coventry City to serve as an assistant to the manager, Ron Atkinson.\n\nContinue Reading Below\n\nHe coached the team and trained them and also appeared in the seasons 1994-1995 and 1995-1996. The club struggled at the start of the 1996-1997 season, which resulted in Atkinson being asked to step down from the managerial position.\n\nAfter Strachan was appointed as manager, he helped his team reach the quarter-finals of the FA Cup in 1997-1998.\n\nIn 2001, he was appointed as the manager of Premier League Southampton, succeeding Stuart Gray. Under his leadership, the Southampton team earned their place for the UEFA Cup.\n\nAfter a brief hiatus, he returned to manage the team, Celtic, on June 1, 2005. Although he had a very shaky start as a manager, the team eventually began to do well under his management and started winning tournaments.\n\nOn October 26, 2009, he was signed on as the manager for Middlesbrough. However, after a series of defeats, he voluntarily stepped down as the manager during the 2010-2011 season."}, {"url": "https://www.scottishfa.co.uk/players/?pid=19&lid=1", "page_content": "Gordon Strachan OBE played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City.\n\n\n\nIn club football, he played 635 league games, scoring a total of 138 goals.\n\nHe was part of the Aberdeen side that defeated Real Madrid 2–1 to lift the 1983 European Cup Winners' Cup in Gothenburg\n\nStrachan earned 50 caps for Scotland, securing his place in the International Roll of Honour.\n\nHe played in two FIFA World Cup final tournaments, Spain '82 and Mexico '86, scoring in a 2-1 defeat to West Germany in June 1986.\n\nHe was named as the Football Writers Association Footballer of the Year in 1990/91 season while at Leeds. After two years at Coventry City he retired in 1997, aged 40, setting a Premier League record for an outfield player.\n\n\n\nIn 2007, Strachan was inducted into the Scottish Football Hall of Fame, and he was named Scotland national coach in January 2013."}, {"url": "https://www.strachanfootballfoundation.co.uk/about-us/", "page_content": "The Strachan Football Foundation is a not for profit community interest company. SFF was established in 2011 in Rugby by our director and founder Gordon Strachan, alongside Gavin Strachan and George Mackie. Who all wanted to bring together education and football for young aspiring students/footballers.\n\nThe foundation is committed to creating a learning environment to enable students to develop their personal growth through education, football and experiences at the foundation . We have worked closely with schools, students, parents and education providers to create a leading football education academy.\n\nSFF continues to grow to be the best for its students and we are constantly looking at furthering the programme. Our facilities are state of the art for both education and football.\n\nOur staff and mentors are among the best in their fields. They are constantly developing and are driven by their desire to make every student's experience at the foundation a positive one.\n\nOpen to students between the ages of 16-21. Students could potentially be with the foundation for up to 5 years ."}, {"url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-gordon-strachan-16000551", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet Sky Blues transfer latest, team news, match updates and analysis delivered straight to your inbox\n\nGordon Strachan had five years in charge of Coventry City from 1996 to 2001, during which he managed some hugely talented players.\n\nThe former Manchester United star joined Highfield Road in 1995 as a player/assistant manager under 'Big Ron' Atkinson with a view to taking the managerial reins.\n\nAlthough it was often tough trying to maintain the club's top flight status with relegation battles in the first two seasons, City held their own in the Premier League with a creditable 11th place finish in 1997/98 thanks, in part, to an impressive 32-goal partnership between Dion Dublin (18) and Darren Huckerby (14).\n\nThe Sky Blues finished 15th the following year and 14th in 1999/2000 when supporters enjoyed midfield maestro Gary McAllister pulling the strings for Robbie Keane (12) while wading in with 11 himself as Moustapha Hadji (6) and Youssef Chippo sprinkled a bit of Moroccan magic to the side dubbed 'The Entertainers'.\n\nSadly, Keane's departure signalled the beginning of the end to City's proud 34 years at the highest level as eight goals from his replacement Craig Bellamy and six from the late arriving John Hartson couldn't save the club from the drop in 2001.\n\nThe former Sky Blues boss effectively had two impressive and exciting teams over the course of his tenure, during which good players inevitably moved on and were replaced.\n\nThe likes of Peter Ndlovu, Noel Whelan, George Boateng, Steve Froggatt, Gary Breen, Mo Konjic, Swedish internationals Roland Nilsson and Magnus Hedman, Paul Williams and Richard Shaw, to name just a few, all pulled on the shirt and served the club well.\n\nBut of all the players Strachan managed during his five year spell, what is his best XI?\n\nHere the 62-year-old explains his starting side and names seven subs to fill the bench.\n\n“We had to change the team a few times because people were buying our good players,\" said the former boss, who went on to manage Southampton, Celtic, Middlesbrough and Scotland.\n\nStarting in goal, Strachan was blessed with the talents of Steve Ogrizovic who was later replaced by Sweden international Magnus Hedman before Academy star Chris Kirkland broke through towards the end of his tenure.\n\nBut there's only one man for the job, Strachan saying: \"In goals I'd have to pick Oggy who is the best goalkeeper I have ever worked with, and that’s from the age of 15 to now!\"\n\nThe right-back slot was occupied by a number of players including the immaculate Brian Borrows early on, the classy Swede Roland Nilsson, Marc Edworthy, the versatile Paul Telfer and Barry Quinn - both of whom were midfielders by trade.\n\n“Roland Nilsson at right-back, that’s for sure,\" he said, without hesitation.\n\nThe central defensive partnership proved a little more problematic for the ex-boss who took his time to ponder the options that included the likes of Gary Breen, Big Mo Konjic, Frenchman Jean-Guy Wallemme, Liam Daish and Scottish international Colin Hendry.\n\nBut two players who stayed the distance get the nod.\n\n“I’d probably go for Williams and Shaw,\" said Strachan, breaking into a chuckle.\n\n\"They were good together and just because neither of them would play with anyone else!\n\n\"They just liked to play with each other.\"\n\nThe left-back berth proved somewhat controversial.\n\nThe options include the excellent former Liverpool star David Burrows and home grown Marcus Hall who took over from him while a number of players filled in out of position.\n\nHe initially went for George Boateng, just to get him in the side after his initial midfield selection, but then changed his mind and went for a versatile option.\n\n“I have missed Paul Telfer, by the way,\" he said.\n\nAsked if Telfer could go on the bench, he replied: “You tell him he’s going on the bench!\n\n\"I tell you what, put him at left-back and put George in midfield instead of Youssef Chippo.\"\n\nHe added: “Kevin Richardson was a good player but put Gary McAllister in midfield.\"\n\npoll loading What's your favourite Sky Blues goal of the season so far? 0+ VOTES SO FAR Amadou Bakayoko's diving header at Charlton Conor Chaplin's free-kick against Plymouth Jordy Hiwula's solo run and super strike against Fleetwood Something else\n\nAsked about Noel Whelan who could play in midfield or up front, the Scot quipped: “I forgot about him.\n\n\"He’d be a substitute in my house and he could go from my house to the game.\"\n\nThe strikers/winger options include the likes of John Aloisi, Cedric Roussel, Steve Froggatt, Moustapha Hadji, Craig Bellamy, Ysael Zuniga, Viorel Moldovan and John Salako.\n\n“Darren Huckerby, Dion Dublin, Robbie Keane, that would be a front three,\" he said.\n\n\"I'd like to get Froggatt in there but I can't put Hadji on the bench. Tell you what, put Hadji in midfield and Froggy can go on the bench.\"\n\nClearly having not lost his sense of humour, he added: “Can I get Robert Jarni in there? Stick him on the bench!\"\n\nJarni, of course, a Croatian left wing-back and World Cup star, joined the club for £2.4 million from Real Betis but, infamously, never pulled on the shirt after being swiftly sold to Real Madrid for £3.4m.\n\nSome believed this was a joint Coventry City and Real Madrid tactic, as Betis refused to sell him to the Madrid giants, while the official line at the time was that the player changed his mind after he and his wife saw Coventry.\n\nIn conclusion, Strachan said: “I had some amazing players over my time there and they were a good bunch to work with as well. I am still friends with many now.\n\n“I had five good years and a desperate one at the end, but there you go.”\n\nGordon Strachan's best Sky Blues XI:\n\nSteve Ogrizovic; Roland Nilsson, Richard Shaw, Paul Williams, Paul Telfer; Darren Huckerby, George Boateng, Gary McAllister, Moustapha Hadji; Dion Dublin, Robbie Keane.\n\nSubstitutes: Magnus Hedman (GK), Noel Whelan, Kevin Richardson, Youssef Chippo, Steve Froggatt, Gary Breen, Robert Jarni.\n\nGordon Strachan is a Paddy Power ambassador, read his columns at news.paddypower.com\n\nDownload the CoventryLive app Click here for iPhone and here for Android\n\nVisit our Facebook pages for Coventry and Nuneaton or visit our Twitter pages for Coventry and Nuneaton\n\nWatch our videos on YouTube and see our photos on Instagram\n\nFor all your latest Sky Blues news, opinion, analysis and transfer gossip, click here"}, {"url": "https://deearchive.co.uk/player.php?id=767", "page_content": "Biography\n\nWhen Gordon Strachan returned to Dundee Football Club as Technical Director in 2019, it was great to welcome Gordon home to the club with whom he started his playing career. Gordon came through the youth ranks at Dens and made his first team debut in 1973 before becoming the youngest captain in the club’s history.\n\n\n\nThe more things change in Scottish football, the more they stay the same and for Dundee Football Club, this certainly rings true. Over the years the Dundee fans have had to watch a conveyor belt of nurtured talent leave Dens for a fraction of their worth and new Technical Director Gordon Strachan was one of those, when the Dark Blues let their young captain leave, simply to allow the club to survive.\n\n\n\n“There was nothing remotely glamorous about Dundee Football Club behind the scenes, especially when it ran into serious financial difficulty following relegation”, Strachan wrote in his biography Mt Life in Football.\n\n\n\n“There were fears we would have to go part-time. It was like the footballing equivalent of ‘I’m a Celebrity Get Me Out of Here’. The players’ training kit – including our pants – was only washed once a week on a Friday. After we had trained in it on Tuesday, Wednesday and Thursday, often in terrible conditions, you can imagine what sort of state it was in by the end of the week”\n\n\n\nThe financial situation for Dundee was dire following relegation from the inaugural Premier Division in 1976 and after failing to achieve promotion at the first attempt, Dundee were forced to sell their undoubted star Gordon Strachan to simply stop the bank closing the doors at Dens.\n\n\n\nThe then chairman Ian Gellatly went to manager Tommy Gemmell on Halloween 1977 and told him that the Club had to raise £50,000 by the end of the week or the bank would foreclose and in Gemmell’s autobiography Lionheart he recounts the events.\n\n\n\n“On Monday morning the chairman said to me ‘We need £50,000 by Friday’. The bank had told him that unless that unless they received that sum of money, they would close the doors of Dens Park. Billy McNeil, who was manager of Aberdeen, had been doing a wee bit of sniffing after Gordon Strachan but I told him Strachan was not available because I knew that if we won promotion to the Premier Division, he would be able to shine at that level. So I phoned Billy up, told him the situation at Dundee, said I would sell Strachan to raise the necessary funds but made it clear he would not be getting him for £50,000; he would need a lot more to purchase the player. After some negotiations we received £85,000 plus Jim Shirra. The money went straight into the bank and Dundee survived to fight another day.”\n\n\n\nGordon David Strachan was born in Edinburgh on February 9th 1957 and raised between a rock and a hard place, Strachan’s Edinburgh was not the craggy outcrop-cum-tourist trap where the castle stands but more something out of the movie Trainspotting on the tough Muirhouse estate. By the age of five he was Hibernian-mad and playing in mass street games and in 1971, when he was a coveted schoolboy international, he was still starring in one such epic at 10.30pm when a Manchester United official arrived at his home. The promise that George Best would be waiting to greet him was meant to be the clincher but showing the principled, stubborn streak that would surface in later years, Strachan sent him away as he had given his word to Dundee.\n\n\n\nWhen Gordon arrived at Dundee from Edinburgh Thistle, there was little doubt about his ability as the wee-ginger haired midfielder was a ‘tanner ba’ player from the old school and was admired by all for his ball skills.\n\n\n\nDespite some question marks over his slight frame, Gordon made his debut for Dundee as a substitute in the first game of the 1973/74 season in a Drybrough Cup tie at Dens against Raith Rovers but the teenager found it tough to break into the side that would win the League Cup that campaign and made just one further appearance from the bench a fortnight later.\n\n\n\nBut the fiery midfielder was fast earning a reputation as a brilliant player in the second team, twice winning the Scottish Reserve Player of the Year Award and being at Dens was not just a football education fro the flame-haired youngster but it was also an education in life.\n\n\n\nProgress was made the following season with a couple of first team starts and as one paper roared “Dundee find new Billy Bremner”, maturity off the pitch was slower in arriving. Caught in the act of quaffing Carlsberg after a Scotland youth match in Copenhagen, he was banned from international duty and another boozy binge with Jimmy Johnstone, the former Celtic winger, ended when they literally ran into their incandescent Dundee manager in his hotel in Errol!\n\n\n\n“I had to look after myself at Dundee”, said Strachan in a Celtic online interview in 2009. “I had moved into digs there when I was fifteen so I had to grow up there quickly. I had to learn to handle the mistakes I made myself.”\n\n\n\nStill staying in Edinburgh when he first signed, wee Gordon caught the train to Dens on a daily basis and his travelling companions George Stewart and Bobby Ford were known to make the naïve youngster go and get the teas from the buffet car and regularly relieve him of his wages at cards.\n\n\n\nBut he was thriving from the coaching at Dens and told the Celtic Mad website on the eve of his Celtic side’s Scottish Cup tie with Dundee in January 2009 that, “I picked up a lot of good habits there from a coach called Hugh Robertson – he had been a left-winger for Dundee’s championship side and was fantastic. So I got good coaching there too. I watched a lot of good players there – Jocky Scott, Gordon Wallace, John Duncan, Dougie Houston – it was a fantastic place and I picked up a lot of good habits.”\n\n\n\nIn August 1975, Strachan outshone Alan Ball in midfield in a pre-season friendly against Arsenal at Dens and the England World Cup winner made a point of shaking the hand of the eighteen year old when Gordon was substituted in the 2-1 win. He had now more than staked his claim for a regular berth in the new ten-team Premier Division.\n\n\n\nDespite his contribution of six goals in thirty-one starts, Dundee were relegated along with St Johnstone at the end of the season and he made an even greater contribution the following year featuring in forty-two of Dundee’s forty-eight matches, scoring eight goals. It wasn’t enough to help take Dundee back up however as they finished third in the First Division behind St Mirren and surprise packets Clydebank.\n\n\n\nTo everyone it was obvious that the 5ft 6in midfielder was Dundee’s key man and at the start of the 1977/78 season, the Dens starlet was appointed club captain, becoming the youngest player in The Dee’s history to holds that honour. His sparkling form earned him a place on the bench for Scotland Under-21s against Switzerland but the skilful Strachan was becoming a target for some rough treatment, forcing manager Tommy Gemmell to complain that his youngster was “being kicked out of the First Division.”\n\n\n\nOn October 29th, Strachan starred in the 1-1 draw with Hearts at Dens but within days he was away to Aberdeen after the bank’s demands and his departure for a relatively small fee would later be cause for bitter regret.\n\n\n\nIt was no surprise to anyone who saw him playing at Dens that he would go on to play in two World Cups, win fifty international caps, the European Cup Winners’ Cup and Super Cup, two Premier Division titles, three Scottish Cups, one English League title and an F.A. Cup. He would be named Scottish Football Writers’ Player of the Year in 1980 and the English P.F.A. Player of the Year twelve years later in a playing career that would last until he was forty.\n\n\n\nStrachan was linked with the vacant Dundee managerial job in the summer of 1988 as player/manager but he later took that role at Coventry eight years later, which kicked off a successful managerial career. Strachan led Southampton to the F.A. Cup Final in the same year Dundee played Rangers at Hampden in the Scottish equivalent and led Celtic to three S.P.L. titles, two League Cups and one Scottish Cup as well as winning the S.P.F.A. Manager of the Year, three out of his four years at Parkhead.\n\n\n\nAn unsuccessful short stint at Middlesbrough followed his spell in Glasgow’s East End and after a break from the game, where he shared his famous ‘Strachanisms’ as a TV pundit, he was appointed as manager of the Scotland national team in January 2013, replacing Craig Levein.\n\n\n\nStrachan remained as Scotland manager for the next four years and despite bringing pride and passion back to the national side, failure to qualify for a major tournament saw him leave the post in October 2017, much to the disappointment of the Tartan Army.\n\n\n\n“I loved my time at Dundee. I spent about five years laughing. Maybe I enjoyed myself too much there but it was fantastic”, Gordon recalls and the Dundee fans loved watching him turning out in the famous dark blue shirt. They knew they were watching a prodigious talent who was going to make it big in the game and like so many others in Dundee’s history, it is a regret that he didn’t do it with Dundee through no fault of his own.\n\n\n\n"}, {"url": "https://wiki.alquds.edu/?query=Gordon_Strachan", "page_content": "Scottish football coach and former player\n\nFor other people named Gordon Strachan, see Gordon Strachan (disambiguation)\n\nGordon David Strachan ( born 9 February 1957) is a Scottish former football coach and player. He played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has since managed Coventry City, Southampton, Celtic, Middlesbrough and Scotland.\n\nIn club football, Strachan played 635 league games, scoring a total of 138 goals, playing 21 of 25 career seasons in either the English or Scottish top-flight. In international football Strachan earned 50 caps, scoring five goals and played in two FIFA World Cup final tournaments, Spain 82 and Mexico 86. Strachan retired from playing in 1997 at age 40, setting a Premier League record for an outfield player.\n\nA right-sided midfielder, Strachan made his senior debut in 1974 with Dundee before moving on within Scotland, to spend seven seasons at Aberdeen. He first played for the Scotland national team in 1980. While at Aberdeen Strachan won multiple domestic league and cup honours in the early 1980s, as well as the 1982–83 European Cup Winners' Cup and 1983 European Super Cup. Moving to England, Strachan won the 1985 FA Cup Final in five seasons with Manchester United. He spent the next seven seasons as club captain at Leeds, winning the 1989–90 Second Division and 1991–92 First Division league titles. He played his last game for Scotland in 1992. He moved to Coventry in 1995 for a final three seasons, as a player-coach.\n\nStrachan became full-time manager of Coventry when the incumbent Ron Atkinson was appointed as director of football. After five years as Coventry manager, he was sacked in 2001 after the club was relegated from the top-flight for the first time in 34 years. He returned to the Premier League as Southampton manager and guided the \"Saints\" to the 2003 FA Cup Final, where they lost 1–0 to Arsenal. Strachan resigned from Southampton in 2004 and took a 16-month break from management. He returned to Scotland to become manager of Celtic, where he achieved three successive league titles and other domestic cup wins. Strachan left Celtic in May 2009 after failing to win a fourth title. He then became manager of Middlesbrough in the English Championship, but left the club after an unsuccessful 12 months in the job. Strachan then managed the Scotland national team for five years, but was unable to secure qualification for a major tournament.\n\nStrachan was named as FWA Footballer of the Year for the 1990–91 season while at Leeds. He was also named Manager of the Year in Scotland several times by writers and players while at Celtic. In 2007, Strachan was inducted into the Scottish Football Hall of Fame. He is the father of Craig Strachan and Gavin Strachan and the grandfather of Luke Strachan, all of whom were also footballers.\n\nStrachan was appointed an Officer of the Order of the British Empire (OBE) in the 1993 New Year Honours for services to association football.[4]\n\nClub career [ edit ]\n\nBorn and raised in Muirhouse, Edinburgh, Strachan supported Hibernian as a boy.[5][6] His father, Jim, worked as a scaffolder, and his mother, Catherine, worked at a whisky distillery.[7] At age 15, he damaged his vision playing football on the school playground when a pen in his pocket became lodged in his right eye; the pen came within \"a thousandth of an inch\" of permanently costing him the vision in his eye.[8] He was offered a contract by Hibernian manager Eddie Turnbull, but his father decided against the offer after stating the club did not pay sufficient expenses for footwear.[9]\n\nDundee [ edit ]\n\nStrachan began his career with Dundee, having decided to sign with the Scottish club at age 14.[9] In joining the club, he rejected an approach from Manchester United,[6] reasoning he had a better chance to establish himself in the first team at Dens Park.[9] His natural talent was immediately apparent and he quickly earned a reputation as an outstanding player in the second team, twice winning the Scottish Reserve Player of the Year Award.[6] He made his mark as an 18-year-old when he outplayed Alan Ball in a friendly with Arsenal in August 1975;[6] The Sunday Post compared him to a young Billy Bremner.[10] Strachan became a regular player in the 1975–76 season, the inaugural season of the Scottish Premier Division, featuring in 17 of the club's 36 league matches.[11] However David White's \"Dee\" were relegated on the last day of the season after rivals Dundee United edged ahead on goal average with an unlikely draw with champions Rangers.[12]\n\nNew boss Tommy Gemmell handed 19-year-old Strachan the captaincy for the 1976–77 First Division campaign,[13] and he remains the youngest player to have captained Dundee.[6] However, the club failed to shine in the lower divisions, and Strachan lost his first team place early in the 1977–78 season following a drinking session with Jimmy Johnstone; Gemmell was also concerned that Strachan was \"getting kicked a lot\" after opposition teams worked out that the way to stop Dundee was to take out their playmaker.[14] Strachan decided to leave Dundee as the club seemed unlikely to win back their top-flight status; the Dundee chairman was also keen on cashing in his most prized asset, and told Gemmell that \"we need £50,000 by Friday or the banks are closing the gate\".[6][15] His last match for Dundee was on 26 October 1977 in a 6–0 defeat in the League Cup to Queen of the South at Palmerston Park, which Strachan described in his autobiography as \"embarrassing\".\n\nAberdeen [ edit ]\n\nStrachan was signed by Aberdeen manager Billy McNeill in November 1977 for a fee of £50,000 plus Jim Shirra.[15] Poor form and niggling injuries made 1977–78 a poor season for Strachan, though the \"Dons\" went on to finish second in the Scottish Premier Division. He was not picked for the 1978 Scottish Cup Final defeat to Rangers.[16]\n\nMcNeill left the Pittodrie Stadium for Celtic in summer 1978, and Alex Ferguson was appointed as the new manager.[17] Strachan played at Hampden Park in the 1979 League Cup defeat to Rangers, and set up Duncan Davidson for the game's opening goal.[18] Though the 1978–79 campaign was a disappointment, Aberdeen went on to win the league title in 1979–80 after closing a ten-point deficit over Celtic with a late run that included two victories at Celtic Park.[19] They again reached the League Cup Final, beating both Old Firm sides en route, where they lost 3–0 to Dundee United at Dens Park.[20] At the end of the season, Strachan was elected SFWA Footballer of the Year.[6][21] After gaining assurance Alex McLeish would also stay with the club, Strachan signed a new contract to keep him at Pittodrie until 1984.[22]\n\nThe \"Reds\" could only manage a second-place finish in 1980–81, as Celtic regained the league title. They exited the European Cup in the second round with defeat to eventual champions Liverpool; manager Bob Paisley said Strachan would become \"Britain's first £2 million player\", in what was a (successful) early attempt at mind games.[23] He missed the second half of the season with a muscle tear in his stomach.[24] With fit-again Strachan on the right flank – supported by full-back Stuart Kennedy – and record signing Peter Weir on the left-flank, Aberdeen mounted a genuine title challenge in 1981–82, but had to settle for second place to Celtic.[25] They did though lift the Scottish Cup with a 4–1 extra-time victory over Rangers, with Strachan contributing one assist and one goal.[26]\n\nThe 1982–83 campaign was the greatest in the history of the club, and Strachan made his mark early on with four goals in a 5–1 victory at former club Dundee in the League Cup.[27] Despite only finishing third in the league (albeit only one point behind champions and New Firm rivals Dundee United) and exiting the League Cup in the quarter-finals, Aberdeen won the Scottish Cup and the European Cup Winners' Cup. The club's European success came with a 2–1 after-extra-time victory over Spanish giants Real Madrid at Ullevi in Gothenburg. The Scottish Cup came with a 1–0 win over Rangers.[28] The \"Dons\" continued their success by delivering the league title and Scottish Cup in 1983–84, with Strachan setting up Mark McGhee for the winning goal in the cup final win over Celtic.[29] This completed a unique treble, as they defeated Hamburger SV in the 1983 European Super Cup.\n\nManchester United [ edit ]\n\nIn August 1984, Manchester United spent £500,000 to take Strachan to Old Trafford.[30] However, because Strachan had previously signed a pre-contract agreement with Bundesliga side 1. FC Köln, United paid £75,000 compensation to resolve the row – teammate Mark McGhee had also signed a contract with Hamburger SV on the understanding that Strachan would also be playing in Germany.[31] Strachan opened the 1984–85 campaign with four goals in seven matches,[32] though the \"Red Devils\" could only manage a fourth-place finish in the First Division. He featured at Wembley Stadium in the 1985 FA Cup Final, as United ran out 1–0 winners over Everton; his lung-bursting run off-the-ball helped Norman Whiteside to find the space for his extra-time winner.[33]\n\nAfter winning their opening ten league matches of the 1985–86 season, United had to cope without Strachan, who was sidelined for much of the season with injury.[34] They proved unable to cope with their injuries – another key player facing extended time in the treatment room was Bryan Robson – and limped to another fourth-place finish.[34] Atkinson was replaced by Alex Ferguson in November 1986, and Strachan mocked sobbing as he told his teammates, \"I never thought he'd follow me this far south!\"[35] After his arrival, Ferguson speculated that no longer being the star player had negatively affected Strachan's form.[36] United finished a disappointing 11th in 1986–87, before rising to second place in 1987–88. Strachan's form was again patchy in 1988–89, as United slipped back down to 11th.[37]\n\nLeeds United [ edit ]\n\nIn March 1989, Sheffield Wednesday manager Ron Atkinson had a bid of £200,000 accepted by Manchester United, and he offered Strachan a contract paying more money than anyone in the club's history.[38] However likely a move to Sheffield seemed, Leeds United manager Howard Wilkinson matched the offer and convinced Strachan to drop down into the Second Division.[39] He quickly became a popular figure at Elland Road, earning comparisons to former favourites Bobby Collins and Johnny Giles.[40] Signing a two-year contract, he was awarded with the captain's armband.[41] He formed an unlikely midfield partnership with Vinnie Jones and led the club to the Second Division title in 1989–90.[42]\n\nWith the \"Whites\" now in the First Division, Wilkinson secured a midfield quartet of Strachan, Gary McAllister, David Batty and Gary Speed.[43] They achieved a commendable fourth-place finish in 1990–91, and also reached the semi-finals of the League Cup.[43] Strachan was voted FWA Footballer of the Year for his performances during the campaign, becoming the first player to win the award both in Scotland and in England.[43]\n\nStrachan signed a new two-year contract, before captaining Leeds to the league title in 1991–92.[44] In so doing, he denied former boss Alex Ferguson and Leeds' hated rivals Manchester United the title.[45] However, Strachan (now nearing age 35) was beginning to feel the effects of his sciatica and missed a number of matches due to his bad back.[46] Following the club's success, Strachan was appointed an OBE for his services to sport.[47]\n\nHowever, Leeds were unable to build on their success, and finished the 1992–93 season down in 17th place in what was newly re-branded as the Premier League.[48] Strachan continued to impress though, and was given the club's Player of the Year award.[48] He scored a hat-trick against Blackburn Rovers on 10 April 1993.[49] This was his second hat-trick for Leeds, the first having come in September 1989 when he found the net three times in a 4–0 win over promotion rivals Swindon Town in the Second Division at Elland Road.[50]\n\nStrachan managed 37 starts in 1993–94, and Leeds rose to fifth.[48] He was rarely selected in the 1994–95 season, which would prove to be the end of his spell at Elland Road, where he had spent six years.[51]\n\nCoventry City [ edit ]\n\nIn March 1995, Strachan moved to Coventry City to work as assistant manager under new manager Ron Atkinson, the man who had brought him south of the border to Manchester United 11 years earlier. It was also agreed he would replace Atkinson as manager in summer 1997.[52] Strachan coached the team and led training sessions while learning the finer points of management from Atkinson.[53] He also took to the field at Highfield Road, playing 26 Premier League matches for the Sky Blues over the next two years before finally hanging up his boots in his 40th year. Atkinson signed Aberdeen midfielder Eoin Jess in 1996 purely on the basis of Strachan's recommendation.[54] However, Isaías left the club after falling-out with Strachan.[55] Coventry signed Gary McAllister for £3 million on wages of £20,000 per week; the deal was done by McAllister's former teammate and friend Strachan, while Atkinson was largely opposed to the deal.[56] The club struggled at the start of the 1996–97 campaign, and the club's board of directors asked Atkinson to step aside in November 1996, some months earlier than first agreed, and Strachan was appointed manager.[57]\n\nInternational career [ edit ]\n\nStrachan won his first cap for Scotland on 16 May 1980, in a British Home Championship defeat to Northern Ireland at Windsor Park.[58] Strachan helped Scotland qualify for the 1982 FIFA World Cup and scored a crucial goal in qualifying by scoring the only goal against Sweden at the Råsunda Stadium in Stockholm.[59] He did not feature in the 1982 British Home Championship, as Jock Stein wanted to rest him for the World Cup, held in Spain.[60] The Scots cruised to a 5–2 victory over New Zealand at La Rosaleda Stadium, Málaga; Strachan was named Man of the Match.[61] Scotland then lost 4–1 to a world-class Brazil side at the Estadio Benito Villamarín, Seville.[62] In the third match, a 2–2 draw with the Soviet Union back in Málaga saw Scotland exit the tournament on goal difference.[62]\n\nScotland also qualified for the 1986 FIFA World Cup. However, shortly after the draw with Wales at Ninian Park on 10 September 1985, Jock Stein died of a heart attack, and his assistant Alex Ferguson took charge for the World Cup campaign.[63] To complete their qualification, they had to beat Australia in a play-off. Strachan played in the first leg at Hampden Park, but did not travel to Melbourne for the second leg.[64] The Scots faced a tough draw in Mexico and lost their opening match 1–0 at the Estadio Neza 86 in the Mexico City suburb of Nezahualcóyotl to the unseeded – but highly fancied – Denmark.[65] Strachan then scored in a 2–1 defeat to West Germany at the Estadio Corregidora in Queretaro; his goal celebration was memorable, as he tried to climb the advertising hoardings, but was thwarted by his short stature and so merely rested his leg on the hoarding before he was joined by his teammates.[66] In the third and final group match back in Nezahualcóyotl, Scotland drew 0–0 with Uruguay despite their opponents going down to ten men after less than a minute of play when José Batista attempted to take Strachan out of the game.[66]\n\nStrachan fell out of the first team picture under Andy Roxburgh, and was omitted from the squad for the 1990 World Cup.[67] Nevertheless, he enjoyed a national team revival between 1990 and 1992, and captained his country in qualification for UEFA Euro 1992.[68] However, he did not travel to Sweden as a member of the squad, as he announced his retirement due to long-term back troubles.[69] He won 50 full caps, and scored five international goals.\n\nManagerial career [ edit ]\n\nCoventry City [ edit ]\n\nWhen Ron Atkinson became Coventry City's director of football in November 1996, Strachan was promoted to the manager's seat. He appointed Alex Miller as his assistant.[70] After an upturn in results, Strachan was named Manager of the Month in December.[71] However, 1 win in 12 matches in the New Year left the \"Sky Blues\" in the relegation zone. Late wins over Liverpool, Chelsea and Tottenham Hotspur saved their season though, and relegation was avoided by a one-point margin. Strachan played in the win over Chelsea at Highfield Road at age 40, in what was at the time a record age for an outfield player in the Premier League.[citation needed]\n\nStrachan signed Swedish goalkeeper Magnus Hedman and defender Roland Nilsson, Dutch midfielder George Boateng, and Romanian striker Viorel Moldovan – all of whom would win international caps.[72] Coventry rose to 11th place in 1997–98, and also reached the quarter-finals of the 1997–98 FA Cup.[72] After Miller left the club, Strachan replaced him with Garry Pendrey, who would go on to spend many years as his assistant at various clubs.[73] Strachan was again named Manager of the Month in February 1998.[citation needed]\n\nThe club finished 15th in 1998–99 and 14th in 1999–2000, as Strachan spent £6 million on Irish striker Robbie Keane and £5 million on Moroccans Mustapha Hadji and Youssef Chippo, while selling Dion Dublin to Midlands rivals Aston Villa.[74] Coventry were relegated at the end of the 2000–01 season, making Strachan unpopular with fans.[75] New signing Craig Bellamy proved disappointing, while Robbie Keane was sold and Gary McAllister departed for Liverpool.[76] Strachan attempted to launch a promotion campaign by signing striker Lee Hughes, but in the face of increasing supporter unrest, he was sacked five matches into the 2001–02 First Division campaign.[77] His replacement, Roland Nilsson, took the club to an 11th-place finish.[citation needed]\n\nSouthampton [ edit ]\n\nStrachan returned to management within weeks, taking the manager's job at Premier League Southampton, who had sacked manager Stuart Gray after a terrible start to their first season at the new St Mary's Stadium. Most pundits had already written off their survival chances by the time of Strachan's appointment in October 2001, but he turned round their fortunes and they finished 11th in the Premier League. The Saints progressed further in 2002–03 when they finished eighth and reached the FA Cup Final, where they lost 1–0 to Arsenal. As Arsenal had already qualified for the 2003–04 UEFA Champions League, Southampton won a place in the UEFA Cup.[citation needed]\n\nIn February 2004, Strachan announced his resignation as Southampton manager after his decision not to stay on at the club in the summer was leaked to the press.[78] He wanted to take a break from football, but was forced to resign earlier than initially intended due to the speculation surrounding his and the club's future following the leak.[79]\n\nCeltic [ edit ]\n\nAfter a 16-month break, Strachan returned to management on 1 June 2005, when he succeeded Martin O'Neill as manager of Celtic in the Scottish Premier League (SPL). For 2005–06, his stated aim was to regain the SPL title from rivals Rangers. He had an embarrassing start to his campaign as Celtic manager, losing 5–0 to Slovakian champions Artmedia Bratislava on 27 July 2005 and three days later, drawing 4–4 with Motherwell in his first SPL match in charge of the Glasgow club. The loss against Artmedia meant Celtic suffered an early exit from European competition, despite winning the return match 4–0. After this disastrous start, Celtic started to improve under Strachan. A low-point was the shock defeat in the third round of the Scottish Cup to First Division Clyde on 8 January 2006. However, the following month his team made history when they defeated Dunfermline Athletic 8–1, a record victory margin for the SPL at the time. Strachan's first season was ultimately successful as he coached Celtic to victory in the League Cup and, on 5 April 2006, his side clinched the SPL title in record time and with six matches remaining. Reflecting this achievement, Strachan was voted Manager of the Year by the Scottish Football Writers' Association eight days later.[80]\n\nStrachan ahead of Celtic's Champions League qualifier against Spartak Moscow , August 2007\n\nThe following year, Strachan restructured the team and made a series of signings, bringing in players such as Hibernian's Derek Riordan; Chelsea's Jiří Jarošík; Kenny Miller and Lee Naylor from Wolverhampton Wanderers; Jan Vennegoor of Hesselink from PSV; Thomas Gravesen from Real Madrid; and Paul Hartley and Steven Pressley from Hearts. Celtic flourished and by mid-January 2007 held a 17-point lead in the SPL table. UEFA Champions League football again returned to Celtic Park, the team having automatically qualified for the group stages and drawn alongside Benfica, Copenhagen and Manchester United. Home victories against all three Group F members saw the team progress to the round of 16 of the Champions League for the first time since the competition was re-formatted in 1993. Celtic lost their round of 16 tie against eventual winners Milan in extra time, missing out on a place in the quarter-finals. On 22 April 2007, Strachan guided Celtic to their 41st league championship, and second in succession. A 2–1 victory against Kilmarnock[81] left Celtic 13 points clear of Rangers with four matches remaining. Later that day, Strachan was recognised as the inaugural PFA Scotland Manager of the Year for 2007. Celtic went on to win the Scottish Cup, beating Dunfermline Athletic.[citation needed]\n\nIn the 2007–08 season, Strachan led Celtic into the round of 16 of the UEFA Champions League again after defeating Milan, Benfica and Shakhtar Donetsk. By April, there was significant criticism from the press and the fans after a 1–0 loss to Aberdeen in the Scottish Cup quarter-final and a 1–0 loss to ten-man Motherwell in the SPL. However, after defeating Rangers twice at home, on 22 May 2008 Strachan became only the third ever Celtic manager to guide the club to three consecutive Scottish league titles.[citation needed]\n\nIn the 2008–09 season, after winning the League Cup after extra time against Rangers, but failing to lead Celtic to another league title, he resigned as manager on 25 May 2009.[82][83]\n\nMiddlesbrough [ edit ]\n\nStrachan signed a four-year contract with English Championship team Middlesbrough on 26 October 2009, succeeding Gareth Southgate.[84][85] He had been linked with the Middlesbrough manager's job 15 years earlier, when still a Leeds United player.[86] His first match in charge was on 31 October, a 1–0 defeat to Plymouth Argyle, with Adam Johnson missing a penalty.[87] On 5 December, Middlesbrough won their first match under Strachan, 5–1 away to Queens Park Rangers.[88] After a poor run of results, including a 3–0 loss at home to Blackpool and a 1–0 loss at home to Cardiff City, Strachan earned his first home win after his team beat Scunthorpe United 3–0.[89]\n\nAfter a poor start to the 2010–11 season meant Middlesbrough were in 20th place,[90] Strachan left the club by mutual consent on 18 October.[91] He voluntarily ended his contract and left without compensation.[90]\n\nScotland [ edit ]\n\nStrachan was appointed manager of the Scotland national team on 15 January 2013, succeeding Craig Levein.[92] His first match in charge was at Pittodrie Stadium in a friendly match against Estonia on 6 February. The game ended 1–0 to Scotland, with Charlie Mulgrew getting his first international goal. Scotland suffered defeats to Wales and Serbia in Strachan's first two competitive matches, which ended the Scots' slim chances of qualification for the 2014 World Cup.[93] After this, Scotland had an upturn in form, winning both matches against Croatia[93] and away against Macedonia. Scotland finished fourth in qualifying Group A.\n\nIn Euro 2016 qualifying, Scotland appeared to have a better chance of qualification as the finals tournament was expanded from 16 teams to 24, but were drawn in a tough group with Germany, Poland and the Republic of Ireland.[93] After losing their opening match in Germany, Scotland recorded home wins against Georgia, Ireland and Gibraltar, and away draws against Poland and Ireland.[93] In their following match, Scotland produced an \"insipid\" performance, as they lost 1–0 in Georgia.[93] A home defeat by Germany left Scotland four points behind third-placed Ireland, with two matches to play.[93] In the penultimate matches of the group, Scotland needed to beat Poland, or hope that Ireland would lose to Germany.[93] Scotland came from behind to lead 2–1 in their match, but Ireland had scored the only goal of their match, leaving the Scots needing a win to stay alive.[93] A late scrambled goal by Robert Lewandowski gave Poland a draw that eliminated Scotland from contention.[93] Strachan bemoaned what he perceived to be bad luck.[93] After a win against Gibraltar in the last qualifier, Strachan agreed to a new contract with the Scottish Football Association.[94] After failing to qualify for the 2018 FIFA World Cup, Strachan resigned from his position on 12 October 2017.[95]\n\nManagement style [ edit ]\n\nTypically playing a traditional 4–4–2 formation,[96][97][98] and very occasionally 4–5–1,[96][99] Strachan is widely known for his rigorous management style,[100][better source needed] and states that he watches video replays of his club's matches two or sometimes three times.[101] He also places great emphasis on player health and fitness, forbidding his players to drink alcohol excessively or regularly, and often giving dietary advice to his players, attributing his own longevity as a player to a strict and somewhat unusual diet involving seaweed.[102][103] Players such as Scotland international Gary Caldwell have attributed their success at Celtic to lifestyle changes enforced by Strachan.[104]\n\nRenowned for his deadpan humour in media interviews, quotes attributed to Strachan have become part of popular football culture.[105][106]\n\nEnmity with Alex Ferguson [ edit ]\n\nDespite playing for Alex Ferguson at two clubs, the pair had an ongoing public feud during Strachan's managerial career. In his 1999 autobiography, the former Manchester United manager said, \"I decided this man could not be trusted an inch – I would not want to expose my back to him in a hurry.\" In his own 2006 autobiography, in response to Ferguson's comments, Strachan said he was \"surprised and disappointed\".[107] The rivalry dates from Strachan's time playing under Ferguson, first at Aberdeen and later Manchester United.[108] In August 2006, after his Celtic team was drawn to play Ferguson's Manchester United in the Champions League, Strachan said that there was no longer any enmity between the two managers.[109]\n\nOther work [ edit ]\n\nStrachan has analysed football matches for the media, including alongside Adrian Chiles on BBC Sport's Match of the Day 2.[110] He has worked as a regular pundit for ITV's coverage of the FA Cup and the UEFA Champions League. During the 2014 World Cup, he worked as a pundit for ITV.[111] In April 2019, Strachan apologised for remarks he made during The Debate on Sky Sports.[112] Following the release of convicted sex offender Adam Johnson from prison, Strachan had appeared to suggest that abusing Johnson for that offence was comparable with racial abuse.[112]\n\nFor the 2006 World Cup, Strachan was appointed as the official FIFA Ambassador for Scotland, joining 50 others in fundraising for SOS Children's Villages, the official charity of the tournament.[113]\n\nStrachan and his two sons started their own football school in the Coventry area in August 2009.[114]\n\nIn July 2019, Strachan was appointed to a technical director position with Dundee.[115]\n\nPersonal life [ edit ]\n\nStrachan married Lesley Scott in 1977; George Mackie was his best man.[116] Together, they had three children: Craig and Gavin Strachan, also footballers,[114] and Gemma Strachan.[117] Strachan's grandson, Luke, is also a footballer and came through the youth setup with Dundee whilst Gordon was technical director at the club.[118]\n\nCareer statistics [ edit ]\n\nClub [ edit ]\n\nInternational [ edit ]\n\nAppearances and goals by national team and year[121] National team Year Apps Goals Scotland 1980 7 1 1981 2 0 1982 8 0 1983 9 1 1984 2 0 1985 5 0 1986 6 2 1987 2 0 1989 2 0 1991 5 1 1992 2 0 Total 50 5\n\nInternational goals [ edit ]\n\nScores and results list Scotland's goal tally first, score column indicates score after each Strachan goal.\n\nManagerial record [ edit ]\n\nAs of 8 October 2017 (competitive club matches and all international matches)\n\nTeam From To Record G W D L Win % Coventry City 5 November 1996 10 September 2001 215 70 56 89 0 32.56 Southampton 22 October 2001 13 February 2004 110 39 32 39 0 35.45 Celtic 1 June 2005 25 May 2009 182 122 28 32 0 67.03 Middlesbrough 26 October 2009 18 October 2010 46 13 13 20 0 28.26 Scotland 15 January 2013 12 October 2017 40 19 9 12 0 47.50 Total 593 263 138 192 0 44.35\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nAberdeen\n\nManchester United\n\nLeeds United\n\nScotland\n\nIndividual\n\nManager [ edit ]\n\nCeltic\n\nIndividual\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nSpecific\n\nGeneral"}, {"url": "https://www.celebsagewiki.com/gordon-strachan", "page_content": "Age, Biography and Wiki\n\nGordon Strachan was born on 9 February, 1957 in Edinburgh, United Kingdom. Discover Gordon Strachan's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 66 years old?\n\nPopular As N/A Occupation N/A Age 66 years old Zodiac Sign Aquarius Born 9 February 1957 Birthday 9 February Birthplace Edinburgh, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 9 February. He is a member of famous with the age 66 years old group.\n\nGordon Strachan Height, Weight & Measurements\n\nAt 66 years old, Gordon Strachan height is 1.68 m .\n\nPhysical Status Height 1.68 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Gordon Strachan's Wife?\n\nHis wife is Lesley Strachan (m. 1977)\n\nFamily Parents Not Available Wife Lesley Strachan (m. 1977) Sibling Not Available Children Not Available\n\nGordon Strachan Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Gordon Strachan worth at the age of 66 years old? Gordon Strachan’s income source is mostly from being a successful . He is from United Kingdom. We have estimated Gordon Strachan's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nGordon Strachan Social Network\n\nInstagram Linkedin Twitter Gordon Strachan Twitter Facebook Wikipedia Gordon Strachan Wikipedia Imdb\n\nTimeline"}], "Coventry City lost to Tottenham Hotspur.": [{"url": "https://www.coventrytelegraph.net/sport/football/football-news/city-premier-league-tottenham-hotspur-18235094", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet Sky Blues transfer latest, team news, match updates and analysis delivered straight to your inbox\n\nToday marks 23 years since Coventry City pulled off one of their greatest ever escapes.\n\nOn May 11, 1997, the Sky Blues beat Tottenham Hotspur 2-1 at White Hart Lane against all the odds to preserve their Premier League status.\n\nIt was the tenth time in the club’s stint in the top flight that CCFC avoided relegation on the last day of the season - and it was arguably the best of them all.\n\nAnd they were faced with a mountain to climb from the get-go, needing other teams to lose and to secure a win themselves to make the seemingly impossible dream a reality.\n\nTraffic problems on the M25 and M1 caused the Tottenham game to kick off late, meaning supporters faced an agonising 15 minutes knowing their team had to avoid conceding.\n\nThen player-manager Gordon Strachan has since revealed that he was too nervous to take to the field that day.\n\nStrachan said : “That game Dion and big Willo scored, and it was the longest 15 minutes of my life at the end.\n\n“We were 15 minutes behind the other games and I was a sub that day. I’d played the week before and was rubbish, so I dropped myself.\n\n“It was 2-1 and in the last 10 minutes the guys in the dug out were saying ‘get yourself on, get the ball, calm the game down’.\n\n“They were saying ‘look, Hucks in knackered’, so I shouted to Hucks to ask how he was doing and he said ‘I’m f*****’.\n\n“The guys on the bench asked me what he said, and I told them ‘he’s fine, he’s good to play on’.\n\n“I was too nervous to go on! But what a day that was.”\n\nCity had spent big across the two seasons that preceded this final day nail-biter and took the lead through one of those marquee signing, Dion Dublin.\n\nAnd just before the break Paul Williams doubled their lead sending City fans into hysteria.\n\nTottenham pulled one back through Paul McVeigh to set up a nervous second-half that saw a string of stellar Steve Ogrizovic saves keep Coventry in the lead and in the top flight.\n\nAt full-time, the scoreboard read six minutes past six as the rest of the Premier League awaited news.\n\nThe club’s captain at the time was Scotland legend Gary McAllister, who said it was the best game he experienced during two spells and six years at the club, setting up both goals.\n\nHe said: “It was just an amazing game. For me, the thing about that game was just seeing the belief on the faces on the supporters who came in their thousands that day.\n\n“But it was also the kit man and the bus driver, the emotion showed by those people that day when we survived was something I’ll never forget.”"}, {"url": "http://stats.football.co.uk/head_to_head/coventry_city/vs/tottenham_hotspur/index.shtml", "page_content": "Coventry City v Tottenham Hotspur Head-to-Head Record\n\nA complete record of competitive matches played between the two teams\n\nCoventry City (46) Tottenham Hotspur (42) Results Total % Results Total % Coventry City 17 7.82 Tottenham Hotspur 24 10.08 Tottenham Hotspur 17 7.82 Coventry City 8 3.36 Draws 12 5.52 Draws 10 4.6 Goals Total Av.pg Goals Total Av.pg Coventry City 62 1.35 Tottenham Hotspur 84 2.00 Tottenham Hotspur 65 1.41 Coventry City 48 1.14\n\nRecords Highest Aggregate 5 Coventry City 0 - 5 Tottenham Hotspur 1919/1920 Highest Coventry City score: 4 Tottenham Hotspur 4 - 0 Coventry City 1948/1949 Highest Tottenham Hotspur score: 5 Tottenham Hotspur 5 - 0 Coventry City 1919/1920"}, {"url": "https://hotspurhq.com/2013/05/16/tottenham-lose-to-coventry-city-in-1987-fa-cup-final/", "page_content": "The unthinkable had happened, Tottenham lost in the FA Cup Final at Wembley for the first time. The defeat to Coventry City occurred on this day, 16th May, 1987.\n\nThe fact that Spurs fans found it difficult to take in that Spurs had lost the FA Cup Final was nothing to do with underestimating Coventry, it was all based on the fact that Tottenham had never lost in an FA Cup Final, dating back to their non-League days and their first Cup win in 1901.\n\nAfter seven successful Finals, Spurs’ amazing record was gone as they lost to Coventry City at Wembley. They had already sacrificed their record of never losing in a Cup Final or at Wembley in 1982 when they lost out in the League/Milk Cup Final to Liverpool but this was the big one.\n\nCoventry City 3 Tottenham Hotspur 2 (aet)\n\nScorers: Bennett, Houchen, Mabbutt o.g Allen, C., Mabbutt\n\nTeam: Clemence; Hughton (Claesen), Mabbutt, Gough, Thomas, M.; Allen, P., Ardiles (Stevens), Hoddle, Hodge, Waddle, Allen,C.\n\nSpurs were firm favourites to lift the trophy as they returned to Wembley for their third FA Cup Final in seven years while Coventry were at this stage of the competition for the first time.\n\nClive Allen put Spurs ahead after two minutes but Coventry equalised within minutes. Gary Mabbutt restored Tottenham’s lead before the interval but Coventry again replied in the second half. In extra time Coventry went ahead when a cross hit Mabbutt’s knee and looped over the head of stranded goalkeeper, Ray Clemence.\n\nDisappointed – to this day I have never seen Coventry receiving the Cup, although I have had to endure watching their equalising goal on many occasion as it is frequently replayed in trailers for the FA Cup. It was to be Glenn Hodle’s last match for Spurs as he signed for Monaco during the summer – a disappointing way to end an amazing Tottenham career.\n\n#knowyourtottenhamhistory 16th May, 1987 Tottenham Lose To Coventry in FA Cup Final\n\n\n\n1986-87\n\nSpurs had arrived at Wembley after a very impressive season which had seen David Pleat’s team finish third in the 1st Division behind Everton and Liverpool. They had lost in the semi-final of the Littlewoods League Cup to Arsenal after a replay was required, the tie ending all square after home and away legs. Arsenal’s late winner at White Hart Lane in that third match was the only time they had led in the tie.\n\nClive Allen had been the revelation of the season as he set a new goalscoring record for Spurs – 49 in all competitions, breaking the record previously held by Jimmy Greaves.The season started with his hat-trick against Aston Villa at Villa Park as Spurs claimed a 3 – 0 success and carried on from there. David Pleat introduced a system where Allen played as a lone striker supported by five in midfield and very successful it proved.\n\nSpurs’ Road to Wembley:\n\nSpurs’ progress to the FA Cup Final had been quite serene with few difficulties along the way with Allen scoring four goals in the competition. This was to be Glenn Hoddle’s last season with Spurs and so it was extra special for him to leave on a high note.\n\n3rd Round v Scunthorpe United (h) Won 3 – 2 Mabbutt, Waddle, Claesen\n\n4th Round v Crystal Palace (h) Won 4 – 0 Mabbutt, Allen, C. (pen), Claesen, Opp. o.g.\n\n5th Round v Newcastle United (h) Won 1 – 0 Allen, C. (pen)\n\n6th Round v Wimbledon (a) Won 2 – 0 Waddle, Hoddle\n\nWimbledon often proved a difficult side for Spurs to beat as they disliked their long ball, high pressured play and often came off second best. David Pleat’s side, however, showed their worth in a visit to Plough Lane and with application and commitment went through as the skill of Chris Waddle and Hoddle provided the goals to ensure the ‘Diamond Lights’ were still shining for the semi-final tie.\n\nSemi-Final v Watford (at Villa Park) Won 4 – 1 Hodge (2), Allen, C., Allen, P.\n\nThis semi-final was one of the easiest Spurs have ever played. Watford went into the game at Villa Park with goalkeeping problems and had to call up an emergency keeper as their regular keepers were injured. A 4-1 victory did not flatter Spurs who continued their good form and won through goals from Steve Hodge(2), Clive Allen and Paul Allen. Coventry City were their unexpected opponents in the Final.\n\nAfter such an easy passage to the Wembley final the outcome was a major disappointment."}, {"url": "https://www.coventrytelegraph.net/sport/football/football-news/tottenham-hotspur-coventry-city-news-17021721", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nSpurs take City's record\n\nIt’s official! Tottenham Hotspur have taken Coventry City’s 49-year unwanted record of suffering the heaviest defeat by an English club in Europe.\n\nThe Sky Blues were famously beaten 6-1 by Bayern Munich back in 1970 and no other English side has been put to the sword so severely until Tuesday night’s 7-2 UEFA Champions League thrashing of Spurs – by remarkable coincidence, also inflicted by the German giants.\n\n“I was watching the game on TV, which I thought was a fabulous game of football,” said Coventry City ’s official historian and statistician, Jim Brown.\n\n“Bayern were absolutely awesome and it wasn’t until the seventh one went in that I realised, ‘blimey, that’s our record gone!’\n\n“I think Leicester lost 5-0 in the Champions League a couple of years ago, and 7-2 obviously trumps 6-1, so the record has gone.\n\n“Coventry have held the record of the heaviest defeat by an English club in European competition since 1970, so 49 years when the Sky Blues lost in the European Fairs Cup.\n\n“I was there that night and remember it well.”\n\nFor younger readers, Jim recalled: “I was 18 at the time and went on a two day trip to Munich. I think the whole package, including flights, transfers, hotel and match ticket cost me £25, which was a lot of money in those days.\n\n“I think about 500 City fans went over and it was an absolutely miserable night. The rain lashed own for the whole 90 minutes.\n\n“City’s goalkeeper, Bill Glazier, had been ruled out with an injury and the manager had to call up the reserve keeper Eric McManus. It wasn’t his debut but it was only his second or third game and poor Eric had an absolute nightmare.\n\n“Bayern were hitting shots from 25/30 yards and Eric just couldn’t handle it.\n\n“We were 4-1 down after 20 minutes and it was just a shambles really.\n\n“Bill Glazier was sat behind me in the stands with Roy Barry, who was the club captain at the time and recovering from a broken leg, and they had their heads in their hands as the goals went in.\n\n“And I’m convinced Coventry wouldn’t have lost like that had Bill been in goal. The other thing, of course, was that City beat Bayern 2-1 in the second leg at Highfield Road and gave a very good account of themselves.”\n\nCoventry City's Mr Angry\n\nGervane Kastaneer has proved to be somewhat enigmatic so far in his early Coventry City career.\n\nThe Dutch winger has had Sky Blues fans on the edge of their seats at times and frustrated manager Mark Robins at others.\n\nHe announced his League One arrival by stepping off the bench against Bristol Rovers and scoring within 60 seconds to secure a 2-0 victory.\n\nThe following game, at Portsmouth, he got himself sent off for two bookable offences, adding to City’s challenge at a time when they were already down to ten men following Fankaty Dabo’s dismissal just before the hour.\n\nBut all agree that once the 22-year-old summer signing from NAC Breda settles, he’ll be a major force for the team in their quest for promotion.\n\nHis superb cameo from the bench on Saturday sparked the Sky Blues to come from behind to earn a deserved point against Doncaster Rovers , and a last gasp counter attack went agonisingly close to producing a dramatic winner.\n\nRobins is trying to get Kastaneer’s fitness levels up so that he can go from impact player to regular starter.\n\nOne player who finds himself in a similar position is Amadou Bakayoko, and the pair have become close as they get their heads down and bide their time, waiting for their chance to shine.\n\n“ Gervane is trying to do the same as me,” said the centre-forward, who bagged the equaliser at the weekend after also going on as a substitute.\n\n“You could see as soon as he went on against Doncaster that he was dribbling and he does that all the time in training, trying to make something happen. And that’s what we have to do coming off the bench.”\n\nAsked for a bit of insight into the player and how good he believes he is, Bakayoko said: “He’s an angry man who just takes his frustration out on the ball.\n\n“He’s really aggressive but also positive.\n\n(Image: Coventry Telegraph)\n\n“He smiles all the time and I never see him down, and I think we both have the same mentality and we click in training.\n\n“Even if we haven’t played as much as we’d want, we’re still laughing and joking and working hard as well. It’s just a really positive mindset, which is good to see.\n\n“He wants to come here and impress but he knows his time will come at some point.”\n\nHe added: “He’s just as hungry as everyone else on the bench. I work with him after training sessions and we both have good mentalities and both know what we need to do.\n\n“We might be getting 10/15 minutes now and again but I think we have a good enough attitude to go out and express ourselves when we have to, which is a good thing for the gaffer.\n\n“He’s definitely a good player. Very dangerous!”\n\nCal's up there with Man U\n\nCallum O’Hare’s fitness levels at Coventry City are up among the best in the Premier League.\n\nThe 21-year-old loan player has been a big hit with the Sky Blues since joining from Aston Villa, with a string of lively performances that have produced two goals so far, and plenty of attacking spark in terms of creating chances for himself and others.\n\nPerformance analysts call them defining moments, and O’Hare’s certainly providing those as his late strikes against Oxford United and Blackpool prove.\n\nAnd he almost added a third at the weekend when his last minute dash for a Gervane Kastaneer through ball was inches away from producing a last gasp winner against Doncaster Rovers.\n\nHis contribution so far has delighted manager Mark Robins , who said about Saturday’s display against Donny: “He’s been outstanding and the work that he gets through is incredible.\n\n“He’s been very good today and I would bet he has covered something like 12.5/13K. And that’s high intensity running.\n\n“He is unbelievable.”\n\nPerformance expert Darren Robinson, who had a spell at City under Micky Adams in the 2000s, now runs his own football intelligence service, iScout , providing a host of data, analysis and expertise on teams, players and performance for the industry.\n\nImpressive figures\n\n“If he’s hitting those kinds of figures they are impressive total distance figures,” said one of the most qualified football coaches in the country, who had a spell at Nuneaton Borough in his playing days.\n\n“They would be impressive at both Premier League and in the Championship in terms of distance covered.\n\n“There’s always a but, and that is how effective is that running?\n\n“The issue is how fast are you running because it’s high intensity and high speed runs that are important, not total distance.\n\n“And also how effective this is, so if you’re coming out of your slot or running round like a headless chicken then it’s actually ineffective running.\n\n“So it’s right to champion the total distance but one would suspect that Mark’s obviously pleased that that work-rate is allowing a contribution to the team in other areas.\n\n“Ultimately, it has to have a context, so if Coventry are wanting to play with ebb and flow, ie make it a leg race and go box to box for the full 90 minutes then that’s a great KPR (key performance requirement).\n\n“When I was at Birmingham we had to play counter attacking football because of the players we had, and that amount of distance might be a suggestion of over reaching. We would sit, hold and then break quickly so our sprint distance would be higher than total distance.\n\nManchester United\n\n“But they are impressive figures and do stack up.\n\n“I have spoken to a friend at Man United and he’s seen two or three players cover more, but not very many.\n\n“But the Premier League is more of a sprinting game and less about distance covered. It’s about playing efficiently and if they have got the ball the opposition are often a bit more respectful, whereas in League One they might say, right, let’s go and press.”\n\nWorking on City's weakness\n\nMark Robins and his coaching staff are working hard this week to improve Coventry City’s Achilles heel.\n\nSet pieces, in particular corners, are proving problematic and while defenders Dom Hyam and Michael Rose have already got on the scoresheet this season, the Sky Blues boss wants more goals from dead ball situations.\n\nSaturday was a case in point when a string of corners - City enjoying a whopping nine in the game - were hit short and all failed to trouble Doncaster Rovers’ organised defence.\n\nAnd that's something the City manager would love to improve on ahead of Saturday's trip to newly-relegated Rotherham United, when the team will be desperately trying to earn their first victory on the road, while also maintaining their outstanding unbeaten start to their League One campaign.\n\n“Clearly we’re not very good at putting it in the box,” admitted Robins , explaining the current set piece strategy.\n\n“And until they can learn how to lose men then we’ll keep doing it (short).\n\n“There were some really good balls into the box when we did get them in but they went straight into the goalkeeper’s hands, but they were at a decent height to come and head.\n\n“So someone has got to get across the goalkeeper, someone has to make a run, someone has to run into space and not wait for the ball to come in, and that’s what we do. That’s what players do at this level.\n\n“We have to keep working and hopefully a penny will drop and it will click. And once it clicks, we’ll score from set plays.\n\n“It’s been an Achilles heel for a while but it’s something we’re mindful of and want to get better at, and we’re actively practising them, although there are only so many days in the week.\n\n“But it’s still early days. We’ve only played ten games.\n\n“After this week’s game it’s quarter of the season gone and we’ll see where we are after that. But it’s not been too shabby a start!”\n\nWoody still going strong and Robins's return - Rotherham lowdown\n\nCoventry City head to Rotherham this weekend looking for an elusive first League One win on the road.\n\nThe Sky Blues have made an eye-catching start to the campaign, currently one of only three teams – along with Liverpool and Ipswich Town – in the top four divisions to be unbeaten in the league.\n\nBut they still haven’t managed to pick up three points away from their adopted St Andrew’s groundshare ‘home’ and Saturday’s fixture at the New York Stadium provides as good a chance as any to achieve that feat.\n\nThe Millers, who are clearly still adapting to life back in the third tier after last season’s relegation from the Championship, have only won once at home so far this term.\n\nBut what can we expect from Paul Warne’s side?\n\n(Image: Athena Pictures/Getty Images)\n\nHere Paul Davis, of the Rotherham Advertiser, gives the lowdown on City’s next opponents who sit in 13th place in the division.\n\nHow would you assess United’s start to the season?\n\n\"Inconsistent would be the best way to describe it. There have been three wins, three draws and three defeats,\" he says.\n\n\"Generally, Rotherham have performed better on their travels than they have at AESSEAL New York Stadium. The Millers have looked good at times but are still bedding after a summer of exits and new arrivals.\n\n\"No-one really quite knows just yet how good or otherwise they might be. A 2-1 defeat at Bristol Rovers last weekend, when Rotherham allowed themselves to be outmuscled in the second half, was a setback after three games without defeat.\"\n\nHaving come down from the Championship, what are the expectations this time round?\n\n\"Most fans are hoping for a tilt at the play-offs,\" said Davis.\n\n\"True, Rotherham did drop out of the Championship last term but they went down with their heads held high, giving their survival bid a really good go and winning the respect of a lot of the major teams in that division.\n\n\"There are no scars from that campaign.\"\n\nTo read the full lowdown on Saturday's opposition, including what sort of reception Mark Robins can expect on his return to the club he served as player and manager, click here:\n\nFor all your latest Coventry City news, transfer gossip and opinion, click here\n\nDownload the CoventryLive app Click here for iPhone and here for Android\n\nVisit our Facebook pages for Coventry and Nuneaton or visit our Twitter pages for Coventry and Nuneaton\n\nWatch our videos on YouTube and see our photos on Instagram\n\nFind old stories in our online Archives and search for jobs, motors and property, or place an advert or family notice here"}, {"url": "https://footballbh.net/2023/05/23/coventry-city-relegation/", "page_content": "With Coventry City just one game away from the Premier League, facing Luton Town at Wembley on Saturday, it felt like a good time to rerun this old piece from our sister site Tale of Two Halves.\n\nFootball’s a funny old game. At least in the mind of Jimmy Greaves. Try telling that to Coventry City fans as they dwell on the very real possibility that this could be their club’s last season in the Football League.\n\nThe club should be celebrating their 100th year in the English Football League this season but an ongoing legal dispute between the Sky Blues’ owners Sisu, Premiership rugby club Wasps and Coventry City Council, could spell the end of league football for the Midlands outfit.\n\nCoventry City left their former home of 106 years, Highfield Road, for the Ricoh Arena back in 2005 but have faced uncertain times since. In 2007, they were 20 minutes from entering administration and despite leaving the Ricoh in 2013 for a groundshare with Northampton Town, they returned a season later.\n\nEmbed from Getty Images\n\nProtests against club owners and general off-field problems have haunted the club since and now the EFL have given the club a 2 April deadline to provide a detailed plan for where they will play their home games for the 2019/2020 season.\n\nShould they fail to satisfy EFL regulations, a meeting of all 92 member clubs will be called to decide the club’s fate, with expulsion from the football league on the table.\n\nWith a heavy shadow hanging over the club, we decided to take a look back to happier times – the 1990s and Premier League football.\n\nThe short-lived glory days\n\nAs the club entered the 1990s they had become a powerhouse of sorts at football’s top table. Never among the top six, but always doing enough to stay above the breadline.\n\nA shock 1987 FA Cup Final victory against Tottenham Hotspur had brought a first, and to this day, only major trophy, as John Sillett and George Curtis’ side saw off the talents of Glenn Hoddle, Chris Waddle, and Ossie Ardiles. An extra-time own goal from Gary Mabbutt sent the Sky Blues wild but a European ban for English clubs in the wake of the Heysel disaster prevented Coventry taking their place in the Cup Winners Cup in 1987-88.\n\nEmbed from Getty Images\n\nAs top-flight football entered a new dawn at the end of the 1991/92 season, Coventry survived relegation by two points and took their place in the inaugural season of the Premier League.\n\nBobby Gould’s men far exceeded expectation as they got off to a flying start with six wins from their opening eight games, leaving them in second place.\n\nJohn Williams and Peter Ndlovu had Highfield Road buzzing under the lights but as the wheels came off in the run-up to Christmas, the Sky Blues slipped to ninth.\n\nJust shy of 20,000 watched in awe as Micky Quinn and Brian Borrows put, first, Liverpool (5-1) to the sword, before following up with a 3-0 victory against Aston Villa to keep City in touching distance of a European slot.\n\nThe sale of Robert Rosario to Nottingham Forest in January was followed by Kevin Gallacher’s £1.5m switch to Blackburn Rovers in March and the goals dried up. Just eight goals came from their remaining 11 games, leaving the club down the table in 15th, and a 3-3 final-day draw with Leeds United ensuring Premier League survival.\n\nFor the four previous seasons, Coventry had been tipped for relegation and despite the same axe hovering over their head again, they started the 1993/94 season in scintillating form. A Micky Quinn hat-trick stunned the Gunners at Highbury on the opening day and an eight-game unbeaten run began.\n\nEmbed from Getty Images\n\nBut as was now customary for quick-starting City, the wheels began to come off. It still came as a surprise to everyone in football when Gould tendered his resignation after losing 5-1 away to QPR. Bolton Wanderers’ Phil Neal was appointed the manager, tasked with survival.\n\nNdlovu and Dublin: a partnership to be proud of\n\nZimbabwean Ndlovu was making a name for himself at the club and his tally of 11 goals aided Neal’s cause as the Sky Blues rocketed up the table late in the season to finish a worthy 11th. Wins against Ipswich Town, Tottenham Hotspur, Blackburn Rovers, and Chelsea in the final weeks of the season showed a defiant side to Neal’s men, and hope for long-suffering City fans.\n\nStriker Dion Dublin was signed from Manchester United for £2m in the close season but hopes of another quick-start were squandered as City lost three of their opening five matches. Dublin grabbed his maiden goal in a 2-2 draw at QPR before firing in the winner against Leeds United in mid-September as City recorded their first win of the season.\n\nDublin formed a formidable partnership with Ndlovu as Coventry claimed five wins from their next 10 games but, again, the bubble burst and an 11-game winless run saw them slip from 10th to 18th.\n\nEmbed from Getty Images\n\nA 2-0 away win marked Neal’s last game in charge as Ron Atkinson was brought in as his successor, with Gordon Strachan coming in as his assistant. An unbeaten run helped the Sky Blues move clear of the relegation places and in one of the most remarkable results in the club’s history, Ndlovu scored a hat-trick as City defeated Liverpool 3-2 at Anfield.\n\nAdditional wins came against Sheffield Wednesday and Spurs but a poor run to the end of the season left Atkinson’s men in 16th. Clear of relegation and survival achieved.\n\nThere was little to celebrate for City fans in the 1995/96 season as they mustered just eight wins from their 38 games. In a forgetful season for Atkinson’s men, the highlights included another victory against Liverpool – this time courtesy of Noel Whelan – and a 5-0 home drubbing of Blackburn Rovers.\n\nIngrained in the memory of all football fans though will be the horrifying injury sustained by David Busst at Old Trafford on 8 April 1996. While challenging for a corner Busst went in for a tackle with both Denis Irwin and Brian McClair and came off the worse with extensive fractures to his tibia and fibula.\n\nDespite 26 operations, Busst never returned to the professional game and retired from football six months later. A dark day not only for City fans but football fans the world over. The only glimmer for the club was their final day salvation effort in which they avoided relegation – again – on goal difference with a 0-0 draw against Leeds United.\n\nI believe in miracles\n\nHaving dodged a bullet on the last day, investment was needed and Atkinson moved fast to sign up Gary McAllister (£3.5m) from Leeds United, while Newcastle United’s Darren Huckerby (£1m) and Gary Breen (£2.5m) from Birmingham City joined midway through the season.\n\nA horrible start to the season saw 11 goals shipped with just one McAllister goal as City lost four of their opening five games. A 2-1 home win against Leeds was followed with six successive draws as the Sky Blues stopped the rot but it wasn’t enough to save Atkinson’s job.\n\nHe was moved to a Director of Football role in early November as Strachan became player-manager. An upturn in fortunes led to one of Coventry’s best spells in their Premier League history as they recorded four-straight victories.\n\nWith Huckerby finding his scoring boots and Dublin continuing to drag City up the table, contributions from the spot came the way of McAllister as home wins against Newcastle United and Middlesbrough bookended away wins at Leicester City and Leeds United.\n\nEmbed from Getty Images\n\nAs New Year 1997 began, Coventry had pulled five points clear of relegation. In a disastrous run to the end of the season, the Highfield Road side managed just three wins from their next 17 games. Entering the final day, a miracle was needed at White Hart Lane.\n\nTwo points from safety but still just three points from Southampton in 16th place, the Sky Blues headed south to London, to take on Spurs, who had nothing to play for in mid-table. Even if they won, they needed other results to go their way.\n\nWith just 12 minutes on the clock, Aston Villa took the lead against Southampton, and as if reacting to the news, Dublin headed home a McAllister cross to give Coventry the perfect start. When Paul Williams volleyed home a McAllister corner on 39 minutes to make it 2-0, the survival miracle was becoming a very real prospect.\n\nHowever, a Sunderland or Middlesbrough victory could still relegate Strachan’s men, even if Southampton lost. At half-time, Coventry were safe, despite Paul McVeigh pulling a goal back for Spurs. The score would remain the same until the final whistle at White Hart Lane but it was a nervy final 10 minutes for the away fans as they sought news of their relegation rivals.\n\nBut when the news arrived that Sunderland had lost at Wimbledon and Middlesbrough could only manage a 1-1 draw at Leeds, Strachan and Coventry had done the unthinkable and escaped the clutches of the Grim Reaper once more.\n\nDespite their survival, Ndlovu was sold to Birmingham City for £1.6m, with Eoin Jess and Regis Genaux also leaving in the same transfer window.\n\nAn upturn in fortunes\n\nHaving completed mission impossible, Strachan was kept on as manager for the 1997/98 season and Coventry started the season with a statement of intent – a 3-2 away win at Chelsea, courtesy of a Dion Dublin hat-trick.\n\nFinishing as top scorer with 13, 14 and 13 goals in his previous three seasons, Dublin had become a household name and hero at Highfield Road. His goals would be crucial to another season in the top flight.\n\nEmbed from Getty Images\n\nDespite their opening-day triumph at Chelsea though, City had to wait until mid-September to taste victory again, ending a four-game winless streak at home to Southampton.\n\nIt was to be a season of consolidation for Strachan’s side as they drew a staggering 16 matches from the 38 scheduled. Huckerby had replaced Ndlovu as Dublin’s strike partner and proved a worthy addition.\n\nAnd in a game that will always stick in my mind from the 1997/98 season was the duo putting Manchester United to the sword at Highfield Road.\n\nNoel Whelan struck first as the hosts took a 12th-minute lead but United weren’t a side that took well to going behind and were level after half an hour as Ole Gunnar Solskjaer danced past the City defence and slotted home.\n\nTeddy Sheringham put United ahead on 47 minutes but Huckerby and Dublin tore up the script to take the headlines. It was Dublin who levelled the match from the penalty spot with just four minutes to go, and surely all the home fans were praying they would hold out for a 2-2 draw.\n\nStep up Darren Huckerby. Collecting the ball in midfield, Huckerby ghosted past Gary Neville and weaved into the box before firing beyond Kevin Pilkington in the United goal to secure all three points. Needless to say, the celebrations were on point.\n\nFive successive wins saw Bolton Wanderers and Crystal Palace overwhelmed 5-1 and 3-0 respectively as City climbed up the table in February, but five draws from their last six games meant the European dream was agonisingly close, but just out of reach in 11th place.\n\nDublin’s 18 league-goal haul secured him a big-money move to Aston Villa in November 1998 as Coventry endured their worst start to the Premier League since its inception with just two wins from their opening 10 games.\n\nBack-to-back wins against Blackburn Rovers and Everton lifted the Sky Blues to 15th in the league but just three points from their next seven games kept them in the mix at the wrong end of the table, seeing out 1998 in 17th position.\n\nHuckerby scored a hat-trick as relegation rivals Nottingham Forest were steamrollered 4-0 and Liverpool were the next to succumb under the Highfield lights as they were defeated 2-1, goals coming from George Boateng and Whelan.\n\nA mixed bag of results towards the end of the season ensured Premier League survival, City were no longer relying on final-day miracles to maintain their top-flight stay.\n\nBig plans for a new stadium\n\nAs the 1990s came to a close, Coventry were planning big. News of a new stadium – the Ricoh Arena – to be built for the 2002 season, was announced, and before the 1999/2000 season began, Strachan had a double-Moroccan signing in Youssef Chippo (£1.2m) and Mustapha Hadji (£4m).\n\nWolves starlet Robbie Keane was bought for £6m in a then-British transfer record fee for a teenager and Colin Hendry came in to shore up the defence in his twilight years.\n\nEmbed from Getty Images\n\nIt took the new boys time to settle at Highfield Road as City claimed just one win from their opening eight games. But once the shackles were off, Strachan’s men were a dangerous side to watch. No longer the happy-go-lucky survivors, Coventry looked the real deal.\n\nHome wins against West Ham United (1-0), Newcastle United (4-1), Watford (4-0) and Aston Villa (2-1) were backed up with draws on the road and Coventry found themselves in 11th as they entered the final month of the decade.\n\nA Boxing Day triumph against Arsenal was followed up by a 2-1 home win against Wimbledon but a lack of consistency would prevent City claiming a top-half finish.\n\nDespite four wins from their last five home matches, City’s form away from Highfield Road was disastrous and saw them stutter to 14th. A disappointing end to the season after so much promise just nine months earlier.\n\nA fall from grace\n\nAfter 34 years playing in the top flight of English football, Coventry were, as some might say, finally relegated from the Premier League at the end of the 2001 season. Their doggedness and determination had served them well through the 90s, but an inevitability caught up with the club and they found themselves playing Championship football in 2001/02.\n\nEmbed from Getty Images\n\nSince then, things have gone from bad, to really bad, some good, and now back to really bad. A decade in tier two saw the successful move to the Ricoh Arena, but relegation to League One in 2012 started a spiral of devastation.\n\nThe club were forced to find a new home and organised a ground share with Northampton Town, while narrowly avoiding a winding-up order in 2013. The club hit a new low when it was relegated to League Two at the end of the 2016/17 season, despite winning the Football League Trophy at Wembley.\n\nThe Sky Blues bounced back to League One at their first attempt and are currently six points adrift of the playoffs in their bid to return to Championship football.\n\nBut with the stadium issues once again rearing their ugly head, the next six weeks will be crucial for City as they seek another miracle – escaping expulsion from the football league. For the good of football, and all involved with this great club, let’s hope the organisations involved can find a way forward for Coventry City. Time will tell."}, {"url": "https://www.coventrytelegraph.net/sport/football/football-news/tottenham-hotspur-bayern-munich-coventry-17019735", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet Sky Blues transfer latest, team news, match updates and analysis delivered straight to your inbox\n\nIt’s official! Tottenham Hotspur have taken Coventry City’s 49-year unwanted record of suffering the heaviest defeat by an English club in Europe.\n\nThe Sky Blues were famously beaten 6-1 by Bayern Munich back in 1970 and no other English side has been put to the sword so severely until Tuesday night’s 7-2 UEFA Champions League thrashing of Spurs – by remarkable coincidence, also inflicted by the German giants.\n\n“I was watching the game on TV, which I thought was a fabulous game of football,” said Coventry City ’s official historian and statistician, Jim Brown.\n\n“Bayern were absolutely awesome and it wasn’t until the seventh one went in that I realised, ‘blimey, that’s our record gone!’\n\n“I think Leicester lost 5-0 in the Champions League a couple of years ago, and 7-2 obviously trumps 6-1, so the record has gone.\n\n“Coventry have held the record of the heaviest defeat by an English club in European competition since 1970, so 49 years when the Sky Blues lost in the European Fairs Cup.\n\n“I was there that night and remember it well.”\n\nFor younger readers, Jim recalled: “I was 18 at the time and went on a two day trip to Munich. I think the whole package, including flights, transfers, hotel and match ticket cost me £25, which was a lot of money in those days.\n\n“I think about 500 City fans went over and it was an absolutely miserable night. The rain lashed own for the whole 90 minutes.\n\n“City’s goalkeeper, Bill Glazier, had been ruled out with an injury and the manager had to call up the reserve keeper Eric McManus. It wasn’t his debut but it was only his second or third game and poor Eric had an absolute nightmare.\n\n“Bayern were hitting shots from 25/30 yards and Eric just couldn’t handle it.\n\n“We were 4-1 down after 20 minutes and it was just a shambles really.\n\n“Bill Glazier was sat behind me in the stands with Roy Barry, who was the club captain at the time and recovering from a broken leg, and they had their heads in their hands as the goals went in.\n\n“And I’m convinced Coventry wouldn’t have lost like that had Bill been in goal. The other thing, of course, was that City beat Bayern 2-1 in the second leg at Highfield Road and gave a very good account of themselves.”\n\nHe added: “Interestingly, before the first leg the club made the second leg all ticket, which was very rare in those days, and there was a capacity back in those days of 50,000 at Highfield Road.\n\n“But of course the result of the first leg put people off with everyone thinking it was a foregone conclusion, and the actual crowd was only about 26,000.”\n\nAs for the coincidence that the record should be beaten by a team losing to Bayern Munich again, he said: “Yes, isn’t that strange!\n\n“They were a strong side in 1970 when they had three World Cup winners, and they’re a very strong side now.\n\n“So our old FA Cup rivals have that new crown. And it’s incredible because it’s four months to the day that Spurs played in the Champions League final, and suddenly they get walloped at home.”\n\nFor all your latest Coventry City news, transfer gossip and opinion, click here\n\nDownload the CoventryLive app Click here for iPhone and here for Android\n\nVisit our Facebook pages for Coventry and Nuneaton or visit our Twitter pages for Coventry and Nuneaton\n\nWatch our videos on YouTube and see our photos on Instagram\n\nFind old stories in our online Archives and search for jobs, motors and property, or place an advert or family notice here"}, {"url": "https://www.theguardian.com/sport/live/2020/apr/25/coventry-city-v-tottenham-hotspur-1987-fa-cup-final-live", "page_content": "25 Apr 2020 17.52 BST So congratulations to Coventry City, the deserved winners of the 1987 FA Cup! Onwards and upwards for a club that has finally come of age as a top-flight concern. Next season’s kit, a gorgeous sky-blue take on Denmark’s beloved Hummel number from Mexico 86, looks like a statement of intent to us. As for Spurs ... only those with a heart of stone or a Highbury season ticket will fail to feel for them, after contributing so much to the league and both cups, only to come away with nothing. They’ll be back at Wembley soon enough, just like David Pleat promises. Anyway, thanks for reading this MBM. David Lacey’s report has landed; click below and enjoy. Here’s hoping for more David-Goliath cup drama next year! Cup earned by the Blue crew Read more Dave Bennett and Keith Houchen - two of Coventry’s goalscorers - hold the trophy as they parade round the pitch on the Sky Blues’ well deserved lap of honour. Photograph: Colorsport/Shutterstock Absolute scenes back up in Coventry. Photograph: Stirk/Birmingham Post and Mail Archive//Mirrorpix/Getty Images\n\nUpdated at 19.50 BST\n\n25 Apr 2020 17.51 BST Meanwhile up at Hampden Park, St Mirren held on to beat Dundee United by that Ian Ferguson goal. Here’s Simon McMahon, albeit in heavily edited form: “[Deleted by Family Newspaper Editor] knew it. [Deleted by Family Newspaper Editor] St. Mirren. But at least we’ve got three full days to prepare for the second leg of the Uefa Cup final. [Deleted by Family Newspaper Editor] sakes. I think we all know how this ends, right?”\n\n\n\n25 Apr 2020 17.47 BST Glenn Hoddle, having come off very much second best in his tussle with the relentless Lloyd McGrath, is slightly sour. “It is a lot harder to paint a picture than to destroy one,” he harrumphs. Not sure his manager will be having that, not least because Coventry played some very pretty football indeed. In fact, here’s Pleat again: “A couple of our players did not do what they have been doing or are capable of doing. The players who did not quite get to grips with it know who they are.” You don’t have to squint too hard to read between the lines there. Ah well, Hoddle’s almost certainly off anyway, there’s probably no point worrying too much about his feelings. A dejected Glenn Hoddle as the Spurs players applaud their fans after the match. Photograph: Action Images\n\nUpdated at 17.52 BST\n\n25 Apr 2020 17.45 BST David Pleat’s hot take: “We were in a lovely position at half-time. A third goal for us would have killed it. The second goal was absolutely vital for them, they were more convinced than ever that their name was on the cup. In the end I thought they deserved to finish in front. We were stretched and they might have scored more. But we contributed to a fair game. We needed to win something at the end of a season in which we have scored a lot of goals and played a lot of games, but it didn’t work out that way. Now we’ll go and try to keep our heads high. Some of our younger players will be back here.”\n\n\n\n25 Apr 2020 17.44 BST John Sillett finally takes the lid of the cup off his head, stops dancing, and speaks! “The longer the game went on, the more certain I was that we were going to win it. Just before extra time I could see some heads dropping. They didn’t relish the prospect of the extra half-hour. I felt that if we continued to do the simple things and make the ball do the work, then this, plus our character and stamina, would make the cup ours. I said to the players at the end of regular time: let’s get at them. But there should be credit all round here. We saw two sides trying to play attacking football as we both showed the best of the English game.” Preach on, Schnozz. Coventry City Manager John Sillett celebrates the win with the FA Cup. Photograph: Action Images\n\nUpdated at 17.46 BST\n\n25 Apr 2020 17.43 BST Some clarification regarding Tottenham’s second goal. It was indeed scored by Mabbutt. He’s claimed it, and Kilcline is more than happy to agree. And it’s been made official. That means Mabbutt joins Charlton Athletic’s Bert Turner (1946) and Manchester City’s Tommy Hutchison (1981) as players who have scored at both ends in an FA Cup final. It’s an exclusive club. Does that make things better or worse? It’s hard to say, isn’t it.\n\nUpdated at 18.20 BST\n\n25 Apr 2020 17.42 BST Brian Kilcline climbs the famous 39 steps to lift Coventry’s first-ever major trophy! He does so in a slightly ginger (yeah, yeah) manner, holding it up below the handles, carefully around the waist. The thigh and ribs must really be hurting. But then one of the photographers shouts “Handles!” in an demand for a more traditional pose. Kilcline, adrenaline acting as an opiate, extends his arms and obliges, hoisting the cup as high as it can go! Meanwhile spare a thought for poor old Spurs: several of their players are laying on the hallowed turf too, but in desolation as opposed to elated exhaustion. David Pleat is wandering around in stunned confusion, while Richard Gough looks close to tears. Coventry City captain Brian Kilcline kisses the FA Cup as the Duchess of Kent hands it over. Photograph: PA Images Then beams a huge smile as he hoists the trophy high. Photograph: Chris Cole/Allsport/Getty Images\n\nUpdated at 17.56 BST\n\n25 Apr 2020 17.39 BST Coventry cavort as you’d expect them to cavort, albeit in a half-kaput fashion. Keith Houchen, one of 12 heroes, responds to the final whistle by quietly shaking hands with Gary Stevens. Dave Bennett, surely the man of the match, sits sprawled on the turf. Cyrille Regis squats next to him, head down, catching his breath. They’ve put everything into this. Not a joule of energy spared. They deserve this. They have been sensational, every last one of them. And it’s wasn’t just a story of graft and effort either: Coventry have won the cup with great flair and style. They’re a fine team, and now they have their place in history. Michael Gynn and Nick Pickering (right) embrace along with jubilant teammates Graham Rodger (14), Lloyd McGrath (4) and David Phillips (2) as the Sky Blues players celebrate a famous victory. Photograph: PA Images\n\nUpdated at 17.48 BST\n\n25 Apr 2020 17.34 BST COVENTRY CITY HAVE WON THE 1987 FA CUP!!! Coventry City 3-2 Tottenham Hotspur (aet; 2-2 after 90 mins) The ref blows the final whistle and a 104-year wait for a major trophy comes to an end for the club formerly known as Singers FC! John Sillett and George Curtis leap into each other’s arms. David Pleat adjusts his cuffs, a coping mechanism of despair. It’s a sorry end to a Homeric season for Spurs. But what joy for Coventry, who finally have something to put in the cupboard! And not only that, they’ve played their part in one of the greatest FA Cup finals of all time. Perhaps the very best! An instant classic. Greg Downs (right) and his Coventry teammates celebrate at the final whistle as Coventry win the cup for the first time in their history. Photograph: Action Images\n\nUpdated at 17.36 BST\n\n25 Apr 2020 17.32 BST ET 30 min +1: Hoddle hooks a hail-mary cross in from the left. It’s nowhere near a team-mate and the ball bounces harmlessly through to Ogrizovic. On the bench, Sillett clenches both fists with a COME ON!!! Curtis performs the universally understood mime for Get Up The Blooming Pitch, Will You. Then Sillett stands up and acts it out as well. Coventry are so close! So close! Sillett sits back down, but four seconds later he springs back up again, because ...\n\n\n\n25 Apr 2020 17.31 BST ET 30 min: A Cov cacophony of whistles. Spurs are reduced to knocking it long. No good comes of the tactic. Regis, Bennett and Gynn play a bit of keep ball in midfield. A cheeky Bennett backheel - shades of Leeds versus Southampton in 1972 - elicits cheers of olé! from the Coventry faithful.\n\n\n\n25 Apr 2020 17.30 BST ET 29 min: Stevens and Paul Allen combine down the right, sending the latter into acres of space. Allen whips a head-height cross through the box. Neither Hodge nor Claesen can get anything on it. Hodge was an eyebrow away.\n\n\n\n25 Apr 2020 17.29 BST ET 28 min: Wonderful keeping by Clemence, mind. Meanwhile Sillett and Curtis continue to have a ball on the Coventry bench. Have any managers ever enjoyed FA Cup final day like these two? Their enthusiasm has been infectious from the first whistle.\n\n\n\n25 Apr 2020 17.28 BST ET 27 min: Coventry Should Have Wrapped This Up! (pt. XXXVIII in an ongoing series) Bennett intercepts a dismal Mabbutt pass and pings it straight back down the inside-right channel, releasing Gynn! Stevens tries to get back, but fails, sliding in from behind and missing. Gynn only has to dink over Clemence to wrap it up, but tries to round him on the outside instead. Pushed too far wide right, he slaps a tame shot straight into the sprawling keeper’s midriff. That really should have been that!\n\n\n\n25 Apr 2020 17.26 BST ET 26 min: Waddle drops deep to quarterback, but sends an aimless ball straight down Ogrizovic’s throat. Spurs are running out of ideas. Actually, in truth, their well of inspiration ran dry quite a while ago.\n\n\n\n25 Apr 2020 17.25 BST ET 25 min: Hoddle dinks a cute first-time wedge down the inside left for Claesen, who enters the box with a view to taking delivery of the pass, then shooting. But Peake is over to bravely head clear as Claesen attempts to trap. An intervention timed nearly as well as his whistle solo on Cov’s 45rpm pop platter.\n\n\n\n25 Apr 2020 17.24 BST ET 24 min: Stevens crosses from the right. Clive Allen traps, his back to goal on the right-hand corner of the six-yard box. He spins. If he curls one towards the bottom left, Ogrizovic’s feet are planted and Spurs are surely level. But McGrath pressures him, and Allen is only able to dribble a lame effort towards the bottom right and into the keeper’s hands.\n\n\n\n25 Apr 2020 17.23 BST ET 23 min: Incidentally, there’s a similar story unfolding at Hampden in the Scottish Cup final, where it’s bad news for Po’ Simon McMahon. Hot favourites Dundee United have fallen behind. Ian Ferguson has broken the deadlock for unfancied St Mirren! Shocks both sides of the border are on!\n\n\n\n25 Apr 2020 17.22 BST ET 22 min: Downs has a batter. It’s straight at Stevens, who was suspiciously closer than ten yards. Coventry recycle possession, and Gynn sashays in from the left, before fizzing a shot inches wide of the left-hand post. Not sure Clemence would have got to one planted in the bottom corner.\n\n\n\n25 Apr 2020 17.21 BST ET 21 min: Rodger strides up the middle, once again channelling his inner Bobby Moore. He nearly releases Houchen on the right, but the pass is blocked. Bennett picks up possession and dribbles at the raggedy Spurs back line. Mabbutt comes crunching in to concede a free kick, just to the right of the D.\n\n\n\n25 Apr 2020 17.20 BST ET 20 min: Before Spurs take their corner, Houchen is given a good talking-to by the referee. He’s obviously been running his mouth off, and Neil Midgley points theatrically to the tunnel, making it quite clear that one more word and he’ll be joining Manchester United’s Kevin Moran on the surprisingly short FA Cup final roll of shame. Zip it! Hoddle’s corner is punched clear with great authority by Ogrizovic. Bennett wanders off upfield, the clock his and Coventry’s friend.\n\n\n\n25 Apr 2020 17.19 BST ET 19 min: But Spurs aren’t done quite yet. Hoddle lumps a pass down the right for Paul Allen to chase. It’s overhit, but the midfielder does well to reach the byline before the ball goes out, and clanks it against Downs for a corner. “If Coventry pull this off, next week is going to be absolute hell,” worries 12-year-old James Wrout. “I desperately need some validation in the harsh world of the first year of big school. I’m really tempted to just stay at home all week instead.”\n\n\n\n25 Apr 2020 17.16 BST ET 17 min: A slow start to the final period of this extra time. Spurs need to up their game if we’re to come back later this week for a replay.\n\n\n\n25 Apr 2020 17.15 BST And we’re off again! Coventry get the ball rolling for the second period of extra time. They’ve were the best side in the first period by some distance. Spurs look knackered, their long season catching up with them at the very end. Can they somehow gather themselves for one last haul? “It’s extra time at Hampden too,” reports Simon McMahon. “Still no goals, though Dundee United have had one (rather dubiously) chalked off for offside. Can’t they check these things on video these days? I’m starting to think this might not be our day, or week.” Or month or even year? If it all goes the shape of a pear, we’ll be there for you, Simon.\n\n\n\n25 Apr 2020 17.11 BST EXTRA TIME, HALF TIME: Coventry City 3-2 Tottenham Hotspur The Sky Blues are 15 minutes away from glory. Tottenham have 15 minutes to salvage their 100 percent record in FA Cup finals.\n\n\n\n25 Apr 2020 17.10 BST ET 15 min: From the resulting throw, Waddle crosses and Rodger heads away from danger. Spurs come again, Hoddle attempting to magic-wand a chipped pass down the inside right for Waddle, but it flies harmlessly out of play for a goal kick.\n\n\n\n25 Apr 2020 17.09 BST ET 14 min: Bennett teases Thomas down the right for the umpteenth time. He finds Phillips on the overlap again. Phillips lays off to Houchen, who dribbles towards the corner flag before abruptly turning and flicking a pass back inside for Bennett, on the edge of the area. And this is a sheer delight: a first-time flick through the legs of Thomas. For a brief moment, this could be another cup-final goal for the ages! But just as Bennett prepares to shoot and deliver the killer blow, Gough slides in to block bravely. Spurs break through Paul Allen, but Rodger ushers the ball out of play down the right.\n\n\n\n25 Apr 2020 17.08 BST ET 13 min: Bennett drives at the Tottenham back line. He sends a pass wide right for Phillips, who has time to cause trouble, but balloons a cross behind for a goal kick. Over on the Spurs bench, David Pleat waves an encouraging fist at his players. Come on lads. But he’s currently perched at the polar opposite of the enjoyment spectrum to Sillett and Curtis. A season that promised so much looks like ending in abject trophy-free disappointment. Spurs certainly don’t look like a team capable of turning this around. Plenty of time left yet to prove us wrong, of course.\n\n\n\n25 Apr 2020 17.07 BST ET 12 min: This is all Coventry. Spurs look out for the count. On the bench, John Sillett and George Curtis are a textbook study of elation. Clapping their hands, waving their arms, smiling and laughing, Coventry’s managerial duo are clearly determined to enjoy their big day, just as their players look in the mood to seize it! Fun: it’s a simple concept, unfashionable perhaps. But they’re having it! Wonderful to see.\n\n\n\n25 Apr 2020 17.06 BST ET 11 min: Bennett takes up possession down the right as Thomas and Gough faff around in the exhausted, nervous and incompetent style. He feeds Houchen , who is afforded way too much time and space just inside the area. Houchen tries to thread one into the bottom left, but it’s gathered by Clemence and always curling away in any case. Coventry are racking up the chances to put this one beyond doubt. Will they live to regret their generosity?\n\n\n\n25 Apr 2020 17.05 BST ET 10 min: But it’s still a free kick just to the right of the D. A quick tap to the right, and Phillips bangs a dismal effort straight into the wall. A chance to warm Clemence’s hands - or possibly put this final out of Tottenham’s reach - is spurned.\n\n\n\n25 Apr 2020 17.05 BST ET 9 min: Nope! Downs and Houchen combine down the left and suddenly Bennett is racing into the Spurs half, with Gynn free in acres down the middle. Bennett delays the pass a little, and though he finds Gynn, he’s allowed Gough to get back and cover. Still, all Gough can do is cynically check Gynn as the Coventry livewire prepares to turn on the jets and zip past him down the inside-right channel and into the box. A tired and desperate hanging out of the leg, with no attempt to play the ball. He should go in the book, but we know what sort of mood Neil Midgley is in, so it’s just a chat and a finger-wag. Both sides have got away with one.\n\n\n\n25 Apr 2020 17.03 BST ET 8 min: Claesen immediately busies himself down the right and earns a free kick off Downs. Hoddle’s delivery isn’t all that, and it’s cleared by Rodger. Hoddle gets another go, but his right-wing cross is hooked clear by Peake. Will this turn into attack versus defence, as Coventry City, 104 years young and without any major silverware to their name, sail nervously into uncharted territory?\n\n\n\n25 Apr 2020 17.02 BST OWN GOAL!!! Coventry City 3-2 Tottenham Hotspur (Mabbutt 96 og) The substitute Rodger intercepts a long pass intended for Clive Allen and strides upfield in homage to Bobby Moore. He calmly enters the Spurs half, takes a look around, and sprays a pinpoint pass to McGrath on the right touchline. Thomas is nowhere near him. McGrath makes it all the way to the edge of the Spurs box, level with the six-yard line. He looks for Pickering in the middle, but Mabbutt, desperately tracking back, sticks out his left leg in the hope of blocking and bundling out for a corner. He had to attempt the interception, but it doesn’t work out. The ball slices off his left kneecap and sails along a perplexing parabola, looping over the helpless Clemence and into the top left! What an absurd stroke of bad luck for Mabbutt and Tottenham ... though Coventry were playing delightfully, pushing hard and this is their reward! The ball flies off the knee of Gary Mabbutt and over Spurs keeper Ray Clemence and Coventry have the lead for the first time in the game Photograph: Mark Leech/Offside/Getty Images Lloyd McGrath ((whose cross was deflected into the net) celebrates with Pickering, Houghen and Bennett, Photograph: Colorsport/Shutterstock\n\nUpdated at 18.05 BST\n\n25 Apr 2020 17.01 BST ET 6 min: Spurs wobble a little. Phillips attempts a cross from the right. It’s blocked. He has another go. In the centre, Gough heads weakly straight up into the air. Regis beats Hughton to the second ball, dropping on the penalty spot, and guides a header left for Pickering. The bounce isn’t Pickering’s friend, and he’s forced a little wide, where he has to hook across goal. Bennett, on the far post, tries to head down for Houchen, but Hodge does enough to put the striker off and Thomas skelps clear. But Coventry come straight back at Spurs, and ...\n\n\n\n25 Apr 2020 17.00 BST ET 5 min: Hodge drifts in from the left, a run that momentarily threatens to open up the backpedalling Coventry defence. But just as it appears the space for a shot is opening up, Downs arrives on the scene to block.\n\n\n\n25 Apr 2020 16.59 BST ET 4 min: Mabbutt exchanges passes with Stevens and tries to burst through the middle of the Cov defence but the door slams shut. Coventry break through Pickering, McGrath and Bennett, the latter skating down the right and winning a corner off Hodge. The set piece is taken short, and Bennett dribbles along the byline before ballooning an excitable cross high over everyone in the box. Another promising position comes to nought.\n\nUpdated at 17.00 BST\n\n25 Apr 2020 16.59 BST ET 3 min: Bennett rides a weak Stevens tackle in midfield and sets off upfield. He finds Gynn, who has options: Pickering to his left, McGrath and Houchen to his right, and there’s only Gough and Mabbutt guarding the back gate for Spurs. Gynn’s eventual pass left, intended for Pickering, hits Gough on the heel and a fine break crumbles.\n\n\n\n25 Apr 2020 16.58 BST ET 2 min: A slow start to extra time. Coventry fans amuse themselves with a rendition of their cup final song, Go For It City. Sky Blues, shooting to win! Not a peep of Hot Shot Tottenham yet. “My dad has gone to Wembley today to watch the cup final with my uncle – without taking me,” cries Jonny Weeks. The tears are fair enough, because he’s only four years old. “My mum’s not even put the game on the tele ffs! This MBM’s all I’ve got. Got a funny feeling our name’s on the cup today. I don’t care how we do it – via someone arse or knee in extra time for all I care. I swear we’ll name a fanzine after whoever wins it for us. Play Up Sky Blues!” That’s pretty darn erudite for a pre-schooler! What an extremely smart young lad. He’ll go places when he grows up, I’ll be bound.\n\n\n\n25 Apr 2020 16.55 BST And we’re off again! Again! Spurs get extra time underway. They’ve made a change, with the cramp-bound Ardiles replaced by Stevens. “As a Cov fan, my nerves are shredded already,” begins Malcolm. “Not sure I can take extra time. My Spurs mate feels the same. He says he doesn’t care how they win, he’d take another scrappy goal off Mabbutt’s leg.”\n\n\n\n25 Apr 2020 16.50 BST Extra time follows after the break ... during which Germany beat England 12-0 in an advert for Holsten Pils. (They deserve a little shout-out, given the Spurs shirt fiasco.)\n\n\n\n25 Apr 2020 16.48 BST FULL TIME: Coventry City 2-2 Tottenham Hotspur This has been a superb final, an instant classic ... and we’re going to get more of it! Another 30 minutes! Thank you, o football gods! And if nothing gets decided during extra time, to a replay we will go.\n\n\n\n25 Apr 2020 16.47 BST 90 min +2: Some time has been added for the stoppage after the Kilcline-Mabbutt incident. Only now do both teams look like they’ve settled for extra time.\n\n\n\n25 Apr 2020 16.45 BST 90 min: Bennett wanders up the right wing and is brought down by a knackered Hodge. From the resulting free kick, Bennett is found in plenty of space down the right, but with time running out he panics and snatches at his cross, sending it high and wide.\n\n\n\n25 Apr 2020 16.43 BST 89 min: Kilcline, who has been limping since bodychecking Mabbutt, can’t continue. He’s jiggered his thigh, and maybe his ribs too. Coventry’s captain is forced to make way for Graham Rodger. He departs to a disapproving chorus from the Spurs choir. Rodger is immediately in the thick of it, winning a clearing header from the corner.\n\n\n\n25 Apr 2020 16.43 BST 88 min: Waddle twists and turns, 25 yards out, desperate to shoot. But Gynn won’t give an inch. Coventry hold their shape. But then the ball’s slipped wide for Hughton, who curls low towards the near post. Clive Allen is sniffing, nips in ahead of Phillips on the right-hand corner of the six-yard box, swivels and flips a shot on target from the tight angle. Ogrizovic, at his near post, contorts at great speed to kick off the line and out for a corner. Allen so close to goal number 50 for the season, and what surely would have been the winner! That split second will have seemed like minutes for everyone involved with Coventry City, their once-in-a-lifetime dreams very nearly extinguished at the death!\n\n\n\n25 Apr 2020 16.42 BST 87 min: Waddle takes the resulting free kick. Kilcline heads it powerfully back upfield. Regis bursts down the middle on the counter, feeding Gynn on the left. Gynn twinkles his toes, but can’t get past Ardiles and soon enough Spurs are on the counter-counter! Thomas and Clive Allen combine crisply down the inside left, the former nearly breaking into a world of space just in front of the Coventry area. But Downs and Pickering swarm and bundle the ball back to Ogrizovic. There’s never been a sign of anyone settling for extra time.\n\n\n\n25 Apr 2020 16.41 BST 86 min: Kilcline really should be booked for that, but referee Neil Midgley - who to be fair has refereed this free-flowing game marvellously, and without pomp or ego either - settles for a stern chat. The Spurs support don’t like it, but what can you do, and it’s in keeping with the mood of the day.\n\n"}, {"url": "https://www.theguardian.com/sport/live/2020/apr/25/coventry-city-v-tottenham-hotspur-1987-fa-cup-final-live?page=with:block-5ea455cd8f08fa2bdcb1b593", "page_content": "25 Apr 2020 16.39 BST 84 min: Waddle turns on the jets and launches a direct sortie down the inside-right channel. He knocks the ball forward and instigates a foot race. For a second it looks as though he’ll win it, but Downs comes across to shepherd the ball back to Ogrizovic.\n\n\n\n25 Apr 2020 16.38 BST 83 min: Ardiles doesn’t get up. He’s got cramp. Sportingly, he rolls off the field to let play continue, and allow the physio to do his thing. What a gentleman.\n\n\n\n25 Apr 2020 16.37 BST 82 min: Regis nearly opens Tottenham up with a boisterous run! Ogrizovic launches a long goal kick towards Houchen, who flicks on. Regis takes up possession and makes good down the inside-left channel. Hughton should deny him entry to the penalty box, but Regis ignores the challenge and simply barges past him. He flick goalwards from a tight angle, but there’s little power in his effort - the ball was caught between his feet - and a combination of the lunging Ardiles and Clemence stops the shot. The ball breaks back to Regis, almost on the byline. He attempts to stab the ball across the face of goal, but again can’t get any purchase, allowing Mabbutt to step in and shepherd the ball back to Clemence. Spurs breathe a sigh of relief.\n\n\n\n25 Apr 2020 16.36 BST 81 min: Waddle strides down the middle in his trademark insouciant manner, and has a crack from distance. The ball nicks off Gynn, standing just in front of him, and flies harmlessly wide left. Ogrizovic probably had that covered had it not taken a deflection and stayed on target. The resulting corner is a non-event.\n\n\n\n25 Apr 2020 16.35 BST 80 min: Bennett embarks on another skitter down the right and feeds Phillips on the overlap. Phillips gets over-excited and hoicks his cross miles behind the goal.\n\n\n\n25 Apr 2020 16.34 BST 79 min: Hodge spins down the inside-right channel and tugs one back for Clive Allen, who connects with a shot six yards out. He’s surely got to hit the target, at the very least, but he’s under pressure from Kilcline and welts high and wide.\n\n\n\n25 Apr 2020 16.33 BST 78 min: The pace has dropped since we took the break for Waddle’s nap. Downs clinks Waddle near the right-hand corner flag, and this is a free kick in a dangerous position. Hoddle’s delivery isn’t all that, and Kilcline clears easily. The ball comes back at Coventry, and for a second it looks like Paul Allen has time and space to shoot in the box. But he hasn’t. He’s closed down and the ball squeaks through to Ogrizovic.\n\n\n\n25 Apr 2020 16.31 BST 76 min: Some space for Thomas down the left. He fizzes a ball along the corridor of uncertainty, but the flag’s gone up for offside. Thomas has looked bright in attack this afternoon, less sure of himself at the back. “I think we can safely say that this is a slightly better game than the one at Hampden,” reports Simon McMahon. “It’s still 0-0 between Dundee United and St Mirren, and looking like the first goal will win it. Possibly after extra time. United are still on course for glory, though!”\n\n\n\n25 Apr 2020 16.29 BST 74 min: Waddle is clipped from behind by McGrath. There’s not much in it, but the Spurs star decides to roll about for a while anyway. On comes the physio. A fair chance Waddle was just after a rest. And who could blame him? This match has been played at 101 miles per second from the off.\n\n\n\n25 Apr 2020 16.28 BST 73 min: Paul Allen cuts in from the left and, from a great distance, flays a dismal effort towards the top-right corner of Wembley Stadium. As a West Ham player, Allen was infamously brought down by Arsenal cynic Willie Young when through on goal in the 1980 final. He’s probably owed one, but he was asking for too much karmic payback there. Ambitious, to put it mildly.\n\n\n\n25 Apr 2020 16.27 BST 72 min: ... Regis sends a weak header straight down Clemence’s throat from 12 yards. On the bench, Schnozz Sillett emits a passionate bellow of COME ON!!! There’s not a hint of aggression in it; a huge grin is spread all across his face. The childlike enthusiasm of a man who knows he’s watching a great cup final; the sheer excitement of a man who knows this could just become one of the greatest days in his life.\n\n\n\n25 Apr 2020 16.26 BST 71 min: Bennett is in the zone right now. A couple of Garrinchaesque skitters down the right in quick succession, testing Thomas to his limits. Classic cup-final wingplay. Stanley Matthews or Tom Finney would be proud of this performance. The second run wins a corner. From which ...\n\n\n\n25 Apr 2020 16.25 BST 70 min: Phillips crosses from Bennett Country on the right. Houchen rises high over Hodge, and plants a firm header down, towards the bottom-right corner. Clemence does magnificently well to get down, stop and smother. For a second, that looked like it was flying in! That’s some goalkeeping from the 38-year-old, who played in his first FA Cup final back in 1971 for Liverpool.\n\n\n\n25 Apr 2020 16.24 BST 69 min: Hoddle threads a clever ball down the inside right for Paul Allen, who enters the area and cracks a shot towards Ogrizovic at the near post. It’s an easy one for the keeper.\n\n\n\n25 Apr 2020 16.23 BST 68 min: Spurs launch a rare attack. Ardiles and Thomas combine well down the inside-left channel to win a corner, but once again Hoddle’s delivery isn’t up to his usual standard. Spurs try to go again, but Waddle yanks a dismal shot miles wide right from distance.\n\n\n\n25 Apr 2020 16.22 BST 67 min: Wembley is lost in music, caught in a trap. What an atmosphere! Both sets of fans giving it plenty. And suddenly Houchen is through on goal! Out of nothing! Hoddle was dozing in the midfield, allowing McGrath to extend a leg from behind and flick a pass down the right channel. Houchen should probably shoot upon stepping inside the box, but he wants to get closer and is well marshalled by Thomas, who gains ground, sticks to his side, and forces him to drift right. What he eventually delivers is neither a shot nor a cross, the ball dropping softly into Clemence’s grateful arms.\n\n\n\n25 Apr 2020 16.21 BST 66 min: Waddle drifts in from the right and curls a cross towards Thomas, bombing in from the other flank. Bennett, creator turned destroyer, flicks a header away from danger, out for a corner that leads to nowt.\n\n\n\n25 Apr 2020 16.20 BST 65 min: Houchen was a Scunthorpe United player last season. According to Motty on the BBC, this time last year he was watching the final in a local working men’s club. And now, thanks to his work of art, the Coventry tails are up. Regis and Kilcline rise to compete for a deep right-wing cross, confusing each other and sending the ball harmlessly out of play for a goal kick. Spurs need to gather themselves and quickly.\n\n\n\n25 Apr 2020 16.19 BST 64 min: Houchen flew through the air like a comic-book hero to meet that! I wonder if Clive Allen’s antics sparked something in his subconscious?! What acrobatics! And it was aesthetic perfection, the whole move a masterclass of timing. Houchen leaps over the hoardings, uncatchable, capering around with the giddy abandon of someone who knows something special has just happened, but he’s not quite able to process or contextualise it yet. He’ll have plenty of time to do so later, because he’s just scored a goal that will be remembered for a very long time indeed. It was such a thing of wonder, given time his name might come to define the spectacular diving header. If so, let the record state: Keith Houchen has just scored a Keith Houchen.\n\n\n\n25 Apr 2020 16.18 BST WHAT A GOAL! Coventry City 2-2 Tottenham Hotspur (Houchen 63) Ogrizovic sends a drop kick long. Regis rises above Mabbutt and flicks it on for Houchen, who spreads the ball right for Bennett. Houchen spins and makes a run into the box. Meanwhile Bennett takes three delicate touches to make just enough room to whip the ball past Thomas. His cross, bent with geometric grace around the full back, drops perfectly for Houchen, who meets it six yards out with a stunning diving header, planting the ball into the bottom-left corner at maximum velocity! What a bullet header! Colour this hyperbole, but that might well be the best goal ever scored in an FA Cup final! Coventry striker Keith Houchen dives to head the second goal past Spurs goalkeeper Ray Clemence as defender Chris Houghton reacts. Photograph: David Cannon/Allsport/Getty Images Houchen (right) and teammates celebrate his wonder goal. Photograph: David Cannon/Allsport/Getty Images\n\nUpdated at 16.29 BST\n\n25 Apr 2020 16.17 BST 62 min: The cameos just keep on coming. Kilcline, never the most silky of defenders, channels his inner Beckenbauer. Just outside his own area, he’s faced with Clive Allen and Hoddle, right up in his grille. There looks to be no way out, but he shovels a dainty flick over the pair, the ball dropping at the feet of McGrath, in space upfield. That’s a delicious touch of delicate skill from the big man. Hoddle will have enjoyed watching that. He’d have been proud of the pass himself.\n\n\n\n25 Apr 2020 16.16 BST 61 min: It’s been a friendly affair - no need yet for the referee to wag a finger, less so brandish a card. That’s amply illustrated here, as Clive Allen tries to beat Peake with another dragback and spin, but this time Peake refuses to give ground. The tussle ends with Allen clambering all over Peake’s back, ending up horizontal in mid-air, posing in the Superman position as his opponent keeps hold of him with a smile. They spin round so everyone can get the joke before Peake plops him softly back down to earth. A couple of friendly pats are exchanged, and we’re on our way again. That’s a genuinely amusing, warm and sportsmanlike moment, in the middle of a very tense cup final. The crowd respond accordingly, breaking into a loud round of applause in celebration of some fine slapstick, a bravura comedic performance. Coventry’s Trevor Peake using an unorthodox manner to deal with Spurs’ Clive Allen. Photograph: Frank Baron/The Guardian\n\nUpdated at 16.18 BST\n\n25 Apr 2020 16.15 BST 60 min: On the hour, and for the first time today, the match descends into a lull as the pace drops. Nobody will complain: it’s sunny, the big Wembley pitch is notoriously hard to cover for 90 minutes, and it’s not as though we haven’t had plenty of bang for our buck so far.\n\n\n\n25 Apr 2020 16.13 BST 58 min: Downs sends a long free kick into the Spurs box. Houchen wins the first header, Kilcline the second. Clemence claims, but Coventry have been the bosses of Spurs in the air all afternoon and Spurs really need to get a handle on this.\n\nUpdated at 16.17 BST\n\n25 Apr 2020 16.12 BST 57 min: A corner on the right leads to a corner on the left. Hoddle takes the latter. It’s way too deep, and easily headed clear by Kilcline. And suddenly Coventry are on the counter, first through Houchen, then with Gynn on the left. He’s got three team-mates in acres to his right, but doesn’t see them and eventually runs into Mabbutt. The match has now settled back into its wildly entertaining first-half pattern, a box-to-box hoot for the ages. Marvellous. Thank you one and all.\n\n\n\n25 Apr 2020 16.11 BST 56 min: Such a lovely move by Spurs! Waddle feeds Hughton down the right. Hughton pulls a low cross back for Clive Allen, who spins, drags back and pirouettes down the channel away from Peake, sliding off to Billy Wright’s wrong fire. For a nanosecond, he’s one on one with Ogrizovic, on the right-hand corner of the six-yard box. But Downs nips in from behind to take the ball off his toe and send it out of play. Marvellous last-ditch defending. That would have been one of the great FA Cup final goals, and some way to bring up his personal half century. As it is, it’s just a corner.\n\n\n\n25 Apr 2020 16.10 BST 55 min: Kilcline creams a simple long pass down the right and Gynn nearly zips free. As he enters the box, Gough slides in to limit the damage to a corner, from which Phillips lands a shot on Wembley’s rickety roof. That rush of blood to the head must have felt real good at the time.\n\n\n\n25 Apr 2020 16.09 BST 54 min: Waddle sashays past Peake with great ease down the right. He’s so good to watch, despite that lumbering gait. Actually, it’s because of that lumbering gait. How can something so ostensibly ungainly be so beautiful? A conundrum for the ages. His cross isn’t all that, mind, easy meat for Ogrizovic with Clive Allen lurking.\n\n\n\n25 Apr 2020 16.08 BST 53 min: ... and as a result their fans are in the middle of a rousing chorus of Jimmy Hill’s bespoke tinkering of the Eton Boating Song. Wembley has been a cauldron on a rolling boil all day.\n\n"}, {"url": "https://www.theguardian.com/sport/live/2020/apr/25/coventry-city-v-tottenham-hotspur-1987-fa-cup-final-live?page=with:block-5ea066848f0898fe360d6234", "page_content": "25 Apr 2020 15.20 BST 20 min: Downs hassles Paul Allen out on the left wing, near the corner flag, and strips him of possession. He hooks into the box. Ardiles heads clear. Pickering lobs it back in. Mabbutt heads out powerfully, Hodge helping it away. But then Allen again comes off second best in a tussle with Downs, conceding a free kick out on the left with a clumsy aerial challenge.\n\n\n\n25 Apr 2020 15.19 BST 19 min: Ardiles dummies to allow Waddle to blooter the free kick goalwards. It clears the wall but also the crossbar. Not a million miles away, but always clearly too high and an easy call for Ogrizovic.\n\n\n\n25 Apr 2020 15.18 BST 18 min: Hoddle and Hodge combine down the left to win a corner. Hoddle takes it himself, but it’s a bit of a non-event. Coventry half clear, and Spurs come again, Hoddle and Ardiles probing down the left, Waddle crossing far too deep. But now it’s Coventry who can’t get out of their final third, and Pickering comes clattering into Hoddle in the ungainly fashion. This’ll be a free kick, 30 yards out, in a central position.\n\n\n\n25 Apr 2020 15.16 BST 16 min: Downs clips Waddle out on the right. Waddle takes the free kick and finds Hoddle, with his back to goal, just to the right of the D. He juggles the ball cleverly with his chest, before spinning like a ballerina and stroking a chip down the channel. But there’s nobody there. Shame, because if he’d have set Ardiles free, as was his intent, that could have been an assist for the ages.\n\n\n\n25 Apr 2020 15.15 BST 15 min: Regis goes barrelling down the right, free in acres, but he’s adjudged to have unfairly bowled Mabbutt to the ground. Mabbutt gets up looking a little rattled. Spurs have been second best for most of the game so far.\n\n\n\n25 Apr 2020 15.14 BST 14 min: This is a bit better from Spurs, and again the attack is instigated by Waddle, who wanders down the right before firing a low pass inside for Hoddle. He lays off for Paul Allen. There’s a little space down the channel, but Allen can’t find Hodge with his first-time pass. A neat sequence, though, Tottenham’s first promising move since the opening goal.\n\n\n\n25 Apr 2020 15.13 BST 13 min: Another Coventry free kick. Spurs can’t get out of their own half. Downs’ delivery isn’t so hot this time. From a central position he launches long for Regis, just inside the box on the left. Regis does well simply to get his eyebrows on it. Goal kick. Spurs go long themselves, Waddle spraying a lovely diagonal ball from the right, nearly springing Hodge clear down the middle. Pickering does well to stand firm and guide the ball back to Ogrizovic.\n\n\n\n25 Apr 2020 15.12 BST 12 min: The Coventry fans are going large. “We’re gonna win the cup!” At the moment, their team looks equally full of belief. Waddle concedes a free kick out on the Coventry left with a high foot. No malice. Downs takes, and sends another fine ball in from deep. Houchen rises highest in a packed box, and flashes a header wide right. Clemence might have had some work to do had that been on target. Houchen will mark that down as a missed opportunity.\n\n\n\n25 Apr 2020 15.11 BST 11 min: Coventry are high on life at the minute. Phillips rakes one down the right. For a second, Houchen and Pickering are two-on-one with Thomas. If Houchen plays the correct flick inside, Pickering will be clear in the box. Instead he takes a touch down the flank before looping in a cross that Clemence nearly fumbles over his head and into the top left! Fortunately Hughton is on point to hack clear, with McGrath lurking. This is such good fun ... although I’m not 100 percent sure Clemence is on board with the entertainment that’s being laid on.\n\n\n\n25 Apr 2020 15.10 BST 10 min: Really, that is no more than Coventry deserve for their response to going behind so early in the biggest match in their history. That was such a composed finish. And what pressure Coventry put Spurs under! It’s been quite the final already, with two goals and two tales of redemption - Allen’s 1982 nightmare and now Bennett’s 1981 misery - ticked off in the first nine minutes! Wembley is banging.\n\n\n\n25 Apr 2020 15.09 BST GOAL!!! Coventry City 1-1 Tottenham Hotspur (Bennett 9) Pickering whips the free kick into the mixer. There’s some head tennis. Gough hacks clear, but poorly, only finding Gynn 30 yards out. Gynn slips the ball wide left for Regis who centres for Houchen. Gough manages to only half-clear again. The ball drops to Phillips, who has a dig. That’s blocked, but Coventry come back again. Spurs can’t get out! Kilcline rolls a pass to Downs on the left touchline. Downs one-twos with Regis, then sends a cross in from a deep position. Houchen rises above Ardiles - hardly a fair fight - to flick on. The ball falls perfectly to the feet of Bennett, eight yards out. He nips ahead of a dozing Hodge and rounds the out-rushing Clemence on the left, before flicking the ball into the empty net while falling over backwards. All in one sweet, balletic move. What grace! What a game we have here! Coventry City’s Dave Bennett (centre) is congratulated by teammates Keith Houchen (left) and Nick Pickering after heading in their equaliser. Photograph: PA Images\n\nUpdated at 15.37 BST\n\n25 Apr 2020 15.08 BST 8 min: Gynn charges down Ardiles, then races after the loose ball. He zips along the right touchline and looks to have the better of Thomas, but just as he prepares to scoot past, he’s upended. Free kick. From which ...\n\n\n\n25 Apr 2020 15.07 BST 7 min: McGrath strides down the middle before drifting right, nearly completing a cute one-two with Bennett, only for Mabbutt to break it up with a well-timed tackle. This match is being played at 100 miles per hour, and it’s extremely open to boot.\n\n\n\n25 Apr 2020 15.06 BST 6 min: Gynn takes. It’s not much cop, too deep and wide, and it’s an easy clearance for Gough. Downs tries to rescue the attack by hooking down the left, but Regis, in plenty of space, can’t get the fiercely-hit pass under control. Goal kick.\n\n\n\n25 Apr 2020 15.05 BST 5 min: “It’s a goal against Coventry,” says former Sky Blue manager, chief executive and chairman Jimmy Hill on BBC Television, “but it might make it a great final, because the other team have to come back. Coventry have to attack now, and so it’s opened it up right at the start, which is probably the best thing that could ever happen in a game at Wembley.” He’s easy to mock, Jimmy Hill, but the man knows a thing or two. And you can hear the excitement dripping from every word, even if his old club haven’t exactly had the perfect start. Good old Jim. Coventry prove him right almost immediately, Bennett and Regis taking turns to dribble down the middle, then laying off to Downs on the left. Downs crosses deep, forcing a slightly out-of-position Clemence into tipping out for a corner on the right.\n\n\n\n25 Apr 2020 15.04 BST 4 min: Wembley is bouncing! The Spurs fans are doing most of the singing right now, naturally. But the Coventry support will be enthused by their team’s reaction to that early stunner. Pickering makes good down the left and crosses long. For a second it looks like Houchen’s chest down might break to Bennett and send him free into the box down the inside-right channel, but Bennett can’t sort his feet out in time and Spurs swarm.\n\n\n\n25 Apr 2020 15.03 BST 3 min: That was a fine goal. Wonderful old-fashioned wingplay by Waddle, and a superb diving header by 1987’s poacher supreme. That’s Allen’s 49th strike of the season, and who’d bet against the Footballer of the Year making the half-century now? He’s got plenty of time left to get it, having scored that one after a mere one minute and 49 seconds. Still not a patch on Newcastle United’s Jackie Milburn, who notched after 45 seconds against Manchester City in 1955. A nightmare start for the underdogs, who get the game going again on the front foot, Phillips launching long down the right, Gynn clattering into Clemence who had come out quickly to claim.\n\n\n\n25 Apr 2020 15.02 BST GOAL!!! Coventry City 0-1 Tottenham Hotspur (C Allen 2) Hoddle swings it into the mixer, where Gough is lurking. Houchen rises above the big defender but can only head down to Clive Allen, with his back to goal on the corner of the six-yard box. Allen blocks Peake, who falls to the ground, but the referee sees nothing wrong with it. Gynn toe-pokes it away from Allen but the ball only falls to Waddle on the right. Waddle drops a shoulder, turns Downs inside out and whips a glorious medium-height cross to the near post, where Allen flashes a header into the right-hand side of the net! Ogrizovic had no chance whatsoever. What a start by the favourites! Clive Allen of Tottenham Hotspur beats Coventry’s Trevor Peake & keeoer Steve Ogrizovic to open the scoring. Photograph: Colorsport/Shutterstock Clive Allen of Tottenham Hotspur celebrates after opening the scoring. Photograph: David Cannon/Getty Images\n\nUpdated at 15.13 BST\n\n25 Apr 2020 15.01 BST 1 min 23 sec: McGrath nips away at Hoddle’s heels as Spurs probe down the right. A free kick in a dangerous position. And from it ...\n\n\n\n25 Apr 2020 15.00 BST And we’re off! Spurs get the ball rolling, and immediately Hoddle embarks on a direct dribble down the middle. This guy’s good! But he’s no Maradona, and eventually he’s stripped of possession. Houchen has a meander down the right but doesn’t really go anywhere either. Front-foot attacking intent on display from both sides already. Like it.\n\n\n\n25 Apr 2020 14.55 BST The weather today really is gorgeous. A sunshine cup-final, the perfect way to start the British summer. The players go through their pre-match routines. We’ll be off very soon!\n\n\n\n25 Apr 2020 14.50 BST The teams are out! Abide with me, fast falls the eventide. Coventry are in their blue-and-white striped shirts and dark blue shorts, sponsored by Granada Bingo. Spurs are in pristine white, sponsored by Holsten. At least some of the team are: five players have shirts with no sponsor on them at all! A lovely throwback to the days before football’s dignity took a diving header out the window, but we can’t imagine their sponsor will be raising a glass of unpleasant syrupy ale to that. Apparently a batch of the sponsored shirts were either too tight or too large. They had one job, etc. What a fiasco. Spurs will be hoping their day improves from this point onward.\n\n\n\n25 Apr 2020 14.30 BST A fantastic atmosphere already at sun-drenched Wembley, all 98,000 inside the grand old stadium giving it plenty. There are a couple of sassy placards in the Spurs end: “Chris Waddle sells more dummies than Mothercare” and “Gough puts the ‘ouch’ in Houchen”. Some big talk there. Let’s hope the lads deliver on those promises. Spurs’ Ricky Villa and Ossie Ardiles with his son take in the atmosphere ahead of the match. Photograph: Colorsport/Shutterstock\n\nUpdated at 14.47 BST\n\n25 Apr 2020 14.20 BST There’s a fair chance we could see a few goals this afternoon, if recent history is anything to go by. Let’s go back to late December, when Spurs visited Highfield Road in the First Division. Spurs boss David Pleat recalled that game earlier this week in conversation with our very own David Lacey: “At half-time we were luckily in front, courtesy of Clive Allen. After 20 minutes of the second half Coventry led 3-2, courtesy of Ray Clemence, Richard Gough and Gary Mabbutt. Coventry did not try to sit on their lead. They came at us like lunatics trying to make it 4-2. With six minutes to go, Nico Claesen pulled the score back to 3-3 and our players were convinced we could win the game because we’d had them on the rack for 15 minutes. We went at them as they had gone at us ... and then Cyrille Regis scored their winner.” Well this augurs well. More please, Coventry! More please, Spurs! Coventry City fans are chuffed to be at Wembley for their team’s first FA Cup final, whereas it is old hat for the Spurs fan on the right, it’s Tottenham’s third FA Cup final since the start of the decade. Photograph: PA Images Labour leader Neil Kinnock, sporting a Tottenham Hotspur scarf, is swamped by enthusiastic Coventry City fan. Photograph: PA Images\n\nUpdated at 15.15 BST\n\n25 Apr 2020 14.15 BST On ITV, John Helm has a word with the aforementioned unfortunate Coventry right-back Brian Borrows. An understandably downbeat interview from his hospital bed in Leamington Spa. But the poor young man rallies to finish strongly, sending the following positive vibes to his team-mates: “I’d like to wish you all the best, lads! I know you’re gonna win it!”\n\n\n\n25 Apr 2020 14.10 BST For your auricular pleasure The cup-final songs are excellent this year. Go For It City features a virtuoso whistle solo by Trevor ‘At His’ Peake ... ... while Chas, Dave and the drummer from Chas ‘n’ Dave celebrate “David Pleat and his blue-and-white army” in their usual vocally dexterous style. A deep cut for those who enjoyed Rabbit.\n\n\n\n25 Apr 2020 13.55 BST Both clubs had to make decisions at right-back. Coventry’s Brian Borrows hurt his knee against Southampton last week and as expected misses out. He’s currently in hospital, recovering from an operation. David Phillips moves back from midfield to deputise; Micky Gynn, usually a livewire sub, starts in his place. Spurs go with Chris Hughton; their first choice Gary Stevens is only fit enough to make the bench. Sky Blues winger Dave Bennett will be hoping it’s second-time lucky in the cup final, having been on the losing side with Manchester City in 1981 against today’s opponents. Tottenham artist-in-residence Glenn Hoddle, who has designs on a move to the continent, will be desperate to sign off with a flourish. Up front, Clive Allen will be hoping to add to his unreal haul of 48 goals in all competitions this season. He’s Tottenham’s most likely match-winner, and will be hoping for better luck than he had as a QPR player in 1982, when he twisted his ankle very early on and missed both second half and replay. Coventry will look to their most recognisable name, Cyrille Regis, for heroics. But it should be noted that the much less heralded Keith Houchen is their cup go-to guy this season, having scored the winner at Manchester United, two at Sheffield Wednesday, and another against Leeds in the semi.\n\n\n\n25 Apr 2020 13.45 BST The teams Coventry City: Steve Ogrizovic, David Phillips, Brian Kilcline, Trevor Peake, Greg Downs, Micky Gynn, Nick Pickering, Lloyd McGrath, Dave Bennett, Cyrille Regis, Keith Houchen.\n\nSubs: Graham Rodger, Steve Sedgley. Tottenham Hotspur: Ray Clemence, Chris Hughton, Richard Gough, Gary Mabbutt, Mitchell Thomas, Paul Allen, Steve Hodge, Ossie Ardiles, Chris Waddle, Glenn Hoddle, Clive Allen.\n\nSubs: Nico Claesen, Gary Stevens. Referee: Neil Midgley (Manchester).\n\n"}, {"url": "https://www.theguardian.com/sport/live/2020/apr/25/coventry-city-v-tottenham-hotspur-1987-fa-cup-final-live?page=with:block-5ea44b348f08fa2bdcb1b53c", "page_content": "25 Apr 2020 16.06 BST 51 min: Coventry are beginning to find their feet again. Gough and Mabbutt get in each other’s way and allow a basic pass through the middle by Downs to reach Regis, who instigates a move that ends with Bennett dinking a cross in from the right. Houchen gets a head on the ball, but can only send it high into the air with no direction, and Spurs clear. Mabbutt may or may not be on the scoresheet, but even so, it’s not been a banner day for the Tottenham centre-back pairing. They’ve looked uncomfortable from the get-go.\n\n\n\n25 Apr 2020 16.04 BST 49 min: Gynn scampers down the right in the Stanley Matthews manner. He beats Thomas and finds Houchen at the near post with his cross, but the striker can’t control, six yards out. That’s much better from Coventry ... although then, up the other end, they nearly concede a worldy, as Clive Allen cuts in from the right and aims for the top left. It’s not very far away at all, and I’m not convinced Ogrizovic was getting there had it been on target.\n\n\n\n25 Apr 2020 16.02 BST 47 min: Coventry haven’t seen much second-half ball yet. Regis and Gynn try to combine down the right, but it doesn’t quite work out, and Regis’s frown is enough to transmit his opinion of the move.\n\n\n\n25 Apr 2020 16.01 BST 46 min: Ardiles rolls a ball down the right for Hughton, who barges his way past Downs and makes for the box along the byline. He looks to have been tripped from behind by Downs, just before he enters the penalty area, but it’s no foul, and Ogrizovic claims. On second look, that was a good decision by the referee, there was little or no contact and Hughton merely tripped over his own feet. Not sure why he didn’t then have a word with Hodge, who slid in on Ogrizovic at full pace for a ball he was never going to get. Big Oggy is a placid fellow, and doesn’t make a big deal of it.\n\n\n\n25 Apr 2020 16.00 BST And we’re off again! The BBC are wavering over their award of Tottenham’s second to Mabbutt, having fallen hard for replays suggesting the ball pinged off Kilcline during the break. “I think we’ve given Gary Mabbutt that goal perhaps a little prematurely,” their commentator John Motson announces. “It would appear that it did go in off Brian Kilcline, so it may end up being credited as an own goal.” Let’s wait for the official line before worrying about that. Coventry get the ball rolling for the second half.\n\n\n\n25 Apr 2020 15.49 BST Half-time advertising break ... featuring Withnail driving a Vauxhall Astra! Making time, presumably. Turns out he didn’t need that cigar commercial after all.\n\n\n\n25 Apr 2020 15.46 BST HALF TIME: Coventry City 1-2 Tottenham Hotspur And so a wonderful half of to-and-fro attacking football comes to an end. As expected, the favourites Spurs are leading, but Coventry are giving them one hell of a game. They came from behind at half-time to beat Spurs at Highfield Road in December; can they repeat the trick on the biggest day in the club’s history? David Pleat’s fine side will be pleased enough, but they’ll know this is far from over.\n\n\n\n25 Apr 2020 15.45 BST 45 min: Kilcline launches long. Mabbutt’s clearing header is useless. Regis intercepts on the edge of the D and makes a nuisance of himself, the ball breaking to Pickering who takes a touch to the left and, falling backwards a la Bennett, goes for goal. But he can’t get enough whip on the shot, allowing Gough to make an excellent sliding block. Clemence gathers.\n\n\n\n25 Apr 2020 15.44 BST 44 min: Ardiles forces a corner off Downs. The same man swings one in from the right but it’s easily claimed by Ogrizovic.\n\n\n\n25 Apr 2020 15.43 BST 43 min: Hoddle chips down the right for Waddle, who can’t quite get the better of McGrath on the edge of the box. Then Hughton has a probe, but he’s forced to turn tail as well under pressure from Downs. Both of the Tottenham goals have originated from this flank, and yet the Coventry left-back Downs has been one of the best players on the pitch. Funny old game, as one of Tottenham’s old strikers likes to point out.\n\n\n\n25 Apr 2020 15.42 BST 42 min: Coventry kick off again, and soon lose possession. Spurs stroke it around in the continental fashion. Coventry have probably been the better side so far, yet look at the scoreline. That’s understandably taken a bit of puff out of the Sky Blue sail.\n\n\n\n25 Apr 2020 15.41 BST GOAL! Coventry City 1-2 Tottenham Hotspur (Mabbutt 41) Paul Allen scampers down the right. He’s flipped into the air by Pickering, and this is a chance for Hoddle to send a free kick into the Coventry area. He swishes an outswinger into the mixer. Ogrizovic comes to claim and gets nowhere near. Neither do Peake and McGrath, occupied by Gough. The ball drops to Kilcline and Mabbutt, both facing the empty net, eight yards out. Mabbutt sticks out a leg and diverts it home! Or did that come off the shin of Kilcline, attempting to nick it clear? Replays, shown from several angles, aren’t exactly conclusive. Let’s go with the BBC’s assessment. Mabbutt’s it is!\n\n\n\n25 Apr 2020 15.40 BST 40 min: Phillips breathes a huge sigh of relief as nothing comes of the resulting corner. But Spurs are soon roaring back at Coventry, and ...\n\n\n\n25 Apr 2020 15.39 BST 39 min: Waddle teases Pickering out on the right wing, but Pickering does just enough to stop him scampering down the touchline. Waddle opts to check back, then sprays a low diagonal pass into the area from a deep position. There are no Spurs players anywhere near the ball, but Phillips takes a heavy touch in attempting to cushion it back to Ogrizovic, and clumsily sends the ball out for a corner on the left. A groan from the Coventry faithful. That’s extremely careless.\n\n\n\n25 Apr 2020 15.38 BST 38 min: Spurs aren’t dealing with high balls very well this afternoon. Here they get themselves in another almighty pickle when Downs launches a long free kick into the box. Houchen wins the first header. Of course he does. Then Pickering, to his left, swivels, spins Hughton, and sends a bobbler into the arms of Clemence from ten yards. He should have given Clemence a real problem there. Spurs need to up their game at the back.\n\n\n\n25 Apr 2020 15.37 BST 37 min: Hodge dribbles down the left and sends a shot-cum-cross towards the top corner. Ogrizovic is forced to fingertip over the bar with great uncertainty. A look of panicked relief washes over his face. Nothing comes of the resulting corner.\n\n\n\n25 Apr 2020 15.36 BST 36 min: Waddle cuts in from the right, drops a shoulder, and sends the ball off towards Hanger Lane. “This might be a day of firsts,” suggests Simon McMahon. “We might not have the glamour of Wembley, or indeed Chas n Dave, but this week could be the greatest in the history of Dundee United. Like Coventry and the famous old trophy, we’re looking to claim our first ever Scottish Cup (currently 0-0 v St. Mirren at Hampden), and on Wednesday it’s the second leg of the UEFA Cup final v Gothenburg at Tannadice. Immortality beckons!” Good luck with that, Simon, our fingers are crossed for you.\n\n\n\n25 Apr 2020 15.35 BST 35 min: So having said that ... Waddle dribbles down the right and falls over beside the D, but he’s not getting the free kick he wanted. Clean challenges by both Peake and Pickering. Then the ball’s humped into the centre circle. Gough should deal with it, but lets Regis spin away from him far too easily. Regis eats up the turf. He’s got Bennett to his right, but opts instead to thread a delicious pass between the hastily backtracking Mabbutt and Hughton, setting Gynn free! Gynn enters the box and whistles a shot towards the bottom left. It’s a good effort, but not a great one, a little bit too close to the keeper. It allows Clemence to make a fine stop, and Mabbutt whacks clear. Coventry striker Cyrille Regis surges past Spurs players Osvaldo Ardiles (left) and Chris Hughton. Photograph: Allsport/Getty Images\n\nUpdated at 15.39 BST\n\n25 Apr 2020 15.34 BST 34 min: Waddle has another crack from distance. It’s straight at Ogrizovic. Spurs are beginning to assert themselves for the first time in this final.\n\n\n\n25 Apr 2020 15.33 BST 33 min: The carefree end-to-end nonsense continues apace. Phillips launches a long free kick into the Spurs box. Regis knocks down towards Bennett, in a perfect position to replicate his goal, but Hodge is alive this time and heads away acrobatically. Hoddle sets Spurs off on the counter. Waddle drops a shoulder out on the right and rasps a rising shot towards the near post from a tight angle. Ogrizovic refuses to be beaten like that, though he makes a meal of parrying and gathering, and nearly spills the ball out for a corner. Soon enough, Spurs are coming at Coventry again, Mabbutt channelling his inner Beckenbauer with a glorious run down the middle. He attempts a full-tilt one-two with Ardiles, but for once the Argentinian maestro’s radar is a little wonky, and a heavy return pass sails straight through to the keeper. Shame for Spurs: a huge gap at the heart of the Coventry defence there.\n\n\n\n25 Apr 2020 15.32 BST 32 min: Waddle opens his legs and grooves down the middle of the park, before whipping a low and fierce shot straight at Ogrizovic. Fortunately for Coventry, the keeper has managed to screw his previously loose head back on tight, and this time deals with the situation without unnecessary drama or emotional tumult.\n\n\n\n25 Apr 2020 15.30 BST 30 min: Gynn dribbles down the middle of the park, but not for the first time this afternoon, Ardiles assumes control with candy-divestment ease. Such a well-timed challenge. He rolls a pass up the centre for Hoddle, who spins and draws his man, before flicking the ball past him for Ardiles, who has kept running and is now in a lot of space. He’s got Paul Allen to his right, and a flick inside will send the midfielder clear on goal. Peake sticks out a boot, it’s all he can do. And he manages to deflect the ball away from Allen and back to Ogrizovic. What an interception! And that should be the end of that, but Coventry, attempting to play out from the back in the continental style, nearly concede in farcical circumstances! Ogrizovic, taking reception of a backpass, decides to go on a C64 International Soccer style dribble upfield! He eventually clanks a dreadful pass straight to Hoddle, who attempts to dispatch it into the unguarded net from 40 yards. Fortunately for the keeper, Peake has read the danger and is back covering. He blocks and taps the ball to the right, assuming his keeper will flop on it when he gets back to his box. But Ogrizovic somehow overruns it, and Peake’s lay off isn’t perfect either, and Clive Allen scampers away with the ball! The net’s still unguarded, but Allen is forced wide by Peake and lashes the ball into the side netting. Coventry dodged a bullet there. Had that resulted in a goal, it would without question be the stupidest ever conceded in an FA Cup final.\n\n\n\n25 Apr 2020 15.29 BST 29 min: Spurs go straight back up the other end, Hodge skedaddling down the left and winning a corner. Hoddle wands it in, but Ogrizovic races off his line and claims with great certainty.\n\n\n\n25 Apr 2020 15.28 BST 28 min: Gynn’s corner is headed behind by Gough. Pickering to take this next one from the left. He sends it in deep. Houchen wins a header at the far post, but can’t get any direction or power on it.\n\n\n\n25 Apr 2020 15.27 BST 27 min: ... Hoddle finds Gough, ten yards out. The defender powers a header goalwards, but it’s deflected into the sky by pop-single flautist Peake, and Ogrizovic plucks from the middle of a melee, under severe pressure from both Clive Allen and Hodge. Then the keeper sends Bennett gliding down the right with a quicksilver throw. Spurs are light at the back, and thankful that Thomas puts in a fine tackle to block Bennett, just as the winger dropped a shoulder with a view to scooting past and romping clear. Gynn picks up the loose ball and continues down the right himself, winning a corner for the Sky Blues. This is end-to-end football at its finest! Gary Mabbutt (right) of Tottenham Hotspur tackles Dave Bennett of Coventry. Photograph: Allsport/Getty Images\n\nUpdated at 15.58 BST\n\n25 Apr 2020 15.26 BST 26 min: This is much better from Tottenham, who are beginning to regroup. Regis, at full pelt down the inside left, is stopped unceremoniously by a fine Ardiles tackle. Ardiles strides upfield and fizzes a pass down the right for Waddle, and suddenly Coventry are on the back foot. Waddle, Hoddle and Paul Allen combine to win a corner. From which ...\n\n\n\n25 Apr 2020 15.24 BST 24 min: Nothing much is coming off for Spurs up front. Waddle sends Hodge scampering down the left, but there’s only Clive Allen in the middle and Hodge is unable to find him with a speculative cross. Coventry will be much the happier team right now.\n\n\n\n25 Apr 2020 15.22 BST 22 min: Ardiles takes a quick free kick in midfield and sends Waddle off on the right. Waddle shuttles the ball inside for Hodge, who looks for Clive Allen in the middle, but the flag goes up for offside. This is breathless. Both teams are piling forward, with little thought to hang about in midfield. And what’s this? Coventry have the ball in the net! Philips sends a long throw into the Spurs box from the right. Houchen flicks on, then with a deft brush of the eyebrow, Regis steers a gentle header towards the bottom left, past Clemence and in. That’s such a tidy finish! But the flag goes up, because Houchen had shoved Thomas in the back to win the first header. Nobody bothers complaining too much, but you’ve seen teams get away with those. It was a sly little shove, and far from obvious.\n\n"}]}