{"Gordon David Strachan was appointed manager of the Scotland national team.": [{"url": "https://www.bbc.com/sport/football/41598733", "page_content": "Gordon Strachan was appointed Scotland manager in January 2013\n\nGordon Strachan has left his position as Scotland manager by \"mutual consent\", four days after the team failed to qualify for the World Cup.\n\nThe decision, taken in conjunction with the board of the Scottish Football Association, means 60-year-old Strachan leaves a job he took in January 2013.\n\nAssistant Mark McGhee also departs.\n\n\"On behalf of the board I would like to thank Gordon for his excellent service to the national team,\" said Scottish FA chief executive Stewart Regan.\n\nStrachan succeeded Craig Levein in the role, initially to oversee the end of the 2014 World Cup qualifying campaign.\n\nScotland's attempt to qualify for Euro 2016 began brightly but they ultimately fell short of reaching the finals in France.\n\nStrachan and the SFA board agreed he would stay on to lead Scotland in the 2018 World Cup qualifiers, but a 2-2 draw in Slovenia on Sunday ended their hopes of finishing second in Group F and reaching the play-offs.\n\n\"I said on my first day as Scotland manager that it was the proudest moment of my career and that I wanted to put a smile back on the nation's face again,\" Strachan said.\n\n\"I share the profound disappointment at missing out on the play-offs, especially having worked so hard to fight our way back into contention.\n\n\"The players should receive immense credit for that resilience in coming back from a difficult start and I would like to thank each and every player who has come in to represent their country.\"\n\nScotland: I'm very surprised Strachan has decided to leave - Gordon Smith\n\nStrachan said he and the players had shared \"some magical moments\" and the memories \"will live with me for ever\".\n\nHe added: \"Of course, what made those moments special was the unwavering support of our fans.\n\n\"Through highs and lows you have stayed with the team and my biggest regret is not being able to provide the finals tournament you deserve.\n\n\"I would like to thank the board, the backroom staff and everyone at the Scottish FA for the help and support they have given me as national coach. It has been a real privilege.\"\n\nThe SFA board met at Hampden on Thursday to discuss the position of Strachan, whose contract was due to end next month. They will now begin the search for a successor.\n\n\"I know how disappointed he was that we couldn't secure a play-off place but to come so close was a tribute to the belief he instilled in his squad,\" Regan said.\n\n\"After almost five years the board felt it was time for a new direction to prepare for the Uefa Euro 2020 qualifying campaign and also the forthcoming Uefa Nations League.\n\n\"We are grateful to both Gordon and Mark for their efforts and wish them the best of luck in the future.\"\n\nScottish FA chief executive Stewart Regan, left, and president Alan McRae, right, were part of the board that discussed Gordon Strachan's future\n\nAnalysis - 'There was only ever going to be one outcome'\n\nBBC Scotland senior football reporter Chris McLaughlin\n\nThere will be disagreements about the decision but few would argue that the news came as much of a shock. The SFA could not be seen to be rewarding failure and as the players trudged off the pitch in Ljubljana. It felt like the end, not only for their world cup chances, but for the manager.\n\nHe had come close to walking away in the past and the speed of today's decision was most likely aided by a reluctance from the man himself to carry on. The players loved him, the media tolerated him and the fans were split down the middle but ultimately the results dictated he couldn't carry on.\n\nYes, performances improved but ultimately it was two campaigns and two failures. There was only ever going to be one outcome."}, {"url": "https://www.theguardian.com/football/2013/jan/14/gordon-strachan-scotland-manager", "page_content": "The Scottish Football Association has called a news conference for midday on Tuesday, when Gordon Strachan is expected to be named the new manager of the national team.\n\nThe 55-year-old, who has been out of work since leaving Middlesbrough in October 2010, has been in negotiation with the SFA with regards to his salary and contract length since the turn of the year. Although those conditions remain unclear, Strachan will be handed at least the remainder of Scotland's failed 2014 World Cup qualification campaign plus the country's attempt to make it to the 2016 European Championship.\n\nScotland have not appeared at a major finals since 1998, a matter which has had a negative impact on public confidence towards the SFA and the governing body's financial position. The SFA has also been heavily criticised for its role in the deeply unpopular reforms of Scotland's domestic set-up.\n\nStrachan was immediately the favoured choice of senior figures within the SFA and among the country's international football support after the inevitable sacking of Craig Levein. Under Levein, Scotland failed to qualify for last summer's European Championship and made an abysmal start to the 2014 campaign; they lie bottom of Group A with two points from four matches.\n\nStrachan was the country's outstanding candidate, with Joe Jordan, who has joined Harry Redknapp at Queens Park Rangers, and Owen Coyle only tentatively mentioned as alternatives. Alex McLeish was briefly quoted, but distanced himself from a return to the Scotland role and has been appointed as the manager of Nottingham Forest.\n\nStrachan, when asked directly about the Scotland job, which will be his first in international management, said in November: \"It's quite simple really – it would be an honour to be asked to be the manager of your own national side; it's terrific.\"\n\nLevein remains in a legal dispute with the SFA in relation to the remainder of his contract. The association has been seeking to retain Levein on its payroll but the 48-year-old wants the balance of his contract paid up.\n\nStrachan has been employed as a pundit by ITV since leaving Middlesbrough. His 12-month spell in the north-east was less than distinguished, with Boro 20th in the Championship when he left, their lowest position for two decades. Of 46 games in charge after he succeeded Gareth Southgate, Strachan won only 13 and, according to the chairman, Steve Gibson, was so chastened by the experience he refused any compensation, despite having two and a half years left on his contract.\n\nBefore that, Strachan managed Coventry City, Southampton and Celtic. He was relegated with Coventry but bounced back with Southampton, whom he took to the 2003 FA Cup final where they lost 1–0 to Arsenal.\n\nStrachan took a 16-month break after resigning from Southampton in 2004 before becoming manager of Celtic, where he won three successive league titles before resigning in May 2009 after failing to win a fourth title."}, {"url": "https://www.independent.co.uk/sport/football/international/gordon-strachan-factfile-8452390.html", "page_content": "Sign up to Miguel Delaney’s Reading the Game newsletter sent straight to your inbox for free Sign up to Miguel’s Delaney’s free weekly newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nFootball email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nGordon Strachan was today appointed as manager of the Scotland national side. Here, we take a closer look at the former Manchester United midfielder...\n\n1957: Born February 9, Edinburgh.\n\n1974: Signs for Dundee. Plays 60 league matches, scoring 13 goals.\n\n1977: Joins Aberdeen for £50,000. Plays 187 matches, scoring 55 times.\n\n1980: Wins Scottish league championship medal and first of 50 Scotland caps against Northern Ireland. Named Scottish Footballer of the Year.\n\n1982: Collects Scottish Cup winners' medal.\n\n1983: Achieves second Scottish Cup success, followed by European Cup Winners' Cup medal.\n\n1984: Wins Scottish league and cup double. Manchester United sign him for £500,000 in August. Stays at Old Trafford for five years, playing 160 league matches and scoring 33 goals.\n\n1985: Only trophy success with United, taking FA Cup.\n\n1989: Joins Second Division Leeds in March for £300,000.\n\n1990: Captains club to Second Division title.\n\n1991: Named Football Writers' Association Player of the Year.\n\n1992: Leads Howard Wilkinson's side to a first league championship in 18 years. Wins final international cap against Finland.\n\n1993: Awarded OBE.\n\n1994: Plays last match for Leeds, a 2-0 home defeat to Liverpool on December 31.\n\n1995: Announces his retirement from Premier League football in January, but continues to play regularly for Leeds' reserve team. Two months later joins Ron Atkinson at Coventry as assistant.\n\n1996: Takes over as Coventry manager as Atkinson stepped down.\n\n1997: Coventry survive relegation on the final day of the Premier League season with victory at Tottenham.\n\n2001: May - Coventry lose at Aston Villa and relinquish their Premier League status after 34 consecutive years in the top flight.\n\nSeptember 8 - City lose 1-0 at home to Grimsby, sparking chants of \"Strachan out\". A handful of fans have to be restrained by police as they attempt to confront the manager.\n\nSeptember 10 - Strachan leaves Coventry by mutual consent.\n\nOctober 22 - Appointed Southampton boss.\n\n2003: May 17 - Southampton lose 1-0 to Arsenal in the FA Cup final but qualify for Europe for the first time in 19 years.\n\nOctober 15 - A 1-0 defeat in Romania against Steaua Bucharest, following a 1-1 home draw, sees Saints crash out of Europe at the first hurdle.\n\n2004: January 9 - Confirms he will not to extend his contract with Southampton beyond the end of the season for personal reasons.\n\nFebruary 13 - Steps down as Southampton manager.\n\nSeptember 9 - Rules himself out of contention to manage Scotland.\n\nDecember 19 - Turns down the opportunity to become boss of Portsmouth.\n\n2005: May 25 - Named Celtic manager on a 12-month rolling contract.\n\nJuly 27 - Celtic thumped 5-0 by Artmedia Bratislava in Strachan's first match in charge to crash out of the Champions League at the qualifying stage.\n\nDecember 15: Signs Roy Keane after release by Manchester United.\n\n2006: March 19 - Lifts first trophy as Celtic manager with victory over Dunfermline in the Scottish League Cup final.\n\nApril 5 - Celtic clinch Scottish Premier League title with victory over Hearts.\n\nNovember 11 - Leads Celtic into Champions League knockout stages for the first time after 1-0 victory over Manchester United.\n\n2007: March 7 - Celtic knocked out of the Champions League at the last-16 stage by AC Milan.\n\nApril 22 - Celtic clinch SPL title with a 2-1 win at Kilmarnock. Strachan is named Manager of the Year.\n\nMay 2 - Named Manager of the Year by the Scottish Football Writers' Association.\n\nMay 26 - Celtic win Scottish Cup, beating Dunfermline 1-0.\n\nOctober 3 - Celtic snatch a last-gasp 2-1 win over European champions AC Milan at Parkhead.\n\nNovember 28 - Celtic reach knockout stage of Champions League despite losing final group game in Milan.\n\n2008: February 20 - Celtic go out of Champions League to Barcelona.\n\nMay 22 - Strachan becomes only the third Celtic manager to win a hat-trick of Scottish championships.\n\nNovember 25 - Celtic suffer shock 2-1 defeat at Aalborg to crash out of the Champions League and Europe altogether.\n\nDecember 13 - Strachan has dressing-room bust-up with midfielder Aiden McGeady after 1-1 SPL draw with Hearts. McGeady is fined two weeks' wages and suspended for two matches.\n\n2009: March 7 - Celtic suffer surprise 1-0 Scottish Cup quarter-final defeat at St Mirren.\n\nMarch 15 - Celtic beat Rangers 2-0 at Hampden in the first Old Firm cup final for six years to lift the Scottish League Cup.\n\nMay 3 - Strachan named SPFA Manager of the Year.\n\nMay 24 - Celtic are held 0-0 by Hearts as Rangers win the SPL title by four points on the final day of the season. Celtic had been eight points clear earlier in the year. He resigned a day later.\n\nOctober 26 - Signed a four-year deal to manage Middlesbrough.\n\n2010: October 18 - Voluntarily tears up his contract and resigns after a run of poor form.\n\n2013: January 15 - Appointed manager of the Scotland national team."}, {"url": "https://www.bbc.co.uk/sport/football/21023913", "page_content": "Last updated on .From the section Football\n\nGordon Strachan has been confirmed as the new manager of Scotland.\n\nThe former Celtic and Middlesbrough boss replaces Craig Levein, who was sacked in November.\n\nStrachan has signed a contract that will cover the remainder of the current World Cup qualifying campaign and the Euro 2016 qualifiers.\n\n\"I'm very proud but also my family are proud. The time is right for me to be able to take a job like this,\" he said after his appointment was announced.\n\nMedia conference: Gordon Strachan unveiled as Scotland manager\n\n\"There'll be rough times but I hope there'll be good times too.\n\n\"Every club you go to there's always challenges but this is the first time the challenge is on behalf of a nation.\n\n\"If you can be successful you can make a nation happy and make a nation proud and that is the priority for me to be able to do that with help from other people.\n\n\"I have the experience, I like working with people, I like dealing with people and I like trying to make people better.\"\n\nThe 55-year-old has been out of management since leaving Boro in October 2010.\n\nCapped 50 times, Strachan featured in Scotland's 1982 and 1986 World Cup finals campaigns.\n\nAfter playing spells at Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, the winger moved into management with the Sky Blues in November 1996.\n\nGordon Strachan Began playing career at Dundee before joining Aberdeen in 1977\n\nWon two Premier Division titles, three Scottish Cups, European Cup Winners' Cup and European Super Cup with the Dons\n\nJoined Manchester United in 1984, winning FA Cup the following year\n\nEnjoyed six-year spell at Leeds, contributing to promotion and top flight title victory\n\nEnded playing career at Coventry and moved into management with same club, having almost five years in the job\n\nReached FA Cup final during three years as Southampton boss\n\nWon three SPL titles and made two Champions League last 16 appearances as Celtic manager after joining in 2005\n\nSpent year in charge of Middlesbrough\n\nAfter keeping Coventry in the Premier League for several seasons, they suffered relegation at the end of season 2000-01 and Strachan departed a few games into the following season.\n\nHe returned to the dugout when Southampton brought him in to replace Stuart Gray and the appointment helped Saints stave off relegation before they reached the FA Cup final in 2003.\n\nBut Strachan left the club the following year and took a break from football.\n\nHis move to Celtic in June 2005 followed Martin O'Neill's decision to leave Glasgow.\n\nStrachan recovered from a 5-0 Champions League qualifying defeat by Artmedia Bratislava in his opening match - a tie that finished 5-4 on aggregate - to win the Scottish Premier League title three years in succession.\n\nHe also led the side to two appearances in the last 16 of the Champions League, the club having never reached the knock-out stages prior to Strachan's arrival.\n\nHowever, Rangers won the SPL in 2009 and Strachan left Glasgow shortly after.\n\nA year in charge of Boro followed but, after missing out on promotion in 2010, a poor start to the season led to Strachan leaving the club by mutual consent.\n\nLevein's three-year spell in charge of Scotland came to an end after a poor start to the 2014 World Cup qualifying campaign.\n\nMedia conference - Stewart Regan\n\nHaving missed out on qualification to Euro 2012, the Scots began their pursuit of a place in next year's finals in Brazil with successive home draws against Serbia and Macedonia.\n\nScotland then lost from a winning position in Wales before defeat in Belgium consigned Levein's side to the bottom of their group.\n\nAfter Levein was sacked, Scotland Under-21 coach Billy Stark was placed in caretaker charge of the senior team for the friendly win in Luxembourg.\n\nStrachan's first match in charge will be the February friendly against Estonia at Pittodrie Stadium, the venue where he enjoyed success as an Aberdeen player.\n\n\"I really want the squad and the staff to give something back to the country and the fans who support us because the fans are probably more famous than the squad now,\" Strachan added.\n\n\"So what we want to try and do is to give back something and make them turn up for a major finals competition.\n\n\"If we work together as a group and a set of fans I know for a fact we'll be successful.\n\n\"What I know is that these guys, for all they might get criticised, are the best at what they do.\n\n\"They play for Scotland and we have to find a system that suits these players to win games of football.\""}, {"url": "https://www.thefamouspeople.com/profiles/gordon-david-strachan-1535.php", "page_content": "Before he professionally started playing football, he was offered a contract by Eddie Turnbull to play for a club, but his father opposed the decision by stating that the club did not cover sufficient expenses.\n\nGeorge David Strachan was born to Jim and Catherine in Muirhouse, Edinburgh. He started playing for Dundee at the age of 14. The following year, he lost vision in his right eye when a pen in his pocket accidentally poked his eye during a football match on the school playground.\n\nRecommended Lists:\n\nCareer\n\nAt the age of 18, he outplayed Alan Ball in a friendly match with Arsenal. His outstanding performance won him the seat of a regular player for the 1975-1976 season, which also happened to be the inaugural season for the Scottish Premier Division.\n\nHe became the team captain for the 1976-1977 First Division campaign, but he lost his position soon, after a drinking incident with Jimmy Johnstone.\n\nHe quit Dundee and signed a contract with Aberdeen in 1977. Poor form and injuries crippled the 1977-78 season for him. However, he was selected for the 1979 League Cup where the team recorded two wins at the Celtic Park. His brilliant performance on the field earned him the SFWA Footballer of the Year.\n\nIn 1980, he was awarded his first cap in the British Home Championship, against Northern Island. Two years later, he was instrumental in getting his home team to qualify for the FIFA World Cup in 1982.\n\nThe 1982-1983 seasons were the most successful runs for the club and he made his mark by striking four goals in a 5-1 victory with Dundee in the League Cup. His team then went on to win the European Cup Winners’ Cup. They also defeated Hamburg in the 1983 European Super Cup Final.\n\nIn the 1984-1985 season, he took four goals in a total of seven games and even though he did not participate in the 1985 FA Cup Final at Wembley, the team went on to win the opening ten league games in the 1985-1986 season.\n\nAfter accepting a contract by Ron Atkinson, he led the Leeds United Club to the Second Division title in the 1989-1990 season. They finished fourth overall, but managed to secure a place in the semi-finals of the League Cup.\n\nHe signed a two-year contract with Leeds and captained them to record a victory in the league title of 1991-1992. However, due to poor health and back problems, he started missing a number of games and thus, became unable to build on the success of Leeds Untied.\n\nOn April 10, 1993, despite his downfalls and tough seasons, he scored a hat-trick against the Blackburn Rovers and then moved to Coventry City to serve as an assistant to the manager, Ron Atkinson.\n\nContinue Reading Below\n\nHe coached the team and trained them and also appeared in the seasons 1994-1995 and 1995-1996. The club struggled at the start of the 1996-1997 season, which resulted in Atkinson being asked to step down from the managerial position.\n\nAfter Strachan was appointed as manager, he helped his team reach the quarter-finals of the FA Cup in 1997-1998.\n\nIn 2001, he was appointed as the manager of Premier League Southampton, succeeding Stuart Gray. Under his leadership, the Southampton team earned their place for the UEFA Cup.\n\nAfter a brief hiatus, he returned to manage the team, Celtic, on June 1, 2005. Although he had a very shaky start as a manager, the team eventually began to do well under his management and started winning tournaments.\n\nOn October 26, 2009, he was signed on as the manager for Middlesbrough. However, after a series of defeats, he voluntarily stepped down as the manager during the 2010-2011 season."}, {"url": "https://www.independent.co.uk/sport/football/international/gordon-strachan-appointed-scotland-manager-8451941.html", "page_content": "Sign up to Miguel Delaney’s Reading the Game newsletter sent straight to your inbox for free Sign up to Miguel’s Delaney’s free weekly newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nFootball email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nGordon Strachan admitted being appointed the Scotland manager was the culmination of a personal project “40 years in the making”.\n\nThe former Celtic, Southampton, Coventry and Middlesbrough boss replaces Craig Levein, who was sacked in November, as the Scottish Football Association confirmed his appointment at Hampden.\n\nHe told Sky Sports News: \"\"I am very very proud in myself and my family are proud I've become Scotland manager.\n\nIt's a great day for me to do this and it's been 40 years in the making.\n\n\"There'll be rough times but I know there'll be good times too.\"\n\nStrachan, whose contract runs up until Euro 2016, stated his desire to make Scotland a proud footballing country once more.\n\nHe said: \"Every club you go to there's always challenges but this is the first time the challenges are in front of a nation.\n\n\"If you can be successful you can make a nation happy and make a nation proud and that is the priority for me to be able to do that with help from other people.\"\n\nStrachan, who has been out of a manager's job since leaving Middlesbrough in 2010, claimed it was the perfect time to step into the role.\n\n\"You're always interested as long as someone asks you But I think that time is right now because I've had that European experience,\" he added.\n\n\"I've had to deal with players and I've also had a couple of years where I can look at national football.\n\n\"The time is right for me to be able to take a job like this. I have the experience, I like working with people, I like dealing with people and I like trying to make people better.\"\n\nStrachan also stated his desire to make the fans proud as well as reach the finals of either the World Cup or the European Championship.\n\nScotland have not qualified for the finals of a major tournament since reaching the 1998 World Cup in France.\n\n\"To progress with the squad. I really want the squad and the staff to give something back to the country and the fans who support us because the fans are probably more famous than the squad now,\" Strachan added.\n\n\"So what we want to try and do is to give back something and make them turn up for a major finals competition.\n\n\"Through my TV work I've been to these competitions and the Irish have kind of stepped up for a while so hopefully the Irish and the Scottish can get together for one major and it'll be one hell of a party.\"\n\nAsked if he had a message for the fans, Strachan responded: \"Keep doing what you're doing because the support is fantastic.\"\n\nScotland have picked up just two points in their bid to qualify for the World Cup in Brazil, but Strachan rejected the suggestion that a top-two spot is out of his players' reach.\n\n\"If we work together as a group and a set of fans I know for a fact we'll be successful,\" he added.\n\n\"I can't ask for anything more than we're doing at the moment.\n\n\"We're going to use the games to try and win. My philosophy is to win games of football, like Manchester United.\n\n\"We still have to collect as many points as we can and it's disrespectful to say we'll use the games just to improve.\n\n\"We'll give it a go.\n\n\"What I know is that these guys, for all they might get criticised, are the best at what they do.\n\n\"They play for Scotland and we have to find a system that suits these players to win games of football.\"\n\nStrachan also denied the national coach's role is a poisoned chalice, adding: \"I think it's a great job.\n\n\"At this time in my life I can deal with this. All my experiences have prepared me for this moment.\"\n\nThe ex-midfielder laughed off suggestions the Scotland job was the best opportunity made available to him since his departure from Middlesbrough.\n\n\"I'm not saying that no,\" he added. \"I'm just saying it was a job I wanted to do.\n\n\"For a Scotsman, it's a fantastic thing. I played for Scotland then started coaching and thought 'I want to be Scotland manager some day'.\n\n\"You don't get easy jobs but the important thing is to make people happy by winning games of football.\n\n\"The more successful I am I look around and the more people there are around me.\n\n\"Together, we'll look to do something.\"\n\nWhen asked if Levein's previous selection would require a significant overhaul to boost Scotland's performances in Group A, Strachan referred to his failed experiment at club level.\n\n\"I made that mistake when I went to Middlesbrough,\" he added. \"I really should have used the players that were there and used a system for them.\n\n\"So I'm going to get a system that suits these players and over the years, through Mark (Wotte) and Billy (Stark), we'll find a style that works.\"\n\nScotland next face Wales, and then Serbia, but Strachan would not be drawn on any tactical switch for the March double header.\n\nHe added: \"The standard of football around Europe has improved dramatically in that time so it's not a question that I can answer just now.\n\n\"In the immediate future we have to find a system that suits the squad here.\n\n\"The last couple of games could have gone either way. The Wales game could have fine well gone to Scotland so we're not far away.\"\n\nStrachan revealed making an approach to an as yet unnamed colleague with a view to hiring an assistant at Hampden.\n\n\"I've spoken to one person and there's no doubt that they would like to take it on but this is before everything was settled,\" he added. \"You'll know him.\"\n\nStrachan's most successful spell as a club manager was arguably his four-year spell with Celtic, a period which saw the Hoops claim three consecutive Premier League titles, and the national boss hopes his new charges can replicate his old club's recent performances.\n\nHe added: \"It shows that we can go up against teams with bigger names - individually better players at huge clubs - and you can beat them with a group that all want to go in the right direction.\n\n\"Celtic got a result against Barcelona this year because they played to their strengths, and the same at Spartak Moscow.\"\n\nPA"}, {"url": "https://www.irishtimes.com/sport/strachan-appointed-scotland-boss-1.961839", "page_content": "SCOTLAND:Gordon Strachan spoke of a 40-year football journey ending in pride yesterday when he was named the new Scotland manager.\n\nThe former Coventry, Southampton, Celtic and Middlesbrough boss was confirmed in the post by the Scottish Football Association before a lunchtime press conference at Hampden.\n\nThe 55-year-old has been out of management since leaving Boro in October 2010 but he realised a long-held dream when made boss of his national side on a contract that will take him through to the 2016 European Championship qualifiers.\n\n“I am very proud of myself but my family, my wife, mother, grandchildren, children and my friends are very proud so it shows you how important the Scotland job is,” he said."}, {"url": "https://www.thescottishsun.co.uk/sport/football/7225758/what-happened-strachan-scotland-manager/", "page_content": "OH MY GORD\n\nTHE journey to FINALLY end 23 years of tournament-less football has been a long one for Scotland.\n\nThere have been some highs but even more lows.\n\n3 Former Scotland boss Gordon Strachan\n\n3 Current Scotland boss Steve Clarke\n\nRightly, there has been some praise handed out to Steve Clarke’s predecessors for the job they did in getting the foundations right.\n\nOne of those men is Gordon Strachan, who so nearly secured qualification during his tenure.\n\nBETTING SPECIAL - BACK SCOTLAND AT HUGE 60/1 ODDS BOOST TO WIN OPENING MATCH AGAINST CZECH REPUBLIC\n\nWhen was Gordon Strachan in charge of Scotland?\n\nStrachan took the national team job following Craig Levein’s departure in January 2013.\n\nHe had previously been Middlesbrough boss for a year.\n\nThat job followed four years as manager of Celtic.\n\nHow did he do at Scotland?\n\n3 Strachan taking Scotland training\n\nStrachan got off to a winning start as national team boss with a 1-0 friendly win over Estonia.\n\nHis first two competitive games were in World Cup qualifying, where Scotland had slim chances of qualification anyway.\n\nDefeats to Wales and Serbia essentially killed the small hope.\n\nThe European finals had been increased to 24 teams from Euro 16 and anticipation was high that a long hiatus would come to an end.\n\nWIN £50,000 with Dream Team Euros Dream Team Euros is HERE! The best fantasy football game to accompany Euro 2020 has arrived. And you can play absolutely FREE for your chance to win the £50,000 jackpot. CLICK HERE TO SIGN UP FOR FREE! Dream Team Euros £50,000 jackpot\n\nThe best fantasy football game this summer\n\nPlay in mini-leagues against your mates, colleagues, family members - and some hand-picked celebrities\n\nFREE to play\n\nA 1-0 defeat in Georgia midway through the group undone the early good work.\n\nThough on the final day, Robery Lewandowski netted a late equaliser which ended any hope.\n\nAfter failing again to qualify for the World Cup in 2018, Strachan resigned from his post.\n\nWhat was his win percentage at Scotland?\n\nDespite failing to get Scotland to a major tournament, his win percentage was actually not too bad.\n\nIn total he managed 40 games, winning just shy of half of them at 19 wins.\n\nGames managed – 40\n\nGames won – 19\n\nGames drawn – 9\n\nGames lost – 12\n\nWin percentage – 47.50%\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://www.dailyrecord.co.uk/sport/football/football-news/video-gordon-strachan-is-appointed-scotland-1535691", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest news from Record Sport with our daily newsletter\n\nVideo Loading Video Unavailable Click to play Tap to play The video will auto-play soon 8 Cancel Play now\n\nThe former Celtic, Middlesbrough, Southampton and Coventry boss takes over with the squad sitting bottom of the World Cup 2014 qualifying group with just two points from the opening four matches.\n\nBut Strachan - an SFA Hall of Fame member - rejected the suggestion that a top-two spot is out of his players' reach.\n\n\"If we work together as a group and a set of fans I know for a fact we'll be successful,\" he added.\n\n\"I can't ask for anything more than we're doing at the moment.\n\n\"We're going to use the games to try and win. My philosophy is to win games of football, like Manchester United.\n\n\"We still have to collect as many points as we can and it's disrespectful to say we'll use the games just to improve.\n\n\"We'll give it a go.\"\n\nSFA chief executive Stewart Regan described the occasion as a \"special day for Scotland\".\n\nRegan said: \"As a player Gordon has experienced what every Scotland player wants to experience - participating in a major tournament and he can share those experiences with the squad as we prepare to qualify hopefully for France 2016.\n\n\"Gordon has bought into our performance strategy and likes the approach the Scottish FA are taking in developing younger players and it's great he is committing himself to working with Mark Wotte and Billy Stark.\n\n\"The single biggest factor that inspired the board was Gordon's passion and desire for the job.\n\n\"He made no secret of wanting this job and has really worn his heart on his sleeve in terms of wanting to be Scotland manager and I think that says it all for the board.\""}, {"url": "https://www.dailyrecord.co.uk/sport/football/football-news/gordon-strachan-is-appointed-scotland-manager-1535348", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest news from Record Sport with our daily newsletter\n\nGORDON STRACHAN admits his appointment as Scotland manager today is the culmination of a personal project \"40 years in the making\".\n\nThe former Celtic, Southampton, Coventry and Middlesbrough boss replaces Craig Levein, who was sacked in November, as the Scottish Football Association confirmed his appointment at Hampden.\n\nHe told a media conference today: \"\"I am very very proud in myself and my family are proud I've become Scotland manager.\n\nIt's a great day for me to do this and it's been 40 years in the making.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will auto-play soon 8 Cancel Play now\n\n\"There'll be rough times but I know there'll be good times too.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will auto-play soon 8 Cancel Play now\n\nStrachan, whose contract runs up until Euro 2016, stated his desire to make Scotland a proud footballing country once more.\n\nHe said: \"Every club you go to there's always challenges but this is the first time the challenges are in front of a nation.\n\n\"If you can be successful you can make a nation happy and make a nation proud and that is the priority for me to be able to do that with help from other people.\"\n\nStrachan, who has been out of a manager's job since leaving Middlesbrough in 2010, claimed it was the perfect time to step into the role.\n\n\"You're always interested as long as someone asks you But I think that time is right now because I've had that European experience,\" he added.\n\n\"I've had to deal with players and I've also had a couple of years where I can look at national football.\n\n\"The time is right for me to be able to take a job like this. I have the experience, I like working with people, I like dealing with people and I like trying to make people better.\"\n\nStrachan revealed making an approach to an as yet unnamed colleague with a view to hiring an assistant at Hampden.\n\nReports have suggested Gary McAllister is the man Strachan wants.\n\n\"I've spoken to one person and there's no doubt that they would like to take it on but this is before everything was settled,\" he added. \"You'll know him.\"\n\nStrachan also stated his desire to make the fans proud as well as reach the finals of either the World Cup or the European Championship.\n\nScotland have not qualified for the finals of a major tournament since reaching the 1998 World Cup in France.\n\n\"To progress with the squad. I really want the squad and the staff to give something back to the country and the fans who support us because the fans are probably more famous than the squad now,\" Strachan added.\n\n\"So what we want to try and do is to give back something and make them turn up for a major finals competition.\n\n\"Through my TV work I've been to these competitions and the Irish have kind of stepped up for a while so hopefully the Irish and the Scottish can get together for one major and it'll be one hell of a party.\"\n\nAsked if he had a message for the fans, Strachan responded: \"Keep doing what you're doing because the support is fantastic.\"\n\nScotland have picked up just two points in their bid to qualify for the World Cup in Brazil, but Strachan rejected the suggestion that a top-two spot is out of his players' reach.\n\n\"If we work together as a group and a set of fans I know for a fact we'll be successful,\" he added.\n\n\"I can't ask for anything more than we're doing at the moment.\n\n\"We're going to use the games to try and win. My philosophy is to win games of football, like Manchester United.\n\n\"We still have to collect as many points as we can and it's disrespectful to say we'll use the games just to improve.\n\n\"We'll give it a go.\n\n\"What I know is that these guys, for all they might get criticised, are the best at what they do.\n\n\"They play for Scotland and we have to find a system that suits these players to win games of football.\"\n\nStrachan also denied the national coach's role is a poisoned chalice, adding: \"I think it's a great job.\n\n\"At this time in my life I can deal with this. All my experiences have prepared me for this moment.\"\n\nThe ex-midfielder laughed off suggestions the Scotland job was the best opportunity made available to him since his departure from Middlesbrough.\n\n\"I'm not saying that no,\" he added. \"I'm just saying it was a job I wanted to do.\n\n\"For a Scotsman, it's a fantastic thing. I played for Scotland then started coaching and thought 'I want to be Scotland manager some day'.\n\n\"You don't get easy jobs but the important thing is to make people happy by winning games of football.\n\n\"The more successful I am I look around and the more people there are around me.\n\n\"Together, we'll look to do something.\""}]}