{"Steven Threet went undrafted in the 2010 NFL Draft.": [{"url": "https://bleacherreport.com/articles/384232-nfl-draft-recap-2010-best-of-the-undrafted-prospects", "page_content": "Andy Lyons/Getty Images\n\nAfter seven long rounds with the 2010 NFL Draft in the bookswe'll take a look at some of the best players not taken in the Top 255.\n\nEvery year, many undrafted players get a shot in the NFL and make NFL teams. So don't rule out any of these prospects to make an impact.\n\nTo get an update on where these players are being picked up, check the link below:\n\n\n\nUndrafted Free Agents\n\n\n\n1 . Donovan Warren - CB - Michigan\n\n-A great cover corner in college, he's a bit raw, which is why he fell\n\n\n\n2 . Jarrett Brown - QB - West Virginia\n\n-Wowed at the Combine, he should be a hot pickup after the draft\n\n\n\n3 . Brandon Lang - DE/OLB - Troy\n\n-Arguably had a better year than his drafted teammate (Cameron Sheffield)\n\n\n\n4 . Vince Oghobaase - DT - Duke\n\n-Probably the best nose tackle left after the draft\n\n\n\n5 . Stafon Johnson - RB - USC\n\n-Throat injury may have scared some teams, should still get a shot\n\n\n\n6 . Donald Jones - WR - Youngstown State\n\n-Very fine tuned recevier, his lack of great speed or physicality hurt\n\n\n\n7 . Devin Ross - CB - Arizona\n\n-Good sized cornerback, his next level position may be in the air\n\n\n\n8 . Jevan Snead - QB - Ole Miss\n\n-Once viewed as a 1st rounder, his radical inconsistent play pushed him down\n\n\n\n9 . Brandon Carter - OG - Texas Tech\n\n-Surprisingly decent athlete for his size, he's a good fit for a power run team\n\n\n\n10 . Jeremy Williams - WR - Tulane\n\n-Great athlete and good in the air getting the ball, he's a little soft\n\n\n\n11 . Boo Robinson - DT - Wake Forest\n\n12 . Brandon Minor - RB - Michigan\n\n13 . Freddie Barnes - WR - Bowling Green\n\n14 . Harry Coleman - S - LSU\n\n15 . LeGarrette Blount - RB - Oregon\n\n16 . Ryan Perrilloux - QB - Jacksonville State\n\n17 . Micah Johnson - ILB - Kentucky\n\n18 . Junior Gallette - DE/OLB - Stillman\n\n19 . Javaris James - RB - Miami (FL)\n\n20 . Danario Alexander - WR - Missouri\n\n\n\n21 . Rahim Alem - DE - LSU\n\n22 . Jason Beauchamp - OLB - UNLV\n\n23 . Lindsey Witten - DE - Connecticut\n\n24 . Justin Woodall - S - Alabama\n\n25 . Jaron Baston - DT - Missouri\n\n26 . Sergio Render - OG - Virginia Tech\n\n27 . Naaman Roosevelt - WR - Buffalo\n\n28 . Derek Hardman - OT - Eastern Kentucky\n\n29 . Swanson Miller - DT - Oklahoma State\n\n30 . Blair White - WR - Michigan State\n\n\n\n31 . Kelaid Williams - RB - LSU\n\n32 . Darius Marshall - RB - Marshall\n\n33 . Jordan Lake - S - Baylor\n\n34 . Jamar Cheaney - ILB - Mississippi State\n\n35 . Colin Peek - TE - Alabama\n\n36 . Brandon Gillebeaux - DT - Delaware\n\n37 . Thomas Austin - OG - Clemson\n\n38 . Albert McClellan - DE/OLB - Marshall\n\n39 . Josh McNeil - C - Tennessee\n\n40 . Chris Bell - WR - Norfolk State\n\n\n\n41 . Chris Chancellor - CB - Clemson\n\n42 . Chris Carter - WR - UC Davis\n\n43 . James Ruffin - DE - Northern Iowa\n\n44 . Adam Ultoski - OT - Texas\n\n45 . Mike McLaughlin - ILB - Boston College\n\n46 . Pat Simonds - WR - Colgate\n\n47 . Randy Phillips - S - Miami (FL)\n\n48 . Shay Hodge - WR - Ole Miss\n\n49 . Chris Brown - RB - Oklahoma\n\n50 . Stephen Virgil - CB - Virginia Tech\n\n\n\n51 . Alex Joseph - ILB - Temple\n\n52 . Bryan Anderson - WR - Central Michigan\n\n53 . Nate Overbay - TE - Eastern Washington\n\n54 . Eric Moncur - DE - Miami (FL)\n\n55 . Jon Estes - C - Hawaii\n\n56 . Travis Ivey - DT - Maryland\n\n57 . Joique Bell - RB - Wayne State\n\n58 . Jeff Fitzgerald - DE - Kansas State\n\n59 . Prince Miller - CB - Georgia\n\n60 . Andre Neblett - DT - Temple\n\n\n\n61 . Chinso Echebelem - S - Tulane\n\n62 . Keenan Clayton - OLB - Oklahoma\n\n63 . Barry Church - S/OLB - Toledo\n\n64 . Josh Pinkard - S - USC\n\n65 . Pat Paschall - RB - North Dakota State\n\n66 . Mark Ortmann - OT - Michigan\n\n67 . Matt Nichols - QB - Eastern Washington\n\n68 . LeRoy Vann - WR/KR - Florida A&M\n\n69 . Mike Nixon - OLB - Arizona State\n\n70 . Andre Amos - CB - Ohio State\n\n\n\n71 . Lonyae Miller - RB - Fresno State\n\n72 . Andre Dixon - RB - Connecticut\n\n73 . Kurtis Gregory - OG - Missouri\n\n74 . Budd Thacker - DT - Florida State\n\n75 . Roy Upchurch - RB - Alabama\n\n\n\n\n\nCheck out www.NFLHouse.com for draft grades and other great draft information and articles. Contact me at EricG@NFLHouse.com or follow us on Twitter! www.twitter.com/NFLHouse"}, {"url": "https://bleacherreport.com/articles/2895234-re-drafting-the-2010-nfl-draft", "page_content": "0 of 32\n\nMark Tenally/Associated Press\n\nThe 2010 NFL draft is known for a few things.\n\nIt was the final draft before the rookie wage scale kicked in with the 2011 collective bargaining agreement. First overall pick Sam Bradford was the last No. 1 selection to get a gonzo payday before even playing a down—$50 million in guarantees.\n\nIt also had possibly the best trio of defensive tackles ever in the same class. Ndamukong Suh and Gerald McCoy went in the top five, while Geno Atkins lasted until Round 4. The threesome has combined for 19 Pro Bowl nods.\n\nDefensive tackle wasn't the only loaded position. The edge-rusher crop was deep. Both Rob Gronkowski and Jimmy Graham entered the NFL. And there was no shortage of wide receiver talent.\n\nThis draft produced a fistful of players who will be enshrined in Canton. But if we knew then what we know now, how much different would the first round of the 2010 draft look?\n\nThat's what we're here to find out.\n\nWith the benefit of hindsight (and without draft-day trades—only deals consummated before April 22, 2010, are included), I've run the 2010 draft through the hot tub time machine and re-slotted the round.\n\nThe St. Louis Rams are on the clock—and Bradford isn't getting that monster payday."}, {"url": "https://bleacherreport.com/articles/393680-profile-of-five-notable-undrafted-free-agents-for-the-2010-nfl-season", "page_content": "Jeff Gross/Getty Images\n\nThroughout the National Football League's storied history, there have been many players who were overlooked by league executives who went on to enjoy Hall of Fame careers. As a result of injuries, poor Combine work-outs or any number of other variables, many talented players get bypassed in the annual Draft.\n\nIt seems that every year there are at least a few notable athletes who get shut out of the draft process and are forced to sign with teams as a free agent.\n\nThis articles ranks the top five players who went unclaimed through the 2010 NFL Draft.\n\n5. Scott Sicko\n\nArguably the most overlooked prospect in the 2010 NFL Draft, former New Hampshire Wildcats tight end Scott Sicko wasn’t invited to the Combine or selected in this year’s draft.\n\nAfter surprising many by turning down five contract offers in favour of becoming either an educator or a state trooper, Sicko finally opted to sign with the Dallas Cowboys as an undrafted free agent.\n\nFor the last several seasons there have been few tight ends who have matched the production of Sicko; in three seasons the 6’4” Wildcat amassed nearly 160 receptions for over 2,000 receiving yards.\n\nWith the Dallas Cowboys, Sicko has found himself behind one of the NFL’s top tight ends in Jason Witten and beside the up-and-coming Martellus Bennett.\n\nIf Sicko can impress coaches early, he may emerge as the team’s second tight end heading into the 2010 season.\n\nAs an athletic pass catcher, Sicko possesses many of the valuable assets Witten brings to the table, and if the Cowboys utilize the 2009 Associated Press FCS Second-Team All-American honouree to his full potential, \"Big D\" may have a new legitimate tight end for years to come.\n\n4. Jevan Snead\n\nOne of the biggest question marks prior to the 2010 NFL Draft was regarding exactly how much value NFL executives placed on Jevan Snead, the former Texas Longhorns and Ole Miss Rebels signal caller.\n\nDespite once being hailed as a potential first-round prospect by some analysts, Snead was signed by the Tampa Bay Buccaneers as a free agent after he was bypassed by all 32 NFL franchises in the draft.\n\nBefore transferring to Ole Miss to become the Rebels’ starting quarterback, Snead, 22, served as a backup to Colt McCoy as a Longhorn.\n\nAlthough Snead showed glimpses of greatness during his time in college, his career has been marred by his often erratic style and tendency to throw too many interceptions, including three in a win over Oklahoma State at the 2009 Cotton Bowl.\n\nWith the Buccaneers Snead has a good opportunity to eventually become a starting quarterback, as the youthful Tampa Bay franchise is in a transitional stage and the unproven starter Josh Freeman has been plagued by inconsistency in the past.\n\nBefore the time comes for Snead to potentially take the reins of the Buccaneers, the 6'3\" signal caller will look to replace the run-first second string quarterback Josh Johnson on the depth chart.\n\nWith the ideal size of a NFL signal caller and a strong passing arm, the Tampa Bay Buccaneers may have picked up their quarterback of the future.\n\nIf Snead can devote himself to refining some of the cerebral aspects of his game through his first few campaigns in the league, the sky will be the limit for the San Angelo, Texas native.\n\n3. Stafon Johnson\n\nPrior to enduring a horrific weightlifting accident in which 275 pounds were dropped on his unprotected neck, many NFL executives viewed Stafon Johnson, 22, as an eventual legitimate prospect to play on Sundays.\n\nAfter recovering from the accident, and putting on an impressive performance at the Combine, Johnson went uncontacted through all seven rounds of the 2010 NFL Draft and later agreed to terms with the Tennessee Titans as an undrafted free agent.\n\nUnder the guidance of head coach Pete Carroll, Johnson was used sparingly throughout his career at USC. Prior to sitting out the majority of his senior campaign as a result of his weightlifting accident, Johnson amassed nearly 20 touchdowns as a Trojan and never finished a season with a rushing average below 4.9 yards per carry.\n\nUsing his combination of speed and agility, Johnson averaged nearly seven yards per carry while rushing the ball as a sophomore in 2007.\n\nDespite performing well as a member of one of the NCAA’s finest football programs, Johnson was overlooked by NFL executives for his perceived susceptibility to future injuries, rather than past performances.\n\nWith the Titans, Johnson will be in the midst of one of the league’s most crowded backfields, as the reigning NFL Offensive Player of the Year Chris Johnson, sophomore tailback Javon Ringer, and fellow undrafted rookie running back LaGarrette Blount will all be competing with the USC alum for carries throughout the 2010 NFL season.\n\nFortunately for Johnson, the run-happy Titans will likely provide many opportunities for the Compton, California native to touch the ball in the future.\n\n2. Freddie Barnes\n\nDespite finishing his collegiate career as one of the most productive wide receivers in recent memory, all 32 NFL franchises passed on Freddie Barnes, 23, in the 2010 NFL Draft.\n\nIn the days following the Draft, the Chicago Bears signed the former Bowling Green Falcon as an undrafted free agent.\n\nAs a member of the Bowling Green Falcons from 2006 to 2009, Barnes cemented his status as one of the biggest playmakers in college football.\n\nShowing that he can put a team on his shoulders, Barnes enjoyed one of the most prolific seasons in collegiate football history, snagging a NCAA record 155 receptions for nearly 1,800 yards and 19 touchdowns in 2009 alone.\n\nPossessing a pair of dependable hands and a proven track record, Barnes ranks among the likes of Randy Moss as one of the most dynamic receivers in MAC history.\n\nWith his hometown Chicago Bears, Barnes will look to establish himself in the thick of one of the NFL’s more promising receiving corps. Under the coaching of offensive coordinator Mike Martz, the Bears will likely focus primarily on passing the football, and this is music to the ears of the 2009 Fred Biletnikoff Award finalist Barnes.\n\nIn 2010 and beyond, Barnes will likely be given many opportunities to advance on the Bears depth chart, as Chicago’s receiving corps is among the league’s most youthful and inexperienced.\n\nAlthough Barnes’s performance most likely won’t mirror the gaudy statistics that he posted in college immediately, there is a good chance that the former MAC standout can become a dependable target for Jay Cutler in the future.\n\n1. LeGarrette Blount\n\nPrior to being known as the perpetrator of one of the most publicised punches in recent memory, former Oregon Duck LeGarrette Blount, 23, was viewed by many as a bright prospect for the NFL.\n\nAfter the incident, however, Blount’s draft stock plummeted and despite an impressive Combine workout, the 240 lb tailback was bypassed by every club in the 2010 NFL Draft.\n\nAfter Blount voiced his intention to sign with the San Francisco 49ers after the draft, the overlooked running back surprised many and agreed to terms with the Tennessee Titans.\n\nAs a power back at Oregon, Blount ran over opposing Pac-10 defences for two seasons. Despite being known more for his right-hook than running ability, Blount has been on the radar of NFL executives for his entire collegiate career.\n\nDifficult to take down and specializing in yardage after first contact, Blount muscled his way to over 1,000 rushing yards as a junior at Oregon in 2008.\n\nIn Tennessee Blount will likely be expected to assume the role that has been vacated as a result of the departure of LenDale White, as the two heavy-set running backs have similar skill sets.\n\nWorking as a compliment to the dynamic Chris Johnson, Blount’s hard-headed running style will likely be used primarily in short-yardage situations. With an inconsistent quarterback in Vince Young, and a coach that focuses largely on “pounding the rock,” Blount will likely receive many opportunities to carry the football in the 2010 season.\n\nIn 2010 Blount is poised to receive ample opportunities with the Titans, and for a physical running back with a chip on his shoulder, this is a scary thought for opposing defences.\n\nWith Blount, the Titans have landed a tenacious power back.\n\nAnd in conjunction with the extremely talented Johnson, Tennessee may have one of the top one-two punch backfields in the NFL..."}, {"url": "https://www.foxsports.com/stories/nfl/the-current-top-10-undrafted-nfl-players", "page_content": "The Current Top 10 Undrafted NFL Players Published Jun. 30, 2017 6:28 p.m. ET share facebook twitter reddit link\n\nfoxsports\n\nAug 13, 2016; Kansas City, MO, USA; Seattle Seahawks defensive back Tanner McEvoy (6) catches a pass and is tackled by Kansas City Chiefs defensive back Deveron Carr (1) during the second half at Arrowhead Stadium. Seattle won 17-16. Mandatory Credit: Denny Medley-USA TODAY Sports\n\nSome College Football players get overlooked coming out of College. Here I rank the top 10 undrafted NFL Players.\n\n\n\nEvery year hundreds of College Football players declare for the NFL Draft, and by the end, usually just over 250 players get drafted to NFL teams. That’s when the cameras turn off, the lights get less bright, and it’s all said and done, right? Wrong. A handful of players continue their dream. Training more, working harder, trying to manage their way onto an NFL Roster through Undrafted Free Agency.\n\nIn 2016 we’ve seen the likes of Trevone Boykin in Seattle, filling in for an injured Russell Wilson. Tanner McEvoy out of Wisconsin caught a long touchdown pass the next week when Wilson made his way back to the starting lineup.\n\nJalen Richard and Josh Ferguson are both getting regular snaps for the Raiders and Colts respectively.\n\nJalin Marshall is in the Wide Receiver rotation for the Jets.\n\nLastly, Brian Poole has worked his way into the starting lineup for the Atlanta Falcons at CB, while De’Vante Harris is seeing time at CB for the New Orleans Saints. All of these players went undrafted in 2016, but beat the odds and are making a difference for their teams.\n\nADVERTISEMENT\n\nWhile these players are merely making a difference, some current NFL players went undrafted, but are stars in the league, some Pro Bowlers, and some integral pieces to Super Bowl Champion teams.\n\nHere is my top 10 Current NFL Players that went Undrafted.\n\nAug 18, 2016; Foxborough, MA, USA; New England Patriots cornerback Malcolm Butler (21) walks off the field after defeating the Chicago Bears at Gillette Stadium. Mandatory Credit: Bob DeChiara-USA TODAY Sports\n\nHonorable Mention\n\nI had a tough time deciding on a top 10, so I had to include an honorable mention section. Just missing the cut:\n\nDoug Baldwin, WR – Seattle Seahawks – After ending last season with 78 receptions, 1,069 yards, and 14 touchdowns, Baldwin had a career year last year. He could well be on his way to a very productive career.\n\nVontaze Burfict, LB – Cincinnati Bengals – Burfict entered the NFL in 2012, and played in all 16 games as a rookie, starting 14 of them. Since then, he’s been a force to be reckoned with….when healthy.\n\nMalcolm Bulter, CB – New England Patriots – Best known for his Super Bowl winning interception vs. Seattle, Butler has earned the starting job under Belichick. He has solidified himself as a great playmaker and very solid NFL cornerback. Expect good things to come, and he could finish higher on this list in years to come.\n\nC.J. Anderson, RB – Denver Broncos – Anderson already has one Super Bowl ring under his belt, and could win more as the featured RB for the Broncos. In the last 2 years, he’s covered over 2,100 yards and found the endzone 15 times. He’s still very young, and could prove to be a great player for the Broncos for many years.\n\nSep 18, 2016; East Rutherford, NJ, USA; New York Giants wide receiver Victor Cruz (80) runs off the field after the Giants defeated the Saints 16-13 at MetLife Stadium. Mandatory Credit: Ed Mulholland-USA TODAY Sports\n\n#10 Victor Cruz – WR – New York Giants\n\nThe Salsa King himself comes in at No. 10. After a monster Senior Year at the University of Massachusetts, Victor Cruz went undrafted in the 2010 NFL Draft. In a Preseason game vs the Jets, he finished the game with 6 catches for 145 yards and 3 touchdowns. The rest was history.\n\nIn 2011 & 2012, Cruz finished the regular season with 80+ receptions, 1500+ & 1000+ yards respectively, and 9 &10 touchdowns. He probably would have done the same in 2013, had a couple injuries not kept him out of 2 games.\n\nCruz was a major part of the Giants Superbowl win over the New England Patriots in 2011.\n\nAs we all know, since 2014, Cruz has dealt with multiple injuries, including a torn patellar tendon and severe calf injuries. Luckily, he has returned to field in 2016 and is beginning to look like his old self.\n\nCruz not only gives the Giants another playmaker but someone who adds some juice to the offense. He plays with such a passion that it rubs off on the rest of his teammates. His importance in the offense could grow if Odell Beckham Jr. doesn’t get his emotions in check.\n\nSep 1, 2016; Glendale, AZ, USA; Denver Broncos cornerback Chris Harris Jr. (25) against the Arizona Cardinals during a preseason game at University of Phoenix Stadium. Mandatory Credit: Mark J. Rebilas-USA TODAY Sports\n\n#9 Chris Harris Jr. – CB – Denver Broncoos\n\nThe cornerback from Denver comes in 9th on this list. Chris Harris Jr. is a part of the intimidating defense that won Super Bowl L. After a very successful season at Kansas in 2010, Chris found himself fighting for a roster position after going undrafted.\n\nIn his rookie season, he finished with 65 tackles and an interception, playing in all 16 games. He also made the Broncos All-Rookie team, as well as winning the Broncos Breakout Player of the Year award.\n\nSince then, Harris Jr. has been increasingly difficult for opposing offenses to deal with. He has great strength and quick feet, very rarely losing receivers in coverage. The opposing AFC Quarterbacks can attest, they don’t like playing against Chris Harris Jr.\n\nIt’s his ability to limit separation that makes him so special. He features a great combination of balance and fluid hips. This allows him to stick close to his target.\n\nHarris Jr. adds extra value because of his versatility. He is someone that the Broncos can play on the outside or move into the slot. Harris also has the rare ability to stick with the quicker targets and also get physical with the bigger wideouts in the league.\n\nDec 6, 2015; Minneapolis, MN, USA; Seattle Seahawks defensive end Michael Bennett (72) against the Minnesota Vikings at TCF Bank Stadium. The Seahawks defeated the Vikings 38-7. Mandatory Credit: Brace Hemmelgarn-USA TODAY Sports\n\n#8 Michael Bennett – DE – Seattle Seahawks\n\nMichael Bennett was signed by the Seahawks after his 2009 season at Texas A&M. Most considered his undrafted status a result of his inconsistent play in college. After making the 53 man roster, he was released by the Seahawks in his rookie season and signed off waivers by the Tampa Bay Buccaneers.\n\nIn his 3 year stint with the Bucs, he totaled 82 tackles and 14 sacks. Bennett was primarily used as a pass rushing DT.\n\nIn 2013, Bennett was signed back to the Seahawks, and this is when he really hit his stride. He had 8.5 sacks that season as a rotational DE, helping the stout defensive front seven on their way to a Super Bowl title.\n\nOver the last 2 years, Bennett has added 17 more sacks to his personal stat sheet, and continues to be a beast in Seattle. He was voted to his first Pro Bowl in 2015, winning Defensive MVP.\n\nBennett continues to be a major part of the Seahawks defensive attack. He’s counted on to set the tone and make life miserable for the opposing quarterback. However, his unhappiness about his contract could eventually lead to some miserable moments for the Seahawks.\n\nSep 25, 2016; Philadelphia, PA, USA; Philadelphia Eagles tackle Jason Peters (71) in action against the Pittsburgh Steelers at Lincoln Financial Field. The Philadelphia Eagles won 34-3. Mandatory Credit: Bill Streicher-USA TODAY Sports\n\n#7 Jason Peters – OT – Philadelphia Eagles\n\nAt #7, and the only offensive lineman to make this list, is Jason Peters. Peters may be the player on this list that surprised the most.\n\nAfter his Senior season at Arkansas in 2003, and being selected 2nd Team All-SEC, Jason Peters was projected to be a 4th round pick by Sports Illustrated. He had 21 catches for 218 yards and 4 touchdowns. Oh. Wait. Did I forget to mention that he was a Tight End in college?\n\nPeters recognized his blocking ability at the position. Add that to his huge frame at 6’4″ 320 pounds on top of his surprisngly quick feet, and he positioned himself as a future offensive tackle coming into the NFL Draft.\n\nHowever teams were skeptical of Peters making the adjustment and he eventually went undrafted, being signed by the Buffalo Bills as a free agent. In just two years, Peters solidified himself as the starting Right Tackle, and one year later earned the starting role on the left side, protecting his QB’s blind side.\n\n2008 was Peters last year with the Bills, after making the Pro Bowl the year before. In 2009 he was traded to the Philadelphia Eagles. Andy Reid, the coach at the time, thought Peters was the best tackle in football, and it was hard to argue.\n\nAs an 8 time Pro Bowl Selection, and 1st Team All-Pro in 2011, 2013, and 2014. Peters earns his spot at #7.\n\nNov 9, 2014; Detroit, MI, USA; Miami Dolphins defensive end Cameron Wake (91) during the fourth quarter against the Detroit Lions at Ford Field. Detroit won 20-16. Mandatory Credit: Tim Fuller-USA TODAY Sports\n\n#6 Cameron Wake – DE – Miami Dolphins\n\nThe Miami Dolphins Edge Rusher finds his place on the list at No. 6. After an inconsistent and arguably disappointing career at Penn State, Wake was originally signed by the New York Giants in 2005 as a free agent, but released soon after.\n\nAfter a two year stint with the BC Lions in the Canadian Football League and leading the league in sacks in consecutive seasons, Wake was a hot prospect for the 2009 NFL Season.\n\nHe received interest from many teams but signed with the Dolphins and has remained in Miami since. When healthy, Cameron Wake has been an unstoppable force, causing pain and misery for opposing Quarterbacks.\n\nSince 2010, Wake has never totaled less than 8.5 sacks when playing in 15 or more games. His season high in sacks came in 2012 when he finished with 15 sacks, 38 tackles, and 3 forced fumbles.\n\nHe has been selected to the Pro Bowl 4 times, and was a First Team All-Pro selection in 2012.\n\nAt this stage of his career, Wake sees most of his action in apparent passing situations. The Dolphins like to keep him fresh and put him on the field when the game is on the line.\n\nAug 12, 2016; Pittsburgh, PA, USA; Pittsburgh Steelers outside linebacker James Harrison (92) on the filed for warm-ups before playing the Detroit Lions at Heinz Field. The Detroit Lions won 30-17. Mandatory Credit: Charles LeClaire-USA TODAY Sports\n\n#5 James Harrison – DE/OLB – Pittsburgh Steelers\n\nIf you can believe it, James Harrison graduated from Kent State University in 2001, and still plays in the league today. He went undrafted in the 2002 NFL Draft, and found himself on and off the Steelers practice squad in his first two seasons.\n\nFrom 2004-2006, Harrison was doing what he could with the time alotted. He made a name for himself on Special Teams, as well as making some good plays on defense as well. His path to stardom was paved with hard work and a no-quit attitude.\n\nHowever in 2007, Harrison got his chance as a starter and cashed in. With 76 tackles and 8.5 sacks, Harrison was selected to his first Pro Bowl and started for the AFC. In 2008, Harrison was named the AP NFL Defensive Player of the Year, becoming the first ever undrafted player to win the award.\n\nHe is still playing at a high level and may realistically have a few more seasons left in the tank.\n\nOver his career, he has amounted 536 tackels and 76.5 sacks. He has been selected to 5 Pro Bowls, and twice to the 1st Team All Pro. Match that with 2 Super Bowl Rings and Harrison is solidly in at No. 5.\n\nNov 1, 2015; Baltimore, MD, USA; San Diego Chargers tight end Antonio Gates (85) runs as Baltimore Ravens inside linebacker C.J. Mosley (57) attempts to bring him down during the fourth quarter at M&T Bank Stadium. Baltimore Ravens defeated San Diego Chargers 29-26. Mandatory Credit: Tommy Gilligan-USA TODAY Sports\n\n#4 Antonio Gates – TE – San Diego Chargers\n\nAt No. 4, is the former Kent State Basketball player turned NFL Tight End. After being considered a “tweener” by NBA scouts, Gates announced his plan to try his hand at football, despite never playing in college. He held workouts for many teams, eventually being signed by the Chargers in 2003.\n\nIn his first NFL Season, he made an immediate impression moving from 3rd on the Depth Chart, to starter by November of his rookie season. The pundits couldn’t wait to see what his sophomore season would bring to the Chargers.\n\nIn 2004, he emerged as Drew Brees’ favorite target, finishing the season with 81 receptions for 964 yards and 13 touchdowns.\n\nEven with an eventual change at Quarterback, he developed instant rapport with Philip Rivers. Gates has been a top tight end in San Diego for his duration there.\n\nHis career is coming to a close but he’s still seen as a big part of the offense. The Chargers will also be looking to him to train his replacement—Hunter Henry.\n\nIn his career he has notched 850 receptions, 10,679 yards, and 105 touchdowns to his name. With 8 Pro Bowl selections, 3 First Team All-Pro selections, and ranked 7th overall in receiving touchdowns all time….Gates is worthy of his No. 4 choice.\n\nAug 27, 2016; Indianapolis, IN, USA; Indianapolis Colts kicker Adam Vinatieri (4) kicks a field goal in the first half against the Philadelphia Eagles at Lucas Oil Stadium. Mandatory Credit: Thomas J. Russo-USA TODAY Sports\n\n#3 Adam Vinatieri – K – Indianapolis Colts\n\nYes, I did just do it. A kicker comes in at #3, but not just any kicker. This is the GOAT himself, Adam Vinatieri. Most known for his time as the New England Patriots Kicker, he now pays his bills kicking in Indianapolis.\n\nAdam was a place kicker and punter for all 4 years of his time at South Dakota State University. After not being drafted, Vinatieri played in the now defunct World League of American Football for the Amsterdam Admirals.\n\nThe next season in 1996, Vinatieri was signed by the New England Patriots as an undrafted free agent as a place kicker.\n\nVinatieri is arguably most known for his two Super Bowl winning field goals as time expired to defeat first the St. Louis Rams, and then in almost identical fashion, the Carolina Panthers. The man is cold-blooded. In his time in New England, he kicked 18 game winning field goals with less than a minute remaining on the clock.\n\nIn 2006, Vinatieri signed with the Indianapolis Colts, and his legacy continued. In his first season, the Colts won the Super Bowl, in which Vinatieri made three field goals.\n\nSo far, he has made 511 field goals, and 752 extra points, and is almost unanimously considered the greatest kicker of all time.\n\nSep 11, 2016; Seattle, WA, USA; Miami Dolphins running back Arian Foster (29) rushes against the Seattle Seahawks during the second quarter at CenturyLink Field. Seattle defeated Miami, 12-10. Mandatory Credit: Joe Nicholson-USA TODAY Sports\n\n#2 Arian Foster – RB – Miami Dolphins\n\nComing in at #2, and most likely in debatable fashion, is Arian Foster. After a slightly above average career at Tennessee, Foster was considered a late round RB draft prospect.\n\nHowever, he went undrafted and was eventually signed by the Houston Texans as a free agent in 2009. After drifting between practice squad and active roster, Foster got his chance towards the end of his rookie season and played well.\n\nIn the following season, Foster was named the starter, and this decision payed immediate dividends. In his first game as a starter, Foster carried the ball 33 times for 231 yards and 3 touchdowns. Talk about a good first game.\n\nHe won the rushing title in his 2nd season with 1,616 yards, adding another 604 yards receiving to eclipse the record for total yards from an undrafted player.\n\nEven with injuries always playing a role in Foster’s career, he managed to rush for 1,000 yards in 4 different seasons. Foster has 54 rushing touchdowns, 14 receiving touchdowns, and 8,740 total yards. He holds Texans franchise records for rushing touchdowns, rushing yards, and single season records in both categories.\n\n4 Pro Bowl selections and a First Team All Pro selection in 2010 solidifies him as a top RB in this league. Though slowed by injuries, and future looking bleak, Foster is still a tremendous player.\n\nAug 25, 2016; Seattle, WA, USA; Dallas Cowboys quarterback Tony Romo (9) comes out of the tunnel for pre game warmups against the Seattle Seahawks at CenturyLink Field. Mandatory Credit: Joe Nicholson-USA TODAY Sports\n\n#1 Tony Romo – QB – Dallas Cowboys\n\nThe number one undrafted player to make a significant impact on his team is the one and only, Tony Romo. Tony was an amazing college quarterback at Eastern Illinois University, earning All-American honors from 2000-2002.\n\nHowever, the small school stud went undrafted in 2003, and signed with the Dallas Cowboys following the NFL Draft. Romo started as the 3rd String QB, and had some scares throughout his first 2 seasons, almost getting cut and traded a couple of times.\n\nBut against all odds, Romo earned a starting position from Drew Bledsoe midway through the 2006 season, and boy did he do something with that. He finished the season by leading the Cowboys into the playoffs, in which they lost to the Seahawks in rather unfortunate fashion…(we’ll leave the details out)\n\nWant your voice heard? Join the With the First Pick team!\n\nIn 2007, Romo was named the starting Quarterback outright, and led the Cowboys to the playoffs once again. Romo has been the starting QB for the Cowboys ever since…when healthy. For the last 10 years, Romo has been considered one of the elite Quarterbacks in the NFL.\n\nRomo has been selected to 4 Pro Bowls, and has amazing career stats. He has passed for 34,154 yards, 247 touchdowns to 117 interceptions with a 65.3% completion record. His career QBR is 97.1 which ranks 3rd all time.\n\nTony Romo gets a lot of negative attention for his play in the playoffs, but it can’t be argued that he has been a great quarterback for the Dallas Cowboys over the last decade. And in doing so, earns my number one spot in this list.\n\nMore from With the First Pick\n\nThis article originally appeared on\n\nshare"}, {"url": "https://www.footballoutsiders.com/stat-analysis/2017/history-undrafted-nfl-quarterbacks", "page_content": "by Scott Kacsmar\n\nWhere will Tony Romo play in the 2017 NFL season? That remains one of the most intriguing questions between now and April's draft. The fact that Romo is still a story at all 14 years after he went undrafted out of Eastern Illinois is an incredible fact in itself. Whether or not Romo returns for a 15th season, he is already one of the greatest undrafted quarterbacks in NFL history.\n\nEarlier this week, we looked at all drafted quarterbacks since 1994. We found that you can count on one hand the total number of successful starters from Rounds 5, 6, and 7. In the same time frame, is one hand sufficient to count the undrafted quarterback successes as well?\n\nThe 1994 undrafted class was a stellar one led by Hall of Famer Kurt Warner and four-time Pro Bowler Jeff Garcia, two quarterbacks who began to make their mark in the NFL's 1999 season. Including Romo, that gives us three bona fide franchise players. Otherwise, we are left with Jake Delhomme's unexpected run in Carolina, Jay Fielder's Miami mediocrity, and the hollow volume of Jon Kitna's career. Even if we lower our standards, that is still just six names from the last 23 years.\n\nSix players out of how many who tried to do this job? We cannot answer that definitively, but we can ballpark it after looking into a recent season's quarterback market. However, we are first going to take a historical look at the most notable and prolific undrafted quarterbacks in NFL history. Some changes in professional football in recent decades may help to explain why a quarterback like Romo is such a rare case, and why the NFL has not come close to finding another gem like him.\n\n\n\nDiamonds in the Rough: The NFL's Best Undrafted Quarterbacks\n\nOpportunities are scarce for undrafted quarterbacks to play in the NFL. When those players do get into a regular-season game, that opportunity is often short lived. For one, their performance is usually not up to par. Furthermore, there is often no obligation from the team to keep playing that player. There was no draft pick used to acquire him, and he is likely earning a minimum salary. There are always other options with experience to target at quarterback.\n\nSure, fans may recall some of the bad undrafted quarterbacks who played briefly. For example, some fans may debate whether Caleb Hanie (Bears) or Tyler Palko (Chiefs) was worse in the 2011 season. (Our numbers say Hanie.) However, leaving a positive mark as an undrafted quarterback is one of the hardest things to do in the NFL.\n\nFor the few that have, many of their stories are no different from other notable players, or even from those of people in regular jobs who had to catch a break to get ahead in their careers. Sometimes it comes down to who you know, or being in the right place at the right time. Instead of Kurt Warner, would Trent Green be a two-time MVP and going into the Hall of Fame this summer if his knee had not been ruined in the 1999 preseason? We champion Tom Brady and Tony Romo as this era's greatest finds, but would either have ever started a game if Drew Bledsoe just avoided injury in 2001 with New England and played at a competent level in 2006 with Dallas?\n\nWhile high draft picks will often get pushed onto the field, something unusual typically needs to happen for undrafted players to get their shot. They rose to fame only after an injury to another player. They had a previous connection with a coach who wanted to give them an opportunity. One minority player had to leave this country to excel in another league before he was able to embark on a Hall of Fame career in the NFL. These stories are all worth reviewing to see how players fell through the draft process, and why that may have never happened in today's league.\n\nThe NFL has existed since 1920, but only 36 quarterbacks have thrown at least 500 passes after not being drafted. Why use 500 as the cutoff? Aside from being a nice, round number, today's offenses tend to throw the ball at least 500 times in a season. In fact, over 75 percent of all NFL teams have attempted 500-plus passes since 1994, and that percentage is only rising. In 2016, all but four teams hit 500 attempts, and every team would ideally like to accomplish that feat with one reliable quarterback.\n\nThe following table shows all 36 of those quarterbacks, sorted by descending attempts, and including the year they went undrafted, as well as any information about other professional leagues they may have been associated with.\n\nNFL's Undrafted Quarterbacks with 500+ Pass Attempts Player Undrafted GP GS Cmp Att Cmp% Yds YPA TD INT PR Other League(s) Warren Moon 1978 208 203 3,988 6,823 58.5 49,325 7.23 291 233 80.9 CFL (1978-1983) Dave Krieg 1980 213 175 3,105 5,311 58.5 38,147 7.18 261 199 81.5\n\nJim Hart 1966 201 180 2,593 5,076 51.1 34,665 6.83 209 247 66.6\n\nJon Kitna 1996 141 124 2,677 4,442 60.3 29,745 6.70 169 165 77.4 NFLE (1997) Tony Romo 2003 156 127 2,829 4,335 65.3 34,183 7.89 248 117 97.1\n\nKurt Warner 1994 124 116 2,666 4,070 65.5 32,344 7.95 208 128 93.7 AFL (1995-97), NFLE (1998) Jeff Garcia 1994 125 116 2,264 3,676 61.6 25,537 6.95 161 83 87.5 CFL (1994-98) Jim Zorn 1975 140 106 1,669 3,149 53.0 21,115 6.71 111 141 67.3\n\nBobby Hebert 1983 118 100 1,839 3,121 58.9 21,683 6.95 135 124 78.0 USFL (1983-85) Jake Delhomme 1997 103 96 1,741 2,932 59.4 20,975 7.15 126 101 81.3 NFLE (1998-99) Mike Tomczak 1985 185 73 1,248 2,337 53.4 16,079 6.88 88 106 68.9\n\nErik Kramer 1987 83 67 1,317 2,299 57.3 15,337 6.67 92 79 76.6 CFL (1988-1990) Gary Danielson 1973 101 60 1,105 1,932 57.2 13,764 7.12 81 78 76.6 WFL (1974-75) Jay Fiedler 1994 76 60 1,008 1,717 58.7 11,844 6.90 69 66 77.1 NFLE (1997) Tom Flores 1958 106 68 838 1,715 48.9 11,959 6.97 93 92 67.6 CFL (1958) Tommy Thompson 1940 99 46 732 1,424 51.4 10,385 7.29 91 103 66.5\n\nShaun Hill 2002 49 35 757 1,225 61.8 8,295 6.77 49 30 84.9 NFLE (2003) Brian Hoyer 2009 49 31 714 1,199 59.6 8,608 7.18 44 26 84.8\n\nPlayer Undrafted GP GS Cmp Att Cmp% Yds YPA TD INT PR Other League(s) Gary Cuozzo 1963 82 40 584 1,182 49.4 7,402 6.26 43 55 62.1\n\nArnie Herber 1930 129 56 481 1,175 40.9 8,041 6.84 81 106 50.1\n\nDamon Huard 1996 64 27 574 946 60.7 6,303 6.66 33 26 80.6 NFLE (1998) Jeff Kemp 1981 96 29 479 916 52.3 6,230 6.8 39 40 70.0\n\nJoe Pisarcik 1974 61 30 425 898 47.3 5,552 6.18 24 48 53.9 CFL (1974-76) Kelly Holcomb 1995 37 24 565 893 63.3 5,916 6.62 39 38 79.2 NFLE (1996) Matt Moore 2007 46 28 508 856 59.4 6,077 7.1 41 31 82.0\n\nShane Matthews 1993 31 22 492 839 58.6 4,756 5.67 31 24 75.0\n\nCase Keenum 2012 26 24 454 777 58.4 5,224 6.72 24 20 78.4\n\nDavid Archer 1984 55 23 336 661 50.8 4,337 6.56 18 30 61.9\n\nKent Nix 1966 46 18 301 652 46.2 3,644 5.59 23 49 44.3\n\nEd Danowski 1934 71 40 309 637 48.5 3,817 5.99 37 44 58.1\n\nAnthony Wright 1999 31 19 332 605 54.9 3,590 5.93 20 25 66.3\n\nSean Salisbury 1986 40 12 318 577 55.1 3,824 6.63 19 19 72.9 CFL (1988-1989) Billy Volek 2000 39 10 337 561 60.1 3,754 6.69 27 15 84.9\n\nJohn McCormick 1962 51 15 214 555 38.6 2,895 5.22 17 38 37.6\n\nJamie Martin 1993 53 8 355 541 65.6 3,814 7.05 20 21 82.3 NFLE (1995) Doug Pederson 1991 100 17 286 522 54.8 2,762 5.29 12 19 62.3 WLAF (1992)\n\n1920-1959: The Old Days\n\nThe beginning of professional football can be characterized by a lack of passing, and for that matter, a lack of statistics of any kind. It was not until the 1932 season that stats were kept for things like pass attempts, so naturally Arnie Herber (1930) and Ed Danowski (1934) are the only players listed who played prior to World War II. Calling them undrafted is a bit inaccurate given that no player was drafted in this time. The first NFL draft was not until 1936.\n\nThe only other player from this golden era to crack 500 attempts was Tommy Thompson. If you have ever studied old quarterbacks, then you will know that Thompson had some prolific numbers on Philadelphia teams that played in the NFL Championship Game three years in a row from 1947 to 1949, winning twice. It's a good thing for Eagles fans that the Steelers ditched Thompson after his rookie year in 1940.\n\nEventually, Johnny Unitas came along and changed the way the quarterback position was viewed in the NFL, but almost every prolific quarterback from the league's first four decades was drafted.\n\n1960-1970: The Common Draft and the Merger\n\nBy 1960, the AFL was underway with eight new teams, meaning more job opportunities for players who may not have cut it in the NFL. One of those players was Tom Flores. While he may be best known for coaching the Raiders to two Super Bowl wins in the 1980s, Flores was one of the best early passers in the AFL. He first spent some time in the Canadian Football League (CFL) in 1958 before getting a camp tryout with the Redskins in 1959. But it was with the Raiders where he became pro football's first Hispanic starting quarterback.\n\nFlores took advantage of the AFL's need for players in its inaugural season of 1960. The first AFL draft took place in 1961, so with both leagues having drafts, it was again very difficult for an undrafted player to break into pro football. There were 520 total selections made in the 1961 drafts for the NFL and AFL. While some players were drafted in both leagues, that was still an excessive amount of rookies to fill 22 total pro football rosters. Imagine being deemed not good enough to be among those 520 choices. John McCormick was the only other real NFL-AFL transplant on our list, and he was originally a punter with the Vikings in 1962 before starting at quarterback with the Broncos. Kent Nix never got past Green Bay's \"taxi squad\" in his first NFL attempt, but eventually started some games for the Steelers.\n\nGary Cuozzo will always live on in Colts lore for what he did in his first NFL start, subbing for Johnny Unitas. Cuozzo threw five touchdown passes against the Vikings in 1965.\n\nThe 36 quarterbacks studied averaged 62 starts in their career, with potentially more to come from the active players. Only a couple of those quarterbacks played more than Jim Hart, who started 180 games and threw 5,069 passes for the St. Louis Cardinals. None of it may have happened had Don Shroyer not invited Hart to a tryout with the team. Shroyer was Hart's coach at Southern Illinois, and had taken a job as an assistant with the Cardinals in 1966. Hart made the team and ended up taking over as the starter in 1967 after Charley Johnson had to fulfill an ROTC commitment. Hart was closer to a Drew Bledsoe or Kerry Collins in his era than a star, but he did make the Pro Bowl four years in a row from 1974 to 77. This makes him one of the top undrafted quarterbacks to ever play the game.\n\nIn 1967, the NFL and AFL agreed to a common draft that took place in each of the next three years. There were still 17 rounds and in excess of 440 players drafted each year, but the leagues were no longer fighting over the rights of the same players. In 1970, the NFL and AFL merged together, creating a league close to what we know today.\n\n1971-1982: Would You Prefer Canada or Seattle?\n\nSome businessmen saw football's rising popularity as an opportunity to challenge the NFL with their own league. The World Football League started in 1974 before folding during its 1975 season. Gary Danielson was a member of that league before he turned in a decent career with the Detroit Lions. Joe Pisarcik took his talent to Canada for a few years before winding up with the Giants, where he infamously botched a sure win with the Miracle at the Meadowlands play in 1978.\n\nBy the middle of the decade, the NFL continued to expand with the addition of the Tampa Bay Buccaneers and Seattle Seahawks in 1976. Seattle put itself on the map early by finding the quarterback-receiver duo of Jim Zorn and Steve Largent. Zorn went undrafted in 1975, failing to make the final roster cut with the Dallas Cowboys. The Seahawks picked him up and he led the league in pass attempts in 1976, starting all 14 games. The Seahawks found even better success when they added the undrafted Dave Krieg to be the third-string quarterback in 1980. Krieg eventually took over for Zorn and enhanced the passing success with Largent while the team began to make the playoffs.\n\nWarren Moon and Jeff Kemp also eventually played for Seattle in their careers, but their origin stories are much different. Kemp was the son of Jack Kemp, a successful AFL quarterback and politician. He was an Ivy League kid from Dartmouth who found a spot on the taxi spot of his hometown Los Angeles Rams in 1981. (Although his dad represented upstate New York in congress, Kemp grew up in Orange County.) He worked his way up to third on the depth chart in 1982, then second in 1983, and first when Vince Ferragamo was hurt three games into the 1984 season.\n\nMoon was MVP of the 1978 Rose Bowl for Washington, but was unable to break the racial barrier and stigma against black quarterbacks at the time. Undrafted, Moon went to the CFL, where he led Edmonton to five Grey Cups in five seasons. Only then did the NFL come calling, and the Houston Oilers, coached by Moon's CFL coach Hugh Campbell, won the bidding war for his services. The rest is history and Moon has a bust in the Pro Football Hall of Fame, throwing for 70,553 combined yards in the CFL and NFL.\n\nMoon went undrafted in 1978 even though Doug Williams actually was drafted in the first round that year, 17th overall by Tampa Bay. He eventually became the first black quarterback to win a Super Bowl, but was never the type of consistent passer that Moon was. Since then, black quarterbacks have often been selected in the first round, including four times as the No. 1 overall pick (Michael Vick, JaMarcus Russell, Cam Newton, and Jameis Winston). A prospect like Moon in today's NFL likely would have been drafted without hesitation, but there was a different climate in 1978.\n\n1983-2002: There Are Other Options\n\nJust prior to Moon's NFL arrival, there was a much more glamorous attempt at a rival league known as the USFL. They were able to bring in some big-name passers such as Jim Kelly and Steve Young, but Bobby Hebert is actually the USFL's all-time passing yardage leader. He led the Michigan Panthers to the championship in 1983, and almost pulled off another title in 1985. Hebert went to the downtrodden Saints in the fall of 1985, and by 1987 he was the starting quarterback for the team's first ever winning season and playoff berth. The rival Falcons tried the undrafted starting quarterback approach as well with David Archer in 1985 and 1986, but that was unsuccessful. Archer lacked the previous pedigree Hebert had shown in the USFL where the level of competition was significant.\n\nGoing to a quarterback-needy team is always a wise move for an undrafted quarterback. Mike Tomczak was basically a game manager at Ohio State when he went undrafted in 1985, but he won a Super Bowl ring with the legendary 1985 Bears. Jim McMahon was often injured as Chicago's main quarterback, and in 1986, Tomczak actually led the team in quarterback starts with seven. He was one of four quarterbacks to start for that Chicago team, which still went 14-2 before falling short in the playoffs with Doug Flutie (who would go on to become another CFL success) under center. Tomczak fell out of favor in Chicago and later tried to revive his game manager role with Bill Cowher's Steelers in 1996, a playoff season that also ended in disappointment.\n\nWe recently covered the 1987 season in DVOA on this site. The three weeks of replacement games with \"scab\" players arguably led to two more careers of significance from undrafted quarterbacks. Sean Salisbury went undrafted in 1986, but Seattle (yes, again) gave him a shot. He signed with the Colts during the strike in 1987 and stuck around through the playoffs where he even got to throw six passes, completing one to his team and one to the opponent. Salisbury went to the CFL for some more seasoning in 1988 and 1989, but returned to the NFL with the Vikings in 1990. He even started a playoff game for the 1992 Vikings, but again played terribly. In fact, in four playoff games, Salisbury completed 14-of-44 passes for 234 yards and three interceptions. He would rank high on the list of most improbable quarterbacks to start a playoff game.\n\n[ad placeholder 3]\n\nErik Kramer had a much better career than Salisbury, but he too caught a break with the 1987 strike when he joined the Falcons. He started two of those replacement games, and in his final appearance, he threw for 335 yards and three touchdowns, leading a 13-point comeback in the fourth quarter. Kramer spent three years in the CFL before returning to the NFL to replace an injured Rodney Peete for the 1991 Lions. He started Detroit's 38-6 playoff win over Dallas, throwing for 341 yards and three scores in what is still the most recent Detroit playoff win. Kramer eventually wound up in Chicago -- I even own that jersey for reasons that cannot be explained -- where he had a stellar 1995 season, leading all quarterbacks in DYAR. The Bears were also grooming Shane Matthews, who eventually helped lead two highly improbable comebacks in back-to-back weeks in the 2001 season.\n\nDoug Pederson is known mostly for being Brett Favre's backup in Green Bay and the current head coach of the Eagles, but mentor Andy Reid liked him enough to give him nine starts in 1999 after the team drafted Donovan McNabb No. 2 overall. Pederson also got eight starts in Cleveland in 2000, and the Browns had drafted Tim Couch first overall in 1999. So if Couch and McNabb had been Week 1 rookie starters, as is now so often the case for top picks, Pederson likely never would have cracked 500 attempts. Pederson first got a tryout with Don Shula's Dolphins back in 1991, but also spent time in 1992 in something called the World League of American Football.\n\nDoes that even ring a bell? The World League of American Football eventually rebranded itself as NFL Europe, a developmental league that helped engineer some of the league's best rags-to-riches stories in the late 1990s and early 2000s. Jamie Martin, Kurt Warner, Jay Fiedler, Kelly Holcomb, Jon Kitna, Jake Delhomme and Damon Huard all spent time in NFL Europe, earning some extra seasoning before getting a real shot at NFL action. Most of those players even found themselves in postseason action, or in Huard's case, owner of the lowest single-season interception rate ever for the 2006 Chiefs.\n\nBetween Salisbury in 1986 and Huard in 1997, 11 of the 12 undrafted quarterbacks to get 500 career attempts first gained experience in an alternative league. This is undeniably a huge part of the success for these players, who often excelled in those other leagues against lesser competition.\n\nNo one had more success than Warner, a 1994 camp arm with the Packers. He went on to be a very prolific Arena Football League quarterback from 1995 to 97. At about the same time, Jeff Garcia was very productive in the CFL from 1994 to 1998, leading a game-winning drive in the 1998 Grey Cup before finally getting a shot with the 49ers at age 29. A career-ending injury to Hall of Famer Steve Young paved the way for Garcia to take over for the next five seasons in San Francisco. Delhomme was actually Warner's backup in Europe, and he went back for another stint with the Frankfurt Galaxy, helping lead that team to a title. He almost pulled off a Super Bowl upset of the Patriots with Carolina in 2003. Kitna led the Barcelona Dragons to a championship win in 1997, earning game MVP honors. Two years later he was in the playoffs with Seattle against Dan Marino and the Dolphins.\n\nThis was a great time for unheralded quarterbacks to show their worth in other ways before NFL teams were comfortable enough to put them on the field. Add in some high-profile injuries and a lot of turnover with so many Hall of Fame quarterbacks retiring, and that is how that late '90s and early '00s period featured quarterbacks from grocery stores and the Amsterdam Admirals. Even Tommy Maddox, a former first-round bust, came back to the spotlight with Pittsburgh in 2002 after shining in Vince McMahon's ill-fated XFL venture.\n\nA few more undrafted quarterbacks did catch on after Warner's stunning success for the 1999 Rams. Billy Volek went undrafted in 2000, but who can forget his success with the Titans in 2004 when a Jeff Fisher-coached team decided to throw the ball all over the field? Volek also came off the bench to help the Chargers to a playoff win over the Colts in the 2007 divisional round.\n\nShaun Hill led NFL Europe in passing yards in 2003, and at times had superior passing stats in the NFL to No. 1 picks Alex Smith and Sam Bradford, two of his teammates along his various stops in the league. I resigned as president of the Shaun Hill Fan Club last season, but still believe he is one of the best backup quarterbacks, undrafted or otherwise, of his era. Is it any surprise that he was able to stand out in NFL Europe? He really is the last notable NFL player to do so at quarterback.\n\n2003-2006: Dallas Strikes It Big\n\nNFL Europe, later changed to NFL Europa, actually continued to exist through the 2007 season. However, the success stories dried up once teams returned to conventional methods to find starting quarterbacks. In the 1999 draft, five quarterbacks were selected in the first 12 picks, still a record to this day. The 2004 draft was also a pivotal one, bringing Eli Manning, Philip Rivers, Ben Roethlisberger, and even Matt Schaub into the league. In that same year, one in which illegal contact was famously reinforced, Carson Palmer rose from the bench in Cincinnati after a redshirt rookie season, and Drew Brees finally broke out in San Diego. The NFL was moving towards a pass-happy game controlled by highly skilled franchise quarterbacks.\n\nTeams also eventually wised up on how many quarterbacks an active roster should carry, which limited the number of jobs available to undrafted quarterbacks. For instance, the Steelers kept Anthony Wright as their fourth-string quarterback in 1999, a move very unlikely to happen in today's NFL. The Jets kept four quarterbacks last season, but that was the result of paying Ryan Fitzpatrick and carrying three recent high draft picks. For the second time this week, we are left wondering why the Jets drafted Christian Hackenberg in the second round.\n\nSometimes, it pays to keep a quarterback around if your team believes in him. The Cowboys had their faith in Tony Romo pay huge dividends. Bill Parcells was the coach at the time, but assistant head coach Sean Payton is credited for the main support in Romo, a talented quarterback out of Eastern Illinois who did attend the combine.\n\nRomo was a third-string quarterback in 2003, and might have lost his spot a year later had it not been for Quincy Carter's release following a substance abuse allegation. Romo was the holder in 2004 and 2005, making 22 game appearances that way, but never threw a pass until 2006, when Parcells had seen enough of Drew Bledsoe's sloppy play. While coach of the New York Giants, Parcells once kept Jeff Hostetler around for five years before he even threw his first regular-season pass. Hostetler's frustration had him contemplating retirement, but he eventually had his moment of glory in 1990 when Phil Simms was injured and Hostetler helped the Giants to a Super Bowl win. Romo's story never hit that point in Dallas, but he helped keep the team competitive and relevant again for a decade before his own injury paved the way for Dak Prescott, the fourth-round stud in the first part of this week's study.\n\nRomo never had any seasoning in another league, but he always had that unique talent of improvising plays when things broke down. He took advantage of Dallas' patience with him, which is something few high draft picks are afforded in today's NFL. Romo shined in preseasons, which are really the best shot for these quarterbacks to put something on tape, and he continued to elevate himself in the organization the right way.\n\n\n\nHad Romo played for another team besides the overexposed Dallas Cowboys, his reputation would likely be a lot different today. He would be lauded more as the successful rags-to-riches story he is instead of being continuously criticized for the shortcomings of his team. The exposure that comes with playing for Dallas can be problematic in this regard. For as quick as Romo was built up to legend status -- let's say by Thanksgiving 2006 -- he was even more quickly branded a choker -- obviously after one fateful botched hold in a playoff game in Seattle.\n\nWhile Romo lacks Moon's volume and Warner's playoff success, he is a similar caliber of player. The fact that he happened to break through at a time in the NFL when teams turned so strongly to the top of the draft to find a franchise quarterback is all the more remarkable. Instead of pointing out the things that Romo did not do in Dallas, we should be asking why teams can't find another Romo. Has the draft process really gotten that good?\n\n2007-2016: The Drought\n\nOne thing is for sure: the NFL has had almost no challengers since the XFL disaster. The United Football League (UFL) ran from 2009 through 2012, but really attracted more NFL has-beens than it created polished starters. With teams looking to the draft for starters and veterans, and many teams only carrying two quarterbacks on the active roster, the jobs for undrafted quarterbacks are increasingly sparse. This is why we only have three players listed from the post-Romo decade, and they may be more likely to elicit groans from fans than adulation.\n\nAfter the success of Romo, Dallas almost immediately landed another undrafted standout to back him up in 2007. The Cowboys had Matt Moore in the preseason, but he did not survive the final roster cuts. The Panthers were interested, and Moore lucked out when Jake Delhomme was injured early in the season and the team went through David Carr and a 44-year-old Vinny Testaverde before Moore started three games. Moore took over for a broken Delhomme in 2009, but ended up in Miami in 2011 where he got a shot after Chad Henne was injured. Moore was team MVP that year, but the Dolphins still drafted Ryan Tannehill in 2012 in the first round. We had barely seen Moore play in that time, but an injury to Tannehill last December led to another starting opportunity for Moore, including the team's wild-card playoff loss in Pittsburgh. He remains one of the few competent backups in the league.\n\n[ad placeholder 4]\n\nThen we have the interesting case of Brian Hoyer, who turned in a poor senior season at Michigan State before going undrafted in 2009. The Patriots, fresh from trading Matt Cassel to Kansas City, added Hoyer and made him Tom Brady's sole backup that season, a risky move considering Brady's return from a torn ACL. Hoyer sparingly played in New England, but showed enough in his opportunities to hang around the league. He also made a good contact in offensive coordinator Bill O'Brien, who would later add him to his Houston quarterback carousel in 2015, even starting a playoff game that went horribly wrong against the Chiefs. Hoyer and his agent have been brilliant at landing him jobs on quarterback-needy teams, such as the pre-Bruce Arians Cardinals, the Browns, Texans, Bears, and now the 49ers. Hoyer's connection with Kyle Shanahan in Cleveland surely helped bring him to San Francisco, where he could be the Week 1 starter. He's a bridge quarterback at best, but teams can do worse than Hoyer.\n\nFinally, there is Case Keenum. If you followed his college career, which felt like it lasted an eternity, then you know he was another insanely productive system quarterback for the University of Houston's run-and-shoot offense. The NFL has all but blackballed these quarterbacks after the draft busts of Andre Ware and David Klingler many years ago. Keenum had three seasons in college where he threw for at least 5,000 yards and 44 touchdown passes. He didn't even get drafted like similar Hawaii quarterback Colt Brennan (sixth round, 2008) did, but Keenum always felt like he had a better chance at success than a lot of the system quarterbacks. You can say that he's proven that too. In 24 NFL starts, he has rarely been good, but he has usually kept some bad teams competitive at least.\n\nKeenum is also fortunate that Matt Schaub's career completely imploded in 2013 for the Texans, and that only the Rams would trade a fortune to draft Jared Goff No. 1 and keep him on the bench. Keenum did outplay Goff last year, but that wasn't very hard to do given Goff's performance when he did take over in Week 11. Keenum is now a backup again, but at least big-time college football's all-time leader in passing yards (19,217) can say he has had a relevant NFL career.\n\nNo one is waiting with bated breath to see if Austin Davis, Kellen Moore, or Scott Tolzien can cross the 500-attempt barrier as undrafted quarterbacks, but those are some of the better options in the last few years. Moore had a prolific college career too at Boise State, and threw for 435 yards in his second NFL start with Dallas in 2015. Arm strength was always the concern with Moore, just as there is often a significant physical deficiency that causes a quarterback to go undrafted.\n\nDrafted late or not drafted at all, just getting an opportunity to play is very difficult for an unheralded quarterback. While most positions can contribute in non-starting roles, the quarterback is a singular leader each week. When teams want to put their very best at the most important position, it is too difficult to sell that a guy who was deemed not good enough to go in the 250-plus picks in his draft is now good enough to lead one of the 32 teams.\n\nThe few capable of pulling that job off are truly among the rarest gems to ever play this game.\n\nA Typical Year of Undrafted Quarterbacks\n\nSince 1994, 11.8 quarterbacks have been drafted each year on average in a seven-round draft. There are 32 teams in the league now, and we can count on the number of undrafted quarterbacks to be greater than that each year. Teams need third-string quarterbacks, preseason prospects, or even just camp arms. A lot of these players get signed right after the draft ends, but very few every go on to make final rosters.\n\nWhen we say that Tony Romo has been the singular smashing success in nearly 20 years, what does the denominator look like in that success rate? Is it out of 300 or 400? We can't answer that with great accuracy, but we wanted to take a look at a typical year for the plight of the undrafted quarterback in today's NFL.\n\nWe chose the 2013 season in particular to study. Why 2013? It is recent, and there is plenty of information available about it online. Also, it was one pretty bad quarterback draft. We touched on this in the round-by-round study earlier this week, as quarterbacks once expected to go really high ended up falling to the fourth round. EJ Manuel was the first quarterback off the board to Buffalo, and he only went 16th. When a draft doesn't have a quarterback go in the top 10, that usually means trouble for that quarterback and that class of quarterbacks.\n\nOur attempt at getting a rough estimate of how many undrafted quarterbacks were vying for success in 2013 included several sources. For one, there are the player rankings provided by NFLDraftScout.com to CBS Sports. The 2013 page had 111 quarterbacks listed, 81 ranked, and 10 ultimately drafted into the NFL (11 including B.J. Daniels, who was later converted to wide receiver). Obviously the remaining 100 players did not all venture into NFL locker rooms at any point, but some did.\n\nWe made use of Spotrac's transactions search to find every quarterback who was involved in a transaction for the 2013 season. Out of 106 unique names, 43 were undrafted players, including 21 undrafted rookies for 2013. This is why I suggested up to 400 for the Romo success denominator -- if there are usually 20 new undrafted quarterbacks each year, then 19 drafts since 1998 would represent about 380 players.\n\nNonetheless, some of these players stick around for several years, even if they're not making much of a mark. In 2013, Graham Harrell and John Parker Wilson were still trying to hang on to NFL jobs in the preseason. Both had gone undrafted in 2009, having made a name for themselves in college in very different fashions. Parker Wilson was a \"bus driver\" type of quarterback for a loaded Alabama team, while Harrell was constantly throwing the ball in Texas Tech's Air Raid offense with Michael Crabtree. Harrell ended up throwing four passes in the regular season while Wilson never made a regular-season appearance. Yet in their fifth seasons since going undrafted, both were still hanging on to hope somewhere in August.\n\nThis does help to show that the rookie season is not the end for these players, but success is still so rare even after a handful of attempts. I also looked at all quarterback passing stats for the 2013 preseason from NFL.com, which included 101 players. Only 23 of those players who accumulated statistics were undrafted quarterbacks, including a few of our notable players such as Romo, Hoyer, Moore, Keenum, and Hill.\n\nPulling our sources together, I created a table of 47 undrafted quarterbacks who tried to hold employment in the NFL during the 2013 season. Players who actually appeared in a meaningful game are highlighted in color below. The players are listed under their undrafted year.\n\n2013 NFL Season: Undrafted Quarterback Market 2013 2012 2011 1996-2010 Alex Carder Aaron Corp Adam Weber Jon Kitna (1996) Caleb TerBush Alex Tanney Jerrod Johnson Shaun Hill (2002) Clay Belton Austin Davis Josh Portis Tony Romo (2003) Colby Cameron Case Keenum McLeod Bethel-Thompson Matt Moore (2007) Collin Klein Dominique Davis Pat Devlin Caleb Hanie (2008) Dalton Williams G.J. Kinne Scott Tolzien Brian Hoyer (2009) Dayne Crist Kellen Moore Chase Daniel (2009) James Vandenberg Matt Blanchard Graham Harrell (2009) Jeff Tuel Matt Simms John Parker Wilson (2009) Jordan Rogers Nick Stephens Thad Lewis (2010) Kyle Padron Matt Brown Matt McGloin Matt Scott Mike Hermann Nate Stanley Ryan Griffin Ryan Katz Seth Doege Tim Jenkins Tyler Bray Players highlighted in color played in a game in the 2013 regular season or postseason.\n\nOnly Matt McGloin (Raiders) and Jeff Tuel (Bills) were able to break through as rookies. None of the other 2013 rookies have amounted to anything in the NFL heading into the 2017 season. Only McGloin, Tyler Bray, and Ryan Griffin are still in the league. The arrival of Manuel in Oakland makes McGloin the fourth-stringer, so that won't last long. Bray and Griffin have always been third-stringers but are now second on the depth chart in Kansas City and Tampa Bay, respectively, because of the departure of Nick Foles and Mike Glennon.\n\nOnly 12 of the players, or just over a quarter of the table, appeared in a game in 2013. Half of those are the veterans you would expect to be active. Kitna did not play that season, but he actually came out of retirement to join the Cowboys in Week 17 after a Romo injury prompted Kyle Orton to start the season finale against the Eagles. Dallas lost and missed the playoffs that night. On a similar note, Scott Tolzien likely would not have seen any action in Green Bay in 2013 had Aaron Rodgers not broken his collarbone in the middle of the season.\n\nSome of these quarterbacks will continue to be recycled in preseason rosters for years to come. Jerrod Johnson, who had a standout season at Texas A&M in 2009, went undrafted in 2011, and he was still on the Cowboys roster for a couple of days this past September. Clearly, he's no Romo or Prescott, but NFL talent evaluators have continued to see something to keep giving Johnson opportunities, even if the data says he has really no shot of ever putting it together for a successful career."}, {"url": "https://bleacherreport.com/articles/446249-arizona-state-football-steven-threet-named-2010-starting-quarterback", "page_content": "Arizona State Sun Devils head coach Dennis Erickson has made his decision—and it only took the entire offseason to do it.\n\nAt 12:00 pm Pacific Time, Erickson decided to go with big game experience and consistency in his choosing of Steven Threet as the Sun Devils' starting quarterback for the 2010 college football season.\n\nThe duel between the junior Michigan transfer Threet and sophomore Brock Osweiler continued into fall camp after lackluster performances by both during spring scrimmages and the annual spring game.\n\nIn Coach Erickson's weekly Monday press conference, he stated that the two quarterbacks were very close and have a great deal of similarities, but Threet showed more consistency throughout the fall camp.\n\nErickson furthered that he feels confident that this was a \"good decision\" in starting Threet this Saturday against Portland State, where Osweiler will see playing time as well.\n\nBut just like any position on the team, if a starter does not perform and win football games, he may end up losing his job—which is the case for the quarterback situation as stated by Erickson. If Threet wins football games, he will remain the starter. If not, Osweiler will see a lot more playing time.\n\nWhile spring scrimmages left Sun Devil fans wanting and hoping for more at the quarterback position, fall camp was a different story. Both Threet and Osweiler stepped up their games tremendously, making the starting decision all that more difficult for Erickson and offensive coordinator Noel Mazzone—a very good sign for the Sun Devil offense.\n\nErickson blamed Threet's slow start in the spring on sitting out the 2009 season, per NCAA transfer guidelines, and having a somewhat breakout performance in the fall after getting back into the swing of things.\n\nWhile playing for the Michigan Wolverines, Threet compiled a total of eight starts, including road games against Notre Dame, Penn State, and Ohio State.\n\nExperience has always been a high priority for Dennis Erickson throughout his lengthy career as a Division I head coach, and Threet takes home the gold medal in the category—although Erickson denied this played any part in his decision.\n\nWhile the experience of starting in some of the most hostile Big Ten stadiums is helpful and encouraging, Threet still enters the 2010 season as the fourth most inexperienced starting quarterback in the Pac-10, only ahead of Jeff Tuel of Washington State (five starts), Ryan Katz of Oregon State (zero starts), and Darron Thomas of Oregon (zero starts).\n\nThreet spoke to the Arizona Republic about his slow start in the quarterback race, saying, \"If you want something bad enough, you just keep working at it and do whatever you can to make it happen.\"\n\nHe did just that."}, {"url": "https://operations.nfl.com/journey-to-the-nfl/undrafted-to-nfl-starter/", "page_content": "Stephen Bowen – Undrafted to NFL Starter\n\nStephen Bowen played defensive end for the Dallas Cowboys, Washington Commanders and New York Jets during his 10-year NFL career. Bowen excelled at both football and basketball in high school before focusing on football at Long Island’s Hofstra University.\n\nThe odds of making it to the NFL are already a long shot. And the odds of making the NFL from a National Collegiate Athletic Association (NCAA) Division I, Football Championship Subdivision (FCS) school are even longer. Most pros are found in Football Bowl Subdivision (FBS) institutions.\n\nAccording to NFL draft data, 254 players were selected in the 2019 NFL Draft — of the 254 players, 238 were from a Division I FBS school while only 11 came from a Division I FCS school. Bowen defied the long odds and earned a roster spot as an undrafted free agent, turning his opportunity into a successful NFL career.\n\nFrom his early college days through his rookie season in the NFL, Bowen recounts what it took to make it to the game’s highest level."}, {"url": "https://www.sportszion.com/undrafted-nfl-players/", "page_content": "The NFL Draft has assumed added importance with each passing year, with teams intent on drafting the best college players into their sides in order to strengthen their rosters.\n\nWhile the Draft consists of the cream of the crop and over 200 world-class players are drafted each year, there are plenty that end up missing the cut due to various reasons.\n\nWhile many of these undrafted players tend to give up on their NFL dreams and pursue other passions, history suggests that had they stuck it out, they could have achieved plenty of success.\n\nAcross the NFL’s history, there have been tons of undrafted players who have gone on to achieve superstardom.\n\nHere, we take a look at the top 10 undrafted players in NFL history:\n\n#10. Lou Groza\n\nPosition: Offensive lineman/kicker\n\nCollege: Ohio State\n\nNFL career: 21 years (1946-67)\n\nTeams: Cleveland Browns\n\nSuper Bowl titles: 0\n\nPro Bowls: 9\n\nAll-Pro Selections: 4\n\nLou Groza was responsible for putting the spotlight on the role of a kicker. After joining the Cleveland Browns in 1946, Groza would go on to play two positions – kicker and offensive tackle – specializing in both.\n\nHe was the greatest kicker to have ever graced the NFL at the time and was nicknamed ‘The Toe’ for his incredible ability to kick field goals from over 50 yards on a regular basis.\n\nGroza made 234/405 field goals during his career as well as 641/657 extra points. He was a four-time NFL champion and nine-time Pro Bowler, even winning the NFL MVP award in 1954.\n\nDespite his death in 2000, Groza will forever remain relevant considering the fact that college football’s best kicker award is named after him.\n\n#9. Willie Wood\n\nPosition: Safety\n\nCollege: Southern California\n\nNFL career: 12 years (1960-71)\n\nTeams: Green Bay Packers\n\nSuper Bowl titles: 2 (1966, 1967)\n\nPro Bowls: 8\n\nAll-Pro Selections: 5\n\nMany teams would regret passing on Willie Wood in the 1960 NFL draft considering the career he would go on to have. After going undrafted, Wood wrote a personal letter to Green Bay head coach Vince Lombardi requesting a tryout.\n\nDespite being a quarterback by nature, he opted for a switch to Safety, which proved to be a masterstroke.\n\nWood would play an integral role in the Packers’ success, ending up with five NFL titles and 2 Super Bowls.\n\nWood made 8 Pro Bowls and was also a five-time All-Pro Selection in his 12 years in the league. He also currently holds the record for the most consecutive starts by a safety in NFL history and at the time of his retirement in 1971, had notched up 699 interception yards on 48 interceptions.\n\nHe was also inducted in into the Hall of Fame in 1989.\n\n#8. Willie Brown\n\nPosition: Cornerback\n\nCollege: Grambling\n\nNFL career: 16 years (1963-78)\n\nTeams: Denver Broncos, Oakland Raiders\n\nSuper Bowl titles: 3\n\nPro Bowls: 9\n\nAll-Pro Selections: 5\n\nAfter being cut by the Houston Oilers in training camp, Willie Brown got his big break when he was picked up by the Denver Broncos.\n\nHe would go on to have a relatively successful career, making nine trips to the Pro Bowl and even winning the Super Bowl in 1976.\n\nIn his 16-year career in the NFL, Brown was a five-time All-Star and racked up 54 interceptions.\n\n#7. John Randle\n\nPosition: Defensive tackle/end\n\nCollege: Texas A&M-Kingsville\n\nNFL career: 14 years (1990-2003)\n\nTeams: Minnesota Vikings, Seattle Seahawks\n\nSuper Bowl titles: 0\n\nPro Bowls: 7\n\nAll-Pro Selections: 6\n\nJohn Randle’s journey to success in the NFL is truly heartwarming. Randle grew up in poverty and had to work odd jobs to make ends meet.\n\nHe began playing football in college and declared for the NFL draft in 1990. After being undrafted, Randle tried out for his brother’s team but was rejected on account of his stature.\n\nHowever, he got a lucky break with the Minnesota Vikings, who picked him up as a free agent. Over the course of the next few years, Randle would develop into one of the best defensive tackles in the league, making seven trips to the Pro Bowl.\n\nRandle also managed double-digit sacks in nine different seasons, including a league-leading 15.5 sacks in 1997.\n\nAside from his on-field displays, Randle was a colorful character not afraid to air his opinions and make his presence felt off the field as well.\n\nAt the time of his retirement in 2003, Randle had racked up 137.5 sacks and 471 tackles, which are phenomenal numbers for a player considered too lightweight to play in the NFL.\n\nHe was inducted into the Hall of Fame in 2010.\n\n#6. Antonio Gates\n\nPosition: Tight end\n\nCollege: Kent State\n\nNFL career: 16 years (2003-present)\n\nTeams: San Diego/Los Angeles Chargers\n\nSuper Bowl titles: 0\n\nPro Bowls: 8\n\nAll-Pro Selections: 3\n\nAntonio Gates, over the course of his 16-year NFL career, has racked up a total of 11,841 receiving yards on 955 receptions as well as 116 receiving touchdowns – not bad for an undrafted free agent.\n\nHowever, things could have been so different early on in Gates’ career. He was initially interested in joining the NBA, but was told his skillset didn’t quite fit into the league at the time.\n\nAs a result, he decided to give the NFL a go and was picked up by the San Diego Chargers. He had a phenomenal rookie season, as he caught 24 passes for 389 yards. He had a great understanding with then-quarterback Drew Brees and developed his game constantly in the following years.\n\nGates would go on to make 8 Pro Bowl appearances and is also a 3-time All-Pro. He racked up a total of five 900-yard seasons and, at the time of writing, Gates ranks sixth in career touchdown receptions, the most among all NFL tight ends of all time.\n\nGates is currently a free agent and is expected to announce his retirement from the sport in the near future.\n\n#5. Adam Vinatieri\n\nPosition: Kicker\n\nCollege: South Dakota State\n\nNFL career: 23 years (1996-present)\n\nTeams: New England Patriots, Indianapolis Colts\n\nSuper Bowl titles: 4 (2001, 2003, 2004, 2006)\n\nPro Bowls: 3\n\nAll-Pro selections: 3\n\nAdam Vinatieri is considered one of the greatest kickers of all time. A four-time Super Bowl winner, Vinatieri made clutch kicks throughout his career, winning numerous games for the New England Patriots and Indianapolis Colts.\n\nHe was picked up by the New England Patriots in 1996 as an undrafted free agent. He remained with the Patriots for 10 seasons, cementing his reputation as one of the most clutch kickers in the league.\n\nVinatieri kicked the winning field goal in two of the three Super Bowls he won with New England. He would go on to sign with the Colts soon after, where he continued to enjoy success.\n\nHe picked up another ring during his time with Indianapolis, becoming the most successful kicker of all time.\n\nVinatieri set a ton of records during his (still ongoing) career, including the most consecutive field goals made, most combined regular-season and postseason games played (397), most career field goals made (599), most career points in NFL history (2,673) and most field goal attempts (715).\n\nHe is also the only kicker in NFL history to have scored more than 1000 points for two different teams.\n\nAt the age of 46, he is still featuring for the Colts and is the oldest player in the NFL. While he has struggled of late, missing a ton of field goals and extra point opportunities this season, his legacy as one of the greatest kickers of all time remains untarnished and he is undoubtedly a future Hall of Famer.\n\n#4. Dick Lane\n\nPosition: Cornerback/defensive end\n\nCollege: Scottsbluff Junior\n\nNFL career: 14 years (1952-65)\n\nTeams: Los Angeles Rams, Chicago Cardinals, Detroit Lions\n\nSuper Bowl titles: 0\n\nPro Bowls: 7\n\nAll-Pro Selections: 3\n\nRichard Lane’s story is one of the most interesting on this list. He was working at the Los Angeles aircraft plant in 1952 when he decided to ask the Rams for a tryout. Impressed by his performance, he was signed up to the roster.\n\nLane broke numerous records during his rookie season. He produced a total of 14 interceptions, a record that stands till date, and also led the league in interception return yards.\n\nLane was known to be a destructive presence on the field and his ferocious tackling forced the NFL to change many of their rules.\n\nOver the course of his career, Lane managed 68 interceptions, 1,207 interception return yards, and five touchdowns on interception, and is considered one of the greatest cornerbacks of all time.\n\nLane was inducted into the Pro Football Hall of Fame in 1974.\n\n#3. Emlen Tunnell\n\nPosition: Safety\n\nCollege: Iowa\n\nNFL career: 14 years (1948-61)\n\nTeams: New York Giants, Green Bay Packers\n\nSuper Bowl titles: 0\n\nPro Bowls: 9\n\nAll-Pro Selections: 4\n\nEmlen Tunnell made history by becoming the first African American to play for the New York Giants. In his rookie season with the Giants, Tunnell put in some wonderful displays, appearing in 10 games and intercepting seven passes.\n\nHe would develop into an elite defender over the course of the next few years and was a four-time All-Pro selection.\n\nHowever, despite his commanding presence on defense, the Giants could never win a Super Bowl during Tunnell’s time at the franchise.\n\nHe moved to the Green Bay Packers soon after but never enjoyed the same success, eventually announcing his retirement in 1962.\n\nTunnell’s 79 interceptions are the second-most in NFL history and he also became the first African American to be inducted into the Hall of Fame.\n\n#2. Warren Moon\n\nPosition: Quarterback\n\nCollege: Washington\n\nNFL career: 17 years (1984-2000)\n\nTeams: Houston Oilers, Minnesota Vikings, Seattle Seahawks, Kansas City Chiefs\n\nSuper Bowl titles: 0\n\nPro Bowls: 9\n\nAll-Pro Selections: 0\n\nDespite an immensely successful college career, Warren Moon went undrafted in the 1978 NFL draft, forcing him to turn to the Canadian Football League for opportunities.\n\nHe enjoyed tremendous success with the Edmonton Eskimos and was picked up by the Houston Oilers in 1984.\n\nDespite a shaky start to life in the NFL, Moon still threw for a franchise-record 3,338 yards in his first season.\n\nOver the course of his 10-year career with the Oilers, Moon would go on to set 37 franchise passing records.\n\nHis success continued in his stints with the Seahawks, Vikings and Chiefs and he twice led the league in passing yards and had four 4,000-yard passing seasons.\n\nMoon is a nine-time Pro Bowler and became the first undrafted quarterback to be inducted into the Hall of Fame.\n\nMoon also had his signature No.1 jersey retired by the Tennessee Titans.\n\n#1. Kurt Warner\n\nPosition: Quarterback\n\nCollege: Northern Iowa\n\nNFL career: 12 years (1998-2009)\n\nTeams: St. Louis Rams, New York Giants, Arizona Cardinals\n\nSuper Bowl titles: 1 (2000)\n\nPro Bowls: 4\n\nAll-Pro Selections: 2\n\nKurt Warner went undrafted in the 1994 NFL draft, but trained with the Green Bay Packers ahead of the new season. However, considering the fact that the Packers’ three quarterbacks at the time were Brett Favre, Mark Brunell, and former Heisman Trophy winner Ty Detmer, Warner never stood a chance of making the squad.\n\nHe was released and forced to stock shelves to make a living. However, he signed with the Arena Football League’s Iowa Barnstormers in 1995 where he went on to make a name for himself.\n\nWarner went on to sign a futures contract with the St. Louis Rams in 1997 but was still only their third-choice quarterback.\n\nHowever, in 1999, following an injury to starting quarterback Trent Green, Warner was thrust into the role and the rest, as they say, is history.\n\nWarner went on to break numerous records that season, throwing for a whopping 4,353 yards with 41 touchdown passes and a completion rate of 65.1%.\n\nHe would lead the Rams to the playoffs and eventually the Super Bowl, where he set more records, throwing for two touchdowns and a then-record 414 passing yards against the Tennessee Titans.\n\nWarner also led the Rams’ game-winning touchdown drive late on and was named Super Bowl MVP for his efforts.\n\nAlthough he would never go on to win another Super Bowl, Warner remains one of the most successful quarterbacks of all time and easily the greatest to have gone undrafted.\n\nHe ended his career with 32,344 passing yards and 208 touchdowns and was inducted into the Pro Football Hall of Fame in 2017."}], "Steven Threet signed with the Pittsburgh Steelers as an undrafted free agent.": [{"url": "https://www.behindthesteelcurtain.com/2023/4/29/23704664/pittsburgh-steelers-2023-undrafted-free-agent-tracker-all-the-signings-and-rumors-news-updates", "page_content": "With the 2023 NFL draft now in the books, the Pittsburgh Steelers will quickly switch their attention to eligible prospects who went undrafted. Long before the seventh-round ended, the Steelers will have reached out to players they were interested in who were expected to be available and it should not take long for the first few signings to be made.\n\nUndrafted players are allowed to sign with whoever they chose, with the more popular names likely to be given a signing bonus to encourage them to pick one team over another.\n\nIt is worth noting that none of these signings are official until confirmed by the team, with players sometimes changing their mind about a destination at the last minute when another team offers a higher signing bonus.\n\nAs rumors begin to emerge of players Pittsburgh is targeting, we will add them in this post, as well as any confirmed signings from the players own social media accounts.\n\nNews and rumors:\n\nThe Pittsburgh Steelers are signing DE David Perales as a UDFA. pic.twitter.com/3sfMKKlOYa — Sidelines - FresnoState (@SSN_FresnoState) April 30, 2023\n\nFormer #Iowa FB Monte Pottebaum is signing with the #Steelers as an undrafted free agent. pic.twitter.com/yJ7Fu2OuYf — Steelers Update (@steelersupdate6) April 30, 2023\n\nFormer Manzano High School and SDSU standout Jordan Byrd is signing a free agent contract with the #Steelers. He joins fellow ABQ native Zach Gentry in Pittsburgh. pic.twitter.com/XqOMbBHRM0 — Brad Benson (@BradBenson7) April 29, 2023\n\nFormer Minnesota QB Tanner Morgan is signing with the #Steelers, per source. — Tom Pelissero (@TomPelissero) April 29, 2023\n\nThe #Steelers will sign former Clemson K B.T. Potter. pic.twitter.com/cEPakUdC9f — Kicker Update (@kickerupdate) April 29, 2023\n\nCongratulations to James Nyamwaya on signing with the Pittsburgh Steelers! #GoMack // #MackTough pic.twitter.com/nWZAm2VGCW — Merrimack Football (@Merrimack_FB) April 30, 2023\n\nSignings:\n\nThe Steelers have announced the official signing of seven UDFAs:"}, {"url": "https://steelerswire.usatoday.com/2023/04/30/pittsburgh-steelers-2023-nfl-draft-udfa/", "page_content": "On Sunday, the Pittsburgh Steelers announced they had agreed to terms with seven undrafted free agents following the 2023 NFL draft. Here is the full list.\n\nWide Receiver/Return Specialist Jordan Byrd – San Diego State\n\nCenter Trevor Downing – Iowa State\n\nQuarterback Tanner Morgan – Minnesota\n\nDefensive End James Nyamwaya – Merrimack\n\nLinebacker David Perales – Fresno State\n\nFullback Monte Pottebaum – Iowa\n\nKicker B.T. Potter – Clemson\n\nOf this group, Byrd, Downing and Morgan all have excellent chances to make the 53-man roster. The addition of Pottebaum is an interesting one as last season’s starting fullback Derek Watt remains unsigned.\n\nThis is a relatively small UDFA group so look for Pittsburgh to add some additional players as the process plays out with rookie camps."}, {"url": "https://www.cbsnews.com/pittsburgh/news/steelers-sign-seven-undrafted-free-agents/", "page_content": "PITTSBURGH (KDKA) - With the 2023 NFL Draft in the rearview mirror, the Steelers this morning announced the signings of seven undrafted free agents.\n\nJordan Byrd, WR, return specialist - San Diego State\n\nIn 58 games, Byrd recorded 47 catches for 219 yards and one touchdown. He also scored three touchdowns on kick returns and one touchdown on a punt return, making him first-team All-Mountain West as both a kick and punt returner, the first Aztec to ever be named first-team at both positions\n\nTrevor Downing, C - Iowa State\n\nDowning became a center in 2022 and started all 12 games. He was second-team All-Big 12 as part of an offensive line that averaged just under 370 yards per game. His first start at Center was in the Cheez-It Bowl against Clemson.\n\nTanner Morgan, QB - Minnesota\n\nMorgan holds several school records at Minnesota including most passing yards in a season with 3,253 in 2019, most touchdown passes with 30 in 2019, and passing yards per game with an average of 250.2 in 2019. Morgan recorded 33 wins with Minnesota, recording 65 touchdowns and just under 9,500 total passing yards.\n\nJames Nyamwaya, DE - Merrimack\n\nNyamwaya played 10 games in the 2022 season and in those 10 games, he recorded 27 tackles, five and a half sacks, a forced fumble, and a fumble recovery. He was second-team All-NEC last year.\n\nDavid Perales, LB - Fresno State\n\nPerales' 22.5 sacks is the sixth-most in Fresno State school history and in 2022, he started 13 games, recording a career-high 11.5 sacks and 16 tackles for a loss.\n\nMonte Pottebaum, FB - Iowa\n\nPottebaum appeared in 45 games for the Hawkeyes across four seasons, starting in 13 of them. Originally a linebacker, he made the switch to fullback in 2019, ultimately recording 20 carries for 82 yards and a touchdown.\n\nB.T. Potter, K - Clemson\n\nPotter holds the record at Clemson for career field goals with 73, PATs with 234, and points for a placekicker with 453. He is the first player in ACC history to have at least 100 points in four seasons. He also scored in every game since becoming the starter in 2019.\n\nYou can see a breakdown of the Steelers' 2023 NFL Draft picks on our draft tracker at this link."}, {"url": "https://www.behindthesteelcurtain.com/2023/4/30/23704678/2023-nfl-draft-steelers-officially-announce-the-signing-of-7-undrafted-free-agents-news", "page_content": "While the Pittsburgh Steelers may have just added seven new players to the roster via the 2023 NFL draft, their work was far from done at the end of the seventh-round. Once the 259th pick was announced, teams got to work in adding players to their 2023 offseason roster.\n\nPittsburgh added another 7 names to their roster once the draft ended, completing the 2023 draft process.\n\nWe have agreed to terms with seven undrafted rookie free agents. — Pittsburgh Steelers (@steelers) April 30, 2023\n\nThe list of UDFAs are:\n\nWide Receiver/Return Specialist Jordan Byrd – San Diego State\n\nCenter Trevor Downing - Iowa State\n\nQuarterback Tanner Morgan – Minnesota\n\nDefensive End James Nyamwaya - Merrimack\n\nLinebacker David Perales – Fresno State\n\nFullback Monte Pottebaum – Iowa\n\nKicker B.T. Potter - Clemson\n\nThe Steelers will also have rookies who are given an invitation to rookie minicamp, but those are not the same as Undrafted Rookie Free Agents (UDFAs). Those players are simply given an invitation to try out, and they often times find their way onto the team’s offseason roster.\n\nEither way, with the NFL Draft officially in the books, and UDFAs already announced, the Steelers now turn their attention to remaining free agents they could possibly sign and getting the team ready to finish up Organized Team Activities (OTAs) and minicamps.\n\nBe sure to stay tuned to BTSC for the latest news and notes surrounding the 2023 Pittsburgh Steelers."}, {"url": "https://steelersdepot.com/2023/04/steelers-announce-signing-of-seven-undrafted-free-agents/", "page_content": "After an unusually long wait, the Pittsburgh Steelers announced their initial 2023 undrafted free agent class. Sunday, the Steelers shared the seven players they have signed.\n\nWide Receiver/Return Specialist Jordan Byrd – San Diego State\n\nCenter Trevor Downing – Iowa State\n\nQuarterback Tanner Morgan – Minnesota\n\nDefensive End James Nyamwaya – Merrimack\n\nLinebacker David Perales – Fresno State\n\nFullback Monte Pottebaum – Iowa\n\nKicker B.T. Potter – Clemson\n\nIt’s a smaller class than what Pittsburgh typically announces and opens the window for potentially other players to be added to the roster in order to hit the 90-man cap. Perhaps the team will sign additional UDFAs, more veterans, or use their remaining spots to open the door for tryout players who participate in rookie minicamp two weeks from now. It’s also uncommon to see the team take this long to announce its class. Usually, it’s done a few hours after the draft.\n\nThe only new name here who wasn’t officially on our UDFA tracker is Iowa State center Trevor Downing, though we saw a report last night that Downing was in talks with the Steelers. Evidently, he chose to continue playing football over his farming career. It doesn’t get much more Iowa than that.\n\nIowa State center Trevor Downing was not selected in the 2023 NFL draft. He and his agent have been talking to the Steelers, Jaguars and Colts about free agent offers. Depending on the offer, he may move forward on one of those, or begin his farming career at home. Up in the air. — Larry Peterson (@larrypeterson) April 29, 2023\n\nDowning started 2021 at guard before moving to center in 2022 for the Cyclones. He’ll compete for a practice squad spot this summer.\n\nMorgan was a big name earlier in his college career, throwing 30 touchdowns for the Gophers in 2019 and at one point was considered a potential first-round pick. But his numbers fell off from there and in 2022, he threw just nine touchdowns with five interceptions. Morgan is cousins with former NFL QB and #1 overall pick Tim Couch, who was taken by the Browns but had a rocky career after Cleveland re-entered the NFL. Couch’s debut came against the Steelers in 1999, a game in which he was promptly picked off. Pittsburgh always carries four quarterbacks to camp so perhaps it will sign another UDFA. They’ll also be inviting at least one to rookie minicamp and could add a veteran arm from the XFL.\n\nByrd didn’t do much on offense in his career but is a dangerous return man with four career touchdowns, three on kicks and one on punts. A small man at 5076, 166 pounds, he only ran a 4.52 at his Aztecs Pro Day but plays faster on tape. He’s listed as a receiver despite catching only 47 passes in college. Last year, he ran the ball 100 times but averaged just only 3.8 yards per carry.\n\nPottebaum was considered one of the draft’s top pure fullbacks and lead blockers. His blonde mullet led the way for the Hawkeyes and in 2021, he carried the ball 15 times. Derek Watt is doubtful to return. That opens the door for a new fullback, though Matt Canada suggested Connor Heyward will assume more of that role in 2023.\n\nNyamwaya is a height/weight/length player from small Merrimack College. At 6’4, 294 pounds with long 34 1/4-inch arms, he had a solid Pro Day workout, running a 5.08 40, with a 35-inch vertical and 9’3″ broad. Last season, he recorded 27 tackles (6.5 for a loss) with 5.5 sacks.\n\nPerales is one of the more notable players on the list. A highly productive player with a good motor, he finished his Bulldogs career with 38 TFL and 23 sacks. Last season, he had 16.5 TFL and 11 sacks. He’s also forced nine fumbles in his career. A JUCO and Sacramento State transfer, he weighed in at 6022, 248 pounds with 32-inch arms at his Pro Day. His 7.04 three-cone suggests some ability to bend the edge.\n\nPotter is the most experienced player in Clemson history, breaking Chris Gardocki’s record for most games played. He hit 75.3% of his career field goals and has a solid leg, though it maxes out at around 52-53 yards. He also handled kickoffs in college. We wrote a pre-draft scouting report on him you can find below. We’ll have reports on the rest of the class in the coming days."}, {"url": "https://www.espn.com/nfl/story/_/id/36329074/2023-nfl-draft-which-teams-signed-25-best-undrafted-free-agents", "page_content": "The 2023 NFL draft is a wrap, and the three-day event concluded with late-round picks and a flurry of undrafted free agent deals.\n\nEvery year there are a number of players who go undrafted, leaving them with the task of finding a team.\n\nBased on Todd McShay's best available rankings, here are where the top 25 undrafted free agents from this year's draft ended up. See the full 2023 rankings here.\n\n1. Jalen Redmond, DT, Oklahoma\n\nSigned: Carolina Panthers\n\n2. Ivan Pace Jr., ILB, Cincinnati\n\nSigned: Minnesota Vikings\n\n3. Lonnie Phelps, OLB, Kansas\n\nSigned: Cleveland Browns\n\n4. Rejzohn Wright, CB, Oregon State\n\nSigned: Carolina Panthers\n\n5. Emil Ekiyor Jr., OG, Alabama\n\nSigned: Indianapolis Colts\n\n6. Thomas Incoom, OLB, Central Michigan\n\nSigned: Denver Broncos\n\n7. Eli Ricks, CB, Alabama\n\nSigned: Philadelphia Eagles\n\n8. Joel Wilson, TE, Central Michigan\n\nSigned: New Orleans Saints\n\n9. Ronnie Hickman, S, Ohio State\n\nSigned: Cleveland Browns\n\n10. Ali Gaye, DE, LSU\n\nSigned: Houston Texans\n\n11. Bryce Ford-Wheaton, WR, West Virginia\n\nSigned: New York Giants\n\n12. Cameron Brown, CB, Ohio State\n\nSigned: Los Angeles Chargers\n\n13. Andre Carter II, OLB, Army\n\nSigned: Minnesota Vikings\n\n14. Jerrod Clark, DT, Coastal Carolina\n\nSigned: Los Angeles Chargers\n\n15. Jason Brownlee, WR, Southern Miss\n\nSigned: New York Jets\n\n16. Lance Boykin, CB, Coastal Carolina\n\nSigned: Seattle Seahawks\n\n17. Isaiah Land, OLB, Florida A&M\n\nSigned: Dallas Cowboys\n\n18. Keaton Mitchell, RB, East Carolina\n\nSigned: Baltimore Ravens\n\n19. Anthony Johnson, CB, Virginia\n\nSigned: New Orleans Saints\n\n20. Richard Gouraige, OG, Florida\n\nSigned: Buffalo Bills\n\nSigned: Dallas Cowboys\n\n22. Brandon Joseph, S, Notre Dame\n\nSigned: Detroit Lions\n\n23. Jaxson Kirkland, OT, Washington\n\nSigned: Cincinnati Bengals\n\n24. Malik Knowles, WR, Kansas State\n\nSigned: Minnesota Vikings\n\n25. Jeremy Banks, ILB, Tennessee\n\nSigned: Tampa Bay Buccaneers"}, {"url": "https://www.behindthesteelcurtain.com/2023/6/5/23750127/steelers-fill-out-their-offseason-roster-by-signing-two-players-and-releasing-one-williams-hagans", "page_content": "Heading into this week, the Pittsburgh Steelers had 89 players on their offseason roster. NFL rules state you can have 90 players, but the Steelers hadn’t completely filled out the roster. Nonetheless, the team made the necessary changes Monday to get that number to 90.\n\nTo do so the Steelers signed two players, offensive linemen Jarrid Williams and running back Darius Hagans. To make room for those two players, the team released Cody Chrest.\n\nThis is the official tweet from the Steelers official Twitter feed:\n\nWe have signed OL Jarrid Williams and RB Darius Hagans and released WR Cody Chrest. @BordasLaw\n\n\n\n: https://t.co/0L7pLp6ezD pic.twitter.com/uzh1qJRbi8 — Pittsburgh Steelers (@steelers) June 5, 2023\n\nIf you are like me, you don’t know much about these new players. So, in that regard, here is some information on them from the Steelers official website:\n\nHagans played college football at Virginia State and took part in the HBCU Combine that was held in the offseason. Hagans was originally signed by the Indianapolis Colts as an undrafted rookie free agent following the 2023 NFL Draft. His senior season he carried the ball 189 times for 1,012 yards and six touchdowns, playing in 10 games. In three seasons at Virginia State he played in 29 games, carrying the ball 420 times for 2,069 yards and 17 touchdowns. Hagans also had 31 receptions for 428 yards and five touchdowns in three seasons. Williams was last with the Philadelphia Eagles, signing a Reserve/Future contract during their postseason run this past year. Williams originally signed with the Eagles as an undrafted rookie free agent following the 2022 NFL Draft and spent time on the Eagles practice squad last season. Williams also spent time on the Detroit Lions practice squad in 2022. Williams played collegiately at both Miami, where he started 10 games as a redshirt senior last year, and Houston.\n\nBe sure to stay tuned to BTSC for the latest news and notes surrounding the Steelers as they prepare for the rest of the 2023 NFL offseason."}, {"url": "https://www.behindthesteelcurtain.com/2023/4/29/23704655/21-undrafted-free-agents-the-steelers-should-consider-signing-2023-nfl-draft-news-rumors", "page_content": "Immediately after the draft concludes, there is quite the flurry of action every year, as the undrafted free agent signing period begins. Players whom NFL teams regarded highly, but not enough to draft above other players, will be signed almost exclusively within a three-hour period following the draft.\n\nHere are some of the top players on our BTSC Big Board that I think the Steelers should attempt to bring in, now that the draft has concluded.\n\n1. Bryce Ford-Wheaton | WR | West Virginia | 6‘3“, 220 lbs\n\n2022 Stats: GP 12, Rec 62, Yds 675, TD 7.\n\nWilbar’s Grade: Mid 3rd\n\nAndrew Wilbar: Bryce Ford-Wheaton is my favorite receiver nobody is talking about. You can complain about the drops all you want to, but at the end of the day, the quarterback play was putrid. Yes, some of the drops were easy catches that should have been made, and I am not dismissing that area of his game and considering it polished. However, the inconsistency at quarterback was evident in just about every game, which forced BFW to constantly readjust. I do believe this was part of the problem, and it is fair to assume it will be less of an issue in the NFL. As it pertains to the rest of his game, how could you not fall in love with the player? This man has been gifted with incredible athletic traits, from speed, to size, to physicality, and much more. Even his route-running is impressive for a receiver his size. He runs his routes with correct depth, and he can change direction relatively quickly, which is not normal for a 6’4”, 222 pound receiver with 4.38 speed. He has the ceiling of former Steeler Martavis Bryant athletically, and his off-the-field resume is much better than Bryant’s. If he is there in Round 4, the Steelers should run their card to the podium.\n\n2. McClendon Curtis | G | Chattanooga | 6’6”, 328 lbs\n\n2022 Stats: GP 11.\n\nWilbar’s Grade: Mid 4th\n\nAndrew Wilbar: Just one year ago, we saw a Chattanooga lineman taken in Round 1 of the draft in Cole Strange. After a strong rookie campaign from Strange, the bar has been set high for his former teammate, who is likely to be taken in the middle rounds of the draft. Curtis is a semi-athletic guard with outstanding length and exceptional hand usage. What I appreciate about his game is his awareness. Whenever freed up, he is always assisting other linemen and seeing who he can help out. He also has a sky-high ceiling as a run blocker if he can learn to keep the pads low and strengthen his upper half. Best case scenario, he is a more athletic version of former Steelers lineman Ramon Foster. He isn’t the flashiest player, but he will get the job done consistently.\n\n3. Thomas Incoom | EDGE | Central Michigan | 6‘4”, 260 lbs\n\n2022 stats: GP 12, T 57, TFL 19, S 11.5, PD 0, FR 2, FF 1.\n\nWilbar’s Grade: Mid 4th\n\nAndrew Wilbar: If you want a guy who doesn’t mess around with his work, Incoom is who you are looking for. A true breakout player in 2022, Incoom developed into one of the best MAC defenders, recording 19 tackles for loss and 11.5 sacks. Converting speed to power is his true calling card, although he is capable of winning with finesse as well. Unfortunately, there is a difference between being able to do something and proving it on a consistent basis. Incoom has more twitchiness than people think, but his technique is so poor that his physical abilities do not always shine through against tough competition. I love Incoom’s potential and could see him taken on Day 2, but do not expect much from him in Year 1.\n\n4. Steven Gilmore | CB | Marshall | 6’2”, 169 lbs\n\n2022 Stats: GP 13, T 41, TFL .5, S 0, Int 3, PD 10.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: The brother of NFL star Stephon Gilmore, Steven is an undersized cornerback prospect (5’9”, 174 lbs) with the speed, ball skills, and bloodlines worthy of enticing *any* NFL franchise. Likely destined for the slot in the NFL, Gilmore does not provide ideal arm length and strength for the outside. Despite that, Gilmore displays a feistiness that I love. His hips are fluid and quick when changing direction, and his hand usage is impressive downfield, having an aggressive mindset and gameplan but not being overaggressive and called for penalties. Having said that, he is never going to be an extremely physical player at his size. Overall, I see Gilmore as an early Day 3 prospect with starting potential in a nickel role.\n\n5. Jason Brownlee | WR | Southern Miss | 6‘2“, 198 lbs\n\n2022 Stats: GP 13, Rec 55, Yds 891, TD 8.\n\nWilbar’s Grade: Mid 4th\n\nAndrew Wilbar: Brownlee will get overlooked because of his poor 40 time, but this guy plays with heart, and he’s more athletic than you are probably giving him credit for. Brownlee did run a 4.59 in the 40 at the combine, but everything else from the workout was positive. Not only did he record 16 reps on the bench, a 39.5” vertical, and a 131” broad jump, but he also looked extremely fluid in drills, displaying great footwork and reliable hands. His route-running still needs a bit of improvement, but he is a fluid mover on the field, and he does display good body control in traffic. This aids in his ability to win contested catches, which makes up for his inability to create separation at the end of his routes. At the end of the day, it is unfair to expect Brownlee to ever be a WR1 in the NFL. However, with his competitiveness, toughness, and work ethic, he could become a valuable WR2. He just lacks the versatility to move around in the formation, as he is almost exclusively an outside receiver.\n\n6. Trevor Nowaske | ILB | Saginaw Valley State | 6‘3”, 235 lbs\n\n2022 stats: GP 11, T 98, TFL 9.5, S 1, Int 4, PD 7, FR 0, FF 0.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: Nowaske was often aligned in an outside linebacker role in college, but I project him as an inside ‘backer at the next level. With the athleticism to cover many receivers, Nowaske has the versatility to line up just about anywhere. His aggressiveness allows him to fearlessly get into passing lanes and make plays on the ball in coverage. He also puts great force into his tackles, driving defenders to the ground when his tackling angles are clean. The big concern I have is that he second-guesses himself in coverage on occasion. He has good instincts as to where he needs to be as the play unfolds, but his backpedal is not the cleanest, and he lacks the field awareness needed to maintain proper spacing relative to both his zone and the nearest receiving entity. That aspect will likely improve as he gains experience (and settles in on one position), but it is something worth keeping an eye on moving forward. Overall, I like Nowaske’s nose for the football and would consider him a steal in the later rounds. The upside is tremendously high long-term, and his experience on special teams will allow him to contribute immediately.\n\n7. Mohamoud Diabate | ILB | Utah | 6‘3”, 227 lbs\n\n2022 stats: GP 12, T 58, TFL 13.5, S 5, Int 0, PD 1, FR 0, FF 1.\n\nWilbar’s Grade: Mid 5th\n\nNoah_E: Diabate’s tape leaves much to be desired. There’s no denying he’s an elite athlete with great instincts. He has the versatility to line up or off the ball and uses his quickness to get to the quarterback. Diabate is also a big hitter that often brings guys down behind the line of scrimmage. His ability to find the ball is fantastic and he has a knack for slipping through gaps to make the tackle. However, he lacks the fluidity to consistently run sideline-to-sideline and has trouble taking on blockers. He often takes bad angles in run support and hasn’t proved he can stick in coverage. He plays upright and lacks explosiveness at times. His athleticism and natural feel for the game make him a solid prospect, but if he can’t cover or be a reliable run defender, I’m afraid he could fizzle out very quickly.\n\n8. Joey Fisher | OT | Shepherd | 6’5”, 322 lbs\n\n2022 Stats: GP 8.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: An athletic lineman with a strong base, Fisher was a complete unknown before the NFLPA Bowl. After multiple impressive reps, Jim Nagy was impressed and gave him a last-second invite to the Senior Bowl . Although he was unable to participate due to a hand injury, it gave him an opportunity to meet with NFL teams and further make known his name and relevancy as a prospect. Fisher was a three-year starter at right tackle at Shepherd, but he is versatile and athletic enough to play just about anywhere along the offensive line. Fisher’s motor is always going at 100 percent, as evidenced by the way he plays through the whistle and finishes his blocks. I think the biggest testament to his dedication, however, was his decision to remain at Shepherd despite opportunities to transfer to bigger schools. He is a high-character prospect who could carve out an impressive NFL career, but the big unknown is the lack of competition he faced. That is what will keep him from going any higher than Day 3.\n\n9. Ben VanSumeren | ILB | Michigan State | 6‘3”, 240 lbs\n\n2022 stats: GP 11, T 81, TFL 3, S 2, Int 0, PD 2, FR 0, FF 0.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: VanSumeren is an interesting prospect with a background unlike any other in this linebacker class. He started his career as a fullback at the University of Michigan before converting to linebacker. One year after the position change, VanSumeren up and left Michigan only to transfer to their in-state rival, Michigan State. After being used minimally in 2021, VanSumeren was a huge part of the Spartans defense this past fall, displaying good open-field tackling ability as well as the fluidity and range to keep up with most skill players in coverage, regardless of position. What put himself on the map, however, was his incredible pro day workout, which included a 4.4 40-yard dash, 29 bench reps, a 42 ½” vertical, and a 131” broad jump. Ben is not a playmaker who has been able to shift the momentum of games with splash plays, nor has he been able to display a good closing burst as an open-field tackler. He also gets out-leveraged from time to time due to poor technique, making it look as if he doesn’t play as big as even his average size would suggest. That is probably the biggest concern as he heads to the NFL. Nonetheless, with a player as athletically gifted as VanSumeren, I cannot blame any team who takes a stab at him on Day 3. The potential makes it well worth it.\n\n10. Andre Carter II | EDGE | Army | 6‘7”, 265 lbs\n\n20221 stats: GP 10, T 41, TFL 7.5, S 3.5, PD 2, FR 0, FF 0.\n\nWilbar’s Grade: Late 3rd\n\nJeremy: Carter is one of the most difficult evaluations in this EDGE class. An absolute monster physically, his presence alone forced opposing offenses to adjust their protections and run schemes to account for him. Carter is surprisingly bendy for a 6’7” rusher, but he does struggle to gain leverage over opposing blockers. As a result, Carter has to win with quickness and good hands, which he can do. He makes for an imposing run defender as well, although he can get pushed around a little bit by aggressive blockers with a lower base. Some team will fall in love with Carter’s physical attributes, but he’s a raw prospect in need of serious refinement in order to take advantage of his natural athleticism.\n\n11. Starling Thomas V | CB | UAB | 6’0”, 195 lbs\n\n2022 Stats: GP 13, T 30, TFL 1, S 0, Int 0, PD 15.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: Thomas may not have put up big interception numbers in 2022, but he sure got his hands on a lot of balls in 2023, deflecting 15 passes and blanketing opponents’ number one receiving options. At 5’10”, 190 pounds, Thomas could play on the outside if need be, but he projects best as a slot corner in a balanced defensive scheme. Thomas can play in both man and zone, as his read-and-react quickness and his open-field tackling prowess allow him to fit just about any scheme. Unfortunately, he is not a finished product. Despite all the speed and potential Thomas brings to the table, his game is incredibly unrefined, especially as it pertains to footwork and hip fluidity. Give him a year on the practice squad or as an exclusive special teamer, and the reward may be felt for the next decade.\n\n12. Anthony Kendall | CB | Baldwin-Wallace | 5’10”, 180 lbs\n\n2022 Stats: GP 10, T 56, TFL 4, S 1, Int 3, PD 1.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: This dude loves lowering the BOOM on opponents! One of the most recurring themes on Kendall’s tape is simply lighting up opposing receivers, and he does it unapologetically. He is also one of the better open-field tacklers in this class, although the lack of competition may have made him look better than he truly is. Nonetheless, he put on a show at his pro day, running a 4.44 in the 40, putting up 20 reps on the bench, jumping 39.5” in the vertical, leaping 133” in the broad jump, and recording a 7.01 in the 3-cone drill. If he was a little thicker, I would recommend moving him to safety, as his play style reminds me a little of Antoine Winfield, Jr. coming out of college. There are only six Division III players in the NFL, but Kendall could easily become number seven.\n\n13. Ty Okada | S | Montana State | 5’11”, 200 lbs\n\n2022 Stats:\n\nWilbar’s grade: Mid 5th\n\n14. Shedrick Jackson | Auburn | 6‘2“, 196 lbs\n\n2022 Stats: GP 12, Rec 16, Yds 217, TD 0.\n\nWilbar’s Grade: Early 5th\n\nAndrew Wilbar: Jackson may not have the production of some of these other receivers, but his combination of solid size and elite speed are difficult to contain. The poor quarterback play at Auburn likely had a part in his lack of production, but recording only 1 career interception is definitely concerning. He does not run the most diverse route tree, but he is wise beyond his ears in that he knows when to come back to the football to make a catch. His speed is off the charts, and he is typically sure-handed. Ultimately, his success in the NFL will be determined by how much his route-running and physicality can improve. He has all the tools you could ever ask for.\n\n15. Matt Landers | WR | Arkansas | 6‘5“, 200 lbs\n\n2022 Stats: GP 13, Rec 47, Yds 901, TD 8.\n\nWilbar’s Grade: Mid 5th\n\nAndrew Wilbar: The long, lanky Matt Landers is a true vertical threat with size to win in the red zone. Running a 4.37 40 at the combine, Landers proved his top-end speed, which has been his calling card throughout his collegiate career. That is further proven by his nearly 20 yards per reception. While his physicality coming off the line is lacking, he finds a way to make catches at poor angles and with poor positioning. However, adding more physicality would prevent him from being rerouted so often, and it is something he will need to do before obtaining success in the NFL. Regardless, the reason his stock is this low is not due to a lack of physicality, but rather due to too many drops on tape. If he can fix the hands issue, he will be a great Z receiver and deep threat.\n\n16. Jerrod Clark | DT | Coastal Carolina | 6‘4”, 340 lbs\n\n2022 stats: T 12, S 3.5, FF 0, INT 0.\n\nWilbar’s Grade: Mid 6th\n\n17. Emari Demercado | RB | TCU | 5’11”, 207 lbs\n\n2022 Stats: GP 15, Att 121, Yds 681, Ave 5.6, TD 6, Rec 13, Yds 134, TD 1.\n\nWilbar’s Grade: Late 6th\n\n18. Trevor Reid | OT | Louisville | 6’5”, 307 lbs\n\n2022 Stats: GP 11.\n\nWilbar’s Grade: Mid 6th\n\n19. Trevor Downing | C | Iowa State\n\n20. Lindsey Scott, Jr. | QB | Incarnate Word | 5’11”, 212 lbs\n\n2022 Stats: GP 12, 322 COMP, 454 ATT, 4686 YDS, 60 TD, 8 INT\n\nWilbar’s Grade: 7th\n\n21. Tashawn Manning | G | Kentucky | 6’4”, 335 lbs\n\n2022 Stats: GP 12.\n\nWilbar’s Grade: Mid 6th"}, {"url": "https://steelersnow.com/steelers-to-ink-explosive-undrafted-free-agent-return-specialist/", "page_content": "PITTSBURGH — The Steelers are signing undrafted free agent running back Jordan Byrd out of San Diego State, according to Brad Benson of KRQE News.\n\nByrd joins Tanner Morgan as the second undrafted free agent that has signed with the Steelers. He is an Albuquerque native, the same place that Steelers tight end Zach Gentry is from. He will compete for the final running back spot on the roster after Benny Snell has yet to return to the team after the 2022 season.\n\nOver his five years with the Aztecs, Byrd racked up 1363 rushing yards and 12 touchdowns on 275 rushes. However, where Byrd’s value is at its highest is as a kick returner. In his career, Byrd has three kick return touchdowns and was named a second-team All-American in 2022 because of his return ability. In addition, he can return punts, having one touchdown off punts in his career, and he notched one each this past season at San Diego State.\n\nThe Steelers are looking for a returner after return man Steven Sims left the team to head to the Houston Texans following the season. Now, Byrd should have an opportunity to compete for that job alongside players such as Anthony McFarland and Calvin Austin. Byrd is a useful receiver out of the backfield as well, but standing only at 5-foot-9, he relies on his quickness and speed to pop on kickoffs."}, {"url": "https://www.wkbn.com/sports/pittsburgh-steelers-announce-7-undrafted-free-agent-signings/", "page_content": "PITTSBURGH (WKBN) – The Pittsburgh Steelers announced the signing of seven undrafted free-agents after selecting seven players in the 2023 NFL Draft.\n\nCheck out the full list of the Steelers undrafted free agent signings below:\n\nJordan Byrd, San Diego State – Wide Receiver/Return Specialist\n\nByrd played 58 games for the Aztecs racking up 1,353 rushing yards and 219 receiving yards with 13 career touchdowns. He was First-Team All-Mountain West at both kick and punt returner (the first Aztec to do so) after scoring three touchdowns on kick returns and one on punt return in his career.\n\nTanner Morgan, Minnesota – Quarterback\n\nThe experienced signal caller set numerous records at Minnesota including most passing yards (3,254) and passing touchdowns (30) in a single-season. Morgan won 33 games and started 47 of 51 career games.\n\nTrevor Downing, Iowa State – Center\n\nDowning showed his versatility after being named Second-Team All-Big 12 at right guard in 2021 and then again in 2022 after making the move to center. He started 38 career games for the Cyclones.\n\nJames Nyamwaya, Merrimack – Defensive End\n\nThe 6’5″ 305 pound defensive end recorded 27 tackles, 5.5 sacks, one forced fumble and fumble recovery in 10 games for Merrimack College last season, earning Second-Team All-NEC honors.\n\nDavid Perales, Fresno State – Linebacker\n\nIn 14 games in 2022, Perales notched 11.5 sacks (7th in FBS) and finished his Fresno State career with 22.5 sacks (6th in program history) after transferring in from Sacramento State.\n\nMonte Pottebaum, Iowa – Fullback\n\nOriginally a linebacker for the Hawkeyes, Pottebaum played in 45 games while starting 13 for Iowa. The fullback, who grew up a Steelers fan, had 20 carries for 82 yards and a touchdown and added 85 receiving yards on 10 catches.\n\nB.T. Potter, Clemson – Kicker\n\nThe Clemson Tiger made 73 of 97 career field goals (school record) and 234 of 235 extra point attempts (school record) and will go down in history of the Clemson program. Potter also finished as the Tigers all time leader in points by a kicker (453) and 50-plus yard field goals (9)."}]}