{"Steven Threet was released by the Steelers in August 2010 and did not play in the NFL.": [{"url": "https://247sports.com/Article/Ex-Michigan-QB-Steven-Threet-rips-Rich-Rodriguez-for-hiring-Rod-Smith-as-Jacksonville-State-footballs-OC-188710516/", "page_content": "Former Michigan quarterback Steven Threet did not hold back when criticizing ex-Wolverines head coach Rich Rodriguez this week. Threet played one season at Michigan under Rodriguez in 2008 when the team went 3-9, which included late-offensive coordinator Calvin Magee and quarterbacks coach Rod Smith. Smith was just hired by Rodriguez ahead of the 2022 season at Jacksonville State, in place of Magee after his passing, as the offensive coordinator and quarterback’s coach. Upon hearing the news, Threet went after Rodriguez’s decision.\n\n“Nothing like returning to a dry well (Coach Rodriguez),” Threet wrote on Twitter. “Rod Smith replacing (Scot Loeffler) at Michigan is the greatest tragedy of my playing career. And I’m including all 15 diagnosed concussions in that assessment.”\n\nThreet was very critical of Rodriguez hiring Smith, his quarterbacks coach in 2008. Loeffler was the quarterbacks coach at Michigan from 2002-07 under former head coach Lloyd Carr. In 2008, Loeffler moved on to the Detroit Lions as their quarterback's coach.\n\nThreet initially decided to transfer from Georgia Tech to Michigan in July 2007 and personally called Carr and explained he wanted to come back closer to home.\n\nHowever, Carr retired after the 2007 season, which ended with a 9-4 record and win in the Capital One Bowl.\n\nThreet spent just two seasons at Michigan, playing in 2008, but under a completely different staff when he was eligible to play after his transfer.\n\nAccording to his statement on Twitter, Threet was more critical of Smith as a coach than the concussions that ultimately forced Threet to retire from the game of football. He transferred in 2009 and was eligible to play for Arizona State in 2010, where he was the starting quarterback.\n\nThreet finished his lone season of playing at Arizona State with 2,534 yards, 18 touchdowns, 16 interceptions and a 61.9% completion rate. In total, with Michigan and ASU, Threet had 3,639 yards, 27 touchdowns, 23 interceptions and a 57.8% completion rate.\n\nAs a Class of 2007 recruit, Threet was a three-star prospect out of Adrian (Mich.), according to the 247Sports Composite. He was the No. 311 overall prospect, No. 12 pro-style quarterback and No. 11 player in Michigan for the cycle.\n\nSmith worked for Rodriguez at various programs. In 2007, Rodriguez hired Smith to be the quarterbacks coach at West Virginia. One year later, when Rodriguez was hired by Michigan, Smith followed him and spent three seasons with the Wolverines.\n\nDuring his stint with Rodriguez in Ann Arbor, Smith did a lot of work on the recruiting trail. He was instrumental in helping Michigan land four-star recruits like Devin Gardner, Tate Forcier and Jeremy Gallon.\n\nGet the fastest scores, stats, news, LIVE videos, and more. CLICK HERE to download the CBS Sports Mobile App and get the latest on your team today.\n\nThe two linked up again at Arizona, when Rodriguez was the head coach there. Smith served as the co-offensive coordinator and quarterbacks coach there from 2012-17. That was the last time Smith and Rodriguez worked together until this hiring by Jacksonville State."}, {"url": "https://www.mlive.com/wolverines/football/2008/10/michigan_quarterback_threet_th.html", "page_content": "University of Michigan quarterback Steven Threet can't stand silence.\n\nWhen he sleeps, two fans whir in the bedroom. When he and roommates Artis Chambers and Vince Helmuth study, \"it's no library environment,\" Helmuth says.Music frequently plays in the background of Threet's life; hip-hop, classic rock, even classical. During his weekday ritual of studying film alone in the Schembechler Hall team room - sometimes until midnight - Threet will sit in front of the big projector screen, remote in hand, wearing headphones.\n\nOn game days, such as today, when Michigan (2-2, 1-0 Big Ten) hosts Illinois (2-2, 0-1), Threet will begin his routine at Michigan Stadium by tossing a ball back and forth with a manager as fans trickle into the venue well before kickoff.\n\nWhile playing catch, Threet may listen to Bob Seger's \"Greatest Hits.\" Or it could be the sounds of a hip-hop artist such as Lil Wayne, T.I. or Jay-Z.\n\nRELATED CONTENT\n\n• Scouting report: Illinois at Michigan\n\n• Carty: With loss of civility, everyone loses\n\n• Q&A: Psych major Dutch has NFL dreams\n\n• Illinois quarterback Williams a proven playmaker\n\n• Huron High School receiver Jackson stays home, will play for Michigan\n\n• Lunch with Heuser: Limiting turnovers critical for U-M against Illinois\n\n• More Wolverines Football Coverage\n\nWhen the stadium's filled and fans are cheering, Threet \"definitely thrives off it,\" says Helmuth, a Michigan fullback.\n\nIt wasn't cheers, however, the Wolverines heard when they jogged off the field at halftime last Saturday against Wisconsin. Michigan trailed 19-0 and the team's offense had generated 21 total yards.\n\nAs for Threet, \"he had about the worst half I've ever seen a quarterback have,\" Michigan quarterbacks coach Rod Smith says bluntly. Threet completed 2 of 10 passes for minus-7 yards. He had also thrown two interceptions, lost a fumble, but remained unfazed by it all.\n\n\"He wasn't doing well in the first half, obviously,\" offensive tackle Stephen Schilling says. \"But he didn't get down on himself, and none of his teammates got down on him. We stuck with him, kept blocking for him. We knew eventually he'd make the right throws and the right reads and we'd turn it around.\"\n\nWhen Threet and the Wolverines were finished, they had reversed things completely, scoring 27 consecutive points and holding off the then-No. 9-ranked Badgers, 27-25. It was the largest comeback in the 500-game history of Michigan Stadium, and it was directed by a redshirt freshman quarterback who said he never doubted himself.\n\n\"He still fought and scratched and made some plays for us and led us to a victory,\" Smith says.\n\nAdds Gary Gray, a family friend and coach from Adrian, the town where Threet was raised: \"I was more proud of him in the first half than in the second. When things aren't going well, that's when you see what Bubba's really all about.\"\n\nWhiz at memorization\n\nTo family and childhood friends, Threet is better known as Stevie, or more often, Bubba. That nickname started out as Chubba Bubba, Threet says.\n\n\"I was a hefty boy,\" he says, laughing. \"I was a large child. When I slimmed down a little bit it was just Bubba.\"\n\nWhatever he was called, Threet was born into a sporting family on Jan. 2, 1989, the day Michigan beat Southern California in the Rose Bowl.\n\nHis father Jewel played baseball at Adrian College, and coached the Lookouts youth travel baseball team in Lenawee County. Threet's older brother Jay played college baseball, first at Purdue, then at Bowling Green. Sister Krissy was a softball pitcher at Eastern Michigan University.\n\nSteven Threet pitched as well, and played basketball and soccer as an elementary student. Threet always told his parents that football was his favorite sport, however, but he didn't have an opportunity to play until he switched to the Adrian public schools.\n\nIn eighth grade, Threet's middle school football coach asked each boy to list two positions they wanted to play. Jewel Threet joked with his son that they'd make him a lineman. Steven Threet wrote down tight end and quarterback.\n\nThreet tried out for the quarterback job, won it, and soon impressed his coach with his ability to learn the offense.\n\n\"I remember the coach telling me that he was able to know his assignment, everybody else's assignment,\" Jewel Threet says. \"He knew every play, every position. And this was in the eighth grade, and I go, 'That's not surprising.' \"\n\nSteven Threet was a whiz at memorization, easily retaining scriptures he learned at Lenawee Christian School, helping with driving directions years before he turned 16 and excelling in academics. What Threet needed was a better grasp of how to play the quarterback position.\n\n\"I had never played football,\" Jewel Threet says. \"So when Stevie wanted to get serious about it, I had to find someone who could teach him.\"\n\nJewel Threet had ferried Jay to the Detroit area and Krissy to Ann Arbor for pitching lessons. For his youngest son's quarterbacking tutorials, he turned to Ken Calhoun, then the offensive coordinator at Adrian College. He also enlisted Mike Howe, a local conditioning coach, and Gray, a physical therapist by trade who has treated professional athletes such as Mario Lemieux and Dan Marino.\n\nThreet worked on his quickness, agility, change of direction, acceleration, deceleration, the proper way to throw from an off-balance position and more. He trained throughout high school, sometimes working out two or three times a day in the summer.\n\n\"I've never seen a kid work so hard,\" Gray says. \"A lot of times, kids are willing to work on their strengths. But he was willing to work to turn his weaknesses into strengths.\"\n\nLong road to starter\n\nThreet's mom, Pam, had graduated from the University of Michigan, and the family began buying football season tickets in the early 1980s. Pam and Jewel joined the Victors Club, and Jewel traveled to the 1992 and '93 Final Fours to watch the Michigan men's basketball team.\n\nWhen Jay was being recruited by Big Ten baseball programs, he tried to schedule his official visits for fall weekends when the Michigan football team was in town. During Jay's visit to Purdue, Stevie tagged along, wearing his Drew Henson No. 7 jersey.\n\nWhen Jay went to Northwestern, Stevie watched the Wildcats win a wild 54-51 game in 2001.\n\n\"We would be sitting there in their recruiting section, and I would have my Michigan jersey on, cheering for Michigan while my brother was looking at the other school,\" Threet says.\n\nHis Henson jersey and the one with former Michigan tailback Anthony Thomas' No. 32, were tucked away at home when Threet - who grew to be 6-feet, 6-inches tall - began his college career, not in Ann Arbor, but at Georgia Tech. Though Michigan expressed some interest in Threet, the school never offered a scholarship, and signed one of the nation's best high school quarterbacks - Ryan Mallett - to succeed four-year starter Chad Henne.\n\nThreet graduated from high school early as class valedictorian, and enrolled at Georgia Tech in January, 2007. But offensive coordinator Patrick Nix - who had recruited Threet - left almost immediately for Miami. By summer, Threet, too, had decided to leave Atlanta.\n\nOne of those he spoke to about where to go next was Helmuth, a Saline High graduate who had known Threet since middle school.\n\n\"I said: 'Come over here,' \" says Helmuth, who had started classes at Michigan in January 2007, along with Chambers, a safety, and Mallett.\n\nBecause another Michigan quarterback, Jason Forcier, had transferred to Stanford, there was a scholarship available for Threet. He sat out the season per NCAA transfer rules, then saw coach Lloyd Carr retire following Michigan's bowl game.\n\nShortly after Rich Rodriguez took over the program, Mallett - who backed up Henne in 2007 - transferred to Arkansas. When Terrelle Pryor, the nation's No. 1 prep quarterback, picked Ohio State over Michigan earlier this year, Threet and redshirt sophomore Nick Sheridan became the top contenders for the starting job.\n\n\"My goal transferring here was, obviously, to compete for the starting position,\" Threet says. \"I didn't come to sit and watch, that's not the type of person I am. I love to compete.\"\n\nAn instant leader\n\nThreet ultimately won the competition with Sheridan in the season's third game, when he completed 16 of 23 passes for 175 yards at Notre Dame. Threet followed that performance with the outing against Wisconsin, in which he had a 58-yard run, but finished 12 of 31 passing for 96 yards.\n\nMechanically, he still needs some polish, as Threet and his quarterbacks coach readily acknowledge. Threet sometimes plants his feet too wide when he throws the ball, and he tends to lower his release point too much, which can be traced to his baseball-playing days.\n\n\"We've gotta keep getting him fundamentally sound in practice,\" Smith says. \"I don't want him thinking on the game field. I want him reacting. Through the week of practice, when he gets all those reps, that's when he's gotta focus on that and concentrate on his technique.\"\n\nThough Threet's overall numbers aren't pretty - he's not ranked in the top 100 nationally in passing efficiency - Smith is optimistic, noting that it's rare for a such a young player to quarterback a spread offense, which requires him to make multiple decisions quickly on each play.\n\n\"I love his mentality, I love his attitude,\" Smith says. \"The kid wants to work, the kid takes coaching and he doesn't ever question or make excuses for anything, which is why I love him. The second thing is, he showed us all on Saturday there's no quit in that dog right there.\"\n\nAmong an offensive cast that includes a single senior, and has several true freshmen in starting roles, Threet has become an instant leader. He never speaks poorly about anyone, right tackle Stephen Schilling says, noting that Threet's positive attitude and enthusiasm are infectious.\n\n\"The young guys, especially, all look up to him, you can tell,\" Helmuth adds. \"That may be hard to say since we're all big football players, but they ask him for help before they go to anyone else.\n\n\"For a guy that's a freshman to be put in such a big role, nothing has gone to his head. He's still the same Stevie I've known from way back.\"\n\nOr the same Bubba, who wears a Galapagos Island T-shirt given to him by his late grandfather under his uniform; the same fashion-conscious Steven who owns upward of 50 pairs of sneakers he keeps meticulously clean; the same person who possesses other, less tangible, things.\n\n\"He has integrity, he has tremendous passion and character,\" Gray says. \"That's why it's so fantastic to see such a neat kid out there, playing the game he loves. All the hard work has come together for him. Rarely is the world fair. In this case it is.\"\n\nJohn Heuser can be reached at jheuser@annarbornews.com or 734-994-6816."}, {"url": "https://cain.ulster.ac.uk/issues/collusion/stevens3/stevens3summary.htm", "page_content": "CAIN Web Service Stevens Enquiry: Overview and Recommendations, 17 April 2003\n\n[CAIN_Home]\n\n[Key_Events] [KEY_ISSUES] [Conflict_Background]\n\nCOLLUSION: [Menu] [Reading] [Summary] [Background] [Chronology] [Main_Pages] [Sources]\n\nText: John Stevens ... Page Compiled: Martin Melaugh\n\nStevens Enquiry: Overview and Recommendations, 17 April 2003\n\nSir John Stevens QPM, DL\n\nCommissioner of the Metropolitan Police Service Chapter one: Introduction 1.1 I have carried out three Enquiries into allegations of collusion between the security forces and loyalist paramilitaries in Northern Ireland. These began nearly fourteen years ago and continue to this day. I believe the time is now right to make some important recommendations. These arise from serious shortcomings I have identified from all three Enquiries. 1.2 I intend to take a twin-track approach, publishing these recommendations whilst allowing the specific criminal investigations to continue. These will be submitted to the Director of Public Prosecutions (NI). Some major lines of enquiry are still in the early stages of investigation. 1.3 My Enquiries have highlighted collusion, the wilful failure to keep records, the absence of accountability, the withholding of intelligence and evidence, and the extreme of agents being involved in murder. These serious acts and omissions have meant that people have been killed or seriously injured. 1.4 This report will also detail how my Enquiries have been obstructed. Terms of Reference 1.5 In May 1999, following a letter from the Director of Public Prosecutions (NI) to the then Chief Constable of the Royal Ulster Constabulary, Sir Ronnie Flanagan, I was asked to re-investigate the murder of Patrick Finucane and allegations of collusion raised by British Irish Rights Watch. 1.6 The significance of the role played by an RUC informant William Stobie in events surrounding the murder of Patrick Finucane led to two principal, further matters being added to my remit. Firstly I undertook to re-investigate the murder in November 1987 of a young student Brian Adam Lambert and secondly to examine certain issues surrounding the handling of agents. 1.7 The task of preventing terrorist attacks by paramilitary groups from either side of the community in Northern Ireland is acknowledged to be one of the most complex policing challenges in the United Kingdom. Conventional roles and duties are overlaid with the need to respond to the ever-present threat from terrorism. The scale of this challenge is highlighted by the fact that during the three years primarily covered by this report, 1987 to 1989, the RUC dealt with over 3,000 terrorist related incidents of which 261 were deaths related to the security situation. 1.8 My third Enquiry has focussed in detail on only two of those murders, and a small number of related agent case histories. In doing so it has worked and continues to work at all times to provide evidence to satisfy the prosecution test. It has also, like my two previous Enquiries, always operated from the premise that those involved in policing and security duties in Northern Ireland work to and are subject to the rule of law. 1.9 My recommendations cover the collection and use of intelligence, the use of agents, standards of investigation and the prevention of collusion. Some of the recommendations I made in my first report are still relevant. I re-emphasise the importance of their implementation. I also propose some new recommendations concerning the future policing of Northern Ireland. 1.10 The publication of this report is later than I had originally hoped. This delay is due to a number of factors. Firstly, as has already been mentioned, new terms of reference were added to the original remit of my Enquiry. 1.11 Secondly last November a considerable amount of additional documentation from the Ministry of Defence, giving rise to several new and major lines of enquiry, became available to the Enquiry team for the first time. I record this late disclosure with considerable disquiet. I had encountered the same problem of late disclosure during my two previous Enquiries and expressed then my strong concerns surrounding the issue.\n\nChapter two: Outline of events investigated by the Enquiry Team The Murder of Patrick Finucane 2.1 Patrick Finucane was murdered in front of his wife and three children in his home on Sunday 12th February 1989. He was 39 years old and worked as a solicitor in Belfast. Mr Finucane was shot fourteen times by two masked gunmen who entered his house in the early evening. The gunmen escaped in a red Ford Sierra motor vehicle driven by an accomplice. The following day the Ulster Freedom Fighters (UFF) claimed responsibility for the murder. 2.2 Two guns were used in the attack, the majority of shots fired from a 9mm-P Browning. This firearm was recovered approximately five months later. It was found to be one of a number of guns stolen in August 1987 from an Ulster Defence Regiment barracks. It had already been used in an attempted murder a few months before the murder of Patrick Finucane. Five men were arrested in connection with the recovery of the weapon and three were later charged. The second gun, a .38 Special or a .357 Magnum revolver, was later used in another attempted murder in 1991. That weapon has never been recovered. 2.3 A number of other suspects were identified and arrested by the RUC but by November 1989 the murder remained unsolved and the investigation had effectively ceased. However in 1990 a journalist, Mr Neil Mulholland, provided new information about the Finucane murder from a man claiming to be both a quartermaster for the Ulster Defence Association and an agent of the RUC Special Branch. This man was William Stobie. He also admitted to Mulholland that he had supplied the murder weapon that had killed another man, Brian Adam Lambert. The Murder of Brian Adam Lambert 2.4 Brian Adam Lambert had been shot on 9th November 1987 at a building site in Belfast. He was a young Protestant student with no criminal record or links to terrorism. It is believed he was mistakenly targeted in revenge for the Remembrance Day bombing at Enniskillen the day before. One man was charged and convicted for the offence of conspiring to murder Brian Adam Lambert. William Alfred Stobie 2.5 Stobie was recruited as an agent by the RUC Special Branch in November 1987 following his arrest for the murder of Brian Adam Lambert for which he was released without charge. He was tasked by Special Branch until 1990 when as a result of Mulholland's information he was arrested by the RUC for the Finucane and Lambert murders. Mulholland, however, refused to sign a statement. This fact was highlighted in a file submitted to the Director of Public Prosecutions (NI) recommending non-prosecution. 2.6 As the UDA quartermaster of the West Belfast Brigade, Stobie had continued to be involved in the storage and supply of weapons several months after the murder of Patrick Finucane. His activities, whilst an agent, clearly indicate his central role in the commission of serious offences from at least July 1988 onwards. 2.7 It has now been established that before the murder of Patrick Finucane, Stobie supplied information of a murder being planned. He also provided significant information to his Special Branch handlers in the days after the murder. This principally concerned the collection of a firearm. However this vital information did not reach the original murder enquiry team and remains a significant issue under investigation by my Enquiry team. 2.8 Stobie was arrested by my third Enquiry team and charged with the murder of Patrick Finucane and Brian Adam Lambert. The case concluded at Belfast Crown Court in November 2001 when the key prosecution witness, Neil Mulholland, who had by then signed a witness statement, failed to give evidence on account of his mental state. Two weeks later Stobie was shot dead. His murder was claimed by the loyalist terrorist group the 'Red Hand Defenders'. Stobie's murder, and his refusal to accept protection beforehand, is a matter that has been investigated by the Police Service of Northern Ireland. 2.9 My Enquiry team arrested three of the original suspects for the murder of Patrick Finucane and nine other men were arrested for the first time on suspicion of murder. None of those arrested could be linked forensically to the scene of the Finucane murder. No admissible evidence has been obtained to enable any person to be charged. I believe however that all played a significant role in the murder of Patrick Finucane or the events surrounding it. This part of my Enquiry is still ongoing. 2.10 Similarly five men were arrested by the Enquiry team on suspicion of the murder of Brian Adam Lambert. No-one, other than William Stobie, has been charged with his murder because of a lack of evidence to satisfy the prosecution test. Investigation of Agents 2.11 My Enquiry team also examined the role of agents, now known as Covert Human Intelligence Sources (CHIS), active around the time of both murders. In particular it reviewed William Stobie's and Brian Nelson's roles in the murder of Patrick Finucane. Nelson, an Army agent, had been identified as a suspect during my first Enquiry. He was charged with thirty-five serious terrorist offences and later convicted. He was imprisoned for ten years. He was the subject of my second Enquiry. This investigated additional allegations concerning his role as highlighted in the 1992 Panorama documentary entitled ' Dirty War'. 2.12 As in the case of Stobie all the available intelligence was assessed. Nelson was aware and contributed materially to the intended attack on Finucane. It is not clear whether his role in the murder extended beyond passing a photograph, which showed Finucane and another person, to one of the other suspects. Nelson was re-arrested and interviewed. There was no new evidence and he was not charged with any further offences. 2.13 Brian Nelson's role also raised a number of issues arising from the work of the Force Research Unit (FRU), the Army's agent-handling unit in Northern Ireland. My Enquiry team investigated allegations made by several former members of the FRU. They reviewed and analysed all material relating to the FRU's operational activity. Twenty former members of the FRU were interviewed and files seeking legal advice in relation to nine of them have been prepared. New material uncovered since the publication of my last report has shed further light on this matter. These enquiries are still ongoing. Intelligence Material 2.14 My Enquiry team has undertaken the forensic examination of a wealth of material recovered from the loyalist paramilitary groups, particularly that belonging to Nelson. The advance in forensic technology has resulted in identification of eighty-one people who had left their fingerprints on classified documents that they had no lawful reason to possess. Twenty-seven have been arrested and interviewed. Application of the prosecution test led to six persons being charged and convicted in relation to possession of documents likely to be of use to terrorists. The remaining twenty-one cases failed to satisfy the prosecution test.\n\nOther Matters Concerning Collusion 2.15 One of the major issues for my Enquiry, underpinning virtually all aspects of the individual investigations, was the allegation of widespread collusion between the loyalist paramilitaries, the RUC and Army. My Enquiry team investigated these allegations. Many were contained in the British Irish RIGHTS WATCH report 'Deadly Intelligence - State involvement in loyalist murder in Northern Ireland' including the allegation that the RUC had incited the death of Patrick Finucane. 2.16 My Enquiry attempted to establish whether Mr Finucane had been threatened by loyalist paramilitaries, or RUC officers, and whether he had made any formal complaint. The absence of any record means that this criminal allegation cannot be substantiated against any RUC officer. 2.17 My Enquiry team also investigated an allegation that senior RUC officers briefed the Parliamentary Under Secretary of State for the Home Department, the Rt Hon Douglas Hogg QC, MP, that 'some solicitors were unduly sympathetic to the cause of the IRA'. Mr Hogg repeated this view during a debate on the Prevention of Terrorism legislation in the House of Commons. Within a few weeks Patrick Finucane was murdered. Mr Hogg's comments about solicitors' support for terrorism made on 17th January 1989 aroused controversy. To the extent that they were based on information passed by the RUC, they were not justifiable and the Enquiry concludes that the Minister was compromised. 2.18 A further aspect of my Enquiry was how the RUC dealt with threat intelligence. This included examination and analysis of RUC records to determine whether both sides of the community were dealt with in equal measure. They were not.\n\nChapter three: Obstruction of my Enquiries 3.1 Throughout my three Enquiries I recognised that I was being obstructed. This obstruction was cultural in its nature and widespread within parts of the Army and the RUC. I am confident that through the investigative efforts of my Enquiry team, I have managed to overcome it and achieve the overall objectives of my Enquiry. 3.2 I gave details in my first report of the obstruction I encountered during my first Enquiry. I recount these details now as their significance has grown as a result of more recent disclosures. 3.3 It was only through the investigative efforts of my Enquiry team that I was able to identify and arrest the Army agent Brian Nelson in January 1990. When he was interviewed I discovered that he had been in possession of an �intelligence dump'. This had been seized by his FRU handlers when my first Enquiry had begun, in September 1989. This crucial evidence had been concealed from my Enquiry team. 3.4 There was a clear breach of security before the planned arrest of Nelson and other senior loyalists. Information was leaked to the loyalist paramilitaries and the press. This resulted in the operation being aborted. Nelson was advised by his FRU handlers to leave home the night before. A new date was set for the operation on account of the leak. The night before the new operation my Incident room was destroyed by fire. This incident, in my opinion, has never been adequately investigated and I believe it was a deliberate act of arson. 3.5 During my first Enquiry I asked to examine particular documents but received written statements that they did not exist. My latest Enquiry team has now recovered all these documents. The dates recorded on them show that they all existed at the time of my first request. Much of the effort of this Enquiry has had, yet again, to be spent building up its own intelligence database and in so doing discovering that it has not been given a full and proper disclosure. 3.6 Following three recent, major disclosures by the Army and the Ministry of Defence I am investigating whether the concealment of documents and information was sanctioned and if so at what levels of the organisations holding them. It has been necessary to interview the same witnesses a number of times because of the failure to provide complete information at the first time of asking. 3.7 I have spoken recently with senior management from the organisations concerned. I am now satisfied that matters have improved and will continue to do so.\n\nChapter four: Conclusion 4.1 My third Enquiry began on 19th April 1999. It has, in conjunction with my two previous Enquiries been the largest investigation undertaken in the United Kingdom. During the course of these three Enquiries 9,256 statements have been taken, 10,391 documents recorded (totalling over 1 million pages) and 16,194 exhibits seized. 4.2 This has led to 144 arrests. So far 94 persons have been convicted. To date 57 separate reports have been submitted to the Director of Public Prosecutions (NI) for his direction. These reports contain the detail of my three Enquiries. 4.3 My recommendations cover the operation of all the security forces in Northern Ireland. They should not be seen in isolation. There have been a number of other reports published in the intervening years since my first Enquiry. The Army undertook a review of their agent handling operations after my first Enquiry had uncovered the criminality of the Army's agent, Brian Nelson. This resulted in the Blelloch report, which established specific guidelines for such operations. More recent reports include the Patten report (1999) on the future of policing in Northern Ireland, the Police Ombudsman for Northern Ireland report on the Omagh bombing (2001) and the report by Her Majesty's Inspectorate of Constabulary into the Police Service of Northern Ireland Special Branch (2002). My recommendations complement and support those contained in them. 4.4 The recommendations arising from my first report and the Blelloch report, together with the recommendations of this report, should be independently reviewed and audited within an agreed time frame. 4.5 My recommendations draw on the information uncovered by my three Enquiries, carried out over the past fourteen years. In most cases the facts have been clearly established; in others the evidence is contradictory and therefore incapable of resolution. 4.6 I have uncovered enough evidence to lead me to believe that the murders of Patrick Finucane and Brian Adam Lambert could have been prevented. I also believe that the RUC investigation of Patrick Finucane's murder should have resulted in the early arrest and detection of his killers. 4.7 I conclude there was collusion in both murders and the circumstances surrounding them. Collusion is evidenced in many ways. This ranges from the wilful failure to keep records, the absence of accountability, the withholding of intelligence and evidence, through to the extreme of agents being involved in murder. 4.8 The failure to keep records or the existence of contradictory accounts can often be perceived as evidence of concealment or malpractice. It limits the opportunity to rebut serious allegations. The absence of accountability allows the acts or omissions of individuals to go undetected. The withholding of information impedes the prevention of crime and the arrest of suspects. The unlawful involvement of agents in murder implies that the security forces sanction killings. 4.9 My three Enquiries have found all these elements of collusion to be present. The co-ordination, dissemination and sharing of intelligence were poor. Informants and agents were allowed to operate without effective control and to participate in terrorist crimes. Nationalists were known to be targeted but were not properly warned or protected. Crucial information was withheld from Senior Investigating Officers. Important evidence was neither exploited nor preserved. 4.10 My enquiries with regard to satisfying the test for prosecution in relation to possible offences arising out of these matters are continuing. The Following Recommendations Are Made: 1. The National Intelligence Model should be introduced into the Police Service of Northern Ireland and supported by the necessary Information Technology. 2. The PSNI should carry out a full review of all their procedures for investigating terrorist offences with a view to establishing a dedicated unit along the lines of the Metropolitan Police model (this was recommended in my first report). 3. An Assistant Chief Constable with single responsibility for the Anti- Terrorist Branch should be appointed and be answerable directly to the Chief Constable. 4. There should be Service Level Agreements between all departments and external partner agencies to ensure clarity and understanding of each other's roles. 5. The Senior Investigating Officer (SIO) of murder and other serious crimes should receive full co-operation and relevant intelligence from Special Branch particularly where Covert Human Intelligence Sources (CHIS) are suspects for murder or other serious crime. 6. Any conflict between the investigation of crime and the protection of agents should be managed through a decision making process overseen by the Regional Assistant Chief Constable. 7. Regionally based Special Branch officers should come under the command of the Regional Assistant Chief Constable. 8. All Regional Special Branch officers of Detective Inspector rank and above should attend the Senior Investigating Officer's course. 9. A pre-requisite for selection to Special Branch should be evidence of investigative experience. 10. Guidelines on the use of CHIS in countering terrorism should be completed as a matter of urgency. These must take account of the existing Regulation of Investigatory Powers Act 2000. 11. An internal strategic review should be undertaken to ensure that CHIS are only employed to achieve a proportionate coverage of the terrorist threat. 12. A full review of training for all agent handlers should be introduced, including integrity issues and the keeping of records. 13. The investigation of murder should be carried out in accordance with the Association of Chief Police Officers' (ACPO) guidelines on Homicide Investigation. 14. Senior Investigating Officers should attend the nationally accredited SIO course and receive critical incident training on scenarios relevant to Northern Ireland. 15. The PSNI should carry out a full review of all their methods and processes of exhibit management. 16. An overarching strategy group of all relevant agencies (Gold group) should be formed at the outset of any major investigation to ensure effective intelligence sharing and to respond to community concerns. 17. All Senior Investigating Officers dealing with terrorist murders must be adequately vetted in order that they can receive and deal with any sensitive intelligence. 18. An internal investigation department should be established by the PSNI in order that any allegations or suspicions of collusion and corruption can be tackled proactively as well as reactively. 19. Integrity testing and Quality Assurance checks should be carried out to ensure that complete confidence is maintained in the security of source intelligence. 20. A senior liaison committee should support future Enquiries of this nature. This should include senior representation from those agencies involved to ensure proper disclosure and accountability in the decision making process. 21. An independent audit and review of my recommendations relating to the Army and the PSNI should be undertaken within an agreed time frame. This process should include recommendations arising from the Blelloch report.\n\nGlossary of Terms RUC Royal Ulster Constabulary DPP(NI) Director of Public Prosecution (Northern Ireland) PSNI Police Service of Northern Ireland BIRW British Irish Rights Watch UFF Ulster Freedom Fighters UDR Ulster Defence Regiment UDA Ulster Defence Association CHIS Covert Human Intelligence Source FRU Force Research Unit SIO Senior Investigating Officer ACPO Association of Chief Police Officers ACC Assistant Chief Constable PONI Police Ombudsman for Northern Ireland HMIC Her Majesty's Inspectorate of Constabulary IT Information Technology SB Special Branch DI Detective Inspector [This summary report was also made available as a PDF File; 243kb]"}, {"url": "https://commanderswire.usatoday.com/2022/08/30/commanders-released-three-defensive-players-on-monday-steven-parker-tyler-clark/", "page_content": "All 32 NFL teams have until 4 p.m. ET Tuesday afternoon to trim their rosters to 53 players. That means every team must release 27 players between the final preseason game and Tuesday’s deadline.\n\nSome teams began making moves on Monday, including the Washington Commanders.\n\nSam Fortier of The Washington Post reported that Washington had released veteran safety Steven Parker.\n\nParker was signed before the first preseason game and played well. Had the Commanders not had young safety depth, Parker could’ve easily made the roster. Parker has spent time with the Rams, Dolphins, Vikings, Cowboys and Giants. His work in the preseason should earn him another look soon.\n\nWashington cut S Steven Parker, per source. — Sam Fortier (@Sam4TR) August 29, 2022\n\nNext, Nicki Jhabvala of The Washington Post reported defensive tackle Tyler Clark was released. The Commanders needed another body at defensive tackle after losing Tim Settle and releasing Matt Ioannidis and signed Clark.\n\nThe Commanders have released DT Tyler Clark, per source. — Nicki Jhabvala (@NickiJhabvala) August 29, 2022\n\nWashington also released undrafted rookie defensive end Jacub Panasiuk. Panasiuk impressed coaches this summer, but the Commanders were likely looking for more experience at defensive end with Chase Young out at least the first four weeks. It wouldn’t be a surprise if Washington signs Panasiuk to the practice squad if he clears waivers.\n\nThe #Commanders are waiving rookie DE Jacub Panasiuk, per source. — Tom Pelissero (@TomPelissero) August 29, 2022\n\nWe’ll keep you posted on all of Washington’s roster moves."}, {"url": "https://www.espn.com/nfl/story/_/id/32834405/former-denver-broncos-wr-demaryius-thomas-33-found-dead-home-police-say", "page_content": "ENGLEWOOD, Colo. -- Former Denver Broncos wide receiver Demaryius Thomas, whose quiet demeanor belied a burning desire to achieve what he routinely called \"everyday greatness,\" has died at age 33, according to police.\n\nRoswell, Georgia, police said Thursday night that Thomas was found dead in his home. Preliminary reports, according to police, indicated Thomas' death might have resulted from a medical issue.\n\nLaTonya Bonseigneur, a first cousin who grew up with Thomas, so close they considered themselves siblings, told The Associated Press that the family believes he died from a seizure.\n\n\"He had been suffering from seizures for over a year, and we believe he had a seizure when he was showering,\" Bonseigneur said early Friday. \"We're not sure when he died. We just spoke with him yesterday.\"\n\nFormer teammates also noted Thursday night that Thomas might have been having seizures in recent months.\n\nThe Broncos released a statement early Friday, mourning the loss of \"an incredible player and a special person.\"\n\n\"We are devastated and completely heartbroken by the sudden, tragic passing of Demaryius Thomas,\" the Broncos said. \"D.T. was beloved by our entire organization, his teammates and coaches, and our fans. Recently retiring as a Bronco, we were very much looking forward to celebrating Demaryius for years to come as one of the greatest players in franchise history.\"\n\nThe Broncos went on to add, \"Demaryius' humility, warmth, kindness and infectious smile will always be remembered by those who knew him and loved him.\"\n\nWe are devastated and completely heartbroken.\n\n\n\nDemaryius' humility, warmth, kindness and infectious smile will always be remembered by those who knew him and loved him. pic.twitter.com/0GLZIr6UP3 — Denver Broncos (@Broncos) December 10, 2021\n\nThomas, who would have turned 34 on Christmas, had announced his retirement from the NFL in June with a short video with a peace sign and his characteristic smile.\n\n\"I'm Demaryius Thomas. I finally came to a decision to hang it up. ... I'm going to retire and I'm going to retire a Denver Bronco,\" he said. \"... I'm done and I did well.\"\n\nHall of Fame quarterback Peyton Manning, who played with Thomas for four seasons, also released a statement early Friday.\n\n\"DT was a better person than he was a player, and he was a Hall of Fame player,\" Manning said. \"That tells you how good of a person he was. He treated my kids like they were his own. He was there for every teammate's charity event. ... Absolutely devastated.\"\n\nSeveral other former teammates and opponents took to social media early Thursday night as reports of Thomas' death began to appear.\n\nBroncos wide receivers coach Zach Azzanni, who coached Thomas in his final season with the Broncos in 2018, tweeted: \"I'm so sad ... I'm heartbroken. I'm at a total loss. I'm sick ... I'm crying I'm just ... I don't know. The Azzanni family will always love you DT. I'm blessed to have known you. RIP #88.\"\n\nGeorgia Tech, where Thomas played college football, posted a picture with the caption \"Rest in peace, Bay Bay\" -- referring to Thomas' nickname.\n\n\"I know I speak on behalf of the entire Georgia Tech football family when I say that we are heartbroken by the news of Demaryius's passing,\" Georgia Tech coach Geoff Collins said in a statement. \"I first got to know Bay Bay during his recruiting process and was fortunate to be a member of the Tech football staff during his true freshman season in 2006. We have grown increasingly closer through the years. I will always remember what a thrill it was for our players when he was able to stop by and spend some time with us during fall camp this past August. Bay Bay was truly one of my favorite people. I will miss him terribly.\"\n\nDeMarcus Ware, a teammate of Thomas' for three seasons, posted a photo of Thomas and himself Thursday night captioned simply \"heartbroken.\" Broncos defensive end Shelby Harris posted \"so sad man,\" and former Thomas teammate and linebacker Brandon Marshall posted \"Love forever bro.\"\n\nThey spoke for many as hundreds of Broncos fans posted videos and other tributes.\n\nDemaryius Thomas played nine of his 10 NFL seasons in Denver. He retired with the team in June. For his career, he had 724 catches, 9,763 yards and 63 touchdowns. Russell Lansford/Icon Sportswire\n\nThomas had been honored by the Broncos during their home opener Sept. 26 against the New York Jets.\n\nHe was the first of two first-round picks for the Broncos in the 2010 NFL draft -- Tim Tebow was the other -- and spent nine seasons with the team. He finished his career as the Broncos' second-leading receiver (9,055 yards), behind only Rod Smith. He is third in franchise history in catches (655) behind Smith and Hall of Famer Shannon Sharpe.\n\nWoke up and saw the really devastating news about my teammate and friend, Demaryius Thomas. So many are going to remember him for his athletic ability... but I'll be remembering him for his kindness, his smile that would light up a room, and the love he had for those in his life. pic.twitter.com/gNVzmJ503X — Tim Tebow (@TimTebow) December 10, 2021\n\nThomas played in 10 seasons overall with the Broncos, Houston Texans and Jets and finished with 724 catches for 9,763 yards and 63 touchdowns.\n\n\"D.T. was the complete package as a wide receiver, growing into one of the very best at his position,\" Broncos president of football operations John Elway said in June after Thomas retired. \"The combination of his size, speed, strength and athleticism was unmatched. Demaryius' remarkable consistency and production were instrumental in our offense setting historic records and our team winning a lot of games, including two AFC Championships and Super Bowl 50.\"\n\nThe Jets honored Thomas in a tweet, saying \"A brilliant career on the field with a light that always shone brighter off of it. Gone way too soon. But your impact remains.\" The Texans also expressed their condolences in a tweet.\n\nThomas had a foot injury -- he had been injured working out before the 2010 draft -- in his first two seasons in the NFL but flourished when healthy. With the arrival of Manning in 2012, Thomas had at least 90 receptions and 1,300 yards in four consecutive seasons, joining Hall of Famers Marvin Harrison and Jerry Rice and Rams legend Torry Holt as the only players to reach those totals over four consecutive seasons.\n\nIn the Broncos' record-setting season in 2013 -- Manning set NFL records for passing yards (5,477) and touchdowns (55) as the Broncos scored a league-record 606 points -- Thomas finished with a career-best 14 touchdowns. The following season, he finished with a career-best 1,619 receiving yards.\n\nThomas routinely said Manning revealed parts of the game that enabled him to elevate his play. Manning had called Thomas one of the best receivers he had played with in his career. When Manning's children would come to practices, Thomas was routinely the first player they would run to as the players had become close friends. Thomas caught Manning's 509th career touchdown pass, which gave the quarterback the career record at the time. A picture of Manning and Thomas posing with a handwritten sign after the game has been on display at the Pro Football Hall of Fame.\n\nDemaryius Thomas Career Highlights • 5-time Pro Bowl selection • 1 of 3 players to have 1,400 receiving yards and 10 receiving TDs in 3 straight seasons (Marvin Harrison, Jerry Rice) • 2nd all-time for Broncos in receiving yards (9,055) and receiving TDs (60) • Set Super Bowl record with 13 receptions in Super Bowl XLVIII (since broken by James White -- 14) • 80-yard TD in overtime in 2011 wild-card round, the longest overtime TD in postseason history\n\nFor many among the team's faithful, Thomas' signature play is the catch-and-run 80-yard touchdown, on a short pass from Tebow, in the first play of overtime to give the Broncos a victory over the Pittsburgh Steelers in the AFC wild-card game following the 2011 season.\n\n\"For as humble and soft-spoken as Demaryius was during his nine years with our organization, you would have never known he was such a dominant player in our league,\" Broncos CEO Joe Ellis said in a statement in June. \"D.T. was an integral part of one of the greatest offenses of all time, putting up record-setting numbers and giving Broncos fans so many unforgettable memories. I've never heard Empower Field at Mile High louder than his game-winning touchdown in overtime against the Steelers in the playoffs.\"\n\nThomas' teammates, coaches and friends have often referred to all he had overcome to reach Georgia Tech and the NFL. His mother, Katina Smith, went to prison on drug charges when Thomas was 11 years old. With his father in the military, Thomas began working before school, picking corn, peas and butter beans for farmers to help support himself.\n\nHis mother's sentence was commuted by President Barack Obama in 2015, and Smith saw her son play football in person for the first time in the Broncos' playoff win over the Steelers in January 2016.\n\nManning, who kneeled down on the game's final play, gave Thomas the football from that play to give to Thomas' mother."}, {"url": "https://heavy.com/news/2016/01/dwight-steven-hammond-oregon-ranchers-protest-prison-arson-fire-land-charges-sentences-age-bundy-armed-militia-judge-photos-family/", "page_content": "An Oregon rancher and his son are at the center of an armed protest against the federal government by a group of militiamen.\n\nDwight and Steven Hammond, of Harney County, were convicted three years ago of setting fires on their ranch that burned federal land. The father and son initially were sentenced to short prison terms, but received new sentences in October, leading to an angry reaction from anti-government protesters, including the sons of Nevada rancher Cliven Bundy.\n\nOn Saturday, Ammon Bundy, his brother, Ryan, and a group of armed men seized a federal building at the Malheur National Wildlife Refuge in rural eastern Oregon. The men are calling for the Hammonds to be released from their prison sentences, and for the national forest land to be returned to the local residents.\n\nThe Hammonds are expected to report to prison Monday.\n\nHere’s what you need to know:\n\n1. They Set Fires in 2001 & 2006 to Protect Their Ranch Lands, But Damaged Federal Property\n\nProtesters supporting the Hammond family. Dwight Hammond and his wife hugging supporters @KTVZ pic.twitter.com/1pIZOay76t — Wanda Moore (@WandaKTVZ) January 2, 2016\n\nDwight Hammond, 73, and his son, Steven, 46, were convicted by a federal jury in 2012 of using fire to destroy federal property, according to the Oregon U.S. Attorney’s office.\n\nThe fires were set on land managed by the U.S. Bureau of Land Management. The Hammonds leased grazing rights for the property from the BLM.\n\nAccording to prosecutors the 2001 fire was located in the Steens Mountain Cooperative Management and Protection Area. The U.s. Attorney’s Office said:\n\nWitnesses at trial, including a relative of the Hammonds, testified the arson occurred shortly after Steven Hammond and his hunting party illegally slaughtered several deer on BLM property. Jurors were told that Steven Hammond handed out ‘Strike Anywhere’ matches with instructions that they be lit and dropped on the ground because they were going to ‘light up the whole country on fire.’ One witness testified that he barely escaped the eight to ten foot high flames caused by the arson. The fire consumed 139 acres of public land and destroyed all evidence of the game violations. After committing the arson, Steven Hammond called the BLM office in Burns, Oregon and claimed the fire was started on Hammond property to burn off invasive species and had inadvertently burned onto public lands. Dwight and Steven Hammond told one of their relatives to keep his mouth shut and that nobody needed to know about the fire.\n\nSteven Hammond was convicted in the 2006 arson, which occurred in the Malheur National Wildlife Refuge:\n\nAn August lightning storm started numerous fires and a burn ban was in effect while BLM firefighters fought those fires. Despite the ban, without permission or notification to BLM, Steven Hammond started several ‘back fires’ in an attempt save the ranch’s winter feed. The fires burned onto public land and were seen by BLM firefighters camped nearby. The firefighters took steps to ensure their safety and reported the arsons.\n\nHammonds and their supporters claim they were targeted by the Bureau of Land Management.\n\n“This prosecution will have a chilling effect across the West among ranchers and others who rely on federal allotments and permits. It will harm the positive relationship many ranchers and organizations have worked to forge with the bureau, and the hard work that has been done on the range,” the Oregon Farm Bureau said. “It also is hypocritical given BLM’s own harm to the range, which goes without consequence. It is unjust. OFB worked quietly behind the scenes with BLM through the spring and summer. That diligent diplomatic effort was fruitless.”\n\n2. Prosecutors Appealed the Lenient Sentences Given to the Hammonds\n\nDwight Hammond was initially sentenced to three months in prison, and Steven Hammond to one year. They both served those sentences, but the federal prosecutor appealed, saying the punishment wasn’t severe enough.\n\nAccording to the U.S. Attorney’s office, the Hammonds argued during their sentencing that the five-year mandatory minimum they faced was unconstitutional, and the trial court agreed. But the Ninth Court of Appeals upheld the federal sentencing law, saying “given the seriousness of arson, the five-year sentence is not grossly disproportionate to the offense.” The Supreme Court rejected the Hammonds case\n\nIn October, they were re-sentenced to the five-year mandatory minimum that their convictions each carried, minus the time they already served. That means both men will serve about four years in prison, which Dwight Hammond has called a “death sentence,” for him according to CBS News.\n\n“We all know the devastating effects that are caused by wildfires. Fires intentionally and illegally set on public lands, even those in a remote area, threaten property and residents and endanger firefighters called to battle the blaze,” Oregon U.S. Attorney Billy Williams said in a statement. “Congress sought to ensure that anyone who maliciously damages United States’ property by fire will serve at least 5 years in prison. These sentences are intended to be long enough to deter those like the Hammonds who disregard the law and place fire fighters and others in jeopardy.”\n\n3. Their Case Caught the Attention of Anti-BLM Groups\n\nPlay\n\nVideo Video related to dwight & steven hammond: 5 fast facts you need to know 2016-01-03T13:44:49-05:00\n\nThe Hammonds case sparked the interest of groups that oppose the Bureau of Land Management, including the family of Nevada rancher Cliven Bundy, who led a tense standoff with the BLM and federal authorities in 2014.\n\nA peaceful protest of outsiders and local residents was held near Hammonds home on Saturday. Following that, Ammon and Ryan Bundy and other armed militiamen went to the nearby Malheur National Wildlife Refuge, which was not occupied by federal employees, and seized the land.\n\nAmmon Bundy told The Oregonian, “The facility has been the tool to do all the tyranny that has been placed upon the Hammonds. We’re planning on staying here for years, absolutely. This is not a decision we’ve made at the last minute.”\n\nIn a Facebook video, he called for others to come to Oregon.\n\n“Calling all freedom loving people to come to Harney County Oregon, come to the Malhuer Wildlife Refuge. The people are finally getting some good use out of a federal facility,” he said in the caption of the video. In a previous video, Bundy called for “all patriots” to “stand up not stand down” and “come prepared.”\n\n4. The Hammonds Say the Bundy & the Militiamen Do Not Speak for Them\n\nPlay\n\nAt Hammond's House Burns Oregon Rally stops at Dwight Hammond's house Burns, OR. 2016-01-02T21:09:00Z\n\nThe Hammonds have said the Bundys and other outside protesters do not speak for them.\n\n“Neither Ammon Bundy nor anyone within his group/organization speak for the Hammond Family,” their attorney, W. Alan Schroder, told KOIN.\n\nThey have not commented since the takeover of the federal building.\n\n5. The Armed Protesters Have Said They Are Willing to Fight & Die for Their Cause\n\nThis is as close as I was allowed to get to the armed militia occupying the Malheur Wildlife Refuge HQ. #burnsoregon pic.twitter.com/DPztu0VsVU — Jason Wilson (@jason_a_w) January 3, 2016\n\nRyan Bundy told the Oregonian, “The best possible outcome is that the ranchers that have been kicked out of the area, then they will come back and reclaim their land, and the wildlife refuge will be shut down forever and the federal government will relinquish such control,” he said. “What we’re doing is not rebellious. What we’re doing is in accordance with the Constitution, which is the supreme law of the land.”\n\nHe said many of the men at the refuge are willing to fight and die to protect the rights of states, counties and individuals to manage local lands."}, {"url": "https://www.espn.com/blog/ncfnation/post/_/id/25363/some-thoughts-on-threet-winning-asus-qb-job", "page_content": "TEMPE, Ariz. -- It's going to be Threet! No, it's Osweiler as they come around the bend! But now Threet is surging!\n\nAnd it's Steven Threet by a nose over Brock Osweiler as Arizona State's starting QB!\n\nSteven Threet will be Arizona State's starter for the opener against Portland State. Rick Scuteri/US Presswire\n\nArizona State's quarterback competition was a bit of a back-and-fourth horse race. While reporters covering Oregon's QB competition seemed to have trouble naming a favorite between Nate Costa and Darron Thomas (Thomas eventually won), it seemed like the competition at ASU always had a leader -- only that leader changed multiple times.\n\nAfter attending Dennis Erickson's press conference -- you can read all his comments here -- and chatting with first-year offensive coordinator Noel Mazzone, it seems that over the past week to 10 days things simply clicked for Threet: He was more consistent at making quick decisions and accurate throws than Osweiler.\n\n\"You've got to be a high-percentage quarterback in this offense,\" said Mazzone, who brought in a quick-strike, spread scheme to fix an offense that has struggled over the past two years. \"You've got to be able to distribute the ball to a lot of different guys... We can make a living off a lot of 4- or 5-yard plays.\"\n\nThreet's experience -- eight starts at Michigan before he transferred -- also was a factor. The junior has played on a big stage before, while Osweiler's lone start was a poor performance at Oregon as a true freshman.\n\nFurther, it seems that it took a while for Threet and Mazzone to find a rapport. Threet was thinking too much early on -- and often outside of the parameters of where Mazzone wanted his thought process to go.\n\n\"Steven is a really intelligent guy,\" Mazzone said. \"If I can bring his intelligence level down to mine, he plays better. I said, 'Steven, if you start thinking like me, we're going to be better.'\"\n\nBoth Threet and Osweiler are good athletes, which means they can escape pressure and work outside of the pocket. That figures to be important with a questionable offensive line.\n\nBut more work remains before Threet is fully annointed as the starter: A pair of games vs. FCS foes -- Portland State on Saturday; Northern Arizona the next weekend -- that can almost serve as preseason games. Osweiler is going to see some action -- though Erickson said he didn't have a plan for how much -- and Threet needs to bring his recent consistency from the practice field into Sun Devil Stadium when the lights are on.\n\nAnd then to the big test: Game three at Wisconsin.\n\nIf Threet struggles and Osweiler thrives when he gets his chance, this QB horse race might have an extra home stretch.\n\n\"We’re committed for [Threet] to be the starter and he will get a lot of opportunities to be the starter,\" Erickson said. \"The bottom line is winning football games and whoever will win football games for us will be the quarterback. Steven has earned the opportunity to start and hopefully it doesn’t change. But if we’re not getting productivity, like any position on our football team, we will have to take a look at something else.”"}, {"url": "https://www.michigandaily.com/uncategorized/michigans-new-quarterback/", "page_content": "At the NFL Scouting Combine last February, Adrian Arrington offered two reasons why he was entering the draft a year early.\n\nArrington, Michigan’s second-leading wide receiver last season, didn’t want to learn the spread offensive scheme under new coach Rich Rodriguez.\n\nThen Arrington bluntly offered his second explanation: “There’s no quarterback there right now.”\n\nIf one of the two hadn’t been the case, Arrington said he likely would have returned to Ann Arbor for his final year of eligibility.\n\nWith Chad Henne’s graduation and the transfer of highly touted freshman Ryan Mallett to Arkansas, Arrington wasn’t the only person wondering about Michigan’s quarterback situation last spring.\n\nAnd then super-recruit Terrelle Pryor chose to attend Ohio State in early March, and the starting quarterback position at Michigan, the next spot in a legendary lineage, became a battle among three unknowns who had a whopping one completion between them.\n\nFor the past seven months, redshirt freshman Steven Threet, redshirt sophomores Nick Sheridan and David Cone, and even true freshman Justin Feagin, have been put down, doubted and made the punch line of jokes.\n\nBut no matter what the media or the public said about them, one was going to be Michigan’s starting quarterback this season.\n\nSecond choice\n\nFrom the beginning, the odds were stacked against Steven Threet ever playing for Michigan.\n\nThreet came to Michigan’s football camp in June after his junior year at Adrian High School. He went through workouts with Mallett, the five-star prospect from Texarkana, Texas.\n\nUnfortunately for Threet, a four-star recruit in his own right, Mallett was Michigan’s top quarterback target for that year’s recruiting class, and he had already committed.\n\n“That was a great experience for him, and he’ll tell you to this day that he competed with Mallett and was the better of the two quarterbacks,” said Phil Jacobs, Threet’s coach at Adrian.\n\nSo with Mallett already in the fold, Michigan asked Threet to wait and see.\n\nBut with offers from a number of BCS-conference programs, including Wisconsin, Stanford, Illinois and Georgia Tech, Threet decided not to wait. In early July, he committed to the Yellow Jackets.\n\n“Steve was disappointed, because he wanted to be a Michigan Man all along,” Jacobs said. “He fell in love with the recruiters and the position coaches at Georgia Tech.”\n\nThreet graduated early from Adrian and arrived at Georgia Tech in January 2007. But soon after Threet arrived, both the coaches that recruited him took jobs elsewhere.\n\nThreet seemed to be Georgia Tech’s backup quarterback at the end of spring camp, behind then-junior Taylor Bennett. But in July of that year, Threet announced he would transfer back to the school he rooted for his whole life: Michigan.\n\nHe didn’t take the decision to transfer lightly, knowing it meant sitting out a year no matter where he went.\n\nFamily played an important role in Threet’s decision. He talked through the pros and cons with his father and his older brother, Jay, who played baseball at Purdue before transferring to Bowling Green for his last two seasons.\n\nWhen he decided to return to Michigan, Threet called Jacobs with a message: “ ‘Coach, I’m going to go back to Michigan, and I’m going to beat Mallett out for that starting job.’ ”\n\nUnexpected competition\n\nAs it turned out, Mallett was out of the picture before Threet even finished his redshirt year.\n\nRodriguez was hired on Dec. 18, 2007. Less than a month later, Mallett enrolled in classes at the University of Arkansas.\n\nMallett officially transferred because he didn’t think he would fit in Rodriguez’s offensive scheme, but there was speculation he wanted to go to school closer to home.\n\nThreet had a strong connection with former Michigan coach Lloyd Carr and his quarterbacks coach Scot Loeffler, too. But he decided to be patient with the transition.\n\n“I think my experience at Georgia Tech kind of helped me with that as well, kind of wait it out, not be irrational about anything,” Threet said. “Let the system work. The coaches made it pretty obvious that you don’t have to be the fastest guy on the team to play quarterback in this offense.”\n\nWith Mallett gone, Threet’s path to the starting spot was certainly clearer. Threet had even played in a similar offensive scheme under Jacobs at Adrian. But before the team started spring camp, another name popped up in conversations.\n\nAt the men’s basketball game against Ohio State in February, Rodriguez was asked about his two scholarship quarterbacks, Threet and Cone.\n\nThe coach answered, and then he threw a third name in the mix: Nick Sheridan.\n\nShortest distance, the longest odds\n\nIn the grand scheme, Sheridan was an unlikely candidate to be a starting quarterback at Michigan. He walked onto the team, lacked the height of most Division-I quarterbacks and he wasn’t particularly fast or strong.\n\nThe son of former Michigan defensive position coach under Carr from 2002-2004 and current New York Giants linebackers coach Bill Sheridan, Nick played quarterback at Saline High School, less than 10 miles from Michigan stadium.\n\nSheridan didn’t receive any scholarship offers from Division-I schools coming out of high school, but Carr invited him to walk on to the Michigan football team. He could have gone to a Division III program and competed for a starting job. But Michigan was too good an opportunity, even if it meant toiling in relative anonymity for four years.\n\n“It was just the best combination of academics and athletics that was available to me,” Sheridan said. “I couldn’t pass up a place like Michigan.”\n\nEven though it seemed unlikely Sheridan would ever see the field at Michigan, he worked as hard as he could, improving every day and thriving on the competition.\n\n“What has been great for him is the fact that he’s been able to be in a program like the University of Michigan where the day-to-day, year-round competition is so fierce that you can’t help but get better,” Bill Sheridan said. “I’m convinced that Nick is much better and much more developed than he ever would have been had he gone to a Division-III school.”\n\nIn fact, Sheridan had improved enough to show Rodriguez that he had the skill set to be a Division-I quarterback.\n\nThe competition\n\nIn spring practice, the battle for the starting quarterback spot developed into a two-man race between Threet and Sheridan, splitting reps equally with the first-team offense.\n\nThreet had more size and arm strength. Sheridan showed flashes of brilliance in the new offense.\n\nQuickly, the media threw questions at both about the position battle. But as many tried to square Sheridan and Threet against each other, they only grew closer.\n\n“It has been a difficult situation at times,” Sheridan said. “Both of us badly want to play. You put the team first. Fortunately, we’re both very unselfish and understand a bitter competition is not going to help the team, and it’s not going to help either of us. I just try to help Steve out, and him the same for me.”\n\nThe pair spent a lot of time watching film together over the summer, trying to understand as much of Rodriguez’s complex offense as they could before fall camp started in early August.\n\nThey developed a rapport that allowed them to keep their relationship light even as they competed for the starting job. They jokingly graded each other’s press conference performances and took digs at each other’s high school (Adrian and Saline are rivals in Michigan’s Southeastern Conference).\n\n“We obviously spend a lot of time together, in the hotel, in meetings, in practice and what not,” Threet said. “When it’s time to be focused and get the job done, we do. But also, it’s good that us, and David Cone as well, we’re pretty good friends. So it makes it a little bit easier.”\n\nFinding a starter\n\nNeither Threet nor Sheridan stood out enough in fall camp for Rodriguez to name a starting quarterback in the week leading up to the season opener against Utah.\n\nWhen Michigan came out against the Utes on Aug. 30, Sheridan, who was starting his first semester on scholarship, was behind center. Threet stood on the sideline with a headset on, relaying the plays.\n\nLate in the first half, the two switched spots. But Threet wasn’t angry about not starting and Sheridan wasn’t upset about getting replaced during the game.\n\n“I’m sure both those guys are preoccupied on a daily basis on Michigan winning football games,” Bill Sheridan said. “They’re just preoccupied with trying to get better as individual quarterbacks. I don’t think those two guys are wrapped on ‘me against you.’ ”\n\nThe next week against Miami (Ohio), Threet took the opening snaps. He did it again on the road against Notre Dame the week after that, playing well enough in South Bend to solidify his starting spot.\n\nThough there’s a lot of pressure on his shoulders now, Threet never appears nervous. He has always been laid back and quick to laugh anytime — and being Michigan’s starting quarterback won’t change that.\n\n“I feel that I can be focused, but be myself, at the same time,” Threet said. “Me as a person, I can’t be uptight. I don’t like that feeling, so that’s not how I’m going to approach a game.”\n\nThough Sheridan hasn’t matched Threet’s success in the first three games of the season, he isn’t planning to cede the starting spot.\n\nBill Sheridan will attend the game tomorrow with the Giants on a bye week, and Nick is hoping his father will get to see him play in person. But even more, he wants Bill to see Michigan upset Wisconsin.\n\n“I’m excited, hopefully I get in there (tomorrow),” Nick Sheridan said. “Who knows what the circumstances will be? If I don’t, that’s OK, too. I just want to win.”\n\nAnswering the doubters\n\nA year ago, few Michigan football fans knew much about Steven Threet and Nick Sheridan. Neither did Adrian Arrinton\n\nBut Threet has stepped up as a capable signal-caller and proven that Arrington was wrong at the NFL Scouting Combine.\n\nAnd now, fans can take a measure of relief — Michigan has a quarterback."}, {"url": "https://bleacherreport.com/articles/618963-steven-threet-to-call-it-a-career-and-why-it-should-make-you-think", "page_content": "Stephen Dunn/Getty Images\n\nIf you have followed the Big House Blog for a few years, you know one of the topics I take very seriously is that of head injuries in football. If you missed those past articles, I will reiterate my stance on the topic:\n\n\n\nFootball is changing. It used to be that if you played high school, college, and maybe even made it to the NFL, you were aware you might be giving up a couple of knees, probably have back problems and maybe injure a shoulder or two. Now, however, it seems the injuries and penalties can be much worse—even devastating.\n\n\n\nChronic Traumatic Encephalopathy—commonly referred to as CTE—is a degenerative brain disease that has been found in football players as young as 18 years old. In boxing, they commonly refer to this disease as being \"punch drunk\". CTE is now showing up in the premature deaths of many football players who struggle with depression. These individuals often experience a brain that is more like that of a 90 year old then a 50 year old.\n\nOne of the higher profile cases was the recent death of Cincinnati Bengals WR Chris Henry. Henry had CTE at the age of 26. There are also studies showing former football players and European soccer players are suffering a higher rate of Lou Gehrig's disease (also known as ALS). Why soccer players? They are taking head shots from a ball traveling at a rate of 80 mph.\n\n\n\nMany researchers linked CTE to concussions, which is accurate, but the more alarming trend is evidence of CTE in players that had no history of concussions; Chris Henry is an example of that theory. Henry reportedly never suffered a concussion. However, after his death from jumping onto a moving vehicle, it was clear he had CTE.\n\n\n\nThis week alone, there have been two alarming cases for football fans and football players, the first incident being the suicide of former Chicago Bears defensive back Dave Duerson. Moments before his death, Duerson sent a text to his family asking for his brain to be tested and the results sent to the NFL. Duerson was suffering from depression and was filing for bankruptcy.\n\n\n\nToday we learn of the apparent retirement of former Michigan QB Steven Threet who has one more year of eligibility left at Arizona State. Steven has suffered four concussions, two of them just last year (Oct. 23 at California and Nov. 26 against UCLA).\n\nThreet told the Arizona Republic on Wednesday that he's still experiencing symptoms—headaches and trouble sleeping—from the last concussion. A source told ESPN that \"Doctors have told him a fifth concussion could be debilitating [..] You don't want to be 35 years old and can't hold up a cup of coffee.\"\n\n\n\nIf you need more proof, read the story about the University of Pennsylvania offensive lineman Owen Thomas who also committed suicide in college. Thomas was the first college football player to have CTE. Here are his mother's chilling words: “I knew there was a missing piece,” says Thomas’ mother, the Rev. Katherine Brearley, of Allentown, Pa. “No one has given me even a hint of an explanation why Owen, at the drop of a hat, would kill himself. It’s out of all proportion and totally out of his character.”\n\n\n\nBelow is an example of the damage on the brain from CTE:\n\n\n\nTop row: Brain sections showing dense tau protein deposition in multiple areas of frontal cortex (boxes).\n\nBottom row: Microscopic images showing large numbers of tau-containing neurofibrillary tangles (dark brown spots) in the areas of damage.\n\n(photo from BU.edu)\n\n\n\n\n\nIf things don't change, these types of head injuries will effect the long term viability of the sport we love, and the NFL is finally starting to take this seriously after years of not believing the evidence.\n\nIt's now clearly starting to effect high school and college football as well. Do you want someone you love playing football? Steven, you are making a great decision. Good luck to you outside of football."}, {"url": "https://www.behindthesteelcurtain.com/2022/3/23/22990391/what-happened-to-the-pittsburgh-steelers-2010-draft-class-pouncey-worilds-sanders-antonio-brown", "page_content": "The 2022 NFL Draft is just over a month away. Last offseason, we dove into a Steelers NFL draft class starting with the 2004 NFL Draft and outlined a successive draft each week. In doing so, each player selected by the Steelers was highlighted as to how their NFL career, or lack thereof, took shape. Each year was outlined with the last three draft classes all combined into one since a large number of the players were still with the team.\n\nSince it worked last season, and since a lot of the research has already been done, let’s look back at they players from these drafts yet again, this time looking at two different years, on separate days, each week leading up to the last week of April. For players no longer in the league, a lot of the information will be the same while others will be updated where needed.\n\nPart 7 of 16 will highlight the Steelers 2010 NFL draft where two wide receivers are still in the league but are currently free agents.\n\nSo let’s take a look at the ten players drafted by the Pittsburgh Steelers in the 2010 NFL draft:\n\nMaurkice Pouncey\n\nCenter, Flordia\n\nRound 1\n\nPick 18\n\nThe former Steelers offensive captain called it a career following the 2020 season. Maurkice Pouncey spent 11 seasons in Pittsburgh and made the Pro Bowl nine times with the only seasons missed were where he played zero snaps and eight snaps on the season due to injury. Pouncey also finished first team All-Pro twice and will be a name floated around years down the road when it comes to enshrinement in the Pro football Hall of Fame. Pouncey has been still involved with players on the Steelers, reportedly working with 2021 rookie center Kendrick Green.\n\nJason Worilds\n\nRound 2\n\nPick 52\n\nIt’s quite the strange story surrounding outside linebacker Jason Worilds. In his first four seasons with the Steelers, he started a total of 21 games with 2013 reaching 11 starts with 8.0 sacks, 63 tackles, and 23 quarterback hits. Worilds’ success to finish out his rookie deal earned him a transition tag for the 2014 season where he started 16 games and had an interception, two fumble recoveries, 7.5 sacks, 59 tackles, and 22 quarterback hits. Set to be a free agent, Worilds announced his retirement on March 11 of 2015. It was widely speculated at the time that Worilds chose to retire in order to dedicate his life more as a Jehovah’s Witness.\n\nEmmanuel Sanders\n\nWide receiver, SMU\n\nRound 3\n\nPick 82\n\nOne of two wide receivers taken in the 2010 draft by the Pittsburgh Steelers, Emmanuel Sanders saw better success beyond his time in Pittsburgh. In his four years in the Steel City, Sanders had 161 receptions for 2,030 yards and 11 touchdowns during the regular season. In his six years with the Denver Broncos, Sanders more than doubled his touchdown output as well as earning Pro Bowl honors in 2014 and 2016. After being traded to the 49ers during the 2019 season, Sanders played with the New Orleans Saints in 2020 where he had 61 receptions for 726 yards and five touchdowns. Sanders was released by the Saints in March of 2021 but signed with the Buffalo Bills the next day. Sanders started 13 games for Buffalo in 2021 and had 42 receptions for 626 yards and four touchdowns along with a touchdown in the postseason. Sanders is currently a free agent.\n\nThaddeus Gibson\n\nLinebacker, Ohio St.\n\nRound 4\n\nPick 116\n\nOutside linebacker Thaddeus Gibson made the Steelers 53-man roster his rookie season only to be waived midway through the season. He was claimed off waivers by the San Francisco 49ers where he appeared in two games. Gibson was released in the middle of training camp by the 49ers in 2011 and landed with the Chicago Bears late in the season. Spending most of training camp with the Bears in 2012, Gibson was released and signed midseason by the Tennessee Titans to their practice squad. Once again waived during training camp in 2013, Gibson was claimed by the Dallas Cowboys but did not make the team. Not landing anywhere else for the season, Gibson played the next two seasons in the Canadian Football League.\n\nChris Scott\n\nGuard, Tennessee\n\nRound 5\n\nPick 151\n\nMaking the Steelers roster his rookie season, Scott did not appear in a game for the Steelers until 2011. After two games on the active roster, Scott was waived and signed to the practice squad for the remainder of 2011. Failing to make the team in 2012, Scott signed with the Green Bay Packers on their practice squad but only lasted part of the season. Scott bounced from the practice squad’s of the Tampa Bay Buccaneers, Tennessee Titans, and Buffalo Bills for the remainder of 2012. In 2013, Scott landed with the Carolina Panthers where he ended up for four seasons and appeared in 45 games with 12 starts. Being placed on injured reserve to start the 2017 season, Scott was released 10 days later. Landing with the New York Giants in 2018, Scott failed to make the team has been out of the NFL ever since.\n\nCrezdon Butler\n\nDefensive back, Clemson\n\nRound 5\n\nPick 164\n\nThe first of the Steelers three compensatory draft picks in 2010, Crezdon Butler made the 53-man roster as a rookie where he appeared in four games with the Steelers. Failing to make the team in 2011, Butler was claimed off waivers by the Arizona cardinals but suffered a dislocated ankle after only appearing in one game. Over the next five seasons, Butler played for seven different clubs. The only team were Butler started any games was for the Tampa Bay Buccaneers in 2014 when he made three starts. After the 2016 season, Butler went on to play in the CFL where he is still a member of the Toronto Argonauts.\n\nJust as interesting about this draft selection was the fact the Steelers gained the compensatory pick from the free-agent loss of Byron Leftwich. The Steelers actually traded their seventh-round pick of the 2010 draft to the Tampa Bay Buccaneers and reacquired Leftwich.\n\nStevenson Sylvester\n\nLinebacker, Utah\n\nRound 5\n\nPick 166\n\nA career special-teams player and reserve linebacker, Stevenson Sylvester made the Steelers 53-man roster from 2010 to 2012. After not making the Steelers in 2013, Sylvester was brought back to the team in October. Following the 2013 season, Sylvester signed with the Buffalo Bills. Unfortunately, he suffered a knee injury during the preseason which ended not just his 2014 campaign but his NFL playing career.\n\nAnother compensatory pick in the fifth round, this choice was from the Steelers losing cornerback Bryant McFadden who was also reacquired by the Steelers in a trade which will be outlined later.\n\nJonathan Dwyer\n\nRunning back, Georgia Tech\n\nRound 6\n\nPick 188\n\nMaking the Steelers 53-man roster his rookie season, Dwyer did not appear in a game until Week 17 where he rushed for 28 yards on nine attempts. Dwyer made the team his first three seasons in Pittsburgh and even had two rushing touchdowns in 2012. Going into 2013, Dwyer did not make the final roster for the Steelers but was re-signed before Week 2 after the Steelers lost LaRod Stephens-Howling to an ACL injury. Dwyer signed with the Arizona Cardinals in 2014 but only appeared in two games where he had 16 carries for 51 yards and one touchdown. Dwyer was arrested for domestic violence against his wife and 18-month-old child on September 17 of 2014 and was placed on the non-football injury list. Dwyer never played in the NFL again.\n\nAntonio Brown\n\nWide receiver, Central Michigan\n\nRound 6\n\nPick 195\n\nThe Steelers acquired an extra sixth-round pick in the 2010 draft by first gaining a fifth-round selection by trading Santonio Holmes to the New York Jets. During the draft, the Steelers traded the pick to move back to the sixth round. In the trade with the Arizona Cardinals, the Steelers also acquired Bryant McFadden who had just left the previous season as a free agent.\n\nAs for the draft pick itself, the Steelers had over 11,000 yards and 74 touchdowns in nine seasons from Antonio Brown before things fell apart. With seven Pro Bowl selections and four first team All-Pro awards, Brown was arguably the best wide receiver in the NFL during his time in Pittsburgh. After forcing a trade during the 2019 offseason, Brown maneuvered his way out of the Oakland Raiders as well and appeared in one game for the New England Patriots before being released due to multiple off-field legal issues. After being suspended for the first eight games of the 2020 season, Brown signed with the Tampa Bay Buccaneers and caught a touchdown in Super Bowl LV. The drama with Brown showed up again in 2021 in Tampa Bay as Brown walked off the field in Week 16. Having already missed nine games throughout the season, Brown threw off his gear after a dispute with head coach Bruce Arians, the details of which are quite different depending on the source. After being released four days later, Brown had ankle surgery and if currently a free agent.\n\nDoug Worthington\n\nDefensive tackle, Ohio St.\n\nRound 7\n\nPick 242\n\nThey can’t all make the 53-man roster, can they? The Steelers final compensatory draft pick in 2010 was initially signed to the Steelers practice squad his rookie year only to be released the next day. Picked up in November by the Tampa Bay Buccaneers on their practice squad, Worthington was signed to the active roster for the very end of the season. Worthington landed with the Washington Redskins during training camp in 2011 and was signed to the practice squad. Also landing on the practice squad in 2012 in Washington, Worthington ended up on the active roster and appeared in six games. Spending the 2013 season on injured reserve with a biceps injury, Worthington was released during training camp in 2014. After spending some time with the San Diego Chargers, Worthington was out of the NFL until mid December when he landed on the Rams practice squad. Worthington appeared in two games in 2015 for the St. Louis Rams before heading back to the practice squad and then ultimately on injured reserve."}]}