{"Rick Mahler was a two-time All-Star.": [{"url": "https://www.baseball-almanac.com/players/player.php?p=mahleri01", "page_content": "Rick Mahler was born on Wednesday, August 5, 1953, in Austin, Texas. Mahler was 25 years old when he broke into the big leagues on April 20, 1979, with the Atlanta Braves. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Rick Mahler baseball stats page.\n\n\"He (Rick Mahler) was a great guy, a great teammate. I talked to him a lot about pitching when I first came up. He was a big help, especially for a young guy who was struggling... My first year in the big leagues I lost 17 games. He was always there to kind of lift you up. Always upbeat.'' - Hall of Famer / Teammate Tom Glavine (The Associated Press. Rick Mahler dies at 51. 2005 March 3.)\n\nRick Mahler threw nine shutouts during his 13-year career. Three of them took place in Opening Day contests! The first, April 6, 1982, was a 2-hitter versus the San Diego Padres. The second, April 8, 1986, was against the Montreal Expos, who had Tim Raines hitting leadoff and Andre Dawson batting clean-up. When he notched his third Opening Day shutout, on April 7, 1987, Mahler tied the National League record for Most Shutouts Won on Opening Day! Do you know either of the other two pitchers (initials & answers at end) who held the mark before Mahler? [C.S. | R.S.]\n\n\n\n\n\n\n\nRick Mahler | 1989 Donruss Baseball Card (#222 | Checklist) | Baseball Almanac Collection\n\nIn 1986, Rick Mahler started a National League leading thirty-nine games for the Atlanta Braves. In 1985, he also started a National League leading thirty nine games, for the Atlanta Braves. No Braves pitcher since Mahler has ever started more than thirty-six games, neither has any pitcher from ANY National League team! [Year by Year Leaders for Games Started]\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://www.baseball-reference.com/bullpen/Rick_Mahler", "page_content": "Richard Keith Mahler\n\nBR page\n\nBiographical Information [ edit ]\n\nPitcher Rick Mahler was a mainstay in the Atlanta Braves rotation for much of the 1980s and won 96 games over his career. He was the Opening Day starter for the Braves five times, throwing shutouts three times in that assignment.\n\nThe brother of Mickey Mahler, Rick was signed as a free agent by Atlanta and scout Al LaMacchia on June 16, 1975. He made his pro debut that summer with the Kingsport Braves and reached the majors early in the 1979 campaign. After splitting time between Atlanta and the Triple A Richmond Braves, he joined the Atlanta rotation late in the 1981 season. He started 1982 with a bang, hurling a two-hit shutout against the San Diego Padres on Opening Day and then blanking the Houston Astros in his next outing. Overall, he went 9-10 that year and made one relief appearance in the NLCS against the St. Louis Cardinals.\n\nAfter spending most of 1983 in the minors with Richmond, Mahler was back in Atlanta in 1984 and went 13-10 with a 3.12 ERA. The next year, he won a career-best 17 games while losing 15 and leading the National League with 272 hits allowed. On Opening Day 1986, he shut out the Montreal Expos, but he went on to lead the NL with 18 losses that summer. The following season, 1987, he held the Philadelphia Phillies scoreless in the Braves' opener.\n\nFollowing the 1988 season, Mahler became a free agent and signed with the Cincinnati Reds. After two years in Cincinnati and a brief stint with the Montreal Expos, he ended his career back in a Braves uniform in 1991.\n\nDuring his career, Mahler lost at least 15 games three times. Four times, he led the NL in hits allowed, and twice he paced the circuit in earned runs allowed. He was regarded as a good fielder, and he hit fairly well for a pitcher, posting a .179 batting average for his career.\n\nAfter his playing career, Mahler was a minor league manager and coach. He was the pitching coach for the Spokane Indians in 1998, Kane County Cougars in 1999 and Omaha Golden Spikes in 2000-2001. He was also a coach for the Kingsport Mets in 2003 and St. Lucie Mets in 2004. He died of a heart attack at age 51 during spring training 2005. At the time of his death, he was a minor league pitching coach for the New York Mets.\n\nNotable Achievements [ edit ]\n\n15 Wins Seasons: 1 (1985)\n\n200 Innings Pitched Seasons: 6 (1982, 1984-1986, 1988 & 1989)\n\nWon a World Series with the Cincinnati Reds in 1990 (he did not play in the World Series)\n\nYear-By-Year Minor League Managerial Record [ edit ]"}, {"url": "https://prabook.com/web/rick.mahler/1946793", "page_content": "Rick Mahler\n\nbaseball player\n\nAugust 5, 1953 (age 51) Austin, Texas , United States\n\nThe two had previously been teammates playing for the Triple-A Richmond Braves. In his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 European Research Area in 1951.1 innings. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season. He made four straight opening day starts beginning in 1985. In 1987, he tied an Netherlands record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 European Research Area. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season. After retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the Saint Louis Cardinals. He also managed Saint Louis\" Double-A affiliate in the Texas League from 1996 to 1997. Mahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets."}, {"url": "https://www.findagrave.com/memorial/10551425/rick-mahler", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.celebsagewiki.com/rick-mahler", "page_content": "Age, Biography and Wiki\n\nRick Mahler was born on 5 August, 1953 in Austin, Texas, United States, is an American baseball player. Discover Rick Mahler's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 52 years old?\n\nPopular As N/A Occupation N/A Age 52 years old Zodiac Sign Leo Born 5 August 1953 Birthday 5 August Birthplace Austin, Texas, United States Date of death March 2, 2005, Died Place Jupiter, Florida, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 5 August. He is a member of famous Player with the age 52 years old group.\n\nRick Mahler Height, Weight & Measurements\n\nAt 52 years old, Rick Mahler height not available right now. We will update Rick Mahler's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nRick Mahler Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Rick Mahler worth at the age of 52 years old? Rick Mahler’s income source is mostly from being a successful Player. He is from United States. We have estimated Rick Mahler's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Player\n\nRick Mahler Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Rick Mahler Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.cbc.ca/sports/baseball/rick-mahler-dies-of-heart-attack-1.545096", "page_content": "Former major-league pitcher Rick Mahler died Wednesday of a heart attack. He was 51.\n\nMahler, a minor-league pitching coach for the New York Mets, was in Jupiter, Fla., preparing to join the Port St. Lucie Mets.\n\n\"I didn't know he had any type of problem,\" Braves manager Bobby Cox said. \"Maybe he didn't, either.\n\n\"It's awful.\"\n\nMahler posted a 96-111 record and 3.99 earned-run average for the Braves, Cincinnati Reds and Montreal Expos between 1979 and 1991.\n\nThe right-hander started 271 of 392 games and pitched 43 complete games with nine shutouts and six saves.\n\n\"I talked to him a lot about pitching when I first came up,\" related Mets pitcher Tom Glavine, who used to pitch for Atlanta.\n\n\"He was a big help, especially for a young guy who was struggling. My first year in the big leagues, I lost 17 games.\n\n\"He was always there to kind of lift you up. Always upbeat.\"\n\nMahler was Atlanta's Opening Day starter five times during the 1980s and tied a National League record with three Opening Day shutouts.\n\nHe also went 1-1 in two playoff starts, defeating the Pittsburgh Pirates in the 1990 National League Championship Series as a member of the Reds.\n\nCincinnati went on to win the World Series.\n\n\"Rick was a great competitor,\" Cox recalled. \"He could pitch.\"\n\nwith files from Sports Network"}, {"url": "https://www.batterypower.com/2022/10/17/23371220/the-best-braves-starting-pitchers-since-1990-maddux-smoltz-glavine-avery-teheran-hudson-spahn-niekro", "page_content": "In March 1992, Suzy Bogguss released, “Aces” the third single off of her album with the same name. Although the song wasn’t about the Braves starting rotation during the 1990s, its title epitomized the excellence of the team’s starting pitching.\n\nBetween Greg Maddux, Tom Glavine, John Smoltz - and a handful of other stablemates who spent seasons in the same rotation as those three Hall of Famers - Braves starters were synonymous with positional superiority for more than a decade.\n\nThere have been other great rotations throughout baseball in the prior century. Rotations of the Orioles in the early ‘70s, the Dodgers in the ‘60s, the Braves and Indians in the ‘50s, the Giants in the 1910s are ones that come to mind as dominating their respective league for multiple years.\n\nInterestingly enough, the last time an organization was as dominate for an entire decade as the 1990s Braves were year-after-year, you have to look no further than the same organization - just a century before.\n\nIn the 1990s, the Braves led the National League in bWAR by pitchers five times ... and Boston did the same one hundred years prior, in the 1890s.\n\n(As an aside, in this piece there will be a lot of talk about wins, which is obviously not the best indicator of a starting pitcher’s effectiveness - and one that has become less-and-less relevant in the last two decades, to the point that it has been almost rendered meaningless. However, given the historical focus of this article, it is a worthy data point that is easy to reference and discuss.)\n\nHistorically, the Braves organization has featured some of the greatest starting pitchers in the history of the game. We will take a look at the most-modern era - beginning in 1990 - in a bit, but before doing so we will review some of the most notable starting pitchers to take the hill for the Braves organization.\n\nGoing back to the earliest days of the franchise - and Major League Baseball itself - Boston featured notable starting pitchers like Tommy Bond, Vic Wells, Jim Whitney, Old Hoss Radbourn, and John Clarkson.\n\nOf that group, only Bond and Whitney have not been elected to the Hall of Fame, although each have borderline cases thanks in large part to both ranking in the top 11 for games started all time for the Braves (Whitney is ninth; Bond is 11th).\n\nAs dominate as that group was, it was their rotation-mate that ranks among the best in the history of the game. That pitcher was Hall of Famer Kid Nichols.\n\nDebuting in 1890, at age 20, the right-hander won 27 games and tossed a career-best seven shutouts as a rookie. In 12 seasons with Boston, Nichols started 502 games, including nine seasons with more than 40 starts. In 1892, Nichols started 51 games while throwing a career-high 453 innings.\n\nNichols, who was elected to the Hall of Fame in 1949, led the National League in wins for three consecutive seasons from 1896 to 1898. His total of 362 wins ranks him seventh all-time in MLB. He also led the NL in shutouts three times (1890, 1894, 1900) and he ranks 25th all-time with 48 total shutouts.\n\nWith Boston, Nichols had a 1.224 WHIP and a 143 ERA+, with Baseball-Reference giving him credit for 107.4 bWAR. That total is second only to Hank Aaron in franchise history. For his career, Nichols ranks fourth all time in MLB history in bWAR, seventh in wins, 11th in inning pitched, and fourth in complete games.\n\nFour decades later, the next franchise great starting pitcher would debut for Boston when Warren Spahn started two games for the Braves in 1942.\n\nUnfortunately, like many other players in MLB, Spahn missed the next three seasons due to military service during World War II. He returned to the team in 1946, but it was his 1947 season that set-in motion a career that saw him become one of the best left-handed starters in the history of the game\n\nBetween 1947 and 1963, Spahn was selected to 17 All Star games while leading the NL in wins eight times - including five seasons in-a-row from 1957 to 1961. He also led the league in complete games a whopping nine times - including a seven-year stretch that started in 1957 and ended in 1963, when he was 42 years old.\n\nSpahn won the Cy Young award in 1957 and finished second three times. Keep in mind that the award didn’t exist until 1956, when Spahn was 35 years old. He finished third in the voting for the inaugural award.\n\nSpahn received MVP votes in 15 difference seasons, with four finishes in the top five (1953, 1956-1958).\n\nIn 20 seasons with the Braves in Boston and Milwaukee, Spahn started 635 games and pitched 5,046 innings. He won 356 game and saved 28. He finished his career splitting his final season between the New York Mets and San Francisco Giants, ending his career with 363 wins - a total that ranks him sixth all-time.\n\nA three-time NL ERA leader - once in each of the three decades he pitched (1947, 1953, 1961) - Spahn is eighth all-time in innings pitched with 5,243.2 after leading the NL four times (1947, 1949, 1958, 1959).\n\nThe Broken Arrow, OK native finished his career with 100.1 bWAR - 99.3 of which came with the Braves. That total places him third in franchise history and behind Aaron and Nichols.\n\nWarren Spahn wasn’t the only Braves starter to have significant impact on the franchise during the late 1940s and 1950s.\n\nIn 1948, fellow starter Johnny Sain was in the midst of the best season of his career. Sain, who like Spahn debuted in 1942 but missed the next three season while in the military, produced back-to-back All Star seasons in 1947 and 1948. He finished second in the MVP voting in ‘48, a season that saw him lead the NL in wins, games started, complete games, innings pitched, and batters faced.\n\nIt was that 1948 season - and specifically the stretch-run in September - that caused Boston Post sports editor Gerald V. Hern to publish a poem which lauded the workload that Boston manager Billy Southworth had given Spahn and Sain as the Braves were trying to win the NL pennant (which they did, only to lose to Larry Doby and the Cleveland Indians in the World Series).\n\nThat poem turned in to a rhyme that is still well known almost 75 years later: “Spahn and Sain; then pray for rain.”\n\nSain’s last season with Boston was in 1951 but he was an All Star again in 1953 with the Yankees, the best of five seasons he spent with the club. After his career ended in 1955 with the Kansas City Athletics, he started his second - and arguably more impactful career as a pitching coach in 1959 with the A’s.\n\nSain coached in six different organizations - including the Atlanta Braves, twice - in a career that spanned from 1959 to 1986.\n\nLinking dominant starting pitching to a team’s success is an easy and obvious action. While it isn’t perfect, nor does it always hold true, is does paint the picture quite well as to the struggles the Braves organization saw for more five decades early in the last century.\n\nOutside of the miracle Braves World Series-winning 1914 team, the team did not finish in first place from 1898 to 1948.\n\nAmong the pitchers on that 1898 Beaneaters’ team? Nichols and Wells. And the Braves 1948 team had Spahn and Sain, as was just outlined.\n\nJoining Spahn in the Braves rotation in 1952 was Lew Burdette, who was traded to Atlanta from the New York Yankees for Sain in August of 1951. In 13 seasons with the Braves, Burdette won 179 games while being selected to three All Star games and finishing third in the 1958 Cy Young voting.\n\nBurdette won 15 or more games eight times between 1953 and 1961 while picking up MVP votes from 1956 through 1959.\n\nBurdette was the star of the 1957 World Series, winning three games in best-of-seven series, including a complete game shutout in Game 7.\n\nBridging the Spahn era with the next Hall of Fame Braves starting pitcher was Tony Cloninger who started 170 games for the Braves from 1961 until being traded in 1968. Although he won 24 games in 1965, he is best remembered for his start with Atlanta on July 3, 1966, when he pitched a complete game as the Braves in beat the Giants. What was most notable about that start for Cloniger was that he stroked two Grand Slams going 3-fo-5 with nine RBI.\n\nAfter the Braves moved to Atlanta in 1966, Ron Reed and Pat Jarvis teamed with Hall of Famer Phil Niekro to solidify the team’s rotation into the early ‘70s.\n\nReed was an All Star in 1968 and started 203 games for the Braves in 10 seasons with the team. He pitched for 19 seasons, finishing his career in 1984, at age 41, with the Chicago White Sox after an eight-year stint with the Phillies as a reliever. He saved 90 games for the team during the regular season and picked up a save for Philadelphia in the 1980 World Series.\n\nJarvis, who spent seven seasons with Atlanta, starting 169 games before finishing his career with Montreal in 1973. From 1967 though 1970, Jarvis averaged 230 innings pitched, pitching to a slightly-above average 101 ERA+ while winning 60 games for Atlanta. On the diamond, he holds two notable historical distinctions: he was the first strikeout victim of Hall of Fame pitcher Nolan Ryan and gave up Hall of Famer Ernie Banks’ 500th home run.\n\nAfter his career ended, Jarvis was elected as sheriff of DeKalb County in metro-Atlanta where he served for 19 years, until resigning in 1995 after being probed by federal prosecutors. After a three-year investigation, he pled guilty to mail fraud in 1999, serving a 15-month federal prison sentence.\n\nSpeaking of former starting pitchers who ran afoul of the law, in 1972, the Braves traded Orlando Cepeda to Oakland for former two-time American League Cy Young winner Denny McLain. At 28, McLain was only three seasons removed from his second Cy Young award with the Tigers but had been mired in numerous personal problems - including ties to the Mob. He was suspended in 1970 for ties to bookmaking activities. He was reinstated after three months, but his career was all-but over.\n\nHis time with Atlanta was the least productive of his career - with a 6.50 ERA in 54 innings for the Braves. He was released in Spring Training, bringing the end to his career. Since his retirement, McClain leveraged his celebrity status in numerous ventures, but also had multiple legal issues across three different decades.\n\nStarting in the late ‘60s and running through the early ‘80s, the Braves organization only appeared in the post-season twice - in 1969 and 1982. In between, the team only finished above .500 three times.\n\nWith Hank Aaron in the waning stages of his career and Dale Murphy making his mark in the ‘80s, it was Niekro who was the star for the team throughout the 1970s.\n\nThe knuckleballer led the National League in innings pitched four times during the ‘70s, the same number of times he led the NL in complete games. He also led the NL in games started three times - all coming in the latter part of the decade, when he was pitching in his late-30s and age 40 season.\n\nThat 1979 season was remarkable for 40-year-old Niekro as he led the NL in win (21) and losses (20). He also led the league by starting 44 games and completing more than half of them - with a league-leading 23 complete games. He also led the NL in innings pitched, hits allowed, home runs allowed, walks, batters hit, and batters faced. He finished sixth in the Cy Young voting, 20th for MVP, and won a Gold Glove.\n\nDurability was a trademark of “Knucksie” who was selected as an All Star four times while with Atlanta and finished in the top 6 of the Cy Young five times (including second in 1969). He also won five Gold Gloves.\n\nHe left Atlanta as a free agent before the 1984 season, and promptly had an All Star season for the New York Yankees, winning 16 games for the team that season.\n\nFor more on Niekro - including is farewell start with Atlanta in 1987 - you can read an article from last year on Battery Power here.\n\nWhen all was said-and-done, Niekro won 318 games in his career. For the Braves, he pitched 21 seasons, winning 268 games (and losing 230) across 740 games that included 595 starts. He threw 226 complete games - including 43 shutouts - and saved 29 games while logging 4,622.1 innings for the franchise.\n\nFor his career, he is 11th all-time in bWAR for pitchers, 16th in wins, 4th in innings pitched, 5th in games started, and 4th in batters faced. Due to the who-knows-where-its-going nature of the knuckleball, he is also 2nd all-time in earned runs, 7th in wild pitches, 4th in hits and - and thanks to many Braves teams who had less hits that the Bee Gees - 5th in losses.\n\nFor the Braves, he is fifth all-time in bWAR, third for pitchers behind Nichols and Spahn. He was elected to the Hall of Fame in 1997.\n\nFor the latter half of the 1970s, the Braves rarely gained more than two seasons out of starting pitchers in the rotation alongside Niekro. Dick Ruthven, Andy Messersmith and Buzz Capra each had an All Star season, but otherwise, the Braves rotation didn’t offer much in terms of high-level success, outside of Niekro.\n\nThe Braves found more success in the early ‘80s, finishing above .500 in 1980, 1982 and 1983. The quality of the team’s rotation played around in organization’s improvement with Pascual Perez, Craig McMurtry, Zane Smith and Rick Mahler providing effective seasons as starters during that time.\n\nPerez became a full-time starter for Atlanta in 1983 and was selected to the only All Star game of his career. He won 29 games between the ‘83 and ‘84 seasons, providing more than 210 innings pitched and a WHIP that averaged 1.225. Unfortunately, he was dreadful in 1985, leading the Braves to release him with rumors of substance abuse issues - which were prevent in baseball during that time - considered a contributing factor to his demise.\n\nPerez would comeback with Montreal in 1987 and spent five seasons in MLB between the Expos and New York Yankees, with his time in Montreal showcasing the promise he showed with Atlanta, including an NL-leading 0.941 WHIP in 1988 and an NL-best 3.38 SO/W in 1989.\n\nUnfortunately, Perez was suspended for a second time for a positive drug test in 1992. Although Perez didn’t appear in an MLB game after the 1991 season, he did return to professional baseball in 1996, pitching in Taiwan. Sadly, Perez was murdered during a robbery at his home in the Dominican Republic in 2012.\n\nPerez’s involvement with one of the most well-known baseball brawls while with Atlanta - and his infamous start missed when he became lost on Atlanta’s perimeter highway - made him one of the more memorable starters of the era despite only starting 96 games in four seasons with Atlanta.\n\nMcMurtry debuted in 1983, with a fantastic rookie season, when he finished second in the NL Rookie of the Year award and seventh in the Cy Young voting by posting a 3.08 ERA with 15 wins for the Braves. That was the high watermark for McMurtry’s career as his sophomore 1984 season saw significant regression although he did provide 30 starts for Atlanta that season. He would only win one game for Atlanta between the 1985 and 1986 seasons, before resurfacing with Texas in the late ‘80s.\n\nMcMurtry, who gave up Barry Bonds’ first homerun in 1986, would make a comeback in 1995 with the Astros appearing in 11 games. After his MLB career ended, he went on to become head baseball coach at Temple College (Texas), where he currently also serves as the athletic director.\n\nSmith would debut in 1984 but didn’t become and full-time member of the rotation until 1986, when the Braves were heading into one of the lowest periods in franchise history. Smith would lead the NL in starts in 1987, winning 15 games for the Braves.\n\nThe best seasons in his 13-year career would come with Montreal (where he joined Perez in the team’s rotation) and later with the Pirates - where he joined former Brave starter Bob Walk in the rotation. Smith would make 35 starts for Pittsburgh in 1991 before finishing his career with the team in 1996 after spending the ‘95 season with Boston.\n\nWith Atlanta, Smith would start 128 games over six seasons. For his career, he finished with an even 100 wins and 20.2 bWAR in 1,919.1 innings pitched.\n\nOne of the more important starting pitchers for Atlanta during the mid-1980s was an aging veteran whose contributions to Atlanta far exceeded the 25 wins and 4.6 bWAR he accumulated in parts of three seasons with the Braves.\n\nDoyle Alexander was originally brought to Atlanta prior to the 1980 season in a trade with the Texas Rangers. At 29, the right-hander was coming off two below-average seasons with the Rangers. For the Braves, Alexander started 35 times and threw seven complete games during the 1980 season as the Braves finished just above .500 with an 81-80 record.\n\nAfter the season, Alexander was whisked away to the Giants. Fast-forward to early July 1986, where the Toronto Blue Jays were struggling in the AL East one season after winning the division under manager Bobby Cox.\n\nWith the 99-win season behind them - and Cox back with Atlanta as General Manager - Toronto traded Alexander to Atlanta for relief prospect Duane Ward. For the Blue Jays, it took a few years, but the deal paid off as Ward became the team’s part-time closer in 1988, sharing the closing role on the lesser side of a time-share, but excelling as the primary set-up man for long-time Toronto closer Tom Henke.\n\nWard became the full-time stopper in 1993, after Henke departed for Texas, leading the AL with 45 saves while being selected to the All Star game. He finished fifth in the AL Cy Young voting (he also finished ninth in 1991). He would be the winning pitcher in Toronto’s World Series-clinching Game 6 that season.\n\nUnfortunately, injuries all-but ended his career after the season. After missing the 1994 season, he would appear in only four games for the Blue Jays in 1995 before retiring with 161 saves in 452 games for the team.\n\nWe might well be talking about Doyle Alexander as the guy that the Braves foolishly gave up Ward for if not for Alexander’s role in another, more legendary trade for the Braves organization.\n\nAfter pitching well in his return to Atlanta in 1986, Alexander was providing the rebuilding Braves with slightly above average production in the rotation while toiling away for an Atlanta squad best-known for aging veterans ending their careers by growing tomatoes in the bullpen.\n\nAs mid-August neared, the Detroit Tigers were looking to add to their rotation behind Jack Morris, Walt Terrell, and Frank Tanana. On August 12, a deal was struck that would send a struggling, hard-throwing minor league pitcher to Atlanta for the 36-year-old Alexander.\n\nAlexander would be almost unstoppable for the Tigers, going 9-0 in 11 starts for Detroit. His 1.53 ERA was supported by a 1.008 WHIP and helped carry Detroit to 98 wins and the AL East title. The Tigers would lose to the Minnesota Twins in the ALCS - with Alexander suffering two losses in the series.\n\nAlexander would be named an All Star in 1988 - for the only time in his career - for the Tigers before ending his career with Detroit in 1989. In 19 seasons, he would win 194 games after making 464 starts with a career ERA of 3.76. He finished in the top six of the Cy Young voting twice - including fourth in 1987 due to his incredible stretch run for the Tigers.\n\nThe young, Michigan-native who the Braves acquired for Alexander? He turned out alright. John Smoltz ended up in the Hall of Fame.\n\nThe 1980s Braves starting rotation would be led - after Niekro departed - by Rick Mahler, whose brother Mickey was a starter for the Braves in the late-’70s (the two were teammates during the 1979 season).\n\nRick Mahler wasn’t an All Star during his career, but in 11 seasons with Atlanta, he started 218 games and appeared in more than 300. He led the NL in games started in 1985 and 1986, with 39 each season.\n\nMahler could have been nicknamed “Mr. Opening Day” in the 1980s because he threw three shutouts in five career Opening Day starts for Atlanta - a notable feat for a pitcher who led the NL in runs allowed four times between 1985 and 1989.\n\nMahler was more than a durable innings-eater for Atlanta during a time that the team was reloading their system with prospects by running out a major league team featuring over-the-hill veterans along-side Dale Murphy. Mahler was excellent in 1981, 1984, and 1985. He struggled in 1983, spending most of the season in AAA, and was below average in mass-usage in 1986 and 1987 - including leading the NL in losses in 1986.\n\nMahler rebounded in 1988, providing near-league average production for an atrocious Braves team. Mahler would leave Atlanta for Cincinnati in 1989, starting 31 games for the Reds that season.\n\nIn 1990, he moved to a swing-man role for the Reds, starting 16 games but also picking up four saves during the team’s World Series-winning season.\n\nAfter joining the Expos in 1991, Mahler was released by the Montreal despite posting a 3.62 ERA across 37.1 innings for Montreal. Atlanta claimed the 37-year-old in mid-June, with him appearing mainly as a low-leverage reliever for six weeks.\n\nThe Braves were 9.5 games out of first place on July 7th but 15 days later, on July 22, the Braves had closed to within 2.5 games of the Dodgers for the division lead. The next week was not fortuitous as the Braves give-up most of their gains as four losses in five games saw Atlanta fall to six games back of Los Angeles.\n\nAtlanta headed into a four-game series with the NL East juggernaut Pirates - a team who they had lost two of three games in Pittsburgh the week prior. Playing a double-leader on a Monday due to a rain-out in May, Atlanta was in jeopardy of being out of the division race by August 1st if they didn’t take the series from the Pirates.\n\nWith Atlanta needing a spot-starter in the second game the July 29th double-header, the Braves turned to Mahler.\n\nMahler turned back the clock that night, winning the final game of his Major League career by pitching six innings of one-run ball, striking out three, to beat John Smiley as the Braves swept the double-header after Tom Glavine had bested Doug Drabek in the first game of the twin-bill. Paired with a Dodgers loss, the Braves moved to 4.5 games back of LA after Mahler’s win and would overtake the Dodgers in late August and would go on to win the division in route to the World Series.\n\nMahler would only appear two more times for the Braves - and in his career - giving up two runs in a single inning of a blow-out loss to the Padres and then starting on August 6 against the Giants at home. Although the Braves would win what was his final game, Mahler gave-up three runs in just two innings, when he walked two and gave up four hits.\n\nThe Braves would release Mahler two days later, bringing an end to a career that saw him provide the team with 16.9 bWAR in 1,558.2 innings pitched during parts of 11 seasons with Atlanta. After he retired, he became a minor league pitching coach and manager for several organizations before passing away during spring training in 2005.\n\nThe Braves ended the 1980s with top prospects Tom Glavine, Pete Smith, and John Smoltz joining Mahler and Zane Smith in the rotation in 1988.\n\nAlthough Pete Smith would start 113 games for the Braves across seven seasons, his only seasons as a full-time starter were in 1988 and 1989, which he started 59 games. He would start between 10 and 14 games each season between 1990 and 1993, with his late ‘92 run of 11 starts seeing him win seven games with an ERA of 2.05 in 12 games.\n\nPete Smith would join the Mets in 1994 and pitch with the Reds and Padres before appearing in 27 games for the Orioles in 1998, the last season of his 11-year career.\n\nThe Braves would end the ‘80s with budding cornerstones of their future juggernaut cutting their teeth and taking their lumps for those dreadful late-’80s teams that lost 106 games in 1988 and 97 in both 1989 and 1990.\n\nThe turnaround was coming, and that will move us into our look at the best Braves starters beginning in 1990. To qualify for a season, a pitcher had to start 21 games in a single season. (That is 60-percent of a 35-start season.) As always, this data is mainly from Baseball-Reference, which you might not love, but works for this retrospective.\n\nBest Single Seasons Since 1990\n\nHere are the best single seasons by a starting pitcher for the Braves since 1990 based on qualifying seasons only.\n\nTop 5 Seasons, bWAR\n\nGreg Maddux, 1995, 9.7\n\nTom Glavine, 1991, 8.5\n\nGreg Maddux, 1994, 8.5\n\nGreg Maddux, 1997, 7.8\n\nJohn Smoltz, 1996, 7.4\n\nTop 5 Seasons, WAA (Wins Above Average)\n\nGreg Maddux, 1995, 8.1\n\nGreg Maddux, 1994, 7.0\n\nTom Glavine, 1991, 6.5\n\nGreg Maddux, 1997, 6.0\n\nJohn Smoltz, 1996, 5.4\n\nTop 5 Seasons, FIP\n\nGreg Maddux, 1995, 2.26\n\nGreg Maddux, 1994, 2.39\n\nGreg Maddux, 1997, 2.43\n\nJohn Smoltz, 1996, 2.64\n\nJohn Smoltz, 1998, 2.71\n\nTop 5 Seasons, WHIP\n\nGreg Maddux, 1995, 0.811\n\nGreg Maddux, 1994, 0.896\n\nGreg Maddux, 1997, 0.946\n\nGreg Maddux, 1998, 0.980\n\nKevin Millwood, 1999, 0.996\n\nTop 5 Seasons, ERA\n\nGreg Maddux, 1994, 1.56\n\nGreg Maddux, 1995, 1.63\n\nGreg Maddux, 1997, 2.20\n\nGreg Maddux, 1998, 2.22\n\nGreg Maddux, 1993, 2.36\n\nTop 5 Seasons, ERA+\n\nGreg Maddux, 1994, 271\n\nGreg Maddux, 1995, 260\n\nGreg Maddux, 1997, 189\n\nGreg Maddux, 1998, 187\n\nMike Soroka, 2019, 171\n\nTop 5 Seasons, IP\n\nGreg Maddux, 1993, 267\n\nJohn Smoltz, 1997, 256\n\nJohn Smoltz, 1996, 253.2\n\nGreg Maddux, 1998, 251\n\nGreg Maddux, 2000, 249.1\n\nTop 5 Seasons, GS (Games Started)\n\nCharlie Leibrandt, 1991, 36\n\nJohn Smoltz, 1991, 36\n\nTom Glavine, 1993, 36\n\nGreg Maddux, 1993, 36\n\nTom Glavine, 1996, 36\n\nTom Glavine, 2002, 36\n\nGreg Maddux, 2003, 36\n\nTop 5 Seasons, Wins\n\nJohn Smoltz, 1996, 24\n\nTom Glavine, 1993, 22\n\nTom Glavine, 2000, 21\n\nRuss Ortiz, 2003, 21\n\nTom Glavine, 1991, 20\n\nTom Glavine, 1992, 20\n\nGreg Maddux, 1993, 20\n\nDenny Neagle, 1997, 20\n\nTom Glavine, 1998, 20\n\nTop 5 Seasons, SO (Strikeouts)\n\nJohn Smoltz, 1996, 276\n\nJohn Smoltz, 1997, 241\n\nJavier Vazquez, 2009, 238\n\nCharlie Morton, 2021, 216\n\nJohn Smoltz, 1992, 215\n\nTop 5 Seasons, SO/9\n\nBrandon Beachy, 2011, 10.7\n\nCharlie Morton, 2021, 10.5\n\nMike Foltynewicz, 2018, 9.9\n\nJohn Smoltz, 1996, 9.8\n\nJavier Vazquez, 2009, 9.8\n\nTommy Hanson, 2011, 9.8\n\nBest Single Seasons by Decade\n\nThese are the best single seasons for starting pitchers per decade based on qualifying seasons only.\n\nTop 5 bWAR, 1990s\n\nGreg Maddux, 1995, 9.7\n\nTom Glavine, 1991, 8.5\n\nGreg Maddux, 1994, 8.5\n\nGreg Maddux, 1997, 7.8\n\nJohn Smoltz, 1996, 7.4\n\nTop 5 WAA, 1990s\n\nGreg Maddux, 1995, 8.1\n\nGreg Maddux, 1994, 7.0\n\nTom Glavine, 1991, 6.5\n\nGreg Maddux, 1997, 6.0\n\nJohn Smoltz, 1996, 5.4\n\nTop 5 FIP, 1990s\n\nGreg Maddux, 1995, 2.26\n\nGreg Maddux, 1994, 2.39\n\nGreg Maddux, 1997, 2.43\n\nJohn Smoltz, 1996, 2.64\n\nJohn Smoltz, 1998, 2.71\n\nTop 5 WHIP, 1990s\n\nGreg Maddux, 1995, 0.811\n\nGreg Maddux, 1994, 0.896\n\nGreg Maddux, 1997, 0.946\n\nGreg Maddux, 1998, 0.980\n\nKevin Millwood, 1999, 0.998\n\nTop 5 ERA+, 1990s\n\nGreg Maddux, 1994, 271\n\nGreg Maddux, 1995, 260\n\nGreg Maddux, 1997, 189\n\nGreg Maddux, 1998, 187\n\nTom Glavine, 1998, 168\n\nTop 5 Wins, 1990s\n\nJohn Smoltz, 1996, 24\n\nTom Glavine, 1993, 22\n\nTom Glavine, 1991, 20\n\nTom Glavine, 1992, 20\n\nGreg Maddux, 1993, 20\n\nDenny Neagle, 1997, 20\n\nTom Glavine, 1998, 20\n\nTop 5 SO, 1990s\n\nJohn Smoltz, 1996, 276\n\nJohn Smoltz, 1997, 241\n\nJohn Smoltz, 1992, 215\n\nJohn Smoltz, 1993, 208\n\nKevin Millwood, 1999, 205\n\nTop 5 bWAR, 2000s\n\nGreg Maddux, 2000, 6.5\n\nJair Jurrjens, 2009, 6.5\n\nJavier Vazquez, 2009, 6.2\n\nJohn Smoltz, 2006, 5.9\n\nGreg Maddux, 2001, 5.3\n\nTop 5 WAA, 2000s\n\nJair Jurrjens, 2009, 4.9\n\nGreg Maddux, 2000, 4.6\n\nJavier Vazquez, 2009, 4.5\n\nJohn Smoltz, 2006, 4.1\n\nGreg Maddux, 2001, 3.3\n\nTop 5 FIP, 2000s\n\nJavier Vazquez, 2009, 2.77\n\nGreg Maddux, 2001, 3.12\n\nJohn Smoltz, 2007, 3.21\n\nGreg Maddux, 2000, 3.23\n\nJohn Smoltz, 2005, 3.27\n\nTop 5 WHIP, 2000s\n\nJavier Vazquez, 2009, 1.026\n\nGreg Maddux, 2001, 1.060\n\nGreg Maddux, 2000, 1.071\n\nJohn Smoltz, 2005, 1.145\n\nKevin Millwood, 2002, 1.157\n\nTop 5 ERA+, 2000s\n\nGreg Maddux, 2002, 159\n\nJair Jurrjens, 2009, 159\n\nGreg Maddux, 2000, 153\n\nJohn Burkett, 2001, 147\n\nGreg Maddux, 2001, 146\n\nTop 5 Wins, 2000s\n\nTom Glavine, 2000, 21\n\nRuss Ortiz, 2003, 21\n\nGreg Maddux, 2000, 19\n\nTom Glavine, 2002, 18\n\nKevin Millwood, 2002, 18\n\nTop 5 SO, 2000s\n\nJavier Vazquez, 2009, 238\n\nJohn Smoltz, 2006, 211\n\nJohn Smoltz, 2007, 197\n\nGreg Maddux, 2000, 190\n\nJohn Burkett, 2001, 187\n\nTop 5 bWAR, 2010s\n\nMike Soroka, 2019, 6.1\n\nTim Hudson, 2010, 5.8\n\nJulio Teheran, 2016, 4.7\n\nJulio Teheran, 2014, 4.3\n\nShelby Miller, 2015, 4.2\n\nMike Foltynewicz, 2018, 4.2\n\nTop 5 WAA, 2010s\n\nMike Soroka, 2019, 4.6\n\nTim Hudson, 2010, 4.0\n\nJulio Teheran, 2016, 3.2\n\nMike Foltynewicz, 2018, 2.8\n\nShelby Miller, 2015, 2.6\n\nTop 5 FIP, 2010s\n\nBrandon Beachy, 2011, 3.19\n\nAlex Wood, 2014, 3.25\n\nTommy Hanson, 2010, 3.31\n\nMike Minor, 2013, 3.37\n\nMike Foltynewicz, 2018, 3.37\n\nTop 5 WHIP, 2010s\n\nJulio Teheran, 2016, 1.053\n\nJulio Teheran, 2014, 1.081\n\nMike Foltynewicz, 2018, 1.082\n\nAnibal Sanchez, 2018, 1.083\n\nMike Minor, 2013, 1.090\n\nTop 5 ERA+, 2010s\n\nMike Soroka, 2019, 171\n\nAnibal Sanchez, 2018, 144\n\nMike Foltynewicz, 2018, 143\n\nTim Hudson, 2010, 138\n\nJulio Teheran, 2016, 129\n\nJair Jurrjens, 2011, 129\n\nTop 5 Wins, 2010s\n\nTim Hudson, 2010, 17\n\nMax Fried, 2019, 17\n\nTim Hudson, 2011, 16\n\nTim Hudson, 2012, 16\n\nDerek Lowe, 2010, 16\n\nTop 5 SO, 2010s\n\nMike Foltynewicz, 2018, 202\n\nJulio Teheran, 2014, 186\n\nMike Minor, 2013, 181\n\nErvin Santana, 2014, 179\n\nMax Fried, 2019, 173\n\nTommy Hanson, 2010, 173\n\nBest Cumulative Qualifying Seasons\n\nThese are the best cumulative totals from qualifying season for Atlanta’s starting pitchers since 1990.\n\nTop 5 bWAR, Cumulative Seasons\n\nGreg Maddux, 66.2\n\nTom Glavine, 57.5\n\nJohn Smoltz, 55.4\n\nTim Hudson, 21.8\n\nJulio Teheran, 20.5\n\nTop 5 WAA, Cumulative Seasons\n\nGreg Maddux, 46.5\n\nTom Glavine, 35.3\n\nJohn Smoltz, 33.3\n\nTim Hudson, 11.3\n\nSteve Avery, 9.9\n\nTop 5 Wins, Cumulative Seasons\n\nTom Glavine, 219\n\nGreg Maddux, 214\n\nJohn Smoltz, 187\n\nTim Hudson, 111\n\nJulio Teheran, 76\n\nTop 5 GS, Cumulative Seasons\n\nTom Glavine, 433\n\nJohn Smoltz, 415\n\nGreg Maddux, 363\n\nTim Hudson, 236\n\nJulio Teheran, 222\n\nTop 5 SO, Cumulative Seasons\n\nJohn Smoltz, 2,470\n\nTom Glavine, 1,860\n\nGreg Maddux, 1,822\n\nJulio Teheran, 1,169\n\nTim Hudson, 967\n\nTop 5 CG, Cumulative Seasons\n\nGreg Maddux, 54\n\nJohn Smoltz, 48\n\nTom Glavine, 45\n\nSteve Avery, 13\n\nCharlie Leibrandt, 11\n\nYoungest and Oldest Qualifiers\n\nTop 5 Youngest\n\nSteve Avery, 1991, 21\n\nMike Soroka, 2019, 21\n\nSteve Avery, 1992, 22\n\nJair Jurrjens, 2008, 22\n\nTommy Hanson, 2009, 22\n\nJulio Teheran, 2013, 22\n\nTop 5 Oldest\n\nR.A. Dickey, 2017, 42\n\nJohn Smoltz, 2007, 40\n\nJohn Smoltz, 2006, 39\n\nDerek Lowe, 2011, 38\n\nJohn Smoltz, 2005, 38\n\nThe Others\n\nIt would be easy to write 10,000 words about each of Greg Maddux, Tom Glavine, and John Smoltz. The three Hall of Fame teammates set a generational standard for excellence as the Atlanta Braves dominated the National League for more than a decade.\n\nAs seen above, those three legends provided 179.1 bWAR in just their qualifying seasons with Atlanta after 1990. Keep in mind that bWAR number doesn’t include Smoltz’s three seasons as closer, nor Smoltz and Glavine’s contributions in non-qualifying seasons.\n\nAs a whole, they approached their craft in different ways, but will always be joined together in the annals of baseball history.\n\nThey weren’t alone, however.\n\nBack in 2009, the band Grizzly Bear released a version of “While You Wait for the Others” featuring Michael McDonald, the solo artist who fronted the band the Doobie Brothers decades earlier.\n\nWhat does that have to do with the Braves starting rotation? You’ll find out, but I’m also checking to see if you are still paying attention.\n\nWhile Maddux, Glavine, and Smoltz were the Big Three (or parts of the Big Three) from 1990 through 2008, there were a number of others who contributed to the overall success of the Braves by providing meaningful production to the team’s starting rotation.\n\nI won’t make you wait any for the others any longer, because I just tied in the song reference. You’re welcome.\n\nCharlie Leibrandt is unfortunately most often remembered due to his odd usage by Bobby Cox in the post-season, but after his arrival from Kansas City for the 1990 season, Leibrandt provided excellent regular season results as the veteran anchor of the Braves young rotation.\n\nFor three seasons, Leibrandt provided a total of 9.6 bWAR, starting 92 games for the team. He was an above average pitcher with an ERA+ between 110 and 126 and a WHIP that ranged from 1.167 to 1.226 while pitching through his age 35 season in 1992.\n\nFor his career, Leibrandt was much better than you may have thought, with 33.3 bWAR provided across 14 seasons, the last of which came with Texas in 1993. Although he won a World Series as a member of the Royals rotation in 1985, his three seasons for Atlanta were the best of his career.\n\nSteve Avery sat opposite Leibrandt as the young, highly touted prospect when he started 20 games (just missing the qualifying total for this piece) in 1990 as a 20-year-old.\n\nThe struggles Avery endured in ‘90 were cast aside in 1991 as he won 18 games in 35 starts with a 116 ERA+ good for 5.2 bWAR (the highest total of his career). Avery, who hit .511 during his senior year of high school, had a remarkable game against the Mets in mid-June, showcasing his all-around skills.\n\nOn June 12, facing Ron Darling, Avery pitched a complete game allowing only five hits and one run on a Howard Johnson home run. Although that that performance was notable itself, Avery starred at the plate, going 4-for-4 with a triple and a run scored.\n\nHe finished sixth in the NL Cy Young voting that season and appeared to be heading toward stardom as “Poison Avery” was named MVP of the 1991 NLCS by throwing 16.1 shut-out innings against the Pirates with 0.796 WHIP good for a 19.2% cWPA. Avery followed that up with a solid World Series featuring a 0.846 WHIP although he did give up five earned runs in 13 innings.\n\nAvery was legend-made at 21.\n\nAvery was at his post-season best in the NLCS, with a 23.8% cWPA in five different season (1991-93, 1995-1996) going 4-1 with a 2.38 ERA in 45.1 innings that included seven starts and 11 total appearances.\n\nHe was also good in World Series - although he is docked with a -12.1% cWPA in four World Series he appeared - he threw 31.2 innings with a 3.41 ERA in five starts and six appearances.\n\nIn the regular season, Avery followed-up his ‘91 season by leading the NL with 35 games started in 1992, throwing a career-high 233.2 innings. He was selected to the All Star team in 1993, a season when he set career bests in ERA, ERA+, WHIP, and tied his career best with 35 starts and 18 wins.\n\nAvery was good, but not great, in 1994. Although he set a career high in strikeouts in 1995, his ERA ballooned to 4.67 and he went 7-13 on the season - although that was due, in part, to bad luck as his secondary numbers remained in-line with those he produced in prior season. The 1996 season was a similar story for Avery, who left Atlanta for Boston as a free agent after the season.\n\nAvery suffered a muscle injury near his shoulder late in the 1993 season; and his heavy workload early in his career is often speculated as a contributing factor to his decline in performance.\n\nAvery struggled in 1997 and 1998 with the Red Sox with an ERA of 5.64 in two seasons with Boston. Boston demoted him to AAA to start the ‘98 season as Avery worked on attempting to transition to a sidearm pitcher. Although he had some initial success, it was ultimately a short-lived experiment.\n\nAvery signed with Cincinnati after his stint with Boston. He pitched in 19 games with the Reds in 1999 before suffering a season-ending injury in July.\n\nAvery attempted to comeback with Atlanta in both 2000 and 2001. In 2000, he pitched in 19 games for four different minor league affiliates, struggling with a combined ERA north of 5. He didn’t pitch in affiliated ball in 2001 after being release by the Braves in Spring Training.\n\nAvery did make a come-back with Detroit in 2003, appearing in 19 games for the Tigers at age 33.\n\nAlthough he pitched in 11 seasons, seven of which were with Atlanta, Avery will always be remembered as the fresh-faced kid who spent his early 20s as the original third pitcher of the Big Three. He won 72 games with Atlanta, making 261 starts for the team from 1990 through 1996.\n\nKent Mercker, who spent the first four seasons of his Braves career working primary as a reliever, moved into the rotation in 1994 and started 26 games in 1995. Mercker pitched well for Atlanta and is the answer to the trivia question for Braves pitchers throwing no-hitters, as he was part of a combined no-hitter in 1991 and pitched a no-hitter in 1994.\n\nThe 5th overall pick in the 1986 June draft, Mercker pitched in 18 seasons, debuting in 1989 for the Braves and ending his career in 2008 at age 40. He started 54 games for Atlanta, but pitched in 251, picking up 20 saves. He returned to Atlanta as a trade deadline pick-up in 2003, tossing 17 innings for the Braves.\n\nInterestingly enough, Mercker is now a star in pickleball. I’ve heard of pickleball, but I still don’t really know what it is. But evidently Mercker - now 54 - is really, really good.\n\nDenny Neagle, an All Star Pittsburgh in 1995, was a trade deadline acquisition by the Braves in 1996. Neagle was 14-6 for the Pirates when the Braves nabbed him. His results with Atlanta were not good as they were with the Pirates as he struggled with a 5.59 ERA in six starts for Atlanta down the stretch. His early-season production was still good enough to see him finish eighth in the Cy Young award.\n\nNeagle turned things around in a big way in 1997, winning 20 games for the Braves with a 2.97 ERA across 233.1 innings. With an ERA+ of 140, and WHIP of 1.084 and 172 strikeouts, Neagle finished third in the Cy Young and was selected as an All Star for the final time in his career.\n\nDespite some regression in 1998, Neagle was still solid pitching 210.1 innings with a 3.55 ERA in 31 starts for Atlanta. The Braves traded Neagle after the ‘98 season to Cincinnati, ended his three-plus seasons with the club.\n\nIn 71 starts for Atlanta, Neagle went 38-19, pitching 482.1 innings with a 3.43ERA and racking up 6.8 bWAR. Although his trade to the Reds yielded Mike Remlinger, who would go on to be an All Star with Atlanta, the trade that brought him to Atlanta cost the Braves highly thought-of pitching prospect Jason Schmidt.\n\nSchmidt would pitch for 14 seasons in MLB, with his six seasons with the Giants besting the six he spent with the Pirates for the high watermarks of his career.\n\nSchmidt and Neagle posted similar career numbers, although Schmidt ended up slightly ahead of Neagle, with 29.5 career bWAR, three All Star selections, and a second and fourth place finish in Cy Young voting.\n\nOne of the reasons that Neagle was expendable when the Braves traded him, was emergence of Kevin Millwood, the latest in an at-the-time seemingly endless run of starting pitching prospects the Braves developed.\n\nMillwood, who debuted for Atlanta in 1997, at age 22, went 17-8 in 1998. He followed that season up with the best of his career in 1999 leading the NL in WHIP with a 0.996. He would be selected as an All Star for the only time in his career and finish third in the Cy Young, going 18-7 with a 2.68 ERA that was good for a 167 ERA+.\n\nMillwood would lead in the NL in starts in 2000 and seemed to be settling into the roll as the Braves long-term fourth starter after posting an 18-8 season with a 3.24 ERA in 2002 at age 27.\n\nAfter the 2002 season, the Braves had expected Greg Maddux to leave via free agency by rejecting salary arbitration, however he opted to remain in Atlanta by accepting arbitration. The decision surprised the Braves who had earlier in the off-season acquired Mike Hampton and Russ Ortiz in separate deals.\n\nMaddux’s unexpected return caused to the Braves to hastily trade Millwood to the Phillies for catcher Johnny Estrada (who was blocked in Philadelphia by long-time backstop Mike Lieberthal) in a transaction that was widely considered a salary dump at the time. Estrada would become Atlanta’s starting catcher in 2004, earning a trip to the All Star game and winning the Silver Slugger. He was solid again in 2005 before being traded to Arizona. Estrada served as an effective bridge between Javy Lopez and Brian McCann.\n\nMillwood would leave Philadelphia after two sub-par seasons, signing a one-year deal with Cleveland for 2005. He’d finish sixth in the AL Cy Young award in 2005, leading the AL with a 2.86 ERA. He leveraged that successful season to get a long-term deal with Texas, with whom he’d spend four seasons.\n\nMillwood’s career ended after the 2012 season with Seattle, winning 169 games and starting 443 games during his 16-year career. Although he put-up 29.8 bWAR, Millwood only had two seasons after leaving Atlanta that were in-line with the seasons he provided with Atlanta - his 2005 season with Cleveland and his 2009 campaign with Texas.\n\nOf the two starting pitchers acquired by the Braves in the 2002 offseason - Hampton and Ortiz - it was Ortiz that ended up providing the best value for Atlanta.\n\nOrtiz pitched two seasons with Atlanta, providing more than 200 innings each season. He was an All Star in 2003, finishing fourth in the Cy Young, after winning an NL-best 21 games. Ortiz walked a lot of batters in his career - leading the league in both 1999 and in 2003. In 2003, he walked 4.3 batters per nine innings contributing to a 1.314 WHIP.\n\nAfter providing Atlanta with similar results in 2004, he left as a free agent for Arizona. He’d go on to pitch until 2010 and would win 113 games during his 12-year career that included 266 career starts and amassed 13.2 career bWAR.\n\nHampton, on the other hand, was an interesting trade acquisition as the Braves took an almost no-risk chance on the former All Star after the Rockies traded him to the Marlins in what amounted to a salary dump.\n\nHampton had a break-out season with the Houston Astros in 1999, winning 22 games and finishing second in the Cy Young. A year from free agency, the Astros smartly traded him to the New York Mets where he posted a second excellent season following up a 155 ERA+ in ‘99 with a 142 ERA+ in 2000. Hampton was also the NLCS MVP for the Mets that post-season.\n\nAs a free agent, Colorado came calling, hoping to add him to their rotation as he was the starting pitcher who had led the NL in fewest home runs allowed per nine innings in back-to-back seasons. Hampton, who was also an excellent hitter, must have thought highly of the schools in the Denver-area as he cited that as the reason he signed with a club that served a pitcher’s purgatory. It also helped that the Rockies offered him an eight-year, $121 million contract.\n\nIn hindsight, the Rockies may have been better off signing Hampton as position player, as he provided the team with 1.9 bWAR as an offensive player, hitting a combined .315/.329/.552 with 10 home runs and a 109 OPS+ in 2001 and 2002.\n\nThe problem was that Colorado signed him to lead their pitching staff, and although he was selected as an All Star in his first season with the team, he ended 2001 with a 99 ERA+ in 203 innings. His 2002 season was an unmitigated disaster, with Hampton’s ERA jumping to 6.15 for the season with a matching 78 ERA+ and an unsightly 1.785 WHIP. He walked more batters than he struck out that season. For those two seasons, he had a -4.7 WAA and -1.6 bWAR.\n\nAfter the 2002 season, the Rockies cut bait with Hampton, sending him to Florida with Juan Pierre in a six-player deal that returned the Colorado catcher Charles Johnson and outfielder Preston Wilson, among others. Two days after that transaction was complete, the Braves sent reliever Tim Spooneybarger and minor leaguer Ryan Baker to the Marlins for Hampton.\n\nIn 2003, at age 30, Hampton rebounded with a 112 ERA+ going 14-8 for the Braves, starting 31 games and winning the Gold Glove (notable, as will be discussed later). He was roughly a league-average pitcher in 2004, but only started 12 games in 2005. Saddled with injuries during the season, Hampton had ligament replacement surgery in September 2005, which would result in him missing the 2006 season.\n\nIn Spring Training 2007, Hampton was hit by injuries again, this time with an issue with his oblique. When he resumed throwing in April, he had elbow discomfort, and resulting in another elbow surgery, causing him to miss the entirety of the 2007 season.\n\nThe Braves hoped to have Hampton back in their rotation to start the 2008 season, but Hampton had an issue with a pectoral muscle in Spring Training and didn’t return as a starter for Atlanta until August 2008 - almost three years from his last start.\n\nHampton would return to Houston for the 2009 season, starting 21 games for the Astros. His career would come to a close after the 2010 season when he pitched 4.1 innings for Arizona.\n\nFor Atlanta, Hampton contributed 35 wins and 85 starts in parts of four seasons spread across six years. For his career, he won 148 games and started 355 games in 16 seasons.\n\nTim Hudson had been fleeced from Oakland in a trade prior to the 2005 season, bringing the two-time All Star and 2000 AL Cy Young runner-up to Atlanta. With Mike Mulder and Barry Zito, Hudson had been part of Oakland’s own “Big Three” at the turn of the millennium.\n\nHudson spent nine seasons with Atlanta, missing parts of three seasons due to injury. He wasn’t quite as effective with the Braves as he had been for the A’s, but he was still an excellent member of the rotation and the anchor for a rotation that saw the last of Atlanta’s Big Three depart when John Smoltz left Atlanta to sign with Boston in 2009.\n\nHudson’s best season with Atlanta came in 2010. He was named an All Star for the only time with Atlanta and finished fourth in the Cy Young vote after finishing 17-9 with a 2.83 ERA across 228.2 innings. Although he significantly overperformed his FIP that season, he did post a 138 ERA+ and had a 1.140 WHIP.\n\nDuring his time with Atlanta, Auburn University’s current pitching coach, started 243 games picking up 113 wins in 1,573 innings pitched finishing just three strikeouts shy of 1,000. He racked up 24.1 bWAR with Atlanta, part of the 57.9 bWAR he accrued throughout a career wrapped up after the 2015 when he spent two seasons with the Giants.\n\nThe early and mid-2000s saw a number of pitchers cycle through Atlanta’s rotation as the team looked to extend their run of division titles. It was an eclectic mix of prospects, veterans, and reclamation projects.\n\nJohn Burkett spent two seasons with Atlanta in 2000 and 2001, with his 2001 being outstanding as he was an All Star for the first time since 1993, starting 34 games and putting up a career-best 147 ERA+ while throwing 219.1 innings.\n\nJohn Thomson was another experienced starter the Braves brought in to shore up their rotation in 2004 - the only season between 1987 and 2008 that Glavine, Smoltz, or Maddux were not in the rotation. Thomson was above average in 2004, making 33 starts, but missed time in both 2005 and 2006 with injuries, starting 17 and 15 games in each season.\n\nHoracio Ramierz started 29 games as a rookie in 2003 and then taking the hill as a starter 32 times in 2005. In parts of four seasons, he started 84 games for Atlanta with a 104 ERA+ before being traded to Seattle for reliever Rafael Soriano in December 2006.\n\nThe Braves hit a homerun when they picked up Jaret Wright on waivers late in the 2003 season. A former top prospect for Cleveland, Wright had been awful as a reliever with the Padres, with an ERA of 8.37 in 39 games for San Diego. He showed promise in a small sample size of nine inning with Atlanta in ‘03 but made the rotation in 2004 and produced the best season of his career in 2004.\n\nWright would start 32 games for Atlanta in ‘04, going 15-8 with a 3.28 ERA and a 130 ERA+. He led the NL in fewest home runs allowed per nine innings while throwing the second most innings of his career.\n\nWright moved on as a free agent after the 2004 season but left behind the magic of his season in Atlanta, pitching only three more seasons in MLB, the last of which came when he was only 31 years old.\n\nGlavine, Smoltz, and Maddux\n\nThey weren’t the original Big Three, as Maddux didn’t join Atlanta until 1993, but for the rest of the 1990s, the National League was dominated by this trio.\n\nTom Glavine\n\nTom Glavine debuted with Atlanta in 1987 with the former hockey player making nine starts while the floundering Braves wrapped up one of many rebuilding seasons the team had in the late ‘80s. He led the NL in losses in 1988, making 34 starts for Atlanta, before turning the corner in 1989 pitching at an almost league-average rate in 29 starts for another awful Braves team. Wash, rise, repeat in 1990.\n\nA veteran of the Braves rotation at age 25 heading into 1991, Glavine broke out in a huge way. After failing to post an ERA+ of better than 98 in his prior four seasons, Glavine would win the NL Cy Young in ‘91, leading the National League in wins, complete games and ERA+. He was named an All Star for the first time, won his first Silver Slugger and finished 11th in the NL MVP vote.\n\nGlavine would lead the NL in wins five times from 1991 to 2000, also leading the NL in games started six times between 1993 and 2002. The tenacious left-hander wasn’t overpowering but lived on the corners as seen by a career walk rate that average more than three per nine innings.\n\nBefore leaving for the New York Mets as a free agent in 2003, Glavine won two Cy Young awards (1991, 1998) and finished in the top three four other times (second in 1992, 2000; third in 1993, 1995). He was selected to eight All Star games as a Brave and won four Silver Slugger awards.\n\nIn the post-season, Glavine is best remembered for his Game 6 start in the 1995 World Series when he won the MVP with a cWPA of 29.0% for the series. For his career, he had a 46.9% cWPA in 35 starts for the Braves and Mets. He was at his best in the World Series, pitching to a 2.16 ERA in 58.1 innings with a WHIP of 0.909 and a 42.6% cWPA.\n\nWith New York, Glavine was a two-time All Star, including a selection in 2006 at age 40. He returned to Atlanta in 2008, making 13 starts before going the disabled list. The Braves released him on June 3rd, as Braves decided to go with top prospect Charlie Morton in the rotation.\n\nGlavine’s two departures from Atlanta were both messy, unfortunate exits for the only member of the Big Three who was an original draft pick of the Braves.\n\nAs seen by the data, Glavine’s career was defined by consistency. During a 22-year career, Glavine threw 183 or more innings in a season 19 times. Only the strike-shortened 1994 season prevented him from doing so in each full season of his career.\n\nGlavine won 305 games in his career, 244 of which came with the Braves. In those 17 seasons in Atlanta, Glavine started 518 games, tossed 22 shutouts, pitched 3,408 innings and created 63.6 of 80.7 career bWAR.\n\nAll time, Glavine is 30th in innings pitched, 29th in bWAR for pitchers, 21st in wins, and 12th in games started. For the Braves, he is ninth in bWAR; fifth among pitchers. He was elected to the Hall of Fame in 2014.\n\nJohn Smoltz\n\nJoining Glavine in the Braves rotation in 1988 was John Smoltz. The hard-throwing right-hander who featured a slider and a tough-on-the-elbow split-finger fastball, started 29 games for the Braves in 1989, being selected to his first All Star game as a 22-year-old that season.\n\nThe 1990 season saw Smoltz lead the league in walks and wild pitches but starting 34 games and throwing the first two shutouts of his career. He started the 1991 campaign by struggling to a 2-11 record. He famously began to see a sports psychologist and proceeded to end the season 12-2 while also being one of the first pro athletes to openly use a mental wellness advisor.\n\nSmoltz would next be an All Star in 1992, when he led the National League in starts, strikeouts, and wild pitches while putting up 246.2 inning and a 130 ERA+. He was an All Star again in 1993 throwing more than 240 innings for the second season in a row.\n\nHe would struggle in 1994, finally undergoing surgery to have bone chips removed from his pitching elbow after throwing only 134.3 innings in 21 starts before the strike.\n\nDespite his success - with some struggles mixed in - Smoltz had not picked up any Cy Young votes through the 1995 season.\n\nWhat he had done, however, was make a name for himself in the post-season, starting with his 1991 NLCS performance against the Pirates. After winning two games against the Pirates - pitching 15.1 innings in two starts, Smoltz fired 14.1 innings in two starts against the Twins in the World Series including the Game 7 classic dual with Jack Morris in Game 7.\n\nFor the 1991 post-season, Smoltz allowed only five runs in 29.2 innings, striking out 26.\n\nSmoltz followed-up ‘91 with by being named MVP of the 1992 NLCS, starting three games against the Pirates for a total of 20.1 inning pitched.\n\nFor his career, Smoltz appeared in 41 post-season games, including 27 starts - all but one with Atlanta. He provided 81.7% cWPA, including 39.2% cWPA in his five World Series performances that included eight starts and 51 innings.\n\nAppearing in 14 post-seasons, Smoltz finished 15-4 with four saves, a 2.67 ERA, and a 1.144 WHIP.\n\nIn 1996, Smoltz put together the best regular season of his career, as he won the NL Cy Young award, finishing 11th in the MVP vote. An All Star that season, he led the NL in wins (24), innings pitched, strikeouts, FIP, and SO/9.\n\nIn 1997, he again led the NL in innings pitched, although he also led the NL in hits allowed, but did pick up the only Silver Slugger award of his career while also leading the NL in starts.\n\nSmoltz only made 26 starts in 1998 but finished fourth in the Cy Young as he went 17-2 with a 144 ERA+. He finished the decade in 1999 with 29 start and his fifth consecutive season with an ERA below 3.20.\n\nThose last two season of the decade saw Smoltz miss time with continued elbow issues. Before the 2000 season, he underwent elbow surgery, missing all of the 2000 season and most of 2001 due to “Tommy John” surgery.\n\nAfter struggling in his return to the rotation post-surgery in 2001, Smoltz moved to the bullpen picking up 10 saves. The next three seasons, Smoltz was one of the premier closers in baseball, leading the NL with 55 saves in 2002 while finishing third in the NL Cy Young vote.\n\nSmoltz returned to the Braves starting rotation in 2005 at age 38, being selected an All Star and pitching 229.2 innings while making 33 starts. He followed-up that season with an NL-best 16 wins and 35 starts in 2006 and being selected as an All Star in 2007 finishing in the top seven in the NL Cy Young each season.\n\nIn the three seasons following his return to the rotation, Smoltz started 100 games, tossing between 205.2 and 232 innings each season, with an ERA+ ranging between 128 and 140.\n\nSmoltz started the 2008 season in the rotation, but a shoulder injury saw him make only five starts before going on the disabled list. He hoped to rejoin the team as a reliever, but blew a save in his only relief appearance, and underwent season-ended surgery.\n\nWith his contract with Atlanta expired, Smoltz signed with the Boston Red Sox in January 2009. He started eight games with Boston after making his debut in June but struggled to an 8.33 ERA in 40 innings with the team. Boston released Smoltz in mid-August.\n\nTwo days after his release, Smoltz signed with the St. Louis Cardinals, faring better in seven starts with a 4.26 ERA in 38 innings. He also appeared in the NLDS for the Cardinals win what would be the last appearance of his career at age 42.\n\nFor his career, Smoltz won 213 games and saved 154 while tossing 3,473 innings and appearing in 723 games - including 481 starts. With Atlanta, Smoltz won 210 games and posted a career ERA+ of 127 and a 1.170 WHIP. He was an eight-time All Star during 21 seasons. For the Braves, he is seventh all time in bWAR and fourth for pitchers. Smoltz was elected to the Hall of Fame in 2015.\n\nGreg Maddux\n\nThe best of the Braves’ Big Three was Greg Maddux, the former Cubs pitcher who signed with Atlanta as a free agent prior to the 1993 season. With Chicago, Maddux was the 1992 NL Cy Young award winner, a two-time All Star and three-time Gold Glove winner.\n\nDebuting in 1986 at age 20, Maddux was an All Star in 1988, winning 18 games while throwing 249 innings. He was even better in 1989, placing fourth in the Cy Young vote and finishing the season with 19 wins and a sub-3 ERA.\n\nFor four seasons, beginning in 1990, he led the NL in games started. Beginning in 1991, Maddux led the NL in innings pitched for five consecutive seasons, including a career-best 268 innings in 1992.\n\nWhen he joined Atlanta in 1993, he was already in the conversation as the best pitcher in the National League - a title he would cement in the next three seasons.\n\nMaddux would win three consecutive NL Cy Young Awards with Atlanta - and four overall. From 1993 to 1995, he would lead the NL in complete games and WHIP while continuing the streak of leading the NL in FIP he started in 1992.\n\nHis 1994 and 1995 seasons were the best in his career - and among the best every posted in the National League in the modern era. Combined between the two seasons, “Mad Dog” had an otherworldly 0.853 WHIP, 265 ERA+, 6.24 SO/W ad 2.32 WHIP. He went 35-8 during those two seasons with a 1.60 ERA in 411.2 innings that included 20 complete games in 53 starts. He added six shutouts for good measure.\n\nTrying to explain Maddux’s brilliance in those two seasons is almost impossible. The numbers tell the story but watching him pitch during those seasons was truly like watching an artist at work.\n\nPick your idiom: He was a man among boys. He was an adult playing against toddlers. He was a professor teaching masters classes to kindergarteners. He was Jimi Hendrix playing guitar; he was Beethoven; he was ...\n\nI am not a good enough writer to effectively express how dominate Greg Maddux was at this peak. If you are too young to have seen him pitch in those years (or if you didn’t follow baseball at that time), trust me when I tell you however good you think he was, he was better.\n\nAlthough he came back to earth slightly in 1996 - an ERA of 2.72 was almost a cause for alarm based on his prior two seasons - he took them bump 35 times pitching 245 innings.\n\nIn 1997 and 1998, he veered back toward his apex, with an ERA that averaged 2.21 and an ERA+ of 188. In 1998, he led the NL in ERA, shutouts, ERA+, and WHIP.\n\nSpeaking of WHIP - only once between 1992 and 2004 did he have a WHIP higher than 1.199. During that streak he had four seasons with a WHIP below 1.000. Furthermore, he produced an ERA+ greater than 104 in every season from 1988 to 2006.\n\nIncredible.\n\nA master of pitch control and location, Maddux led the NL in fewest walks per nine innings nine times in his career. That isn’t surprising, but what is notable is that he led the NL in the last two seasons of his career - his age 41 and 42 seasons.\n\nMaddux would spend his last season with Atlanta in 2003 before returning to Chicago to join the Cubs in 2004. He spent the last several seasons of his career playing with the Dodgers and Padres, both because they were relatively close to his home near Las Vegas.\n\nMaddux spent 11 of his 23 seasons with Atlanta - the best seasons of his career. He would win 194 of his 355 career wins with the Braves, starting 363 games, pitching 61 complete games and 21 shutouts in his 2,526.2 innings pitched. Maybe the most staggering numbers of his Braves career was that his ERA+ was 163 and his WHIP was 1.051.\n\nIn total, Maddux won four NL Cy Young awards, was selected to eight All Star games, won four ERA titles and won 18 Gold Gloves. His streak of 13 straight Gold Gloves was broken by Mike Hampton in 2003.\n\nElected to the Hall of Fame in 2014, Maddux is eighth all time in bWAR for pitchers, eighth in wins, 13th in innings pitched, and fourth in games started. He is also 10th all time in strikeouts with 3,371. With the Braves, he is eighth in bWAR and fifth for pitchers, between Smoltz and Glavine.\n\nWithout a doubt, for as great as Glavine and Smoltz were, the best starting pitcher the Braves employed since 1990 was Greg Maddux. In a poll conducted prior to the publishing of this article, 84-percent of almost 450 responders also selected Maddux as the best starting pitcher.\n\nPost-Big Three\n\nAfter Smoltz’s departed the organization in 2009, the Braves rolled out a starting rotation that included two top prospects, an unusual signing, an over-the-hill veteran, and a veteran on a make-good deal.\n\nWith Tim Hudson injured, the 2009 rotation featured five qualifying starters. They included Jair Jurrjens and Tommy Hanson - both top organizational prospects; the rare-for-the-organizational signing of Japanese free agent Kenshin Kawakami; late-career veteran Derek Lowe; and in-his-prime Javier Vazquez.\n\nThat rotation was surprisingly successful with Jurrjens and Vazquez both putting up two of the best single-season performances of the decade and Hanson flashing the skills that made him such a high up-side prospect. Kawakami was above average while Lowe was adequate.\n\nUnfortunately for the Braves, Lowe’s decline paired with his large contract hamstrung the organization for several seasons. Although Lowe twice led the league in starts (2009, 2011) and gave the team no less than 187 innings in each of his three seasons, he was a below average starter in each season.\n\nKawakami was unable to provide the Braves much value after a solid start. The veteran Japanese hurler made only 16 starts in 2010 going 1-10 and giving up 10.1 hits per nine innings before being sent to the minors. He never returned to Atlanta as he re-signed with Chunichi in Japan in 2012.\n\nVazquez made good on his one-year deal with Atlanta, generating the best season of his career - one that earned him a fourth-place finish in the Cy Young award. He had a sterling 1.026 WHIP and 143 ERA+ in 219.1 innings for Atlanta. Although he was only 32 when he pitched for Atlanta, he only pitched two more seasons in the Majors.\n\nJurrjens came to Atlanta in a trade that sent shortstop Edgar Renteria to Detroit after the 2007 season. The Curacao-native made his debut for Atlanta in 2008, with 31 starts of above average production, garnering him a third-place finish in the NL Rookie of the Year vote that season.\n\nJurrjens followed his rookie campaign with the best season of his career in 2009, leading the NL in starts and tossing 215 innings while generating 6.5 bWAR for the season. He battled injuries in 2010 and 2011, making only 20 starts in 2010. He started the 2011 season with a return to his 2009 form, pitching well enough to be selected to the All Star game, but was befallen by injuries in July and August, with the Braves faltering without their star pitcher and missing the playoffs.\n\nJurrjens was injured again early in the 2012 season and pitched poorly upon his return, with the team sending him to the minors in what would be his last season with the team. He pitched in 15 games with the Angels in 2013, but never returned to the majors despite being only 26 in his last MLB campaign.\n\nWith Atlanta, he did win 50 games and started 118 games across parts of five seasons generating 10.7 bWAR. He was outstanding for a season and-a-half, and good for another.\n\nFor Tommy Hanson, a fast-rising, hard-throwing former 22nd round pick by Atlanta, success was fleeting. Debuting in 2009, Hanson - like Jurrjens the year before - finished third in the NL Rookie of the Year voting, despite making only 21 starts for the team. He was excellent, however, with a 143 ERA+ and 1.183 WHIP, mowing down more than eight batters per nine innings via strikeout.\n\nHanson’s sophomore season was similarly effective, starting 34 games and pitching more than 202 innings in 2010. Injuries began to hamper Hanson in 2011, with shoulder issues limiting him to 22 starts, although he was effective when he pitched, seeing his strike rate increase to almost 10 per nine innings.\n\nBy 2012, he began to see a drop in velocity, and although he made 31 starts, put up the worst numbers of his career, to that point. During the offseason, the Braves traded him to the Angels for reliever Jordan Walden.\n\nHanson would make only 15 appearances for the Angles with health issues and the death of his half-brother impacting his season.\n\nThat 2013 season would be Hanson’s last as a big-league pitcher. After failing to make the Texas roster in spring training, he spent time with the White Sox organization in 2014 and in the Giants minor league the year after.\n\nTragically, Hanson passed away on November 9, 2015, after suffering from a drug overdose, less than three months after his 29th birthday.\n\nFor most of the rest of the 2010s, the Braves cycled through starting pitchers as the team went into, the came out of, a rebuild. The team found success in one-year rentals like Aaron Harang, Ervin Santana, Anibal Sanchez, and R.A. Dickey; and saw Shelby Miller be outstanding in his only season with the team in 2015.\n\nInjuries impacted numerous starters during the decade, including Brandon Beachy - who came out of nowhere be excellent for parts of two seasons; but staying healthy enough to only twice start more than 13 games in a season.\n\nLikewise, Kris Medlen put together one of the best partial seasons in Braves history when he moved into the rotation late in 2012. Debuting in 2009, Medlen split time between the bullpen and rotation, starting 14 games in 31 appearances in 2010. He missed the majority of the 2011 season due to injuries, with “Tommy John” surgery ending his season.\n\nMedlen returned to the Braves in 2012, starting out in the bullpen as he made his way back from the prior year’s surgery. Entering the Braves rotation as the Braves headed into August, Medlen was almost unstoppable, winning the August and September NL Pitcher of the Month awards as threw two complete games and one shutout in seven starts down the stretch.\n\nHis performance earned him down-ballot MVP votes as he earned 4.4 bWAR for the team finishing the season 10-1 with a 1.57 ERA and a Maddux-esque 256 ERA+ in 138 innings.\n\nHe picked-up where he left off in 2013, starting 31 games and pitching a career-high 197 innings. With an ERA+ of 121 and WHIP of 1.223, Medlen provided well above average results - including another NL Pitcher of the Month award in September - in what would be his only full-season as a starting pitcher.\n\nEarly in Spring Training in 2014, Medlen had elbow discomfort that resulted in him having a second Tommy John surgery, missing the ‘14 campaign. After the season, the Braves declined to tender him a contract, making him a free agent.\n\nMedlen would sign with Kansas City and pitch in 15 games, including eight starts, for the Royals during their World Series championship season, pitching well in September. Injury issues continued to plague the switch-hitting right-hander, as he struggled in only six starts with the Royals in 2016.\n\nMedlen re-joined the Braves for Spring Training in 2017 but failed to make the team. He started 20 games in the team’s minor league system but didn’t make a return trip to Atlanta.\n\nMedlen gave pitching one final shot with the Diamondbacks in 2018, starting one game for Arizona before retiring in May of that year.\n\nMedlen (and Beachy) are only 36 years old as of this article’s publish date. When people play the game of “what baseball player would you like to have seen have a career without injuries?” Kris Medlen is right there with Bo Jackson and Eric Davis at the top of my list.\n\nAlex Wood and Mike Minor were both Braves prospects who had success with Atlanta before the team moved them each in trades. Both pitchers, although still active, have struggled with injuries over the years. Wood, in particular, was highly effective in 2014 for Atlanta and was an All Star for the Dodgers in 2017.\n\nThe team also tried out a number of pitching prospects they acquired in the tear-down portion of their rebuild. Aaron Blair didn’t pan out, nor did Matt Wisler, although Wisler re-invented himself as a reliever after failing to stick in the Braves rotation. Although Wisler has been a bit of a journeyman, having pitched in eight seasons, he outlasted Blair who hasn’t pitched in the big leagues since 2017 (although he has pitched in the Atlantic League each of the last two seasons; and had a stint in AA in 2021).\n\nMike Foltynewicz spent parts of five seasons in the Braves rotation - and appeared to breakout in 2018, being selected an All Star and finishing eighth for the Cy Young - but regressed the following season and is now out of baseball after struggling with Texas in 2021.\n\nSean Newcomb showed a lot of promise as a starter in 2017 and built on that in 2018 but wasn’t able to find success after an effective season as a reliever in 2019. Newcomb struggled after wanting to return to starting, posting an ERA north of 11 in four starts in 2020 and putting up borderline average production as a reliever in 2021, as his strikeouts per nine jetted to 12, but his walk-rate increased dramatically as well. The Braves traded him to the Cubs after three appearances in 2022, where he continued to struggle.\n\nWhile there may not have been a single turning point in his career, if there was one, you can point to July 23, 2018. Starting in Dodger Stadium, Newcomb held Los Angeles hitless through 8.2 innings and had two strikes on shortstop Chris Taylor when Taylor singled on Newcomb’s 134th pitch of the night.\n\nNewcomb would end the night with a record of 10-5 with a 3.23 ERA. After a solid start again Washington, he struggled in four of his next five starts (and six of his next eight). He’d end his season 12-9 with a 3.90 ERA over a career-high 164 innings.\n\nThere was one constant in the rotation for most of the 2010s - a homegrown pitcher who stabilized the rotation with seasons that ranged between average and above average.\n\nJulio Teheran debuted in 2011 at age 20 making five appearances for Atlanta but followed that season up by making only two appearances in 2012. He moved into the rotation in 2013 and started 30 games, pitching 185.2 innings before finishing fifth in the NL Rookie of the Year voting.\n\nFrom 2013 through his last season in Atlanta in 2019, Teheran started at least 30 games in each season - including a league-high 33 in 2015. He was an All Star in 2014 and 2016, throwing a career-high 221 innings in 2014, in what was the best season of his career.\n\nTeheran was consistent, providing an average of 193 innings during his time as the plow mule of the Braves rotation. There always seems to be a knock on Teheran that he was miscast as a number one starter - and while that might have been true if he’d been pitching with Glavine, Smoltz, and Maddux, he took the hill season-in-and-season-out during an era when the Braves largely struggled.\n\nDespite is overall consistency, Teheran followed-up each of his two All Star seasons with what ended up being the worst seasons (each slightly below average based on ERA+) during his seven-year run. But, on the average, he had a 109 ERA+ that included three seasons above 117. Likewise, his WHIP was 1.191 during that same timeframe. Speaking candidly, that surprised me. Although he did walk a fairly high number of batters, he didn’t give up an egregious number of hits.\n\nIn nine seasons, Teheran started 236 games for Atlanta (all but four of those coming within the seven seasons from 2013 and 2019), tossing 1,360 innings, with a 3.67 ERA totaling 20.2 bWAR.\n\nThere are comparisons that can be made between Teheran and Rick Mahler, although Teheran was better, they both anchored the Braves pitching staff during an era when the team spent numerous years without realistic playoff aspirations.\n\nTeheran started six Opening Days, including his last season in Atlanta. He signed with the Los Angeles Angels for the 2020 season but struggled in nine starts with a 10.05 ERA. He latched on with Detroit for Spring Training 2021 and made the team; but made only one start - picking up a win - before going on the injured list with shoulder issues from which he was unable to recover enough to return to the Tigers.\n\nNot yet 32 years old, Teheran pitched primarily in Mexico in 2022. Hopefully we haven’t seen the last of Teheran as a pitcher in MLB.\n\nOf the prospects the Braves received during their rebuild, the pitcher who has had the success is Max Fried. Now concluding his fourth season in the rotation, Fried has been the ace of the Braves staff winning 54 games in 108 starts with an ERA of 3.09. His ERA+ has averaged 141, including 208 in the COVID-shortened 2020 season.\n\nWith two seasons left until he is a free agent, the Braves have been benefited from the left-hander’s dominance in the last three seasons when he had had a WHIP below 1.100 each season.\n\nHis 2022 season has been his best, with a career high in innings pitched, SO/W rate, WHIP, and FIP while being selected as an All Star for the first time in his career. A two-time Gold Glove winner, he is almost certain to finish high in the Cy Young vote after the season; with the only question being if he will best the fifth place finish he had in 2020.\n\nFried also holds the distinction of likely being the last pitcher to win a Silver Slugger award, when he won it in 2021.\n\nCharlie Morton’s return to the Braves in 2021 helped to bolster a young rotation. After his debut season with Atlanta in ‘08, Morton spent a decade as a starter - primarily with Pittsburgh - although had never started more than 29 games in a season before his All Star 2018 season with Houston.\n\nMorton signed with Tampa and had the best season of his career in 2019. He finished third in the AL Cy Young voting behind a 1.084 WHIP and career bests in strikeout per nine innings and innings pitched.\n\nHe was excellent upon returning to Atlanta in 2021, leading the league in starts and posting a 130 ERA+ but took a step back in 2022. The Braves recently agreed to bring him back for 2023, so they must believe he will rebound for his upcoming age 39 season.\n\nFive seasons after his debut, Kyle Wright became a full-time member of the rotation, starting 30 games and tossing 180.1 innings while winning 21 games behind a 1.159 WHIP. One season does not a career make, so it will be interesting to see if Wright has become the pitcher the Braves hoped he would be when they selected him fifth overall in the 2017 draft or if regression is in store after struggling during his limited time with Atlanta in the prior four seasons.\n\nIan Anderson, the third overall pick in 2016, has thus far been the inverse of Wright. Pitching well in six starts in 2020, Anderson was above average in 2021 but struggled mightily in 22 starts in 2022 before being optioned to the minor leagues. Only 24 years old, there’s plenty of time for Anderson to rebound, but there are warning signs that there may be cause for concern for his long-term effectiveness as a top-end starter.\n\nAnother former first round pick - who has missed all but three games in the last three seasons due to injury - is Mike Soroka, still only 24, who was outstanding in 2019 while being selected as an All Star, finishing sixth in the Cy Young and second for NL Rookie of the Year.\n\nFor the season, he started 29 games with a 171 ERA+ that included leading the NL in fewest home runs allowed per nine innings; and had a 1.111 WHIP in 174.2 inning.\n\nIn his third start of 2020, Soroka suffered a torn Achilles, which ended his season. Then, after some setbacks in his rehabilitation, he tore the same tendon again in July 2021. He pitched in six games in the Braves minor leagues in 2022, before being shutdown with some arm soreness, but with the hope being that he will be ready for 2023.\n\nNotable Tidbits\n\nHere are some of the notable pieces of information from the data associated with starting pitchers who qualified for this retrospective.\n\nFrom 1990 through 2021 (and excluding 2020), 121 starting pitching seasons qualified. A few pitchers just missed with 20 starts, including Steve Avery (1990), Terry Mulholland (2000), and Buddy Carlyle (2007).\n\nA number of pitchers didn’t qualify despite being somewhat notable additions to the Braves rotation over the years either as veteran additions or prospects who either didn’t pan out or were traded before establishing themselves elsewhere. This includes guys who made close to 20 starts for Atlanta, like: Dallas Keuchel, Brandon McCarthy, Paul Byrd, Odalis Perez, Huascar Ynoa, Kyle Davies, and Randall Delgado.\n\nTwo pitchers provided double-digit bWAR during their time in Atlanta but weren’t part of the top 5: Kevin Millwood (13.1) and Jair Jurrjens (11.9). Charlie Leibrandt was close, with 9.6 bWAR in three seasons.\n\nOnly four pitchers provided negative value, according to their bWAR: Jo-Jo Reyes (-1.0), Shane Reynolds (-0.8), Paul Maholm (-0.3), and Jason Marquis (-0.2). Unsurprisingly, all four pitchers only qualified in a single season with Atlanta.\n\nTen pitchers totaled 100 games started in qualifying seasons with Atlanta.\n\nOne of the more unlikely pitchers to qualify was Jorge Campillo. He had only appeared in eight games (one start) and pitched a total of 17.2 innings in three seasons with Seattle before joining Atlanta for the 2008 season. He appeared in 39 games for Atlanta that season and ended up starting 25 games for the Braves. He was actually pretty good as he pitched 158.2 innings with a 1.235 WHIP and a 107 ERA+ while going 8-7 on the season. After five games with Atlanta in 2009, his MLB career was over at age 30.\n\nThe Braves had seven pitchers start 13 or more games in 2008, with Campillo making the second-most behind Teheran.\n\nThe 121 qualified season provided the Braves with a total of 376.1 bWAR.\n\nGreg Maddux, Tom Glavine, and John Smoltz combined to provide 47.6-percent of the overall bWAR created by Braves starters on this list.\n\nThe 1990s led all decades with 173.6 bWAR, followed by the 2000s with 107.0 bWAR, then the 2010s with 83.3 bWAR.\n\nStarting pitching usage as changed across baseball in the last three decades, which can be seen when looking at the average innings pitched by qualifying starters per decade. In the 1990s, the average was 211.29 innings, in the 2000s that dropped to 191.69, and in the 2010s it fell to 175.43.\n\nIn the 1990s, Atlanta’s starters averaged 156.83 strike outs per season; in the 2000s that number fell to 133.05; and in the 2010s it went back up to 148.16. So, at least for the Braves, the idea that starting pitchers didn’t strikeout as many batters during in the 1990s can be dispelled.\n\nThirty times during this time frame a Braves starter’s ERA was 3.00 or below - almost one per season, on average.\n\nOnly two Braves starters qualified in a single season twice: 2015 (Shelby Miller, Julio Teheran) and 2006 (Tim Hudson, John Smoltz).\n\nThe 2006 season was another season that saw the Braves have seven pitchers start 13 or more games. The second-best starter, behind John Smoltz, was Chuck James despite only starting 18 games.\n\nJames - who pitched eight innings of one-hit ball in his first career start in 2006 - would qualify for this list in 2007, making a career-high 30 starts while providing a tick above league average production.\n\nJames, who notoriously worked as a contractor for Lowe’s installing windows during the off-season even while pitching for Atlanta, battled shoulder injuries that started late in the 2007 season. He pitched in only seven games with Atlanta in 2008, his last with the team. He made a brief return to the big league with Minnesota in 2011.\n\nOnly five pitchers made it through an entire season in the rotation with an ERA that exceeded 5.00. The highest was from Jo-Jo Reyes in 22 starts in 2008 with a 5.81 ERA, followed by Shane Reynolds (2003), Derek Lowe (2011), Jason Marquis (2002), and Matt Wisler (2016).\n\nOnly three pitchers qualified with fewer than 120 innings pitched: Reyes (2008), Marquis (2002), and Mike Foltynewicz (2019).\n\nAnibal Sanchez, who's overall has been quietly effective producing 28.0 bWAR, had a strong season in 2018, he only time spent in Atlanta. He produced 3.3 bWAR despite starting only 24 games, with a 144 EAR+ and a 1.083 WHIP.\n\nOnly 25 times did a qualifying Atlanta starter have an ERA+ less than 100.\n\nA whopping 40 times a Braves starter had an ERA+ of 130 or higher.\n\nUnderscoring the excellence of the Braves rotation during the decade, only eight starting pitchers qualified in the 1990s, with Kent Mercker (1995) being the only starter to qualify in a single season.\n\nIn the history of the Braves organization, four of the qualifying starters rank in the top 10 for games started: Tom Glavine (3), John Smoltz (5), Greg Maddux (6), and Tim Hudson (10).\n\nWhat does the average qualifying starting pitcher profile looked like based on the numbers:\n\nPlaying at 28.9 years old, the “average” Braves starter went 13-9 with a 3.58 ERA in 30 starts with 192 innings pitched and 146 strikeouts.\n\nThe closest actual starter to that average?\n\nTim Hudson in 2005. He was 29 and went 14-9 with a 3.52 ERA in 29 starts and 192 innings pitched (although only 115 strikeouts).\n\nIf you made it this far, I hope you either took a nap or drank a cup of coffee, because this piece went on much longer than originally intended.\n\nBut really, what else should you have expected given that starting pitching excellence is what has defined this organization since Tony! Toni! Tone! made you feel good, Nirvana made you angsty, and Trisha Yearwood made you want to be in love, even if you didn’t have a row to hoe?\n\nThe talent the Braves trotted to the mound during the 1990s and mid-2000s was among the best ever assembled, with General Managers John Mullen, Bobby Cox, and John Schuerholz all playing key roles in drafting, signing, or trading for the pitchers found in this list.\n\nLikewise, a nod must also be given to the pitching coaches who development them, most notably Leo Mazzone, whose 16 years as the Braves pitching coach from 1990 through 2005 will forever be linked with the great rotations he oversaw.\n\nSince the Braves returned to post-season play in 2018, starting pitching has once again stepped to the forefront, although not yet near the levels the team saw three decades ago.\n\nWith a 2023 rotation that could include Spencer Strider, Max Fried, Kyle Wright, and Charlie Morton, the Braves seem to have a formable rotation that would only be strengthened if Mike Soroka is able to return to a form similar to what he exhibited in 2019."}, {"url": "https://www.wikiwand.com/en/Rick_Mahler", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was a major league pitcher as well; the two were Braves teammates in 1979. The brothers had also played together for the Triple-A Richmond Braves.\n\nAmerican baseball player\n\nBaseball player\n\nQuick facts: Rick Mahler, MLB debut, Last MLB appearance, ... ▼\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1984, when he went 13-10 with a 3.12 ERA while hitting .296 at the plate. In 1985, he won his first 7 straight starts and ended up 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. In postseason play, Mahler pitched 3+1⁄3 scoreless innings. Mahler was a key member of the 1990 Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets.[1]"}, {"url": "https://alchetron.com/Rick-Mahler", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon."}, {"url": "https://lawandcrime.com/high-profile/making-a-murderer-jurors-call-b-s-on-dismissed-jurors-claim/", "page_content": "Two unnamed jurors from the Steven Avery trial are now speaking out, and what these jurors say calls into question a story being told by dismissed juror Richard Mahler.\n\nMahler has given many interviews recently in which he repeats the claim he made in the documentary that a preliminary vote taken by jurors at the start of deliberations was 7-not guilty; 2-undecided; 3-guilty. His story is generally portrayed in a way that makes him appear as another lost, last best hope for Steven Avery. As a result, he has become sort of a mini-celebrity in the aftermath of the release of Making a Murderer.\n\nNow there is reason to believe Mahler’s story might not be accurate, according to a new report in InTouch.\n\nIn the recent interview, the magazine separately asked two unnamed jurors about Mahler’s claims; one flatly denied that such a vote took place and the other remembered an informal vote, but stated only three voted not guilty.\n\nThis marks the first time that other jurors have either denied, or at least contradicted Mahler’s story about the preliminary vote. However, like almost everything else with this case, this revelation will only really add confusion and fuel to the fire surrounding the debate about this matter.\n\n[h/t InTouch;image via screengrab]\n\nHave a tip we should know? [email protected]"}], "Rick Mahler won the National League (NL) ERA title in 1985.": [{"url": "https://www.baseball-reference.com/bullpen/Rick_Mahler", "page_content": "Richard Keith Mahler\n\nBR page\n\nBiographical Information [ edit ]\n\nPitcher Rick Mahler was a mainstay in the Atlanta Braves rotation for much of the 1980s and won 96 games over his career. He was the Opening Day starter for the Braves five times, throwing shutouts three times in that assignment.\n\nThe brother of Mickey Mahler, Rick was signed as a free agent by Atlanta and scout Al LaMacchia on June 16, 1975. He made his pro debut that summer with the Kingsport Braves and reached the majors early in the 1979 campaign. After splitting time between Atlanta and the Triple A Richmond Braves, he joined the Atlanta rotation late in the 1981 season. He started 1982 with a bang, hurling a two-hit shutout against the San Diego Padres on Opening Day and then blanking the Houston Astros in his next outing. Overall, he went 9-10 that year and made one relief appearance in the NLCS against the St. Louis Cardinals.\n\nAfter spending most of 1983 in the minors with Richmond, Mahler was back in Atlanta in 1984 and went 13-10 with a 3.12 ERA. The next year, he won a career-best 17 games while losing 15 and leading the National League with 272 hits allowed. On Opening Day 1986, he shut out the Montreal Expos, but he went on to lead the NL with 18 losses that summer. The following season, 1987, he held the Philadelphia Phillies scoreless in the Braves' opener.\n\nFollowing the 1988 season, Mahler became a free agent and signed with the Cincinnati Reds. After two years in Cincinnati and a brief stint with the Montreal Expos, he ended his career back in a Braves uniform in 1991.\n\nDuring his career, Mahler lost at least 15 games three times. Four times, he led the NL in hits allowed, and twice he paced the circuit in earned runs allowed. He was regarded as a good fielder, and he hit fairly well for a pitcher, posting a .179 batting average for his career.\n\nAfter his playing career, Mahler was a minor league manager and coach. He was the pitching coach for the Spokane Indians in 1998, Kane County Cougars in 1999 and Omaha Golden Spikes in 2000-2001. He was also a coach for the Kingsport Mets in 2003 and St. Lucie Mets in 2004. He died of a heart attack at age 51 during spring training 2005. At the time of his death, he was a minor league pitching coach for the New York Mets.\n\nNotable Achievements [ edit ]\n\n15 Wins Seasons: 1 (1985)\n\n200 Innings Pitched Seasons: 6 (1982, 1984-1986, 1988 & 1989)\n\nWon a World Series with the Cincinnati Reds in 1990 (he did not play in the World Series)\n\nYear-By-Year Minor League Managerial Record [ edit ]"}, {"url": "https://www.baseball-almanac.com/players/playerpost.php?p=mahleri01&ps=lcs", "page_content": "\"He (Rick Mahler) was a great guy, a great teammate. I talked to him a lot about pitching when I first came up. He was a big help, especially for a young guy who was struggling... My first year in the big leagues I lost 17 games. He was always there to kind of lift you up. Always upbeat.'' - Hall of Famer / Teammate Tom Glavine (The Associated Press. Rick Mahler dies at 51. 2005 March 3.)\n\nThe League Championship Series determines who wins the league pennant and advances to the World Series. Prior to 1969, the pennant winner was determined by the best won-loss record at the end of the regular season. A structured playoff series began in 1969, when both the National and American League reorganized into two divisions each, East and West. The two division winners within each league played each other in a best-of-five series to determine who would advanced to the World Series. In 1985, the format of the League Championship Series changed to best-of-seven.\n\nDid you know that 65,829 fans watched the League Championship game played on October 11, 2003 - the most of any single game in Major League history? Did you know the smallest crowd at a League Championship game was 24,265 and that game was played on October 11, 1973?\n\nDo you like the existing playoff format? Do you dislike it? Should Major League Baseball reduce the number of teams and bring back the pennant winner format? Share your opinion with us on Baseball Fever."}, {"url": "https://www.nytimes.com/1985/05/19/sports/national-league-braves-mahler-wins-8th.html", "page_content": "Rick Mahler drilled a three-run double in the second to support his eighth pitching victory, the most in the majors, as the Braves beat the Chicago Cubs today, 4-3.\n\nMahler (8-2) surrendered seven hits over eight innings, walked two and struck out two. Bruce Sutter pitched the final inning to earn his seventh save.\n\nAtlanta took a 3-0 lead in the second off Dennis Eckersley (4-3). Dale Murphy led off with a single and, one out later, went to second on a single by Rafael Ramirez. Glenn Hubbard walked to load the bases. With two out, Mahler hit his double to right-center. Atlanta added a run in the sixth off the reliever Lary Sorensen on a single by Bruce Benedict.\n\nChicago scored twice in the eighth. With two outs, Ryne Sandberg singled and Gary Matthews hit his fourth homer. Keith Moreland and Ron Cey led off with singles in the ninth, and Davey Lopes stroked a pinch double to left field to drive in the final Cub run."}, {"url": "https://peoplepill.com/people/rick-mahler/", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon."}, {"url": "https://www.baseball-reference.com/bullpen/1985_National_League", "page_content": "The 1985 season of the National League was the one hundred tenth season of the league.\n\nBR page\n\nSeason summary [ edit ]\n\nStandings [ edit ]\n\nBold indicates league champion, Italics indicates World Series champion\n\nLeague leaders [ edit ]\n\nBold indicates league record, Italics indicate all-time record\n\nBatting [ edit ]\n\nPitching [ edit ]\n\nAll-Star Game [ edit ]\n\nThe National League won the fifty-sixth midsummer classic at Hubert H. Humphrey Metrodome in Minneapolis, MN on Tuesday, July 16, 1985 by a score of 6 to 1. The league's manager was Dick Williams.\n\nPostseason [ edit ]\n\nThe National League Championship Series, featured St. Louis Cardinals, the Eastern Division winner, and the Los Angeles Dodgers, the Western Division winner. The Cardinals defeated the Dodgers, 4 games to 2.\n\nIn the World Series, the National League champion St. Louis Cardinals were defeated by the American League's Kansas City Royals, 4 games to 3.\n\nAward winners [ edit ]\n\nThe winner of the league's Most Valuable Player Award, given its Most Valuable Player, was Willie McGee, an outfielder with the St. Louis Cardinals. In the award's voting, he had 280 out of a possible 336 points and 14 first place votes.\n\nThe winner of the league's Cy Young Award, given its best pitcher, was Dwight Gooden of the New York Mets. In the award's voting, he had 120 out of a possible 120 points and 24 first place votes.\n\nThe winner of the league's Rookie of the Year Award, given its best rookie player, was Vince Coleman, an outfielder with the St. Louis Cardinals. In the award's voting, he had 120 out of a possible 120 points and 24 first place votes.\n\nGold Gloves [ edit ]\n\nThe following players won the Gold Glove Award, given to the league's best fielders as voted upon by its managers and coaches, at their respective position.\n\nSilver Sluggers [ edit ]\n\nThe following players won the Silver Slugger Award, given to the league's best fielders as voted upon by its managers and coaches, at their respective position.\n\nMonthly Awards [ edit ]\n\nHall of Fame Game [ edit ]\n\nThe forty-second annual Hall of Fame Game was played on July 29 at Doubleday Field in Cooperstown, NY near the National Baseball Hall of Fame. In the game, the National League's Houston Astros defeated the Boston Red Sox of the American League by a score of 5 to 3 in 10 innings.\n\nNotable events [ edit ]\n\nUmpires [ edit ]\n\n\n\n\n\nThis page on a league season in need of some additional content. Please help the Bullpen by expanding it, or learn how to contribute.\n\n\n\n"}, {"url": "http://historicbaseball.com/players/m/mahler_rick.html", "page_content": "\n\n\n\nSponsor a page on Historic Baseball! Click here for details\n\nRick Mahler\n\nRichard Keith Mahler\n\nBorn: Aug. 5, 1953 in Austin, Texas\n\nDied: March 2, 2005 in Jupiter, Fla.\n\nDebut: 1979 | Pos: P\n\nH: 6'1\" | W: 202 | B: R | T: R\n\nYrs W L G SV IP SO ERA 13 96 111 392 6 1951.1 952 3.99\n\n>> Visit the Rick Mahler biography on Baseball Almanac for complete statistics.\n\nRick Mahler, who won 96 games in his 13-year career in the major leagues, died of a heart attack at his home in Jupiter, Fla., on March 2, 2005. He was 51.\n\nMahler was 96-111 in 13 seasons with a 3.99 career ERA. He pitched 1,951.1 innings pitched and recorded 952 strikeouts.\n\nMahler was scheduled to begin his second season as a minor league pitching coach for the New York Mets with the Class A team in Port St. Lucie.\n\n\"He was a great guy, a great teammate,\" Tom Glavine, friend and former teammate, said in wire reports. \"I talked to him a lot about pitching when I first came up. He was a big help, especially for a young guy who was struggling.\"\n\nMahler debuted with Atlanta in 1979 and his best seasons with the team came from 1984 to 1986. In 1985, he was 17-15 with a 3.48 ERA in 266.2 innings on a team that won just 66 games.\n\nIn 1986, he won 14 games, but led the major leagues with 18 losses.\n\nHe pitched for the Reds in 1989 and 1990, pitched 10 games for Montreal in 1991 and finished up his career with the Atlanta Braves in 1991.\n\nHe pitched twice in the postseason -- with Atlanta in the NLCS in 1982 and with Cincinnati in the NLCS in 1990.\n\nHis brother, Mickey, also pitched in the major leagues and posted a 14-32 record from 1977 to 1986.\n\nMahler worked in the minor league organizations of Kansas City, Florida and St. Louis before becoming the manager of the Cardinals' Double-A affiliate in the Texas League in 1996-97."}, {"url": "https://infogalactic.com/info/Rick_Mahler", "page_content": "From Infogalactic: the planetary knowledge core\n\nRichard Keith Mahler (August 5, 1953 in Austin, Texas – March 2, 2005 in Jupiter, Florida) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon.[1]\n\nReferences"}, {"url": "https://www.baseball-almanac.com/players/pitchinglogs.php?p=mahleri01&y=1985", "page_content": "Rick Mahler pitched in 39 Major League games during the 1985 regular season. The chart below is a comprehensive analysis of the games Mahler pitched in, specifically relating to his 1985 pitching statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Mahler started that game. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Rick Mahler pitched 19 games at home, had an ERA of 3.27, pitched 135 innings, allowed 131 hits, had 49 earned runs, 53 runs, and 12 home runs, walked 38 batters (4 intentionally), threw 1 wild pitches, hit batters 1 times, and balked 1 times?\n\nOn the road, Rick Mahler pitched 20 games, had an ERA of 3.70, pitched 131.2 innings, allowed 141 hits, had 54 earned runs, 63 runs, and 12 home runs, walked 41 batters (4 intentionally), threw 2 wild pitches, hit batters 1 times, and balked 0 times.\n\nAre you a Rick Mahler fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}, {"url": "https://www.celebsagewiki.com/rick-mahler", "page_content": "Age, Biography and Wiki\n\nRick Mahler was born on 5 August, 1953 in Austin, Texas, United States, is an American baseball player. Discover Rick Mahler's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 52 years old?\n\nPopular As N/A Occupation N/A Age 52 years old Zodiac Sign Leo Born 5 August 1953 Birthday 5 August Birthplace Austin, Texas, United States Date of death March 2, 2005, Died Place Jupiter, Florida, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 5 August. He is a member of famous Player with the age 52 years old group.\n\nRick Mahler Height, Weight & Measurements\n\nAt 52 years old, Rick Mahler height not available right now. We will update Rick Mahler's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nRick Mahler Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Rick Mahler worth at the age of 52 years old? Rick Mahler’s income source is mostly from being a successful Player. He is from United States. We have estimated Rick Mahler's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Player\n\nRick Mahler Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Rick Mahler Wikipedia Imdb\n\nTimeline"}, {"url": "https://alchetron.com/Rick-Mahler", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon."}]}