{"Rick Mahler was drafted by the Braves in the first round of the 1975 amateur draft.": [{"url": "https://www.baseball-almanac.com/players/player.php?p=mahleri01", "page_content": "Rick Mahler was born on Wednesday, August 5, 1953, in Austin, Texas. Mahler was 25 years old when he broke into the big leagues on April 20, 1979, with the Atlanta Braves. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Rick Mahler baseball stats page.\n\n\"He (Rick Mahler) was a great guy, a great teammate. I talked to him a lot about pitching when I first came up. He was a big help, especially for a young guy who was struggling... My first year in the big leagues I lost 17 games. He was always there to kind of lift you up. Always upbeat.'' - Hall of Famer / Teammate Tom Glavine (The Associated Press. Rick Mahler dies at 51. 2005 March 3.)\n\nRick Mahler threw nine shutouts during his 13-year career. Three of them took place in Opening Day contests! The first, April 6, 1982, was a 2-hitter versus the San Diego Padres. The second, April 8, 1986, was against the Montreal Expos, who had Tim Raines hitting leadoff and Andre Dawson batting clean-up. When he notched his third Opening Day shutout, on April 7, 1987, Mahler tied the National League record for Most Shutouts Won on Opening Day! Do you know either of the other two pitchers (initials & answers at end) who held the mark before Mahler? [C.S. | R.S.]\n\n\n\n\n\n\n\nRick Mahler | 1989 Donruss Baseball Card (#222 | Checklist) | Baseball Almanac Collection\n\nIn 1986, Rick Mahler started a National League leading thirty-nine games for the Atlanta Braves. In 1985, he also started a National League leading thirty nine games, for the Atlanta Braves. No Braves pitcher since Mahler has ever started more than thirty-six games, neither has any pitcher from ANY National League team! [Year by Year Leaders for Games Started]\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://prabook.com/web/rick.mahler/1946793", "page_content": "Rick Mahler\n\nbaseball player\n\nAugust 5, 1953 (age 51) Austin, Texas , United States\n\nThe two had previously been teammates playing for the Triple-A Richmond Braves. In his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 European Research Area in 1951.1 innings. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season. He made four straight opening day starts beginning in 1985. In 1987, he tied an Netherlands record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 European Research Area. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season. After retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the Saint Louis Cardinals. He also managed Saint Louis\" Double-A affiliate in the Texas League from 1996 to 1997. Mahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets."}, {"url": "https://peoplepill.com/people/rick-mahler/", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon."}, {"url": "https://bravesjournal.com/2006/10/21/no-30-rick-mahler/", "page_content": "Righthanded Pitcher\n\nSeasons With Braves: 1979-1988; 1991\n\nStats With Braves: 79-89, 4.00 ERA\n\nI may have struggled with Rick’s ranking even more than Glenn Hubbard’s. The raw numbers say that he was an average or slightly below-average pitcher for the bulk of his Braves career. His ERA is worse than the league average, but that’s park effects; adjust for that, and it’s average. He didn’t strike a lot of people out and thus allowed a lot of balls in play. Considering the defense behind him, that was not ideal. I expect that the two thoughts that crossed Mahler’s mind most when he was on the mound in those years were “Please hit it to Hubbard” and “How did he drop that?”\n\nRick was signed as an undrafted free agent out of Trinity University in 1975. He dominated the low minors but ran into a speedbump in Richmond in 1977. He righted the ship and spent the next three years pitching the International League to a standstill with only 15 relief appearances in the majors in 1979 and two in 1980 to show for it. Bobby finally gave him a full chance in 1981 and he responded by going 8-6 with a 2.80 ERA, pitching both relief and in the rotation.\n\nRick wasn’t as good in 1982 and wound up spending most of 1983 back in Richmond. From 1984 to 1988 he was the workhorse of the big league staff. He pitched very well in the first two years, a combined 30-25 with a 3.32 ERA (well below the league considering the park). The team collapsed anyway, and Mahler had a rough time the next two seasons, even falling out of the rotation in 1987. He rebounded some in 1988, putting up an ERA right about the average, but that team was so bad he went 9-16 anyway. He left as a free agent after the season, but was more or less washed up. After a couple of seasons in Cincinnati and a half season with the Expos, he was released.\n\nThe Braves brought Mahler back (middle of a pennant drive, though nobody quite believed that in June of 1991) but he really had nothing left. Mostly he pitched relief, but did make two starts. In one of them, against the Pirates on July 29, he went six innings, allowed two runs, and got the win. But he wiped out in his second start, against the Giants, and that was the last appearance of his career.\n\nSo, how does he rank? Hard to say. He pitched a lot of innings for the Braves. Only four men (you probably know who) have pitched more for the team since 1966. On the other hand, those innings were largely piled into a five-year stretch where the team went 341-465, so what good were they? He wasn’t an ace, really, he was just the best that they had. The only positive category in which he ever led the league was starts, twice. On the other hand, he led the league in hits allowed four times, earned runs allowed twice, and losses once.\n\nI tend to think that given a real defense behind him, Rick Mahler would have won a lot of games. The Braves’ defense was very bad, and he was a guy who needed a good defense. In a way, it’s surprising that he did as well as he did. Tom Glavine couldn’t have won with the defense Mahler had to work with. In point of fact, he didn’t; he only became Tom Glavine when they were replaced with real infielders. Think on it: if Mahler could put up average ERAs with Bob Horner, Ken Oberkfell, and the Dysfunctional Duo (Ramirez and Thomas) behind him, what could he have done with Lemke and Pendleton?\n\nBut in the end, he didn’t get that chance, and with the hand he was dealt he was ordinary. At any rate, I still don’t really know where to rank him. It’s possible that he really doesn’t belong, but I just couldn’t see it.\n\nRick Mahler Statistics – Baseball-Reference.com"}, {"url": "https://theathletic.com/3430774/2022/07/18/atlanta-braves-mlb-draft-day-1/", "page_content": "WASHINGTON, D.C. — Some of Owen Murphy’s hitting statistics were as absurdly good as his jaw-dropping pitching stats at his Illinois high school. And in the immediate aftermath of going to the Braves with the 20th pick of the MLB Draft on Sunday, Murphy said he intended to pursue his dream of being a two-way player, à la Shohei Ohtani, and that the Braves had agreed to let him.\n\nAdvertisement\n\nCall it youthful exuberance, or initial excitement over being selected higher than he thought possible before the draft began, but Murphy’s assertion wasn’t accurate. The Braves intend for him, like the other three right-handed pitchers they took with their four picks on the draft’s first day, to pitch. And only pitch.\n\n“He loves baseball, first and foremost,” Dana Brown, Braves vice president of scouting, said shortly after selecting Murphy and another hard-throwing high schooler, JR Ritchie of Bainbridge Island, Wash., with the 35th pick, a Competitive Balance selection the Braves got from Kansas City in a July 11 trade for Drew Waters and two pitching prospects.\n\n“But (Murphy) knew going in that he was more of a prospect as a pitcher, and he knew that his path to the big leagues is quicker as a pitcher, so he embraced that, and we were excited about it,” Brown said. “We feel like we got a good one.”\n\nBrown returned to the Braves’ draft room after that Zoom interview to prepare for the remaining Day 1 selections: Texas high school pitcher Cole Phillips, whose fastball was clocked at 100 mph before season-ending Tommy John surgery in April that dropped him to the second round at pick No. 57; and Auburn closer Blake Burkhalter, who had 71 strikeouts with seven walks in 46 1/3 innings as a junior.\n\nWhile Brown and his staff were working to make those last two picks, Murphy did a Zoom interview with Atlanta reporters, during which he was asked how hard it would be to give up hitting, considering the Illinois Gatorade Player of the Year hit .550 with 18 home runs in 36 games as a shortstop in his senior year, and set Brookfield-Riverside High career records for homers (30), RBIs (130) and average (.548).\n\nThat’s in addition to going 9-0 with an astounding 0.12 ERA as a senior, throwing four no-hitters, including two perfect games, and allowing 10 hits and four walks with 137 strikeouts in 58 1/3 innings. Teams including the Braves thought of him as a potential fourth- or fifth-round pick as a position player, but the Braves saw him as a first-round pitcher.\n\nOwen Murphy, 2022 Draft prospect and @NDBaseball commit, got it done on both sides of the ball in #PDPLeague21 action. The 3B/RHP out of Illinois fanned six and swatted a two-run homer. pic.twitter.com/ZlxQhHGngh — MLB Pipeline (@MLBPipeline) July 31, 2021\n\n“Well, I don’t think I am” giving up hitting, Murphy said, to the surprise of reporters who’d heard just minutes before that he was drafted as a pitcher, not a pitcher and hitter. “I’ll be able to pick up the bat, too, so I’m real excited about that opportunity, to try to do the two-way thing for a little bit and do all that.”\n\nAdvertisement\n\nAsked if the Braves had told him he could be a two-way player, Murphy said, “Absolutely, yeah. I’ve wanted to two-way forever, it’s one of the biggest parts of my ask (of the team), was just to be a two-way guy and have that opportunity. I love swinging it and I love throwing, I want to do both as long as I can.”\n\nAsked if Angels two-way star Ohtani was a favorite of his, Murphy said, “Oh, yeah, absolutely. Just his presence in the league is absolutely nuts. I know I’m not the same stature as him, in all his 6-4 glory and everything. But he’s a great asset to the league and he shows that you can still play the game being an athlete and doing it all. I aspire to be that way and that’s all I’m trying to do.”\n\nIt sounded good, including the part about how Murphy would probably “bounce around” all four infield positions when not pitching, or maybe go to the outfield if the team thought it less stressful on his arm.\n\nBut it didn’t take long for those quotes to get back to Braves officials, and an hour later Brown made it clear — again — that Murphy was drafted as pitcher, and that all parties involved were now on the same page, even if Murphy had briefly strayed from that understanding.\n\n“It’s definitely pitcher,” said Brown, who’s in his fourth year as Braves scouting chief and is regarded as one of the best and brightest in the majors at what he does. “We cleared it up with him and his agent (since Murphy’s interview). The kid is very excited about being a professional player. He felt like he could do both. We made it clear that, look, we drafted you as a pitcher.\n\n“I think that maybe some other clubs may have told him that (he could do both) and he thought maybe he was going to get a chance to both, but we were very clear: Look, we want you to pitch, we think you can be a fast-track-to-the-big-leagues type guy, whether it’s like (Mike) Soroka and moving that fast — we really feel that good about him.”\n\nAdvertisement\n\nBrown said the Braves scouted Murphy the past two summers, and it was his performance in summer showcases against top prospects — many of them drafted Sunday — that stood out, rather than his jaw-dropping stats in a high school league not nearly as competitive as some in Sun Belt states.\n\n“He’s a really athletic kid,” Brown said of Murphy, a 6-foot-1, 195-pounder who was a high school quarterback. “Has been up to 96 (mph), big-time strike thrower. Really athletic, clean delivery, with the makings of plus-secondary stuff. So we’re really excited about him, his future, and trying to build arms. We feel like this is a good way.”\n\nIn one Prospect Development Pipeline (PDP) summer game against top prospects, Murphy had 10 strikeouts in four innings.\n\n“The intriguing thing is, yes, the high school competition (in Illinois) is not equivalent to Texas, California and Florida, but it’s a decent league,” Brown said. “But the most important is, we evaluate these guys and their stats in the summer, and he probably had the best (summer) stats of any of the pitchers, even (Buford High’s Dylan) Lesko. (Murphy’s) stats, his walk rate, his strikeout rate, he was at the top of the chart for all those guys. And in the summer you face the best talent, you face all of those kids that get drafted today.”\n\nBrown had similar assessment of Ritchie, who throws a little harder than Murphy and was scouted by Cody Martin, who pitched for the Braves in 2015. Ritchie was a first-team prep All-American this year after going 7-0 with a 0.39 ERA and 75 strikeouts in 35 1/3 innings.\n\n“We were excited that he was still there (at No. 35),” Brown said. “(Martin) has seen him throw up to 98. We had Murphy higher on the board, more athletic, but we were shocked that Ritchie made it (to the Braves). His strike-throwing ability and being able to throw up to 98 as a high school kid, we were excited that he fell to us. Getting the extra pick is big. He’s for sure first-round type talent.”\n\nAs for taking two high school right-handers with such high picks, Brown said, “We know that high school arms are a little more risky than some of the other players, but some of the ways that we can cut down the risk is to make sure that these high school arms have really good command and that they’re pretty athletic. And the common denominator seems to be that, when it comes to high school arms getting to their ability. Like (Max) Fried — he’s so athletic, good arm strength, and throwing strikes is a big part of what these high school guys do that get to the big leagues.”\n\nAdvertisement\n\nPhillips, from Boerne (Texas) High, had 42 strikeouts and no earned runs in 23 1/3 innings before tearing his UCL and having Tommy John surgery in April. He showed his toughness when he tore the ligament but threw three sliders to get the batter out that he was facing at the time, before leaving the game. He fastball had been rated the best in the draft class and he was projected as a high first-rounder before the injury.\n\n“Sort of like the (Spencer) Strider pick, when he had Tommy John and was also up against COVID,” Brown said, referring to the Braves rookie who was a fourth-round pick from Clemson in 2020. “So sometimes you have to strategically take some guys with upside. And with Cole Phillips, I saw the kid throw up to 99, my scouts have seen him throw up to 100. It’s a mid-80s slider. Big-time athlete, big Texas fireballer, and we’re really excited about him.”\n\nBrown also mentioned Strider in relation to plans for Burkhalter, who got a strong recommendation from former Braves ace Tim Hudson, the pitching coach at Auburn.\n\n“We think he’s got some Strider stuff going on in the delivery, the rise of the fastball, a hard slider, so there’s some excitement there,” Brown said. “And worse comes to (worst), we know we’ve got a big-time end-of-the-game bullpen guy. But we have some plans to try to see if this guy can start, and maybe we can kind of flip this into a Strider-type pick, where you take a college guy that doesn’t have a ton of innings, but he has really good stuff and he’s been up to 98, with a really hard cutter. So yeah, sometimes you have to get strategic, and it could turn into something big.”\n\n(Photo of JR Ritchie: Jayne Kamin-Oncea / USA Today)"}, {"url": "https://wiki2.org/en/Rick_Mahler", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican baseball player\n\nBaseball player\n\nRichard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was a major league pitcher as well; the two were Braves teammates in 1979. The brothers had also played together for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1984, when he went 13-10 with a 3.12 ERA while hitting .296 at the plate. In 1985, he won his first 7 straight starts and ended up 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. In postseason play, Mahler pitched 3+1⁄3 scoreless innings. Mahler was a key member of the 1990 Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets.[1]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 1 359 2 681 1 507\n\nAtlanta Braves vs Houston Astros (8-17-1987) \"Glenn Davis Is Not Happy With Rick Mahler\"\n\n⚾ Baseball. Tim Leary, Jack Armstrong, Rick Mahler and Danny Darwin.\n\n4.8.1986 Braves/Expos Transcription\n\nReferences\n\n^ Obituary. The Deadball Era. Retrieved on April 21, 2016. . Retrieved on April 21, 2016."}, {"url": "https://wiki.alquds.edu/?query=Rick_Mahler", "page_content": "American baseball player\n\nBaseball player\n\nRichard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was a major league pitcher as well; the two were Braves teammates in 1979. The brothers had also played together for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1984, when he went 13-10 with a 3.12 ERA while hitting .296 at the plate. In 1985, he won his first 7 straight starts and ended up 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. In postseason play, Mahler pitched 3+1⁄3 scoreless innings. Mahler was a key member of the 1990 Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets.[1]\n\nReferences [ edit ]"}, {"url": "https://baseballhall.org/discover-more/stories/baseball-history/caught-in-the-draft", "page_content": "A list of drafted players who eventually were elected to the Hall of Fame, in chronological order of their draft selection:\n\n• Johnny Bench – Drafted by Reds in June 1965 with second-round pick\n\n• Nolan Ryan – Drafted by the Mets in June 1965 with 12th-round pick\n\n• Reggie Jackson – Drafted by the A’s in June 1966 with first-round pick (No. 2 overall)\n\n• Carlton Fisk – Drafted by the Red Sox in Jan. 1967 with first-round pick (No. 4 overall)\n\n• Ted Simmons – Drafted by the Cardinals in June 1967 with first-round pick (No. 10 overall)\n\n• Bert Blyleven – Drafted by the Twins in June 1969 with third-round pick\n\n• Goose Gossage – Drafted by the White Sox in June 1970 with ninth-round pick\n\n• Jim Rice – Drafted by the Red Sox in June 1971 with first-round pick (No. 15 overall)\n\n• George Brett – Drafted by the Royals in June 1971 with second-round pick (No. 29 overall)\n\n• Mike Schmidt – Drafted by the Phillies in June 1971 with second-round pick (No. 30 overall)\n\n• Dennis Eckersley – Drafted by the Indians in June 1972 with third-round pick (No. 50 overall)\n\n• Gary Carter – Drafted by the Expos in June 1972 with third-round pick (No. 53 overall)\n\n• Robin Yount – Drafted by the Brewers in June 1973 with first-round pick (No. 3 overall)\n\n• Dave Winfield – Drafted by the Padres in June 1973 with first-round pick (No. 4 overall)\n\n• Eddie Murray – Drafted by the Orioles in June 1973 with third-round pick\n\n• Lee Smith – Drafted by the Cubs in June 1975 with second-round pick (No. 28 overall)\n\n• Andre Dawson – Drafted by the Expos in June 1975 with 11th-round pick\n\n• Alan Trammell – Drafted by the Tigers in June 1976 with second-round pick\n\n• Rickey Henderson – Drafted by the A’s in June 1976 with fourth-round pick\n\n• Jack Morris – Drafted by the Tigers in June 1976 with fifth-round pick\n\n• Wade Boggs – Drafted by the Red Sox in June 1976 with seventh-round pick\n\n• Harold Baines – Drafted by the White Sox in June 1977 with first-round pick (No. 1 overall)\n\n• Paul Molitor – Drafted by the Brewers in June 1977 with first-round pick (No. 3 overall)\n\n• Ozzie Smith – Drafted by the Padres in June 1977 with fourth-round pick\n\n• Tim Raines – Drafted by the Expos in June 1977 with fifth-round pick\n\n• Cal Ripken Jr. – Drafted by the Orioles in June 1978 with second-round pick\n\n• Ryne Sandberg – Drafted by the Phillies in June 1978 with 20th-round pick\n\n• Tony Gwynn – Drafted by the Padres in June 1981 with third-round pick\n\n• Kirby Puckett – Drafted by the Twins in Jan. 1982 with first-round pick (No. 3 overall)\n\n• Greg Maddux – Drafted by the Cubs in June 1984 with second-round pick (No. 31 overall)\n\n• Tom Glavine – Drafted by the Braves in June 1984 with second-round pick (No. 47 overall)\n\n• Barry Larkin – Drafted by the Reds in June 1985 with first-round pick (No. 4 overall)"}, {"url": "https://alchetron.com/Rick-Mahler", "page_content": "Richard Keith Mahler (August 5, 1953 – March 2, 2005) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979–1988, 1991), Cincinnati Reds (1989–1990) and Montreal Expos (1991). His brother Mickey was also a major league pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves.\n\nIn his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings.\n\nBorn in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season.\n\nMahler started on opening day for the Braves in 1982, when Atlanta won the National League West title. He made four straight opening day starts beginning in 1985. In 1987, he tied an NL record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7–6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season.\n\nAfter retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997.\n\nMahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon."}, {"url": "https://www.baseball-reference.com/players/m/mahlemi01.shtml", "page_content": "Frequently Asked Questions\n\nHow old is Mickey Mahler?\n\nMickey Mahler is 70 years old.\n\nWhen was Mickey Mahler born?\n\nMickey Mahler was born on July 30, 1952.\n\nWhere was Mickey Mahler born?\n\nMickey Mahler was born in Montgomery, AL.\n\nHow tall is Mickey Mahler?\n\nMickey Mahler is 6-3 (190 cm) tall.\n\nHow much did Mickey Mahler weigh when playing?\n\nMickey Mahler weighed 189 lbs (85 kg) when playing.\n\nHow many seasons did Mickey Mahler play?\n\nMickey Mahler played 8 seasons.\n\nIs Mickey Mahler in the Hall of Fame?\n\nMickey Mahler has not been elected into the Hall of Fame.\n\nWhen was Mickey Mahler drafted?\n\nMickey Mahler was drafted by the Atlanta Braves in the 10th round of the 1974 MLB June Amateur Draft from Trinity University (San Antonio, TX).\n\nWhat position did Mickey Mahler play?\n\nMickey Mahler was a Pitcher.\n\nHow many strikeouts did Mickey Mahler have?\n\nMickey Mahler had 262 strikeouts over his career.\n\nHow many teams has Mickey Mahler played for?\n\nMickey Mahler played for 7 teams; the Atlanta Braves, Pittsburgh Pirates, California Angels, Detroit Tigers, Montreal Expos, Texas Rangers and Toronto Blue Jays.\n\nWhen did Mickey Mahler retire?\n\nMickey Mahler last played in 1986."}]}