{"He was traded to the Reds in 1984, and then to the Expos in 1986.": [{"url": "https://www.mlb.com/cut4/flashback-to-the-mets-acquisition-of-gary-carter-in-1984-c263163258", "page_content": "The Mets made a trade with the Expos in 1984 that changed the franchise forever\n\nNEW YORK - OCTOBER 27: Gary Carter #8 and Wally Backman #6 of New York Mets celebrate after winning the 1986 Major League Baseball World Series between the New York Mets and the Boston Red Sox during game seven at Shea Stadium in Flushing, Queens, New York on October 27, 1986. The Mets won their second World Series, first in 1969, by beating the Red Sox 4-3. (Photo by MLB Photos via Getty Images) (MLB Photos/Getty Images)\n\nFrom 1974 to 1984, the Montreal Expos enjoyed having Gary Carter, a slugging catcher and tremendous defensive backstop, suit up for them every day. During that span, Carter made seven NL All-Star teams, won three Gold Glove Awards and hit a bunch of dingers. He was a star.\n\nOn Dec. 10, 1984 -- 33 years ago today -- Carter began the next phase of his career when Montreal traded him to the Mets for a quartet of players (Hubie Brooks, Mike Fitzgerald, Herm Winningham and Floyd Youmans). It was a big get for the Mets, who leapt from 68 wins in 1983 to 90 in 1984 behind a couple of young studs named Dwight Gooden and Darryl Strawberry. Now New York had its eyes on the postseason, and picking up a star like Carter was a big step toward making that happen.\n\nOnly it didn't, at least not right away. Carter had a strong first season with his new team in 1985, hitting 32 homers, driving in 100 runs and finishing sixth in NL MVP voting. The Mets won 98 games -- but wound up finishing second in the NL East to the 101-61 Cardinals and missing the postseason.\n\nThe next season, though, things were different. The '86 Mets, as you may have heard, won the World Series over the Red Sox in one of the most thrilling Fall Classics in baseball history. To nobody's surprise, Carter had a lot to do with that -- and his first big moment came in Game 5 of the NLCS against the Astros:\n\nYour browser does not support HTML5 video tag. Click here to view original GIF\n\nCarter hit a walk-off single in the 12th inning, plating Wally Backman and turning the tide of that series. New York won Game 6 and advanced to the World Series, where Carter again had a lot to do with the final outcome.\n\nCarter hit .276 against Boston, clubbing two huge homers in Game 4 at Fenway Park ...\n\nYour browser does not support HTML5 video tag. Click here to view original GIF\n\n... and delivering a key eighth-inning sacrifice fly in Game 6 that scored Lee Mazzilli to tie the game at 3:\n\nYour browser does not support HTML5 video tag. Click here to view original GIF\n\nTwo innings later, the Mets were trailing, 5-3, staring at the end of their season. Down to their final out, Carter began the Mets' legendary comeback with a single to left field. Two singles later, he came around the score, and the Mets would win, 6-5, on a fortuitous grounder to first off the bat of Mookie Wilson.\n\nThe Mets followed up that historic game with an 8-5 win in Game 7, putting a bow on New York's second World Series title. Carter, picked up in hopes of making an ascending team a championship team, had done just that -- and celebrated by emphatically jumping into the air after catching strike three from Jesse Orosco for the final out:\n\nCarter would be elected to the Baseball Hall of Fame in 2003 in his sixth year of eligibility, after a career that made him one of the most formidable and well-rounded catchers to ever crouch behind home plate.\n\nSafe to say that trade worked out rather well for New York."}, {"url": "https://www.mlb.com/reds/hall-of-fame/alumni/directory", "page_content": "Simply put, George Wright was the best baseball player of his time. The younger brother of famed Cincinnati Red Stockings captain Harry Wright, George became a star player with the Washington and New York clubs and was an immediate target for Harry when the Cincinnati club decided to hire all of its players in 1869.\n\nWith George in the fold, the Red Stockings had secured the services of baseball's best player on what was soon to be baseball's best team. The Red Stockings of 1869 were a sensation, conquering each opponent who challenged them en route to a 57-0 season. As their wins mounted, so too did the club's popularity -- and no player on the club was the focus of more adulation than George Wright.\n\nPossessed of dashing good looks, the 22-year old George was particularly popular with female fans, who were known to scandalously lift their skirts to reveal their red-stockinged ankles in George's presence. The acclaim for George was, of course, well deserved. On a club filled with superlative talents, George was exceptional. He led the Red Stockings in every offensive category -- in most cases by a wide margin over the player behind him. He hit an astonishing .633 (129 points better than the second highest batting average, posted by Doug Allison), had 304 hits (Fred Waterman was second with 226), hit 49 home runs (Charles Sweasy's 30 were the second-most on the club) scored 339 runs (Waterman finished at 293) and his 614 total bases bested Sweasy's runner-up total by 192. In addition to his awesome offensive production, Wright's play at short established the standard for modern play at the position.\n\nGeorge enjoyed another outstanding season with the Red Stockings in 1870 before he moved on to Boston when financial pressures forced the Cincinnati club to cease operations as a professional club. With George maintaining his exemplary play, the Boston Red Stockings dominated the nascent National Association, winning pennants in four of the Association's first five years. The club's success continued in the new National League, which began play in 1876 and counted the Boston club as its champion in two of its first three years of operation. Appropriately, George was the first player to bat in the National League's first game.\n\nGeorge Wright was inducted into the National Baseball Hall of Fame in 1937 as part of the Hall's second induction class. In a special election in 2005, George and his brother Harry were honored with induction into the Cincinnati Reds Hall of Fame. George is the only player for whom the Reds Hall of Fame's requirement that a player play three years in a Reds uniform has been waived.\n\nGeorge Wright\n\nBats: Right\n\nThrows: Right\n\nHeight: 5' 9\"\n\nWeight: 150\n\nBorn: January 28, 1847, New York, New York\n\nDeath: August 21, 1937, Boston, Massachusetts\n\nHow Acquired: Signed by the Cincinnati Reds as a free agent from the Unions of Morrisania, NY, in 1869\n\nDebut: May 5, 1867 vs. Unknown\n\nFinal Game: October 2, 1882 vs. Boston Red Caps\n\nInducted into the National Baseball Hall of Fame by the Centennial Committee in 1937 ( ballots)\n\nInducted into the Reds Hall of Fame 2005"}, {"url": "https://www.sportingnews.com/us/mlb/news/lets-talk-about-pete-roses-short-stint-with-the-expos/1makpfgy53n7i1i96dv2kk7itn", "page_content": "You know what‘s still weird? Seeing Pete Rose in an Expos uniform. I was reminded of that again today when I saw that it's the anniversary of Rose's 4,000th career hit. More on that in a minute.\n\n\n\nOne of the strangest blips in baseball history was the relatively short stint that MLB's all-time hit leader spent north of the border during the 1984 season. It’s easy to forget that Rose ever spent time in Montreal, as it represented a fairly minor chapter in his 24-year playing career. It's really only considered odd because Rose — after playing for 22 years in the vaguely similar color schemes of the Reds and Phillies — just didn't look right in the loud red, white and blue Expos uniform. But that's also what makes it kinda cool.\n\nMORE: That time the Padres' owner insulted the team over the PA system during a game\n\nThough Rose's time in Montreal isn’t really forgotten, it’s hardly talked about. That’s because nearly every significant highlight from his career happened with the Reds and Phillies from 1963 until he was banned from baseball in 1989 for betting on games. But, obviously, his time in Montreal wasn’t without significance, thanks to that 4,000th career hit. His double down the right field line against the Phillies on April 13, 1984, made the switch-hitting Rose just the second player in MLB history to reach 4,000 hits, after Ty Cobb. Let’s enjoy that highlight now.\n\nThat the hit came against his former team likely made it even sweeter.\n\nRose signed with the Expos during the 1983-84 offseason. His time with the Phillies had ended somewhat acrimoniously, as the team felt his playing days were over after a poor showing for a pennant-winning '83 Philadelphia squad. Rose was worth -2.1 bWAR that season, and it appeared age had finally caught up to the then-42-year-old. But Montreal still had faith and signed him to a one-year deal for 1984.\n\n\n\nAnd make no mistake, Rose approached the 1984 season with something to prove.\n\n\n\n\"When you mess with my pride, when you back me up against the wall with my pride, somebody's going to be in trouble,\" Rose said after his release from the Phillies, according to a Sporting News report at the time.\n\nThe Expos hoped Rose still had enough left to spark their team the way he sparked Reds and Phillies championship teams earlier in his career.\n\n\"We seemed to have lacked some of the qualities Pete has,\" Expos president John McHale told SN. \"Maybe we can get a last breath from him — well, not a last breath, but a couple of breaths out of him. We told Pete we're not interested in him for attendance. ... We told him we're only interested in him helping us win.\"\n\nMORE: Networks, teams need better definition of \"classic\" games\n\nRose was up for the challenge.\n\n\"For those who think I can't play anymore, Montreal gave me a contract, and they're a pretty good team,\" Rose said, according to an SN report. \"There's nothing I can do about the day I was born. I wish people would forget how damned old I am. I don't feel old, I don't act old, and medical experts have told me my body isn't old.\n\n\"Two years ago, I led the league in hits at age 40, and nobody said anything about me being washed up. The people of Montreal should hope I get 202 hits because, if I do, I'll produce for this team.\"\n\nThat's not quite how things played out.\n\nDespite those early expectations from both Rose and the Expos, and despite his historic 4,000th hit in April, Rose played just 95 games in Montreal before a trade back to his hometown Reds in August. In 314 plate appearances with the Expos, Rose collected 72 hits and produced a slash line of .259/.334/.295 — good for 0.3 bWAR. Ironically, despite wanting Rose to provide the X-factor to push them over the top, and despite the presence of three future Hall of Famers in the lineup, the 1984 Expos provided the franchise's first losing season of the decade.\n\nThe Reds named Rose player-manager, a title he held for two more seasons before retiring as a player after the 1986 campaign. During that time, Rose passed Cobb on the all-time hit list and finished his career with 4,256 hits. A few years later, of course, Rose was banned from baseball because of the gambling allegations and subsequent investigation that culminated with him accepting baseball's ultimate punishment.\n\nBut today isn't about that well-worn story. It’s about that brief time when Rose wore the colorful Montreal uniform — preserved in the memories of fans, one major highlight, and a few baseball cards, such as this 1985 Donruss beauty."}, {"url": "https://baseballhall.org/discover/inside-pitch/tony-perez-deal-marks-the-end-of-an-era-in-cincinnati", "page_content": "But it was the Pérez move that had everyone in the game wondering if the Reds were heading toward a rebuilding phase after back-to-back World Series championships.\n\n“He’s part of what helped make me what I am,” Reds second baseman Joe Morgan – who won back-to-back National League Most Valuable Player Awards in 1975-76 – told the Associated Press: “I have to be losing a little bit, too.”\n\nPérez waived his no-trade provision as a 10-and-5 player (10 years in the big leagues with the last five with the same team) to complete the trade and received a three-year deal from the Expos worth around $500,000."}, {"url": "https://allsportshistory.com/2021/06/25/what-happened-to-the-montreal-expos/", "page_content": "The Montreal Expos were the first major league baseball team in Canada, and were a huge part of the sports scene in the Quebec area. So what exactly led to the team leaving the city they called home for 35 years? In today’s video we’ll take a look back at how MLB came close to folding the team, before they ended up moving away for good.\n\nThe Montreal Royals (1890 – 1969)\n\nBaseball in Montreal has a rich history, dating all the way back to the late 1800’s when the city’s most prominent team the Montreal Royals of the Eastern League were founded in 1897. They would play for 20 seasons before folding in 1917, but were revived in 1928. About a decade later, the Brooklyn Dodgers bought the team to use in their minor league farm system. The Royals became highly successful under the Dodgers management, winning seven international league championships and three junior world series. However, the Royals arguably became most famous for developing talented young prospects like Jackie Robinson and Roberto Clemente who would eventually go on to have legendary baseball careers. By the mid 1950’s, the Royals successful years had waned as did the home game attendance. Eventually the Dodgers sold the Royals to the upstart Minnesota Twins franchise in 1961, who promptly moved the Royals from Montreal to Syracuse, New York. Sadly, this left Montreal without a baseball club for the first time in decades.\n\nPretty much right after the Royals left town, the mayor of Montreal Jean Drapeau and city executive committee chairman Gerry Synder got to work on bringing a major league baseball club to Montreal. Unfortunately, the city was too late in their proposal for the 1962 MLB expansion, where the Houston Colt .45s (later renamed the Astros) and the New York evil plotting babies… I mean the New York Mets came into the league for the first time. Montreal would have to wait another five years, when in 1967 MLB planned another expansion to the league. This time, Montreal was significantly helped by the chairman of the National League’s expansion committee, Walter O’Malley. O’Malley, just happened to also be the owner of the Dodgers and the former owner of the Montreal Royals. It pays to have connections right? With his influence, Montreal became one of the two teams officially announced as new National League franchises on May 27, 1968 (with the other being San Diego). The American League also announced an expansion, adding Kansas City and Seattle as two new clubs. With that, Montreal became the first city outside of the United States to have a Major League Baseball team.\n\nFormation (1969)\n\nHowever, the brand new team ran into issues almost immediately, as the ownership group found it difficult to secure a stadium for the ball club to play in. Due to Montreal’s inclimate weather during the spring and fall months, the ownership group wanted to build a dome stadium but found it difficult to get the city to agree on such a plan. As time dragged on without any deal in place, by late 1968 the National League owners had become increasingly concerned that Montreal wouldn’t be able to start on time for the 1969 season. There were rumors that the franchise would instead be awarded to Buffalo, New York, who had War Memorial Stadium ready to go. Mayor Drapeau met with National League president Warren Giles, and assured him that Montreal would get a deal done, and proposed spending 1 million Canadien dollars on expanding a community field named Jerry Park from 3000 seats to 30,000 seats as a temporary home for the team.\n\nWith the Jarry Park plan in place, the team began the process of choosing a team nickname. Initially they preferred the name Royals, as an homage to the minor league club that played in Montreal for so many years. But there was just one problem, that name was already taken by the Kansas City Royals who announced their new nickname via fan vote. Montreal then considered a number of different names, including Voyageurs and Nationals (whis is pretty much a huge steaming bowl of foreshadowing) but settled on Expos named after the World’s Fair Exposition that had taken place a couple of years earlier in Montreal in 1967. The Expos chose a unique logo to represent the team. The logo has some clever and subtle hidden elements that represent the team’s namesake. The overall shape is shaped like an “M” for the city of Montreal, with a red swirl shape on the left that creates a lowercase “e” shape for Expos. Then the right side of the logo has a lowercase “b” shape in blue that stands for baseball. The logo is also italicized to represent forward movement, and while it was initially mocked for being too modern looking it eventually gained admiration as an iconic and classic logo.\n\nEarly Struggles & New Stadium (1970-1980)\n\nThe Expos played their first ever game on April 8, 1969 defeating the New York Mets 11-10 at Shea Stadium. They would play their first home game, and first ever MLB game outside of the US a week later on April 14, defeating the St. Louis Cardinals 8-7 at Jerry Park in front of a crowd of 29,184. However, the team quickly fell to the bottom of the standings, finishing tied with their expansion mates the San Diego Padres for the worst record in the National League at 52-110. One early breakout star was the power hitter, Rusty Staub who had been traded from the Houston Astros. Staub quickly became a fan favorite, nicknamed “Le Grande Orange” for his red hair and physical stature. He was the Expos only representative at the All Star Game during the Expos first three seasons. However, the club never managed to have a winning season for their first ten years of existence causing attendance and interest around the team to dwindle.\n\nBy the mid 1970’s, attendance had dropped to just 600,000 thousand fans for the entire season, about half of what the attendance figure’s were during their first season. It didn’t help that Jerry Park, which was intended to be a temporary home for the Expos left fans completely exposed to the outdoors and were forced to postpone many early season games due to inclimate weather. Earlier in the decade, Montreal had been selected as the host city for the 1976 Olympics, and part of the plan to host was building a brand new dome stadium that would be the main venue for many events including the opening and closing ceremonies. A worker strike, overruns in construction costs, and brutal winter months all contributed to the construction of the new stadium being delayed by several years. Olympic stadium finally opened July 17, 1976, just in time for the opening ceremonies. The Expos would move into Olympic Stadium the following year, with their first game on April 15, 1977 in front of a sellout crowd of 57,592. In 1977, MLB expanded once more adding two new teams, the Seattle Mariners (who replaced the Pilots team who had moved to Milwaukee) and the Toronto Blue Jays. With Toronto joining the league as the second Canadien team, it formed a natural rivalry between the Expos and the Blue Jays. The two teams would meet regularly for the Pearson Cup exhibition game, named after former Prime Minister Lester B. Pearson. The game was meant as a way to raise funds for minor league baseball in Canada, and was played every year from 1978 to 1986, and revived again in Montreal’s final years between 2003 and 2004.\n\nThe Turnaround (1981 – 1985)\n\nThe new stadium ushered in a new era of baseball for the Expos, although some of the same weather issues continued to persist due to construction issues with Olympic Stadium, and the roof not being fully installed until 1987. By the early 80’s the Expos had built a solid core of all star caliber players including Gary Carter, Tim Raines, and Andre Dawson. The 1981 season ended up being split into two halves, due to a player’ strike that lasted nearly two months. MLB decided that the team’s who won their divisions in both halves would advance to the playoffs. The Expos finished the first half in third place, and decided to fire the manager Dick Williams and replace him with scouting director Jim Fanning. This was seen as an odd choice at the time, as Fanning hadn’t managed a game in 20 years. But the Expos had a strong finish during the second half, winning the National League East with a half game over the St. Louis Cardinals.\n\nThe Expos faced the defending World Champions the Philadelphia Phillies in the divisional round and ended up splitting the first four games. In the fifth and deciding game, Expos pitcher Steve Rogers (nope, not that Steve Rodgers) pitched a complete game 3-0 shutout over the Phillies. This advanced the Expos to their first ever National League Championship series appearance. In the NLCS, Montreal faced the Los Angeles Dodgers and once again split the first four games of at the time a best of five game series. In near freezing temperatures, the two teams faced off for the final game at Olympic Stadium. The game went all the way to the 9th inning tied at 1 run a piece, when the Expos manager Jim Fanning called on the team’s ace Steve Rogers to come out of the bullpen and face the Dodgers in the 9th inning. Rogers retired the first two batters, and then faced Dodger’s fielder Rick Monday. On a 3-1 count, Rogers threw a hanging sinking ball that Monday hit over the centerfield wall putting the Dodgers ahead 2-1 and became the series winning home run. The Expos were left stunned, having to face a massive disappointment in coming up just short. Monday’s homerun and the game would become an infamous moment in Expos history, known as “Blue Monday”, while the Dodgers would go on to defeat the New York Yankees in six games, winning the World Series.\n\nCollusion (1985 – 1989)\n\nBy the mid 1980’s the Expos had won more games between 1979 and 1983 than any other National League East team, but had only managed to make the playoffs once. In an attempt to turn things around, Montreal signed verteran star player Pete Rose to a one year contract. Coming into the season, Rose (seen here just as shocked as you are that he’s an Expo) was just ten hits shy of 4,000 career hits and closing in on Ty Cobb’s all time record of 4,191 hits. On April 13, 1984 Rose reached 4,000 career hits with a double off of Phillies pitcher Jerry Koosman. However, Rose’s time with the Expos was short lived as he was traded later that summer back to the team he began his career with, the Cincinnati Reds. With the team struggling on the field, attendance began to dwindle. It didn’t help that player salaries had increased significantly, going from the average player making $29,000 a year in 1970 (just after the team was founded) to $371,000 in 1985. In order to cut costs, the Expos began selling off their star players. Star catcher and fan favorite Gary Carter was traded to the New York Mets, with the Expos owner Charles Bronfman stating a year earlier that signing Carter to a seven year contract was the biggest mistake he had made in his life.\n\nIt didn’t get easier from there, another star player Andre Dawson left the Expos to test free agency after the 1986 season. However, all of the MLB team owners had privately worked together to purposely drive free agent’s salaries down in order to save money. The Expos management even leaked information about Dawson’s knee injuries, to try and dissuade any interest in him. Frustrated with the lack of movement in the free agent market, Dawson literally walked into the Chicago Cubs training camp and signed a blank contract. The Cubs signed Dawson to a one year contract worth half of his previous salary. He then went on to hit 49 home runs, while driving in 137 runs and being named the NL MVP for 1987. Andre Dawson’s, teammate Tim Raines suffered a similar fate after he became a free agent in 1986 when no serious offers were made to sign the six time all star player. Raines ended up re-signing with the Expos for 5 million dollars over three years, and was named the MVP of the 1987 All Star Game. The Player’s association filed several greiences with MLB throughout the late 1980’s over collusion, and eventually the owners were ordered to pay $280 million dollars in damages to the player’s association for loss wages and violation of the collective bargaining agreement between the players and owners. Obviously the players felt betrayed and disgusted with the entire situation, and the whole event would set the stage for a major showdown between the two sides in the coming years.\n\nUp For Sale (1990 – 1994)\n\nWith the team continuing to struggle, and attendance fading, Expos owner Charles Bronfman became increasingly impatient with the realities of running a ballclub. In 1989, he decided to give winning a championship one more shot by trading for star pitcher Mark Langston of the Seattle Mariners. In return, Seattle got back from the Expos a then relatively unknown pitcher named Randy Johnson, who would of course go on to have a Hall of Fame career. The trade, at least initially, helped the Expos grab the division lead by the 1989 All Star Break. But soon after the wheels came off, and the Expos fell to fourth place finishing with a .500 record.\n\nDisappointed, Bronfman decided after that season that he was done with the team and wanted to sell. The initial price Bronfman had in mind for the Expos was $100 million but he found it very difficult to find a local buyer who wanted the team. There were of course interested buyers from the US, who wanted to relocate the team to places like Miami or Buffalo. Bronfman insisted that the Expos remain in Montreal, and only wanted to sell to local buyers. The team’s president, Claude Brochu offered to lead a group of investors who could pool their money together and buy the team from Bronfman. Brochu managed to get 11 other Canadien businesses on board with the plan, as well as taking a loan from the city of Montreal and province of Quebec to purchase the Expos for the $100 million dollar asking price. The sale between Bronfman and Brochu was completed on November 29, 1990.\n\nThe new ownership group got to work right away on making improvements to the team, they traded away future Hall of Fame player Tim Raines before the 1991 season in a five player deal. After the team started 21-21, the Expos fired manager Buck Rodgers (nope not that Buck Rogers), who had managed the team since 1985. But it wasn’t all bad, because on July 28 of that season, Expos pitcher Dennis Martinez pitched a perfect game against the Los Angeles Dodgers. It was only the 13th perfect game in MLB history up to that point, and became one of the most iconic moments in Expos history. Shortly after that, the team ended being forced out of Olympic Stadium for the final month of the season due to a 50 ton beam that fell from the stadium’s structure onto a concourse shortly before a motocross event. During the offseason, the team had the stadium go under a full safety inspection and was cleared to be safe to play. However the roof had sustained damage from a wind storm earlier in the year and the team decided that it was safer, but also cheaper to just keep the roof closed permanently. By 1992 the Expos once again had a talented core of young players to build around, including Delino DeShields, Larry Walker, and Marquis Grissom. The team also traded for outfielder Moises Alou, who’s father Felipe Alou just happened to be the newly named manager of the Expos. DeShields was eventually traded to the Dodgers but in return the Expos got a young pitcher named Pedro Martinez (who’d go onto have a hall of fame career), and the team’s play on the field greatly improved, winning 94 games in 1993.\n\nStrike & Fire Sale (1994 – 1998)\n\nEntering the 1994 season, the Expos fielded what many analysts felt were the best team in the franchise’s history. However, Montreal would face tougher competition in the NL East division, as MLB expansion the season before led to new divisional alignments. This meant that the dominant Atlanta Braves, powered by their trio of pitching Greg Maddux, Tom Glavine, and John Smoltz, were now in the NL East. The Expos were 2.5 games back of the Braves, when they hosted Atlanta in late June. Montreal would take two of the three game series, which sparked the team on an impressive run of wins. By the All Star break, the Expos were in first place and continued to pull away from the rest of the division through July and the beginning of August. By mid August, Montreal had the best record in baseball with 74 wins and 40 losses, and were on pace to set a franchise record of 106 wins.\n\nBut all of that would come to a sudden end, because on August 12 every player in MLB went on strike due to collapsing talks of a new collective bargaining agreement between the players and the owners. The players were against the owners desire to install a hard salary cap on player’s salaries, while the owners claimed that smaller market teams would struggle to survive unless the larger market teams shared revenue from local broadcasts, and that it wouldn’t be possible without a salary cap in place. At the time the player’s union thought a new deal would be reached by Labor day at the latest, which was September 5th that year. That would leave just under a month left in the season, before the playoffs started. However, both sides were stuck in a stalemate and by September 14th, the commissioner of baseball Bud Selig (seen here working on his pickoff move) officially canceled the rest of the season, postseason, and World Series for 1994. This would be the first time in 90 years that the World Series wasn’t played, with the last time being in 1904 when the New York Giants refused to play the Boston Americans (who are now the Red Sox) in a series, believing that it was beneath them to play a team from an inferior league. The cancellation of the season left many in Montreal devastated, as this seemed to be their year to finally make a World Series appearance. Unfortunately for the Expos, the 1981 playoff run 13 years earlier would be the first and last time the franchise ever reached the playoffs.\n\nThe strike would last all offseason, finally coming to an end in March of 1995 when both the owners and players were ordered to back to work by future Supreme Court justice Sonia Sotomayer of the US District Court for the Southern District of New York. Sotomayer issued an injunction against the owners, who were planning on using replacement players. Ordering both sides to honor the terms of the previous CBA until a new agreement could be made. The strike arguably hurt the Expos more than any other franchise, as Montreal’s management was notoriously known as a penny pinching club. With mounting financial losses, the Expos decided to sell off most of their key players. Larry Walker and Moises Alou left as free agents, while Ken Hill, John Wetteland, and Pedro Martinez were all traded in the following years. Making matters worse, every other MLB team knew the Expos were close to bankruptcy and had virtually no leverage involving trades, so Montreal ended up getting very little in return for their players.\n\nThe combination of the strike and the fire sale of players left Expos fans disgusted with their club. As the team finished in last place in 1995, attendance dipped below an average of 20,000 fans per game and would never again reach above that mark. In order to address the attendance problems, Claude Brochu began to pitch to his partners the idea of building a new stadium, one closer to Montreal’s population center and closer to local entertainment districts. The concept stadium called Labatt Park, was announced in 1997 and would seat about 35,000 people. It was designed with a retro-classic feel, with the old Bonaventure railway station as it’s main design influence. The project had a budget of $250 million dollars and was hoped to be completed before the 2001 season. However, the plan fell through when the $150 million that Brochu sought from the provincial government of Quebec refused to pay, citing yet to be paid debts from Olympic Stadium’s construction as a main concern. Many of Brochu’s partners wanted to just sell the team instead, and began to openly question Brochu’s leadership as managing general partner. Some of the other partners even accused Brochu of having a secret deal with MLB’s commissioner Bud Selig to move the team to Washington DC. With all of this turmoil happening behind the scenes, Brochu was eventually replaced with minority stake holder Jeffrey Loria (seen here as the grown up version of the evil plotting baby). Loria, an American art dealer who had no real prior experience running a baseball club, sought to bring major changes to the team and succeeded in many intended and unintended ways.\n\nContraction (1999-2005)\n\nBefore Jeffrey Loria had become the new managing general partner, he had previously tried to buy the Expos in 1991 but was ultimately rejected in favor of Claude Brochu’s offer instead. By 1999, Loria had purchased a 24 percent stake in the team, and would eventually over the next two years end up with a 93 percent of the team’s shares. Once Loria took control over the Expos, he made it well known that the days of cheap spending were over, and that the team would be aggressive in trying to win. Loria was seen by some as a potential savior for the franchise, but Loria quickly ran into the same issues as his predecessor did.\n\nMany of the other business partners involved with the Expos refused to spend more on the team, and wanted to trade key assets like all star player Vladimir Guerrero. Loria outright refused, and tried to focus his energy on getting a new stadium built with the help of the city of Montreal and the province of Quebec. Loria proposed cost cutting measures to the Labatt Park project, swapping the retro-classic design for a more modern and sleek look. But once again, both the city and provincial government refused to pay for any part of a new stadium. And to top it off, MLB after also being asked by Loria for financial help, said that Lobatt Park’s new design was structurally unsound. In another move to increase cash flow, Loria thought it would be a brilliant idea to demand more money from the Expos television and radio broadcast partners. But the team’s English speaking TV or Radio broadcasters both refused to pay the increased rate, and so for the 2000 season the Expos went without English broadcasts.\n\nBy 2001, with the fans obviously irate at the lack of over the air coverage for the team, the Expos drew just under 650,000 for the entire season. At this point, with MLB claiming that they were struggling financially, the league decided to take the unusual step of holding a vote for contraction of the league. MLB singled out the Montreal Expos and the Minnesota Twins as two clubs that potentially could fold, thus shrinking the league down to 28 teams from 30. On November 6 2001, the owners voted 28-2 in favor of contracting the league (with the two teams voting against, of course being the Expos and Twins). Commissioner Bud Selig stated the two teams “had a long record of failing to generate enough revenues to operate a viable major league franchise.” However, fortunately for both teams that contraction plan fell through when a Minnesota court ruled that Twins must play out the rest of their lease with the Metrodome (which ran through 2002). With the ruling, and multiple legal challenges by the player’s association, MLB officially backed off plans for contraction.\n\nNot long after, Loria decided to sell the Expos to MLB for $120 million dollars and then he turned around and used that money to buy the Florida Marlins from owner John Henry, who then used that money to purchase the Boston Red Sox. With the musical chairs of ownership happening, the Expos ended up being literally owned by the 29 other clubs in baseball. Loria took everything he could with him to Florida, including the Expos team computers, and scouting information. Montreal’s general manager, Omar Minaya (hired by MLB from the New York Mets), felt that if the Expos could have a successful postseason run, it might spark reinvigorated interest in the team as it did for the Mariners when they got a new stadium built after their iconic 1995 playoff run. With that in mind, Minaya completed a blockbuster trade for all star pitcher Bartolo Colon from the Cleveland Indians. Unfortunately, the Expos lost their early season momentum and finished the 2002 season second in the NL east but it was their first winning season since 1996.\n\nAfter surviving the contraction attempt, the Expos were once again momentarily saved by the new collective bargaining agreement which stated that no contractions could take place until 2006. Looking to boost revenue, MLB decided that for the 2003 season 22 of the 81 home games would be played in San Juan, Puerto Rico, instead of Montrael. The Expos once again performed surprisingly well that season, finding themselves in a four way tie for a wild card spot by late August. However, Bud Selig announced that the Expos would not do the customary September call ups for any players from the minors which usually adds depth to a team’s lineup. Deflated, Montreal faded from the standings and finished second to last in the NL east.\n\nRelocation and Future (2005 – Present)\n\nThe Expos once again split time between San Jan and Montreal for the 2004 season. They got off to a slow start, and never ended up gaining any traction, finishing the season with 67 wins and 95 losses. On September 29, 2004 MLB officially announced that after an extensive search for various relocation sites, they had settled on Washington D.C. as the new home for the Expos. That same night, the Expos played their last ever game in Montreal, a somber 9-1 loss coincidentally to Jeffrey Loria’s Florida Marlins. A few days later, the Expos traveled to New York and fittingly played their last ever franchise game where they played their first ever game, at Shea Stadium against the Mets. The following season the Expos moved to Washington D.C. and became the Washington Nationals, inspired by the two American league teams that existed between 1901 and 1971, who used both Senators and Nationals as nicknames.\n\nMeanwhile, the Expos old mascot Youppi! Who was first introduced in 1979 after replacing the team’s short lived first mascot “Souki” (after he apparently and this is true, scared too many little children) – Sadly was left without a team to root for. Various local teams around Montreal offered to have Youppi as their mascot, but the Montreal Canadiens stepped in and made a deal with MLB to buy the rights to Youppi from them. With his debut on October 18, 2005, Youppi became the first mascot in professional sports to change leagues. Major League Baseball did find it’s way back to Montreal, when ten years afte r the Expos left, Montreal hosted two spring training games between the Toronto Blue Jays and the New York Mets in 2014. Over the two games, 96,350 packed in Olympic Stadium and let the baseball world know that they wanted their Expos back.\n\nSince baseball left Montreal, there’s been rumors of MLB possibly exploring expanding by adding two new teams in the near future, with Montreal typically at the top of the rumored list. The city has remained attractive due it’s large extended population center of 4.2 million people and it’s rich baseball history, however the weak Canadien dollar in comparison to the American dollar would be a major drawback in considerations. MLB’s commissioner Rob Manfred has stated repeatedly that the league won’t consider expansion until the Oakland A’s and Tampa Rays stadium situations are resolved. Both teams are looking to build new stadiums, and have used relocations to other cities as a possible threat. Recently, there’s been a proposed plan to build a brand new stadium near the Peel Basin area of Montreal. The concept was formulated by an investment group headed by the Expo’s former owner Charles Bronfman’s son, Stephen Bronfamn (appearing on the right) and the former president of the Montreal Canadiens Pierre Boivin (appearing on the left). The idea being that the Tampa Bay Rays could split their season between playing in Tampa and in Montreal (similar to how the Expos split their time between the city and San Juan). As of the recording of this video, there’s been no definitive timetable to build this proposed stadium but who knows, maybe we’ll get to see the Montreal ExRays in the future!\n\nThe Expos legacy has continued to remain enduring, with merchandise sales of their old logo still performing strong. According to retailer Lids, sales of Expos hats have continued to rise every year with it climbing to their fifth most popular hat as of 2018. While the Washington Nationals have honored their Expos past in various ways, it wasn’t until 2019 that the Nationals wore Expos throwback uniforms for the very first time. Which was particularly meaningful, since the Nationals manager Dave Martinez once played for the Expos between 1988 and 1991.\n\nBut what did you guys think of the Expos leaving Montreal and becoming the Washington Nationals? Do you think that baseball could return to Montreal in the future? Let me know in the comments below! And while you’re here, check out some of the other All Sports History’s videos!\n\nAdvertisement"}, {"url": "https://zhuanlan.zhihu.com/p/404531054", "page_content": "在中国文化中，红色通常象征着好运、长寿和幸福，在春节和其他喜庆场合，红色到处可见。人们把现金作为礼物送给家人或亲密朋友时，通常放在红信封里。红色在中国流行的另一个原因是人们把它与中国革命和共产党相联系。然而，红色并不总是代表好运与快乐。因为从前死者的名字常用红色书写，用红墨水写中国人名被看成是一种冒犯行为。\n\n参考译文：\n\nThe color of red in Chinese culture usually means good luck, longevity and happiness. Red can be found everywhere during Chinese Spring Festival and other joyous occasions. Cashes often in red envelopes are sent to family members or close friends as gifts. Its popularity can also be attributed the fact that people accociate it with Chinese revolution and Communist Party. However, it does not always equal to good luck and joy in that the name of the dead used to be written in red. Using red ink to write names of Chinese people were seen as an offense."}, {"url": "https://www.britannica.com/biography/Frank-Robinson", "page_content": "Frank Robinson, (born August 31, 1935, Beaumont, Texas, U.S—died February 7, 2019, Los Angeles, California), American professional baseball player who became the first Black manager in Major League Baseball.\n\nAs a youth, Robinson played sandlot and American Legion Junior League baseball in Oakland, California, and at McClymonds High School, where he also played football and basketball. The right-hander played third base and pitched occasionally. After graduation he was signed by the National League (NL) Cincinnati Reds and played with their minor league teams (third base and outfield) until he joined the parent club in 1956, the year he was awarded Rookie of the Year honours. Robinson won an NL Most Valuable Player (MVP) award in 1961, and he batted more than .300 in 5 of the 10 years before he was traded to the American League (AL) Baltimore Orioles in 1966. In his first season with Baltimore he won the Triple Crown—leading the league in home runs (49), runs batted in (122), and batting average (.316)—and he was named the 1966 AL MVP, becoming the first to win the award in both leagues. He remained with Baltimore through 1971 and then played with the NL Los Angeles Dodgers (1972) and the AL California Angels (1973–74) and Cleveland Indians (1974–76). With 586 career home runs, Robinson ranked fourth in home runs hit, after Hank Aaron (755), Babe Ruth (714), and Willie Mays (660) when he retired in 1976.\n\nBritannica Quiz Sports Quiz\n\nRobinson began managing the Indians in 1975, the first African American to manage a major league team. He had begun his managing career in winter baseball for the Santurce team in the Puerto Rican League in 1968 and had also coached at Baltimore and in the minor leagues for the International League. In 1981 he became manager of the NL San Francisco Giants. In 1984 Robinson returned to the Orioles, working as a coach, as a manager (he was named AL Manager of the Year in 1989), and in the front office for the team’s upper management. He stayed with the Orioles until the end of the 1995 season. In 2000 Robinson was put in charge of discipline as a vice president of Major League Baseball, meting out fines and suspensions in controversial imbroglios. In 2002 he became manager of the Montreal Expos (from 2005 known as the Washington Nationals); he was fired by the franchise in 2006. Robinson was elected to the Baseball Hall of Fame in Cooperstown, New York, in 1982."}, {"url": "https://sabr.org/journal/article/frank-robinson-and-the-trade-that-ignited-two-dynasties/", "page_content": "This article was written by William Schneider\n\nThis article was published in The National Pastime: A Bird’s-Eye View of Baltimore (2020)\n\n“Bad trades are a part of baseball; I mean who can forget Frank Robinson for Milt Pappas for gosh sakes.” — Annie Savoy, Bull Durham\n\nOutside of the 1919 sale of Babe Ruth to the Yankees, baseball trades do not often occupy a persistent niche in pop culture. As the Bull Durham quotation indicates, the December 1965 trade of Frank Robinson from the Reds to the Orioles is a notable exception.\n\nAnnie doesn’t have the details quite right, though. In actuality, the Reds traded 30-year-old All Star outfielder Frank Robinson to the Orioles on December 9, 1965, for a package of players that included 26-year old starting pitcher Milt Pappas, 29-year old reliever Jack Baldschun, and 22-year old outfield prospect Dick Simpson. The trade has gone down in baseball lore as a lopsided deal that gave rise to the strong Orioles team of the late sixties and early seventies while condemning the Reds to second division status. Many articles and books have attempted to dissect the trade, and it frequently makes lists of the worst trades in baseball history.1\n\nOn the surface, the facts seem indisputable. In Robinson, the Orioles acquired a Hall of Fame outfielder in the late prime of his career. He not only won the Triple Crown in his first year in Baltimore (1966), but also was arguably the most important player on Orioles teams that won two World Series and four American League pennants across six seasons. In return, the Reds acquired a good, not great, starting pitcher (Pappas), a washed up reliever who never contributed (Baldschun), and a prospect who failed to make a major-league impact (Simpson).\n\nHowever, as is often the case, there is more to the story. The “obvious” evaluation of this trade might not be the most accurate one. This article will explore an alternate viewpoint, that this trade was much closer to a “Win-Win” than is commonly perceived. In fact, the Big Red Machine might never have existed without it.\n\nThe Reds’ Perspective\n\nFrank Robinson had played for the Reds at an elite level since entering the league in 1956. During his ten seasons (1956–65), he had accumulated 64 WAR and consistently ranked as one of the best players in the major leagues. In 1965, he delivered a slash line of .296/.386/.540 , with 33 home runs, and 113 runs batted in. These numbers were very strong, but at least in terms of conventional stats were down from his 1962 peak of .342/.421/.624, 39 homers, and 136 RBIs,.\n\nAll was not well in Reds country, though. The 1965 Reds had finished 4th in the NL standings, as their strong offense (825 runs, most in the NL) was offset by weak defense (704 runs allowed, fourth worst in the NL). Since appearing in the 1961 World Series, the Reds had won 98, 86, 92, and 89 games, but had yet to claim another NL pennant. The 1965 team had finished a distant eight games behind the National League champion Dodgers.\n\nMoreover, the relationship between Reds owner/GM Bill DeWitt, a portion of the Reds fan base, and Frank Robinson was rocky. Frank had been arrested for possessing a firearm without a permit in Florida during Spring Training in 1961, and DeWitt had elected to let Robinson spend a night in jail without attempting to intervene. Robinson was commonly thought to resent this.2 Additionally, Robinson and the perennially cash-strapped DeWitt had annual salary squabbles for several years. Robinson had even threatened to retire in September 1963 until he received a substantial raise. Reds fans were frustrated at the team’s lack of competitiveness in 1965, and Robinson drew a great deal of their ire. Reds manager Dick Sisler had taken the unusual step of imploring fans to cease booing the outfielder at Crosley Field in August of 1965.\n\nBill DeWitt, under pressure to improve team pitching and in possession of a valuable asset he thought was in decline, proceeded to offer Robinson in trade to several teams. When the Orioles obtained pitcher Baldschun and outfielder Simpson in separate deals and included them with Pappas in their offer, the Reds agreed to the trade.\n\nDeWitt had already been unsuccessful at acquiring Baldschun from the Phillies, and he liked Simpson for his speed and potential. He viewed Pappas as the incoming ace of the Reds staff, and furthermore emphasized his desire to maximize the return for Robinson while he still could. In fact, in a trade defense that is often misquoted, DeWitt described Robinson as “not a young 30,”3 and stated, “we’d rather trade a player a year too soon than a year late.”4\n\nThe Orioles Perspective\n\nThe Baltimore Orioles of the mid-1960s were a team on the rise. They had won 97 games in 1964 and 94 games in 1965, although they finished third in the American League standings both years. Those Orioles teams were pretty well balanced, having finished fourth in the majors both years in runs allowed and ninth (1964) and twelfth (1965) in runs scored. Nonetheless, Orioles General Manager Lee MacPhail thought they needed a change to break through.\n\nIn fact, per Orioles’ Farm Director Harry Dalton, the Orioles were specifically seeking an upgrade to their outfield. After the acquisition of Robinson, Dalton commented, “Oh boy, cannons at the corners!”5 With Robinson in right field, Curt Blefary in left, Brooks Robinson at third, and Boog Powell transitioning from left field to first base, the Orioles did indeed feature strong production at each of these positions. .\n\nPappas had been the Orioles’ best starter in 1965, and the All-Star had pitched over 200 effective innings six out of seven seasons since assuming a full time role in 1959. Nonetheless, a dearth of effective pitching was not really a concern for the Orioles. All six of the pitchers who had made 15 or more starts in 1965 had an ERA+ better than league average, 19-year old Jim Palmer had thrown 92 effective innings, and Tom Phoebus, Jim Hardin, and Eddie Watt were in the Orioles minor league pipeline. The team certainly felt that they had a pitching surplus to leverage, particularly if the payoff was someone of Robinson’s stature.\n\nAs for Baldschun and Simpson, neither had actually appeared in a game as part of the Orioles organization. Both were acquired in December 1965 deals prior to their inclusion in the Robinson trade.\n\nThe Results\n\nFrom the Orioles’ perspective, the trade bore immediate fruit. Robinson came out of the gate exceptionally well in 1966, hitting for a slash line of .463/.585/.976 in April. He finished the year with 49 home runs, 122 runs, 122 runs batted in, and a batting average of .316, winning the American League’s first Triple Crown since 1956 (Mickey Mantle).\n\nFrom a team perspective, the Orioles were also very successful. The team went 11-1 in April, on their way to a 97-63 overall record. They beat the Twins by nine games for the American League pennant, then proceeded to sweep the Dodgers for the first World Series title in franchise history. Robinson capped his dominant season by winning the American League Most Valuable Player award, and was named the World Series MVP as well.\n\nThe significance of Robinson’s arrival in Baltimore went beyond his stellar on-the-field contributions. Robinson’s competitive nature and leadership abilities also helped spur a normally solid team to greatness. Jim Palmer, then just starting his second big league season, noted that the Orioles prior to 1966 had always hoped to win, but, “After [Frank Robinson] got there, we expected to win.”6 Outfielder Paul Blair echoed this sentiment: “We were good before — had great defense, good pitching, decent hitting — but Frank was the key. Not only did he play great, he showed us how to be all business and get the job done.”7\n\nWhat did Robinson do for an encore? He continued to slug, and made the All-Star team four of the next five seasons. Although he never won another Most Valuable Player Award, he finished third in the voting in 1969 and 1971 and garnered votes each year except for 1968.\n\nThe Orioles as a franchise, after a brief drop off in 1967, also continued their strong run. After finishing sixth in the American League standings in 1967, the Orioles climbed to second in 1968, then concluded Frank Robinson’s tenure with the team with three straight 100-win seasons, three straight American League pennants, and another World Series championship in 1970 (ironically defeating the Reds).\n\nMeanwhile, in Cincinnati the results of the trade were not as promising. Pappas struggled out of the gate in 1966, and had a mediocre first season with the Reds (12–11 record, 4.29 ERA, allowed more hits than innings pitched, ERA+ of only 92). Jack Baldschun was a disaster as a reliever, delivering a 5.49 ERA in 57 innings. Prospect Dick Simpson was similarly disappointing , as he contributed a slash line of .238/.333/.405 in 99 plate appearances.\n\nThe Reds fortunes, as might be expected after swapping their best player for middling contributors, collapsed. Cincinnati had been in the thick of the pennant race in 1964, won 89 games in 1965 (fourth place), and in 1966 could only manage 76 wins and a seventh-place finish. The Reds’ traditionally strong offense dropped off considerably, and the pitching did not substantially improve, despite trading Robinson for pitching help.\n\nFan and pundit reactions were mixed immediately after the trade, but the criticism mounted throughout the season as Robinson continued to produce and the Reds continued to struggle. Reds fans did not accept the team’s declining fortunes, and Bill DeWitt took the brunt of their ire. DeWitt experienced the ignominy of being hung in effigy in downtown Cincinnati in June, his earlier good work in shepherding the Reds to the 1961 National League pennant seemingly forgotten.8\n\nDeWitt was embattled on another front as well, as the Reds were in discussions with the city of Cincinnati for a new stadium to replace Crosley Field. DeWitt believed the Reds should move out of downtown Cincinnati to a suburban location, and as a result was unwilling to commit to an extended lease in a downtown location. When National League president Warren Giles said he would block any move out of the city, DeWitt was left with few viable alternatives.9 He sold the team to a group of local businessmen on December 5, 1966, only four days shy of a year after the trade that ultimately defined his legacy.\n\nMilt Pappas would enjoy a strong year for the Reds in 1967, going 16-13 with a 3.35 ERA in 217 innings. But he struggled in 1968, and he was traded to the Atlanta Braves in June after delivering a 5.60 ERA in 15 games for the Reds. Jack Baldschun only appeared in nine games in 1967 and spent the rest of his time with the Reds in the minors until his 1969 release. Dick Simpson played in only 44 games and batted .259/.339/.370 in 62 plate appearances in 1967, and then was traded to the St. Louis Cardinals in the offseason.\n\nMost conventional analyses of the “Frank Robinson trade” end here, as Robinson continued to play well for the Orioles, while the Reds had parted ways with all of the players they had acquired. Using WAR, here is how the trade stacked up:\n\nTable 1: WAR Comparison for Directly Traded Players\n\nSeason Orioles WAR Reds WAR 1966 Robinson 7.7 Pappas 2.4 1967 Robinson 5.4 Pappas 3.6 1968 Robinson 3.7 1969 Robinson 7.5 1970 Robinson 4.8 1971 Robinson 3.3 Orioles Total 32.4 Reds Total 6.0\n\nNote: Baldschun and Simpson failed to contribute positive WAR to the Reds.\n\nOn the surface, this seems a convincing win for the Orioles. But although the Reds released Baldschun, Pappas and Simpson would eventually be traded for other players. A comprehensive review of the total impact of the Reds-Orioles trade not only needs to consider the contributions the players made directly to their respective teams, but also the contributions made by players that were acquired in exchange for them. Here’s where the story gets more interesting.\n\nMilt Pappas was traded to the Atlanta Braves on June 11, 1968, along with pitcher Ted Davidson and infielder Bob Johnson, for pitcher Clay Carroll, pitcher Tony Cloninger, and shortstop Woody Woodward. At the time of the trade, Davidson was a 28-year old with a 6.23 ERA and Johnson was a 32-year old with only 17 plate appearances. It is clear the Braves were trading for Pappas.\n\nDick Simpson was traded to the St. Louis Cardinals on January 11, 1968, for outfielder Alex Johnson. Johnson would play two years for the Reds before he was traded in turn, along with utility man Chico Ruiz, to the California Angels for pitchers Pedro Borbon, Jim McGlothlin, and Vern Geishert.\n\nThe sum contributions of all the players acquired by the Reds need to be contrasted with Robinson’s value to the Orioles to evaluate the total on-field impact of the Robinson trade.\n\nI chose to use Baseball-Reference.com’s Wins Above Replacement (WAR) to measure value, and I have further chosen to utilize only positive WAR and ignore negative WAR. My logic is this: the purpose of a trade is to provide assets to the team. Suboptimal deployment of those assets (such as continuing to start a below-replacement level pitcher every five days) are not necessarily reflective of the trade. I also restricted the analysis to the years 1966–71 when Robinson played for the Orioles. Going beyond that point gets increasingly complicated due to the number of players involved.\n\nHere is how the trade stacks up considering all assets acquired by the Reds through 1971:\n\nSeason Orioles WAR Reds WAR 1966 Robinson 7.7 2.4 Pappas 2.4 1967 Robinson 5.4 3.6 Pappas 3.6 1968 Robinson 3.7 6.2 Carroll 3.1\n\nA. Johnson 3.1 1969 Robinson 7.5 5.1 Carroll 1.2\n\nWoodward 0.5\n\nA. Johnson 3.4 1970 Robinson 4.8 7.8 Carroll 2.0\n\nCloninger 1.8\n\nWoodward 0.5\n\nMcGlothlin 3.5 1971 Robinson 3.3 3.9 Carroll 1.7\n\nCloninger 0.4\n\nWoodward 0.4\n\nMcGlothlin 1.4 Orioles Total 31.4 Reds Total 29.0\n\nNote: Baldschun and Simpson failed to contribute positive WAR to the Reds and Pappas didn’t in 1968; Carroll played for the Reds through 1975, Borbon through 1979.\n\n\n\nWhen seen through this lens, the trade was not nearly the disaster for the Reds it has widely been assumed to be. In fact, the trade was arguably a significant enabler to the launching of the “Big Red Machine” Reds team of 1970–76.\n\nThere is one more very significant consideration when evaluating this trade. The architect of the Reds of 1970–76 was legendary general manager Bob Howsam. He masterminded the 1972 trade that brought Joe Morgan to the Reds, hired Sparky Anderson, traded for George Foster, drafted Ken Griffey Sr, and made many other roster moves that were essential to creating one of baseball’s all-time best teams.\n\nIf the Robinson trade had not occurred, it is likely that Bill DeWitt would have remained in charge of the Reds, Howsam would have gone elsewhere, and baseball history might have been very different. Despite his accomplishments prior to the Robinson trade, there is nothing in his resume to indicate that he had the acumen to forge the Reds into the perennial championship-winning force they would become.\n\nThe acquisition of Frank Robinson spurred the start of the Orioles dominance. There is no doubt that with the benefit of hindsight the Orioles would make the trade again and the Reds would not. However, that 1965 trade of Frank Robinson for Milt Pappas, Jack Baldschun, and Dick Simpson ignited the great Reds team, as well.\n\nWILLIAM SCHNEIDER has been a baseball fan since opening his first pack of baseball cards in 1974. An engineer by trade, he has a particular interest in the strategic and team-building aspects of the game. He has contributed articles to several SABR publications.\n\n\n\n\n\nTHE SECOND FRANK ROBINSON TRADE\n\nAnother bad Frank Robinson trade? The sidebar practically writes itself.\n\nOn December 6, 1971, the Orioles traded Frank Robinson and reliever Pete Richert to the Los Angeles Dodgers for a package of young players including pitcher Doyle Alexander, pitcher Bob O’Brien, catcher Sergio Robles, and outfielder Royle Stillman. Here’s the positive bWAR earned by the players in the trade (regardless of team) until the end of Robinson’s playing career in 1976:\n\nDodgers Received Orioles Received Frank Robinson 11.2 Doyle Alexander 3.7 Pete Richert 2.4 Bob O’Brien 0 Sergio Robles 0 Royle Stillman .2 Dodgers Total 13.6 Orioles Total 3.9\n\nDespite Robinson’s advanced age (he was 36 at the time of the trade), this appears to be a second trade that confirms the idea that you will not get value when trading Robinson. However, just like the 1965 Reds-Orioles trade, there is more to the story.\n\nOn June 15, 1976, the Orioles traded Doyle Alexander, Jimmy Freeman, Elrod Hendricks, Ken Holtzman, and Grant Jackson to the New York Yankees for catcher Rick Dempsey and four pitchers: Tippy Martinez, Rudy May, Scott McGregor, and Dave Pagan. The headline players were Alexander (coming off a 2.1 WAR season in 1975) and Holtzman (5-4 with a 2.86 ERA at trade time), while Hendricks (aged 35) was nearing the end of his career, Freeman was a non-prospect by that point, and Jackson would be left unprotected in the 1976 expansion draft.\n\nIn return, the Orioles received quite a haul. Dempsey, Martinez, and McGregor would all be important players in the Orioles next run of greatness (1977 to 1983), with each playing for the team through at least 1986. May kicked in 2.2 WAR from 1976–77, while Pagan failed to develop and was left unprotected in the expansion draft. Dempsey, Martinez, McGregor, and May contributed 53.8 WAR to the Orioles in total.\n\nThe Alexander trade, which was only possible because Alexander had come for Robinson, was one of the best trades in Orioles history. Unlike Bill DeWitt in 1965, Orioles general manager Frank Cashen successfully executed Branch Rickey’s “better to trade them a year early than a year late” dictum.\n\nSources\n\nPhotos: National Baseball Hall of Fame Library, The Topps Company\n\nNotes\n\n1 “For those reasons, and they are good reasons, many people in Cincinnati will always view the Robinson trade as the worst trade ever made by the Reds.” Doug Decatur, Traded: Inside the Most Lopsided Trades in Baseball History (ACTA Sports, 2009).\n\n2 “Two thoughts stayed with him (Robinson). He didn’t know he needed a permit for the gun, but he should have known; and if Gabe Paul had still been the General Manager he would not have had to spend the night in jail.” John C. Skipper, Frank Robinson (McFarland and Company, 2015).\n\n3 Rob Neyer, “Rob Neyer’s Book of Baseball Blunders (Simon and Schuster, Inc., 2006).\n\n4 Robert H. Boyle, “Cincinnati’s Brain Picker,” Sports Illustrated June 13, 1966.\n\n5 G. Richard McKelvey, The MacPhails: Baseball’s First Family of the Front Office (McFarland & Co., 2000).\n\n6 John Eisenberg, From 33rd Street to Camden Yards: An Oral History of the Baltimore Orioles (Contemporary Books, 2001).\n\n7 Eisenberg, From 33rd Street to Camden Yards.\n\n8 “Fans Hang DeWitt Effigy in Downtown Cincinnati,” The Sporting News, July 2, 1966.\n\n9 Mark J. Schmetzer, Before the Machine (Cleristy Press, 2011)."}, {"url": "https://www.newsday.com/sports/baseball/mets/40-years-ago-the-mets-did-the-unthinkable-they-traded-tom-seaver-j69907", "page_content": "Forty years ago, the Mets did the unthinkable. They traded Tom Seaver — The Franchise — to the Reds in a deal that many longtime fans have neither forgotten nor forgiven.\n\nThe trade deadline of June 15, 1977, became a day of wreckoning as the Mets sent their future Hall of Famer packing over a salary dispute with board chairman M. Donald Grant.\n\n“What were they thinking?’’ former teammate Bud Harrelson said recently, echoing a question that Mets fans have been asking since the deal.\n\nSeaver’s departure was a seismic event that lit up the Shea Stadium switchboard with calls from angry fans shaken by the trade of the team’s star, who had won three Cy Young Awards.\n\nWith the beginning of big free-agent contracts, Seaver, in spring training in 1977, wanted to renegotiate the three-year deal he signed in February 1976 that paid him a base salary of $225,000 a year.\n\nBefore signing that deal, Seaver had told then-team president Lorinda de Roulet, daughter of founding owner Joan Whitney Payson, that the time had arrived for the $200,000-plus price tag\n\n“She said, ‘Over my dead body,’ ’’ Whitney de Roulet Bullock, the owner’s daughter, said from her home in upstate Millbrook.\n\nGrant, who ran the baseball operations, would not consider renegotiation. Seaver was shipped to Cincinnati for top minor league outfield prospect Steve Henderson, pitcher Pat Zachry, utility infielder Doug Flynn and minor league outfielder Dan Norman.\n\nHarrelson recently visited Seaver and his wife, Nancy, at their Napa Valley vineyard in Calistoga, California. Seaver has been coping with some effects of Lyme disease, a bacterial infection transmitted by ticks that he traced to when he lived in Greenwich, Connecticut, in 1991. “The Lyme has impacted his short-term memory, but he is in great physical health,” said Seaver’s daughter, Anne.\n\nHarrelson said Seaver “looks good, he’s happy.’’\n\nSeaver, 72, declined to be interviewed.\n\nHarrelson, 73, said he recalled that evening in Atlanta when Seaver was traded. “I cried,’’ Harrelson said. “He was my buddy. We were roomies. I went and hugged him and cried.’’\n\nSeaver, coming off a season in which he went 14-11 with a 2.59 ERA, was 7-3, 3.00 at the time of the trade. He had extricated the Mets from their early years as baseball’s bumblers and led them from 1968’s ninth-place finish to the 1969 World Series championship.\n\nLorinda de Roulet was appointed team president by her father, Charles Payson, who took over ownership of the Mets when Joan Payson died. The Harvard-educated Payson identified himself as a Red Sox fan. Grant had been Mrs. Payson’s financial adviser. Grant, who lived on Long Island in Lawrence, honed his financial skills as a broker on Wall Street.\n\nGrant wanted no part of free agency when it appeared on the horizon in a December 1975 ruling by arbitrator Peter Seitz that essentially nullified the reserve clause, which bound players to one team for life. The ruling was upheld by a federal court in March 1976, and shortly thereafter, Major League Baseball and the players association agreed to allow players with at least six years of service to become free agents.\n\nSeaver’s salary seemed a pittance when Andy Messersmith signed a three-year deal for $1 million with the Braves and Wayne Garland got a 10-year, $2.3-million pact with the Indians.\n\nThe Yankees were flourishing in the Bronx under free-spending owner George Steinbrenner, who in November 1976 signed Reggie Jackson to a five-year deal worth $3 million after signing Catfish Hunter to a five-year deal worth $3.35 million.\n\n“Donald did not want to get involved with free agency like Steinbrenner was,’’ former Mets pitcher Craig Swan, 66, said from Fort Myers, Florida. “We were just getting retreads mostly.’’\n\nGRANT TAKES HEAT\n\nIn February 1977, Seaver openly complained about Grant not spending money to improve the Mets, who would finish 64-98. Grant reportedly called Seaver “an ingrate.’’ De Roulet Bullock, who then worked in the Mets’ public relations department, said her family supported Grant’s position. “Everybody felt strongly, a contract is a contract is a contract,’’ she said.\n\nLorinda deRoulet, 84, declined to comment from her home in Manhasset. Grant died at 94 in 1998.\n\nThe National League was taken aback by the trade. “Everybody held their nose about it,’’ said Louis Hoynes of Glen Cove, the league’s lawyer at the time, who was a friend of Lorinda deRoulet’s. “I think it was a miscalculation by Don Grant . . . He was on the wrong side of history.’’\n\nMost in the media portrayed Grant as a curmudgeon. With withering attendance at Shea Stadium, the ballpark was called “Grant’s Tomb.’’ Former Newsday columnist Joe Gergen referred to Grant as “chairman of the bored.”\n\n“He got off on the wrong foot with the sports press,’’ Michael Grant, 79, said of his father. “They pictured him as a member of the elite moneyed class, a stuffed shirt. He was anything but that. He was a guy that came to this country in the Depression and made his way. He never even graduated from high school. He’s a guy that really founded the Mets and fought for them when the National League [Dodgers and Giants] left New York and went to California.’’\n\nSeaver wasn’t the only Met trying to get the team to buy into free agency. “I made comments along the lines that I wish there would be something done to improve the ballclub and it was taken as someone who is disgruntled and wanted to be traded,’’ pitcher Jon Matlack, 67, said from upstate Johnsburg. He was sent to the Texas Rangers after the ’77 season.\n\n“It’s just the owners not knowing the economics of the game,” said former catcher John Stearns, 65, speaking from Aurora, Colorado. “They were old-school, where players shouldn’t make any money, and within a few years, salaries skyrocketed. Seaver should have never been traded.’’\n\nA day before the trade, Daily News columnist Dick Young wrote that Seaver was envious of former teammate Nolan Ryan, who was making $300,000 with the Angels. “That galls Tom,’’ Young wrote, “because Nancy Seaver and Ruth Ryan are very friendly and Tom Seaver long has treated Nolan Ryan like a little brother.’’\n\nThat put Seaver over the edge. “That column was the straw that broke the back,’’ Seaver was quoted as saying in 2007. “Bringing your family into it with no truth whatsoever to what he wrote. I could not abide by that. I had to go.’’\n\nSeaver also said he could no longer work under Grant.\n\nMichael Grant, a financial adviser who lives in Riverside, Connecticut, said his father “thought he had done well by Seaver and that Seaver had rejected him. He would stand fast in the fact that Seaver traded himself. It had to taste bad that when Seaver got away, he was going to be smeared with the responsibility of it all. He felt bad about being labeled a villain. He went out as a villain, as somebody who was a terrible baseball executive. It was just sad that in the waning days while he was still chairman, he needed a bodyguard to walk around Shea Stadium.’’\n\nM. Donald Grant was fired after the 1978 season by Charles Payson. The team was sold to Doubleday in 1980. Fred Wilpon had a fractional percentage but became the principal owner in 2002.\n\nMichael Grant said that long after the trade, he and Seaver remained friendly neighbors in their Greenwich community but that the rift between the pitcher and Donald Grant “never got healed.’’\n\nJOINING BIG RED MACHINE\n\nSeaver joined a Reds team that had won the 1975 and 1976 World Series. “All of a sudden, we have Tom Seaver,’’ former Reds pitcher Jack Billingham, 74, said from New Smyrna Beach, Florida. “But to me, Tom Seaver is a Met.’’\n\nSeaver spent six seasons with the Reds and pitched a no-hitter on June 16, 1978, but the Reds did not win another title during his tenure.\n\nThe players traded for Seaver quickly understood the magnitude of the deal from the New York perspective.\n\n“When you pick up a newspaper and it says ‘Midnight Massacre,’ it kind of gives you an idea,’’ said Flynn, a banking executive in Louisville, Kentucky. “I can understand what was going through the minds of the fans. They were getting rid of The Franchise.’’\n\nFlynn spent five years with the Mets and had a batting average of .234. He won a Gold Glove in 1980. Henderson showed an early flash, hitting 12 homers in 99 games in ’77 and finishing second in the Rookie of the Year voting to Andre Dawson, but he totaled only 25 homers in the next three seasons and was traded to the Cubs for slugger Dave Kingman. Norman played in 139 games over four seasons and ended his career with the Expos in 1982.\n\nFlynn, 66, said it was impossible for the quartet of players to replace Seaver. “Y’all kept reminding us of it, so it was hard’’ not to think about it, he said. “I got cut from a college team and then signed from a tryout camp. And then all of a sudden, to be thrown into that situation. To be compared to what Tom had done would be silly on our part.’’\n\nEPILOGUE\n\nWith the Mets now owned by Doubleday and Wilpon, Seaver, then 38, was reacquired from the Reds in 1982 for Charlie Puleo, Lloyd McClendon and Jason Felice. But in the winter of 1984, the Mets again lost Seaver. This time they left him unprotected in the free-agent compensation pool and he was selected by the White Sox. He won 31 games in two seasons for Chicago, including his 300th win, which came at Yankee Stadium.\n\nSeaver pitched his last big-league games with the Red Sox in 1986 — the year the Mets beat that team for their second world championship. A knee injury sidelined Seaver in the Series.\n\nIn June 1987, Seaver tried a comeback with the Mets but officially retired after taking a drubbing by Triple-A Tidewater in an exhibition game.\n\nAfter his playing days, Seaver was a color commentator on television for the Mets but had more popularity when he teamed with Phil Rizzuto on Yankees telecasts from 1989-93. The Mets retired his No. 41 in 1988 and he was elected to the Hall of Fame in 1992 with the highest percentage of votes (98.8) until Ken Griffey Jr. (99.3) in 2016.\n\nSeaver’s relationship with the Mets nowadays is unclear. Last season, his wife chastised the team for not erecting a statue of her husband, saying in a published report that she was ”embarrassed’’ for them. Sources say the Mets would like to honor Seaver ahead of the 2019 reunion of the ’69 Mets, but no date has been announced. Nancy Seaver did not return calls.\n\n“I think he just doesn’t like New York anymore,’’ Harrelson said. “He just doesn’t want to come back.’’\n\nPerhaps he feels disenfranchised."}, {"url": "https://www.amazinavenue.com/2018/6/15/17459040/mets-tom-seaver-41-years-ago-midnight-massacre-reds", "page_content": "It’s unusual for a story to begin by referencing the photograph that accompanies it, but seeing Tom Seaver in a Cincinnati Reds’ uniform still evokes agita, pain and sadness to many Mets fans. Today is the 41st anniversary of what would come to be known as the Midnight Massacre—the day Tom Seaver, #41, was traded away.\n\nThe cast of characters responsible for the trade are many, but the principals were Seaver, M. Donald Grant, the chairman of the board of the Mets, and NY Daily News columnist Dick Young. The roots of all of the deal can be traced back to July 12, 1976, when a new Collective Bargaining Agreement was reached which, among other items, ushered in free agency for the first time. At the time, Seaver signed a three-year deal worth $675,000 making him the highest paid pitcher in baseball, a distinction that would turn out to be very temporary. His deal was reached just a few months before the new CBA was adopted and was said to be a contentious negotiation between Grant and Seaver’s agent.\n\nIn the winter between the ‘76 and ‘77 seasons, owners of other teams raced to sign their players and acquire new ones with free agency in place, but the Mets were strangely quiet. This perturbed Seaver as the Mets, who finished 3rd in 1976, fifteen games out of first place, were sorely lacking in offensive production. Outfielder Gary Matthews was available and many felt he would have been a perfect fit, but Grant and general manager Joe McDonald made no effort to sign him, and Matthews instead signed a five-year deal with the Braves. Seaver later told reporters, “How can you not even try?” The rift between management and Seaver was widening.\n\nAs spring training began, Seaver, who was the Mets’ player representative in labor negotiations, was happy that so many players had received marked raises and long term contracts. Across baseball, 11 pitchers signed multi-year deals worth $1 million or more. Seaver’s good friend Nolan Ryan, who the Mets traded to the Angels in 1971, was not eligible for free agency but received an increase in salary to $300,000. Seaver wanted to renegotiate his contract to bring his salary in line with other top pitchers. Grant refused and even became nasty, calling Seaver a “communist” in the clubhouse for wanting more money and later berating him for joining a swanky country club.\n\nThe situation was made even more tense by Daily News columnist Dick Young who was one of the few columnist in town who sided with Grant. calling Seaver’s demands “greedy.” Negative piece after negative piece appeared in the News, drawing ire from both fans and fellow writers.\n\nSeaver was advised to go over the head of management and talk directly with owner Lorinda deRoulet. She, Seaver, and McDonald worked out, in principle, a three-year contract extension as the trade deadline approached. However, before it was signed, Young wrote a suspicious column that intimated that Seaver was being goaded by his wife to ask for more money, supposedly because she was jealous that Nolan Ryan was making more money than Seaver. The mention of his wife enraged Seaver, and while in a coffee shop in Atlanta, phoned Met management to inform them the deal was off and to “get me out of here.” McDonald complied and 41 years ago today, Seaver was traded to the Reds for pitcher Pat Zachary, minor leaguers Steve Henderson and Dan Norman, and infielder Doug Flynn. That night, the Mets also traded Dave Kingman to the Padres for Paul Siebert and Bobby Valentine, and Mike Phillips to the Cardinals for Joel Youngblood. The trio of trades would be dubbed the Midnight Massacre.\n\nSeaver’s departure led to widespread negative fan reaction, ranging from fans openly weeping to physical threats to Mets’ management on signs displayed around the city. With Seaver gone, Mets fortunes quickly sank as they finished in last place the next three seasons, and would not have a winning record again until 1984. Attendance also suffered with 1979 being the nadir, as the Mets averaged less than 10,000 fans per game.\n\nThe Midnight Massacre occurred a generation ago. The Mets going forward would win divisions, National League pennants and even a World Series in 1986. But the ugly stain left by this team on a June night 41 years ago will never fully be removed. That was the night our number 41 was taken away from us. It was a night that forever changed the franchise, because The Franchise was gone."}]}