{"Rick Mahler pitched over 200 innings in six consecutive seasons from 1983 to 1988.": [{"url": "http://historicbaseball.com/players/m/mahler_rick.html", "page_content": "\n\n\n\nSponsor a page on Historic Baseball! Click here for details\n\nRick Mahler\n\nRichard Keith Mahler\n\nBorn: Aug. 5, 1953 in Austin, Texas\n\nDied: March 2, 2005 in Jupiter, Fla.\n\nDebut: 1979 | Pos: P\n\nH: 6'1\" | W: 202 | B: R | T: R\n\nYrs W L G SV IP SO ERA 13 96 111 392 6 1951.1 952 3.99\n\n>> Visit the Rick Mahler biography on Baseball Almanac for complete statistics.\n\nRick Mahler, who won 96 games in his 13-year career in the major leagues, died of a heart attack at his home in Jupiter, Fla., on March 2, 2005. He was 51.\n\nMahler was 96-111 in 13 seasons with a 3.99 career ERA. He pitched 1,951.1 innings pitched and recorded 952 strikeouts.\n\nMahler was scheduled to begin his second season as a minor league pitching coach for the New York Mets with the Class A team in Port St. Lucie.\n\n\"He was a great guy, a great teammate,\" Tom Glavine, friend and former teammate, said in wire reports. \"I talked to him a lot about pitching when I first came up. He was a big help, especially for a young guy who was struggling.\"\n\nMahler debuted with Atlanta in 1979 and his best seasons with the team came from 1984 to 1986. In 1985, he was 17-15 with a 3.48 ERA in 266.2 innings on a team that won just 66 games.\n\nIn 1986, he won 14 games, but led the major leagues with 18 losses.\n\nHe pitched for the Reds in 1989 and 1990, pitched 10 games for Montreal in 1991 and finished up his career with the Atlanta Braves in 1991.\n\nHe pitched twice in the postseason -- with Atlanta in the NLCS in 1982 and with Cincinnati in the NLCS in 1990.\n\nHis brother, Mickey, also pitched in the major leagues and posted a 14-32 record from 1977 to 1986.\n\nMahler worked in the minor league organizations of Kansas City, Florida and St. Louis before becoming the manager of the Cardinals' Double-A affiliate in the Texas League in 1996-97."}, {"url": "https://www.baseball-almanac.com/players/pitchinglogs.php?p=mahleri01&y=1983", "page_content": "Rick Mahler pitched in 10 Major League games during the 1983 regular season. The chart below is a comprehensive analysis of the games Mahler pitched in, specifically relating to his 1983 pitching statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Mahler started that game. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Rick Mahler pitched 5 games at home, had an ERA of 3.00, pitched 6 innings, allowed 6 hits, had 2 earned runs, 2 runs, and 0 home runs, walked 3 batters (0 intentionally), threw 0 wild pitches, hit batters 0 times, and balked 0 times?\n\nOn the road, Rick Mahler pitched 5 games, had an ERA of 6.67, pitched 8.1 innings, allowed 10 hits, had 6 earned runs, 6 runs, and 0 home runs, walked 6 batters (1 intentionally), threw 0 wild pitches, hit batters 0 times, and balked 0 times.\n\nAre you a Rick Mahler fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}, {"url": "https://www.baseball-almanac.com/players/pitchinglogs.php?p=mahleri01&y=1985", "page_content": "Rick Mahler pitched in 39 Major League games during the 1985 regular season. The chart below is a comprehensive analysis of the games Mahler pitched in, specifically relating to his 1985 pitching statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Mahler started that game. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Rick Mahler pitched 19 games at home, had an ERA of 3.27, pitched 135 innings, allowed 131 hits, had 49 earned runs, 53 runs, and 12 home runs, walked 38 batters (4 intentionally), threw 1 wild pitches, hit batters 1 times, and balked 1 times?\n\nOn the road, Rick Mahler pitched 20 games, had an ERA of 3.70, pitched 131.2 innings, allowed 141 hits, had 54 earned runs, 63 runs, and 12 home runs, walked 41 batters (4 intentionally), threw 2 wild pitches, hit batters 1 times, and balked 0 times.\n\nAre you a Rick Mahler fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}, {"url": "https://www.baseball-almanac.com/players/pitchinglogs.php?p=mahleri01&y=1986", "page_content": "Rick Mahler pitched in 39 Major League games during the 1986 regular season. The chart below is a comprehensive analysis of the games Mahler pitched in, specifically relating to his 1986 pitching statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Mahler started that game. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Rick Mahler pitched 18 games at home, had an ERA of 4.56, pitched 118.1 innings, allowed 130 hits, had 60 earned runs, 67 runs, and 16 home runs, walked 44 batters (3 intentionally), threw 0 wild pitches, hit batters 1 times, and balked 1 times?\n\nOn the road, Rick Mahler pitched 21 games, had an ERA of 5.21, pitched 119.1 innings, allowed 153 hits, had 69 earned runs, 72 runs, and 9 home runs, walked 51 batters (7 intentionally), threw 5 wild pitches, hit batters 2 times, and balked 0 times.\n\nAre you a Rick Mahler fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}, {"url": "https://stathead.com/sharing/7JdL4", "page_content": "Most seasons with 200 innings\n\ngenerated by a site user\n\nThis report was generated using the SHARE link located just above the stat tables on the site. Give it a try!\n\nUser's Notes:\n\n\n\nPlease report any abuse."}, {"url": "https://sports.yahoo.com/blogs/big-league-stew/mark-buehrle-7th-pitcher-since-1901-to-throw-200-innings-14-straight-seasons-144701676.html", "page_content": "If they ever give Mark Buehrle of the Toronto Blue Jays a nickname, \"Mr. Durable\" sounds about right. Well, it sounds kind of boring, but it would be accurate. Buehrle surpassed the 200 inning mark for the 14th consecutive season in a 1-0 victory against the Seattle Mariners on Wednesday night.\n\nHe's just the seventh pitcher to do it since 1901, and all of the others are in the Hall of Fame. He seldom gets mentioned in the same circles as Warren Spahn, Don Sutton, Gaylord Perry, Phil Niekro, Christy Mathewson and Greg Maddux, but his effective durability is among the best who have ever pitched. And he's never gotten the volume of postseason opportunities as, say, Andy Pettitte — but he's been no less valuable during the regular season.\n\nSo it's not just longevity, which sometimes is used as a degrading code word. Buehrle has been very good, too. Note another impressive milestone for Buehrle he achieved against the M's: He's the first pitcher to record at least 200 innings with 61 or fewer walks in 14 straight years. The person he surpassed: Cy Young.\n\nScroll to continue with content Ad ADVERTISEMENT\n\nCall Buehrle \"Mr. Accurate,\" too. Even if that also sounds kind of boring. Geez, Buehrle, c'mon.\n\nIt's kind of amazing, though, giving the biblical amounts that pitchers used to pitch 100 years ago (and even more recently), that there aren't more than seven pitchers who have gone 200 innings 14 straight times.\n\n(AP)\n\nBuehrle said he wasn't sure, in the middle of the season, if he'd make it to 200.\n\nVia MLB.com:\n\n\"I think when I had two or three starts in a row I had three innings, four innings, mixed a six-inning game in there, I kind of, I don't want to say gave up, I said, 'Hey it's not going to happen.' I did the math and said I have eight starts, I need so many innings, I didn't like my chances. It means a lot because I put this goal on myself in Spring Training.\"\n\nAdvertisement\n\nHe's probably not going to Cooperstown. Only once has Buehrle gotten significant AL Cy Young Award votes; in 2005. He led the league in starts twice, in innings twice, in batters faced twice. In WHIP, once. Made the top 10 in ERA four times. He's made five All-Star teams, won four Gold Gloves. He'd be a below-average Hall of Famer. He ranks 90th on the JAWS meter, which measures peak performance for wins above replacement level among pitchers. He's better than Whitey Ford and 13 others who are in the Hall, though.\n\nIn reaching these milestones, Buehrle might not immortalize himself with the highest honors or the most fabulous nicknames (How about \"Mr. Fabulous\"?!\"), but he does ink himself in the record books. People will know. Mark Buehrle was darned good.\n\nMore MLB coverage at Yahoo Sports:\n\n- - - - - - -\n\nDavid Brown is an editor for Big League Stew on Yahoo Sports. Have a tip? Email him at rdbrown@yahoo-inc.com and follow him on Twitter!\n\nFollow @AnswerDave"}, {"url": "https://bravesjournal.com/2006/10/21/no-30-rick-mahler/", "page_content": "Righthanded Pitcher\n\nSeasons With Braves: 1979-1988; 1991\n\nStats With Braves: 79-89, 4.00 ERA\n\nI may have struggled with Rick’s ranking even more than Glenn Hubbard’s. The raw numbers say that he was an average or slightly below-average pitcher for the bulk of his Braves career. His ERA is worse than the league average, but that’s park effects; adjust for that, and it’s average. He didn’t strike a lot of people out and thus allowed a lot of balls in play. Considering the defense behind him, that was not ideal. I expect that the two thoughts that crossed Mahler’s mind most when he was on the mound in those years were “Please hit it to Hubbard” and “How did he drop that?”\n\nRick was signed as an undrafted free agent out of Trinity University in 1975. He dominated the low minors but ran into a speedbump in Richmond in 1977. He righted the ship and spent the next three years pitching the International League to a standstill with only 15 relief appearances in the majors in 1979 and two in 1980 to show for it. Bobby finally gave him a full chance in 1981 and he responded by going 8-6 with a 2.80 ERA, pitching both relief and in the rotation.\n\nRick wasn’t as good in 1982 and wound up spending most of 1983 back in Richmond. From 1984 to 1988 he was the workhorse of the big league staff. He pitched very well in the first two years, a combined 30-25 with a 3.32 ERA (well below the league considering the park). The team collapsed anyway, and Mahler had a rough time the next two seasons, even falling out of the rotation in 1987. He rebounded some in 1988, putting up an ERA right about the average, but that team was so bad he went 9-16 anyway. He left as a free agent after the season, but was more or less washed up. After a couple of seasons in Cincinnati and a half season with the Expos, he was released.\n\nThe Braves brought Mahler back (middle of a pennant drive, though nobody quite believed that in June of 1991) but he really had nothing left. Mostly he pitched relief, but did make two starts. In one of them, against the Pirates on July 29, he went six innings, allowed two runs, and got the win. But he wiped out in his second start, against the Giants, and that was the last appearance of his career.\n\nSo, how does he rank? Hard to say. He pitched a lot of innings for the Braves. Only four men (you probably know who) have pitched more for the team since 1966. On the other hand, those innings were largely piled into a five-year stretch where the team went 341-465, so what good were they? He wasn’t an ace, really, he was just the best that they had. The only positive category in which he ever led the league was starts, twice. On the other hand, he led the league in hits allowed four times, earned runs allowed twice, and losses once.\n\nI tend to think that given a real defense behind him, Rick Mahler would have won a lot of games. The Braves’ defense was very bad, and he was a guy who needed a good defense. In a way, it’s surprising that he did as well as he did. Tom Glavine couldn’t have won with the defense Mahler had to work with. In point of fact, he didn’t; he only became Tom Glavine when they were replaced with real infielders. Think on it: if Mahler could put up average ERAs with Bob Horner, Ken Oberkfell, and the Dysfunctional Duo (Ramirez and Thomas) behind him, what could he have done with Lemke and Pendleton?\n\nBut in the end, he didn’t get that chance, and with the hand he was dealt he was ordinary. At any rate, I still don’t really know where to rank him. It’s possible that he really doesn’t belong, but I just couldn’t see it.\n\nRick Mahler Statistics – Baseball-Reference.com"}, {"url": "https://prabook.com/web/rick.mahler/1946793", "page_content": "Rick Mahler\n\nbaseball player\n\nAugust 5, 1953 (age 51) Austin, Texas , United States\n\nThe two had previously been teammates playing for the Triple-A Richmond Braves. In his 13-year career, Mahler posted a 96–111 record with 952 strikeouts and a 3.99 European Research Area in 1951.1 innings. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season. He made four straight opening day starts beginning in 1985. In 1987, he tied an Netherlands record with his third opening day shutout. His best season came in 1985, when he went 17-15 with a 3.48 European Research Area. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season. After retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the Saint Louis Cardinals. He also managed Saint Louis\" Double-A affiliate in the Texas League from 1996 to 1997. Mahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets."}, {"url": "https://www.arkansasonline.com/news/2021/oct/01/mlbs-200-inning-club-becomes-quite-exclusive/", "page_content": "Los Angeles Dodgers right-hander Walker Buehler has a lot of pride in reaching 200 innings pitched this season, especially considering he's battled injuries through parts of his career, including Tommy John surgery.\n\nConsidering the current state of big-league pitching, it's even more impressive.\n\n\"I've never done it before and it's weird because it used to be the norm,\" Buehler said. \"It's been a goal of mine for a long time. It's hard to put into words because you're doing it over 32, 33 starts.\"\n\nIt appears that just four pitchers will reach the 200-inning mark this season, including Buehler, Phillies right-hander Zack Wheeler, Cardinals right-hander Adam Wainwright and Marlins righty Sandy Alcantara. That would be the fewest in a full season in modern MLB history.\n\nBuehler's durability has been a bonus for the Dodgers, who have won 102 games and are still in the hunt for another NL West title.\n\n\"It's great, certainly considering what we've been through with pitching,\" Dodgers Manager Dave Roberts said. \"To really be able to bank six or six-plus [innings] every time he takes the mound is huge.\"\n\nIt wasn't long ago that 200 innings pitched in a season was a common occurrence in the big leagues -- a sign of a solid, healthy season but nothing special. Just two years ago, 15 pitchers topped the mark. In 2011, there were 39, led by Justin Verlander's 251 innings.\n\nNo one will get close to touching 250 this season. Wheeler could top 220 depending on how many innings he throws in his final start.\n\nThere are myriad reasons the 200-inning starter is becoming so rare. Among them:\n\n• The covid-19 effect: The workload for starting pitchers had been trending downward for years, but it really accelerated during the coronavirus-shortened 2020 season. When pitchers returned for the abbreviated summer camp, teams were ultra-cautious with their starters. It's an approach that's largely continued into 2021.\n\n• Pitch counts. The concept of limiting a starter's pitches in an outing is far from new, but managers are sticking to lower limits, even for ace pitchers. In 2019, starters were allowed to throw at least 100 pitches 1,167 times. Two years later, that number might not even reach 700.\n\n• Openers. Also not a new concept, but the idea of starting the game with a reliever or having \"bullpen\" games has become more commonplace throughout the league. The Tampa Bay Rays -- who made the World Series in 2020 and could win 100 games this season -- have been one of the biggest proponents of the trend. Their starting pitchers have thrown less than 80 pitches 84 times this season, which leads MLB.\n\n• 26-man rosters. MLB has historically allowed 25 players on the active roster, but that number was bumped to 28 in the altered 2020 season. Starting in 2021, the number was reduced to 26, but it still allowed many teams to carry another pitcher in the bullpen.\n\nThe 31-year-old Wheeler has evolved into one of MLB's best pitchers, but even with his team locked in a playoff race, Manager Joe Girardi has had a close eye on the right-hander's pitch counts. He's topped 100 pitches just once in his last six starts.\n\n\"They're just looking out for me,\" Wheeler said. \"I communicate with them between starts on how I feel. That's why we're doing what we're doing. I want to keep pitching for the rest of the season and hopefully into the playoffs.\"\n\nWainwright might be the most unlikely member of this year's club. The 40-year-old has been one of the game's top pitchers for a long time but this is his first 200-inning season since 2014. He led the National League with 2412/3 innings pitched in 2013.\n\nThe 26-year-old Alcantara is the most anonymous of the bunch, quietly leading the Marlins pitching staff. Miami Manager Don Mattingly said pitchers still relish taking the mound every fifth day and going deep into games.\n\n\"When he's out there, he's thinking nine (innings) all the time,\" Mattingly said. \"He doesn't like coming out of games. It's just a continuation of his growth. It's a mark for guys just being out there for your club.\"\n\nPhiladelphia Phillies starting pitcher Zack Wheeler (45) works in the first inning of a baseball game against the Atlanta Braves Tuesday, Sept. 28, 2021, in Atlanta. (AP Photo/John Bazemore)\n\nMiami Marlins starter Sandy Alcantara pitches against the Tampa Bay Rays during the first inning of a baseball game Saturday, Sept. 25, 2021, in St. Petersburg, Fla. (AP Photo/Steve Nesius)"}, {"url": "https://www.tsn.ca/quick-hook-mlb-s-200-inning-club-becomes-even-smaller-1.1700539", "page_content": "Los Angeles Dodgers right-hander Walker Buehler has a lot of pride in reaching 200 innings pitched this season, especially considering he's battled injuries through parts of his career, including Tommy John surgery.\n\nConsidering the current state of big-league pitching, it's even more impressive.\n\n“I’ve never done it before and it’s weird because it used to be the norm,” Buehler said. “It’s been a goal of mine for a long time. It’s hard to put into words because you’re doing it over 32, 33 starts.”\n\nIt appears that just four pitchers will reach the 200-inning mark this season, including Buehler, Phillies right-hander Zack Wheeler, Cardinals right-hander Adam Wainwright and Marlins righty Sandy Alcantara. That would be the fewest in a full season in modern MLB history.\n\nBuehler's durability has been a bonus for the Dodgers, who have won 102 games and are still in the hunt for another NL West title.\n\n“It’s great, certainly considering what we’ve been through with pitching,” Dodgers manager Dave Roberts said. “To really be able to bank six or six-plus (innings) every time he takes the mound is huge.”\n\nIt wasn't long ago that 200 innings pitched in a season was a common occurrence in the big leagues — a sign of a solid, healthy season but nothing special. Just two years ago, 15 pitchers topped the mark. In 2011, there were 39, led by Justin Verlander's 251 innings.\n\nNo one will get close to touching 250 this season. Wheeler could top 220 depending on how many innings he throws in his final start as the Phillies chase slim playoff hopes in the NL East.\n\nThere are myriad reasons the 200-inning starter is becoming so rare. Among them:\n\n— The COVID-19 effect: The workload for starting pitchers had been trending downward for years, but it really accelerated during the coronavirus-shortened 2020 season. When pitchers returned for the abbreviated summer camp, teams were ultra-cautious with their starters. It's an approach that's largely continued into 2021.\n\n— Pitch counts. The concept of limiting a starter's pitches in an outing is far from new, but managers are sticking to lower limits, even for ace pitchers. In 2019, starters were allowed to throw at least 100 pitches 1,167 times. Two years later, that number might not even reach 700.\n\n— Openers. Also not a new concept, but the idea of starting the game with a reliever or having “bullpen” games has become more commonplace throughout the league. The Tampa Bay Rays — who made the World Series in 2020 and could win 100 games this season — have been one of the biggest proponents of the trend. Their starting pitchers have thrown less than 80 pitches 84 times this season, which leads MLB.\n\n— 26-man rosters. MLB has historically allowed 25 players on the active roster, but that number was bumped to 28 in the altered 2020 season. Starting in 2021, the number was reduced to 26, but it still allowed many teams to carry another pitcher in the bullpen.\n\nThe 31-year-old Wheeler has evolved into one of MLB's best pitchers, but even with his team locked in a playoff race, manager Joe Girardi has had a close eye on the right-hander's pitch counts. He's topped 100 pitches just once in his last six starts.\n\n“They’re just looking out for me,” Wheeler said. “I communicate with them between starts on how I feel. That’s why we’re doing what we’re doing. I want to keep pitching for the rest of the season and hopefully into the playoffs.”\n\nWainwright might be the most unlikely member of this year's club. The 40-year-old has been one of the game's top pitchers for a long time but this is his first 200-inning season since 2014. He led the National League with 241 2/3 innings pitched in 2013.\n\nThe 26-year-old Alcantara is the most anonymous of the bunch, quietly leading the Marlins pitching staff. Miami manager Don Mattingly said pitchers still relish taking the mound every fifth day and going deep into games.\n\n“When he’s out there, he’s thinking nine (innings) all the time,” Mattingly said. \"He doesn’t like coming out of games. It’s just a continuation of his growth. It’s a mark for guys just being out there for your club.”\n\n___\n\nAP Sports Writers Beth Harris and Dan Gelston contributed.\n\n___\n\nMore AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"}]}