{"Archie Baird went on to make over 200 appearances for Rangers and won two Scottish League titles and two Scottish Cups.": [{"url": "https://www.afcheritage.org/Team/CurrentSquad/player_show.cfm?player_id=66&Season=1952-53", "page_content": "Inside forward Baird joined the Dons in 1938 but had a long wait to make his Aberdeen debut due to the war. Scored in the Dons first national triumph in the 3-2 Southern League Cup win against Rangers in 1946. Was also a vital part of the Dons successful Scottish Cup side a year later. Represented Scotland in wartime internationals, Archie Baird joined St Johnstone at the end of the 1952-53 season.\n\nAnother link with this football club's past was lost forever on the 4th November 2009, with the sad news that former player and Aberdeen legend, Archie Baird, has passed away. However his memory will always live on at Aberdeen Football Club. Whenever the Scottish Cup comes around, talk will be of the side that carried off the crown in 1947, for the very first time, and Archie Baird's role in it. That will never die.\n\nArchie Baird Interview taken from Red Matchday earlier this year\n\nBeing the oldest known living former Don was not a burden that would have worried Archie Baird; after all he has been through some incredible experiences in what has been a memorable playing career and personal life. Archie had celebrated his 90th birthday on the 8th May and was the only surviving Don from the team that won the Dons first Scottish Cup in 1947.\n\nBorn in Rutherglen, Archie joined Aberdeen as a youngster of great promise in the summer of 1938. Aberdeen offered Archie a two-year contract which was unusual back then for any young player to be rewarded with more than a year's contract. \"I had offers from Blackpool, Motherwell, St Mirren, Partick and others but my mother influenced my final decision due to the fact that Aberdeen manager Dave Halliday had good, honest eyes that were what clinched my move to Aberdeen. I had always admired the Dons and their style and moving to Aberdeen was a clean break. It all happened so quickly; six months after starting as a Junior I was away to Aberdeen and earning £4 per week with a £20 signing on fee. I set out on my great adventure in July 1938 leaving Buchanan Street station in Glasgow in the company of someone called Willie Waddell but not my right wing buddie from Strathclyde. By a strange coincidence there was another young player of that name with Renfrew and he too had just signed for Aberdeen. Willie was a fine player and we grew to become close friends for many years.\"\n\nArchie soon began to realise what being at a football club like Aberdeen was all about as he started out in the reserves. \"We got a taste of full-time training the month before the start of the season. Donald Colman was the trainer at that time; a quiet-spoken intelligent man. He made an immediate impression on me. When he entered the dressing room you could sense he had the respect of the hard-bitten pros. Donald was detailed in everything he did and that rubbed off on the players. He would advise players on their fitness and diet and the importance of living healthy. He was ahead of his time. He also got the best out of players and that was his real strength. Matt Armstrong was struggling to make it at Celtic but Colman transformed him at Pittodrie and he went on to become one of the best forwards ever to play for the Dons. I soon began to realise that I would turn to Donald for guidance as my form began to suffer and I lost confidence. I saw my friend Willie Waddell promoted to the first team and I was delighted for him but things were not going well for me and I was struggling to make an impact.\"\n\nIt was at that point that events in Europe were soon to have an impact on the whole country as Britain declared war on Germany in September 1939. All football was immediately stopped as every attention turned to the war effort. Events during those difficult times would have a huge bearing on Archie. \"It all happened so quickly. Here I was in Aberdeen and trying to make my way as a professional player and also training to be an architect. A couple of months later I was conscripted and was very soon in France as a member of a medical corps unit with the ill-fated British Expeditionary Force. I missed the evacuation of Dunkirk, and only managed to leave France on the last ship out of St Nazaire. That was in the summer of 1940. By Christmas I was in the Western Desert, and by May 1942 had been captured by the Germans near Tobruk and handed over to the Italians. It was at El Adem when our field ambulance attached to the infantry unit had been surrounded by a squadron of German tanks. We ended up in a camp near Tripoli, called Suani Ben Adem. It was a filthy hell-hole, a huge rectangular strip of oasis surrounded by a wire fence and sentry towers. Prisoners were unable to do anything and many died there. What an eternity those four years seemed and how different from my teenage dreams; my twenty-first birthday spent in a tent 'somewhere in France'; my football confined to games for the unit team, a kick about with the lads and the occasional improvised training session. Since the war broke out I had played only two first class games, both with Leeds United as a guest player while I was stationed at Headingly Cricket Ground awaiting transfer to Egypt. Lying there under the clear Italian sky, I relived the excitement of playing against the pre-war Everton stars; Jones, Britton, Mercer and the great Tommy Lawton. But not even the good memory of scoring a goal for Leeds that day could make me forget the seriousness of my situation.\"\n\nArchie spent much of his time during the hostilities as a POW in Italy but it was his story of what happened after his escape that was truly a tale of human courage and compassion. After eighteen months as a captive, Archie and his close friend Harold 'Smudger' Smith escaped to the foothills of the Appenines, free, but still in enemy-occupied territory. They headed south after news of an Allied landing on the Italian coast suggested that would have been their best route. However the journey was an arduous one with German patrols prominent. Their route to safety was achieved by living off the land and the generosity of sympathetic Italian farmers and peasants they met along the way.\n\n\"We had encountered many dangers along the way but the local Italian people were humble, generous people.\"\n\nIt was on that long trek to freedom that Archie came across an Italian family that would go to 'adopt' him as one of their own for several months as the harsh winter set in. The Pilotti family were Italian farmers who looked after Archie as his good friend Harold and Tom who had joined them along the way, found similar families nearby to home the escapees. Archie made life-long friendships during those days and daily news of Allied advances helped raise spirits. Archie also by his association with his new friends managed to speak the language in time. As the German occupation waned by the day and news of the Allied efforts in Italy were successful.\n\n\"As we made our way to eventual freedom we could hear gunfire in the distance. The Germans were retreating north and their convoy was an easy target for our fighters and bombers. The activity in the air was increasing as we made our way north. We eventually arrived in a village called Sarnano where it was soon to become Allied occupied territory, my feelings were mixed as the Italian people did not really understand what was happening as the Union flag was raised in their town.\n\n\"I came back a completely different person. I went away as a raw young laddie and came back after experiencing a lot, I had more confidence in myself and as far as football was concerned I was thrust straight into the Aberdeen first team so it just developed from there. On my return to Falmouth I had started playing for my unit team and for Aldershot. By early 1945 I was stationed at Edinburgh Castle and playing for Aberdeen when I could get leave arranged. The Scottish Command then selected me for a tour of Orkney Islands and I met up with some players I would face in the coming months. However the most important day for me was stepping out at Pittodrie to face Hearts for the first time in seven years and I was at last, making my first team debut. The war ended in May 1945 and I was demobbed in September.\"\n\nIt was in January 1946 that Archie gained his one Scotland cap when he played against Belgium at Hampden. \"That game should never have been played as the ground was covered in snow. The game ended in a 2-2 draw but the thick fog made conditions all the more difficult. Jimmy Delaney and Gordon Smith were alongside me in that side. It was not an ideal international to play in but the Victory International against England was something else. It was the last wartime international and was seen as a celebration of the end of hostilities. I was delighted to be selected for the Scotland team. I would be facing some famous names like Frank Swift, Len Shackleton and Billy Wright. The Saturday before the international we were playing Partick at Firhill. I went down in a tackle with Jacky husband and I knew at once that I was seriously injured. On the Monday I had to call off from the Scotland team as the injury worsened. It was a sad day for me although my team mate George Hamilton took my place.\"\n\nThe highlights of Archie's Pittodrie career came in the Dons Southern League Cup win in May 1946 and the Scottish Cup a year later.\n\n\"I had a month to recover from that injury to make it for the final against Rangers. We prepared in Largs for three days before the game and we also had to contend with the butt of all jokes as Aberdeen had never won a national trophy at that time. The game was a real highlight for me personally as I scored a goal in the opening minute. Andy Cowie sent in a long throw and George (Hamilton) flicked the ball on with his head. I managed to leap past George Young to score. When Stan Williams scored just before half time, the big Aberdeen contingent was convinced we had done enough. Rangers back though and the game was tied at 2-2 as we moved into the final minutes. In the last seconds George Taylor popped up with a sensational winner and the cup was ours.\n\n\"A year later we took the Scottish Cup as well after beating Hibernian. There was a huge Aberdeen following that day as supporters came from all over, as far away as Orkney and Shetland; a true north east invasion. It was an amazing experience and after we lost a goal in the opening minute we came back to win with Stan Williams scoring the winner. I took up a position at the near post as Stan cut in from the bye-line. I was shouting at Stan to cut the ball back, but he flicked the ball in at the near post for a great goal. Stan later admitted to me that he heard my shout but he noticed Hibernian keeper Kerr move off his line in anticipation.\"\n\nLooking back at his playing career, one player stood out from the rest as far as Archie was concerned;\n\n\"George Hamilton was the best player to play for the club. George was the complete player and it was a privilege to play alongside him. It was all so different in those days, there wasn't a great deal of influence from the manager regarding tactics or coaching. Any success we had was usually down to us playing off the cuff as it were.\"\n\nAfter finishing his career in 1956 after three seasons with St Johnstone, Archie immediately began working for the Scottish Daily Express as a north east beat reporter. Despite offers to go full time as a journalist, Archie continued with his career as a PE teacher, a profession he had taken up during his time at Pittodrie.\n\n\"You have got to look at the whole picture and I count myself lucky to have survived the war. That was the big thing. To have been able to come back and play football again was a great thrill. To be honest I have never looked upon myself as being unlucky during the war and I don't have any regrets.\"\n\nArchie Baird - Aberdeen Record"}, {"url": "https://www.independent.co.uk/news/obituaries/archie-baird-footballer-who-escaped-from-pow-camp-before-helping-aberdeen-to-postwar-triumphs-1831675.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nAny contemplation of the life of Archie Baird must attach colossal significance to the game of football, as Aberdeen fans of the 1940s and early 1950s will testify with unstinting enthusiasm and affection.\n\nBut all that achievement and derring-do in the Pittodrie cause, exhilarating and ground-breaking though unquestionably it was, doesn't begin to tell the full story of a remarkable individual whose intrepid, intensely harrowing experiences as a prisoner of war place mere sporting issues in their proper context.\n\nBaird, a tall, stylish, creative inside-forward, was a key figure as the Dons lifted the first major trophies in their history during the immediate post-war seasons, by which time he was no longer looking at the world through the eyes of the callow, promising rookie who had been the target of eminent clubs on both sides of the border in 1938. At that point the likes of Blackpool, Motherwell, Partick Thistle and St Mirren were vying for his signature, but the 19-year-old's mother was so impressed by the honest approach of the Aberdeen manager David Halliday that the boy heeded her advice to head north-east from his Lanarkshire home to enlist with the Dons.\n\nBaird, who had starred for Strathclyde Juniors alongside the future Rangers luminary Willie Waddell, was an intelligent fellow who nursed ambitions to be an architect, but his football skills had proved impossible to ignore and now he planned to train in the mornings and study for his future career in the afternoons. However, he made a slow start at Pittodrie, struggling for an impact in this new competitive environment, and he was still featuring for the reserves when war broke out in 1939.\n\nNow, all too soon, the youngster who had viewed joining the Dons as a great adventure was to find himself caught up in an expedition of an altogether more daunting nature, one on which failure surely must have carried fatal consequences.\n\nWhile serving in the medical corps for the ill-fated British Expeditionary Force, he missed the evacuation at Dunkirk but managed to board the last ship out of St Nazaire when France fell in summer 1940. Awaiting his return to the war, Baird was stationed at Headingley, Yorkshire's cricket headquarters, and while he was there he guested for Leeds United, facing top performers of the day such as the Everton trio Tommy Lawton, Joe Mercer and Cliff Britton.\n\nThe respite was brief, though, and he was dispatched to North Africa, where he was part of the force which confronted Rommel in the Western Desert. When Tobruk was taken in the summer of 1942, his field ambulance was surrounded by German tanks and he was captured and handed over to the Italians, who placed him in a prisoner-of-war camp near Rimini on the Adriatic coast.\n\nMany of his fellow detainees died in what he described later as \"a filthy hell-hole\" but Baird, who whiled away some of his time by day-dreaming about his life as a footballer, remained resilient and in 1943, after 18 months of incarceration, he and a comrade, Harold Smith, managed to escape. Knowing that the Allies had landed in Italy, and aiming to join them, the pair headed south into the lower reaches of the Appenines. They lived off the land, helped on their way by sympathetic Italian farmers, and when severe winter weather set in Baird was sheltered for some months by a compassionate family, the Pilottis, who found other safe billetts for Smith and another fugitive who had joined the pair on their trek towards freedom.\n\nWith his sharp and lively mind, Baird picked up Italian quickly, enabling him to pose convincingly as the son of his courageous benefactors, to whom he became devoted and with whom he embarked on a lifelong friendship. \"They were real heroes,\" he said years later. \"They looked after me despite knowing the Germans would have shot them if they had found out.\"\n\nEventually, as Hitler's forces pulled out of Italy, Baird rejoined the Allied ranks and returned to Britain, guesting as a footballer for Aldershot and non-League Falmouth before returning to Aberdeen following his demob in September 1945. Vastly matured by his recent experiences, he was now a far more confident character than the tentative youth he had been during his initial Pittodrie sojourn, and he became established rapidly in the Dons' first team.\n\nOperating as an incisive prompter alongside his close pal and fellow inside-forward George Hamilton and the diminutive spearhead Stan Williams, Baird proved hugely influential as Aberdeen won the Southern League Cup, an emergency wartime competition and the precursor to the soon-to-be-launched Scottish League Cup. They beat Rangers 3-2 in a see-sawing final in front of 135,000 fans at Hampden Park in May 1946 to claim the first big prize since the club's formation in 1903.\n\nThere was reward on a wider front, too, with an appearance for Scotland in the Victory international against Belgium that January, the game finishing 2-2. Because it was classed as an unofficial wartime encounter, no cap was awarded, and that proved to be his sole outing for his country. He was immensely unfortunate because he had excelled against the Belgians, keeping his feet deftly in thick snow on a foggy Hampden afternoon, and had been selected for the next fixture, against England, only to be forced out through injury.\n\nA season later Baird was prominent again as the Dons beat highly-fancied Hibernian 2-1 to win the Scottish Cup, thus securing their first senior trophy and emphasising the progress they had made in finishing third in that term's title race behind Rangers and Hibs. They reached the inaugural League Cup final, too, losing 4-0 to Rangers, and faced the future on a tide of optimism.\n\nBaird, with his clever passing, neat ball skill and happy knack of contributing important goals, was seen as a major plank of Halliday's entertaining side, but he was hampered cruelly by knee problems which demanded three operations, and also he suffered a fractured leg. His best extended run was in 1950-51, when he scored 10 times in 40 league and cup appearances, but after barely figuring in 1952-53, the 34-year-old – whose overall record of 37 goals in 144 games for Aberdeen would have been far more extensive had he been blessed with fitness on a consistent basis – accepted a transfer to second-tier St Johnstone.\n\nAt McDiarmid Park Baird enjoyed a fruitful Indian summer, moving back to wing-half and missing only a handful of matches as the Saints twice finished in upper mid-table, then narrowly missed promotion to the top flight in 1955-56, his last campaign.\n\nAfter leaving the game, Baird – who until his death was believed to be Aberdeen's oldest surviving player – embarked on a fulfilling and packed life as a sports writer for the Scottish Sunday Express and a PE teacher who rose to become assistant head of Hilton Academy in Aberdeen by the time he retired in 1979. Somehow he even chiselled out the necessary time from his crowded schedule to qualify as a glider pilot.\n\nBaird believed passionately in education, achieving degrees in English and Italian through the University of London by correspondence course in the 1960s then teaching his second language at evening class. A warm, gregarious and charming man who had come to love all things Italian, he moved to Italy for a year from 1980, along with his wife Nancy, to teach English there.\n\nHis attachment to journalism was equally deep – many of his family members were practitioners, including his brother-in-law Magnus Magnusson and Magnusson's daughter Sally – and he became a popular columnist on the Aberdeen-based monthly magazine Leopard.\n\nArchie Baird was an author, too, penning a moving autobiography, Family Of Four (1989). It was a book in which his love of football was abundantly evident, but which illustrated eloquently his appreciation of its rightful place when he came to consider the more profound values of life.\n\nIvan Ponting\n\nArchibald MacKechnie Baird, footballer, journalist and teacher; born Rutherglen, Lanarkshire 8 May 1919; played for Aberdeen 1938-53, St Johnstone 1953-56; marriedn (one son, one daughter); died Cove, Aberdeen 3 November 2009."}, {"url": "https://www.peoplepill.com/people/archie-baird", "page_content": "Archie Baird (8 May 1919 – 3 November 2009) was a Scottish association football player who played for Aberdeen and St Johnstone. He was also capped once by the Scotland national football team. Baird was born in Rutherglen.\n\nBaird signed for Aberdeen before the Second World War, but the war started before he had made the first team. He joined the British Army, but was captured and held as a prisoner of war. He escaped and lived with an Italian family as their \"son\". In 1989 he published an autobiography, Family of Four, which described these experiences.\n\nBaird returned to Aberdeen before the end of the war. His good form in this period earned him selection for Scotland in a friendly match against Belgium in early 1946. Baird was one of nine Scotland players making their international debut in the match, with only Jimmy Delaney having significant experience. Of those nine debutants, five players did not make another international appearance, including Baird.\n\nBaird helped Aberdeen win the Southern League Cup (a forerunner of the Scottish League Cup) in 1946 and the 1947 Scottish Cup, but his appearances were restricted by injuries. In all he made 104 league appearances for Aberdeen, scoring 26 goals in those matches. He was transferred in 1953 to St Johnstone, where he played for three seasons before retiring in 1956.\n\nAfter retiring as a player, Baird worked as a teacher and a sports journalist. His sister, journalist Mamie Baird, married TV broadcaster Magnus Magnusson; Archie is the uncle of their children, TV producer Jon Magnusson and TV news presenter Sally Magnusson.\n\nBaird celebrated his 90th birthday in May 2009, and died quietly in his sleep on 3 November 2009."}, {"url": "https://prabook.com/web/archie.baird/2596340", "page_content": "Archie Baird\n\nassociation football player\n\nMarch 8, 1919 (age 90) Rutherglen, South Lanarkshire, United Kingdom\n\nHe was also capped once by the Scotland national football team Baird signed for Aberdeen before the Second World War, but the war started before he had made the first team He joined the British Army, but was captured and held as a prisoner of war. In 1989 he published an autobiography, Family of Four, which described these experiences. Baird returned to Aberdeen before the end of the war. His good form in this period earned him selection for Scotland in a friendly match against Belgium in early 1946. Baird was one of nine Scotland players making their international debut in the match, with only Jimmy Delaney having significant experience. Of those nine debutants, five players did not make another international appearance, including Baird. In all he made 104 league appearances for Aberdeen, scoring 26 goals in those matches. He was transferred in 1953 to Street Johnstone, where he played for three seasons before retiring in 1956. After retiring as a player, Baird worked as a teacher and a sports journalist. Baird celebrated his 90th birthday in May 2009, and died quietly in his sleep on 3 November 2009."}, {"url": "https://www.skysports.com/football/news/11788/12637403/andy-goram-rangers-legend-dies-at-age-of-58-following-a-short-battle-with-cancer", "page_content": "Former Rangers goalkeeper Andy Goram has died at the age of 58 after a short battle with cancer; Goram made 260 appearances for Rangers; he was part of the nine-in-a-row squad; he also played for a number of other clubs including Oldham, Hibernian and Motherwell\n\nAndy Goram: Rangers legend dies at age of 58 following a short battle with cancer\n\nRangers' legendary goalkeeper Andy Goram has died at the age of 58 after a short battle with cancer\n\nPlease use Chrome browser for a more accessible video player\n\nRangers' legendary goalkeeper Andy Goram has died at the age of 58 after a short battle with cancer.\n\nGoram made 260 appearances for Gers between 1991 and 1998, and won five league titles, three Scottish Cups and two League Cups.\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nThe former Oldham Athletic and Hibernian shot-stopper won 43 caps for Scotland and was the first-choice goalkeeper for both Euro 92 and Euro 96 in Sweden and England respectively.\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nA Rangers statement read: \"Rangers Football Club are today deeply saddened to announce the death of our legendary goalkeeper, Andy Goram, following a short battle with cancer.\n\n\"The thoughts of the directors, management, players and staff are today with Andy's family, and would ask that their privacy is respected at this sad time. Funeral details will be communicated in due course.\"\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nFormer Scotland manager Craig Brown paid tribute to Goram, whom he managed at international level.\n\nHe told Sky Sports News: \"He was a very popular guy, not only with his own players but the opposition. He was a wonderful goalkeeper and a very nice chap.\n\nPlease use Chrome browser for a more accessible video player Former Scotland manager Craig Brown recalls his memories of the late Andy Goram\n\n\"He's a cult hero at Ibrox and he's a Rangers legend, no doubts. The nickname 'The Goalie' just tells you everything because they felt that he was the one and the best goalkeeper.\"\n\nRemembering one of Scottish football's greatest ever players\n\nHere Sky Sports looks back on a career which, although turbulent at times, will see him remembered as of Scottish football's greatest ever players.\n\nAndy Goram's sporting journey began in England and could have seen him focus on cricket rather than on football.\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nBorn in Bury in 1964, he excelled at both sports as a teenager and actually favoured a career between the wickets rather than the goalposts.\n\nHe was captain of Lancashire Schoolboys - the great West Indian batsman Clive Lloyd, who was playing for the county at the time, was his hero.\n\nBut, after signing for Ron Atkinson's West Bromwich Albion as a 15-year-old, his football development became his focus.\n\nHis time at The Hawthorns did not go to plan though.\n\nImage: Goram's Scottish football career started at Hibs\n\nWhen Atkinson departed for Manchester United a year after his arrival, the new boss Ronnie Allen felt the 5 foot 11 Goram was too small to make it as a 'keeper and he was released.\n\nHis football journey really began at Oldham Athletic.\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nA 16-year-old Goram made his debut in May 1981 and went on to make 219 appearances for the club across a six-year spell.\n\nBy then he had won four Scotland caps and decided to move north, signing for Hibernian in a £325,000 deal.\n\nHe spent four years at Easter Road, became Hibs captain, played 163 times and even scored a goal.\n\nImage: Walter Smith signed Goram for Rangers for £1m\n\nHis performances in the capital did not go unnoticed and Rangers made their move in 1991 when Walter Smith bought him for £1m.\n\nThis time he was following in the footsteps of England goalkeeper Chris Woods and, rather than crumble under the pressure of playing in Glasgow, he thrived on it.\n\nIt was in the heat of an Old Firm clash that he often delivered his best performances.\n\nDuring his seven years at Ibrox, he faced Celtic 26 times.\n\nHe kept 11 clean sheets and was on the losing side just five times.\n\nImage: He faced Celtic 26 times as Rangers goalkeeper\n\nHis contribution was such that Tommy Burns - Celtic manager for three of those years was famously quoted as saying \"When I pass away you can put it on my tombstone `Goram broke my heart'.\n\nThings didn't always run smoothly through Andy's time at Rangers though.\n\nHe was transfer-listed by Walter Smith in 1994 after going AWOL for six days, drinking and partying in Tenerife when he should have been resting.\n\nBut he worked on his fitness that summer, returning fitter and stronger. That convinced his manager to give him a second chance.\n\nDuring his time at Ibrox he was named the Scottish Football Writers' and PFA Scotland player of the year in 1993.\n\nIn total, he would win three Scottish Cups, two league cups and be part of six title-winning squads as he helped the club clinch nine-in-a-row before leaving in 1998 when Dick Advocaat took over as manager.\n\nAfter losing his way that year with just one appearance for Notts County, and nine for Sheffield United he eventually returned to Scotland with Motherwell and again showed people just how special a talent he was.\n\nHe led by example and helped the Lanarkshire side to a fourth-place finish in his second season at Fir Park, eventually racking up 69 games for the Steelmen.\n\nImage: Goram also made 69 appearances for Motherwell\n\nIn the final months of his time with Motherwell, Goram was given the chance to fulfill another of his childhood dreams.\n\nSir Alex Ferguson called to bring him to the team he supported as a boy, Manchester United.\n\nThe 36-year-old was brought in on loan as cover at the tail end of the 2000-2001 season.\n\nHe played for them just twice but, nevertheless, it was another ambition ticked off for the boy from Bury.\n\nSpells with Hamilton, Coventry, Oldham again and Queen of the South followed where he notched up his 750th appearance in senior football and helped his side win the Challenge Cup along the way.\n\nHe finished up in 2003 at Elgin City having played 762 games during his club career.\n\nImage: Andy Goram was capped 43 times for Scotland\n\nIt was not just on the domestic stage that Goram excelled - he won 43 caps for Scotland, across a 13-year period.\n\nHe was the number one at Euro 92 in Sweden and again at Euro 96 in England.\n\nLike his club career though, his time in the national jersey also threw up the odd moment of debate or controversy - most noticeably in 1998.\n\nJust 15 days before the World Cup was to start in France, he walked out of the squad.\n\nHe was furious manager Craig Brown had opted to pick the 40-year-old Jim Leighton as his number one for the tournament, and not him.\n\nHe left their US training camp and retired from international duty.\n\nImage: Goram was inducted into Scottish football's Hall of Fame in 2010\n\nGoram's passion to represent the country of his father did not stop on the football field.\n\nHe also pulled on the cricket whites of Scotland as well, managing two first-class matches - and remains the only person to have played a first-class international match at cricket as well as a major international football match for Scotland.\n\nReleased by his first club, told he was too short to make it as a 'keeper, he had to battle to achieve what he did.\n\nHe did not always help himself along the way.\n\nDuring his career, it is fair to say that Goram caused the odd headache for his managers, and clashed with the odd team-mate, but Smith underlined exactly why he and others would see beyond that.\n\nHe said: \"I cared far more about that winners' attitude he had. He had a burning desire, a craving to keep a clean sheet every week.\"\n\nThat sums the man up pretty well;\n\nFor many people, he wasn't just a Goalie, he was, The Goalie."}, {"url": "https://www.bbc.co.uk/sport/football/61460438", "page_content": "Goram went to four major finals with Scotland and won 43 international caps\n\nFormer Scotland and Rangers goalkeeper Andy Goram has died after \"a short battle\" with cancer at the age of 58.\n\nGoram won 43 caps and played four times for his country at cricket - the only modern era Scot to have played at the top level at both sports.\n\nHe helped Rangers win five Scottish Premier League titles, three Scottish Cups and two League Cups.\n\nGoram was also on loan at Manchester United during the run-in as they won the Premier League title in 2000-01.\n\nHe was most recently goalkeeping coach with West of Scotland Football League club Cambuslang Rangers.\n\nIt was announced in April that Goram had been diagnosed with oesophageal cancer, which affects the long tube that carries food from the throat to the stomach, and later revealed he been given six months to live.\n\nHe also disclosed that he had turned down chemotherapy as it would only extend his life by three months.\n\nMany tributes have been made on social media from former clubs, team-mates and rivals to the man who became affectionately known simply as \"The Goalie\" after Rangers posted on Saturday that they were \"deeply saddened\" to announce his death.\n\nBorn in Bury of a Scottish father, Goram signed for Oldham Athletic, then in England's Second Division, after his release from West Bromwich Albion's youth set-up and went on to make 195 appearances.\n\nSir Alex Ferguson had already handed him his Scotland debut by the time he moved to Hibernian in 1987 and he would captain the Edinburgh side for many of his 138 appearances before being sold to Rangers for £1m four years later.\n\nGoram represented Scotland at cricket as well as football\n\nThe high point of Goram's stay at Ibrox came in season 1992-93, when the Glasgow side narrowly missed out on reaching the Champions League final but won a fifth consecutive league title as they completed a domestic treble. He also received the Scottish Football Writers' Association and SPFA player of the year awards.\n\nInternationally, he was part of the Scotland squad that played at the 1986 and 1990 World Cups and Euro 92 and 96, but he walked out on the squad before the 1998 finals because of head coach Craig Brown's preference at the time for long-time rival Jim Leighton.\n\nAfter brief spells at Notts County and Sheffield United, Goram signed for Motherwell in January 1999, helping them finish fourth in the Scottish top flight the following year.\n\nHe played twice on loan at Old Trafford in Man United's title run-in before a spell with Coventry City and a return to Scotland with Queen of the South, helping the Dumfries side lift the Scottish Challenge Cup in 2002.\n\nAfter retiring at the end of the 2003-04 campaign following a season-long spell at Elgin City, he turned to coaching, with Motherwell, Clyde, Hamilton Academical, BSC Glasgow, Dunfermline Athletic and Airdrieonians among the clubs whose goalkeepers he assisted.\n\nAs a left-handed batsman and right-arm medium-pace bowler, Goram played for a series of local-league clubs in England and Scotland before Rangers manager Walter Smith effectively ended his cricket career when he ordered him to concentrate on football."}, {"url": "https://www.dailyrecord.co.uk/news/local-news/rutherglen-born-aberdeen-fc-hero-2601789", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest top news stories sent straight to your inbox with our daily newsletter\n\nTRIBUTES have been paid to Aberdeen Football Club hero Archie Baird, who died recently.\n\nArchie, from Rutherglen, born on May 8 1919, passed away on November 3, when he died in his sleep.\n\nAs well as helping the Dons to their first-ever Scottish Cup win in 1947, the inside-forward and wing-half also played for St Johnstone, and picked up one international cap for Scotland.\n\nBelieved to have been the oldest surviving Aberdeen player, Archie signed for the Pittodrie club from Strathclyde Juniors before the Second World War, but the war started before he had made the first team.\n\nSpeaking to the Aberdeen website earlier this year, he said: “I had always admired the Dons and their style and moving to Aberdeen was a clean break It all happened so quickly; six months after starting as a junior I was away to Aberdeen and earning £4 per week with a £20 signing on fee.”\n\nHe joined the British Army, but was captured and held as a prisoner of war. He escaped and lived with an Italian family as their \"son\".\n\nIn 1989 he published an autobiography, Family of Four, which described these experiences. In 2001, he was presented with a medal and diploma for his service to Italian language and culture in Scotland.\n\nBaird returned to Aberdeen before the end of the war. His good form in this period earned him selection for Scotland in a friendly match against Belgium in January 1946. The match ended in a 2-2 draw.\n\nArchie was one of nine Scotland players making their international debut in the match, and five of them did not make another international appearance, including the Rutherglen man.\n\nHe said: “That game should never have been played as the ground was covered in snow. The game ended in a 2-2 draw but the thick fog made conditions all the more difficult.”\n\nBaird helped Aberdeen win the Southern League Cup - a forerunner of the Scottish League Cup - in 1946 and the 1947 Scottish Cup.\n\nArchie recalled: “It was an amazing experience and after we lost a goal in the opening minute we came back to win with Stan Williams scoring the winner. I took up a position at the near post as Stan cut in from the bye-line.\n\n“I was shouting at Stan to cut the ball back, but he flicked the ball in at the near post for a great goal.”\n\nBut his appearances at Pittodrie were restricted by injuries. In all he made 104 league appearances for Aberdeen, scoring 26 goals.\n\nHe was transferred in 1953 to St. Johnstone, where he played for three seasons before retiring in 1956.\n\nAfter retiring as a player, Archie worked as a teacher and a sports journalist.\n\nAn Aberdeen FC spokesman said: “A tall inside forward, Baird was a master in the air and arguably one of the finest inside forwards to grace Pittodrie.”\n\nArchie celebrated his 90th birthday in May this year. He is survived by his wife Nancy, his son and daughter, and three grandchildren.\n\nHis sister Mamie was married to the late Mastermind host, Magnus Magnusson."}, {"url": "https://wiki2.org/en/Archie_Baird", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nScottish footballer\n\nArchibald MacKechnie Baird (8 May 1919 – 3 November 2009) was a Scottish footballer, who played for Aberdeen and St Johnstone. He was also capped once by the Scotland national football team.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 581 6 862 1 286\n\nTWIPF 1973 Week 4\n\nDecember #SPFL Goal of the Month Winner! Partick Thistle's Kris Doolan\n\n1987-88: Blackburn Rovers 3-2 Aston Villa Transcription\n\nPlaying career\n\nBaird was born in Rutherglen.[3] Having played for local Junior clubs in the area, he signed for Aberdeen before the Second World War (along with Willie Waddell, although it was the other player of the same name who had been his teammate at Strathclyde), but the war started before he had made the first team.[4] He joined the British Army, but was captured and held as a prisoner of war.[4] He escaped and lived with an Italian family as their \"son\". In 1989, he published an autobiography, Family of Four, which described these experiences.[4]\n\nBaird returned to Aberdeen before the end of the war.[4] His good form in this period earned him selection for Scotland in a friendly match against Belgium in early 1946.[4] Baird was one of nine Scotland players making their international debut in the match, with only Jimmy Delaney having significant experience.[5] Of those nine debutants, five players did not make another international appearance, including Baird.[5]\n\nBaird helped Aberdeen win the Southern League Cup (a forerunner of the Scottish League Cup) in 1946 and the 1947 Scottish Cup, but his appearances were restricted by injuries.[4] In all he made 104 league appearances for Aberdeen, scoring 26 goals in those matches. He was transferred in 1953 to St Johnstone, where he played for three seasons before retiring in 1956.[4]\n\nLater life and family\n\nAfter retiring as a player, Baird worked as a teacher and a sports journalist.[4] His sister, journalist Mamie Baird, married TV broadcaster Magnus Magnusson; Archie is the uncle of their children, TV producer Jon Magnusson and TV news presenter Sally Magnusson.\n\nBaird celebrated his 90th birthday in May 2009,[6] at which point he was Aberdeen's oldest living former player; he died quietly in his sleep on 3 November 2009.[1]\n\nCareer statistics\n\nClub\n\n* Unofficial wartime appearances\n\nInternational\n\nAppearances and goals by national team and year[9] National team Year Apps Goals Scotland 1946 1 0 Total 1 0\n\nBibliography\n\nBaird, Archie (1989). Family of Four. Mainstream Publishing. ISBN 1-85158-235-5 .\n\nReferences"}, {"url": "https://www.afc.co.uk/2020/04/27/afc-fps-alex-kiddie-feature/", "page_content": "by Charlie Allan, Aberdeen FC Former Players Association\n\n\n\nEVERYONE at Aberdeen Football Club would like to send our best wishes to Alex Kiddie, our oldest surviving former player, as he celebrates his 93rd birthday today.\n\nAlex not only played for the Dons, he was also a member of our first ever trophy winning side, who beat Rangers 3-2 in the 1946 Southern League Cup final in front of a bumper 130,000 crowd at Hampden Park.\n\nUnfortunately, we were unable to contact Alex directly to pass on our good wishes. The care home he now stays at in Dundee is currently in lock down in accordance with the regulations put in place to protect the more vulnerable members of our society during the Covid-19 outbreak. But – as part of our StillStandingFree campaign – the club sent Alex a letter to say thanks for being a true living legend plus a video message from another afc great, Neil Simpson.\n\nIt’s fitting that we should also celebrate Alex’s big day by using extracts from previous interviews done with him to look back on his time as a Don.\n\nI first spoke to Alex more than seven years ago, while working as a sportswriter for the Aberdeen Evening Express, and it was clear that he really loved his time at Pittodrie.\n\n“I’ve always appreciated the opportunity Aberdeen gave to me,” he said.\n\n“I retain a lot of affection for the club because it was a special time and an honour to be part of the team which won the first major trophy.”\n\nBorn in 1927, Alex played for Ashdale Boys in his native Dundee before joining Stobswell Juniors.\n\nHe was provisionally signed by Celtic in 1944, but the Hoops never took up their option to sign him.\n\nThe Dons stepped in after being impressed by Alex’s display for Forfarshire against Aberdeenshire in a county select representative match.\n\nThat was despite a last gasp attempt by Celtic to scupper the deal for the then 18- year-old winger.\n\nAlex said: “I had never heard anything from Celtic after leaving them that summer, so assumed they wouldn’t be getting in touch.\n\n“David Halliday, Aberdeen’s manager at the time, spoke to me after the select game and asked me to sign for them.\n\n“After talking things over with my dad, I agreed.\n\n“A few days later a neighbour told me a man from Glasgow had come to see me.\n\n“She said I wasn’t in but knew I’d be playing for my Junior club later so he told her he would be back to see me.\n\n“That was my last game for Stobswell and at half-time the club secretary told me Jimmy McGrory (Celtic’s manager) wanted to se me.\n\n“Everyone’s mouths fell wide open when they heard that!\n\n“We went into the committee room and Mr McGrory told me he had heard Aberdeen had signed me and wanted to know it it was true.\n\n“I told him it was and he insisted Celtic were still interested but I said I couldn’t\n\ngo back.\n\n“He then said if I also signed a contract with them, both would become null and void, meaning I would be suspended and I’d become a free agent again.\n\n“He promised Celtic would sign me after I served my suspension but I told him I had given my word to Aberdeen and that was that.”\n\nAlex’s show of loyalty was even more remarkable because he had joined the Dons as an amateur player.\n\n“I was still at St Andrews University studying for my BSC in maths and physics,” said Alex.\n\n“I was also active as a sprinter on the athletics field and did well in the long jump, which is why I chose not to go professional.\n\n“I got my expenses covered but that was it.\n\n“I didn’t care though because I loved playing for Aberdeen.”\n\nAlex ended up enjoying a fairytale first season with the Dons as they claimed the first trophy in the club’s history.\n\nThe Southern League Cup was a regional competition held during the Second World War.\n\nIt was dominated by Rangers, who won it in 1941, 42, 43 and 45, with Hibs the only side to break their grip on the trophy.\n\nWhen the war ended, the competition was expanded to include teams from the north of Scotland as well, which is how Aberdeen came to be involved.\n\nWe beat Ayr United to book a semi-final against Airdrie.\n\nThe sides drew 2-2 in their first clash, at Ibrox, but Alex scored twice in the replay in a 5-2 victory. Stan Williams, Archie Baird and Bill Straus were Aberdeen’s other scorers that day.\n\nThat set up the final showdown against holders Rangers on May 11, 1946, which caught the imagination of the public and attracted that huge crowd of 130,000.\n\nAlex said: “Playing in front of the sea of faces at Hampden that day is something that has never left me.\n\n“How big the crowd was never really struck home until I was setting the ball to take a corner.\n\n“It gave me the chance to look around myself and I thought ‘my goodness’.\n\n“It really was quite amazing.”\n\nIt was to be an afternoon when Alex produced one of his best ever performances in an Aberdeen shirt, despite the fact he was still a teenager and up against Rangers greats like Jock ‘Tiger’ Shaw, Willie Waddell, Scot Symon, George Young and Willie Thornton.\n\nLegendary Scottish journalist Jack Webster, who was just a teenager himself when the final was played, wrote about it his book ‘The Dons’ – the official history of the club, which was first published in 1978.\n\nJack wrote: “It was the first opportunity for a whole generation of football supporters to visit the national stadium and when the Aberdeen party arrived in Glasgow they found the city seething with red and white.\n\n“That was the day when a slightly built lad from Dundee, who was generally referred to as A.A.Kiddie, played the game of his life, turning his own dream-like performance into a nightmare for Rangers left-back stalwart Tiger Shaw, who was not accustomed to chasing shadows.”\n\nThe Dons took the lead when Stan Williams nodded on a long throw-in from Andy Cowie for Archie Baird to nod home.\n\nAlex provided the cross that led to Stan Williams making it 2-0 but Rangers hit back with two goals in the second half. Alex then hit the crossbar with a shot in a game that looked destined to end in a draw until Aberdeen’s young winger stepped up again.\n\nJack Webster, who listened to final live on BBC radio back in Aberdeen, continued:\n\n“The game had entered its very last minute and the atmosphere was felt not only on the slopes of Hampden Park but in places like the common room of Gordon’s College boarding house at Queen’s Road, where a group of us were clustered around the wireless set, as we called it then, hanging on every word of BBC commentator Peter Thomson.\n\n“He had checked his watch his watch for the number of dying seconds when suddenly Aberdeen were on the attack, the ball had been crossed by Kiddie… Cowie was going for it… Hamilton was going for it… George Taylor was going for it…”\n\nIt was Taylor who finally put the cross away and there was only time for the game to restart before the final whistle went and confirmed Aberdeen had won their first national trophy.\n\nNewspaper reports of the time also talk of how ‘young Kiddie of Aberdeen’ gave Tiger Shaw a ‘torrid time.’\n\nWhen I asked Alex about that he seemed a little embarrassed and would only say:\n\n“I was pretty pleased with how I played that day.\n\n“Rangers had a terrific side but we got the better of them.\n\n“I don’t think many people gave us a chance but we always believed we would win, even when Rangers pulled it back to 2-2.”\n\nWhen asked about the winning goal, Alex said: “I did what always did, got the ball, took it down the wing and crossed for George to score.\n\n“It was a great achievement winning the cup that day.\n\n“I remember stopping at the railway station to buy a paper to read the match report, I still have that newspaper!”\n\nAs the only amateur to play in the final, Alex was unable to share in the win bonus the Dons directors gave to their cup winning squad. Aberdeen chairman William Mitchell asked what he would like instead to mark the occasion – and Alex chose a wristwatch.\n\n“I had never owned a watch before so I was delighted,” he said.\n\n“Not getting a bonus never worried me.\n\n“Winning the cup was reward enough.\n\n“The watch was a very kind gesture by the club and I’ve been proud to wear it almost every day since.\n\n“The only time I’ve taken it off was when I went on holiday because I was worried about losing it.\n\n“I get it serviced regularly so it still keeps perfect time.\n\n“The chairman had it inscribed before presenting it to me, it’s one of my most treasured possessions.”\n\nAlex continued to play as an amateur for a further two years while completing his studies.\n\nHe made a total 48 appearances and scored 13 goals for the Dons before moving to Falkirk, in December 1950.\n\nAlex also played for Dundee, Arbroath, Brechin City, Montrose and Forfar during the 1950s but it was that spell with Aberdeen that was the highlight of his career.\n\nWhen Alex turned 90, in April 2017, the club contacted him to say we were aiming to beat Celtic in the Scottish Cup final the following month in his honour.\n\nA letter sent to Alex from Pittodrie said: “As our oldest living player, and the last survivor of what was our first major honour, the Southern League Cup in 1946, you hold a very special place in the hearts of all those connected with the club and hopefully we can lift the Scottish Cup in your honour.”\n\nAlex admitted he was touched by that gesture: “The letter from Aberdeen was a lovely touch and had some very nice words.\n\n“It was a pleasant surprise and brought back many great memories for me.”\n\nOn behalf of all of the Red Army, we would once again like to say thank you to Alex for the important part he played in our history and hope that he enjoys his birthday celebrations.\n\nGallery"}, {"url": "https://www.wikizero.com/en/Archie_Baird", "page_content": "From Wikipedia the free encyclopedia\n\nScottish footballer\n\nArchibald MacKechnie Baird (8 May 1919 – 3 November 2009) was a Scottish footballer, who played for Aberdeen and St Johnstone. He was also capped once by the Scotland national football team.\n\nPlaying career [ edit ]\n\nBaird was born in Rutherglen.[3] Having played for local Junior clubs in the area, he signed for Aberdeen before the Second World War (along with Willie Waddell, although it was the other player of the same name who had been his teammate at Strathclyde), but the war started before he had made the first team.[4] He joined the British Army, but was captured and held as a prisoner of war.[4] He escaped and lived with an Italian family as their \"son\". In 1989, he published an autobiography, Family of Four, which described these experiences.[4]\n\nBaird returned to Aberdeen before the end of the war.[4] His good form in this period earned him selection for Scotland in a friendly match against Belgium in early 1946.[4] Baird was one of nine Scotland players making their international debut in the match, with only Jimmy Delaney having significant experience.[5] Of those nine debutants, five players did not make another international appearance, including Baird.[5]\n\nBaird helped Aberdeen win the Southern League Cup (a forerunner of the Scottish League Cup) in 1946 and the 1947 Scottish Cup, but his appearances were restricted by injuries.[4] In all he made 104 league appearances for Aberdeen, scoring 26 goals in those matches. He was transferred in 1953 to St Johnstone, where he played for three seasons before retiring in 1956.[4]\n\nLater life and family [ edit ]\n\nAfter retiring as a player, Baird worked as a teacher and a sports journalist.[4] His sister, journalist Mamie Baird, married TV broadcaster Magnus Magnusson; Archie is the uncle of their children, TV producer Jon Magnusson and TV news presenter Sally Magnusson.\n\nBaird celebrated his 90th birthday in May 2009,[6] at which point he was Aberdeen's oldest living former player; he died quietly in his sleep on 3 November 2009.[1]\n\nCareer statistics [ edit ]\n\nClub [ edit ]\n\n* Unofficial wartime appearances\n\nInternational [ edit ]\n\nAppearances and goals by national team and year[9] National team Year Apps Goals Scotland 1946 1 0 Total 1 0\n\nBibliography [ edit ]\n\nBaird, Archie (1989). Family of Four. Mainstream Publishing. ISBN 1-85158-235-5 ."}]}