{"Archie Baird died in 1962.": [{"url": "https://www.independent.co.uk/news/obituaries/archie-baird-footballer-who-escaped-from-pow-camp-before-helping-aberdeen-to-postwar-triumphs-1831675.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nAny contemplation of the life of Archie Baird must attach colossal significance to the game of football, as Aberdeen fans of the 1940s and early 1950s will testify with unstinting enthusiasm and affection.\n\nBut all that achievement and derring-do in the Pittodrie cause, exhilarating and ground-breaking though unquestionably it was, doesn't begin to tell the full story of a remarkable individual whose intrepid, intensely harrowing experiences as a prisoner of war place mere sporting issues in their proper context.\n\nBaird, a tall, stylish, creative inside-forward, was a key figure as the Dons lifted the first major trophies in their history during the immediate post-war seasons, by which time he was no longer looking at the world through the eyes of the callow, promising rookie who had been the target of eminent clubs on both sides of the border in 1938. At that point the likes of Blackpool, Motherwell, Partick Thistle and St Mirren were vying for his signature, but the 19-year-old's mother was so impressed by the honest approach of the Aberdeen manager David Halliday that the boy heeded her advice to head north-east from his Lanarkshire home to enlist with the Dons.\n\nBaird, who had starred for Strathclyde Juniors alongside the future Rangers luminary Willie Waddell, was an intelligent fellow who nursed ambitions to be an architect, but his football skills had proved impossible to ignore and now he planned to train in the mornings and study for his future career in the afternoons. However, he made a slow start at Pittodrie, struggling for an impact in this new competitive environment, and he was still featuring for the reserves when war broke out in 1939.\n\nNow, all too soon, the youngster who had viewed joining the Dons as a great adventure was to find himself caught up in an expedition of an altogether more daunting nature, one on which failure surely must have carried fatal consequences.\n\nWhile serving in the medical corps for the ill-fated British Expeditionary Force, he missed the evacuation at Dunkirk but managed to board the last ship out of St Nazaire when France fell in summer 1940. Awaiting his return to the war, Baird was stationed at Headingley, Yorkshire's cricket headquarters, and while he was there he guested for Leeds United, facing top performers of the day such as the Everton trio Tommy Lawton, Joe Mercer and Cliff Britton.\n\nThe respite was brief, though, and he was dispatched to North Africa, where he was part of the force which confronted Rommel in the Western Desert. When Tobruk was taken in the summer of 1942, his field ambulance was surrounded by German tanks and he was captured and handed over to the Italians, who placed him in a prisoner-of-war camp near Rimini on the Adriatic coast.\n\nMany of his fellow detainees died in what he described later as \"a filthy hell-hole\" but Baird, who whiled away some of his time by day-dreaming about his life as a footballer, remained resilient and in 1943, after 18 months of incarceration, he and a comrade, Harold Smith, managed to escape. Knowing that the Allies had landed in Italy, and aiming to join them, the pair headed south into the lower reaches of the Appenines. They lived off the land, helped on their way by sympathetic Italian farmers, and when severe winter weather set in Baird was sheltered for some months by a compassionate family, the Pilottis, who found other safe billetts for Smith and another fugitive who had joined the pair on their trek towards freedom.\n\nWith his sharp and lively mind, Baird picked up Italian quickly, enabling him to pose convincingly as the son of his courageous benefactors, to whom he became devoted and with whom he embarked on a lifelong friendship. \"They were real heroes,\" he said years later. \"They looked after me despite knowing the Germans would have shot them if they had found out.\"\n\nEventually, as Hitler's forces pulled out of Italy, Baird rejoined the Allied ranks and returned to Britain, guesting as a footballer for Aldershot and non-League Falmouth before returning to Aberdeen following his demob in September 1945. Vastly matured by his recent experiences, he was now a far more confident character than the tentative youth he had been during his initial Pittodrie sojourn, and he became established rapidly in the Dons' first team.\n\nOperating as an incisive prompter alongside his close pal and fellow inside-forward George Hamilton and the diminutive spearhead Stan Williams, Baird proved hugely influential as Aberdeen won the Southern League Cup, an emergency wartime competition and the precursor to the soon-to-be-launched Scottish League Cup. They beat Rangers 3-2 in a see-sawing final in front of 135,000 fans at Hampden Park in May 1946 to claim the first big prize since the club's formation in 1903.\n\nThere was reward on a wider front, too, with an appearance for Scotland in the Victory international against Belgium that January, the game finishing 2-2. Because it was classed as an unofficial wartime encounter, no cap was awarded, and that proved to be his sole outing for his country. He was immensely unfortunate because he had excelled against the Belgians, keeping his feet deftly in thick snow on a foggy Hampden afternoon, and had been selected for the next fixture, against England, only to be forced out through injury.\n\nA season later Baird was prominent again as the Dons beat highly-fancied Hibernian 2-1 to win the Scottish Cup, thus securing their first senior trophy and emphasising the progress they had made in finishing third in that term's title race behind Rangers and Hibs. They reached the inaugural League Cup final, too, losing 4-0 to Rangers, and faced the future on a tide of optimism.\n\nBaird, with his clever passing, neat ball skill and happy knack of contributing important goals, was seen as a major plank of Halliday's entertaining side, but he was hampered cruelly by knee problems which demanded three operations, and also he suffered a fractured leg. His best extended run was in 1950-51, when he scored 10 times in 40 league and cup appearances, but after barely figuring in 1952-53, the 34-year-old – whose overall record of 37 goals in 144 games for Aberdeen would have been far more extensive had he been blessed with fitness on a consistent basis – accepted a transfer to second-tier St Johnstone.\n\nAt McDiarmid Park Baird enjoyed a fruitful Indian summer, moving back to wing-half and missing only a handful of matches as the Saints twice finished in upper mid-table, then narrowly missed promotion to the top flight in 1955-56, his last campaign.\n\nAfter leaving the game, Baird – who until his death was believed to be Aberdeen's oldest surviving player – embarked on a fulfilling and packed life as a sports writer for the Scottish Sunday Express and a PE teacher who rose to become assistant head of Hilton Academy in Aberdeen by the time he retired in 1979. Somehow he even chiselled out the necessary time from his crowded schedule to qualify as a glider pilot.\n\nBaird believed passionately in education, achieving degrees in English and Italian through the University of London by correspondence course in the 1960s then teaching his second language at evening class. A warm, gregarious and charming man who had come to love all things Italian, he moved to Italy for a year from 1980, along with his wife Nancy, to teach English there.\n\nHis attachment to journalism was equally deep – many of his family members were practitioners, including his brother-in-law Magnus Magnusson and Magnusson's daughter Sally – and he became a popular columnist on the Aberdeen-based monthly magazine Leopard.\n\nArchie Baird was an author, too, penning a moving autobiography, Family Of Four (1989). It was a book in which his love of football was abundantly evident, but which illustrated eloquently his appreciation of its rightful place when he came to consider the more profound values of life.\n\nIvan Ponting\n\nArchibald MacKechnie Baird, footballer, journalist and teacher; born Rutherglen, Lanarkshire 8 May 1919; played for Aberdeen 1938-53, St Johnstone 1953-56; marriedn (one son, one daughter); died Cove, Aberdeen 3 November 2009."}, {"url": "https://www.dailyrecord.co.uk/news/local-news/rutherglen-born-aberdeen-fc-hero-2601789", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest top news stories sent straight to your inbox with our daily newsletter\n\nTRIBUTES have been paid to Aberdeen Football Club hero Archie Baird, who died recently.\n\nArchie, from Rutherglen, born on May 8 1919, passed away on November 3, when he died in his sleep.\n\nAs well as helping the Dons to their first-ever Scottish Cup win in 1947, the inside-forward and wing-half also played for St Johnstone, and picked up one international cap for Scotland.\n\nBelieved to have been the oldest surviving Aberdeen player, Archie signed for the Pittodrie club from Strathclyde Juniors before the Second World War, but the war started before he had made the first team.\n\nSpeaking to the Aberdeen website earlier this year, he said: “I had always admired the Dons and their style and moving to Aberdeen was a clean break It all happened so quickly; six months after starting as a junior I was away to Aberdeen and earning £4 per week with a £20 signing on fee.”\n\nHe joined the British Army, but was captured and held as a prisoner of war. He escaped and lived with an Italian family as their \"son\".\n\nIn 1989 he published an autobiography, Family of Four, which described these experiences. In 2001, he was presented with a medal and diploma for his service to Italian language and culture in Scotland.\n\nBaird returned to Aberdeen before the end of the war. His good form in this period earned him selection for Scotland in a friendly match against Belgium in January 1946. The match ended in a 2-2 draw.\n\nArchie was one of nine Scotland players making their international debut in the match, and five of them did not make another international appearance, including the Rutherglen man.\n\nHe said: “That game should never have been played as the ground was covered in snow. The game ended in a 2-2 draw but the thick fog made conditions all the more difficult.”\n\nBaird helped Aberdeen win the Southern League Cup - a forerunner of the Scottish League Cup - in 1946 and the 1947 Scottish Cup.\n\nArchie recalled: “It was an amazing experience and after we lost a goal in the opening minute we came back to win with Stan Williams scoring the winner. I took up a position at the near post as Stan cut in from the bye-line.\n\n“I was shouting at Stan to cut the ball back, but he flicked the ball in at the near post for a great goal.”\n\nBut his appearances at Pittodrie were restricted by injuries. In all he made 104 league appearances for Aberdeen, scoring 26 goals.\n\nHe was transferred in 1953 to St. Johnstone, where he played for three seasons before retiring in 1956.\n\nAfter retiring as a player, Archie worked as a teacher and a sports journalist.\n\nAn Aberdeen FC spokesman said: “A tall inside forward, Baird was a master in the air and arguably one of the finest inside forwards to grace Pittodrie.”\n\nArchie celebrated his 90th birthday in May this year. He is survived by his wife Nancy, his son and daughter, and three grandchildren.\n\nHis sister Mamie was married to the late Mastermind host, Magnus Magnusson."}, {"url": "https://www.aberdeenlive.news/sport/aberdeen-footballer-born-day-who-7054265", "page_content": "Inside Forward Archie Baird was born in Rutherglen in 1919.\n\nHe began his playing career with Strathclyde Juniors, quickly catching the eyes of clubs both sides of the border.\n\nBlackpool, Motherwell, St Mirren and Partick Thistle were all fighting for the exciting 19-year-old's signature, however his mother was most impressed with Aberdeen. Baird left for the north-east from Lanarkshire to sign for the Dons in 1938.\n\nThe teenager had a slow start to his career in the Granite City, plying his trade with the reserves up until war broke out.\n\nBaird joined the medical corps of the doomed British Expeditionary Force. After missing the evacuation of Dunkirk, he manged to board a ship in St Nazaire, escaping as France fell in 1940.\n\nJoin our Aberdeen FC Facebook group for all the latest Dons news\n\nOn his return to UK shores he would turn out for Leeds as guest, but his return to football was short-lived.\n\nWhilst based in North Africa his field ambulance was surrounded by German tanks. Baird was captured and handed over to the Italians who brought him to a prisoner-of-war camp on the Adriatic coast.\n\nThe former Don watched as his fellow detainees died, locked away in the camp for 18 months.\n\nHe and fellow prisoner Harold Smith managed to escape and make their way south to join the allied force, quickly learning the Italian language.\n\nBaird returned to England and played for both Aldershot and non-League Falmouth before returning to Aberdeen .\n\nUpon pulling on the red jersey he quickly established himself as a key member of the squad. Winning the Southern League Cup in 1946 against Rangers in front of 135,000 fans at Hampden Park, the clubs first piece of silverware since its formation.\n\nSign up to our Aberdeen F.C newsletter Get all the latest Aberdeen F.C news sent straight to your Inbox by signing up to our newsletter. We're committed to bringing Dons fans all the latest headlines, transfer news and more from Pittodrie, from articles, videos, interviews and more. To sign up, simply click the link here. And if you aren't already, make sure you join the conversation over on our A.F.C Facebook Group.\n\nHis fine form was rewarded with a Scotland call-up in the Victory international against Belgium, the game finished 2-2, but since it was classed as a wartime fixture he never received a cap.\n\nThe inside forward's fantastic performances continued the following season, leading the Dons to their first Scottish Cup win and to the final of the inaugural League Cup.\n\nHis time in the north-east was marred with injury problems which saw him undergo surgery three times. the Lanarkshire born man left the club in 1953 scoring 37 goals in 144 games.\n\nBaird joined St Johnstone, who played in the second-tier, where the 34-year-old enjoyed somewhat of a resurgence. During his final season of football, the Saints narrowly missed out on promotion.\n\nThe Aberdeen great would later become a sport journalist and teacher. He would return to the north-east to enjoy his retirement, passing away in 2009."}, {"url": "https://www.nationalclubgolfer.com/news/archie-baird-gullane-golf-museum-dies/", "page_content": "No trip to Gullane is complete without a visit to the Heritage of Golf Museum. Its founder, Archie Baird, who has died aged 95, leaves a legacy as one of the sport's foremost historians\n\nGaping wide-eyed in wonder at the golfing treasures that filled every nook and cranny of the Heritage of Golf Museum was the only way to top off a day at Gullane Golf Club.\n\nWhether it was cleeks and featheries, paintings, or rare books, the fruits of Archie Baird’s lifetime of collecting the sport’s memorabilia were on show for inquisitive minds and those keen to see the history of the game from its origins.\n\nSo it was no surprise that warm tributes filled the air when it was announced Baird, the well-known golf historian, museum curator and former Gullane captain, had died at the weekend aged 95.\n\nHis passion for collecting the game’s riches began in the early 1950s when visiting an auction in Edinburgh.\n\nHe spied a canvas bag full of old clubs and found the words W Park, Musselburgh, inscribed.\n\nNot only did the first Open champion make them but Park Snr was also the great grandfather of Baird’s new wife, Sheila.\n\n“I realised it would be a fascinating hobby to collect old golf clubs, and a rewarding one, because every junk shop in Edinburgh had them and nobody wanted them,” he said.\n\nFrom there, a love was born and his collection was opened up to all when he established the museum, found next to the pro shop at Gullane, in 1980.\n\nIt became a destination for golfers from all of the world – with both the sport’s luminaries and weekend hackers among those to go on pilgrimage.\n\nLast year, Baird, who lived in Aberlady, was given the British Empire Medal in the Queen’s Birthday Honours List for his services to the history of golf.\n\n“We were saddened at the weekend to learn of the passing of Archie Baird, aged 95, the founder of our Heritage of Golf Museum,” said Gullane in a tweet.\n\n“A warm and charming character, his knowledge and love for golf made him a great source of information for all who met him. We will all miss him dearly.”\n\nGeoff Shackleford, Golf Channel contributor and senior writer at Golfweek, wrote on his blog: “We’ll never know the number of golfers he entertained, enlightened and informed, and it really doesn’t matter.\n\n“Anyone who came into Archie Baird’s golf museum at Gullane got a crash course in golf.\n\n“The great man has moved on to the Big 18 in the Sky, but his legacy lives on in his museum and the joy he gave golfers who made the pilgrimage to East Lothian.”\n\nWriter Lorne Rubenstein added: “Many people on planet golf, including Ben Crenshaw, considered Archie one of the great golf historians. Archie loved foursomes (alternate shot) team golf and decried the emphasis on score and score alone as the emphasis of what he believed represented the heart of the game.”\n\nOther tributes flowed in across the world of golf…\n\nThe world lost one of the great lovers of golf history today- one of the men who got me into collecting #golfhistory & sold me my first ever golf print…the immortal Archie Baird. Any words I write will not do that man justice. The world lost one of the best. @britgolfmuseum pic.twitter.com/zKbIo4looF — Society of Golf Historians (@SHistorians) December 7, 2019\n\nR.I.P Archie Baird. Long-serving curator of the Heritage of Golf Museum, Gullane Golf Member and dear friend to all us here at Gullane Professional Shop. Our heartfelt thoughts are with his wife Sheila and family. pic.twitter.com/7OuiEHtRYg — ⛳️ Gullane Pro Shop ⛳️ (@GullaneProShop) December 9, 2019\n\nThe greats of golf history saluting a fellow historian. What could be more fitting? RIP Archie Baird. — Stephen Proctor (@SProctorGolf) December 10, 2019\n\nR.I.P. Archie Baird B.E.M. 95 yrs old of Gullane Golf Club. I attended his tour a few years ago then took this pic afterwards. pic.twitter.com/jyt2hIqXZu — howard boylan (@Golfsnappper) December 9, 2019\n\nBaird, who had also been the historian at Muirfield, was a veterinarian for many years and said of his introduction to golf: “I knew when I qualified I couldn’t afford to get injured playing rugby and have a locum work for me so I thought golf was a good alternative.\n\n“There were lots of marvellous municipal courses such as Braid Hills or Portobello. Two shillings and you were on.”\n\nWhat a life that decision would bring.\n\nPicture: @GullaneProShop. For more on the Heritage of Golf Museum, visit their website.\n\nSteve Carroll A journalist for 23 years, Steve has been immersed in club golf for almost as long. A former captain and committee member, he has passed the Level 3 Rules of Golf exam with distinction having attended the national Tournament Administrators and Referee's Seminar. He has officiated at a host of high-profile tournaments, including Open Regional Qualifying and the PGA Fourball Championship. A member of NCG's Top 100s panel, Steve has a particular love of links golf and is frantically trying to restore his single-figure handicap. Steve is currently playing: Driver: TaylorMade Stealth 2 3-Wood: TaylorMade Stealth 2 Hybrids: TaylorMade Stealth 2 Irons: TaylorMade Stealth 5-A Wedge Wedges: TaylorMade Hi-Toe 54 and 58 Putter: Sik Sho Ball: TaylorMade TP5 Handicap: 11.3\n\nGroup bookings of four or more golfers receive 10% OFF our NCG Top 100s Tour events VIEW EVENTS\n\nSubscribe to NCG"}, {"url": "https://www.golfheritage.org/archie-baird-scotlands-ambassador-for-golf-dies-at-95/", "page_content": "Archie Baird, beloved ambassador for golf who lived in Gullane, Scotland, died Sunday, Dec. 7, 2019. He was 95. He passed away very peacefully at Edington Cottage Hospital in North Berwick.\n\nMr. Baird, a former RAF fighter pilot and veterinary surgeon, is survived by his wife, Sheila, a medical doctor and great-grandaughter of the legendary Willie Park Sr., first winner of the Open Championship, Prestwick in 1860. The couple had four great-grandchildren.\n\nEarly in their marriage the couple shared a small flat in Edinburgh. Their tight budget forced the couple to search second-hand shops and auctions for furnishings. It was during one such excursion that Mr. Baird came upon a dusty bag of hickory shafted clubs. One of the log-nosed woods bore the name of Park. Excited by the find of a club connected to a family member, he bought the club for five shillings (less than a dollar), and thus began a lifelong love of golf collecting.\n\nMr. Baird began to scour shops throughout England and eventually amassed an enormous number of especially prized ancient clubs before turning his eye to other golf collectibles such as books, medals, and other odds and ends. His keenest interest turned out to be artwork.\n\nHis home was a gallery of landscapes, golfing scenes, portraits, sketches, prints, and caricatures. The artist names were a who’s who of the genre – Major Francis Powell Hopkins, W.D. McKay, John Smart, J. Michael Brown, John Hassell, “George Pipeshank,” John Barclay, Lawson Wood, Harry Rountree, and William S. Nicholson. One of the oldest pieces was a tempura painting from the 1850s of the Bruntsfield links. He had also acquired a portrait of W. Goddard. Esq. painted by Charles Lees, RSA as a study for his later masterpiece “A Grand Match Played Over St. Andrews Links.”\n\nArchie Baird in an early 1980s photo of the Golf Heritage Museum.\n\nIn 1980 wishing to share some of these treasures, and with fellow collector Ben Crenshaw cutting the ribbon, Mr. Baird opened the Heritage of Golf Museum nearly adjacent to the 18th green of the Gullane No. 1 golf course in Aberlady. Thousands of visitors have come through the museum these past 40 years. Mr. Baird charged not a penny, rather wanting visitors to come away with a deeper appreciation of the game’s rich history. He delighted in giving those tours, all delivered in a concise, entertaining style punctuated with dry humor and memorable one-liners. In an interview with Links Magazine he spoke of the Dutch as inventors of the game:\n\n“They were ahead of the Scots, but they couldn’t make decent clubs—they didn’t need to because they played on iced-over canals, so everyone hit the ball a long way. Nonetheless it was the Scottish craftsmen, with their fine woods of beech and ash, who made the first great golf clubs, and it was the Scots who spread the game.”\n\nHe would often appear at golf functions wearing an original red golf play coat, c. early 1800s, worn by members of the Honourable Company of Edinburgh Golfers, a coat he was said to have found at a Boy Scout rummage sale.\n\nMr. Baird was the author of Golf on Gullane Hill, published in 1982, which recounts 350 years of golf on Gullane links. He was a member of Muirfield Golf Club and assisted in the development of exhibits that display the club’s rich history. He also donated the pocket watch that Old Tom Morris gave his son, Tommy, after he won his first Open Championship, to the St Andrews Golf Club, whose clubhouse faces the 18th fairway of the St Andrews Old Course. A small plaque commemorates the gift.\n\nAmong many other memberships and honors, Mr. Baird was a founding member of the British Golf Collectors Society, latterly an Honorary Life member and an original committee member. He won the BGCS’s Murdoch Medal in 2000 and in June 2018 was honored with the British Empire Medal, both in recognition for services to the history of golf. The BEM was bestowed as part of the Queen’s Birthday Honours, which annually recognizes individuals for a variety of services to the Crown.\n\nHe was a past Captain of Gullane Golf Club, and an honorary member the Society of Hickory Golfers, the latter a modest honor, but a testimony to the esteem in which he was held by those around the world who value golf’s traditions.\n\nMr. Baird will long be remembered for his kindness, his keen appreciation for golf’s heritage and his expertise in sharing that knowledge.\n\nAdditional information will be added here as it becomes available."}, {"url": "https://www.eastlothiancourier.com/news/18105409.tributes-paid-death-well-known-golf-historian-archie-baird/", "page_content": "Mr Baird was born in Edinburgh on September 28, 1924.\n\nHe moved to East Lothian after he retired from working as a veterinarian, living in Aberlady for more than 30 years.\n\nArchie met his wife Sheila, whom he was married to for more than 60 years, while he was studying at veterinary college and she was studying medicine at the University of Edinburgh.\n\nArchie, described as a cheeky man of huge character, founded Gullane Golf Club’s Heritage of Golf Museum, which he opened in 1980.\n\nHe was a long-serving curator at the museum and an author of several books on the history of golf.\n\nHe was also awarded a British Empire Medal last year as part of the Queen’s Birthday Honours.\n\nMr Baird was captain of Gullane Golf Club from 1976 to 1978 and an honorary life member at the club.\n\nHe was also a member of the Honourable Company of Edinburgh Golfers, Muirfield.\n\nA father to Colin, Marion, Mungo and Christine, Mr Baird, who was also a great-grandfather of four, had previously said that Gullane Hill was his favourite golfing spot in the county.\n\nHe was also said to have enjoyed golf for the social interactions and exercise.\n\nTributes have been pouring in since Archie’s passing.\n\nIn a post on Twitter on Monday, Gullane Golf Club said: “We were saddened at the weekend to learn of the passing of Archie Baird, aged 95, the founder of our Heritage of Golf Museum.\n\n“A warm and charming character, his knowledge and love for golf made him a great source of information for all who met him. We will all miss him dearly.”\n\nJulie Cadzow, golf administrator at Gullane Golf Club, told the Courier: “Archie was a much-loved member of Gullane Golf Club for over 63 years, serving as captain from 1976 to 1978.\n\n“A great lover of the game, he was also a collector and archivist and founded our Heritage of Golf Museum.\n\n“A warm and charming character, we will all miss him dearly.”\n\nAlasdair Good, head professional at Gullane Golf Club, said on Saturday: “We lost one of golf’s warmest and most charming characters earlier today.\n\n“Archie Baird gave those who were lucky enough to meet him 95 fun-filled years.\n\n“His knowledge and love for golf made him one of the game’s great sources of information.\n\n“As a collector and archivist, he educated many on the finer points of the game and particularly his love for foursomes play.\n\n“His encyclopaedic knowledge was regularly sought by many of the world’s foremost collectors of historic golfing literature and artwork.\n\n“He absolutely loved golf and this was clear for all to see. He loved his competitive foursomes matches at Gullane.\n\n“Archie always looked upon the bright side and, although we will all miss him, thinking of him will always make us smile.\n\n“Our heartfelt thoughts are with his wife Sheila and family.”\n\nThe club’s Pro Shop added on Facebook: “RIP Archie Baird. Long-serving curator of the Heritage of Golf Museum, Gullane Golf member and dear friend to all us here at Gullane Professional Shop.”\n\nSpeaking to the Courier in 2018 on how Archie first discovered his love of golf, Sheila said: “My great-grandfather was Willie Park, who won the first-ever Open Championship, and one day we were at a sale where Archie spotted some golf balls.\n\n“They had Willie Park’s name on them and he bought them for about 10 shillings I think – that is where it all comes from.”\n\nArchie’s family thanked the staff at the Edington Hospital and those at Gullane Day Centre for their fantastic support and help during this hard time.\n\nA gathering is taking place after his funeral next Thursday (December 19) in The Mallard Hotel in Gullane at 12.30pm for friends and family who wish to pay their respects."}, {"url": "https://www.hickorygolfers.com/archie-baird-scotlands-golfing-ambassador-dies-at-95/", "page_content": "Archie Baird, beloved ambassador for golf who lived in Gullane, Scotland, died Sunday, Dec. 7, 2019. He was 95. He passed away very peacefully at Edington Cottage Hospital in North Berwick.\n\nMr. Baird, a former RAF fighter pilot and veterinary surgeon, is survived by his wife, Sheila, a medical doctor and great-grandaughter of the legendary Willie Park Sr., first winner of the Open Championship, Prestwick in 1860. The couple had four great-grandchildren.\n\nEarly in their marriage the couple shared a small flat in Edinburgh. Their tight budget forced the couple to search second-hand shops and auctions for furnishings. It was during one such excursion that Mr. Baird came upon a dusty bag of hickory shafted clubs. One of the log-nosed woods bore the name of Park. Excited by the find of a club connected to a family member, he bought the club for five shillings (less than a dollar), and thus began a lifelong love of golf collecting.\n\nMr. Baird began to scour shops throughout England and eventually amassed an enormous number of especially prized ancient clubs before turning his eye to other golf collectibles such as books, medals, and other odds and ends. His keenest interest turned out to be artwork.\n\nHis home was a gallery of landscapes, golfing scenes, portraits, sketches, prints, and caricatures. The artist names were a who’s who of the genre – Major Francis Powell Hopkins, W.D. McKay, John Smart, J. Michael Brown, John Hassell, “George Pipeshank,” John Barclay, Lawson Wood, Harry Rountree, and William S. Nicholson. One of the oldest pieces was a tempura painting from the 1850s of the Bruntsfield links. He had also acquired a portrait of W. Goddard. Esq. painted by Charles Lees, RSA as a study for his later masterpiece “A Grand Match Played Over St. Andrews Links.”\n\nIn 1980 wishing to share some of these treasures, and with fellow collector Ben Crenshaw cutting the ribbon, Mr. Baird opened the Heritage of Golf Museum nearly adjacent to the 18th green of the Gullane No. 1 golf course in Aberlady. Thousands of visitors have come through the museum these past 40 years. Mr. Baird charged not a penny, rather wanting visitors to come away with a deeper appreciation of the game’s rich history. He delighted in giving those tours, all delivered in a concise, entertaining style punctuated with dry humor and memorable one-liners. In an interview with Links Magazine he spoke of the Dutch as inventors of the game:\n\n“They were ahead of the Scots, but they couldn’t make decent clubs—they didn’t need to because they played on iced-over canals, so everyone hit the ball a long way. Nonetheless it was the Scottish craftsmen, with their fine woods of beech and ash, who made the first great golf clubs, and it was the Scots who spread the game.”\n\nHe would often appear at golf functions wearing an original red golf play coat, c. early 1800s, worn by members of the Honourable Company of Edinburgh Golfers, a coat he was said to have found at a Boy Scout rummage sale.\n\nMr. Baird was the author of Golf on Gullane Hill, published in 1982, which recounts 350 years of golf on Gullane links. He was a member of Muirfield Golf Club and assisted in the development of exhibits that display the club’s rich history. He also donated the pocket watch that Old Tom Morris gave his son, Tommy, after he won his first Open Championship, to the St Andrews Golf Club, whose clubhouse faces the 18th fairway of the St Andrews Old Course. A small plaque commemorates the gift.\n\nAmong many other memberships and honors, Mr. Baird was a founding member of the British Golf Collectors Society, latterly an Honorary Life member and an original committee member. He won the BGCS’s Murdoch Medal in 2000 and in June 2018 was honored with the British Empire Medal, both in recognition for services to the history of golf. The BEM was bestowed as part of the Queen’s Birthday Honours, which annually recognizes individuals for a variety of services to the Crown.\n\nHe was a past Captain of Gullane Golf Club, and an honorary member the Society of Hickory Golfers, the latter a modest honor, but a testimony to the esteem in which he was held by those around the world who value golf’s traditions.\n\nMr. Baird will long be remembered for his kindness, his keen appreciation for golf’s heritage and his expertise in sharing that knowledge.\n\nAdditional information will be added here as it becomes available."}, {"url": "https://www.findagrave.com/memorial/83643281/archie-albert-baird", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.answers.com/Q/When_did_Archie_Baird_die", "page_content": "Trending Questions\n\nIs it better to take a shower in the morning or at night?\n\nAsked By Laverna Senger\n\nWhat happened to Gregory redman Wallace of the HBO documentary lalee's kin the legacy of cotton?\n\nAsked By Wiki User\n\nWhat other letters fits in the following series B C D E you K O X?\n\nAsked By Wiki User\n\nWhich US cities have city in the name?\n\nAsked By Wiki User\n\nWhat does iii over ooo brain teaser mean?\n\nAsked By Wiki User\n\nHow much should a 12 year old bench press?\n\nAsked By Wiki User\n\nAlliteration with the letter R?\n\nAsked By Wiki User\n\nWhat do you call the situation when your parachute doesn't open?"}, {"url": "https://chemistry.fudan.edu.cn/chemen/a3/5a/c22421a238426/page.htm", "page_content": "Y. Liu, W. Li, J. Zhang* Chiral ligands designed in China. Natl. Sci. Rev. 2017, 4, 326–358.\n\nY. Wang, P.-C. Zhang, X. Di, Q. Dai, Z.-M. Zhang, J. Zhang* Gold-Catalyzed Asymmetric Intramolecular Cyclization of N-Allenamides for the Synthesis of Chiral Tetrahydrocarbolines. Angew. Chem. Int. Ed. 2017, 56, 15905–15909.\n\nS. Xu, Z.-M. Zhang, B. Xu, B. Liu, Y. Liu*, J. Zhang* Enantioselective Regiodivergent Synthesis of Chiral Pyrrolidines with Two Quaternary Stereocenters via Ligand-Controlled Copper(I)-Catalyzed Asymmetric 1,3-Dipolar Cycloadditions. J. Am. Chem. Soc. 2018, 140, 2272–2283.\n\nL. Wang, M. Chen, P.-C. Zhang, W. Li, J. Zhang* Palladium/PC-Phos-Catalyzed Enantioselective Arylation of General Sulfenate Anions: Scope and Synthetic Applications. J. Am. Chem. Soc. 2018, 140, 3467–3473.\n\nZ.-M. Zhang, B. Xu, Y. Qian, L. Wu, Y. Wu, L. Zhou, Y. Liu, J. Zhang* Palladium-Catalyzed Enantioselective Reductive Heck Reactions: Convenient Access to 3,3-Disubstituted 2,3-Dihydrobenzofuran. Angew. Chem. Int. Ed. 2018, 57, 10373–10377.\n\nH. Wang, L. Zhang, Y. Tu, R. Xiang, Y.-L. Guo*, J. Zhang* Phosphine-Catalyzed Difunctionalization of β-Fluoroalkyl α,β-Enones: A Direct Approach to β-Amino α-Diazo Carbonyl Compounds. Angew. Chem. Int. Ed. 2018, 57, 15787–15791.\n\nH. Wang, J. Zhan, Y. Tu, J. Zhang* Phosphine-Catalyzed Enantioselective Dearomative [3+2]-Cycloaddition of 3-Nitroindoles and 2-Nitrobenzofurans. Angew. Chem. Int. Ed. 2019, 58, 5422–5426.\n\nZ.-M. Zhang, B. Xu, L. Wu, L. Zhou, D. Ji, Y. Liu, Z. Li*, J. Zhang* Palladium/XuPhos-Catalyzed Enantioselective Carboiodination of Olefin-Tethered Aryl Iodides. J. Am. Chem. Soc. 2019, 141, 8110–8115.\n\nP.-C. Zhang, J. Han, J. Zhang* Pd/PC-Phos-Catalyzed Enantioselective Intermolecular Denitrogenative Cyclization of Benzotriazoles with Allenes and N-Allenamides. Angew. Chem. Int. Ed. 2019, 58, 11444–11448. (VIP)\n\nZ.-M. Zhang, B. Xu, L. Wu, Y. Wu, Y. Qian, L. Zhou, Y. Liu, J. Zhang* Enantioselective Dicarbofunctionalization of Unactivated Alkenes by Palladium-Catalyzed Tandem Heck/Suzuki Coupling Reaction. Angew. Chem. Int. Ed. 2019, 58, 14653–14659.\n\nC. Zhu, H. Chu, G. Li, S. Ma*, J. Zhang* Pd-Catalyzed Enantioselective Heck Reaction of Aryl Triflates and Alkynes. J. Am. Chem. Soc. 2019, 141, 19246–19251.\n\nQ. Dai, W. Li, Z. Li, J. Zhang* P-Chiral Phosphines Enabled by Palladium/Xiao-Phos-Catalyzed Asymmetric P–C Cross-Coupling of Secondary Phosphine Oxides and Aryl Bromides. J. Am. Chem. Soc. 2019, 141, 20556–20564.\n\nH. Wang, H. Luo, Z.-M. Zhang, W.-F. Zheng, Y. Yin, H. Qian*, J. Zhang*, S. Ma* Pd-Catalyzed Enantioselective Syntheses of Trisubstituted Allenes via Coupling of Propargylic Benzoates with Organoboronic Acids. J. Am. Chem. Soc. 2020, 142, 9763–9771.\n\nL. Wang, K. Zhang, Y. Wang, W. Li, M. Chen, J. Zhang* Enantioselective Synthesis of Isoxazolines Enabled by Palladium-Catalyzed Carboetherification of Alkenyl Oximes. Angew. Chem. Int. Ed.2020, 59, 4421–4427.\n\nL. Zhou, S. Li, B. Xu, D. Ji, L. Wu, Y. Liu, Z.-M. Zhang*, J. Zhang* Enantioselective Difunctionalization of Alkenes by a Palladium-Catalyzed Heck/Sonogashira Sequence. Angew. Chem. Int. Ed. 2020, 59, 2769–2775.\n\nQ. Dai, L. Liu, Y. Qian, W. Li, J. Zhang* Construction of P-Chiral Alkenylphosphine Oxides through Highly Chemo-, Regio-, and Enantioselective Hydrophosphinylation of Alkynes. Angew. Chem. Int. Ed.2020, 59, 20645–20650.\n\nH. Chu, J. Cheng, J. Yang, Y.-L. Guo*, J. Zhang * Asymmetric Dearomatization of Indole via Palladium/PC-Phos-Catalyzed Dynamic Kinetic Transformation. Angew. Chem. Int. Ed. 2020, 59, 21991–21996. (Hot Paper)\n\nT.-Y. Lin, Z. Pan, Y. S. Zhu, H.-H. Wu, Y. Liu, Z. Li*, J. Zhang* Design and Synthesis of TY-Phos and Application in Palladium-Catalyzed Enantioselective Fluoroarylation of gem-Difluoroalkenes. Angew. Chem. Int. Ed. 2020, 59, 22957−22962.\n\nD. Qian, J. Zhang* Yne–Enones Enable Diversity-Oriented Catalytic Cascade Reactions: A Rapid Assembly of Complexity. Acc. Chem. Res.2020, 53, 2358–2371.\n\nZ. Pan, W. Li, S. Zhu, F. Liu, H.-H. Wu, J. Zhang* Palladium/TY-Phos-Catalyzed Asymmetric Intermolecular α-Arylation of Aldehydes with Aryl Bromides. Angew. Chem. Int. Ed.2021, 60, 18542–18546. (Hot Paper)\n\nP.-C. Zhang, Y.-L. Li, J. He, H.-H. Wu*, Z. Li*, J. Zhang* Simultaneous construction of axial and planar chirality by gold/TY-Phos-catalyzed asymmetric hydroarylation. Nat. Commun.2021, 12, 4609.\n\nY.-L. Li, P.-C. Zhang, H.-H. Wu, J. Zhang* Palladium-Catalyzed Asymmetric Tandem Denitrogenative Heck/Tsuji–Trost of Benzotriazoles with 1,3-Dienes. J. Am. Chem. Soc. 2021, 143, 13010–13015.\n\nG. Zhao, Y. Wu, H.-H. Wu, J. Yang*, J. Zhang* Pd/GF-Phos-Catalyzed Asymmetric Three-Component Coupling Reaction to Access Chiral Diarylmethyl Alkynes. J. Am. Chem. Soc. 2021, 143, 17983–17988.\n\nQ. Dai, L. Liu*, J. Zhang* Palladium/Xiao-Phos-Catalyzed Kinetic Resolution of sec-Phosphine Oxides by P-Benzylation. Angew. Chem. Int. Ed. 2021, 60, 27247–27252."}]}