{"Peter Breen is a member of the Republican Party.": [{"url": "https://ballotpedia.org/Peter_Breen", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://chicago.suntimes.com/2020/9/7/21425118/peter-breen-illinois-house-rep-48th-district-republican-nominee-candidate-2020-election-profile", "page_content": "Candidate profile\n\nPeter Breen\n\nRunning for: State Representative 48th District\n\nPolitical party affiliation: Republican\n\nPolitical/civic background: Served as Trustee/Acting Village President, Village of Lombard. Served 2 terms in the Illinois General Assembly, including as GOP Floor Leader.\n\nOccupation: Constitutional Attorney, specializing in First Amendment cases in federal and state courts across the country.\n\nEducation: Top 10, Naperville North HS; B.E., Electrical Eng., Vanderbilt University (earned in 3 years); J.D., University of Notre Dame (ND Law Scholarship)\n\nCampaign website:http://www.votebreen.com/\n\nFacebook:https://www.facebook.com/votebreen/\n\nElection Guide - Full Guide 2020 Election Voting Guide This article is part of our Illinois 2020 election voting guide. Click here to see more.\n\n\n\nThe Chicago Sun-Times Editorial Board sent nominees for the Illinois House of Representatives a list of questions to find out their views on a range of important issues facing the state of Illinois and their districts. Peter Breen submitted the following responses:\n\n1. The COVID-19 pandemic has hammered the finances of Illinois. The state is staring at a $6.2 billion budget shortfall in this fiscal year. What should be done? Please be specific.\n\nThe pandemic highlighted the historical short-sightedness of the General Assembly. We went into this horrific situation with absolutely NO money in a “rainy day fund.” Further, for over a decade, the General Assembly knowingly passed underfunded budgets using every accounting scheme imaginable. Even when we had higher than anticipated tax receipts in the state, as the result of a very positive economy, we didn’t save but spent every dime and more. Then the virus came and devastated business, personal income, taxes and user fees, etc. While the economy is beginning to rebound, Illinois must become far more proactive in helping grow small and midsize businesses, instead of again hiking crippling taxes to meet the voracious appetite for out-of-control spending in Springfield.\n\n2. What grade — “A” to “F” — would you give Gov. J.B. Pritzker for his handling of the coronavirus pandemic? Please explain. What, if anything, should he have done differently?\n\nThe grade has to be “Incomplete,” since we are still midway through the pandemic. We won’t know the impact of the governor’s lockdown and pandemic orders until at least next year: then, we can see the full results of these policies on the physical, mental, and economic health of our residents versus those of neighboring states.\n\nBefore the pandemic, Illinois imposed the worst tax burden on its residents of any state in the country, along with being known as a notoriously bad place to start, build, or bring a business. Gov. Pritzker then imposed one of the most severe lockdowns in the country. Predictably, Illinois residents have not recovered their jobs and businesses as quickly as folks in other states. Even with the lockdown, Illinoisans experienced worse physical health impacts from COVID than neighboring states.\n\nWe need a full post-COVID review of why we suffered such high infections and deaths in long-term-care facilities. Without that review, we won’t know whether this was due to the governor’s actions or inactions, or some other cause.\n\nFrom the beginning, I’ve advocated against including my county of DuPage in a “zone” with Cook County in terms of phasing openings and policies. That penalized and handicapped our ability to move more quickly to recovery.\n\nAnd it was wrong to ban small family retailers from in-person sales of their products, while large retailers could sell those same products.\n\nFinally, the Pritzker Administration entirely botched unemployment insurance, leaving the jobless with no one to answer the phone, trying to navigate a broken website, and suffering the indignity of their personal identification details put on the internet. With tens of thousands of government employees across Illinois at home, there were plenty of people who could have manned unemployment phone lines during this unprecedented crisis.\n\n3. In the wake of the death of George Floyd in Minneapolis, legislatures in some states have taken up the issue of police reform. Should Illinois do the same? If so, what would that look like?\n\nEveryone was horrified by the tragic circumstances surrounding the needless death of George Floyd. It was inexcusable on every level. There are clearly agencies and departments that require more and better training of officers and a clear set of policies to prevent such a tragic result ever again. That officer in Minneapolis was acting outside of guidelines and deserves to be punished for his crimes. Our agencies are better than this, particularly in DuPage County.\n\nIn Illinois, I backed the bipartisan Police and Community Relations Improvement Act, which banned chokeholds, put standards in place for officer-involved deaths, and improved training requirements, among other reforms. While due to this Act, Illinois already has in place many of the reforms other states are now reviewing, we should always be looking at any and every helpful reform that protects the public and gives our agencies the ability to perform professionally in maintaining the law. As a Village Trustee, I was also a strong supporter of body cameras to protect both the public and police officers in altercations. This was at a time when there was significant resistance to these devices.\n\n4. Should the Legislature pass a law requiring all law enforcement officers to wear body cameras? Why or why not?\n\nAbsolutely. It protects both citizens and law enforcement. It can and does act as a deterrent for both parties. I would immediately sponsor or co-sponsor such a bill.\n\n5. Federal prosecutors have revealed a comprehensive scheme of bribery, ghost jobs and favoritism in subcontracting by ComEd to influence the actions of House Speaker Michael Madigan. Who’s to blame? What ethics reforms should follow? Should Madigan resign?\n\nTerra Costa Howard, and enablers like her, are to blame. During the 2018 elections, Costa Howard promised the residents of the 48th District that she would be independent of Mike Madigan, but then she turned around and took $1.5 million in campaign contributions from him (more than any other state legislative candidate) and voted for him for Illinois House Speaker. Terra Costa Howard handed our vote—and our voice—to a crook and a thief.\n\nEven today, Costa Howard still refuses to return one dime of all the dirty money she’s taken—and she is still raking in money from Madigan-controlled campaign committees.\n\nMadigan has run state government as a pay-to-play scheme for decades. The monied interest groups pay into his campaign committees and hire his preferred lobbyists, guaranteeing them a seat at the legislative table. If you don’t have money or the right lobbyist, you lose.\n\nAnd he’s done this in plain sight, with increasing numbers of Illinoisans watching in horror, but unable to stop it. When reform-minded candidates like me step forward to run in competitive districts, they get hit with multi-million-dollar smear campaigns, executed by the Madigan machine’s sophisticated political operation. Even post-Madigan, this won’t change unless we elect new leaders clean of the taint of Madigan and his machine.\n\nOn Madigan, I called for his resignation last year. While in the House, I opposed Madigan for Speaker twice.\n\nOn reforms, we need term limits. We have a part-time citizen legislature, and term limits will strengthen the temporary nature of legislative service. There are a raft of additional reforms in this vein: bans on lobbying after legislating, strengthening lobbyist disclosure requirements, limits on legislative leaders, taking power away from legislative leaders and returning it to members, and putting teeth into laws prohibiting conflicts of interest by legislators, among others. Reform should be an “all-of-the-above” approach.\n\n6. Please tell us about your civic work in the last two years, whether it’s legislation you have sponsored or work you have done in other ways to improve your community.\n\nMy wife and I were blessed to be able to adopt our second son two years ago, literally a week before the last election. We’re very committed to our community and blessed to raise a family here.\n\nDuring COVID, I’ve been active running food drives that collected thousands of pounds of food and thousands of dollars for our local St. Vincent De Paul Societies. I’ve also been handling requests from local residents who weren’t able to get help from the Costa Howard district office. And I’ve been putting out informational Facebook Live videos that have received tens of thousands of views, on a variety of topics of interest to our district.\n\nAt the end of last year, after our community suffered a spate of over-valuations on local properties, I put on multiple emergency property tax seminars, along with working directly with residents, to help folks get their assessments and taxes lowered. Ms. Costa Howard was not responsive to the needs of these residents, who are literally being taxed out of their homes.\n\nIn my professional capacity, I’ve worked hard to assist churches to be able to open safely, with precautions, to enjoy the status that other “essential places” have had. My wife and I also participate with both time and treasure to many of the civic organizations in my community.\n\n7. Please list three concerns that are specific to your district, such as a project that should be undertaken or a state policy related to an important local issue that should be revised.\n\nThe people and businesses of our district are burdened the most by out-of-control spending and taxes, onerous mandates on businesses and local governments, and rampant corruption. We can’t recover quickly and fully from COVID while suffering under these burdens.\n\nYet all of them have been made worse by Terra Costa Howard: she supported unbalanced budgets, new mandates on local businesses, and voted for Madigan for House Speaker. Costa Howard told voters during her 2018 campaign that she’d be for “fiscal responsibility” and “small business,” but once she got to Springfield, her voting record was the exact opposite.\n\nCosta Howard even voted against a proposal to stop the conflicts of interest in General Assembly members, like Mike Madigan, writing the property tax laws and then raking in millions doing property tax appeals. The Chicago City Council banned that practice, in response to the Ed Burke prosecution, but Costa Howard rejected reform and stood with Madigan.\n\nFor our district, I’ve succeeded in securing relief when state action was required. Whether it was securing IDOT approval for the new Mariano’s on Roosevelt Rd in Lombard; helping a local nonprofit, SCARCE, with a law allowing it to collect cooking grease and oil; or changing state law to allow Noon Whistle Brewing to use innovative “360-lid” technology (allowing removal of nearly all the top of a beverage can, making it more like a cup), I got the job done.\n\n8. What are your other top legislative priorities?\n\nToo many Illinoisans feel they must uproot and leave the state they call home. We are now at six straight years of losing residents to other states, losing over 100,000 people net in just the past two years. Every person who leaves takes their hopes and dreams and contributions with them, pulling vitality and energy away from Illinois.\n\nAnd the latest data shows we’re not just losing seniors—it’s prime working-age residents who are leading the exodus. Residents are taxed out of their homes, or are just tired of supporting a state government they see as disconnected and corrupt. Students are heading to college out of state, never to return. Families are packing up for places with more and better paying jobs.\n\nThe solutions are not easy, but they are simple. Lower the tax burden on our residents and businesses—both income taxes and property taxes have to come down. Stop out-of-control spending at the state level, which is driving tax and fee increases. Embrace reform measures like Fair Maps and Term Limits, to ensure we have citizen legislators representing whole communities, not sliced up narrow groups of partisans. Our broken state government is the primary obstacle standing in the way of turning our state around.\n\n9. What is your position on Gov. J.B. Pritzker’s proposed graduated income tax? Please explain.\n\nI stand firmly against the graduated income tax. My greatest reason comes from my experience in the General Assembly, where I saw first-hand the amount of wasteful spending and poor fiscal policy being implemented in the state. The budgets passed always exceeded our anticipated income, and even those income numbers were artificially inflated as part of an obscene effort to call these budgets “balanced.” They never were. In a state with an insatiable appetite for spending, feeding more hard-earned taxpayer money into that corrupt process is not the solution.\n\nOur entire budgeting process should be overhauled, a zero-based budget starting with a clean slate. There are numerous programs which are simply routinely re-appropriated, without careful assessment of effectiveness or necessity. They often become silos of money for discretionary spending, and they are rife for corruption. Before anyone asks an Illinois taxpayer for a single penny more, there should be an absolutely full accounting of all of the money this state already raises through every tax and fee we already levy. We’re in recovery mode. Consumers will be a huge part of that. Taking away more money isn’t the way to encourage growth.\n\n10. Illinois continues to struggle financially, with a backlog of unpaid bills. In addition to a progressive state income tax — or in lieu of such a tax — what should the state do to pay its bills, meet its pension obligations and fund core services such as higher education?\n\nAs stated before, this state needs to re-examine every dollar we are spending now. Illinois should do what any entity should do when they are spending more than they take in: reform, and spend less.\n\nIllinois government needs to innovate with a view to 2030, not 1830. Advancements in technology should lead to lower expense, not greater, but there’s never a solution proposed in this state that doesn’t include a tax hike. That’s the first and only solution ever considered.\n\nThere also needs to be a very serious and fair discussion with relation to pension funds. These have become an eternal issue with no solvent funding solution in place. I lose sleep over the fact that these funds won’t be there for people who have been made promises that are fiscally impossible to keep. I believe that before we can solve this problem, we have to stop the bleeding first. There are some measures with the tier system that have helped a little bit, but are still inadequate. For everyone’s sake, including pensioners who deserve security and certainty, a fair, equitable set of agreements to tackle this dire issue over a reasonable period of time is the only realistic solution.\n\nAs for “core services”, we need to narrowly define them and fund them properly. This area of funding suffers more than any other as they don’t enjoy the auto-reappropriation so many other elements of the state budget do. The whole budget needs to be re-imagined and re-examined starting with a fresh balance sheet.\n\n11. Should Illinois consider taxing the retirement incomes of its very wealthiest residents, as most states do? And your argument is?\n\nThere aren’t many incentives to remaining an Illinoisan. The policy of not taxing retirement income is among the few incentives any resident of Illinois has to stay here. If we were to selectively consider taxing retirement income, who would decide who is wealthy? Who would decide the rates? Who would decide when those rates should change, because Illinois still continues to spend more than it takes in? We know who. The same General Assembly that put us in the fiscal morass we’re stuck in. Who would trust them to make those decisions? To make my answer clear: No, Illinois should not consider this.\n\n12. What can Illinois do to improve its elementary and high schools?\n\nIllinois schools spend double the national average on administration—we have to move that money back to the classroom. And the state imposes numerous unfunded mandates that hike costs for local school districts.\n\nI put forward a bill to cap administrative spending at the national average, which would free up hundreds of millions of dollars for classroom needs and property tax relief. Whether this efficiency is achieved by consolidating districts or sharing administrative costs, this is a huge sum of money being wasted in our state.\n\nWhen I review our standards, I believe they’re high enough, but we’re not meeting them. There needs to be more accountability for doing so. We are in a financial crisis in this state that affects everyone, including school districts. It very much affects the families sending these students to schools. The funding of schools has experienced years of band-aid approaches, special legislation and a completely non-comprehensive approach.\n\nAt present, we’re not even sure if schools are going to open this school year or how. I’m a public high school graduate. I was fortunate to get an outstanding education and go on to very strong universities with that foundation. I don’t believe that is the case for many of our students today.\n\nThe only way to truly improve schools is by actively reforming our education policy, cognizant of the needs of the various regions of the state, and with the full participation of all of the stakeholders in the process. That simply hasn’t been done. There are too many golden calves, resulting in winners and losers with every partial-reform effort enacted. Too often the losers were a set of students in one part or the state or the other, or worse, everywhere. Educators are smart people by nature and experience. This is a solvable problem.\n\n13. Mass shootings and gun violence plague America. What can or should the Legislature do, if anything, to address this problem in Illinois?\n\nWe’ve had selected success and failure with this issue in Illinois. It’s both heart-breaking and frustrating to see our state on the national news every night reporting the most recent tally of shootings and killings in Chicago. The city has some of the strictest gun laws in the country, and despite that, there are no shortage of guns or tragic carnage there. The General Assembly has also already tightened gun regulations to be some of the toughest in the country.\n\nThe other side of the equation is policing and prosecuting those misusing firearms. For instance, I have worked closely with our DuPage State’s Attorney, Bob Berlin, on a variety of legislative measures, including enhancing penalties for those who commit crimes and then jump bail. Historically, DuPage has seen as much as 50% of felonies committed by individuals from outside the county, so laws like this one would give our prosecutors the tools they need to discourage crime locally.\n\n14. Do you favor or oppose term limits for any elected official in Illinois? Please explain.\n\nI am in favor of term limits. Legislators do need enough time to become effective and not let the permanent establishment of staff operate the government. In the State of Illinois, with the way legislative maps are gerrymandered, elections do not serve the function as term limits as it was intended. I believe strongly in a Citizen Legislature for a carefully prescribed period of service.\n\nThere’s no reason a statewide official should serve more than 2 terms (8 years). And 8-10 years for Legislators in the State Senate or General Assembly is plenty. Controlled, centralized power for too long of a period is a recipe for corruption: we are watching this play out on our television screens as more and more long-serving members of the Illinois General Assembly are charged with various federal crimes.\n\n15. Everybody says gerrymandering is bad, but the party in power in every state — Democrats in Illinois — resist doing anything about it. Or do we have that wrong? What should be done?\n\nYou have it right. It is bad. Fortunately, more and more, the people of Illinois view gerrymandering to be unconstitutional and wrong. I drafted and championed a Fair Maps Amendment, presented as a citizen initiative, because of the block put on Fair Maps by the Democratic Party of Illinois. (We had over 10,000 signatures gathered, before being abruptly halted by the coronavirus.)\n\nEvery few years, you see cynical attempts by electorally vulnerable Democrats to file fair maps amendments, knowing full well these efforts will never see the light of day. We saw it in 2016 when then-Rep. Jack Franks was allowed to bring his amendment to the House Floor (where it garnered 105 votes), with the understanding that the Senate would not take it up. And we saw Ms. Costa Howard do the same thing this year, filing another dead-on-arrival amendment just two months before the deadline.\n\nWhat should be done? The media, private industry, and good-government groups should coalesce behind a citizen initiative that meets the requirements of the Illinois Constitution. My Fair Maps Amendment is one legally rock-solid way to meet those stringent requirements. Any system would be better than the current one.\n\n16. The U.S. attorney’s office in Chicago is investigating possible official corruption by state and local officials. This prompted the Legislature to pass an ethics reform measure to amend the Lobbyist Registration Act (SB 1639). It was signed into law in December. What’s your take on this and what more should be done?\n\nAs I noted previously, we need an all-of-the-above approach to ethics reform, starting with term limits. There are plenty of ideas out there, and if we need more, we can look to the many other states that are known for clean government, like Iowa and Wisconsin.\n\n17. When people use the internet and wireless devices, companies collect data about us. Oftentimes, the information is sold to other companies, which can use it to track our movements or invade our privacy in other ways. When companies share this data, we also face a greater risk of identity theft. What should the Legislature do, if anything?\n\nIllinois currently has some of the toughest laws in the country around information privacy. Even so, we can always be open to addressing the privacy challenges presented by tech advancements. For instance, the issues relating to Tik Tok and its undisclosed scraping of user data may present areas for us to legislate in Illinois, if the federal government does not act.\n\nThe General Assembly is severely lacking in the experience necessary to meet the challenges presented by emerging technology: I bring unique training and experience in computer science and telecommunications to bear on these issues. Voices like mine are missing from the General Assembly.\n\n18. The number of Illinois public high school graduates who enroll in out-of-state universities continues to climb. What can Illinois do to make its state universities more attractive to Illinois high school students?\n\nEvery Illinoisan deserves the opportunity to attend college or a trade school, and to graduate without debt. A big reason people leave Illinois for out of state institutions is the cost of education here. We are not as competitive as other state university systems. In my district, many students choose universities in Indiana, Iowa, or Missouri, instead of staying here. With few financial incentives available, U of I is also difficult for many of our best students to attend. Other states have aggressively recruited in Illinois and provided financing, to cherry pick our best students.\n\nParents also have a role in how students make these choices. They want what’s best for their children, and because of the problems afflicting Illinois, many parents urge their kids to go elsewhere. Illinois needs to live up to the standard that “anything is possible” to pursue and prosper here. This is another area where our state’s horrible fiscal condition is negatively affecting us. All this adds up to students choosing less expensive, top-flight schools in other states, with better fiscal management and opportunity.\n\n19. What is your top legislative priority with respect to the environment?\n\nI’m a husband and father of 2 little boys. Clean air and clean water are our most important environmental considerations. I am proud to have been one of the few Republicans regularly rated 100% by the Illinois Environmental Council.\n\nAs well, being the only person with an Electrical Engineering background in the General Assembly, I repeatedly worked with environmental groups to responsibly move Illinois to low- and zero-emissions energy. Illinois is recognized as a national leader in the field today, due to our efforts on that front.\n\n20. What historical figure from Illinois, other than Abraham Lincoln (because everybody’s big on Abe), do you most admire or draw inspiration from? Please explain.\n\nI’d choose the “Great Communicator,” Ronald Reagan, since I can’t pick Abraham Lincoln. Growing up, we knew President Reagan as a calm, upbeat presence for our country. He fought hard for his principles, but he united folks across partisan lines and was focused on getting things done. We could use more leaders like him today.\n\n21. What’s your favorite TV, streaming or web-based show of all time. Why?\n\nAll-time would probably be Doctor Who. Some seasons are better than others, but the fact that the whole main cast changes every few years keeps up the variety of the show. You get something to latch onto with each crew. The show is wickedly funny and creative, and often bends your brain.\n\n"}, {"url": "https://ballotpedia.org/Illinois_House_of_Representatives_District_48", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://chicago.suntimes.com/2018/10/21/18423343/illinois-house-48th-district-republican-nominee-peter-breen", "page_content": "Republican Peter Breen is the Sun-Times’ endorsed candidate in the 48th district race in the Illinois House. Breen faces Democrat Terra Costa Howard in the general election.\n\nThe Chicago Sun-Times sent the candidates seeking nominations for the Illinois House of Representatives a list of questions to find out their views on a range of important issues facing the state of Illinois.\n\nThese are the answers Breen submitted to our questionnaire.\n\nPlease explain what cause or causes you will make priorities.\n\nBreen: Too many Illinoisans feel they must uproot and leave the state they call home. Senior citizens are taxed out of their homes, or are just tired of supporting a state government they see as disconnected and corrupt. Students are heading to college out of state, never to return. Families are packing up for places with more and better paying jobs.\n\nThe solutions are not easy, but they are simple. Lower the tax burden on our residents and businesses—both income taxes and property taxes have to come down. Stop out-of-control spending at the state level, which is driving tax and fee increases. Embrace reform measures like Fair Maps, to ensure that legislators represent whole communities, not sliced up narrow groups of partisans. Our broken state government is the primary obstacle standing in the way of turning our state around.\n\nPlease list three concerns that are highly specific to your district, such as a project that should be undertaken or a state policy related to some local issue that must be changed.\n\nBreen: The latest studies indicate that, for every tax dollar the residents of DuPage County send to Springfield, only 31 cents come back. That’s a lot of money sent to Springfield, with very little to show for it.\n\nFor our district, when we identify a local issue that requires some action by the state, I’ve usually able to secure those changes. For instance, I was able to work with Sen. Chris Nybo and others on getting IDOT approval to bring in the new Mariano’s on Roosevelt Rd in Lombard. He and I also successfully sponsored a bill to allow a local nonprofit, SCARCE, collect cooking grease and oil, which had been prohibited under state law. And when a popular local microbrewery, Noon Whistle, were prohibited by state law from using innovative “360-lid” technology (allowing removal of nearly all the top of a beverage can, making it more like a cup), I drafted the bill to get that changed.\n\nThe people and businesses of our district are burdened the most by out-of-control spending and tax increases, onerous mandates on businesses and local governments, and excessive debt, all caused by past mostly Democrat-led majorities of the General Assembly.\n\nWho is Peter Breen?\n\nHis legislative District: 48th Representative District His political/civic background: State Representative, 2015-present, Floor Leader, 2017-present Trustee, 2011-2014, & Acting President, 2012-2013, Village of Lombard His occupation: Constitutional Attorney & State Representative His education: Juris Doctor, University of Notre Dame Bachelor of Engineering, Electrical Engineering, Vanderbilt University Diploma, Naperville North High School Campaign website: votebreen.com\n\nWhat are the most important differences between you and your opponent?\n\nBreen: I’ve been an independent advocate for the people of my district during my two terms in the Illinois House. There’s no person or group that can claim to “own” me.\n\nHowever, my opponent is almost entirely funded by House Speaker Mike Madigan and his political operation. She’s staffed with his people. She uses the talking points his people provide her.\n\nMy opponent sat on a school board for 8 years, and she voted to increase property taxes every single year, including during the worst depths of the Great Recession. She even broke ties several years to raise property taxes. And those were large increases, some years as high as 12% or 15%, well more than the rate of inflation. My opponent raises taxes, and she has zero credibility in addressing the massive property tax problem plaguing our state.\n\nI’ve repeatedly voted to freeze property taxes, and I support reducing and capping them. This isn’t new for me: while on the Lombard Village Board, I secured a freeze, the first property tax relief the people of the Lilac Village had experienced in 20 years. I also led the effort as Acting Village President to cut half a million dollars from our annual budget, with no loss of services, and return the money to the people by permanently eliminating the village vehicle sticker. If you drive in Lombard, you might see some folks still have a sticker on their car–that’s from 2012-2013, the final year of that most-despised fee.\n\nFinally, my opponent has pointed to abortion either as the primary reason she decided to run against me or the only issue she would discuss in interviews with reporters. That sort of single-issue focus doesn’t fit our district, and it isn’t the reason Illinois state government is broke and bankrupt either. On abortion, my opponent supports taxpayer funding of elective abortions, while I do not believe tax dollars should be used for elective abortions. But I’m focused cleaning up the fiscal mess in Springfield and shining a bright light on the special interests who have taken hold of so much of Illinois government, at all levels.\n\nIllinois is now the sixth-most populated state, down from No. 5, after 33,703 people moved out between July 2016 and July 2017. What must the Legislature do to make Illinois a more desirable place to live?\n\nBreen: We should be terribly alarmed by our population loss. Our consumer base is powerful. But as we lose residents, the corporate and business base follows them out of state. Our start-up businesses, our education opportunities, and employment opportunities will all suffer. Reversing the trend means making Illinois a more hospitable place to live, with regard to our taxing policy, and a better place to start, expand, and run a business.\n\nOur border state neighbors take full advantage of our poor policies with regard to property taxes, sales taxes, fees, and regulations. When a huge corporation chooses a location a few miles north in Kenosha County, it takes advantage of our highly skilled, highly educated work force, but another state realizes the lion’s share of the benefits of that corporation. Many residents will move a few miles to take even greater advantage of lower tax policies overall, and a lower cost of living. This scenario continues to happen to Illinois.\n\nWe have to lower the tax burden. Create policy that offers businesses a long-term vision of an Illinois that is hospitable to them and their growth. These are things that could happen quickly with the right governance. The reasons for not doing so are utterly selfish and self-dealing government policies. It’s not too late yet, but we are absolutely on the verge of passing a point where it is.\n\nIn 2017, our state’s unfunded pension liability ballooned to more than $130 billion. What’s to be done about that?\n\nBreen: The General Assembly refuses to grapple with substantive pension reform. The Illinois Democrats rely heavily on government employee unions for campaign workers and dollars, and those government unions have taken a hard line against any pension reform. And the many government workers in downstate districts have firmly instructed their legislators, “don’t touch our pensions.” But these attitudes have us hurtling toward a future where our (clearly unsustainable) pension liabilities can’t be paid. The problem stems from politicians over-promising pension benefits, mainly in the 1980’s and 1990’s, leading to a 1000% increase in liability over the past 30 years.\n\nThe General Assembly should do everything possible to stem the tide of increasing pension liabilities. We should immediately convene a Blue Ribbon Commission, bringing together the top legal and economic experts, to lay out every option possibly available to us. That should lead into the broadest possible public, statewide debate on this crisis. Since Illinois politicians either refuse or feel they can’t address this issue, avenues should be explored to put the matter directly to the People.\n\nFrom 2000 to 2016, the number of Illinois residents who enrolled as college freshmen outside the state increased by 73% (20,507 to 35,445). Why are so many more Illinois residents going to college elsewhere? What should be done to encourage more of them to go to school here?\n\nBreen: The causes for our college decline are both short-term and long-term. First off, we’re not competitive enough in the short-term for the students looking at schools. Our kids who in years past would attend an Illinois school are headed out of state for a variety of immediate reasons, including because they got a better financial package or because they felt the programs offered by an out-of-state school would better meet their educational aims.\n\nA review of the data from the past few years shows that, for each of our state universities, the Illinois state government spends more money per pupil than nearly any other competing institution–and at the same time, our schools charge a higher tuition per student than their competing schools! This imbalance, where we’re pumping in more tax dollars but still charging more than competing schools, needs to be addressed openly and honestly.\n\nThe long-term issues relate to the desire of families and businesses to stay here. If families don’t see a future for themselves in Illinois, why would their kids bother attending school in-state? If there are more and better jobs elsewhere, why stay? We have to fix our broader governmental problems before we will stem the long-term tide of students leaving.\n\nWhat laws, if any, should the Legislature pass to address the problem of gun violence?\n\nBreen: This term, I worked with Rep. Kathy Willis (D-Addison) to craft the state’s new Firearms Restraining Order law, which provides a mechanism to get guns out of the hands of provably dangerous individuals. That law is a significant step forward to addressing the issue of gun violence. I’ve also supported the licensing of firearms dealers, to stop the illegal flow of guns into the hands of criminals, and increased penalties on those who commit crimes with guns.\n\nOn-demand scheduling software now helps large retail companies determine how many staff members they will need on a day-to-day or even hour-to-hour basis. The downside is that employees may not receive their work schedules until the last minute. Oregon and a number of cities have responded by adopting “fair scheduling” laws. Would it be appropriate for the Illinois\n\nLegislature to pass a “fair scheduling” law? Please explain. What would such a law look like?\n\nBreen: At this point, we need to focus on reducing the burdens on businesses, and especially those facing small businesses, and help them create jobs and economic growth. In reviewing any regulation, my first question is “what are our competing states doing?”–that means reviewing the policies of the states that are now home to former Illinois businesses.\n\nShould recreational marijuana be legalized in Illinois? Please explain.\n\nBreen: The law enforcement community is strongly against a full-scale legalization and commercialization of recreational marijuana, and their concerns should be thoroughly investigated, discussed, and analyzed before legalization is considered.\n\nOpioid overdoses and fatalities continue to rise in number. In Illinois in 2017, there were 13,395 opioid overdoses, including 2,110 deaths. What should the Legislature do, if anything, about this?\n\nBreen: Opioid abuse has destroyed families and taken too many of our loved ones. I’m in favor of an all-of-the-above approach on this subject, whether in looking at alternatives to opioids, education campaigns, and law enforcement and criminal justice reforms, among others.\n\nThe Future Energy Jobs Act, passed in 2016, is generating job growth in renewable energy and improving energy efficiency. Do you agree or disagree with the objectives and substance of the Act? What more — or less — should be done?\n\nBreen: I supported the Future Energy Jobs Act, and I was recognized this year by the Illinois Environmental Council with a 100% rating for my support of legislation protecting our environment. The Act appears to be working, but due to its complexity, it’s taken a while to fully implement. There will inevitably be bumps in the road, which the General Assembly should monitor and intervene to address if necessary.\n\nWhat would you do to ensure the long-term viability of the state’s Medicaid program? What is your view on managed care for Medicaid beneficiaries?\n\nBreen: Every state has different ways of providing care for those on Medicaid, so as we look at reforms, there are myriad examples to draw upon. Whether you’re looking at managed care, or some form of individual savings accounts, or some of the innovative new medical practice models sweeping the country, let’s take an honest look. The point is to get the best care possible at the best price, and if there are better ways to achieve that goal, we should assess them.\n\nUnderfunding at the Department of Corrections has led to troubling findings by the auditor general that many inmates don’t receive services or opportunities for work while incarcerated. Is this a legitimate concern? What should the Legislature do?\n\nBreen: One of the purposes of prison is reformative, to provide the support necessary to the individual to be a productive member of society upon release. Whatever we need to do to bring that about, we should do. Work skills are absolutely critical to this–without those skills, you can’t get and keep a job. If folks who have been in prison can find good jobs after release, the incentives to commit crimes in the future obviously go way down.\n\nShould the state restore the practice of parole for people sentenced to long terms? Why or why not?\n\nBreen: At this time, with the terrible violence plaguing our communities, we need to first focus on protecting innocent folks across our state who are at risk of grave harm. The victims need to be our top priority.\n\nAhead of the historic 2018 elections, the Sun-Times is teaming up weekly with the Better Government Association, in print and online, to fact-check the truthfulness of the candidates. You can find all of the PolitiFact Illinois stories we’ve reported together here.\n\nRELATED\n\n• ENDORSEMENT: Peter Breen for Illinois House in the 48th District\n\n• Endorsements for 16 Illinois House races in the Chicago area, Districts 15 through 50\n\n• Endorsements for 17 Illinois House races in the Chicago area, Districts 51 through 98\n\n• Illinois Senate endorsements for the Chicago area\n\n"}, {"url": "https://ilga.gov/house/Rep.asp?MemberID=2264", "page_content": "×\n\nThe Illinois General Assembly offers the Google Translate™ service for visitor convenience. In no way should it be considered accurate as to the translation of any content herein.\n\nVisitors of the Illinois General Assembly website are encouraged to use other translation services available on the internet.\n\nThe English language version is always the official and authoritative version of this website.\n\nNOTE: To return to the original English language version, select the \"Show Original\" button on the Google Translate™ menu bar at the top of the window."}, {"url": "https://www.dailyherald.com/news/20201006/peter-breen-candidate-profile-illinois-house-48th-district", "page_content": "Peter Breen: Candidate profile, Illinois House, 48th District\n\nIn the race for Illinois House from District 48, Terra Costa Howard, a one-term incumbent Democrat from Glen Ellyn, is facing a rematch with Republican Peter Breen of Lombard, whom she ousted from this House seat in 2018.\n\nBreen, an attorney, served two terms as the state representative from 2015-2019, including as Republican Floor Leader from 2017-2019. He is vice president and senior counsel for the Thomas More Society, a nonprofit, national public interest law firm. He is a former Lombard village trustee from 2011 to 2014, stepping in as Lombard's acting village president in 2012-13.\n\nTo explore his campaign website, visit votebreen.com.\n\nThe 48th District includes Glen Ellyn, Lombard and parts of Wheaton and Lisle.\n\nThe Daily Herald asked the candidates a series of questions. Here are Breen's responses.\n\nQ: Should Speaker Madigan resign from his leadership positions? If he does not resign, will you support him for a new term as House speaker?\n\nA: I called for Madigan to resign after it was disclosed earlier this year that his chief lobbyist, Mike McClain, protected a Madigan operative for covering up the rape of a child in Champaign.\n\nThat was the latest in a string of sexual misconduct by high-level operatives in the Madigan machine.\n\nMcClain personally backed Terra Costa Howard in the 2018 election cycle, and according to November 2019 reporting, he ran a \"secret project\" to fund the campaigns of his preferred House Democrats during the critical closing weeks of the 2018 cycle.\n\nCosta Howard did nothing about her supporter McClain's rape cover-up, or about any of the other sexual misconduct. She stuck with the Madigan machine through it all. And she's still taking his money and the support of his machine. No one who knows Illinois politics was surprised by the corrupt conduct detailed in the ComEd prosecution.\n\nMadigan has run state government as a pay-to-play scheme for decades. Every Republican in the legislature has demanded he step down, but the Democrats have lashed themselves to his mast. They deserve to go down with his ship. Some would say \"they stayed loyal.\" I'd say, \"they stayed bought.\"\n\nQ: What are the most important components that should be included in legislative ethics reform? What will you do to help them come to pass?\n\nA: We should start with term limits. Whether it's Mike Madigan or disgraced legislators like Louis Arroyo, Martin Sandoval, or Terry Link (and many others), term limits would likely have prevented their crimes.\n\nTerm limits ensure we have a part-time citizen legislature, as our Illinois Constitution calls for. With term limits, the Illinois General Assembly becomes less appealing for those who are corrupt coming in, and a short period of service hopefully ushers out those who are corruptible before they can \"break bad.\"\n\nEither way, with a brief time in office, you have to get your work done quickly, because you'll soon be back in private life. As to the myriad other ethics proposals out there, and we should take an \"all-of-the-above\" approach.\n\nSadly, there is also a great need for reform for personal ethics as well, with regard to personal behavior. Every manner of bad behavior is tolerated and covered up in Springfield, leaving far too many victims in its wake. I've been willing to sponsor this kind of legislation and will continue. I will sponsor, support vocally, and vote for any real reform bill that gets filed.\n\nQ: What should the General Assembly do to improve the state's unemployment benefits system?\n\nA: Our technology is so far out of date in Illinois that we couldn't even distribute federal money to Illinois residents.\n\nAdding to the problem of a website that couldn't handle the traffic were phones not being answered within the agency itself. With so many state employees at home on account of the virus, it's beyond imagination how there could not have been more support for millions of state residents who were suddenly in great need.\n\nTechnology can be upgraded quickly. Why this hasn't been done in so many years is inexcusable.\n\nI'm certain I'd be told it was a financial issue. The high cost of human involvement (state jobs) is many times more costly than technology upgrades. And when it came to humans; they weren't at work. Many state Reps and state Senators couldn't reach anyone in the agency to get any answers for constituents or for themselves. Residents couldn't get through and didn't receive any calls back if they somehow did get an opportunity to leave a message. This is by far the easiest fixable question on this entire survey. The philosophy of state government has to change drastically. Illinoisans pay a great deal of money for service. They deserve to get some.\n\nQ: Should Illinois use a non-partisam process to redraw legislative districts?\n\nA: The companion to term limits is Fair Maps. I drafted a Fair Maps Amendment citizen initiative that presented a legally rock-solid way to upend the corrupt system of partisan mapping in Illinois.\n\nUnfortunately, every few years, you see cynical attempts by electorally vulnerable Democrats to file fair maps amendments, knowing full well these efforts will never see the light of day.\n\nWe saw it in 2016 when then-Rep. Jack Franks was allowed to bring his amendment to the House Floor (where it garnered 105 votes), with the understanding that the Senate would not take it up.\n\nAnd we saw Ms. Costa Howard do the same thing this year, filing another dead-on-arrival amendment just two months before the deadline.\n\nThe media, private industry, and good-government groups should coalesce behind a citizen initiative that meets the requirements of the Illinois Constitution, to avoid the partisan logjam in the General Assembly. My Fair Maps Amendment is one way to do that, but any system would be better than the current one.\n\nQ: The graduated income tax is designed with the intent to reduce taxes for 97 percent of Illinoisans. Do you believe that will happen? Why or why not? What assurances can be given to voters?\n\nA: I stand firmly against the graduated income tax hike. We're in recovery mode. Consumers and small businesses will be a huge part of that. Taking more money away from them isn't the way to encourage growth.\n\nBut Terra Costa Howard, after promising the people of this district she'd oppose the graduated tax hike, turned around and voted for it. There is almost NO savings for anyone with this proposal. In my experience in the General Assembly, I saw up close the amount of wasteful spending and poor fiscal policy in our state. Budgets passed always exceeded anticipated income, and even income numbers were artificially inflated as part of an obscene effort to call these budgets \"balanced.\"\n\nIn a state with an insatiable appetite for spending, feeding more taxpayer dollars is not the solution. There are numerous programs which are simply routinely re-appropriated, without careful assessment of effectiveness or necessity. Before anyone asks an Illinois taxpayer for a single penny more, there should be a full accounting of all of the money this state already raises through every tax and fee we already levy.\n\nQ: Describe at least two circumstances in which you have shown or would show a willingness and capacity to act independently of the direction or demands of party leadership.\n\nA: In my two terms in the General Assembly, I shepherded 32 bills into law as Chief House Sponsor -- more than any other second-term legislator, Republican or Democrat. That's required me to work across the aisle on a regular basis, on a variety of issues and areas of law.\n\nI stood against my party on some significant issues, as well. One of the biggest was opposing an unbalanced budget that spent $39.7 billion, at least $1.2 billion more than we had funds available. I'm serious about fiscal reform and responsibility, and our state constitution requires a balanced budget. The Democrat majority refused to even consider a spending bill that lived within our means, and the people of Illinois suffered, and continue to suffer, the consequences of that action with more and more debt. As well, when the governor from my party broke his promise to Illinoisans not to spend precious taxpayer dollars on elective abortions, I opposed him, directly and publicly, not with a press release issued from my basement but with a full downtown media conference that you saw on the evening news. While I'm still a Republican, folks in our area appreciate my strong Independent streak.\n\nQ: How would you rate the governor's handling of the COVID-19 crisis? Does the legislature need to have more input and influence in establishing rules and policies related to stemming the spread of the disease? What would you have done differently, if anything? If nothing, please say so.\n\nA: The rating for Pritzker has to be \"Incomplete,\" since we are still midway through the pandemic. Next year we'll know the impact of the governor's orders on the physical, mental, and economic health of our residents versus those of neighboring states.\n\nThe legislature hid in the basement and shirked its duty to lead, to what should be its eternal shame: having one man run Illinois unilaterally for half a year violates our system of checks and balances.\n\nGoing forward, we need a full review of the high infections and deaths in long-term-care facilities -- we don't know whether this was due to the governor's actions, or some other cause.\n\nDuPage should never have been \"zoned\" with Cook County for phasing openings. And it was wrong to ban small family retailers from in-person sales of their products, while large retailers could sell those same products.\n\nPritzker botched unemployment insurance, leaving the jobless with no one to answer the phone, trying to navigate a broken website, and suffering the indignity of their personal identification details put on the internet. Thousands of government employees across Illinois were at home who would have been glad to handle unemployment phone lines.\n\nQ: Regardless of whether the federal government provides assistance, what is the impact of the pandemic on the state's economic outlook and what immediate and long-term actions should be taken to address it? Would you support increasing taxes to pay for COVID-19 response or to make up for lost revenue related to COVID-19?\n\nA: The last thing our state government needs is yet another special reason to tax residents. Our state may have been the most ill-prepared state in the country with literally no emergency fund and unpaid bills and liabilities that are beyond comparison.\n\nGiven we are still dealing with the pandemic and our businesses are still severely restricted in many cases, we can't even assess the economic cost of the pandemic. As businesses come on line in the recovery, we should do everything we possibly can to provide incentives for growth and productivity.\n\nOur best chance at economic recovery is more people working and paying taxes and companies maximizing their productivity and sales. This legislature has been content in normal times to pass out of balance budgets that spend billions more than available. Every other state is prioritizing and figuring out how to deal with reduced revenue, pandemic or not. The General Assembly needs to do the same. There's already a huge tax increase on the ballot, with a new discussion on taxing retirement income. It's time for responsible fiscal policy that doesn't conclude that every revenue issue is solved by socking it to Illinois taxpayers.\n\nQ: Should Illinois prohibit lawmakers from lobbying other levels of government? Should lawmakers be prohibited from becoming lobbyists after their term in office? For how long?\n\nA: Yes, of course. You can't serve two masters: a legislator is supposed to be dedicated to the service of the people, not special interest groups. Legislators should be banned from lobbying for the longest time allowed under the Constitution. Whether that's 10 years, or 5 years, or 2 years, I'm for it.\n\nQ: What should the state do to address the still-growing problems with its key pension programs?\n\nA: Stop ignoring the pension problem is the immediate answer. We've let this wound fester for decades. Pension holidays had become the norm. Lower than anticipated returns on investments made it even worse. And budgets that were cheered, when every sane person knew they were wildly out of balance.\n\nThe only answer to our hundreds of billions in unfunded pension liabilities is to reform the structure of the systems, before they go bankrupt. Reform is possible: Arizona has achieved it, as have numerous other states. Once you reform, then you have to maintain the discipline to pay the bills when they come due.\n\nQ: Protesters have massed in the streets in Chicago and other cities across Illinois for greater social justice and changes in the funding and responsibilities for police. How significant a role does systemic racism play in limiting equal opportunity in Illinois? To the degree that it exists, what should be done about it? What, if any, changes should be made in funding and duties of police?\n\nA: Two domestic terrorists recently tried to blow up the Lombard Police Department. Just a few weeks ago, three Cook County residents with guns broke into homes in Wheaton and Lombard, seeking to rape and murder sleeping residents. I stand firmly for public safety and in support our police officers who face incredible danger, especially in the current environment.\n\nAs for systemic racism, the primary solution is providing a world-class education to all children, no matter their family income or ZIP code. Imagine the impact of a full generation of highly educated, career-ready young people ready to enter the workforce and public life on systemic racism.\n\nUnlike those who want to condemn poor children to terrible schools in Chicago and elsewhere, I've taken the tough votes to get those kids the resources they need. On other policing issues, Illinois is already a leader on reforms: Back in 2015, we banned chokeholds like the one that killed George Floyd this year, along with regulating body cameras, in a bipartisan measure that I supported.\n\nQ: Do you believe climate change is caused by human activity? What steps should state government be taking to address the issue?\n\nA: Obviously, human activities impact the climate. I was proud to support the Future Energy Jobs Act, which made Illinois a national leader in clean energy, brought renewable energy spending that was out of state back to Illinois, and created numerous jobs in clean energy technologies.\n\nWe should be constantly looking for ways to improve our clean energy profile, while maintaining two critical factors: (1.) keep energy prices down for the sake of our residents and our business community who need low-cost electricity and (2.) maintain sources of energy that are rock-solid reliable during bad weather, from polar vortexes to heat waves, so we avoid the blackouts being suffered today by folks in California and Germany.\n\nSometimes the sun doesn't shine and wind turbines don't turn, so you need other technologies to keep the lights on."}, {"url": "https://www.peoplepill.com/people/peter-breen-1/", "page_content": "Peter Breen is a former Republican member of the Illinois House of Representatives who represented the 48th district from 2015 until 2019. The 48th district includes municipalities in DuPage County including all or parts of Lombard, Glen Ellyn, Wheaton, and Lisle.\n\nBreen earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University and his J.D. from the University of Notre Dame. He worked as the Vice President and Senior Counsel of the Thomas More Society. He served as a trustee on the Lombard Village Board and served as Lombard's Acting Village President.\n\nBreen defeated six-term incumbent State Representative Sandra M. Pihos in the Republican primary in March 2014 with 56% of the vote. He won the general election against a write-in candidate with about 91% of the vote according to preliminary election results. In 2018, Breen lost reelection to Terra Costa Howard in a year that saw numerous suburban Republicans lose at the polls."}, {"url": "https://www.cbsnews.com/chicago/news/terra-costa-howard-attacks-rep-peter-breens-pro-life-views/", "page_content": "CHICAGO (CBS) -- Democrats like State Representative nominee Terra Costa Howard are choosing abortion as a key issue in the fight. Representative Peter Breen is one of the strongest pro-life voices in Springfield and a top republican lawmaker. CBS 2's Political Reporter Derrick Blakley reports Rep. Breen is under assault from pro-choice democrats who want to take him out.\n\nState Representative Peter Breen says he knows why democrats have targeted him for defeat.\n\n\"This district is one that very much rejected President Trump and went strongly for Mrs. Clinton in the last general election,\" stated Rep. Peter Breen (R-Lombard.)\n\nDemocrats have chosen abortion as the key issue in the fight.\n\n\"He wants it to be illegal for a woman to have an abortion, even in the cases of rape and incest,\" said Terra Costa Howard (D), nominee for State Representative.\n\nThat is the only issue Breen's opponent, former school board member Terra Costa Howard, would talk about.\n\n\"Voters are concerned about tax levels, their jobs. They're concerned about family and friends leaving the state,\" said Breen.\n\nBreen's the top GOP floor leader in the Illinois House. His pro-life views are well known. He led a lawsuit to overturn Gov. Rauner's approval of Medicaid abortions.\n\nTuesday, rape survivors came together to blast Breen's opposition to abortion.\n\nRape survivor Jenny Goodman stated, \"We are not pro-abortion, but we feel abortion must be a choice and adoption must be a choice and parenting must be a choice for us, and us alone.\"\n\nBreen said, \"If my opponent wants to run on her support for taxpayer funded abortion, as the primary issue in the race, she is going to lose and I'm going to win and win handily.\"\n\nWith House Speaker Mike Madigan assisting Terra Costa Howard, Breen concedes he'll be outspent, perhaps two to one.\n\nBreen insists he survived the last blue wave in 2016 and believes he will do it again."}, {"url": "https://peoplepill.com/people/peter-breen-2/", "page_content": "Peter James Breen (born 4 November 1947) is a former Australian politician. He was a solicitor before entering politics, achieving a Diploma of Law from Sydney University. He was originally a member of the Liberal Party, serving as President of the Campbelltown Young Liberals 1971-1972. From 1995-1998 he was Secretary of the Australian Bill of Rights Group, and in 1998 joined Reform the Legal System. In the 1999 New South Wales election he was elected to the Legislative Council.\n\nBreen joined the Australian Labor Party on 5 May 2006, but resigned on 18 July to form the Human Rights Party. He unsuccessfully contested the 2007 New South Wales state election.\n\nIn 2014 Breen became an adviser to Senator Ricky Muir of the Australian Motoring Enthusiast Party but was sacked on 5 August 2014. He has campaigned over an alleged miscarriage of justice in the conviction of Stephen Wayne 'Shorty' Jamieson for the 1988 murder of Janine Balding.\n\nIn 2016, Breen was a key person in the Renewable Energy Party and candidate for the Australian Senate to represent New South Wales in the Australian federal election."}, {"url": "https://miltongop.org/breen", "page_content": "In November 2018, Breen lost a tight reelection in the midst of the national “Blue Wave,” with House Speaker Michael Madigan spending over $2 Million against Breen, outspending Breen’s underdog campaign roughly 3 to 1. Breen concluded his two terms with 32 bills passed into law, more than any other second term legislator. His bills saved small businesses and nonprofits millions, protected seniors from having their estates raided by scammers, and shined a bright spotlight on the activities and spending of Illinois’ many thousands of units of government. He enjoyed consistently high marks for his support of small businesses, manufacturing and technology jobs, lower taxes and balanced budgets, a healthier environment, craft brewers and organic farmers, transparency and openness, and personal freedoms.\n\nPeter founded a local not-for-profit, mobilizing hundreds of volunteers who have since served thousands of pregnant women in need and their children in the counties of DuPage and Will. In 2008, Peter joined the Thomas More Society, a national not-for-profit law firm that focuses on the defense of First Amendment rights. As Vice President and Senior Counsel for the Society, Peter represents churches, organizations, and individuals in state and federal courts across the country, and he regularly advises state and federal elected officials on the effects of proposed legislation.\n\nPeter served as an elected Trustee on the Lombard Village Board from 2011-2014, stepping in as Lombard’s Acting Village President in 2012-13. One of his first initiatives as a trustee was authoring and securing passage of the strongest municipal transparency policy in the state of Illinois, earning Lombard a rare 100% transparency rating from the Illinois Policy Institute. When he took over as Acting Village President, Peter initiated a line-by-line review of the Village’s proposed 2013 annual budget, identifying and cutting over half a million dollars in spending without the loss of Village services. He then ensured that those savings were returned to Lombard taxpayers by permanently eliminating the Village’s annual vehicle sticker and fee. The next year, Peter led a successful fight to freeze property taxes in the Lilac Village, which was the first property tax relief residents experienced in 20 years.\n\nIn 2009, Peter founded “BanRedCams,” a grassroots initiative that sought to ban unfair and punitive red light cameras in Lombard and surrounding communities. Lombard removed its cameras shortly thereafter. As a Village Trustee, Peter successfully worked to prevent garnishment of residents’ state tax refunds to pay red light camera ticket fees.\n\nPeter earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University, completing the program in just 3 years. Peter earned his Juris Doctor from the University of Notre Dame, which he attended on scholarship. He is a member of the Father Boecker Council of the Knights of Columbus and is an Eagle Scout. Peter and his wife Margie have been married for 14 years, and they are the proud parents of two sons, Matthew Elijah, whom they adopted in August 2016, and James Francis, whom they adopted in September 2018."}], "Peter Breen served as a member of the Illinois House of Representatives from the 48th district from 2013 to 2019.": [{"url": "https://ilga.gov/house/Rep.asp?MemberID=2454", "page_content": "×\n\nThe Illinois General Assembly offers the Google Translate™ service for visitor convenience. In no way should it be considered accurate as to the translation of any content herein.\n\nVisitors of the Illinois General Assembly website are encouraged to use other translation services available on the internet.\n\nThe English language version is always the official and authoritative version of this website.\n\nNOTE: To return to the original English language version, select the \"Show Original\" button on the Google Translate™ menu bar at the top of the window."}, {"url": "https://ballotpedia.org/Peter_Breen", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://ilga.gov/house/Rep.asp?MemberID=2264", "page_content": "×\n\nThe Illinois General Assembly offers the Google Translate™ service for visitor convenience. In no way should it be considered accurate as to the translation of any content herein.\n\nVisitors of the Illinois General Assembly website are encouraged to use other translation services available on the internet.\n\nThe English language version is always the official and authoritative version of this website.\n\nNOTE: To return to the original English language version, select the \"Show Original\" button on the Google Translate™ menu bar at the top of the window."}, {"url": "https://chicago.suntimes.com/2020/9/7/21425118/peter-breen-illinois-house-rep-48th-district-republican-nominee-candidate-2020-election-profile", "page_content": "Candidate profile\n\nPeter Breen\n\nRunning for: State Representative 48th District\n\nPolitical party affiliation: Republican\n\nPolitical/civic background: Served as Trustee/Acting Village President, Village of Lombard. Served 2 terms in the Illinois General Assembly, including as GOP Floor Leader.\n\nOccupation: Constitutional Attorney, specializing in First Amendment cases in federal and state courts across the country.\n\nEducation: Top 10, Naperville North HS; B.E., Electrical Eng., Vanderbilt University (earned in 3 years); J.D., University of Notre Dame (ND Law Scholarship)\n\nCampaign website:http://www.votebreen.com/\n\nFacebook:https://www.facebook.com/votebreen/\n\nElection Guide - Full Guide 2020 Election Voting Guide This article is part of our Illinois 2020 election voting guide. Click here to see more.\n\n\n\nThe Chicago Sun-Times Editorial Board sent nominees for the Illinois House of Representatives a list of questions to find out their views on a range of important issues facing the state of Illinois and their districts. Peter Breen submitted the following responses:\n\n1. The COVID-19 pandemic has hammered the finances of Illinois. The state is staring at a $6.2 billion budget shortfall in this fiscal year. What should be done? Please be specific.\n\nThe pandemic highlighted the historical short-sightedness of the General Assembly. We went into this horrific situation with absolutely NO money in a “rainy day fund.” Further, for over a decade, the General Assembly knowingly passed underfunded budgets using every accounting scheme imaginable. Even when we had higher than anticipated tax receipts in the state, as the result of a very positive economy, we didn’t save but spent every dime and more. Then the virus came and devastated business, personal income, taxes and user fees, etc. While the economy is beginning to rebound, Illinois must become far more proactive in helping grow small and midsize businesses, instead of again hiking crippling taxes to meet the voracious appetite for out-of-control spending in Springfield.\n\n2. What grade — “A” to “F” — would you give Gov. J.B. Pritzker for his handling of the coronavirus pandemic? Please explain. What, if anything, should he have done differently?\n\nThe grade has to be “Incomplete,” since we are still midway through the pandemic. We won’t know the impact of the governor’s lockdown and pandemic orders until at least next year: then, we can see the full results of these policies on the physical, mental, and economic health of our residents versus those of neighboring states.\n\nBefore the pandemic, Illinois imposed the worst tax burden on its residents of any state in the country, along with being known as a notoriously bad place to start, build, or bring a business. Gov. Pritzker then imposed one of the most severe lockdowns in the country. Predictably, Illinois residents have not recovered their jobs and businesses as quickly as folks in other states. Even with the lockdown, Illinoisans experienced worse physical health impacts from COVID than neighboring states.\n\nWe need a full post-COVID review of why we suffered such high infections and deaths in long-term-care facilities. Without that review, we won’t know whether this was due to the governor’s actions or inactions, or some other cause.\n\nFrom the beginning, I’ve advocated against including my county of DuPage in a “zone” with Cook County in terms of phasing openings and policies. That penalized and handicapped our ability to move more quickly to recovery.\n\nAnd it was wrong to ban small family retailers from in-person sales of their products, while large retailers could sell those same products.\n\nFinally, the Pritzker Administration entirely botched unemployment insurance, leaving the jobless with no one to answer the phone, trying to navigate a broken website, and suffering the indignity of their personal identification details put on the internet. With tens of thousands of government employees across Illinois at home, there were plenty of people who could have manned unemployment phone lines during this unprecedented crisis.\n\n3. In the wake of the death of George Floyd in Minneapolis, legislatures in some states have taken up the issue of police reform. Should Illinois do the same? If so, what would that look like?\n\nEveryone was horrified by the tragic circumstances surrounding the needless death of George Floyd. It was inexcusable on every level. There are clearly agencies and departments that require more and better training of officers and a clear set of policies to prevent such a tragic result ever again. That officer in Minneapolis was acting outside of guidelines and deserves to be punished for his crimes. Our agencies are better than this, particularly in DuPage County.\n\nIn Illinois, I backed the bipartisan Police and Community Relations Improvement Act, which banned chokeholds, put standards in place for officer-involved deaths, and improved training requirements, among other reforms. While due to this Act, Illinois already has in place many of the reforms other states are now reviewing, we should always be looking at any and every helpful reform that protects the public and gives our agencies the ability to perform professionally in maintaining the law. As a Village Trustee, I was also a strong supporter of body cameras to protect both the public and police officers in altercations. This was at a time when there was significant resistance to these devices.\n\n4. Should the Legislature pass a law requiring all law enforcement officers to wear body cameras? Why or why not?\n\nAbsolutely. It protects both citizens and law enforcement. It can and does act as a deterrent for both parties. I would immediately sponsor or co-sponsor such a bill.\n\n5. Federal prosecutors have revealed a comprehensive scheme of bribery, ghost jobs and favoritism in subcontracting by ComEd to influence the actions of House Speaker Michael Madigan. Who’s to blame? What ethics reforms should follow? Should Madigan resign?\n\nTerra Costa Howard, and enablers like her, are to blame. During the 2018 elections, Costa Howard promised the residents of the 48th District that she would be independent of Mike Madigan, but then she turned around and took $1.5 million in campaign contributions from him (more than any other state legislative candidate) and voted for him for Illinois House Speaker. Terra Costa Howard handed our vote—and our voice—to a crook and a thief.\n\nEven today, Costa Howard still refuses to return one dime of all the dirty money she’s taken—and she is still raking in money from Madigan-controlled campaign committees.\n\nMadigan has run state government as a pay-to-play scheme for decades. The monied interest groups pay into his campaign committees and hire his preferred lobbyists, guaranteeing them a seat at the legislative table. If you don’t have money or the right lobbyist, you lose.\n\nAnd he’s done this in plain sight, with increasing numbers of Illinoisans watching in horror, but unable to stop it. When reform-minded candidates like me step forward to run in competitive districts, they get hit with multi-million-dollar smear campaigns, executed by the Madigan machine’s sophisticated political operation. Even post-Madigan, this won’t change unless we elect new leaders clean of the taint of Madigan and his machine.\n\nOn Madigan, I called for his resignation last year. While in the House, I opposed Madigan for Speaker twice.\n\nOn reforms, we need term limits. We have a part-time citizen legislature, and term limits will strengthen the temporary nature of legislative service. There are a raft of additional reforms in this vein: bans on lobbying after legislating, strengthening lobbyist disclosure requirements, limits on legislative leaders, taking power away from legislative leaders and returning it to members, and putting teeth into laws prohibiting conflicts of interest by legislators, among others. Reform should be an “all-of-the-above” approach.\n\n6. Please tell us about your civic work in the last two years, whether it’s legislation you have sponsored or work you have done in other ways to improve your community.\n\nMy wife and I were blessed to be able to adopt our second son two years ago, literally a week before the last election. We’re very committed to our community and blessed to raise a family here.\n\nDuring COVID, I’ve been active running food drives that collected thousands of pounds of food and thousands of dollars for our local St. Vincent De Paul Societies. I’ve also been handling requests from local residents who weren’t able to get help from the Costa Howard district office. And I’ve been putting out informational Facebook Live videos that have received tens of thousands of views, on a variety of topics of interest to our district.\n\nAt the end of last year, after our community suffered a spate of over-valuations on local properties, I put on multiple emergency property tax seminars, along with working directly with residents, to help folks get their assessments and taxes lowered. Ms. Costa Howard was not responsive to the needs of these residents, who are literally being taxed out of their homes.\n\nIn my professional capacity, I’ve worked hard to assist churches to be able to open safely, with precautions, to enjoy the status that other “essential places” have had. My wife and I also participate with both time and treasure to many of the civic organizations in my community.\n\n7. Please list three concerns that are specific to your district, such as a project that should be undertaken or a state policy related to an important local issue that should be revised.\n\nThe people and businesses of our district are burdened the most by out-of-control spending and taxes, onerous mandates on businesses and local governments, and rampant corruption. We can’t recover quickly and fully from COVID while suffering under these burdens.\n\nYet all of them have been made worse by Terra Costa Howard: she supported unbalanced budgets, new mandates on local businesses, and voted for Madigan for House Speaker. Costa Howard told voters during her 2018 campaign that she’d be for “fiscal responsibility” and “small business,” but once she got to Springfield, her voting record was the exact opposite.\n\nCosta Howard even voted against a proposal to stop the conflicts of interest in General Assembly members, like Mike Madigan, writing the property tax laws and then raking in millions doing property tax appeals. The Chicago City Council banned that practice, in response to the Ed Burke prosecution, but Costa Howard rejected reform and stood with Madigan.\n\nFor our district, I’ve succeeded in securing relief when state action was required. Whether it was securing IDOT approval for the new Mariano’s on Roosevelt Rd in Lombard; helping a local nonprofit, SCARCE, with a law allowing it to collect cooking grease and oil; or changing state law to allow Noon Whistle Brewing to use innovative “360-lid” technology (allowing removal of nearly all the top of a beverage can, making it more like a cup), I got the job done.\n\n8. What are your other top legislative priorities?\n\nToo many Illinoisans feel they must uproot and leave the state they call home. We are now at six straight years of losing residents to other states, losing over 100,000 people net in just the past two years. Every person who leaves takes their hopes and dreams and contributions with them, pulling vitality and energy away from Illinois.\n\nAnd the latest data shows we’re not just losing seniors—it’s prime working-age residents who are leading the exodus. Residents are taxed out of their homes, or are just tired of supporting a state government they see as disconnected and corrupt. Students are heading to college out of state, never to return. Families are packing up for places with more and better paying jobs.\n\nThe solutions are not easy, but they are simple. Lower the tax burden on our residents and businesses—both income taxes and property taxes have to come down. Stop out-of-control spending at the state level, which is driving tax and fee increases. Embrace reform measures like Fair Maps and Term Limits, to ensure we have citizen legislators representing whole communities, not sliced up narrow groups of partisans. Our broken state government is the primary obstacle standing in the way of turning our state around.\n\n9. What is your position on Gov. J.B. Pritzker’s proposed graduated income tax? Please explain.\n\nI stand firmly against the graduated income tax. My greatest reason comes from my experience in the General Assembly, where I saw first-hand the amount of wasteful spending and poor fiscal policy being implemented in the state. The budgets passed always exceeded our anticipated income, and even those income numbers were artificially inflated as part of an obscene effort to call these budgets “balanced.” They never were. In a state with an insatiable appetite for spending, feeding more hard-earned taxpayer money into that corrupt process is not the solution.\n\nOur entire budgeting process should be overhauled, a zero-based budget starting with a clean slate. There are numerous programs which are simply routinely re-appropriated, without careful assessment of effectiveness or necessity. They often become silos of money for discretionary spending, and they are rife for corruption. Before anyone asks an Illinois taxpayer for a single penny more, there should be an absolutely full accounting of all of the money this state already raises through every tax and fee we already levy. We’re in recovery mode. Consumers will be a huge part of that. Taking away more money isn’t the way to encourage growth.\n\n10. Illinois continues to struggle financially, with a backlog of unpaid bills. In addition to a progressive state income tax — or in lieu of such a tax — what should the state do to pay its bills, meet its pension obligations and fund core services such as higher education?\n\nAs stated before, this state needs to re-examine every dollar we are spending now. Illinois should do what any entity should do when they are spending more than they take in: reform, and spend less.\n\nIllinois government needs to innovate with a view to 2030, not 1830. Advancements in technology should lead to lower expense, not greater, but there’s never a solution proposed in this state that doesn’t include a tax hike. That’s the first and only solution ever considered.\n\nThere also needs to be a very serious and fair discussion with relation to pension funds. These have become an eternal issue with no solvent funding solution in place. I lose sleep over the fact that these funds won’t be there for people who have been made promises that are fiscally impossible to keep. I believe that before we can solve this problem, we have to stop the bleeding first. There are some measures with the tier system that have helped a little bit, but are still inadequate. For everyone’s sake, including pensioners who deserve security and certainty, a fair, equitable set of agreements to tackle this dire issue over a reasonable period of time is the only realistic solution.\n\nAs for “core services”, we need to narrowly define them and fund them properly. This area of funding suffers more than any other as they don’t enjoy the auto-reappropriation so many other elements of the state budget do. The whole budget needs to be re-imagined and re-examined starting with a fresh balance sheet.\n\n11. Should Illinois consider taxing the retirement incomes of its very wealthiest residents, as most states do? And your argument is?\n\nThere aren’t many incentives to remaining an Illinoisan. The policy of not taxing retirement income is among the few incentives any resident of Illinois has to stay here. If we were to selectively consider taxing retirement income, who would decide who is wealthy? Who would decide the rates? Who would decide when those rates should change, because Illinois still continues to spend more than it takes in? We know who. The same General Assembly that put us in the fiscal morass we’re stuck in. Who would trust them to make those decisions? To make my answer clear: No, Illinois should not consider this.\n\n12. What can Illinois do to improve its elementary and high schools?\n\nIllinois schools spend double the national average on administration—we have to move that money back to the classroom. And the state imposes numerous unfunded mandates that hike costs for local school districts.\n\nI put forward a bill to cap administrative spending at the national average, which would free up hundreds of millions of dollars for classroom needs and property tax relief. Whether this efficiency is achieved by consolidating districts or sharing administrative costs, this is a huge sum of money being wasted in our state.\n\nWhen I review our standards, I believe they’re high enough, but we’re not meeting them. There needs to be more accountability for doing so. We are in a financial crisis in this state that affects everyone, including school districts. It very much affects the families sending these students to schools. The funding of schools has experienced years of band-aid approaches, special legislation and a completely non-comprehensive approach.\n\nAt present, we’re not even sure if schools are going to open this school year or how. I’m a public high school graduate. I was fortunate to get an outstanding education and go on to very strong universities with that foundation. I don’t believe that is the case for many of our students today.\n\nThe only way to truly improve schools is by actively reforming our education policy, cognizant of the needs of the various regions of the state, and with the full participation of all of the stakeholders in the process. That simply hasn’t been done. There are too many golden calves, resulting in winners and losers with every partial-reform effort enacted. Too often the losers were a set of students in one part or the state or the other, or worse, everywhere. Educators are smart people by nature and experience. This is a solvable problem.\n\n13. Mass shootings and gun violence plague America. What can or should the Legislature do, if anything, to address this problem in Illinois?\n\nWe’ve had selected success and failure with this issue in Illinois. It’s both heart-breaking and frustrating to see our state on the national news every night reporting the most recent tally of shootings and killings in Chicago. The city has some of the strictest gun laws in the country, and despite that, there are no shortage of guns or tragic carnage there. The General Assembly has also already tightened gun regulations to be some of the toughest in the country.\n\nThe other side of the equation is policing and prosecuting those misusing firearms. For instance, I have worked closely with our DuPage State’s Attorney, Bob Berlin, on a variety of legislative measures, including enhancing penalties for those who commit crimes and then jump bail. Historically, DuPage has seen as much as 50% of felonies committed by individuals from outside the county, so laws like this one would give our prosecutors the tools they need to discourage crime locally.\n\n14. Do you favor or oppose term limits for any elected official in Illinois? Please explain.\n\nI am in favor of term limits. Legislators do need enough time to become effective and not let the permanent establishment of staff operate the government. In the State of Illinois, with the way legislative maps are gerrymandered, elections do not serve the function as term limits as it was intended. I believe strongly in a Citizen Legislature for a carefully prescribed period of service.\n\nThere’s no reason a statewide official should serve more than 2 terms (8 years). And 8-10 years for Legislators in the State Senate or General Assembly is plenty. Controlled, centralized power for too long of a period is a recipe for corruption: we are watching this play out on our television screens as more and more long-serving members of the Illinois General Assembly are charged with various federal crimes.\n\n15. Everybody says gerrymandering is bad, but the party in power in every state — Democrats in Illinois — resist doing anything about it. Or do we have that wrong? What should be done?\n\nYou have it right. It is bad. Fortunately, more and more, the people of Illinois view gerrymandering to be unconstitutional and wrong. I drafted and championed a Fair Maps Amendment, presented as a citizen initiative, because of the block put on Fair Maps by the Democratic Party of Illinois. (We had over 10,000 signatures gathered, before being abruptly halted by the coronavirus.)\n\nEvery few years, you see cynical attempts by electorally vulnerable Democrats to file fair maps amendments, knowing full well these efforts will never see the light of day. We saw it in 2016 when then-Rep. Jack Franks was allowed to bring his amendment to the House Floor (where it garnered 105 votes), with the understanding that the Senate would not take it up. And we saw Ms. Costa Howard do the same thing this year, filing another dead-on-arrival amendment just two months before the deadline.\n\nWhat should be done? The media, private industry, and good-government groups should coalesce behind a citizen initiative that meets the requirements of the Illinois Constitution. My Fair Maps Amendment is one legally rock-solid way to meet those stringent requirements. Any system would be better than the current one.\n\n16. The U.S. attorney’s office in Chicago is investigating possible official corruption by state and local officials. This prompted the Legislature to pass an ethics reform measure to amend the Lobbyist Registration Act (SB 1639). It was signed into law in December. What’s your take on this and what more should be done?\n\nAs I noted previously, we need an all-of-the-above approach to ethics reform, starting with term limits. There are plenty of ideas out there, and if we need more, we can look to the many other states that are known for clean government, like Iowa and Wisconsin.\n\n17. When people use the internet and wireless devices, companies collect data about us. Oftentimes, the information is sold to other companies, which can use it to track our movements or invade our privacy in other ways. When companies share this data, we also face a greater risk of identity theft. What should the Legislature do, if anything?\n\nIllinois currently has some of the toughest laws in the country around information privacy. Even so, we can always be open to addressing the privacy challenges presented by tech advancements. For instance, the issues relating to Tik Tok and its undisclosed scraping of user data may present areas for us to legislate in Illinois, if the federal government does not act.\n\nThe General Assembly is severely lacking in the experience necessary to meet the challenges presented by emerging technology: I bring unique training and experience in computer science and telecommunications to bear on these issues. Voices like mine are missing from the General Assembly.\n\n18. The number of Illinois public high school graduates who enroll in out-of-state universities continues to climb. What can Illinois do to make its state universities more attractive to Illinois high school students?\n\nEvery Illinoisan deserves the opportunity to attend college or a trade school, and to graduate without debt. A big reason people leave Illinois for out of state institutions is the cost of education here. We are not as competitive as other state university systems. In my district, many students choose universities in Indiana, Iowa, or Missouri, instead of staying here. With few financial incentives available, U of I is also difficult for many of our best students to attend. Other states have aggressively recruited in Illinois and provided financing, to cherry pick our best students.\n\nParents also have a role in how students make these choices. They want what’s best for their children, and because of the problems afflicting Illinois, many parents urge their kids to go elsewhere. Illinois needs to live up to the standard that “anything is possible” to pursue and prosper here. This is another area where our state’s horrible fiscal condition is negatively affecting us. All this adds up to students choosing less expensive, top-flight schools in other states, with better fiscal management and opportunity.\n\n19. What is your top legislative priority with respect to the environment?\n\nI’m a husband and father of 2 little boys. Clean air and clean water are our most important environmental considerations. I am proud to have been one of the few Republicans regularly rated 100% by the Illinois Environmental Council.\n\nAs well, being the only person with an Electrical Engineering background in the General Assembly, I repeatedly worked with environmental groups to responsibly move Illinois to low- and zero-emissions energy. Illinois is recognized as a national leader in the field today, due to our efforts on that front.\n\n20. What historical figure from Illinois, other than Abraham Lincoln (because everybody’s big on Abe), do you most admire or draw inspiration from? Please explain.\n\nI’d choose the “Great Communicator,” Ronald Reagan, since I can’t pick Abraham Lincoln. Growing up, we knew President Reagan as a calm, upbeat presence for our country. He fought hard for his principles, but he united folks across partisan lines and was focused on getting things done. We could use more leaders like him today.\n\n21. What’s your favorite TV, streaming or web-based show of all time. Why?\n\nAll-time would probably be Doctor Who. Some seasons are better than others, but the fact that the whole main cast changes every few years keeps up the variety of the show. You get something to latch onto with each crew. The show is wickedly funny and creative, and often bends your brain.\n\n"}, {"url": "https://www.ice-pac.com/peter-breen/", "page_content": "Peter Breen served two terms as State Representative from 2015-2019, including as Republican Floor Leader from 2017-2019, a role where he served as the lead debater on all bills that reached the Floor of the Illinois House. In 2014, Peter mounted an underdog campaign to unseat a popular six-term incumbent Republican in the primary election, closing a 25-point margin and eventually securing a 14-point victory. In November 2014, he would go on to become the first resident of the Village of Lombard in 140 years to be elected to the General Assembly.\n\nIn November 2018, Breen lost a tight reelection in the midst of the national “Blue Wave,” with House Speaker Michael Madigan spending over $2 Million against Breen, outspending Breen’s underdog campaign roughly 3 to 1. Breen concluded his two terms with 32 bills passed into law, more than any other second term legislator. His bills saved small businesses and nonprofits millions, protected seniors from having their estates raided by scammers, and shined a bright spotlight on the activities and spending of Illinois’ many thousands of units of government. He enjoyed consistently high marks for his support of small businesses, manufacturing and technology jobs, lower taxes and balanced budgets, a healthier environment, craft brewers and organic farmers, transparency and openness, and free speech and personal freedoms.\n\nAn attorney by training, Peter left a lucrative private law practice in Chicago in 2004 to enter full-time public service. One year later, Peter founded a local not-for-profit, mobilizing hundreds of volunteers who have since served thousands of pregnant women in need and their children in DuPage and Will counties. He spearheaded the Chicagoland Project Gabriel campaign, which distributed tens of thousands of “Pregnant? Need Help?” bumper stickers throughout local churches to reach out to women in difficult and untimely pregnancies. In 2008, Peter joined the Thomas More Society, a national not-for-profit law firm that focuses on the defense of First Amendment rights. As Vice President and Senior Counsel for the Society, Peter represents churches, organizations, and individuals in state and federal courts across the country, and he regularly advises state and federal elected officials on the effects of proposed legislation. Peter is sought out by local and national television, radio, and print media as an expert legal analyst.\n\nPeter served as an elected Trustee on the Lombard Village Board from 2011-2014, stepping in as Lombard’s Acting Village President in 2012-13. One of his first initiatives as a trustee was authoring and securing passage of the strongest municipal transparency policy in the state of Illinois, earning Lombard a rare 100% transparency rating from the Illinois Policy Institute. When he took over as Acting Village President, Peter initiated a line-by-line review of the Village’s proposed 2013 annual budget, identifying and cutting over half a million dollars in spending without the loss of Village services. He then ensured that those savings were returned to Lombard taxpayers by permanently eliminating the Village’s annual vehicle sticker and fee. The next year, Peter led a successful fight to freeze property taxes in the Lilac Village, which was the first property tax relief residents experienced in 20 years.\n\nDuring his time as Trustee, Peter served as Chairperson of the Lombard Economic & Community Development Committee. Under Peter’s leadership, the Committee took on numerous initiatives to help downtown Lombard and to improve the business climate generally in the village. He sponsored and worked to pass the Lombard “outdoor dining” program, rolling back unnecessary regulations to allow new outdoor dining options in the downtown area. He also started downtown Lombard’s “Outdoor Game Watches,” bringing in hundreds of new patrons to shop at local businesses. In order to encourage lower prices for taxi service and to allow Lombard-based livery businesses to grow, Peter rewrote the Lombard Taxi Ordinance to wipe away outdated regulations and to allow a wider variety of vehicles to service residents’ transport needs.\n\nIn 2009, Peter founded “BanRedCams,” a grassroots initiative that sought to ban unfair and punitive red light cameras in Lombard and surrounding communities. Lombard removed its cameras shortly thereafter. As a Village Trustee, Peter successfully worked to prevent garnishment of residents’ state tax refunds to pay red light camera ticket fees.\n\nIn 2019, Peter began the Fair Maps Initiative to remove the redistricting power from Michael Madigan. This initiative would give voters the opportunity to pass a referendum in the 2020 November elections to amend the Illinois Constitution. If passed, redistricting would be put into the hands of a bipartisan commission, ending gerrymandering in Illinois. The goal is to give more residents in Illinois a voice when choosing representatives.\n\nPeter earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University, completing the program in just 3 years. Peter earned his Juris Doctor from the University of Notre Dame, which he attended on scholarship. He is a member of the Father Boecker Council of the Knights of Columbus and is an Eagle Scout. Peter and his wife Margie have been married for 14 years, and they are the proud parents of two sons, Matthew Elijah, whom they adopted in August 2016, and James Francis, whom they adopted in September 2018.\n\nsource: VoteBreen.com"}, {"url": "https://www.dailyherald.com/news/20201006/peter-breen-candidate-profile-illinois-house-48th-district", "page_content": "Peter Breen: Candidate profile, Illinois House, 48th District\n\nIn the race for Illinois House from District 48, Terra Costa Howard, a one-term incumbent Democrat from Glen Ellyn, is facing a rematch with Republican Peter Breen of Lombard, whom she ousted from this House seat in 2018.\n\nBreen, an attorney, served two terms as the state representative from 2015-2019, including as Republican Floor Leader from 2017-2019. He is vice president and senior counsel for the Thomas More Society, a nonprofit, national public interest law firm. He is a former Lombard village trustee from 2011 to 2014, stepping in as Lombard's acting village president in 2012-13.\n\nTo explore his campaign website, visit votebreen.com.\n\nThe 48th District includes Glen Ellyn, Lombard and parts of Wheaton and Lisle.\n\nThe Daily Herald asked the candidates a series of questions. Here are Breen's responses.\n\nQ: Should Speaker Madigan resign from his leadership positions? If he does not resign, will you support him for a new term as House speaker?\n\nA: I called for Madigan to resign after it was disclosed earlier this year that his chief lobbyist, Mike McClain, protected a Madigan operative for covering up the rape of a child in Champaign.\n\nThat was the latest in a string of sexual misconduct by high-level operatives in the Madigan machine.\n\nMcClain personally backed Terra Costa Howard in the 2018 election cycle, and according to November 2019 reporting, he ran a \"secret project\" to fund the campaigns of his preferred House Democrats during the critical closing weeks of the 2018 cycle.\n\nCosta Howard did nothing about her supporter McClain's rape cover-up, or about any of the other sexual misconduct. She stuck with the Madigan machine through it all. And she's still taking his money and the support of his machine. No one who knows Illinois politics was surprised by the corrupt conduct detailed in the ComEd prosecution.\n\nMadigan has run state government as a pay-to-play scheme for decades. Every Republican in the legislature has demanded he step down, but the Democrats have lashed themselves to his mast. They deserve to go down with his ship. Some would say \"they stayed loyal.\" I'd say, \"they stayed bought.\"\n\nQ: What are the most important components that should be included in legislative ethics reform? What will you do to help them come to pass?\n\nA: We should start with term limits. Whether it's Mike Madigan or disgraced legislators like Louis Arroyo, Martin Sandoval, or Terry Link (and many others), term limits would likely have prevented their crimes.\n\nTerm limits ensure we have a part-time citizen legislature, as our Illinois Constitution calls for. With term limits, the Illinois General Assembly becomes less appealing for those who are corrupt coming in, and a short period of service hopefully ushers out those who are corruptible before they can \"break bad.\"\n\nEither way, with a brief time in office, you have to get your work done quickly, because you'll soon be back in private life. As to the myriad other ethics proposals out there, and we should take an \"all-of-the-above\" approach.\n\nSadly, there is also a great need for reform for personal ethics as well, with regard to personal behavior. Every manner of bad behavior is tolerated and covered up in Springfield, leaving far too many victims in its wake. I've been willing to sponsor this kind of legislation and will continue. I will sponsor, support vocally, and vote for any real reform bill that gets filed.\n\nQ: What should the General Assembly do to improve the state's unemployment benefits system?\n\nA: Our technology is so far out of date in Illinois that we couldn't even distribute federal money to Illinois residents.\n\nAdding to the problem of a website that couldn't handle the traffic were phones not being answered within the agency itself. With so many state employees at home on account of the virus, it's beyond imagination how there could not have been more support for millions of state residents who were suddenly in great need.\n\nTechnology can be upgraded quickly. Why this hasn't been done in so many years is inexcusable.\n\nI'm certain I'd be told it was a financial issue. The high cost of human involvement (state jobs) is many times more costly than technology upgrades. And when it came to humans; they weren't at work. Many state Reps and state Senators couldn't reach anyone in the agency to get any answers for constituents or for themselves. Residents couldn't get through and didn't receive any calls back if they somehow did get an opportunity to leave a message. This is by far the easiest fixable question on this entire survey. The philosophy of state government has to change drastically. Illinoisans pay a great deal of money for service. They deserve to get some.\n\nQ: Should Illinois use a non-partisam process to redraw legislative districts?\n\nA: The companion to term limits is Fair Maps. I drafted a Fair Maps Amendment citizen initiative that presented a legally rock-solid way to upend the corrupt system of partisan mapping in Illinois.\n\nUnfortunately, every few years, you see cynical attempts by electorally vulnerable Democrats to file fair maps amendments, knowing full well these efforts will never see the light of day.\n\nWe saw it in 2016 when then-Rep. Jack Franks was allowed to bring his amendment to the House Floor (where it garnered 105 votes), with the understanding that the Senate would not take it up.\n\nAnd we saw Ms. Costa Howard do the same thing this year, filing another dead-on-arrival amendment just two months before the deadline.\n\nThe media, private industry, and good-government groups should coalesce behind a citizen initiative that meets the requirements of the Illinois Constitution, to avoid the partisan logjam in the General Assembly. My Fair Maps Amendment is one way to do that, but any system would be better than the current one.\n\nQ: The graduated income tax is designed with the intent to reduce taxes for 97 percent of Illinoisans. Do you believe that will happen? Why or why not? What assurances can be given to voters?\n\nA: I stand firmly against the graduated income tax hike. We're in recovery mode. Consumers and small businesses will be a huge part of that. Taking more money away from them isn't the way to encourage growth.\n\nBut Terra Costa Howard, after promising the people of this district she'd oppose the graduated tax hike, turned around and voted for it. There is almost NO savings for anyone with this proposal. In my experience in the General Assembly, I saw up close the amount of wasteful spending and poor fiscal policy in our state. Budgets passed always exceeded anticipated income, and even income numbers were artificially inflated as part of an obscene effort to call these budgets \"balanced.\"\n\nIn a state with an insatiable appetite for spending, feeding more taxpayer dollars is not the solution. There are numerous programs which are simply routinely re-appropriated, without careful assessment of effectiveness or necessity. Before anyone asks an Illinois taxpayer for a single penny more, there should be a full accounting of all of the money this state already raises through every tax and fee we already levy.\n\nQ: Describe at least two circumstances in which you have shown or would show a willingness and capacity to act independently of the direction or demands of party leadership.\n\nA: In my two terms in the General Assembly, I shepherded 32 bills into law as Chief House Sponsor -- more than any other second-term legislator, Republican or Democrat. That's required me to work across the aisle on a regular basis, on a variety of issues and areas of law.\n\nI stood against my party on some significant issues, as well. One of the biggest was opposing an unbalanced budget that spent $39.7 billion, at least $1.2 billion more than we had funds available. I'm serious about fiscal reform and responsibility, and our state constitution requires a balanced budget. The Democrat majority refused to even consider a spending bill that lived within our means, and the people of Illinois suffered, and continue to suffer, the consequences of that action with more and more debt. As well, when the governor from my party broke his promise to Illinoisans not to spend precious taxpayer dollars on elective abortions, I opposed him, directly and publicly, not with a press release issued from my basement but with a full downtown media conference that you saw on the evening news. While I'm still a Republican, folks in our area appreciate my strong Independent streak.\n\nQ: How would you rate the governor's handling of the COVID-19 crisis? Does the legislature need to have more input and influence in establishing rules and policies related to stemming the spread of the disease? What would you have done differently, if anything? If nothing, please say so.\n\nA: The rating for Pritzker has to be \"Incomplete,\" since we are still midway through the pandemic. Next year we'll know the impact of the governor's orders on the physical, mental, and economic health of our residents versus those of neighboring states.\n\nThe legislature hid in the basement and shirked its duty to lead, to what should be its eternal shame: having one man run Illinois unilaterally for half a year violates our system of checks and balances.\n\nGoing forward, we need a full review of the high infections and deaths in long-term-care facilities -- we don't know whether this was due to the governor's actions, or some other cause.\n\nDuPage should never have been \"zoned\" with Cook County for phasing openings. And it was wrong to ban small family retailers from in-person sales of their products, while large retailers could sell those same products.\n\nPritzker botched unemployment insurance, leaving the jobless with no one to answer the phone, trying to navigate a broken website, and suffering the indignity of their personal identification details put on the internet. Thousands of government employees across Illinois were at home who would have been glad to handle unemployment phone lines.\n\nQ: Regardless of whether the federal government provides assistance, what is the impact of the pandemic on the state's economic outlook and what immediate and long-term actions should be taken to address it? Would you support increasing taxes to pay for COVID-19 response or to make up for lost revenue related to COVID-19?\n\nA: The last thing our state government needs is yet another special reason to tax residents. Our state may have been the most ill-prepared state in the country with literally no emergency fund and unpaid bills and liabilities that are beyond comparison.\n\nGiven we are still dealing with the pandemic and our businesses are still severely restricted in many cases, we can't even assess the economic cost of the pandemic. As businesses come on line in the recovery, we should do everything we possibly can to provide incentives for growth and productivity.\n\nOur best chance at economic recovery is more people working and paying taxes and companies maximizing their productivity and sales. This legislature has been content in normal times to pass out of balance budgets that spend billions more than available. Every other state is prioritizing and figuring out how to deal with reduced revenue, pandemic or not. The General Assembly needs to do the same. There's already a huge tax increase on the ballot, with a new discussion on taxing retirement income. It's time for responsible fiscal policy that doesn't conclude that every revenue issue is solved by socking it to Illinois taxpayers.\n\nQ: Should Illinois prohibit lawmakers from lobbying other levels of government? Should lawmakers be prohibited from becoming lobbyists after their term in office? For how long?\n\nA: Yes, of course. You can't serve two masters: a legislator is supposed to be dedicated to the service of the people, not special interest groups. Legislators should be banned from lobbying for the longest time allowed under the Constitution. Whether that's 10 years, or 5 years, or 2 years, I'm for it.\n\nQ: What should the state do to address the still-growing problems with its key pension programs?\n\nA: Stop ignoring the pension problem is the immediate answer. We've let this wound fester for decades. Pension holidays had become the norm. Lower than anticipated returns on investments made it even worse. And budgets that were cheered, when every sane person knew they were wildly out of balance.\n\nThe only answer to our hundreds of billions in unfunded pension liabilities is to reform the structure of the systems, before they go bankrupt. Reform is possible: Arizona has achieved it, as have numerous other states. Once you reform, then you have to maintain the discipline to pay the bills when they come due.\n\nQ: Protesters have massed in the streets in Chicago and other cities across Illinois for greater social justice and changes in the funding and responsibilities for police. How significant a role does systemic racism play in limiting equal opportunity in Illinois? To the degree that it exists, what should be done about it? What, if any, changes should be made in funding and duties of police?\n\nA: Two domestic terrorists recently tried to blow up the Lombard Police Department. Just a few weeks ago, three Cook County residents with guns broke into homes in Wheaton and Lombard, seeking to rape and murder sleeping residents. I stand firmly for public safety and in support our police officers who face incredible danger, especially in the current environment.\n\nAs for systemic racism, the primary solution is providing a world-class education to all children, no matter their family income or ZIP code. Imagine the impact of a full generation of highly educated, career-ready young people ready to enter the workforce and public life on systemic racism.\n\nUnlike those who want to condemn poor children to terrible schools in Chicago and elsewhere, I've taken the tough votes to get those kids the resources they need. On other policing issues, Illinois is already a leader on reforms: Back in 2015, we banned chokeholds like the one that killed George Floyd this year, along with regulating body cameras, in a bipartisan measure that I supported.\n\nQ: Do you believe climate change is caused by human activity? What steps should state government be taking to address the issue?\n\nA: Obviously, human activities impact the climate. I was proud to support the Future Energy Jobs Act, which made Illinois a national leader in clean energy, brought renewable energy spending that was out of state back to Illinois, and created numerous jobs in clean energy technologies.\n\nWe should be constantly looking for ways to improve our clean energy profile, while maintaining two critical factors: (1.) keep energy prices down for the sake of our residents and our business community who need low-cost electricity and (2.) maintain sources of energy that are rock-solid reliable during bad weather, from polar vortexes to heat waves, so we avoid the blackouts being suffered today by folks in California and Germany.\n\nSometimes the sun doesn't shine and wind turbines don't turn, so you need other technologies to keep the lights on."}, {"url": "https://www.peoplepill.com/people/peter-breen-1/", "page_content": "Peter Breen is a former Republican member of the Illinois House of Representatives who represented the 48th district from 2015 until 2019. The 48th district includes municipalities in DuPage County including all or parts of Lombard, Glen Ellyn, Wheaton, and Lisle.\n\nBreen earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University and his J.D. from the University of Notre Dame. He worked as the Vice President and Senior Counsel of the Thomas More Society. He served as a trustee on the Lombard Village Board and served as Lombard's Acting Village President.\n\nBreen defeated six-term incumbent State Representative Sandra M. Pihos in the Republican primary in March 2014 with 56% of the vote. He won the general election against a write-in candidate with about 91% of the vote according to preliminary election results. In 2018, Breen lost reelection to Terra Costa Howard in a year that saw numerous suburban Republicans lose at the polls."}, {"url": "https://alchetron.com/Peter-Breen-(Illinois-politician)", "page_content": "Peter Breen is a Republican member of the Illinois House of Representatives who represents the 48th district. The 48th district includes municipalities in DuPage County including all or parts of Lombard, Glen Ellyn and Lisle.\n\nContents\n\nBreen earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University and his J.D. from the University of Notre Dame. He worked as the Vice President and Senior Counsel of the Thomas More Society. He served as a trustee on the Lombard Village Board and served as Lombard's Acting Village President.\n\nBreen defeated six-term incumbent State Representative Sandra M. Pihos in the Republican primary in March 2014 with 56% of the vote. He won the general election against a write-in candidate with about 91% of the vote according to preliminary election results."}, {"url": "https://chicago.suntimes.com/2018/10/21/18423343/illinois-house-48th-district-republican-nominee-peter-breen", "page_content": "Republican Peter Breen is the Sun-Times’ endorsed candidate in the 48th district race in the Illinois House. Breen faces Democrat Terra Costa Howard in the general election.\n\nThe Chicago Sun-Times sent the candidates seeking nominations for the Illinois House of Representatives a list of questions to find out their views on a range of important issues facing the state of Illinois.\n\nThese are the answers Breen submitted to our questionnaire.\n\nPlease explain what cause or causes you will make priorities.\n\nBreen: Too many Illinoisans feel they must uproot and leave the state they call home. Senior citizens are taxed out of their homes, or are just tired of supporting a state government they see as disconnected and corrupt. Students are heading to college out of state, never to return. Families are packing up for places with more and better paying jobs.\n\nThe solutions are not easy, but they are simple. Lower the tax burden on our residents and businesses—both income taxes and property taxes have to come down. Stop out-of-control spending at the state level, which is driving tax and fee increases. Embrace reform measures like Fair Maps, to ensure that legislators represent whole communities, not sliced up narrow groups of partisans. Our broken state government is the primary obstacle standing in the way of turning our state around.\n\nPlease list three concerns that are highly specific to your district, such as a project that should be undertaken or a state policy related to some local issue that must be changed.\n\nBreen: The latest studies indicate that, for every tax dollar the residents of DuPage County send to Springfield, only 31 cents come back. That’s a lot of money sent to Springfield, with very little to show for it.\n\nFor our district, when we identify a local issue that requires some action by the state, I’ve usually able to secure those changes. For instance, I was able to work with Sen. Chris Nybo and others on getting IDOT approval to bring in the new Mariano’s on Roosevelt Rd in Lombard. He and I also successfully sponsored a bill to allow a local nonprofit, SCARCE, collect cooking grease and oil, which had been prohibited under state law. And when a popular local microbrewery, Noon Whistle, were prohibited by state law from using innovative “360-lid” technology (allowing removal of nearly all the top of a beverage can, making it more like a cup), I drafted the bill to get that changed.\n\nThe people and businesses of our district are burdened the most by out-of-control spending and tax increases, onerous mandates on businesses and local governments, and excessive debt, all caused by past mostly Democrat-led majorities of the General Assembly.\n\nWho is Peter Breen?\n\nHis legislative District: 48th Representative District His political/civic background: State Representative, 2015-present, Floor Leader, 2017-present Trustee, 2011-2014, & Acting President, 2012-2013, Village of Lombard His occupation: Constitutional Attorney & State Representative His education: Juris Doctor, University of Notre Dame Bachelor of Engineering, Electrical Engineering, Vanderbilt University Diploma, Naperville North High School Campaign website: votebreen.com\n\nWhat are the most important differences between you and your opponent?\n\nBreen: I’ve been an independent advocate for the people of my district during my two terms in the Illinois House. There’s no person or group that can claim to “own” me.\n\nHowever, my opponent is almost entirely funded by House Speaker Mike Madigan and his political operation. She’s staffed with his people. She uses the talking points his people provide her.\n\nMy opponent sat on a school board for 8 years, and she voted to increase property taxes every single year, including during the worst depths of the Great Recession. She even broke ties several years to raise property taxes. And those were large increases, some years as high as 12% or 15%, well more than the rate of inflation. My opponent raises taxes, and she has zero credibility in addressing the massive property tax problem plaguing our state.\n\nI’ve repeatedly voted to freeze property taxes, and I support reducing and capping them. This isn’t new for me: while on the Lombard Village Board, I secured a freeze, the first property tax relief the people of the Lilac Village had experienced in 20 years. I also led the effort as Acting Village President to cut half a million dollars from our annual budget, with no loss of services, and return the money to the people by permanently eliminating the village vehicle sticker. If you drive in Lombard, you might see some folks still have a sticker on their car–that’s from 2012-2013, the final year of that most-despised fee.\n\nFinally, my opponent has pointed to abortion either as the primary reason she decided to run against me or the only issue she would discuss in interviews with reporters. That sort of single-issue focus doesn’t fit our district, and it isn’t the reason Illinois state government is broke and bankrupt either. On abortion, my opponent supports taxpayer funding of elective abortions, while I do not believe tax dollars should be used for elective abortions. But I’m focused cleaning up the fiscal mess in Springfield and shining a bright light on the special interests who have taken hold of so much of Illinois government, at all levels.\n\nIllinois is now the sixth-most populated state, down from No. 5, after 33,703 people moved out between July 2016 and July 2017. What must the Legislature do to make Illinois a more desirable place to live?\n\nBreen: We should be terribly alarmed by our population loss. Our consumer base is powerful. But as we lose residents, the corporate and business base follows them out of state. Our start-up businesses, our education opportunities, and employment opportunities will all suffer. Reversing the trend means making Illinois a more hospitable place to live, with regard to our taxing policy, and a better place to start, expand, and run a business.\n\nOur border state neighbors take full advantage of our poor policies with regard to property taxes, sales taxes, fees, and regulations. When a huge corporation chooses a location a few miles north in Kenosha County, it takes advantage of our highly skilled, highly educated work force, but another state realizes the lion’s share of the benefits of that corporation. Many residents will move a few miles to take even greater advantage of lower tax policies overall, and a lower cost of living. This scenario continues to happen to Illinois.\n\nWe have to lower the tax burden. Create policy that offers businesses a long-term vision of an Illinois that is hospitable to them and their growth. These are things that could happen quickly with the right governance. The reasons for not doing so are utterly selfish and self-dealing government policies. It’s not too late yet, but we are absolutely on the verge of passing a point where it is.\n\nIn 2017, our state’s unfunded pension liability ballooned to more than $130 billion. What’s to be done about that?\n\nBreen: The General Assembly refuses to grapple with substantive pension reform. The Illinois Democrats rely heavily on government employee unions for campaign workers and dollars, and those government unions have taken a hard line against any pension reform. And the many government workers in downstate districts have firmly instructed their legislators, “don’t touch our pensions.” But these attitudes have us hurtling toward a future where our (clearly unsustainable) pension liabilities can’t be paid. The problem stems from politicians over-promising pension benefits, mainly in the 1980’s and 1990’s, leading to a 1000% increase in liability over the past 30 years.\n\nThe General Assembly should do everything possible to stem the tide of increasing pension liabilities. We should immediately convene a Blue Ribbon Commission, bringing together the top legal and economic experts, to lay out every option possibly available to us. That should lead into the broadest possible public, statewide debate on this crisis. Since Illinois politicians either refuse or feel they can’t address this issue, avenues should be explored to put the matter directly to the People.\n\nFrom 2000 to 2016, the number of Illinois residents who enrolled as college freshmen outside the state increased by 73% (20,507 to 35,445). Why are so many more Illinois residents going to college elsewhere? What should be done to encourage more of them to go to school here?\n\nBreen: The causes for our college decline are both short-term and long-term. First off, we’re not competitive enough in the short-term for the students looking at schools. Our kids who in years past would attend an Illinois school are headed out of state for a variety of immediate reasons, including because they got a better financial package or because they felt the programs offered by an out-of-state school would better meet their educational aims.\n\nA review of the data from the past few years shows that, for each of our state universities, the Illinois state government spends more money per pupil than nearly any other competing institution–and at the same time, our schools charge a higher tuition per student than their competing schools! This imbalance, where we’re pumping in more tax dollars but still charging more than competing schools, needs to be addressed openly and honestly.\n\nThe long-term issues relate to the desire of families and businesses to stay here. If families don’t see a future for themselves in Illinois, why would their kids bother attending school in-state? If there are more and better jobs elsewhere, why stay? We have to fix our broader governmental problems before we will stem the long-term tide of students leaving.\n\nWhat laws, if any, should the Legislature pass to address the problem of gun violence?\n\nBreen: This term, I worked with Rep. Kathy Willis (D-Addison) to craft the state’s new Firearms Restraining Order law, which provides a mechanism to get guns out of the hands of provably dangerous individuals. That law is a significant step forward to addressing the issue of gun violence. I’ve also supported the licensing of firearms dealers, to stop the illegal flow of guns into the hands of criminals, and increased penalties on those who commit crimes with guns.\n\nOn-demand scheduling software now helps large retail companies determine how many staff members they will need on a day-to-day or even hour-to-hour basis. The downside is that employees may not receive their work schedules until the last minute. Oregon and a number of cities have responded by adopting “fair scheduling” laws. Would it be appropriate for the Illinois\n\nLegislature to pass a “fair scheduling” law? Please explain. What would such a law look like?\n\nBreen: At this point, we need to focus on reducing the burdens on businesses, and especially those facing small businesses, and help them create jobs and economic growth. In reviewing any regulation, my first question is “what are our competing states doing?”–that means reviewing the policies of the states that are now home to former Illinois businesses.\n\nShould recreational marijuana be legalized in Illinois? Please explain.\n\nBreen: The law enforcement community is strongly against a full-scale legalization and commercialization of recreational marijuana, and their concerns should be thoroughly investigated, discussed, and analyzed before legalization is considered.\n\nOpioid overdoses and fatalities continue to rise in number. In Illinois in 2017, there were 13,395 opioid overdoses, including 2,110 deaths. What should the Legislature do, if anything, about this?\n\nBreen: Opioid abuse has destroyed families and taken too many of our loved ones. I’m in favor of an all-of-the-above approach on this subject, whether in looking at alternatives to opioids, education campaigns, and law enforcement and criminal justice reforms, among others.\n\nThe Future Energy Jobs Act, passed in 2016, is generating job growth in renewable energy and improving energy efficiency. Do you agree or disagree with the objectives and substance of the Act? What more — or less — should be done?\n\nBreen: I supported the Future Energy Jobs Act, and I was recognized this year by the Illinois Environmental Council with a 100% rating for my support of legislation protecting our environment. The Act appears to be working, but due to its complexity, it’s taken a while to fully implement. There will inevitably be bumps in the road, which the General Assembly should monitor and intervene to address if necessary.\n\nWhat would you do to ensure the long-term viability of the state’s Medicaid program? What is your view on managed care for Medicaid beneficiaries?\n\nBreen: Every state has different ways of providing care for those on Medicaid, so as we look at reforms, there are myriad examples to draw upon. Whether you’re looking at managed care, or some form of individual savings accounts, or some of the innovative new medical practice models sweeping the country, let’s take an honest look. The point is to get the best care possible at the best price, and if there are better ways to achieve that goal, we should assess them.\n\nUnderfunding at the Department of Corrections has led to troubling findings by the auditor general that many inmates don’t receive services or opportunities for work while incarcerated. Is this a legitimate concern? What should the Legislature do?\n\nBreen: One of the purposes of prison is reformative, to provide the support necessary to the individual to be a productive member of society upon release. Whatever we need to do to bring that about, we should do. Work skills are absolutely critical to this–without those skills, you can’t get and keep a job. If folks who have been in prison can find good jobs after release, the incentives to commit crimes in the future obviously go way down.\n\nShould the state restore the practice of parole for people sentenced to long terms? Why or why not?\n\nBreen: At this time, with the terrible violence plaguing our communities, we need to first focus on protecting innocent folks across our state who are at risk of grave harm. The victims need to be our top priority.\n\nAhead of the historic 2018 elections, the Sun-Times is teaming up weekly with the Better Government Association, in print and online, to fact-check the truthfulness of the candidates. You can find all of the PolitiFact Illinois stories we’ve reported together here.\n\nRELATED\n\n• ENDORSEMENT: Peter Breen for Illinois House in the 48th District\n\n• Endorsements for 16 Illinois House races in the Chicago area, Districts 15 through 50\n\n• Endorsements for 17 Illinois House races in the Chicago area, Districts 51 through 98\n\n• Illinois Senate endorsements for the Chicago area\n\n"}, {"url": "https://miltongop.org/breen", "page_content": "In November 2018, Breen lost a tight reelection in the midst of the national “Blue Wave,” with House Speaker Michael Madigan spending over $2 Million against Breen, outspending Breen’s underdog campaign roughly 3 to 1. Breen concluded his two terms with 32 bills passed into law, more than any other second term legislator. His bills saved small businesses and nonprofits millions, protected seniors from having their estates raided by scammers, and shined a bright spotlight on the activities and spending of Illinois’ many thousands of units of government. He enjoyed consistently high marks for his support of small businesses, manufacturing and technology jobs, lower taxes and balanced budgets, a healthier environment, craft brewers and organic farmers, transparency and openness, and personal freedoms.\n\nPeter founded a local not-for-profit, mobilizing hundreds of volunteers who have since served thousands of pregnant women in need and their children in the counties of DuPage and Will. In 2008, Peter joined the Thomas More Society, a national not-for-profit law firm that focuses on the defense of First Amendment rights. As Vice President and Senior Counsel for the Society, Peter represents churches, organizations, and individuals in state and federal courts across the country, and he regularly advises state and federal elected officials on the effects of proposed legislation.\n\nPeter served as an elected Trustee on the Lombard Village Board from 2011-2014, stepping in as Lombard’s Acting Village President in 2012-13. One of his first initiatives as a trustee was authoring and securing passage of the strongest municipal transparency policy in the state of Illinois, earning Lombard a rare 100% transparency rating from the Illinois Policy Institute. When he took over as Acting Village President, Peter initiated a line-by-line review of the Village’s proposed 2013 annual budget, identifying and cutting over half a million dollars in spending without the loss of Village services. He then ensured that those savings were returned to Lombard taxpayers by permanently eliminating the Village’s annual vehicle sticker and fee. The next year, Peter led a successful fight to freeze property taxes in the Lilac Village, which was the first property tax relief residents experienced in 20 years.\n\nIn 2009, Peter founded “BanRedCams,” a grassroots initiative that sought to ban unfair and punitive red light cameras in Lombard and surrounding communities. Lombard removed its cameras shortly thereafter. As a Village Trustee, Peter successfully worked to prevent garnishment of residents’ state tax refunds to pay red light camera ticket fees.\n\nPeter earned his Bachelor of Engineering in Electrical Engineering from Vanderbilt University, completing the program in just 3 years. Peter earned his Juris Doctor from the University of Notre Dame, which he attended on scholarship. He is a member of the Father Boecker Council of the Knights of Columbus and is an Eagle Scout. Peter and his wife Margie have been married for 14 years, and they are the proud parents of two sons, Matthew Elijah, whom they adopted in August 2016, and James Francis, whom they adopted in September 2018."}]}