{"Breen was first elected to the Illinois House of Representatives in 2012.": [{"url": "https://ballotpedia.org/Peter_Breen", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://www.history.com/topics/us-states/illinois", "page_content": "Located on Lake Michigan, and connected to the eastern ports via the Erie Canal , Chicago became a booming metropolis, and even the fire of 1871 could not stunt its growth. In the second half of the 19th century, the great need for workers in the mills, rail yards and slaughterhouses made Chicago a popular destination for immigrants and freed Blacks. During Prohibition , Chicago became synonymous with bootleg liquor and gangsters like Al Capone .\n\nFrench explorers Louis Jolliet and Jacques Marquette were the first Europeans to visit Illinois in 1673. The region was ceded to Britain following the French and Indian War . After the American Revolution , Illinois became a territory of the United States and achieved statehood in 1818.\n\nIllinois Native American History\n\nThe first people arrived in the area now known as Illinois an estimated 12,000 years ago. These nomadic hunter-gatherers eventually organized into many different tribes, including the Sauk, Mesquakie, Potawatomi, Kickapoo and Winnebago. The state is named after the Illiniwek Nation, who were called the Illinois by the French. The Illiniwek Nation was originally comprised of 12 smaller tribes, including the Cahokia, Peoria and Kaskaskia.\n\nWhen the first Europeans arrived in Illinois in the late 1600s, there were more than 10,000 Indigenous people living in the area. Over time, most of these tribes merged with other tribes or disappeared. Many died of smallpox and other diseases and warfare with enemy tribes, including the Siouan and Dakota (Sioux) tribes, who often allied with European colonists and American settlers. By the 1700s, there were only a handful of tribes left in Illinois.\n\nIn the late 1700s, a growing number of white American settlers in the Ohio river valley displaced Native American tribes. The Black Hawk War was the last major Native American resistance to these settlements. Sauk leader Black Hawk and his tribe, who were expelled from Illinois in 1831, returned the following year and were attacked by an American militia. When they fought back, the United States sent in army troops. Most of the Sauk fighters were killed, and Black Hawk surrendered.\n\nWith President Andrew Jackson’s signing of the Indian Removal Act in 1832, the remaining Indigenous people ceded their last claims to Illinois land. The Kaskaskia and Peoria tribes left Illinois and settled on a joint reservation in modern-day eastern Kansas. In 1854, the tribes merged again with the Wea and Piankashaw tribes to become the Confederated Peoria Tribe. In 1867, the group moved to “Indian territory” in modern-day Oklahoma.\n\nToday there are no federally-recognized Native American tribes in Illinois, although Indigenous people from over 100 tribal nations continue to live in the state. The descendants of the Illiniwek (Illinois) Nation are known as the Peoria Indian Tribe of Oklahoma.\n\nFrench Colonization of Illinois\n\nThe first Europeans to set foot in Illinois were explorers Father Jacques Marquette and Louis Jolliet, who claimed the territory for France in 1673 and founded a Jesuit mission two years later at Starved Rock. The French colony of Canada initially governed the Illinois territory. In 1680, French Jesuit René-Robert Cavelier de la Salle built a mission near present-day Peoria, and in 1691 the Starved Rock settlers moved their mission to Peoria.\n\nIn 1699, a small group of French settlers from Canada created Cahokia, Illinois. It was the first permanent settlement on the Mississippi River, which they coveted in order to control trade and travel all the way down to the Gulf of Mexico. After Kaskaskia was established in 1703, the colony started trading with Louisiana, and French settlers began arriving from New Orleans. The governance of Illinois passed from Canada to Louisiana in 1718, and in 1719 the center of Illinois governance was founded at Fort de Chartres.\n\nBritish Colony to American State\n\nAfter the British victory in the French and Indian War in 1763, France passed Illinois and other lands east of the Mississippi to the British with the Treaty of Paris. French settlers in Illinois began leaving for settlements in Spanish St. Louis and French New Orleans. The Kaskaskia and Peoria Native American tribes, who had been allies with the French, resisted the transfer and held off British soldiers until they eventually took over Fort de Chartres in 1765. The British destroyed the fort in 1772, and more French fled the area around the outbreak of the Revolutionary War.\n\nIn 1778, American troops claimed Illinois and made the territory a county of Virginia, and American settlers began arriving the following year. The U.S. federal government took over the territory of Illinois in 1784. In 1786 it was declared as part of the Northwest Territory by the Northwest Ordinance, then part of Indiana Territory in 1800.\n\nOn December 3, 1818, Illinois became the 21st state admitted to the Union. In the 1800s, the state was populated by American migrants and immigrants from Germany, Ireland, England, Canada, Scotland and France.\n\nThroughout the 17th and 18th centuries, people were kidnapped from the continent of Africa, forced into slavery in the American colonies and exploited to work as indentured servants and laborers in the production of crops. Shown are iron shackles used on enslaved people prior to 1860. Shown is a chart showing the packed positioning of enslaved people on a ship from 1786.READ MORE: The Last Slave Ship Survivor Gave an Interview in the 1930s. It Just Surfaced In late August 1619, the White Lion sailed into Point Comfort and dropped anchor in the James River.Virginia colonist John Rolfe documented the arrival of the ship and “20 and odd” Africans on board. History textbooks immortalized his journal entry, with 1619 often used as a reference point for teaching the origins of slavery in America. READ MORE: America's History of Slavery Began Long Before Jamestown Shown is an iron mask and collar used by slaveholders to keep field workers from running away and to prevent them from eating crops such as sugarcane, circa 1750. The mask made breathing difficult and, if left on too long, would tear at the person's skin when removed. The first U.S. president, George Washington, owned enslaved people, along with many of the presidents who followed him. Thomas Jefferson, author of the Declaration of Independence and the third president of the United States, was born on a large Virginia estate run on slave labor. His marriage to the wealthy Martha Wayles Skelton more than doubled his property in land and enslaved people. This is a portrait of Isaac Jefferson, enslaved by Jefferson, circa 1847. READ MORE: Why Thomas Jefferson's Anti-Slavery Passage Was Removed from the Declaration of Independence The slave auction was the epitome of slavery's dehumanization. Enslaved people were sold to the person who bid the most money, and family members were often split-up.READ MORE: Married Enslaved People Often Faced Wrenching Separations Broadside advertising an auction outside of Brooke and Hubbard Auctioneers office, Richmond, Virginia, July 23, 1823. An enslaved Black male youth is shown in this photo from the 1850s, holding his white master’s child. From left to right: William, Lucinda, Fannie (seated on lap), Mary (in cradle), Frances (standing), Martha, Julia (behind Martha), Harriet, and Charles or Marshall, circa 1861.The women and their children were enslaved at the time this photograph was taken on a plantation just west of Alexandria, Virginia, that belonged to Felix Richards. Frances and her children were enslaved by Felix, while Lucinda and her children were enslaved by his wife, Amelia Macrae Richards. By the start of the American Civil War, the South was producing 75 percent of the world’s cotton and creating more millionaires per capita in the Mississippi River valley than anywhere in the nation. Shown are enslaved people working on sweet potato planting at Hopkinson's Plantation in April 1862.READ MORE: How Slavery Became the Economic Engine of the South Enslaved people in the antebellum South constituted about one-third of the southern population. A formerly enslaved man from Louisiana, whose forehead was branded with the initials of his owner, is shown wearing a punishment collar in 1863. Despite the horrors of slavery, it was no easy decision to flee. Escaping often involved leaving behind family and heading into the complete unknown, where harsh weather and lack of food might await. Shown are two unidentified men who escaped slavery, circa 1861. A man named Peter, who had escaped slavery, reveals his scarred back at a medical examination in Baton Rouge, Louisiana, while joining the Union Army in 1863.READ MORE: The Shocking Photo of 'Whipped Peter' That Made Slavery's Brutality Impossible to Deny Confederate soldiers rounding up Black people in a church during the American Civil War, Nashville, Tennesee, the 1860s. The Emancipation Proclamation, issued on January 1, 1863, established that all enslaved people in Confederate states in rebellion against the Union “shall be then, thenceforward, and forever free.” But for many enslaved people, emancipation took longer to take effect. Shown are a group of enslaved people outside their quarters on a plantation on Cockspur Island, Georgia, circa 1863.READ MORE: What Is Juneteenth? 1 / 16 : Collection of the Smithsonian National Museum of African American History and Culture\n\nSlavery and Abraham Lincoln\n\nThe French brought the first slaves to Illinois in the early 1700s. When Illinois became part of the Northwest Territory in 1786, the Northwest Ordinance banned slavery in the state. Some Illinois slaveholders interpreted the Ordinance to mean no new slaves could be brought into the area, and they kept the slaves they already had. When the state entered the Union in 1818, the federal government required it to do so as a “free state.” However, Illinois included “black codes” in its first constitution. Preexisting slave owners were also allowed to keep their slaves, and all residents could have indentured servants. The slave population continued to increase. Although Illinois banned slavery within its own borders beginning in 1848, slaves were still found in the state until 1863.\n\nIllinois also had its share of abolitionists. In 1830, politician Abraham Lincoln moved to the state with his family near present-day Decatur. In 1831, he moved to New Salem, and in 1834 he was elected to the Illinois General Assembly. Three years later, he moved to Springfield, where he lived for most of the rest of his life.\n\nIn 1846, Lincoln was elected to the United States House of Representatives for Illinois, and in 1849 he proposed banning slavery in Washington, D.C. Lincoln ran for United States Senate in 1855, lost, and ran again in 1858. At the time, the 1857 Supreme Court decision in the Dredd Scott case banned slaves and descendants of slaves from citizenship and pitted northern free states against southern slaveholding states. A mostly unfamiliar candidate, Lincoln engaged with incumbent Democratic Senator Stephen A. Douglas in a series of debates throughout Illinois. Although Lincoln lost the race, his “House Divided” speech—where he warned against a nation divided between free and slave-holding states—drew the nation's attention. Just two years later, in 1860, Lincoln was elected president—and pro-slavery states soon began seceding from the Union.\n\nDespite some pro-secessionist sentiment in the southern part of the state, Illinois remained in the Union during the Civil War. The state was an important supplier of corn, wheat and livestock and more than 250,000 Union soldiers. The Underground Railroad also ran through Illinois beginning in the 1830s, helping slaves escape from Southern states.\n\nCivil Rights Movement\n\nIn 1865, Illinois became the first state to ratify the 13th Amendment to the Constitution, which abolished slavery. Illinois then passed a state law in 1874 forbidding segregation, and the Illinois Civil Rights Act of 1885 banned discrimination in public facilities and venues such as restaurants, hotels, theaters and trains. This allowed for the rise of Black visionaries, such as doctor Daniel Hale Williams, who founded Provident Hospital in 1891 to train Black doctors and serve Black patients and became the first person to perform open heart surgery in 1893.\n\nRacial tensions in Illinois, however, remained high. On August 14, 1908, an angry mob formed outside the city jail in Springfield, seeking revenge against two Black men accused of separate crimes against whites. Policemen escorted the prisoners out the back door to safety, and the violent Springfield Race Riot ensued. Buildings in the Black section of Springfield were destroyed and looted, and two unrelated Black members of the community were lynched. The appalling event led to the formation of the National Association for the Advancement of Colored People (NAACP) a few months later.\n\nFrom 1920 to 1930, Black residents of southern states began moving to northern states, including Illinois, in what became known as the Great Migration. The Black population of Illinois increased by 81 percent during the decade, and many Black people were elected to public office in the state. As early as the 1930s to 1940s, Black Chicago residents staged sit-ins and other protests against segregation and discrimination, so the city was largely integrated by the early 1960s.\n\nHowever, segregation continued in some schools leading to the 1963 “Freedom Day” protest. The struggle culminated in 1966 with the Chicago Freedom Movement, led by Martin Luther King, Jr., which aimed to end housing discrimination and gain equal rights for all Chicago residents. The government eventually agreed to build more public housing in Illinois and open mortgages to people of all races.\n\nThe Windy City\n\nIn the 1800s, Chicago became one of the country’s largest cities in the country, as John Deere, the inventor of the steel plow, and Cyrus Hall McCormick, the creator of the wheat reaper, set up manufacturing plants in the city.\n\nChicago’s status attracted the World’s Columbian Exposition of 1893. The event brought 27 million visitors during its six-month operation—more than 40 percent of the United States’ total population at the time. Among the many inventions exhibited was the first Ferris wheel, made to rival the Eiffel Tower built for the Paris Fair in 1889. The 250-foot diameter wheel carried 36 cars with up to 60 riders each. The fair also introduced some of the first automobile prototypes, the Morrison electric and a German gasoline-powered car, leading to annual auto shows in the city starting in the early 1900s. Although Chicago never quite matched Detroit as the king of the auto industry, it was already well set up as an industrial manufacturer and became a hub for the manufacturing of automotive parts throughout much of the 20th century.\n\nIn the 1920s, Prohibition gave rise to Chicago speakeasies and gangsters. The port city had many poor immigrants looking for opportunities, some of whom went on to become mobsters. Johnny Torrio and Al Capone famously launched some of the nation’s biggest bootlegging, brothels and illegal gambling operations out of Chicago. The subsequent “Beer Wars” of 1922 to 1926, when mobsters battled their rivals and police, led to the death of nearly 500 Chicago mobsters. Many gangsters found more legal businesses when alcohol was legalized in 1933.\n\nChicago remains a major U.S. city and manufacturing center. The city and surrounding area are home to the U.S. headquarters for many major companies, including Walgreens, Boeing, Caterpillar, Abbott Laboratories, McDonald’s and the Kraft Heinz Company, among others. Chicago’s famous Willis Tower, formerly named Sears Tower, was completed in 1973. At 1,450 feet high and 110 stories tall, it’s the second tallest building in North America, after One World Trade Center in New York City.\n\nDate of Statehood: December 3, 1818\n\nCapital: Springfield\n\nPopulation: 12,812,508 (2020)\n\nSize: 57,916 square miles\n\nNickname(s): Prairie State; Land of Lincoln\n\nMotto: State Sovereignty, National Union\n\nTree: White Oak\n\nFlower: Violet\n\nBird: Cardinal\n\nInteresting Facts\n\nWhat began as an ordinary fire in Patrick and Catherine O’Leary’s barn on October 8, 1871, quickly turned into what became known as the Great Chicago Fire, which devastated roughly 18,000 buildings, left close to 100,000 inhabitants homeless and killed between 200 and 300 people.\n\nOn May 4, 1886, after weeks of protests in which workers were demanding an eight-hour workday, a bomb was thrown during a demonstration at the Randolph Street Haymarket. Eight officers were killed and 60 were injured, spurring a public cry for justice. Although the bomber was never identified, eight anarchists were tried and convicted of murder in what is often referred to as a grave miscarriage of justice.\n\nThe Illinois Coal Basin covers 65 percent of the state’s land. Illinois has an estimated 2 billion tons of coal lying underground, 38 million tons of which can be mined economically—giving the state the largest recoverable bituminous coal reserve in the United States.\n\nSources\n\nUnited States Census Bureau, Illinois Quick Facts.\n\nIllinois State Museum, The Arrival of Native Nations (11,700-4,000 years ago).\n\nIllinois State Museum, The Illinois.\n\nIllinois Historic Preservation Agency, The Illini.\n\nIllinois State Museum, The Illinois Decline.\n\nIllinois State Museum, The Illinois Today.\n\nState of Illinois Central Management Services, Native American FY2020 Employment Plan Report.\n\nIllinois Department of Natural Resources, Colonial Era, 1763-1776.\n\nNorthern Illinois University Libraries, Illinois as a French Colony.\n\nIllinois State Museum, French Settlement in the Illinois Country.\n\nIllinois State Museum, Time Line: 1673-1800.\n\nCanadian Museum of History, René-Robert Cavelier de La Salle 1670-1687.\n\nIllinois State Museum, The British (1763-1778).\n\nIllinois State Museum, Early Statehood (1818-1848).\n\nThe Gilder Lehrman Institute of American History, The “House Divided” Speech, ca. 1857–1858.\n\nNational Park Service, Lincoln Chronology.\n\nEncyclopedia of Chicago, Black Hawk War.\n\nIllinois State Museum, Illinois Fights the Civil War.\n\nNational Public Radio, Illinois Issues: Slave State.\n\nNorthern Illinois University Libraries, Politics in Illinois and the Union During the Civil War.\n\nSouthern Illinois University Libraries, The Underground Railroad in Southern Illinois.\n\nNorthern Illinois University Libraries, Foreign Immigrants in Illinois 1850.\n\nEncyclopedia of Chicago, Civil Rights Movements.\n\nNorthern Illinois University Libraries, Springfield Race Riot of 1908.\n\nStanford University, Chicago Campaign.\n\nLibrary of Congress, Illinois Entered the Union as the 21st State, on December 3, 1818.\n\nWillis Tower, History & Facts.\n\nCrain’s Book of Lists 2020, Chicago’s 50 Largest Publicly Traded Companies.\n\nEncyclopedia of Chicago, Automobile Manufacturing.\n\nThe Mob Museum, Prohibition Profits Transformed the Mob.\n\nSierra Club, Coal Mining Basics."}, {"url": "https://ballotpedia.org/Illinois_House_of_Representatives_elections,_2014", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://ilga.gov/house/Rep.asp?MemberID=2454", "page_content": "×\n\nThe Illinois General Assembly offers the Google Translate™ service for visitor convenience. In no way should it be considered accurate as to the translation of any content herein.\n\nVisitors of the Illinois General Assembly website are encouraged to use other translation services available on the internet.\n\nThe English language version is always the official and authoritative version of this website.\n\nNOTE: To return to the original English language version, select the \"Show Original\" button on the Google Translate™ menu bar at the top of the window."}, {"url": "https://ballotpedia.org/Illinois_House_of_Representatives_elections,_2020", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://ilga.gov/house/Rep.asp?MemberID=2264", "page_content": "×\n\nThe Illinois General Assembly offers the Google Translate™ service for visitor convenience. In no way should it be considered accurate as to the translation of any content herein.\n\nVisitors of the Illinois General Assembly website are encouraged to use other translation services available on the internet.\n\nThe English language version is always the official and authoritative version of this website.\n\nNOTE: To return to the original English language version, select the \"Show Original\" button on the Google Translate™ menu bar at the top of the window."}, {"url": "https://chicago.suntimes.com/2020/9/7/21425118/peter-breen-illinois-house-rep-48th-district-republican-nominee-candidate-2020-election-profile", "page_content": "Candidate profile\n\nPeter Breen\n\nRunning for: State Representative 48th District\n\nPolitical party affiliation: Republican\n\nPolitical/civic background: Served as Trustee/Acting Village President, Village of Lombard. Served 2 terms in the Illinois General Assembly, including as GOP Floor Leader.\n\nOccupation: Constitutional Attorney, specializing in First Amendment cases in federal and state courts across the country.\n\nEducation: Top 10, Naperville North HS; B.E., Electrical Eng., Vanderbilt University (earned in 3 years); J.D., University of Notre Dame (ND Law Scholarship)\n\nCampaign website:http://www.votebreen.com/\n\nFacebook:https://www.facebook.com/votebreen/\n\nElection Guide - Full Guide 2020 Election Voting Guide This article is part of our Illinois 2020 election voting guide. Click here to see more.\n\n\n\nThe Chicago Sun-Times Editorial Board sent nominees for the Illinois House of Representatives a list of questions to find out their views on a range of important issues facing the state of Illinois and their districts. Peter Breen submitted the following responses:\n\n1. The COVID-19 pandemic has hammered the finances of Illinois. The state is staring at a $6.2 billion budget shortfall in this fiscal year. What should be done? Please be specific.\n\nThe pandemic highlighted the historical short-sightedness of the General Assembly. We went into this horrific situation with absolutely NO money in a “rainy day fund.” Further, for over a decade, the General Assembly knowingly passed underfunded budgets using every accounting scheme imaginable. Even when we had higher than anticipated tax receipts in the state, as the result of a very positive economy, we didn’t save but spent every dime and more. Then the virus came and devastated business, personal income, taxes and user fees, etc. While the economy is beginning to rebound, Illinois must become far more proactive in helping grow small and midsize businesses, instead of again hiking crippling taxes to meet the voracious appetite for out-of-control spending in Springfield.\n\n2. What grade — “A” to “F” — would you give Gov. J.B. Pritzker for his handling of the coronavirus pandemic? Please explain. What, if anything, should he have done differently?\n\nThe grade has to be “Incomplete,” since we are still midway through the pandemic. We won’t know the impact of the governor’s lockdown and pandemic orders until at least next year: then, we can see the full results of these policies on the physical, mental, and economic health of our residents versus those of neighboring states.\n\nBefore the pandemic, Illinois imposed the worst tax burden on its residents of any state in the country, along with being known as a notoriously bad place to start, build, or bring a business. Gov. Pritzker then imposed one of the most severe lockdowns in the country. Predictably, Illinois residents have not recovered their jobs and businesses as quickly as folks in other states. Even with the lockdown, Illinoisans experienced worse physical health impacts from COVID than neighboring states.\n\nWe need a full post-COVID review of why we suffered such high infections and deaths in long-term-care facilities. Without that review, we won’t know whether this was due to the governor’s actions or inactions, or some other cause.\n\nFrom the beginning, I’ve advocated against including my county of DuPage in a “zone” with Cook County in terms of phasing openings and policies. That penalized and handicapped our ability to move more quickly to recovery.\n\nAnd it was wrong to ban small family retailers from in-person sales of their products, while large retailers could sell those same products.\n\nFinally, the Pritzker Administration entirely botched unemployment insurance, leaving the jobless with no one to answer the phone, trying to navigate a broken website, and suffering the indignity of their personal identification details put on the internet. With tens of thousands of government employees across Illinois at home, there were plenty of people who could have manned unemployment phone lines during this unprecedented crisis.\n\n3. In the wake of the death of George Floyd in Minneapolis, legislatures in some states have taken up the issue of police reform. Should Illinois do the same? If so, what would that look like?\n\nEveryone was horrified by the tragic circumstances surrounding the needless death of George Floyd. It was inexcusable on every level. There are clearly agencies and departments that require more and better training of officers and a clear set of policies to prevent such a tragic result ever again. That officer in Minneapolis was acting outside of guidelines and deserves to be punished for his crimes. Our agencies are better than this, particularly in DuPage County.\n\nIn Illinois, I backed the bipartisan Police and Community Relations Improvement Act, which banned chokeholds, put standards in place for officer-involved deaths, and improved training requirements, among other reforms. While due to this Act, Illinois already has in place many of the reforms other states are now reviewing, we should always be looking at any and every helpful reform that protects the public and gives our agencies the ability to perform professionally in maintaining the law. As a Village Trustee, I was also a strong supporter of body cameras to protect both the public and police officers in altercations. This was at a time when there was significant resistance to these devices.\n\n4. Should the Legislature pass a law requiring all law enforcement officers to wear body cameras? Why or why not?\n\nAbsolutely. It protects both citizens and law enforcement. It can and does act as a deterrent for both parties. I would immediately sponsor or co-sponsor such a bill.\n\n5. Federal prosecutors have revealed a comprehensive scheme of bribery, ghost jobs and favoritism in subcontracting by ComEd to influence the actions of House Speaker Michael Madigan. Who’s to blame? What ethics reforms should follow? Should Madigan resign?\n\nTerra Costa Howard, and enablers like her, are to blame. During the 2018 elections, Costa Howard promised the residents of the 48th District that she would be independent of Mike Madigan, but then she turned around and took $1.5 million in campaign contributions from him (more than any other state legislative candidate) and voted for him for Illinois House Speaker. Terra Costa Howard handed our vote—and our voice—to a crook and a thief.\n\nEven today, Costa Howard still refuses to return one dime of all the dirty money she’s taken—and she is still raking in money from Madigan-controlled campaign committees.\n\nMadigan has run state government as a pay-to-play scheme for decades. The monied interest groups pay into his campaign committees and hire his preferred lobbyists, guaranteeing them a seat at the legislative table. If you don’t have money or the right lobbyist, you lose.\n\nAnd he’s done this in plain sight, with increasing numbers of Illinoisans watching in horror, but unable to stop it. When reform-minded candidates like me step forward to run in competitive districts, they get hit with multi-million-dollar smear campaigns, executed by the Madigan machine’s sophisticated political operation. Even post-Madigan, this won’t change unless we elect new leaders clean of the taint of Madigan and his machine.\n\nOn Madigan, I called for his resignation last year. While in the House, I opposed Madigan for Speaker twice.\n\nOn reforms, we need term limits. We have a part-time citizen legislature, and term limits will strengthen the temporary nature of legislative service. There are a raft of additional reforms in this vein: bans on lobbying after legislating, strengthening lobbyist disclosure requirements, limits on legislative leaders, taking power away from legislative leaders and returning it to members, and putting teeth into laws prohibiting conflicts of interest by legislators, among others. Reform should be an “all-of-the-above” approach.\n\n6. Please tell us about your civic work in the last two years, whether it’s legislation you have sponsored or work you have done in other ways to improve your community.\n\nMy wife and I were blessed to be able to adopt our second son two years ago, literally a week before the last election. We’re very committed to our community and blessed to raise a family here.\n\nDuring COVID, I’ve been active running food drives that collected thousands of pounds of food and thousands of dollars for our local St. Vincent De Paul Societies. I’ve also been handling requests from local residents who weren’t able to get help from the Costa Howard district office. And I’ve been putting out informational Facebook Live videos that have received tens of thousands of views, on a variety of topics of interest to our district.\n\nAt the end of last year, after our community suffered a spate of over-valuations on local properties, I put on multiple emergency property tax seminars, along with working directly with residents, to help folks get their assessments and taxes lowered. Ms. Costa Howard was not responsive to the needs of these residents, who are literally being taxed out of their homes.\n\nIn my professional capacity, I’ve worked hard to assist churches to be able to open safely, with precautions, to enjoy the status that other “essential places” have had. My wife and I also participate with both time and treasure to many of the civic organizations in my community.\n\n7. Please list three concerns that are specific to your district, such as a project that should be undertaken or a state policy related to an important local issue that should be revised.\n\nThe people and businesses of our district are burdened the most by out-of-control spending and taxes, onerous mandates on businesses and local governments, and rampant corruption. We can’t recover quickly and fully from COVID while suffering under these burdens.\n\nYet all of them have been made worse by Terra Costa Howard: she supported unbalanced budgets, new mandates on local businesses, and voted for Madigan for House Speaker. Costa Howard told voters during her 2018 campaign that she’d be for “fiscal responsibility” and “small business,” but once she got to Springfield, her voting record was the exact opposite.\n\nCosta Howard even voted against a proposal to stop the conflicts of interest in General Assembly members, like Mike Madigan, writing the property tax laws and then raking in millions doing property tax appeals. The Chicago City Council banned that practice, in response to the Ed Burke prosecution, but Costa Howard rejected reform and stood with Madigan.\n\nFor our district, I’ve succeeded in securing relief when state action was required. Whether it was securing IDOT approval for the new Mariano’s on Roosevelt Rd in Lombard; helping a local nonprofit, SCARCE, with a law allowing it to collect cooking grease and oil; or changing state law to allow Noon Whistle Brewing to use innovative “360-lid” technology (allowing removal of nearly all the top of a beverage can, making it more like a cup), I got the job done.\n\n8. What are your other top legislative priorities?\n\nToo many Illinoisans feel they must uproot and leave the state they call home. We are now at six straight years of losing residents to other states, losing over 100,000 people net in just the past two years. Every person who leaves takes their hopes and dreams and contributions with them, pulling vitality and energy away from Illinois.\n\nAnd the latest data shows we’re not just losing seniors—it’s prime working-age residents who are leading the exodus. Residents are taxed out of their homes, or are just tired of supporting a state government they see as disconnected and corrupt. Students are heading to college out of state, never to return. Families are packing up for places with more and better paying jobs.\n\nThe solutions are not easy, but they are simple. Lower the tax burden on our residents and businesses—both income taxes and property taxes have to come down. Stop out-of-control spending at the state level, which is driving tax and fee increases. Embrace reform measures like Fair Maps and Term Limits, to ensure we have citizen legislators representing whole communities, not sliced up narrow groups of partisans. Our broken state government is the primary obstacle standing in the way of turning our state around.\n\n9. What is your position on Gov. J.B. Pritzker’s proposed graduated income tax? Please explain.\n\nI stand firmly against the graduated income tax. My greatest reason comes from my experience in the General Assembly, where I saw first-hand the amount of wasteful spending and poor fiscal policy being implemented in the state. The budgets passed always exceeded our anticipated income, and even those income numbers were artificially inflated as part of an obscene effort to call these budgets “balanced.” They never were. In a state with an insatiable appetite for spending, feeding more hard-earned taxpayer money into that corrupt process is not the solution.\n\nOur entire budgeting process should be overhauled, a zero-based budget starting with a clean slate. There are numerous programs which are simply routinely re-appropriated, without careful assessment of effectiveness or necessity. They often become silos of money for discretionary spending, and they are rife for corruption. Before anyone asks an Illinois taxpayer for a single penny more, there should be an absolutely full accounting of all of the money this state already raises through every tax and fee we already levy. We’re in recovery mode. Consumers will be a huge part of that. Taking away more money isn’t the way to encourage growth.\n\n10. Illinois continues to struggle financially, with a backlog of unpaid bills. In addition to a progressive state income tax — or in lieu of such a tax — what should the state do to pay its bills, meet its pension obligations and fund core services such as higher education?\n\nAs stated before, this state needs to re-examine every dollar we are spending now. Illinois should do what any entity should do when they are spending more than they take in: reform, and spend less.\n\nIllinois government needs to innovate with a view to 2030, not 1830. Advancements in technology should lead to lower expense, not greater, but there’s never a solution proposed in this state that doesn’t include a tax hike. That’s the first and only solution ever considered.\n\nThere also needs to be a very serious and fair discussion with relation to pension funds. These have become an eternal issue with no solvent funding solution in place. I lose sleep over the fact that these funds won’t be there for people who have been made promises that are fiscally impossible to keep. I believe that before we can solve this problem, we have to stop the bleeding first. There are some measures with the tier system that have helped a little bit, but are still inadequate. For everyone’s sake, including pensioners who deserve security and certainty, a fair, equitable set of agreements to tackle this dire issue over a reasonable period of time is the only realistic solution.\n\nAs for “core services”, we need to narrowly define them and fund them properly. This area of funding suffers more than any other as they don’t enjoy the auto-reappropriation so many other elements of the state budget do. The whole budget needs to be re-imagined and re-examined starting with a fresh balance sheet.\n\n11. Should Illinois consider taxing the retirement incomes of its very wealthiest residents, as most states do? And your argument is?\n\nThere aren’t many incentives to remaining an Illinoisan. The policy of not taxing retirement income is among the few incentives any resident of Illinois has to stay here. If we were to selectively consider taxing retirement income, who would decide who is wealthy? Who would decide the rates? Who would decide when those rates should change, because Illinois still continues to spend more than it takes in? We know who. The same General Assembly that put us in the fiscal morass we’re stuck in. Who would trust them to make those decisions? To make my answer clear: No, Illinois should not consider this.\n\n12. What can Illinois do to improve its elementary and high schools?\n\nIllinois schools spend double the national average on administration—we have to move that money back to the classroom. And the state imposes numerous unfunded mandates that hike costs for local school districts.\n\nI put forward a bill to cap administrative spending at the national average, which would free up hundreds of millions of dollars for classroom needs and property tax relief. Whether this efficiency is achieved by consolidating districts or sharing administrative costs, this is a huge sum of money being wasted in our state.\n\nWhen I review our standards, I believe they’re high enough, but we’re not meeting them. There needs to be more accountability for doing so. We are in a financial crisis in this state that affects everyone, including school districts. It very much affects the families sending these students to schools. The funding of schools has experienced years of band-aid approaches, special legislation and a completely non-comprehensive approach.\n\nAt present, we’re not even sure if schools are going to open this school year or how. I’m a public high school graduate. I was fortunate to get an outstanding education and go on to very strong universities with that foundation. I don’t believe that is the case for many of our students today.\n\nThe only way to truly improve schools is by actively reforming our education policy, cognizant of the needs of the various regions of the state, and with the full participation of all of the stakeholders in the process. That simply hasn’t been done. There are too many golden calves, resulting in winners and losers with every partial-reform effort enacted. Too often the losers were a set of students in one part or the state or the other, or worse, everywhere. Educators are smart people by nature and experience. This is a solvable problem.\n\n13. Mass shootings and gun violence plague America. What can or should the Legislature do, if anything, to address this problem in Illinois?\n\nWe’ve had selected success and failure with this issue in Illinois. It’s both heart-breaking and frustrating to see our state on the national news every night reporting the most recent tally of shootings and killings in Chicago. The city has some of the strictest gun laws in the country, and despite that, there are no shortage of guns or tragic carnage there. The General Assembly has also already tightened gun regulations to be some of the toughest in the country.\n\nThe other side of the equation is policing and prosecuting those misusing firearms. For instance, I have worked closely with our DuPage State’s Attorney, Bob Berlin, on a variety of legislative measures, including enhancing penalties for those who commit crimes and then jump bail. Historically, DuPage has seen as much as 50% of felonies committed by individuals from outside the county, so laws like this one would give our prosecutors the tools they need to discourage crime locally.\n\n14. Do you favor or oppose term limits for any elected official in Illinois? Please explain.\n\nI am in favor of term limits. Legislators do need enough time to become effective and not let the permanent establishment of staff operate the government. In the State of Illinois, with the way legislative maps are gerrymandered, elections do not serve the function as term limits as it was intended. I believe strongly in a Citizen Legislature for a carefully prescribed period of service.\n\nThere’s no reason a statewide official should serve more than 2 terms (8 years). And 8-10 years for Legislators in the State Senate or General Assembly is plenty. Controlled, centralized power for too long of a period is a recipe for corruption: we are watching this play out on our television screens as more and more long-serving members of the Illinois General Assembly are charged with various federal crimes.\n\n15. Everybody says gerrymandering is bad, but the party in power in every state — Democrats in Illinois — resist doing anything about it. Or do we have that wrong? What should be done?\n\nYou have it right. It is bad. Fortunately, more and more, the people of Illinois view gerrymandering to be unconstitutional and wrong. I drafted and championed a Fair Maps Amendment, presented as a citizen initiative, because of the block put on Fair Maps by the Democratic Party of Illinois. (We had over 10,000 signatures gathered, before being abruptly halted by the coronavirus.)\n\nEvery few years, you see cynical attempts by electorally vulnerable Democrats to file fair maps amendments, knowing full well these efforts will never see the light of day. We saw it in 2016 when then-Rep. Jack Franks was allowed to bring his amendment to the House Floor (where it garnered 105 votes), with the understanding that the Senate would not take it up. And we saw Ms. Costa Howard do the same thing this year, filing another dead-on-arrival amendment just two months before the deadline.\n\nWhat should be done? The media, private industry, and good-government groups should coalesce behind a citizen initiative that meets the requirements of the Illinois Constitution. My Fair Maps Amendment is one legally rock-solid way to meet those stringent requirements. Any system would be better than the current one.\n\n16. The U.S. attorney’s office in Chicago is investigating possible official corruption by state and local officials. This prompted the Legislature to pass an ethics reform measure to amend the Lobbyist Registration Act (SB 1639). It was signed into law in December. What’s your take on this and what more should be done?\n\nAs I noted previously, we need an all-of-the-above approach to ethics reform, starting with term limits. There are plenty of ideas out there, and if we need more, we can look to the many other states that are known for clean government, like Iowa and Wisconsin.\n\n17. When people use the internet and wireless devices, companies collect data about us. Oftentimes, the information is sold to other companies, which can use it to track our movements or invade our privacy in other ways. When companies share this data, we also face a greater risk of identity theft. What should the Legislature do, if anything?\n\nIllinois currently has some of the toughest laws in the country around information privacy. Even so, we can always be open to addressing the privacy challenges presented by tech advancements. For instance, the issues relating to Tik Tok and its undisclosed scraping of user data may present areas for us to legislate in Illinois, if the federal government does not act.\n\nThe General Assembly is severely lacking in the experience necessary to meet the challenges presented by emerging technology: I bring unique training and experience in computer science and telecommunications to bear on these issues. Voices like mine are missing from the General Assembly.\n\n18. The number of Illinois public high school graduates who enroll in out-of-state universities continues to climb. What can Illinois do to make its state universities more attractive to Illinois high school students?\n\nEvery Illinoisan deserves the opportunity to attend college or a trade school, and to graduate without debt. A big reason people leave Illinois for out of state institutions is the cost of education here. We are not as competitive as other state university systems. In my district, many students choose universities in Indiana, Iowa, or Missouri, instead of staying here. With few financial incentives available, U of I is also difficult for many of our best students to attend. Other states have aggressively recruited in Illinois and provided financing, to cherry pick our best students.\n\nParents also have a role in how students make these choices. They want what’s best for their children, and because of the problems afflicting Illinois, many parents urge their kids to go elsewhere. Illinois needs to live up to the standard that “anything is possible” to pursue and prosper here. This is another area where our state’s horrible fiscal condition is negatively affecting us. All this adds up to students choosing less expensive, top-flight schools in other states, with better fiscal management and opportunity.\n\n19. What is your top legislative priority with respect to the environment?\n\nI’m a husband and father of 2 little boys. Clean air and clean water are our most important environmental considerations. I am proud to have been one of the few Republicans regularly rated 100% by the Illinois Environmental Council.\n\nAs well, being the only person with an Electrical Engineering background in the General Assembly, I repeatedly worked with environmental groups to responsibly move Illinois to low- and zero-emissions energy. Illinois is recognized as a national leader in the field today, due to our efforts on that front.\n\n20. What historical figure from Illinois, other than Abraham Lincoln (because everybody’s big on Abe), do you most admire or draw inspiration from? Please explain.\n\nI’d choose the “Great Communicator,” Ronald Reagan, since I can’t pick Abraham Lincoln. Growing up, we knew President Reagan as a calm, upbeat presence for our country. He fought hard for his principles, but he united folks across partisan lines and was focused on getting things done. We could use more leaders like him today.\n\n21. What’s your favorite TV, streaming or web-based show of all time. Why?\n\nAll-time would probably be Doctor Who. Some seasons are better than others, but the fact that the whole main cast changes every few years keeps up the variety of the show. You get something to latch onto with each crew. The show is wickedly funny and creative, and often bends your brain.\n\n"}, {"url": "https://ballotpedia.org/List_of_United_States_Representatives_from_Illinois", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://www.biography.com/political-figures/tammy-duckworth", "page_content": "(1968-)\n\nWho Is Tammy Duckworth?\n\nTammy Duckworth was deployed to serve in the Iraq War in 2004 and lost both of her legs when her helicopter was struck. Duckworth became director of the Illinois Department of Veterans' Affairs in 2006, and three years later President Barack Obama appointed her assistant secretary in the U.S. Department of Veterans Affairs. In 2012, she was elected to Congress, representing Illinois’ 8th District. Four years later, she was elected a U.S. senator, thereby becoming the first disabled woman and the second Asian American woman in the Senate. In April 2018, Duckworth became the first female senator to give birth while holding office.\n\nEarly Life\n\nLadda Tammy Duckworth was born on March 12, 1968, in Bangkok, Thailand, to a mother of Chinese heritage and a father of British descent. Because her father did refugee work for the United Nations, Duckworth's childhood took place against varied backdrops — spanning Thailand, Indonesia, Singapore, Cambodia and Hawaii.\n\nDuckworth, along with her mother, Lamai, and her father, Franklin, moved to Hawaii as a teenager. After high school, Duckworth earned her undergraduate degree at the University of Hawaii. Afterward, she obtained her Master of Arts in international affairs at George Washington University in Washington, D.C. In pursuit of yet more higher education, Duckworth then relocated to Illinois, where she enrolled in a political science Ph.D. program at Northern Illinois University.\n\nService in Iraq\n\nWhile attending NIU, Duckworth enrolled in the Reserve Officers' Training Corps with the Illinois Army National Guard. Trained as a Blackhawk pilot, in 2004 Duckworth left NIU when she was deployed to Iraq. In Iraq, Duckworth flew Operation Iraqi Freedom combat missions until her helicopter was struck by a rocket-propelled grenade in the autumn of 2004.\n\nThe explosion took both of Duckworth's legs and robbed her of full function in her right arm. Still believing in the worthiness of her mission amid questions of whether she felt her sacrifice was for naught, Duckworth responded, \"I was hurt in service for my country. I was proud to go. It was my duty as a soldier to go. And I would go tomorrow.\" She did, however, express frustration that U.S. policymakers were failing to match the sacrifices of American soldiers.\n\nFollowing her injuries, Duckworth was promoted to major and awarded the Purple Heart. During her year's recovery time at the Walter Reed Army Medical Center, she became an activist, advocating for better medical care for wounded veterans and their families. Duckworth presented her impassioned views to Congress, testifying on two separate occasions.\n\nLeader of Veterans' Affairs\n\nDuckworth's activism led her to pursue a political career after her recovery. In 2006 she ran for Congress but lost by a narrow margin. Instead, she took an appointment as director of the Illinois Department of Veterans' Affairs. In this role, she worked toward developing an incentive program that would give employers a tax credit for hiring war veterans. She also initiated programs that would provide veterans and their families with better mental support, health care and housing resources.\n\nAfter President Obama was elected, he chose Duckworth as his assistant secretary for public and intergovernmental affairs in the U.S. Department of Veterans Affairs. In her new role, Duckworth focused largely on putting a stop to the cycle of homeless veterans. She also developed resources especially tailored to the unique needs of female veterans.\n\nHistory-Making Congresswoman\n\nIn 2012, Duckworth took a second shot at a seat in Congress, as a Democrat representing Illinois, and won. Her victory was twofold: Not only did Duckworth now have the platform to advance her political agenda, but she also became a living example for fellow female veterans, as the first disabled woman ever to be elected to the U.S. House of Representatives.\n\nDuring her time in the House of Representatives, Duckworth worked in a number of committees including the House Committee on Armed Services, the House Committee on Oversight and Government Reform, as well as the House Select Committee on the Events, Surrounding the 2012 Terrorist Attack in Benghazi. In 2013, during a House hearing, she made headlines when she took Virginia CEO Braulio Castillo to task for fraudulently representing himself as a disabled military vet and receiving millions of dollars in federal contracts. \"Shame on you. You may not have broken any laws … [but] you broke the trust of veterans.” Duckworth added, “Twisting your ankle in prep school is not defending or serving this nation.”\n\nIn 2016, Duckworth successfully ran for the U.S. Senate against incumbent Mark S. Kirk, thereby becoming the second female Asian American to win a Senate seat (California's Kamala Harris soon became the third) and the first disabled woman to accomplish the task. An outspoken Democrat, she railed against President Donald Trump during the brief government shutdown in January 2018, saying, \"I will not be lectured about what our military needs by a five-deferment draft dodger.\"\n\nMotherhood in the Senate\n\nPrior to her injuries, Duckworth married Major Bryan Bowlsbey of the Illinois Army National Guard. She announced her retirement from the military in October 2014, shortly before giving birth to a daughter.\n\nIn January 2018, Duckworth announced that she was expecting a second daughter in April, which would make her the first senator to give birth while holding office. Noting it was \"about damn time\" someone achieved this, Duckworth said, \"I can't believe it took until 2018. It says something about the inequality of representation that exists in our country.\"\n\nA few weeks later, the senator penned an op-ed piece in which she pushed for expanded benefits for parental leave. Noting that she was among the lucky ones who would be able to enjoy paid time off while caring for a newborn, she cited the FAMILY Act, proposed by New York Senator Kirsten Gillibrand, and the Child Care for Working Families Act, from Washington's Patty Murray, as examples of legislation that would help people balance the responsibilities of parenting and their careers.\n\nOn April 9, 2018, Duckworth gave birth to a baby girl, Maile Pearl, at a hospital in Arlington, Virginia. Along with tweeting messages that thanked friends and family for support, she issued a statement that showed she had an eye on returning to work. Duckworth then showed she meant those words seriously when she took 10-day-old Maile with her to cast what could have been a deciding vote against a Trump nominee for NASA administrator. The baby's presence came one day after the Senate changed its admission rules, making the senator and Maile the first mama-daughter team appear on the chamber floor during a vote.\n\nDuckworth made her formal return to the Senate on July 2, noting she would have a nanny there to help care for Maile and make use of the breast pump and refrigerator in the new health and wellness room. She said it had been nice to get away and have quiet moments with her newborn, but added that she couldn't get too detached from work with her vote occasionally needed and other issues, like the administration's controversial border policy that separated immigrant families, commanding her attention in recent weeks.\n\nQUICK FACTS\n\nName: Tammy Duckworth\n\nBirth Year: 1968\n\nBirth date: March 12, 1968\n\nBirth City: Bangkok\n\nBirth Country: Thailand\n\nGender: Female\n\nBest Known For: Illinois' Tammy Duckworth became the first disabled female veteran to earn election to the U.S. House of Representatives and the Senate, as well as the second female Asian American senator.\n\nIndustries\n\nWar and Militaries\n\n\n\nU.S. Politics\n\nAstrological Sign: Pisces\n\nSchools\n\nNorthern Illinois University\n\n\n\nGeorge Washington University\n\n\n\nUniversity of Hawaii\n\nCultural Associations\n\nAsian American\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Tammy Duckworth Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/political-figures/tammy-duckworth\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: August 3, 2020\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.britannica.com/topic/House-of-Representatives-United-States-government", "page_content": "The House of Representatives originally comprised 59 members. The number rose following the ratification of the Constitution by North Carolina and Rhode Island in 1790; the first Congress (1789–91) adjourned with 65 representatives. By 1912 membership had reached 435. Two additional representatives were added temporarily after the admission of Alaska and Hawaii as states in 1959, but at the next legislative apportionment , membership returned to 435, the number authorized by a law enacted in 1941.\n\nEach state is guaranteed at least one member of the House of Representatives. The allocation of seats is based on the population within the states, and membership is reapportioned every 10 years, following the decennial census . House members are elected for two-year terms from single-member districts of approximately equal population. The constitutional requirements for eligibility for membership of the House of Representatives are a minimum age of 25 years, U.S. citizenship for at least seven years, and residency of the state from which the member is elected, though he need not reside in the constituency that he represents.\n\nThe House of Representatives shares equal responsibility for lawmaking with the U.S. Senate . As conceived by the framers of the Constitution, the House was to represent the popular will, and its members were to be directly elected by the people. In contrast, members of the Senate were appointed by the states until the ratification of the Seventeenth Amendment (1913), which mandated the direct election of senators.\n\nPowers\n\nThe Constitution vests certain exclusive powers in the House of Representatives, including the right to initiate impeachment proceedings and to originate revenue bills. The organization and character of the House of Representatives have evolved under the influence of political parties, which provide a means of controlling proceedings and mobilizing the necessary majorities. Party leaders, such as the speaker of the House and the majority and minority leaders, play a central role in the operations of the institution. However, party discipline (i.e., the tendency of all members of a political party to vote in the same way) has not always been strong, owing to the fact that members, who must face reelection every two years, often vote the interests of their districts rather than their political party when the two diverge.\n\nA further dominating element of House organization is the committee system, under which the membership is divided into specialized groups for purposes such as holding hearings, preparing bills for the consideration of the entire House, and regulating House procedure. Each committee is chaired by a member of the majority party. Almost all bills are first referred to a committee, and ordinarily the full House cannot act on a bill until the committee has “reported” it for floor action. There are approximately 20 standing (permanent) committees, organized mainly around major policy areas, each having staffs, budgets, and subcommittees. They may hold hearings on questions of public interest, propose legislation that has not been formally introduced as a bill or resolution, and conduct investigations. Among important standing committees are those on appropriations, on ways and means (which handles matters related to finance), and on rules. There are also select and special committees, which are usually appointed for a specific project and for a limited period.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe committees also play an important role in the control exercised by Congress over governmental agencies. Cabinet officers and other officials are frequently summoned before the committees to explain policy. The Constitution (Article I, section 6) prohibits members of Congress from holding offices in the executive branch of government—a chief distinction between parliamentary and congressional forms of government.\n\nAfter the census of 1920, Northeastern and Midwestern states held 270 House seats and the South and West held 169. Thereafter, the balance between the two regions gradually shifted: following the 2010 census, the Northeast and Midwest accounted for only 172 seats, compared with the South and West’s 263. Most notably, the number of representatives from New York declined from 45 in the 1930s to only 27 in 2012, while the number from California increased from 11 to 53."}]}