{"Peter Breen was a vocal advocate for criminal justice reform, sponsoring legislation to reduce the state's prison population and reform the state's bail system.": [{"url": "https://www.nytimes.com/2019/06/25/us/joe-biden-crime-laws.html", "page_content": "michael barbaro\n\nFrom The New York Times, I’m Michael Barbaro. This is “The Daily.” Today: In the Democratic race for president, Joe Biden is being asked to confront a record on race that some in his party now see as outdated and unjust. Astead Herndon on the policies Biden embraced and how they were viewed when he embraced them. It’s Wednesday, July 3.\n\narchived recording (kamala harris) I do not believe you are a racist. And I agree with you when you commit yourself to the importance of finding common ground. But I also believe — and it’s personal. And I was actually very — it was hurtful to hear you talk about the reputations of two United States senators who built their reputations and career on the segregation of race in this country. And it was not only that, but you also worked with them to oppose busing. And there was a little girl in California who was part of the second class to integrate her public schools. And she was bused to school every day. And that little girl was me. So I will tell you that on this subject, it cannot be an intellectual debate among Democrats. We have to take it seriously. We have to act swiftly.\n\nmichael barbaro\n\nAstead, to the average American watching the debates last week, what do you think that this now famous confrontation between Joe Biden and Kamala Harris seemed to be about?\n\nastead herndon\n\nOn its most literal level, it was two top-tier Democrats having the most confrontational, direct moment we’ve seen in the primary so far.\n\narchived recording (joe biden) If we want to have this campaign litigated on who supports civil rights and whether I did or not, I’m happy to do that. I was a public defender. I didn’t become a prosecutor. I came out, and I left a good law firm to become a public defender, when, in fact — [APPLAUSE] — when, in fact, my city was in flames because of the assassination of Dr. King.\n\nastead herndon\n\nBut in the bigger, more abstract view, these were two different generations of Democrats. One, a barrier-breaking, younger black senator, pushing the old guard, the senator who came in the 1970s, who had relationships with segregationists and avowed racists. She was pushing him on racial issues and trying to hold him accountable for how the Democratic Party has handled issues of race for decades leading up to this point.\n\nmichael barbaro\n\nBut it also felt like this was about the details of a specific policy that Biden was a part of. And most of us probably don’t really understand what his intentions were or what the context of that policy was. So take us back to that time. Where was Joe Biden in his political career?\n\nastead herndon\n\nWell, Joe Biden began as a lawyer in Wilmington and, eventually, a city councilor in the county. And he was emerging at a really racially contentious time within the city and state.\n\narchived recording In April, after the murder of Martin Luther King, the National Guard was called out in several cities to put down riots. One of these cities was Wilmington, Delaware. But now, in Wilmington, the National Guard is still on duty. And the governor, Charles Terry, has no plan to send it back.\n\nastead herndon\n\nAnd Joe Biden runs for Senate in 1971 as a new type of Democrat —\n\narchived recording (joe biden) I’m Joe Biden, and I’m a candidate for the United States Senate.\n\nastead herndon\n\n— a Democrat who understands black communities and has personal and deep relationships in those communities, but as a Democrat who can also unite the kind of outer portions of the state, which saw those issues very differently.\n\narchived recording (joe biden) Politicians have done such a job on the people that the people don’t believe them anymore. And I’d like a shot at changing that.\n\nastead herndon\n\nJoe Biden himself tells a story about how he was the only lifeguard at a newly integrated pool in Wilmington.\n\narchived recording (joe biden) I applied to the city of Wilmington for a job, and I was the only white employee here. And I learned so much. And I realized that I live in a neighborhood where I could turn on the television, and I’d see and listen to Dr. King and others. But I didn’t know any black people. No, I really didn’t. You didn’t know any white people either. That’s the truth.\n\nastead herndon\n\nIt was part of his identity and part of his brand that he cared about civil rights, understood the plight of African-Americans in Wilmington, but also, he understood that kind of outer white Delaware was really motivated around grievance at the time. In 1971, a group of black students had filed a lawsuit in hopes to get the schools to further desegregate. And so the question of school segregation and school integration was very much on the forefront of the state’s politics. And at the exact same time, that’s when the young Joe Biden makes his way to Capitol Hill.\n\nmichael barbaro\n\nAnd what was Biden’s position when it came to desegregation?\n\narchived recording (joe biden) Where the court has concluded that a school district, a state, or a particular area has intentionally attempted to prevent black, or any group of people, from attending a school, the court should and must declare that to be unconstitutional and thereby move from there to impose a remedy to correct the situation.\n\nastead herndon\n\nJoe Biden takes the position, as many other politicians did at that time, that they were not opposed to the idea of integration. What they’re opposed to was the remedy.\n\narchived recording (joe biden) I have argued that the least effective remedy to be imposed is the busing remedy.\n\nastead herndon\n\nYou get a court order in the late ‘70s that says that Delaware schools are too racially segregated, and they must form a plan for racial integration. And a plan is instituted by the courts that says, from the city in Wilmington, which is majority black, and the suburbs outside of it, that both those groups of students were for some portion of their schooling going to have to bus to the opposite community. So for the kind of inner city students, which are majority black, they were going to have to go out to the suburbs for six years. And the outer suburbs would have to come into Wilmington schools for about three years. So this becomes the plan that’s put in place that inflames those racial tensions on both sides of the state.\n\nmichael barbaro\n\nAnd what is Biden’s opposition to that specific solution?\n\nastead herndon\n\nThat the idea of integration was not a problem, but it was how the courts were forcing them to go about it. You have to think — if you were a parent in the suburbs, which is almost exclusively white, who had made that choice for your family almost entirely around the school district that your child was supposed to go into. And then there is a court order that comes down that says not only are different people coming to that school, but that your child is going to be put on a bus to a different school. That is the logic that those parents used to oppose the idea of busing. And so at one point in 1975, Joe Biden says, the real problem with busing is you take people who aren’t racist, people who are good citizens, who believe in equal education and opportunity, and you stunt their children’s intellectual growth by busing them to an inferior school. And you’re going to fill them with hatred.\n\nmichael barbaro\n\nSo Biden is sympathizing with white parents in the suburbs who are suddenly feeling dislocated by this decision. But what about black parents in this city whose children would be bused to these theoretically better schools in the suburbs? What is Biden saying to them?\n\nastead herndon\n\nThis is an important point. Although the kind of white suburbs were almost uniformly against busing, somewhat because of the method and sometimes because of pure racism, in black communities, particularly in Wilmington, there is not universal agreement on this issue. There is universal consensus that integration is important and that their schools had not been adequately funded or not been adequately supported by the state. But when you look at polling and when you talk to people at the time, the actual issue of busing is controversial. Remember, these parents themselves had to send their children further away into neighborhoods and communities that may have not always been welcoming to those students. So it wasn’t universally loved. In one poll, about 40 percent of black parents supported the idea, 40 percent were against it, around 20% were unsure. Joe Biden tries to take a nuanced position, where sometimes it seems like he is a vocal opponent of the idea of busing and that he is signaling to the kind of white Delaware that he is their advocate.\n\narchived recording (joe biden) And on the issue that the argument is about — and that is whether or not busing is, A, required constitutionally, and B, has a utilitarian value for desegregation — I come down on the side of A, it is not constitutionally required, and B, it is not a useful tool.\n\nastead herndon\n\nBut there’s other times when he sounds very much like many of the black leaders in Wilmington who say, I don’t know if I like this remedy, but I do know that the issue of integration is really important. So he’s kind of firmly in the middle. And that kind of middle ground is something we see him stake on a number of issues, most notably crime, where he takes the kind of position and relies on those personal relationships with black communities, while, according to his critics, legislating in the interest of white ones.\n\n[music]\n\nmichael barbaro\n\nWe’ll be right back. So Joe Biden takes the middle ground, or the middle ground for that time, on busing. How do we then see that in his approach to crime?\n\nastead herndon\n\nThis one’s a little different, because while Biden on busing was seen as kind of emblematic of the larger Democratic stance, with crime, he was really kind of pushing the boundaries. At that time, particularly in the ‘80s and ‘90s, was a kind of moral panic happening throughout the country —\n\narchived recording Crack, the most addictive form of cocaine, is now sweeping New York.\n\nastead herndon\n\n— around the explosion of drugs in cities —\n\narchived recording It’s going nationwide, especially among the young, a drug so pure and so strong, it might just as well be called crack of doom.\n\nastead herndon\n\n— and the violent crime that often associated and came with them.\n\narchived recording It’s the devil — see, this cocaine ain’t nothing but the devil, and the devil was telling me to do it.\n\nastead herndon\n\nAnd Biden, as someone who had come up in Wilmington, a community that was experiencing these things closely, he had black community leaders, neighbors of his, saying the issue was very important, but that they were looking at kind of root cause problems of why crime was happening. They were talking about issues like education or job opportunities and the like. When the outer Wilmington and the kind of all-white suburbs, you were hearing a more vocal cry for increasing cops, increasing prisons, and really cracking down on those tough-on-crime measures that came to the cities. So again, Biden is caught between political problem, but also one that’s divided pretty clearly on racial lines.\n\nmichael barbaro\n\nAnd so what does he do?\n\narchived recording The truth is every major crime bill since 1976 that’s come out of this Congress has had the name of the Democratic senator from the state of Delaware, Joe Biden, on that bill.\n\nastead herndon\n\nThere’s this split screen of Joe Biden that you often hear about when you talk to people in Wilmington. There is the neighbor who would go to black churches, would know the kind of leaders by name, and the issues they were advocating for. But then in Washington, you have a Joe Biden that is using those stories of Wilmington to kind of pass more tough-on-crime measures that some in that community say they weren’t asking for. In 1977, he first proposes mandatory minimums for drug sentences. And through the ‘80s, in his connection with Strom Thurmond, they end up passing a really kind of significant set of bills.\n\narchived recording (joe biden) Not enough prosecutors to convict them, not enough judges to sentence them, and not enough prison cells to put them away for a long time.\n\nastead herndon\n\nIn 1984, that establishes mandatory minimums. In ‘86, the Anti-Drug Abuse Act creates harsher sentences for crack than powder cocaine. And it kind of builds up into the early ‘90s, when Bill Clinton is elected president, the ‘94 bill —\n\narchived recording (bill clinton) Thank you, Mr. Vice President, for your introduction and for your labors on this bill.\n\nastead herndon\n\n— the “three strikes and you’re out” kind of policy —\n\narchived recording (bill clinton) “Three strikes and you’re out” will be the law of the land.\n\nastead herndon\n\n— where, if you had three instances of drug offenses or violent drug offenses, it would be an instant life sentence.\n\narchived recording (bill clinton) We have the tools now. Let us get about the business of using them.\n\nmichael barbaro\n\nAnd what do we understand about how the black community back in Delaware felt about these tough crime measures at the time?\n\nastead herndon\n\nJoe Biden talks about, to this day, in his presidential campaign, they make a big point to say that the Congressional Black Caucus overwhelmingly voted for the bill and that black leaders at the time were very supportive of the bill. That is partly true. The Congressional Black Caucus certainly backed the bill after showing some initial wariness. The majority of its members voted for it. There were some vocal black mayors who were calling for these particular measures. But there were also some who were against it.\n\narchived recording (jesse jackson) This ill-conceived bill, fed by a media frenzy over crime, was on the fast track to the president’s desk for signature by Christmas.\n\nastead herndon\n\nJesse Jackson spoke out against it.\n\narchived recording (jesse jackson) Spending several billion dollars on prisons and longer sentences is not the answer to reducing crime.\n\nastead herndon\n\nThe head of the Congressional Black Caucus spoke out against it. Representatives like Bobby Scott said they knew that the kind of increase of police in these neighborhoods would cause detrimental effects.\n\nmichael barbaro\n\nRight. So what turns out to be, over time, the actual impact of all of these bills, including the biggest of them all, that 1994 crime bill, in the years that followed?\n\nastead herndon\n\nThe undeniable impact is an explosion of America’s prison population that has disproportionately affected black and brown communities. So coming out of the ‘80s and ‘90s, you have a pretty clear articulation from then-Senator Biden that cops and the expansion of cops is a preventative measure.\n\narchived recording (joe biden) In a nutshell, the president’s plan doesn’t include enough police officers to catch the violent thugs.\n\nastead herndon\n\nHe felt that the kind of presence of police officers, the increased presence of police officers in these communities, would inherently mean that crime would go down. As the years have gone on, it has become clear that the actual effect was not that, but was the disruption of the communities themselves. When I was in Wilmington talking to folks there, they were saying by 1994, it was already clear that the tough-on-crime kind of measures of the ‘80s weren’t working on the streets. It was not decreasing crime, but more importantly, it was causing a kind of incarceration effect that didn’t have the terminology for mass incarceration that we now call it, but it was clear that communities were getting ruptured by the increase in sentences and the increased focus on tough-on-crime measures.\n\nmichael barbaro\n\nAnd of course, the legacy of busing is that we’ve seen a resegregation of the U.S. school system, because the job was never really done.\n\nastead herndon\n\nExactly. There is a narrative that busing failed, but the truth is kind of murkier. Busing, as a policy, often did achieve its goals and racially integrate the places it was instituted. What failed was the political will to keep those measures in place that made integration happen and to see racial integration of schools as a necessary problem to solve. So in the last decades, you have not only overturned to pre-busing segregation levels, but in some places, you have racial segregation in schools becoming even worse than they were, or just as bad as they were, at the time of Brown v. Board of Education.\n\nmichael barbaro\n\nSo Astead, it seems like what we’re seeing in the debate last week, in this exchange between Harris and Biden, was that Biden is going to have to confront these past policies as their legacies are understood in the current moment. And that means complicated legacies with real implications, many of them quite negative for the black community.\n\nastead herndon\n\nJoe Biden is being — his whole record is being examined in new ways. He’s run for president twice before, but never as a front-runner and never as someone who enjoys this amount of support among black communities. Remember, this is still the vice president to the first black president. This is still the person who is seen, oftentimes, as the most likely to beat President Trump in the Democratic Party, which black communities have often seen as their number one goal. So he’s enjoying this kind of support, robust support, among black communities, while at the same time, his rivals are trying to use his record, particularly on busing and crime, to wrest away those votes. And I think that’s a really interesting question, is will these moments, like the one Senator Harris made happen in the debate, will they start to chip away at that image of him as a champion and an advocate for black communities? As people come to understand the record and as people come to understand the context of Delaware at the time, will he be seen as someone who was navigating a difficult racial terrain or as someone who kept black people close, but fundamentally legislated in the interests of white communities?\n\nmichael barbaro\n\nAnd so the question is, will voters evaluate him for what he was trying to accomplish in the ‘70s, and the ‘80s, and the ‘90s, or for what we now understand the impact of those bills to have been up through today? I wonder if you have any sense of how black voters are seeing that from your reporting.\n\nastead herndon\n\nI spent a lot of time in South Carolina, where we have the biggest population of black voters in the early states. And Joe Biden enjoys a large amount of goodwill in those places. What that is not is a deep connection to Joe Biden as an individual. As I heard someone say recently, his support is wide, but it’s thin. I think that people vote on a lot of different levels. Voting based on policy and record is one of them. Voting based on emotion, and feeling, and connection is another. And I think in this era for Democrats, and particularly for black Democrats who feel as if Trump has brought in a new era of white identity politics, there’s voting based on fear. And what you hear in South Carolina is not that they want to vote for Joe Biden because they believe in the things that he has done. But they see him as kind of an emergency fix to a much worse problem for them, which they believe is the presidency of Donald Trump.\n\nmichael barbaro\n\nAstead, is what you’re saying the black voters may be more inclined to go with a safe choice, because in their mind, in this racial climate and in this political climate, the alternative, which is not winning the presidency, is far more threatening than a Democratic candidate with a debatable historical record on race?\n\nastead herndon\n\nYep. And I think it’s important to make distinctions when we talk about black voters. We particularly see that kind of calculation among older black voters and black voters who are in the South. Now among younger voters, we see a bigger willingness to reject Joe Biden because of some of those records and to embrace candidates who are talking more explicitly and openly about structural changes to create racial equity. But among the older voters, who remain the real heart and soul of the black vote and a sizable portion of the Democratic electorate, it’s that calculation of safety that’s really helping Joe Biden right now. But we should also say that among those older voters, many of them can remember 1994 and remember the 1980s and may have themselves supported these bills and seen their thinking change as well. And I think that’s the important thing to not forget, is just as Joe Biden has evolved, so have many of these people. And I’ve talked to people who don’t see what he did as particularly invalidating, frankly, because they have experienced that same evolution. And sometimes, I have talked to people who said that ‘94 crime bill ruined their homes, and they also say they can’t wait to vote for Joe Biden in the primary.\n\narchived recording (joe biden) Before I start, I’d like to say something about the debate we had last night. And I heard, and I listened to, and I respect Senator Harris. But we all know that 30 seconds to 60 seconds on a campaign debate exchange can’t do justice to a lifetime committed to civil rights.\n\nmichael barbaro\n\nWell, so Astead, what do you make of how defensive Biden has been to these criticisms and these questions about his legacy, rather than acknowledging, a lot has changed since then. I was doing what I thought was best in the moment. I now see, I now understand that it played out differently than I expected.\n\nastead herndon\n\nThis is a question I’ve thought a lot about. If by the early 1990s, it was clear to the cops on the ground in Wilmington that the tough-on-crime measures didn’t work, that the disparities that were created in the ‘80s between crack and cocaine were disproportionately hurting black communities, why did it take until this year for Joe Biden to acknowledge it himself? And we don’t have clear answers to that.\n\narchived recording (joe biden) I haven’t always been right. I know we haven’t always gotten things right. But I’ve always tried.\n\nastead herndon\n\nWe know that Joe Biden very rarely apologizes. But it was not until this year that you really have an articulation from Vice President Biden that he played a role as a senator in creating some of these disparities.\n\narchived recording (joe biden) That Barack and I finally reduced the disparity in sentencing, which we had been fighting to eliminate, in crack cocaine versus powder cocaine. It was a big mistake when it was made. We thought we were told by the experts that, crack, you never go back. It was somehow fundamentally different. It’s not different. But it’s trapped an entire generation.\n\nmichael barbaro\n\nDo you think it’s possible that he might fear that if he apologizes, that that might weaken him more with moderate voters who don’t feel that Americans should have to apologize for that period, for those instincts, and for those policies?\n\nastead herndon\n\nI think that’s a big possibility. I also think Joe Biden was acting in what he believes was good faith, even at that moment, and what he thinks was the evidence in front of him and the context of the time. I think it’s important to always go back to Delaware with him. And in the moment that he comes up in, it is part of his personal and political identity that he was an advocate for the black communities and that he was performing a new role and, frankly, public service to those communities that white politicians had not done in that state. And so I think it’s bigger than just the political realities of right now and what apologizing would mean. To apologize would go to the heart of what his identity has been since he got in public office in the 1970s.\n\nmichael barbaro\n\nMm-hmm. And he’s just not willing to apologize for that. Because in fact, he’s still proud of it.\n\nastead herndon\n\nThe evidence in front of us tells us that’s true. He was praising the crime bill just years ago. And he has called it, at some points, his greatest accomplishment. And he has shown a real resistance to the many opportunities that activists and other rivals have given him to say that those actions were a mistake.\n\n[music]\n\nmichael barbaro\n\nAstead, thank you very much. We appreciate it.\n\nastead herndon\n\nThanks for having me.\n\nmichael barbaro"}, {"url": "https://www.brennancenter.org/our-work/analysis-opinion/how-first-step-act-became-law-and-what-happens-next", "page_content": "Update June 2020: Click here for the latest on how the First Step Act is being implemented.\n\nLast month, the FIRST STEP Act was signed into law — a major win for the movement to end mass incarceration.\n\nFor years, Congress had attempted to pass criminal justice reform legislation, such as the Sentencing Reform and Corrections Act (SRCA) introduced in 2015 by Senators Chuck Grassley (R-Iowa) and Dick Durbin (D-Ill.). But the SRCA failed to pass in 2016 despite overwhelming bipartisan support, thanks to opposition from Sen. Tom Cotton (R-Ark.) and then-Senator Jeff Sessions (R-Ala.).\n\nThat all changed last December when the Senate finally passed, and President Trump signed, the FIRST STEP Act — a modest bill that, despite some initial setbacks, includes key parts of the SRCA. That makes it the first major reduction to federal drug sentences.\n\nWhat happened to make this bill possible? And more importantly — what’s next?\n\nThe making of a criminal justice reform bill\n\nThe Brennan Center has been advocating for federal sentencing reform for years: Attorneys at the Center’s Justice Program were heavily involved in the fight to pass the SRCA and its predecessor, the Smarter Sentencing Act of 2013.\n\nBut when Donald Trump was elected president in 2016, many worried that sentencing reform would prove impossible for the next four years. Trump’s position on criminal justice reform was unclear at best and regressive at worse. His early moves appeared to confirm these suspicions: While still President-Elect, Trump nominated Jeff Sessions, a vocal critic of any reduction to the U.S. prison population, to be the nation’s chief law enforcement officer. Nonetheless, Grassley and Durbin reintroduced the SRCA again in October 2017 and navigated it through committee in early 2018. The bill looked poised to stall once again due to vocal opposition from Sessions.\n\nBut the momentum started to pick up in early 2018, when the White House brokered the Prison Reform and Redemption Act, a bipartisan bill aimed at improving conditions in federal prisons. This bill, which was renamed the FIRST STEP Act after some modest improvements were added, still lacked any meaningful sentencing reform component, meaning it would have done little to reduce the prison population. For the White House, that was part of the appeal: Republican leaders believed that SRCA’s sentencing reform provisions made it a nonstarter among conservatives. But because of that, the Brennan Center and a coalition of more than 100 civil rights groups opposed the bill, arguing that the votes were there for sentencing reform — if only Republican leaders would put a bill on the floor. Nonetheless, the FIRST STEP Act passed the House of Representatives by a wide margin of 360 to 59.\n\nThat’s where the process stood until late last year. A breakthrough occurred in November, when lawmakers and advocates reached a compromise on the FIRST STEP Act, amending it to incorporate four provisions from the SRCA. The measure garnered the support of the president and both Republicans and Democrats in Congress. Critically, the compromise was blessed by Grassley and Durbin, signaling that the new bill adequately met the goals of their own prior bill.\n\nThe FIRST STEP Act initially stalled in the Senate amid opposition from a right-wing minority faction led again by Cotton. And, critically, time was running out in the legislative session, making Republican leaders balk at spending precious floor time on the bill. But another series of compromises quieted opposition from Sen. Ted Cruz (R-Texas) and garnered support for the bill from Sen. John Cornyn (R-Texas), the majority whip, clearing the path for an easy floor vote. After that change and continued pressure from Trump, Grassley, the Koch Brothers, and constituents in Kentucky, Senate Majority Leader Mitch McConnell announced in mid-December that he would bring up the bill for a vote before the end of the year, during the lame-duck Congress.\n\nLongtime opponents of reform like Cotton still had a chance to block the bill: They could run out the clock. But a series of procedural shortcuts allowed McConnell to bring the bill to the floor by essentially slotting the text of the bill into another piece of legislation that was already eligible for Senate consideration. And so another hurdle was cleared.\n\nBut one more remained. During the amendment process for the FIRST STEP Act, Cotton and Sen. John Kennedy (R-La.) pushed for a series of “poison pill” amendments that would have unacceptably weakened the bill and split the bipartisan coalition supporting it, just at the moment of passage. But those amendments ultimately failed to materialize in the final bill, which cleared the Senate by an overwhelming 87–12 margin. Not a single Democrat voted against the bill, and Republican opponents of reform were relegated to a small minority. Next, then-House Speaker Paul Ryan (R-Wis.) cleared the way for quick consideration of the bill in the House of Representatives — and sent it to President Trump’s desk just before Christmas. The president signed the bill on December 21.\n\nCriminal justice reform starts with sentencing reform\n\nThe FIRST STEP Act is consequential because it includes provisions for meaningful sentencing reform, which would reduce the number and amount of people in prison and is part of the starting point of any serious legislation for criminal justice reform. Sentencing laws played a central role in the rise of mass incarceration in recent decades. The federal prison population, in particular, has risen by more than 700 percent since 1980, and federal prison spending has increased by nearly 600 percent. That growth has disproportionally affected Black, Latino, and Native Americans.\n\nFederal mandatory minimum sentences were a catalyst for the recent surge of unnecessarily harsh prison sentences. More than two-thirds of federal prisoners serving a life sentence or a virtual life sentence have been convicted of non-violent crimes.\n\nBut research continues to show that long prison sentences are often ineffective. One Brennan Center study found that overly harsh sentences have done little to reduce crime. In fact, in some cases, longer prison stays can actually increase the likelihood of people returning to criminal activity. These sentences disproportionately impact people of color and low-income communities.\n\nHow the FIRST STEP Act tackles our outdated sentencing laws\n\nThe FIRST STEP Act shortens mandatory minimum sentences for nonviolent drug offenses. It also eases a federal “three strikes” rule — which currently imposes a life sentence for three or more convictions — and issues a 25-year sentence instead. Most consequentially, it expands the “drug safety-valve,” which would give judges more discretion to deviate from mandatory minimums when sentencing for nonviolent drug offenses.\n\nIn an overdue change, the bill also makes the Fair Sentencing Act retroactive. Passed in 2010, the Fair Sentencing Act has helped reduce the sentencing disparity between crack and powder cocaine offenses — a disparity that has hurt racial minorities. The FIRST STEP Act will now apply the Fair Sentencing Act to 3,000 people who were convicted of crack offenses before the law went into effect.\n\nBeyond sentencing reform, the FIRST STEP Act includes provisions that will improve conditions for current prisoners and address several laws that increased racial disparities in the federal prison system. The bill will require federal prisons to offer programs to reduce recidivism; ban the shackling of pregnant women; and expand the cap on “good time credit” — or small sentence reductions based on good behavior — from around 47 to 54 days per year. That “good time” amendment will benefit as many 85 percent of federal prisoners.\n\nThe FIRST STEP Act changes the conversation on mass incarceration\n\nThe FIRST STEP Act is a critical win in the fight to reduce mass incarceration. While the bill is hardly a panacea, it’s the largest step the federal government has taken to reduce the number of people in federal custody. (The federal government remains the nation’s leading incarcerator, and more people are under the custody of the federal Bureau of Prisons than any single state system.)\n\nThe FIRST STEP Act’s overwhelming passage demonstrates that the bipartisan movement to reduce mass incarceration remains strong. And the bill, which retains major parts of SRCA’s sentencing reform provisions, is now known as “Trump’s criminal justice bill.” This means that conservatives seeking to curry favor with the president can openly follow his example or push for even bolder reforms. Finally, this dynamic creates a unique opening for Democrats vying for the White House in 2020 to offer even better solutions to end mass incarceration.\n\nWe’ve taken a first step. Here are some next steps to consider\n\nThe FIRST STEP Act marks progress for criminal justice reform, but it has some notable shortcomings. It will leave significant mandatory minimum sentences in place. In addition, two of the bill’s key sentencing provisions are not retroactive, which minimizes their overall impact.\n\n“It’s imperative that this first step not be the only step,” said Inimai Chettiar, director of the Brennan Center’s Justice Program. “Now we must focus our efforts on bigger and bolder widespread reforms that will make our system more fair and more humane. We know better, and we must do better.”\n\nThe Brennan Center has outlined many additional steps that both federal and state lawmakers can take toward ending mass incarceration in the United States.\n\nOne step is to eliminate incarceration for lower-level crimes, such as minor marijuana trafficking and immigration crimes. The default sentences for those crimes should be alternatives to incarceration, such as treatment, community service, or probation. Second, lawmakers should also pass legislation that would make default prison sentences — which are often excessively long — proportional to the specific crimes committed. If Congress and every state enacted this pair of reforms, the national prison population would be safely reduced by 40 percent. Third, Congress can use the power of the purse to encourage these changes. Washington spends a significant amount of money supporting state criminal justice systems: Those dollars could be used to reward policies that reduce rather than entrench mass incarceration.\n\nUltimately, the FIRST STEP Act is one step in the right direction for reducing mass incarceration in the United States. It has elevated criminal justice reform as a rare space for bipartisan consensus and cooperation in a fractured national political environment. With an awareness of that consensus, we should push for the bigger next steps that will move us toward ending mass incarceration.\n\n(Photo by Tasos Katopodis/Getty Images)"}, {"url": "https://www.brookings.edu/research/a-better-path-forward-for-criminal-justice-changing-prisons-to-help-people-change/", "page_content": "Below is the third chapter from \"A Better Path Forward for Criminal Justice,\" a report by the Brookings-AEI Working Group on Criminal Justice Reform. You can access other chapters from the report here .\n\nPrison culture and environment are essential to public health and safety. While much of the policy debate and public attention of prisons focuses on private facilities, roughly 83 percent of the more than 1,600 U.S. facilities are owned and operated by states.1 This suggest that states are an essential unit of analysis in understanding the far-reaching effects of imprisonment and the site of potential solutions. Policy change within institutions has to begin at the state level through the departments of corrections. For example, California has rebranded their state corrections division and renamed it the California Department of Corrections and Rehabilitation. For many, these are not only name changes but shifts in policy and practice. In this chapter, we rethink the treatment environment of the prison by highlighting strategies for developing cognitive behavioral communities in prison—immersive cognitive communities. This new approach promotes new ways of thinking and behaving for both incarcerated persons and correctional staff. Behavior change requires changing thinking patterns and cognitive behavioral therapy (CBT) is an evidence-based strategy that can be utilized in the prison setting. We focus on short-, medium-, and long-term recommendations to begin implementing this model and initiate reforms for the organizational structure of prisons.\n\nLevel Setting\n\nThe U.S. has seen a steady decline in the federal and state prison population over the last eleven years, with a 2019 population of about 1.4 million men and women incarcerated at year-end, hitting its lowest level since 1995.2 With the COVID-19 pandemic in 2020, criminal justice reformers have urged a continued focus on reducing prison populations and many states are permitting early releases of nonviolent offenders and even closing prisons. Thus, we are likely to see a dramatic reduction in the prison population when the data are tabulated for 2020.\n\nChristy Visher Professor - University of Delaware John Eason Associate Professor - University of Wisconsin\n\nHowever, it is undeniable that the U.S. will continue to use incarceration as a sanction for criminal behavior at a much higher rate than in other Western countries, in part because of our higher rate of violent offenses. Consequently, a majority of people incarcerated in the U.S. are serving a prison sentence for a violent offense (58 percent). The most serious offense for the remainder is property offenses (16 percent), drug offenses (13 percent), or other offenses (13 percent; generally, weapons, driving offenses, and supervision violations).3 Moreover, the majority of people in U.S. prisons have been previously incarcerated. The prison population is largely drawn from the most disadvantaged part of the nation’s population: mostly men under age 40, disproportionately minority, with inadequate education. Prisoners often carry additional deficits of drug and alcohol addictions, mental and physical illnesses, and lack of work experience.4\n\nAccording to data compiled by the U.S. Bureau of Justice Statistics, the average sentence length in state courts for those sentenced to confinement in a state prison is about 4 years and the average time served is about 2.5 years. Those sentenced for a violent offense typically serve about 4.7 years with persons sentenced for murder or manslaughter serving an average of 15 years before their release.5 Thus, it is important to consider the conditions of prison life in understanding how individuals rejoin society at the conclusion of their sentence. Are they prepared to be valuable community members? What lessons have they learned during their confinement that may help them turn their life around? Will they be successful in avoiding a return to prison? What is the most successful path for helping returning citizens reintegrate into their communities?\n\nRegrettably, prison life is often fraught with difficulty. Being sentenced to incarceration can be traumatic, leading to mental health disorders and difficulty rejoining society. Incarcerated individuals must adjust to the deprivation of liberty, separation from family and social supports, and a loss of personal control over all aspects of one’s life. In prison, individuals face a loss of self-worth, loneliness, high levels of uncertainty and fear, and idleness for long periods of time. Imprisonment disrupts the routines of daily life and has been described as “disorienting” and a “shock to the system”.6 Further, some researchers have described the existence of a “convict code” in prison that governs behavior and interactions with norms of prison life including mind your own business, no snitching, be tough, and don’t get too close with correctional staff. While these strategies can assist incarcerated persons in surviving prison, these tools are less helpful in ensuring successful reintegration.\n\nThus, the entire prison experience can jeopardize the personal characteristics required to be effective partners, parents, and employees once they are released. Coupled with the lack of vocational training, education, and reentry programs, individuals face a variety of challenges to reintegrating into their communities. Successful reintegration will not only improve public safety but forces us to reconsider public safety as essential to public health.\n\nDespite the toll of difficult conditions of prison, people who are incarcerated believe that they can be successful citizens. In surveys and interviews with men and women in prison, the majority express hope for their future. Most were employed before their incarceration and have family that will help them get back on their feet. Many have children that they were supporting and want to reconnect with. They realize that finding a job may be hard, but they believe they will be able to avoid the actions that got them into trouble, principally committing crimes and using illegal substances.7 Research also shows that most individuals with criminal records, especially those convicted of violent crimes, were often victims themselves. This complicates the “victim”-“offender” binary that dominates the popular discourse about crime. By moving beyond this binary, we propose cognitive behavioral therapy, among a host of therapeutic approaches, as part of a broader restorative approach.\n\nDespite having histories of associating with other people who commit crimes and use illegal drugs, incarcerated individuals have pro-social family and friends in their lives. They also may have some personality characteristics that make it difficult to resist involvement in criminal behavior, including impulsivity, lack of self-control, anger/defiance, and weak problem-solving and coping skills. Psychologists have concluded that the primary individual characteristics influencing criminal behavior are thinking patterns that foster criminal activity, associating with other people who engage in criminal activity, personality patterns that support criminal activity, and a history of engaging in criminal activity.8 While the context constrains individual behavior and choices, the motivation for incarcerated individuals to change their behavior is rooted in their value of family and other positive relationships. However, most prison environments pose significant challenges for incarcerated individuals to develop motivation to make positive changes. Interpersonal relationships in prison are difficult as there is often a culture of mistrust and suspicion coupled with a profound absence of empathy. Despite these challenges, cognitive behavioral interventions can provide a successful path for reintegration.\n\nMany psychologists believe that changing unwanted or negative behaviors requires changing thinking patterns since thoughts and feelings affect behaviors. Cognitive behavioral therapy (CBT) emerged as a psycho-social intervention that helps people learn how to identify and change destructive or disturbing thought patterns that have a negative influence on behavior and emotions. It focuses on challenging and changing unhelpful cognitive distortions and behaviors, improving emotional regulation, and developing personal coping strategies that target solving current problems.9 In most cases, CBT is a gradual process that helps a person take incremental steps towards a behavior change. CBT has been directed at a wide range of conditions including various addictions (smoking, alcohol, and drug use), eating disorders, phobias, and problems dealing with stress or anxiety. CBT programs help people identify negative thoughts, practice skills for use in real-world situations, and learn problem-solving skills. For example, a person with a substance use disorder might start practicing new coping skills and rehearsing ways to avoid or deal with a high-risk situation that could trigger a relapse.\n\nSince criminal behavior is driven partly by certain thinking patterns that predispose individuals to commit crimes or engage in illegal activities, CBT helps people with criminal records change their attitudes and gives them tools to avoid risky situations. Cognitive behavioral therapy is a comprehensive and time-consuming treatment, typically, requiring intensive group sessions over many months with individualized homework assignments. Evaluations of CBT programs for justice-involved people found that cognitive restructuring treatment was significantly effective in reducing criminal behavior, with those receiving CBT showing recidivism reductions of 20 to 30 percent compared to control groups.10 Thus, the widespread implementation of cognitive behavioral therapy as part of correctional programming could lead to fewer rearrests and lower likelihood of reincarceration after release. CBT can also be used to mitigate prison culture and thus help reintegrate returning citizens back into their communities.\n\nThus, the widespread implementation of cognitive behavioral therapy as part of correctional programming could lead to fewer rearrests and lower likelihood of reincarceration after release.\n\nEven the most robust CBT program that meets three hours per week leaves 165 hours a week in which the participant is enmeshed in the typical prison environment. Such an arrangement is bound to dilute the therapy’s impact. To counter these negative influences, the new idea is to connect CBT programming in prison with the old idea of therapeutic communities. Therapeutic communities—either in prison or the community—were established as a self-help substance use rehabilitation approach and instituted the idea that separating the target population from the general population would allow a pro-social community to develop and thereby discourage antisocial cognitions and behaviors. The therapeutic community model relies heavily on participant leadership and requires participants to intervene in arguments and guide treatment groups. Inside prisons, therapeutic communities are a separate housing unit that fosters a rehabilitative environment.\n\nCognitive Communities in prison would be an immersive experience in cognitive behavioral therapy involving cognitive restructuring, anti-criminal modeling, skill building, problem-solving, and emotion management. These communities would promote new ways of thinking and behaving among its participants around the clock, from breakfast in the morning through residents’ daily routines, including formal CBT sessions, to the evening meal and post-dinner activities. Blending the best aspects of therapeutic communities with CBT principles would lead to Cognitive Communities with several key elements: a separate physical space, community participation in daily activities, reinforcement of pro-social behavior, use of teachable moments, and structured programs. This cultural shift in prison organization provides a foundation for restorative justice practices in prisons.\n\nAccordingly, our recommendations include:\n\nShort-Term Reforms\n\nCreate Transforming Prisons Act\n\nAccelerate Decarceration Begun During Pandemic\n\nMedium-Term Reforms\n\nEncourage Rehabilitative Focus in State Prisons\n\nFoster Greater Use of Community Sanctions\n\nLong-Term Reforms\n\nEmbrace Rehabilitative/Restorative Community Justice Models\n\nEncourage Collaborations between Corrections Agencies and Researchers\n\nSHORT-TERM REFORMS\n\nCreate Transforming Prisons Act\n\nTo begin transforming prisons to help prisons and people change, a new funding opportunity for state departments of correction is needed. We propose the Transforming Prisons Act (funded through the Department of Justice’s Bureau of Justice Assistance) which would permit states to apply for funds to support innovative programs and practices that would improve prison conditions both for the people who live in prisons and work in prisons. This dual approach would begin to transform prisons into a more just and humane experience for both groups. These new funds could support broad implementation of Cognitive Communities by training the group facilitators and the correctional staff assigned to the specialized prison units. Funds could also be used to broaden other therapeutic programming to support individuals in improving pro-social behaviors through parenting classes, family engagement workshops, anger management, and artistic programming. One example is the California Transformative Arts which promotes self-awareness and improves mental health through artistic expression. Together, these programs could mark a rehabilitative turn in corrections.\n\nAccelerate Decarceration Begun During Pandemic\n\nWhile we work to change policies and practices to make prisons more humane, we also need to work towards decarceration. The COVID-19 crisis has enabled innovations in diverting and improving efforts to reintegrate returning citizens in the U.S. During the pandemic, many states took bold steps in implementing early release for older incarcerated persons especially those with health disorders. Research shows that returning citizens of advanced age and with poor health conditions are far less likely to commit crime after release. This set of circumstances makes continued diversion and reintegration of this population a much wiser investment than incarceration.\n\nMEDIUM-TERM REFORMS\n\nEncourage Rehabilitative Focus in State Prisons\n\nIn direct response to calls to abolish prisons and defund the police, state prisons should move away from focusing on incapacitation to rehabilitation. To assist in this change, federal funds should be tied to embracing a rehabilitative mission to transform prisons. This transformation should be rooted in evidence-based therapeutic programming, documenting impacts on both incarcerated individuals and corrections staff. Prison good-time policies should be revisited so that incarcerated individuals receive substantial credit for participating in intensive programming such as Cognitive Communities. With a backdrop of an energized rehabilitative philosophy, states should be supported in their efforts to implement innovative models and programming to improve the reintegration of returning citizens and change the organizational structure of their prisons.\n\nIn direct response to calls to abolish prisons and defund the police, state prisons should move away from focusing on incapacitation to rehabilitation.\n\nFoster Greater Use of Community Sanctions\n\nAs the country with the highest incarceration rate in the world, current U.S. incarceration policies and practices are costly for families, communities, and state budgets. Openly punitive incarceration policies make it exceedingly difficult for incarcerated individuals to successfully reintegrate into communities as residents, family members, and employees. A long-term policy goal in the U.S. must be to reduce our over-reliance on incarceration through shorter prison terms, increased reliance on community sanctions, and closing prisons. The COVID-19 pandemic revealed that decarceration poses minimal risk to community safety. Given this steady decline in the prison population and decline in prison building in the U.S. since 2000, we encourage other types of development in rural communities to loosen the grip of prisons in these areas. Alternative development for rural communities is important because the most disadvantaged rural communities are both senders of prisoners and receivers of prisons with roughly 70 percent of prison facilities located in rural communities.\n\nLONG-TERM REFORMS\n\nEmbrace Rehabilitative/Restorative Community Justice Models\n\nPublic safety and public health goals can be achieved through Community Justice Centers—these are sites that act as a diversion preference for individuals who may be in a personal crisis due to mental health conditions, substance use, or family trauma. Recent research demonstrates that using social or public health services to intervene in such situations can lead to better outcomes for communities than involving the criminal justice system. To be clear, many situations can be improved by crisis intervention expertise specializing in de-escalation rather than involving the justice system which may have competing objectives. Community Justice Centers are nongovernmental organizations that divert individuals in crisis away from law enforcement and the justice system. Such diversion also helps ease the social work burden on the justice system that it is often ill-equipped to handle.\n\nEncourage Collaborations between Corrections Agencies and Researchers\n\nResearchers and corrections agencies need to develop working relationships to permit the study of innovative organizational approaches. In the past, the National Institute of Justice created a researcher-practitioner partnership program, whereby local researchers worked with criminal justice practitioners (generally, law enforcement) to develop research projects that would benefit local criminal justice agencies and test innovative solutions to local problems. A similar program could be announced to help researchers assist corrections agencies and officials in identifying research projects that could address problems facing prisons and prison officials (e.g., safety, staff burnout, and prisoner grievance procedures).\n\nRecommendations for Future Research\n\nSome existing jail and prison correctional systems are implementing broad organization changes, including immersive faith-based correctional programs, jail-based 60- to 90-day reentry programs to prepare individuals for their transition to the community, Scandinavian and other European models to change prison culture, and an innovative Cognitive Community approach operating in several correctional facilities in Virginia. However, these efforts have not been rigorously evaluated. New models could be developed and tested widely, preferably through randomized controlled trials, and funded by the research arm of the Department of Justice, the National Institute of Justice (NIJ), or various private funders, including Arnold Ventures.\n\nCorrectional agencies in some states may be ready to implement the Cognitive Community model using a separate section of a prison or smaller facility not in use. Funding is needed to evaluate these pilot efforts, assess fidelity to the model standards, identify challenges faced in implementing the model, and propose any modifications to improve the proposed Cognitive Community model. Full-scale rigorous tests of the Cognitive Community model are needed which would randomly assign eligible inmates to the Cognitive Community environment or to continue to carry out their sentence in a regular prison setting. Ideally, these studies would observe the implementation of the program, assess intermediate outcomes while participants are enrolled in the program, follow participants upon release and examine post-release experiences in the post-release CBT program, and then assess a set of reentry outcomes at several intervals for at least one year after release.\n\nConclusion\n\nPrison culture and environment are essential to community public health and safety. Incarcerated individuals have difficulty successfully reintegrating into their communities after release because the environment in most U.S. prisons is not conducive to positive change. Normalizing prison environments with evidence-based programming, including cognitive behavioral therapy, education, and personal development, will help incarcerated individuals lead successful lives in the community as family members, employees, and community residents. States need to move towards less reliance on incarceration and more attention to community justice models.\n\nRecommended Readings\n\nEason, John M. 2017. Big House on the Prairie: Rise of the Rural Ghetto and Prison Proliferation. Chicago, IL: Univ of Chicago Press.\n\nTravis, J., Western, B., and Redburn, S. (Eds.). 2014. The Growth of Incarceration in the United States: Exploring Causes and Consequences. National Research Council; Division of Behavioral and Social Sciences and Education; Committee on Law and Justice; Committee on Causes and Consequences of High Rates of Incarceration. Washington, DC: National Academies Press.\n\nOrrell, B. (Ed). 2020. Rethinking Reentry. Washington, DC: American Enterprise Institute.\n\nMitchell, Meghan M., Pyrooz, David C., & Decker, Scott. H. 2020. “Culture in prison, culture on the street: the convergence between the convict code and code of the street.” Journal of Crime and Justice. DOI: 10.1080/0735648X.2020.1772851.\n\nHaney, C. 2002. “The Psychological Impact of Incarceration: Implications for Post-Prison Adjustment.” https://aspe.hhs.gov/basic-report/psychological-impact-incarceration-implications-post-prison-adjustment."}, {"url": "https://prabook.com/web/peter.breen/1951739", "page_content": "Peter Breen\n\npolitician\n\nNovember 4, 1947\n\nFrom 1995-1998 he was Secretary of the Australian Bill of Rights Group, and in 1998 joined Reform the Legal System. In the 1999 New South Wales election he was elected to the Legislative Council. Breen joined the Australian Labor Party on 5 May 2006, but resigned on 18 July to form the Human Rights Party. He unsuccessfully contested the 2007 New South Wales state election. He has campaigned over an alleged miscarriage of justice in the conviction of Stephen Wayne \"Shorty\" Jamieson for the 1988 murder of Janine Balding. In 2016, Breen was a key person in the Renewable Energy Party."}, {"url": "https://www.americanprogress.org/article/5-discussions-shaped-justice-reform-movement-2020/", "page_content": "The system is not broken, it is operating exactly the way it was designed. And unless we work to change the structures and the systems, we will only be putting in policies that we can’t enforce and can’t implement. Color of Change President Rashad Robinson, during the 2020 Innovations Conference\n\nDuring summer 2020, the murders of George Floyd, Breonna Taylor, and too many other Black Americans sparked a national dialogue around the failings of the U.S. criminal justice system. People nationwide joined together in protest of police violence, calling for a new approach to safety and justice. During this crucial moment, the Center for American Progress, the John Jay College of Criminal Justice, and the Draper Richards Kaplan Foundation virtually gathered 1,000 advocates, researchers, artists, and practitioners for the Innovations Conference, a multiday exploration of what it means to reimagine public safety and shrink the footprint of the justice system.\n\nIn the months that followed, public protests, spirited discussions, and grassroots campaigns led to remarkable policy changes across the country. Although the work is far from done, the movement has tangibly reshaped the nation’s approach to justice and safety, offering a powerful example of community activism and civic engagement in action. The sections below break down five major issues that have shaped the national conversation around safety and justice, weaving in voices from the Innovations Conference to provide a snapshot of the country’s progress to date and the pathway forward. 1. Investing in safety beyond policing In most American cities, police department appropriations make up a significant portion of local budgets. Yet communities need more than just investments in policing, a fact that police officers themselves have acknowledged. Investments in community-building resources—including high-quality health care, child care and education, access to affordable housing, and other supportive services—are integral to building safer and stronger neighborhoods.\n\n79% Percentage of American voters who support diverting 911 calls for behavioral health issues to trained civilian first responders instead of police officers Alliance for Safety and Justice, “Toward Shared Safety: The First Ever National Survey of America’s Safety Gaps” (2020).\n\nAs more and more Americans call for investments in safety beyond policing, local lawmakers have started to shift resources toward social supports and nonpunitive strategies, such as civilian first-responder programs and violence intervention models. And many cities are establishing offices within local government that are dedicated specifically to community-building solutions. Examples include: Albuquerque, New Mexico. In June 2020, Mayor Tim Keller (D) announced plans to create the Albuquerque Community Safety Department, a new branch of civilian first responders that provides an alternative to police response for 911 calls related to certain types of nonviolent issues.\n\nIn June 2020, Mayor Tim Keller (D) announced plans to create the Albuquerque Community Safety Department, a new branch of civilian first responders that provides an alternative to police response for 911 calls related to certain types of nonviolent issues. Austin, Texas. In August 2020, the Austin City Council voted to reinvest a portion of the city’s police budget into a range of services aimed at preventing violence, boosting employment outcomes, alleviating chronic homelessness, protecting victims of family violence, and responding to COVID-19.\n\nIn August 2020, the Austin City Council voted to reinvest a portion of the city’s police budget into a range of services aimed at preventing violence, boosting employment outcomes, alleviating chronic homelessness, protecting victims of family violence, and responding to COVID-19. Baltimore. In December 2020, the city of Baltimore established the Mayor’s Office of Neighborhood Safety and Engagement, which is charged with implementing a holistic approach to strengthening safety and addressing the impact of violence and trauma within the community.\n\nIn December 2020, the city of Baltimore established the Mayor’s Office of Neighborhood Safety and Engagement, which is charged with implementing a holistic approach to strengthening safety and addressing the impact of violence and trauma within the community. Minneapolis. In August 2020, with additional funding from the Minneapolis City Council, the Minneapolis Office of Violence Prevention announced the hiring of street outreach workers—known as “violence interrupters”—to detect and de-escalate conflicts before they turn violent.\n\nIn August 2020, with additional funding from the Minneapolis City Council, the Minneapolis Office of Violence Prevention announced the hiring of street outreach workers—known as “violence interrupters”—to detect and de-escalate conflicts before they turn violent. San Francisco. In November 2020, Mayor London Breed (D) launched the Street Crisis Response Team, which sends trained, unarmed professionals in lieu of police to respond to 911 calls involving mental health and substance misuse concerns.\n\nIn November 2020, Mayor London Breed (D) launched the Street Crisis Response Team, which sends trained, unarmed professionals in lieu of police to respond to 911 calls involving mental health and substance misuse concerns. Seattle. In its 2021 budget, the city of Seattle prioritized investments in community safety and well-being, including by expanding tiny house villages and other services for unhoused people, providing appropriate responses to behavioral health crises, revitalizing parks and other community green spaces, and launching initiatives to combat racial inequality within the city.\n\n2. Promoting police accountability American police have significant leeway to use force against civilians, yet officers are rarely held accountable for the harmful—and, in some cases, deadly—consequences of their actions. In recent months, the need for increased police accountability has sparked protests and dominated headlines following a spate of high-profile incidents of police violence against the Black community. Policymakers have begun answering calls to overhaul policing practices, including by establishing use-of-force guidance to proactively prevent misconduct and creating processes to hold officers accountable when misconduct occurs. Voters approved dozens of police reform measures in the November 2020 election, and additional ballot measures are already in the works for local elections in 2021.\n\n90% Percentage of the American public who favor a federal government database to track officers accused of misconduct Pew Research Center, “Majority of Public Favors Giving Civilians the Power to Sue Police Officers for Misconduct” (2020).\n\nWhile it’s still too early to assess the impacts of these newly enacted measures, there is promising evidence emerging from police departments that are farther down the path to reform. For example, the Newark, New Jersey, Police Department began implementing a package of comprehensive police reforms in 2016 after a U.S. Department of Justice investigation found systemic officer misconduct within the department, including biased policing practices and excessive use of force. After overhauling use-of-force guidelines and mandating intensive de-escalation trainings for officers, the Newark police “did not fire a single shot” during the entirety of 2020. Examples of other reforms include: Akron, Ohio. In November 2020, voters in Akron approved Issue 2, a ballot initiative that requires law enforcement agencies to release body and dashboard camera footage following use of force that results in death or serious harm.\n\nIn November 2020, voters in Akron approved Issue 2, a ballot initiative that requires law enforcement agencies to release body and dashboard camera footage following use of force that results in death or serious harm. Colorado. In June 2020, Gov. Jared Polis (D) signed S. 217 into law, which changes guidelines around police use of force and requires law enforcement agencies to collect and report data—such as racial data on officers’ encounters with the public—to the state.\n\nIn June 2020, Gov. Jared Polis (D) signed S. 217 into law, which changes guidelines around police use of force and requires law enforcement agencies to collect and report data—such as racial data on officers’ encounters with the public—to the state. Illinois. The state of Illinois enacted a sweeping criminal justice reform law in February 2021 that sets a statewide standard for use of force, empowers the state attorney general to investigate unconstitutional policing practices, and creates a process for decertifying police officers who engage in misconduct. The bill also expands a database that tracks officer misconduct and prevents law enforcement agencies from destroying officer misconduct records, purchasing certain types of military equipment, or using chokeholds.\n\nThe state of Illinois enacted a sweeping criminal justice reform law in February 2021 that sets a statewide standard for use of force, empowers the state attorney general to investigate unconstitutional policing practices, and creates a process for decertifying police officers who engage in misconduct. The bill also expands a database that tracks officer misconduct and prevents law enforcement agencies from destroying officer misconduct records, purchasing certain types of military equipment, or using chokeholds. New York. In June 2020, Gov. Andrew Cuomo (D) signed into law the “Say Their Name” Reform Agenda package, which permits the disclosure of officers’ prior disciplinary records and designates the New York attorney general as an independent prosecutor for matters relating to civilian deaths.\n\nIn June 2020, Gov. Andrew Cuomo (D) signed into law the “Say Their Name” Reform Agenda package, which permits the disclosure of officers’ prior disciplinary records and designates the New York attorney general as an independent prosecutor for matters relating to civilian deaths. Philadelphia. This past Election Day, Philadelphia residents approved Question 3, a ballot initiative that will replace the city’s Police Advisory Commission with a Citizens Police Oversight Commission, granting it greater authority to investigate police misconduct.\n\nThis past Election Day, Philadelphia residents approved Question 3, a ballot initiative that will replace the city’s Police Advisory Commission with a Citizens Police Oversight Commission, granting it greater authority to investigate police misconduct. Virginia. In October 2020, Gov. Ralph Northam (D) signed into law a bill that allows the state attorney general to conduct pattern-or-practice investigations of police misconduct.\n\n3. Ending unjust punishments Policymakers across the political spectrum have renounced the war on drugs, a punitive policy agenda that has exacerbated mass incarceration by imposing excessive punishments for substance use, particularly for communities of color. Yet in 2019, law enforcement agencies still made more than 1.5 million drug-related arrests, more than 30 percent of which were for possession of marijuana. These statistics hide stark racial disparities in drug enforcement: Despite roughly equal usage rates, Black Americans are nearly four times more likely to be arrested for marijuana possession and six times more likely to be incarcerated for drug charges than their white counterparts.\n\n153% Percentage increase in the average length of incarceration for people convicted of federal drug offenses between 1988 and 2012 The Pew Charitable Trusts, “Prison Time Surges for Federal Inmates” (2015).\n\nPromisingly, jurisdictions across the country are taking action to reverse the harsh penalties of the war on drugs, including 15 states that have legalized recreational marijuana. However, the conversation around unduly severe punishments cannot be limited to low-level, nonviolent offenses. Dismantling mass incarceration will require stakeholders to reevaluate sentencing practices and challenge excessive punishments for all offenses—even serious ones. Jurisdictions across the nation have begun this important work, eliminating unjust punishments and adjusting sentence lengths to ensure that every offense is met with a fair and proportional response. Examples include: Athens, Georgia. Newly elected District Attorney Deborah Gonzalez (D) is using her prosecutorial discretion to address unduly harsh punishments by instructing her office to limit charges that trigger mandatory minimum sentences, decline prosecutions for marijuana possession, and cut back on charges for low-level drug offenses and probation violations.\n\nNewly elected District Attorney Deborah Gonzalez (D) is using her prosecutorial discretion to address unduly harsh punishments by instructing her office to limit charges that trigger mandatory minimum sentences, decline prosecutions for marijuana possession, and cut back on charges for low-level drug offenses and probation violations. Oregon. The state of Oregon adopted a public health approach to addressing substance use after voters approved a ballot measure to decriminalize personal possession of small amounts of all drugs. Starting in February 2021, people in possession of drugs will be offered treatment and recovery services, rather than prison time.\n\nThe state of Oregon adopted a public health approach to addressing substance use after voters approved a ballot measure to decriminalize personal possession of small amounts of all drugs. Starting in February 2021, people in possession of drugs will be offered treatment and recovery services, rather than prison time. Nationwide. Lawmakers in Louisiana, Ohio, and Virginia eliminated life without parole sentences for people under age 18, while Washington, D.C., adopted a law allowing individuals incarcerated for crimes committed while under age 25 to apply for a sentence reduction after serving 15 years in prison.\n\n4. Eliminating racial disparities across the justice system Racial disparities pervade every stage of the American criminal justice system, from police stops to arrest rates to sentencing decisions and beyond. For instance, African Americans are more likely than their white counterparts to be arrested, convicted, and given longer sentences for the same offense. Moreover, amid the COVID-19 public health crisis the incarcerated population—disproportionately comprised of communities of color—faces a heightened risk of contracting the coronavirus, given the confined nature of correctional facilities.\n\n60% Percentage of people who died of COVID-19 in New York state prisons who were Black, March 30, 2020, to May 14, 2020 New York Daily News, “NY prisons see sharp spike in deaths since coronavirus outbreak, blacks hit hardest behind bars” (2020).\n\nWhile more must be done, some jurisdictions have taken key steps to protect incarcerated individuals and reduce overcrowding behind bars, including by curtailing pretrial detention, expanding early release options, and pursuing other reforms that can be sustained even once the pandemic has subsided. Other jurisdictions are directly confronting racial disparities in policing by calling for an end to practices that target communities of color, such as stop and frisk. And importantly, policymakers are looking upstream to disrupt systems that contribute to disparities within the justice system. Many localities are starting to remove police officers from schools in an effort to disrupt the school-to-prison pipeline—the practice of pushing students out of educational systems and into the justice system, which disproportionately criminalizes young people of color for disciplinary violations at school. Examples of all the above include: Fremont, California. In November 2020, the Fremont Unified School District board voted to remove police resource officers from all of the district’s high schools.\n\nIn November 2020, the Fremont Unified School District board voted to remove police resource officers from all of the district’s high schools. California. To combat systemic racism within the justice system, the state of California enacted a package of bills in September 2020 that will address discriminatory practices within jury selection, prohibit prosecutors from seeking convictions or sentences on the basis of defendants’ race or ethnicity, and lay the groundwork for reparations for the Black community.\n\nTo combat systemic racism within the justice system, the state of California enacted a package of bills in September 2020 that will address discriminatory practices within jury selection, prohibit prosecutors from seeking convictions or sentences on the basis of defendants’ race or ethnicity, and lay the groundwork for reparations for the Black community. New Jersey. In October 2020, Gov. Phil Murphy (D) signed into law a bill allowing incarcerated people with less than a year left on their sentences to be released up to eight months early for the duration of the COVID-19 public health emergency. The effort is intended to mitigate harm within New Jersey’s prison system, which had the nation’s worst racial disparities in incarceration rates and the highest rates of COVID-19 deaths behind bars as of November 2020.\n\nIn October 2020, Gov. Phil Murphy (D) signed into law a bill allowing incarcerated people with less than a year left on their sentences to be released up to eight months early for the duration of the COVID-19 public health emergency. The effort is intended to mitigate harm within New Jersey’s prison system, which had the nation’s worst racial disparities in incarceration rates and the highest rates of COVID-19 deaths behind bars as of November 2020. Philadelphia. In November 2020, voters in Philadelphia approved a ballot measure that adds language to the city charter calling on the police department to eliminate unconstitutional stop-and-frisk actions.\n\nIn November 2020, voters in Philadelphia approved a ballot measure that adds language to the city charter calling on the police department to eliminate unconstitutional stop-and-frisk actions. Portland, Maine. In November 2020, voters approved a ballot measure that bans the use of facial recognition technology by the police and other public agencies or businesses.\n\n5. Removing barriers facing individuals affected by the justice system After decades of overcriminalization, nearly 5 million Americans have spent time in prison, and upward of 77 million Americans have some sort of criminal record. Individuals affected by the criminal justice system face immense barriers, even after serving their sentences. Within state and federal laws and regulations, there are roughly 45,000 “collateral consequences” that disqualify people with criminal records from voting, obtaining business or occupational licenses, accessing employment and housing, receiving public assistance, and participating in other key elements of civic life. This vast network of collateral consequences has disenfranchised 5.2 million Americans and contributed to staggering rates of unemployment and housing insecurity among formerly incarcerated individuals.\n\n23% The average jump in wages one year after a person gets their criminal record expunged in Michigan Sonja B. Starr, “Expungement Reform in Arizona: The Empirical Case for a Clean Slate” (2021).\n\nAll too often, policymakers have marginalized the voices of these affected communities, whose firsthand experiences with the justice system are invaluable to the national conversation around reform. Over the past few months, however, jurisdictions have adopted a range of policies to break down barriers facing these communities—from expanding reentry services and voting rights to issuing pardons and sealing old criminal records to provide people with a clean slate. Many of these reforms were driven by justice-involved advocates, whose leadership and expertise must be at the center of the national movement to shrink the criminal justice system. Examples include: California. In November 2020, following a successful campaign led by justice-involved organizers, voters in California approved a constitutional amendment to restore the right to vote for people who have felony convictions and are on parole.\n\nIn November 2020, following a successful campaign led by justice-involved organizers, voters in California approved a constitutional amendment to restore the right to vote for people who have felony convictions and are on parole. Colorado. In October 2020, Gov. Polis pardoned more than 2,700 people convicted of possession of an ounce of marijuana or less.\n\nIn October 2020, Gov. Polis pardoned more than 2,700 people convicted of possession of an ounce of marijuana or less. Dallas. For its fiscal year 2020–2021 budget, the city of Dallas boosted investments in reentry services to expand access to housing, job skills trainings, and wraparound supports for formerly incarcerated residents.\n\nFor its fiscal year 2020–2021 budget, the city of Dallas boosted investments in reentry services to expand access to housing, job skills trainings, and wraparound supports for formerly incarcerated residents. Michigan. In September 2020, Michigan enacted a law that will automatically expunge certain criminal records after seven years, providing a fresh start for hundreds of thousands of people. The “Clean Slate” law was championed by a coalition of advocates representing both formerly incarcerated individuals and survivors of crime."}, {"url": "https://abcnews.go.com/Politics/supporters-criminal-justice-reform-bill-warn-poison-pills/story?id=59870831", "page_content": "The Senate is expected to vote on bill this week.\n\nWith the Senate set to vote this week on White House-backed legislation that seeks to reform the nation’s prison system and sentencing guidelines, supporters are crying foul over a set of amendments they say would effectively gut the bill.\n\nRepublican Sens. Tom Cotton of Arkansas and John Kennedy of Louisiana, two of the most vocal critics of the legislation, have introduced amendments that they say would expand explicit exclusions for violent criminals from early release programs, among other changes.\n\n“If advocates of First Step want to protect public safety, they will support all three amendments,” Cotton said in an Op-Ed in the National Review published Monday.\n\nBut backers of the legislation, known as the First Step Act, say the amendments are actually designed to effectively kill the bill, which they say already excludes violent offenders from early release, and would disincentive prisoners from participating in anti-recidivism programming by giving wardens ultimate veto power in determining a prisoner’s fate.\n\nHolly Harris, a conservative strategist who has been pushing for the bill’s passage in her role as the Executive Director of Justice Action Network, says the Cotton amendments are “not based in reality.”\n\n“This is a person who truly doesn’t understand the prison system. There has to be some incentive to participate in this programming,” Harris said. “This is not a good faith effort but an effort to destroy the bill.”\n\nCriminal justice reform advocate Van Jones, who has been a close ally of the White House on this legislation, said he remains optimistic that ultimately the bill will pass but said the Cotton amendments would deal a blow to the efficacy of the legislation.\n\n“Sen. Cotton is hoping that those amendments will stick and cause some Democrats to bolt from supporting the bill,” said Jones. “We will pass this bill, the question is whether some of his amendments will also make it in.”\n\nA coalition of groups and individuals from across the political spectrum who back the bill penned a joint letter addressed to President Trump expressing their strong opposition to the Cotton-Kennedy amendments.\n\n“The amendments proposed by Senators Cotton and Kennedy will weaken what would otherwise be a significant step towards making our federal prisons more accountable and results oriented. Beyond substance, however, they are political ‘poison pills’,” the letter says.\n\n“Right now we have a system of only sticks and people get bitter, we’re trying to get to a system where there are some carrots and people can have some hope,” Jones said.\n\nDebate on the bill is expected to begin in the Senate Monday night with supporters confident they have the votes needed to advance the bill toward final passage, killing amendments like those from the two conservative GOP senators, according to a senior GOP aide to a bill cosponsor. The White House declined to comment on the attempted revisions to the legislation.\n\nA final vote on the measure is expected mid-week.\n\nThe House must then approve the measure, but aides to members in both chambers have been working behind the scenes to ensure the bill's passage. The bill would then head to the president's desk where he has said he would sign it.\n\nThe bill's approval would be a notable achievement for President Trump's son-in-law, Jared Kushner, who has been the leading advocate for criminal justice reform within the administration and shepherded the White House's legislative effort.\n\nWhite House senior adviser Jared Kushner shakes hands with President Donald Trump during an event on prison reform in the East Room of the White House, May 18, 2018, in Washington. Evan Vucci/AP\n\nThe issue is a personal passion for Kushner, whose own father spent time behind bars for tax evasion and illegal campaign contributions over a decade ago.\n\nPresident Trump’s embrace of the legislation is a departure from his tough-on-crime rhetoric.\n\nWhile the president has gone so far in the past gone as to call for the death penalty for drug dealers, the president has gotten on board with a bill that aims to loosen sentencing guidelines for some nonviolent drug offenses.\n\n“We’re all better off when former inmates can receive and reenter society as law-abiding, productive citizens. And thanks to our booming economy, they now have a chance at more opportunities than they’ve ever had before,” President Trump said in November, announcing his support for the Senate bill.\n\nIn addition to giving judges greater latitude in sentencing for some nonviolent offenses, the First Step Act also seeks to beef up anti-recidivism programming for the nation’s prison population. According to Justice Department figures, approximately three out of every four Americans released from state prison ends up back behind bars within five years, and one in four prisoners in the federal prison system."}, {"url": "https://www.sentencingproject.org/fact-sheet/top-trends-in-criminal-justice-reform-2022/", "page_content": "Overview\n\nThe United States continues to lead the world in incarceration. More than five million people were under some form of correctional control in 2020 (the last year available) with nearly two million in prison or jail. Nationwide, an estimated 70-100 million persons have a criminal record, including at least 19 million persons living with a felony conviction.\n\nChanges in policy and practice may help counter the impact of tough on crime rhetoric that reinforce mass incarceration policies. State lawmakers in at least 15 states and Washington D.C. adopted policy reforms in 2022 that may contribute to decarceration and addressing collateral consequences while promoting effective approaches to public safety. This briefing paper provides an overview of recent policy reforms in the areas of extreme sentencing and decarceration, drug policy, prison reform, probation and parole, guaranteeing voting rights, and youth justice.\n\nChanges in criminal justice policy were realized for various reasons, including an interest in managing prison capacity. Lawmakers have demonstrated interest in enacting reforms that recognize that the nation’s scale of incarceration has produced diminishing returns for public safety. However, stakeholders working to reform adult and youth criminal legal system practices also encountered rhetoric on increases in violent crime which impacted the ability to adopt significant reforms like the repeal of mandatory minimum sentences and expansion of alternatives to incarceration for prison bound defendants. Consequently, legislators and other stakeholders have prioritized implementing policies that provide a more balanced approach to public safety. The evolving framework is rooted in reducing returns to prison for technical violations, expanding alternatives to prison for persons convicted of low level offenses and authorizing earned release for prisoners who complete certain rehabilitation programs."}, {"url": "https://www.brennancenter.org/our-work/research-reports/criminal-justice-reform-state-level", "page_content": "The criminal justice system in America is complex, made up of county courts and jails, state courts and prisons, and a federal justice system with its own courts, judges, and prisons. Reducing mass incarceration means working across this tangled web.\n\nDespite the attention that the federal system gets, most Americans encounter the justice system at the county and state level. In fact, most incarcerated people in America are held in state and county facilities. That is why state reform efforts are so important.\n\nThe staggering number of people behind bars in America\n\nToday, some 2.2 million people are incarcerated in county jails and state and federal prisons, giving the United States the largest prison population in the world.\n\nMany factors building over decades got us here. Since the late 1960s, the government has spent billions of dollars funding crime prevention in the United States that was focused more on policing and punishment than on addressing the root causes of crime. States also enacted a series of laws that dramatically lengthened sentences for many crimes and created entirely new ones. In particular, mandatory minimum sentencing and truth-in-sentencing provisions required individuals to serve longer periods of time behind bars, contributing to the explosion in the nation’s prison population.\n\nThe criminal justice system encompasses more than 1,700 state prisons, 100 federal prisons, 1,700 juvenile correctional facilities, 3,100 local jails, and 80 jails on Native American reservations, as well as other facilities like military prisons.\n\nThese figures underscore an important point: it is impossible to end mass incarceration by focusing on just one aspect of this sprawling system.\n\nHarsher state criminal laws, followed by the prison-building boom\n\nState laws contributed to mass incarceration, and those laws must change to end it. Federal crimes cover a relatively narrow range of conduct, such as drug offenses. State laws, on the other hand, cover crimes that are more recognizable to the average citizen, like drunk driving, shoplifting, and homicide. It’s no surprise, then, that state courts handle many more cases than federal courts.\n\nAs crime rose in the 1970s and 1980s, lawmakers at the state and federal level enacted more draconian laws that ensnared more people in the criminal justice system. In 1973, legislators in New York passed the so-called Rockefeller drug laws, which imposed mandatory minimum 15-year terms for possession of marijuana and other drugs. Michigan and other states quickly enacted similar laws. Continuing this trend, Washington State in 1984 adopted the nation’s first “truth-in-sentencing” law, which required people to serve at least 85 percent of their sentences before becoming eligible for parole. In a domino effect across the country, 27 other states imposed similar requirements.\n\nAlthough violent crime in America peaked in 1991, and crime today remains at historic lows, our nation’s punitive responses to crime resulted in a prison building spree throughout the 1990s. According to the Congressional Research Service, in the mid-1990s, at the peak of the prison construction boom, a new prison opened every 15 days on average.\n\nProsecutors and the vanishing criminal trial\n\nAs the United States continued to build prisons, another trend emerged: the gradual disappearance of the jury trial and its replacement with plea bargaining, to the detriment of defendants’ rights.\n\nAbout 94 percent of criminal cases at the state level are resolved through plea bargaining. This trend increases the already vast discretion wielded by local prosecutors, who handle more than 95 percent of America’s criminal cases.\n\nProsecutors enjoy unique authority to make decisions about what to charge someone with, making deals with witnesses, and negotiating pleas — and they frequently dictate sentences or sentencing ranges. As a result, they have gained greater leverage to extract guilty pleas from defendants and reduce the number of cases that go to trial, often by using the threat of more serious charges with mandatory minimum sentences or other harsh penalties.\n\nIn fact, fewer than 1 in 40 felony cases results in a trial, according to data from 9 states that have published their records since the 1970s, when the ratio was closer to 1 in 12. As New York University Law and Sociology Professor David Garland recently wrote, “The move away from rehabilitation, the spread of mandatory penalties, the creation of new categories of crimes, and the priority given to public safety over offenders’ rights — these all increased prosecutors’ leverage and incentivized them to use it aggressively.”\n\nState prosecutors often seek higher sentences against people who exercise their right to trial — something known as “the trial penalty” or the “trial tax.” Historically, bringing the maximum possible charges has persuaded defendants to plead guilty instead of going to trial. This practice emerged to prioritize resources when courts across the country were overburdened lacked the resources to take every case to trial. Yet, as the late legal scholar William Stuntz noted in The Collapse of American Criminal Justice, “The law of guilty pleas made such pleas easy for prosecutors to extract, which allowed the justice system to increase dramatically the ratio of convicted felons to prosecutors and defense lawyers.” As Stuntz also explained, “Guilty pleas and the quick bargains that precede them have become the system’s primary means of judging criminal defendants’ guilt or innocence.”\n\nCounty jail systems\n\nMany of those incarcerated have yet to even be convicted of a crime. According to 2017 figures from the Justice Department, about 482,000 people in jail were “awaiting court action on a current charge,” and about 260,000 people were convicted of violating a law.\n\nJails are run by local governments, often managed by a sheriff’s department, and they operate independently from other jails in the same state. Jail populations typically consist of those who are being held on bail or bond pending trial and individuals who are serving out short sentences of less than a year.\n\nOn any given day, about 612,000 people are behind bars in county jails. But that number doesn’t reflect the roughly 10.6 million instances of people cycling through jails each year. These are not all separate individuals, as it includes some people who have been rearrested, sometimes many times in one single year.\n\nState prison systems\n\nState prisons today hold about 1.3 million people, representing the biggest chunk of those who are behind bars in America. They typically house people convicted of felonies, which in most states are crimes that carry a sentence of one year or more.\n\nAccording to Justice Department statistics, more than half of those in state prisons are serving sentences for violent crimes: approximately 14 percent were serving time in state prison for murder or non-negligent manslaughter, and about 13 percent of state prisoners were sentenced for rape or sexual assault. As opposed to the federal population, where nearly half of the prison population is incarcerated for a drug offense, only about 15 percent were convicted of a drug offense.\n\nMinor violations\n\nMany state prison admissions result from violations of probation or parole conditions. In fact, in 2017, the states of Washington, Idaho, Vermont, Utah, Maine, New Hampshire, and Pennsylvania admitted more than half of their prisoners for probation or parole violations. Overall, one-third of state prisoners admitted to prison in 2017 entered on a “new commitment” on such a violation, compared with only 10 percent in the federal system.\n\nThese re-incarcerations are often for minor violations, such as failing a drug test or not completing a drug or other required program. States could make a huge dent in the prison population by passing reforms to ensure people are not sent back to prison for minor violations of conditions of probation such as not attending a hearing.\n\nNeeded Reforms\n\nGiven the toll that mass incarceration takes at the state and county level, it’s essential that we focus reform efforts there to ensure that states roll back punitive laws that send too many people to prison for far too long. We’ve created blueprints for that work, including recommendations for sentencing reform and guidelines for prosecutors. Another key step would be for Congress to pass the Reverse Mass Incarceration Act.\n\nNone of these proposals offers a silver bullet. But they will do a great deal to improve the lives of countless Americans as we continue the fight to improve our justice system on multiple fronts."}, {"url": "https://www.rightsadvocacyproject.org/criminal-justice-reform", "page_content": "We all want to feel safe and be treated with dignity. This becomes particularly important when interacting with police officers, both, as a victim of crime or an alleged perpetrator. Therefore, we must always consider mechanisms for improving police accountability.\n\nBody-worn cameras (BWCs) have evolved as a useful tool for promoting police accountability and transparency, particularly in the wake of the Black Lives Matter movement.\n\nWhile there is a rapid expansion in the use of BWCs in Victoria, a lack of specific legislation and external oversight on their use means that any benefit of the technology is in the hands of Victoria Police alone. As a result, the key goals of promoting accountability and efficiency are not being optimised.\n\nVictoria needs urgent reform to ensure that body worn cameras are used in a manner that enhances police accountability.\n\nThis report identifies critical areas related to police use of BWCs and outlines recommendations for legislative and policy reform to ensure that BWCs are used in a way that promotes, accountability and transparency in policing and to ensure BWC are being used in a manner that is consistent, clear and promotes the safety and dignity of all members of the public.\n\nThis report was written by the Rights Advocacy Project’s 2020-2021 criminal justice team: Samantha Varghese, Ovi Rajasinghe, Mahnoor Sikandar, Kiara Wagner, and Katherine Schofield."}, {"url": "https://www.brookings.edu/research/a-better-path-forward-for-criminal-justice-reimagining-pretrial-and-sentencing/", "page_content": "Below is the second chapter from \"A Better Path Forward for Criminal Justice,\" a report by the Brookings-AEI Working Group on Criminal Justice Reform. You can access other chapters from the report here .\n\nThe roots of mass incarceration in the United States lie in policies and practices that result in jail for millions of individuals charged with but not convicted of any crime and lengthy jail or prison sentences for those who are convicted. These policies and practices are the results of 50 years of efforts at criminal justice reform in response to the “War on Crime” and the “War on Drugs” that began in the 1970s—intended to improve public safety, curb drug abuse, and address perceived inequities in the justice system, these reforms also had unintended consequences that exacerbated disparities.\n\nPamela K. Lattimore Senior Director for Research Development, Division for Applied Justice Research - RTI International Cassia Spohn Regents Professor - School of Criminology and Criminal Justice, Arizona State University Matthew DeMichele Senior Research Sociologist - RTI International\n\nAs the United States grapples with yet another iteration of calls for social and racial justice following multiple deaths of Black Americans at the hands of law enforcement, the time is ripe to develop and implement deep structural reforms that will increase fairness and ensure proportionate punishment without sacrificing public safety. Concurrently, practices implemented to address the public health crisis in the Nation’s jails and prisons accompanying the COVID-19 pandemic provide an opportunity to examine whether reducing pretrial detention and prison sentences can be accomplished without negatively affecting public safety.\n\nAs the United States grapples with yet another iteration of calls for social and racial justice following multiple deaths of Black Americans at the hands of law enforcement, the time is ripe to develop and implement deep structural reforms that will increase fairness and ensure proportionate punishment without sacrificing public safety.\n\nThis chapter briefly discusses the evolution of criminal justice reform efforts focused on pretrial and sentencing policies and practices that resulted in unprecedented rates of incarceration that have only recently begun to abate. This discussion is followed by proposals for policy reforms that should be implemented and recommendations for critical research needed to guide future reform efforts.\n\nLevel Setting\n\nDespite declining somewhat over the past two decades, America’s incarceration rate remains the highest in the world.1 Individuals in the United States may spend months in jail awaiting trial and those convicted are more likely than those in peer nations to receive long carceral sentences. Against the backdrop of renewed calls for racial and social justice in response to deaths of Black people at the hands of police, the COVID-19 pandemic has shone an unforgiving spotlight on America’s jails and prisons, where those awaiting trial or serving sentences have experienced disproportionate rates of infection and death due to the spread of the virus. The responses to the pandemic in many jurisdictions have included unprecedented efforts to reduce jail populations and some efforts toward early prison release that provide an opportunity to determine whether reducing pretrial detention or prison sentences can be accomplished without negatively affecting public safety.\n\nThe United States has been engaged in efforts to reform pretrial practices and sentencing for more than five decades. The 1966 Bail Reform Act sought to reduce pretrial detention through the offer of payment of money bond in lieu of detention, while rising violent crime rates and an ongoing “drug war” resulted in the 1984 Pretrial Reform Act that once again led to a reliance on preventive pretrial detention. More recently, there has been a renewed push to reduce reliance on financial requirements for pretrial release in response to concerns about the growing numbers of individuals detained and the disparate impact of these detentions on individuals who are poor and people of color. Risk assessment tools that predict failure to appear and new arrests for those released while awaiting trial have been implemented to support release decisionmaking and to provide an alternative to money bail. These tools have also been suggested as a means to reduce disparities in release that may reflect implicit biases and cognitive errors in judgement by those charged with making release decisions quickly with incomplete information. Risk assessment tools continue to garner support despite criticisms that they perpetuate historical biases that exist in the criminal record information used to make the predictions.\n\nConcerns about disparity, discrimination, and unfairness in sentencing led to a sentencing reform movement that began in the mid-1970s and that, over time, revolutionized sentencing. States and the federal system moved from indeterminate sentencing, in which judges imposed minimum and maximum sentences and parole boards determined how long those incarcerated would serve, to structured sentencing policies that constrained the discretion of judges, ensured that sentences were pegged to crime seriousness and to the criminal history of those found guilty, and, in many jurisdictions, eliminated discretionary release on parole.\n\nAs the “War on Crime” and the “War on Drugs” escalated during the 1980s in response to increasing rates of violent crime and the drug—primarily crack cocaine—epidemic, reformers also championed changes designed to establish more punitive sentencing standards. These changes included sentencing enhancements for use of a weapon, prior criminal history, and infliction of serious injury; mandatory minimum sentences, particularly for drug and weapons offenses; “three-strikes laws” that mandated long prison sentences for repeat offenders; truth-in-sentencing statutes that required individuals to serve more of their sentences before they were eligible for release; and life without the possibility of parole (LWOP) sentences. Federal support for these efforts included funding under the Violent Crime Control and Law Enforcement Act of 1994 (Pub. L. 103-322) that established the Violent Offender Incarceration and Truth-in-Sentencing (VOI/TIS) Incentive Grant Program, which was designed to assist state efforts to remove violent offenders from the community. Over five years (FY1996 to FY2001) this program provided states with $3 billion in funding to expand prison and jail capacity and to encourage states to eliminate indeterminate sentencing in favor of “Truth in Sentencing” laws that required individuals to serve at least 85 percent of the imposed sentence.2\n\nWhat have been the results of these efforts at reform? More individuals detained pretrial as the numbers of individuals booked into jails increased and as the proportion of those held in jail pending trial increased from 56 percent of the jail population in 2000 to 66 percent in 2018. Prison populations also skyrocketed—from about 200,000 in 1970 to 1.43 million in 2019.3 Further, sentences became more punitive, with individuals convicted of felonies in state and federal courts facing a greater likelihood of incarceration and longer sentences than they did in the pre-reform era. The number of individuals serving life—and life without the possibility of parole—sentences also increased dramatically; there are now more offenders serving life sentences than the total number of individual who were held in all U.S prisons in the early 1970s. Worldwide, the United States accounts for more than one-third of all life sentences and eight out of ten LWOP sentences. Moreover, there is persuasive evidence that these punitive changes did not produce the predicted decline in crime but did exacerbate already alarming racial and ethnic disparities in incarceration.\n\nThere are now more offenders serving life sentences than the total number of individuals who were held in all U.S prisons in the early 1970s.\n\nPretrial detention and prison incarceration are linked, as those engaged in recent efforts on pretrial reform recognize. Pretrial detention contributes to mass incarceration both directly and indirectly. Pretrial detention results in a greater likelihood that individuals (irrespective of guilt) will plead guilty, a greater likelihood of being sentenced to incarceration, and longer sentences. These impacts are disproportionately borne by people of color—who are more likely to be detained and less likely to be able to afford bond amounts that are often set higher than for similarly situated White defendants.\n\nThe consequences of pretrial detention are difficult to reconcile given that many of those detained pretrial are charged with offenses that, were they to be found guilty, would be unlikely to result in incarcerative sentences. Research suggests that pretrial detention is linked to substantially higher recidivism rates post sentencing—suggesting that even if pretrial detention reduces some criminal activity during the pretrial period this is more than offset by much higher recidivism rates after individuals serve their sentences. Further, pretrial detention removes individuals presumed innocent from their families and communities—often resulting in the loss of employment and housing, interrupted treatment, and, in some cases, the loss of child custody. Court imposed fines and fees are passed without making income-based adjustments and failure to pay such fines and fees can result in revocation of one’s driver’s license and further incarceration.\n\nHousing America’s prisoners is expensive—more than $88 billion in local, state, and federal taxpayer monies were spent on corrections in 2016.4 Most of those in jail are awaiting trial—so the costs of jail are not to pay for punishment. Instead, pretrial detention is meant to ensure attendance at trial and to protect the public from harm by individuals who have not been convicted of a crime. But, in fact, failure to appear at trial is rare and often due to mundane reasons (e.g., forgetting the trial or hearing date). Similarly, new arrests of those released pretrial are also infrequent with arrests for violent crimes rare.5\n\nThe costs of jail or prison for sentenced individuals are justified in terms of one or more of the purposes of punishment—retribution, incapacitation, deterrence, and rehabilitation. The first of these (retribution) provides voice to the victims of crime and recognizes society’s need for justice. The remaining three are utilitarian justifications of punishment, each of which is designed to prevent or reduce crime. Incarcerated individuals cannot perpetrate new crimes on society at large (incapacitation) and there is a presumption that punishment will deter those who have been punished and those contemplating similar crimes from future criminal acts (deterrence). Finally, as reflected in the last three decades’ focus on reentry programs, society benefits if prisoners can be rehabilitated, reentering society with the skills and desire to be contributing citizens. These goals are often at odds—lengthy prison sentences may be justified by the seriousness of the crime and may act to incapacitate dangerous individuals or to deter potential offenders, but they also may decrease the odds of rehabilitation and successful reentry into the community. Long prison sentences that cause individuals to lose touch with their families and their communities and that reduce their ability to function in society interfere with rehabiliative goals, particularly as the prison environment itself is toxic to individual agency and the skills needed to function in society.\n\nThere is an urgent need to identify a balanced strategy with respect to pretrial justice and sentencing, one that will reduce crime and victimization, ameliorate unwarranted disparities, and reclaim human capital currently lost to incarceration. This strategy should identify the costs incurred across the system and society and ensure that these costs are balanced by the benefits. Further, to ensure that the intent of policy changes is realized and to identify unanticipated consequences, rigorous research should assess the impacts and costs of changes, identifying what is promising.\n\nCriminal justice reform is complicated. In the United States, justice responsibilities are spread across the legislative, executive, and judicial branches of local, state, and federal governments. As a result, the costs and benefits of various justice functions are seldom obvious to those making decisions. Further, the costs often accrue to one branch and level of government while the benefits accrue to another—for example, if the local government implements and pays for a program that diverts individuals with mental illness from jail to treatment, thus reducing future criminal activity, the local police and jail may incur fewer future justice system costs but the greatest savings may accrue to the state government that won’t have to prosecute and incarcerate or supervise these individuals in the future. A judicial decision to detain an individual pretrial or to sentence an individual to years in prison (or on probation) imposes costs that are not borne by the judicial branch. As a result, there is often little incentive to change policies and practices. In addition, laws and decisions are often made to address retributive or incapacitation goals—perhaps with a nod to deterrence—without consideration that less punitive—and less costly—interventions might provide better, long-term societal outcomes. Finally, the justice system is often the system of last resort to address the needs of individuals with mental illness and substance use disorders, who often do not have the education and job skills to be successful in the 21st century. Rethinking how society can better address societal disadvantage may relieve the burdens on the justice system and result in better outcomes.\n\nOur recommendations for achieving these goals include the following:\n\nShort-Term Reforms\n\nCost-benefit Analyses of Pretrial and Sentencing Practices\n\nSet Fines and Fees on Ability to Pay\n\nHold Prosecutors Accountable for Filing and Plea-Bargaining Decisions\n\nReconsider Probation and Parole Practices that Contribute to Mass Incarceration\n\nMedium-Term Reform\n\nInter-Agency Approaches to Reducing Justice System Intervention\n\nLong-Term Reforms\n\nEstablish a Presumption of Pretrial Release\n\nRevise Sentencing Statutes to Ensure Proportionality\n\nSHORT-TERM REFORMS\n\nCost-Benefit Analyses of Pretrial and Sentencing Practices\n\nImmediate changes could be made to reveal the costs across decision points within justice systems to those making decisions, with a goal of ensuring that the incurred costs are equal to the benefits. For pretrial decisions, this means stakeholders would have the information to understand that pretrial detention is not “free,” but instead comes with justice system costs and with collateral costs to the detained, their families, and their communities. If the average cost of a night in jail is $50 or higher6 and given the collateral costs of pretrial detention, how many nights in jail awaiting trial would be justifiable for someone who is charged with a minor crime that would never result in a sentence of incarceration? Does society benefit if an individual spends many nights in jail because they are unable to post $200 to cover a $2000 bond while they are awaiting trial on minor charges or because they were unable to pay fees and fines from a previous case?\n\nJustice systems should consider monetary and extra-monetary costs alongside the usual considerations of judicial officers as to whether someone will miss court or be arrested for a new crime as well as the costs of these very different events. Missing court is likely less costly than incorrectly detaining many people to avoid the potential for missed court appearances—particularly if inexpensive court reminder systems can more cheaply reduce failures to appear. Many jails reduced their pretrial detained populations significantly as the COVID-19 pandemic began and there is little evidence of effects on crime. This may provide a reset in some communities as they consider that what changed was not the risk posed by the detained individuals but the decision to release, as well as reconsideration of the initial decisions to arrest (rather than cite) and book into jail. To this end, jurisdictions need to move away from reliance on financial conditions for release. Few people are denied bail, but most people detained pretrial are there because they are unable to pay bail—a system that advantages the well-off who have the resources to cover bail at the expense of the poor. If bail cannot be eliminated for most charges, policymakers should revisit the use of private bail bond agencies so that individuals who are released only by securing the services of a bail agency do not end up forgoing the ten percent they pay to cover their bail—an expense they incur even if they appear and meet all pretrial conditions.\n\nSetting Fines and Fees Based on Ability to Pay\n\nAnother reform that could be accomplished in the short-term is setting fines and fees based on ability to pay.7 Just as bail differentially disadvantages the poor over the more well-off individual, so do fixed fine and fee schedules that charge the indigent the same as the millionaire. Fixed fines and fees can trap those with limited means in a cycle of fines, fees, jail for failure to pay, more fines, etc. Fine schedules could be developed that set fines based on multiples of the individual’s daily wage (perhaps setting the minimum at the minimum wage for those intermittently employed—for example, $58 representing eight hours of wage at $7.25). Similarly, fees could be adjusted to reflect ability to pay. Neither of these should preclude the ability of judges to waive fees and fines for those unlikely to ever be able to make the payments. In clear cases of indigence, courts should have the authority to waive all fines, fees, and surcharges.”8\n\nHold Prosecutors Accountable for Filing and Plea-Bargaining Decisions\n\nPolicy changes that constrained judicial discretion at sentencing have concomitantly led to increased prosecutorial discretion at charging and plea bargaining. Prosecutors decide whether to file charges that trigger mandatory minimum sentences, life without parole sentences, or habitual offender provisions; whether to dismiss these charges during plea bargaining; and whether to file (and later dismiss) collateral charges that lead to punitive sentence enhancements. An immediate effort needs to be made to hold prosecutors accountable by requiring that they file charges only for offenses for which there is proof beyond a reasonable doubt and a reasonable likelihood of conviction at trial, and by mandating that plea negotiations be in writing and on the record. Prosecutors also should consider establishing sentencing review units that would identify, evaluate, and rectify sentences deemed excessive and disproportionate.\n\nReconsider Probation and Parole Practices that Contribute to Mass Incarceration\n\nJurisdictions should reconsider probation and parole policies and practices that contribute to mass incarceration. In many jurisdictions, a large proportion of those admitted to jail or prison are individuals who violated the conditions of probation or parole. To rectify this, the conditions imposed on individuals placed on probation or parole should be reasonable (and not designed to set them up for failure), judges should use graduated sanctions in responding to probation/parole violations, and probation or parole should be revoked, and a jail or prison sentence imposed, only for repeated or egregious technical violations or for serious new crimes.\n\nMEDIUM-TERM REFORMS\n\nInter-Agency Approaches to Reducing Justice System Intervention\n\nThere should be investment in ongoing performance measurement—across the decision points—so that stakeholders can begin to understand the aggregate impacts of individual decisions. The law at its core is about the individual—the individual victim, the individual defendant, and the individual case. But the decisions that are made individually add up to crowded jails and prisons. These performance measurement systems are not necessarily complex—for example, dashboards to track variation in judicial sentencing or to monitor who is being held in jail provide insight into the overall consequences of the dispensation of justice.\n\nDeveloping and monitoring these process metrics are simply good business practices. Just as a well-run restaurant knows exactly how many ingredients are needed and how long it takes to process each part of an order, a local justice system should know the details of who is in their jail and why. Prosecutors should know how their offices and individual prosecutors manage caseloads and outcomes. Judges should know how their sentencing stacks up with their peers.\n\nMid-term improvements require more sophisticated inter-agency approaches by law enforcement, prosecutors, and the courts.9 These agencies have wide discretion to institute diversion programs, problem-solving courts, and other alternatives to incarceration, and they should collaborate with social service agencies and with public health and educational professionals to address underlying issues, such as behavioral health, substance abuse, or homelessness, that lead to local justice system intervention. Such inter-agency approaches to developing programs reflect that the complex needs of individuals caught in the justice system are the responsibility of society more broadly and not of a justice system poorly equipped and financed to address lifetimes of cumulative disadvantage. These programs need to be adequately funded and designed to provide positive pathways forward. One misunderstanding that accompanied the many early reentry programs was the assumption that the programs and services needed to address the needs and deficits of returning prisoners already existed in communities and only needed to be harnessed through planning and case management. Evaluations of some of the largest federally funded reentry grant programs have repeatedly shown that few individuals releasing from prison access services to address their needs—as services are not available or competing demands such as finding and keeping employment or lack of transportation preclude engagement. Emerging support for the hypothesis that desisting from criminal behavior may have different roots than simply addressing deficits correlated with offending like substance use also suggests that these programs should divert to a positive lifestyle through demonstrations and support for alternative identities.10\n\nLONG-TERM REFORMS\n\nEstablish a Presumption of Pretrial Release\n\nMass incarceration is the result of several decades of policy decisions, and unwinding mass incarceration will require a long-term approach designed to slow the flow of individuals into jails and prisons and to reduce the lengths of sentences they are serving. Pretrial detention is an important component of mass incarceration; something to consider is restricting the crimes for which individuals are booked into jail and establishing a presumption for release for all but the most serious offenses and the individuals who pose the most serious flight risks.\n\nRevise Sentencing Statutes to Ensure Proportionality\n\nIn the long run, the criminal codes that govern the imposition of punishment in municipal, state, and federal justice systems in the United States need to be reformed to ensure that punishment is commensurate with the seriousness of the crime. This will entail ratcheting downward the sentencing ranges associated with various combinations of offense seriousness and criminal history, enhancing eligibility for probation, reducing sentence enhancements for aggravating circumstances, and increasing sentence discounts for mitigating circumstances. In addition, mandatory minimum sentencing statutes and two- and three-strikes laws should be repealed or, if that proves politically unpalatable, dramatically scaled back to ensure that the punishment fits the crime. Jurisdictions also should revise truth-in-sentencing and life sentencing statutes by reducing the amount of time offenders must serve before being eligible for release and should eliminate life without the possibility of parole sentences for all but the most heinous crimes.\n\nRecommendations for Future Research\n\nJustice requires identifying and confirming more effective and cost-efficient ways of securing appropriate outcomes for society, for victims, and for those charged with and convicted of crimes. Reforms should be surrounded with rigorous research and ongoing performance measurement. Basic research is needed to better understand the relationships between policy alternatives and outcomes, and evaluation is needed to ensure that reforms lead to better outcomes, to identify unintended negative consequences, and to embark on a path of continuous improvement of the justice system.\n\nResearchers studying pretrial systems need to assess the impact of current practices and potential reforms on the crime rate, sentencing punitiveness, mass incarceration, and unwarranted disparity in pretrial detention. First, there needs to be more research on cumulative disadvantage to understand how disparities at earlier stages of the process (i.e., pretrial detention) accumulate across the life course of a criminal case to produce harsher treatment of certain categories of offenders. Second, research on the pretrial process needs to address and answer the following questions:\n\nDo financial conditions increase court attendance and decrease crime rates compared to release on recognizance (ROR) or non-financial conditions?\n\nDoes the amount of bail affect outcomes?\n\nHow consequential are pretrial decisions in future decisions about conviction and sentencing? And on future criminal behavior?\n\nWhat are the factors associated with failure to appear? Is there a relationship between the seriousness of the charged offense or the severity of the prior record and failure to appear?\n\nHow does defense counsel at first appearance affect detention decisions and case outcomes?\n\nWhat are the effects of pretrial conditions and supervision practices on failure to appear and new criminal activity?\n\nHow dangerous are pretrial releasees? What is the nature of criminal activity during pretrial release?\n\nWhat considerations and conditions need to attend release decisions for special categories of offenders that may pose special risks to victims (e.g., domestic violence cases) or to justice (e.g., defendants that pose special concerns with respect to witness intimidation)?\n\nSentencing researchers should examine decisions to sentence offenders to life—and especially to life without the possibility of parole; these consequential decisions have not been subjected to the type of empirical scrutiny directed at other sentencing outcomes and thus little is known about the existence of or extent of unwarranted disparities in the application of these punitive punishments. Research is needed to assess the impact of different types of punishment on recidivism rates—that is, to determine whether more punitive sentences lead to higher or lower recidivism rates and whether this relationship varies depending upon the offense of conviction. We know that those sentenced in the United States are more likely to be incarcerated, and for longer terms, than similar individuals in peer countries. What is not known is whether these harsher punishments produce any positive “added value” for society at large.\n\nResearch is needed to produce better estimates of the “costs of punishment” across the justice system and society. These estimates should include the explicit costs to local, state, and federal jurisdictions, but also the implicit costs to individuals, their families, and their communities. These efforts should be accompanied by new work to update estimates of the cost of crimes—both the cost to the criminal justice system but also the costs to victims. These sets of studies will provide the foundations for balancing the costs of crime with the costs of punishment.\n\nAnd, finally, evaluation research should study the process, outcomes, impacts, and costs and benefits of pretrial and sentencing reforms. This research should help to identify what works and what does not work, including identifying unexpected consequences of reform. This research should clearly identify the goals of the reform and then assess how well those goals are met. For example, if changes in detention decisionmaking are intended to reduce racial disparity, a rigorous evaluation should assess the extent to which decisionmaking changes, whether those changes are commensurate with what was envisioned, had an impact on disparity.\n\nConclusion\n\nPretrial release and sentencing policies and practices are a root cause of mass incarceration in the United States. Moreover, these inflexible and punitive policies have disparate effects on the poor and people of color, are not cost effective, and often result in punishment that is disproportionate to the seriousness of the crime. We have outlined a series of short- medium- and long-term reforms designed to slow the flow of people into our nation’s jails and prisons, reduce the number of persons now incarcerated and the lengths of sentences they are serving, and ameliorate unwarranted disparities and unfairness. We also have articulated a series of issues for future research; answers to the questions we pose will be critical to understanding the cost, benefits, and effectiveness of pretrial and sentencing reforms.\n\nRECOMMENDED READING\n\nClear, Todd R. 2008. “The Effects of High Imprisonment Rates on Communities.” Crime and Justice. 37: 97–132.\n\nGottschalk, Marie. 2015. Caught: The Prison State and the Lockdown of American Politics. Princeton: Princeton University Press.\n\nMauer, Marc, and Ashley Nellis. 2018. The Meaning of Life: The Case for Abolishing Life Sentences. New York: The New Press.\n\nNational Research Council. 2014. The Growth of Incarceration in the United States: Exploring Causes and Consequences. Washington, DC: The National Academies Press.\n\nPfaff, John F. 2017. Locked In: The True Causes of Mass Incarceration—and How to Achieve Real Reform. New York: Basic Books.\n\nTonry, Michael. 2014. “Remodeling American -Sentencing: A Ten-Step Blueprint for Moving Past Mass Incarceration.” Criminology & Public Policy 13: 503–533."}]}