{"Peter Breen also sponsored legislation to protect the rights of victims of sexual assault and domestic violence.": [{"url": "https://www.unodc.org/unodc/en/frontpage/2022/February/launch-of-model-legislative-provisions-to-support-and-protect-the-rights-and-needs-of-victims-of-terrorism.html", "page_content": "© UNODC\n\nGeneva/New York/Vienna, 07 February 2022 - The Inter-Parliamentary Union (IPU), together with the United Nations Office of Counter-Terrorism/United Nations Counter-Terrorism Centre (UNOCT-UNCCT) and the United Nations Office on Drugs and Crime (UNODC) launched today the Model Legislative Provisions to support and protect the rights and needs of victims of terrorism, on the occasion of a virtual event.\n\nThe Model Legislative Provisions will serve as a model against which existing national laws and procedures related to victims of terrorism are reviewed, and towards the development of national legislation where applicable. They will also serve to systematize and promote the exchange of information between Member States regarding good practices supporting and protecting victims of terrorism.\n\nThe launch was attended by representatives of Member States, Parliaments, United Nations entities civil society organizations including victims’ associations as well as victims of terrorism.\n\nAt the opening session, Under-Secretary General Voronkov, Head of UNOCT stated that showing political will means supporting victims, understanding their unique needs and realizing their rights. “This can be done by Member States enacting strong domestic legislation that recognizes that victims need support and require accountability, and that establishes mechanisms that are victim-centric, ” he added. “We owe that to the victims, their families and their communities”\n\nMs. Ghada Fathi Waly, Executive Director of UNODC and Director-General of the United Nations Office at Vienna said that “the model provisions, by acknowledging the difficulties victims face and by listening to and incorporating their perspectives, represent a key component of the integrated, comprehensive responses our societies need to prevent terrorist threats and protect people.”\n\nMr. Martin Chungong, Secretary-General of the Inter-Parliamentary Union stressed that “the importance of the Model Legislative Provisions for Victims of Terrorism lies not only in their development, but more importantly, in the need for parliamentarians to transform them into national legislation. Indeed, the work of parliamentarians in drafting legislation is just the beginning of the effort needed to help the victims of terrorism rebuild their lives.”\n\nFollowing the opening session the Model Legislative Provisions were presented by co-authors Professor Jeanne Sulzer and Professor Ben Saul.\n\nHonarable Gennaro Migliore, President of the Parliamentary Assembly of the Mediterranean and Mr. Reinhold Lopatka, Vice-President of the Organization for Security and Co-operation in Europe (OSCE) Parliamantary Assembly delivered keynotes.\n\nThe United Nations Special Rapporteur on the Promotion and Protection of Human Rights and Fundamental Freeddon while Countering Terrorism, Ms. Fionnuala Ní Aoláin chaired an interactive dialogue. The dialogue discussed specific issues related to victims ranging from assistance and support, to reparation, compensation, restitution, and rehabilitation as well as protection, access to justice and the specific needs of women and girls victims of terrorism. It included statements by Mr. Arthur Dénouveaux, President of Life for Paris; Ms. Jacqueline Oudoul, Honorable Professor and Member of Parliament Kenya; Dr. Fatima Ali Haider, Co-Founder of The Grief Directory and Ms. Iman Sayed Taha, UN Women Policy Specialist in the Peace and Security Section.\n\nBackground\n\nThe Model Legislative Provisions were developed through a series of expert consultations organized by UNOCT-UNCCT, IPU and UNODC, which took place in July 2020, and between November 2020-January 2021. The consultations included participation of national institutions, parliaments, civil society organizations including victims’ associations and victims, academic institutions as well as experts from the United Nations and other regional organizations.\n\nA core group of dedicated experts, composed of staff from United Nations Entities, representatives of victims’ associations and victims provided technical support to guide the drafting process of the Model Legislative Provisions.\n\nThe Model Legislative Provisions will include guidance on the implementation of laws and procedures to support adaptation in different countries, as well as provide suggestions for formulating provisions based on various legal systems, as necessary.\n\nThe Provisions are comprehensive and underline the need for States to follow a victim-centric approach in addressing the rights and needs of victims."}, {"url": "https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/16/fact-sheet-reauthorization-of-the-violence-against-women-act-vawa/", "page_content": "This week, President Biden signed into law the Violence Against Women Act Reauthorization Act of 2022, bipartisan legislation passed by Congress as part of the Omnibus appropriations package.\n\nOne of the driving forces of President Biden’s career has been fighting back against abuses of power. That force led him to write and champion the groundbreaking Violence Against Women Act (VAWA) as a U.S. Senator, landmark legislation that first passed in 1994. In the nearly three decades since, he has worked with Members of Congress from both parties to pass legislation to renew and strengthen VAWA three times: in 2000, 2005, and 2013. Each time, he worked to expand access to safety and support for all survivors and increase prevention efforts. Preventing and responding to gender-based violence wherever it occurs, and in all of its forms, has remained a cornerstone of the President’s career in public service—from VAWA reauthorization to a national campaign to combat campus sexual assault to reforms to address sexual assault and harassment in the military.\n\nWhile incidents of domestic violence and sexual assault have declined significantly since VAWA first took effect—and efforts to increase access to services, healing, and justice for survivors have improved with each iteration of VAWA—much work remains.\n\nThe 2022 reauthorization of VAWA strengthens this landmark law, including by:\n\nReauthorizing all current VAWA grant programs until 2027 and, in many cases, increasing authorization levels.\n\nExpanding special criminal jurisdiction of Tribal courts to cover non-Native perpetrators of sexual assault, child abuse, stalking, sex trafficking, and assaults on tribal law enforcement officers on tribal lands; and supporting the development of a pilot project to enhance access to safety for survivors in Alaska Native villages.\n\nIncreasing services and support for survivors from underserved and marginalized communities—including for LGBTQ+ survivors of domestic violence, dating violence, sexual assault and stalking; funding survivor-centered, community-based restorative practice services; and increasing support for culturally specific services and services in rural communities.\n\nEstablishing a federal civil cause of action for individuals whose intimate visual images are disclosed without their consent, allowing a victim to recover damages and legal fees; creating a new National Resource Center on Cybercrimes Against Individuals; and supporting State, Tribal, and local government efforts to prevent and prosecute cybercrimes, including cyberstalking and the nonconsensual distribution of intimate images.\n\nImproving prevention and response to sexual violence, including through increased support for the Rape Prevention and Education Program and Sexual Assault Services Program; expansion of prevention education for students in institutions of higher education; and enactment of the Fairness for Rape Kit Backlog Survivors Act, which requires state victim compensation programs to allow sexual assault survivors to file for compensation without being unfairly penalized due to rape kit backlogs.\n\nStrengthening the application of evidence-based practices by law enforcement in responding to gender-based violence, including by promoting the use of trauma-informed, victim-centered training and improving homicide reduction initiatives.\n\nImproving the healthcare system’s response to domestic violence and sexual assault, including through enhanced training for sexual assault forensic examiners.\n\nUpdating the SMART Prevention Program and the CHOOSE Youth Program to reduce dating violence, help children who have been exposed to domestic violence, and engage men in preventing violence.\n\nEnacting the National Instant Criminal Background Check System (NICS) Denial Notification Act to help state law enforcement investigate and prosecute cases against individuals legally prohibited from purchasing firearms who try to do so.\n\nOver the past year, the Biden-Harris Administration has taken significant steps to prevent and respond to gender-based violence at home and abroad:\n\nIncreased funding for domestic violence and sexual assault services. Directed $1 billion in supplemental funding for domestic violence and sexual assault services through the American Rescue Plan (ARP) in response to the pandemic, including $49.5 million for culturally-specific community-based organizations that help survivors from historically marginalized communities access the services and support they need. The ARP also provided approximately 70,000 housing choice vouchers to local Public Housing Authorities in order to assist individuals and families, including those who are fleeing, or attempting to flee, from domestic violence, dating violence, sexual assault, stalking, or human trafficking.\n\nDirected $1 billion in supplemental funding for domestic violence and sexual assault services through the American Rescue Plan (ARP) in response to the pandemic, including $49.5 million for culturally-specific community-based organizations that help survivors from historically marginalized communities access the services and support they need. The ARP also provided approximately 70,000 housing choice vouchers to local Public Housing Authorities in order to assist individuals and families, including those who are fleeing, or attempting to flee, from domestic violence, dating violence, sexual assault, stalking, or human trafficking. Reformed the military justice system to address sexual assault, harassment, and related crimes. Signed into law the National Defense Authorization Act, which included sweeping reforms to the military justice system—the most significant since the Uniform Code of Military Justice was established more than seventy years ago—and implemented the President’s campaign promise to address the scourge of sexual assault in our armed forces. In conjunction with the President’s Executive Order on military justice reform, this bipartisan, historic law adopts core recommendations of the Independent Review Commission on Sexual Assault, as called for by President Biden, and fundamentally shifts how the military prosecutes and investigates sexual assault, domestic violence, sexual harassment, and other serious crimes, and increases prevention initiatives and support for survivors.\n\nSigned into law the National Defense Authorization Act, which included sweeping reforms to the military justice system—the most significant since the Uniform Code of Military Justice was established more than seventy years ago—and implemented the President’s campaign promise to address the scourge of sexual assault in our armed forces. In conjunction with the President’s Executive Order on military justice reform, this bipartisan, historic law adopts core recommendations of the Independent Review Commission on Sexual Assault, as called for by President Biden, and fundamentally shifts how the military prosecutes and investigates sexual assault, domestic violence, sexual harassment, and other serious crimes, and increases prevention initiatives and support for survivors. Ended forced arbitration for sexual assault and harassment. Signed into law the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021—bipartisan legislation that empowers survivors of sexual assault and harassment by giving them a choice to go to court instead of being forced into arbitration.\n\nSigned into law the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021—bipartisan legislation that empowers survivors of sexual assault and harassment by giving them a choice to go to court instead of being forced into arbitration. Directed action to protect students from campus sexual assault. Directed the Department of Education to review Title IX regulations and other agency actions to ensure that all students have an educational environment that is free from discrimination on the basis of sex. The Department is developing a Notice of Proposed Rulemaking currently under review that will address the need for protection for students who experience campus sexual assault while treating all students fairly.\n\nDirected the Department of Education to review Title IX regulations and other agency actions to ensure that all students have an educational environment that is free from discrimination on the basis of sex. The Department is developing a Notice of Proposed Rulemaking currently under review that will address the need for protection for students who experience campus sexual assault while treating all students fairly. Increased resources for survivors of crime, including gender-based violence. Signed into law the Amendments to the Victims of Crime Act (VOCA), which passed Congress with strong bipartisan support and expands the allocation of resources for the Crime Victims Fund. This has already resulted in an increase of hundreds of millions of dollars of non-taxpayer funding for essential and lifesaving services to crime victims around the country, including survivors of gender-based violence.\n\nSigned into law the Amendments to the Victims of Crime Act (VOCA), which passed Congress with strong bipartisan support and expands the allocation of resources for the Crime Victims Fund. This has already resulted in an increase of hundreds of millions of dollars of non-taxpayer funding for essential and lifesaving services to crime victims around the country, including survivors of gender-based violence. Led multinational effort to address online harassment and abuse. Launched the Global Partnership for Action on Gender-Based Online Harassment and Abuse during the 2022 meeting of the United Nations Commission on the Status of Women, together with the governments of Denmark, Australia, the United Kingdom, and Sweden. This multinational initiative will align countries, international organizations, and civil society to better prioritize, understand, and address the growing scourge of technology-facilitated gender-based violence.\n\nLaunched the Global Partnership for Action on Gender-Based Online Harassment and Abuse during the 2022 meeting of the United Nations Commission on the Status of Women, together with the governments of Denmark, Australia, the United Kingdom, and Sweden. This multinational initiative will align countries, international organizations, and civil society to better prioritize, understand, and address the growing scourge of technology-facilitated gender-based violence. Prioritized the crisis of Missing or Murdered Indigenous People, including gender-based violence. Issued an executive order directing the Departments of Justice, Interior, Homeland Security and Health and Human Services to create a strategy to improve public safety and justice for Native Americans and to address the epidemic of missing or murdered Indigenous peoples, which disproportionately affect Native women, girls, and LGBTQI+ individuals; the Department of the Interior established the Missing and Murdered Unit to pursue justice for missing or murdered American Indians and Alaska Natives.\n\nIssued an executive order directing the Departments of Justice, Interior, Homeland Security and Health and Human Services to create a strategy to improve public safety and justice for Native Americans and to address the epidemic of missing or murdered Indigenous peoples, which disproportionately affect Native women, girls, and LGBTQI+ individuals; the Department of the Interior established the Missing and Murdered Unit to pursue justice for missing or murdered American Indians and Alaska Natives. Strengthened regional leadership on violence against Indigenous women and girls. Re-launched the United States’ leadership and participation in the Trilateral Working Group on Violence Against Indigenous Women and Girls with the Governments of Mexico and Canada. The White House will host the Fourth Convening of the Trilateral Working Group this summer to improve and reaffirm our respective national and regional commitments to prevent and respond to violence against Indigenous women and girls through increased access to justice and prevention services.\n\nOn International Women’s Day in 2021, President Biden signed an Executive Order creating the White House Gender Policy Council and calling for the development of the first-ever government-wide National Action Plan to End Gender-Based Violence, as well as an update to the 2016 United States Strategy to Prevent and Respond to Gender-Based Violence Globally. These strategies will provide a roadmap to guide the Biden-Harris Administration’s whole-of-government effort to end gender-based violence—and in so doing, create a society where survivors are supported and all people can live free from abuse.\n\n###"}, {"url": "https://www.gov.uk/government/publications/the-code-of-practice-for-victims-of-crime/code-of-practice-for-victims-of-crime-in-england-and-wales-victims-code", "page_content": "Summary of Victims’ Rights\n\n1. To be able to understand and to be understood\n\nYou have the Right to be given information in a way that is easy to understand and to be provided with help to be understood, including, where necessary, access to interpretation and translation services.\n\n2. To have the details of the crime recorded without unjustified delay\n\nYou have the Right to have details of the crime recorded by the police as soon as possible after the incident. If you are required to provide a witness statement or be interviewed, you have the Right to be provided with additional support to assist you through this process.\n\n3. To be provided with information when reporting the crime\n\nYou have the Right to receive written confirmation when reporting a crime, to be provided with information about the criminal justice process and to be told about programmes or services for victims. This might include services where you can meet with the suspect or offender, which is known as Restorative Justice.\n\n4. To be referred to services that support victims and have services and support tailored to your needs\n\nYou have the Right to be referred to services that support victims, which includes the Right to contact them directly, and to have your needs assessed so services and support can be tailored to meet your needs. If eligible, you have the Right to be offered a referral to specialist support services and to be told about additional support available at court, for example special measures.\n\n5. To be provided with information about compensation\n\nWhere eligible, you have the Right to be told about how to claim compensation for any loss, damage or injury caused as a result of crime.\n\n6. To be provided with information about the investigation and prosecution\n\nYou have the Right to be provided with updates on your case and to be told when important decisions are taken. You also have the Right, at certain stages of the justice process, to ask for decisions to be looked at again by the relevant service provider.\n\n7. To make a Victim Personal Statement\n\nYou have the Right to make a Victim Personal Statement, which tells the court how the crime has affected you and is considered when sentencing the offender. You will be given information about the process.\n\n8. To be given information about the trial, trial process and your role as a witness\n\nIf your case goes to court, you have the Right to be told the time, date and location of any hearing and the outcome of those hearings in a timely way. If you are required to give evidence, you have the Right to be offered appropriate help before the trial and, where possible, if the court allows, to meet with the prosecutor before giving evidence.\n\n9. To be given information about the outcome of the case and any appeals\n\nYou have the Right to be told the outcome of the case and, if the defendant is convicted, to be given an explanation of the sentence. If the offender appeals against their conviction or sentence, you have the Right to be told about the appeal and its outcome.\n\n10. To be paid expenses and have property returned\n\nIf you are required to attend court and give evidence, you have the Right to claim certain expenses. If any of your property was taken as evidence, you have the Right to get it back as soon as possible.\n\n11. To be given information about the offender following a conviction\n\nWhere eligible, you have the Right to be automatically referred to the Victim Contact Scheme, which will provide you with information about the offender and their progress in prison, and if/when they become eligible for consideration of parole or release. Where applicable, you also have the Right to make a new Victim Personal Statement, in which you can say how the crime continues to affect you.\n\n12. To make a complaint about your Rights not being met\n\nIf you believe that you have not received your Rights, you have the Right to make a complaint to the relevant service provider. If you remain unhappy, you can contact the Parliamentary and Health Service Ombudsman.\n\nIntroduction\n\nWhat is the Victims’ Code?\n\nThe Code of Practice for Victims of Crime[footnote 1] (Victims’ Code) sets out the services and a minimum standard for these services that must be provided to victims of crime by organisations (referred to as service providers) in England and Wales.\n\nWho is a ‘victim’ under this Code?\n\nThis Code acknowledges that the terms ‘complainant’ and ‘survivor’ are often used in the criminal justice system to describe a person who has made a criminal allegation to the police. However, for the purpose of this Code, the definition of a ‘victim’ is:\n\na person [footnote 2] who has suffered harm, including physical, mental or emotional harm or economic loss which was directly caused by a criminal offence [footnote 3]\n\nwho has suffered harm, including physical, mental or emotional harm or economic loss which was directly caused by a criminal offence a close relative[footnote 4] (or a nominated family spokesperson) of a person whose death was directly caused by a criminal offence.\n\nYou can also receive Rights under this Code if you are:\n\na parent or guardian of the victim if the victim is under 18 years of age [footnote 5] or\n\nor a nominated family spokesperson if the victim has a mental impairment or has been so badly injured because of a criminal offence that they are unable to communicate or lacks the capacity to do so.\n\nAll service providers must have the victim’s best interests as their primary consideration and take the victim’s age, maturity, views, needs and concerns fully into account.\n\nWhich Rights will apply to you?\n\nWhich Rights apply to you will depend on whether the crime is reported to the police, if the case goes to court, and whether the defendant is convicted, as well as your personal needs and circumstances. Rights 1, 4 and 12 apply to all victims. The remaining Rights only apply where a crime has been reported to the police. The relevant service provider will tell you which Rights apply to you.\n\nHow can I expect to be treated?\n\nYou have the Right to:\n\nbe treated with respect, dignity, sensitivity, compassion and courtesy;\n\nmake informed choices that are fully respected;\n\nhave your privacy respected by service providers in accordance with their obligations under the relevant privacy and data protection laws; and\n\nhave services provided to assist you and your family to understand and engage with the criminal justice process and that are offered in a professional manner, without discrimination of any kind.\n\nSupport for witnesses\n\nIf you have suffered harm, including physical, mental or emotional harm or economic loss, as a direct result of witnessing a crime, you are a victim of crime for the purposes of this Code and are able to access services that support victims. You do not need to have provided a statement to or been interviewed by the police, or be required to attend court as a witness.\n\nAll other witnesses can access services provided under the Witness Charter [footnote 6] rather than under this Code.\n\nResident status\n\nYou have the Right to services under this Code regardless of your resident status. However, if the crime was committed in England or Wales but you live elsewhere, you should access support services where you live. If you are required to give evidence in court in England or Wales, you will be able to access support services while you are in England or Wales.\n\nFamilies bereaved[footnote 7] by murder or manslaughter abroad\n\nFamilies bereaved by murder or manslaughter of a British national committed outside of the United Kingdom should contact the Foreign, Commonwealth & Development Office. They provide support and information about processes in the country where the incident occurred, including repatriation of the deceased. They may also be able to refer the deceased’s family to specialist support services. Further information is available by calling: 020 7008 5000[footnote 8] or at: Death abroad through murder or manslaughter\n\nThere is a Memorandum of Understanding to help clarify the role of the Foreign, Commonwealth & Development Office, the police and coroners in England and Wales, when a British national is a victim of murder, manslaughter or infanticide abroad. The Memorandum focuses on both the deceased and their family and explains what type of support is available.\n\nHow can I ensure I receive the best service?\n\nService providers will try to minimise the number of different people you have contact with during your case, and wherever possible, offer you a single point of contact for information. To assist them in delivering your Rights under this Code, you should:\n\nlet them know if your contact details or preferences change\n\nask them questions if you are unsure about anything related to your case or the criminal justice process, and\n\ngive service providers your views on the services they are providing to help them deliver and tailor a high-quality service.\n\nWhat if I do not want to receive the Rights offered under this Code?\n\nYou may decide that you do not want some or all of the Rights under this Code. You should discuss this with the relevant service provider.\n\nYou can choose to opt back in to receiving Rights under this Code at any time while the case is under active investigation, or prosecution, or the offender is serving their sentence. This does not apply to the Right to access support to help you to cope, and as far as possible, recover from being a victim of crime.\n\nThis Right is available regardless of whether anyone has been charged, convicted of a criminal offence and regardless of whether you decide to report the crime to the police or you do not wish to cooperate with the investigation.\n\nYour Right to be protected\n\nYou have the Right to be protected from re-victimisation, intimidation and retaliation during and after the investigation and proceedings. If you are concerned for your immediate safety, you should contact the police on: 999.\n\nIn the unlikely event that the suspect (pre-trial) or offender (following conviction) escapes from custody, the police will contact you. If it is assessed that the suspect or offender poses a significant risk of harm to you, they will take any necessary measures to ensure your on-going protection.\n\nIf you are receiving unwanted contact from an offender in prison, you should contact Her Majesty’s Prison and Probation Service Victim Helpline[footnote 9] on: 0300 060 669910 or email: victim.helpline@justice.gov.uk\n\nIf you receive unwanted contact from an offender who is on licence in the community, you can contact the police or if you have one, your Victim Liaison Officer. If the offender is under 18, you can also report any unwanted contact to the police, but if you know they are being supervised by a Youth Offending Team, you may wish to contact the team directly. Contact details for Youth Offending Teams are available at: www.gov.uk/government/collections/youth-offending-team-contact-details\n\nInformation provided under this Code\n\nService providers must include information about this Code on their websites. This information must also signpost victims to the relevant pages on: GOV.UK\n\nWhere required to share information under this Code, service providers must do so effectively and in accordance with their obligations under the Data Protection Act and General Data Protection Regulation 2018 and other relevant legislation.\n\nWhere there is a high number of victims involved in a case, such as large-scale investment frauds with multiple investor victims, or in other exceptional cases, the service provider may communicate information[footnote 10] that a victim has the Right to under this Code through alternative channels, such as their website, rather than contacting each victim individually.\n\nNothing in this Code requires a service provider to provide information to the victim where its disclosure:\n\ncould result in harm to any person\n\ncould affect the proper handling of any criminal investigation or prosecution, or could otherwise prejudice any civil or criminal case, or parole proceedings, or\n\nwould, in the service provider’s view, be contrary to the interests of national security.\n\nGenerally, journalists can attend and report events that happen in court. Sometimes the media may take an interest in a case and approach you and/or your family for comment. There is no obligation to speak to them. However, you should be careful that you do not do anything to risk unfairly influencing the outcome of a court case and being in contempt of court[footnote 11]\n\nIf you have any concerns or would like some advice, you can speak with the police or a victim support provider. Alternatively, you can contact the Independent Press Standards Organisation, who will talk to you about your concerns and give practical advice and guidance.\n\nAccess to medical support\n\nIf you have been the victim of crime and have a physical or mental health need as a result, you can access National Health Service services. You do not need to have reported a crime to the police in order to access these services.\n\nIf someone is seriously ill or injured and their life is at risk, call the emergency services on: 999. If it is not a life-threatening emergency, there are several options you can take. You can:\n\nCall 111 (National Health Service England) or 0845 46 47 (National Health Service Wales) non-emergency medical helpline;\n\ngo to your local National Health Service walk-in centre or local urgent care centre/minor injuries unit or your local Accident and Emergency (A&E) service department;\n\nvisit or call your General Practitioner, who can refer you to specialist services including mental health support; or\n\ntalk to a pharmacist.\n\nMore information about National Health Service services is available at www.nhs.uk or www.wales.nhs.uk, or by calling: 111/0845 46 47 in (England/ Wales) or by visiting your General Practitioner.\n\nAs well as being referred by the police, you can also refer yourself to a Sexual Assault Referral Centre[footnote 12]. These centres have specially trained professionals who can give you both physical and mental health support if you have experienced rape or sexual assault, regardless of whether you choose to report the crime to the police or not.\n\nYou can also access a wide range of psychological and emotional counselling and therapeutic approaches provided in a wide variety of settings, for instance, the National Health Service, voluntary sector agencies and private practice. If you are not ordinarily resident in the United Kingdom, you should note that some health services are exempt from payment, such as primary care services; services for the treatment of a physical or mental condition caused by torture, female genital mutilation, domestic violence, sexual violence or if you are determined a victim of modern slavery or human trafficking. Further details are available at: www.gov.uk/guidance/nhs-entitlements-migrant-health-guide\n\nCoroners\n\nCoroners are not included as service providers under this Code. This is because inquests are not criminal proceedings and bereaved family members already have interested person status in inquests which gives them certain statutory Rights. This includes the Right to ask relevant questions of the witnesses and to receive disclosure of documents and other evidence. Bereaved family members of a victim of crime who are involved in an inquest should instead consult the guidance on coroners’ investigations for bereaved people which is available at: www.gov.uk/government/publications/guide-to-coroner-services-andcoroner-investigations-a-short-guide\n\nWho is responsible for meeting the Rights under this Code?\n\nThe following organisations are required to deliver the Rights under this Code:\n\nPolice and Crime Commissioners\n\nAll police forces in England and Wales, the British Transport Police and the Ministry of Defence Police\n\nPolice Witness Care Units [footnote 13]\n\nThe Crown Prosecution Service\n\nHer Majesty’s Courts and Tribunals Service\n\nHer Majesty’s Prison and Probation Service\n\nThe National Probation Service\n\nThe Parole Board for England and Wales\n\nThe Criminal Cases Review Commission\n\nThe Criminal Injuries Compensation Authority\n\nThe UK Supreme Court\n\nYouth Offending Teams\n\nUnder this Code some victims will receive their Rights through a combination of the service providers listed above and other service providers, including:\n\nThe Competition and Markets Authority\n\nDepartment for Business, Energy and Industrial Strategy (Criminal Enforcement)\n\nThe Environment Agency\n\nThe Financial Conduct Authority\n\nThe Gambling Commission\n\nThe Health and Safety Executive\n\nHer Majesty’s Revenue and Customs\n\nHome Office (Immigration Enforcement)\n\nThe Information Commissioner’s Office\n\nIndependent Office for Police Conduct\n\nThe National Crime Agency\n\nThe National Health Service\n\nNatural Resources Wales\n\nThe Office of Rail and Road\n\nThe Serious Fraud Office\n\nOther service providers can also have a role in relation to the investigation and/or prosecution of crimes.[footnote 14] However, unlike the police and the Crown Prosecution Service, who have a broad remit to investigate and prosecute crimes, these service providers are limited to investigating and prosecuting specific types of offences committed in certain circumstances. This will determine the way in which, and frequency with which, they come into contact with victims.\n\nThe Rights in this Code only apply where other service providers (such as those listed above) accept formal responsibility for conducting a criminal investigation or making a decision to prosecute. However, not all functions undertaken by other service providers are identical to those carried out by the police and the Crown Prosecution Service. Where functions are equivalent to a service provider under this Code (for example the other service provider is investigating or prosecuting an alleged offence), they must deliver the same Rights without unjustified delay, regardless of whether the other service provider is listed above.\n\nThe role of Police and Crime Commissioners\n\nPolice and Crime Commissioners are locally elected to secure efficient and effective policing. They have a legal duty to consult with victims in setting the policing priorities in their area and to hold the Chief Constable of the police in their area to account. They are responsible for commissioning many of the services that support victims outlined in this Code.\n\nThe role of the Commissioner for Victims and Witnesses (Victims’ Commissioner)\n\nThe Victims’ Commissioner is not listed as a service provider under this Code. This is because the Commissioner has a statutory duty to keep this Code under regular review. It is part of the Commissioner’s role to listen to the views of victims, understand the criminal justice system from the victims’ point of view and try to help improve the services and support available. The Victims’ Commissioner cannot help with individual cases or challenge criminal justice agencies to make different decisions.\n\nEnhanced Rights\n\nThis Code acknowledges that victims who are considered vulnerable or intimidated, are a victim of the most serious crime (including a bereaved close relative) or have been persistently targeted are more likely to require specialised assistance (some victims may fall into one or more of these categories). Such support may include being offered a referral to a specialist support service, being contacted sooner after key decisions and having access to special measures (see Right 4) Within each individual Right this Code highlights where such Enhanced Rights apply.\n\nOnce a service provider has identified that you are eligible for Enhanced Rights, they must ensure that this information is passed to other service providers with responsibilities under this Code and, where appropriate, to services that support victims.\n\nIf you do not fall within the categories outlined above, a service provider may decide to provide access to certain Enhanced Rights depending on your circumstances or the impact of the crime.\n\nYou are eligible for Enhanced Rights under this Code as a vulnerable[footnote 15] victim if:\n\nyou are under 18 years of age at the time of the offence, [footnote 16] or\n\nor the quality of your evidence is likely to be affected because you suffer from mental disorder within the meaning of the Mental Health Act 1983 have a physical disability or are suffering from a physical disorder.\n\n\n\nYou are also eligible for Enhanced Rights under this Code as an intimidated victim if the service provider considers that the quality of your evidence will be affected because of your fear of distress about testifying in court.[footnote 17]\n\nWhen assessing whether a victim is intimidated, the service provider must consider:\n\nthe behaviour towards the victim on the part of the suspect, members of their family or associates, or any other person who is likely to be a suspect or witness in the case\n\nthe victim’s age\n\nif relevant, the victim’s social and cultural background, religious beliefs or political opinions, ethnic origin, domestic and employment circumstances\n\nthe nature and alleged circumstance of the offence to which the case relates (victims of a sexual offence or human trafficking will be considered to be intimidated), and\n\nany views expressed by the victim.\n\nVictims of the most serious crime\n\nYou are eligible for Enhanced Rights under this Code as a victim of the most serious crime, if you are a close relative bereaved by a criminal offence, a victim of domestic abuse, hate crime, terrorism, sexual offences, human trafficking, modern slavery, attempted murder, kidnap, false imprisonment, arson with intent to endanger life and wounding or causing grievous bodily harm with intent.\n\nAdditional Enhanced Rights that are available for bereaved close relatives are highlighted separately within each individual Right of this Code.\n\nPersistently targeted victims\n\nYou are eligible for Enhanced Rights under this Code as a persistently targeted victim if you have been targeted repeatedly as a direct victim of crime over a period of time, particularly if you have been deliberately targeted or if you are a victim of a campaign of harassment or stalking.\n\nRight 1: To be able to understand and to be understood\n\n1.1 You have the Right to be helped to understand what is happening and to be understood. In considering appropriate measures, service providers must consider any relevant personal characteristics which may affect your ability to understand and to be understood. All service providers must communicate in simple and accessible language and all translation or interpretation services must be offered free of charge to the victim.\n\n1.2 If, due to the impact of the crime, you need assistance to understand or to be understood, you can be supported by a person of your choice, unless the service provider considers that it would not be in your best interests or that it would impact the investigation or prosecution. In these circumstances, the service provider will tell you why.\n\n1.3 If you have difficulty understanding or speaking English, you have the Right to use an interpreter[footnote 18] to help you understand, when:\n\nreporting a criminal offence [footnote 19]\n\nbeing interviewed by the police\n\ngiving evidence as a witness\n\n1.4 You can also receive the translation of any document where it is essential for the purposes of the interview or court proceedings to read a document that is given to you, including:\n\nthe written acknowledgment of the reported crime\n\nwhere it is essential for the purposes of the interview or court hearing to see a particular document that is disclosed to you, a copy of the relevant parts of the document\n\ncommunication informing you of the date, time and location of the trial\n\nthe outcome of criminal proceedings and, where available, the reasons for the decision\n\nthe response to any complaint or request made under the Victims’ Right to Review Scheme.[footnote 20]\n\n1.5 You can also receive an oral translation or summary of any of the documents listed above, unless doing so would prejudice the fairness of the proceedings.\n\n1.6 For cases heard in Wales, you have the legal Right to use Welsh when giving evidence and the court will make the necessary arrangements.[footnote 22] You also have the Right to submit a Victim Personal Statement to the Parole Board in Welsh, irrespective of the location of the offender, and to ask for a summary of the parole decision to be provided in Welsh.\n\nRight 2: To have the details of the crime recorded without unjustified delay\n\n2.1 You have the Right to have details of the crime recorded by the police without unjustified delay after the incident. When you report an incident, you will be asked to provide details about the crime.\n\n2.2 If you are asked to make a witness statement, the police will explain to you that this may result in you needing to give evidence at court, if the case goes to trial.\n\n2.3 If you are asked to be interviewed, any interview should take place without unjustified delay, the number of interviews should be kept to a minimum and where possible be conducted by the same person. The police must take any steps necessary to ensure that you (and your family) do not have unnecessary contact with the suspect.\n\n2.4 The police must consider whether you would benefit from additional support, for example, the assistance of an interpreter, and that any interview is carried out by or through professionals trained for that purpose. They must also seek to ensure that it takes place in premises designed or adapted for the purpose. If this is not possible, the police will tell you why.\n\n2.5 You also have the Right to request to bring a person of your choice to the interview. If this is not possible, the police will tell you why.\n\n2.6 If the police or the Crown Prosecution Service believe that the quality of your evidence may be adversely affected by a vulnerability, they must consider whether you are eligible for support from a Registered Intermediary (see Right 4) and make any other reasonable adjustments based on your needs.\n\nWhat is a Registered Intermediary? A Registered Intermediary is a self-employed communication specialist who helps vulnerable victims and witnesses with communication difficulties to give evidence to the police and to the court in criminal trials.\n\n\n\nA victim/witness might need the help of a Registered Intermediary because of their age, a learning disability, a mental disorder or a physical disability that affects their ability to communicate. They are often the difference between a witness being able to give evidence or not.\n\n2.7 If a medical examination is required for the purposes of the criminal proceedings, these must be kept to a minimum and are subject to your consent.\n\n2.8 If you are a victim of sexual violence, gender-based violence or domestic abuse, you have the Right to request that the police officer conducting the interview is of a gender of your choice. The police must meet your request unless doing so would prejudice the fairness of the proceedings. If this happens, the police will tell you why.\n\n2.9 If you are considered vulnerable, for example under 18 years of age or intimidated (see Enhanced Rights), the police will ask you, or your parent/guardian, if you would like your police interview to be video recorded to make it easier for you to tell them what happened. This may be presented as your evidence in court. You may also be able to have your court cross examination evidence pre-recorded at a time earlier and separate to the trial. The police will discuss this option with you. If you do want to give your evidence at the trial, if eligible, a court may allow you to give your evidence and be cross-examined via a live-link room away from the court or a remote site, to minimise the risk of meeting the defendant. However, if you would prefer, you can give your evidence in court. Prosecutors should make witnesses aware that while they can consider how they might like to give evidence, it will be subject to an application to the court and the final decision is made by a judge.\n\nRight 3: To be provided with information when reporting the crime\n\n3.1 If you report a crime to the police or have an allegation reported on your behalf, or if you are contacted as a victim in the course of investigations, you have the Right to written confirmation of your allegation. This will include the basic details of the offence, a crime reference number and the contact details of the police officer dealing with your case. The confirmation could be a letter, email, text message, or it could be written by hand.\n\n3.2 Where the police consider there may be a risk of harm to you from sending the written confirmation, for example in domestic abuse cases, they must provide confirmation in a way that does not potentially risk your safety.\n\n3.3 The police will explain where you can get further information about the criminal justice process and your Rights as a victim. This will include information on where and how to get advice and support. For example, where appropriate and available, how to seek compensation (see Right 5) access to medical support, specialist support, such as psychological support (including pretrial therapy and counselling), and alternative accommodation. The police will also explain what arrangements are available if you do not live in England and Wales.\n\nAccessing Safe Accommodation If you are experiencing domestic abuse there are a number of organisations that can provide advice and support on how to access safe accommodation. The National Domestic Abuse Helpline is staffed 24 hours a day, every day of the year, by a dedicated team of experts and can be reached on: 0808 2000 247. The Samaritans is also staffed every day, 24 hours a day, and can be contacted on: 116 123. Alternatively, a range of other services including social services, General Practitioner’s, pharmacies, and the Citizens Advice Bureau can provide further information and signpost support in your area.\n\n\n\nFurther information can be found at: www.gov.uk/report-domestic-abuse. Most domestic abuse support sites have quick exit options for those with limited time. If you are in immediate danger you should contact the police on: 999.\n\n3.4 If the offender is an adult, you have the Right to receive information about Restorative Justice from the police and how to access Restorative Justice services in your local area. If the offender is under the age of 18, you have the Right to receive information about Restorative Justice from the Youth Offending Team.[footnote 23]\n\n3.5 Although the police are responsible for providing you with information on Restorative Justice initially, all service providers must consider whether you would benefit from receiving this information at any stage of the criminal justice process.\n\nWhat is Restorative Justice? Restorative Justice is a process that brings those harmed by crime, and those responsible for the harm, into communication. It enables everyone affected by a particular incident to play a part in repairing the harm which can be valuable in finding a positive way forward. The communication may take many forms, for some this may mean meeting the offender face-to-face, for others, this could be communicating via letter, recorded interviews or videos. Whichever form of Restorative Justice is most suited to you, trained facilitators will prepare and support you throughout.\n\n\n\nRestorative Justice is voluntary for all parties and it must be agreed by all involved, including facilitators, that it is safe and appropriate to proceed. It will only happen if you and the offender, having acknowledged the basic facts of the case, both want to take part. You do not have to take part and you can withdraw at any time. You can ask to participate in Restorative Justice at a time that is right for you. You may be offered the opportunity to take part because the offender has been referred and it is assessed as safe.\n\n3.6 All information under this Right must be provided within 5 working days (1 working day under Enhanced Rights) of reporting the crime.\n\nRight 4: To be referred to services that support victims and have services and support tailored to your needs\n\nNeeds Assessments\n\n4.1 When you report a crime to the police, you have the Right to be offered support. This will include an assessment of whether you are entitled to receive the Enhanced Rights as set out on page 10 of this Code. The more information you are able to provide during this assessment will ensure that service providers are able to offer help and support that better meets your needs.\n\n4.2 Throughout your case, all service providers must give you the opportunity to be re-assessed if you tell them how your needs have changed.\n\n4.3 If you are required to attend court to give evidence, you will be offered a separate needs assessment by the Witness Care Unit to determine whether you require any further help and support before the trial and at the court.\n\nReferral to Services that support victims\n\n4.4 Services that support victims are there to help you cope and, as far as possible, recover after a crime. Access to support is free, even if the crime hasn’t been reported to the police. For further information about the support in your area, contact your local Police and Crime Commissioner[footnote 23] or visit: www.gov.uk/get-support-as-a-victim-of-crime\n\n4.5 If you report a crime to the police, you have the Right to be referred to a service that supports victims, including Restorative Justice services. The police will tell you about all the support services available in your local area. You will be referred to a support service within 2 working days, and these services will endeavour to provide timely access to support based on availability.\n\n4.6 If you choose not to report the crime to the police, you still have the Right to access support services at any time. You can contact local support services directly. To search for a support service near you, contact your local Police and Crime Commissioner[footnote 24] or visit: www.gov.uk/getsupport-as-a-victim-of-crime\n\n4.7 If you are a bereaved close relative, you have the Right to have a Family Liaison Officer assigned to you by the police, where the Senior Investigating Officer considers this to be appropriate (this will happen in most cases). Your Family Liaison Officer will normally act as the single point of contact between you and service providers. If your case involves an allegation of murder or manslaughter, you also have the Right to be referred to the National Homicide Service and any other relevant specialist support service. This offer will normally be made through your Family Liaison Officer.\n\nWhat is the National Homicide Service? The National Homicide Service is a free service that provides emotional, practical, specialist and peer support to families bereaved by murder or manslaughter, including after an act of terrorism.\n\n4.8 Depending on your needs and the nature of your case, you may be offered specialist support, for example from an Independent Sexual Violence Advisor or an Independent Domestic Violence Advisor. Your advisor will normally act as your single point of contact throughout the case and communicate with the police, Witness Care Unit and the Crown Prosecution Service on your behalf.\n\nWhat is the role of an Independent Sexual Violence Advisor or Independent Domestic Violence Advisor? An Independent Sexual Violence Advisor is an adviser who works with people who have experienced rape and sexual assault, irrespective of whether they have reported to the police.\n\n\n\nIndependent Domestic Violence Advisors work with victims of domestic abuse to understand their experiences and their risk of ongoing harm. They will develop an individual safety plan with a victim to ensure they have everything they need to become safe and start to rebuild their lives free from abuse. This plan may include supporting victims to access statutory services (such as health care and housing services), representing their voice at a Multi-Agency Risk Assessment Conference and accessing other voluntary services in their communities. Independent Domestic Violence Advisors are independent of statutory services and are able to provide victims with relevant information and advice tailored to their needs.\n\n4.9 If you are required to give evidence in court, you have the Right to be offered a referral to a Witness Support Service (see Right 8).\n\n4.10 At the end of your case, regardless of the outcome, you have the Right to be offered a referral to a support service even if you haven’t accessed them previously. To search for a service that supports victims near you, contact your local Police and Crime Commissioner [footnote 25] or visit: www.gov.uk/get-support-as-a-victim-of-crime\n\nSpecial Measures\n\n4.11 You have the Right to have your needs assessed by the police or Witness Care Unit to determine whether you are eligible and would benefit from giving evidence using special measures.[footnote 26] The police or Witness Care Unit will explain what special measures are available and will ask for your views about which you might like to apply for.\n\nWhat are special measures? Vulnerable or intimidated victims and witnesses can ask for special measures to be used during the trial to help them give their best evidence in court and help to relieve some of the stress associated with giving evidence. If eligible, a court will decide whether special measures should be granted.\n\n\n\nCommon special measures include: having a screen/curtain around the witness box or giving evidence by live video-link, either from a separate room within the court or a dedicate live-link site outside the court building, so you do not have to face the defendant and court observers.\n\n\n\nOther special measures include: giving evidence in private with no press or public allowed in the court room;\n\nremoving of wigs and gowns worn by the judge, and the defence and prosecution advocates in the Crown Court;\n\nthe use of communication aids or having the help of an intermediary to understand questions; or\n\nproviding evidence or being cross-examined through pre-recorded video, which means the witness does not need to give evidence at the trial (witnesses are not able to change their minds from pre-recorded to attending trial to give evidence).\n\n4.12 The judge or magistrate will decide whether special measures should be granted following a request from the prosecutor. The Witness Care Unit will tell you the judge’s or magistrates’ decision (see Right 8) and Her Majesty’s Courts and Tribunals Service court staff will ensure that any special measures granted are available for you at court.\n\nRight 5: To be provided with information about compensation\n\nCourt ordered compensation\n\n5.1 If the defendant pleads or is found guilty, the judge or magistrate may order them to pay you compensation for any loss, damage or injury caused as a result of the crime. You have the Right to be told by the police how to seek compensation and you may be asked to provide evidence of any loss or damage, for example receipts or quotes for repairing the damage caused during the crime.\n\nCriminal Injuries Compensation Scheme\n\n5.2 If you have suffered a serious physical or mental injury as a direct result of a violent crime, you may be entitled to compensation through the Criminal Injuries Compensation Scheme (the Scheme).[footnote 27] The Scheme is for those injured in England,Wales and Scotland. You have the Right to be told by the police how to apply for compensation through the Scheme[footnote 28] (see Right 3).\n\n5.3 The Criminal Injuries Compensation Authority is responsible for administering the Scheme.\n\n5.4 Do not delay your application. You must apply as soon as reasonably practical. This should normally be within two years of the date of the incident. The Criminal Injuries Compensation Authority can only extend the time limits where there are exceptional circumstances.29 Different rules apply if you were aged under 18 years of age at the time of the incident. To be eligible for compensation, you will need to meet the wider eligibility criteria set out within the Scheme.\n\n5.5 You should not wait for the outcome of a criminal trial to apply. Your claim is not dependent on the conviction of an offender. However, the Criminal Injuries Compensation Authority may put your application on hold until you know the outcome of the trial, if they do not have sufficient information to be able to progress your claim.\n\n5.6 The Scheme is one of last resort. Where the opportunity exists to pursue compensation elsewhere, you should do so. An award under the Scheme will take account of other compensatory payments made to you, such as court ordered compensation or a civil personal injury award. The Criminal Injuries Compensation Authority may defer making a decision on a claim until you take reasonable steps to seek compensation through other routes available to you and await the outcome of those steps.\n\n5.7 Once you have applied, the Criminal Injuries Compensation Authority will confirm that your application has been received and respond to all written correspondence regarding your application within 20 working days of it being received.\n\n5.8 Having considered your application, you will be provided with information on the Right to review the Criminal Injuries Compensation Authority’s decision, including the procedure and time limits for reviewing that decision.\n\n5.9 Further information about applying for compensation can be found at: www.gov.uk/claimcompensation criminal-injury, from the police, your local support service, or by contacting the Criminal Injuries Compensation Authority on: 0300 003 3601.[^30}\n\n5.10 Whilst it is outside of the scope of the Code, UK victims injured in terrorist attacks abroad may also be entitled to compensation through the Victims of Overseas Terrorism Compensation Scheme. Further information about applying for compensation can be found at: www.gov.uk/compensation-victim-terrorist-attack, or by contacting the Criminal Injuries Compensation Authority on: 0300 003 3601.[footnote 30]\n\nCivil (non-criminal) compensation\n\n5.11 It may be possible to seek compensation from the suspect or offender outside of the criminal justice process. If you want to consider applying for civil compensation, you should seek legal advice and assistance from a solicitor.\n\nGetting legal advice/assistance on claiming compensation\n\n5.12 If you need legal advice and/or assistance you should contact a solicitor. If you are on a low income or benefits you may be able to get Legal Aid to help cover the cost. More information on whether you are eligible for Legal Aid is available at: www.gov.uk/legal-aid\n\n5.13 To find a local solicitor you should contact the Law Society at: www.lawsociety.org.uk\n\nRight 6: To be provided with information about the investigation and prosecution\n\n6.1 You have the Right to be told by the police when key decisions on the investigation are made and, where applicable, to have the reasons explained to you within 5 working days (1 working day under Enhanced Rights) of a suspect being:\n\narrested;\n\ninterviewed under caution;\n\nreleased without charge; and\n\nreleased on police bail or under investigation or if police bail conditions are changed or cancelled.\n\n6.2 If the police decide not to investigate your case, you will be given an explanation of this decision within 5 working days (1 working day under Enhanced Rights). The police will also offer you a referral to a support service.\n\n6.3 Where the police do investigate your case, they will discuss with you how often you would like to receive updates and your preferred method of contact. You can update your preferences at any time.\n\n6.4 The investigation and decision on whether the case should go to court can take a long time and there may be long periods between key decisions. The police will discuss with you if you would like contact during this time and provide you with contact details if you have any questions during the investigation.\n\n6.5 There may be times when a service provider is unable to provide you with updates and/or use your preferred method of contact, but in these instances, they will tell you why.\n\n6.6 In some cases, the police or the Crown Prosecution Service may decide to deal with the case without taking it to court. This is called an out of court disposal.[footnote 31] This enables the incident to be dealt with relatively quickly and may prove more effective in preventing further offences.\n\n6.7 Where the police or the Crown Prosecution Service are considering an out of court disposal you have the Right to be asked for your views and to have these views taken into account when a decision is made. Where this is not possible for practical reasons, the police or the Crown Prosecution Service will tell you why\n\n6.8 The police or the Crown Prosecution Service will take the final decision after considering the full circumstances of the offence and your views. You have the Right to be told the reasons for their decision within 5 working days (1 working day under Enhanced Rights) of an out of court disposal being given to the offender.\n\n6.9 When the police have finished their investigation, they may decide what should happen next or, for more serious crimes, pass the information to the Crown Prosecution Service, who will then decide if there is enough evidence to take the case to court.\n\n6.10 If the police or the Crown Prosecution Service decide not to prosecute the suspect, you have the Right to be told within 5 working days (1 working day under Enhanced Rights) of the decision of:\n\nthe reasons for the decision;\n\nhow you can get further information;\n\nhow to seek a review and make representations under the National Police Chiefs’ Council or the Crown Prosecution Service Victims’ Right to Review scheme [footnote 32] ; and\n\n; and how to be referred to a support service.\n\n6.11 If you are unhappy with a police or a Crown Prosecution Service decision not to prosecute the suspect, you have the Right to ask for a review under the National Police Chiefs’ Council or Crown Prosecution Service Victims’ Right to Review schemes.\n\nWhat is the Victims’ Right to Review Scheme? The Victims’ Right to Review Scheme gives victims of crime a Right to request a review of a police or Crown Prosecution Service decision not to prosecute, or to stop the case.\n\n\n\nPolice The Victims’ Right to Review Scheme gives victims the Right to ask for a review of a police decision not to prosecute33 a suspect. This applies to cases in which a suspect has been identified and interviewed under caution, either after an arrest or voluntarily. You have the Right to request a review if the police decide: not to bring proceedings in cases where they have authority to charge; or where\n\nthe case doesn’t meet the test for referring the matter to the Crown Prosecution Service for a charging decision. Crown Prosecution Service The Victims’ Right to Review Scheme gives victims the Right to seek a review of a Crown Prosecution Service decision not to bring charges or to terminate all proceedings. Under the scheme you can seek a review of the following decisions: not to charge;\n\nto discontinue (or withdraw in the Magistrates’ Court) all charges, thereby ending all proceedings;\n\nto offer no evidence in all proceedings; or\n\nto leave all charges in the proceedings to ‘lie on the file’ (this is the term used in circumstances where the Crown Prosecution Service makes a decision not to proceed and requests that the charges be allowed ‘to lie on the file’ marked ‘not to be proceeded with without the leave of this Court or the Court of Appeal’).\n\n6.12 If you are a victim in a specified case[footnote 34] where the Crown Prosecution Service tells you of a decision not to charge a suspect, you have the Right to be offered a meeting unless the Crown Prosecution Service decides that a meeting should not take place. On the rare occasions where the Crown Prosecution Service decide that a meeting is not appropriate, this decision will be explained to you.\n\n6.13 If the suspect is charged with an offence(s), you have the Right to be told by the police within 5 working days (1 working day under Enhanced Rights) of:\n\nthe offence they are charged with;\n\nthe date, time and location of the first court hearing; and\n\nwhere the suspect is released on police bail to appear in court, any bail conditions and any changes to these bail conditions.\n\n6.14 If you are a bereaved close relative in a qualifying case[footnote 35] you have the Right to be offered a meeting with the Crown Prosecution Service prior to or following a decision about whether or not to charge a suspect. If a decision is made to charge, the Crown Prosecution Service will explain how the case is likely to progress and answer any questions that you may have. The Crown Prosecution Service will also discuss your needs and jointly agree how regularly you will receive updates.\n\n6.15 If, after the suspect has been charged with an offence(s), the Crown Prosecution Service decides to stop a charge and proceed with another, make a big change to a charge or stop the case, you have the Right to be told the reason why and, where the decision is to stop the case, how to ask for a review under the Crown Prosecution Services’ Victims’ Right to Review Scheme, if you disagree with their decision.\n\nRight 7: To make a Victim Personal Statement\n\n7.1 You have the Right to make a Victim Personal Statement to explain in your own words how a crime has affected you, whether physically, emotionally, financially or in any other way. This is different from a witness statement. The Victim Personal Statement is considered by the judge or magistrate when determining what sentence the defendant should receive and can also help service providers to consider what additional support you and/or your family may require.\n\n7.2 If you are a bereaved close relative, you have the Right to make a Victim Personal Statement and the Right to have someone with you when you do so, regardless of whether you have made a witness statement.\n\n7.3 To help you decide whether you wish to make one, you have the Right to be provided with information about the Victim Personal Statement process by the police when reporting a crime. If you decide to make a personal statement, you will be asked for your preference about whether you would like to read your statement aloud in court or to have it read on your behalf. You can also request a copy from the police and will be given an opportunity to make an additional personal statement to reflect the changing impact of the crime.\n\n7.4 If the defendant pleads guilty, or is found guilty, and you have asked that your statement is read aloud (or played) in court, the judge or magistrate will decide whether and what sections of your personal statement should be read aloud (or played), and who should read it. The judge or magistrate will always take your preference into account when making their decision, unless there is good reason not to do so. The Witness Care Unit will let you know the judge’s or magistrates’ decision.\n\n7.5 You do not have to read your Victim Personal Statement yourself or have it read on your behalf. If at first you choose to have your personal statement read aloud but later decide you do not want this, you can change your mind. Your personal statement will be considered by the judge or magistrate in the same way, whether or not it is read (or played) aloud in court.\n\n7.6 In addition to the named point of contact for a business being able to make a Victim Personal Statement, businesses of all sizes can make an Impact Statement for Business. This is similar to a Victim Personal Statement and will be used in the same way in court, but allows the business to explain how a crime has affected it, such as direct financial loss, operational disruption or reputational damage.\n\n7.7 The named point of contact has the Right to be provided information about the Impact Statement for Business process by the police when reporting the crime, to help them decide whether the business wishes to make one.\n\n7.8 Further information about the Victim Personal Statement and Business Impact Statement process is available from the police and at: www.gov.uk/government/publications/victimpersonal-statement\n\nWhen can I make a Victim Personal Statement? You can make a Victim Personal Statement at any time prior to sentencing of the offender, however you may not have an opportunity to make it once the court hearing has started, especially if the defendant pleads guilty. For many victims, the best time to make a Victim Personal Statement is when they are told that the suspect has been charged and the full impact of the crime may be clearer. The police may still ask for details of the initial impact when conducting your needs assessment or taking your witness statement. Once you have made a Victim Personal Statement, it becomes part of the court papers and you cannot withdraw or change it. However, if you remember something important, or feel that the impact of the crime on you has changed, you may make another statement. Will the defendant be able to see my Victim Personal Statement? If the case reaches court, the defendant will usually be allowed to read your personal statement. As with other evidence, if the court agrees it is relevant to the case, the defence can ask you questions about the contents of your personal statement. If your statement is read aloud in court, what is said could be reported by the media. Further questions or help recording your Victim Personal Statement If you have questions about making a Victim Personal Statement, how it will be used or what to include, you can speak with the police, Witness Care Unit or a support service for victims of crime. They can also help you to record it.\n\nVictim Personal Statements in parole hearings or tariff review[footnote 36] hearings\n\n7.9 You can ask that your original Victim Personal Statement be used at tariff review hearings and at Parole Board hearings. However, you are entitled to write a new Victim Personal Statement for these hearings, where you are able explain how the crime continues to affect you and/or your family, and the impact that any outcome at one of these hearings may have on you. Different rules apply to a Victim Personal Statement made to the Parole Board, (see Right 11).\n\nRight 8: To be given information about the trial, trial process and your role as a witness\n\n8.1 If the case goes to court, you have the Right to be told by the Witness Care Unit within 5 working days (1 working day under Enhanced Rights) of them receiving the information from the court, which will be within 5 working days of the outcome of the relevant hearing:\n\nthe time, date and location of any hearing (within 1 working day for all victims);\n\nthe outcome of any bail hearing (and relevant bail conditions, any relevant changes to these bail conditions and the reasons for those changes);\n\nif an arrest warrant has been issued for the suspect and the outcome of a hearing if the suspect is re-arrested; and\n\nthe outcome of any hearing if the suspect has been re-arrested.\n\n8.2 If the suspect pleads not guilty and you are required to attend court, you have the Right to:\n\nbe told by the Witness Care Unit if you are required to give evidence within 1 working day (for all victims) of them receiving the information from the Crown Prosecution Service;\n\nhave your needs assessed and be offered a referral to a witness support service who can arrange a visit to the court before the trial date to familiarise yourself with the building, or another support service (see Right 4); and\n\nbe told of the outcome of any special measures application (see Right 4).\n\n8.3 If you are required to give evidence, you will be able to refresh your memory by reading (or watching where it has been recorded) your witness statement. Where possible, if the court allows, the prosecutor will meet you before you go into court to explain what will happen and answer any questions you may have.\n\n8.4 If you are a bereaved close relative, you have the Right to request, from your Family Liaison Officer or Witness Care Unit, a visit to the court before the trial date to familiarise yourself with the building, regardless of whether you are required to give evidence. You also have the Right to be offered a meeting with the Crown Prosecution Service prosecutor or advocate who will be presenting the case in court. This meeting will usually take place shortly before the trial and is an opportunity for you to be introduced and to ask any questions that you may have.\n\n8.5 When attending court, and where possible, you will be able to enter through a different entrance to the defendant and wait in a separate waiting area before and after your case has been heard. Some court buildings do not currently have separate entrances for victims, however, where informed, Her Majesty’s Courts and Tribunals Service staff will make arrangements to ensure that you do not have to see the defendant on arrival.\n\n8.6 During the trial, you may have to wait to give evidence, Her Majesty’s Courts and Tribunals Service court staff will give you a contact point at the court (who may be a member of a witness support service) to keep you updated on the progress of the trial and they or the Crown Prosecution Service prosecutor or advocate will tell you how long you will likely need to wait.\n\n8.7 Sometimes you may need to come back to court on another day, if this happens, Her Majesty’s Courts and Tribunals Service court staff or the Crown Prosecution Service prosecutor or advocate will tell you why.\n\nHelp when attending court Having to attend court can be a worrying experience for any victim. However, you will be contacted by the Witness Care Unit before the trial. As well as providing the Rights listed in paragraphs 8.1, 8.2 and 8.4, they can also provide practical guidance and advice to help you. This includes: being told about what to expect in court and answer any questions you might have about the court process;\n\nif the victim is under 18, being given information for young witnesses;\n\nbeing offered help with directions to the court and planning and/or arranging travel or accommodation;\n\nbeing offered help arranging child care or additional support to allow you to attend court;\n\nbeing given information about claiming witness expenses and allowances;\n\nbeing referred to the Crown Prosecution Service, who will answer any questions you may have about the sentence which the Witness Care Unit is not able to answer; and\n\nbeing offered a referral to services that support victims before, during or after you have attended court.\n\nRight 9: To be given information about the outcome of the case and any appeals\n\n9.1 At the end of the case, you have the Right to be told the outcome, including where available, a brief summary of reasons for the decision,[footnote 37] by the Witness Care Unit, within 1 working day of them receiving the information from the court, which will be within 5 working days of the outcome of the case.\n\n9.2 If the defendant is convicted (found guilty), you have the Right to be told the sentence they received, including a short explanation about the meaning and effect of the sentence, by the Witness Care Unit, within 1 working day of them receiving the information from the court, which will be within 5 working days of the outcome of the case. If you have any questions about the sentence which the Witness Care Unit are unable to answer, you have the Right to be referred to the Crown Prosecution Service, who will answer any questions which the Witness Care Unit is not able to answer.\n\n9.3 If you are a bereaved close relative, you have the Right to be offered a meeting with the Crown Prosecution Service:\n\nfollowing conviction, but before the sentencing hearing of the defendant, to confirm that a Victim Personal Statement has been made or to confirm that it is up to date (this meeting will usually take place at court);\n\nfollowing the sentencing hearing to explain the sentence given (this meeting will usually take place at court);\n\nin cases where the defendant is found not guilty or is convicted of a less serious charge the offer of a meeting will be made a few weeks after the case has concluded, unless the Crown Prosecution Service decide that this is inappropriate. On the rare occasions where they decide that a meeting is not appropriate, this decision will be explained to you. The actual timing of the meeting will be informed by the wishes of the family and you will be contacted to discuss when it should take place; and\n\nin a murder case where all defendants are found not guilty of all charges, the police and Crown Prosecution Service will follow the process set out in the National Standards of Support for bereaved families. The National Standards of Support are available on the Crown Prosecution Service website at: www.cps.gov.uk and a copy is provided by the police to bereaved families as part of the police bereavement pack.\n\nIf you think the sentence given to the offender is far too low\n\n9.4 For some (but not all) cases sentenced in the Crown Court you can ask[footnote 38] the Attorney General[footnote 39] to refer the sentence to the Court of Appeal to reconsider it. This can only be done if the Attorney General thinks that the sentence was not just lenient but ‘unduly lenient’,[footnote 40] such that the sentencing judge made a gross error or imposed a sentence outside the range of sentences reasonably available in the circumstances of the case.\n\n9.5 If the Attorney General considers that the sentence meets the standard of being ‘unduly lenient’, the case is referred to the Court of Appeal. The Attorney General must consider the matter as soon as possible after sentence and no later than the 28th calendar day after the sentence was imposed (in business hours and with sufficient time for consideration). If the Court of Appeal agrees, it may increase the sentence.\n\n9.6 The Witness Care Unit will tell you about the scheme, when you are told the sentence in the case.\n\nIf the offender appeals\n\n9.7 Sometimes the offender will ask the court to look at the case or the sentence again. This is called an appeal. What will happen next will depend on whether the offender is allowed to appeal and if so, the outcome of that appeal.\n\nIf an application is made to the Crown Court to appeal against a conviction or sentence in the Magistrates’ Court\n\n9.8 If the offender appeals to the Crown Court, you have the Right to be told by the Witness Care Unit within 1 working day of them receiving the information from the court, which will be within 5 working days of the outcome of the hearing:\n\nthat a notice of appeal has been made;\n\nthe date, time and location of any hearing; and\n\nthe outcome of the appeal, including any changes to the original sentence.\n\n9.9 If you wish to attend the appeal, you have the Right for court staff to arrange for you to:\n\nwherever possible wait and be seated in court in an area separate from the offender and their family and friends;\n\nbe provided with a contact point at the Crown Court; and\n\nreceive information about services that support victims where appropriate and available.\n\nIf an application is made to appeal against a conviction or sentence to the Court of Appeal, or an application or appeal is made to the UK Supreme Court in a criminal case on a point of law\n\n9.10 If the offender appeals to the Court of Appeal or UK Supreme Court, you have the Right to be told by the Witness Care Unit within 5 working days (1 working day under Enhanced Rights) of them receiving the information from the court, which will be within 5 working days of the outcome of the relevant hearing:\n\nif the offender has been given permission to appeal against the conviction, sentence or point of law;\n\nthe date, time and location of any hearing, and any changes to this information (within 1 working day for all victims);\n\nif the offender is to be released on bail pre-appeal or if the bail conditions have been changed (within 1 working day for all victims);\n\nthe name of a contact for the Criminal Appeal Office or UK Supreme Court staff;\n\nthe outcome of the appeal, including any changes to the original sentence, and\n\nhow to request a copy from the Criminal Appeal Office or UK Supreme Court staff of the court’s judgment in the case once it has been published.\n\n9.11 If you wish to attend the appeal, you have the Right for court staff or UK Supreme Court staff to arrange for:\n\nwherever possible, to wait and be seated in court in an area separate from the offender and their family and friends; and\n\nspecial arrangements to be made for you if the offender is present and you do not wish to sit in the courtroom (it is rare for the offender to attend hearings in the Supreme Court).\n\n9.12 Following a decision to give the offender permission to appeal, if you are a bereaved close relative, you have the Right to be offered a meeting with the Crown Prosecution Service to explain the nature of the appeal and the court processes.\n\n9.13 In determining an appeal against a sentence, the court will always take into account any Victim Personal Statement that was considered by the sentencing court.\n\n9.14 It is not normally necessary for a further personal statement to be provided to the Court of Appeal. However, if there is information that the court should know about the continuing impact the crime has had on you, a new or further Victim Personal Statement may be sent to the Court through the police or the Crown Prosecution Service.\n\nCriminal Cases Review Commission\n\n9.15 The Criminal Cases Review Commission investigates alleged miscarriages of criminal justice in England, Wales and Northern Ireland. An offender can apply to the Commission to review their convictions and/or sentence if there is some new information or new argument which might mean the conviction is unsafe or the sentence too long.\n\n9.16 The Commission, when reviewing a case, will assess the potential impact on you and decide if you should be notified.\n\n9.17 The Commission will not usually try to contact you just because they have received an application. This is because most reviews will not lead to a referral to the Court of Appeal, and therefore there is no need to warn you that the offender has applied. However, the Commission will tell you if they think there is a reasonable chance that you may find out that they are looking at a case though the media or through another source. The Commission will usually work with the police to notify you of an application and will contact you again when a decision has been made on whether they refer the case.\n\n9.18 If the Commission decides that it is not appropriate to contact you during the review, but subsequently decides to refer the conviction or sentence to the courts, the Commission will try their best to contact you before the case is referred for an appeal.\n\nRight 10: To be paid expenses and have property returned\n\n10.1 If you attend court[footnote 41] to give evidence, you have the Right to claim certain expenses from the Crown Prosecution Service,[footnote 42] for example, for travel, child care, loss of earnings, refreshments and meals (further details are available on the Crown Prosecution Service website at: www.cps.gov.uk). The Witness Care Unit will be able to help if you have any questions about claiming expenses.\n\n10.2 The Crown Prosecution Service will pay any expenses due to you within 10 working days of receiving a correctly completed claim form.\n\n10.3 If the police took any of your property as evidence, you have the Right to get it back as soon as it is no longer required. The police will be able to help if you have any questions about the return of your property.\n\nRight 11: To be given information about the offender following a conviction\n\n11.1 If you are the victim or a bereaved family relative and the offender was convicted of a specified violent or sexual offence,43 and sentenced to 12 months or more in prison44 (or detained in a hospital for treatment under the Mental Health Act 1983 with or without a restriction order45), you have the Right to be automatically referred within 10 working days of sentencing to the National Probation Service Victim Contact Scheme and be assigned a Victim Liaison Officer. The Victim Liaison Officer will contact you within 20 working days of the referral.\n\n11.2 Where you choose to receive the Victims Contact Scheme, you are entitled to receive information at key stages of the offender’s sentence (see 11.3). You may opt-out and opt back in to the Victims Contact Scheme at any time whilst the offender is serving their sentence/hospital order.\n\n11.3 The Victim Liaison Officer will tell you:\n\nwhat the sentence of the court means in terms of the offender’s detention in prison or hospital, and if there are any changes to their sentence;\n\nwhen an offender in prison becomes eligible to be considered for a transfer to open conditions;\n\nif a prisoner moves to open conditions;\n\nwhen an offender is being considered for release or for conditional discharge;\n\nwhen the offender is released, or discharged from hospital, and if they are recalled to prisonor hospital;\n\nhow to make a Victim Personal Statement where it falls to the Parole Board to decide whether to direct the release of the offender from prison;\n\nhow to apply to read your Victim Personal Statement to the Parole Board, or have it read out on your behalf, or make a pre-recording in those cases where the Parole Board holds an oral hearing;\n\nhow to apply for licence/discharge conditions to reduce the chances of you encountering the offender in the community, or to prohibit them from contacting you;\n\nabout any licence/discharge conditions that relate to you and the date they will end or where a request to change or remove them has been made;\n\nhow to ask for a summary of the Parole Board’s decision and how to seek to make representations where the Parole Board decides the offender is safe to release;\n\nif the offender escapes or absconds from custody;\n\nhow to ask for information should the offender be convicted of a most serious offence (see 11.18 – 11.19); and\n\nhow to make a reconsideration request (where eligible) (see 11.9 – 11.10).\n\n11.4 In addition to the statutory offences where the Victims Contact Scheme is offered, the National Probation Service will also offer victims access to the scheme where the offender is sentenced to 12 months or more in prison (or detained in a hospital for treatment under the Mental Health Act 1983 with or without a restriction order) for:\n\nCausing Death by Careless or Inconsiderate Driving (Road Traffic Act 1988);\n\nCausing Serious Injury by Dangerous Driving (Road Traffic Act 1988); or\n\nControlling or coercive behaviour in an intimate or family relationship (Serious Crime Act 2015).\n\nVictims of offenders who are under 18 years old\n\n11.5 If the offender in your case is under the age of 18 and you are not eligible for the Victims Contact Scheme, the Youth Offending Team may contact you directly. This is in cases where a young offender is sentenced to less than 12 months in custody, 12 months or more for a non-sexual or non-violent offence or a community-based order. A community-based order puts conditions on an offender serving a sentence in the community rather than prison.\n\n11.6 The Youth Offending Team may seek your views prior to sentencing and explore whether you want to get involved in any Restorative Justice initiatives (see Right 3), where appropriate and available.\n\n11.7 You have the Right to receive the following information from the Youth Offending Team:\n\ninformation about the progress of the offender’s case upon request; and\n\ninformation on appropriate services that support victims if you ask for additional support.\n\nThe Parole Board\n\n11.8 The Parole Board[footnote 46] must:\n\nconsider all representations that victims have made about licence conditions; where a victim has requested a licence condition which has not been included, or has been amended, and provide an explanation for this non-inclusion or amendment;\n\nread a Victim Personal Statement if one is submitted;\n\nconsider any application by the victim to be permitted to attend the hearing and read their Victim Personal Statement or have it read by someone else on their behalf;\n\nunless there is a good reason for not doing so, agree to the statement being read at the hearing by the victim or someone else on their behalf; and\n\nprovide a summary of the parole decision upon application, unless there is a good reason for not doing so.[footnote 47]\n\nThe Parole Board and Victim Personal Statements When can I make a Victim Personal Statement to the Parole Board? You can make a new Victim Personal Statement any time leading up to the parole review, but it must be submitted in good time in order for the Parole Board to read it. If there is to be a parole oral hearing the Victim Personal Statement should be submitted at least eight weeks in advance. A parole hearing is unlikely to be delayed to allow for a late Victim Personal Statement to be submitted. You can update your Victim Personal Statement or write a new one, but you will need to withdraw a previous version first. You can write a new statement for each parole review that may take place. Will the offender be able to see my Victim Personal Statement? The overriding principle is that the offender will see all information related to the parole review, unless in very exceptional circumstances the Parole Board agrees not to disclose it to the offender. This practice is consistent with the fundamental principles of our criminal justice system. However, if you do not wish the offender to read your statement you may ask your Victim Liaison Officer to apply for the statement to be withheld, under a non-disclosure application. There are rules about this which will need to be followed, including strict timeframes for making a request (eight weeks ahead of an oral hearing) and specific reasons for when information can be withheld, which are set out in the Parole Board Rules 2019. The final decision lies with the Parole Board. If the Board agrees not to disclose your Victim Personal Statement, the prisoner’s solicitor may still have sight of it, although he/she may be required not to disclose it to the prisoner. If you request non-disclosure and the Parole Board turns it down, you may withdraw your Victim Personal Statement. Further questions or help recording your Victim Personal Statement If you have questions about making a Victim Personal Statement, how it will be used or what to include, you can speak to your Victim Liaison Officer. They can also help you to record your personal statement.\n\nAsking for a parole decision to be reviewed[footnote 48] (Reconsideration Mechanism)\n\n11.9 The Parole Board considers certain offenders for parole (release on licence) or re-release following recall and does so based on their risk of harm to the public.\n\n11.10 If the Parole Board decides it is safe to release an offender the decision is provisional for 2149 calendar days in the majority of cases (except standard determinate recalls[footnote 50]). The Secretary of State may ask the Parole Board to reconsider the decision during this period, if he has an arguable case that: - the correct process was not followed in the review of the offender for parole - for example, important evidence was not taken into account; or - the decision was irrational - the decision cannot be justified based on the evidence of risk that was considered.\n\nAs a victim, you may submit a request to the Secretary of State asking that an application for reconsideration is made, if you believe that the decision meets either of these tests. Your request must be submitted within the 21-day provisional window. The Secretary of State will only do so where there is evidence the criteria is met. You will receive a letter informing you of whether the Secretary of State makes an application for reconsideration or not.\n\nSexual Offender Notification Requirements Review Process\n\n11.11 Registered sex offenders are subject to ‘notification requirements’. This means they must tell the police about some of their personal details. The notification requirements are an automatic consequence of a conviction or caution, for a Schedule 3 offence under the Sexual Offences Act 2003, but the length of time an offender will be subject to the requirements will vary dependent upon the sentence they are given. A breach of the notification requirements is a criminal offence and is punishable by up to five years imprisonment.\n\n11.12 Offenders who are subject to notification requirements for life can apply to have this reviewed after a set period of time following their first notification, which usually takes place at release from prison. The set period of time is 15 years for adults and 8 years for juveniles. If the offender makes such an application, the police will then carry out a review, including a risk assessment to decide whether the offender’s notification requirements may be stopped. Sex offenders who are assessed as still being a risk will remain subject to notification requirements and will do so for life if necessary.\n\n11.13 If you are a victim of an offender who makes such an application, you have the Right to be contacted by the police to provide your views on the application as part their review. Your Victim Liaison Officer will provide you with further information about this process.\n\nForeign National Offenders\n\n11.14 If you have been a victim of a crime committed by a foreign national and the offender: - has received a prison sentence of 12 months or more, or a hospital order, for an offence against you; - was recommended by a court for deportation for an offence against you; or - was sentenced to a period in prison for a violent or sexual offence\n\nthen you have the Right to receive information about the offender’s deportation. You can choose not to receive this information. The National Probation Service (Victim Liaison Officer and Offender Managers) must take all reasonable steps to work with the immigration authorities to ensure, as far as possible, that information about the prisoner’s immigration status and any deportation information is passed on to victims.\n\n11.15 If you have been the victim of a crime as set out in 11.14, your Victim Liaison Officer assigned by the Victims Contact Scheme (see 11.1) will be able to obtain updates from the Home Office on your behalf.\n\n11.16 If you are not eligible for the Victims Contact Scheme or have opted out of the scheme, but you meet the criteria (see 11.14) you have the Right to ask for updates regarding the immigration case of the Foreign National Offender directly from the Home Office’s Victim Support Team.\n\n11.17 The Home Office Victim Support Team can tell you: - whether the Home Office intends to take deportation action against the offender; - the final outcome of any appeal against deportation; - when the offender is going to be released from immigration detention; - when the offender has been deported; or - if the offender is not being deported and if possible, the reasons why.\n\nSerious Further Offence Reviews\n\n11.18 In the event that an offender commits a Serious Further Offence[footnote 51] while they are under statutory supervision by the provider of probation services, or shortly after this supervision has ended, the provider of probation services will carry out a Serious Further Offence Review, to investigate how the case was managed and whether or not there are any improvements that need to be made to manage future cases.\n\n11.19 In the most serious cases, providers of probation services will offer to share the findings of a Serious Further Offence Review with the victim or their families following conviction of the offender. If this occurs you have the Right to be contacted by your Victim Liaison Officer, to be asked whether you would like to meet with a senior manager from the provider of probation services to talk about the findings of the Serious Further Offence Review, and if you would like a copy of the report.\n\nRight 12: To make a complaint about your Rights not being met\n\n12.1 If you believe that you have not received any of your Rights under this Code, you can make a complaint. In the first instance, and if you feel comfortable doing so, you should discuss your complaint with the person you have been dealing with at the relevant service provider.\n\n12.2 If you remain unhappy, or if you do not feel comfortable discussing the complaint with the person you have been dealing with, you can make a complaint through the service provider’s internal complaints’ procedure.[footnote 52] They will provide you with information about their complaints procedure and respond within the timescales set out in this procedure.\n\n12.3 If you send your complaint to the wrong service provider or it needs to be dealt with by more than one service provider, they will let you know.\n\n12.4 If you are still not satisfied after you have finished the service provider’s complaints procedure, or they are taking too long to get back to you, you can ask your Member of Parliament to refer your complaint to the Parliamentary and Health Service Ombudsman. The Ombudsman will consider any complaints referred to them and, where appropriate, undertake an independent investigation.\n\n12.5 Further information about making a complaint to the Ombudsman can be found on their website at: www.ombudsman.org.uk or by calling their Customer Helpline on: 0345 015 4033 [footnote 53]"}, {"url": "https://www.gov.uk/government/news/new-set-of-rights-for-victims-of-crime", "page_content": "victims to be automatically referred to Victim Contact Scheme\n\nnew support for victims of mentally disordered offenders\n\nVictims of crime will have clearer rights regarding the support they should receive from the police, courts and other criminal justice agencies as a new Victims’ Code is published today (5 March 2020).\n\nA six-week consultation seeks views on a revised Code, which sets out the minimum level of information and service victims can expect from criminal justice agencies. It brings together 12 overarching rights that are clear, concise and easy to understand.\n\nFor the first time, eligible victims will be automatically referred to the Victim Contact Scheme, which gives vital updates on offenders as they serve their sentence, including their potential release from prison.\n\nThe new Code will also give victims greater flexibility over when and how a Victim Personal Statement (VPS) can be made – recognising that for many the impact of the crime may not be immediately apparent. Victims will also be able to request a copy of their VPS for them to refer to in future.\n\nToday’s consultation will pave the way for a Victims’ Law, which will underpin victims’ rights in legislation and further reinforce the support offered from the criminal justice system.\n\nJustice Minister Alex Chalk MP said:\n\nSimplifying the Victims’ Code is a vital step in our efforts to rebuild confidence in the criminal justice system. It will make the process less daunting and provide victims with the information and support they need to recover from crime. And we are going further to strengthen victims’ rights by bringing through a Victims’ Law to ensure they are supported at every stage of the justice system.\n\nVictims’ Commissioner, Dame Vera Baird, says:\n\nThe Victims Code needs to deliver on what victims need, if they are to have confidence in the justice system and to feel positively engaged, all of which is essential if they are to cope with the impact of crime and recover from it. But we can only get it right if we hear from victims themselves, using their own lived experience to inform us on what works and what doesn’t. Therefore I am calling on the government, the media and criminal justice agencies to do all they can to promote this consultation. In doing so, they can stimulate a national conversation on how society should treat victims of crime and give them the support they need.\n\nProposals set out in the new Code include:\n\nOffering greater flexibility over when a Victim Personal Statement, which tells the court how the crime has affected the victim, can be made.\n\nSimplifying and shortening the Code to make it clear, concise and easy to understand.\n\nChanging the Victim Contact Scheme from an opt-in to automatic referral scheme.\n\nNew rights for victims of mentally disordered offenders, allowing them access to a Victim Liaison Officer to provide information on an offender’s management and potential release from hospital.\n\nFor the first time, the Code sets out the rights of victims of Foreign National Offenders to be updated on when an offender’s deportation may occur.\n\nThe new Code also includes practical information about how victims can access services provided by the National Health Service (NHS) and sign-post them to where they can get help and advice if they are approached by the media.\n\nNotes to editors"}, {"url": "https://www.gov.uk/government/news/new-victims-code-comes-into-force", "page_content": "Victims offered automatic updates when perpetrators leave jail\n\nVictims of rape and sexual violence can choose sex of police interviewer\n\nPaves way for consultation on Victims’ Law later this year\n\nThey will be told what to expect at every stage of the justice system including, for the first time, their automatic right to be told when a perpetrator is due to leave prison. Victims of sexual violence will be able to choose the sex of their police interviewer and there will be clearer advice on when they can have their evidence pre-recorded ahead of a trial – rather than face the stress of cross-examination in front of a packed courtroom. Where an offender is a foreign national offender, victims will for the first time have the right to know when they are deported.\n\nToday’s milestone will pave the way for a new Victims’ Law, on which Ministers will consult this summer. It seeks to underpin victims’ rights in legislation and ensure justice agencies are held to account for delivering them.\n\nThe Lord Chancellor, Robert Buckland QC MP, said:\n\nHaving worked for over 25 years as a criminal barrister, I know how daunting the justice system can be for victims which is why the information and support they receive is so vital.\n\nOur new Code provides victims with a simplified and stronger set of rights – making clear their entitlements at every step of the way as they recover from crime.\n\nBut we are not stopping here and will consult on strengthening these rights even further through a Victims’ Law as we continue to build back confidence in the justice system.\n\nThe Code brings together 12 overarching rights that are straightforward, concise and easy to understand – outlining the minimum level of information and service victims can expect at every stage of the justice process. These include:\n\nFor the first time, eligible victims will be automatically referred to the Victim Contact Scheme (VCS) and offered a Victim Liaison Officer (VLO), who provides vital updates on offenders as they serve their sentence, including their potential release from prison. A VLO can also help victims apply for licence conditions to reduce the chance of them encountering an offender in the community and assist with requesting reviews of Parole Board decisions.\n\nVictims of sexual violence or domestic abuse will be able to choose the sex of police officers that interview them. They will also be directed towards the support of independent advisors who provide emotional and practical help, regardless of whether the crime is reported to the police – following a £27 million investment to boost their numbers.\n\nThe ability for vulnerable victims to have their cross-examination pre-recorded away from the courtroom - reducing the stress of giving evidence in court, which many find intimidating.\n\nGreater flexibility over when and how a Victim Personal Statement (VPS), which tells the court how the crime has affected the victim, can be made – recognising that for many the impact of the crime may not be immediately apparent. Victims will also be able to request a copy of their VPS for them to refer to in future.\n\nThe right to be informed the reasons why a suspect will not be prosecuted. If unhappy, victims will also be able to ask the police or Crown Prosecution Service to review this decision.\n\nFor the first time, the Code sets out the rights of victims of Foreign National Offenders to be updated on when an offender’s deportation may occur\n\nThe Victims’ Commissioner for England and Wales, Dame Vera Baird QC, says:\n\nWe all want a system which delivers justice and the launch of the new Victims’ Code is to be welcomed as an important step in the right direction.\n\nUnder the Victims’ Code, everyone has a right to support following a crime. The Victims’ Code sets out the services and information victims of crime are entitled to from criminal justice agencies - like the police, CPS, and the courts - from the moment they report a crime to the end of the trial. This new, simplified Victims’ Code represents a positive step forward for victims. These 12 rights are well set out and should provide some much-needed clarity for victims and victims’ services.\n\nI also welcome the government’s commitment to consult on victims’ legislation in the summer. A victims’ law would ensure that victims’ rights, such as to information, making a personal statement and accessing independent support services, are legally enforceable. With a Victims Law, we have the opportunity to truly transform the victims’ experience of the justice system. I look forward to engaging with the government in the coming months to make this law a reality.\n\nAndreana De Vecchis works as an Independent Sexual Violence Advisor at the independent charity Victim Support and helps ensure victims get access to the support outlined in the Code. She said:\n\nWorking with victims of rape I know the prospect of reporting a crime to the police and attending court can put a huge emotional strain on people.\n\nIt is my job to take survivors through every step of the process, explaining the rights they have under the Victims’ Code and making sure they receive them.\n\nAt every step my priority is the victim and empowering them to get the support they need from the justice system – whether they choose to report crimes or not.\n\nThe new Code is part of recent action across government to build back confidence in the justice system. This includes a £100m investment into services tackling violence against women and girls, a landmark Domestic Abuse Bill to better protect victims and bring perpetrators to justice, and 20,000 extra police and new legislation to cut crime and boost public protection. Meanwhile, hundreds of millions is being spent to deliver speedier justice for victims and reduce delays in courts caused by the pandemic.\n\nNotes to editors"}, {"url": "https://www.justice.gov/enrd/rights-victims", "page_content": "Two federal statutes describe the federal Government’s responsibilities to crime victims. The Victims’ Rights and Restitution Act (VRRA) (34 U.S.C. § 20141) describes the services the federal government is required to provide to victims of federal crime. The Crime Victims’ Rights Act (CVRA) (18 U.S.C. § 3771) sets forth the rights that a person has as a crime victim. For purposes of these rights and services, victims are defined in specific ways in the law.\n\nUnder the Victims’ Rights and Restitution Act (VRRA), 34 U.S.C. § 20141, some of the services victims are entitled to include:\n\nTo be informed of the place where they may receive medical and social services\n\nTo be informed of public and private programs available for counseling, treatment, and other support services\n\nTo receive reasonable protection from a suspected offender and persons acting in concert with or at the behest of the suspected offender\n\nTo know the status of the investigation of the crime, to the extent it is appropriate and will not interfere with the investigation\n\nTo have personal property being held for evidentiary purposes maintained in good condition and returned as soon as it is no longer needed for evidentiary purposes\n\n\n\nUnder the VRRA, a crime victim is a person who has suffered direct physical, emotional, or pecuniary (financial) harm as a result of a crime. If a crime victim is under 18 years of age, incompetent, incapacitated, or deceased, services should be provided to one of the following representatives of the victim (in order of preference): a spouse, legal guardian, parent, child, sibling, another family member, or another person designated by the court. More than one victim representative can be identified and provided with services depending on the circumstances. Under no circumstances shall a person culpable (responsible) for the crime be treated as a representative of a victim.\n\n\n\nAdditionally, under the Crime Victims' Rights Act (CVRA), 18 U.S.C. § 3771, victims have the following rights:\n\nThe right to be reasonably protected from the accused\n\nThe right to reasonable, accurate, and timely notice of any public court proceeding, or any parole proceeding, involving the crime or of any release or escape of the accused\n\nThe right not to be excluded from any such public court proceeding, unless the court, after receiving clear and convincing evidence, determines that testimony by the victim would be materially altered if the victim heard other testimony at that proceeding\n\nThe right to be reasonably heard at any public proceeding in the district court involving release, plea, sentencing, or any parole proceeding\n\nThe reasonable right to confer with the attorney for the government in the case\n\nThe right to full and timely restitution as provided in law\n\nThe right to proceedings free from unreasonable delay\n\nThe right to be treated with fairness and with respect for the victim’s dignity and privacy\n\nThe right to be informed in a timely manner of any plea bargain or deferred prosecution agreement\n\nThe right to be informed of the rights under this section and the services described in section 503(c) of the Victims' Rights and Restitution Act of 1990 (34 U.S.C. § 20141(c)) and provided contact information for the Office of the Victims' Rights Ombudsman of the Department of Justice. The Victims’ Rights Ombudsman may be contacted at eousa.VictimOmbudsman@usdoj.gov if a victim believes a Department of Justice employee has failed to provide them their rights under the Crime Victims’ Rights Act\n\nUnder the CVRA, a crime victim is a person who has been directly and proximately harmed (physically, emotionally, or financially) as a result of the commission of a federal offense or an offense in the District of Columbia. In the case of a crime victim who is under 18 years of age, incompetent, incapacitated, or deceased, the legal guardians of the crime victim or the representatives of the crime victim's estate, family members, or any other persons appointed as suitable by the court may assume the crime victim's rights, as long as that person is not a defendant in the crime being investigated or prosecuted. Foreign citizens may be victims in some cases. Businesses, corporations, and non-profit organizations can be eligible victims, and an authorized representative of the entity should be designated for purposes of notification."}, {"url": "https://www.ohchr.org/en/instruments-mechanisms/instruments/declaration-basic-principles-justice-victims-crime-and-abuse", "page_content": "A. Victims of crime\n\n1. \"Victims\" means persons who, individually or collectively, have suffered harm, including physical or mental injury, emotional suffering, economic loss or substantial impairment of their fundamental rights, through acts or omissions that are in violation of criminal laws operative within Member States, including those laws proscribing criminal abuse of power.\n\n2. A person may be considered a victim, under this Declaration, regardless of whether the perpetrator is identified, apprehended, prosecuted or convicted and regardless of the familial relationship between the perpetrator and the victim. The term \"victim\" also includes, where appropriate, the immediate family or dependants of the direct victim and persons who have suffered harm in intervening to assist victims in distress or to prevent victimization.\n\n3. The provisions contained herein shall be applicable to all, without distinction of any kind, such as race, colour, sex, age, language, religion, nationality, political or other opinion, cultural beliefs or practices, property, birth or family status, ethnic or social origin, and disability.\n\nAccess to justice and fair treatment\n\n4. Victims should be treated with compassion and respect for their dignity. They are entitled to access to the mechanisms of justice and to prompt redress, as provided for by national legislation, for the harm that they have suffered.\n\n5. Judicial and administrative mechanisms should be established and strengthened where necessary to enable victims to obtain redress through formal or informal procedures that are expeditious, fair, inexpensive and accessible. Victims should be informed of their rights in seeking redress through such mechanisms.\n\n6. The responsiveness of judicial and administrative processes to the needs of victims should be facilitated by:\n\n(a) Informing victims of their role and the scope, timing and progress of the proceedings and of the disposition of their cases, especially where serious crimes are involved and where they have requested such information;\n\n(b) Allowing the views and concerns of victims to be presented and considered at appropriate stages of the proceedings where their personal interests are affected, without prejudice to the accused and consistent with the relevant national criminal justice system;\n\n(c) Providing proper assistance to victims throughout the legal process;\n\n(d) Taking measures to minimize inconvenience to victims, protect their privacy, when necessary, and ensure their safety, as well as that of their families and witnesses on their behalf, from intimidation and retaliation;\n\n(e) Avoiding unnecessary delay in the disposition of cases and the execution of orders or decrees granting awards to victims.\n\n7. Informal mechanisms for the resolution of disputes, including mediation, arbitration and customary justice or indigenous practices, should be utilized where appropriate to facilitate conciliation and redress for victims.\n\nRestitution\n\n8. Offenders or third parties responsible for their behaviour should, where appropriate, make fair restitution to victims, their families or dependants. Such restitution should include the return of property or payment for the harm or loss suffered, reimbursement of expenses incurred as a result of the victimization, the provision of services and the restoration of rights.\n\n9. Governments should review their practices, regulations and laws to consider restitution as an available sentencing option in criminal cases, in addition to other criminal sanctions.\n\n10. In cases of substantial harm to the environment, restitution, if ordered, should include, as far as possible, restoration of the environment, reconstruction of the infrastructure, replacement of community facilities and reimbursement of the expenses of relocation, whenever such harm results in the dislocation of a community.\n\n11. Where public officials or other agents acting in an official or quasi-official capacity have violated national criminal laws, the victims should receive restitution from the State whose officials or agents were responsible for the harm inflicted. In cases where the Government under whose authority the victimizing act or omission occurred is no longer in existence, the State or Government successor in title should provide restitution to the victims.\n\nCompensation\n\n12. When compensation is not fully available from the offender or other sources, States should endeavour to provide financial compensation to:\n\n(a) Victims who have sustained significant bodily injury or impairment of physical or mental health as a result of serious crimes;\n\n(b) The family, in particular dependants of persons who have died or become physically or mentally incapacitated as a result of such victimization.\n\n13. The establishment, strengthening and expansion of national funds for compensation to victims should be encouraged. Where appropriate, other funds may also be established for this purpose, including in those cases where the State of which the victim is a national is not in a position to compensate the victim for the harm.\n\nAssistance\n\n14. Victims should receive the necessary material, medical, psychological and social assistance through governmental, voluntary, community-based and indigenous means.\n\n15. Victims should be informed of the availability of health and social services and other relevant assistance and be readily afforded access to them.\n\n16. Police, justice, health, social service and other personnel concerned should receive training to sensitize them to the needs of victims, and guidelines to ensure proper and prompt aid.\n\n17. In providing services and assistance to victims, attention should be given to those who have special needs because of the nature of the harm inflicted or because of factors such as those mentioned in paragraph 3 above.\n\nB. Victims of abuse of power\n\n18. \"Victims\" means persons who, individually or collectively, have suffered harm, including physical or mental injury, emotional suffering, economic loss or substantial impairment of their fundamental rights, through acts or omissions that do not yet constitute violations of national criminal laws but of internationally recognized norms relating to human rights.\n\n19. States should consider incorporating into the national law norms proscribing abuses of power and providing remedies to victims of such abuses. In particular, such remedies should include restitution and/or compensation, and necessary material, medical, psychological and social assistance and support.\n\n20. States should consider negotiating multilateral international treaties relating to victims, as defined in paragraph 18.\n\n21. States should periodically review existing legislation and practices to ensure their responsiveness to changing circumstances, should enact and enforce, if necessary, legislation proscribing acts that constitute serious abuses of political or economic power, as well as promoting policies and mechanisms for the prevention of such acts, and should develop and make readily available appropriate rights and remedies for victims of such acts."}, {"url": "https://commission.europa.eu/strategy-and-policy/policies/justice-and-fundamental-rights/criminal-justice/protecting-victims-rights/victims-rights-eu_en", "page_content": "Victims' needs\n\nEvery year, an estimated 15% of Europeans or 75 million people in the European Union fall victim to crime. More and more people are travelling, living or studying abroad in another EU country and can become potential victims of crime.\n\nThe EU works continuously to ensure that victims receive the support and protection they need, everywhere in the EU.\n\nPeople falling victim to crime have a range of needs, varying from victim to victim. To meet these needs, all victims must be treated individually. However, the needs of victims can be grouped into 5 broad categories\n\nrespectful treatment and recognition as victims\n\nprotection from intimidation, retaliation and further harm by the accused or suspected and from harm during criminal investigations and court proceedings\n\nsupport, including immediate assistance following a crime, longer-term physical and psychological assistance and practical assistance\n\naccess to justice to ensure that victims are aware of their rights and understand them, and are able to participate in proceedings\n\ncompensation and restoration, whether through financial damages paid by the state or by the offender or through mediation or other form of restorative justice\n\nVictims' rights in the EU\n\nThe Victims' Rights Directive establishes minimum standards on the rights, support and protection of victims of crime and ensures that persons who have fallen victim to crime are recognised and treated with respect. They must also receive proper protection, support and access to justice.\n\nThe Directive considerably strengthens the rights of victims and their family members to information, support and protection. It further strengthens the victims' procedural rights in criminal proceedings. The Directive also requires that EU countries ensure appropriate training on victims' needs for those officials who are likely to come into contact with victims.\n\nEU countries had to implement the provisions of the Directive into their national laws by 16 November 2015. In 2013, the European Commission issued a guidance document to assist EU countries in this process.\n\nOn 11 May 2020, the European Commission adopted a report on the implementation of the Victims’ Rights Directive. The report assesses the extent to which Member States have taken the necessary measures to comply with its provisions.\n\nFor certain groups of victims, the EU adopted specific rules. These rules build on the Victims' Rights Directive but respond more directly to the specific needs of some victims. The EU legislation exists to provide protection and support for\n\nIn order to assist the national authorities in implementation of the EU rules on victims’ rights, the European Commission set up the EU Centre of Expertise for Victims of Terrorism. The EU Centre offers expertise, training, guidance and support to national authorities and to victim support organisations.\n\nEvaluation of the Victims’ Rights Directive\n\nOn 28 June 2022, the European Commission adopted its evaluation of the Victims’ Rights Directive. The evaluation is one of the Commission’s key actions set out in the EU Strategy on Victims’ Rights (2020 – 2025). It was informed by a support study and data collection that included a public consultation.\n\nThe evaluation shows that over the past ten years, the Victims’ Rights Directive has greatly contributed to improving the lives of victims across the EU. It has enhanced victims’ safety and reduced the risk of negatives effect from the participation in criminal proceedings and from the contacts with the offender.\n\nHowever, the evaluation also points that there are still situation where not all victims can fully rely on their rights due to a lack of clarity and precision in the drafting of some of the rights in the Directive. In particular, shortcomings were identified in relation to victims’ access to information, victims’ access to support services and to protection in accordance with each victim individual needs. Victims should be able to take more active role in the criminal proceedings and have easier access to compensation – so they can see that justice is done for them.\n\nThe Commission will continue working on strengthening victims’ rights and plans to propose a revision of the Victims’ Rights Directive in 2023.\n\nOpen public consultation on the impact assessment for the revision of the Victims’ Rights Directive\n\nThe Commission conducted a consultation to gather the views of the public on possible policy options within the context of the impact assessment for the revision of the Victims’ Rights Directive. The revision of the Victims’ Rights Directive is part of the EU Strategy on Victims’ Rights (2020 – 2025).\n\nThis consultation was directed towards all stakeholders and citizens with an interest in this topic. It lasted from 8 March to 31 May 2022: Open public consultation on the impact assessment for the revision of the Victims’ Rights Directive.\n\nFunding\n\nJustice programme 2014-2020"}, {"url": "https://eea.iom.int/protect-preventing-sexual-and-gender-based-violence-against-migrants-and-strengthening-support-victims", "page_content": "Project Status: Complete\n\nSexual and gender-based violence is a violation of human rights.\n\nSexual and gender-based violence (SGBV) may be physical or psychological and it can take the form of domestic violence, sexual harassment, social exclusion or even exploitation and trafficking in human beings. Women and men, boys and girls and lesbian, gay, bisexual, transgender and intersex people (LGBTI) can all become victims of sexual and gender-based violence. However, the EU Fundamental Rights Agency confirmed that the majority of the victims are women and girls.\n\nThe video has been produced with subtitles in 23 languages. Watch the other versions here\n\nThe project “PROTECT - Preventing sexual and gender-based violence against migrants and strengthening support to victims” aims to strengthen national support services for victims of sexual and gender-based violence.\n\nPROTECT also aims to make these services available to refugees, asylum seekers and migrants, be them children or adults and including LGBTI people. PROTECT included awareness-raising activities on preventing sexual and gender-based violence among these communities.\n\nIn coordination with national authorities, first responders and service providers, IOM and the partners work together to tailor the following activities to the national contexts and implement them:\n\nStrengthen and adapt existing national support services for victims of sexual and gender-based violence to coordinate better and include refugees, asylum seekers and migrants; Build capacity for professionals who work with and for refugees, asylum seekers and migrants to identify and address the needs of victims and potential victims of SGBV more effectively; Empower and inform refugees, asylum seekers and migrant communities about SGBV and how to protect themselves from the risk of becoming a victim of sexual and gender-based violence."}, {"url": "https://www.gov.uk/government/news/landmark-reforms-for-victims", "page_content": "major step towards new Victims’ Law as consultation is launched\n\nscorecards published to increase transparency and hold criminal justice agencies to account\n\nscheme sparing rape victims the stress of testifying in court rapidly rolled out nationwide\n\ncommunities given the chance to express how a crime has impacted them to amplify victims’ voices\n\nJustice Secretary Dominic Raab set out plans for a first ever Victims’ Law that would guarantee greater consultation with them during the criminal justice process to ensure their voices are properly heard, and hold Agencies such as the police, Crown Prosecution Service and courts service to appropriately account for the service they provide to victims.\n\nUnder plans set out in a consultation published today, victims’ views would be taken into better account at regular points during their case. Proposals include an explicit requirement for prosecutors to meet the victims of certain crimes before making a charging decision in order to understand the impact.\n\nIt also outlines plans for community impact statements, which would provide an account for the collective impact of an offence, including in cases where there is no clear victim – such as attacks on public places or anti-social behaviour. A similar system currently is used in Canada, where in 2018, a Community Impact Statement was produced for a case in which several people were on trial for viewing images of child sexual abuse. Testimony was given by the victims who featured in the abusive material to explain the impact that this offence had on them, and that the act of watching these videos was not victimless. Their statement helped lead to tougher punishments for the offenders involved.\n\nDeputy Prime Minister, Lord Chancellor and Secretary of State for Justice, Dominic Raab said:\n\nNo victim should feel unsupported. We have a moral duty to do better for victims, but as a practical matter that support will also help bring more criminals to justice and protect the public. Our plans will give victims a louder voice, a greater role in the criminal justice system, and make criminals pay more to help victims recover.\n\nThe consultation seeks views on new legislation designed to amplify victims’ voices in the criminal justice process, bolster the level of support they receive, and strengthen the accountability of all the agencies responsible for delivering this. This includes clear expectations of the quality of service that should be offered by the police, prosecutors and the courts service. The ultimate aim of these improvements is to secure more convictions, prevent further crime and make neighbourhoods safer.\n\nPlans to increase the Victim Surcharge have also been set out in the consultation today, to ensure that criminals contribute more towards crucial victim services. This penalty fee – which offenders are made to pay when they are sentenced for crimes - goes straight back into funding support services for victims and currently can be as low as £22 for a conditional discharge. Under the plans set out today, the minimum rate could be increased to £100, over and above the existing pledge to increase it by 20%. These changes would mean that offenders take greater responsibility for the cost of their crimes and pay back to society by contributing to services which support victims as rape support centres and the National Homicide Service.\n\nThe consultation seeks to establish clear routes of redress if victims do not receive the support they are entitled to, and whether better oversight across the system could improve performance through strengthening inspection regimes and increasing the role of Police and Crime Commissioners.\n\nToday the government also published the first ever quarterly performance scorecards, as part of a greater drive for transparency and to hold all justice agencies appropriately to account. The publication of this data will help identify and address concerns, including key information on the volumes of cases going through the system and the time taken for investigation, charging and completion at court. It also includes data on victim engagement – with Ministers determined to increase confidence so that more victims pursue their case so that justice is served as frequently as possible. Local scorecards will be published next year setting out greater detail in each area of the country.\n\nThe scorecards also shine a light specifically on the response to rape and sexual violence – delivering on a key pledge in the government’s Rape Review published earlier this year. The aim is to use this data to help drive a major increase in the number of prosecutions reaching court.\n\nAs part of this push, it was also confirmed today that victims of sexual and modern slavery offences offences will be spared the trauma of giving evidence in court, subject to a successful application, through the national roll out of a scheme enabling pre-recorded evidence across all crown courts in England and Wales – far faster and further than initially pledged in the Rape Review. Known as section 28, the scheme allows victims to have their cross-examination pre-recorded earlier in the process and outside the courtroom, and can help to reduce stress to ensure they give their best evidence. The measure is already in place for vulnerable witnesses such as children and is currently being piloted for victims of sexual and modern slavery offences in seven crown courts. The government will now work in close partnership with the judiciary, police and Crown Prosecution Service to develop a plan which will see it available across the country as soon as possible. The judiciary will retain oversight and discretion to ensure the interests of justice are properly served. This has the potential to increase successful prosecutions and earlier guilty pleas.\n\nDame Vera Baird QC, The Victims’ Commissioner for England & Wales said:\n\nThe criminal justice system has a key role to play in helping victims recover and rebuild their lives. Yet all too often victims are treated as an afterthought, with their needs ignored and neglected. The government’s Victims’ Law represents a once in a generation opportunity to drive real culture change, requiring agencies to see, hear and help victims – if necessary, with real consequences if this does not happen. I welcome the commitments outlined today and I look forward to working with government to make this a reality. We know that we must drastically improve how this country polices and prosecutes rape. The national rollout of section 28 will mark a huge leap in the right direction, helping to reduce unnecessary stress and trauma for victims. This work has my full support.\n\nEmily Hunt, independent advisor to the government on victims, said:\n\nNone of us set out to be a victim of a crime and we often don’t like to talk about it the impact it can have. But anyone of us - our parents, our children, our friends - could become a victim. At the moment, victims are not told what to expect and, if their rights are ignored, nothing happens. This legislation will set out clearly the ways in which victims of all crimes should be protected. It will make sure that they are supported and, when they chose to seek justice, ensure that the criminal justice system takes them seriously and treats them with dignity and respect that they deserve.\n\nDiana Fawcett, Chief Executive of the independent charity Victim Support, said:\n\nThe Victims’ Bill is a real opportunity to improve victims’ experiences of the criminal justice system. Our research has found time and time again that victims do not always receive their rights and entitlements, and so the government’s focus on strengthening victims’ rights is welcome. There needs to be a real shift in the way victims are treated by the criminal justice process. We will work to ensure that the Victims’ Bill makes a meaningful difference to victims of crime, and we will encourage victims and survivors to make their voice heard during the consultation.\n\nThe rollout of pre-recorded evidence nationally marks a step forward against the actions set out in the government’s Rape Review earlier this year. A bi-annual update on this work, also published today, reveals that while more must be done, considerable headway is being made across the justice system to drive the change needed to increase convictions and ultimately put more rapists behind bars, preventing future victims. Progress made so far includes:\n\nPublishing performance scorecards\n\nSecuring the funding to recruit hundreds more Independent Sexual Violence Advisors (ISVAs), who provide vital advice and support for victims, acting as the link between police, support services and criminal justice agencies.\n\nRolling out a new approach to investigations that places greater emphasis on understanding a suspect’s behaviour rather than placing undue focus on a victim’s credibility. Five police forces are already piloting Operation Soteria with further expansion in a further 14 from the end of this year. A number of these are also piloting a scheme to return mobile phones to victims within 24 hours, or provide them with replacements.\n\nTraining more than 100 specialist rape prosecutors, 470 extra CPS staff and 11,000 additional police officers of the pledged 20,000\n\nInvesting a quarter of a billion pounds to support recovery within the courts – providing extra capacity through Nightingale Courts, limit-free sitting days in the Crown Courts, and two new “super courts” to deliver swifter justice for victims\n\nToday’s announcement builds on the foundations laid by the new Victims’ Code which came into force in April. It sets out the level of support victims can expect from criminal justice agencies, including the information they should receive from the police, CPS, and courts. The consultation seeks views on enshrining the code in law.\n\nThe Ministry of Justice (MOJ) secured an additional £2.2 billion in funding from the recent Spending Review of which £185million will go towards supporting victims by 2024/25. This will increase the number of Independent Sexual and Domestic Violence Advisors funded by the MOJ to over 1,000 and fund other key services such as a 24/7 sexual violence helpline. Almost half a billion pounds will be spent on measures to tackle the impact of the pandemic and restore the swift justice victims deserve.\n\nNotes to editors\n\nOn Victims’ Bill consultation:\n\nThe Victims’ Bill consultation will run for 8 weeks from 9 December to 3 February 2022. A response and legislation will be drawn up in due course following its conclusion.\n\nThe Victims’ Bill will cover England and Wales.\n\nOn Rape Review progress report and scorecards:\n\n6 months since its publication the End-to-End Rape Review, the report provides an update on the progress we have made against the Action Plan\n\nThe first set of CJS scorecards - recorded adult rape offences has also been published\n\nOn Scorecards:\n\nThe full scorecards were published on 9 December at 9.30am.\n\nThe government is planning to publish scorecards every 3 months, with new localised scorecards expected to be published early in the new year.\n\nOn Section 28:"}]}