{"Yunkers was also a noted designer, creating furniture, textiles, and jewelry.": [{"url": "http://www.graphicstudio.usf.edu/GS/artists/yunkers_adja/yunkers.html", "page_content": "Adja Yunkers\n\nAdja Yunkers (1900-1983) studied at Lenigrad Art Academy in Saint Petersburg, Russia. The Latvian artist traveled through Europe and Cuba studying and creating art until he settled in New York. There he taught at various institutions including Columbia University, Cooper Union School of Art and Architecture, and the New School for Social Research.\n\nYunkers explored multiple techniques and styles in printmaking during his residency at Graphicstudio in 1969. Yunkers produced elegant images that combined blind embossing and lithography. Aegean IX-69 combined the elder artist\u0092s old world elegance, broad connections to the New York art world, and passionate discussions of his work.\n\nThe artist exhibited widely in the United States and Europe, with retrospectives at the Baltimore Museum of Art, Utah Museum of Art, Museo de arte modern in Mexico City, the Brooklyn Museum and the Fine Arts Museum of Long Island.\n\nPrintmaking + Sculpture Terms\n\nPrintmaking Glossary\n\nSculpture Glossary\n\nSales\n\nFor sales, or more information about an edition, please contact Graphicstudio at (813) 974-3503 or gsoffice@usf.edu.\n\nCopyright + Reproduction\n\nImages of the artwork are jointly owned by the artist and Graphicstudio. Reproduction of any kind including electronic media must be expressly approved by Graphicstudio."}, {"url": "https://www.nytimes.com/1984/06/03/nyregion/many-ideas-meet-in-yunkerss-art.html", "page_content": "There can be little doubt that Mr. Yunkers wanted his color to achieve power, and that the monochromatic works - especially the compositions that date from the 70's - were intended to have a metaphysical force. Sometimes they invite the eye to adjust to subtle markings, or minute changes in tone. Frequently there is a haunting resonance, as well as a sense of the profound and mysterious. ''The unknown is comfortable for me,'' he said in an interview with Mrs. Flomenhaft.\n\nIt is also obvious to the visitor that the Yunkers oeuvre was quite unpredictable. This 40-year overview includes a number of radical changes in style. Tactile qualities, for example, become an important part of the content in his group of rope collages from the 70's. Here paint-encrusted frayed roping acts as pattern, as composition, and also substitutes for brushstroke or gesture in directing the eye.\n\nSocial concerns are sometimes present in the Yunkers art, too. One strong late canvas, ''In Memory of the Disappeared'' (a reference to political turmoil in Argentina and El Salvador), draws attention to its large, black central field. In the works that are the most spacious, the Aegean Series, a few undulating marks act as contour, and it is intentionally ambiguous as to which area is pushing against the curving shape, and which is receiving the action.\n\nFor many years Mr. Yunkers was known best as a printmaker, and a first-rate group of woodcuts from the 40's represents the early segment of the retrospective (a 1947 fire in his Stockholm studio destroyed accumulated works from earlier decades). The woodcuts blend solidity and transparency, curving and angular shapes, motion, rhythm and bold color, and appear to be an important precursor for the energetic work of the next decade.\n\nMissing and missed here is a fuller range of the Yunkers prints. The CDS Gallery in New York did mount a comprehensive survey of these art works earlier this spring, however."}, {"url": "https://www.aaa.si.edu/collections/adja-yunkers-papers-13445", "page_content": "Collection Information\n\nSize: 2.32 Linear feet, (partially microfilmed on 3 reels)\n\nSummary: REEL N70-16: A typescript (42 p.) address delivered at the Corcoran Museum of Art, 1967, by Yunkers describing his student years in Russia, and later years in Germany, France, and Mexico, ca. 1917-1928, and relating political, social, and cultural events to the development of modern art. He describes Russia before and during the Revolution and Germany during the Weimar Republic. Also included are a resume; a critical bibliography of Yunkers work; typescripts of 2 articles; and clippings.\n\nREEL D251: Printed material, 1941-1965, including newspaper clippings, magazine articles, reviews, exhibition catalogs and announcements, and press releases.\n\nREEL 1023: \"Prints in the Desert: New Mexico,\" 1950, a limited edition book of prints and poetry produced by a collaboration of artists under the leadership of Yunkers.\n\nUNMICROFILMED: Biographical material, including naturalization papers and a passport; files of letters from Mikael Bjornstjerna (1977-1983), Cheryl Bowers (1978-1983), Morton and Chris Grossman (1979-1982), Donna Haley (1982-1983), Denis Wood (1978-1983), Yunker's daughters, including Nina (1979-1983); business and personal correspondence, 1960-1983; files on galleries handling Yunkers' work, including Smith Andersen Gallery (Palo Alto, Calif.), Alice Simsar Gallery (Ann Arbor, Mich.), and Impressions Gallery (Boston, Mass.) containing correspondence, price lists and receipts; a few sketches and a collage; 2 portfolios, \"Creation\" (1941) and \"Ars: Tidskrift for Konst Litterature Och Veteskap\" (1942) containing original prints and collages by Yunkers; 2 appointment books, 1980-1983; notes and writings; photographs of Yunkers, Yunkers at work, his family, friends, studio, and art work; photograph albums, including 2 of Yunkers' studios in Stockholm, Sweden, New Mexico, and New York City (1942-1980) and one of exhibition installations, undated; photographs by Denis Hare of the making of Octavio Paz's book BLANCO, illustrated by Yunkers, and slides of prints included in BLANCO; and printed material, including exhibition announcements, clippings and miscellany."}, {"url": "https://www.britannica.com/biography/Hugo-Junkers", "page_content": "Hugo Junkers, (born February 3, 1859, Rheydt, Prussia [Germany]—died February 3, 1935, Gauting, near Munich, Germany), German aircraft designer and early proponent of the monoplane and all-metal construction of aircraft.\n\nIn 1895 Junkers founded the firm Junkers and Company, which made boilers, radiators, and water heaters. He patented a flying-wing design in 1910, the same year in which he established an aircraft factory at Dessau. His J-1 Blechesel (“Sheet Metal Donkey”) monoplane was the first successful all-metal airplane (1915), and his F-13 was the first all-metal transport plane (1919). Many Junkers aircraft had a corrugated sheet-metal skin, which was copied by several American builders, including the Ford Motor Company. The Junkers works also built “Jumo” aircraft engines. Under pressure from the Nazis, who sought to consolidate aircraft production under the national government and harshly criticized Junkers’s socialist leanings, he stepped down from his company in 1933.\n\nAfter Junkers stepped down, the company designed one of the first turbojet engines during World War II and played an important part in German airpower during the war, supplying the Luftwaffe with the Ju 52, a trimotor monoplane used as a troop transport and glider tug; the Ju 87 dive bomber (Sturzkampfflugzeug, shortened to “Stuka”); and the Ju 88, a twin-engine all-purpose bomber."}, {"url": "http://www.artcyclopedia.com/artists/yunkers_adja.html", "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe cannot be responsible for the content of external web sites.\n\n\n\nAll images and text on this Adja Yunkers page are copyright 1999-2015 by John Malyon/Specifica, Inc., unless otherwise noted. Note that the listings on this site are a unique compilation of information and are protected by copyright worldwide.\n\n\n\n\n\n\n\n"}, {"url": "https://www.1stdibs.com/creators/adja-yunkers/", "page_content": "Latvian Modernist 'The Sky Hides All It's Birds' Intaglio Etching Embossing\n\nBy Adja Yunkers\n\nLocated in Surfside, FL\n\nPrinted on Dark Paper a magnificent piece. this is an etching with embossing on black wove, J Barcham Green paper Publisher Styria Studio, chopmark lower left Adja Yunkers b. 1900, Riga, Russia; d. 1983, New York Adja Yunkers was born Adolf Junkers on July 15, 1900, in Riga, Russia (now Latvia). He studied art in Petrograd (now Saint Petersburg), but from 1917 to 1919 his schooling was interrupted by military service in the Russian army. Yunkers soon left Russia for Europe and traveled extensively for the next two decades, settling for long periods in Cuba, France, and Germany. During much of his early career, Yunkers was active in political as well as artistic movements. At times his political investments even outweighed his commitment to his art, and in 1936 he moved to Spain to fight in its civil war. When the war ended in 1939, he moved to Stockholm and began to focus on art making again. He became associated with the Swedish Surrealists and published three journals devoted to art and politics. These handcrafted publications signaled a strong interest in printmaking, and in the 1940s he made many woodblock prints depicting distorted objects and figural compositions that demonstrate the influence of German Expressionism on his work. In 1947, Yunkers moved to New York and began to teach at the New School for Social Research. After four tumultuous marriages, he married one of his former students from the New School, Dore Ashton, in 1952. Ashton became an art critic for the New York Times in 1955, and through her, Yunkers was introduced to the artists who would become known as the Abstract Expressionists. He began drawing with pastel directly on canvas, resulting in large-scale works that recall Color Field painting in their emphasis on the materiality of color. Expanding on this impulse, Yunkers's later work made extensive use of negative space, collage, and monochrome. The influence of Minimalism in this more reduced aesthetic is clear, and his canvases became more object-like. Both printmaking and bookmaking were central to Yunkers's oeuvre. He founded the Rio Grande Workshop in New Mexico (where he also taught) in 1949, publishing an entirely handmade art magazine called Prints in the Desert. In 1969 he illustrated a limited-edition book by the poet Octavio Paz, a collaboration that sparked both a friendship and a number of additional illustrated books in the years to come. Yunkers also produced two large public works on commission: A Human Condition (1966), a mural for Syracuse University, and a tapestry produced for Stony Brook University (1968), both in New York. Yunkers had his first solo exhibition in 1921 at the Maria Kunde Galerie, Hamburg, Germany. Later that same year, he was part of a group show featuring Eastern European and Russian artists, including Alexander Archipenko, Marc Chagall, and Vasily Kandinsky, held in Hannover, Germany. He was included in an exhibition organized by the Print Council of America entitled American Prints Today. A snapshot of the state of American printmaking at the time of the exhibition. Among the many featured artists were Josef Albers, Leonard Baskin, Ralston Crawford, Adolf Dehn, Fritz Glarner, Grace Hartigan, Jasper Johns, Ynez Johnston, John Paul Jones, Misch Kohn ..."}, {"url": "https://www.elledecoration.co.uk/design/a33583178/recycled-tights-and-textile-waste-in-design/", "page_content": "It may be lagging behind single-use plastics in terms of public awareness, but textile waste is a major environmental concern.\n\nThe statistics are sobering – second to oil, the textile and clothing industry is the largest polluter in the world, and on average, consumers throw away over 30 kilograms of clothing and shoes per person annually. To make matters worse, only a quarter of the 95 percent of textiles that can be recycled actually are.\n\nThis critical situation is high on the agenda of these three innovators, who are reusing end-of-life textiles to keep them out of landfill.\n\nSwedish Stockings\n\nThe sustainable hosiery brand has manufactured products from pre- and post-consumer nylon waste since 2013. Now the brand has gone a step further with a surprising new product – a series of tables made from customers’ old tights.\n\nAfter learning that around two billion pairs of tights are worn once and then discarded every year, the brand took action by rewarding customers for sending back their used tights (from any label).\n\n‘Hosiery is a petroleum product that will never degrade’\n\n‘We got so many tights from people all over the world. At the time we didn't know what we were going to do with them, we just wanted to stop them ending up in landfill. Hosiery is a petroleum product that will never degrade, except for into smaller microplastics,’ explains founder and CEO Linn Frisinger.\n\nSwedish stockings\n\nExperiments in grinding the tights down and mixing them with waste fibreglass from her father’s factory led to the idea of injection moulded furniture, which Frisinger developed with designer Gustaf Westman. The result is a collection of tables with unique surfaces that resemble polished stone. But Frisinger won’t stop there; ‘We’re looking into the possibility of making other objects – our mission is to change and influence the industry.’ swedishstockings.com\n\n\n\nReally\n\nDanish brand Really was one of the first to cotton on to the potential of upcycling end-of-life textiles.\n\nPartly owned by fabric brand Kvadrat (whose factory offcuts also provide raw material), its endlessly reusable materials can be used for furniture and interiors on an industrial scale.\n\nAngela Moore\n\nIts 'Solid Textile Board' made from cotton and wool has already been utilised by studios Front andRaw-Edges, plus designers such as Max Lamb, who created this bench (above) in a collaboration with the brand in 2017. reallycph.dk\n\nPressing Matters\n\nThe brainchild of Australian design initiative Supercyclers and sustainable homeware firm Seljak Brand, the Pressing Matters project’s debut product is a floor lounger that is composed of 100 per cent textile waste from used mattresses.\n\nAlice Wesley-Smith\n\nA combination of synthetic and natural materials (which are too difficult to separate for recycling) are shredded and pressed into shape, resulting in a closed-loop product that can be recycled endlessly. seljakbrand.com.au; supercyclers.com\n\nThis article first appeared in ELLE Decoration August 2020\n\n\n\nLike this article? Sign up to our newsletter to get more articles like this delivered straight to your inbox.\n\nSIGN UP\n\nKeep your spirits up and subscribe to ELLE Decoration here, so our magazine is delivered direct to your door."}, {"url": "https://www.lifestyleasia.com/bk/living/real-estate/luxury-fashion-designer-furniture/", "page_content": "The prestigious Salone del Mobile Milano (or Milan Furniture Fair) will finally begin on 5 September 2021.\n\nThe renowned event is known for showcasing the latest designs in furniture, home decor and lighting by acclaimed designers. It is also a starting point for many fashion brands making inroads into the furniture market.\n\nFurniture is definitely one of the first things that catches the eye when we enter a house, hotel or office. And the market is burgeoning. According to a study conducted by Research and Markets, this industry is poised to touch US$838 billion by 2027 — up from US$616.6 billion in 2019.\n\nPerhaps this is one of the reasons why luxury fashion brands including Gucci, Versace and Louis Vuitton have branched out into the business of interiors. Illustrious designers at the helm of these brands focus on creating attractive home furnishing products. A recent example is Off-White founder Virgil Abloh, who used his time indoors during last year’s lockdown in Chicago to design a homeware collection of more than 80 products, including stools, deck chairs and doorstoppers.\n\nFrom Versace’s Baroque-inspired designs to Off-White’s trendy home collections, here are 10 fashion brands we love for their super stylish furniture.\n\n[Hero Image Credit: Tiendaogt/ Facebook; Featured Image Credit: Gucci/Facebook]\n\nFendi Casa\n\nCoffee and side tables from Fendi Casa collection. (Image courtesy of luxurylivinggroup/ Instagram)\n\nA sofa from Fendi Casa. (Image courtesy of Tiendaogt/ Facebook)\n\nFendi Casa was launched in 1988 when Italian entrepreneur Alberto Vignatelli met fashion designer Anna Fendi and decided to introduce a furniture brand. According to Vignatelli’s daughter Raffaella, it was the first time that a fashion house launched a line of furniture. Anna Fendi built the Fendi brand with her four sisters. Fendi has for decades played a leading role in luxury fashion with its lines of clothing, perfumes, timepieces, eyewear, shoes and other accessories.\n\nLike the fashion house, Fendi Casa’s home collection is the epitome of effortless sophistication. Its range of sofas, coffee tables, low cabinets and table lamps features a diversity of textures, sizes and designs. Among its latest designs are coffee and side tables (first picture) introduced in vibrant colours and geometrical shapes. As of 2018, Fendi Casa’s estimated sales were more than €70 million.\n\nHermès\n\nThe Essential bull-calf leather upholstered groom valet by Hermès. (Image courtesy of Best Interior Designers)\n\nA foldable screen with “Maitres de la Foret” fabric on the front and H canvas fabric at the back. (Image courtesy of Hermès)\n\nThe renowned fashion label offers a stunning collection of furniture, textiles, ceramics and wall coverings. When Hermès launched its homeware products in 2011, the first set was crafted by Enzo Mari, Antonio Citterio and RDAI Studio — three iconic names in furniture design. The luxury fashion furniture brand has everything from ergonomically designed chairs to elegant benches in its collection. Some of the products, such as the Hippodrome d’Hermès coffee table and the set called Équilibre d’Hermès comprising a table, a chair and an armchair, have been created by reputed designers such as Normal Studio and Jasper Morrison.\n\nIn 2013, the brand launched the Les Necessaires d’Hermes collection created by French designer Philippe Nigro using materials like original Hermès textiles and Canaletto walnut — a solid wood known for its elegant texture. Some of its pieces are multifunctional. For instance, the Essential bull-calf leather upholstered groom valet (first picture) has a rotating mirror along with a pouch and a hook made of metal bones covered in Canaletto walnut. Another notable item from the collection is the folding screens (second picture), which have “Maitres de la Foret” fabric on the front and H canvas fabric on the reverse.\n\nLouis Vuitton Objets Nomades Collection\n\nThe Swell Waves Shelf made of polished oak wood. (Image courtesy of Louis Vuitton)\n\nThe Bomboca Sofa designed by Brazilian designers Humberto and Fernando Campana. (Image courtesy of Louis Vuitton)\n\nIn 2012, the fashion label started inviting renowned artists to collaborate for its travel-themed collection Objets Nomades, featuring “functional furniture pieces and design objects”. Designers from across the world like Patricia Urquiola, André Fu, Atelier Oï, India Mahdavi and Marcel Wanders have contributed one-of-its-kind creations.\n\nIn 2020, Andrew Kudless became the first American designer to feature his work in the collection. Named the Swell Waves Shelf (pictured, top), it is a curvilinear design made of polished oak wood and comes with leather straps. Another notable item is the Bomboca Sofa (pictured, bottom), designed by Brazilian designers Humberto and Fernando Campana — famously known as the Campana brothers. The sofa gets its name from a traditional Brazilian confection. Eight plush cushions fit in a curved shell lined with soft calfskin creating an impression of a sculpture.\n\nThe collection also features LV’s innovative furniture designs from the past like the iconic “trunk bed” — a foldable bed that can fit inside a mid-size trunk — created specially for French explorer Pierre Savorgnan de Brazza in 1905. De Brazza was the founder of Brazzaville, the settlement named after him and Congo’s capital today. A similar item can be custom made under the brand’s My Creation service.\n\nArmani/Casa\n\nFor its 2020 collection, Armani/Casa has drawn inspiration from the art of icons such as Paul Klee and Henri Matisse. (Image courtesy of emporioarmani/ Facebook)\n\nGiorgio Armani founded his eponymous fashion label in 1975. Years after becoming one of the most famous fashion designers, Armani entered the realm of home decor with Armani/Casa in 2004. Exotic villas, luxurious hotels, and private planes and yachts are among those decorated with furniture, lighting and carpets produced by the brand, which espouses its design philosophy: elegance, essentiality and simplicity.\n\nThe Armani Hotel in Dubai is one such example — it has bespoke Armani furniture made from elegant textiles and precious materials. For its 2020 collection, Armani/Casa drew inspiration from the art of icons such as Paul Klee and Henri Matisse. While the decorative cushion line Portia draws inspiration from Matisse’s paintings and features floral designs, the range of frames called Ponte is inspired by Klee’s paintings and uses geometrical designs. Emerald green quartzite and satin-finish brass are among the materials used for some of these items that centre around modernism.\n\nRalph Lauren Home\n\nA Ralph Lauren Brook Street Bookcase. (Image courtesy of Ralph Lauren Home)\n\nOne of the first American fashion houses to enter the home decor business, Ralph Lauren Home was launched in 1983. The range of products, including bedding, lighting, furniture, floor covering and other accessories, are created with a focus on four signature RL motifs — Thoroughbred, New England, Jamaica, and Log Cabin. According to Lauren, the home decor products are designed “the way I design for a man or woman, with the same attention to detail and the same eye for what is beautiful and unique”.\n\nEvery product in the brand’s range appears to be following this principle. One such example is the Brook Street Bookcase (pictured) — black with carved rosettes and a reinterpretation of 1940s neoclassical bookcases.\n\nGucci\n\nA chair from the ‘Souvenir from Rome’ collection. (Image courtesy of Gucci)\n\nA velvet three-panel screen by Gucci. (Image courtesy of Gucci)\n\n\n\n\n\nWhen Gucci announced in 2017 it was launching its home decor line, the news was received with much excitement. And the fashion powerhouse didn’t disappoint — its products bear the standard maximalist signature of its creative director Alessandro Michele.\n\nItems such as chairs, cushions, screens, wallpapers and trays are decorated with the House motifs of animals and colourful floral patterns. Designed by Michele, its new collection ‘Souvenir from Rome’ uses a floral jacquard pattern for upholstery of the made to order chairs (first picture) — a design borrowed from his ready-to-wear collection reminiscent of vintage fabrics.\n\nOne of the most luxurious products in the range is a velvet three-panel screen (second picture). Worth US$32,000, the panel is mounted on black lacquered engineered wood with tufted pink velvet on one side and hexagon jacquard fabric on the other.\n\nThe line also includes candles, incense trays and metal folding tables. Gucci’s home decor products can be purchased online and also at some of its stores.\n\nVersace\n\nThe brand clearly believes in excess. (Image courtesy of Versace)\n\nThe iconic Italian fashion house forayed into home decor in 1992 with textiles and porcelain dinnerware. It gradually expanded to luxury furniture, including leather beds, sofas and chairs, and lighting.\n\nVersace’s products are exquisite pieces of art due to the use of Baroque and Greek motifs. Black, gold and white appear to be the dominant colours in its glamorously detailed furniture. The brand clearly believes in excess — a glimpse of which can be seen in the dazzling designs of its sofas alone, each of which is fit for a palace. Take a look at Jaipur (pictured), which has an upholstered frame in printed panel velvet fabric with seat cushions and is made of wood with polyurethane foam wrap to frame and seats.\n\nThe fabrics that go in the making of soft furnishings such as cushions and beddings are pure silk, velvet and super-soft cotton.\n\nBottega Veneta\n\nThe metal magazine rack is a merger of eye-catching design with functionality. (Image courtesy of Sybarites)\n\nBottega Veneta’s first furniture product was a bench designed by its then creative director Tomas Maier in 2006. With that, the fashion brand — in existence since 1966 — began spreading its wings in the world of home decor.\n\nToday, its wide range includes beds, tables, consoles, desks, pillows, blankets and lamps. Materials such as steel, oak, marble, glass and bronze are used to create the sturdy pieces in designs that are simple yet gorgeous. Oak chests with sleek frames draped in suede or leather and bronze hardware will make for a remarkable addition to any room. Those who love the outdoors might find the foldable camp bed, which is made using gunmetal or brushed steel, to their liking. Also available are a folding lamp with bronze finishing, a lantern-inspired floor lamp, and metal magazine rack (pictured) — which looks like a shopping bag and is a quintessential example of the brand’s ability to merge eye-catching design with functionality.\n\nOver the years, Bottega Veneta has collaborated with illustrious names such as designer Osanna Visconti di Modrone, porcelain maker Koenigliche Porzellan-Manufaktur Berlin and furniture maker Poltrona Frau for its products.\n\nBerluti\n\nThe Pinjore garden green judge armchair from the collection. (Image courtesy of Financial Times )\n\nLuxury leather brand Berluti’s creative director Kris Van Assche joined hands with the founder of Laffanour Galerie Downtown François Laffanour to showcase 17 stunning pieces of furniture at the Design Miami fair in 2019. The pieces were a tribute to, and a reminder of, the artistic genius of Pierre Jeanneret — the Swiss architect renowned for designing the Indian city Chandigarh, along with his cousin Charles-Édouard Jeanneret who went by the pseudonym Le Corbusier.\n\nOriginal Pierre Jeanneret pieces from the 1950s created for the administrative buildings of Chandigarh’s Capitol Complex were restored by Laffanour and upholstered with Berluti’s hand-patinated Venezia leather.\n\nIn the collection, what strikes immediately are the colours — Van Assche used 18 different shades for the 17 pieces that include the Nespola orange day bed, Pinjore garden green judge armchair (pictured), one Sukhna cinema chair in purple and another in Simal red. Also part of the distinctive U, V, and X-like shape solid teak furniture are a base-building desk, high court chair, a pair of library chairs and folding screen. The only piece with Berluti signature tobacco colour leather upholstery is the writing chair, which is also one of the few with rattan seats.\n\nTo ensure that the historical integrity of the collection was maintained, Domeau & Pérès, who worked on the upholstery as per Berluti tradition, used magnetic fixings. And for the sake of preserving the character of each piece, normal signs of wear were left intact.\n\nOff-White\n\nAn ivory deck chair from Off White’s latest collection. (Image courtesy of Off White)\n\nThree years after the launch of his brand Off-White, Virgil Abloh presented his inaugural furniture collection at Art Basel in Miami in 2016. On display were chairs, tables and sideboards made of wood, steel and stone.\n\nIn 2019, the brand presented a series of homeware under the “HOME” label with ceramics, bed and bath products. Its latest collection, released in late 2020, comprises more than 80 items including everything from a toothbrush to bedsheets. Available in black, grey and beige tones with accents in fluorescent pink and orange, all of them feature the brand’s unique design elements such as meteor holes and quotation marks. An example is the beautiful ivory deck chair (pictured), made with fabric featuring blue meteor holes in print and the “Off” logo. This is also available in black.\n\nOutside of his brand, Abloh has dabbled in other furniture projects. For his “Acqua Alta” collection at the 2019 Venice Biennale, he designed low chairs that represented the threat from rising sea levels. The same year, he also collaborated with Swedish furniture maker IKEA for a collection named “Markerad” which had 15 products including a rug that looked like a receipt."}, {"url": "https://www.nytimes.com/1983/12/28/obituaries/adja-yunkers-artist-explored-uses-of-color.html", "page_content": "Adja Yunkers, a Latvian-born American artist known for his abstract paintings, prints and pastels, died of Saturday at the New York Infirmary- Beekman Downtown Hospital. He was 83 years old.\n\nMr. Yunkers used soft, lyrical colors, balanced to interact with each other and activate the entire pictorial surface. He studied printmaking in Germany with German Expressionists after World War I, and did color prints marked by an experimental and lyrical quality.\n\nWhen Mr. Yunkers exhibited at the Whitney Museum of American Art in 1972, John Canaday wrote in The New York Times: ''He has been a steady presence confirming the wisdom of taking your time, thinking things out and allowing sensitivities to mature rather than depending on the gush of something passing for inspiration.''\n\nWork by Mr. Yunkers is in the collections of more than 80 institutions in this country and abroad, including the Whitney Museum of American Art, the Metropolitan Museum of Art, the Solomon R. Guggenheim Museum and the Museum of Modern Art. A retrospective of Mr. Yunkers's work is planned for the Fine Arts Museum of Long Island in Hempstead in April."}, {"url": "https://www.1stdibs.com/creators/adja-yunkers/art/", "page_content": "Latvian Modernist 'The Sky Hides All It's Birds' Intaglio Etching Embossing\n\nBy Adja Yunkers\n\nLocated in Surfside, FL\n\nPrinted on Dark Paper a magnificent piece. this is an etching with embossing on black wove, J Barcham Green paper Publisher Styria Studio, chopmark lower left Adja Yunkers b. 1900, Riga, Russia; d. 1983, New York Adja Yunkers was born Adolf Junkers on July 15, 1900, in Riga, Russia (now Latvia). He studied art in Petrograd (now Saint Petersburg), but from 1917 to 1919 his schooling was interrupted by military service in the Russian army. Yunkers soon left Russia for Europe and traveled extensively for the next two decades, settling for long periods in Cuba, France, and Germany. During much of his early career, Yunkers was active in political as well as artistic movements. At times his political investments even outweighed his commitment to his art, and in 1936 he moved to Spain to fight in its civil war. When the war ended in 1939, he moved to Stockholm and began to focus on art making again. He became associated with the Swedish Surrealists and published three journals devoted to art and politics. These handcrafted publications signaled a strong interest in printmaking, and in the 1940s he made many woodblock prints depicting distorted objects and figural compositions that demonstrate the influence of German Expressionism on his work. In 1947, Yunkers moved to New York and began to teach at the New School for Social Research. After four tumultuous marriages, he married one of his former students from the New School, Dore Ashton, in 1952. Ashton became an art critic for the New York Times in 1955, and through her, Yunkers was introduced to the artists who would become known as the Abstract Expressionists. He began drawing with pastel directly on canvas, resulting in large-scale works that recall Color Field painting in their emphasis on the materiality of color. Expanding on this impulse, Yunkers's later work made extensive use of negative space, collage, and monochrome. The influence of Minimalism in this more reduced aesthetic is clear, and his canvases became more object-like. Both printmaking and bookmaking were central to Yunkers's oeuvre. He founded the Rio Grande Workshop in New Mexico (where he also taught) in 1949, publishing an entirely handmade art magazine called Prints in the Desert. In 1969 he illustrated a limited-edition book by the poet Octavio Paz, a collaboration that sparked both a friendship and a number of additional illustrated books in the years to come. Yunkers also produced two large public works on commission: A Human Condition (1966), a mural for Syracuse University, and a tapestry produced for Stony Brook University (1968), both in New York. Yunkers had his first solo exhibition in 1921 at the Maria Kunde Galerie, Hamburg, Germany. Later that same year, he was part of a group show featuring Eastern European and Russian artists, including Alexander Archipenko, Marc Chagall, and Vasily Kandinsky, held in Hannover, Germany. He was included in an exhibition organized by the Print Council of America entitled American Prints Today. A snapshot of the state of American printmaking at the time of the exhibition. Among the many featured artists were Josef Albers, Leonard Baskin, Ralston Crawford, Adolf Dehn, Fritz Glarner, Grace Hartigan, Jasper Johns, Ynez Johnston, John Paul Jones, Misch Kohn ..."}]}