{"Yunkers was a member of the American Abstract Artists group and exhibited widely in the United States and Europe.": [{"url": "https://www.moma.org/artists/6526", "page_content": "If you would like to reproduce an image of a work of art in MoMA’s collection, or an image of a MoMA publication or archival material (including installation views, checklists, and press releases), please contact Art Resource (publication in North America) or Scala Archives (publication in all other geographic locations).\n\nMoMA licenses archival audio and select out of copyright film clips from our film collection. At this time, MoMA produced video cannot be licensed by MoMA/Scala. All requests to license archival audio or out of copyright film clips should be addressed to Scala Archives at [email protected]. Motion picture film stills cannot be licensed by MoMA/Scala. For access to motion picture film stills for research purposes, please contact the Film Study Center at [email protected]. For more information about film loans and our Circulating Film and Video Library, please visit https://www.moma.org/research/circulating-film.\n\nIf you would like to reproduce text from a MoMA publication, please email [email protected]. If you would like to publish text from MoMA’s archival materials, please fill out this permission form and send to [email protected]."}, {"url": "https://prabook.com/web/adja.yunkers/1108438", "page_content": "Adja Yunkers\n\nartist painter printmaker\n\nJuly 15, 1900 (age 83) Riga, Latvia\n\nAdja Yunkers began his career from the military service at the Russian Army beginning at the outbreak of the Revolution in 1917. After Yunkers left the country and in 1921 settled down in Hamburg, Germany where he had his first solo exhibition at the Maria Kunde Galerie. Later the same year, Adja Yunkers participated at the group show in Hannover along with such artists, as Alexander Archipenko, Marc Chagall and Vasily Kandinsky. He rented a studio with the money he earned from the exhibitions. While in Germany, Yunkers took an active part at artistic movements, joining the members of the Sturmgruppe, including Emil Nolde and Karl Schmidt-Rottluff. Since 1923, Adja Yunkers had travelled around Europe and Latin America visiting Spain, the Canary Island, France, Germany, the United Kingdom and Cuba where he spent one year from 1926. He then moved to Mexico where he met Diego Rivera. At the end of 1927, Yunkers came back to Europe settling down in Paris. While in the capital of France, the artist worked on multiple artistic projects, like murals for the City Hall in Ivry or his woodcut series “The Ten Commandments”. During 1936-1939, Adja Yunkers participated in the Spanish Civil War. After, he moved to Stockholm, Sweden. The artist got acquainted with the Swedish Surrealists and exhibited widely. While in the country, he published and edited the periodicals on art and politics called Creation, Arts and Art portfolio. Since then, Yunkers devote much of his time to printmaking and soon became recognized for his graphic work. During the 1940s, he produced a great number of woodblock prints showing deformed objects and figures similar to German Expressionism in style. The fire accident of 1947 destroying Yunkers’s studio with almost all of his artworks pushed the artist to relocate to New York City where he joined the teacher’s staff of the New School for Social Research working in the summers at the University of New Mexico. His popularity continued to grow and soon his artworks were acquired by several public and private collections. Two years after his arriving in America, Adja Yunkers formed the Rio Grande Workshop in Albuquerque, New Mexico, which issued a handmade art magazine titled ‘Prints in the Desert’. In 1960, Yunkers produced his first lithographs including two series called ‘Salt’ of five lithographs and ‘Skies of Venice’ of ten lithographs at the Tamarind Lithography Workshop in Los Angeles. At the end of the decade, the artist worked on two commissioned projects, a mural for Syracuse University called a ‘Human Condition’ (1966) and a tapestry for Stony Brook University (1968). The same time, he collaborated with the poet Octavio Paz illustrating his book. Octavio became Yunkers’s and the following years, the artist illustrated many of his other writings. Adja Yunkers exhibited a lot in the United States and in Europe, having the retrospectives at the Baltimore Museum of Art (1960), at the Brooklyn Museum (1967), at the Utah Museum of Fine Arts, Salt Lake City (1968), at the Museum of Modern Art in Mexico City, Mexico (1975) and at the Fine Arts Museum of Long Island in Hempstead, New York (1983). In addition to the above-mentioned teaching posts, Yunkers also worked as a visiting lecturer at the University of Hawaii, Honolulu, and Columbia University."}, {"url": "https://www.lamodern.com/auctions/2023/01/prints-multiples/181", "page_content": "Adja Yunkers\n\nBorn Adolf Junkers in Latvia, Adja Yunkers’ journey to becoming an artist began when he left home at 14 to study art in Saint Petersburg. In 1919, after serving in the Russian military for two years, he moved to Germany and had his first show at the Maria Kunde Galerie in Hamburg in 1921. While in Germany he became familiar with artists in the Sturmgruppe and he also participated in a Russian avant-garde exhibition alongside Wassily Kandinsky, Alexander Archipenko, and Marc Chagall.\n\nYunkers began a series of travels in 1923, from Spain to the Canary Islands to Paris and finally to Cuba in 1926 (where he changed his name from Adolf Junkers to Adja Yunkers). He returned to Europe by the end of 1927 and remained active in both artistic and political movements, even moving to Spain in 1936 to fight in their civil war. He immigrated to Sweden in 1939 and remained there for many years, becoming associated with Swedish Surrealists and publishing three journals about art and politics. These handcrafted publications led Yunkers to develop a deeper interest in printmaking and, in the 1940s, he made many woodblock prints that exhibited the influence of German Expressionism on his work.\n\nIn 1947, Yunkers moved to New York to teach at the New School for Social Research. Several years later, in 1952, he married a former student, Dore Ashton, who became an art critic for The New York Times. It was through Ashton that Yunkers was introduced to Abstract Expressionist artists. This association had an enormous effect on the development of his later paintings and collages, which became more minimal and monochromatic with an emphasis on negative space. Printmaking and bookmaking would also remain important to him throughout his career; in 1949, he founded the Rio Grande Workshop in New Mexico and, beginning in 1969, he illustrated several limited-edition books by the poet Octavio Paz.\n\nYunkers exhibited widely throughout the United States and Europe, and his works can be found in numerous important public institutions including the Museum of Modern Art, New York, the Philadelphia Museum of Art, the Guggenheim Museum, New York, the British Museum, London, and the Jewish Museum, New York."}, {"url": "https://americanart.si.edu/artist/george-l-k-morris-3421", "page_content": "A writer and editor as well as a painter and sculptor, George L. K. Morris used various publications as platforms foradvocating abstract art during the 1930s and 1940s. He believed that abstraction offered limitless possibilities for the twentieth century and set about to interpret new forms and ideas in historical terms so they would have special meaning for an American audience. \"There is nothing new,\" he maintained in a 1937 article, \"about the quality that we have come to call abstract. . . . In great works of the past there has always been a dual achievement—the plastic, or structural, on the one hand, and the literary (or subject) on the other.\" When \"the veil of subject-matter had been pierced and discarded,\" he continued, \"the works of all periods began to speak through a universal abstract tongue.\"(1)\n\nMorris came to his understanding of modern movements firsthand. His frequent trips to Europe and close association with leading Parisian painters and sculptors gave him special authority when arguing the historical basis of their art.\n\nOften described as a \" Park Avenue Cubist,\" Morris came from a privileged background. He attended Groton and graduated from Yale in 1928, where he studied art and literature and edited the Yale Literary Magazine. He spent the fall semesters of 1928 and 1929 at the Art Students League; in the spring of 1929 he went to Paris with Albert Gallatin and stayed after Gallatin's departure to take Léger's and Ozenfant's classes at the Académie Moderne. In Paris he became a confirmed abstractionist; in his work illusionistic space in figurative paintings yielded to uptilted planes and increasingly to a Cubist fracturing of the picture plane.\n\nOn his return to New York, Morris founded a short-lived cultural and literary magazine called The Miscellany, for which he wrote intelligent and informed art criticism. He continued to travel frequently, often accompanying Gallatin to Paris to buy work for the Gallery of Living Art. He became friendly with Jean Hélion, who provided introductions to Braque, Picasso, and Brancusi, and he wrote catalogue notes to accompany Hélion's essayfor the catalogue of the Gallery of Living Art. In 1937 he joined forces with Gallatin, Sophie Taeuber-Arp, and Cesar Domela, to publish an art magazine called Plastique. There, and in the pages of Partisan Review—where he served as an editor between 1937 and 1943—Morris spoke of the cyclical nature of art history and placed contemporary art squarely within a framework of historical evolution. He wrote that during the nineteenth century, when art appealed to a growing middle class insufficiently sophisticated to understand its plastic qualities, it became stuck \"in the mire of realism.\" With Cézanne and Seurat, who analyzed objects as shapes in space, the modern era began. The time is ripe, Morris continued, \"for a complete beginning. The bare expressiveness of shape and position of shape must be pondered anew; the weight of color (and) the direction of line and angle can be restudied until the roots of primary tactile reaction shall be perceived again.\" Contemporary artists, he maintained, \"must strip art inward to those very bones from which all cultures take their life.\"(2)\n\nDuring World War II, Morris worked as a draftsman for a naval architect's firm. After 1947, he devoted his time almost exclusively to painting and sculpture, although he continued to write occasionally. A founding member of the American Abstract Artists, in the late 1940s he also served as the group's president, arranging exhibitions in Europe and Japan as well as in the United States. He continued to be active with the group during the 1950s and 1960s.\n\nIn Morris's own art, Léger served as an early model. Although his work never physically resembled that of his teacher, like Léger, Morris sought a synthesis of Cubist structure and primitive form. In Morris's work this was reflected in the incorporation of American Indian imagery. During the mid 1930s, he argued for the concrete, and in his paintings juxtaposed hard-edged circular and angular forms in completely nonobjective compositions related to Hélion's work of the same time. In the early 1940s, he began to reincorporate figurative imagery in his art. In his Posthumous Portrait of 1944, Morris experimented with such non-art materials as tile and linoleum embedded in painted plaster compositions.\n\nAlthough Morris exhibited with some frequency during the 1930s and 1940s, his paintings and sculpture received greatest recognition after the war. He remained steadfast in his devotion to his variant form of Cubism, even though many of his friends and colleagues turned to more expressionist styles in the postwar years.\n\n1. George L. K. Morris, \"On the Abstract Tradition,\" Plastique no.1 (Spring 1937, reprint, New York: Arno Press, 1969).\n\n2. On the Abstract Tradition, and \"The Quest for an Abstract Tradition,\" American Abstract Artists: Three Yearbooks (1938, 1939, 1946) (reprint, New York: Arno Press, 1969), p.14.\n\nVirginia M. Mecklenburg The Patricia and Phillip Frost Collection: American Abstraction 1930–1945 (Washington, D.C.: Smithsonian Institution Press for the National Museum of American Art, 1989)"}, {"url": "https://www.caldwellgallery.com/artists/carl-holty/biography", "page_content": "Carl Holty was awakened to his interest in art as a child through visits to the Layton Art Gallery of Milwaukee, and began painting lessons with Friedrich Wilhelm Heine at a young age. Though born in Freiburg, Germany, in 1900, he was raised in Wisconsin and enrolled at Marquette University. Before long, Holty abandoned his pre-medical studies in order to pursue art. He spent a summer at the School of the Chicago Art Institute in Saugatuck, Michigan, and set off for New York in 1920. He then studied at the National Academy of Design under Francis Coates Jones.\n\n\n\nHolty continued his studies abroad, and at the recommendation of friend Vaclav Vytlacil enrolled at the Munich Academy with Hans Hofmann. Hofmann was a major influence, and encouraged Holty’s life-long curiosity in abstraction. Holty moved to Paris in 1930, and became close to Piet Mondrian, whose work he greatly admired. He also was drawn to the flattened imagery explored by cubists Juan Gris and Roger de la Fresnaye. Robert Delaunay nominated him to become the second American member of the Abstraction-Creation artist group, following Alexander Calder.\n\nUpon his return to New York in 1936, Holty was part of a group of modern artists that included Joan Miro, Edvard Munch, Gino Severini, and Brassai. Critic Harold Rosenberg championed his work, and Holty became a founding member of the American Abstract Artists group, serving as their second chairman. He also lectured widely, with numerous artist-in-resident positions. At the American Artists’ School in New York, Ad Reinhardt was among his students. He became a Professor Emeritus at Brooklyn College, after entering the art department there in 1964. His talents also extended to the written word, completing a brief memoir of Mondrian and discussions of painterly creativity. Together with Romare Bearden, he published “The Painter’s Mind.”\n\n\n\nHolty exhibited consistently until his death in 1973, including numerous showings at the Whitney Museum of American Art. His work underwent many stylistic shifts over the years, though he maintained a vibrant and arresting color palette. In the 1940s he became more interested in biomorphic shapes alike to Joan Miró’s, transforming the aims of his rhythmic compositions. His abstract creations maintained references to the natural world, with titles alluding to the influence of reality. With his many experimentations and shifts in technique, Holty demonstrated a belief in the pliability of modern art to suit many types of visual expression.\n\n\n\nWritten by Zenobia Grant Wingate\n\nChronology\n\n1900 Born June 12 in Freilburg, Germany\n\nMoves with family to Milwaukee\n\n1919 Studies at the Art Institute of Chicago, Illinois\n\n1920-1921 Studies at the National Academy of Design and Parsons School of Design\n\n1923 Returns to Milwaukee to paint commercial portraiture\n\n1926 Moves to Munich, Germany to study at the Royal Academy\n\nMeets Vaclav Vytlacil, and together they enroll at Hans Hofmann School\n\n1926-1935 Travels to Germany, Switzerland, France, North Africa and Hungary\n\n1927 Moves to Switzerland due to wife’s worsening health\n\n1932 Returns to Paris after his wife’s death\n\nJoins Abstract-Creation group\n\n1935 Moves to New York City\n\n1936 Helps establish American Abstract Artists Group\n\n1939 Teaches at the Art Students League, New York\n\n1948-1950 Artist-in-Residence at the University of Georgia, Athens\n\n1950 Teaches at the Art Students League, New York\n\n1950-1952 Professor of fine arts at Washington University, St. Louis, MI\n\n1951 Summer residency at the University of California, Berkeley\n\n1955-1959 Joins fine arts faculty at Brooklyn College, New York\n\n1961 Summer Artist-in-Residence at the University of Wisconsin-Milwaukee\n\n1969 Co-authors The Painter’s Mind with Romare Bearden\n\n1970 Becomes a professor of the Emeritus of Brooklyn College, New York\n\n1973 Dies on March 22nd in New York\n\nSolo Exhibitions\n\n1927 Simonson Galerie, Paris, France\n\n1937 New Art Circle, New York\n\n1940 World’s Fair, New York\n\n1943 Nierdendorf Gallery, New York\n\n1944 San Francisco Art Museum\n\nSeattle Art Museum\n\n1946 Carnegie Institute of Pittsburgh\n\n1948 Carnegie Institute of Pittsburgh, Pittsburgh\n\nSamuel Kootz Gallery, New York\n\n1953 J.B. Neumann, New Art Circle, New York\n\n1956 Graham Gallery, New York\n\n1969 Georgia State University, Atlanta\n\n1972 The City University of New York\n\n1973 Andrew Crispo Gallery, New York\n\nGroup Exibitions\n\n1926 Milwaukee Art Institute Wisconsin Painters and Sculptors\n\n1944 New Art Circle, New York, NY Abstract and Surrealist Art in America\n\n1945 Whitney Museum of American Art (’57, ’59,’62, ’65, ’69)\n\n1950 Metropolitan Museum of Art American Painting Today\n\n1951 Museum of Modern Art Abstract Painting and Sculpture in America\n\n1963 Krannert Art Museum, University of Illinois, IL\n\nPublic Collections\n\nWorks by the artist may be found at the Addison Gallery of American Art at Phillips Academy and the Smithsonian American Art Museum.\n\nBibliography\n\nOral history interview with Carl Holty, 1964 December 8, Archives of American Art, Smithsonian Institution\n\nAmerican Abstract Art of the 1930s and 1940s. The J. Donald Nichols Collection, Wake Forrest University. Winston-Salem, North Carolina. Harry N. Abrams, Inc.\n\n\n\nVirginia M. Mecklenburg. The Patricia and Phillip Frost Collection American Abstraction 1930-1945. National Museum of American Art. Smithsonian Institution Press. 1989. pp. 112-114.\n\n\n\nSusan E. Strickler and Elaine D. Gustafson. The Second Wave: American Abstraction from the 1930s and 1940s. Selections from the Penny and Elton Yasuna Collection. Worcester Art Museum.\n\n\n\nNew York Times. Carl Holty Dies; Abstract Painter. March 24, 1973.\n\nSmithsonian Archives of American Art"}, {"url": "https://judithrothschildfoundation.org/about/", "page_content": "Judith Rothschild\n\n1921-1993\n\nJudith Rothschild, who died at the age of 71 in 1993, was a noted abstract painter whose work was exhibited widely in the United States and abroad. A graduate of Wellesley College, Rothschild studied painting at the Cranbrook Academy of Art, at the Art Students League with Reginald Marsh, at Stanley William Hayter’s Atelier 17, and with Hans Hofmann and Karl Knaths. She was a member and later president of the American Abstract Artists, a member of the Jane Street Gallery, and an editor of Leonardo magazine. Ms. Rothschild was deeply interested in the careers of fellow artists and sought to create and share opportunities for advancement with them. For instance, she joined with several fellow artists to form the cooperative Long Point Gallery in Provincetown, on Cape Cod. It is in this spirit of cooperation and support that The Judith Rothschild Foundation was created by her will, based on her belief that the life’s work of meritorious artists should be preserved and made accessible to future generations.\n\nAs a further reflection of her commitment to arts organizations and to the importance of contributing the insights of a working artist, Rothschild actively served at various times as a trustee of The American Federation of Arts, The MacDowell Colony, The New York Studio School, The Fine Arts Work Center in Provincetown, and on committees of the Pennsylvania Academy of the Fine Arts, the Philadelphia Museum of Art, and the Wellesley, Williams, and Bard College art museums.\n\nJudith Rothschild worked in oils and collage and began her relief paintings in the early 1970s; the reliefs combine figurative elements with an abstract sign language, wedding sensual color to austere formal structures. Her work is included in the collections of many museums, such as the Metropolitan Museum of Art, the National Gallery of Art, the Phillips Collection, The Museum of Modern Art, the San Francisco Museum of Modern Art, Los Angeles County Museum of Art, the Solomon R. Guggenheim Museum, the Whitney Museum of American Art, the Philadelphia Museum of Art, the Baltimore Museum of Art, the Sammlung Ludwig Museum in Aachen, The Neuberger Museum, the Corcoran Gallery of Art, the Fogg Art Museum, and the Smith and Wellesley College art museums, and a number of museums abroad including The Tate Gallery, Centre Pompidou, and the State Russian Museum, St. Petersburg."}, {"url": "https://art.state.gov/personnel/judith_rothschild/", "page_content": "Judith Rothschild, who died at the age of 71, was a noted abstract painter whose work was exhibited widely in the United States and abroad. A graduate of Wellesley College (Massachusetts), Rothschild studied painting at the Cranbrook Academy of Art (Bloomfield Hills, Michigan), at the Art Students League in New York City with Reginald Marsh, at Stanley William Hayter’s Atelier 17 (Paris, France), and with Hans Hofmann and Karl Knaths. She was a member and later president of the American Abstract Artists, a member of the Jane Street Gallery (New York’s first artists’ cooperative), and an editor of Leonardo magazine. Rothschild was deeply interested in the careers of fellow artists and sought to create and share opportunities for advancement with them. For instance, she joined with several fellow artists to form the cooperative Long Point Gallery in Provincetown, on Cape Cod (Massachusetts). It is in this spirit of cooperation and support that The Judith Rothschild Foundation was created by her will, based on her belief that the life’s work of meritorious artists should be preserved and made accessible to future generations.\n\nAs a further reflection of her commitment to arts organizations and to the importance of contributing the insights of a working artist, Rothschild actively served at various times as a trustee of The American Federation of Arts, The MacDowell Colony (Peterborough, New Hampshire), The New York Studio School, The Fine Arts Work Center in Provincetown, and on committees of the Pennsylvania Academy of the Fine Arts (Philadelphia), the Philadelphia Museum of Art, and the Wellesley, Williams (Williamstown, Massachusetts), and Bard College (Annandale-on-Hudson, New York) art museums.\n\nJudith Rothschild worked in oil paint and collage and began her relief paintings in the early 1970s; the reliefs combine figurative elements with an abstract sign language, wedding sensual color to austere formal structures. Her work is included in the collections of many museums, such as the Metropolitan Museum of Art, The Museum of Modern Art, the Solomon R. Guggenheim Museum, and the Whitney Museum of American Art, all in New York City; the Philadelphia Museum of Art (Pennsylvania; the Baltimore Museum of Art (Maryland); the Sammlung Ludwig Museum in Aachen, Germany; and the National Gallery of Art and the Corcoran Gallery of Art, both in Washington, D.C., and many others.\n\nwww.judithrothschildfdn.org"}, {"url": "https://americanart.si.edu/artist/louis-schanker-4287", "page_content": "\"Though much of my work is generally classified as abstract, all of my work develops from natural forms. I have great respect for the forms of nature and an inherent need to express myself in relation to those forms. No matter how far my experimental design may take me there remains always a core of objective reality which I have no desire to destroy or even to impair but only to investigate, analyze, develop.\"(1)\n\nLouis Schanker was one of many members of the American Abstract Artists who chose to base his art in the objects, patterns, and rhythms of nature. Although never a student of Hans Hofmann, Schanker's ideas about art had many parallels with Hofmann's. Concern for the spatial dynamics of a painting's surface, and an insistence on some aspect of nature as a starting point for art, are two areas that mirror a shared philosophy between the two artists. Although much of Schanker's later work is completely abstract, during the 1930s and 1940s he frequently used direct, identifiable themes—motifs drawn from sports, his early years working for a circus, and even socially conscious subjects not normally employed by abstract artists.(2)\n\nAs a youth, Louis Schanker quit school and ran away to join the circus. He put in two years of \"interesting but grueling hard labor.\"(3) After leaving the circus, he worked as a laborer in the wheatfields of Canada and the Dakotas, as a \"gandy dancer\" on the Erie Railroad, and as a stevedore on Great Lakes steamers. For almost a year Schanker cast his lot with hobos, riding freight trains throughout the country. In 1919, he put this itinerant life behind him and began attending night classes at Cooper Union. Subsequently, he studied at the Art Students League of New York and the Educational Alliance. Schanker spent 1931 and 1932 in Paris. He took classes at the Académie de la Grande Chaumière and worked on his own, doing \"plein air\" the work of Renoir, Degas, and Signac made a deep impression on the young artist. After he moved to Mallorca in 1933, Schanker began abstracting form to a greater degree and incorporating Cubist devices of uptilted planes and prismatic color in his work.\n\nDuring the mid 1930s, Schanker began making prints and subsequently became a graphic arts supervisor for the WPA. He also completed murals for radio station WNYC, the Neponsit Beach Hospital in Long Island, and the Science and Health building at the 1939 New York World's Fair. During World War II, Schanker worked as a shipfitter and began teaching the technique of color woodblock printing at the New School for Social Research. In 1949, he became an assistant professor at Bard College, where he remained until his retirement.\n\nThroughout the 1930s and 1940s, Schanker exhibited frequently in group shows both in museums and in commercial galleries. He became especially well known for his innovations as a printmaker. Schanker belonged to The Ten, a group that exhibited together in protest against the hegemony of Americanscene painting in Whitney exhibitions and in support of artistic experimentation and an international (rather than nativist) outlook in art.(4)\n\nSchanker imbued his prints, paintings, and sculpture with an animated expressionism that aims at a fundamental emotional structure. Sculptures such as Owl, carved in 1937, adroitly convey not only the bird's physical appearance, but the quality of mystery that has made it a symbol of wisdom and secrecy. Three Men, exhibited in the American Abstract Artists' first annual exhibition in 1937, exemplifies the expressive, angular animation for which Schanker's work was frequently praised in press reviews of the 1930s.\n\n1. Louis Schanker, \"The Ides of Art: Eleven Graphic Artists Write,\" Tiger's Eye 8 (June 1949): 45.\n\n2. In a letter to the editor of Art News in 1938, an art historian noted the similarities between Schanker's Circus, a WPA mural done for the children's dining room in the Neponsit Beach Hospital and Giovanni Battista Tiepolo's I Saltimbanchi. In his reply, Schanker said that he had chosen his subject matter based on his own experience. \"I ran away from school to join the 'big top' and put in two years of interesting but grueling hard labor as a 'canvas-man,' 'animal ostler,' and 'property-man' for clowns, acrobats and other performers with one of the best known American circuses. The visual memories that I retain of this period are, needless to say, vivid if not particularly humorous;\" \"The Artist Replies,\" Art News 37 (29 October 1938): 16.\n\n3. Louis Schanker, letter to the editor, Art News 37 (29 October 1938): 16, 21. I am grateful to Joel Schanker, Louis's brother, for relating details about Schanker's life and work in a videotaped interview, 9 June 1988.\n\n4. Other members were Ben-Zion, Ilya Bolotowsky, Louis Harris, Earl Kerkam, Ralph Rosenborg, Joseph Solman, Adolph Gottlieb, and Mark Rothko (then still using the name Marcus Rothkowitz). The group associated for five years and held exhibitions at Montross, Passedoit, and Mercury galleries, and at the Galérie Bonaparte in Paris. For further information about The Ten, see Lucy McCormick Embick, \"The Expressionist Current in New York's Avant-Garde: The Paintings of The Ten\" (Master's thesis, University of Oregon, 1982).\n\nVirginia M. Mecklenburg The Patricia and Phillip Frost Collection: American Abstraction 1930–1945 (Washington, D.C.: Smithsonian Institution Press for the National Museum of American Art, 1989)"}, {"url": "https://artincontext.org/abstract-artists/", "page_content": "Beginning in the early 20th century, the Abstract Art movement managed to introduce different types of abstraction into the main painting style that dominated the artistic world at the time. Seen as an avant-garde style, Abstract Art went on to become very influential in the formation and development of art that was nonrepresentation and essentially considered to be “pure art.” Despite initially shocking audiences, Abstract Art became more acceptable, with mere colors and shapes being used as the central motifs in the works that were created.\n\nA Brief History of the Abstract Art Period\n\nAbstract Art was an incredibly notable movement due to its complete departure from reality. Images that were depicted were entirely non-figurative and non-objective, as no concrete reference to anything remotely real or representational was made in the artworks created. Within art history, some earlier movements began to veer in the direction of abstraction, including Romanticism, Impressionism, and Expressionism. The artworks that were made in this era placed a greater focus on visual sensation as opposed to the portrayal of objects.\n\nAbstraction as an artistic style helped with the materialization of the concept of “art for art’s sake”, which was the belief that paintings and sculpture should free themselves from all external meanings. Thus, Abstract artists created art with the notion that their works should exist simply to be enjoyed for what they were. Concentration was placed on the substance of art itself, as artworks emphasized the elements of material, texture, line, tone, color, and composition over accurate depictions during this era.\n\nEfflorescence (1937) by Paul Klee, oil and pencil on cardboard; Daderot, CC0, via Wikimedia Commons\n\nRepresenting a crucial moment in modernism, Abstract Art was driven forward by many pioneering artists who believed that the emotion present within an artwork was the most crucial aspect. Acting as a catalyst for the emergence of Contemporary Art, Abstract painters were quick to reject the rules that governed traditional art as artworks created merged the concepts of both abstraction and surrealism. This paved the way for artists to move away from realistic depictions in favor of figurative works.\n\nThe arrival of the 20th century saw a revolution within the art world, as artists became independent from the visual world through the use of abstractedness in their artworks. Despite it being more than a century since the dawn of Abstract Art, the movement has remained an important aspect within the continuously evolving Contemporary Art world.\n\nThe impact of abstraction was monumental, as it brought about a fundamental shift within the history of art that is still seen today.\n\nOur Top Ten Most Famous Abstract Artists\n\nExisting as influential figures within Abstract Art as well as various other art movements, a significant number of Abstract painters are still spoken about today. Their numerous paintings have remained iconic pieces of art, which has led to some Abstract artists standing out greatly. While many artists can be included within this ranking, we will now explore our top ten list of Abstract artists whose artworks and reputations have stood the test of time.\n\nWassily Kandinsky (1866 – 1944)\n\nConsidered to be the most famous Abstract artist of all time, Russian painter Wassily Kandinsky was viewed as the leading pioneer of the entire Abstract genre. Kandinsky initially studied law and economics before he gave up academics and began painting studies, which included life-drawing, sketching, and anatomy depictions, at the age of 30. Rising to fame during the 1910s, Kandinsky is remembered as a leading figure within the development of Modern Art, with his artworks existing as the earliest Abstract paintings to be produced.\n\nAlthough pursuing figurative art before 1913, Kandinsky was noted as the first Abstract modern artist to fully and freely use pure abstraction within the artworks he created. Credited as the creator of the very first modern Abstract painting to ever exist, Kandinsky has produced many notable pieces throughout his career, with a few paintings remaining incredibly remarkable. These paintings include Untitled (First Abstract Watercolor) (1910), Composition VII (1913), Farbstudie Quadrate (1913), and On White II (1923).\n\nUntitled (First abstract watercolor) (1913) by Wassily Kandinsky; Wassily Kandinsky, Public domain, via Wikimedia Commons\n\nKandinsky claimed that he was compelled by an “inner necessity” when painting, which required him to remain indifferent to recognized and unrecognized forms and to only paint what he truly felt in the moment. Within most of Kandinsky’s Abstract paintings, his nonrepresentational figures took the shape of random geometric forms that were juxtaposed with shapes, hovering lines, and vivid colors.\n\nBelieving that color could be independent of all exterior references, Kandinsky experimented with color in such a way that it became a mere subject within his artworks. Painting was very spiritual for Kandinsky, as he tried to impart a profound sense of human emotion through his abstracted forms and vibrant colors. He believed these elements were able to surpass different cultural and physical limitations, making his works accessible to everyone.\n\nUntitled (Composition Lyrique) (1922) by Wassily Kandinsky, watercolor and India ink on paper; Wassily Kandinsky, Public domain, via Wikimedia Commons\n\nMusic also formed an essential part of Kandinsky’s work, as he saw it to be the most unparalleled form of non-objective art. He believed that music was able to express universal emotions and ideas in ways that other visual languages could not, with Kandinsky seeing it as his mission to share these ideas with the rest of the world. This led to him naming some of his more impulsive and intricate artworks as “compositions”.\n\nIn addition to being an Abstract artist, Kandinsky was a prominent member of the Der Blaue Reiter group during the German Expressionism movement, which was said to be inextricably linked to abstract painting. Kandinsky was also a professor at the Bauhaus school until it was forced to close by the Nazis leading up to the start of World War Two.\n\nThroughout his career, Kandinsky’s manipulation of vibrant colors and forms influenced the development of Abstract Art, with his contributions leading him to be seen as the “Father of Abstract Art”.\n\nPiet Mondrian (1872 – 1944)\n\nDutch artist Piet Mondrian was among the most famous Abstract artists during the movement’s peak, as he was considered to be a significant innovator of Abstract Art. Initially experimenting with figurative styles in his earlier works, Mondrian quickly transitioned into an extremely abstracted style as he began to make use of solid geometric shapes in his artworks.\n\nAs the son of a painter, Mondrian grew up being taught how to draw by his father. However, he only began to properly pursue painting as an adult and embraced Abstract Art after the end of World War One. Never once depicting any religious figures, Mondrian’s art became notable for the unique grid style of painting that he created.\n\nBroadway Boogie Woogie (1942-1943) by Piet Mondrian; Piet Mondrian, Public domain, via Wikimedia Commons\n\nMondrian’s use of squares, lines, and robust colors saw him becoming the most influential contributor to the De Stijl movement, as his artworks promoted the use of pure abstraction through reducing essential aspects relating to form and color. Thus, the majority of Mondrian’s artworks consist of very structural and nonrepresentational forms that have been highlighted in basic primary colors.\n\nSome of his most notable works include Broadway Boogie Woogie (1942 – 1943), Composition with Red, Yellow, and Blue (1937 – 1942), and Composition II in Red, Blue, and Yellow (1930). By just examining the names given to his paintings, Mondrian’s preference for the primary colors of red, yellow, blue, as well as the inclusion of black, gray, and white within his works becomes known.\n\nComposition with Yellow, Blue and Red (1942) by Piet Mondrian; Piet Mondrian, Public domain, via Wikimedia Commons\n\nThrough using this style of geometrical abstraction, Mondrian coined the term “neoplasticism” to describe his Abstract artworks, which only made use of straight lines, three primary colors, and three neutral tones. As the De Stijl movement gained in popularity, Mondrian became well-known for his focus on the simplification of form and tone within his artworks.\n\nThis led to Mondrian becoming an important leader in the progression of Abstract Art, as his iconic style went on to later influence the development of the Bauhaus movement and the Minimalist movement. These genres were both based on Mondrian’s work, with Bauhaus making use of oversimplified lines and color theory, while Minimalism focused on geometric forms and a limited color palette.\n\nMondrian’s methodical use of vertical and horizontal elements allowed his artworks to evolve in a logical manner, with his development of Neoplasticism going on to become a key proponent in Abstract Art. It took Mondrian a few years of experimentation until he found his iconic style in the early 1920s, which went on to be seen as a new method for illustrating modern reality.\n\nKazimir Malevich (1878 – 1935)\n\nWhen considering influential Russian Abstract artists who have helped define the movement, Kazimir Malevich is an important addition to the list. Malevich is mostly known for being the artist who paved the way for Suprematism, which focused on basic geometric forms like circles, squares, rectangles, and lines that were painted with a limited choice of colors. As he experimented with this movement, Malevich began to develop his use of radical abstraction, which led to his artworks becoming important pieces within Abstract Art.\n\nBlack Square (1924) by Kazimir Malevich; Kazimir Malevich, Public domain, via Wikimedia Commons\n\nIn 1915, after Kandinsky’s rise to popularity, Malevich followed in his footsteps and renounced representational painting as a whole. This led to Malevich developing a style that placed its focus on the importance of pure feeling and the reduction of pictorial scenes, which became known as Suprematism. The emergence of this style was regarded as the new painterly version of realism and allowed Malevich to make use of a reductive method in his artworks.\n\nDespite working with a variety of art styles, Malevich spent most of his career exploring the avant-garde genre of Suprematism. He included his own thinking and understanding of the concept of painting within his artworks, as he believed that true shapes and color had the ability to reign “supreme” over the images and stories being created. Malevich’s most notable artworks all make use of the Suprematist style and include Black Square (1915), Suprematist Composition (1916), and White on White (1918).\n\nSuprematist Composition (1915) by Kazimir Malevich; Kazimir Malevich, Public domain, via Wikimedia Commons\n\nAs a pioneer of geometric abstract art, Malevich experimented mainly with squares, triangles, and circles in the numerous artworks he created. While he stated that his paintings were merely compositions of flat, abstracted sections of paint, they were able to provide potent and layered symbols and feelings relating to the concepts of time and space. Malevich was seen as more radical than Cubists and Futurists in his approach to Suprematism, as his artworks followed an extremely methodical and calculated approach.\n\nMalevich was said to be a prolific writer in addition to being an artist. His essays on the ideology of art addressed a wide array of theoretical problems related to Abstract Art and its ability to guide our feelings and spirituality within the types of artworks produced.\n\nDespite his prominence, Malevich was forced to abandon Suprematism and return to figurative art in 1924 as Joseph Stalin rose to power. This was because Abstract Art was labeled as a form of decadence that should be repressed, which led to Malevich having to alter his artistic style.\n\nGeorgia O’Keeffe (1887 – 1986)\n\nOne of the most prolific female Abstract artists was Georgia O’Keeffe, who played a significant role in the development of American modernism and its relationship to the avant-garde artistic movements in Europe. Throughout her career that spanned seven decades, O’Keeffe produced a substantial amount of work that attempted to capture the emotion and strength of objects through abstractions of the natural world.\n\nExisting as one of the first female American Modern artists, O’Keeffe’s abstracted paintings focused on depicting flowers, empty landscapes, and close-up still lives, with these elements going on to become staple images within most American artistic landscape paintings. O’Keeffe’s most iconic artworks, therefore, include these portrayals of flowers, which can be seen in Blue and Green Music (1921), Red Canna (1924), and Black Iris III (1926).\n\nBlue and Green Music (1921) by Georgia O’Keeffe; Georgia O’Keeffe, Public domain, via Wikimedia Commons\n\nO’Keeffe excelled as an abstract and figurative artist, as she continually contested the boundaries of artistic style within her paintings. She combined aspects of abstraction and representation in her artworks, which demonstrated her intentional deviation from traditional artistic styles towards more innovative forms of expression.\n\nDespite being one of the most influential Abstract painters to come from the movement, O’Keeffe is perhaps more known for her unique depiction of flowers in a sensuous way. Her dramatically large close-ups of flowers gave her artworks an incredibly erotic feel, as they were thought to be representative of the female anatomy. However, O’Keeffe stated that the sensual nature of her pieces was what essentially turned them into abstracted works, as her images had the ability to mimic whatever viewers interpreted them to be.\n\nRed Canna (1919) by Georgia O’Keeffe; Georgia O’Keeffe, Public domain, via Wikimedia Commons\n\nWhile O’Keeffe did not follow any specific artistic movements when creating art, her experimentation with abstracted motifs within nature was her most profound works. She played around with creating very detailed artworks, as well as artworks that stripped away all unimportant details so as to focus on shape and color. Throughout her numerous artistic explorations, O’Keeffe’s paintings remained grounded in representation, which existed as the common element within all of her artworks made.\n\nIf you hope to complete craft projects where you need paint that will work well for any number of surfaces, then craft paint is your go-to! The consistency is smooth, creamy, and easy to use.\n\nMark Rothko (1903 – 1966)\n\nCompeting with fellow artists Jackson Pollock and Willem de Kooning for the title of the most celebrated Abstract Expressionist of all time is Russian-American artist Mark Rothko. Remembered as an important member of the Color Field Painting group, Rothko worked over his entire canvas with paint when creating artwork as opposed to subjecting certain areas to gestural attacks.\n\nRothko, who was born in Latvia, immigrated to the United States when he was a young child. He initially went to Yale for several years before dropping out, as he believed the institution was both pretentious and racist. It was only after visiting a friend in New York that he began to paint, which led to his move to the city. Rothko went through a number of different styles during his artistic career, including Surrealism, before he started to develop his own personal style. This led to the emergence of Color Field Painting, in which Rothko was the pioneer.\n\nA photograph of Mark Rothko, Yorktown Heights, ca. 1949; Consuelo Kanaga, No restrictions, via Wikimedia Commons\n\nWithin his paintings, Rothko focused on creating a magnificent type of geometric abstraction through painting juxtaposing blocks of pure colors next to one another. In a typical Rothko painting, he would depict large blobs of pigment bordering one another to create a comparison between the colors. This style can be seen in the majority of his Abstract artworks from that period, such as No. 10 (1950), No. 21 (Red, brown, black and orange) (1951), Orange, Red, Yellow (1960), and Untitled (Black on Gray) (1970).\n\nThrough this contrast, Rothko was able to create visual vibrations through his color choice, which made it seem that his blocks were hovering above the canvas when viewing the artwork. In doing so, a strong emotional response was attributed to each work, as Rothko translated different types of moods into his paintings which provoked different reactions in different viewers.\n\nRothko found great success as an artist, with his works being exhibited at the Museum of Modern Art as well as being acknowledged in Fortune magazine. This led to much jealousy in his personal relationships, which left Rothko a lonely individual.\n\nDespite his renowned international success, Rothko sadly committed suicide in 1970. His artworks leading up to his death acted as a foreshadow, as his color palette grew increasingly darker with heavier emotions being expressed.\n\nClyfford Still (1904 – 1980)\n\nAnother American artist on our list of Abstract artists is Clyfford Still, who helped elevate Abstract Expressionism into the prominent art movement it became known as. Although not as widely known as his New York School colleagues, Still was the first artist to push through to a modern and drastically abstract style in his artworks that were completely devoid of any and all obvious subject matter.\n\nStill originally produced representational works before he began experimenting with pure abstraction and nonrepresentation during the mid-1940s, which went on to influence his Abstract Expressionist contemporaries to do the same. Within his artworks created, Still made use of expansive fields of bright colors to evoke dramatic conflicts that he believed occurred between man and nature. This style can be seen in his paintings titled PH-973 (1959), PH-971 (1957), and PH-960 (1960).\n\nThe dominant theme that existed within Still’s artworks made reference to the existential battle of the human spirit against uncontrollable forces of nature. Still expressed this concept through the vertical and jagged formations that seemed to defiantly confront viewers in most of his large-scale paintings, along with the great juxtaposition of color he created.\n\nAlthough the reception of his works revolved around the results of his color combinations, Still’s expressed that he never wanted color to be accepted as purely color within his works. This concept was also applied to the texture and shapes in his paintings, as he wanted each element in his artworks to fuse together and create a living energy that could be felt when viewing the works.\n\nDespite his acclaim, Still was an infamously difficult individual to work with, who frequently rejected the New York art scene. He defied the majority of the critiques aimed at his works, which led to him going to great lengths to control how his paintings were exhibited, collected, and even sold.\n\nWillem de Kooning (1904 – 1997)\n\nOne of the most well-known Abstract artists of all time was Dutch American artist Willem de Kooning, who went on to establish a distinctly American style of painting in the artworks he created. At the age of 22, de Kooning arrived in New York City after traveling as a stowaway on a boat. He joined the Artists Union in 1934 and began painting murals but had to step away from this project as he was not a lawful citizen. De Kooning was only able to open up his own art studio after he received his citizenship, where he worked until he passed away.\n\nDe Kooning experimented with the style of abstraction through distorting figure painting to the point where the forms appeared to be abstract. Due to his captivation with this style, he never completely abandoned the depiction of the human figure within his Abstract artworks. This representation of figures can be seen in some of his most notable works, such as Woman I (1952), Woman III (1953), and Interchange (1955).\n\nWillem de Kooning in his studio, 1961; Unknown author Unknown author, Public domain, via Wikimedia Commons\n\nHis abstract paintings differed from most of his colleagues, as he continued to make reference to the human form through his abstractions. De Kooning favored depicting the woman figure, with these paintings emphasizing his unique combination of gestural abstraction and figuration. De Kooning was also greatly impacted by Pablo Picasso’s Cubist artworks, which led to him experimenting with ambiguously blending figures and ground within his own paintings, as well as dismembering, reassembling, and distorting his figures in the process.\n\nMost of de Kooning’s earlier paintings consist of female figures that were portrayed using geometric and abstract elements. It was only later in his career that he switched to more abstracted imagery within his artworks. Despite de Kooning embracing the popular image of the masculine, boozy artist, he approached art with gentle and careful thought and was viewed as one of the most intelligent artists associated with the New York School.\n\nThe prominence associated with de Kooning has led to his paintings frequently being sold for historical prices. “Woman III” (1953) was sold for $137.5 million in 2006, while “Interchange” (1955) was sold for $300 million in 2015, which was the highest price ever paid for a painting at the time.\n\nFranz Kline (1910 – 1962)\n\nAmerican artist Franz Kline was best known for his involvement within the Abstract Expressionist movement and was considered to be one of the greatest Action Painters of his time. Although he explored the same concepts in his artworks as other Abstract artists, Kline’s work remains incredibly distinct and well-respected ever since the 1950s.\n\nKline was best known for his large black and white paintings that confidently made use of abstract motifs, as well as fluid and thick brushstrokes that often intersected, overlapped, and interacted with one another. This style can be seen in his iconic artworks, such as Mahoning (1956), Untitled (1957), and Blueberry Eyes (1959 – 1960). Within these artworks, Kline made use of his distinctive gestural brushstrokes, which invoked a lot of emotion into his paintings.\n\nSabra (1966) by Franz Kline; Pedro Ribeiro Simões from Lisboa, Portugal, CC BY 2.0, via Wikimedia Commons\n\nBeginning his artistic career as a realist, Kline developed a fluent style which he perfected throughout his academic training and admiration of Old Masters of traditional art. However, after moving to New York City and meeting Willem de Kooning, his style began to evolve into his signature abstract approach for which he is known.\n\nWith artworks ranging from black-and-white pieces that experimented with negative space to vivid compositions that were incredibly dynamic and filled with energy, Kline’s artworks illustrated his evolving aesthetic as his career went on. His abstractions, especially his neutral works, went on to be likened to the cityscapes of New York, the landscape surrounding his childhood home, and Japanese calligraphy.\n\nKline’s unwillingness to attribute any hidden and subtle meanings to his artworks was an interesting stance to take, as this meant his works could be recommended to later generations of Abstract artists without predetermined and possibly outdated meanings.\n\nBy the end of his life, Kline had achieved great international acclaim for his unusual approach to gestural abstraction, with his style going on to influence the minds of countless Minimalist artists.\n\nJackson Pollock (1912 – 1956)\n\nOne of the most iconic Abstract painters of all time, whose name is synonymous with the entire Abstract Expressionist movement, is American artist Jackson Pollock. Inspired by the idea of spontaneous creation and energetic compositions, Pollock went on to develop one of the most notable art techniques to come out of the movement, known as drip painting. To produce his signature drip paintings, Pollock would drip, pour, and splash paint onto large canvases that were set up on the floor, allowing him complete access to the entire canvas.\n\nAt 18 years old, Pollock moved to New York City where he was introduced to liquid paint techniques, which began to experiment with. This led to the eventual creation of his infamous “drip paint” technique, whereby he painted canvases laid flat on the floor using his whole body at multiple angles. Drip painting went on to popularize the term “Action Painting” during Abstract Expressionism, which referred to the physical act of painting itself being seen as an important aspect of the completed work.\n\nPortrait of Jackson Pollock, 1928; Smithsonian American Art Museum, Public domain, via Wikimedia Commons\n\nA series of influences within Pollock’s life led to his creation of drip painting. Prior to his iconic artworks, Pollock was painting realist murals during the 1930s, which demonstrated to him the power of painting on a large scale. Additionally, Surrealism encouraged his exploration of the unconscious which can be deduced in his later works, with Cubism guiding his understanding of the picture space and how it should be used.\n\nSeen as America’s first significant postwar artist and subsequent its greatest, Pollock went on to make use of this gestural paint application technique in all of the notable artworks he produced. His unique style can be seen in all of his works, including Number 5 (1948), One: Number 31 (1950), and Number 11 (Blue Poles) (1952).\n\nThe paintings created using his drip painting technique led to Pollock becoming an incredibly famous artist. However, at the height of his fame, he abandoned this technique in an attempt to create a blend of abstraction and figures in new series of artworks. These paintings proved to be wildly unpopular in comparison to his drip paintings, as none of them ever sold.\n\nA bollard in Winchester, England, painted in the style of Summertime by Jackson Pollock. This is one of a series, on the corner of Great Minster Street and the Square; Andy Mabbett, CC BY-SA 3.0, via Wikimedia Commons\n\nPollock went on to develop one of the most radical abstract styles that have ever been seen in the history of Modern Art. His detachment of line and color and his redefinition of the concepts of painting and drawing found new meaning to the pictorial space, which has been expanded on ever since.\n\nThe drip paintings he produced in the late 1940s represent one of the most innovative bodies of work of the entire century, with Pollock achieving a level of fame that remained unmatched until the appearance of fellow artist Andy Warhol in the 1960s.\n\nThus, in addition to Pollock being considered the most famous Abstract Expressionist artist to exist, he is also considered to be one of the leading figures of 20th-century art as a whole.\n\nHelen Frankenthaler (1928 – 2011)\n\nAnother prominent female on the list of Abstract artists is American painter Helen Frankenthaler, who rose to fame during the Abstract Expressionist movement. considered to be one of the most influential painters of the 20th century, Frankenthaler invented a technique known as the Soak Stain technique that cemented her status as an outstanding artist. Within this technique, Frankenthaler poured thinned paint directly onto unprepared canvases and allowed the paint to seep through in order to produce luminous washes of color.\n\nBeginning her career at an early age, Frankenthaler was introduced to major artists like Robert Motherwell, Jackson Pollock, and Franz Kline, whose practices influenced her view of Abstract Expressionism. Through viewing artworks considered to be iconic Abstract works, Frankenthaler began to develop her own distinct approach to the style, which led to the emergence of her Soak Stain technique. Her breakthrough in the art world gave rise to the emergence of Color Field Painting, within which she was a pioneering member.\n\nFrankenthaler’s compositions were airy in nature, as they depicted celebrations of the pleasures related to the use of pure color in an abstracted yet gentle sense. This style can be seen in most of her notable artworks, including Mountains and Sea (1952), Canyon (1965), Savage Breeze (1974), and Madame Butterfly (2000).\n\nAfter experimenting with both phosphorescent and misty compositions that were dominated by great areas of organic color, Frankenthaler turned her attention to other artistic mediums. She began exploring the versatility of woodcuts, upon which she was able to achieve the characteristics of painting through replicating the effects of her infamous Soak Stain technique.\n\nFrankenthaler was seen as a unique Abstract modern artist due to the focus she placed on natural landscapes, which she often emulated in her works.\n\nRather than create artworks that explored existential confrontation, Frankenthaler produced gentle and dreamlike abstractions of nature and the sublime. With a lengthy career that ranged numerous generations of Abstract painters, Frankenthaler went on to exhibit her work for over six decades while she continued to produce crucial and ever-changing artworks.\n\nMany famous Abstract artists emerged from this period of creation during the 20th century, which led to the creation of many iconic artworks that are still spoken about today. If you have enjoyed going through our list of Abstract artists, we encourage you to further explore other Abstract painters who might not be as well-known but still significant within their own right.\n\nWe’ve created also an abstract artist web story."}, {"url": "https://americanabstractartists.org/exhibitions/2020s/groundings-dialogs/", "page_content": "Groundings—dialogues between contemporary and historic members of American Abstract Artists\n\nCurated by Jason Andrew\n\nFeaturing works by:\n\nAlice Adams, Suzy Frelinghuysen, Iona Kleinhaut, Katinka Mann, Nancy Manter, Betty Parsons, Judith Rothschild, Edith Schloss, Esphyr Slobodkina, & Karen Schifano\n\nGroundings examines the continuing legacy of American Abstract Artists by juxtaposing the works of historic and contemporary members of the organization. Having little abstract tradition of their own, American artists, many of them immigrants to this country, formed this group in New York in 1936 at a time when abstract art was met with strong, even critical resistance. Through this group, one of the earliest to be particularly inclusive of women artists, a new advocacy emerged providing opportunities to exhibit and a much-needed refuge for discussion related to new ideas and artistic theories.\n\nOriginators of this group channeled a Cubist-based tradition of cool structural abstraction in the face of prevailing Social Realism and later held strong to this aesthetic during the dawn of the emotive and brutish school of Abstract Expressionism. Today, the group continues to expand in numbers and varying aesthetics.\n\nThis online exhibition, the first of its kind for the organization, brings together the work of ten women artists, five of whom are historic members and five of whom are contemporary members. Through the pairing of these artists, it is my intention to find aesthetic commonalities and compositional similarities that bridge decades of thinking and making. Throughout history, whether it be ancient, modern, or contemporary, art circulates a rhythm of evolution—one generation building upon the groundings of the former.\n\nSuzy Frelinghuysen | Alice Adams\n\nSuzy Frelinghuysen (left) & Alice Adams (right)\n\nSuzy Frelinghuysen (1911–1988), Composition (Toreador Drinking), 1940\n\nOil and paper on composition board, 39 1/2 x 31 3/8 in. (100.3 x 79.7 cm)\n\nCollection of the Philadelphia Museum of Art, A. E. Gallatin Collection (1952-61-26a)\n\n© Frelinghuysen Morris House & Studio, Lenox, Mass.\n\nSuzy Frelinghuysen was a formidable force in early American Modernism. Linked to history as a Park Avenue Cubist, a group that included Albert Eugene Gallatin, George L. K. Morris, and Charles B. Shaw, her paintings flatten a subject, then expand on the principles of relative perspective. All logic of representational appearances of her subject is put aside; shapes deduced from this natural form remain.\n\nAlice Adams, Sheath, 1964\n\nCotton cord on cotton rope\n\nCollection of Beth Rudin DeWoody\n\nSculpturally based, Alice Adams has always been characterized by her interest in structure expressed through materials. Her object-based work takes on the form of the familiar but not the function. Just as Frelinghuysen used the ideas behind Cubism to explore perception and perspective, Adams has since the 1960s, developed a unique approach to sculpture. “Whether yarn, rope or steel cable in the early work or the building materials like wood and plaster in later abstract configurations, I want their ambiguity and familiarity to inform the perception of the work.”\n\nBetty Parsons | Katinka Mann\n\nBetty Parsons (left) & Katinka Mann (right)\n\nBetty Parsons (1900–1982) II Oglala, 1979\n\nAcrylic on wood, 31h x 33w x 16d in. (78.74 x 83.82 x 40.64 cm)\n\n© Betty Parsons Foundation, courtesy Alexander Gray Associates, New York\n\nBetty Parsons may have been best known as a visionary gallerist who launched the careers of Rothko, Reinhardt, and Newman, but her true genius continues to be discovered in her own artistic pursuits. While her canvases took on the painterly approaches of post-war art, her sculptural assemblages are entirely her own. Often clunky and rough, these works take on an animated and spontaneous personality when Parsons applies color and pattern. It is contour that carries the character and narrative core in both Parsons’ paintings and sculptures.\n\nKatinka Mann, Where So, 2013\n\nPainted Aluminum, 37 x 38 x 2 in.\n\nCourtesy of the artist\n\nKatinka Mann, like Parsons, relies on contour in her curved geometric works. Overtly manufactured, she cuts organic forms out of aluminum and attaches a contrasting often hard-edged shape to the cutout. “My work is influenced by Taoism. In Taoism, opposites are oneness. These paradoxes help change our perceptions of how we see space and form. My intent is to use visual elements, drawing me and others toward a new perceptual sensibility.” Embracing the flatness and clean aesthetics of minimalism, Mann uses color and texture to defy flatness.\n\nJudith Rothschild | Nancy Manter\n\nJudith Rothschild (left) & Nancy Manter (right)\n\nJudith Rothschild (1921–1993), Figure and Object, 1946\n\nOil on canvas, 30 3/16 x 40 3/16 in. (76.7 x 102.1 cm)\n\nCollection of Philadelphia Academy of Art, Gift of Mr. and Mrs. Ben Wolf (1991.6)\n\nJudith Rothschild was a remarkable colorist with a keen eye for composition. An active member of American Abstract Artists, she served as its President from 1978 to 1979. Rothschild built her compositions using a linear language—looping lines that connect into shapes—while often applying planes of color that drop one’s eye deep into a flexible space.\n\nNancy Manter, Walkie Talkie, 2020\n\nFlashe and charcoal on panel, 52 x 40 in. (132 x 101.6 cm)\n\nCourtesy of the artist\n\nSimilarly, Nancy Manter juggles space. Influenced by natural phenomena such as our radically changing atmosphere, ocean tides, and plate tectonics, Manter structures her works on panel with planes of color and texture. She uses geological terms like “dip-slip faults” and “chatter marks” to describe her work. While employing an abstract language, her work is not without emotion. “My work continues to reflect my deep sense of foreboding, anticipation and curiosity in nature, as it exists today.”\n\nEdith Schloss | Iona Kleinhaut\n\nEdith Schloss (left) & Iona Kleinhaut (right)\n\nEdith Schloss (1919–2011), Agon, 2000\n\nOil on canvas, 27 1/2 x 23 5/8 in. (70 x 60 cm)\n\n© Estate of Edith Schloss, New York\n\nEdith Schloss was known for her narrative abstractions that originate from a still life set against a window-on-the-sea or inspired by an ancient Greek myth. With a biography inextricably linked to the Loft Generation in downtown New York that included painter Willem de Kooning, photographer Rudy Burckhardt, and writer Edwin Denby, Schloss developed a style that balanced crudeness with complexity.\n\nIona Kleinhaut, Mare Nostrum: Otranto, 2018\n\nOil on linen, 24 x 22 in. (61 x 55.9 cm)\n\nCourtesy of the artist\n\nLike Schloss, Iona Kleinhaut relies on the emotive power of highly saturated and densely layered colors to introduce a narrative that often features blindfolded or disembodied heads, stunted tree limbs, or rib cage enclosures, all of which are enmeshed in an ambiguous landscape. Through the murky palette, Kleinhaut evokes the ongoing toxic legacy of fear and loss.\n\nEsphyr Slobodkina | Karen Schifano\n\nEsphyr Slobodkina (left) & Karen Schifano (right)\n\nEsphyr Slobodkina (1908–2002), Composition, 1940\n\nOil on Masonite, 12 1/4 x 9 1/4 in. (31.1 x 23.5 cm)\n\nCollection of the Philadelphia Museum of Art, A. E. Gallatin Collection (1946-70-19)\n\n© The Slobodkina Foundation, New York\n\nEsphyr Slobodkina was a founder of American Abstract Artists and served as president from 1963 to 1966. As a noted Russian avant-garde artist, her bold color and tightly controlled brushwork brought a unique and determined influence to early American modernism. Often theatrical in her composition, shapes seem to dance in and out of her paintings in rhythmic discourse.\n\nKaren Schifano, Don’t Look Now, 2017–19\n\nAcrylic, flash on canvas, 12 x 16 in. (30.5 x 40.6 cm)\n\nCourtesy of the artist\n\nIntrigued by the mind’s ability to recognize, conceptualize and manifest spatial constructs simply through the use of shape, edge and color, Karen Schifano takes constructive cues from Slobodkina, designing a performative stage in her paintings. These framed openings present a proscenium setting from which she projects shapes, symbols, and metaphors.\n\nAs these artistic pairings convey, American Abstract Artists has come to represent a multiplicity of stylistic possibilities revolving around diverse and personal ideologies. In one of his early advocacies of abstraction, George L. K. Morris argued for originality. In an article published in Paris Review, 1938, Morris implored his generation as they “desire to become grounded in the new tradition” not to “hide your voice so stiffly behind” the styles of others. Emulation has its inherent pitfalls.\n\nThere are threads of connection between the works of these ten women and the history that came before them, yet their voices are distinct. Frelinghuysen, Parson, Rothschild, Schloss, and Slobdkina made lasting strides in their pursuit of abstraction. Likewise, Adams, Mann, Manter, Kleinhaut, and Schifano are forging ahead with ideas that will endure.\n\n—Jason Andrew, Brooklyn 2020\n\nJason Andrew is an independent curator and writer based in Brooklyn.\n\nhttps://www.artistestatestudio.com/\n\nArtists’ Biographies\n\nSuzy Frelinghuysen (1911–1988)\n\nSuzy Frelinghuysen was born in New Jersey in 1911 and displayed an early interest in painting. While she never earned a formal degree she was privately tutored in art and music and made childhood trips to Europe. In 1938 became the first woman artist to have a painting placed in the permanent collection of the Museum of Living Art.\n\nhttps://www.frelinghuysen.org/bios/suzy.html\n\nAlice Adams (b. 1930)\n\nAlice Adams was born in Brooklyn, New York in 1930. She earned her BFA from Columbia University in 1953. After graduation, she studied for a year at the L’Ecole Nationale d’Art Decoratif in Aubusson, France. She is a recipient of the Guggenheim Foundation Grant and a two-time recipient of the National Endowment for the Arts Fellowship.\n\nhttps://www.aliceadamssculpture.com/\n\nBetty Parsons (1900–1982)\n\nBetty Parsons was born in New York City. She studied sculpture in Paris at the Académie de la Grande Chaumière, and in the summers, she studied painting with Arthur Lindsey on the coast of Brittany. She is best known as the gallerist behind the Betty Parsons Gallery, which she opened in 1946 and ran until her death in 1982.\n\nhttps://www.bettyparsons.org/\n\nKatinka Mann (b. 1925)\n\nKatinka Mann was born in New York City in 1925. She attended the Hartford Art School at the University of Hartford, Connecticut. Mann has been recognized by numerous grants, residencies, and awards, such as the studio program at The Elizabeth Foundation for the Arts, where she has maintained a studio from 2009–2019.\n\nhttp://www.katinkamann.com/\n\nJudith Rothschild (1921–1993)\n\nJudith Rothschild was born in New York City in 1921. A graduate of Wellesley College, Rothschild studied painting at the Cranbrook Academy of Art, at the Art Students League with Reginald Marsh, at Stanley William Hayter’s Atelier 17, and with Hans Hofmann and Karl Knaths. She was a member of the Jane Street Gallery, and an editor of Leonardo magazine.\n\nhttp://judithrothschildfoundation.org/\n\nNancy Manter (b. 1952)\n\nNancy Manter was born in Maine in 1952. She studied at the University of New Mexico, Albuquerque and the University of Wisconsin, Madison. She is a recipient of a number of grants and fellowships including two NYFA grants and a fellowship from the McDowell Colony.\n\nhttps://www.nancymanter.com/\n\nEdith Schloss (1919–2011)\n\nEdith Schloss was born in Germany in 1919. In 1936 she attended Scuola Privata at Teresita Baldi in Florence and studied Italian and Renaissance Art. In 1937 she traveled to England where she studied drawing at night at Shrewsbury Technical College. During the Blitz on London by German forces, she left England for America. In the US she studied at the Boston School of Practical Arts and applied for American citizenship. In 1942 she enrolled in the Arts Student League. In 1943 she studied art history, music and poetry at the The New School of Social Research, New York.\n\nhttp://www.edithschloss.com/\n\nIona Kleinhaut (b. 1955)\n\nIona Kleinhaut was born in 1955 in New York City, where she continues to live and work. She holds a BFA from Tyler School of Art at Temple University and an MFA from Columbia University. She is the current President of BAU Institute’s summer arts residency at the Camargo Foundation in Cassis, France.\n\nhttp://www.ionakleinhaut.com/\n\nEsphyr Slobodkina (1908–2002)\n\nEsphyr Slobodkina was born in Chelyabinsk, Russia in 1908. During the Russian Revolution of 1917, she emigrated with her family to Harbin, Manchuria (China), where she studied art and architecture. Slobodkina immigrated to the United States in 1928 where she enrolled at the National Academy of Design.\n\nhttps://www.slobodkinafoundation.org\n\nKaren Schifano (b. 1955)\n\nKaren Schifano was born in 1955 in Huntington, New York, and lives and works in New York City. She received a BA in Art History from Swarthmore College, an MFA from Hunter College, and fellowships from the MacDowell Colony and the Fine Arts Work Center in Provincetown, Mass.\n\nhttps://www.karenschifano.com/\n\n↑ top"}]}