{"The Blood Divine is a term used to refer to the blood of Jesus Christ, which is believed to have been shed for the remission of sins.": [{"url": "https://www.britannica.com/topic/two-natures-of-Christ", "page_content": "two natures of Christ, in Christianity, the doctrine stating that Jesus, through the Incarnation, became fully human and fully divine and that these natures cannot be separated. The idea that “Jesus Christ is true God and true man” is also referred to as the hypostatic union and is a central tenet of Orthodox Christianity. Indeed, the Christian doctrine of salvation depends on the belief that Christ had to become fully human to share his full divinity with humanity.\n\nChrist is often referred to as “the Word” (see logos) in Scripture, a term that refers to divine order, illumination, and the source of life and creation. The Gospel According to John states that Jesus is the Word incarnate who reveals God to humanity; the other Gospels and New Testament writings also address this idea. However, the full and technical doctrine of the two natures of Christ was arrived at over time, often with much controversy and debate.\n\nBritannica Quiz Pop Quiz: 19 Things to Know About Christianity\n\nIn the first centuries following Christ’s death, the church was forced to develop a succinct theology regarding the two natures of Christ in order to address and quell a number of divergent belief systems it deemed heresies. Gnostic Docetists, for example, believed that Christ was not truly human and did not truly suffer; Docetism was attacked by numerous opponents of gnosticism, particularly Bishop Ignatius of Antioch in the 2nd century. Another early 2nd century heresy was Monarchianism, which stated that God the Father was the sole deity and that Jesus, while considered the Redeemer, was merely a mortal endowed with divine wisdom. In 341 the Council of Antioch declared that Jesus was the Son of God by nature rather than by adoption, refuting Monarchianism.\n\nAnother significant challenge came from Bishop Arius of Alexandria, who emphasized the oneness of God. He stated that the essence (ousia) of God the Son was different from that of God the Father and that Christ could not be the same as the God of creation. He also posited that the Son came from the Father and had a beginning. In 325 the First Council of Nicaea sought to refute Arius, declaring that Christ was “begotten, not made, of the same substance as the Father.” The council used the Greek word homoousios, “of one substance,” rather than homoiousios “of similar substance.”\n\nAs a reaction against Arianism, Bishop Apollinarus the Younger stressed that Christ was divine nature housed in a human body without a human soul. In 381 the First Council of Constantinople rejected Apollinarianism as being insufficient to describe Christ as God incarnate and adopted the Nicene Creed.\n\nThe rise of Nestorianism necessitated further doctrinal uniformity, especially in relation to the personhood (hypostasis) of Christ. In 428 Bishop Nestorius of Constantinople objected to the use of the word Theotokos, “God-bearer,” to refer to the Virgin Mary. Nestorius’s refusal to style Mary as mother of God seemed to deny the unity of the God-man. In 431 the Second Council of Ephesus affirmed “that the Word, uniting to himself in his person the flesh animated by a rational soul, became man.” Nestorianism was also condemned at the Council of Chalcedon in 451.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe Council of Chalcedon also addressed the ideas of Eutyches and the monophysites, who held that Christ’s nature was altogether divine and not human. The council refuted this belief in a single nature, affirming that Christ was “perfect in Godhead and also perfect in manhood; truly God and truly man…consubstantial with the Father…and consubstantial with us.”\n\nDebates about the two natures of Christ continued after the Council of Chalcedon. In 482 the Byzantine patriarch Acacius attempted to reconcile differences with the monophysite sect, which insisted that Christ had only a single, divine nature. Acacius drew on the ideas of Christ’s divinity from the councils of Nicaea and Chalcedon but failed to acknowledge Christ’s humanity. While accepted by the Eastern church, Acacius’s teachings were declared unacceptable by the Roman Pope Felix III in 484, who excommunicated Acacius; the resultant Acacian Schism was not resolved until 519.\n\nIn 553 the Second Council of Constantinople further defined Christ as a unique, single person, a hypostasis, and one member of the Trinity. The 14 anathemas issued by the council further rejected Nestorianism by insisting yet again upon the hypostatic unity of the person of Christ in his two natures, divine and human."}, {"url": "https://www.gotquestions.org/blood-of-Christ.html", "page_content": "Question\n\nAnswer\n\nThe phrase “blood of Christ” is used several times in the New Testament and is the expression of the sacrificial death and full atoning work of Jesus on our behalf. References to the Savior’s blood include the reality that He literally bled on the cross, but more significantly that He bled and died for sinners. The blood of Christ has the power to atone for an infinite number of sins committed by an infinite number of people throughout the ages, and all whose faith rests in that blood will be saved.The reality of the blood of Christ as the means of atonement for sin has its origin in the Mosaic Law. Once a year, the priest was to make an offering of the blood of animals on the altar of the temple for the sins of the people. “In fact, the law requires that nearly everything be cleansed with blood, and without the shedding of blood there is no forgiveness” (Hebrews 9:22). But this was a blood offering that was limited in its effectiveness, which is why it had to be offered again and again. This was a foreshadowing of the “once for all” sacrifice which Jesus offered on the cross (Hebrews 7:27). Once that sacrifice was made, there was no longer a need for the blood of bulls and goats.The blood of Christ is the basis of the New Covenant. On the night before He went to the cross, Jesus offered the cup of wine to His disciples and said, \"This cup is the new covenant in my blood, which is poured out for you” (Luke 22:20). The pouring of the wine in the cup symbolized the blood of Christ which would be poured out for all who would ever believe in Him. When He shed His blood on the cross, He did away with the Old Covenant requirement for the continual sacrifices of animals. Their blood was not sufficient to cover the sins of the people, except on a temporary basis, because sin against a holy and infinite God requires a holy and infinite sacrifice. “But those sacrifices are an annual reminder of sins, because it is impossible for the blood of bulls and goats to take away sins” (Hebrews 10:3). While the blood of bulls and goats were a “reminder” of sin, “the precious blood of Christ, a lamb without blemish or defect” (1 Peter 1:19) paid in full the debt of sin we owe to God, and we need no further sacrifices for sin. Jesus said, “It is finished” as He was dying, and He meant just that—the entire work of redemption was completed forever, “having obtained eternal redemption” for us (Hebrews 9:12).Not only does the blood of Christ redeem believers from sin and eternal punishment, but “His blood will make our consciences pure from useless acts so we may serve the living God” (Hebrews 9:14 NCV). This means that not only are we now free from having to offer sacrifices which are “useless” to obtain salvation, but we are free from having to rely on worthless and unproductive works of the flesh to please God. Because the blood of Christ has redeemed us, we are now new creations in Christ (2 Corinthians 5:17), and by His blood we are freed from sin to serve the living God, to glorify Him, and to enjoy Him forever."}, {"url": "https://hermeneutics.stackexchange.com/questions/6017/according-to-hebrews-912-did-the-lord-jesus-christ-offer-his-blood-in-heaven", "page_content": "The earthly is to be an example of the heavenly:\n\nwho serve the copy and shadow of the heavenly things, as Moses was divinely instructed when he was about to make the tabernacle. For he said, “See that you make all things according to the pattern shown to you on the mountain.” (Hebrews 8:5 NKJV)\n\nEntering the Holy of Holies was determined by the calendar, not by blood. The high priest could enter only once, on the Day of Atonement. Jesus died at the time of Passover; His resurrection took place 3 days later. The Day of Atonement was about 6 months away and it is unlikely the earthly example is pointing to Day of Atonement to understand Hebrews 9:12.\n\nThe writer of the letter states:\n\nNeither by the blood of goats and calves, but by (διὰ) his own blood he entered in once into the holy place, having obtained eternal redemption for us. (Hebrews 9:12 KJV)\n\nHe entered the Holy Place, not the Holy of Holies. As additional confirmation the animals identifed are goats and calves. There are no bulls, an animal needed for the Day of Atonement, a fact the writer immediately acknowledges:\n\nFor if the blood of bulls and goats and ashes of a heifer, sprinkling the unclean, sanctifies for the purifying of the flesh. (Hebrews 9:13 NKJV)\n\nAlso the writer states:\n\nand above it were the cherubim of glory overshadowing the mercy seat. Of these things we cannot now speak in detail. (Hebrews 9:5 NKJV)\n\nWhile the Day of Atonement is discussed in the letter of Hebrews, that is not what Hebrews 9:12 is describing and the meaning of the passage should be based in what is outside the Holy of Holies.\n\nThe word διὰ means “through, on account of.” The underlying sense of the word is one of movement, “so across (to the other side), back-and-forth to go all the way through, ‘successfully across.’” [διά] Therefore if His blood marked the entrance to the Holy Place, or a door to a passageway that led to the Holy Place, He could enter by (διὰ) his own blood. (If He enters the Holy Place He need only go through the veil to reach the Holy of Holies; entrance into the first permits access to the second.)\n\nSince Jesus died on the Passover, the use of blood on the Passover should be consistent with and provide the basis for the blood in Hebrews 9:12.\n\nAt the first Passover, blood was placed on the door post in three places:\n\nAnd they will take some of the blood and put it on the two doorposts and on the lintel of the houses where they will eat it. (Exodus 12:7 NKJV)\n\nThe father of each household would kill the Passover and use the blood to mark the door to their house. A family member knew that house was a safe place to spend the night because the doorframe (not the door) was marked in 3 places. As a result, the firstborn of that household was spared and redeemed and belonged to the LORD:\n\nbecause all the firstborn are Mine. On the day I struck all the firstborn in the land of Egypt, I sanctified to Myself all the firstborn in Israel, both man and beast. They shall be Mine. I am the LORD. (Numbers 3:13 NKJV)\n\nAfter the Passover in Egypt blood was not used or included as part of the remembrance until the Passover on which Jesus died. First, when He was nailed to the cross and His blood was sprinkled on it in three places, marking the entrance to His Father’s House:\n\nThe two uses of blood on the doorframe mark two doors. The first was a door in Egypt with an earthly orientation; the second is the door outside Jerusalem with a heavenly orientation. His blood now marked the doorframe to His Father’s house. Anyone who wants to enter the house of His Father and receive the same protection the Israelites found in Egypt must enter through the door hanging upon the doorframe of the cross:\n\nI am the door. If anyone enters by Me, he will be saved, and will go in and out and find pasture. (John 10:9 NKJV) Jesus said to him, “I am the way, the truth, and the life. No one comes to the Father except through Me.” (John 14:6 NKJV) by a new and living way which He consecrated for us, through the veil, that is, His flesh. (Hebrews 10:20 NKJV)\n\nThis door is the only entrance to His Father’s house. He is the firstborn and has ” obtained eternal redemption for us.” (Hebrews 9:12) He has entered by His own blood (and marked the way for us).\n\nAt His death the temple curtain was torn from top to bottom:\n\nAnd the temple curtain was torn in two, from top to bottom (Mark 15:38 NKJV)\n\nIf the earthly is the pattern of the heavenly, then both were torn in two and the heavenly separation between Holy Place and Holy of Holies ended; entrance to one is now entrance to both. The Day of Atonement restriction was removed. Jesus is the True High Priest always able to intercede for us.\n\nSecond, every use of His blood should be consistent with what happened on earth:\n\nBut one of the soldiers pierced His side with a spear, and immediately blood and water came out. (John 19:34 NKJV)\n\nHis blood was emptied from His body; there must be some significance to the blood poured out on the ground.\n\nWhen Moses made his first trip up the mountain to receive His instructions on how to live, he never received any instructions on the sin offering or on the offering for the Day of Atonement. Before the sacrificial law, Moses received this instruction on how the high priest was to be installed:\n\nAnd thou shalt cause a bullock to be brought before the tabernacle of the congregation: and Aaron and his sons shall put their hands upon the head of the bullock. And thou shalt kill the bullock before the LORD, by the door of the tabernacle of the congregation. And thou shalt take of the blood of the bullock, and put it upon the horns of the altar with thy finger, and pour all of the blood beside the bottom of the altar.” (Exodus 29:10-12 KJV)\n\nThe blood poured out at the foot of the cross serves to install Jesus as the True High Priest. So He is the True High Priest who is able to minister for us every day of the year, including the Day of Atonement.\n\nIn heaven the Day of Atonement and daily offerings are not blood from any animal. It is the body of the resurrected Christ:"}, {"url": "https://hermeneutics.stackexchange.com/questions/5020/what-is-the-meaning-of-water-and-blood-in-1-john-56", "page_content": "Forgive me for quoting extensively from The Mystery of God: Early Jewish Mysticism and the New Testament. It's the only book I've found in more than 15 years of studying the writings of John which so clearly gets the water and blood right.\n\nThe Standard View: Water and Blood as Baptism and Death\n\nIt is tempting to suppose that the reference to water in this passage is a reference to Jesus' baptism and the blood to his death on the cross. In that case, it would appear that we have a repudiation of a Christology which asserted that only the baptism, and not the suffering of the cross, was part of the coming of Christ.\n\nThis is a very common view. Here's how the New Living Translation \"translates\" this passage, \"And Jesus Christ was revealed as God's Son by his baptism in water and by shedding his blood on the cross - not by water only, but by water and blood.\n\nPut like this, the similarities with Gnostic Cerinthus' teaching seem very marked indeed (see Irenaeus, Haer. 1.26). After all, according to Irenaeus, Cerinthus believed that Christ descended in the form of a dove, but departed from him, so that only the human Jesus suffered and rose again, while the divine Christ remained impassable. 1 John 5:6 would seem to indicate that the false teachers accepted the presence of the heavenly Christ at baptism but not at the crucifixion.\n\nIrenaus in his second century work Against Heresies mentions the teaching of one Cerinthus. \"Cerinthus, again, a man who was educated in the wisdom of the Egyptians, taught that the world was not made by the primary God, but by a certain Power far separated from him, and at a distance from that Principality who is supreme over the universe, and ignorant of him who is above all. He represented Jesus as having not been born of a virgin, but as being the son of Joseph and Mary according to the ordinary course of human generation, while he nevertheless was more righteous, prudent, and wise than other men. Moreover, after his baptism, Christ descended upon him in the form of a dove from the Supreme Ruler, and that then he proclaimed the unknown Father, and performed miracles. But at last Christ departed from Jesus, and that then Jesus suffered and rose again, while Christ remained impassible, inasmuch as he was a spiritual being.\"\n\nIrenaus also records an antagonism between John and Cerinthus through an anecdote of Polycarp's, the disciple of John. \"There are also those who heard from him (Polycarp) that John, the disciple of the Lord, going to bathe at Ephesus, and perceiving Cerinthus within, rushed out of the bath-house without bathing, exclaiming, “Let us fly, lest even the bath-house fall down, because Cerinthus, the enemy of the truth, is within.”\n\nProblems with Water and Blood Referring to Baptism and the Cross\n\nBut there's several problem's with this interpretation.\n\nFirst of all, it is by no means obvious that the coming of Christ spoken of in 1 John refers to the events which characterized his life as a whole but speak rather of the mode of his coming (i.e. his incarnation, the reality of his humanity). This seems to be the case in 1 John 4:2 and 2 John 7, where the coming on both occasions is linked explicitly with the humanity of Jesus.\n\n1 John 4:2 states, \"by this you know the Spirit of God: every spirit that confesses that Jesus Christ has come in the flesh is from God, and every spirit that does not confess Jesus is not from God.\" 2 John 7 reads, \"For many deceivers have gone out into the world, those who do not confess the coming of Jesus Christ in the flesh.\"\n\nA more natural explanation of 5:6, therefore, is to suppose that the water and the blood refer to the nature of the incarnate Christ rather than events in his life. This is a view which would seem to be confirmed by the passage in John 19:34, which seems to parallel 1 John 5:6.\n\nJohn 19:34, the only mention of blood in the crucifixion is an element of Christ's body and not simply the representation of an event. It says, \"But one of the soldiers pierced his side with a spear, and at once there came out blood and water.\"\n\nThe point is further supported by a study of blood in the writings John. Though the only reference to blood in John (1:7) may seem to point to the event of Jesus crucifixion its more likely that it refers to the physical nature of his sacrifice. In the gospel of John (specifically 1:13, 6:53) blood and flesh have a synonymous meaning.\n\nSecondly, the other passage dealing with the false teaching in 4:2 is not so easy to interpret in the light of the teaching of Cerinthus as many have supposed. The issue here, and for that matter also in 2 John 7, is not the extent of the presence of the heavenly Christ throughout the life of Jesus of Nazareth, but the reality of the humanity of Jesus Christ. There seems to be no question here of the problem of a separation between the divine Christ and the humanity of Jesus. Rather, the author of 1 John repudiates the views of the those who reject the reality of the incarnation. This was not, as far as one can ascertain, part of Cerinthus's Christology. Thus, if we start with 4:2 as a summary of the Christology of the false teachers, we are driven to conclude that the issue was the reality of the humanity of Jesus Christ.\n\nSo what then does the water mean?\n\nBlood and Water as the Human and Divine Natures of Christ.\n\nHow then are we to understand 5:6 in this light? Is this a separate christological deviation, or can it be related to the other aspects of the false teachings? The reference in 1 John 5:6 is not to events in Jesus' life but an affirmation of the reality of the incarnation by pointing out the character of Jesus' nature, in much the same way as the parallel passage in John 19:34. This view has the advantage of being consistent with 1 John 4:2 and 2 John 7. There are two further factors to be borne in mind when interpreting the passage in the latter way, either the reference to water and blood could reflect ancient beliefs about human beings, or the water and the blood could represent the two aspects of Jesus' nature, the water the divine, the blood the human. The second alternative fits better with the fact that the writer wants to deny a view that Jesus Christ came by water only, an idea which is not completely comprehensible if this passage is merely about the make-up of humans. Emphasis on blood as a sign of the reality of the incarnation is found also in Ignatius, Smyrn. 6, and such an emphasis contrasts with those who deny the reality of his humanity by suggesting that the body of Jesus was made up of some other substance.\n\nIgnatius in his letter says, \"Let no man be deceived. Even the heavenly powers and the glory of the angels and the principalities both visible and invible, except they believe in the blood of Christ.\" In speaking of those who deny this he goes on to state, \"They have no thought for love, nor for widow, the orphan, the afflicted, the prisoner, the hungry nor the thirsty. They withhold themselves from Communion and prayer, because they confess not that communion is the flesh of our Savior Jesus Christ, which flesh suffered for our sins, and which in His loving-kindness the Father raised up.\"\n\nWengst rightly points out the difficulty of finding examples of Gnostic teachers who considered that Jesus was made up of a watery substance, without any human blood. There is some evidence, however, to suggest that some later Gnostics did think of Christ as consisting of an ethereal substance (Tertullian, De carne Christi 6 and Adv. Marc. 3.11).\n\nTertullian states, \"Thus the official record of both substances represents him as both man and God: on the one hand born, on the other not born: on the one hand fleshly, on the other spiritual: on the one hand weak, on the other exceeding strong: on the one hand dying, on the other living. That these two sets of attributes, the divine and the human, are each kept distinct from the other, is of course accounted for by the equal verity of each nature, both flesh and spirit being in full degree what they claim to be: the powers of the Spirit of God proved Him God, the sufferings proved there was the flesh of man.\"\n\nIndeed, in a passage which explicitly quoted John 19:34, Origen himself seems to make a similar point against celsus in Contra Celsum 2.36. In this passage Origen sees the water which flowed from the side of the crucified Jesus as a miraculous indication of his divinity.\n\nCelsus had asked, \"What is the nature of the ichor in the body of the crucified Jesus? Is it such as flows in the bodies of the immortal god's\". Celsus had drawn this conclusion in part from the Illiad, where Homer states concerning the wounding of Aphrodite, \"and blood immortal flowed from the goddess, ichor, that which funds in the veins of the blessed divinities; since these eat no food, nor do they drink of the shinning wine, and therefore they have no blood and are called immortal.' As these authors say, Origen counters Celsus' spirit of mockery but does not deny that the water is a representation of Christ's diety."}, {"url": "https://openthebible.org/article/the-power-in-the-blood-of-jesus-christ/", "page_content": "French philosopher Voltaire and American President John Adams are famous for their criticisms of Christianity as a bloody religion, pointing to the Bible’s frequent wars, mention of blood, and bloody death of Jesus Christ. Why then do Christians celebrate the blood of their Founder when blood is usually considered grotesque?[1]\n\nWhat follows are six gifts the blood of Jesus Christ affords those who believe in Him.[2]\n\n1. We gain bold access to God in worship and prayer\n\nThe Bible is clear that every person is separated from God because of our sin (Romans 3:23; Colossians 1:21). That means even the best of us are unable to approach God and offer worship or prayer. Because of our sins, we remain at a distance.\n\nBut because of the death of Jesus on the cross, Christians to come boldly into God’s presence. “We have confidence to enter the holy places by the blood of Jesus” (Hebrews 10:19). If you are a Christian today, you can have confidence as you approach God with your prayers and worship, because you are no longer far away from God, but “have been made near by the blood of Christ” (Ephesians 2:13).\n\n2. We receive the forgiveness of our sin\n\nIn addition to being able to enter into God’s presence through the blood of Christ, we are also forgiven of our sins. Ephesians 1:7 says, “In Him we have redemption through His blood, the forgiveness of sins, according to the riches of His grace.” Because of Christ’s shed blood, God is able to forgive us of sins because He took our punishment. While we deserve hell because of our sin, Jesus’ sacrifice makes heaven our eternal destination.\n\nChrist explained the forgiveness He offers to His disciples at the Last Supper (which was also the meal celebrating the Passover Lamb): “For this is my blood of the covenant, which is poured out for many for the forgiveness of sins” (Matthew 26:28; emphasis mine). Just as the blood of the Passover lamb delivered the Israelite people from the night of terror in Egypt, Christ’s own blood would deliver from the judgment of God. This truth is expressed beautifully in the hymn, “Nothing But the Blood”:\n\nWhat can wash away my sin?\n\nNothing but the blood of Jesus;\n\nWhat can make me whole again?\n\nNothing but the blood of Jesus. Oh! Precious is the flow\n\nThat makes me white as snow;\n\nNo other fount I know,\n\nNothing but the blood of Jesus.\n\nTake joy, Christian, that the blood of Jesus Christ has cleansed you from your sin!\n\n3. We have our consciences cleansed\n\n“[T]he blood of Christ, who through the eternal Spirit offered himself without blemish to God, [will] purify our conscience from dead works to serve the living God” (Hebrews 9:14)\n\nThis is an amazing promise, Christ cleanses our consciences from acts that lead to death! How does He do it? He offered Himself—His unblemished, perfect life—as a sacrifice to God for us on account of our sins.\n\nEven though our minds have been corrupted by sin, Christ can cleanse us. We are able to live and think the way God wants us to once again. This is great news for those who are burdened by a sinful past and corrupted consciences.\n\n4. We are progressively cleansed from more and more sin\n\nThe blood of Christ not only offers forgiveness of sin, but also sanctification. Hebrews 13:12 tells us that “Jesus also suffered…in order to sanctify the people through His own blood.” It makes sense that God wants us to be in a new relationship with the sin that previously condemned us. That is why He gives us the power, through the blood of His Son, to be cleansed from our sinful behaviors.\n\n5. We are able to conquer the accuser of the brethren\n\nBecause of Christ’s sacrifice, we can trust in the righteousness of Christ and not our own righteousness when we are accused by our enemy. Revelation 12:11 says, “And they have conquered him [Satan] by the blood of the Lamb and by the word of their testimony, for they loved not their lives even unto death.” As believers, we know that we cannot stand on our own merit or because of our own deeds. Christ’s righteousness attributed to us is how we can stand up against accusations.\n\n\n\nCharles Spurgeon knew this truth well and spoke these comforting words:\n\nI know what the devil will say to you. He will say to you, ‘You are a sinner!’ Tell him you know you are, but that for all that you are justified. He will tell you of the greatness of your sin. Tell him of the greatness of Christ’s righteousness. He will tell you of all your mishaps and your backslidings, of your offences and your wanderings. Tell him, and tell your own conscience, that you know all that, but that Jesus Christ came to save sinners, and that, although your sin be great, Christ is quite able to put it all away.\n\n6. We are rescued out of a sinful way of life\n\n…you were ransomed from the futile ways inherited from your forefathers, not with perishable things such as silver or gold, but with the precious blood of Christ, like that of a lamb without blemish or spot. (1 Peter 1:18-19)\n\nBeing ransomed from futile ways is another benefit Christians have through the blood of Jesus. We are rescued from a life lived devoid of meaning and are brought into a relationship with God and the ability to live in His will and with purpose. The world’s most valuable items like gold and silver can’t compare with the lasting and eternal value of the blood of Jesus Christ shed to redeem sinners from sin.\n\nThere Is Power in the Blood!\n\nDoes the blood of Jesus cover your sin? If not, these glorious benefits are not for you. But if you humble yourself and cry out to Jesus Christ for forgiveness, He will save you. There is no greater gift than reconciliation with God. Trust in Jesus today!\n\n–\n\n[1] Here is just a sampling of the hymns that have been written throughout the ages about the blood of Christ: “ Nothing But the Blood”, “Are You Washed in the Blood?”, “ Oh, the Blood of Jesus”, “ Power In the Blood”.\n\n[2] These categories were taken from Dr. Wayne Grudem’s comments on 1 Peter 1:19 in 1 Peter: An Introduction and Commentary."}, {"url": "https://www.biblestudytools.com/bible-study/topical-studies/why-is-the-blood-of-jesus-so-powerful.html", "page_content": "If you grew up in church, perhaps you’re familiar with the terminology that Jesus’ blood cleanses us. But why is the blood of Jesus so powerful? And have we truly grasped the weight of Jesus’ sacrifice and the immense privilege we have to be washed by the blood of the Lamb?\n\nIn the Old Testament, it was only through the shedding of blood in animal sacrifices that man could be cleansed from sins, because “it is the blood that makes atonement for one’s life” (Leviticus 17:11).\n\nBut animal’s blood is not powerful enough to bring redemption from the curse upon mankind. This restoration could only be made in the shedding of blood from God’s own heavenly bloodline.\n\nAny other type of blood would have been too contaminated.\n\nLook at what Hebrews 9:12-14 says about Jesus’ blood: “With his own blood—not the blood of goats and calves—he entered the Most Holy Place once for all time and secured our redemption forever. Under the old system, the blood of goats and bulls and the ashes of a heifer could cleanse people’s bodies from ceremonial impurity. Just think how much more the blood of Christ will purify our consciences from sinful deeds so that we can worship the living God. For by the power of the eternal Spirit, Christ offered himself to God as a perfect sacrifice for our sins.”\n\nThis was the perfect sacrifice that God purchased with a “high price” (1 Corinthians 6:20, 7:23). He wanted to redeem mankind back to Himself so that we could have access to His presence once again and receive a remission for our sins—without having to perform sacrifices and rituals.\n\nJesus’ blood is our ticket to boldly enter God’s presence. Hebrews 10:19-22 says, “And so, dear brothers and sisters, we can boldly enter heaven’s Most Holy Place because of the blood of Jesus. By his death, Jesus opened a new and life-giving way through the curtain into the Most Holy Place. And since we have a great High Priest who rules over God’s house, let us go right into the presence of God with sincere hearts fully trusting him. For our guilty consciences have been sprinkled with Christ’s blood to make us clean, and our bodies have been washed with pure water.”\n\nIt wasn’t just because of Jesus’ love for His Father that He went along with the plan. It was His love and compassion toward us. He witnessed, firsthand, the curse of evil that had spread throughout humankind, and He longed for us to be purged of that wickedness, knowing it was only His blood that contained the necessary healing and purification properties.\n\nJesus wanted us to receive the power that His blood contained. He knew, if we accepted our new life in Him, then we, too, would receive…\n\nPeace with God:\n\n“And through him God reconciled everything to himself. He made peace with everything in heaven and on earth by means of Christ’s blood on the cross” Colossians 1:20.\n\n“And since we have been made right in God’s sight by the blood of Christ, he will certainly save us from God’s condemnation” Romans 5:9\n\nFreedom and redemption:\n\n“He is so rich in kindness and grace that he purchased our freedom with the blood of his Son and forgave our sins” Ephesians 1:7.\n\n“All glory to him who loves us and has freed us from our sins by shedding his blood for us” Revelation 1:5.\n\nCleansing of our sins:\n\n“…the blood of Jesus, his Son, cleanses us from all sin” 1 John 1:7b.\n\nHoliness:\n\n“So also Jesus suffered and died outside the city gates to make his people holy by means of his own blood”Hebrews 13:12.\n\nRedemption:\n\n“For you know that God paid a ransom to save you from the empty life you inherited from your ancestors. And it was not paid with mere gold or silver, which lose their value. It was the precious blood of Christ, the sinless, spotless Lamb of God” 1 Peter 1:18-19.\n\nA new covenant that brings us into right standing with God:\n\n“After supper he took another cup of wine and said, ‘This cup is the new covenant between God and his people—an agreement confirmed with my blood, which is poured out as a sacrifice for you” Luke 20:22.\n\nAnd a perfect restoration of fellowship with our Heavenly Father:\n\n“But now you have been united with Christ Jesus. Once you were far away from God, but now you have been brought near to him through the blood of Christ” Ephesians 2:13.\n\nWhat Is the Purpose of the Blood of Jesus?\n\nThe fall in the Garden of Eden created a division between mankind and God. From that point on, our sin separated us from our Creator—and the only way we could be made right in His eyes was through the shedding of blood as used in animal sacrifices. This blood would serve as an atonement, a covering, of our sins.\n\nWe are reminded of this in Hebrews 9:22: “In fact, according to the law of Moses, nearly everything was purified with blood. For without the shedding of blood, there is no forgiveness.”\n\nWhen God accepts a blood sacrifice, it’s because the life that is within that sacrifice has the power to purge the evil—the death—that flows through our own veins. It’s the “life of the flesh” that is “in the blood,” according to Leviticus 17:11. The actual blood of the animal wasn’t powerful within itself; rather, it was God’s accepting of it that gave it that power.\n\nThe animal became a substitute, dying in place of man.\n\nGod, however, was “not pleased with burnt offerings or other offerings for sin” (Hebrews 10:6). Jesus agreed to do His Father’s will because He knew it would be the only sacrifice that “cancels the first covenant in order to put the second into effect” (Hebrews 10:9).\n\nBlood is a life-giving substance, as it carries within it the life of the body. This explains why, if we bleed to death, then our life becomes emptied out as well.\n\nIt’s the life found within the blood that makes atonement for sins by infusing life into death.\n\nThe blood of animals, however, was not potent enough. It was only in the blood inherited from the Divine—pure blood that did not contain a trace of death’s contamination—that could forever purge us of our sins.\n\nSo, when we accept Christ into our life, our Heavenly Father imparts Jesus’ life-giving blood into our veins. Our faith allows us to receive a “blood transfusion,” except this type of blood carries eternal life. And it’s this eternal life that forever expels the contamination of Adam’s sin that was once polluted our bloodstream.\n\nAmazing, isn’t it?\n\nAs a result, this “blood transfusion” causes us to become a new person, according to 2 Corinthians 5:17: “This means that anyone who belongs to Christ has become a new person. The old life is gone; a new life has begun!”\n\nHow Does Jesus' Blood Protect Believers?\n\nIf Jesus’ blood courses through our veins, then we are protected from the attacks of the enemy. How? Because Satan is nicknamed “Lord of the flies” (which comes from Baal-zebub). So, when we become covered by the blood of the Lamb, then Satan must flee, because the enemy is only attracted to death.\n\nThere’s a reason why Jesus was sacrificed at the time of the Feast of the Passover. This was a day when the Jews would remember when God protected the children of Israel from destructive plagues. How were they protected? Because of their obedience in covering their doorframes with the blood of unblemished lambs.\n\nExodus 12:13 says, “But the blood on your doorposts will serve as a sign, marking the houses where you are staying. When I see the blood, I will pass over you. This plague of death will not touch you when I strike the land of Egypt.”\n\nThis was a foreshadow of what was to come in Jesus. Those of us who, by faith, remain beneath the covering of the blood of the Lamb, will be protected from the enemy and his demons. This blood protects us, providing us with an exodus, from the penalty of our sins.\n\nJesus volunteered Himself to be our Passover.\n\nWhy Should All Christians Know about This?\n\nRomans 3:25a says, “God presented Christ as a sacrifice of atonement, through the shedding of his blood—to be received by faith.”\n\nThis faith must be consistently active and displayed through obedience because faith without obedience is dead (James 2:17, James 2:22 and 24). We cannot claim to be covered by Jesus’ blood if we, in rebellion and lack of faith, walk out from beneath its covering.\n\nPeter says, in 1 Peter 1:2, that we are elect according to “obedience and sprinkling of the blood of Christ.” He then tells us that we, as a holy priesthood, are “to offer up spiritual sacrifices acceptable to God through Jesus Christ” (1 Peter 1:5).\n\nIn “The Power of the Blood,” H.A. Maxwell Whyte says, “As the priests offered up daily blood sacrifices on behalf of the people in Old Testament times, so also today in New Testament times we offer the Blood of Jesus Christ to God as our plea on behalf of ourselves, our children, our loved ones…”\n\nAs we know, the old rules of worship and sacrifices are an “illustration pointing to the present time” (Hebrews 9:9). The earthly tabernacle was based on the heavenly one. Once a year, the High Priest went within the Holy of Holies to sprinkle the animal blood along the mercy seat. God’s glory was only evident when the blood was used. This was the only way in which the Priest could come before God’s throne.\n\nLikewise, we, too, can only approach God’s throne by the sprinkling of Christ’s blood.\n\nHebrews 10:22 tells us to “draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience and our bodies washed with pure water.”\n\nThis, again, is an active form of sprinkling.\n\nThe mention of the sprinkling of blood in Hebrews 12:24 refers to a present-tense experience as well. We are to come to the blood of sprinkling and pray through the blood of Jesus. Not just yesterday, when we received salvation in Christ, but today. Hebrews 10:14 says, “For by one offering He has perfected forever those who are being sanctified.” His blood continues to sanctify us; if that were not the case, then we would never need to repent for our sins ever again.\n\nThe covenant of protection made to the Israelites, saving them from the plague, could only be fulfilled by their obedience. If they were to walk out of from beneath covering, they would have been destroyed. Again, this is a foreshadowing, an illustration, of the protection we receive when we are covered by the blood of the Lamb.\n\nIt’s this blood that grants us access to the shelter of God’s presence.\n\nAnd it’s there where our victory is found, according to Revelation 12:9, which reminds us that we can only overcome by the “blood of the Lamb and the word of their testimony.”\n\nVictory blood courses through our veins. We receive it straight from God’s throne room, and it brings forth transformation. Cleansing. Deliverance. Healing. Breakthrough. Salvation. So why should we still act lifeless, like the world does—void of hope and freedom?\n\nIf a dying man were to receive a blood transfusion that pulled him out of death and restored life back into his body, do you think he’d choose to remain bedridden? Absolutely not! He’d spend the rest of his days rejoicing over this second chance at life.\n\nYet that’s what we do when we Christians act like we’re still on the verge of death. What a disgrace this must be to Jesus after the price He paid for our freedom!\n\nSince we have received the most powerful “blood transfusion,” it’s time we stop acting like dead men, arise from our hospital beds, and rejoice in our new life in Christ.\n\nA life granted to us by the power of the blood of the Lamb.\n\nPhoto credit: ©GettyImages/g215\n\nTessa Emily Hall is an award-winning author who wrote her debut novel when she was sixteen. She is now a multi-published author of both fiction and non-fiction inspirational yet authentic books for teens, including her latest release, LOVE YOUR SELFIE (October 2020, Ellie Claire). Tessa's passion for shedding light on clean entertainment and media for teens led her to a career as a Literary Agent at Cyle Young Literary Elite, YA Acquisitions Editor for Illuminate YA (LPC Imprint), and Founder/Editor of PursueMagazine.net. She is guilty of making way too many lattes and never finishing her to-read list. When her fingers aren’t flying 128 WPM across the keyboard, she can be found speaking to teens, teaching at writing conferences, and acting in Christian films. Her favorite way to procrastinate is to connect with readers is on her mailing list, social media (@tessaemilyhall), and website: www.tessaemilyhall.com."}, {"url": "https://www.crosswalk.com/faith/bible-study/things-the-bible-tells-us-about-the-blood-of-jesus.html", "page_content": "There are a plethora of hymns and worship songs that talk about the blood of Jesus. Some of my favorites include:\n\nWhat can wash away my sin?\n\nNothing but the blood of Jesus;\n\nWhat can make me whole again?\n\nNothing but the blood of Jesus.\n\nThere is power, power, wonder working power\n\nIn the blood of the Lamb;\n\nO victory in Jesus,\n\nMy Savior, forever.\n\nHe sought me and bought me\n\nWith His redeeming blood\n\nWhat is the power of the blood of Jesus and why do we sing about it so much? If you think about the meaning of the blood of Jesus in Christianity - it is everything. In Hebrews 9:22 we are reminded that without the shedding of blood there is no remission of sins. If Jesus did not die on the cross and shed his blood for our sins then we have no hope of forgiveness. That means that this blood that Jesus shed has power first and foremost to wash away sins and that should mean everything to a Christian.\n\nThe Blood of Jesus Is Life-Giving\n\nLeviticus 17:11 teaches us, “For the life of the body is in its blood. I have given you the blood on the altar to purify you, making you right with the LORD. It is the blood, given in exchange for a life, that makes purification possible.”\n\nWhenever someone donates blood they are literally giving a part of their life so that another might live. The sacrifice a person makes of temporary pain and loss provides a greater gain of another. If a person has no blood running through their veins, the person has no life. Jesus Himself knew that His blood would be given in a greater way than a blood drive. Rather than giving life to one or a few other people, His blood gives life to all who accept Him.\n\nWe see from the beginning that the consequence of sin is death. Since life is in the blood, from the beginning we see God Himself teach humanity to sacrifice animals to cover their sins. (Genesis 3:21) The lives of sacrificed animals were the temporary offerings over the sins of the people performed by the high priests. Hebrews 5:1 says, “For every high priest taken from among men is appointed on behalf of men in things pertaining to God, in order to offer both gifts and sacrifices for sins.”\n\nWe see that Abraham’s faith made him well. It wasn’t so much the sacrifice of sins but the obedience out of a heart of faith that the Messiah was coming. BibleStudyTools shares Bible verses that tell us that Jesus’ blood gives us new life and redemption.\n\nEphesians 1:17 “In him we have redemption through his blood, the forgiveness of sins, in accordance with the riches of God ’ s grace.”\n\ns grace.” Hebrews 9:14 “How much more, then, will the blood of Christ, who through the eternal Spirit offered himself unblemished to God, cleanse our consciences from acts that lead to death, so that we may serve the living God!”\n\nHebrews 13:12 “And so Jesus also suffered outside the city gate to make the people holy through his own blood.”\n\nThe Blood of Jesus Was Necessary\n\nPure, perfect blood was a requirement to reconcile us back to God. We often do not like to think about our sins and the devastation of separation that they have caused us from the Creator, but in reality, we are under the punishment of sin which is death. As we read of blood sacrifices paid on behalf of the sins of the people of God, we are even more aware of what would have been required of us had Jesus not come. We are significantly blessed to be on this side of the cross. Jesus’ blood covered all sins in one divine moment of death, He brought us eternal life.\n\nColossians 1:20, “And through him to reconcile to himself all things, whether things on earth or things in heaven, by making peace through his blood, shed on the cross.”\n\nHebrews 9:22, “In fact, the law requires that nearly everything be cleansed with blood, and without the shedding of blood there is no forgiveness.”\n\nMatthew 26:28, “This is my blood of the covenant, which is poured out for many for the forgiveness of sins.”\n\nI even ponder the time when the angel of death was going to take the first born sons in Egypt during the time of Moses. This was the final plague on Egypt because Pharaoh would not let the Israelites go. (Exodus 12:23) Blood from a pure animal was the necessary action to protect the first borns from death. This was a foreshadowing of the blood that Christ would one day shed on the cross to protect us all who accept Him from eternal death.\n\nThe Blood of Jesus Gives Freedom\n\nRevelations 1:5 “And from Jesus Christ, who is the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth. To him who loves us and has freed us from our sins by his blood.”\n\nWe all have had a death sentence. We have been trapped by the deception and luring of our sinful ways. Jesus’ blood sets us free from the punishment of sin. We no longer have to live under the bondage and condemnation of sin. Because Jesus has the victory, those who follow Him share in His victory. (1 Corinthians 15:57)\n\nWe do not need to be fearful of the punishment of eternal death and separation from God. We have been justified by Jesus’ blood and saved from the wrath of God. According to Webster’s Dictionary, justified means, “Having or shown to have a just, right, or reasonable basis.” This means that we have been made right by the blood of Jesus. What sins made wrong that caused us to be guilty, Jesus’ blood took care of on our behalf.\n\nImagine being sentenced to prison and then death. The gut-wrenching moment of realizing that you were guilty and you could not pay your way, smooth talk your way, or argue your way out of it. Then, steps in a Man with a perfect track record who never did anything wrong. He says that he would like to take your place. So the guards bind him in chains that were meant to be yours, mock him, beat him, and ultimately kill him instead of you. This is what Jesus did for us through His bloody death. We no longer have to hold the weight of punishment from sins, but it is by His great love that we have been set free.\n\nRomans 5:9 “Since we have now been justified by his blood, how much more shall we be saved from God’s wrath through him!”\n\nThe Blood of Jesus Was Perfect\n\nIn order for Jesus’ blood to make a difference, He needed to be perfect. Jesus’ perfection was a result of Him being fully God and fully man. Whenever a sacrifice was made prior to Jesus, they were always “a male without defect.” The Hebrew word tamiym meaning, to be complete is from the root word tamam which means to be finished. Sinful people needed a sinless Savior. Jesus purified us whiter than snow with His perfect blood.\n\n1 Peter 1:18-19 “For you know that it was not with perishable things such as silver or gold that you were redeemed from the empty way of life handed down to you from your ancestors, but with the precious blood of Christ, a lamb without blemish or defect.”\n\nMaybe you are not feeling valuable or seen today? Perhaps you feel that you are too dirty for Jesus. I encourage you to take heart and believe His words that His sacrifice took care of every sin.\n\nJohn 1:29 says, \"The next day John saw Jesus coming toward him and said, ‘Look, the Lamb of God, who takes away the sin of the world!’” His blood gives life, it was necessary, it gives us freedom, and it was perfect. Because of His great love to lay down His life, we can believe in Him and now have eternal hope that we have been covered by the Lamb of the world.\n\nPrayer of Thankfulness for the Blood of Jesus\n\nJesus, thank You for leaving heaven and coming to earth to die on the cross for me. Thank You for shedding Your blood so I could begin each day in the joy of being cleansed and forgiven. Thank You for being the Lamb of God, my perfect Savior from sin!\n\nPhoto Credit: ©iStock/Getty Images Plus/RomoloTavani\n\nEmma Danzey’s mission in life stems from Ephesians 3:20-21, inspiring young women to embrace the extraordinary. One of her greatest joys is to journey with the Lord in His Scriptures. She is wife to Drew for over two years and mom to baby Graham. Drew and Emma serve with Upstate CRU college ministry in South Carolina. Emma is an avid writer for Salem Web Network and provides articles on the Bible, life questions, and on the Christian lifestyle. Her article on Interracial Marriage was the number 1 viewed article on Crosswalk for the year 2021. All the glory to the Lord! She had the joy of hosting Her Many Hats podcast where she explored the many roles that women play while serving One God. Most recently, Emma has released her first Bible Study Book, Wildflower: Blooming Through Singleness.\n\nEmma enjoys singing/songwriting, fitness classes, trying new recipes, home makeover shows, and drinking tea! During her ministry career, Emma recorded two worship EP albums, founded and led Polished Conference Ministries, ran the Refined Magazine, and served in music education for early childhood. Emma also had the privilege of having been a national spokesperson for Mukti Mission based out of India. Mukti has been working to restore shattered lives in India for over 120 years. You can view her articles through her blog at emmadanzey.wordpress.com and check out her Bible Study videos on Instagram @Emmadanzey.\n\nThis article is part of our larger Holy Week and Easter resource library centered around the events leading up to the death and resurrection of Jesus Christ. We hope these articles help you understand the meaning and story behind important Christian holidays and dates and encourage you as you take time to reflect on all that God has done for us through his son Jesus Christ!\n\nWhat Lent and Why is it Celebrated?\n\nWhat is the Holy Week?\n\nWhat Is Palm Sunday?\n\nWhat is Maundy Thursday?\n\nWhat Is Good Friday?\n\nWhat Is Easter?\n\nEaster Prayers\n\nAt Easter, the Son of God took on the world’s sin and defeated the devil, death, and the grave. How is it that history’s most glorious moment is surrounded by fearful fishermen, despised tax collectors, marginalized women, feeble politicians, and traitorous friends?\n\nIn The Characters of Easter, you’ll become acquainted with the unlikely collection of ordinary people who witnessed the miracle of Christ’s death and resurrection. This FREE podcast provides a fresh approach to the Lenten season and can be used as a devotional or study for individuals and groups.\n\n\n\n"}, {"url": "https://www.patheos.com/blogs/richardmurray/2019/12/understanding-the-blood-of-jesus/", "page_content": "Nothing seems to alternatively bore and divide Christians more than does “atonement theory.” How are we to understand Jesus’ cross, Jesus’ blood, Jesus’ descent (into death and hell), and, finally, Jesus’ ascent (into resurrection and glory)?\n\nI want to avoid using dense and polysyllabic theological terms to dissect and then stitch together a “Frankenstein monster” explanation of the atonement, an explanation which is often more frightful than insightful, more awkward than awesome, and more barbaric than heroic.\n\nInstead I want to present two simple metaphors on which we can hang a coherent understanding of Jesus’ atonement— Christ as our BLOOD DONOR and Christ as our HEALING POULTICE.\n\nSo first, let’s consider the atonement as a symbol of Jesus’ blood donor transfusion of His curative life energies into all our souls and bodies.\n\n“Blood is the gift of life!”\n\nSo the Red Cross rightfully tells us. Blood transfusions save countless millions of lives every month. Yet, this concept of transfusion was unknown in the ancient world. Nonetheless, the New Testament emphasizes again and again the life infusing energies and curative benefits of Jesus’ blood as the paschal lamb of God.\n\nBut consider this— the world changing science of the bountiful benefits of blood transfusion wasn’t EVEN discovered until the 17th century. And yet, in the first century, Jesus was priming it as a dynamic spiritual symbol to richly bless us two thousand years later. What an incredible testimony and apologetic proof of the advanced revelation surrounding Jesus!\n\nHere is the bombastic bottom line. The blood of Jesus isn’t about transgression, but transfusion. Jesus is a blood-donor, not a blood-shedder.\n\n“The life is in the blood,” as the Scripture says. And Jesus’ life pulsates in His blood. Jesus doesn’t want us laboring listlessly with our anemic iron-poor life energy. Rather, Jesus wants us to allow His iron-rich life force to course through our spiritual veins.\n\nJesus’ blood is not about paying for our past transgressions but rather providing for our future transfusion.\n\nJesus wants to transfuse us with His transcendence, His very divine nature, His very goodness, His very own love-rich emotional and mental states.\n\nJesus doesn’t take life, He gives it. Better yet. He gives us HIS life. Let’s start looking at His cross, and ours as well, as donor tables laid next to each other so that His curative energies can fully flow into our beings.\n\nAgain, the blood of Jesus is not about “transgression,” but about “transfusion.”\n\nThe nails in his body were the symbolic needles of transfusion where He gave us His faith, His virtues, His wisdom, His energy, His standing with the Father, His own Spirit– His very life force. “By His stripes we were healed.” 1 Peter 2:24.\n\nIt is as if we were all laid on our own crosses, on the table of blood donor-ship right next to Him in His cross, to receive a full transfusion of His divine nature into our spiritual veins. This transfusion is wonderfully described in the following passage. “I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me.” Galatians 2:20.\n\nSo, the cross and atonement necessary for us to be forgiven for our sins?\n\nWell, that’s a tricky question.\n\nCertainly, Jesus didn’t need to die in order for God to change His heart’s love and goodwill “for” and “toward” us– i.e. His willingness to lavish us with His love. The Father’s heart has no “unforgiveness” toward us IF we define that word as it’s commonly used in English: “having or making no allowance for error or weakness.” The problem arises because in the original Greek, the original language in which the New Testament was written, the word translated as “forgiveness” does not match the English definition at all.\n\nThe New Testament doesn’t so much teach “forgiveness OF sin” as it does “freedom FROM sin.”\n\nThe term “forgiveness” is not the most accurate translation of the Greek word “aphesis” which is used in verses like Luke 24:45-47; Acts 2:38-40; 5:29-31; 13:35-39; 26:15-18; Ephesians 1:7; Colossians 1:12-14. In all these passages just cited, the King James translation uses either the words “REMISSION of sins” or “FORGIVENESS of sins” to translate the Greek word “aphesis,” which in truth simply means “freedom.” Aphesis is also translated in the New Testament as “DELIVERANCE” or “LIBERTY.” Its primary definition is “to release from bondage or imprisonment” (Thayer and Smith).\n\nAphesis derives from the Greek word “apheimi” which means “to send away,” as in “a husband divorcing his wife.” Factoring all this together then, the better translation of this Greek term used in the above referenced verses is not “FORGIVENESS OF SIN,” but rather “FREEDOM FROM SIN” or “DELIVERANCE FROM SIN.” This phrase literally speaks of our rescue and release FROM our bondage to sin. As G.K. Chesterton said, “We are all seasick and we are all in the same boat.” Our corporate and individual sickness of soul has left us all spiritually anemic and in desperate need of a transfusion of the curative energies of God. Jesus, then, IS the living personification of God’s curative energies.\n\nCertainly, God has no unforgiveness toward us, and we need to know that, lest our hearts condemn us from boldly coming to the throne of grace in time of need. But, the blood of Jesus wasn’t shed so that God would no longer be disgusted, hateful, or mad at us. Rather, Jesus allowed His blood to be shed so that we ALL could and would have complete full and final DELIVERANCE from every evil thought, temptation, emotion, circumstance, or action.\n\nSo here is my point. If we substitute “FREEDOM FROM SIN” or “DELIVERANCE FROM SIN” for “FORGIVENESS OF SIN” in the New Testament passages cited above, then the Cross becomes clearer in scope and purpose.\n\nJesus came to earth to restore mankind to full fellowship with God by delivering ALL men from ALL sin for ALL time. THE WORK OF THE CROSS WASN’T JUST TO ASSURE US WE ARE “FORGIVEN FOR” OUR SINS, BUT RATHER TO SHOW US WE ARE “DELIVERED FROM” OUR SINS. I can know I am forgiven of a sin, and that is great, but I can still be in utter bondage to the sin itself and go on repeating it till the cows come home.\n\nConsider addicts, alcoholics and wife beaters, who though are repeatedly forgiven by those they harm, continue to engage in the destructive conduct. Jesus came, died and rose again SO THAT we would be COMPLETELY rescued from any and all sin-bondages. Again, knowing we are “forgiven” is wonderful, but knowing we are “delivered” from the POWER of sin, death and hell is even better.\n\nJesus’ shed blood is not about punishment FOR sin. It’s about deliverance FROM sin. I noticed a very interesting fact some time ago about the blood of Jesus. What the New Testament says about Jesus’ BLOOD, it also says about God’s SPIRIT. The literal blood of Jesus externally symbolizes the internal realities of the Spirit of Christ.\n\nThe blood justifies (Romans 5:9), the Spirit justifies (1 Corinthians ‪6:11‬). The blood sanctifies (Hebrews ‪13:12‬), the Spirit sanctifies (1Corinthians ‪6:11‬). The blood cleanses (1 John 1:7), the Spirit cleanses (1 Corinthians ‪6:11‬). We drink the blood (1 Corinthians 11:24-25; John 6:55-56), we drink the Spirit (1 Corinthians ‪12:13‬). The life is in the blood (Leviticus ‪17:11‬), while the Spirit gives life (2 Corinthians 3:6). We are to have “faith in His blood” (Romans 3:24-25) and are to have “the Spirit of faith.” I think that on some level, the blood of Jesus and the Spirit of Christ are synonymous in some mystical way.\n\nSimply put, the blood of Jesus symbolizes the “delivery system” of God’s salvation. Any manifestation of power must have a delivery system. In the physical, blood literally serves as a system for the human body to DELIVER oxygen and nutrients to the various tissues throughout the body.\n\nSpiritually speaking, the blood of Jesus delivers the fullness of divine life through the oxygenation of the Spirit into every corner of our being. The definition of the word “Spirit,” interestingly enough, means breath, which of course is how we physically intake oxygen into our blood stream.\n\nWhat the blood delivers, the Spirit manifests. What the blood transports, the Spirit provides. What the blood accesses, the Spirit strengthens. Jesus sweated blood resisting sin. He sacrificed His blood to give US access to His Spirit, the EXACT SAME access He had as the Son of Man. I see this whole issue is about effectively receiving the permanent indwelling of the Spirit of Christ.\n\nThe BLOOD OF JESUS symbolizes God’s “delivery system” of salvation to all of us. It delivers us FROM sin and death TO holiness and love. The MAJOR part of this deliverance was Jesus REPLACING the “seasick” double-minded core within the human soul WITH Jesus’ healthy single-minded core within His divine soul. He first absorbed all of our toxic soul-cores on the Cross. THEN, when He symbolically poured out His own blood on the Heavenly mercy seat, the pouring continued at Pentecost as Jesus’ poured out His Spirit as described in Acts 2. At Pentecost, Jesus poured out His Spirit onto and into the hearts of men.\n\nAt the Cross, Jesus shed His pristine blood FOR us. But at Pentecost, Jesus’ blood transmuted to become His Spirit living WITHIN us. Jesus, through this sacrifice, took away our sin-natures and replaced them with HIS pristine faith, HIS pristine mind, and HIS pristine nature.\n\nWe were enabled by Jesus to become “partakers of the divine nature” 2 Peter 1:4. “I am crucified with Christ: nevertheless I live; yet not I, but Christ lives in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me.” Galatians ‪2:20‬.\n\nThe blood of Jesus, then, is not about human transgression, but rather about divine transfusion. So, Jesus’ death on the cross wasn’t needed to change GOD’S heart-state toward us FROM “unforgiveness” TO “goodwill.” But, the cross WAS needed to change OUR heart-state FROM “captivity” TO “freedom.” Jesus’ death on the cross was necessary as the vehicle for God’s rescue and liberation. It was His Christus Victor raid, invasion, and spoliation of death, Hell, and our captivity to the fallen powers.\n\nSO, now let’s move on from the imagery of Christ as a TRANSFUSIVE BLOOD DONOR to Christ as a HEALING POULTICE.\n\nPOULTICE is a wonderful word. It vibrantly captures Jesus’ healing work at the Cross in a new and fresh way. A POULTICE is a soft, ABSORBENT and moist mass, which is often often heated and medicated. It is carefully spread over a wound, painful part or infected area of the body. The POULTICE then “draws out” the poison from the wound or body. The end result is that the body is cleansed of harmful toxins. POULTICE is also a term used for commercial products which can remove stains from porous stones such as marble or granite. So, POULTICE carries with it the related concepts of “poison and stain removal.”\n\nSnake and spider bites have been treated with poultices for thousands of years. Poison oak, poison ivy and even boils have also long been treated by poultices. POULTICES are called “poison pullers” because they pull poison away from infected areas by ABSORBING THE POISON INTO THEMSELVES. Epsom salt is a poultice, which combined with a bath and an exfoliating loofah sponge, draws out toxins through the pores of the skin. Other poultices include chewing tobacco, tea tree oil, castor oil, aspirin pastes, baking soda pastes, garlic coves, raw cabbage, echinacea, ashes, mashed pumpkins, bran, cereals and mustard plants.\n\nMost interesting though, is the fact that bread is one of the more common poultices. This is because of its absorbent quality. Bread is packed into the wound, and then covered with a piece of sacking before being bandaged onto the site. Isn’t it amazing that both “salt” and “bread” are common poultices, because Jesus uses these exact two items to describe Himself and us. Jesus refers to Himself as “the bread of life,” while He calls us “the salt of the earth.”\n\nOne application of these terms speaks to the anointing that both Jesus and the Church have to heal the world. It is easy to see Jesus as the ultimate POULTICE FOR ALL OUR SINS AND SICKNESSES. Consider the following prophetic passage where Isaiah describes Jesus’ absorption of all our sins. “Surely He has borne our griefs (lit. sicknesses), and carried our sorrows (lit. pains)…. But He was wounded for our transgressions, He was bruised for our iniquities: the chastisement of our peace was upon Him; and with His stripes we are healed…. because He has poured out His soul unto death: and He was numbered with the transgressors; and He bore the sin of many, and made intercession for the transgressors.” Isaiah 53:4-5,12. What a perfect passage to describe Jesus as our POULTICE!\n\nJesus, as the bread of life, became the POULTICE which was laid over all our sins and sicknesses at the Cross. Jesus then ABSORBED our each and every sin-toxin into Himself. He absorbed every affliction of our spirits, souls and bodies. He “pulled out” every poisonous thought, impulse or wicked desire from our minds and hearts. He “pulled out” every sickness which has ever affixed itself to the human body. He “pulled out” every Satanic thorn imbedded in our flesh because of the access our sin gave the devil. He absorbed ALL our sins and sicknesses onto and into Himself.\n\nAs the Apostle Peter said in referring to Jesus, “Who His own self bore our sins in His own body on the tree, that we, being dead to sin, should live unto righteousness: by whose stripes you were healed.” 1 Peter 2:24. So we, as the salt of the world, should quickly and fervently apply by the laying on of believing hands the POULTICE of the Gospel onto every sin, sickness or demonic obstruction we encounter. Jesus at the Cross absorbed all evil onto Himself, both its causes and effects. All we have to do to receive this great healing truth is to BELIEVE this great healing truth.\n\nAs Spiritual medics, we all carry the great panacea for all situations in the pouch of our hearts. Toward all we encounter, we possess the Gospel POULTICE of Jesus to tenderly apply to every human wound and firmly apply to every evil circumstance. In fact, the POULTICE was already applied 2,000 years ago to ALL our wounds. All that remains is our faith’s recognition of it.\n\nOnce we believe it, the full MANIFESTATION of our healing WILL occur, and that right speedily. We will proclaim, along with King David, “Bless the Lord, O my soul: and all that is within me, bless His holy name. Bless the Lord, O my soul, and forget not all His benefits: Who forgives all your inequities; Who heals all your diseases; Who redeems your life from destruction; Who crowns you with lovingkindness and tender mercies; Who satisfies your mouth with good things so that your youth is renewed as the eagle’s.” Psalm 103:1-5. And remember, POULTICES not only absorb the presence of poison, but they also remove the stains left behind. All the stains of our shame, guilt and condemnation are no more. Jesus heroically absorbed away all OUR pain and poison onto Himself. Our Hero from Heaven!\n\nIn conclusion, I hope the suggested metaphors of Christ as both TRANSFUSIVE BLOOD DONOR and HEALING POULTICE will help us to personally appreciate, relish, and celebrate the Christus Victor Atonement in new, vibrant, and visceral ways."}, {"url": "https://www.biblestudytools.com/topical-verses/blood-of-jesus-bible-verses/", "page_content": "What does the Bible say about the Blood of Jesus? Why is this part of Communion?\n\nLearn about the importance and meaning of the blood of Jesus from this collection of scripture quotes. Just as sacrifices were made in the Old Testament, Jesus gave His life and shed His blood to reconcile us from sin if we believe in Him. \"But if we walk in the light, as he is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin.\" 1 John 1:7\n\nJesus demonstrated the significance of His blood as part of the Last Supper with His disciples. As the disciples sat together, Jesus said, \" ‘Take it and eat it, for this is my body' \" (Matthew 26:26). He then gave thanks and offered them the cup and said, \" ‘Each of you drink from it, for this is my blood, which seals the covenant between God and his people. It is poured out to forgive the sins of many \" (Matthew 26:27-28).\n\nFrom Christ's crucifixion to the communion sacrament, the blood of Jesus has symbolized the cleansing of our sins. Learn more about the significance and meaning of the Blood of Jesus from the collection of Bible verses below. You can also download a beautiful copy of these Scriptures HERE. Print them and use them as you study the importance of the blood of our Savior.\n\nPhoto credit: ©GettyImages/g215"}, {"url": "https://www.projectprobe.org/blog/pleading-the-blood-of-jesus-what-does-the-bible-say/", "page_content": "By Roger Marshall*\n\nOne may wonder why I should question the practice of “pleading the blood of Jesus” which has been so entrenched in several Evangelical and Charismatic churches for many years. I question the practice for two basic reasons. First as a seeker after truth, the Bible commands us to prove or test all things and hold fast to that which is good (1 Thess. 5:21). The only way we can prove or test our beliefs and experiences is by scrutinizing them in light of the God’s word the Bible. Isaiah 8:20 says: “To the law and to the testimony: if they speak not according to this word, it is because there is no light in them.”\n\nThis brings me to the second reason why I question this practice. I question it because nowhere in the gospels did Jesus ever teach his disciples to carry out such a ritual. Nowhere in the Acts of the Apostles do we find the apostles or members of the early church carrying out such a practice. Nowhere in the Epistles do we find the apostles and their associates teaching such a doctrine. As far as I know there is no record that the practice was carried out by the early church fathers or the protestant reformers. So why should we today think or be lead to think that we must carry out the ritual of “pleading the blood of Jesus” in order to gain divine protection?\n\nNevertheless, I want to make it abundantly clear that whether a person believes that he or she must actually say the words “I plead the blood of Jesus” for divine protection or simply pray to God and ask Him for His protection, it is ultimately not an issue that is essential for salvation. Christians are free to disagree on secondary issues in good conscience all the while searching the scriptures for a better understanding. As one of the reputed church fathers Augustine once said: “In essentials unity, in nonessentials liberty, in all things charity.”\n\nHowever, when one’s perspective on any controversial issue leads one to embrace and espouse to others such a perspective as absolutely necessary for the enablements of divine grace, I believe it is at that point we must most certainly take a closer look at our perspective in clear light of scripture. If our perspective does not line up to the teaching of scripture, then we should be willing to cast aside our view-point in favour of God’s word which is forever settled in heaven (Psalm 119:89).\n\nDefinition of Terms\n\nBefore we go any further in our investigation it is important that we define our terms.\n\nQ. What do many Christians today seem to mean when they say the words “I plead the blood of Jesus”?\n\nA. They seem to mean that they are applying the red fluid that flowed from Jesus’ veins to problems, objects and situations as a means of protection.\n\nThus they plead or apply it to their cars, houses, church buildings, windows, doors, floors, pews, musical instruments, pets, drinking water, neighbourhoods, unsaved relatives, sick bodies etc. They even draw bloodlines around these said objects for protections from evil forces, just like some occultists speak of drawing a magic circle around people and objects for the same protection purposes.\n\nIs this practice biblical?\n\nThe Bible and The Blood\n\nThroughout the New Testament scriptures the term “the blood of Jesus” refers to the substitutionary death of Christ for our sins and not the red fluid in and of itself (Heb 9: 11-29; Cf Matt 26: 28; Mark 10:45; Rom. 3:24-25; 5: 9-11; Eph. 1:7; 2:13; Col. 1:14).\n\nSpecial attention needs to be given to the Hebrews 9 passage. A proper understanding of this text of scripture is key to understanding why there was a practice of besmearing the tabernacle and its instruments with blood (a practice which seems to have given the rationale for the modern practice of pleading the blood of Jesus) and why the practice is no longer necessary. The reason for its cessation was because of Jesus’ perfect and supreme ONCE FOR ALL sacrifice for sins. It also shows that the Old Testament practice was carried out for an entirely different purpose than what practitioners of the modern version are doing today.\n\nThe literal sprinkling and applying of the sacrificial blood of goats and bulls in Old Testament times on the tabernacle and it various instruments or vessels, was to make atonement for those said things because of the uncleanness of the children of Israel. In other words because the Israelites were sinful they polluted the whole tabernacle whenever they went up to it. The blood of the animal, which indicated or symbolized the death of the sacrifice, was to atone for their sinfulness which affected every thing they touched. It was a temporary means of appeasing the wrath of God against them (Lev. 16:3, 6-19, 32-34; cf. Ex 12:1-13, 21-27). This ordinance had to be carried out once every year because the way to the true mercy seat of God was not yet made manifest (Heb. 9:6-10, 16-22).\n\nThe tabernacle and its various instruments or vessels were symbolic of and prefigured the true tabernacle in heaven (i.e. God’s immediate eternal abode; Heb. 8:1-5). These earthly copies of heavenly realities had to be yearly purified which was to impress upon the minds of the children of Israel that there was no way for a sinful, filthy and polluted people to even enter into the prefigured presence of God, much less His real presence, without blood atonement, (i.e. the sacrificial death of a substitute). Yet, for all they were worth, these sacrifices were never able to take away their sins (i.e. they were never able to perfectly appease the wrath of God because Jesus the perfect sacrifice had not yet died), hence the perpetual yearly practice of applying the blood of the sacrifices to the tabernacle (Heb. 10: 1-4).\n\nBut now in the end of the world the good news or the gospel is that Christ has offered Himself once for all time as the perfect sacrifice for sins. This act has satisfied the demands of divine judgement and thus has completely appeased the wrath of God from heaven (i.e the true tabernacle not made with hands; Heb 9:11). Therefore there is no need for any kind of perpetual applying of Jesus’ blood, symbolic of His death, to earthly tabernacles and vessels because His blood or sacrificial death, was NOT intended for the earthly tabernacle, but rather it was for ministry in the heavenly tabernacle, which opened up the way for us to boldly come to the throne of grace or the heavenly mercy seat (Heb. 9:23-28; 10:11-22). Jesus’ blood or death permanently appeased the wrath of God against our sins (Heb 8:7-12). It was a one-time act, never to be repeated. When a sinner puts his faith in that once for all act in the past time, he or she is perpetually justified (Rom. 5:1). As far as God is concerned he or she bears no more condemnation before Him. (Rom. 8:1-4).\n\nTo make a long story short, Jesus died or shed His blood for our SINS not for our THINGS such as cars, houses, lands, church buildings, windows, doors etc. Furthermore because Jesus’ sacrifice was perfect, we can no longer be guilty of polluting everything we touch in the service of God, in the Old Testament sense. Further still, nothing in our church buildings etc. prefigures the heavenly sanctuary anyway, which would merit them being atoned for in the Old Testament sense. Even if they did, any constant applying or pleading the blood of Jesus on these objects would indicate that His sacrifice was not a perfect atoning sacrifice. But thank God His sacrifice was perfect. Hence, there is no need to be constantly saying “I plead or apply the blood of Jesus” to this or that in the Old Testament atoning sense, much less in an unbiblical sense like many Christians do today, to secure protection form evil forces (see Rom 5:10-11).\n\nSound Scholarship and the Blood\n\nThis understanding of how the term “blood of Jesus” is used in scripture is unanimously attested to by several sources of sound Biblical scholarship.\n\nMillard Erickson in the book Introducing Christian Doctrine says: “references to Christ’s blood are not to His actual physical blood per se but to His death as a sacrificial provision for our sins” (p. 250).\n\nThe World’s Bible Dictionary says: “In the New Testament the expressions ‘blood of the cross’, ‘blood of Christ’ and ‘death of Christ’ are often used interchangeably. To have life through Christ’s blood means to have life through His death … those who share in Christ’s blood share in the benefits of His death.” (p. 53).\n\nIn Thayer’s Greek English Lexicon Of The New Testament p. 15, we find the following definitions of the word blood as used in scripture: “blood simply and generally” or it can denote “generation and origin”. It also can mean “blood shed”, “bloody death” and the “pledge of redemption”.\n\nR.K Harrison writing in the Zondervan Pictoral Bible Encyclopaedia, Vol 1, says: “Because of the fundamental importance for individual existence, blood was frequently used for life itself…The Old Testament indicates that the atonement for human sin was obtained by the death of an acceptable substitute, rather than by its life, and this emphasis, which is basic to the Old Covenant, is carried over into the New Testament with specific reference to the work of Jesus Christ in the New Covenant … The sacrificial blood is associated with the death of the Saviour (Heb. 9:14), and the author of Hebrews makes it plain that the blood is associated with death rather than life. (Heb.12: 24). It seems evident, therefore, that sacrifices were efficacious through the death of the victim and the blood indicates life given up in death”.\n\nJ.C Macaulay writing in the book Expository Commentary on Hebrews, p. 129 say: “This has been a great offence to many, aggravated no doubt by the materialistic emphasis of some earnest but mistaken Christians … Is there any claim or virtue in that red fluid, which we call blood, that it can put away sin? No, the material substance itself is nothing, it is what the blood represents and symbolizes, death and life … Blood shed means life poured out. Sacrificial blood is life poured out, yielded up, for redemptive purposes” (Emphasis added).\n\nLeon Morris in Baker’s Dictionary of Theology, p. 100 says: “Blood points not to life set free, but to life given up in death.”\n\nJames Atkinson affirms the same truth. Writing in the Westminister Dictionary of Christians Theology, p. 76, says: “The word blood in the Old Testament apart from the every day physiological meaning, is generally associated with the idea of death, violent death in particular … the phrase ‘the blood of Christ’, like the words ‘the cross’, is nothing but a pregnant phrase for the death of Christ in its salvation meaning.” (Emphasis added).\n\nThe New Bible Dictionary says: “The sacrifices are still understood to be efficacious by virtue of the death of the victim. The blood of Christ accordingly is to be understood as the Atoning death of the Saviour.” (p. 145).\n\nThe Holman Bible Dictionary agrees: “The term the blood of Christ designates in the New Testament, the Atoning death of Christ.” (p. 201)\n\nBible expositor, John MacArthur, in commenting on Romans 5:9 says that the verse refers to Jesus’ “violent, substitutionary death.” He goes on to say: “References to the blood of the Saviour include the reality that He bled in His death (a necessity to fulfil the OT imagery of sacrifice), but are not limited to the fluid itself. NT writers use the term “blood” as a graphic way to describe violent death (see Matt. 23: 30, 35,; 27:4-8, 24, 25; John 6: 53-56; Acts 5:28; 20:26). References to the Saviour’s blood are not simply pointing to the fluid, but at His death and entire atoning work (cf. Rom. 3:25; Eph. 1:7; 2:13; Col 1: 14,20; Heb. 9:12; 10:19; 13:12; 1 Peter 1:2,19; 1 John 1:7; Rev. 1:5).” (See The MacArthur Study Bible).\n\nIn commenting on Col. 1: 14 MacArthur points out that reference to the blood of Christ in this verse is “not limited to the fluid as if the blood had saving properties in its chemistry, but an expression pointing to the totality of Christ’s atoning work as a sacrifice for sin. This is a frequently used metonym [“a figure of speech consisting of the use of the name of one thing for that of another of which it is an attributer or with which it is associated” – Merriam Webster’s Collegiate Dictionary] in the NT (see Eph. 1:7; 2:13; Heb.9: 14; 1Pet. 1:19). The word ‘cross’ (as in vs 20) is used similarly to refer to the whole atoning work (see 1Cor. 1: 18; Gal. 6: 12, 14; Eph. 2: 16).”\n\nThe editors of The NIV Study Bible, © 1995 by The Zondervan Corporation, make the following comments on the passages of Scripture cited dealing with Jesus’ blood.\n\nRom. 3: 25 – the phrase “faith in His blood” means faith “in His sacrificial death for us.”\n\nRom. 5: 9 – the phrase “justified by His blood” refers to Jesus “… laying down His life as a sacrifice – a reference to Christ’s death for our sins.”\n\nEph. 1:7 – the statement: “In Him we have redemption through His blood, the forgiveness of sins, in accordance with the riches of God’s grace” speaks of “… the ransom necessary to free sinners from bondage of sin and the resulting curse imposed by the law (see Gal. 3:13), was the death of Christ (called here ‘His blood’).”\n\nEph 2:13 – the phrase “ ‘blood of Christ’ expresses the violent death of Christ as He poured out His lifeblood as a sacrifice for us (ct Eph 1:7)”.\n\nHeb. 9: 18 – the phrase “not put into effect without blood” means that the covenant was not put into effect without death.\n\nOn a point of interest, if it was the red fluid in and of itself that actually atones for or “washes away” our sins, then the atonement could have been accomplished in the garden of Gethsemane where Jesus literally sweated blood. It could have been accomplished when He was brutally flogged and His blood gushed out. However, the atonement was only accomplished when Jesus died (John 19:30; Hub. 9: 15-17).\n\nThings To Ponder\n\nSince the phrase “blood of Jesus” really refers to the sacrificial death of Jesus would it be equally all right to say I plead the death of Jesus on my car, house, children, church pews etc?\n\nI’m sure we can see that such an invocation would make no sense. This goes to show that those who plead the blood are really referring to the red fluid in and of itself which is an unscriptural emphasis. This practice really has more I common with fetishism. The Meriam Webster’s Collegiate Dictionary defines a fetish as “A: an object believed to have magical power to protect or aid its owner; broadly: a material object regarded with superstitions or extravagant trust or reverence. B an object of irrational reverence or obsessive devotion.”\n\nPleading the blood of Jesus (i.e. the red fluid which flowed from His veins) as a means of protection from evil is very much akin to the fetishist practice of using crosses as a means of protection. Those who do so may want to claim that Paul said in Gal. 6:14 that he would glory in the cross of the Lord Jesus Christ. But the phrase “Cross of Jesus”, used in this verse, just as in many other verses, refers to the sacrificial, substitutional, atoning death of Christ and not to the physical cross in and of itself. In similar fashion the phrase “blood of Jesus” as used in scripture refers to the sacrificial, substitutional, atoning death of Christ and not the red fluid in and of itself as many have been taught.\n\nOn another point of interest: if to cover one’s self or one’s family members (e.g. children) with the blood of Jesus is a means of divine protection, does this mean that the Jews were invoking God’s protection in Matt. 27:25 when they said “His blood be on us and our children”? Of course not. In that statement they were just taking the responsibility for His death upon themselves (cf. Acts 5:28).\n\nThe point is we must not view the term “blood of Jesus” as a reference to the red fluid in and of itself which flowed from His veins but we must understand it as referring to the sacrificial death of Christ on the cross for the atonement of our sins and not for the atonement of our things (i.e. our personal possessions). The apostle Paul puts it very aptly in Rom. 5: 9-11, when he wrote: “Much more then, being now justified by His BLOOD, we shall be saved from wrath through Him. For if, when we were enemies, we were reconciled to God by the DEATH of His Son; much more, being reconciled we shall be saved by His life. And not only so, but we also joy in God through our Lord Jesus Christ, by whom we have now received the ATONEMENT.” (Emphasis added; see Lev. 17:11, 14 which speaks of the fact that life given up in death atones for sin).\n\nObjections\n\nSome may say that they do not use any kind of tangible or physical blood when they plead the blood of Jesus therefore it can’t be a fetish like using a cross. However, such an admission would only raise more problems. When Jesus was crucified the blood that flowed from His veins was tangible blood that existed in real space and time. Even the OT practice of besmearing the various objects in the tabernacle (from which the ritual of pleading the blood of Jesus gets its impetus) involved tangible blood. Yet when Christians plead the blood on objects in and outside of churches no tangible or physical blood is employed. Any appeal to it being a spiritual act wouldn’t help either simply because there is no such thing as spiritual or immaterial blood! However, on the other hand a fetish does not have to be a physical object but it can also be an object of fantasized presence (i.e. existing only in the mind but not in real space and time).\n\nBut It Works\n\nSomeone may say; “well I’ve been pleading the blood of Jesus for some time now and it works for me.”\n\nWhile this may apparently be true we must be cognizant of the fact that appealing to experience is not a valid test of Biblical truth. Many people can also testify that they have used crosses/crucifixes for protection and it worked for them too but that does not mean it is scriptural.\n\nThe Bible says that although a sign or wonder may work if it is leading people to embrace false teaching it is to be rejected (Deut. 13: 1 – 5).\n\nWhile they are those who say that a man with an experience is not at the mercy of a man with an argument, the Bible say that experience is not the test of truth rather it’s God’s word which is the test of truth (Isa. 8: 20). This is so because the capacity of the human heart for self-deception knows no bounds. As the prophet Jeremiah, writing under divine inspiration, said: “The heart is deceitful above all things, and desperately wicked: who can know it” (Jer. 17: 9).\n\nThankfully God knows our hearts with its thoughts and intentions (Jer. 17: 10) and I believe sometimes He graciously grants us our hearts’ requests in prayer not because of the words a believer may use such as “I plead the blood of Jesus” on this, or that situation but rather in spite of those words simply because He knows what we really mean to ask even though we get the words wrong. As the apostle said: “In the same way, the Spirit helps us in our weakness. We do not know what we ought to pray for, but the Spirit himself intercedes for us with groans that words cannot express” (Rom. 8: 26, NIV).\n\nHowever, I believe that just as God wanted Apollos to know the way of God more perfectly (see Acts 18; 24 – 26), so I believe He wants all those who practice pleading the blood of Jesus to know the way of God more perfectly as it relates to what the Bible really teaches about the blood of Jesus.\n\nPleading the Blood of Jesus Legitimately\n\nThere is only one way in which Christians should understand “pleading the blood of Jesus” and that is in the judicial sense. The word “plea” from which we get the word “plead” means: “An accused person’s answer to a charge or indictment in criminal practice…an earnest entreaty or appeal.” Similarly, the word “plead” means “to make a plea of a specified nature (eg. to plead not guilty).” (Merriam Webster’s Collegiate Dictionary)\n\nRev. 12:10 paints a picture of a complainant (the devil) who is constantly brining charges to God against the saints. It says: “And I heard a loud voice saying in heaven, now is come salvation, and strength, and the kingdom of our God, and the power of His Christ, for the ACCUSER of our brethren is cast down, which ACCUSED them before our God day and night.”\n\nThe very next verse (Rev. 12: 11) gives the saints defence against the devil’s accusations. It says: “And they overcome him by the blood of the Lamb, and by the word of their testimony, and they loved not their lives unto the death.” The blood/death of the Lamb (Jesus) was the only recourse the saints had against the devil’s accusations. In actuality they pleaded not guilty in light of the fact that Jesus died for their sins/crimes against God.\n\nThis is exactly how the hymn writers of two great hymns of the Church understood the blood of Jesus as a plea. The hymn Nothing But The Blood says:\n\n“What can was away my sin?\n\nNothing but the blood of Jesus\n\nWhat can make me whole again?\n\nNothing but the blood of Jesus\n\nFor my pardon this I see\n\nNothing but the blood of Jesus\n\nFor my cleansing this my PLEA\n\nNothing but the blood of Jesus\n\nNothing can for sin atone\n\nNothing but the blood of Jesus\n\nNow by this I’ll OVERCOME\n\nNothing but the blood of Jesus”\n\n(Nothing But The Blood verses 1,2,5, Emphasis added).\n\nIn the hymn Arise, My Soul, Arise the author Charles Wesley says:\n\n“Arise my soul, arise; Shake off they guilty fears\n\nThe bleeding sacrifice in my behalf appears\n\nBefore the throne my surety stands\n\nBefore the throne my surety stands\n\nMy name is written on His hands.\n\nHe ever lives above, for me to intercede\n\nHis all redeeming love, His precious blood to PLEAD\n\nHis blood ATONED for all our race\n\nHis blood ATONED for all our race\n\nAnd sprinkles now the throne of grace.\n\nFive bleeding wounds He bears, Received on Calvary\n\nThey pour effectual prayers, They strongly speak for me\n\n‘Forgive Him, O forgive’ they cry\n\n‘Forgive Him, O forgive’ they cry\n\n‘Nor let that ransomed sinner die!’”\n\n(Arise, My Soul, Arise verses 1,2,3).\n\nThank God that Jesus died for our sins and not for our personal possessions. Because He did, our sins are forgiven and we thereby overcome the accuser of our souls.\n\nThere is a saying: “Bad theology leads to bad practice.” The modern bad theology of what is called “pleading the blood of Jesus” has surely led to bad and bizarre practices among Christian believers. To avoid such, let us always endeavour to promote good or accurate theology that is squarely based on God’s word of truth: the Bible.\n\n*Roger Marshall is founder and executive director of Project PROBE Ministries, a Barbadian Christian apologetics organisation.\n\n© 2001"}]}