{"Zhuang of Chu was the last ruler of Chu.": [{"url": "http://chinaknowledge.de/History/Zhou/personschuzhuangwang.html", "page_content": "Dec 2, 2010 © Ulrich Theobald\n\nChu Zhuangwang 楚莊王 (r. 613-591) was a ruler of the state of Chu 楚 during the Spring and Autumn period 春秋 (770-5th cent. BCE) and was one of the so-called five hegemons (wuba 五霸). His personal name was Mi Xionglü 芈熊侶 (also written 熊呂 or 熊旅). The state of Chu is sometimes called Jing 荊, and Xionglü's posthumous title is also King Yan 嚴王.\n\nHe succeeded to the throne as son of King Mu 楚穆王 (r. 625-614). King Zhuang started his reign in a style of laissez-faire politics without much caring for the government. His advisors Wu Ju 伍舉 and Su Cong 蘇從 opened him his eyes, so that he started restructuring the administration and strengthening the royal power with the support of Sunshu Ao 孫叔敖. The state took over the care for hydraulic works, dykes and dams, he built up a strong army and quelled the internal rebellion of a certain Ruo Ao 若敖 (not King Ruo Ao, r. 791-764). His armies marched to the north, defeated the state of Song 宋 and the Rong 戎 barbarians of Luhun 陸渾, and lined up before the domain of the king of Zhou 周.\n\nWith the awareness of his power King Zhuang of Chu menaced the King of Zhou and threatened him that Chu would be able to replace the house of Zhou. The armies of Chu then conquered a handfull of smaller states like Yong 庸, Shu 舒 and Chen 陳, and in 602, King Zhuang was able to destroy the army of Jin 晉 at Bi 邲 (modern Xingyang 滎陽, Henan). Chu thus came to replace Jin as the hegemonial power of the Central States.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1991). Shiji cidian 史記辭典 (Jinan: Shandong jiaoyu chubanshe), 590.\n\nChen Quali 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 20.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 469.\n\nLiu Mengxun 柳孟訓 (1997). \"Chu Huaiwang de baye 楚莊王的霸業\", in Men Kui 門巋, Zhang Yanjin 張燕瑾, ed. Zhonghua guocui da cidian 中華國粹大辭典 (Xianggang: Guoji wenhua chuban gongsi), 3.\n\nWang Songling 王松齡, ed. (1991). Shiyong Zhongguo lishi zhishi cidian 實用中國歷史知識辭典 (Changchun: Jilin wenshi chubanshe), 401.\n\nXiong Tieji 熊鐵基, Yang Youli 楊有禮, ed. (1994). Zhongguo diwang zaixiang cidian 中國帝王宰相辭典 (Wuhan: Hubei jiaoyu chubanshe), 77.\n\nYi Xingguo 衣興國, ed. (1988). Shiyong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 44.\n\nXue Hong 薛虹 et al., ed. (1988). Zhongguo huangshi gongting cidian 中國皇室宮廷辭典 (Changchun: Jilin wenshi chubanshe), 773."}, {"url": "https://www.britannica.com/place/Chu-ancient-state-China-770-223-BCE", "page_content": "Chu, Wade-Giles romanization Ch’u, one of the most important of the small states contending for power in China between 770 and 223 bce.\n\nOriginally one of the duke states under the Xi (Western) Zhou dynasty (1046–771 bce), Chu rose in the mid-8th century bce around the present province of Hubei, in the fertile valley of the Yangtze River (Chang Jiang) in South China. The Chu state has been characterized by some scholars as “barbarian” in origin, though some members of its ruling class possibly came from North China. Chu began to expand rapidly into north and east proper, conquering much of present-day Henan province. China itself was at the time divided into a series of small duke states, all of which theoretically owed allegiance to the Zhou dynasty, although the Zhou rulers had long since been unable to exercise control over more than their own fiefs. Chu was one of the first states to break with the established custom and give its rulers the title of wang, or “king,” thus removing any pretense of overall Zhou suzerainty.\n\nChu’s rapid expansion into North China was halted temporarily in the 7th century bce, when the small states of the region banded together to protect themselves from being absorbed. But Chu continued nevertheless to be a major contender for power in China for the next 400 years. In the 3rd century bce, Chu and six other major states finally absorbed all of the other little states and began a desperate struggle for supreme control of China. Chu itself was finally eliminated in 223, and the state of Qin united all of China two years later.\n\nWhen the Qin dynasty fell after ruling for less than 15 years, the rebels, led by a former aristocrat, Xiang Yu, installed a former member of the Chu ruling house as the new emperor of China. But this new Chu government survived only for a few months before Xiang Yu was defeated by one of his former generals, Liu Bang, who then established the Han dynasty (206 bce–220 ce)."}, {"url": "http://chinaknowledge.de/History/Zhou/rulers-chu.html", "page_content": "Nov 1, 2018 © Ulrich Theobald\n\nDon't confound his regional state of the Zhou period with the empire of Chu 楚 (926-951), one of the Ten Kingdoms 十國 (902-979) of the Five Dynasties period 五代 (907-960).\n\nThe state of Chu 楚 was a regional state of the Zhou period 周 (11th cent.-221 BCE). It belonged to the larger polities that were able to survive until the end of the Warring States period 戰國 (5th cent.-221 BCE). Chu is known for its culture that was significantly different from that of the states of the Central Plain. Chu was not among the states that were distributed as a regional states at the beginning of the Western Zhou period 西周 (11th cent.-770 BCE). Its ruling dynasty was of a different origin than most of the regional dynasties of the Zhou empire. Another name of Chu is Jing 荊. Chu was first located in the valley of the River Han 漢 and then moved southeast into the Yangtze Valley. During the Spring and Autumn period 春秋 (770 - 5th cent. BCE) it gradually expanded towards the north and east.\n\nMap 1. The regional state of Chu 楚 (11th cent. - 223 BCE) Map according to Tan Qixiang 谭其骧 (1987), Zhongguo lishi ditu ji 中国历史地图集. Chu was located in the middle course of the Yangtze River and gradually expanded to the east and northeast. It played the role of temporary ally for the states of Qi and Qin, before the latter dominated over all regional states and founded the empire of Qin. Click to enlarge.\n\nThe semi-barbarian state of Chu becomes part of the middle kingdom\n\nThe ruling house of Chu derived its descendancy from the mythical Emperor Zhuan Xu 顓頊, himself being a grandson of the Yellow Emperor 黃帝. Zhuan Xu's great-grandson Zhong Li 重黎 was the minister for fire (huo zheng 火正) of the mythical Emperor Di Ku 帝嚳. For his merits earned in office, Zhong Li was bestowed the name of Zhu Rong 祝融. He was sent out to punish the rebellious lord of the waters, Gong Gong 共工, but Zhu Rong/Zhong Li was unable to kill Gong Gong. Enraged about this failure, Emperor Di Ku executed Zhong Li and had his brother Wu Hui 吳回 take over the duties as minister of fire. Wu Hui had six grandsons that were called Kun Wu 昆吾, Shen Hu 參胡, Peng Zu 彭祖, Hui Ren 會人, Ji Lian 季連 and an unnamed son that was given the family name of Cao 曹. Five branches of the family fell into oblivion, except the descendants of Ji Lian who adopted the family name of Xiong 熊 or Mi 羋 (originally written 嬭).\n\nExcavated objects from the late Warring States period prove that the reigning dynasty of Chu also bore the family name Yan 酓. Mi Xiong allegedly took part in King Wu's 周武王 conquest of the Shang empire 商 (17th-11th cent. BCE).\n\nIn the early decades of the Zhou period, King Cheng of Zhou 周成王 (r. 1116-1079 BCE) made the family Mi regional rulers over the country of Chu in the middle Yangtze valley. From that time on they adopted the family name Mi, yet the rulers retained the surname Xiong. Xiong might also be a prefix of the personal name worn by all members of the family. In the late 11th century King Zhao of Zhou 周昭王 undertook several military campaigns against Chu during one of which he died, while his own army drowned in the River Han. The rulers of Chu called themselves \"king\" (wang 王) and therefore demonstrated that they were actually not part of the system of regional states of the Zhou empire.\n\nYu Xiong's great-grandson Xiong Yi 熊繹 settled near Mt. Jingshan 荊山 (modern Nanzhang 南漳, Hubei) and, after being appointed regional ruler (zhuhou 諸侯) by King Cheng of Zhou, moved to Danyang 丹陽 (modern Zigui 秭歸, Hubei).\n\nViscount (zi 子) Xiong Qu 熊渠 became aware that the house of Zhou was weakening and expanded his rule along the middle Yangtze valley up into the valley of River Han. He conquered the statelets of Yong 庸 and Yangyue 揚粵. He made his oldest song Wukang 毋康 king of Goutan 句亶, his second son Zhihong 摯紅 king of E 鄂, and his youngest son Zhici 執疵 king of Yuezhang 越章. Later on he feared that the king of Zhou would attack him because of the usurpation of the title of king and stripped his sons off their ranks as kings.\n\nAfter the death of Viscount Xiong Shuang 熊霜 his three sons indeed contended for the throne of Chu. The youngest son, Jixun 季徇 (Xiong Xun 熊徇), was finally able to occupy the throne. When Fen Mao 蚡冒 (r. 758-741), also called Xiong Xun 熊眴, died, his younger brother Xiong Tong 熊通 assassinated the heir apparent and usurped the throne. He is posthumously called King Wu of Chu 楚武王 (r. 741-690) because he carried out numerous military campaigns, like that against the statelet of Sui 隨, whose marquis, hoping to escape defeat, offered to Xiong Tong to travel to the court of the King of Zhou to reconfirm Xiong Tong in his royal position, but the King of Zhou declined. Enraged about the King of Zhou's refusal, Xiong Tong decided to adopt the title of king without the permission by the Son of Heaven, concluded an alliance with the marquis of Sui and occupied the territory of the hundred Pu tribes 百濮 south of the Yangtze River. Xiong Tong later suspected the marquis of Sui of treason and planned to occupy his territory, but he died en route to the battlefield.\n\nHis son Xiong Zi 熊貲 mounted the throne. Zi is posthumously known as King Wen 楚文王 (r. 690-677). He was the first ruler of Chu who took residence in Ying 郢 (near modern Shashi 沙市, Hubei) instead of Danyang. Xiong Zi conquered several small states, like Xi 息 (modern Xixian 息縣， Henan), Shen 申 (modern Nanyang 南陽, Henan) and Deng 鄧 (modern Xiangfan 襄樊, Hubei). His son Zhuang'ao 莊敖 (ao was a kind of temple name, like the Chinese zong 宗), known as Xiong Jian 熊囏 (also written 熊艱), planned to kill his brother Xiong Yun 熊惲 (also written 熊頵), but the latter escaped to Sui and gained sufficient support to usurp the throne of his brother. Xiong Yun is posthumously known as King Cheng 楚成王 (r. 672-626). Unlike his predecessors, King Cheng was a peaceful ruler who sent appropriate tributes to the court of the king of Zhou, so that he was ordered to appease the barbarian tribes of the south instead of harassing the states in the Yellow River plain.\n\nIn 656 the hegemonial lord (ba 霸) Duke Huan of Qi 齊桓公 (r. 685-643) attacked Chu, but King Cheng was able to urge his troops to stop and concluded a peace alliance (meng 盟) in the conference of Zhaoling 召陵 (modern Yancheng 郾城, Henan). In his later years King Cheng waged war against the statelets of Xu 許, Xian 弦 (near modern Xixian, Henan), Huang 黃 (modern Huanchuan 潢川, Henan) and Ying 英. Duke Xiang of Song 宋襄公 (r. 650-637), the new hegemonial lord, dispatched an envoy to Chu to offer a peaceful alliance, but the king refused and soon attacked Song 宋 and defeated the duke in the battle of Hong 泓 (modern Zhecheng 柘城, Henan) and also the state of Zheng 鄭. Duke Xiang died from a wound received during the battle.\n\nIn 634 Duke Xi of Lu 魯僖公 (r. 659-627) arrived at the court of Chu and requested an army to punish the Duke of Qi 齊. King Cheng sent out the Marquis of Shen 申 who conquered the territory of Gu 穀, where Duke Huan's son Yong 雍 was instated as the local governor. The other sons of the Duke of Qi fled to Chu and were all made nobles in Chu. The statelet of Kui 夔 was conquered, and then King Cheng attacked the state of Song. The Duke of Song requested support by the army of Jin 晉. King Cheng thereupon withdrew because Duke Wen of Jin 晉文公 (r. 636-628), had been his exiled guest for a long time, and sent only out Ziyu 子玉 with a small contingent that was defeated.\n\nAgainst the advice of Prime Minister (lingyin 令尹) Zishang 子上, King Chen nominated his beloved son Shangchen 商臣 heir apparent. Later on he deposed Shangchen in favour to Zhi 職. Shangchen thereupon arrested King Cheng and forced him to commit suicide. He mounted the throne, posthumously called King Mu 楚穆王 (r. 626-614). His chief counsellor was Pan Chong 潘崇. King Mu conquered the statelets of Jiang 江 (modern Xixian, Henan) and Lu 六 (a special reading, modern Lu'an 六安, Anhui) and attacked the state of Chen 陳.\n\nHe was succeeded by his son Lü 侶, who is posthumously known as King Zhuang 楚莊王 (r. 614-591). King Zhuang did not attend the court, indulged in pleasures and even ordered to execute those who dared remonstrating against him. Wu Ju 伍舉 thereupon used a riddle to admonish him, but without success. Only Su Cong 蘇從 was able to open the king's eyes so that he started caring for political matters again. During his campaign against the Rong barbarians 戎 of Luhun 陸渾, King Zhuang visited the capital of the kings of Zhou in Luoyang 洛陽 (modern Luoyang, Henan) and was received by royal grandson Man 王孫滿. The latter convinced him that the Heavenly Mandate (tianming 天命) of the Zhou dynasty had not yet ended, in spite of the obvious weakness of the royal house.\n\nIn 597 Chu defeated the army of Jin near Bi 邲 (near modern Zhengzhou 鄭州, Henan). In 594 Chu besieged the capital of Song for five months and conquered the statelet of Yong 庸 (near modern Zhushan 竹山, Hubei), later Shu-Liao 舒蓼 (modern Shucheng 舒城, Anhui) and Xiao 蕭 (near modern Xuzhou 徐州, Jiangsu).\n\nAfter the conquest of Chen, King Zhuang wanted to transform it into a district of Chu, but Shen Shu 申叔 of Qi criticized the king, so that he reinstated the house of Chen. Yet his next step was to conquer the state of Zheng. After the lord of Zheng had begged for mercy, King Zhuang released him and created an alliance of peace. In 575 the army of Chu defeated the relieve army from Jin in the battle of Yanling 鄢陵 (modern Yanling, Henan). The rule of King Zhuang is seen as the apogee of the power of the state of Chu among the regional states of the Zhou period. He was accepted as hegemonial lord (ba 霸).\n\nKing Zhuang was succeeded by his son Shen 審, posthumously known as King Gong 楚共王 (r. 591-560). During his reign the army of Chu was defeated by Jin. The next ruler was King Gong's son Zhao 招, posthumously known as King Kang 楚康王 (r. 560-545). The latter was succeeded by his son Yuan 員, who is also known as Jia'ao 郟敖 (r. 545-541). King Kang had four younger brothers called Wei 圍, Zibi 子比, Zixi 子晳 and Qiji 弃疾. Wei was made Prime Minister and commander of the army. When Jia'ao fell ill, Wei entered the palace, strangulated the king and killed his sons Mo 莫 and Pingxia 平夏. Zibi fled to Jin, while Wei mounted the throne. He is posthumously known as King Ling 楚靈王 (r. 541-529).\n\nChu as a major power of the Warring States\n\nKing Ling was able to assemble the regional rulers and to take over the lead as a factual hegemon of the regional states. Minister Wu Ju warned the king to become over-confident in his superior role, yet King Ling commanded the regional states in a campaign against the state of Wu 吳. Qing Feng 慶封, the commander of the troops of Wu, was kept prisoner, but dared criticizing King Ling for the way his fathers had come to the throne of Chu, and was therefore immediately executed by the king. He had the Zhanghua Terrace 章華臺 built where he received noble refugees from other states. Prince Qiji was ordered to attack the state of Chen, and King Ling invited the marquis of Cai 蔡 in order to poison him. Prince Qiji conquered the headless state of Cai and usurped the throne of the small marquisate.\n\nIn 530 BCE, King Ling attacked the small state of Xu 徐, located northwest of the state of Wu, and Lai 賴 (modern Suizhou 隨州, Hubei). Chen was heavily deafeated and its dynasty brought to an end. At that moment, King Ling deliberated with his nobles whether he was strong enough to claim the same rights as the other regional rulers. Grand master (dafu 大夫) Xi Fu 析父 answered that in old times, the state of Chu had been a very remote and less developed country, but now the King of Zhou would not refuse to bestow to the King of Chu bronze tripods as a symbol of royal power, and none of the other states would refuse to exchange gifts with the state of Chu.\n\nWhen King Ling was on campaign against Wu in the camp of Ganxi 乾溪, the king of Wu was advised by Guan Cong 觀從, a son of a noble of Cai whom King Ling had killed. The King of Wu joined a secret alliance with the state of Yue 越, whose nobleman Chang Shouguo 常壽過 had also been insulted by the king of Chu. Wu and Yue attacked Cai and won over Qiji, who was able to kill the heir apparent of Chu, Prince Lu 祿. Zibi was enthroned as king of Chu, Zixi was made Prime Minister, and Qiji Minister of War (sima 司馬). Guan Cong thereupon travelled to the camp of King Ling and presented him with the facts of the rebellion at home. The army of Chu dispersed and left the king alone. King Ling wandered around in the wilderness and finally died of hunger because the new ruler had forbidden giving him anything to eat.\n\nThe new king, Zibi, was for a long time in an unclear state about the whereabouts of King Ling, and finally committed suicide, together with Zixi. Qiji renamed himself Xiong Ju 熊居 and proclaimed himself king of Chu. He is posthumously known as King Ping 楚平王 (r. 527-516).\n\nIn fear of revenge, King Ping demonstrated a benevolent government towards the common people and restored the territories of the states of Chen and Cai, enthroning members of the former ruling houses. The eastern parts of Chu were plundered by the armies of Wu during this interlude of internal war in Chu.\n\nKing Ping decided to marry his son, Crown Prince Jian 建, with a princess from Qin 秦. Yet the girl was so beautiful that the king decided to take her for himself, and she gave birth to Prince Zhen 軫. Grand Tutor (taifu 太傅) Wu She 伍奢 and Junior Tutor (shaofu 少傅) Fei Wuji 費無忌 intrigued against each other and instigated in the king the fear that the crown prince might prematurely usurp the throne. Prince Jian thereupon fled to the court of Song. Wu She's son Wu Zixu 伍子胥, who was an excellent strategist, was able to escape to the state of Wu, the arch-enemy of Chu.\n\nThe mother of Prince Jian was captured by the army of Wu when Prince Guang 光 of Wu was campaigning against Chen and Cai. A small border clash in Beiliang 卑梁 lead to an armed conflict between Chu and Wu, in which Wu conquered the territories of Zhongli 鐘離 and Juchao 居巢. King Ping was so threatened that he began fortifying the capital city Ying. When King Ping died, the nobles wanted to enthrone his younger brother Prince Zixi 子西, but he refused, so that the under-age prince Zhen was enthroned as ruler of Chu. He is posthumously known as King Zhao 楚昭王 (r. 516-489).\n\nAt the beginning of his reign, Prime Minister Zichang 子常 took revenge for Prince Jian and Wu She and killed the intriguer Fei Wuji. The reason for this was that a many nobles had fled to Wu, where they supported the troops of Chu against the own dynasty in Chu. Yet there were also some princes of Wu escaping trouble in the own country at the court of Chu.\n\nIn 509 BCE the army of Chu, commanded by Prince Zichang, was heavily defeated by Wu in the battle of Baiju 柏舉 (modern Macheng 麻城, Hubei). Wu Zixu as one of the competent military leaders of Wu even managed to conquer the capital of Chu in 506. As a revenge for the execution of his father, Wu Zixu had the tomb of King Ping desecrated. Commander Prince Zichang fled to the state of Zheng. King Zhao himself escaped to Yunmeng 雲夢 and then on to the former state of Sui, where he was hidden by his loyal courtiers and the population from the army of Wu.\n\nIn the meantime, minister Shen Baoxu 申鮑胥 was sent to the state of Qin to ask for relief troops, which were indeed able to defeat the troops of Wu that had advanced far into the country of the enemy until they reached Ji 稷 (modern Tongbai 桐柏, Henan). Prince Fugai 夫概, brother of the king of Wu, usurped the throne on this occasion but was driven out by the righteous king and fled to the court of Chu.\n\nStill on his way back to the capital, King Zhao of Chu swallowed the state of Tang 唐 (near modern Suizhou, Hubei), then Dun 頓 (modern Shangshui 商水, Henan) and Hu 胡 (modern Fuyang 阜陽, Anhui). There was another occasion in 504 when the army of Wu again invaded the state of Chu. Only with the death of King Helü 闔閭 of Wu (r. 514-496) the attention of Wu was directed against the state of Yue, and the danger from the east was gone.\n\nOn his sickbed, King Zhao wanted to cede the throne to his younger brother, yet all nobles refused, before Prince Zilü 子閭 conceded to become the successor of his brother. Yet when the King died on a campaign, the brothers decided to enthrone the king's son, Prince Zhang 章. He is posthumously known as King Hui 楚惠王 (r. 489-432). In 488 Prince Zixi invited the former Prince Jian's son Prince Sheng 勝 to come back to Chu. He was granted the title of Duke Bai 白公. Duke Bai planned to revenge his father's death, who had been killed in exile in Zheng.\n\nIn 481 BCE, the army of Jin attacked Zheng, and Zheng asked Chu for help. Instead of annihilating Zheng, commander Zixi left Zheng untouched. Duke Bai thereupon killed Zixi, Prince Ziqi 子綦 and Prime Minister Sima Ziqi 司馬子期 at the court and tried to kidnap King Hui. Yet the king was protected by his retainers and took refuge in the palace of the Queen Dowager of King Zhao.\n\nDuke Bai thereupon proclaimed himself king, but was assassinated by Prince Zigao 子高, called Duke Ye 葉公. In this year, Chu finally destroyed the state of Chen, in 447 the state of Cai, and in 445 the state of Qi 杞.\n\nIn 473, the armies of Yue had finally destroyed the state of Wu. In the northern parts of Wu, along the plain of the River Huai 淮, Chu began to expand its territory. King Hui was succeeded by his son Prince Zhong 中, who is posthumously known was King Jian 楚簡王 (r. 432-408). Under his reign, Chu conquered the statelet of Ju 莒 (modern Juxian 莒縣, Shandong) that had belonged to the territory of Qi. King Jian employed the famous military advisor Wu Qi 吳起, who reformed the army, so that Chu was able to conquer the southern regions inhabited by the non-Chinese peoples of the Yangyue 揚粵, namely the Dongting 洞庭 (Hunan) and Cangwu 蒼梧 (Guizhou) regions.\n\nKing Jian was succeeded by his son Prince Dang 當, posthumously known as King Sheng 楚聲王 (r. 408-402). King Sheng was killed by \"robbers\" (presumably nobles or family members) and was succeeded by his son Prince Yi 疑, posthumously known as King Dao 楚悼王 (r. 402-381). Under his reign, Chu contended with the troops of the new states of Han 韓, Zhao 趙 and Wei 魏, the successor states of Jin. King Dao was succeeded by his son Prince Zang 臧, posthumously known as King Su 楚肅王 (r. 381-370). Because King Su had no sons, he left the throne to his younger brother Prince Liangfu 良夫, who is posthumously known as King Xuan 楚宣王 (r. 370-340). At the end of the latter's reign, the armies of Qin attacked Chu. At that time, Qin was governed by counsellor Shang Yang 商鞅.\n\nKing Xuan's son Prince Shang 商 succeeded to the throne in Chu, posthumously known as King Wei 楚威王 (r. 340-329). He was able to defeat the armies of the state of Qi, which was at that time disturbed by inner quarrels. King Wei also defeated the armies of the kingdom of Yue and occupied a large part of its territory, so that Chu was now the sole state in the southern parts of China. In 306, Yue was destroyed by Chu.\n\nChu as a large but weak state between Qin and Qi\n\nWhen King Wei died, the state of Wei used this opportunity and conquered part of its northern territory. King Wei's successor was his son Prince Guai 槐, posthumously known as King Huai 楚懷王 (r. 329-299). In 323 BCE he took revenge and attacked the territory of Wei, seizing eight counties. The next military target was the state of Qi, yet at that time the military adviser Chen Zhen 陳軫 dwelled at the court of Qi and was dispatched to the camp of counsellor Zhao Yang 昭陽, highest commander of the army of Chu. Chen Zhen persuaded Zhao Yang with the parable of drawing feet to a snake that he would have no advantage in defeating the army of Qi, so that Zhao Yang withdrew. At least, Chu was able to conclude an alliance with the states of Qin, Wei and Qi that was initiated by the famous diplomatist Zhang Yi 張儀.\n\nThis alliance became important in 318 BCE, when an alliance, concluded with the help of Su Qin 蘇秦, attacked the state of Qin. King Huai took over the lead of the allies and penetrated into the Hangu Pass 函谷關, yet the allies withdrew without forcing Qin to battle.\n\nIn 313, things had changed and Chu was in alliance with Qi. The king of Qin decided to send Zhang Yi to Chu in order to persuade King Huai to change side again and, in the end, to isolate Chu. Chen Zhen was well aware of this and warned King Huai, but he refused to accept the warning. In the end, the enraged king of Qi concluded an alliance with Qin. King Huai, on his side, made ready the troops for a campaign against Qin. Again, Chen Zhen warned the king and suggested offering Qin a city to restore the former alliance. King Huai ignored the warning, and so the army of Qin destroyed that of Chu at Danyang 丹陽 in 312, captured a huge humber of troops and officers, and occupied the region of Hanzhong 漢中. At Lantian 藍田, the armies battled a second time, and the fresh defeat of Chu instigated Han and Wei to seize some more territory from Chu.\n\nA year later, Qin suggested concluding peace and sent Zhang Yi to the court of Chu. King Huai immediately arrested Zhang Yi and planned to kill him, but Zhang established contact with Jin Shang 靳尚, who explained to King Huai that Qin would attack Chu again. He also spoke with the King's favourite, Lady Zheng Xiu 鄭袖, and threatened her that the king of Qin would try to purchase peace by sending beautiful girls to King Huai. The Lady then managed the release of Zhang Yi, and peace was made with Qin. Shortly after, the Chu embassador to Qi returned, Qu Yuan 屈原, and reproached the king for not having executed Zhang Yi.\n\nIn 310 BCE, the King Min of Qi 齊湣王 (r. 324-284) sent an envoy to the court of Chu and explained that, after the death of King Hui in Qin, the situation had changed thoroughly, and suggested to conclude a common alliance with Han, Wei, Zhao and Yan 燕 against Qin. Zhao Ju 昭雎 convinced King Huai that it was better to be part of the alliance around Qi and to win back the territory once lost to Qin. Yet in 307, King Huai decided that he could also win territory by concluding a peaceful alliance with Qin. Two years later Qin, Han and Wei attacked Chu for its betrayal of the alliance. King Huai sent his crown prince as a hostage to Qin and requested military support against the three states.\n\nIn 304, the crown prince of Chu had a private quarrel with some nobles of Qin. When he accidentally killed one of them, he fled and returned to Chu. In order to take revenge for the murder, Qin attacked Chu, supported by troops of Qi, Han and Wei, and defeated Chu at Chuisha 垂沙. A year later, Qin undertook a second campaign against Chu and heavily defeated the army of Chu. King Huai thereupon sent his crown prince as a hostage to Qi, an ally of Qin, and requested peace.\n\nOnly after a further campaign and after King Zhao of Qin had sent an urgent letter, King Huai of Chu consented to a meeting with the king of Qin at the Wuguan Pass 武關. Yet King Huai did not trust Qin and feared that he might be caught in a trap. Zhao Ju suggested not to meet the king of Qin, but the King's younger son urged him to go. In the end, King Huai was escorted to Xianyang 咸陽, the capital of Qin, and was threatened to cease territory before concluding an alliance. He refused and was arrested and detained.\n\nAt home, the situation was precarious. Both the king and the crown prince were held hostages in Qin, and Zhao Ju argued that it was against etiquette to enthrone a younger son as long as the ruler was living. This meant that there was no head of government as long as King Huai was in Qin. The court brooded over the issue and finally invited Prince Heng 橫 to come to the capital Ying. He was enthroned as king of Ch, posthumously known as King Qingxiang 楚頃襄王 (r. 299-263).\n\nThe king of Qin thereupon continued his campaigning against Chu, defeated its army, and seized territory in the north. A year later, King Huai managed to escape, but because the roads to Chu were blocked by Qin, he fled to the state of Zhao, but fearing the anger of Qin, King Huiwen of Zhao 趙惠文王 (r. 299-266) refused to offer protection. King Huai was finally captured by the bloodhounds of Qin and brought back to Xianyang, where he died a year later. At least, his corpse was allowed to be transferred back to his native state, where he was buried with greatest honours.\n\nIn 293 BCE, general Bai Qi 白起 massacred the army of Han. Threatened by this cruel way of warfare, King Qingxiang agreed to conclude a marriage of peace with Qin. This new alliance led to a campaign in 284, carried out by Qin, Chu, Han, Wei, Zhao and Yan and targeted against the state of Qi in the east. Chu so regained the region of Huaibei 淮北. In 281, King Qingxiang was persuaded to resume war against Qin, in order to gain more territory. He first concluded an alliance with Qin and Han and planned to use this opportunity to conquer some territory of the patriarchal kings of Zhou around Luoyang. King Nan of Zhou 周王赧 (r. 315-256) thereupon sent his relative, Duke Wu 武公, to Zhaozi 昭子, the counsellor of Chu. Duke Wu explained to Zhaozi that the destruction of the house of Zhou meant a thorough dissolution of the world order and would bring only chaos to the state of Chu. King Qingxiang thereupon abandoned this plan.\n\nThe campaigns against Qin continued, but in 278 BCE, general Bai Qi advanced to the capital of Chu and defiled the tombs of the kings of Chu. The capital of Chu was moved to the ancient site of Chen (modern Huaiyang 淮陽, Henan) It was only in 276 that the army of Chu was able to recover some of its core territory. Chu was even able to supporte Han, Zhao and Wei in a campaign against Yan. This was only possible because of an armistice bargained with Qin, covered by the crown prince as a hostage dwelling in Qin.\n\nWhen King Qingxiang fell ill, his son Prince Xiong Yuan 熊元 (or Wan 完) managed to escape from Qin and was enthroned as the new king of Chu. He is posthumously known as King Kaolie 楚考烈王 (r. 263-238). The new king immediately appointed his trusted Counsellor-to-the-Left (zuoxi 左徒), Lord Chunshen 春申君, as Prime Minister. Under the Lord's administration, the state of Chu was able to recover for a while. The capital was first shifted to Juyang 巨陽 (modern Taihe 太和, Anhui), later to to Shouchun 壽春 (modern Shouxian 壽縣, Anhui) further to the east. Lord Chunshen met with Lord Xinling 信陵君 of Wei and forged an alliance that was able to defeat Qin in 257. A year later, Chu conquered the state of Lu.\n\nKing Kaolie was succeeded by his son Prince Dao 悍 (or Yu 煜), who is posthumously known as King You 楚幽王 (r. 238-228). Li Yuan 李園, a powerful noble, used this personal change to assassinate Lord Chunshen. King You was succeeded by his younger half-brother You 猶 (or Hao 郝), who is posthumously known as King Ai 楚哀王 (r. 228). He only ruled for two months before he was overthrown and killed by his older half-brother Fuchu 負芻 (r. 228-223).\n\nThe rule of the last kings of Chu was overshadowed by a growing military success of the state of Qin that succeedingly conquered the states of Han, Zhao and Wei. In 224, the Qin general Wang Jian 王翦 defeated the army of Chu and killed general Xiang Yan 項燕, a great uncle of Xiang Yu 項羽, the eventual hegemonial king (bawang 霸王) of West Chu 西楚. A year later, Wang Jian and Meng Wu 蒙武 seized the capital of Chu, captured King Fuchu and transformed the state of Chu into a commandery of the state of Qin.\n\nThe name of Chu was often used as a name for imperial princedoms, and was one of the Ten States (Shiguo 十國) in the 10th century.\n\n\n\n\n\nTable 1. Rulers of the regional state of Chu 楚 Capitals: Danyang 丹陽 (modern Zigui 秭歸, Hubei), Ying 郢 (modern Jiangling 江陵 or Shashi 沙市, Hubei), Ruo 鄀 (Shangruo 上鄀; near modern Zhongxiang 鍾祥, Hubei), Yingchen 郢陳 (modern Huaiyang 淮陽, Henan), Juyang 巨陽 (near Taihe 太和, Anhui), Shouchun 壽春 (modern Shouxian 壽縣, Anhui) dynastic title personal name time Xiong Yi of Chu 楚熊繹, family name Mi 芈 (or Nai 嬭, Qian 芊, Xiong 熊, Yan 酓) Xiong Yi of Chu 楚熊乂 Xiong Tan of Chu 楚熊黮 Xiong Sheng of Chu 楚熊勝 Xiong Shang 楚熊煬 or Xiong Yang of Chu 楚熊揚 Xiong Qu of Chu 楚熊渠 Xiong Wukang of Chu 楚熊無康 Zhi Hong of Chu 楚鷙紅 (or 摯紅) Xiong Yan of Chu 楚熊延 Xiong Yong of Chu 楚熊勇 848-838 Xiong Yan of Chu 楚熊嚴 838-828 Xiong Shuang of Chu 楚熊霜 828-822 Xiong Xun of Chu 楚熊徇 (or 熊狥) 822-800 Xiong E of Chu 楚熊鄂 (or 熊咢) 800-791 Ruo Ao of Chu 楚若敖 Mi Xiong Yi 芈熊儀 791-764 Xiao Ao of Chu 楚霄敖 Mi Xiong Kan 芈熊坎 764-758 Fen Mao of Chu 楚蚡冒 Mi Xiong Xuan 芈熊眴 (or Xiong Xun 熊㫬) 758-741 King Wu of Chu\n\n(Chu Wuwang 楚武王) Mi Xiong Tong 芈熊通 741-690 King Wen of Chu\n\n(Chu Wenwang 楚文王) Mi Xiong Zi 芈熊貲 690-677 Du Ao, King of Chu 楚王堵敖 Mi Xiong Jian 芈熊艱 677-672 King Cheng of Chu\n\n(Chu Chengwang 楚成王) Mi Jun 芈頵 672-626 King Mu of Chu\n\n(Chu Muwang 楚穆王) Mi Shangchen 芈商臣 625-614 King Zhuang of Chu\n\n(Chu Zhuangwang 楚莊王) Mi Lü 芈旅 614-591 King Gong of Chu\n\n(Chu Gongwang 楚共王) Mi Shen 芈審 591-560 King Kang of Chu\n\n(Chu Kangwang 楚康王) Mi Zhao 芈招 560-545 Jia Ao, King of Chu 楚王郟敖 Mi Jun 芈麇 545-451 King Ling of Chu\n\n(Chu Lingwang 楚靈王) Mi Qian 芈虔 541-529 King Ping of Chu\n\n(Chu Pingwang 楚平王) Mi Ju 芈居 529-516 King Zhao of Chu\n\n(Chu Zhaowang 楚昭王) Mi Zhen 芈軫 516-489 King Hui of Chu\n\n(Chu Huiwang 楚惠王) Mi Zhang 芈章 489-432 King Jian of Chu\n\n(Chu Jianwang 楚簡王) Mi Zhong 芈中 432-408 King Sheng of Chu\n\n(Chu Shengwang 楚聲王) Mi Dang 芈當 408-402 King Dao of Chu\n\n(Chu Daowang 楚悼王) Mi Yi 芈疑 402-381 King Su of Chu\n\n(Chu Suwang 楚肅王) Mi Zang 芈臧 381-370 King Xuan of Chu\n\n(Chu Xuanwang 楚宣王) Mi Liangfu 芈良夫 370-340 King Wei of Chu\n\n(Chu Weiwang 楚威王) Mi Shang 芈商 340-329 King Huai of Chu\n\n(Chu Huaiwang 楚懷王) Mi Guai 芈槐 329-299 King Qingxiang of Chu\n\n(Chu Qingxiangwang 楚頃襄王) Mi Heng 芈橫 299-263 King Kaolie of Chu\n\n(Chu Kaoliewang 楚考烈王) Mi Wan 芈完 263-238 King You of Chu\n\n(Chu Youwang 楚幽王) Mi Yu 芈煜 238-228 King Ai of Chu\n\n(Chu Aiwang 楚哀王) Mi Hao 芈郝 228 Fuchu, King of Chu 楚王負芻 Mi Fuchu 芈負芻 228-223 223 Chu destroyed by Qin 秦.\n\nSources:\n\nLi Ling 李零 (1992). \"Chu 楚\", in Zhongguo da baike quanshu 中國大百科全書, Zhongguo lishi 中國歷史 (Beijing/Shanghai: Zhongguo da baike quanshu chubanshe), Vol. 1, 109-110."}, {"url": "https://chockchin.org/meet-the-family-king-zhuang-of-chu/", "page_content": "King Zhuang of Chu was one of our ancestors.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn period in ancient China.\n\nHis personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu “to enquire about ding in the central plains”, i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán – see the entry at wiktionary.)[3]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu “amaze [others] with one cry” (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén – see the entry at wiktionary).\n\nThe Chu were known for their unique and elaborate bronze works. Here’s an example:\n\nhttps://en.wikipedia.org/wiki/King_Zhuang_of_Chu\n\nPhoto credit for image of King Zhuang: http://en.hubei.gov.cn/culture/highlights/201608/t20160805_876410.shtml"}, {"url": "https://infogalactic.com/info/King_Zhuang_of_Chu", "page_content": "From Infogalactic: the planetary knowledge core\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally: \"Amaze [the others] with one cry\").\n\nReferences"}, {"url": "https://everything.explained.today/%5C/King_Zhuang_of_Chu/", "page_content": "King Zhuang of Chu explained\n\nKing Zhuang of Chu (reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü, his ancestral name was Mi, and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions .[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" .\n\nNotes and References"}, {"url": "https://wiki.alquds.edu/?query=King_Zhuang_of_Chu", "page_content": "King of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén)."}, {"url": "http://www.chinaknowledge.de/History/Han/personschuhuaiwang.html", "page_content": "Mar 8, 2011 © Ulrich Theobald\n\nKing Huai of Chu 楚懷王 (r. 209-205 BCE), personal name Mi Xiongxin 芈熊心, was a ruler enthroned at the end of the Qin period 秦 (221-206 BCE). He was a grandson of King Huai of Chu (personal name Mi Xionghuai 芈熊槐, r. 329-299), one of the last rulers of the state of Chu 楚 before Qin conquered this region.\n\nDuring the reign of the Qin dynasty, Mi Xiongxin lived as a commoner. When the first rebellions against the Qin broke out in 209, general Xiang Liang 項梁 decided making Mi Xiongxin not only king of Chu, but giving him the leading position over all rebels that joined against the Qin.\n\nMi Xiongxin agreed and took first residence in Xuchi 盱眙 (modern Xuchi, Jiangsu), and after Xiang Liang's death, in Pengcheng 彭城 (modern Xuzhou 徐州, Jiangsu). He was wholly dominated by the warlord Xiang Yu 項羽 and was forced to accompany him during all his campaigns.\n\nWhen Xiang Yu entered the capital of the Qin dynasty, Xianyang 咸陽 (modern Xianyang, Shaanxi), the warlord adopted the title of hegemonial king (bawang 霸王) and bestowed to the king of Chu the honorific title of Righteous Emperor (Yidi 義帝). Not soon thereafter, Xiang Yu had King Huai assassinated and made himself King of West Chu 西楚.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1996), Hanshu cidian 漢書辭典 (Jinan: Shandong jiaoyu chubanshe), 798."}, {"url": "http://zh.worldheritage.org/articles/King_Zhuang_of_Chu", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "http://www.chinaknowledge.de/History/Zhou/rulers-song.html", "page_content": "Nov 1, 2018 © Ulrich Theobald\n\nDon't confound this regional state of the Zhou period with the Liu-Song dynasty 劉宋 (420-479) of the Southern Dynasties period 南朝 (420~589) or the great Song dynasty 宋 (960-1279).\n\nThe state of Song 宋 was a regional state of the Zhou period 周 (11th cent.-221 BCE). As a small state of the Central Plain, it had always to cope with the ambitions of the larger states around. Its ruling dynasty were descendants of the Shang dynasty 商 (17th-11th cent. BCE). The territory of Song was located in the southern tip of the modern province of Henan.\n\nMap 1. The regional state of Song 宋 (11th cent. - 286 BCE) Zhongguo lishi ditu ji 中国历史地图集. Song was located in the eastern parts of the Yellow River Plain and was relatively strong among the smaller regional states. It survived the Map according to Tan Qixiang 谭其骧 (1987),中国历史地图集. Song was located in the eastern parts of the Yellow River Plain and was relatively strong among the smaller regional states. It survived the Spring and Autumn period and was conquered by its eastern neighbour Qi. Click to enlarge.\n\nThe house of Song was founded by Weizi 微子, who was the oldest son of King Di Yi 帝乙 of the Shang dynasty and an older, yet inferior, brother of the last ruler of the Shang, King Zhou 紂. When King Zhou succeeded to the throne, he proved to be an incompetent and cruel ruler who loved an extravagant lifestyle. Prince Wei several times remonstrated against his brother, but without success. At that time, the Viscount of the West 西伯, Ji Chang 姬昌 (known as King Wen of Zhou 周文王), exerted a virtuous government and began to conquer the western borderlands of the Shang kingdom.\n\nWeizi thereupon deliberated whether he should seek death in a last memorial to the tyrant, or leave the country. He explained to the Grand and Small Preceptors (taifu 太傅, shaofu 少傅), the highest ministers of the Shang court, his considerations, and Jizi 箕子, the Grand Preceptor, pursued him to leave rather than to die, because when he lived in exile, Weizi would be able to mount the throne of the Shang one day, while a further memorial to the unteachable king would bring him the death penalty, and the dynasty would be ended definitely. Qizi himself, an uncle of King Zhou, did not leave the country but feigned madness, was enslaved and so survived the demise of King Zhou's rule. Another uncle of the king, Bi Gan 比干, did not survive. For his free criticism he was cruelly executed but cutting out his heart.\n\nWhen Ji Fa 姬發 (posthumous title King Wu of Zhou 周武王), son of the Viscount of the West, defeated the army of the king of Shang in the battle of Muye 牧野, Weizi brought the sacrificial tools of his fathers to the camp of Ji Fa and offered his submission. Ji Fa accepted and promised to give him a high position.\n\nWhen the Zhou dynasty was founded, King Wu appointed the late King Zhou's son Wu Geng 武庚 (Lu Fu 祿父) as righteous successor of the dynastic line, and gave him the territory of Bei 邶. Wu Geng was assisted by Guan Shu Xian 管叔鮮, regent of Yong 鄘, and Cai Shu Du 蔡叔度, ruler of Wei 衛. Both were half-brothers of King Wu.\n\nKing Wu, now ruler over China, asked Jizi for advice, and the latter explained to him the power of the Five Agents 五行 that influenced the whole cosm as well as the kingdom and the lives of men. The explanation of the Five Agents and their effect is narrated in the history Shiji 史記 as well as in the chapter Hongfan 洪範 in the book Shangshu 尚書. King Wu, having learned about the functioning of the universe, made Jizi regional ruler of the eastern country Chaoxian 朝鮮 (Korea), yet without counting him as a regional ruler (zhuhou 諸侯). In Korea, Jizi is known as Kicha.\n\nWhen King Wu died, his young son King Cheng 周成王 mounted the throne. Late King Wu's brother, the Duke of Zhou 周公, thereupon took over regency for the under-age king, but Guan Shu and Cai Shu suspected the Duke of usurpation and instigated Wu Geng, nominal head of the descendants of the former Shang dynasty, to rise in rebellion. Their army was defeated by the Duke of Zhou, the three traitors were executed, and Weizi was named head of the Shang dynasty and made regional ruler as Duke of Song. His investiture is reported in the chapter Weizi zhi ming 微子之命 in the book Shangshu. He was willingly accepted by the people of the Shang because of his virtuous conduct. His line continued as the rulers of the regional state of Song.\n\nDuke Xuan 宋宣公 (r. 747-729) had a crown prince called Yuyi 與夷. Yet when the duke fell ill, he summoned his younger brother Prince He 和 to his bed and entrusted to him the throne. When the duke died, Prince He, posthumously known as Duke Mu 宋穆公 (also written 宋繆公, r. 728-720), had a conversation with his Minister of War (da sima 大司馬) Kong Fu Jia 孔父嘉, in which he said the after his death it should be Prince Yuyi to whom the throne should fall, yet Kong Fu explained that all ministers preferred Prince Feng 馮, Duke Mu's own son. Yet the Duke did not want to offend his brother's soul and therefore sent Prince Feng to the state of Zheng 鄭 and managed the enthronement of Prince Yuyi, who is posthumously known as Duke Shang 宋殤公 (r. 719-711). Under his reign a years-long conflict with the state of Zheng erupted. The war was caused by an usurpation in the state of Wei, whose ruler feared an attack by Zheng and therefore sought alliance (meng 盟) with Song.\n\nKong Fu Jia's wife was very beautiful, and Counsellor-in-chief (taizai 太宰) Hua Du 華督 therefore wanted to possess her. In order to get rid of Kong Fu Jia, he slandered him by attributing the sufferings of the country under the long period of warfare with Zheng to the politics of Kong Fu Jia. Hua Du assassinated Kong Fu, kidnapped his widow, and immediately thereafter killed Duke Shang who had been enraged about this impertinence. Hua Du invited Prince Feng to mount the throne. He is known posthumously as Duke Zhuang 宋莊公 (r. 710-692). Hua Du as counsellor to the Duke had a great influence on politics and even controlled the succession in the state of Zheng.\n\nHis son was Duke Min 宋閔公 (also written 宋愍公, r. 691-682). Under his reign, during a campaign against the state of Lu 魯, minister Nangong Wan 南宮萬 was captured and only released when the Duke heavily insisted in his release. Somewhat later, during a hunt, the Duke insulted Nangong Wan as a former \"prisoner of Lu\". The minister thereupon decided to kill the Duke. The noble Qiu Mu 仇牧, who wanted to defend the ruler, was killed at the gate, likewise counsellor Hua Du. Nangong Wan thereupon enthroned Prince Ziyou 子游 as the new ruler of Song. Prince Yuyue 御說 fled to Hao 毫, other princes to the small state of Xiao 蕭. Nangong Wan's brother Nangong Niu 南宮牛 besieged the town of Hao, but the princes united their forces and were able to kill Nangong Niu and returned to Song, where they killed Prince Ziyou and enthroned Prince Yuyue as the new ruler of Song. Nangong Wan fled to the state of Chen 陳, but Yuyue (posthumously known as Duke Huan 宋桓公, r. 681-651), managed to have Nangong Wan handed over, made him drunk and wrapped into a cow hide. He was cruelly chopped to death.\n\nDuke Huan was able to dominate the succession in the weak state of Wei and married the sister of Duke Wen of Wei 衛文公 (r. 659-635). When Duke Huan fell ill, Prince Zifu 茲父 (also written 茲甫), planned to cede the right of succession to his older, yet inferior, brother Muyi 目夷, but the latter refused the position of heir apparent. In the end, Prince Zifu mounted the throne, while Prince Muyi became his chief counsellor. Zifu is known as Duke Xiang 宋襄公 (r. 650-637).\n\nWhen the hegemonial lord (ba 霸) Duke Huan of Qi 齊桓公 (r. 685-643) died, Duke Xiang of Song invited the regional rulers to swear an alliance at Lushang 鹿上. With this conference Duke Xiang planned to take over the position of hegemonial lord, yet Prince Muyi warned him against such a step with the argument that a small country like Song would not be able to fulfill this duty appropriately. On a meeting with the regional rulers at Yu 盂, the king of the powerful state of Chu 楚 arrested Duke Xiang and only released him a few months later.\n\nImmediately thereafter, Duke Xiang attacked the state of Zheng, an occasion that minister Ziyu 子魚 interpreted as the origin of the disaster that Prince Muyi had predicted because the large state of Chu soon dispatched an army to bring relief to Zheng. Duke Xiang awaited the army of Chu at River Hong 泓 until they had formed their battle arrays, in spite of Prince Muyi's urgent plea to attack them while crossing the river. This gentleman-like behaviour (\"only attack the enemy when he has completed the battle array\") cost Duke Xiang the victory.\n\nThe duke of Zheng feasted the victor and his saviour, King Cheng of Chu 楚成王 (r. 672-626), but the latter, when leaving, seized the two daughters of the duke and with this insolent behaviour violated the right of hospitality.\n\nDuke Xiang granted asylum to Prince Chong'er 重耳 of the state of Jin 晉, and knowing that the prince might become duke of Jin one day, decided to support him, in order to have an ally against the state of Chu. Prince Chong'er later mounted the throne as Duke Wen of Jin 晉文公 (r. 636-628). When Duke Xiang died, he was succeeded by his son Prince Wangchen 王臣, who is known as Duke Cheng 宋成公 (r. 636-620). When Chu attacked Song in 633, Duke Wen of Jin sent a relief army to help Duke Cheng. When Duke Cheng died, his younger brother Prince Yu 禦 assassinated the crown prince and the Minister of War, Gongsun Gu 公孫固. Yet Yu was killed soon, and Duke Cheng's son Prince Chujiu 杵臼 mounted the throne. He is known as Duke Zhao 宋昭公 (I, r. 619-611).\n\nDuke Zhao was an inapt ruler, but his younger brother Prince Baoge 鮑革, a decent and worthy man, did not want be given a higher position in government. Yet in the end, he became successor of Duke Zhao when the former was assassinated during a hunt by a certain Wei Bo 衛伯, who had been instigated by the Duchess Dowager of late Duke Xiang. Prince Baoge is known as Duke Wen 宋文公 (r. 610-589). Baoge's name as a person of great virtue saved him from being charged with murder, yet the descendants of the late dukes rebelled against the usurper. Duke Wen executed all rebels and had exiled their relatives.\n\nThe king of Chu ordered the duke of Zheng to attack Song. General Hua Yuan 華元 was taken prisoner, and Zheng claimed ransom, yet Hua Yuan was able to escape. In 595, Duke Wen took the envoy of Chu prisoner, so that King Zhuang of Chu 楚莊王 (r. 614-591) decided to besiege the capital of Song. After five months of siege, the people of Song were near starvation. Hua Yuan at night visited the camp of King Zhuang and reported to him the grave situation in Song, yet in a somewhat exaggerated form. The king, his army being short of grain itself, thereupon lifted the siege and returned.\n\nDuke Wen was succeeded by his son Prince Xia 瑕, who is known as Duke Gong 宋共公 (r. 588-576). Under his reign, Hua Yuan was able to establish good relationships with general Zichong 子重 of Chu and general Luan Shu 欒書 of Jin, so that no war threatened the state of Song. When Duke Gong died, the Minister of War, Tang Shan 唐山, killed the heir apparent Prince Fei 肥 and wanted to kill Hua Yuan, who was Commander to the Right (youshi 右師). When Hua Yan was about to flee, the Commander to the Left (zuoshi 左師) Yu Shi 魚石 arrested and executed Tang Shan. The next ruler was a minor son of Duke Gong, Prince Cheng 成, who is known as Duke Ping 宋平公 (r. 575-532). His reign was long and peaceful, except for an invasion by Chu that occupied the city of Pengcheng 彭城 and appointed Yu Shi grand master (dafu 大夫) of that territory.\n\nPrince Zuo 佐 was the next ruler, known as Duke Yuan 宋元公 (r. 531-517). Duke Yuan had executed all princes of Song, descendants of the former dukes. The families Hua 華 and Xiang 向 thereupon rose in rebellion and brought turmoil to the state of Song. Duke Yuan died on the way to Lu to support the re-enthronement of Duke Zhao 魯昭公. His successor was his son Prince Touman 頭曼, who is known as Duke Jing 宋景公 (r. 516-451). During his reign, Confucius 孔子 visited Song and was nearly assassinated by Minister of War Huan Tui 桓魋. In 487, Song attacked and occupied the state of Cao 曹.\n\nDuke Jing was succeeded by Prince Te 特 (or De 得 or De 德), who is known as Duke Zhao 宋昭公 (II, r. 450-404). Prince Te was a great-grandson of Duke Yuan. His father, Gongsun Jiu 公孫糾, had been killed by Duke Jing, for which reason Prince Te killed the heir apparent when Duke Jing had died, and usurped the throne.\n\nDuke Zhao was succeeded by his son Prince Gouyou 購由 (or Gouyao 購繇), who is known as Duke Dao 宋悼公 (r. 403-396). The last century of the ruling dynasty was quite a peaceful time for the state of Song, and it did not play a role in the conflicts of the Warring States period 戰國 (5th cent.-221 BCE). Prince Ticheng 剔成, duke of Song (r. 369-329), was exiled by his younger brother Prince Yan 偃, who usurped the throne and was to be the last ruler of Song (r. 328-286). In 318, the duke adopted the title of king. He is therefore known as King Kang of Song 宋康王. He did not only conquer some smaller states like Teng 滕 and Xue 薛, but was even able to defeat the large states of Qi in the east and Chu in the south, and routed the troops of the young state of Wei 魏 in the west. Yet his indecent and extravagant lifestyle caused people to compare him with the ancient king of Shang, King Zhou, who had once ruined his dynasty. In 286 therefore, an alliance between Qi, Wei and Chu was created, and the state of Song was conquered. While the territory of Song was divided into three, King Yan was killed and the dynasty ended.\n\n\n\nThe name of Song was used for many imperial princedoms, for one of the Southern Dynasties (Nanchao 南朝: Liu-Song 劉宋), and for the great Song Dynasty.\n\nTable 1. Rulers of the regional state of Song 宋 Capital: Shangqiu 商丘, also called Suiyang 睢陽 (modern Shangqiu, Henan) dynastic title personal name time Lu Fu Yin 祿父殷, son of King Zhou 紂 of the Shang 商, posthumously called Wu Geng 武庚, made ruler of Bei 邶. He rebels against King Cheng of the Zhou 周成王 and is executed. His territory was given to Huo Shu 霍叔, a brother of King Cheng. Weizi 微子 Zi Qi 子啟, Wei Zi Qi 微子啟, brother of King Zhou of Shang Weizhong of Song 宋微仲 Zi Yan 子衍 Zi Ji 子稽 Duke Ding (\"IV) of Song\n\n(Song Dinggong 宋丁公) Zi Shen 子申 Duke Min of Song\n\n(Song Mingong 宋湣公) Zi Gong 子共 Duke Shang of Song\n\n(Song Shanggong 宋煬公) Zi Xi 子熙 Duke Li of Song\n\n(Song Ligong 宋厲公) Zi Fusi 子鮒祀 Duke Xi of Song\n\n(Song Xigong 宋釐公, 宋僖公) Zi Ju 子舉 859-831 Duke Hui of Song\n\n(Song Huigong 宋惠公) Zi Jian 子覵 831-800 Duke Ai of Song\n\n(Song Aigong 宋哀公) 800-799 Duke Dai of Song\n\n(Song Daigong 宋戴公) 799-766 Duke Wu of Song\n\n(Song Wugong 宋武公) Zi Sikong 子司空 766-748 Duke Xuan of Song\n\n(Song Xuangong 宋宣公) Zi Li 子力 748-729 Duke Mu of Song\n\n(Song Mugong 宋穆公) Zi He 子和 729-720 Duke Shang of Song\n\n(Song Shanggong 宋殤公) Zi Yuyi 子與夷 720-711 Duke Zhuang of Song\n\n(Song Zhuanggong 宋莊公) Zi Feng 子馮 711-692 Duke Min of Song\n\n(Song Mingong 宋閔公) Zi Jie 子捷 692-682 Duke Huan of Song\n\n(Song Huangong 宋桓公) Zi Yuyue 子御說 682-651 Duke Xiang of Song\n\n(Song Xianggong 宋襄公) Zi Zifu 子茲父 651-637 Duke Cheng of Song\n\n(Song Chenggong 宋成公) Zi Wangcheng 子王臣 637-620 Duke Zhao of Song (I)\n\n(Song Zhaogong 宋昭公) Zi Chujiu 子杵臼 620-611 Duke Wen of Song\n\n(Song Wengong 宋文公) Zi Bao 子鮑 611-589 Duke Gong of Song\n\n(Song Gonggong 宋共公) Zi Xia 子瑕 589-576 Duke Ping of Song\n\n(Song Pinggong 宋平公) Zi Cheng 子成 576-532 Duke Yuan of Song\n\n(Song Yuangong 宋元公) Zi Zuo 子佐 532-517 Duke Jing of Song\n\n(Song Jinggong 宋景公) Zi Touman 子頭曼 517-451 Duke Zhao of Song (II)\n\n(Song Zhaogong 宋昭公) Zi De 子得 451-404 Duke Dao of Song\n\n(Song Daogong 宋悼公) Zi Gouyao 子購繇 404-396 Duke Xiu of Song\n\n(Song Xiugong 宋休公) Zi Tian 子田 396-373 Duke Bi of Song\n\n(Song Bigong 宋辟公) Zi Bibing 子辟兵 373-370 Ticheng, Lord of Song 宋君剔成 Zi Ticheng 子剔成 370-329 Yan, Lord of Song 宋君偃 or King Kang of Song (Song Kangwang 宋康王) Zi Yan 子偃 329-286 286 Song conquered by Qi 齊\n\nSources:\n\nSong Weizi shijia 宋微子世家. Shiji 史記, 38,宋微子世家.\n\nLuo Shilie 羅世烈 (1992). \"Song 宋\", in Zhongguo da baike quanshu 中國大百科全書, Zhongguo lishi 中國歷史 (Beijing/Shanghai: Zhongguo da baike quanshu chubanshe), Vol. 2, 970."}], "Zhuang of Chu was in the Spring and Autumn period of ancient China.": [{"url": "https://www.cambridge.org/core/books/cambridge-history-of-ancient-china/spring-and-autumn-period/41B49F658446B6CDC852639FFBD7892C", "page_content": "To save this book to your Kindle, first ensure coreplatform@cambridge.org is added to your Approved Personal Document E-mail List under your Personal Document Settings on the Manage Your Content and Devices page of your Amazon account. Then enter the ‘name’ part of your Kindle email address below. Find out more about saving to your Kindle.\n\nNote you can select to save to either the @free.kindle.com or @kindle.com variations. ‘@free.kindle.com’ emails are free but can only be saved to your device when it is connected to wi-fi. ‘@kindle.com’ emails can be delivered even when you are not connected to wi-fi, but note that service fees apply.\n\nFind out more about the Kindle Personal Document Service."}, {"url": "http://chinaknowledge.de/History/Zhou/personschuzhuangwang.html", "page_content": "Dec 2, 2010 © Ulrich Theobald\n\nChu Zhuangwang 楚莊王 (r. 613-591) was a ruler of the state of Chu 楚 during the Spring and Autumn period 春秋 (770-5th cent. BCE) and was one of the so-called five hegemons (wuba 五霸). His personal name was Mi Xionglü 芈熊侶 (also written 熊呂 or 熊旅). The state of Chu is sometimes called Jing 荊, and Xionglü's posthumous title is also King Yan 嚴王.\n\nHe succeeded to the throne as son of King Mu 楚穆王 (r. 625-614). King Zhuang started his reign in a style of laissez-faire politics without much caring for the government. His advisors Wu Ju 伍舉 and Su Cong 蘇從 opened him his eyes, so that he started restructuring the administration and strengthening the royal power with the support of Sunshu Ao 孫叔敖. The state took over the care for hydraulic works, dykes and dams, he built up a strong army and quelled the internal rebellion of a certain Ruo Ao 若敖 (not King Ruo Ao, r. 791-764). His armies marched to the north, defeated the state of Song 宋 and the Rong 戎 barbarians of Luhun 陸渾, and lined up before the domain of the king of Zhou 周.\n\nWith the awareness of his power King Zhuang of Chu menaced the King of Zhou and threatened him that Chu would be able to replace the house of Zhou. The armies of Chu then conquered a handfull of smaller states like Yong 庸, Shu 舒 and Chen 陳, and in 602, King Zhuang was able to destroy the army of Jin 晉 at Bi 邲 (modern Xingyang 滎陽, Henan). Chu thus came to replace Jin as the hegemonial power of the Central States.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1991). Shiji cidian 史記辭典 (Jinan: Shandong jiaoyu chubanshe), 590.\n\nChen Quali 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 20.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 469.\n\nLiu Mengxun 柳孟訓 (1997). \"Chu Huaiwang de baye 楚莊王的霸業\", in Men Kui 門巋, Zhang Yanjin 張燕瑾, ed. Zhonghua guocui da cidian 中華國粹大辭典 (Xianggang: Guoji wenhua chuban gongsi), 3.\n\nWang Songling 王松齡, ed. (1991). Shiyong Zhongguo lishi zhishi cidian 實用中國歷史知識辭典 (Changchun: Jilin wenshi chubanshe), 401.\n\nXiong Tieji 熊鐵基, Yang Youli 楊有禮, ed. (1994). Zhongguo diwang zaixiang cidian 中國帝王宰相辭典 (Wuhan: Hubei jiaoyu chubanshe), 77.\n\nYi Xingguo 衣興國, ed. (1988). Shiyong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 44.\n\nXue Hong 薛虹 et al., ed. (1988). Zhongguo huangshi gongting cidian 中國皇室宮廷辭典 (Changchun: Jilin wenshi chubanshe), 773."}, {"url": "https://www.newworldencyclopedia.org/entry/Spring_and_Autumn_Period", "page_content": "The Spring and Autumn Period (春秋時代, Chūnqiū Shídài) was a period in Chinese history, which roughly corresponds to the first half of the Eastern Zhou Dynasty (from the second half of the eighth century to the first half of the fifth century B.C.E. ). Its name comes from the Spring and Autumn Annals (Ch'un Ch'iu), a chronicle of the state of Lu between 722 B.C.E. and 481 B.C.E. , which tradition associates with Confucius. During the Spring and Autumn Period, the status of the Emperor was diminished to little more than that of a figurehead, while powerful nobles gradually extended their dominions over smaller neighboring states. By the sixth century B.C.E. , most small states had disappeared, and a few large and powerful principalities dominated China. Some southern states, such as Chu (楚), and Wu (呉), claimed independence from the Zhou. Wars were undertaken to oppose some of these states (Wu and Yue (越國). In the state of Jin(晋), six powerful families fought for supremacy, and a series of civil wars resulted in the splitting of Jin into three smaller states by the beginning of the fifth century B.C.E.. At that time, the control Zhou kings exerted over feudal princes was greatly reduced, the feudal system crumbled, and the Warring States Period (戰國時代) began.\n\nDuring the Spring and Autumn Period, a complex system of interstate relations developed and many projects requiring the collaboration of two or more states were undertaken, such as drainage operations, canals, dikes, reservoirs, and roads. Massive walls were built, both as protection from each other and from aboriginal and nomadic tribes. Many important cultural developments took place, and great Chinese thinkers including Confucius（孔子), founder of Confucianism; Laozi (老子), founder of Daoism; and Mozi, founder of Mohism developed the philosophical systems which have shaped North Eastern Asia until the present day.\n\nSpring and Autumn Cai Cao Chen Chu Hua Jin Lu Qi Qin Shu Song Wei Wu Yan Yue Zheng\n\nBeginning of the Eastern Zhou Dynasty\n\nKing You of Zhou (reigned 781 B.C.E. - 771 B.C.E. ) (周幽王, zhōu yōu wáng) was the twelfth sovereign of the Chinese Zhou Dynasty. In 780 B.C.E. , after an earthquake hit Guanzhong, a sage named Bo Yangfu (伯陽甫) predicted that the Zhou Dynasty was doomed. In 779 B.C.E. , King You of Zhou became enamored of a courtesan named Baosi (褒姒). She had a son by the King, Bofu (伯服), and King You deposed Queen Shen (申后) and Crown Prince Yijiu and made Baosi the new queen and Bofu the new prince. Baosi did not laugh often. In an effort to impress her, King You used the beacon intended to summon the nobles to his aid in case of enemy attack. The nobles rushed to his castle to find that there was no enemy attack and that Baosi was laughing at them for being fooled. When King You saw that Baosi was entertained by this, he used the trick again and again, so that the nobles lost trust in him and began to disregard his lighted beacon. The angry father of the deposed Queen Shen recruited outside forces to come and attack King You. When the attackers approached, King You lighted his beacon, but none of the nobles came to help, thinking that they were being fooled again. King You and Bofu were killed and Baosi was captured. King You’s insincerity had brought about the end of the Western Zhou Dynasty.\n\nAfter the death of King You, the nobles supported Prince Yijiu as King Ping. The Zhou capital had been sacked by western barbarian tribes, so Prince Ji Yijiu (周平王, zhōu píng wáng) or King P'ing of Chou (姬宜臼) fled to the east. During the flight from the western capital to the east, the king relied on the nearby lords of Qi (齐), Zheng (郑) and Jin (晋) for protection from barbarians and rebellious lords. He moved the Zhou capital from Zongzhou (Hao) to Chengzhou( 洛陽) (Luoyang) in the Yellow River valley and began the Eastern Zhou Dynasty.)\n\nThe fleeing Zhou elite did not have a strong foothold in the eastern territories; even the coronation of the crown prince depended on the support of the eastern states for its success. With the Zhou domain greatly reduced, to Luoyang and nearby areas, the court could no longer support six groups of standing troops (六軍, liù jūn). Subsequent Zhou kings had to request help from neighboring powerful states to defend themselves from raids and to resolve internal power struggles. The Zhou court never regained its original authority; instead, it was relegated to being merely a figurehead of the feudal states. Though the king de jure retained the Mandate of Heaven ( 天命, Tiānmìng), de facto the title held no real power.\n\nUrbanization during the Spring and Autumn period.\n\nDuring the Spring and Autumn period, China was ruled by a feudal system. The Zhou dynasty kings held nominal power over a small Royal Domain, centered on their capital (modern Luoyang( 洛陽)), and granted fiefdoms over the rest of China to several hundred hereditary nobles (Zhuhou 诸侯), descendants of members of the Zhou clan, close associates of the founders of the dynasty, or local potentates. The most important feudal princes (known later as the twelve princes, 十二诸侯) met during regular conferences, where important matters, such as military expeditions against foreign groups or offending nobles were decided. During these conferences, one prince was sometimes declared hegemon (伯 and then 霸), and took leadership over the armies of all feudal states.\n\nRise of the Hegemonies\n\nThe first noble to assist the Zhou kings was Duke Zhuang of Zheng (郑庄公 or鄭莊公) (r. 743 B.C.E. -701 B.C.E. ). He was the first to establish the hegemonial system (bà 霸), which traditional historians justified as a means of protecting weaker civilized states and the Zhou royalty from the intruding \"barbarian\" tribes, which included the Man in the south, Yi in the north, Rong in the east and Di in the west. As the era unfolded, larger states annexed or claimed suzerainty over smaller ones. By the sixth century B.C.E. , most small states had disappeared, and a few large and powerful principalities dominated China. The rulers of the newly powerful states were more anxious to maintain their aristocratic privileges than to follow the tradition, which had been widely propagated during imperial China to consolidate power into the ruling family, of supporting the weak ruling entity during times of unrest (匡扶社稷 kuāng fú shè jì).\n\nDukes Huan of Qi( 齊桓公)(r. 685 B.C.E. -643 B.C.E. ) and Wen of Jin (晉文公) (b. 697, r. 636 B.C.E. -628 B.C.E. ) took further steps to install a system of overlordship, which brought relative stability, though for shorter time periods than before. Annexations increased, favoring the several most powerful states, including Qin (秦), Jin( 晉), Qi (齊) and Chu. The role of the overlord gradually changed from the protection of weaker states to a system of hegemony of major states over weaker satellites of Chinese and \"barbarian\" origin. On the pretext of offering aid and protection, the overlords of the larger states intervened in the internal conflicts of the smaller states and gained advantages over them. The overlords proclaimed themselves masters over their territories, with little recognition of the figurehead, King of Zhou, whose duties were mostly priestly, ritualistic and diplomatic. The establishment of a local administration system (Jun and Xian), with officials appointed by the government, gave states better control over their dominions. Taxation facilitated commerce and agriculture more than proto-feudalism had done.\n\nSome southern states, such as Chu (楚), and Wu (呉), claimed independence from the Zhou. Wars were undertaken to oppose some of these states (Wu and Yue (越國)). The three states of Qin (秦), Jin( 晉) and Qi (齊) not only optimized their own strength, but also repelled the southern state of Chu (楚), whose rulers had proclaimed themselves kings. The Chu armies gradually intruded into the Yellow River Basin. The northern states referred to the Chu as the \"southern barbarians,\" (Chu Man). Chu intrusion was checked several times in three major battles of increasing violence with the Jin armies: the Battle of Chengpu(城濮之戰) in 632 B.C.E. , the Battle of Bi ((邲之戰) in 595 B.C.E. , and the Battle of Yanling (鄢陵之戰) in 575 B.C.E. between the armies of Chu and Jin at Yanling. These victories resulted in the restorations of the states of Chen (陳) and Cai( 蔡).\n\nMany important cultural developments took place in China during the Spring and Autumn Period. Merchants and artisans began to take on importance. Great Chinese thinkers including Confucius（孔子), founder of Confucianism; Laozi（老子）or Lao tse, founder of Daoism; and Mozi, known as Motse (墨子 Mò Zǐ), founder of Mohism developed the philosophical systems which have shaped Asia until the present day. The system of Confucian government administration, with a bureaucracy staffed by qualified scholars who had to undergo a civil service examination, was established.\n\nInterstate Relations\n\nChinese pu vessel with interlaced dragon design, Spring and Autumn Period.\n\nA complex system of interstate relations developed during the Spring and Autumn Period. It was partially structured upon the Western Zhou (周朝) system of feudalism, but operated according to a code of customary norms and values, which loosely resembled international law. As the states attempted to expand and assert themselves, diplomatic encounters among them increased. Many projects requiring the collaboration of two or more states were undertaken, such as drainage operations, canals, dikes, reservoirs, and roads. Massive walls were built, both as protection from each other and from aboriginal and nomadic tribes. Long walls too were thrown up as a means of protection not only against one another but also against aboriginal and nomadic tribes.\n\nAfter a period of increasingly exhaustive warfare, Qi, Qin, Jin, and Chu met for a disarmament conference in 579 B.C.E. , and in 546 B.C.E. , Jin and Chu agreed to yet another truce. During the relatively peaceful sixth century B.C.E. , the two coastal states in today's Zhejiang( 浙江), Wu( 呉) and Yue( 越國), gradually grew in power. After defeating and banishing King Fu Chai of Wu (吳王夫差), King Gou Jian of Yue( 越王句踐) (r. 496 B.C.E. -465 B.C.E. ) became the last recognized overlord.\n\nThis era of peace was a prelude to the maelstrom of the Warring States Period ( 戰國時代) which followed. The four powerful states were all embroiled in internal power struggles. In Jin (晋), six elite landholding families waged war on each other. The Chen family was eliminating political enemies in Qi. Legitimacy of the rulers was often challenged in civil wars by various royal family members in Qin and Chu. Eventually each of these conflicting groups established its own dominion. The Warring States Period officially started in 403 B.C.E. when the three remaining elite families in Jin , Zhao, Wei and Han, partitioned the state and the impotent Zhou court was forced to recognize their authority. The control exerted by Zhou kings over feudal princes was greatly reduced, the feudal system crumbled, and the Warring States Period( 戰國時代) began.\n\nList of Overlords, or Ba (霸)\n\nTraditionally, the Five Overlords of Spring and Autumn Period (春秋五霸 Chūn Qiū Wǔ Bà) include:\n\nDuke Huan of Qi (齐桓公)\n\nDuke Wen of Jin (晋文公)\n\nKing Zhuang of Chu (楚莊王)\n\nDuke Mu of Qin (秦穆公)\n\nDuke Xiang of Song (宋襄公)\n\nWhile some other historians suggest that the Five Overlords include:\n\nDuke Huan of Qi (齐桓公)\n\nDuke Wen of Jin (晋文公)\n\nKing Zhuang of Chu (楚庄王)\n\nKing Fu Chai of Wu (吴王夫差)\n\nKing Gou Jian of Yue (越王勾踐)\n\nList of prominent states\n\nThe name following the name of the state is the capital (En., TC. and SC.).\n\nQi (state) 齐 - Linzi 臨淄 临淄 Chu (state) 楚 - Ying 郢 郢 Qin (state) 秦 - Xianyang 咸陽 咸阳 Jin (state) 晉 Lu (state) 鲁 - Qufu 曲阜 曲阜 Chen (state) 陈; - Wanqiu 宛丘; 宛丘 Cai (state) 蔡 - Shangcai 上蔡 上蔡 Cao (state) 曹 Song (state) 宋 - Shangqiu 商丘 商丘 Wei (Spring and Autumn state) 卫 Wu (state) 吴 - Gusu 姑蘇 姑苏 Yue (state) 越 - Kuaiji 會稽 会稽 Hua (state) 滑 Zheng (state) 郑 - Xinzheng 新鄭 Yan (state) 燕\n\nImportant figures of the Spring and AutumnPeriod\n\nGuan Zhong (管仲), statesman and advisor of Duke Huan of Qi and regarded by some modern scholars as the first Legalist. Baili Xi (百里奚), famous prime minister of Qin. Bo Pi, （伯噽）the corrupted bureaucrat under King He Lu and played important diplomatic role of Wu-Yue relations. Wen Zhong文種 and Fan Li范蠡, the two advisors and partisans of King Gou Jian of his rally against Wu. Zi Chan, （子产）leader of self-strengthening movements in Zheng Confucius（孔子）, leading figure in Confucianism the editor of Spring and Autumn Annals (春秋) Laozi （老子）or Lao tse, founder of Daoism Mozi, known as Motse (墨子 Mò Zǐ) or \"Mocius\" (also \"Micius\") to Western scholars, founder of Mohism and engineer Lu Ban（鲁班）- engineer Ou Ye Zi, literally means Ou the wielder – Swordmaker and mentor of the couple Gan Jiang and Mo Ye Fan Li - Entrepreneur Rang Ju, elder contemporary and possibly mentor of Sun Tzu, （孙子）the author of The Art of War\n\n\n\n\n\nSee also: Hundred Schools of Thought\n\nList of important events\n\n770 B.C.E. - the nobilities of the Zhou realm supported King Píng of Zhou (周平王) as the new king of the Zhou Dynasty. King Píng moved the capital to luò yì (雒邑). The era of Eastern Zhou, or Spring Autumn, began. King Píng appointed the son of the nobility Yíng Qí (贏其) to the northwestern part of the Zhou realm. He was named Duke Xiāng of Qin (秦襄公). The kingdom of Qin (秦) was born.\n\n763 B.C.E. - Duke Zhuang of Zheng (郑庄公) attacked and destroyed the barbarian kingdom of hú (胡國). Duke Zhuang relied on his famous officer Zhài Zhòng (祭仲).\n\n750 B.C.E. - Duke Wén of Jin (晉文侯), Jī Chóu (姬仇), attached and destroyed the kingdom of Yú Chén Zhou (余臣周)\n\n704 B.C.E. - Duke of Chǔ (楚), Mǐ Xióng Tōng (羋熊通), saw the weakened power of the King of Zhou as an opportunity to break free from being a tributary state of the Zhou Dynasty and claimed the title of king himself. He announced the kingdom of Chǔ (楚國) and called himself King Wu of Chu (楚武王).\n\n701 B.C.E. - Duke Zhuang of Zheng (鄭莊公) died. His son Jī Hū (姬忽) succeeded the title of Duke and was known as Duke Zhāo of Zheng (鄭昭公). Because Lady Yōng (雍氏) of Song (宋國) was married to Duke Zhuang of Zheng and had a son named Ji Tū (姬突), the King of Song thought that he could extend influence in Zheng by helping to support a new ruler who had relations with Song. Zhài Zhòng (祭仲), who had the respect and influence in the state of Zheng, was lured and captured by Song and was forced to support Jī Tū as the successor to the throne.\n\nReferences ISBN links support NWE through referral fees\n\nAll links retrieved February 8, 2023."}, {"url": "https://www.chinahighlights.com/travelguide/chinese-history/spring-and-autumn-period.htm", "page_content": "Ancient Chinese Musical Instruments. Ancient Chinese Musical Instruments.\n\nThe 800-year period of the Zhou Dynasty (1045–221) is divided into three periods of time called the Western Zhou Period (1045–770), the Spring and Autumn Period (770–476), and the Warring States Period (475–221).\n\nThe Spring and Autumn Period was a fertile time for the emergence of key philosophies, schools of thought, and religious ideas as small states expanded, peacefully coexisted, and fought wars.\n\nHistory of the Spring and Autumn Period\n\nIn 771 BC, after King You of Zhou replaced his wife with a concubine, the capital was attacked by his wife's father who ruled a region called Shen and by a nomadic tribe called the Quanrong.\n\nThe rulers of several of the regions in the empire proclaimed the queen's son, who was named Ji Yijiu, to be the new king.\n\nThe capital was moved eastward in 770 BC from Haojing in Xi'an to Luoyang in present-day Henan Province (marking the start of the Eastern Zhou Dynasty of 770–221 BC). The sack of the king and the change of capital marked the end of the rule of the Ji clan over the whole region.\n\nAfter 771, the Zhou Dynasty became the nominal leading clan.\n\n\n\n\n\nEarly Spring and Autumn Period\n\nLongmen Grottoes in Luoyang. Longmen Grottoes in Luoyang.\n\nThe Spring and Autumn Period was the beginning of the Eastern Zhou era.\n\nDuring this period, the Zhou empire reached the Yangtze River, and it was basically centered on the eastern part of the Yellow River (see our Eastern Zhou Map). The first king to rule in the eastern capital, Luoyang, was said to be King Ping.\n\nThe Zhou kings ruled as figureheads. Although the dynastic clan did have a small territory of their own at Luoyang, their territory was too small to raise an army. They depended on the surrounding regions fortheir defense. They performed religious ceremonies.\n\nPolitical Organization\n\nThe whole Zhou empire was basically centered on the eastern part of the Yellow River. The territory was divided into many fiefdoms and kingdoms.\n\nThe political structure of the dozens of states at the beginning of the era was fairly loose. Representatives of the most powerful states and the weaker states held a council to discuss common treaties or other problems.\n\nSometimes, the leader of a powerful state would be recognized as the hegemon during a time of crisis or war. During this time, the states on the frontier, such as Qin, grew stronger since they had more room for expansion. There was a lot of rivalry and wars.\n\nMajor Events of the Spring and Autumn Period\n\nThe Zhou emperors were ceremonial figureheads although they did have a small amount of territory of their own at Luoyang.\n\nTheir territory was too small to raise an army of their own that was big enough to defend them. They depended on the surrounding regions, and they performed religious ceremonies.\n\nThey were perhaps like the modern British royalty except that the populace believed they had real powers as representatives of heaven as gods.\n\nDuring the approximately 300 years of the Spring and Autumn Period, many small fiefdoms and states slowly coalesced through conquest.\n\nThere was a lot of rivalry and wars. In about 550 BC, there were four major powers:Qin in the west, Jin in the center, Chu in the south, and Qi in the east.\n\nIn 497, the nobles in Jin began a civil war. In 453, there were only four major regions in Jin, and in that year the three weaker clans destroyed the stronger, leaving only Han, Wei, and Zhao. In 403, they divided the Jin state between themselves.\n\nThis action left eight states in the former Zhou empire region: Han, Wei, Zhao, Qin, Chu, Yue, Qi, and Yan near modern-day Beijing.\n\nLate Spring and Autumn Period\n\n481 BC was the end of the Spring and Autumn Period according to the Spring and Autumn Annals. The start of the reigning period for King Yuan of Zhou, 475 BC, is the generally accepted date. 403 BC was when the Jin state officially splitinto Zhao, Wei, and Han.\n\nThe Partition of Jin (455–403 BC)\n\nThe Jin state was a major state in central northern China during the middle part of the Zhou Dynasty but the Jin duke lost power to his nobles.\n\nThe Philosophy and Religion\n\nThe Spring and Autumn Period was known as the time of the \"Hundred Schools of Thought\". During the beginning and middle parts of the era, the existence of many small states and fiefdoms with their own languages，tribal and cultural backgrounds allowed many schools of thought to exist simultaneously.\n\nSince there was some level of peace, people could discuss and teach their ideas freely. The Spring and Autumn Period was a fertile time for the development of philosophy and religion.Major philosophies emerged that were passed to later empires: Legalism, Confucianism, and Taoism.\n\nOther major schools of thought, such as Mohism, Buddhism, and others that we don't know anything about, were not passed down to later empires.\n\nConfucianism\n\nConfucius Statue. Confucius Statue.\n\nConfucianism was probably the first major school to emerge of the three remaining dominant schools.\n\nConfucius was perhaps the first major philosopher whose teachings survived and became widely accepted in this era.\n\nIn the Analects, a book of his pithy sayings, it is recorded that he said he didn't invent any of his philosophy. He was only transmitting the ancient teachings to his disciples. He wanted them to read the ancient texts.\n\nHe said he wanted to restore and teach the doctrine of the Mandate of Heaven. This important belief of his political philosophy was that Heaven would choose a person and his clan to rule. He mixed his theology with his ideas of politics.\n\nHe encouraged everybody to behave as they should in whatever role they had in their society. He said that if they did so, there would be harmony, prosperity, and happiness.\n\nLegalism\n\nLegalist ideas were not accepted everywhere. A major antithetical philosophy was later developed by court rulers in Qin after Shang Yang (390–338) came to power.\n\nThis teaching justified subservience to the emperor and total war. A centralized bureaucracy was emphasized and the people were used for large construction projects to strengthen the empire.\n\nLegalism taught that people's primary role in life was to obey the rule of emperors, and so they did away with familial relationships, freedoms, and accepted cultural ethics throughout their domain.\n\nDaoist-Type Philosophy\n\nDao De Jing. Dao De Jing.\n\nAnother major school that became a basis for post-religion is called Daoism. The first teacher was said to be Laozi (老子). People differ about whether he was born during the Spring and Autumn Period or afterwards.\n\nIt is said that Laozi wrote the Dao De Jing (道德经) but historians debate about whether he actually wrote the text, when Laozi lived, and whether he was a real historical person.\n\nMost people place him as a contemporary of the philosopher Confucius. They say he lived around 450 or 600 BC. Others say that he lived in about 380 BC.\n\nIt is thought that another influential Daoist philosopher,named Zhuangzi (庄子), wrote the Zhuangzi.\n\nIt is said that Daoism wasn't thought of as a systematic school of philosophy and religion until the Han Dynasty. In the Han era, the Dao De Jing was considered to be the main Taoist scripture and the Zhuangzi was a secondary scripture.\n\nTours of Spring and Autumn Period Sites\n\nMany Spring and Autumn Period sites are in Luoyang. An important Zhou Dynasty site is the Museum of the Zhou Imperial Carriages where you can tour the archaeological excavations and see the artifacts. Visit Luoyang with our Luoyang tours.\n\nMost of the discovered historical relics from the Zhou Dynasty are displayed at Shaanxi History Museum in Xi'an. China Highlight's tours of Xi'an, almost without exception, include a visit to the museum."}, {"url": "https://www.chinahighlights.com/travelguide/china-history/spring-and-autumn-period.htm", "page_content": "Ancient Chinese Musical Instruments. Ancient Chinese Musical Instruments.\n\nThe 800-year period of the Zhou Dynasty (1045–221) is divided into three periods of time called the Western Zhou Period (1045–770), the Spring and Autumn Period (770–476), and the Warring States Period (475–221).\n\nThe Spring and Autumn Period was a fertile time for the emergence of key philosophies, schools of thought, and religious ideas as small states expanded, peacefully coexisted, and fought wars.\n\nHistory of the Spring and Autumn Period\n\nIn 771 BC, after King You of Zhou replaced his wife with a concubine, the capital was attacked by his wife's father who ruled a region called Shen and by a nomadic tribe called the Quanrong.\n\nThe rulers of several of the regions in the empire proclaimed the queen's son, who was named Ji Yijiu, to be the new king.\n\nThe capital was moved eastward in 770 BC from Haojing in Xi'an to Luoyang in present-day Henan Province (marking the start of the Eastern Zhou Dynasty of 770–221 BC). The sack of the king and the change of capital marked the end of the rule of the Ji clan over the whole region.\n\nAfter 771, the Zhou Dynasty became the nominal leading clan.\n\n\n\n\n\nEarly Spring and Autumn Period\n\nLongmen Grottoes in Luoyang. Longmen Grottoes in Luoyang.\n\nThe Spring and Autumn Period was the beginning of the Eastern Zhou era.\n\nDuring this period, the Zhou empire reached the Yangtze River, and it was basically centered on the eastern part of the Yellow River (see our Eastern Zhou Map). The first king to rule in the eastern capital, Luoyang, was said to be King Ping.\n\nThe Zhou kings ruled as figureheads. Although the dynastic clan did have a small territory of their own at Luoyang, their territory was too small to raise an army. They depended on the surrounding regions fortheir defense. They performed religious ceremonies.\n\nPolitical Organization\n\nThe whole Zhou empire was basically centered on the eastern part of the Yellow River. The territory was divided into many fiefdoms and kingdoms.\n\nThe political structure of the dozens of states at the beginning of the era was fairly loose. Representatives of the most powerful states and the weaker states held a council to discuss common treaties or other problems.\n\nSometimes, the leader of a powerful state would be recognized as the hegemon during a time of crisis or war. During this time, the states on the frontier, such as Qin, grew stronger since they had more room for expansion. There was a lot of rivalry and wars.\n\nMajor Events of the Spring and Autumn Period\n\nThe Zhou emperors were ceremonial figureheads although they did have a small amount of territory of their own at Luoyang.\n\nTheir territory was too small to raise an army of their own that was big enough to defend them. They depended on the surrounding regions, and they performed religious ceremonies.\n\nThey were perhaps like the modern British royalty except that the populace believed they had real powers as representatives of heaven as gods.\n\nDuring the approximately 300 years of the Spring and Autumn Period, many small fiefdoms and states slowly coalesced through conquest.\n\nThere was a lot of rivalry and wars. In about 550 BC, there were four major powers: Qin in the west, Jin in the center, Chu in the south, and Qi in the east.\n\nIn 497, the nobles in Jin began a civil war. In 453, there were only four major regions in Jin, and in that year the three weaker clans destroyed the stronger, leaving only Han, Wei, and Zhao. In 403, they divided the Jin state between themselves.\n\nThis action left eight states in the former Zhou empire region: Han, Wei, Zhao, Qin, Chu, Yue, Qi, and Yan near modern-day Beijing.\n\nLate Spring and Autumn Period\n\n481 BC was the end of the Spring and Autumn Period according to the Spring and Autumn Annals. The start of the reigning period for King Yuan of Zhou, 475 BC, is the generally accepted date. 403 BC was when the Jin state officially splitinto Zhao, Wei, and Han.\n\nThe Partition of Jin (455–403 BC)\n\nThe Jin state was a major state in central northern China during the middle part of the Zhou Dynasty but the Jin duke lost power to his nobles.\n\nThe Philosophy and Religion\n\nThe Spring and Autumn Period was known as the time of the \"Hundred Schools of Thought\". During the beginning and middle parts of the era, the existence of many small states and fiefdoms with their own languages，tribal and cultural backgrounds allowed many schools of thought to exist simultaneously.\n\nSince there was some level of peace, people could discuss and teach their ideas freely. The Spring and Autumn Period was a fertile time for the development of philosophy and religion.Major philosophies emerged that were passed to later empires: Legalism, Confucianism, and Taoism.\n\nOther major schools of thought, such as Mohism, Buddhism, and others that we don't know anything about, were not passed down to later empires.\n\nConfucianism\n\nConfucius Statue. Confucius Statue.\n\nConfucianism was probably the first major school to emerge of the three remaining dominant schools.\n\nConfucius was perhaps the first major philosopher whose teachings survived and became widely accepted in this era.\n\nIn the Analects, a book of his pithy sayings, it is recorded that he said he didn't invent any of his philosophy. He was only transmitting the ancient teachings to his disciples. He wanted them to read the ancient texts.\n\nHe said he wanted to restore and teach the doctrine of the Mandate of Heaven. This important belief of his political philosophy was that Heaven would choose a person and his clan to rule. He mixed his theology with his ideas of politics.\n\nHe encouraged everybody to behave as they should in whatever role they had in their society. He said that if they did so, there would be harmony, prosperity, and happiness.\n\nLegalism\n\nLegalist ideas were not accepted everywhere. A major antithetical philosophy was later developed by court rulers in Qin after Shang Yang (390–338) came to power.\n\nThis teaching justified subservience to the emperor and total war. A centralized bureaucracy was emphasized and the people were used for large construction projects to strengthen the empire.\n\nLegalism taught that people's primary role in life was to obey the rule of emperors, and so they did away with familial relationships, freedoms, and accepted cultural ethics throughout their domain.\n\nDaoist-Type Philosophy\n\nDao De Jing. Dao De Jing.\n\nAnother major school that became a basis for post-religion is called Daoism. The first teacher was said to be Laozi (老子). People differ about whether he was born during the Spring and Autumn Period or afterwards.\n\nIt is said that Laozi wrote the Dao De Jing (道德经) but historians debate about whether he actually wrote the text, when Laozi lived, and whether he was a real historical person.\n\nMost people place him as a contemporary of the philosopher Confucius. They say he lived around 450 or 600 BC. Others say that he lived in about 380 BC.\n\nIt is thought that another influential Daoist philosopher,named Zhuangzi (庄子), wrote the Zhuangzi.\n\nIt is said that Daoism wasn't thought of as a systematic school of philosophy and religion until the Han Dynasty. In the Han era, the Dao De Jing was considered to be the main Taoist scripture and the Zhuangzi was a secondary scripture.\n\nTours of Spring and Autumn Period Sites\n\nMany Spring and Autumn Period sites are in Luoyang. An important Zhou Dynasty site is the Museum of the Zhou Imperial Carriages where you can tour the archaeological excavations and see the artifacts. Visit Luoyang with our Luoyang tours.\n\nMost of the discovered historical relics from the Zhou Dynasty are displayed at Shaanxi History Museum in Xi'an. China Highlight's tours of Xi'an, almost without exception, include a visit to the museum.\n\nRelated Articles"}, {"url": "https://www.visiontimes.com/2021/07/12/a-forgiving-nature-is-always-rewarded.html", "page_content": "King Zhuang of Chu (楚莊王) was one of the Five Hegemons of the Spring and Autumn Period (春秋五霸, 770-476 B.C.), and the most accomplished monarch of Chu.\n\nAt a celebration after the suppression of a rebellion, King Zhuang and his ministers drank to their heart’s content. King Zhuang had his concubine Xu Ji toast the ministers. In the evening, he ordered the court to light candles, and the singing and dancing continued.\n\nSuddenly a gust of wind blew out the candles. In the darkness, one of the drunken courtiers pulled on Xu Ji’s clothing. In those days, no men were allowed in the palace unless they were castrated. Assaulting a concubine in this way was a serious offence. She pulled the tassel off of the courtier’s hat and asked King Zhuang to deal with him. King Zhuang not only did not do anything about it but also said loudly that everyone should take their tassels off, relax and enjoy. After all the ministers had taken off their tassels, King Zhuang ordered the candles to be relit.\n\nXu Ji was both surprised and angry. When the banquet was over, she complained to the king. He replied, “It is excusable to be careless after drinking. If I were to condemn a minister to death over something like this, it would chill the hearts of other ministers, and they would not be able to do their best to defend the country.” Nodding, Xu Ji listened, and agreed.\n\nThe minister was undoubtedly at fault for his drunken demeanor, but King Zhuang showed breadth of mind in the way he handled the incident. In time, he was repaid for his kindness.\n\nWhen King Zhuang was leading his troops to attack the state of Zheng, he was ambushed, and in a critical situation. Tang Cui, the vice general of the Chu army, single-handedly rushed into the enemy lines and rescued King Zhuang from the chaos. The King of Chu was very grateful and wanted to reward him. Then Tang Cui told him that he was the one who had pulled on Xu Ji’s clothes at “the feast of the tassels.”\n\nLater on, the story of “the Feast of the Tassels (絕纓之宴 Jué yīng zhī yàn)” was used as an allusion to treating people with generosity.\n\nTolerance does not mean giving up one’s dignity; tolerance is the use of wisdom and virtue to treat others kindly."}, {"url": "https://www.liquisearch.com/king_zhuang_of_chu", "page_content": "King Zhuāng of Chǔ (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao Chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally \"Amazing with one cry\")."}, {"url": "http://english.cssn.cn/focus/culture/202203/t20220324_5400428.shtml", "page_content": "Ideal of feminine beauty evolved in ancient China\n\nAuthor : SUN XIAO Source : Chinese Social Sciences Today 2022-03-24\n\nOver the years, there have been many studies on the evolution of the idealized images of ancient Chinese women. In archives, Zhao Feiyan [empress to Emperor Cheng of Han, who was said to be so slender and agile in dance that she was like a flying swallow] is often depicted as “skinny, petite, and delicate,” while Yang Yuhuan [719–756, the beloved consort of Emperor Xuanzong of Tang during his later years, and known as one of the Four Beauties of ancient China] is portrayed as “fair, plump, and charming.” The two seem to have been widely recognized as representing the ideal of feminine beauty in the Han (206 BCE–220 CE) and Tang (618–907) dynasties, respectively. However, this “consensus” is inconsistent with historical facts, and the reasons are worth considering.\n\n‘Slim for beauty’ in the Han era\n\nZhao Feiyan was often depicted as light as a swallow in ancient documents. After the great Song Dynasty scholar Su Shi wrote a poem contrasting Zhao Feiyan’s thin build with Yang Yuhuan’s full build, the idiom huanfei yanshou (lit. plump Yuhuan and slim Feiyan) soon became popular. It was said that during the Spring and Autumn Period (770–476 BCE), King Ling of Chu (r. 540–529 BCE) favored people with tiny waists. So, there was a saying: “The King of Chu loved a narrow waist, so many people at court starved themselves to death.” Liu Bang (r. 206–195 BCE), the founder of the Han Dynasty, was a native of Chu. In the early days of the Han Empire, most of the nobles at the court were also from the Chu state. The slim-waisted female images can also be seen in the stone reliefs and the unearthed terracotta dancing figures of the Han Dynasty. Therefore, the belief that the Han people preferred women to be slim has been further supported by historical texts and cultural relics, and people are deeply convinced of it. However, this inference is highly questionable.\n\nThe saying that King Ling of Chu favored people with a slim waist was originally a pre-Qin (before 221 BCE) anecdote, which referred to men with tiny waists rather than women. It was probably after the Han Dynasty that people began assuming that the Chu King adored women with narrow waists. When it came to the Wei, Jin, and Southern and Northern Dynasties (220–589), a slim waist had been generally accepted as another name for beauty. Therefore, a tiny waist might not have represented women’s idealized build in Chu culture.\n\nAlthough a narrow waist didn’t originally represent beauties in the Chu state, there were depictions of petite women in Chu culture. At that time, such a beauty standard was quite different from those of the Central Plain states in Northern China, where tall and fit women were more adored. The significant differences in beauty standards between the south and north in ancient China were based on the differences in average height between the north and the south, and the same is true today. The question is, did the Han Dynasty culture adopt the Chu fashion that preferred a more delicate figure? In the power struggle for supremacy over China, Liu Bang defeated Xiang Yu with help from his supporters who came from Liu’s hometown, Pei County, and neighboring Feng County [both in present day Jiangsu Province]. The Feng-Pei area belonged to the Chu territory before the Qin Dynasty (221–207 BCE). Though influenced by the Chu culture, this area was still dominated by the Central Plain culture. Meanwhile, stone reliefs and unearthed terracotta dancing figures of the Han Dynasty don’t provide enough evidence to prove the Han Dynasty preferred a slim figure. Most terracotta dancing figures were slim, perhaps because a slender build is the basic requirement for a dancer.\n\nIn summery, we cannot draw the conclusion that women with a slim build were adored in the Han Dynasty; nor can we prove it with unearthed materials. So, what was the beauty standard in the Han Dynasty? In fact, ancient texts have already answered this question. While portraying the Chu beauties as slim with tiny waists in his poem titled “Dazhao” (“Grand Requiem”), the Chu poet Qu Yuan (c. 340–278 BCE) also stressed that these beauties were curvy and well-developed, which coincides with the Western Han poet Sima Xiangru’s illustration of beauties in his prose, and the Eastern Han (25–220) scholar Wang Can’s imagination of Zhao Feiyan. Regarding Zhao Feiyan’s figure, it makes sense that she was slim and agile since she often practiced singing and dancing.\n\nThe ideal female body shape did change somewhat during the Wei, Jin, and Southern and Northern Dynasties, especially in the Southern Dynasties (420–589), when the upper-class literati adored women who appeared delicate and fragile, as “a pliant willow swaying in the wind.” The exaggeration that Zhao Feiyan could even dance in the palm of one’s hand originated from Jin Dynasty (266–420) texts. The desirable female body shape of the Wei, Jin era has been testified by the terracotta figures and grotto statues unearthed in recent years. The graceful and slim figure of a female Buddhist donor painted in Cave 285 at the Mogao Grottoes in Dunhuang, which dates to the Western Wei period (535–557), well illustrates the painter’s understanding of the feminine beauty ideal.\n\n‘Plump for beauty’ in the Tang era\n\nThe view that the Tang adored women with a full build also originated from Su Shi’s poem. It seems difficult to find evidence of “plump for beauty” in the Tang Dynasty from ancient texts. In fact, people in the early Tang era still followed the Wei, Jin aesthetic criterion, which preferred women to be slender.\n\nThe reason why people believe that the Tang adored slightly overweight women is as follows. In Tang Dynasty paintings, women were often portrayed with round faces and voluptuous figures. Among the Tang terracotta figurines unearthed in recent years, many are characterized by plump figures. Another reason lies in the general understanding of Yang Yuhuan’s image.\n\nFrom an archaeological perspective, the female images found in the Tang Dynasty tombs can be roughly divided into five categories: (1) rigid and thin; (2) fairly tall and well-proportioned; (3) curvy and plump; (4) stout and chubby; (5) frail and skinny. Study shows that the first two types mostly appeared before the reign of Wu Zetian [the only legitimate female sovereign in the history of China, ruling from 690 to 705]. The third was more common between the reign of Wu Zetian and the Kaiyuan Era (713–741). The fourth was popular from the An Lushan Rebellion (755–763) to the reign of Emperor Daizong (r. 762–779), and the fifth was often seen in the late Tang Dynasty. Perhaps due to the reign of Wu Zetian, idealized feminine beauty featuring a plump build started to emerge during the Tang era. The plump fashion continued for quite a period of time even after the reign of Wu Zetian.\n\nToday’s explanations for “plump for beauty” in the Tang Dynasty mostly rely on the views of Chen Yinke [a renowned Chinese historian, 1890–1969]: the Tang imperial family had a northern nomad pedigree. Nomads travelled from place to place, and preferred to be big and strong. Hence, it was natural for the Tang people to adore plump figures. However, such a view cannot explain why the early Tang Dynasty still preferred slim figures. In fact, the “plump for beauty” fashion had much to do with Wu Zetian’s reign. After Wu rose to power, with their social status being greatly improved, women were liberated in many aspects.\n\nThe Song stereotypes\n\nThe view that the ideal female body shape shifted from “slim” in the Han to “plump” in the Tang was actually formed during the Song Dynasty (960–1279). Just as the Han Dynasty, the Song were also dominated by Confucianism. The Song literati adored fragile beauty, and they believed that people in the Han era had the same taste. However, the Song culture had neither the Han’s grandeur nor the Tang’s tolerance. The Song had always been under the threat of nomads, and were unable to eradicate these threats, so people at that time were intolerant of nomadic cultures. The Song artists often portrayed women with narrow shoulders, thin waists, and a sense of frailty. Scholar-officials’ sense of superiority was greatly satiated by portraying women’s delicate and fragile beauty.\n\nWhen discussing the evolution of idealized feminine beauty in ancient China, the physical differences of people between north and south China are worth noting. Generally speaking, southerners are thinner and shorter than northerners, which definitely affects their aesthetic criterion. Additionally, people’s aesthetic views vary, and each individual’s standards of beauty can be quite different. Physical differences in the body shape of ancient people over time should also be considered. Anthropologists find that from 6,000 years ago to 300 or 400 years ago, the average height of ancient Chinese adult males was 1.65-1.67 meters, and the average height of ancient adult women was 1.54-1.56 meters, with people in the Qin and Han period tending to be slightly taller, and the Song slightly shorter.\n\n“Slim for beauty” in the Han and “plump for beauty” in the Tang was the imagination of the Song people. Interestingly, the Song preference for “slim and frail” was similar to that of the Jin Dynasty. As in the late Song, the country fell into fragmentation situation during the Wei and Jin periods. It seems that under the same historical background, scholar-officials of both the Wei and Jin eras and the Song Dynasty tended to boost their egos in the same way.\n\nSun Xiao is the director of the National Centre of Chinese Traditional Culture."}, {"url": "https://link.springer.com/article/10.1007/s10503-020-09527-x", "page_content": "4.1 A Case of Political Argumentation by Reciting Poems\n\nWith the preliminary knowledge about cultural background being laid out, in this section we are going to focus our attention on the political argumentation by reciting poems. We will follow the procedure to analyze a case of this kind of argumentation. From step 2 (of localized procedure), the case to be analyzed is introduced in detail in Sect. 4.1. As stipulated by step 3, the rules governing argumentation are recognized in Sects. 4.2–4.4. In Sect. 4.5, we follow step 4 to justify the rules discovered in the last step. Through steps 1–4, we can find out locally rational rules and demonstrate how this procedure works. In Sect. 4.6, we will test the argumentative rules with a new case briefly (step 5). Now we will present a particular case.\n\n①In autumn, in the 7th month, the marquis of Qi and the earl of Zheng went to Jin in the interest of the Duke Xian of Wei. Duke Ping of Jin entertained them at the same time, and recited the Jia Le (Kew loh). ②Guo Jing-zi was in attendance on the marquis of Qi, and recited the Lu Xiao (Luh seaou).③ Zizhan was in attendance on the earl of Zheng, and recited the Zi Yi (Tsze-e). ④Shuxiang instructed Duke Ping to acknowledge [the compliment paid by] the two princes, and then said, “My ruler ventures to thank the ruler of Qi for the rest which he secures to the ancestral tablets of our former princes. He ventures also to thank the ruler of Zheng for his unswerving adherence.” ⑤Guo Jing-zi makes Yan Ping-zhong say privately to Shuxiang, “The ruler of Jin displays his brilliant virtue to the States, compassionating their distresses, repairing their defects, correcting their errors, and relieving their troubles. In this way he is the lord of covenants; but how is it that he has now in the behalf of a subject seized the ruler?” Shuxiang told this to Zhao Wen-zi, who reported it to Duke Ping. ⑥Duke Ping explained to him the offence of Duke Xian of Wei, and made Shuxiang inform the two princes of it. ⑦Guo Jing-zi on this recited the Pei Zhi Rou Yi (Pe che jow), and ⑧Zizhan recited the Qiang Zhong Zi Xi (Tseang Chung-tsze he). ⑨After this Duke Ping granted the return of Duke Xian to Wei. (Adapted from the Zuo Zhuan, Duke Xiang 26th year, Legge 1991a, p. 525)Footnote 7\n\nBefore analyzing the text move by move, let’s see the social setting of the case. In Duke Xiang 14th year (559 BC), Duke Xian of Wei (ruler of the state of Wei) had been banished by Sun Lin-fu and Ning Hui-zi, two of his cabinet officials, and later they (the latter two) enthroned marquis Shang in the same year. In Duke Xiang 26th year (547 BC), Ning Xi, son of Ning Hui-zi, killed marquis Shang and attacked Sun clan and succeeded in restoring Duke Xian to power in Wei. Sun Lin-fu, who had surrendered himself to Duke Ping of Jin, the leader of the alliance, requested Jin to come to his rescue. Jin went to help Sun Lin-fu. In its military campaign against Sun, Wei killed three hundred soldiers. This irritated Jin and Jin gathered all the member states of the alliance to discuss a military campaign against Wei. Duke Xian went to Jin to seek a peace deal but was detained by Jin. The marquis of Qi and the earl of Zheng hurried to Jin to request the release of Duke Xian.\n\nFor convenience of analysis, we put numbers ①–⑨ before each move of argumentative exchange and divide them into three rounds. Round one includes ①–④, round two ⑤–⑥ and round three ⑦–⑨. Besides, we adopt a simplified upper capitals with numerals to designate characters involved in the case. All the characters are to be divided into two argumentative parties: J party and W party. Here it is:\n\nJ Party: J 11 (Duke Ping); J 12 (Zhao Wen-zi); J 13 (Shuxiang)\n\nW Party: W 11 (marquis of Qi); W 12 (Guo Jing-zi); W 13 (Yan Ping-zhong) W 21 (the earl of Zheng); W 22 (Zizhan)\n\n4.2 Round One\n\n①In autumn, in the 7th month, the marquis of Qi (W 11 ) and the earl of Zheng (W 21 ) went to Jin in the interest of the Duke Xian of Wei. Duke Ping of Jin entertained them at the same time, and recited the Jia Le.\n\nW 11 and W 21 (members) went to Jin in order to seek the release of Duke Xian. Having known the purpose of their visit (Zeng 1993, p. 279), J 11 (the leader) feasted the two visiting noblemen with a banquet. In this context, there arose a demand for J 11 to carry out the welcome (function) and this welcome was carried out by way of reciting Jia Le. This poem has four stanzas and previous studies have shown that J 11 took meaning of the first stanza of the poem (Zeng 1993, pp. 119–120, 279):\n\nOf [our] admirable, amiable, sovereign (假乐君子)\n\nMost illustrious is the excellent virtue (显显令德).\n\nHe orders rightly the people, orders rightly the officers (宜民宜人)\n\nAnd receives his dignity from heaven (受禄于天)\n\nWhich protects and helps him, and [confirms] his appointment (保右命之)\n\nBy repeated acts of renewal from heaven (自天申之). (Legge 1991b, p. 481)\n\nThis piece of discourse is being used to speak highly of the sovereign, or to perform “praise” (function). In this particular context of the banquet, J 11 (the leader) compared the two noblemen to the sovereign in the poem so as to compliment them. By doing so, this stanza is intended to be a welcome to W party. In this move, the function rule of ① is: in the context of an official meeting (at a banquet) between members and the leader of an alliance, the leader is supposed to welcome the visitors; the expression rule of ① is: in the context of an official meeting (at a banquet) between members and the leader of an alliance, reciting a poem with complimentary content can be used to realize the function of welcome.\n\n②Guo Jing-zi (W 12 ) was in attendance on the marquis of Qi (W 11 ), and recited the Lu Xiao.\n\nAfter J party’s recitation, W 12 understood the poem by the first stanza and took it as a welcome. Having received the welcome, in return W 12 (the member) expressed his gratitude (function) for the welcome and further made a request (function) for the release of Duke Xian since this was the purpose of visit. This was performed by W 12 ’s reciting Lu Xiao. The poem has four stanzas and previous studies found that the meaning of the first stanza of the poem was taken (Zeng 1993, pp. 276–277, 279):\n\nHow long grows the southernwood (蓼彼萧斯),\n\nWith the dew lying on it so bright (零露湑兮)!\n\nNow that I see my noble men (既见君子),\n\nMy heart is entirely satisfied (我心写兮).\n\nAs we feast, we laugh and talk (燕笑语兮);\n\nIt is right he should have fame and prosperity!(是以有誉处兮) (Legge 1991b, p. 274)\n\nThis stanza begins with a depiction of southernwood, capturing the moment when the dew was lying in the southernwood. With the nurturing from the dew, the southernwood grows long! In this particular context that a welcome from J 11 (the leader) had been extended, the members of an alliance benefit from the grace of the alliance leader just like growth of the southernwood benefits from the nurturing of the dew. Since for W party, the purpose was to seek the release of Duke Xian and the latter was also one of the members, therefore, the grace of J 11 should likewise reach him, thus proffering a request (Zeng 1993, p. 279). The context comprehension rule of ② is: at the banquet, alliance members could choose the first stanza for understanding in relation to the poem recited by the alliance leader; the function rule of ② is: in the context that a welcome is initiated by way of reciting a poem by the leader at a banquet, and considering the purpose of visit, the members could choose to express thanks as a response; the function of request could be indirectly performed; the expression rule of ② is: in the context that a welcome is initiated by way of reciting a poem by the leader at a banquet, and considering the purpose of visit, reciting a poem with appreciative content can be used to realize the function of thanking and indirect request.\n\n③Zizhan (W 22 ) was in attendance on the earl of Zheng (W 21 ), and recited the Zi Yi.\n\nAfter J party’s recitation, W 22 (the member) understood the poem by the first stanza and took it as a welcome as W 12 did. Having received the welcome and followed W 12 , in reply to J 11 (the leader),W 22 expressed his loyalty (function) to Jin and further made a request (function) for the release of Duke Xian since this was the purpose of visit. These two functions were realized through W 22 reciting Zi Yi. This poem has three stanzas and former studies have found that the meaning of the first stanza was employed (Zeng 1993, pp. 277, 279):\n\nHow well do the black robes befit you (缁衣之宜兮)!\n\nWhen worn out, we will make others for you (敝,予又改为兮).\n\nWe will go to your court (适子之馆兮),\n\nAnd when we return [from it], we will send you a feast (还,予授子之粲兮)! (Legge 1991b, p. 124)\n\nThis stanza describes the devotion and loyalty of a wife to her husband. In this particular context that a welcome from J 11 had been extended, W 22 adopted this meaning of the poem to express the members’ loyalty to Jin by comparing their loyalty to that of a wife to her husband. Since for W party, the purpose was to seek the release of Duke Xian, and the latter, being among the members, was also loyal, therefore W 22 intended to make a request for the release of the detainee. In this move, the context comprehension rule of ③ is: at the banquet, alliance members could choose the first stanza for understanding in relation to the poem recited by the alliance leader; the function rule of ③ is: in the context that a welcome is initiated by way of reciting a poem by the leader at the banquet, and considering the purpose of visit, the members could choose to declare loyalty to the leader and thus make a request; the expression rule of ③ is: in the context that a welcome is initiated by way of reciting a poem by the leader at the banquet, and considering the purpose of visit, the members could recite a poem with loyalty-expressing content to declare loyalty and make an indirect request.\n\n④Shuxiang (J 13 ) instructed Duke Ping (J 11 ) to acknowledge [the compliment paid by] the two princes, and then said, “My ruler ventures to thank the ruler of Qi for the rest which he secures to the ancestral tablets of our former princes. He ventures also to thank the ruler of Zheng for his unswerving adherence”.\n\nAfter W 12 and W 22 recited Lu Xiao and Zi Yi respectively, considering these poems being used as responses to Jia Le recited by J 11 together with the purpose of visit, J party took what had been expressed in the first stanzas of the recited poems as requesting the release of Duke Xian by way of expressing gratitude and declaring loyalty respectively by the two visitors.So, J 13 led J 11 (the leader) to express thanks to W 11 and W 21 (the members). In the reply to W 11 who recited the first stanza of Lu Xiao to express thanks to J 11 and to make a request for Duke Xian’s release, J 11 expressed the gratitude (function) toward W 11 with regard to the thanks expressed, by taking the meaning of the first stanza of this poem but did not mention the release of Duke Xian to W 11 (cf. Yang 1990, pp. 1116–1117; Zeng 1993, pp. 279–280). In the reply to W 21 who recited the first stanza of Zi Yi to show their loyalty and to make a request for Duke Xian’s release, J 11 expressed the gratitude (function) toward W 21 for the loyalty by taking the meaning of the first stanza of this poem with regard to the loyalty expressed but did not mention the release of the detained duke to W 21 (ibid.). By this way of replying, J 11 intimated a decline of the requests indirectly proffered by the two dukes (function). In this move, the context comprehension rule of ④ is: in responding to the poems recited by the alliance members, the alliance leader could choose to understand the poems by taking the first stanzas and the linguistic context as well as the purpose of alliance members; the function rule of ④ is: in the context that the members express thanks, loyalty and indirect request by reciting two poems and considering the purpose of visit at a banquet, the leader could use the function of thanking and indirect declining; and the expression rule of ④ is: in the context that the members express thanks, loyalty and indirect request by reciting two poems and considering the purpose of visit at a banquet, in line with the contents of the poems recited, the leader could use plain language to directly express the function of thanking, and avoid mentioning relevant event to decline the request.\n\n4.3 Round Two\n\n⑤Guo Jing-zi (W 12 ) makes Yan Ping-zhong (W 13 ) say privately to Shuxiang (J 13 ), “The ruler of Jin (J 11 ) displays his brilliant virtue to the States, compassionating their distresses, repairing their defects, correcting their errors, and relieving their troubles. In this way he is the lord of covenants; but how is it that he has now in the behalf of a subject seized the ruler?” Shuxiang (J 13 ) told this to Zhao Wen-zi (J 12 ), who reported it to Duke Ping (J 11 ).\n\nAfter J 11 expressed thanks to W party and did not mention the release of Duke Xian, considering that J party knew W party’s purpose of seeking the release of Duke Xian, W 12 and W 13 understood what J party had said as declining their request. With such a context that J 11 (the leader) did not directly mention the release, W 12 (the member) proceeded with a questioning (function) considering that their purpose of visit was to seek the release of Duke Xian. This questioning was performed by an overt verbal expression. In expressing, W 12 brought up the responsibilities for a leader (compassionating their distresses, repairing their defects, correcting their errors, and relieving their troubles) and pointed out that helping Sun Lin-fu (cf. Sect. 4.1), Duke Xian’s subject, to imprison the duke was in violation of the responsibilities of a leader. J 13 told this to J 12 and the latter told this to J 11 . Here is the context comprehension rule of ⑤ is: when one party makes a request and the other party, in responding, does not mention things related to the request, the latter could be understood as declining the request; the function rule of ⑤: in the context of an indirect decline from the leader and considering the purpose of visit, members could choose a questioning function; the expression rule of ⑤ is: in response to the indirect decline, members could choose the norm concerning the leadership to directly express the questioning.\n\n⑥Duke Ping (J 11 ) explained to him the offence of Duke Xian of Wei, and made Shuxiang (J 13 ) inform the two princes of it.\n\nAfter W 13 questioned Duke Ping of Jin’s helping Duke Xian’s subject to hold Duke Xian as hostage in violation of the responsibilities of an alliance leader, considering that Jin was the alliance leader and that W party came for the release of Duke Xian, J 11 understood what J 13 said directly as requesting the release of the detainee. After the revelation of the purpose of visit and the questioning from W 13 (the member), J 11 (the leader) now tried to defend himself for imprisoning Duke Xian, explaining that it was not about Duke Xian being sent into exile but about Duke Xian having committed a crime in the first place (cf. Legge 1991a, p. 525). In so doing, J 11 rebuked the questioning by W 13 . Here, the context comprehension rule of ⑥ is: based on the purpose of requesting, when a verbal questioning is put forth one party, the other party could understand the questioning as asking for the acceptance of the request; the function rule of ⑥ is: in the context that the leader is questioned by an overt expression, the leader chooses to defend; the expression rule of ⑥: in the context that the leader is questioned by an overt expression, an overt explanation of reasons can be used.\n\n4.4 Round Three\n\n⑦Guo Jing-zi (W 12 ) on this recited the Pei Zhi Rou Yi.\n\nAfter J party’s justification for keeping Duke Xian in response to the questioning made by W 13 (namely, telling W party about the reason of keeping Duke Xian), W 12 understood that J party intended the decline the request. Having been informed of the reason about the detention of Duke Xian, that is, Duke Xian perpetrated a crime in the first place. With the aim to having Duke Xian released, W 12 (the member) made a remonstrance and persistent request (function) and this is done by reciting Pei Zhi Rou Yi, not denying that Duke Xian had committed the crime. The complete version of this poem is lost and what remains available now are the three verses. It reads:\n\nBe the horse strong, hold the bridle loose (马之刚矣,辔之柔矣);\n\nBe the horse not strong, hold the bridle tight (马亦不刚,辔亦不柔);\n\nHave strong aspiration, do not hesitate (志气麃麃,取与不疑).\n\nThe short poem is used to describe the proper way to deal with the relation between the horse and the bridle. If the horse is strong, let the bridle loose up, and vice versa. In such a context, the way a leader treats the members (including Duke Xian) is likened to the way a loosened bridle goes with a strong horse (the first verse) (Zeng 1993, pp. 277–278, 280), which serves to remonstrate with J 11 (the leader) that he should be more lenient to the members, further intending it as an indirect request for the release. In this move, the context comprehension rule of ⑦ is: when the other party provides justification in response to one party’s questioning, the latter could understand the justification as declining; the function rule of ⑦ is: in the context that a rebuttal is brought forth at the banquet and considering the purpose of visit, the members could choose the function of positive remonstrance and direct request; the expression rule of ⑦ is: in the context that a rebuttal is brought forth at the banquet and considering the purpose of visit, reciting such a kind of exhortative poem can express the positive remonstrance and direct request.\n\n⑧Zizhan (W 22 ) recited the Qiang Zhong Zi Xi.\n\nAfter J party’s justification for keeping Duke Xian in response to the questioning made by W 13 (namely, telling W party about the reason of keeping Duke Xian), W 22 understood that J party intended the decline the request. So, this last attempt shares the same context and function with that of ⑦ and this is done by reciting Qiang Zhong Zi Xi. It has three stanzas and previous studies found that the meaning of last stanza of the poem was adopted (Zeng 1993, pp. 278–280):\n\nI pray you, Mr. Zhong (将仲子兮),\n\nDo not come leaping into my garden (无逾我园);\n\nDo not break my sandal trees (无折我树檀).\n\nDo I care for them?(岂敢爱之)\n\nBut I dread the talk of people (畏人之多言).\n\nYou, O Zhong, are to be loved (仲可怀也),\n\nBut the talk of people (人之多言),\n\nIs also to be feared (亦可畏也). (Legge 1991b, p. 127)\n\nIt depicts the complex mental state of a lady who is in love with a man. She expects to meet him but at the same time she dreads the “talk of people”. She cares not about ruined trees in a secret date with Mr. Zhong, but she cares about people’s talk. Considering the context, people’s talk about Jin’s taking Duke Xian is compared to that about Mr. Zhong’s leaping into the garden/destroying the sandal tree (Zeng 1993, p. 280). By doing so, W 22 (the member) was remonstrating with J 11 (the leader) that people’s talk is to be feared, thus making a further request (function) for releasing Duke Xian. In this move, the context comprehension rule of ⑧ is: when the other party provides justification in response to one party’s questioning, the latter could understand the justification as declining; the function rule of ⑧ is: in the context that a rebuttal is brought forth at a banquet and considering the purpose of visit, the members could choose the function of negative remonstrance and direct request. The expression rule of ⑧ is: in the context that a rebuttal is brought forth at a banquet and considering the purpose of visit, members could recite exhortative poems to realize the function of negative remonstrance and direct request.\n\n⑨After this Duke Ping granted the return of Duke Xian to Wei.\n\nAfter W and W recited Pei Zhi Rou Yi and Qiang Zhong Zi Xi respectively, considering W party’s purpose of visit, J party took the implied meaning of Pei Zhi Rou Yi and the last stanza of Qiang Zhong Zi Xi, thinking that W 12 intended Pei Zhi Rou Yi to implicate that alliance leader should respect and care for the alliance members, and that W 22 intended Qiang Zhong Zi Xi to implicate that it would be censured that the alliance leader helps the subject of Wei to rebel against the ruler (Sun Lin-fu’s rebelling against Duke Xian). In the end, J 11 (the leader), having considered the attempts made by W 11 and W 21 (the members), conceded and promised to release Duke Xian. This concession, probably, was based on power reality of Jin, which was on the decline because Jin had just quelled a domestic riot and on the other hand Chu, Qin and Qi were seeing growth of power (cf. Ma 1992, pp. 280–294; Tong 2006, pp. 70–72, 75–76). Thus, the case is concluded with W party succeeding in persuading J party to release the detainee. Here from the text, we could not see the expression rule but could reveal the context comprehension rule of ⑨: in responding to poems recited by alliance members, the alliance leader could choose the implied meaning and last stanza in understanding the poems recited with the consideration of purpose of the alliance members and linguistic context; and the function rule of ⑨: in the context that a reasonable remonstrance is made and some other factors are considered, the leader chooses to accept the opponents’ request.\n\nIn summary, the sequence of 9 discourses (in the form of poem or verbal articulation) in this case constitutes the whole argumentation process which could be divided into four argumentation stage according to such a proposed division rule: argumentative sequence could be compartmentalized based on regular conversation turn construction, normal developments of social actions and cultural scripts etc.\n\nArgumentation stage 1 (①–④): W party indirectly requested J party to release Duke Xian but did not succeed so as to make clear the standpoint of J.\n\nArgumentation stage 2 (⑤–⑥): W party questioned J party directly and obtained the reason why J party didn’t want to release Duke Xian.\n\nArgumentation stage 3 (⑦–⑧): W party requested J party again to release Duke Xian, not denying the reason provided by J party. W party still stuck to the belief that J party had violated the alliance leader norm.\n\nArgumentation stage 4 (⑨): J party accepted W party’s request to release Duke Xian, thus concluding the argumentation.\n\n4.5 The Reasonableness of the Rules of Political Argumentation by Reciting Poems\n\nUp to now, we have elaborated in detail a case of political argumentation of reciting poems. Through such a detailed elaboration, we have found the context comprehension rules, function rules and expression rules for the argumentative move in the whole course of this argumentation. Now, we are going to justify these rules and explain their reasonableness in the social cultural context. Because the same social norms may support different rules and one rule may be supported by different norms, for the sake of convenience, the rules supported by the same norms will be chunked into one group and then be justified.\n\nWe have one group of context comprehension rules that we could find particular in Chinese ancient culture. The context comprehension rules of ② ③ ④ ⑨ conform to the norm of reciting and understanding poems. As introduced, it works as follows: first, take part or the whole of the poems when reciting; take part or whole of the poems when understanding; second, when understanding the poems, take what is expressed or what is implied through the poems (see Sect. 3.3). The context comprehension rules used in ⑤ ⑥ ⑦ ⑧, however, tend to show little cultural tendency, which means that they could be found in different cultures.\n\nWe have three groups of function rules. Firstly, the function rule of ① is in line with the alliance leader norm that leaders should respect the members of the alliance. Secondly, the function rules of ② ③ ④ ⑨ comply with the poem-replying norm (cf. Sect.3.3) which requires that when one party recites poems in line with Li, the other party is supposed to reply according to the poem.\n\nThirdly, the function rules of ② ③ ⑤ ⑦ ⑧ conform with the alliance member norm that when the ruler (or the leader) commits some mistakes, the subjects (or the officials) should make remonstrance, which is a kind of social norm in the Spring and Autumn Period. There were specific institutions about remonstrance in that time. For example, in the Zuo Zhuan, Duke Xiang 14th year, the music-master Kuang of Jin said “Heaven, in giving birth to the people, appointed for them rulers to act as their superintendents and pastors, so that they should not lose their proper nature. For the rulers there are assigned their assistants to act as tutors and guardians to them, so that they should not go beyond their proper limits. Therefore the son of Heaven has his dukes, princes of states have their high ministers; ministers have [the heads of] their collateral families; great officers have the members of the secondary branches of their families… These stimulate and honour those [to whom they stand in such a relation], when they are good, and correct them when they do wrong” (Legge 1991a, p. 466). In our case, ② ③ ⑤ ⑦ ⑧ show that when the leader (Duke Ping of Jin) committed mistakes (helping Sun Lin-fu, the subject of Duke Xian of Wei), the members (rulers of Qi and Zheng) should remonstrate with the leader.\n\nWe have four groups of expression rules. Firstly, the expression rules of ① ② ③ ⑦ ⑧, which deal with the realization of certain functions by reciting poems, comply with norms of reciting poems (cf. Sect. 3.3) at banquets in the Spring and Autumn Period. Because poems were classics in that period and had become the common discourse between dignitaries, people (dignitaries) could use poems to express their ideas, especially at banquets. As a matter of fact, poem-reciting activities in the Spring and Autumn Period mainly took place at banquets. For instance, in the Zuo Zhuan, the poem-reciting activity appears 34 times among which it happened at banquets 22 times and therefore “it is part of the feast ritual” (Ding 2006, p. 115).\n\nSecondly, the expression rules of ② ③ ④ ⑦ comply with the alliance leader norm (cf. Sect. 3.2) that the leader of the alliance should respect and care for the allies.\n\nThirdly, the expression rule of ③ meets the alliance member norm (cf. Sect. 3.2) that the members should be subservient to the leader (loyalty declaring being a form of subservience).\n\nFinally, the expression rules of ⑤ ⑥ ⑧ accord with the alliance leader norm (cf. Sect. 3.2) that the leader should fight the members who have violated the principle of Li(礼), as is recorded in Duke Xiang 11th year “All we who have covenanted together [are here] because your great state found it necessary to punish a small one which had offended”(Legge 1991a, p. 453).\n\nAfter the rules we obtained from the case analysis are justified, they are recognized as adequate social norms for argumentation making. In the following part, on the basis of the analysis above, we are going to describe argumentation as a language game with discourse governed by social norms. In the process, motivated by the initial context of discourse ①, the arguer 1 selects the function of discourse ① based on the function rule of discourse ①, and then produces discourse ① based on the expression rule of discourse ①. Finally, discourse ① produces new information and effect on the other arguer 2 ’s original context. At this moment the first move is over and the next move begins. Arguer 2 grasps the new context and the meaning of discourse ① according to context comprehension rule. In a similar way the following moves of this game are going on till the end. The whole game of this case can be described in the following chart.\n\nIn light of the analysis offered in Sects. 4.2–4.4 and the explanations provided above, it becomes clear that political argumentation by reciting poems has the following features. First of all, the poems recited are authoritative. By authoritative it is meant that participants in the political argumentation by reciting poems will mutually acknowledge the authority of the poems they are reciting. Then, the method for reciting and understanding poems that is used in this kind of argument is as follows: the reciters select the poems, part or whole, to meet the demands of the situational context and to take the meanings in their best interest; and accordingly, the addressees of the poems understand the recited poems in the way that they select the possible meanings of the poems, part or whole, in their best interest. In the end, the whole process of the political argumentation by reciting poems take the principle of Li as the reasons to their standpoints, just as we have laid out in part 3 of this paper.\n\n4.6 Test of Rules\n\nTill now, we have analyzed a political argumentative case of the Spring and Autumn Period in which participants, mainly the alliance leader and members, use poems to make their arguments. The argumentative rules we obtained from analysis conform to the social norms of the Spring and Autumn Period. We get two main categories of norms: poem reciting norms and norms about relationships between alliance leader and members. These two kinds of norms also could be found in some other cases of the Spring and Autumn Period. Here in the following is a case that may help us to test the rules (step 5 of localized procedure).\n\nIn Duke Xiang 18th year (555 BC), the alliance leader Jin, together with some other alliance members like Lu and Wei launched an attack against Qi for the reason that Qi had encroached on Lu for many times. In Duke Xiang 19th year, marquis Ling of Qi died and Qi wanted to make peace with Jin. In this background, Lu was worried that Qi did not really mean to make peace with Jin and that Qi may continuing encroaching on Lu (cf. Zeng 1993, pp. 260–261). So Mushu, an official of Lu went to Jin and asked for help from Shuxiang:\n\nMushu had a meeting with Shuxiang, he recited the 4th stanza of the Zai Chi (Tsae ch’e). Shuxiang said, “I dare not but receive your command.” (Adapted from the Zuo Zhuan, Duke Xiang 19th year, Legge 1991a, p. 484)\n\nThe poem Zai Chi recited by Mushu has five stanzasFootnote 8 and the fourth stanza reads:\n\nI would have gone through the country,\n\nAmidst the wheat so luxuriant.\n\nI would have carried the case before the great State.\n\nOn whom should I have relied? Who would come to the help of Wei? (Legge 1991b, p. 89)\n\nHere Mushu took the alliance leader Jin as a reliable power and asked Jin to help Lu (the function) in order to save Lu from Qi’s encroachment. (cf. Zeng 1993, p. 260) The function rule is: in the context that the alliance members is under attack from other state, the member could ask for help from the alliance leader. This function rule accords with the alliance leader norm which stipulates that the leader should care for the member and protect the member from attacks. (cf. Sects. 3.2 and 4.5) The expression rule is: in the context that the alliance members is under attack from other state, the member could appeal to reciting poems to realize the request function. This rule conforms with the poem-reciting norm. (cf. Sects. 3.3 and 4.5)\n\nShuxiang knew that Qi didn’t really mean to make peace (cf. Zeng 1993, pp. 260–261). After Mushu recited the poem, Shuxiang also took the fourth stanza for understanding thinking that Mushu was asking Jin to help Lu and responded, in plain language, to the latter in agreement to the request. Here the context comprehension rule is: in responding to the fourth stanza of the poem recited by the alliance member, the leader could choose to the implied meaning of the recited stanza in understanding. This rule conforms to the poem-reciting norm we had laid out. (cf. Sects. 3.3 and 4.5) The function rule is: in the context that the alliance member asks for help by reciting poems, the alliance leader could choose to help the member. This rule accords with the poem-replying norm we laid out. (cf. Sects. 3.3 and 4.5) The expression rule is: in the context that the alliance member asks for help by reciting poems, the alliance leader could use plain language in answer to the poems recited and agree to the request for help to the alliance member. This rule conforms with the alliance leader norm we laid out. (cf. Sects. 3.3 and 4.5).\n\nApart from these two cases, there are many other cases of political argumentation by reciting poems in the Spring and Autumn Period that could be used to test these kinds of rules. For example, the Zuo Zhuan has it that in Duke Xiang 8th year (565 BC) Fan Xuan-zi of Jin recited Biao You Mei (P’eaou yew mei) to ask Lu to attack Zheng together with Jin and Ji Wu-zi of Lu agreed by reciting Jiao Gong (Keoh kung). There is another example. In Duke Xiang 16th year (557 BC) Mushu of Lu recited Qi Fu (K’e foo) in order to ask Zhongxing Xian-zi of Jin to rescue Lu and recited Hong Yan (Hung yen) to ask help from Fan Xuan-zi and both them agreed to help Lu at last.\n\n4.7 Little Red Book Quotation Fight: A Similar Phenomenon\n\nIt’s clear that participants in the political argumentation by reciting poems in the Spring and Autumn Period recite poems from some authoritative and widely accepted texts (for example poems) and re-contextualize the meanings of the texts based on their original meanings to meet the contextual demands. By so doing, they reach their argumentative goals of persuading the other(s). In Chinese history, this kind of argument is not a rarity. Among others, the quotation from Little Red Book (also known as Quotations from Chairman Mao Zedong) in the Great Proletarian Cultural Revolution (1966AD–1976AD) is worthy of note.\n\nIn that period of time, almost everyone had one copy of the Little Red Book. Quotation from the Little Red Book is so commonly seen that even beggars, when begging, make use of the book to its fullest and quote such saying as “We came from all across the country and our common revolutionary goal has united us together… Among us, we should care for each other, love each other and help each other…” Afterwards, they stick out their hands (He 2012, p. 72). This shows that the beggar can persuade others to accept his position through quoting a political maxim from the Little Red Book.\n\nIn various ways of usage of the book, quotation fight is the most prominent form, in which two debating parties “fight” each other by plunging into the book and looking for the most appropriate and authoritative quotes to support their ideas and rebuke their opponents’ ideas. So, what concerns us here is that the quotation fight bears certain similarities to the political argumentation by reciting poems. In them, the participants on different sides resort to some other sources when expressing their ideas in argumentative activities. Here is an example.\n\nIn his “Ten Thousand days by the side of Mao Zedong” (memoirs), Li Dunbai, a revolutionist during the (cultural) revolution who was working in the National Broadcast Bureau, recalled an incident that took place at the workplace (ibid.):"}, {"url": "http://www.chinaknowledge.de/History/Zhou/zhou-event-chunqiu.html", "page_content": "Oct 3, 2018 © Ulrich Theobald\n\nThe Spring and Autumn period (Chunqiu 春秋, 770-5th cent. BCE) is the first part of the so-called Eastern Zhou period (Dongzhou 東周, 770-221 BCE). It is characterized by a significant decrease of political power of the kings of Zhou which had to flee to the eastern capital Chengzhou 成周 (or Luoyi 雒邑, modern Luoyang 洛陽, Henan) after their western and main capital Zongzhou 宗周 (of Feng 豐, near modern Xi'an 西安, Shaanxi) had been attacked by the nomad tribes of the Quanrong 犬戎.\n\nPeriodization\n\nThe name of the historical period is derived from the chronicle of the regional state of Lu 魯 called Chunqiu 春秋 \"Spring and Autumn Annals\" because the seasons are always mentioned in the entries. The Annals cover the time from 722 to 481 BCE, yet the historical period is traditionally counted from the reign of King Ping of Zhou 周平王 (r. 770-720 BCE), who restored the Zhou dynasty in Luoyang, down to the division of the state of Jin 晉 by the regional rulers (zhuhou 諸侯) of Han 韓, Wei 魏 and Zhao 趙 in 376. Alternatively, the end of the Spring and Autumn period can be seen as 453, when the three viscounts (zi 子) of Han, Wei and Zhao extinguished all other lateral lines to the house of Jin, or 403, when King Weilie of Zhou 周威烈王 (r. 426-402) bestowed upon the viscounts of Han, Wei and Zhao the title of marquis (hou 侯).\n\nThe second great historiographical writing of the Spring and Autumn period is the collection Guoyu 國語 \"Discourses of the states\" that includes anecdotes of the states of Zhou 周, Lu 魯, Qi 齊, Jin 晉, Zheng 鄭, Chu 楚, Wu 吳 and Yue 越. Said to be a composition of Zuo Qiuming 左丘明, its oldest parts must have been compiled at the end of the 5th century BCE.\n\nConfucius\n\nThe most important intellectual person of this historical period was the philosopher Confucius (Kongzi 孔子; ca. 551-479) who tried to revive the ideal of the human and righteous rulers of old. Although his ideas seemed lost in a time of political realism his thoughts about state and society (\"Confucianism\") were to become the fundamental doctrine of imperial China.\n\nThe Early Decades of the Eastern Zhou and the Duke of Zheng\n\nThe eastern capital Chengzhou (Luoyang) did not provide the kings of Zhou with sufficient power. They were therefore dependent on the powerful regional rulers, especially those of Qin 秦, Jin, Qi and Chu. These are called the \"local rulers\" (fang bo 方伯) because they practically ruled independently from the king of Zhou, and not any more as his vassals. It became common that the regional states acted on their own behalf regarding territory and military feuds, without asking the king of Zhou for formal permission. Duke Zhuang of Zheng 鄭莊公 (r. 743-701) even dared attacking King Huan 周桓王 (r. 720-697 BCE) who had not treated him properly according to the ritual regulations. Heijian 黑肩, the Duke of Zhou 周公, even planned to kill King Huan's successor, King Zhuang 周莊王 (r. 697-682), and to replace him with Prince Ke 克. Yet Xin Bo 辛伯 warned the king and saved his life.\n\nDuke Zhuang of Zheng defeated intruding Rong 戎 tribes and swallowed the neighbouring state of Xu 許. In 707 King Huan of Zhou 周桓王 (r. 719-697) started a punitive expedition against the Duke, but the king was defeated. From then on, the kings of Zhou never again tried to intervene into the politics of their own regional rulers. They stayed in their small royal domain around Luoyang and had to be content with the tributes of the regional rulers that were presented less and less regularly. Besides Zheng, the states of Song 宋 and Lu 魯 demonstrated their military and political power in the Central Plain.\n\nThe Rise of Duke Huan of Qi\n\nKing Li 周釐王 (r. 682-677) was so helpless against the new threats endangering the empire that he allowed Duke Huan of Qi 齊桓公 (r. 685-643) to adopt the title of hegemonial lord (ba 霸, or bo 伯). In this function the Duke defended the regional states against raids of barbarian tribes and cared for law and order among the states of the Middle Kingdom, with the motto \"support the king and ward off the barbarians\" (zun wang rang yi 尊王攘夷).\n\nIn the east, the state of Qi had rich natural ressources and became one of the mightiest regional states of the Eastern Zhou period.\n\nDuke Huan of Qi employed the legalist statesman Guan Zhong 管仲 as his adviser who reorganized administration and the military and financial systems. Through these reforms Qi was able to subdue Song and Lu and even the hegemonial state of Zheng. At that time, the non-Chinese nomad tribes of the Rong and Di 狄 undertook raids on the soil of Chinese states and devastated the states of Xing 邢 and Wei 衛 (modern Shanxi and Hebei). Duke Huan of Qi rescued the dynastic houses of these states and settled them down more to the south. The system of the hegemon thus developed to a kind of lord protector of a strong state over weaker ones, and Qi promised to protect the states in the Central Plain against further intrusions of the northern nomad warriors.\n\nThe Semi-Barbarian Kingdom of Chu\n\nIn the south, the state of Chu on the middle Yangtze River had become politically stronger than before. King Cheng of Chu 楚成王 (r. 671-626) started to challenge the hegemony of Qi and swallowed smaller states in his neighbourhood. Nonetheless, subservient states like Jiang 江 and Huang 黃 changed side and declared their alliance with Qi. Chu thereupon attacked Zheng. Duke Huan assembled the regional rulers and created an alliance with Lu, Song, Chen and Wei to punish Chu in 656 by devastating the state of Cai 蔡, an ally of Chu. Chu gave in, and the ambassadors of the two mighty states met at Shaoling 召陵 (modern Yancheng 郾城, Henan) to conclude a peaceful alliance (meng 盟).\n\nThe System of Hegemonial Lordship\n\nIn 651 Qi organized a meeting at Kuiqiu 葵丘 (modern Lankao 蘭考, Henan) whith the representatives of Lu, Song, Zheng and Wei, and in presence of a royal diplomat from Zhou. The members of the meeting decided that states creating a friendly alliance should never attack each other, and that they had to assist each other in case that one partner was attacked. The Duke of Qi thus became the overlord over the weaker states of Zhou China and replaced the king of Zhou as the highest judicial person.\n\nSuccession Crises at the Zhou Court\n\nWhen King Li died a succession crisis endangered the house of Zhou. His righteous heir was Prince Kan 閬, who is known as King Hui 周惠王 (r. 677-652), but his late grandfather, King Zhuang, had had a favourite son called Prince Tui 穨. King Hui was not a very intelligent ruler. He offended many of his highest ministers and caused a rebellion that forced him to flee to Wen 溫 (modern Wenxian 溫縣, Henan) and then to Li 櫟, a town in the state of Zheng. His uncle Prince Tui was made King of Zhou, but he did not prove a better ruler. He was therefore attacked and killed by the lords of Zheng and Guo 虢. King Hui returned to the throne.\n\nWhen King Hui died he was succeeded by his son Prince Zheng 鄭, who is known as King Xiang 周襄王 (r. 652-619). King Xiang had a half-brother called Shudai 叔帶 (or Dai 帶), who had been the favourite son of King Hui. Prince Shudai planned to usurp the throne and joined forces with the Rong and Di 翟 tribes. The plot failed and Prince Shudai fled to Qi. It was a high minister of Qi, the reformer Guan Zhong, who mediated the peace treaty between the house of Zhou and the Rong tribes. A decade later the king of Zhou even allowed Prince Shudai to return.\n\nWhen the state of Zheng attacked in 639 the statelet of Hua 滑, whose lords were relatives to the house of Zhou, King Xiang sent You Sun 游孫 and Bo Fu 伯服 as diplomats to negotiate peace. Yet the Duke of Zheng arrested the diplomats. The King thereupon ordered the Di tribes to attack Zheng, inspite of the remonstances of minister Fu Chen 富辰. Fu Chen was also not content with the King's will to marry a Di princess in order to reward the Di chieftain for his support. His critics were justified because only a few years later King Xiang discarded the \"barbarian\" queen, which caused an attack of the Di on the royal capital, during which the Earl of Tan 譚 (or the earls of Yuan 原 and Mao 毛) was/were killed. Fu Chen thereupon threw himself into battle against the intruders and died. King Xiang fled to Zheng and was received by the duke of Zheng, in spite of all former discrepancies.\n\nIn the meantime Prince Dai was enthroned as King of Zhou, yet he took residence in Wen, not in Luoyang. He invited the Di queen to return to the royal domain. Two years later King Xiang asked the duke of Jin for help, who willingly attacked the usurper and executed him. King Xiang, returning to the throne, rewarded Duke Wen of Jin 晉文公 (r. 636-628) with the title of hegemonial lord and presented him with some territory. Duke Wen was thereafter the most powerful political leader of the Middle Kingdom and assembled the regional rulers, including his formal superior, the King of Zhou, at Heyang 河陽 and Jiantu 踐土. The kings of Zhou were now wholly dependent from support by other political actors. Histories nevertheless concealed this shameful situation with terms like \"royal hunt at Heyang\".\n\nThe Rise of the Regional State of Jin\n\nAfter the death of Duke Huan of Qi several regional rulers strove for overlordship. Duke Xiang of Song 宋襄公 (r. 650-637) was defeated by Chu, and the state of Song lost its last chance to rise to political and military significance. Instead, the state of Jin rose to supremacy in old China: Duke Xian of Jin 晉獻公 (r. 676-651) had already extended the power of his state by swallowing the statelets of Geng 耿, Huo 霍, Wei 魏 (a state that was later one of the three destructors of Jin), Guo 虢 and Yu 虞. After a decade of inner struggles, the state of Qin supported Duke Wen of Jin in his ascension to the throne of Jin.\n\nJust as Duke Huan of Qi, Duke Wen of Jin employed political advisors, Zhao Shuai 趙衰 (Zhao Chengzi 趙成子) and Hu Yan 狐偃, who strengthened the \"national\" economy and so the military power of the state. In 635 the King Xiang of Zhou escaped from inner disturbances to the state of Zheng. Duke Wen of Jin saw his chance, rescued the king and accompanied him back to the royal domain, for which support he was highly rewarded by the King.\n\nThe next step for the Duke was to challenge the power of the southern, semi-Chinese state of Chu that had dominated the Central Plain since the death of Duke Huan of Qi. In 632 the two states clashed at the battle of Chengpu 城濮 (modern Zhencheng 甄城, Shandong), and Chu was defeated. Duke Wen of Jin established a new friendly alliance during the meeting at Jiantu 踐土 (modern Yingze 滎澤, Henan) with the seven most important states. In the same year, at Wen, the King of Zhou sanctified the hegemony by Jin. Duke Wen's successor Duke Xiang 晉襄公 (r. 627-621) was able to prolong the hegemonial prevalence of the state of Jin.\n\nConflict Between Qin and Jin\n\nDuring the reign of Duke Xiang of Jin, Duke Mu of Qin 秦穆公 (r. 659-621) opened a long period of military confrontation between Jin and Qin, but Qin seldomly won any battle. The powerful state of Jin blocked the gate to the Central Plain, and Qin could not but expand its territory to the west into the territory of the Western Rong tribes 西戎 and establish good relations with Chu in the south. Chu meanwhile further expanded its territory by conquering the statelets of Jiang 江, Lu 六 (a special reading!), and Liao 蓼. After the death of Duke Xiang of Jin, the noble Zhao Dun 趙盾 (Zhao Xuanzi 趙宣子) dominated the throne succession of Jin, murdered Duke Ling 晉靈公 (r. 620-607) and enthroned Duke Cheng 晉成公 (r. 606-600). During this period Jin lost its initiative in \"foreign\" politics. The political advisor Fan Shan 范山 proposed to King Mu of Chu 楚穆王 (r. 625-614) to take the chance and to advance against the north.\n\nThe Rise of the State of Chu\n\nKing Zhuang of Chu 楚莊王 (r. 613-591) had to resolve internal quarrels and uprisings of aboriginal tribes before he was able to reform economic and military administration and to resume this expansion politics. In 606 the southern king sent out an envoy to the court of King Ding of Zhou 周定王 (r. 606-586) to express his will to swallow the royal domain of Zhou. In 598 King Zhuang of Chu crushed the small state of Chen 陳, one year later the state of Zheng. At the battle of Bi 邲 (near modern Zhengzhou 鄭州, Henan) the army of the hegemonial state of Jin was defeated.\n\nA few years later, Chu defeated the state of Song and finally obtained the overlordship over the Central Plain. The protecting task of the overlord had gradually lost its original intention and became a system of hegemony of one major state over weak satellites of Chinese and \"barbarian\" origin. The attitude to help small states during internal quarrels and against \"barbarian\" invaders changed to a regular intervention into political affairs to the advantage of the great states.\n\nInternal Quarrels in Jin\n\nThe state of Qi observed the growing power of Chu, declared a friendly relationship with the southern king of Chu, who was the only regional ruler who called himself king, except, of course, the King of Zhou. Qi repeatedly attacked the smaller states of Lu and Wei which therefore asked for support the former hegemonial state of Jin. In 589, the army of Jin fought with Qi in the battle of An 鞍 (modern Jinan 濟南, Shandong) and once again demonstrated its superior military power. Chu instantly declared war to Jin, but neither Chu nor Jin dared to initiate a concrete campaign.\n\nAfter long years of hesitation and negotiations (under the stipulation of Jin's political advisor Song Huayuan 宋華元) Chu attacked Zheng and Wei in 576. One year later the armies of the two hegemonial states fought in the famous battle of Yanling 鄢陵 (modern Yanling, Henan) in which Jin prevailed by a narrow margin. Duke Li of Jin 晉厲公 (r. 580-573) saw his chance to resume hegemony, murdered his mightiest noblemen Xi Zhi 郤至, Xi Qi 郤錡 and Xi Chou 郤犨 (the \"Three Xi\" 三郤). Yet instead of having strengthened his own position, Duke Li faced serious opposition by the Jin aristocracy like Luan Shu 欒書 and Xun Yan 荀偃 who eventually killed their lord.\n\nUnder the next ruler, Duke Dao 晉悼公 (r. 572-558), the internal situation calmed down, and the duke was able to strengthen the position of the state of Jin. His political advisor Wei Jiang 魏絳 proposed to appease the nomad warriors of the Rong with financial tributes instead of fighting them. In 571 Jin erected a fortification wall at Hulao 虎牢 (modern Fanshui 氾水, Henan) against the state of Zheng that was backed by Chu.\n\nAfter more than two decades of relative peace the political advisor Song Xiangxu 宋向戌 proposed to organize a peace conference to end military conflict. It was held in the capital of Jin in 546 and the participating fourteeen states decided to accept the overlordship of the two states of Jin and Chu. Their adherents had to declare their subjection under the respective overlordship and to present tributes to the two hegemons. Among the participating states, there would be ten years of peace, and for more than fourty years, Jin and Chu would not meet at the battle field again.\n\nOnly two of the larger states did not participate in the general peace: Qi, and Qin.\n\nThe old kingdom of Zhou had totally lost its political role. The tributes once paid to the kings of Zhou were now offered to the dukes of Jin and the kings of Chu. If a small state did not pay tribute it had to expect military sanctions. Especially precarious was the role of the state of Lu that had to maintain good relationships to the three states of Jin, Chu and Qi, if it did not want to be swallowed by one of them. Very similar was the role of Zheng that was directly in the line of fire between Jin and Chu. But states like Lu also imitated the overlordship of their own masters and demanded tributes from yet smaller states like Teng 滕, Qi 杞 or Zeng 鄫.\n\nThe Rise of the Semi-Barbarian States of Wu and Yue\n\nDuring the relatively peaceful sixth century, the two southern non-Chinese coastal states of Wu 吳 and Yue 越 emerged as new powers. Jin saw its chance to open a second flank against Chu, and in 583 Duke Wuchen of Shen 申公巫臣 was sent to Wu in order to seek a military alliance. The semi-barbarian state of Wu was equipped with military tools and Wu soldiers were trained to attack Chu. But it was only more than half a century later that Wu became a serious threat to Chu after swallowing the statelet of Xu 徐.\n\nUnder King Helü 闔閭 (r. 514-496) the political advisor Wu Yuan 伍員 proposed to raise three armies that clockwise were to skirmish at the borders of Chu to weaken this state. In 506 the whole army of Wu finally attacked Chu and defeated this state at Baiju or Boju 柏舉 (modern Macheng 麻城, Hubei). In pursuit of the escaping enemy, the army of Wu advanced to the capital of Chu, Yingdu 郢都 (modern Jiangling 江陵, Hebei). King Zhao of Chu 楚昭王 (r. 516-489) had to take his flight and sought for help in Qin. This western state sent out chariots that expelled the invaders from Wu.\n\nWu's neighbour Yue took the advantage of the prolonged campaigns against Chu to invade Wu. In 496, Wu set its troops into march to carry out a punitive expedition against Yue, but King Helü died in the battle of Zuili 檇李 (modern Jiaxing 嘉興, Zhejiang). Two years later, King Fucha 夫差 of Wu (r. 495-473) defeated Yue during the revenge battle of Fujiao 夫椒 (modern Suzhou 蘇州, Jiangsu). Goujian 句踐, king of Yue (r. 496-465), fled to Mount Guiji 會稽山 (south of modern Shaoxing 紹興, Zhejiang).\n\nAlthough Fucha's advisor Wu Yuan proposed to destroy the state of Yue, the king of Wu was content with his success in battle and the destruction of the capital of Yue. After the defeat of Chu and Yue, King Fucha turned his attention to the north. He had a fortification wall built at Han 邗 (near modern Yangzhou 揚州, Jiangsu) and dug out canals (see Grand Canal) that connected the Yangtze River with the Huai River 淮水 valley, creating a traffic line to the north and the possibility to move troops faster. The small states of Lu and Zhu 邾 declared themselves subjects to Wu. In the years 485 and 484 Wu attacked several times the state of Qi by land and by river and finally defeated Qi in the battle of Ailing 艾陵 (modern Laiwu 萊蕪, Shandong). Wu assembled the states of the Central Plain to a meeting at Huangchi 黃池 (modern Fengqiu 封丘, Henan), with the intention to declare its hegemony. Jin, weakened by internal struggles, did not dare to challenge the new powerful state of Wu, and King Fucha became the new hegemon.\n\nJust during the conference of Huangchi, King Goujian of Yue took the chance and invaded the capital of Wu. The overstretched military power of the state of Wu was unable to withstand the southern opponent who had rebuilt its strength after the defeat of Guiji. In 473, Yue destroyed the state of Wu and replaced it as the dominating power of the southeast. King Goujian of Yue was the last of the so-called Five Hegemons (Wuba 五霸).\n\nThe Five Hegemons are also called the \"Five Earls\" (Wubo 五伯). Different literary sources and commentaries identify them with different persons. The traditional definition by Zhao Qi 趙岐 defines them as Duke Huan of Qi, Duke Wen of Jin, Duke Mu of Qin, Duke Xiang of Song, and King Zhuang of Chu. The book Xunzi 荀子 identifies them with Duke Huan of Qi, Duke Wen of Jin, King Zhuang of Chu, King Helü of Wu and King Goujian of Yue.\n\nThe Disintegration of the Old Order of Regional States\n\nIn the mid-5th century BCE there were four states that dominated old China: Chu in the south, Yue in the southwest, Jin in the north, and Qi in the east. Yet things were to change soon: Inner conflicts toppled two of the reigning houses (Jin and Qi), new powers emerged (Wei 魏, Zhao 趙 and Han 韓), and reforms in the administration of several states created a new type of \"modernized\" regional state: the centralized state with a strengthened \"national\" economy and a professional army. The administration of the state by nobles related to the ruling house was replaced by a bureaucratic officialdom.\n\nThe state Lu was the first that felt the power of noble families which challenged the ducal house, in this case the Three Huan (Sanhuan 三桓, descendants of Duke Huan 魯桓公) the Jisun 季孫, Mengsun 孟孫 (Zhongsun 仲孫) and Shusun 叔孫. From the time of Duke Xi 魯僖公 (r. 659-627) on these three noble families dominated the state of Lu. Duke Zhao 魯昭公 (r. 541-510) even had to escape from their intrigues and died abroad. At the beginning of the fifth century minor nobles like Nan Kuai 南蒯, Yang Hu 陽虎 and Hou Fan 侯犯 rebelled against the mighty families and took over the rule of Lu.\n\nDescendants of the dukes of Song fought for the domination within the small state: the families Hua 華, Yue 樂, Lao 老, Huang 皇 (descendants of Duke Dai 宋戴公, r. 799-766), Yu 魚, Dang 蕩, Lin 鱗 and Xiang 向 (descendants of Duke Huan 宋桓公, r. 681-651). In the permanent power struggles only the families Yue and Huang survived the Spring and Autumn period.\n\nThe seven descendant lineages of Duke Mu of Zheng 鄭穆公 (r. 627-606) also gradually lost their power in the course of the Spring and Autum period.\n\nIn the state of Qi, the government was led by the lineages of Guo 國, Gao 高, Cui 崔 and Qing 慶. In this state it was a family not related to the ducal house that took over power in Qi: the family Tian 田, descendants of a prince from Chen, Tian Jingzhong 田敬仲, who had come to Qi in 672 while escaping internal disturbances in Chen. Under Duke Jing 齊景公 (r. 547-490), Jingzhong's descendant Tian Qi 田乞 was ennobled and from this position collected wealth and power enough to annihilate the families Guo and Gao. His son Tian Chang 田常 was already wealthier than the Duke himself and sent his ambassadors to the neighbouring states. His descendants would eventually replace the reigning house in Qi.\n\nThe most tremendous power challenge from within took place in the state of Jin where descendants of the ducal line were not invested as regional governors (dafu 大夫). But this measure did not prevent other noble families from trying to dominate the court of Jin: Hu 狐, Zhao 趙, Xian 先, Xi 郤 and Xu 胥 were the dominating noble clans of the middle Spring and Autumn period, and were later replaced by the families Han 韓, Wei 魏, Luan 欒, Fan 范 and Xun 荀. At the beginning of the 5th century the noble families of Zhao, Wei, Han, Fan, Zhonghang 中行 and Zhi 智 survived the internal struggle. The three first could destroy the last three and dissolved the dukedom of Jin, dividing its territory among themselves.\n\nDuring the reign of King Ding of Zhou 周定王 (r. 607-586), the southern ruler King Zhuang of Chu 楚莊王 (r. 613-591) advanced his armies as far as the valley of River Luo in the pursuit of the Rong tribes of Luhun 陸渾. The king of Chu used this situation pay the king of Zhou a visit, but King Ding only sent Prince Man 滿 (\"Royal Grandson Man\" 王孫滿) to confer with the semi-barbarian king of Chu. They talked about the so-called \"nine tripods\" (jiuding 九鼎) erected in the capital that symbolized the nine regions of the kingdom of Zhou.\n\nAfter the death of King Ling of Zhou 周靈王 (r. 572-545) and during the reign of King Jing 周景王 (r. 545-521) a succession crisis beset the house of Zhou. The heir apparent, Prince Sheng 聖, had died prematurely. King Jing preferred his oldest son Prince Chao 朝, yet when the king died, Prince Gai 丐 was supported by a strong party among the courtiers. The highest ministers enthroned Prince Meng 猛, who was immediately attacked and killed by the adherents of Prince Chao. Prince Meng is posthumously known as King Dao 周悼王 (r. 521-520). Prince Chao proclaimed himself king of Zhou, yet Prince Gai on his side asked for support by the duke of Jin and finally made it to the throne. He is known as King Jing 周敬王 (r. 520-476). Prince Chao, who had reigned for four years, fled to Chu. In 504, when he had assembled a sufficient number of supporters, he attacked King Jing and forced him to flee to Jin. A year later Duke Ding of Jin 晉定公 (r. 512-475) helped King Jing back on the throne."}], "Zhuang of Chu died 621 BC": [{"url": "http://zh.worldheritage.org/articles/King_Zhuang_of_Chu", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://infogalactic.com/info/King_Zhuang_of_Chu", "page_content": "From Infogalactic: the planetary knowledge core\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally: \"Amaze [the others] with one cry\").\n\nReferences"}, {"url": "https://everything.explained.today/%5C/King_Zhuang_of_Chu/", "page_content": "King Zhuang of Chu explained\n\nKing Zhuang of Chu (reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü, his ancestral name was Mi, and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions .[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" .\n\nNotes and References"}, {"url": "https://www.liquisearch.com/king_zhuang_of_chu", "page_content": "King Zhuāng of Chǔ (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao Chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally \"Amazing with one cry\")."}, {"url": "https://en-academic.com/dic.nsf/enwiki/709964", "page_content": "King Zhuāng of Chǔ (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng) (died 591 BC) was a monarch of the Zhou Dynasty vassal State of Chu during the Spring and Autumn Period of Chinese history. Born ancestral name Mi(芈), given name is Lǚ (旅 or 侶), he became one of the Five Hegemons and later attempted to wrest control of China from the Zhou King.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his kingship, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao (孫叔敖) Chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin（晉國）, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of \"Yī Mǐng Jīng Rén\" (一嗚驚人), literally \"Amazing [the others] with one cry\", which comes from his promise: \"不嗚則已，一嗚驚人；不飛則已，一飛衝天\", translated as \"[It would be] fine if he does not cry out, [if he does,] one cry is enough to amaze all others; [It would be fine] if he does not fly, [if he does,] he would charge through the sky\".\n\nReferences\n\nEditors Lin Handa (林汉达), Cao Yuzhang (曹余章). \"Five thousand Years of Chinese History\" (上下五千年). 1990, Youth & Children Publishing, PRC.\n\nKing Zhuang of Chu House of Mi Died: 591 BC Regnal titles Preceded by\n\nKing Mu of Chu King of Chu\n\n613 BC – 591 BC Succeeded by\n\nKing Gong of Chu\n\n\n\n"}, {"url": "https://www.visiontimes.com/2021/07/12/a-forgiving-nature-is-always-rewarded.html", "page_content": "King Zhuang of Chu (楚莊王) was one of the Five Hegemons of the Spring and Autumn Period (春秋五霸, 770-476 B.C.), and the most accomplished monarch of Chu.\n\nAt a celebration after the suppression of a rebellion, King Zhuang and his ministers drank to their heart’s content. King Zhuang had his concubine Xu Ji toast the ministers. In the evening, he ordered the court to light candles, and the singing and dancing continued.\n\nSuddenly a gust of wind blew out the candles. In the darkness, one of the drunken courtiers pulled on Xu Ji’s clothing. In those days, no men were allowed in the palace unless they were castrated. Assaulting a concubine in this way was a serious offence. She pulled the tassel off of the courtier’s hat and asked King Zhuang to deal with him. King Zhuang not only did not do anything about it but also said loudly that everyone should take their tassels off, relax and enjoy. After all the ministers had taken off their tassels, King Zhuang ordered the candles to be relit.\n\nXu Ji was both surprised and angry. When the banquet was over, she complained to the king. He replied, “It is excusable to be careless after drinking. If I were to condemn a minister to death over something like this, it would chill the hearts of other ministers, and they would not be able to do their best to defend the country.” Nodding, Xu Ji listened, and agreed.\n\nThe minister was undoubtedly at fault for his drunken demeanor, but King Zhuang showed breadth of mind in the way he handled the incident. In time, he was repaid for his kindness.\n\nWhen King Zhuang was leading his troops to attack the state of Zheng, he was ambushed, and in a critical situation. Tang Cui, the vice general of the Chu army, single-handedly rushed into the enemy lines and rescued King Zhuang from the chaos. The King of Chu was very grateful and wanted to reward him. Then Tang Cui told him that he was the one who had pulled on Xu Ji’s clothes at “the feast of the tassels.”\n\nLater on, the story of “the Feast of the Tassels (絕纓之宴 Jué yīng zhī yàn)” was used as an allusion to treating people with generosity.\n\nTolerance does not mean giving up one’s dignity; tolerance is the use of wisdom and virtue to treat others kindly."}, {"url": "https://alchetron.com/King-Zhuang-of-Chu", "page_content": "King Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally: \"Amaze [the others] with one cry\")."}, {"url": "https://alchetron.com/King-Gong-of-Chu", "page_content": "King Gong of Chu (Chinese: 楚共王 or 楚龔王; pinyin: Chŭ Gōng Wáng, 600–560 BC) was from 590 to 560 BC the king of Chu, a major power during the Spring and Autumn period of ancient China. He was born Xiong Shen (Chinese: 熊審), and at the age of 10 succeeded his father King Zhuang of Chu, who was the Hegemon of China. However, in 575 BC King Gong was defeated by Chu's archrival Jin in the Battle of Yanling and Chu's power declined. He ruled for 31 years and was succeeded by his eldest son, King Kang of Chu. Three of King Gong's younger sons also ascended the throne, all by treacherous means.\n\nBattle of Yanling\n\nWhen King Gong ascended the throne in 590 BC Chu was the strongest power in China. In 597 BC his father King Zhuang defeated Chu's archrival Jin in the Battle of Bi and was recognized as the Hegemon by other states. However, King Gong's reign was marked by Chu's decisive defeat by the resurgent Jin in the 575 BC Battle of Yanling.\n\nThe battle was triggered by a series of minor events. In 577 BC, the Jin vassal state Zheng attacked the Chu vassal state Xu (許). The next year Chu attacked Zheng in revenge, and forced Zheng to switch its loyalty to Chu. Zheng then attacked Song, another Jin vassal state. In 575 BC, Duke Li of Jin raised an army to attack Zheng, while King Gong led the Chu army north to defend his new ally.\n\nThe two forces met at Yanling, and Jin defeated Chu by attacking its weaker flanks manned by the poorly trained Zheng and Dongyi soldiers. During the battle King Gong was shot in the eye by an arrow. Despite his wound, at the end of the day King Gong summoned the chief military commander Zifan to discuss the battle plan for the next day, but caught Zifan drunk. King Gong decided to retreat and Zifan later committed suicide.\n\nConflicts with Wu\n\nWhile Chu was preoccupied with its rivalry with Jin, the formerly insignificant state of Wu began to rise to its east. In 598 BC, during King Zhuang's reign, Chu minister Wuchen (Duke of Shen) defected to Jin after a personal dispute with general Zifan. In 584 BC Wuchen went on a mission to Wu on behalf of Jin to establish an alliance between the two states. He brought along 100 charioteers who taught the Wu army to use chariots, and successfully incited Wu to revolt against Chu. The Wu king Shoumeng invaded Chu, annexed the Chu city of Zhoulai, and took over many tribes that had been loyal to Chu.\n\nIn 570 BC Chu general Zichong attacked Wu, reaching Mount Heng (in present-day Dangtu County) in Wu territory. However, Wu counterattacked and took the important Chu city of Jia. Zichong was blamed for the loss and died from an illness. For the ensuing seven decades Chu would be consumed by a series of at least ten wars or battles with Wu, culminating in the 506 BC Battle of Boju, when the Wu army would capture and destroy the Chu capital Ying.\n\nPosthumous title\n\nIn 560 BC, when King Gong was dying from illness, he summoned his ministers and requested to be given the pejorative posthumous title of Ling (靈) or Li (厲), expressing shame for losing the Battle of Yanling and causing disgrace to the nation. The ministers agreed at his insistence, but after his death they instead gave him the title Gong, meaning \"humbly reverent\". The pejorative title King Ling was later given to King Gong's second son Xiong Wei, who would in 541 BC murder his nephew Jia'ao and usurp the throne.\n\nSuccession\n\nKing Gong had at least five sons, four of whom became king. When King Gong died in 560 BC, he was succeeded by his eldest son King Kang of Chu, who died in 545 BC after 15 years of reign and was succeeded by his son Xiong Yuan (posthumous title Jia'ao). Four years later King Gong's second son Prince Wei murdered Jia'ao and his two sons when he was ill, and usurped the throne. Prince Wei was later given the pejorative posthumous title King Ling of Chu.\n\nIn 529 BC when King Ling was on an expedition against the State of Xu, his three younger brothers staged a coup d'etat and killed his son Crown Prince Lu. Prince Bi, the third brother, ascended the throne (posthumous title Zi'ao), and the fourth brother Prince Zixi became the prime minister. When news of the coup reached King Ling's troops they abandoned him en masse, and in desperation King Ling killed himself.\n\nHowever, Prince Qiji, the fifth brother, concealed the truth about King Ling's death from Zi'ao and Zixi. Instead, he pretended to be defeated by King Ling and said the king would soon return to the capital. Zi'ao and Zixi were so fearful that they both committed suicide; Zi'ao had been king for less than twenty days. Prince Qiji then ascended the throne and would come to be known as King Ping of Chu."}, {"url": "https://wiki2.org/en/King_Zhuang_of_Chu", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nKing of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén).\n\nYouTube Encyclopedic\n\n1 / 3 Views: 404 277 721 4 301\n\nChinese Ding Vessels in 700 BC\n\n華晨宇《齊天》電影《悟空傳Wukong zhuan》主題曲《高清動態歌詞》\n\n大壯《我們不一樣》HD動態歌詞 Transcription\n\nReferences"}, {"url": "https://www.liquisearch.com/king_zhuang_of_chu", "page_content": "King Zhuāng of Chǔ (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao Chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally \"Amazing with one cry\")."}]}