{"Zhuang of Chu was the son of King Huai of Chu.": [{"url": "https://chockchin.org/meet-the-family-king-zhuang-of-chu/", "page_content": "King Zhuang of Chu was one of our ancestors.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn period in ancient China.\n\nHis personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu “to enquire about ding in the central plains”, i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán – see the entry at wiktionary.)[3]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu “amaze [others] with one cry” (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén – see the entry at wiktionary).\n\nThe Chu were known for their unique and elaborate bronze works. Here’s an example:\n\nhttps://en.wikipedia.org/wiki/King_Zhuang_of_Chu\n\nPhoto credit for image of King Zhuang: http://en.hubei.gov.cn/culture/highlights/201608/t20160805_876410.shtml"}, {"url": "http://chinaknowledge.de/History/Zhou/personschuzhuangwang.html", "page_content": "Dec 2, 2010 © Ulrich Theobald\n\nChu Zhuangwang 楚莊王 (r. 613-591) was a ruler of the state of Chu 楚 during the Spring and Autumn period 春秋 (770-5th cent. BCE) and was one of the so-called five hegemons (wuba 五霸). His personal name was Mi Xionglü 芈熊侶 (also written 熊呂 or 熊旅). The state of Chu is sometimes called Jing 荊, and Xionglü's posthumous title is also King Yan 嚴王.\n\nHe succeeded to the throne as son of King Mu 楚穆王 (r. 625-614). King Zhuang started his reign in a style of laissez-faire politics without much caring for the government. His advisors Wu Ju 伍舉 and Su Cong 蘇從 opened him his eyes, so that he started restructuring the administration and strengthening the royal power with the support of Sunshu Ao 孫叔敖. The state took over the care for hydraulic works, dykes and dams, he built up a strong army and quelled the internal rebellion of a certain Ruo Ao 若敖 (not King Ruo Ao, r. 791-764). His armies marched to the north, defeated the state of Song 宋 and the Rong 戎 barbarians of Luhun 陸渾, and lined up before the domain of the king of Zhou 周.\n\nWith the awareness of his power King Zhuang of Chu menaced the King of Zhou and threatened him that Chu would be able to replace the house of Zhou. The armies of Chu then conquered a handfull of smaller states like Yong 庸, Shu 舒 and Chen 陳, and in 602, King Zhuang was able to destroy the army of Jin 晉 at Bi 邲 (modern Xingyang 滎陽, Henan). Chu thus came to replace Jin as the hegemonial power of the Central States.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1991). Shiji cidian 史記辭典 (Jinan: Shandong jiaoyu chubanshe), 590.\n\nChen Quali 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 20.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 469.\n\nLiu Mengxun 柳孟訓 (1997). \"Chu Huaiwang de baye 楚莊王的霸業\", in Men Kui 門巋, Zhang Yanjin 張燕瑾, ed. Zhonghua guocui da cidian 中華國粹大辭典 (Xianggang: Guoji wenhua chuban gongsi), 3.\n\nWang Songling 王松齡, ed. (1991). Shiyong Zhongguo lishi zhishi cidian 實用中國歷史知識辭典 (Changchun: Jilin wenshi chubanshe), 401.\n\nXiong Tieji 熊鐵基, Yang Youli 楊有禮, ed. (1994). Zhongguo diwang zaixiang cidian 中國帝王宰相辭典 (Wuhan: Hubei jiaoyu chubanshe), 77.\n\nYi Xingguo 衣興國, ed. (1988). Shiyong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 44.\n\nXue Hong 薛虹 et al., ed. (1988). Zhongguo huangshi gongting cidian 中國皇室宮廷辭典 (Changchun: Jilin wenshi chubanshe), 773."}, {"url": "http://chinaknowledge.de/History/Zhou/personschuhuaiwang.html", "page_content": "Sep 21, 2011 © Ulrich Theobald\n\nChu Huaiwang 楚懷王 (r. 329-299) was a ruler of the state of Chu 楚 during the late Warring States period 戰國 (5th cent.-221 BCE). His personal name was Xiong Huai 熊槐 and he was the son of King Wei 楚威王 (r. 340-329).\n\nIn 318, the counsellor of the state of Wei 魏, Gongsun Yan 公孫衍, suggested to create an alliance (meng 盟) of five states (Han 韓, Wei, Zhao 趙, Chu and Yan 燕) against the state of Qin 秦, which by its continuing military campaigns threatened the state system of the Zhou dynasty 周 (11th. cent.-221 BC).\n\nThe alliance was concluded, and King Huai of Chu chosen as its leader, yet the allies were defeated by Qin. In 313 Qin wanted to disrupt a newly created alliance with the state of Qi 齊 and therefore sent out Zhang Yi 張儀, who offered some territory to Chu. King Huai was so much pleased by this vain offer that he broke with the state of Qi. In the end, Qin refused to cede territory, and King Huai was therefore so enraged that he attacked Qin. He was defeated in the battle of Danyang 丹陽 (located on the north banks of River Dan 丹水 in Henan) and retreated with 80,000 remaining troops.\n\nThe whole region of Hanzhong 漢中 (between today's Sichuan and Shaanxi) was lost and the generals Qu Xiong 屈匈 (Qu Gai 屈匄) and Feng Hou Chu 逢侯丑 were captured by Qin. Moreover, the states of Han, Wei and Qi attacked Chu for its perfidy to break the alliance and defeated Chu in the battle of Chuisha 垂沙 (modern Biyang 泌陽, Henan).\n\nIn 311, Qin offered King Huai of Chu to give him back half of the territory of Hanzhong, but instead of demanding back his territory, King Huai planned to take revenge on Zhang Yi. This clever diplomatist and counsellor of Qin bribed King Huai's officials Jin Shang 靳尚 and the king's favourite concubine Zheng Xiu 鄭袖, so that he was finally released.\n\nIn 299, King Zhaoxiang of Qin 秦昭襄王 (r. 307-251) lured King Huai into a trap masked as an official state meeting in Wuguan 武關 (near modern Danfeng 丹鳳, Shaanxi) and arrested the ruler of Chu. The country of Chu was now without a head, and therefore Prince Heng 橫 was enthroned as the new king (King Qingxiang 楚頃襄王, r. 299-263), although King Huai was still living. King Huai tried to escape to Zhao, but the king of Zhao refused to provide him asylum. King Huai died in Qin. His posthumous title Huai means \"the missed king\".\n\n\n\nA grandson of King Huai, Prince Xiong Xin 熊心, was the last ruler of Chu before it was conquered by Qin. When rebellions broke out against the Qin dynasty, the rebel leader, general Xiang Liang 項梁, a former general of Chu, enthroned Xiong Xin as ruler of Chu. His posthumous title is likewise King Huai of Chu 楚懷王 (r. 209-205 BCE). He was killed by the warlord Ying Bu 英布.\n\nSources:\n\nChen Quanli 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 26.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 470.\n\nYi Xingguo 衣興國, ed. (1988). Shiyoong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 89.\n\nWuhan daxue lishi xi Jianming lishi cidian bianxiezu 武漢大學歷史系《簡明歷史辭典》編寫組, ed. (1983). Jianming lishi cidian 簡明歷史辭典 (Shijiazhuang: Hebei renmin chubanshe), 18.\n\nZhang Huizhi 張撝之, Shen Qiwei 沈起煒, Liu Dezhong 劉德重, ed. (1999). Zhongguo lidai renmin da cidian 中國歷代人名大辭典 (Shanghai: Shanghai guji chubanshe), Vol. 2, 2393.\n\nZhang Ke 張克, Huang Kangbo 黃康白, Huang Fangdong 黃方東, ed. (1991). Shiji renmin cidian 史記人物辭典 (Nanning: Guangxi renmin chubanshe), 234."}, {"url": "https://wiki2.org/en/King_Zhuang_of_Chu", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nKing of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén).\n\nYouTube Encyclopedic\n\n1 / 3 Views: 404 277 721 4 301\n\nChinese Ding Vessels in 700 BC\n\n華晨宇《齊天》電影《悟空傳Wukong zhuan》主題曲《高清動態歌詞》\n\n大壯《我們不一樣》HD動態歌詞 Transcription\n\nReferences"}, {"url": "https://wiki.alquds.edu/?query=King_Zhuang_of_Chu", "page_content": "King of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén)."}, {"url": "https://everything.explained.today/%5C/King_Zhuang_of_Chu/", "page_content": "King Zhuang of Chu explained\n\nKing Zhuang of Chu (reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü, his ancestral name was Mi, and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions .[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" .\n\nNotes and References"}, {"url": "https://www.liquisearch.com/king_zhuang_of_chu", "page_content": "King Zhuāng of Chǔ (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao Chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally \"Amazing with one cry\")."}, {"url": "http://www.chinaknowledge.de/History/Han/personschuhuaiwang.html", "page_content": "Mar 8, 2011 © Ulrich Theobald\n\nKing Huai of Chu 楚懷王 (r. 209-205 BCE), personal name Mi Xiongxin 芈熊心, was a ruler enthroned at the end of the Qin period 秦 (221-206 BCE). He was a grandson of King Huai of Chu (personal name Mi Xionghuai 芈熊槐, r. 329-299), one of the last rulers of the state of Chu 楚 before Qin conquered this region.\n\nDuring the reign of the Qin dynasty, Mi Xiongxin lived as a commoner. When the first rebellions against the Qin broke out in 209, general Xiang Liang 項梁 decided making Mi Xiongxin not only king of Chu, but giving him the leading position over all rebels that joined against the Qin.\n\nMi Xiongxin agreed and took first residence in Xuchi 盱眙 (modern Xuchi, Jiangsu), and after Xiang Liang's death, in Pengcheng 彭城 (modern Xuzhou 徐州, Jiangsu). He was wholly dominated by the warlord Xiang Yu 項羽 and was forced to accompany him during all his campaigns.\n\nWhen Xiang Yu entered the capital of the Qin dynasty, Xianyang 咸陽 (modern Xianyang, Shaanxi), the warlord adopted the title of hegemonial king (bawang 霸王) and bestowed to the king of Chu the honorific title of Righteous Emperor (Yidi 義帝). Not soon thereafter, Xiang Yu had King Huai assassinated and made himself King of West Chu 西楚.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1996), Hanshu cidian 漢書辭典 (Jinan: Shandong jiaoyu chubanshe), 798."}, {"url": "https://infogalactic.com/info/King_Zhuang_of_Chu", "page_content": "From Infogalactic: the planetary knowledge core\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally: \"Amaze [the others] with one cry\").\n\nReferences"}, {"url": "http://chinaknowledge.de/History/Zhou/rulers-chu.html", "page_content": "Nov 1, 2018 © Ulrich Theobald\n\nDon't confound his regional state of the Zhou period with the empire of Chu 楚 (926-951), one of the Ten Kingdoms 十國 (902-979) of the Five Dynasties period 五代 (907-960).\n\nThe state of Chu 楚 was a regional state of the Zhou period 周 (11th cent.-221 BCE). It belonged to the larger polities that were able to survive until the end of the Warring States period 戰國 (5th cent.-221 BCE). Chu is known for its culture that was significantly different from that of the states of the Central Plain. Chu was not among the states that were distributed as a regional states at the beginning of the Western Zhou period 西周 (11th cent.-770 BCE). Its ruling dynasty was of a different origin than most of the regional dynasties of the Zhou empire. Another name of Chu is Jing 荊. Chu was first located in the valley of the River Han 漢 and then moved southeast into the Yangtze Valley. During the Spring and Autumn period 春秋 (770 - 5th cent. BCE) it gradually expanded towards the north and east.\n\nMap 1. The regional state of Chu 楚 (11th cent. - 223 BCE) Map according to Tan Qixiang 谭其骧 (1987), Zhongguo lishi ditu ji 中国历史地图集. Chu was located in the middle course of the Yangtze River and gradually expanded to the east and northeast. It played the role of temporary ally for the states of Qi and Qin, before the latter dominated over all regional states and founded the empire of Qin. Click to enlarge.\n\nThe semi-barbarian state of Chu becomes part of the middle kingdom\n\nThe ruling house of Chu derived its descendancy from the mythical Emperor Zhuan Xu 顓頊, himself being a grandson of the Yellow Emperor 黃帝. Zhuan Xu's great-grandson Zhong Li 重黎 was the minister for fire (huo zheng 火正) of the mythical Emperor Di Ku 帝嚳. For his merits earned in office, Zhong Li was bestowed the name of Zhu Rong 祝融. He was sent out to punish the rebellious lord of the waters, Gong Gong 共工, but Zhu Rong/Zhong Li was unable to kill Gong Gong. Enraged about this failure, Emperor Di Ku executed Zhong Li and had his brother Wu Hui 吳回 take over the duties as minister of fire. Wu Hui had six grandsons that were called Kun Wu 昆吾, Shen Hu 參胡, Peng Zu 彭祖, Hui Ren 會人, Ji Lian 季連 and an unnamed son that was given the family name of Cao 曹. Five branches of the family fell into oblivion, except the descendants of Ji Lian who adopted the family name of Xiong 熊 or Mi 羋 (originally written 嬭).\n\nExcavated objects from the late Warring States period prove that the reigning dynasty of Chu also bore the family name Yan 酓. Mi Xiong allegedly took part in King Wu's 周武王 conquest of the Shang empire 商 (17th-11th cent. BCE).\n\nIn the early decades of the Zhou period, King Cheng of Zhou 周成王 (r. 1116-1079 BCE) made the family Mi regional rulers over the country of Chu in the middle Yangtze valley. From that time on they adopted the family name Mi, yet the rulers retained the surname Xiong. Xiong might also be a prefix of the personal name worn by all members of the family. In the late 11th century King Zhao of Zhou 周昭王 undertook several military campaigns against Chu during one of which he died, while his own army drowned in the River Han. The rulers of Chu called themselves \"king\" (wang 王) and therefore demonstrated that they were actually not part of the system of regional states of the Zhou empire.\n\nYu Xiong's great-grandson Xiong Yi 熊繹 settled near Mt. Jingshan 荊山 (modern Nanzhang 南漳, Hubei) and, after being appointed regional ruler (zhuhou 諸侯) by King Cheng of Zhou, moved to Danyang 丹陽 (modern Zigui 秭歸, Hubei).\n\nViscount (zi 子) Xiong Qu 熊渠 became aware that the house of Zhou was weakening and expanded his rule along the middle Yangtze valley up into the valley of River Han. He conquered the statelets of Yong 庸 and Yangyue 揚粵. He made his oldest song Wukang 毋康 king of Goutan 句亶, his second son Zhihong 摯紅 king of E 鄂, and his youngest son Zhici 執疵 king of Yuezhang 越章. Later on he feared that the king of Zhou would attack him because of the usurpation of the title of king and stripped his sons off their ranks as kings.\n\nAfter the death of Viscount Xiong Shuang 熊霜 his three sons indeed contended for the throne of Chu. The youngest son, Jixun 季徇 (Xiong Xun 熊徇), was finally able to occupy the throne. When Fen Mao 蚡冒 (r. 758-741), also called Xiong Xun 熊眴, died, his younger brother Xiong Tong 熊通 assassinated the heir apparent and usurped the throne. He is posthumously called King Wu of Chu 楚武王 (r. 741-690) because he carried out numerous military campaigns, like that against the statelet of Sui 隨, whose marquis, hoping to escape defeat, offered to Xiong Tong to travel to the court of the King of Zhou to reconfirm Xiong Tong in his royal position, but the King of Zhou declined. Enraged about the King of Zhou's refusal, Xiong Tong decided to adopt the title of king without the permission by the Son of Heaven, concluded an alliance with the marquis of Sui and occupied the territory of the hundred Pu tribes 百濮 south of the Yangtze River. Xiong Tong later suspected the marquis of Sui of treason and planned to occupy his territory, but he died en route to the battlefield.\n\nHis son Xiong Zi 熊貲 mounted the throne. Zi is posthumously known as King Wen 楚文王 (r. 690-677). He was the first ruler of Chu who took residence in Ying 郢 (near modern Shashi 沙市, Hubei) instead of Danyang. Xiong Zi conquered several small states, like Xi 息 (modern Xixian 息縣， Henan), Shen 申 (modern Nanyang 南陽, Henan) and Deng 鄧 (modern Xiangfan 襄樊, Hubei). His son Zhuang'ao 莊敖 (ao was a kind of temple name, like the Chinese zong 宗), known as Xiong Jian 熊囏 (also written 熊艱), planned to kill his brother Xiong Yun 熊惲 (also written 熊頵), but the latter escaped to Sui and gained sufficient support to usurp the throne of his brother. Xiong Yun is posthumously known as King Cheng 楚成王 (r. 672-626). Unlike his predecessors, King Cheng was a peaceful ruler who sent appropriate tributes to the court of the king of Zhou, so that he was ordered to appease the barbarian tribes of the south instead of harassing the states in the Yellow River plain.\n\nIn 656 the hegemonial lord (ba 霸) Duke Huan of Qi 齊桓公 (r. 685-643) attacked Chu, but King Cheng was able to urge his troops to stop and concluded a peace alliance (meng 盟) in the conference of Zhaoling 召陵 (modern Yancheng 郾城, Henan). In his later years King Cheng waged war against the statelets of Xu 許, Xian 弦 (near modern Xixian, Henan), Huang 黃 (modern Huanchuan 潢川, Henan) and Ying 英. Duke Xiang of Song 宋襄公 (r. 650-637), the new hegemonial lord, dispatched an envoy to Chu to offer a peaceful alliance, but the king refused and soon attacked Song 宋 and defeated the duke in the battle of Hong 泓 (modern Zhecheng 柘城, Henan) and also the state of Zheng 鄭. Duke Xiang died from a wound received during the battle.\n\nIn 634 Duke Xi of Lu 魯僖公 (r. 659-627) arrived at the court of Chu and requested an army to punish the Duke of Qi 齊. King Cheng sent out the Marquis of Shen 申 who conquered the territory of Gu 穀, where Duke Huan's son Yong 雍 was instated as the local governor. The other sons of the Duke of Qi fled to Chu and were all made nobles in Chu. The statelet of Kui 夔 was conquered, and then King Cheng attacked the state of Song. The Duke of Song requested support by the army of Jin 晉. King Cheng thereupon withdrew because Duke Wen of Jin 晉文公 (r. 636-628), had been his exiled guest for a long time, and sent only out Ziyu 子玉 with a small contingent that was defeated.\n\nAgainst the advice of Prime Minister (lingyin 令尹) Zishang 子上, King Chen nominated his beloved son Shangchen 商臣 heir apparent. Later on he deposed Shangchen in favour to Zhi 職. Shangchen thereupon arrested King Cheng and forced him to commit suicide. He mounted the throne, posthumously called King Mu 楚穆王 (r. 626-614). His chief counsellor was Pan Chong 潘崇. King Mu conquered the statelets of Jiang 江 (modern Xixian, Henan) and Lu 六 (a special reading, modern Lu'an 六安, Anhui) and attacked the state of Chen 陳.\n\nHe was succeeded by his son Lü 侶, who is posthumously known as King Zhuang 楚莊王 (r. 614-591). King Zhuang did not attend the court, indulged in pleasures and even ordered to execute those who dared remonstrating against him. Wu Ju 伍舉 thereupon used a riddle to admonish him, but without success. Only Su Cong 蘇從 was able to open the king's eyes so that he started caring for political matters again. During his campaign against the Rong barbarians 戎 of Luhun 陸渾, King Zhuang visited the capital of the kings of Zhou in Luoyang 洛陽 (modern Luoyang, Henan) and was received by royal grandson Man 王孫滿. The latter convinced him that the Heavenly Mandate (tianming 天命) of the Zhou dynasty had not yet ended, in spite of the obvious weakness of the royal house.\n\nIn 597 Chu defeated the army of Jin near Bi 邲 (near modern Zhengzhou 鄭州, Henan). In 594 Chu besieged the capital of Song for five months and conquered the statelet of Yong 庸 (near modern Zhushan 竹山, Hubei), later Shu-Liao 舒蓼 (modern Shucheng 舒城, Anhui) and Xiao 蕭 (near modern Xuzhou 徐州, Jiangsu).\n\nAfter the conquest of Chen, King Zhuang wanted to transform it into a district of Chu, but Shen Shu 申叔 of Qi criticized the king, so that he reinstated the house of Chen. Yet his next step was to conquer the state of Zheng. After the lord of Zheng had begged for mercy, King Zhuang released him and created an alliance of peace. In 575 the army of Chu defeated the relieve army from Jin in the battle of Yanling 鄢陵 (modern Yanling, Henan). The rule of King Zhuang is seen as the apogee of the power of the state of Chu among the regional states of the Zhou period. He was accepted as hegemonial lord (ba 霸).\n\nKing Zhuang was succeeded by his son Shen 審, posthumously known as King Gong 楚共王 (r. 591-560). During his reign the army of Chu was defeated by Jin. The next ruler was King Gong's son Zhao 招, posthumously known as King Kang 楚康王 (r. 560-545). The latter was succeeded by his son Yuan 員, who is also known as Jia'ao 郟敖 (r. 545-541). King Kang had four younger brothers called Wei 圍, Zibi 子比, Zixi 子晳 and Qiji 弃疾. Wei was made Prime Minister and commander of the army. When Jia'ao fell ill, Wei entered the palace, strangulated the king and killed his sons Mo 莫 and Pingxia 平夏. Zibi fled to Jin, while Wei mounted the throne. He is posthumously known as King Ling 楚靈王 (r. 541-529).\n\nChu as a major power of the Warring States\n\nKing Ling was able to assemble the regional rulers and to take over the lead as a factual hegemon of the regional states. Minister Wu Ju warned the king to become over-confident in his superior role, yet King Ling commanded the regional states in a campaign against the state of Wu 吳. Qing Feng 慶封, the commander of the troops of Wu, was kept prisoner, but dared criticizing King Ling for the way his fathers had come to the throne of Chu, and was therefore immediately executed by the king. He had the Zhanghua Terrace 章華臺 built where he received noble refugees from other states. Prince Qiji was ordered to attack the state of Chen, and King Ling invited the marquis of Cai 蔡 in order to poison him. Prince Qiji conquered the headless state of Cai and usurped the throne of the small marquisate.\n\nIn 530 BCE, King Ling attacked the small state of Xu 徐, located northwest of the state of Wu, and Lai 賴 (modern Suizhou 隨州, Hubei). Chen was heavily deafeated and its dynasty brought to an end. At that moment, King Ling deliberated with his nobles whether he was strong enough to claim the same rights as the other regional rulers. Grand master (dafu 大夫) Xi Fu 析父 answered that in old times, the state of Chu had been a very remote and less developed country, but now the King of Zhou would not refuse to bestow to the King of Chu bronze tripods as a symbol of royal power, and none of the other states would refuse to exchange gifts with the state of Chu.\n\nWhen King Ling was on campaign against Wu in the camp of Ganxi 乾溪, the king of Wu was advised by Guan Cong 觀從, a son of a noble of Cai whom King Ling had killed. The King of Wu joined a secret alliance with the state of Yue 越, whose nobleman Chang Shouguo 常壽過 had also been insulted by the king of Chu. Wu and Yue attacked Cai and won over Qiji, who was able to kill the heir apparent of Chu, Prince Lu 祿. Zibi was enthroned as king of Chu, Zixi was made Prime Minister, and Qiji Minister of War (sima 司馬). Guan Cong thereupon travelled to the camp of King Ling and presented him with the facts of the rebellion at home. The army of Chu dispersed and left the king alone. King Ling wandered around in the wilderness and finally died of hunger because the new ruler had forbidden giving him anything to eat.\n\nThe new king, Zibi, was for a long time in an unclear state about the whereabouts of King Ling, and finally committed suicide, together with Zixi. Qiji renamed himself Xiong Ju 熊居 and proclaimed himself king of Chu. He is posthumously known as King Ping 楚平王 (r. 527-516).\n\nIn fear of revenge, King Ping demonstrated a benevolent government towards the common people and restored the territories of the states of Chen and Cai, enthroning members of the former ruling houses. The eastern parts of Chu were plundered by the armies of Wu during this interlude of internal war in Chu.\n\nKing Ping decided to marry his son, Crown Prince Jian 建, with a princess from Qin 秦. Yet the girl was so beautiful that the king decided to take her for himself, and she gave birth to Prince Zhen 軫. Grand Tutor (taifu 太傅) Wu She 伍奢 and Junior Tutor (shaofu 少傅) Fei Wuji 費無忌 intrigued against each other and instigated in the king the fear that the crown prince might prematurely usurp the throne. Prince Jian thereupon fled to the court of Song. Wu She's son Wu Zixu 伍子胥, who was an excellent strategist, was able to escape to the state of Wu, the arch-enemy of Chu.\n\nThe mother of Prince Jian was captured by the army of Wu when Prince Guang 光 of Wu was campaigning against Chen and Cai. A small border clash in Beiliang 卑梁 lead to an armed conflict between Chu and Wu, in which Wu conquered the territories of Zhongli 鐘離 and Juchao 居巢. King Ping was so threatened that he began fortifying the capital city Ying. When King Ping died, the nobles wanted to enthrone his younger brother Prince Zixi 子西, but he refused, so that the under-age prince Zhen was enthroned as ruler of Chu. He is posthumously known as King Zhao 楚昭王 (r. 516-489).\n\nAt the beginning of his reign, Prime Minister Zichang 子常 took revenge for Prince Jian and Wu She and killed the intriguer Fei Wuji. The reason for this was that a many nobles had fled to Wu, where they supported the troops of Chu against the own dynasty in Chu. Yet there were also some princes of Wu escaping trouble in the own country at the court of Chu.\n\nIn 509 BCE the army of Chu, commanded by Prince Zichang, was heavily defeated by Wu in the battle of Baiju 柏舉 (modern Macheng 麻城, Hubei). Wu Zixu as one of the competent military leaders of Wu even managed to conquer the capital of Chu in 506. As a revenge for the execution of his father, Wu Zixu had the tomb of King Ping desecrated. Commander Prince Zichang fled to the state of Zheng. King Zhao himself escaped to Yunmeng 雲夢 and then on to the former state of Sui, where he was hidden by his loyal courtiers and the population from the army of Wu.\n\nIn the meantime, minister Shen Baoxu 申鮑胥 was sent to the state of Qin to ask for relief troops, which were indeed able to defeat the troops of Wu that had advanced far into the country of the enemy until they reached Ji 稷 (modern Tongbai 桐柏, Henan). Prince Fugai 夫概, brother of the king of Wu, usurped the throne on this occasion but was driven out by the righteous king and fled to the court of Chu.\n\nStill on his way back to the capital, King Zhao of Chu swallowed the state of Tang 唐 (near modern Suizhou, Hubei), then Dun 頓 (modern Shangshui 商水, Henan) and Hu 胡 (modern Fuyang 阜陽, Anhui). There was another occasion in 504 when the army of Wu again invaded the state of Chu. Only with the death of King Helü 闔閭 of Wu (r. 514-496) the attention of Wu was directed against the state of Yue, and the danger from the east was gone.\n\nOn his sickbed, King Zhao wanted to cede the throne to his younger brother, yet all nobles refused, before Prince Zilü 子閭 conceded to become the successor of his brother. Yet when the King died on a campaign, the brothers decided to enthrone the king's son, Prince Zhang 章. He is posthumously known as King Hui 楚惠王 (r. 489-432). In 488 Prince Zixi invited the former Prince Jian's son Prince Sheng 勝 to come back to Chu. He was granted the title of Duke Bai 白公. Duke Bai planned to revenge his father's death, who had been killed in exile in Zheng.\n\nIn 481 BCE, the army of Jin attacked Zheng, and Zheng asked Chu for help. Instead of annihilating Zheng, commander Zixi left Zheng untouched. Duke Bai thereupon killed Zixi, Prince Ziqi 子綦 and Prime Minister Sima Ziqi 司馬子期 at the court and tried to kidnap King Hui. Yet the king was protected by his retainers and took refuge in the palace of the Queen Dowager of King Zhao.\n\nDuke Bai thereupon proclaimed himself king, but was assassinated by Prince Zigao 子高, called Duke Ye 葉公. In this year, Chu finally destroyed the state of Chen, in 447 the state of Cai, and in 445 the state of Qi 杞.\n\nIn 473, the armies of Yue had finally destroyed the state of Wu. In the northern parts of Wu, along the plain of the River Huai 淮, Chu began to expand its territory. King Hui was succeeded by his son Prince Zhong 中, who is posthumously known was King Jian 楚簡王 (r. 432-408). Under his reign, Chu conquered the statelet of Ju 莒 (modern Juxian 莒縣, Shandong) that had belonged to the territory of Qi. King Jian employed the famous military advisor Wu Qi 吳起, who reformed the army, so that Chu was able to conquer the southern regions inhabited by the non-Chinese peoples of the Yangyue 揚粵, namely the Dongting 洞庭 (Hunan) and Cangwu 蒼梧 (Guizhou) regions.\n\nKing Jian was succeeded by his son Prince Dang 當, posthumously known as King Sheng 楚聲王 (r. 408-402). King Sheng was killed by \"robbers\" (presumably nobles or family members) and was succeeded by his son Prince Yi 疑, posthumously known as King Dao 楚悼王 (r. 402-381). Under his reign, Chu contended with the troops of the new states of Han 韓, Zhao 趙 and Wei 魏, the successor states of Jin. King Dao was succeeded by his son Prince Zang 臧, posthumously known as King Su 楚肅王 (r. 381-370). Because King Su had no sons, he left the throne to his younger brother Prince Liangfu 良夫, who is posthumously known as King Xuan 楚宣王 (r. 370-340). At the end of the latter's reign, the armies of Qin attacked Chu. At that time, Qin was governed by counsellor Shang Yang 商鞅.\n\nKing Xuan's son Prince Shang 商 succeeded to the throne in Chu, posthumously known as King Wei 楚威王 (r. 340-329). He was able to defeat the armies of the state of Qi, which was at that time disturbed by inner quarrels. King Wei also defeated the armies of the kingdom of Yue and occupied a large part of its territory, so that Chu was now the sole state in the southern parts of China. In 306, Yue was destroyed by Chu.\n\nChu as a large but weak state between Qin and Qi\n\nWhen King Wei died, the state of Wei used this opportunity and conquered part of its northern territory. King Wei's successor was his son Prince Guai 槐, posthumously known as King Huai 楚懷王 (r. 329-299). In 323 BCE he took revenge and attacked the territory of Wei, seizing eight counties. The next military target was the state of Qi, yet at that time the military adviser Chen Zhen 陳軫 dwelled at the court of Qi and was dispatched to the camp of counsellor Zhao Yang 昭陽, highest commander of the army of Chu. Chen Zhen persuaded Zhao Yang with the parable of drawing feet to a snake that he would have no advantage in defeating the army of Qi, so that Zhao Yang withdrew. At least, Chu was able to conclude an alliance with the states of Qin, Wei and Qi that was initiated by the famous diplomatist Zhang Yi 張儀.\n\nThis alliance became important in 318 BCE, when an alliance, concluded with the help of Su Qin 蘇秦, attacked the state of Qin. King Huai took over the lead of the allies and penetrated into the Hangu Pass 函谷關, yet the allies withdrew without forcing Qin to battle.\n\nIn 313, things had changed and Chu was in alliance with Qi. The king of Qin decided to send Zhang Yi to Chu in order to persuade King Huai to change side again and, in the end, to isolate Chu. Chen Zhen was well aware of this and warned King Huai, but he refused to accept the warning. In the end, the enraged king of Qi concluded an alliance with Qin. King Huai, on his side, made ready the troops for a campaign against Qin. Again, Chen Zhen warned the king and suggested offering Qin a city to restore the former alliance. King Huai ignored the warning, and so the army of Qin destroyed that of Chu at Danyang 丹陽 in 312, captured a huge humber of troops and officers, and occupied the region of Hanzhong 漢中. At Lantian 藍田, the armies battled a second time, and the fresh defeat of Chu instigated Han and Wei to seize some more territory from Chu.\n\nA year later, Qin suggested concluding peace and sent Zhang Yi to the court of Chu. King Huai immediately arrested Zhang Yi and planned to kill him, but Zhang established contact with Jin Shang 靳尚, who explained to King Huai that Qin would attack Chu again. He also spoke with the King's favourite, Lady Zheng Xiu 鄭袖, and threatened her that the king of Qin would try to purchase peace by sending beautiful girls to King Huai. The Lady then managed the release of Zhang Yi, and peace was made with Qin. Shortly after, the Chu embassador to Qi returned, Qu Yuan 屈原, and reproached the king for not having executed Zhang Yi.\n\nIn 310 BCE, the King Min of Qi 齊湣王 (r. 324-284) sent an envoy to the court of Chu and explained that, after the death of King Hui in Qin, the situation had changed thoroughly, and suggested to conclude a common alliance with Han, Wei, Zhao and Yan 燕 against Qin. Zhao Ju 昭雎 convinced King Huai that it was better to be part of the alliance around Qi and to win back the territory once lost to Qin. Yet in 307, King Huai decided that he could also win territory by concluding a peaceful alliance with Qin. Two years later Qin, Han and Wei attacked Chu for its betrayal of the alliance. King Huai sent his crown prince as a hostage to Qin and requested military support against the three states.\n\nIn 304, the crown prince of Chu had a private quarrel with some nobles of Qin. When he accidentally killed one of them, he fled and returned to Chu. In order to take revenge for the murder, Qin attacked Chu, supported by troops of Qi, Han and Wei, and defeated Chu at Chuisha 垂沙. A year later, Qin undertook a second campaign against Chu and heavily defeated the army of Chu. King Huai thereupon sent his crown prince as a hostage to Qi, an ally of Qin, and requested peace.\n\nOnly after a further campaign and after King Zhao of Qin had sent an urgent letter, King Huai of Chu consented to a meeting with the king of Qin at the Wuguan Pass 武關. Yet King Huai did not trust Qin and feared that he might be caught in a trap. Zhao Ju suggested not to meet the king of Qin, but the King's younger son urged him to go. In the end, King Huai was escorted to Xianyang 咸陽, the capital of Qin, and was threatened to cease territory before concluding an alliance. He refused and was arrested and detained.\n\nAt home, the situation was precarious. Both the king and the crown prince were held hostages in Qin, and Zhao Ju argued that it was against etiquette to enthrone a younger son as long as the ruler was living. This meant that there was no head of government as long as King Huai was in Qin. The court brooded over the issue and finally invited Prince Heng 橫 to come to the capital Ying. He was enthroned as king of Ch, posthumously known as King Qingxiang 楚頃襄王 (r. 299-263).\n\nThe king of Qin thereupon continued his campaigning against Chu, defeated its army, and seized territory in the north. A year later, King Huai managed to escape, but because the roads to Chu were blocked by Qin, he fled to the state of Zhao, but fearing the anger of Qin, King Huiwen of Zhao 趙惠文王 (r. 299-266) refused to offer protection. King Huai was finally captured by the bloodhounds of Qin and brought back to Xianyang, where he died a year later. At least, his corpse was allowed to be transferred back to his native state, where he was buried with greatest honours.\n\nIn 293 BCE, general Bai Qi 白起 massacred the army of Han. Threatened by this cruel way of warfare, King Qingxiang agreed to conclude a marriage of peace with Qin. This new alliance led to a campaign in 284, carried out by Qin, Chu, Han, Wei, Zhao and Yan and targeted against the state of Qi in the east. Chu so regained the region of Huaibei 淮北. In 281, King Qingxiang was persuaded to resume war against Qin, in order to gain more territory. He first concluded an alliance with Qin and Han and planned to use this opportunity to conquer some territory of the patriarchal kings of Zhou around Luoyang. King Nan of Zhou 周王赧 (r. 315-256) thereupon sent his relative, Duke Wu 武公, to Zhaozi 昭子, the counsellor of Chu. Duke Wu explained to Zhaozi that the destruction of the house of Zhou meant a thorough dissolution of the world order and would bring only chaos to the state of Chu. King Qingxiang thereupon abandoned this plan.\n\nThe campaigns against Qin continued, but in 278 BCE, general Bai Qi advanced to the capital of Chu and defiled the tombs of the kings of Chu. The capital of Chu was moved to the ancient site of Chen (modern Huaiyang 淮陽, Henan) It was only in 276 that the army of Chu was able to recover some of its core territory. Chu was even able to supporte Han, Zhao and Wei in a campaign against Yan. This was only possible because of an armistice bargained with Qin, covered by the crown prince as a hostage dwelling in Qin.\n\nWhen King Qingxiang fell ill, his son Prince Xiong Yuan 熊元 (or Wan 完) managed to escape from Qin and was enthroned as the new king of Chu. He is posthumously known as King Kaolie 楚考烈王 (r. 263-238). The new king immediately appointed his trusted Counsellor-to-the-Left (zuoxi 左徒), Lord Chunshen 春申君, as Prime Minister. Under the Lord's administration, the state of Chu was able to recover for a while. The capital was first shifted to Juyang 巨陽 (modern Taihe 太和, Anhui), later to to Shouchun 壽春 (modern Shouxian 壽縣, Anhui) further to the east. Lord Chunshen met with Lord Xinling 信陵君 of Wei and forged an alliance that was able to defeat Qin in 257. A year later, Chu conquered the state of Lu.\n\nKing Kaolie was succeeded by his son Prince Dao 悍 (or Yu 煜), who is posthumously known as King You 楚幽王 (r. 238-228). Li Yuan 李園, a powerful noble, used this personal change to assassinate Lord Chunshen. King You was succeeded by his younger half-brother You 猶 (or Hao 郝), who is posthumously known as King Ai 楚哀王 (r. 228). He only ruled for two months before he was overthrown and killed by his older half-brother Fuchu 負芻 (r. 228-223).\n\nThe rule of the last kings of Chu was overshadowed by a growing military success of the state of Qin that succeedingly conquered the states of Han, Zhao and Wei. In 224, the Qin general Wang Jian 王翦 defeated the army of Chu and killed general Xiang Yan 項燕, a great uncle of Xiang Yu 項羽, the eventual hegemonial king (bawang 霸王) of West Chu 西楚. A year later, Wang Jian and Meng Wu 蒙武 seized the capital of Chu, captured King Fuchu and transformed the state of Chu into a commandery of the state of Qin.\n\nThe name of Chu was often used as a name for imperial princedoms, and was one of the Ten States (Shiguo 十國) in the 10th century.\n\n\n\n\n\nTable 1. Rulers of the regional state of Chu 楚 Capitals: Danyang 丹陽 (modern Zigui 秭歸, Hubei), Ying 郢 (modern Jiangling 江陵 or Shashi 沙市, Hubei), Ruo 鄀 (Shangruo 上鄀; near modern Zhongxiang 鍾祥, Hubei), Yingchen 郢陳 (modern Huaiyang 淮陽, Henan), Juyang 巨陽 (near Taihe 太和, Anhui), Shouchun 壽春 (modern Shouxian 壽縣, Anhui) dynastic title personal name time Xiong Yi of Chu 楚熊繹, family name Mi 芈 (or Nai 嬭, Qian 芊, Xiong 熊, Yan 酓) Xiong Yi of Chu 楚熊乂 Xiong Tan of Chu 楚熊黮 Xiong Sheng of Chu 楚熊勝 Xiong Shang 楚熊煬 or Xiong Yang of Chu 楚熊揚 Xiong Qu of Chu 楚熊渠 Xiong Wukang of Chu 楚熊無康 Zhi Hong of Chu 楚鷙紅 (or 摯紅) Xiong Yan of Chu 楚熊延 Xiong Yong of Chu 楚熊勇 848-838 Xiong Yan of Chu 楚熊嚴 838-828 Xiong Shuang of Chu 楚熊霜 828-822 Xiong Xun of Chu 楚熊徇 (or 熊狥) 822-800 Xiong E of Chu 楚熊鄂 (or 熊咢) 800-791 Ruo Ao of Chu 楚若敖 Mi Xiong Yi 芈熊儀 791-764 Xiao Ao of Chu 楚霄敖 Mi Xiong Kan 芈熊坎 764-758 Fen Mao of Chu 楚蚡冒 Mi Xiong Xuan 芈熊眴 (or Xiong Xun 熊㫬) 758-741 King Wu of Chu\n\n(Chu Wuwang 楚武王) Mi Xiong Tong 芈熊通 741-690 King Wen of Chu\n\n(Chu Wenwang 楚文王) Mi Xiong Zi 芈熊貲 690-677 Du Ao, King of Chu 楚王堵敖 Mi Xiong Jian 芈熊艱 677-672 King Cheng of Chu\n\n(Chu Chengwang 楚成王) Mi Jun 芈頵 672-626 King Mu of Chu\n\n(Chu Muwang 楚穆王) Mi Shangchen 芈商臣 625-614 King Zhuang of Chu\n\n(Chu Zhuangwang 楚莊王) Mi Lü 芈旅 614-591 King Gong of Chu\n\n(Chu Gongwang 楚共王) Mi Shen 芈審 591-560 King Kang of Chu\n\n(Chu Kangwang 楚康王) Mi Zhao 芈招 560-545 Jia Ao, King of Chu 楚王郟敖 Mi Jun 芈麇 545-451 King Ling of Chu\n\n(Chu Lingwang 楚靈王) Mi Qian 芈虔 541-529 King Ping of Chu\n\n(Chu Pingwang 楚平王) Mi Ju 芈居 529-516 King Zhao of Chu\n\n(Chu Zhaowang 楚昭王) Mi Zhen 芈軫 516-489 King Hui of Chu\n\n(Chu Huiwang 楚惠王) Mi Zhang 芈章 489-432 King Jian of Chu\n\n(Chu Jianwang 楚簡王) Mi Zhong 芈中 432-408 King Sheng of Chu\n\n(Chu Shengwang 楚聲王) Mi Dang 芈當 408-402 King Dao of Chu\n\n(Chu Daowang 楚悼王) Mi Yi 芈疑 402-381 King Su of Chu\n\n(Chu Suwang 楚肅王) Mi Zang 芈臧 381-370 King Xuan of Chu\n\n(Chu Xuanwang 楚宣王) Mi Liangfu 芈良夫 370-340 King Wei of Chu\n\n(Chu Weiwang 楚威王) Mi Shang 芈商 340-329 King Huai of Chu\n\n(Chu Huaiwang 楚懷王) Mi Guai 芈槐 329-299 King Qingxiang of Chu\n\n(Chu Qingxiangwang 楚頃襄王) Mi Heng 芈橫 299-263 King Kaolie of Chu\n\n(Chu Kaoliewang 楚考烈王) Mi Wan 芈完 263-238 King You of Chu\n\n(Chu Youwang 楚幽王) Mi Yu 芈煜 238-228 King Ai of Chu\n\n(Chu Aiwang 楚哀王) Mi Hao 芈郝 228 Fuchu, King of Chu 楚王負芻 Mi Fuchu 芈負芻 228-223 223 Chu destroyed by Qin 秦.\n\nSources:\n\nLi Ling 李零 (1992). \"Chu 楚\", in Zhongguo da baike quanshu 中國大百科全書, Zhongguo lishi 中國歷史 (Beijing/Shanghai: Zhongguo da baike quanshu chubanshe), Vol. 1, 109-110."}], "Zhuang of Chu was the younger brother of King Huai II.": [{"url": "http://chinaknowledge.de/History/Zhou/personschuzhuangwang.html", "page_content": "Dec 2, 2010 © Ulrich Theobald\n\nChu Zhuangwang 楚莊王 (r. 613-591) was a ruler of the state of Chu 楚 during the Spring and Autumn period 春秋 (770-5th cent. BCE) and was one of the so-called five hegemons (wuba 五霸). His personal name was Mi Xionglü 芈熊侶 (also written 熊呂 or 熊旅). The state of Chu is sometimes called Jing 荊, and Xionglü's posthumous title is also King Yan 嚴王.\n\nHe succeeded to the throne as son of King Mu 楚穆王 (r. 625-614). King Zhuang started his reign in a style of laissez-faire politics without much caring for the government. His advisors Wu Ju 伍舉 and Su Cong 蘇從 opened him his eyes, so that he started restructuring the administration and strengthening the royal power with the support of Sunshu Ao 孫叔敖. The state took over the care for hydraulic works, dykes and dams, he built up a strong army and quelled the internal rebellion of a certain Ruo Ao 若敖 (not King Ruo Ao, r. 791-764). His armies marched to the north, defeated the state of Song 宋 and the Rong 戎 barbarians of Luhun 陸渾, and lined up before the domain of the king of Zhou 周.\n\nWith the awareness of his power King Zhuang of Chu menaced the King of Zhou and threatened him that Chu would be able to replace the house of Zhou. The armies of Chu then conquered a handfull of smaller states like Yong 庸, Shu 舒 and Chen 陳, and in 602, King Zhuang was able to destroy the army of Jin 晉 at Bi 邲 (modern Xingyang 滎陽, Henan). Chu thus came to replace Jin as the hegemonial power of the Central States.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1991). Shiji cidian 史記辭典 (Jinan: Shandong jiaoyu chubanshe), 590.\n\nChen Quali 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 20.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 469.\n\nLiu Mengxun 柳孟訓 (1997). \"Chu Huaiwang de baye 楚莊王的霸業\", in Men Kui 門巋, Zhang Yanjin 張燕瑾, ed. Zhonghua guocui da cidian 中華國粹大辭典 (Xianggang: Guoji wenhua chuban gongsi), 3.\n\nWang Songling 王松齡, ed. (1991). Shiyong Zhongguo lishi zhishi cidian 實用中國歷史知識辭典 (Changchun: Jilin wenshi chubanshe), 401.\n\nXiong Tieji 熊鐵基, Yang Youli 楊有禮, ed. (1994). Zhongguo diwang zaixiang cidian 中國帝王宰相辭典 (Wuhan: Hubei jiaoyu chubanshe), 77.\n\nYi Xingguo 衣興國, ed. (1988). Shiyong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 44.\n\nXue Hong 薛虹 et al., ed. (1988). Zhongguo huangshi gongting cidian 中國皇室宮廷辭典 (Changchun: Jilin wenshi chubanshe), 773."}, {"url": "https://wiki2.org/en/King_Zhuang_of_Chu", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nKing of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén).\n\nYouTube Encyclopedic\n\n1 / 3 Views: 404 277 721 4 301\n\nChinese Ding Vessels in 700 BC\n\n華晨宇《齊天》電影《悟空傳Wukong zhuan》主題曲《高清動態歌詞》\n\n大壯《我們不一樣》HD動態歌詞 Transcription\n\nReferences"}, {"url": "https://books.google.com/books/about/A_History_Of_Chu_Volume_3.html?id=nNhDEAAAQBAJ", "page_content": "The fruit of late historian and accomplished Chu expert Zhang Zhengming’s long and dedicated research, A History of Chu reveals the intriguing history of a powerful feudal state in the Zhou dynasty. Chu, once deemed southern “barbarians,” gradually rose to prominence on the shores of the Yangtze as the Zhou court weakened. With King Zhuang recognized as hegemonial lord towards the late Spring and Autumn period, the Chu subdued many Central Plain states and eventually survived into the Warring States period as a major power. From its emergence to the realization of its ambitious conquests and regional hegemony, the Chu state, with its vast territory, boasted a culture that was distinctly different from the Central Plain states.\n\n\n\n\n\nZhang Zhengming spent years studying and gathering both historical records and archaeological finds, carefully compiling his findings into a Chu-centric narrative that previous studies of traditional Chinese history have lacked. A History of Chu documents the entirety of the Chu’s remarkable and dramatic existence.\n\n\n\n\n\nVolume 3 finishes with an account of the gradual decline of the once powerful Chu. Although the short-lived reforms in administration and the military initiated by the famous military strategist Wu Qi returned the Chu to a position of power during the Warring States period, the Chu’s prominence started to fall into obscurity under the rule of King Huai and the Chu was eventually subjugated by the increasingly dominant Qin. The Chu family was later revived as an insurgent force against the Qin’s imperial rule and was defeated by the Han after the collapse of the Qin dynasty."}, {"url": "https://chockchin.org/meet-the-family-king-zhuang-of-chu/", "page_content": "King Zhuang of Chu was one of our ancestors.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn period in ancient China.\n\nHis personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu “to enquire about ding in the central plains”, i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán – see the entry at wiktionary.)[3]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu “amaze [others] with one cry” (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén – see the entry at wiktionary).\n\nThe Chu were known for their unique and elaborate bronze works. Here’s an example:\n\nhttps://en.wikipedia.org/wiki/King_Zhuang_of_Chu\n\nPhoto credit for image of King Zhuang: http://en.hubei.gov.cn/culture/highlights/201608/t20160805_876410.shtml"}, {"url": "https://infogalactic.com/info/King_Zhuang_of_Chu", "page_content": "From Infogalactic: the planetary knowledge core\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, died 591 BC) was a monarch of the Zhou Dynasty State of Chu during the Spring and Autumn Period of ancient Chinese. His personal name was Xiong Lü, ancestral name Mi (芈), and King Zhuang was his posthumous title. He became one of the Five Hegemons and attempted to wrest control of China from the king of Zhou.\n\nKing Zhuang ascended the throne in 613 BC at a time when the Kingdom of Chu was in disarray. For the first three years of his reign, Zhuang wasted time on excessive hunting and lavish partying. Several courtiers were anxious about the king but none dared speak up as he had given orders that anyone who challenged his authority would be killed. When a particularly senior minister challenged him through a riddle, the king responded that he had been waiting for three years for someone from his court to show some nationalistic pride.\n\nThe king made Sunshu Ao chancellor and began a series of reforms. Chu's agricultural output improved significantly during his reign, aided by Sunshu Ao's comprehensive dam-works and an enormous planned reservoir created in modern-day northern Anhui province. In 611 BC he annexed the State of Yong (庸国), a move which made Chu much stronger.\n\nAfter some overwhelming victories at the head of his army, King Zhuang attempted to take the place of King Ding of Zhou. He asked a messenger from Zhou about the weight of the Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China at the time but was rebuffed.\n\nIn the Battle of Bi, his army defeated the State of Jin, another strong state at that time. Later he achieved hegemony amongst some other states. His progress from lazy regent to a hegemon of his time gave rise to the Chinese Four-character idiom of yī mǐng jīng rén (Chinese: 一嗚驚人; literally: \"Amaze [the others] with one cry\").\n\nReferences"}, {"url": "http://chinaknowledge.de/History/Zhou/personschuhuaiwang.html", "page_content": "Sep 21, 2011 © Ulrich Theobald\n\nChu Huaiwang 楚懷王 (r. 329-299) was a ruler of the state of Chu 楚 during the late Warring States period 戰國 (5th cent.-221 BCE). His personal name was Xiong Huai 熊槐 and he was the son of King Wei 楚威王 (r. 340-329).\n\nIn 318, the counsellor of the state of Wei 魏, Gongsun Yan 公孫衍, suggested to create an alliance (meng 盟) of five states (Han 韓, Wei, Zhao 趙, Chu and Yan 燕) against the state of Qin 秦, which by its continuing military campaigns threatened the state system of the Zhou dynasty 周 (11th. cent.-221 BC).\n\nThe alliance was concluded, and King Huai of Chu chosen as its leader, yet the allies were defeated by Qin. In 313 Qin wanted to disrupt a newly created alliance with the state of Qi 齊 and therefore sent out Zhang Yi 張儀, who offered some territory to Chu. King Huai was so much pleased by this vain offer that he broke with the state of Qi. In the end, Qin refused to cede territory, and King Huai was therefore so enraged that he attacked Qin. He was defeated in the battle of Danyang 丹陽 (located on the north banks of River Dan 丹水 in Henan) and retreated with 80,000 remaining troops.\n\nThe whole region of Hanzhong 漢中 (between today's Sichuan and Shaanxi) was lost and the generals Qu Xiong 屈匈 (Qu Gai 屈匄) and Feng Hou Chu 逢侯丑 were captured by Qin. Moreover, the states of Han, Wei and Qi attacked Chu for its perfidy to break the alliance and defeated Chu in the battle of Chuisha 垂沙 (modern Biyang 泌陽, Henan).\n\nIn 311, Qin offered King Huai of Chu to give him back half of the territory of Hanzhong, but instead of demanding back his territory, King Huai planned to take revenge on Zhang Yi. This clever diplomatist and counsellor of Qin bribed King Huai's officials Jin Shang 靳尚 and the king's favourite concubine Zheng Xiu 鄭袖, so that he was finally released.\n\nIn 299, King Zhaoxiang of Qin 秦昭襄王 (r. 307-251) lured King Huai into a trap masked as an official state meeting in Wuguan 武關 (near modern Danfeng 丹鳳, Shaanxi) and arrested the ruler of Chu. The country of Chu was now without a head, and therefore Prince Heng 橫 was enthroned as the new king (King Qingxiang 楚頃襄王, r. 299-263), although King Huai was still living. King Huai tried to escape to Zhao, but the king of Zhao refused to provide him asylum. King Huai died in Qin. His posthumous title Huai means \"the missed king\".\n\n\n\nA grandson of King Huai, Prince Xiong Xin 熊心, was the last ruler of Chu before it was conquered by Qin. When rebellions broke out against the Qin dynasty, the rebel leader, general Xiang Liang 項梁, a former general of Chu, enthroned Xiong Xin as ruler of Chu. His posthumous title is likewise King Huai of Chu 楚懷王 (r. 209-205 BCE). He was killed by the warlord Ying Bu 英布.\n\nSources:\n\nChen Quanli 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 26.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 470.\n\nYi Xingguo 衣興國, ed. (1988). Shiyoong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 89.\n\nWuhan daxue lishi xi Jianming lishi cidian bianxiezu 武漢大學歷史系《簡明歷史辭典》編寫組, ed. (1983). Jianming lishi cidian 簡明歷史辭典 (Shijiazhuang: Hebei renmin chubanshe), 18.\n\nZhang Huizhi 張撝之, Shen Qiwei 沈起煒, Liu Dezhong 劉德重, ed. (1999). Zhongguo lidai renmin da cidian 中國歷代人名大辭典 (Shanghai: Shanghai guji chubanshe), Vol. 2, 2393.\n\nZhang Ke 張克, Huang Kangbo 黃康白, Huang Fangdong 黃方東, ed. (1991). Shiji renmin cidian 史記人物辭典 (Nanning: Guangxi renmin chubanshe), 234."}, {"url": "https://wiki.alquds.edu/?query=King_Zhuang_of_Chu", "page_content": "King of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén)."}, {"url": "https://www.primidi.com/emperor_yi_of_chu/biography/as_king_huai_ii_of_chu", "page_content": "As King Huai II of Chu\n\nIn 209 BC, the Daze Village Uprising to overthrow the Qin Dynasty erupted under the leadership of Chen Sheng, who proclaimed himself \"King of Zhangchu\" (\"King of rising Chu\"). Although Chen's uprising was crushed by the imperial forces, other rebel forces had sprouted throughout China to overthrow Qin and restore the former six states annexed by Qin about two decades ago. The leader of the Chu rebel force, Xiang Liang, was advised by Fan Zeng to seek a member of the Chu royal family and install him on the throne, in order to garner more support from the people. Xiang found Xiong Xin, a shepherd, and installed him on the throne of Chu in the summer of 208 BC, with the title of \"King Huai II of Chu\".\n\nKing Huai II was effectively a puppet ruler, as the military power of Chu was actually in the hands of Xiang Liang. However, after Xiang was killed at the Battle of Dingtao in the winter of 208 BC, the military power of Chu fell into the hands of King Huai II and some Chu generals, with the king gradually beginning to assert his authority. Following that, King Huai II commissioned Song Yi and Liu Bang to lead two armies to attack Qin, promising that whoever managed to enter Guanzhong (heartland of Qin) first would be granted the title of \"King of Guanzhong\". Xiang Liang's nephew, Xiang Yu, was put as second-in-command to Song Yi's army, which was sent to attack the Qin forces led by Zhang Han. Zhang's army was besieging Handan, the capital city of the Zhao state, and Song Yi refused to advance any further to assist the Zhao forces. Xiang took Song by surprise in a military conference and killed Song on charges of treason. Xiang sent a messenger to inform King Huai II, and the king approved of Xiang's command of the army reluctantly. In the winter of 207 BC, Liu Bang's army arrived in Guanzhong before Xiang and the last Qin ruler Ziying surrendered, marking the end of the Qin Dynasty."}, {"url": "http://chinaknowledge.de/History/Zhou/rulers-chu.html", "page_content": "Nov 1, 2018 © Ulrich Theobald\n\nDon't confound his regional state of the Zhou period with the empire of Chu 楚 (926-951), one of the Ten Kingdoms 十國 (902-979) of the Five Dynasties period 五代 (907-960).\n\nThe state of Chu 楚 was a regional state of the Zhou period 周 (11th cent.-221 BCE). It belonged to the larger polities that were able to survive until the end of the Warring States period 戰國 (5th cent.-221 BCE). Chu is known for its culture that was significantly different from that of the states of the Central Plain. Chu was not among the states that were distributed as a regional states at the beginning of the Western Zhou period 西周 (11th cent.-770 BCE). Its ruling dynasty was of a different origin than most of the regional dynasties of the Zhou empire. Another name of Chu is Jing 荊. Chu was first located in the valley of the River Han 漢 and then moved southeast into the Yangtze Valley. During the Spring and Autumn period 春秋 (770 - 5th cent. BCE) it gradually expanded towards the north and east.\n\nMap 1. The regional state of Chu 楚 (11th cent. - 223 BCE) Map according to Tan Qixiang 谭其骧 (1987), Zhongguo lishi ditu ji 中国历史地图集. Chu was located in the middle course of the Yangtze River and gradually expanded to the east and northeast. It played the role of temporary ally for the states of Qi and Qin, before the latter dominated over all regional states and founded the empire of Qin. Click to enlarge.\n\nThe semi-barbarian state of Chu becomes part of the middle kingdom\n\nThe ruling house of Chu derived its descendancy from the mythical Emperor Zhuan Xu 顓頊, himself being a grandson of the Yellow Emperor 黃帝. Zhuan Xu's great-grandson Zhong Li 重黎 was the minister for fire (huo zheng 火正) of the mythical Emperor Di Ku 帝嚳. For his merits earned in office, Zhong Li was bestowed the name of Zhu Rong 祝融. He was sent out to punish the rebellious lord of the waters, Gong Gong 共工, but Zhu Rong/Zhong Li was unable to kill Gong Gong. Enraged about this failure, Emperor Di Ku executed Zhong Li and had his brother Wu Hui 吳回 take over the duties as minister of fire. Wu Hui had six grandsons that were called Kun Wu 昆吾, Shen Hu 參胡, Peng Zu 彭祖, Hui Ren 會人, Ji Lian 季連 and an unnamed son that was given the family name of Cao 曹. Five branches of the family fell into oblivion, except the descendants of Ji Lian who adopted the family name of Xiong 熊 or Mi 羋 (originally written 嬭).\n\nExcavated objects from the late Warring States period prove that the reigning dynasty of Chu also bore the family name Yan 酓. Mi Xiong allegedly took part in King Wu's 周武王 conquest of the Shang empire 商 (17th-11th cent. BCE).\n\nIn the early decades of the Zhou period, King Cheng of Zhou 周成王 (r. 1116-1079 BCE) made the family Mi regional rulers over the country of Chu in the middle Yangtze valley. From that time on they adopted the family name Mi, yet the rulers retained the surname Xiong. Xiong might also be a prefix of the personal name worn by all members of the family. In the late 11th century King Zhao of Zhou 周昭王 undertook several military campaigns against Chu during one of which he died, while his own army drowned in the River Han. The rulers of Chu called themselves \"king\" (wang 王) and therefore demonstrated that they were actually not part of the system of regional states of the Zhou empire.\n\nYu Xiong's great-grandson Xiong Yi 熊繹 settled near Mt. Jingshan 荊山 (modern Nanzhang 南漳, Hubei) and, after being appointed regional ruler (zhuhou 諸侯) by King Cheng of Zhou, moved to Danyang 丹陽 (modern Zigui 秭歸, Hubei).\n\nViscount (zi 子) Xiong Qu 熊渠 became aware that the house of Zhou was weakening and expanded his rule along the middle Yangtze valley up into the valley of River Han. He conquered the statelets of Yong 庸 and Yangyue 揚粵. He made his oldest song Wukang 毋康 king of Goutan 句亶, his second son Zhihong 摯紅 king of E 鄂, and his youngest son Zhici 執疵 king of Yuezhang 越章. Later on he feared that the king of Zhou would attack him because of the usurpation of the title of king and stripped his sons off their ranks as kings.\n\nAfter the death of Viscount Xiong Shuang 熊霜 his three sons indeed contended for the throne of Chu. The youngest son, Jixun 季徇 (Xiong Xun 熊徇), was finally able to occupy the throne. When Fen Mao 蚡冒 (r. 758-741), also called Xiong Xun 熊眴, died, his younger brother Xiong Tong 熊通 assassinated the heir apparent and usurped the throne. He is posthumously called King Wu of Chu 楚武王 (r. 741-690) because he carried out numerous military campaigns, like that against the statelet of Sui 隨, whose marquis, hoping to escape defeat, offered to Xiong Tong to travel to the court of the King of Zhou to reconfirm Xiong Tong in his royal position, but the King of Zhou declined. Enraged about the King of Zhou's refusal, Xiong Tong decided to adopt the title of king without the permission by the Son of Heaven, concluded an alliance with the marquis of Sui and occupied the territory of the hundred Pu tribes 百濮 south of the Yangtze River. Xiong Tong later suspected the marquis of Sui of treason and planned to occupy his territory, but he died en route to the battlefield.\n\nHis son Xiong Zi 熊貲 mounted the throne. Zi is posthumously known as King Wen 楚文王 (r. 690-677). He was the first ruler of Chu who took residence in Ying 郢 (near modern Shashi 沙市, Hubei) instead of Danyang. Xiong Zi conquered several small states, like Xi 息 (modern Xixian 息縣， Henan), Shen 申 (modern Nanyang 南陽, Henan) and Deng 鄧 (modern Xiangfan 襄樊, Hubei). His son Zhuang'ao 莊敖 (ao was a kind of temple name, like the Chinese zong 宗), known as Xiong Jian 熊囏 (also written 熊艱), planned to kill his brother Xiong Yun 熊惲 (also written 熊頵), but the latter escaped to Sui and gained sufficient support to usurp the throne of his brother. Xiong Yun is posthumously known as King Cheng 楚成王 (r. 672-626). Unlike his predecessors, King Cheng was a peaceful ruler who sent appropriate tributes to the court of the king of Zhou, so that he was ordered to appease the barbarian tribes of the south instead of harassing the states in the Yellow River plain.\n\nIn 656 the hegemonial lord (ba 霸) Duke Huan of Qi 齊桓公 (r. 685-643) attacked Chu, but King Cheng was able to urge his troops to stop and concluded a peace alliance (meng 盟) in the conference of Zhaoling 召陵 (modern Yancheng 郾城, Henan). In his later years King Cheng waged war against the statelets of Xu 許, Xian 弦 (near modern Xixian, Henan), Huang 黃 (modern Huanchuan 潢川, Henan) and Ying 英. Duke Xiang of Song 宋襄公 (r. 650-637), the new hegemonial lord, dispatched an envoy to Chu to offer a peaceful alliance, but the king refused and soon attacked Song 宋 and defeated the duke in the battle of Hong 泓 (modern Zhecheng 柘城, Henan) and also the state of Zheng 鄭. Duke Xiang died from a wound received during the battle.\n\nIn 634 Duke Xi of Lu 魯僖公 (r. 659-627) arrived at the court of Chu and requested an army to punish the Duke of Qi 齊. King Cheng sent out the Marquis of Shen 申 who conquered the territory of Gu 穀, where Duke Huan's son Yong 雍 was instated as the local governor. The other sons of the Duke of Qi fled to Chu and were all made nobles in Chu. The statelet of Kui 夔 was conquered, and then King Cheng attacked the state of Song. The Duke of Song requested support by the army of Jin 晉. King Cheng thereupon withdrew because Duke Wen of Jin 晉文公 (r. 636-628), had been his exiled guest for a long time, and sent only out Ziyu 子玉 with a small contingent that was defeated.\n\nAgainst the advice of Prime Minister (lingyin 令尹) Zishang 子上, King Chen nominated his beloved son Shangchen 商臣 heir apparent. Later on he deposed Shangchen in favour to Zhi 職. Shangchen thereupon arrested King Cheng and forced him to commit suicide. He mounted the throne, posthumously called King Mu 楚穆王 (r. 626-614). His chief counsellor was Pan Chong 潘崇. King Mu conquered the statelets of Jiang 江 (modern Xixian, Henan) and Lu 六 (a special reading, modern Lu'an 六安, Anhui) and attacked the state of Chen 陳.\n\nHe was succeeded by his son Lü 侶, who is posthumously known as King Zhuang 楚莊王 (r. 614-591). King Zhuang did not attend the court, indulged in pleasures and even ordered to execute those who dared remonstrating against him. Wu Ju 伍舉 thereupon used a riddle to admonish him, but without success. Only Su Cong 蘇從 was able to open the king's eyes so that he started caring for political matters again. During his campaign against the Rong barbarians 戎 of Luhun 陸渾, King Zhuang visited the capital of the kings of Zhou in Luoyang 洛陽 (modern Luoyang, Henan) and was received by royal grandson Man 王孫滿. The latter convinced him that the Heavenly Mandate (tianming 天命) of the Zhou dynasty had not yet ended, in spite of the obvious weakness of the royal house.\n\nIn 597 Chu defeated the army of Jin near Bi 邲 (near modern Zhengzhou 鄭州, Henan). In 594 Chu besieged the capital of Song for five months and conquered the statelet of Yong 庸 (near modern Zhushan 竹山, Hubei), later Shu-Liao 舒蓼 (modern Shucheng 舒城, Anhui) and Xiao 蕭 (near modern Xuzhou 徐州, Jiangsu).\n\nAfter the conquest of Chen, King Zhuang wanted to transform it into a district of Chu, but Shen Shu 申叔 of Qi criticized the king, so that he reinstated the house of Chen. Yet his next step was to conquer the state of Zheng. After the lord of Zheng had begged for mercy, King Zhuang released him and created an alliance of peace. In 575 the army of Chu defeated the relieve army from Jin in the battle of Yanling 鄢陵 (modern Yanling, Henan). The rule of King Zhuang is seen as the apogee of the power of the state of Chu among the regional states of the Zhou period. He was accepted as hegemonial lord (ba 霸).\n\nKing Zhuang was succeeded by his son Shen 審, posthumously known as King Gong 楚共王 (r. 591-560). During his reign the army of Chu was defeated by Jin. The next ruler was King Gong's son Zhao 招, posthumously known as King Kang 楚康王 (r. 560-545). The latter was succeeded by his son Yuan 員, who is also known as Jia'ao 郟敖 (r. 545-541). King Kang had four younger brothers called Wei 圍, Zibi 子比, Zixi 子晳 and Qiji 弃疾. Wei was made Prime Minister and commander of the army. When Jia'ao fell ill, Wei entered the palace, strangulated the king and killed his sons Mo 莫 and Pingxia 平夏. Zibi fled to Jin, while Wei mounted the throne. He is posthumously known as King Ling 楚靈王 (r. 541-529).\n\nChu as a major power of the Warring States\n\nKing Ling was able to assemble the regional rulers and to take over the lead as a factual hegemon of the regional states. Minister Wu Ju warned the king to become over-confident in his superior role, yet King Ling commanded the regional states in a campaign against the state of Wu 吳. Qing Feng 慶封, the commander of the troops of Wu, was kept prisoner, but dared criticizing King Ling for the way his fathers had come to the throne of Chu, and was therefore immediately executed by the king. He had the Zhanghua Terrace 章華臺 built where he received noble refugees from other states. Prince Qiji was ordered to attack the state of Chen, and King Ling invited the marquis of Cai 蔡 in order to poison him. Prince Qiji conquered the headless state of Cai and usurped the throne of the small marquisate.\n\nIn 530 BCE, King Ling attacked the small state of Xu 徐, located northwest of the state of Wu, and Lai 賴 (modern Suizhou 隨州, Hubei). Chen was heavily deafeated and its dynasty brought to an end. At that moment, King Ling deliberated with his nobles whether he was strong enough to claim the same rights as the other regional rulers. Grand master (dafu 大夫) Xi Fu 析父 answered that in old times, the state of Chu had been a very remote and less developed country, but now the King of Zhou would not refuse to bestow to the King of Chu bronze tripods as a symbol of royal power, and none of the other states would refuse to exchange gifts with the state of Chu.\n\nWhen King Ling was on campaign against Wu in the camp of Ganxi 乾溪, the king of Wu was advised by Guan Cong 觀從, a son of a noble of Cai whom King Ling had killed. The King of Wu joined a secret alliance with the state of Yue 越, whose nobleman Chang Shouguo 常壽過 had also been insulted by the king of Chu. Wu and Yue attacked Cai and won over Qiji, who was able to kill the heir apparent of Chu, Prince Lu 祿. Zibi was enthroned as king of Chu, Zixi was made Prime Minister, and Qiji Minister of War (sima 司馬). Guan Cong thereupon travelled to the camp of King Ling and presented him with the facts of the rebellion at home. The army of Chu dispersed and left the king alone. King Ling wandered around in the wilderness and finally died of hunger because the new ruler had forbidden giving him anything to eat.\n\nThe new king, Zibi, was for a long time in an unclear state about the whereabouts of King Ling, and finally committed suicide, together with Zixi. Qiji renamed himself Xiong Ju 熊居 and proclaimed himself king of Chu. He is posthumously known as King Ping 楚平王 (r. 527-516).\n\nIn fear of revenge, King Ping demonstrated a benevolent government towards the common people and restored the territories of the states of Chen and Cai, enthroning members of the former ruling houses. The eastern parts of Chu were plundered by the armies of Wu during this interlude of internal war in Chu.\n\nKing Ping decided to marry his son, Crown Prince Jian 建, with a princess from Qin 秦. Yet the girl was so beautiful that the king decided to take her for himself, and she gave birth to Prince Zhen 軫. Grand Tutor (taifu 太傅) Wu She 伍奢 and Junior Tutor (shaofu 少傅) Fei Wuji 費無忌 intrigued against each other and instigated in the king the fear that the crown prince might prematurely usurp the throne. Prince Jian thereupon fled to the court of Song. Wu She's son Wu Zixu 伍子胥, who was an excellent strategist, was able to escape to the state of Wu, the arch-enemy of Chu.\n\nThe mother of Prince Jian was captured by the army of Wu when Prince Guang 光 of Wu was campaigning against Chen and Cai. A small border clash in Beiliang 卑梁 lead to an armed conflict between Chu and Wu, in which Wu conquered the territories of Zhongli 鐘離 and Juchao 居巢. King Ping was so threatened that he began fortifying the capital city Ying. When King Ping died, the nobles wanted to enthrone his younger brother Prince Zixi 子西, but he refused, so that the under-age prince Zhen was enthroned as ruler of Chu. He is posthumously known as King Zhao 楚昭王 (r. 516-489).\n\nAt the beginning of his reign, Prime Minister Zichang 子常 took revenge for Prince Jian and Wu She and killed the intriguer Fei Wuji. The reason for this was that a many nobles had fled to Wu, where they supported the troops of Chu against the own dynasty in Chu. Yet there were also some princes of Wu escaping trouble in the own country at the court of Chu.\n\nIn 509 BCE the army of Chu, commanded by Prince Zichang, was heavily defeated by Wu in the battle of Baiju 柏舉 (modern Macheng 麻城, Hubei). Wu Zixu as one of the competent military leaders of Wu even managed to conquer the capital of Chu in 506. As a revenge for the execution of his father, Wu Zixu had the tomb of King Ping desecrated. Commander Prince Zichang fled to the state of Zheng. King Zhao himself escaped to Yunmeng 雲夢 and then on to the former state of Sui, where he was hidden by his loyal courtiers and the population from the army of Wu.\n\nIn the meantime, minister Shen Baoxu 申鮑胥 was sent to the state of Qin to ask for relief troops, which were indeed able to defeat the troops of Wu that had advanced far into the country of the enemy until they reached Ji 稷 (modern Tongbai 桐柏, Henan). Prince Fugai 夫概, brother of the king of Wu, usurped the throne on this occasion but was driven out by the righteous king and fled to the court of Chu.\n\nStill on his way back to the capital, King Zhao of Chu swallowed the state of Tang 唐 (near modern Suizhou, Hubei), then Dun 頓 (modern Shangshui 商水, Henan) and Hu 胡 (modern Fuyang 阜陽, Anhui). There was another occasion in 504 when the army of Wu again invaded the state of Chu. Only with the death of King Helü 闔閭 of Wu (r. 514-496) the attention of Wu was directed against the state of Yue, and the danger from the east was gone.\n\nOn his sickbed, King Zhao wanted to cede the throne to his younger brother, yet all nobles refused, before Prince Zilü 子閭 conceded to become the successor of his brother. Yet when the King died on a campaign, the brothers decided to enthrone the king's son, Prince Zhang 章. He is posthumously known as King Hui 楚惠王 (r. 489-432). In 488 Prince Zixi invited the former Prince Jian's son Prince Sheng 勝 to come back to Chu. He was granted the title of Duke Bai 白公. Duke Bai planned to revenge his father's death, who had been killed in exile in Zheng.\n\nIn 481 BCE, the army of Jin attacked Zheng, and Zheng asked Chu for help. Instead of annihilating Zheng, commander Zixi left Zheng untouched. Duke Bai thereupon killed Zixi, Prince Ziqi 子綦 and Prime Minister Sima Ziqi 司馬子期 at the court and tried to kidnap King Hui. Yet the king was protected by his retainers and took refuge in the palace of the Queen Dowager of King Zhao.\n\nDuke Bai thereupon proclaimed himself king, but was assassinated by Prince Zigao 子高, called Duke Ye 葉公. In this year, Chu finally destroyed the state of Chen, in 447 the state of Cai, and in 445 the state of Qi 杞.\n\nIn 473, the armies of Yue had finally destroyed the state of Wu. In the northern parts of Wu, along the plain of the River Huai 淮, Chu began to expand its territory. King Hui was succeeded by his son Prince Zhong 中, who is posthumously known was King Jian 楚簡王 (r. 432-408). Under his reign, Chu conquered the statelet of Ju 莒 (modern Juxian 莒縣, Shandong) that had belonged to the territory of Qi. King Jian employed the famous military advisor Wu Qi 吳起, who reformed the army, so that Chu was able to conquer the southern regions inhabited by the non-Chinese peoples of the Yangyue 揚粵, namely the Dongting 洞庭 (Hunan) and Cangwu 蒼梧 (Guizhou) regions.\n\nKing Jian was succeeded by his son Prince Dang 當, posthumously known as King Sheng 楚聲王 (r. 408-402). King Sheng was killed by \"robbers\" (presumably nobles or family members) and was succeeded by his son Prince Yi 疑, posthumously known as King Dao 楚悼王 (r. 402-381). Under his reign, Chu contended with the troops of the new states of Han 韓, Zhao 趙 and Wei 魏, the successor states of Jin. King Dao was succeeded by his son Prince Zang 臧, posthumously known as King Su 楚肅王 (r. 381-370). Because King Su had no sons, he left the throne to his younger brother Prince Liangfu 良夫, who is posthumously known as King Xuan 楚宣王 (r. 370-340). At the end of the latter's reign, the armies of Qin attacked Chu. At that time, Qin was governed by counsellor Shang Yang 商鞅.\n\nKing Xuan's son Prince Shang 商 succeeded to the throne in Chu, posthumously known as King Wei 楚威王 (r. 340-329). He was able to defeat the armies of the state of Qi, which was at that time disturbed by inner quarrels. King Wei also defeated the armies of the kingdom of Yue and occupied a large part of its territory, so that Chu was now the sole state in the southern parts of China. In 306, Yue was destroyed by Chu.\n\nChu as a large but weak state between Qin and Qi\n\nWhen King Wei died, the state of Wei used this opportunity and conquered part of its northern territory. King Wei's successor was his son Prince Guai 槐, posthumously known as King Huai 楚懷王 (r. 329-299). In 323 BCE he took revenge and attacked the territory of Wei, seizing eight counties. The next military target was the state of Qi, yet at that time the military adviser Chen Zhen 陳軫 dwelled at the court of Qi and was dispatched to the camp of counsellor Zhao Yang 昭陽, highest commander of the army of Chu. Chen Zhen persuaded Zhao Yang with the parable of drawing feet to a snake that he would have no advantage in defeating the army of Qi, so that Zhao Yang withdrew. At least, Chu was able to conclude an alliance with the states of Qin, Wei and Qi that was initiated by the famous diplomatist Zhang Yi 張儀.\n\nThis alliance became important in 318 BCE, when an alliance, concluded with the help of Su Qin 蘇秦, attacked the state of Qin. King Huai took over the lead of the allies and penetrated into the Hangu Pass 函谷關, yet the allies withdrew without forcing Qin to battle.\n\nIn 313, things had changed and Chu was in alliance with Qi. The king of Qin decided to send Zhang Yi to Chu in order to persuade King Huai to change side again and, in the end, to isolate Chu. Chen Zhen was well aware of this and warned King Huai, but he refused to accept the warning. In the end, the enraged king of Qi concluded an alliance with Qin. King Huai, on his side, made ready the troops for a campaign against Qin. Again, Chen Zhen warned the king and suggested offering Qin a city to restore the former alliance. King Huai ignored the warning, and so the army of Qin destroyed that of Chu at Danyang 丹陽 in 312, captured a huge humber of troops and officers, and occupied the region of Hanzhong 漢中. At Lantian 藍田, the armies battled a second time, and the fresh defeat of Chu instigated Han and Wei to seize some more territory from Chu.\n\nA year later, Qin suggested concluding peace and sent Zhang Yi to the court of Chu. King Huai immediately arrested Zhang Yi and planned to kill him, but Zhang established contact with Jin Shang 靳尚, who explained to King Huai that Qin would attack Chu again. He also spoke with the King's favourite, Lady Zheng Xiu 鄭袖, and threatened her that the king of Qin would try to purchase peace by sending beautiful girls to King Huai. The Lady then managed the release of Zhang Yi, and peace was made with Qin. Shortly after, the Chu embassador to Qi returned, Qu Yuan 屈原, and reproached the king for not having executed Zhang Yi.\n\nIn 310 BCE, the King Min of Qi 齊湣王 (r. 324-284) sent an envoy to the court of Chu and explained that, after the death of King Hui in Qin, the situation had changed thoroughly, and suggested to conclude a common alliance with Han, Wei, Zhao and Yan 燕 against Qin. Zhao Ju 昭雎 convinced King Huai that it was better to be part of the alliance around Qi and to win back the territory once lost to Qin. Yet in 307, King Huai decided that he could also win territory by concluding a peaceful alliance with Qin. Two years later Qin, Han and Wei attacked Chu for its betrayal of the alliance. King Huai sent his crown prince as a hostage to Qin and requested military support against the three states.\n\nIn 304, the crown prince of Chu had a private quarrel with some nobles of Qin. When he accidentally killed one of them, he fled and returned to Chu. In order to take revenge for the murder, Qin attacked Chu, supported by troops of Qi, Han and Wei, and defeated Chu at Chuisha 垂沙. A year later, Qin undertook a second campaign against Chu and heavily defeated the army of Chu. King Huai thereupon sent his crown prince as a hostage to Qi, an ally of Qin, and requested peace.\n\nOnly after a further campaign and after King Zhao of Qin had sent an urgent letter, King Huai of Chu consented to a meeting with the king of Qin at the Wuguan Pass 武關. Yet King Huai did not trust Qin and feared that he might be caught in a trap. Zhao Ju suggested not to meet the king of Qin, but the King's younger son urged him to go. In the end, King Huai was escorted to Xianyang 咸陽, the capital of Qin, and was threatened to cease territory before concluding an alliance. He refused and was arrested and detained.\n\nAt home, the situation was precarious. Both the king and the crown prince were held hostages in Qin, and Zhao Ju argued that it was against etiquette to enthrone a younger son as long as the ruler was living. This meant that there was no head of government as long as King Huai was in Qin. The court brooded over the issue and finally invited Prince Heng 橫 to come to the capital Ying. He was enthroned as king of Ch, posthumously known as King Qingxiang 楚頃襄王 (r. 299-263).\n\nThe king of Qin thereupon continued his campaigning against Chu, defeated its army, and seized territory in the north. A year later, King Huai managed to escape, but because the roads to Chu were blocked by Qin, he fled to the state of Zhao, but fearing the anger of Qin, King Huiwen of Zhao 趙惠文王 (r. 299-266) refused to offer protection. King Huai was finally captured by the bloodhounds of Qin and brought back to Xianyang, where he died a year later. At least, his corpse was allowed to be transferred back to his native state, where he was buried with greatest honours.\n\nIn 293 BCE, general Bai Qi 白起 massacred the army of Han. Threatened by this cruel way of warfare, King Qingxiang agreed to conclude a marriage of peace with Qin. This new alliance led to a campaign in 284, carried out by Qin, Chu, Han, Wei, Zhao and Yan and targeted against the state of Qi in the east. Chu so regained the region of Huaibei 淮北. In 281, King Qingxiang was persuaded to resume war against Qin, in order to gain more territory. He first concluded an alliance with Qin and Han and planned to use this opportunity to conquer some territory of the patriarchal kings of Zhou around Luoyang. King Nan of Zhou 周王赧 (r. 315-256) thereupon sent his relative, Duke Wu 武公, to Zhaozi 昭子, the counsellor of Chu. Duke Wu explained to Zhaozi that the destruction of the house of Zhou meant a thorough dissolution of the world order and would bring only chaos to the state of Chu. King Qingxiang thereupon abandoned this plan.\n\nThe campaigns against Qin continued, but in 278 BCE, general Bai Qi advanced to the capital of Chu and defiled the tombs of the kings of Chu. The capital of Chu was moved to the ancient site of Chen (modern Huaiyang 淮陽, Henan) It was only in 276 that the army of Chu was able to recover some of its core territory. Chu was even able to supporte Han, Zhao and Wei in a campaign against Yan. This was only possible because of an armistice bargained with Qin, covered by the crown prince as a hostage dwelling in Qin.\n\nWhen King Qingxiang fell ill, his son Prince Xiong Yuan 熊元 (or Wan 完) managed to escape from Qin and was enthroned as the new king of Chu. He is posthumously known as King Kaolie 楚考烈王 (r. 263-238). The new king immediately appointed his trusted Counsellor-to-the-Left (zuoxi 左徒), Lord Chunshen 春申君, as Prime Minister. Under the Lord's administration, the state of Chu was able to recover for a while. The capital was first shifted to Juyang 巨陽 (modern Taihe 太和, Anhui), later to to Shouchun 壽春 (modern Shouxian 壽縣, Anhui) further to the east. Lord Chunshen met with Lord Xinling 信陵君 of Wei and forged an alliance that was able to defeat Qin in 257. A year later, Chu conquered the state of Lu.\n\nKing Kaolie was succeeded by his son Prince Dao 悍 (or Yu 煜), who is posthumously known as King You 楚幽王 (r. 238-228). Li Yuan 李園, a powerful noble, used this personal change to assassinate Lord Chunshen. King You was succeeded by his younger half-brother You 猶 (or Hao 郝), who is posthumously known as King Ai 楚哀王 (r. 228). He only ruled for two months before he was overthrown and killed by his older half-brother Fuchu 負芻 (r. 228-223).\n\nThe rule of the last kings of Chu was overshadowed by a growing military success of the state of Qin that succeedingly conquered the states of Han, Zhao and Wei. In 224, the Qin general Wang Jian 王翦 defeated the army of Chu and killed general Xiang Yan 項燕, a great uncle of Xiang Yu 項羽, the eventual hegemonial king (bawang 霸王) of West Chu 西楚. A year later, Wang Jian and Meng Wu 蒙武 seized the capital of Chu, captured King Fuchu and transformed the state of Chu into a commandery of the state of Qin.\n\nThe name of Chu was often used as a name for imperial princedoms, and was one of the Ten States (Shiguo 十國) in the 10th century.\n\n\n\n\n\nTable 1. Rulers of the regional state of Chu 楚 Capitals: Danyang 丹陽 (modern Zigui 秭歸, Hubei), Ying 郢 (modern Jiangling 江陵 or Shashi 沙市, Hubei), Ruo 鄀 (Shangruo 上鄀; near modern Zhongxiang 鍾祥, Hubei), Yingchen 郢陳 (modern Huaiyang 淮陽, Henan), Juyang 巨陽 (near Taihe 太和, Anhui), Shouchun 壽春 (modern Shouxian 壽縣, Anhui) dynastic title personal name time Xiong Yi of Chu 楚熊繹, family name Mi 芈 (or Nai 嬭, Qian 芊, Xiong 熊, Yan 酓) Xiong Yi of Chu 楚熊乂 Xiong Tan of Chu 楚熊黮 Xiong Sheng of Chu 楚熊勝 Xiong Shang 楚熊煬 or Xiong Yang of Chu 楚熊揚 Xiong Qu of Chu 楚熊渠 Xiong Wukang of Chu 楚熊無康 Zhi Hong of Chu 楚鷙紅 (or 摯紅) Xiong Yan of Chu 楚熊延 Xiong Yong of Chu 楚熊勇 848-838 Xiong Yan of Chu 楚熊嚴 838-828 Xiong Shuang of Chu 楚熊霜 828-822 Xiong Xun of Chu 楚熊徇 (or 熊狥) 822-800 Xiong E of Chu 楚熊鄂 (or 熊咢) 800-791 Ruo Ao of Chu 楚若敖 Mi Xiong Yi 芈熊儀 791-764 Xiao Ao of Chu 楚霄敖 Mi Xiong Kan 芈熊坎 764-758 Fen Mao of Chu 楚蚡冒 Mi Xiong Xuan 芈熊眴 (or Xiong Xun 熊㫬) 758-741 King Wu of Chu\n\n(Chu Wuwang 楚武王) Mi Xiong Tong 芈熊通 741-690 King Wen of Chu\n\n(Chu Wenwang 楚文王) Mi Xiong Zi 芈熊貲 690-677 Du Ao, King of Chu 楚王堵敖 Mi Xiong Jian 芈熊艱 677-672 King Cheng of Chu\n\n(Chu Chengwang 楚成王) Mi Jun 芈頵 672-626 King Mu of Chu\n\n(Chu Muwang 楚穆王) Mi Shangchen 芈商臣 625-614 King Zhuang of Chu\n\n(Chu Zhuangwang 楚莊王) Mi Lü 芈旅 614-591 King Gong of Chu\n\n(Chu Gongwang 楚共王) Mi Shen 芈審 591-560 King Kang of Chu\n\n(Chu Kangwang 楚康王) Mi Zhao 芈招 560-545 Jia Ao, King of Chu 楚王郟敖 Mi Jun 芈麇 545-451 King Ling of Chu\n\n(Chu Lingwang 楚靈王) Mi Qian 芈虔 541-529 King Ping of Chu\n\n(Chu Pingwang 楚平王) Mi Ju 芈居 529-516 King Zhao of Chu\n\n(Chu Zhaowang 楚昭王) Mi Zhen 芈軫 516-489 King Hui of Chu\n\n(Chu Huiwang 楚惠王) Mi Zhang 芈章 489-432 King Jian of Chu\n\n(Chu Jianwang 楚簡王) Mi Zhong 芈中 432-408 King Sheng of Chu\n\n(Chu Shengwang 楚聲王) Mi Dang 芈當 408-402 King Dao of Chu\n\n(Chu Daowang 楚悼王) Mi Yi 芈疑 402-381 King Su of Chu\n\n(Chu Suwang 楚肅王) Mi Zang 芈臧 381-370 King Xuan of Chu\n\n(Chu Xuanwang 楚宣王) Mi Liangfu 芈良夫 370-340 King Wei of Chu\n\n(Chu Weiwang 楚威王) Mi Shang 芈商 340-329 King Huai of Chu\n\n(Chu Huaiwang 楚懷王) Mi Guai 芈槐 329-299 King Qingxiang of Chu\n\n(Chu Qingxiangwang 楚頃襄王) Mi Heng 芈橫 299-263 King Kaolie of Chu\n\n(Chu Kaoliewang 楚考烈王) Mi Wan 芈完 263-238 King You of Chu\n\n(Chu Youwang 楚幽王) Mi Yu 芈煜 238-228 King Ai of Chu\n\n(Chu Aiwang 楚哀王) Mi Hao 芈郝 228 Fuchu, King of Chu 楚王負芻 Mi Fuchu 芈負芻 228-223 223 Chu destroyed by Qin 秦.\n\nSources:\n\nLi Ling 李零 (1992). \"Chu 楚\", in Zhongguo da baike quanshu 中國大百科全書, Zhongguo lishi 中國歷史 (Beijing/Shanghai: Zhongguo da baike quanshu chubanshe), Vol. 1, 109-110."}, {"url": "https://www.liquisearch.com/emperor_yi_of_chu/biography/as_king_huai_ii_of_chu", "page_content": "As King Huai II of Chu\n\nIn 209 BC, the Daze Village Uprising to overthrow the Qin Dynasty erupted under the leadership of Chen Sheng, who proclaimed himself \"King of Zhangchu\" (\"King of rising Chu\"). Although Chen's uprising was crushed by the imperial forces, other rebel forces had sprouted throughout China to overthrow Qin and restore the former six states annexed by Qin about two decades ago. The leader of the Chu rebel force, Xiang Liang, was advised by Fan Zeng to seek a member of the Chu royal family and install him on the throne, in order to garner more support from the people. Xiang found Xiong Xin, a shepherd, and installed him on the throne of Chu in the summer of 208 BC, with the title of \"King Huai II of Chu\".\n\nKing Huai II was effectively a puppet ruler, as the military power of Chu was actually in the hands of Xiang Liang. However, after Xiang was killed at the Battle of Dingtao in the winter of 208 BC, the military power of Chu fell into the hands of King Huai II and some Chu generals, with the king gradually beginning to assert his authority. Following that, King Huai II commissioned Song Yi and Liu Bang to lead two armies to attack Qin, promising that whoever managed to enter Guanzhong (heartland of Qin) first would be granted the title of \"King of Guanzhong\". Xiang Liang's nephew, Xiang Yu, was put as second-in-command to Song Yi's army, which was sent to attack the Qin forces led by Zhang Han. Zhang's army was besieging Handan, the capital city of the Zhao state, and Song Yi refused to advance any further to assist the Zhao forces. Xiang took Song by surprise in a military conference and killed Song on charges of treason. Xiang sent a messenger to inform King Huai II, and the king approved of Xiang's command of the army reluctantly. In the winter of 207 BC, Liu Bang's army arrived in Guanzhong before Xiang and the last Qin ruler Ziying surrendered, marking the end of the Qin Dynasty."}]}