{"Zhuang of Chu faced numerous challenges from the Zhou dynasty.": [{"url": "http://chinaknowledge.de/History/Zhou/personschuzhuangwang.html", "page_content": "Dec 2, 2010 © Ulrich Theobald\n\nChu Zhuangwang 楚莊王 (r. 613-591) was a ruler of the state of Chu 楚 during the Spring and Autumn period 春秋 (770-5th cent. BCE) and was one of the so-called five hegemons (wuba 五霸). His personal name was Mi Xionglü 芈熊侶 (also written 熊呂 or 熊旅). The state of Chu is sometimes called Jing 荊, and Xionglü's posthumous title is also King Yan 嚴王.\n\nHe succeeded to the throne as son of King Mu 楚穆王 (r. 625-614). King Zhuang started his reign in a style of laissez-faire politics without much caring for the government. His advisors Wu Ju 伍舉 and Su Cong 蘇從 opened him his eyes, so that he started restructuring the administration and strengthening the royal power with the support of Sunshu Ao 孫叔敖. The state took over the care for hydraulic works, dykes and dams, he built up a strong army and quelled the internal rebellion of a certain Ruo Ao 若敖 (not King Ruo Ao, r. 791-764). His armies marched to the north, defeated the state of Song 宋 and the Rong 戎 barbarians of Luhun 陸渾, and lined up before the domain of the king of Zhou 周.\n\nWith the awareness of his power King Zhuang of Chu menaced the King of Zhou and threatened him that Chu would be able to replace the house of Zhou. The armies of Chu then conquered a handfull of smaller states like Yong 庸, Shu 舒 and Chen 陳, and in 602, King Zhuang was able to destroy the army of Jin 晉 at Bi 邲 (modern Xingyang 滎陽, Henan). Chu thus came to replace Jin as the hegemonial power of the Central States.\n\nSource:\n\nCang Xiuliang 倉修良, ed. (1991). Shiji cidian 史記辭典 (Jinan: Shandong jiaoyu chubanshe), 590.\n\nChen Quali 陳全力, Hou Xinyi 侯欣一, ed. (1988). Diwang cidian 帝王辭典 (Xi'an: Shaanxi renmin jiaoyu chubanshe), 20.\n\nGao Wende 高文德, ed. (1995). Zhongguo shaoshu minzu shi da cidian 中國少數民族史大辭典 (Changchun: Jilin jiaoyu chubanshe), 2349.\n\nHuang Banghe 黃邦和, Pi Mingxiu 皮明庥, ed. (1987). Zhong-wai lishi renwu cidian 中外歷史人物詞典 (Changsha: Hunan renmin chubanshe), 469.\n\nLiu Mengxun 柳孟訓 (1997). \"Chu Huaiwang de baye 楚莊王的霸業\", in Men Kui 門巋, Zhang Yanjin 張燕瑾, ed. Zhonghua guocui da cidian 中華國粹大辭典 (Xianggang: Guoji wenhua chuban gongsi), 3.\n\nWang Songling 王松齡, ed. (1991). Shiyong Zhongguo lishi zhishi cidian 實用中國歷史知識辭典 (Changchun: Jilin wenshi chubanshe), 401.\n\nXiong Tieji 熊鐵基, Yang Youli 楊有禮, ed. (1994). Zhongguo diwang zaixiang cidian 中國帝王宰相辭典 (Wuhan: Hubei jiaoyu chubanshe), 77.\n\nYi Xingguo 衣興國, ed. (1988). Shiyong Zhongguo mingren cidian 實用中國名人辭典 (Changchun: Jilin wenshi chubanshe), 44.\n\nXue Hong 薛虹 et al., ed. (1988). Zhongguo huangshi gongting cidian 中國皇室宮廷辭典 (Changchun: Jilin wenshi chubanshe), 773."}, {"url": "https://www.britannica.com/place/China/The-Zhou-feudal-system", "page_content": "The Zhou feudal system\n\nThe feudal states were not contiguous but rather were scattered at strategic locations surrounded by potentially dangerous and hostile lands. The fortified city of the feudal lord was often the only area that he controlled directly; the state and the city were therefore identical, both being guo, a combination of city wall and weapons. Satellite cities were established at convenient distances from the main city in order to expand the territory under control. Each feudal state consisted of an alliance of the Zhou, the Shang, and the local population. A Chinese nation was formed on the foundation of Zhou feudalism.\n\nThe scattered feudal states gradually acquired something like territorial solidity as the neighbouring populations established closer ties with them, either by marriage or by accepting vassal status; the gaps between the fortified cities were thus filled by political control and cultural assimilation. This created a dilemma for the Zhou central court: the evolution of the feudal network buttressed the structure of the Zhou order, but the strong local ties and parochial interests of the feudal lords tended to pull them away from the centre. Each of these opposing forces became at one time or another strong enough to affect the history of the Zhou order.\n\nFor about two centuries Zhou China enjoyed stability and peace. There were wars against the non-Zhou peoples of the interior and against the nomads along the northern frontier, but there was little dispute among the Chinese states themselves. The southern expansion was successful, and the northern expansion worked to keep the nomads away from the Chinese areas. The changing strength of the feudal order can be seen from two occurrences at the Zhou court. In 841 bce the nobles jointly expelled Liwang, a tyrant, and replaced him with a collective leadership headed by the two most influential nobles until the crown prince was enthroned. In 771 bce the Zhou royal line was again broken when Youwang was killed by invading barbarians. The nobles apparently were split at that time, because the break gave rise to two courts, headed by two princes, each of whom had the support of part of the nobility. One of the pretenders, Pingwang, survived the other (thus inaugurating the Dong [Eastern] Zhou period), but the royal order had lost prestige and influence. The cohesion of the feudal system had weakened. Thereafter, it entered the phase traditionally known as Chunqiu (Spring and Autumn).\n\nThe familial relationship among the nobles gradually was diluted during the Chunqiu period. A characteristic of the Zhou feudal system was that the extended family and the political structure were identical. The line of lordship was regarded as the line of elder brothers, who therefore enjoyed not only political superiority but also seniority in the family line. The head of the family not only was the political chief but also had the unique privilege of offering sacrifice to and worshipping the ancestors, who would bestow their blessings and guarantee the continuity of the mandate of heaven. After the weakening of the position of the Zhou king in the feudal structure, he was not able to maintain the position of being the head of a large family in any more than a normal sense. The feudal structure and familial ties fell apart, continuing in several of the Chunqiu states for various lengths of time, with various degrees of modification. Over the next two centuries the feudal-familial system gradually declined and disappeared.\n\nIn the first half of the Chunqiu period, the feudal system was a stratified society, divided into ranks as follows: the ruler of a state; the feudal lords who served at the ruler’s court as ministers; the shi (roughly translated as “gentlemen”) who served at the households of the feudal lords as stewards, sheriffs, or simply warriors; and, finally, the commoners and slaves. The state ruler and the ministers were clearly a superior class, and the commoners and slaves were an inferior class; the class of shi was an intermediate one in which the younger sons of the ministers, the sons of shi, and selected commoners all mingled to serve as functionaries and officials. The state rulers were, in theory, divided into five grades; in reality, the importance of a ruler was determined by the strength of his state. The ministerial feudal lords, however, often had two or three grades among themselves, as determined by the lord-vassal relationship. In general, each state was ruled by a group of hereditary feudal lords who might or might not be of the same surname as the state ruler. The system was not stable in the Chunqiu period, and everywhere there were changes.\n\nThe first important change occurred with the advent of interstate leadership. For several decades after 722 bce, the records chiefly show battles and diplomatic maneuvers among the states on the central plain and in the middle and lower reaches of the Huang He valley. These states, however, were too small to hold the leadership and too constricted in the already crowded plain to have potentiality for further development. The leadership was soon taken over by states on the peripheral areas.\n\nThe first to achieve this leadership was Huangong (reigned 685–643 bce), the ruler of the state of Qi on the Shandong Peninsula. He successfully rallied around him many other Chinese states to resist the pressure of non-Chinese powers in the north and south. While formally respecting the suzerainty of the Zhou monarchy, Huangong adopted a new title of “overlord” (ba). He convened interstate meetings, settled disputes among states, and led campaigns to protect his followers from the intimidation of non-Chinese powers.\n\nAfter his death the state of Qi failed to maintain its leading status. The leadership, after a number of years, passed to Wengong of Jin (reigned 636–628 bce), the ruler of the mountainous state north of the Huang He. Under Wengong and his capable successors, the overlordship was institutionalized until it took the place of the Zhou monarchy. Interstate meetings were held at first during emergencies caused by challenges from the rising southern state of Chu. States answering the call of the overlord were expected to contribute and maintain a certain number of war chariots. Gradually the meetings became regular, and the voluntary contribution was transformed into a compulsory tribute to the court of the overlord. The new system of states under the leadership of an overlord developed not only in northern China under Jin but also in the south under Chu. Two other states, Qin and Qi, though not commanding the strength of the formidable Jin and Chu, each absorbed weaker neighbours into a system of satellite states. A balance of power thus emerged among the four states of Qi, Qin, Jin, and Chu. The balance was occasionally tipped when two of them went to war, but it was subsequently restored by the transference of some small states from one camp to another.\n\nA further change began in the 5th century bce, when the states of Wu and Yue far to the south suddenly challenged Chu for hegemony over the southern part of China, at a time when the strong state of Jin was much weakened by an internecine struggle among powerful magnates. Wu got so far as to claim overlordship over northern China in an interstate meeting held in 482 bce after defeating Chu. But Wu’s hegemony was short-lived; it collapsed after being attacked by Yue. Yue held the nominal overlordship for only a brief period; Jin, Qin, and Qi were weakened by internal disturbances (Jin split into three contending powers) and declined; and a series of defeats paralyzed Chu. Thus, the balance-of-power system was rendered unworkable.\n\nA half century of disorder followed. Small states fell prey to big ones, while in the big states usurpers replaced the old rulers. When the chaos ended, there were seven major powers and half a dozen minor ones. Among the seven major powers, Zhao, Han, and Wei had formerly been parts of Jin; the Qi ruling house had changed hands; and Qin was undergoing succession problems. The only “old” state was Chu. Even Chu, a southern state, had become almost completely assimilated to the northern culture (except in art, literature, and folklore). The minor powers had also changed: some had retained only small portions of their old territories, some had new ruling houses, and some were new states that had emerged from non-Chinese tribes. The long interval of power struggle that followed (475–221 bce) is known as the Zhanguo (Warring States) period."}, {"url": "https://history.stackexchange.com/questions/4/what-events-led-to-the-fall-of-the-zhou-dynasty-during-the-warring-states-period", "page_content": "@lins314159 is correct: the Eastern Zhou's fall began with the demise of the Western Zhou. Unlike its predecessor, the Eastern Zhou was never able to control its vassals. The precipitous drop in royal authority was caused by the collapse of the king's moral authority, his ineptitude, and the internal bickering of the court. This doomed the Eastern Zhou by creating a power vacuum for ambitious vassals to expand their own territories at the expense of royal power, kickstarting a vicious cycle of decline.\n\nMoral Authority\n\nFollowing the eastward move, Zhou's moral authority and general prestige crumbled. But this has less to do with the barbarian invasion itself than one might reasonably think1. As @lins314159 mentioned, King You was killed by a coalition of rebel lords and barbarians led by the Marquis of Shen, father-in-law to King You and grandfather of King Ping.\n\nHowever, the future King Ping fled to Shen in 777 B.C. as the Crown Prince of Zhou, three years before being disinherited and five years before fighting erupted. Thus, when King You was killed in the ensuing conflict, it exposed King Ping to charges of patricide and regicide - the two most serious crimes of Ancient China.\n\n及平王東遷，以弒父嫌疑，不為正義所歸附，而周室為天下共主之威信亦掃地以盡，此下遂成春秋之霸局。... 凡擁護平王諸國，如許、申、鄭、晉、秦、犬戎等，皆別有用心，形成一非正義之集團，為東方諸侯所不齒。因此周室東遷後，政令亦驟然解體。 King Ping moved east, implicated in patricide. Justice was not on his side, and Zhou's prestige as the national suzerain had been wiped clean ... States who supported King Ping, such as Hsu, Shen, Zhang, Jin, Qin and the Quanrong, all had their own designs. They formed an unjust coalition scorned by the eastern lords. Consequently, by moving east, Zhou's authority to rule also fell apart. - Ch'ien Mu, Kuo Shih Ta Kan, Hong Kong Commercial Press, 1995, page 49\n\nThe eastern states regarded him as a usurper, an illegitimate king who came to power through murder. King You's (factual or otherwise) failings did not excuse this treason. The basis of Zhou governance had been a strict adherence to hierarchical rules, but in a single stroke the new King had broken two of its most sacred laws.\n\nHenceforth King Ping, and the line of Eastern Zhou kings he sired, could command scarcely more than vestigial respect.\n\nInternal Zhou Division\n\nAs mentioned earlier, King You disinherited his son before he was killed. This meant that King Ping was not the legal heir when he was being crowned by his grandfather.\n\nThe kingdom had already become divided between father and son, and the destruction caused by King Ping's regicidal rebels and the barbarians he (or his grandfather) invited failed to win him popular support. Instead, Zhou was plunged into a succession crisis as the nobles crowned the late king's brother2 as King Xie.\n\n《清華簡·系年·第二章》幽王及白盤乃滅，周乃亡。邦君、者正乃立幽王之弟余臣於虢，是攜惠王。立廿又一年，晉文侯仇乃殺惠王於虢。周亡王九年，邦君者侯焉始不朝於周， Tsinghua Bamboo Slips - Chapter II: King You and [Bao Si's son] died. Zhou fell. The princes and ministers crowned King You's brother at Guo as [King Xie]. 21 years later, Chou, the Marquis Wen of Jin, killed King Xie at Guo. Zhou lost king for nine years3, and the princes began to cease paying homage.\n\nIn addition to hemorrhaging the devastated Zhou demesne's resources, the conflict also ensured King Ping was wholly dependent on the support of powerful lords - who, as Ch'ien Mu pointed out, each had their own designs. At a time when the royal court needed to demonstrate strength and leadership more than ever4, the Zhou king was instead preoccupied with bestowing gifts, powers and honours upon its nominal vassals. Due to the unfortunate timing, this produced long term strategic implications. Zhou's patron states, such as Jin and Zheng, was able to leverage their political advantage into concrete territorial gains.\n\nDuke Wu of Zheng, for example, egregiously breached the Zhou constitution5 by attacking and conquering two of his fellow vassals. Fully exploiting his position as a minister of the court, Zheng even commanded royal troops into battle against his personal enemies, and to annex land to himself. In this way Duke Wu forged the newly founded state of Zheng6 into the hegemon of early Spring and Autumn - in stark contrast to the precipitous decline of Eastern Zhou under his stewardship.\n\nThis usurpation of royal authority undermined Zhou's heavily impaired prestige, and contributed strongly towards the increasing expansion of the eastern lords. At the same time, the paralysis of royal leadership at a time of pressing barbarian threats, also provided a vacuum for the more powerful vassal states to step in and take up the mantle of defending Hwa-Hsia.\n\nKing Ping's Longevity\n\nZheng's meteoric rise to power demonstrates what a more capable leader, had one been in charge of Zhou, could have achieved. Unfortunately, not only was King Ping of ill repute, he was also incapable7. Worst still, he was also extremely long lived: King Ping's 50 year reign of stagnation fatally undermined Eastern Zhou's chances.\n\nWhen he finally died, his grandson succeeded him and sought to rebuild Zhou authority by rebuking Zheng. Soon open warfare erupted, and although Zhou was still powerful enough to muster an army, its disastrous defeat in 707 B.C. ended all hopes.\n\nNotes:\n\n[1] On paper, the Eastern Zhou (in its early years, at least) was not materially much weaker than its predecessor. Zhou's eastern demesne, around the new capital, was sizable and wealthy. Much of its western demesne, around the old capital, was reconquered by Qin's armies and restored to the royal court within two decades before being squandered as rewards for Jin .\n\n[2] Previously thought to be another son of King You.\n\n[3] There is debate over whether this meant the ninth year of King You's reign, the ninth year after King You's reign, or King Ping's coronation did not take place until nine years after the Duke of Jin killed King Xie.\n\n[4] During the Spring and Autumn Era, conflict between the Chinese states and the barbarians kingdoms/tribes intensified. The organised State of Chu arose in the Yangtze basin in the south, while smaller, roving tribes of Di threaten the Central Plain states from the north. According to the Commentaries of Kung Yang: 南夷與北狄交，中國不絕若線 (\"Southern and Northern barbarians crisscrosses, China is only maintained by a thread.\")\n\n[5] The powers of war and peace were supposed to be reserved to the King, who would issue orders for a vassal to attack. The king could delegate the power for a region to a trusted vassal, but this was normally done for remote locations because communications were difficult. The state of Zheng was right next doors to the Eastern Zhou.\n\n[6] Zheng was only created in 806 B.C., and like Zhou itself migrated into the region from the West. After King Ping moved the court east, Zheng conquered the Eastern Guo and Kuai within four years, establishing its new territories in their former lands.\n\n[7] King Ping eventually tried to curb the overstepping Duke of Zheng's powers at court. This was discovered by the Duke, and upon being confronted, the king gave up his own son to Zheng as a hostage for good behaviour. This was viewed as the king lowering himself to the same level as his vassals."}, {"url": "https://www.worldhistory.org/Zhou_Dynasty/", "page_content": "The Zhou Dynasty (1046-256 BCE) was among the most culturally significant of the early Chinese dynasties and the longest lasting of any in China's history, divided into two periods: Western Zhou (1046-771 BCE) and Eastern Zhou (771-256 BCE). It followed the Shang Dynasty (c. 1600-1046 BCE), and preceded the Qin Dynasty (221-206 BCE, pronounced “chin”) which gave China its name.\n\nAmong the Shang concepts developed by the Zhou was the Mandate of Heaven – the belief in the monarch and ruling house as divinely appointed – which would inform Chinese politics for centuries afterwards and which the House of Zhou invoked to depose and replace the Shang.\n\nRemove Ads Advertisement\n\nThe Western Zhou period saw the rise of decentralized state with a social hierarchy corresponding to European feudalism in which land was owned by a noble, honor-bound to the king who had granted it, and was worked by peasants. Western Zhou fell just before the era known as the Spring and Autumn Period (c. 772-476 BCE), named for the state chronicles of the time (the Spring and Autumn Annals) and notable for its advances in music, poetry, and philosophy, especially the development of the Confucian, Taoist, Mohist, and Legalist schools of thought.\n\nEastern Zhou moved the capital to Luoyang and continued the Western Zhou model but with an ever-increasing breakdown of the imperial Chinese government which resulted in the claim that the Zhou had lost the Mandate of Heaven. The weakness of the king's position gave rise to the chaotic era known as the Warring States Period (c. 481-221 BCE) during which the seven separate states of China fought each other for supremacy. This period ended with the victory of the state of Qin over the others and the establishment of the Qin Dynasty which tried to erase the accomplishments of the Zhou in order to establish its own primacy.\n\nRemove Ads Advertisement\n\nThe Zhou Dynasty made significant cultural contributions to education, literature, philosophical schools of thought, as well as political & religious innovations.\n\nThe Zhou Dynasty made significant cultural contributions to agriculture, education, military organization, Chinese literature, music, philosophical schools of thought, and social stratification as well as political and religious innovations. The foundation for many of these developments had been laid by the Shang Dynasty but the form in which they came to be recognized is entirely credited to the Zhou.\n\nThe culture they established and maintained for almost 800 years enabled the development of the arts, metallurgy, and some of the most famous names in Chinese philosophy, among them Confucius, Mencius, Mo Ti, Lao-Tzu, and Sun-Tzu all of whom lived and wrote during the period known as the time of the Hundred Schools of Thought during which individual philosophers established their own schools. The contributions of the Zhou Dynasty provided the foundation for the development of Chinese culture by those that followed, most notably the Han Dynasty (202 BCE-220 CE) which would fully recognize the value of the Zhou Dynasty's contributions.\n\nLove History? Sign up for our free weekly email newsletter!\n\nFall of the Shang & Rise of the Zhou\n\nPrior to the Zhou was the Shang Dynasty who overthrew the Xia Dynasty (c. 2700-1600 BCE), claiming it had become tyrannical, and the Shang leader, Tang (dates unknown) then stabilized the region and initiated policies encouraging economic and cultural advances. The Shang made the most of the fertile soil on the banks of the Yellow River to produce abundant harvests, providing more food than required, the surplus of which then went toward trade. The resulting prosperity allowed for the development of cities, (some on a large scale, such as Erligang), arts, and culture.\n\nKing Tang of Shang Ma Lin (Public Domain) The Shang were expert masons, jewelers, and metallurgists, creating masterpieces in bronze and jade, as well as producing high-quality bolts of silk. They developed a calendar, divination through oracle bones, writing, music and musical instruments, the concept of ancestor worship, Taoism, and the religious concept of the Mandate of Heaven which claimed the monarch ruled by the will of the gods.\n\nThe gods' approval of a king was evident in the prosperity of the land and the general well-being of the people. Any decline in either was interpreted as a sign the monarch had broken his contract with the gods and should be deposed. The last Shang emperor, Zhou (also given as Xin), became as tyrannical as the earlier Xia kings had been. He was challenged by King Wen of Zhou (l. 1152-1056 BCE) and was overthrown by Wen's second son, King Wu, who reigned 1046-1043 BCE as the first king of the Zhou Dynasty.\n\nRemove Ads Advertisement\n\nWestern Zhou\n\nKing Wu at first followed the paradigm of the Shang in establishing a central government on either side of the Feng River known as Fenghao. Wu died shortly afterwards, and his brother, Dan, the Duke of Zhou (r. 1042-1035 BCE), took control of the government as regent for Wu's young son, Cheng (r. 1042-1021 BCE). The Duke of Zhou is a legendary character in Chinese history as a poet-warrior and author of the famous book of divination, the I-Ching. He expanded the territories eastward, and ruled respectfully, abdicating when the son of Wu came of age and took the throne as King Cheng of Zhou. Not every region under Zhou control admired their policies, however, and rebellions throughout the vast realm broke out, inspired by factions wishing to rule themselves.\n\nMap of Western Zhou Philg88 (CC BY-NC-SA)\n\nA centralized government could not maintain the large territory that had been conquered and so the ruling house sent out trusted generals, family members, and other nobles to establish smaller states which would be loyal to the king. The policy of fengjian (“establishment”) was instituted which decentralized the government and allotted land to nobles who acknowledged the supremacy of the Zhou king. The fengjian policy established a feudal system and social hierarchy which ran, top to bottom:\n\nKing\n\nNobles\n\nGentries\n\nMerchants\n\nLaborers\n\nPeasants\n\nEach noble formed his own separate state with its own legal system, tax code, currency, and militia. They paid homage and taxes to the Zhou king and provided him with soldiers when necessary. In order to strengthen the king's position, the Mandate of Heaven concept was more fully developed. The king made sacrifices at the capital on behalf of the people and the people honored him with their loyalty and service.\n\nRemove Ads Advertisement\n\nThis was one of the few times in China's history that the upper & lower classes worked together for the greater common good.\n\nThe fengjian policy was so successful, producing such abundance of crops, that the resultant prosperity validated the Zhou as possessing the Mandate of Heaven. The wealth that was generated encouraged the so-called well-field system which divided lands between those cultivated for nobility and the king, and those worked by and for the peasantry. This was one of the few times in China's history that the upper and lower classes worked together for the greater common good.\n\nThe Zhou culture, naturally, flourished with this kind of cooperation. Works in bronze became more sophisticated and the metallurgy of the Shang, overall, was improved upon. Chinese writing was codified and literature developed, as evidenced in the work known as Shijing (the Book of Songs, composed 11th-7th centuries BCE), one of the Five Classics of Chinese literature. The poems of the Shijing would have been sung at court and were thought to encourage virtuous behavior and compassion for members of all social classes.\n\nPalace Scene in Zhou Dynasty China Amplitude Studios (Copyright)\n\nThis time of prosperity and relative peace, however, could not last. Scholar Patricia Buckley Ebrey comments:\n\nThe decentralized rule of the Western Zhou had from the beginning carried within it the danger that the regional lords would become so powerful that they would no longer respond to the commands of the king. As generations passed and ties of loyalty and kinship grew more distant, this indeed happened. In 771 BCE, the Zhou king was killed by an alliance [of tribesmen and vassals]. (38)\n\nWestern Zhou fell when invasions, most likely by the peoples known as the Xirong (or Rong), further destabilized the region. The nobility moved the capital to Luoyang in the east which gives the next period of Zhou history its name of Eastern Zhou.\n\nRemove Ads Advertisement\n\nEastern Zhou\n\nBy all accounts, the era of Eastern Zhou was chaotic and violent but managed to produce literary, artistic, and philosophical works of startling originality and substance. The Spring and Autumn Period which begins the era of Eastern Zhou still retained some of the courtesy and decorum of the days of Western Zhou but that would not last for long. The separate states – Chu, Han, Qi, Qin, Wei, Yan, and Zhao - all had more power than the Zhou at Luoyang at this time. Even so, it was still thought that the Zhou held the Mandate of Heaven and so each state tried to prove themselves the Zhou successor.\n\nIn the early years of the Spring and Autumn Period, chivalry in battle was still observed and all seven states used the same tactics resulting in a series of stalemates since, whenever one engaged with another in battle, neither could gain an advantage. In time, this repetition of seemingly endless, and completely futile, warfare became simply the way of life for the people of China during the era now referred to as the Warring States Period. The famous work The Art of War by Sun-Tzu (l. c. 500 BCE) was written during this time, recording precepts and tactics one could use to gain advantage over an opponent, win the war, and establish peace.\n\nThe Art of War by Sun-Tzu Coelacan (CC BY-SA)\n\nHow widely read The Art of War was at this time is unknown but Sun-Tzu was not the only one who tried to end the violence through stratagems. The pacifist philosopher Mo Ti (also given as Mot Tzu, l. 470-291 BCE) went to each state, offering his knowledge in strengthening a city's defenses as well as offensive tactics in battle. His idea was to provide each state with exactly the same advantages, neutralizing all, in the hope that they would realize the futility of further warfare and declare peace. His plan failed, however, because each state, like a die-hard gambler, believed that their next offensive would result in the big win.\n\nA Qin statesman named Shang Yang (d. 338 BCE), following Sun-Tzu's lead, advocated for total war, without regard to the old laws of chivalry, and stressed the goal of victory by any means at one's disposal. Shang Yang's philosophy was adopted by King Ying Zheng of Qin who embarked on a brutal campaign of carnage, defeated the other states, and established himself as Shi Huangdi, the first Chinese emperor. The Zhou Dynasty had fallen, and the Qin Dynasty now began its reign over China.\n\nZhou Contributions\n\nThe Qin would undo many of the advances of the Zhou but could not completely rewrite history. In the same way the Zhou had drawn on the accomplishments of the Shang, so the Qin did with the Zhou. The Zhou's advances in agriculture, for example, were kept and improved upon, notably irrigation techniques, dam building, and hydraulics which would be instrumental in Shi Huangdi's construction of the Grand Canal.\n\nThe use of cavalry and chariots in Chinese warfare (also originally Shang developments) were further developed by the Zhou and kept by the Qin. The Zhou had brought horsemanship to such a high level that it was considered a form of art and a requisite for the education of princes. Horses were thought so important, they were frequently buried with their masters or sacrificed for the spiritual power and protection their energy could provide to the deceased.\n\nChinese Qin Chariot Erwyn van der Meer (CC BY-NC-ND)\n\nThe most famous example of this is the tomb of Duke Jing of Qi (r. 547-490 BCE), found in Shandong Province in 1964 CE which, though still not fully excavated presently, is thought to contain the remains of 600 horses sacrificed to accompany the Duke into the afterlife. All of the states drew on the Zhou knowledge of horsemanship and Ying Zheng, in fact, made full use of the chariot and cavalry units developed by the Zhou in subduing the other states.\n\nThe Zhou separation of an army into units, deployed in different directions in battle, was also maintained by the Qin as was Zhou metallurgy. Shi Huangdi made the most of Zhou techniques in metalworking by forcing the subdued states to turn over their weapons which were melted down and turned into statues celebrating his reign.\n\nThe Zhou contributions which were discarded by the Qin were all in the areas of art and culture. The Spring and Autumn Period and its time of the Hundred Schools of Thought had produced some of the most significant philosophical thinkers in the world. The major schools of thought were founded by Confucius (l. 551-479 BCE) whose famous Confucian precepts continue to inform Chinese culture, Lao-Tzu (l. c. 500 BCE) who codified and founded formal Taoism, and Han Feizi (l. c. 280-233 BCE), founder of the school of Legalism.\n\nConfucius Rob Web (CC BY-NC-SA)\n\nThere were also many lesser known, but still significant, philosophers such as the sophist Teng Shih (l. c. 500 BCE), the hedonist Yang Zhu (l. 440-360 BCE), and the politician and philosopher Yan Ying (l. 578-500 BCE). Among the best-known later philosophers was the famous Mencius (also given as Mang-Tze, l. 372-289 BCE) who would codify the works of Confucius, and Xun Kuang (l. c. 310 - c. 235 BCE) whose work, Xunzi, reimagined Confucian ideals with a more pessimistic, pragmatic vision. Except for the legalism of Han Feizi, which the Qin adopted as its national policy, the work of all these philosophers was ordered destroyed; any which survived had been hidden by priests and intellectuals at the risk of their lives.\n\nZhou musical contributions were also undervalued by the Qin, though they were later recognized fully by the Han Dynasty. Central to the values of the Zhou Dynasty were the concepts of Li (ritual) and Yue (music and dance), commonly given as Li-Yue. Music was considered transformative, as explained by the scholar Johanna Liu:\n\nSince the Zhou Dynasty, music has been considered as one important subject in the curriculum including four disciplines for cultivating the sons of royal family and eminent people from the State to be prominent future leaders. In the Book of Rites, it was said…'the direction of Music gave all honor to its four subjects of instruction, and arranged the lessons in them, following closely the poems, histories, ceremonies, and music of the former kings, in order to complete its scholars.' (Shen, 65)\n\nEach piece of music had a corresponding dance and the combination of these was thought to not only improve the moral character of the individual but assist in balancing the nature of the cosmos. Confucius believed music to be essential in cultivating a good character, especially in a ruler, and that a lover of music would conduct himself, and his administration, justly.\n\nThe Book of Rites referenced by Liu is one of the classic Chinese texts which was produced during the Zhou Dynasty during the period of the Hundred Schools of thought. The Four Books and Five Classics – which managed to survive the book burning of the Qin – became the standard texts for Chinese education. They are:\n\nThe Book of Rites (also known as The Book of Great Learning)\n\nThe Doctrine of the Mean\n\nThe Analects of Confucius\n\nThe Works of Mencius\n\nThe I-Ching\n\nThe Classics of Poetry\n\nThe Classics of Rites\n\nThe Classics of History\n\nThe Spring and Autumn Annals\n\nThese works continue to be studied in the present day and for the same reason: they are thought to not only educate an individual but also elevate the soul and improve one's overall character.\n\nConclusion\n\nThese works were only made possible by the Zhou development of writing. The Zhou developed the Shang script Jiaguwen into the Dashuan, Xiaozhuan, and Lishu scripts which would lend themselves to the development of still others. The Zhou's elevation of ancestor worship encouraged the development of religious thought and their vision of the Mandate of Heaven would continue to inform Chinese dynasties going forward for thousands of years.\n\nIf the Zhou had only produced philosophers such as Confucius and the others, it would be impressive enough, but they did far more. In the Western Zhou period, they established a decentralized, but cohesive, state which honored and inspired the people of all social classes, not just the noble and wealthy. They consistently improved upon what they had inherited from the Shang and looked for other ways to make their lives, and others', better.\n\nIn the Eastern Zhou period, even amidst the chaos of constant warfare, they continued to develop art, music, literature, and philosophy of the highest quality. The Zhou Dynasty's reign of nearly 800 years, in fact, was so profoundly influential at every level of culture that even the destructive policies of the Qin could not erase it. After the Qin fell to the Han Dynasty, the cultural contributions of the Zhou were revived and, today, are indistinguishable from Chinese culture."}, {"url": "http://chinaknowledge.de/History/Zhou/rulers-chu.html", "page_content": "Nov 1, 2018 © Ulrich Theobald\n\nDon't confound his regional state of the Zhou period with the empire of Chu 楚 (926-951), one of the Ten Kingdoms 十國 (902-979) of the Five Dynasties period 五代 (907-960).\n\nThe state of Chu 楚 was a regional state of the Zhou period 周 (11th cent.-221 BCE). It belonged to the larger polities that were able to survive until the end of the Warring States period 戰國 (5th cent.-221 BCE). Chu is known for its culture that was significantly different from that of the states of the Central Plain. Chu was not among the states that were distributed as a regional states at the beginning of the Western Zhou period 西周 (11th cent.-770 BCE). Its ruling dynasty was of a different origin than most of the regional dynasties of the Zhou empire. Another name of Chu is Jing 荊. Chu was first located in the valley of the River Han 漢 and then moved southeast into the Yangtze Valley. During the Spring and Autumn period 春秋 (770 - 5th cent. BCE) it gradually expanded towards the north and east.\n\nMap 1. The regional state of Chu 楚 (11th cent. - 223 BCE) Map according to Tan Qixiang 谭其骧 (1987), Zhongguo lishi ditu ji 中国历史地图集. Chu was located in the middle course of the Yangtze River and gradually expanded to the east and northeast. It played the role of temporary ally for the states of Qi and Qin, before the latter dominated over all regional states and founded the empire of Qin. Click to enlarge.\n\nThe semi-barbarian state of Chu becomes part of the middle kingdom\n\nThe ruling house of Chu derived its descendancy from the mythical Emperor Zhuan Xu 顓頊, himself being a grandson of the Yellow Emperor 黃帝. Zhuan Xu's great-grandson Zhong Li 重黎 was the minister for fire (huo zheng 火正) of the mythical Emperor Di Ku 帝嚳. For his merits earned in office, Zhong Li was bestowed the name of Zhu Rong 祝融. He was sent out to punish the rebellious lord of the waters, Gong Gong 共工, but Zhu Rong/Zhong Li was unable to kill Gong Gong. Enraged about this failure, Emperor Di Ku executed Zhong Li and had his brother Wu Hui 吳回 take over the duties as minister of fire. Wu Hui had six grandsons that were called Kun Wu 昆吾, Shen Hu 參胡, Peng Zu 彭祖, Hui Ren 會人, Ji Lian 季連 and an unnamed son that was given the family name of Cao 曹. Five branches of the family fell into oblivion, except the descendants of Ji Lian who adopted the family name of Xiong 熊 or Mi 羋 (originally written 嬭).\n\nExcavated objects from the late Warring States period prove that the reigning dynasty of Chu also bore the family name Yan 酓. Mi Xiong allegedly took part in King Wu's 周武王 conquest of the Shang empire 商 (17th-11th cent. BCE).\n\nIn the early decades of the Zhou period, King Cheng of Zhou 周成王 (r. 1116-1079 BCE) made the family Mi regional rulers over the country of Chu in the middle Yangtze valley. From that time on they adopted the family name Mi, yet the rulers retained the surname Xiong. Xiong might also be a prefix of the personal name worn by all members of the family. In the late 11th century King Zhao of Zhou 周昭王 undertook several military campaigns against Chu during one of which he died, while his own army drowned in the River Han. The rulers of Chu called themselves \"king\" (wang 王) and therefore demonstrated that they were actually not part of the system of regional states of the Zhou empire.\n\nYu Xiong's great-grandson Xiong Yi 熊繹 settled near Mt. Jingshan 荊山 (modern Nanzhang 南漳, Hubei) and, after being appointed regional ruler (zhuhou 諸侯) by King Cheng of Zhou, moved to Danyang 丹陽 (modern Zigui 秭歸, Hubei).\n\nViscount (zi 子) Xiong Qu 熊渠 became aware that the house of Zhou was weakening and expanded his rule along the middle Yangtze valley up into the valley of River Han. He conquered the statelets of Yong 庸 and Yangyue 揚粵. He made his oldest song Wukang 毋康 king of Goutan 句亶, his second son Zhihong 摯紅 king of E 鄂, and his youngest son Zhici 執疵 king of Yuezhang 越章. Later on he feared that the king of Zhou would attack him because of the usurpation of the title of king and stripped his sons off their ranks as kings.\n\nAfter the death of Viscount Xiong Shuang 熊霜 his three sons indeed contended for the throne of Chu. The youngest son, Jixun 季徇 (Xiong Xun 熊徇), was finally able to occupy the throne. When Fen Mao 蚡冒 (r. 758-741), also called Xiong Xun 熊眴, died, his younger brother Xiong Tong 熊通 assassinated the heir apparent and usurped the throne. He is posthumously called King Wu of Chu 楚武王 (r. 741-690) because he carried out numerous military campaigns, like that against the statelet of Sui 隨, whose marquis, hoping to escape defeat, offered to Xiong Tong to travel to the court of the King of Zhou to reconfirm Xiong Tong in his royal position, but the King of Zhou declined. Enraged about the King of Zhou's refusal, Xiong Tong decided to adopt the title of king without the permission by the Son of Heaven, concluded an alliance with the marquis of Sui and occupied the territory of the hundred Pu tribes 百濮 south of the Yangtze River. Xiong Tong later suspected the marquis of Sui of treason and planned to occupy his territory, but he died en route to the battlefield.\n\nHis son Xiong Zi 熊貲 mounted the throne. Zi is posthumously known as King Wen 楚文王 (r. 690-677). He was the first ruler of Chu who took residence in Ying 郢 (near modern Shashi 沙市, Hubei) instead of Danyang. Xiong Zi conquered several small states, like Xi 息 (modern Xixian 息縣， Henan), Shen 申 (modern Nanyang 南陽, Henan) and Deng 鄧 (modern Xiangfan 襄樊, Hubei). His son Zhuang'ao 莊敖 (ao was a kind of temple name, like the Chinese zong 宗), known as Xiong Jian 熊囏 (also written 熊艱), planned to kill his brother Xiong Yun 熊惲 (also written 熊頵), but the latter escaped to Sui and gained sufficient support to usurp the throne of his brother. Xiong Yun is posthumously known as King Cheng 楚成王 (r. 672-626). Unlike his predecessors, King Cheng was a peaceful ruler who sent appropriate tributes to the court of the king of Zhou, so that he was ordered to appease the barbarian tribes of the south instead of harassing the states in the Yellow River plain.\n\nIn 656 the hegemonial lord (ba 霸) Duke Huan of Qi 齊桓公 (r. 685-643) attacked Chu, but King Cheng was able to urge his troops to stop and concluded a peace alliance (meng 盟) in the conference of Zhaoling 召陵 (modern Yancheng 郾城, Henan). In his later years King Cheng waged war against the statelets of Xu 許, Xian 弦 (near modern Xixian, Henan), Huang 黃 (modern Huanchuan 潢川, Henan) and Ying 英. Duke Xiang of Song 宋襄公 (r. 650-637), the new hegemonial lord, dispatched an envoy to Chu to offer a peaceful alliance, but the king refused and soon attacked Song 宋 and defeated the duke in the battle of Hong 泓 (modern Zhecheng 柘城, Henan) and also the state of Zheng 鄭. Duke Xiang died from a wound received during the battle.\n\nIn 634 Duke Xi of Lu 魯僖公 (r. 659-627) arrived at the court of Chu and requested an army to punish the Duke of Qi 齊. King Cheng sent out the Marquis of Shen 申 who conquered the territory of Gu 穀, where Duke Huan's son Yong 雍 was instated as the local governor. The other sons of the Duke of Qi fled to Chu and were all made nobles in Chu. The statelet of Kui 夔 was conquered, and then King Cheng attacked the state of Song. The Duke of Song requested support by the army of Jin 晉. King Cheng thereupon withdrew because Duke Wen of Jin 晉文公 (r. 636-628), had been his exiled guest for a long time, and sent only out Ziyu 子玉 with a small contingent that was defeated.\n\nAgainst the advice of Prime Minister (lingyin 令尹) Zishang 子上, King Chen nominated his beloved son Shangchen 商臣 heir apparent. Later on he deposed Shangchen in favour to Zhi 職. Shangchen thereupon arrested King Cheng and forced him to commit suicide. He mounted the throne, posthumously called King Mu 楚穆王 (r. 626-614). His chief counsellor was Pan Chong 潘崇. King Mu conquered the statelets of Jiang 江 (modern Xixian, Henan) and Lu 六 (a special reading, modern Lu'an 六安, Anhui) and attacked the state of Chen 陳.\n\nHe was succeeded by his son Lü 侶, who is posthumously known as King Zhuang 楚莊王 (r. 614-591). King Zhuang did not attend the court, indulged in pleasures and even ordered to execute those who dared remonstrating against him. Wu Ju 伍舉 thereupon used a riddle to admonish him, but without success. Only Su Cong 蘇從 was able to open the king's eyes so that he started caring for political matters again. During his campaign against the Rong barbarians 戎 of Luhun 陸渾, King Zhuang visited the capital of the kings of Zhou in Luoyang 洛陽 (modern Luoyang, Henan) and was received by royal grandson Man 王孫滿. The latter convinced him that the Heavenly Mandate (tianming 天命) of the Zhou dynasty had not yet ended, in spite of the obvious weakness of the royal house.\n\nIn 597 Chu defeated the army of Jin near Bi 邲 (near modern Zhengzhou 鄭州, Henan). In 594 Chu besieged the capital of Song for five months and conquered the statelet of Yong 庸 (near modern Zhushan 竹山, Hubei), later Shu-Liao 舒蓼 (modern Shucheng 舒城, Anhui) and Xiao 蕭 (near modern Xuzhou 徐州, Jiangsu).\n\nAfter the conquest of Chen, King Zhuang wanted to transform it into a district of Chu, but Shen Shu 申叔 of Qi criticized the king, so that he reinstated the house of Chen. Yet his next step was to conquer the state of Zheng. After the lord of Zheng had begged for mercy, King Zhuang released him and created an alliance of peace. In 575 the army of Chu defeated the relieve army from Jin in the battle of Yanling 鄢陵 (modern Yanling, Henan). The rule of King Zhuang is seen as the apogee of the power of the state of Chu among the regional states of the Zhou period. He was accepted as hegemonial lord (ba 霸).\n\nKing Zhuang was succeeded by his son Shen 審, posthumously known as King Gong 楚共王 (r. 591-560). During his reign the army of Chu was defeated by Jin. The next ruler was King Gong's son Zhao 招, posthumously known as King Kang 楚康王 (r. 560-545). The latter was succeeded by his son Yuan 員, who is also known as Jia'ao 郟敖 (r. 545-541). King Kang had four younger brothers called Wei 圍, Zibi 子比, Zixi 子晳 and Qiji 弃疾. Wei was made Prime Minister and commander of the army. When Jia'ao fell ill, Wei entered the palace, strangulated the king and killed his sons Mo 莫 and Pingxia 平夏. Zibi fled to Jin, while Wei mounted the throne. He is posthumously known as King Ling 楚靈王 (r. 541-529).\n\nChu as a major power of the Warring States\n\nKing Ling was able to assemble the regional rulers and to take over the lead as a factual hegemon of the regional states. Minister Wu Ju warned the king to become over-confident in his superior role, yet King Ling commanded the regional states in a campaign against the state of Wu 吳. Qing Feng 慶封, the commander of the troops of Wu, was kept prisoner, but dared criticizing King Ling for the way his fathers had come to the throne of Chu, and was therefore immediately executed by the king. He had the Zhanghua Terrace 章華臺 built where he received noble refugees from other states. Prince Qiji was ordered to attack the state of Chen, and King Ling invited the marquis of Cai 蔡 in order to poison him. Prince Qiji conquered the headless state of Cai and usurped the throne of the small marquisate.\n\nIn 530 BCE, King Ling attacked the small state of Xu 徐, located northwest of the state of Wu, and Lai 賴 (modern Suizhou 隨州, Hubei). Chen was heavily deafeated and its dynasty brought to an end. At that moment, King Ling deliberated with his nobles whether he was strong enough to claim the same rights as the other regional rulers. Grand master (dafu 大夫) Xi Fu 析父 answered that in old times, the state of Chu had been a very remote and less developed country, but now the King of Zhou would not refuse to bestow to the King of Chu bronze tripods as a symbol of royal power, and none of the other states would refuse to exchange gifts with the state of Chu.\n\nWhen King Ling was on campaign against Wu in the camp of Ganxi 乾溪, the king of Wu was advised by Guan Cong 觀從, a son of a noble of Cai whom King Ling had killed. The King of Wu joined a secret alliance with the state of Yue 越, whose nobleman Chang Shouguo 常壽過 had also been insulted by the king of Chu. Wu and Yue attacked Cai and won over Qiji, who was able to kill the heir apparent of Chu, Prince Lu 祿. Zibi was enthroned as king of Chu, Zixi was made Prime Minister, and Qiji Minister of War (sima 司馬). Guan Cong thereupon travelled to the camp of King Ling and presented him with the facts of the rebellion at home. The army of Chu dispersed and left the king alone. King Ling wandered around in the wilderness and finally died of hunger because the new ruler had forbidden giving him anything to eat.\n\nThe new king, Zibi, was for a long time in an unclear state about the whereabouts of King Ling, and finally committed suicide, together with Zixi. Qiji renamed himself Xiong Ju 熊居 and proclaimed himself king of Chu. He is posthumously known as King Ping 楚平王 (r. 527-516).\n\nIn fear of revenge, King Ping demonstrated a benevolent government towards the common people and restored the territories of the states of Chen and Cai, enthroning members of the former ruling houses. The eastern parts of Chu were plundered by the armies of Wu during this interlude of internal war in Chu.\n\nKing Ping decided to marry his son, Crown Prince Jian 建, with a princess from Qin 秦. Yet the girl was so beautiful that the king decided to take her for himself, and she gave birth to Prince Zhen 軫. Grand Tutor (taifu 太傅) Wu She 伍奢 and Junior Tutor (shaofu 少傅) Fei Wuji 費無忌 intrigued against each other and instigated in the king the fear that the crown prince might prematurely usurp the throne. Prince Jian thereupon fled to the court of Song. Wu She's son Wu Zixu 伍子胥, who was an excellent strategist, was able to escape to the state of Wu, the arch-enemy of Chu.\n\nThe mother of Prince Jian was captured by the army of Wu when Prince Guang 光 of Wu was campaigning against Chen and Cai. A small border clash in Beiliang 卑梁 lead to an armed conflict between Chu and Wu, in which Wu conquered the territories of Zhongli 鐘離 and Juchao 居巢. King Ping was so threatened that he began fortifying the capital city Ying. When King Ping died, the nobles wanted to enthrone his younger brother Prince Zixi 子西, but he refused, so that the under-age prince Zhen was enthroned as ruler of Chu. He is posthumously known as King Zhao 楚昭王 (r. 516-489).\n\nAt the beginning of his reign, Prime Minister Zichang 子常 took revenge for Prince Jian and Wu She and killed the intriguer Fei Wuji. The reason for this was that a many nobles had fled to Wu, where they supported the troops of Chu against the own dynasty in Chu. Yet there were also some princes of Wu escaping trouble in the own country at the court of Chu.\n\nIn 509 BCE the army of Chu, commanded by Prince Zichang, was heavily defeated by Wu in the battle of Baiju 柏舉 (modern Macheng 麻城, Hubei). Wu Zixu as one of the competent military leaders of Wu even managed to conquer the capital of Chu in 506. As a revenge for the execution of his father, Wu Zixu had the tomb of King Ping desecrated. Commander Prince Zichang fled to the state of Zheng. King Zhao himself escaped to Yunmeng 雲夢 and then on to the former state of Sui, where he was hidden by his loyal courtiers and the population from the army of Wu.\n\nIn the meantime, minister Shen Baoxu 申鮑胥 was sent to the state of Qin to ask for relief troops, which were indeed able to defeat the troops of Wu that had advanced far into the country of the enemy until they reached Ji 稷 (modern Tongbai 桐柏, Henan). Prince Fugai 夫概, brother of the king of Wu, usurped the throne on this occasion but was driven out by the righteous king and fled to the court of Chu.\n\nStill on his way back to the capital, King Zhao of Chu swallowed the state of Tang 唐 (near modern Suizhou, Hubei), then Dun 頓 (modern Shangshui 商水, Henan) and Hu 胡 (modern Fuyang 阜陽, Anhui). There was another occasion in 504 when the army of Wu again invaded the state of Chu. Only with the death of King Helü 闔閭 of Wu (r. 514-496) the attention of Wu was directed against the state of Yue, and the danger from the east was gone.\n\nOn his sickbed, King Zhao wanted to cede the throne to his younger brother, yet all nobles refused, before Prince Zilü 子閭 conceded to become the successor of his brother. Yet when the King died on a campaign, the brothers decided to enthrone the king's son, Prince Zhang 章. He is posthumously known as King Hui 楚惠王 (r. 489-432). In 488 Prince Zixi invited the former Prince Jian's son Prince Sheng 勝 to come back to Chu. He was granted the title of Duke Bai 白公. Duke Bai planned to revenge his father's death, who had been killed in exile in Zheng.\n\nIn 481 BCE, the army of Jin attacked Zheng, and Zheng asked Chu for help. Instead of annihilating Zheng, commander Zixi left Zheng untouched. Duke Bai thereupon killed Zixi, Prince Ziqi 子綦 and Prime Minister Sima Ziqi 司馬子期 at the court and tried to kidnap King Hui. Yet the king was protected by his retainers and took refuge in the palace of the Queen Dowager of King Zhao.\n\nDuke Bai thereupon proclaimed himself king, but was assassinated by Prince Zigao 子高, called Duke Ye 葉公. In this year, Chu finally destroyed the state of Chen, in 447 the state of Cai, and in 445 the state of Qi 杞.\n\nIn 473, the armies of Yue had finally destroyed the state of Wu. In the northern parts of Wu, along the plain of the River Huai 淮, Chu began to expand its territory. King Hui was succeeded by his son Prince Zhong 中, who is posthumously known was King Jian 楚簡王 (r. 432-408). Under his reign, Chu conquered the statelet of Ju 莒 (modern Juxian 莒縣, Shandong) that had belonged to the territory of Qi. King Jian employed the famous military advisor Wu Qi 吳起, who reformed the army, so that Chu was able to conquer the southern regions inhabited by the non-Chinese peoples of the Yangyue 揚粵, namely the Dongting 洞庭 (Hunan) and Cangwu 蒼梧 (Guizhou) regions.\n\nKing Jian was succeeded by his son Prince Dang 當, posthumously known as King Sheng 楚聲王 (r. 408-402). King Sheng was killed by \"robbers\" (presumably nobles or family members) and was succeeded by his son Prince Yi 疑, posthumously known as King Dao 楚悼王 (r. 402-381). Under his reign, Chu contended with the troops of the new states of Han 韓, Zhao 趙 and Wei 魏, the successor states of Jin. King Dao was succeeded by his son Prince Zang 臧, posthumously known as King Su 楚肅王 (r. 381-370). Because King Su had no sons, he left the throne to his younger brother Prince Liangfu 良夫, who is posthumously known as King Xuan 楚宣王 (r. 370-340). At the end of the latter's reign, the armies of Qin attacked Chu. At that time, Qin was governed by counsellor Shang Yang 商鞅.\n\nKing Xuan's son Prince Shang 商 succeeded to the throne in Chu, posthumously known as King Wei 楚威王 (r. 340-329). He was able to defeat the armies of the state of Qi, which was at that time disturbed by inner quarrels. King Wei also defeated the armies of the kingdom of Yue and occupied a large part of its territory, so that Chu was now the sole state in the southern parts of China. In 306, Yue was destroyed by Chu.\n\nChu as a large but weak state between Qin and Qi\n\nWhen King Wei died, the state of Wei used this opportunity and conquered part of its northern territory. King Wei's successor was his son Prince Guai 槐, posthumously known as King Huai 楚懷王 (r. 329-299). In 323 BCE he took revenge and attacked the territory of Wei, seizing eight counties. The next military target was the state of Qi, yet at that time the military adviser Chen Zhen 陳軫 dwelled at the court of Qi and was dispatched to the camp of counsellor Zhao Yang 昭陽, highest commander of the army of Chu. Chen Zhen persuaded Zhao Yang with the parable of drawing feet to a snake that he would have no advantage in defeating the army of Qi, so that Zhao Yang withdrew. At least, Chu was able to conclude an alliance with the states of Qin, Wei and Qi that was initiated by the famous diplomatist Zhang Yi 張儀.\n\nThis alliance became important in 318 BCE, when an alliance, concluded with the help of Su Qin 蘇秦, attacked the state of Qin. King Huai took over the lead of the allies and penetrated into the Hangu Pass 函谷關, yet the allies withdrew without forcing Qin to battle.\n\nIn 313, things had changed and Chu was in alliance with Qi. The king of Qin decided to send Zhang Yi to Chu in order to persuade King Huai to change side again and, in the end, to isolate Chu. Chen Zhen was well aware of this and warned King Huai, but he refused to accept the warning. In the end, the enraged king of Qi concluded an alliance with Qin. King Huai, on his side, made ready the troops for a campaign against Qin. Again, Chen Zhen warned the king and suggested offering Qin a city to restore the former alliance. King Huai ignored the warning, and so the army of Qin destroyed that of Chu at Danyang 丹陽 in 312, captured a huge humber of troops and officers, and occupied the region of Hanzhong 漢中. At Lantian 藍田, the armies battled a second time, and the fresh defeat of Chu instigated Han and Wei to seize some more territory from Chu.\n\nA year later, Qin suggested concluding peace and sent Zhang Yi to the court of Chu. King Huai immediately arrested Zhang Yi and planned to kill him, but Zhang established contact with Jin Shang 靳尚, who explained to King Huai that Qin would attack Chu again. He also spoke with the King's favourite, Lady Zheng Xiu 鄭袖, and threatened her that the king of Qin would try to purchase peace by sending beautiful girls to King Huai. The Lady then managed the release of Zhang Yi, and peace was made with Qin. Shortly after, the Chu embassador to Qi returned, Qu Yuan 屈原, and reproached the king for not having executed Zhang Yi.\n\nIn 310 BCE, the King Min of Qi 齊湣王 (r. 324-284) sent an envoy to the court of Chu and explained that, after the death of King Hui in Qin, the situation had changed thoroughly, and suggested to conclude a common alliance with Han, Wei, Zhao and Yan 燕 against Qin. Zhao Ju 昭雎 convinced King Huai that it was better to be part of the alliance around Qi and to win back the territory once lost to Qin. Yet in 307, King Huai decided that he could also win territory by concluding a peaceful alliance with Qin. Two years later Qin, Han and Wei attacked Chu for its betrayal of the alliance. King Huai sent his crown prince as a hostage to Qin and requested military support against the three states.\n\nIn 304, the crown prince of Chu had a private quarrel with some nobles of Qin. When he accidentally killed one of them, he fled and returned to Chu. In order to take revenge for the murder, Qin attacked Chu, supported by troops of Qi, Han and Wei, and defeated Chu at Chuisha 垂沙. A year later, Qin undertook a second campaign against Chu and heavily defeated the army of Chu. King Huai thereupon sent his crown prince as a hostage to Qi, an ally of Qin, and requested peace.\n\nOnly after a further campaign and after King Zhao of Qin had sent an urgent letter, King Huai of Chu consented to a meeting with the king of Qin at the Wuguan Pass 武關. Yet King Huai did not trust Qin and feared that he might be caught in a trap. Zhao Ju suggested not to meet the king of Qin, but the King's younger son urged him to go. In the end, King Huai was escorted to Xianyang 咸陽, the capital of Qin, and was threatened to cease territory before concluding an alliance. He refused and was arrested and detained.\n\nAt home, the situation was precarious. Both the king and the crown prince were held hostages in Qin, and Zhao Ju argued that it was against etiquette to enthrone a younger son as long as the ruler was living. This meant that there was no head of government as long as King Huai was in Qin. The court brooded over the issue and finally invited Prince Heng 橫 to come to the capital Ying. He was enthroned as king of Ch, posthumously known as King Qingxiang 楚頃襄王 (r. 299-263).\n\nThe king of Qin thereupon continued his campaigning against Chu, defeated its army, and seized territory in the north. A year later, King Huai managed to escape, but because the roads to Chu were blocked by Qin, he fled to the state of Zhao, but fearing the anger of Qin, King Huiwen of Zhao 趙惠文王 (r. 299-266) refused to offer protection. King Huai was finally captured by the bloodhounds of Qin and brought back to Xianyang, where he died a year later. At least, his corpse was allowed to be transferred back to his native state, where he was buried with greatest honours.\n\nIn 293 BCE, general Bai Qi 白起 massacred the army of Han. Threatened by this cruel way of warfare, King Qingxiang agreed to conclude a marriage of peace with Qin. This new alliance led to a campaign in 284, carried out by Qin, Chu, Han, Wei, Zhao and Yan and targeted against the state of Qi in the east. Chu so regained the region of Huaibei 淮北. In 281, King Qingxiang was persuaded to resume war against Qin, in order to gain more territory. He first concluded an alliance with Qin and Han and planned to use this opportunity to conquer some territory of the patriarchal kings of Zhou around Luoyang. King Nan of Zhou 周王赧 (r. 315-256) thereupon sent his relative, Duke Wu 武公, to Zhaozi 昭子, the counsellor of Chu. Duke Wu explained to Zhaozi that the destruction of the house of Zhou meant a thorough dissolution of the world order and would bring only chaos to the state of Chu. King Qingxiang thereupon abandoned this plan.\n\nThe campaigns against Qin continued, but in 278 BCE, general Bai Qi advanced to the capital of Chu and defiled the tombs of the kings of Chu. The capital of Chu was moved to the ancient site of Chen (modern Huaiyang 淮陽, Henan) It was only in 276 that the army of Chu was able to recover some of its core territory. Chu was even able to supporte Han, Zhao and Wei in a campaign against Yan. This was only possible because of an armistice bargained with Qin, covered by the crown prince as a hostage dwelling in Qin.\n\nWhen King Qingxiang fell ill, his son Prince Xiong Yuan 熊元 (or Wan 完) managed to escape from Qin and was enthroned as the new king of Chu. He is posthumously known as King Kaolie 楚考烈王 (r. 263-238). The new king immediately appointed his trusted Counsellor-to-the-Left (zuoxi 左徒), Lord Chunshen 春申君, as Prime Minister. Under the Lord's administration, the state of Chu was able to recover for a while. The capital was first shifted to Juyang 巨陽 (modern Taihe 太和, Anhui), later to to Shouchun 壽春 (modern Shouxian 壽縣, Anhui) further to the east. Lord Chunshen met with Lord Xinling 信陵君 of Wei and forged an alliance that was able to defeat Qin in 257. A year later, Chu conquered the state of Lu.\n\nKing Kaolie was succeeded by his son Prince Dao 悍 (or Yu 煜), who is posthumously known as King You 楚幽王 (r. 238-228). Li Yuan 李園, a powerful noble, used this personal change to assassinate Lord Chunshen. King You was succeeded by his younger half-brother You 猶 (or Hao 郝), who is posthumously known as King Ai 楚哀王 (r. 228). He only ruled for two months before he was overthrown and killed by his older half-brother Fuchu 負芻 (r. 228-223).\n\nThe rule of the last kings of Chu was overshadowed by a growing military success of the state of Qin that succeedingly conquered the states of Han, Zhao and Wei. In 224, the Qin general Wang Jian 王翦 defeated the army of Chu and killed general Xiang Yan 項燕, a great uncle of Xiang Yu 項羽, the eventual hegemonial king (bawang 霸王) of West Chu 西楚. A year later, Wang Jian and Meng Wu 蒙武 seized the capital of Chu, captured King Fuchu and transformed the state of Chu into a commandery of the state of Qin.\n\nThe name of Chu was often used as a name for imperial princedoms, and was one of the Ten States (Shiguo 十國) in the 10th century.\n\n\n\n\n\nTable 1. Rulers of the regional state of Chu 楚 Capitals: Danyang 丹陽 (modern Zigui 秭歸, Hubei), Ying 郢 (modern Jiangling 江陵 or Shashi 沙市, Hubei), Ruo 鄀 (Shangruo 上鄀; near modern Zhongxiang 鍾祥, Hubei), Yingchen 郢陳 (modern Huaiyang 淮陽, Henan), Juyang 巨陽 (near Taihe 太和, Anhui), Shouchun 壽春 (modern Shouxian 壽縣, Anhui) dynastic title personal name time Xiong Yi of Chu 楚熊繹, family name Mi 芈 (or Nai 嬭, Qian 芊, Xiong 熊, Yan 酓) Xiong Yi of Chu 楚熊乂 Xiong Tan of Chu 楚熊黮 Xiong Sheng of Chu 楚熊勝 Xiong Shang 楚熊煬 or Xiong Yang of Chu 楚熊揚 Xiong Qu of Chu 楚熊渠 Xiong Wukang of Chu 楚熊無康 Zhi Hong of Chu 楚鷙紅 (or 摯紅) Xiong Yan of Chu 楚熊延 Xiong Yong of Chu 楚熊勇 848-838 Xiong Yan of Chu 楚熊嚴 838-828 Xiong Shuang of Chu 楚熊霜 828-822 Xiong Xun of Chu 楚熊徇 (or 熊狥) 822-800 Xiong E of Chu 楚熊鄂 (or 熊咢) 800-791 Ruo Ao of Chu 楚若敖 Mi Xiong Yi 芈熊儀 791-764 Xiao Ao of Chu 楚霄敖 Mi Xiong Kan 芈熊坎 764-758 Fen Mao of Chu 楚蚡冒 Mi Xiong Xuan 芈熊眴 (or Xiong Xun 熊㫬) 758-741 King Wu of Chu\n\n(Chu Wuwang 楚武王) Mi Xiong Tong 芈熊通 741-690 King Wen of Chu\n\n(Chu Wenwang 楚文王) Mi Xiong Zi 芈熊貲 690-677 Du Ao, King of Chu 楚王堵敖 Mi Xiong Jian 芈熊艱 677-672 King Cheng of Chu\n\n(Chu Chengwang 楚成王) Mi Jun 芈頵 672-626 King Mu of Chu\n\n(Chu Muwang 楚穆王) Mi Shangchen 芈商臣 625-614 King Zhuang of Chu\n\n(Chu Zhuangwang 楚莊王) Mi Lü 芈旅 614-591 King Gong of Chu\n\n(Chu Gongwang 楚共王) Mi Shen 芈審 591-560 King Kang of Chu\n\n(Chu Kangwang 楚康王) Mi Zhao 芈招 560-545 Jia Ao, King of Chu 楚王郟敖 Mi Jun 芈麇 545-451 King Ling of Chu\n\n(Chu Lingwang 楚靈王) Mi Qian 芈虔 541-529 King Ping of Chu\n\n(Chu Pingwang 楚平王) Mi Ju 芈居 529-516 King Zhao of Chu\n\n(Chu Zhaowang 楚昭王) Mi Zhen 芈軫 516-489 King Hui of Chu\n\n(Chu Huiwang 楚惠王) Mi Zhang 芈章 489-432 King Jian of Chu\n\n(Chu Jianwang 楚簡王) Mi Zhong 芈中 432-408 King Sheng of Chu\n\n(Chu Shengwang 楚聲王) Mi Dang 芈當 408-402 King Dao of Chu\n\n(Chu Daowang 楚悼王) Mi Yi 芈疑 402-381 King Su of Chu\n\n(Chu Suwang 楚肅王) Mi Zang 芈臧 381-370 King Xuan of Chu\n\n(Chu Xuanwang 楚宣王) Mi Liangfu 芈良夫 370-340 King Wei of Chu\n\n(Chu Weiwang 楚威王) Mi Shang 芈商 340-329 King Huai of Chu\n\n(Chu Huaiwang 楚懷王) Mi Guai 芈槐 329-299 King Qingxiang of Chu\n\n(Chu Qingxiangwang 楚頃襄王) Mi Heng 芈橫 299-263 King Kaolie of Chu\n\n(Chu Kaoliewang 楚考烈王) Mi Wan 芈完 263-238 King You of Chu\n\n(Chu Youwang 楚幽王) Mi Yu 芈煜 238-228 King Ai of Chu\n\n(Chu Aiwang 楚哀王) Mi Hao 芈郝 228 Fuchu, King of Chu 楚王負芻 Mi Fuchu 芈負芻 228-223 223 Chu destroyed by Qin 秦.\n\nSources:\n\nLi Ling 李零 (1992). \"Chu 楚\", in Zhongguo da baike quanshu 中國大百科全書, Zhongguo lishi 中國歷史 (Beijing/Shanghai: Zhongguo da baike quanshu chubanshe), Vol. 1, 109-110."}, {"url": "https://www.chinahighlights.com/travelguide/china-history/zhou-dynasty.htm", "page_content": "The Zhou Dynasty (1045–221 BC) saw China grow, fracture into states, then unite in imperialism. It was technically the longest dynasty, though the Zhouhad effectively lost power by 770 BC. Major philosophies and religions emerged that were the basis of Chinese belief in later eras, such as Confucianism and Daoism.\n\nThe era is divided into three periods: the Western Zhou Dynasty (1045–771 BC), the Spring and Autumn Period (770–476), when the empire divided into dozens of competing kingdoms, which then coalesced into several big and warring kingdoms during the Warring States Period (475–221).\n\nThe Western Zhou Period (1045–770)\n\nAccording to written accounts, the king of the Zhou tribe who was called Zhou Wu attacked the last king of the Shang Dynasty and became the first Zhou emperor.It is thought that the Zhou Empire was initially politically centralized over a small territory around the Yellow River (see ).\n\nThe Zhou Dynasty is said to have been initially strong. The ruling clan's name was Ji. But over time, as the territory grew, local rulers became more powerful. As the empire expanded in size, various strong clans emerged and expanded their territories.\n\nThe Western to Eastern Zhou Transition (771–770 BC)\n\nIn 771 BC, after King You replaced his wife with a concubine, the capital was attacked by his wife's father who ruled a region called Shen and by a nomadic tribe called the Quanrong. The rulers of several of the regions in the empire proclaimed the queen's son who was named Ji Yijiu to be the new king.\n\nThe capital was moved eastward in 770 BC from Haojing in Xi'an to Luoyang in present-day Henan Province (marking the start of the Eastern Zhou Dynasty of 770–221 BC). The sack of the king and the change of capital mark the end of the rule of the Ji clan over the whole region. After 771, the Zhou Dynasty became the nominal leading clan.\n\nThe Ancient Historical Accounts\n\nThe main ancient written accounts about the beginning of the Zhou Dynasty are in the Records of the Grand Historian that were written between about 109 BC and 91 BC by Sima Qian.\n\nAnother text that is called the Bamboo Annals, it is said that the text, written on flat pieces of bamboo, was buried with the King of Wei who died in 296 BC and that it was rediscovered in 281 AD during the Jin Dynasty era.\n\nThe written accounts may not be accurate. There is a lot of myth and legend concerning this early period of time.\n\nThe Spring and Autumn Period (770–476)\n\nThe Spring and Autumn Period was the beginning ofthe Eastern Zhou era. During this period, the Zhou Empire reached the Yangtze River, and it was basically centered on the eastern part of the Yellow River (see our Eastern Zhou Period Map). The first king to rule in the eastern capital, Luoyang, was said to be King Ping.\n\nThe Zhou kings ruled as figure heads. Though the dynastic clan did have a small territory of their own at Luoyang, their territory was too small to raise an army. They depended on the surrounding regions for their defense. They performed religious ceremonies.\n\nZhou Dynasty Literature\n\nThe main contributions of the Zhou era to Chinese literature were the prose works of the Spring and Autumn Period, many of which developed in the Warring Sates Period: the Confucian Classics, the Daoist writings, Legalism texts, and preserved poems, histories, and songs.\n\nWarfare Between the States Increased (c.550–476 BC)\n\nThere was warfare between the states, and by the middle of the 500s BC, three big states emerged: Qin, Jin and Qi. To the south, the state of Chu became powerful also.\n\nFinally, at the end of this period, the state of Jin was divided by civil war into three states, and there were about 14 states in the whole region.\n\nThe Warring States Period (476–221)\n\nIn the Warring States Period, after the relatively peaceful and over philosophical Spring and Autumn Period, various kingdoms fought and conquered for over 200 years before the Qin State conquered them all.\n\nIn the Warring States Period, technology advanced so that iron tools and weapons became common. Instead of companies of chariots, armies of organized mounted soldiers with masses of infantry became common. In the end, the Qin could muster armies of hundreds of thousands.\n\nThe Zhou to Qin Dynasty Transition\n\nIn 221 BC, the State of Qin conquered the last of the warring states, and united China under the Qin Dynasty. The First Emperor made Xi'an his new capital. He was famous for huge building projects, such as a mausoleum for himself with Terracotta Warriors, and the first complete Great Wall.\n\nZhou Dynasty Tours of China"}, {"url": "http://www.chinaknowledge.de/History/Zhou/zhou-event-chunqiu.html", "page_content": "Oct 3, 2018 © Ulrich Theobald\n\nThe Spring and Autumn period (Chunqiu 春秋, 770-5th cent. BCE) is the first part of the so-called Eastern Zhou period (Dongzhou 東周, 770-221 BCE). It is characterized by a significant decrease of political power of the kings of Zhou which had to flee to the eastern capital Chengzhou 成周 (or Luoyi 雒邑, modern Luoyang 洛陽, Henan) after their western and main capital Zongzhou 宗周 (of Feng 豐, near modern Xi'an 西安, Shaanxi) had been attacked by the nomad tribes of the Quanrong 犬戎.\n\nPeriodization\n\nThe name of the historical period is derived from the chronicle of the regional state of Lu 魯 called Chunqiu 春秋 \"Spring and Autumn Annals\" because the seasons are always mentioned in the entries. The Annals cover the time from 722 to 481 BCE, yet the historical period is traditionally counted from the reign of King Ping of Zhou 周平王 (r. 770-720 BCE), who restored the Zhou dynasty in Luoyang, down to the division of the state of Jin 晉 by the regional rulers (zhuhou 諸侯) of Han 韓, Wei 魏 and Zhao 趙 in 376. Alternatively, the end of the Spring and Autumn period can be seen as 453, when the three viscounts (zi 子) of Han, Wei and Zhao extinguished all other lateral lines to the house of Jin, or 403, when King Weilie of Zhou 周威烈王 (r. 426-402) bestowed upon the viscounts of Han, Wei and Zhao the title of marquis (hou 侯).\n\nThe second great historiographical writing of the Spring and Autumn period is the collection Guoyu 國語 \"Discourses of the states\" that includes anecdotes of the states of Zhou 周, Lu 魯, Qi 齊, Jin 晉, Zheng 鄭, Chu 楚, Wu 吳 and Yue 越. Said to be a composition of Zuo Qiuming 左丘明, its oldest parts must have been compiled at the end of the 5th century BCE.\n\nConfucius\n\nThe most important intellectual person of this historical period was the philosopher Confucius (Kongzi 孔子; ca. 551-479) who tried to revive the ideal of the human and righteous rulers of old. Although his ideas seemed lost in a time of political realism his thoughts about state and society (\"Confucianism\") were to become the fundamental doctrine of imperial China.\n\nThe Early Decades of the Eastern Zhou and the Duke of Zheng\n\nThe eastern capital Chengzhou (Luoyang) did not provide the kings of Zhou with sufficient power. They were therefore dependent on the powerful regional rulers, especially those of Qin 秦, Jin, Qi and Chu. These are called the \"local rulers\" (fang bo 方伯) because they practically ruled independently from the king of Zhou, and not any more as his vassals. It became common that the regional states acted on their own behalf regarding territory and military feuds, without asking the king of Zhou for formal permission. Duke Zhuang of Zheng 鄭莊公 (r. 743-701) even dared attacking King Huan 周桓王 (r. 720-697 BCE) who had not treated him properly according to the ritual regulations. Heijian 黑肩, the Duke of Zhou 周公, even planned to kill King Huan's successor, King Zhuang 周莊王 (r. 697-682), and to replace him with Prince Ke 克. Yet Xin Bo 辛伯 warned the king and saved his life.\n\nDuke Zhuang of Zheng defeated intruding Rong 戎 tribes and swallowed the neighbouring state of Xu 許. In 707 King Huan of Zhou 周桓王 (r. 719-697) started a punitive expedition against the Duke, but the king was defeated. From then on, the kings of Zhou never again tried to intervene into the politics of their own regional rulers. They stayed in their small royal domain around Luoyang and had to be content with the tributes of the regional rulers that were presented less and less regularly. Besides Zheng, the states of Song 宋 and Lu 魯 demonstrated their military and political power in the Central Plain.\n\nThe Rise of Duke Huan of Qi\n\nKing Li 周釐王 (r. 682-677) was so helpless against the new threats endangering the empire that he allowed Duke Huan of Qi 齊桓公 (r. 685-643) to adopt the title of hegemonial lord (ba 霸, or bo 伯). In this function the Duke defended the regional states against raids of barbarian tribes and cared for law and order among the states of the Middle Kingdom, with the motto \"support the king and ward off the barbarians\" (zun wang rang yi 尊王攘夷).\n\nIn the east, the state of Qi had rich natural ressources and became one of the mightiest regional states of the Eastern Zhou period.\n\nDuke Huan of Qi employed the legalist statesman Guan Zhong 管仲 as his adviser who reorganized administration and the military and financial systems. Through these reforms Qi was able to subdue Song and Lu and even the hegemonial state of Zheng. At that time, the non-Chinese nomad tribes of the Rong and Di 狄 undertook raids on the soil of Chinese states and devastated the states of Xing 邢 and Wei 衛 (modern Shanxi and Hebei). Duke Huan of Qi rescued the dynastic houses of these states and settled them down more to the south. The system of the hegemon thus developed to a kind of lord protector of a strong state over weaker ones, and Qi promised to protect the states in the Central Plain against further intrusions of the northern nomad warriors.\n\nThe Semi-Barbarian Kingdom of Chu\n\nIn the south, the state of Chu on the middle Yangtze River had become politically stronger than before. King Cheng of Chu 楚成王 (r. 671-626) started to challenge the hegemony of Qi and swallowed smaller states in his neighbourhood. Nonetheless, subservient states like Jiang 江 and Huang 黃 changed side and declared their alliance with Qi. Chu thereupon attacked Zheng. Duke Huan assembled the regional rulers and created an alliance with Lu, Song, Chen and Wei to punish Chu in 656 by devastating the state of Cai 蔡, an ally of Chu. Chu gave in, and the ambassadors of the two mighty states met at Shaoling 召陵 (modern Yancheng 郾城, Henan) to conclude a peaceful alliance (meng 盟).\n\nThe System of Hegemonial Lordship\n\nIn 651 Qi organized a meeting at Kuiqiu 葵丘 (modern Lankao 蘭考, Henan) whith the representatives of Lu, Song, Zheng and Wei, and in presence of a royal diplomat from Zhou. The members of the meeting decided that states creating a friendly alliance should never attack each other, and that they had to assist each other in case that one partner was attacked. The Duke of Qi thus became the overlord over the weaker states of Zhou China and replaced the king of Zhou as the highest judicial person.\n\nSuccession Crises at the Zhou Court\n\nWhen King Li died a succession crisis endangered the house of Zhou. His righteous heir was Prince Kan 閬, who is known as King Hui 周惠王 (r. 677-652), but his late grandfather, King Zhuang, had had a favourite son called Prince Tui 穨. King Hui was not a very intelligent ruler. He offended many of his highest ministers and caused a rebellion that forced him to flee to Wen 溫 (modern Wenxian 溫縣, Henan) and then to Li 櫟, a town in the state of Zheng. His uncle Prince Tui was made King of Zhou, but he did not prove a better ruler. He was therefore attacked and killed by the lords of Zheng and Guo 虢. King Hui returned to the throne.\n\nWhen King Hui died he was succeeded by his son Prince Zheng 鄭, who is known as King Xiang 周襄王 (r. 652-619). King Xiang had a half-brother called Shudai 叔帶 (or Dai 帶), who had been the favourite son of King Hui. Prince Shudai planned to usurp the throne and joined forces with the Rong and Di 翟 tribes. The plot failed and Prince Shudai fled to Qi. It was a high minister of Qi, the reformer Guan Zhong, who mediated the peace treaty between the house of Zhou and the Rong tribes. A decade later the king of Zhou even allowed Prince Shudai to return.\n\nWhen the state of Zheng attacked in 639 the statelet of Hua 滑, whose lords were relatives to the house of Zhou, King Xiang sent You Sun 游孫 and Bo Fu 伯服 as diplomats to negotiate peace. Yet the Duke of Zheng arrested the diplomats. The King thereupon ordered the Di tribes to attack Zheng, inspite of the remonstances of minister Fu Chen 富辰. Fu Chen was also not content with the King's will to marry a Di princess in order to reward the Di chieftain for his support. His critics were justified because only a few years later King Xiang discarded the \"barbarian\" queen, which caused an attack of the Di on the royal capital, during which the Earl of Tan 譚 (or the earls of Yuan 原 and Mao 毛) was/were killed. Fu Chen thereupon threw himself into battle against the intruders and died. King Xiang fled to Zheng and was received by the duke of Zheng, in spite of all former discrepancies.\n\nIn the meantime Prince Dai was enthroned as King of Zhou, yet he took residence in Wen, not in Luoyang. He invited the Di queen to return to the royal domain. Two years later King Xiang asked the duke of Jin for help, who willingly attacked the usurper and executed him. King Xiang, returning to the throne, rewarded Duke Wen of Jin 晉文公 (r. 636-628) with the title of hegemonial lord and presented him with some territory. Duke Wen was thereafter the most powerful political leader of the Middle Kingdom and assembled the regional rulers, including his formal superior, the King of Zhou, at Heyang 河陽 and Jiantu 踐土. The kings of Zhou were now wholly dependent from support by other political actors. Histories nevertheless concealed this shameful situation with terms like \"royal hunt at Heyang\".\n\nThe Rise of the Regional State of Jin\n\nAfter the death of Duke Huan of Qi several regional rulers strove for overlordship. Duke Xiang of Song 宋襄公 (r. 650-637) was defeated by Chu, and the state of Song lost its last chance to rise to political and military significance. Instead, the state of Jin rose to supremacy in old China: Duke Xian of Jin 晉獻公 (r. 676-651) had already extended the power of his state by swallowing the statelets of Geng 耿, Huo 霍, Wei 魏 (a state that was later one of the three destructors of Jin), Guo 虢 and Yu 虞. After a decade of inner struggles, the state of Qin supported Duke Wen of Jin in his ascension to the throne of Jin.\n\nJust as Duke Huan of Qi, Duke Wen of Jin employed political advisors, Zhao Shuai 趙衰 (Zhao Chengzi 趙成子) and Hu Yan 狐偃, who strengthened the \"national\" economy and so the military power of the state. In 635 the King Xiang of Zhou escaped from inner disturbances to the state of Zheng. Duke Wen of Jin saw his chance, rescued the king and accompanied him back to the royal domain, for which support he was highly rewarded by the King.\n\nThe next step for the Duke was to challenge the power of the southern, semi-Chinese state of Chu that had dominated the Central Plain since the death of Duke Huan of Qi. In 632 the two states clashed at the battle of Chengpu 城濮 (modern Zhencheng 甄城, Shandong), and Chu was defeated. Duke Wen of Jin established a new friendly alliance during the meeting at Jiantu 踐土 (modern Yingze 滎澤, Henan) with the seven most important states. In the same year, at Wen, the King of Zhou sanctified the hegemony by Jin. Duke Wen's successor Duke Xiang 晉襄公 (r. 627-621) was able to prolong the hegemonial prevalence of the state of Jin.\n\nConflict Between Qin and Jin\n\nDuring the reign of Duke Xiang of Jin, Duke Mu of Qin 秦穆公 (r. 659-621) opened a long period of military confrontation between Jin and Qin, but Qin seldomly won any battle. The powerful state of Jin blocked the gate to the Central Plain, and Qin could not but expand its territory to the west into the territory of the Western Rong tribes 西戎 and establish good relations with Chu in the south. Chu meanwhile further expanded its territory by conquering the statelets of Jiang 江, Lu 六 (a special reading!), and Liao 蓼. After the death of Duke Xiang of Jin, the noble Zhao Dun 趙盾 (Zhao Xuanzi 趙宣子) dominated the throne succession of Jin, murdered Duke Ling 晉靈公 (r. 620-607) and enthroned Duke Cheng 晉成公 (r. 606-600). During this period Jin lost its initiative in \"foreign\" politics. The political advisor Fan Shan 范山 proposed to King Mu of Chu 楚穆王 (r. 625-614) to take the chance and to advance against the north.\n\nThe Rise of the State of Chu\n\nKing Zhuang of Chu 楚莊王 (r. 613-591) had to resolve internal quarrels and uprisings of aboriginal tribes before he was able to reform economic and military administration and to resume this expansion politics. In 606 the southern king sent out an envoy to the court of King Ding of Zhou 周定王 (r. 606-586) to express his will to swallow the royal domain of Zhou. In 598 King Zhuang of Chu crushed the small state of Chen 陳, one year later the state of Zheng. At the battle of Bi 邲 (near modern Zhengzhou 鄭州, Henan) the army of the hegemonial state of Jin was defeated.\n\nA few years later, Chu defeated the state of Song and finally obtained the overlordship over the Central Plain. The protecting task of the overlord had gradually lost its original intention and became a system of hegemony of one major state over weak satellites of Chinese and \"barbarian\" origin. The attitude to help small states during internal quarrels and against \"barbarian\" invaders changed to a regular intervention into political affairs to the advantage of the great states.\n\nInternal Quarrels in Jin\n\nThe state of Qi observed the growing power of Chu, declared a friendly relationship with the southern king of Chu, who was the only regional ruler who called himself king, except, of course, the King of Zhou. Qi repeatedly attacked the smaller states of Lu and Wei which therefore asked for support the former hegemonial state of Jin. In 589, the army of Jin fought with Qi in the battle of An 鞍 (modern Jinan 濟南, Shandong) and once again demonstrated its superior military power. Chu instantly declared war to Jin, but neither Chu nor Jin dared to initiate a concrete campaign.\n\nAfter long years of hesitation and negotiations (under the stipulation of Jin's political advisor Song Huayuan 宋華元) Chu attacked Zheng and Wei in 576. One year later the armies of the two hegemonial states fought in the famous battle of Yanling 鄢陵 (modern Yanling, Henan) in which Jin prevailed by a narrow margin. Duke Li of Jin 晉厲公 (r. 580-573) saw his chance to resume hegemony, murdered his mightiest noblemen Xi Zhi 郤至, Xi Qi 郤錡 and Xi Chou 郤犨 (the \"Three Xi\" 三郤). Yet instead of having strengthened his own position, Duke Li faced serious opposition by the Jin aristocracy like Luan Shu 欒書 and Xun Yan 荀偃 who eventually killed their lord.\n\nUnder the next ruler, Duke Dao 晉悼公 (r. 572-558), the internal situation calmed down, and the duke was able to strengthen the position of the state of Jin. His political advisor Wei Jiang 魏絳 proposed to appease the nomad warriors of the Rong with financial tributes instead of fighting them. In 571 Jin erected a fortification wall at Hulao 虎牢 (modern Fanshui 氾水, Henan) against the state of Zheng that was backed by Chu.\n\nAfter more than two decades of relative peace the political advisor Song Xiangxu 宋向戌 proposed to organize a peace conference to end military conflict. It was held in the capital of Jin in 546 and the participating fourteeen states decided to accept the overlordship of the two states of Jin and Chu. Their adherents had to declare their subjection under the respective overlordship and to present tributes to the two hegemons. Among the participating states, there would be ten years of peace, and for more than fourty years, Jin and Chu would not meet at the battle field again.\n\nOnly two of the larger states did not participate in the general peace: Qi, and Qin.\n\nThe old kingdom of Zhou had totally lost its political role. The tributes once paid to the kings of Zhou were now offered to the dukes of Jin and the kings of Chu. If a small state did not pay tribute it had to expect military sanctions. Especially precarious was the role of the state of Lu that had to maintain good relationships to the three states of Jin, Chu and Qi, if it did not want to be swallowed by one of them. Very similar was the role of Zheng that was directly in the line of fire between Jin and Chu. But states like Lu also imitated the overlordship of their own masters and demanded tributes from yet smaller states like Teng 滕, Qi 杞 or Zeng 鄫.\n\nThe Rise of the Semi-Barbarian States of Wu and Yue\n\nDuring the relatively peaceful sixth century, the two southern non-Chinese coastal states of Wu 吳 and Yue 越 emerged as new powers. Jin saw its chance to open a second flank against Chu, and in 583 Duke Wuchen of Shen 申公巫臣 was sent to Wu in order to seek a military alliance. The semi-barbarian state of Wu was equipped with military tools and Wu soldiers were trained to attack Chu. But it was only more than half a century later that Wu became a serious threat to Chu after swallowing the statelet of Xu 徐.\n\nUnder King Helü 闔閭 (r. 514-496) the political advisor Wu Yuan 伍員 proposed to raise three armies that clockwise were to skirmish at the borders of Chu to weaken this state. In 506 the whole army of Wu finally attacked Chu and defeated this state at Baiju or Boju 柏舉 (modern Macheng 麻城, Hubei). In pursuit of the escaping enemy, the army of Wu advanced to the capital of Chu, Yingdu 郢都 (modern Jiangling 江陵, Hebei). King Zhao of Chu 楚昭王 (r. 516-489) had to take his flight and sought for help in Qin. This western state sent out chariots that expelled the invaders from Wu.\n\nWu's neighbour Yue took the advantage of the prolonged campaigns against Chu to invade Wu. In 496, Wu set its troops into march to carry out a punitive expedition against Yue, but King Helü died in the battle of Zuili 檇李 (modern Jiaxing 嘉興, Zhejiang). Two years later, King Fucha 夫差 of Wu (r. 495-473) defeated Yue during the revenge battle of Fujiao 夫椒 (modern Suzhou 蘇州, Jiangsu). Goujian 句踐, king of Yue (r. 496-465), fled to Mount Guiji 會稽山 (south of modern Shaoxing 紹興, Zhejiang).\n\nAlthough Fucha's advisor Wu Yuan proposed to destroy the state of Yue, the king of Wu was content with his success in battle and the destruction of the capital of Yue. After the defeat of Chu and Yue, King Fucha turned his attention to the north. He had a fortification wall built at Han 邗 (near modern Yangzhou 揚州, Jiangsu) and dug out canals (see Grand Canal) that connected the Yangtze River with the Huai River 淮水 valley, creating a traffic line to the north and the possibility to move troops faster. The small states of Lu and Zhu 邾 declared themselves subjects to Wu. In the years 485 and 484 Wu attacked several times the state of Qi by land and by river and finally defeated Qi in the battle of Ailing 艾陵 (modern Laiwu 萊蕪, Shandong). Wu assembled the states of the Central Plain to a meeting at Huangchi 黃池 (modern Fengqiu 封丘, Henan), with the intention to declare its hegemony. Jin, weakened by internal struggles, did not dare to challenge the new powerful state of Wu, and King Fucha became the new hegemon.\n\nJust during the conference of Huangchi, King Goujian of Yue took the chance and invaded the capital of Wu. The overstretched military power of the state of Wu was unable to withstand the southern opponent who had rebuilt its strength after the defeat of Guiji. In 473, Yue destroyed the state of Wu and replaced it as the dominating power of the southeast. King Goujian of Yue was the last of the so-called Five Hegemons (Wuba 五霸).\n\nThe Five Hegemons are also called the \"Five Earls\" (Wubo 五伯). Different literary sources and commentaries identify them with different persons. The traditional definition by Zhao Qi 趙岐 defines them as Duke Huan of Qi, Duke Wen of Jin, Duke Mu of Qin, Duke Xiang of Song, and King Zhuang of Chu. The book Xunzi 荀子 identifies them with Duke Huan of Qi, Duke Wen of Jin, King Zhuang of Chu, King Helü of Wu and King Goujian of Yue.\n\nThe Disintegration of the Old Order of Regional States\n\nIn the mid-5th century BCE there were four states that dominated old China: Chu in the south, Yue in the southwest, Jin in the north, and Qi in the east. Yet things were to change soon: Inner conflicts toppled two of the reigning houses (Jin and Qi), new powers emerged (Wei 魏, Zhao 趙 and Han 韓), and reforms in the administration of several states created a new type of \"modernized\" regional state: the centralized state with a strengthened \"national\" economy and a professional army. The administration of the state by nobles related to the ruling house was replaced by a bureaucratic officialdom.\n\nThe state Lu was the first that felt the power of noble families which challenged the ducal house, in this case the Three Huan (Sanhuan 三桓, descendants of Duke Huan 魯桓公) the Jisun 季孫, Mengsun 孟孫 (Zhongsun 仲孫) and Shusun 叔孫. From the time of Duke Xi 魯僖公 (r. 659-627) on these three noble families dominated the state of Lu. Duke Zhao 魯昭公 (r. 541-510) even had to escape from their intrigues and died abroad. At the beginning of the fifth century minor nobles like Nan Kuai 南蒯, Yang Hu 陽虎 and Hou Fan 侯犯 rebelled against the mighty families and took over the rule of Lu.\n\nDescendants of the dukes of Song fought for the domination within the small state: the families Hua 華, Yue 樂, Lao 老, Huang 皇 (descendants of Duke Dai 宋戴公, r. 799-766), Yu 魚, Dang 蕩, Lin 鱗 and Xiang 向 (descendants of Duke Huan 宋桓公, r. 681-651). In the permanent power struggles only the families Yue and Huang survived the Spring and Autumn period.\n\nThe seven descendant lineages of Duke Mu of Zheng 鄭穆公 (r. 627-606) also gradually lost their power in the course of the Spring and Autum period.\n\nIn the state of Qi, the government was led by the lineages of Guo 國, Gao 高, Cui 崔 and Qing 慶. In this state it was a family not related to the ducal house that took over power in Qi: the family Tian 田, descendants of a prince from Chen, Tian Jingzhong 田敬仲, who had come to Qi in 672 while escaping internal disturbances in Chen. Under Duke Jing 齊景公 (r. 547-490), Jingzhong's descendant Tian Qi 田乞 was ennobled and from this position collected wealth and power enough to annihilate the families Guo and Gao. His son Tian Chang 田常 was already wealthier than the Duke himself and sent his ambassadors to the neighbouring states. His descendants would eventually replace the reigning house in Qi.\n\nThe most tremendous power challenge from within took place in the state of Jin where descendants of the ducal line were not invested as regional governors (dafu 大夫). But this measure did not prevent other noble families from trying to dominate the court of Jin: Hu 狐, Zhao 趙, Xian 先, Xi 郤 and Xu 胥 were the dominating noble clans of the middle Spring and Autumn period, and were later replaced by the families Han 韓, Wei 魏, Luan 欒, Fan 范 and Xun 荀. At the beginning of the 5th century the noble families of Zhao, Wei, Han, Fan, Zhonghang 中行 and Zhi 智 survived the internal struggle. The three first could destroy the last three and dissolved the dukedom of Jin, dividing its territory among themselves.\n\nDuring the reign of King Ding of Zhou 周定王 (r. 607-586), the southern ruler King Zhuang of Chu 楚莊王 (r. 613-591) advanced his armies as far as the valley of River Luo in the pursuit of the Rong tribes of Luhun 陸渾. The king of Chu used this situation pay the king of Zhou a visit, but King Ding only sent Prince Man 滿 (\"Royal Grandson Man\" 王孫滿) to confer with the semi-barbarian king of Chu. They talked about the so-called \"nine tripods\" (jiuding 九鼎) erected in the capital that symbolized the nine regions of the kingdom of Zhou.\n\nAfter the death of King Ling of Zhou 周靈王 (r. 572-545) and during the reign of King Jing 周景王 (r. 545-521) a succession crisis beset the house of Zhou. The heir apparent, Prince Sheng 聖, had died prematurely. King Jing preferred his oldest son Prince Chao 朝, yet when the king died, Prince Gai 丐 was supported by a strong party among the courtiers. The highest ministers enthroned Prince Meng 猛, who was immediately attacked and killed by the adherents of Prince Chao. Prince Meng is posthumously known as King Dao 周悼王 (r. 521-520). Prince Chao proclaimed himself king of Zhou, yet Prince Gai on his side asked for support by the duke of Jin and finally made it to the throne. He is known as King Jing 周敬王 (r. 520-476). Prince Chao, who had reigned for four years, fled to Chu. In 504, when he had assembled a sufficient number of supporters, he attacked King Jing and forced him to flee to Jin. A year later Duke Ding of Jin 晉定公 (r. 512-475) helped King Jing back on the throne."}, {"url": "https://courses.lumenlearning.com/suny-fmcc-boundless-worldhistory/chapter/the-zhou-dynasty/", "page_content": "The Mandate of Heaven\n\nThe Zhou Dynasty overthrew the Shang Dynasty, and used the Mandate of Heaven as justification.\n\nLearning Objectives Describe the Zhou Dynasty’s justification for overthrowing the Shang Dynasty\n\nKey Takeaways Key Points In 1046 BCE, the Shang Dynasty was overthrown at the Battle of Muye, and the Zhou Dynasty was established.\n\nThe Zhou created the Mandate of Heaven: the idea that there could be only one legitimate ruler of China at a time, and that this ruler had the blessing of the gods. They used this Mandate to justify their overthrow of the Shang, and their subsequent rule.\n\nSome scholars think the earlier Xia Dynasty never existed—that it was invented by the Zhou to support their claim under the Mandate that there had always been only one ruler of China. Key Terms Battle of Muye : The battle that resulted with the Zhou, a subject people living in the western part of the kingdom, overthrew the Shang Dynasty.\n\n: The battle that resulted with the Zhou, a subject people living in the western part of the kingdom, overthrew the Shang Dynasty. Mandate of Heaven: The Chinese philosophical concept of the circumstances under which a ruler is allowed to rule. Good rulers were allowed to rule under the Mandate of Heaven, while despotic, unjust rulers had the Mandate revoked.\n\nThe Fall of the Shang\n\nIn 1046 BCE, the Zhou, a subject people living in the western part of the kingdom, overthrew the Shang Dynasty at the Battle of Muye. This was a battle between Shang and Zhou clans, over the Shang’s expansion. They largely had the support of the Chinese people: Di Xin (the final king of the Shang Dynasty) had become cruel, spent state money on drinking and gambling, and ignored the state. The Zhou established authority by forging alliances with regional nobles, and founded their new dynasty with its capital at Fenghao (near present-day Xi’an, in western China).\n\nThe Mandate of Heaven\n\nUnder the Zhou Dynasty, China moved away from worship of Shangdi (“Celestial Lord”) in favor of worship of Tian (“heaven”), and they created the Mandate of Heaven. According to this idea, there could be only one legitimate ruler of China at a time, and this ruler reigned as the “Son of Heaven” with the approval of the gods. If a king ruled unfairly he could lose this approval, which would result in his downfall. Overthrow, natural disasters, and famine were taken as a sign that the ruler had lost the Mandate of Heaven.\n\nThe Mandate of Heaven did not require a ruler to be of noble birth, and had no time limitations. Instead, rulers were expected to be good and just in order to keep the Mandate. The Zhou claimed that their rule was justified by the Mandate of Heaven. In other words, the Zhou believed that the Shang kings had become immoral with their excessive drinking, luxuriant living, and cruelty, and so had lost their mandate. The gods’ blessing was given instead to the new ruler under the Zhou Dynasty, which would rule China for the next 800 years.\n\nThe need for the Zhou to create a history of a unified China is also why some scholars think the Xia Dynasty may have been an invention of the Zhou. The Zhou needed to erase the various small states of prehistoric China from history, and replace them with the monocratic Xia Dynasty in order for their Mandate of Heaven to seem valid (i.e., to support the claim that there always would be, and always had been, only one ruler of China).\n\nThe Zhou ruled until 256 BCE, when the state of Qin captured Chengzhou. However, the Mandate of Heaven philosophy carried on throughout ancient China.\n\nSociety Under the Zhou Dynasty\n\nUnder the initial period of the Zhou Dynasty (called the Western Zhou period), a number of innovations were made, rulers were legitimized under the Mandate of Heaven, a feudal system developed, and new forms of irrigation allowed the population to expand.\n\nLearning Objectives Describe the main accomplishments of the Western Zhou period\n\nKey Takeaways Key Points The first period of Zhou rule, during which the Zhou held undisputed power over China, is known as the Western Zhou period.\n\nDuring the Western Zhou period, the focus of religion changed from the supreme god, Shangdi, to “Tian,” or heaven; advances were made in farming technology; and the feudal system was established.\n\nUnder the feudal system, the monarchy would reward loyal nobles with large pieces of land.\n\nOver time, the king grew weaker, and the lords of the feudal system grew stronger, until finally, in 711 BCE, one lord joined forces with an invading group of barbarians and killed the king. Key Terms Western Zhou period : The first period of Zhou rule, during which the Zhou held undisputed power over China (1046-771 BCE).\n\n: The first period of Zhou rule, during which the Zhou held undisputed power over China (1046-771 BCE). feudal system : A social system based on personal ownership of resources and personal fealty between a suzerain (lord) and a vassal (subject). Defining characteristics include direct ownership of resources, personal loyalty, and a hierarchical social structure reinforced by religion.\n\n: A social system based on personal ownership of resources and personal fealty between a suzerain (lord) and a vassal (subject). Defining characteristics include direct ownership of resources, personal loyalty, and a hierarchical social structure reinforced by religion. Duke of Zhou: A regent to the king who established the feudal system, and held a lot of power during the Western Zhou period.\n\nThe first period of Zhou rule, during which the Zhou held undisputed power over China, is known as the Western Zhou period. This period ended when the capital was moved eastward. A number of important innovations took place during this period: the Zhou moved away from worship of Shangdi, the supreme god under the Shang, in favor of Tian (“heaven”); they legitimized rulers, through the Mandate of Heaven (divine right to rule); they moved to a feudal system; developed Chinese philosophy; and made new advances in irrigation that allowed more intensive farming and made it possible for the lands of China to sustain larger populations.\n\nChina created a substantial amount of literature during the Zhou Dynasty. These include The Book of History and The Book of Diviners, which was used by fortune tellers. Books dedicated to songs and ceremonial rites were also created. While many of these writings have been destroyed over time, their lasting impression on history is evidence of the strength of Zhou culture.\n\nLike other river valley civilizations of the time, the people under the Zhou Dynasty followed patriarchal roles. Men chose which children would be educated and whom their daughters were married. The household usually consisted of the head male, his wife, his sons and unmarried daughters.\n\nThe feudal system in China was structurally similar to ones that followed, such as pre-imperial Macedon, Europe, and Japan. At the beginning of the Zhou Dynasty’s rule, the Duke of Zhou, a regent to the king, held a lot of power, and the king rewarded the loyalty of nobles and generals with large pieces of land. Delegating regional control in this way allowed the Zhou to maintain control over a massive land area. Under this feudal (fengjian) system, land could be passed down within families, or broken up further and granted to more people.\n\nMost importantly, the peasants who farmed the land were controlled by the feudal system. Slavery had been common during the Shang Dynasty, but this decreased and finally disappeared under the Zhou Dynasty, as social status became more fluid and transitory.\n\nWhen the Duke of Zhou stepped down, China was united and at peace, leading to years of prosperity. But this only lasted for about seventy-five years. Over time, the central power of the Zhou Dynasty slowly weakened, and the lords of the fiefs originally bestowed by the Zhou came to equal the kings in wealth and influence. They began to actively compete with them for power, and the fiefs gained independence as individual states.\n\nFinally, in 711 BCE, one rebellious noble, the Marquess of Shen, joined forces with invading barbarians, the Quanrong, to defeat the King You. No one came to the king’s defense, and he was killed. The Zhou capital was sacked by the barbarians, and with this the Western Zhou period ended.\n\nArt Under the Zhou Dynasty\n\nUnder the Zhou Dynasty, many art forms expanded and became more detailed, including bronze, bronze inscriptions, painting, and lacquerware.\n\nLearning Objectives Identify some of the art forms prevelant under the Zhou Dynasty\n\nKey Takeaways Key Points Work in bronze, including inscriptions, continued and expanded in the Zhou Dynasty.\n\nFew paintings have survived from this period, but we know that they were representations of the real world.\n\nThe production of lacquerware expanded during this period. Key Terms lacquer: A natural varnish, originating in China or Japan, and extracted from the sap of a sumac tree.\n\nBronze, Ceramics, and Jade\n\nChinese script cast onto bronzeware, such as bells and cauldrons, carried over from the Shang Dynasty into the Zhou; it showed continued changes in style over time, and by region. Under the Zhou, expansion of this form of writing continued, with the inclusion of patrons and ancestors.\n\nOther improvements to bronze objects under the Eastern Zhou included greater attention to detail and aesthetics. The casting process itself was improved by a new technique, called the lost wax method of production.\n\nCeramic and Jade art continued from the Shang Dynasty, and was improved and refined, especially during the Warring States Period.\n\nPaintings\n\nVery few paintings from the Zhou have survived, however written descriptions of the works have remained. Representations of the real world, in the form of paintings of figures, portraits, and historical scenes, were common during the time. This was a new development. Painting was also done on pottery, tomb walls, and on silk.\n\nLacquerware\n\nLacquerware was a technique through which objects were decoratively covered by a wood finish and cured to a hard, durable finish. The lacquer itself might also be inlaid or carved. The Zhou continued and developed lacquer work done in the Shang Dynasty. During the Eastern Zhou period, a large quantity of lacquerware began to be produced.\n\nThe Eastern Zhou Period\n\nThe Eastern Zhou period was divided into two halves. In the Spring and Autumn period, power became decentralized as nobles vied for power. In the Warring States period, strong states fought each other in large-scale war. During the period, there were substantial intellectual and military developments.\n\nLearning Objectives Explain the main political and military developments during the Eastern Zhou period\n\nKey Takeaways Key Points During the first part of the Eastern Zhou period, called the Spring and Autumn period, the king became less powerful and the regional feudal became lords more so, until only seven consolidated powerful feudal states were left.\n\nDuring the second part of the period, called the Warring States period, strong states vied for power until the Qin conquered them all and created a unified dynasty.\n\nDevelopments during the period included increasing use of infantry, a trend toward bureaucracy and large-scale projects, the use of iron over bronze, and intellectual and philosophical developments. Key Terms feudalism : A social system in which nobility hold lands from the King in exchange for military service, and peasants lived on the nobles’ land and provided services.\n\n: A social system in which nobility hold lands from the King in exchange for military service, and peasants lived on the nobles’ land and provided services. decentralized : Moving away from a single point of administration to multiple locations, and usually giving them a degree of autonomy.\n\n: Moving away from a single point of administration to multiple locations, and usually giving them a degree of autonomy. infantry : Soldiers marching or fighting on foot.\n\n: Soldiers marching or fighting on foot. Hegemony: Domination, influence, or authority over another, especially by one political group over a society or by one nation over others.\n\nThe End of the Western Zhou Period\n\nThe first period of Zhou rule, which lasted from 1046-771 BCE and was referred to as the Western Zhou period, was characterized mostly by unified, peaceful rule. The lords under feudalism gained increasing power, and ultimately the Zhou King You was assassinated, and the capital, Haojing, was sacked in 770 BCE. The capital was quickly moved east to Chengzhou, near modern-day Luoyang, and the Zhou abandoned the western regions. Thus, the assassination marked the end of the Western Zhou period and the beginning of the Eastern Zhou period.\n\nThe Spring and Autumn Period of Eastern Zhou\n\nThe first part of the Eastern Zhou period is known as the Spring and Autumn period, named after the Spring and Autumn Annals, a text that narrated events on a year-by-year basis, and marked the beginning of China’s deliberately recorded history. This period lasted from about 771-476 BCE. During this time, power became increasingly decentralized as regional feudal lords began to absorb smaller powers and vie for hegemony. The monarchy continued to lose power, and the people were nearly always at war.\n\nThe period from 685-591 BCE was called The Five Hegemons, and featured, in order, the Hegemony of Qi, Song, Jin, Qin, and Chu. By the end of 5th century BCE, the feudal system was consolidated into seven prominent and powerful states—Han, Wei, Zhao, Yue, Chu, Qi, and Qin—and China entered the Warring States period, when each state vied for complete control.\n\nThe Warring States Period\n\nThis period, in the second half of the Eastern Zhou, lasted from about 475-221 BCE, when China was united under the Qin Dynasty. The partition of the Jin state created seven major warring states. After a series of wars among these powerful states, King Zhao of Qin defeated King Nan of Zhou and conquered West Zhou in 256 BCE; his grandson, King Zhuangxiang of Qin, conquered East Zhou, bringing the Zhou Dynasty to an end.\n\nDevelopments During the Eastern Zhou\n\nWhile the chariot remained in use, there was a shift during the period to infantry, possibly because of the invention of the crossbow. This meant that war became larger scale, as peasants were drafted to take the place of nobility as soldiers and needed complex logistical support. The aristocracy’s importance dwindled as the king’s became stronger, and strong central bureaucracies took hold. The Art of War, attributed to Sun Tzu, was written during this time; it remains a very influential book about strategy.\n\nA sophisticated form of commercial arithmetic was in place during the period, as shown by a bundle of bamboo slips showing two digit decimal multiplication.\n\nA history of the Spring and Autumn Period, called the Zuo Commentary on the Spring and Autumn Annals, was published during this time.\n\nDevelopments in iron work replaced bronze as the dominant metal used in warfare. Trade became increasingly important among states within China. Large-scale works, including the Dujiangyan Irrigation System and the Zhengguo Canal, were completed and increased agricultural production.\n\nThe Warring States Period\n\nThe Warring States period saw technological and philosophical development, and the emergence of the Qin Dynasty.\n\nLearning Objectives Demonstrate understanding of the main characteristics of the Warring States period\n\nKey Takeaways Key Points The second part of the Eastern Zhou period is known as the Warring States period. During this time, the seven states remaining from the Spring and Autumn period intensely and unrelentingly battled each other for total power.\n\nIt was during this period that the Iron Age spread in China, leading to stronger tools and weapons made from iron instead of bronze.\n\nThis period also saw the further development of Confucianism (by Mencius), Daoism, Legalism, and Mohism.\n\nBy this time, two key Chinese social characteristics had solidified: l) the concept of the patrilineal family as the basic unit of society, and 2) the concept of natural social differentiation into classes.\n\nIron replaced the use of bronze, sophisticated math came into use, and large-scale projects were undertaken.\n\nUltimately, in 221 BCE, the Qin state emerged victorious and unified China once more under the Qin Dynasty. Key Terms crossbow: A mechanised weapon, based on the bow and arrow, that fires bolts; it was invented during the Warring States period of the Zhou Dynasty, when its low cost and ease of use made it a preferable weapon to the chariot.\n\nOver the course of the Spring and Autumn period, regional feudal lords consolidated and absorbed smaller powers; by 476 BCE, seven prominent states were left, all led by individual kings. The second part of the Eastern Zhou period is known as the Warring States period; during this time these few remaining states battled each other for total power.\n\nConflict Among the Seven States\n\nThe king by now was powerless, and the rulers of the seven independent states began to refer to themselves as kings as well. These major Chinese states were in constant competition. Since none of the states wanted any one rival to become too powerful, if one state became too strong, the others would join forces against it, so no state achieved dominance. This led to nearly 250 years of inconclusive warfare that became larger and larger in scale. It was also at this point that there first emerged the concept of a Chinese emperor who would rule over all the various kings, though the first Chinese emperors did not rule until China was unified under the later Qin Dynasty. The crossbow was invented, and its low cost and easy use (as compared to the expensive chariot) resulted in the increased conscription of peasants as expandable infantry.\n\nTechnological and Philosophical Development\n\nThe Iron Age had reached China by 600 CE, but it was during this period that the age spread and took root in China: by the time of the Warring States Period, China saw a widespread adoption of iron tools and weapons that were significantly stronger than their bronze counterparts.\n\nThis period also saw the further development of the philosophical movements that originated in the Hundred Schools of Thought of the Spring and Autumn period. Mencius further developed Confucian philosophy, expanding upon its doctrines and asserting the innate goodness of the individual and the importance of destiny. Daoism, Legalism, and Mohism became more developed. Archaic writing also gave way to a far more recognizable form of Chinese script.\n\nCultural, Economic, and Social Development\n\nTwo fundamental Chinese social characteristics had become apparent by this time: l) the concept of the patrilineal family as the basic unit in society, with high importance placed on blood relations, and 2) the concept of natural social differentiation into classes, each regarded in terms of their contributions to society.\n\nLarge-scale projects, like the Dujiangyan Irrigation System and the Zhengguo Canal, were carried out. Sophisticated arithmetic was carried out, including two digit decimal multiplication.\n\nThe Zuo Commentary on the Spring and Autumn Annals was a literary achievement. In other literary works, sayings of philosophers of the period were recorded in the Analects and the Art of War.\n\nThe Rise of the Qin State and Resolution of the Warring States Period\n\nThough the military rivalries and alliances in the Warring States period were complex and constantly in flux, over time the Qin state, under the leadership of King Zheng, emerged as the most powerful. The Qin were particularly strongly rooted in Legalist philosophy, which advocated the importance of the state at the expense of the individual. They were also known for being ruthless and ignoring etiquette and protocol of war in order to win at all costs. In particular, Shang Yang, adviser to Zheng, enacted laws to force subjects of the kingdom to act in ways that helped the state; he forced them to marry early, have many children, and produce certain quotas of food. Ultimately, in 221 BCE, the Qin state conquered the others and established the Qin Dynasty.\n\nChinese Philosophy\n\nConfucianism, Daoism, Legalism, and Mohism all began during the Zhou Dynasty in the 6th century BCE, and had very strong influences on Chinese civilization.\n\nLearning Objectives Discuss Confucianism, Daoism, Legalism, and Mohism.\n\nKey Takeaways Key Points Confucius stressed tradition and believed that an individual should strive to be virtuous and respectful, and to fit into his or her place in society.\n\nConfucianism remained prevalent in China from the Han Dynasty in 202 BCE to the end of dynastic rule in 1911.\n\nLao-tzu was the legendary founder of Daoism, recorded in the form of the book the Tao Te Ching.\n\nDaoism advocated that the individual should follow a mysterious force, called The Way (dao), of the universe, and that all things were one.\n\nLegalism held that humans were inherently bad and needed to be kept in line by a strong state. According to Legalism, the state was far more important than the individual.\n\nLegalists could be divided into three types: those concerned with the position of ruler, those concerned with laws, and those concerned with tactics to keep the state safe.\n\nMohism emerged under the philosopher Mozi, and its most well-known concept was “impartial care.” Mohism also stated that all people should be equal in their material benefit, and in their protection from harm. Key Terms Five Classics : The basis of civil examinations in imperial China and the Confucian canon. They consist of the Book of Odes, the Book of Documents, the Book of Changes, the Book of Rites, and the Spring and Autumn Annals.\n\n: The basis of civil examinations in imperial China and the Confucian canon. They consist of the Book of Odes, the Book of Documents, the Book of Changes, the Book of Rites, and the Spring and Autumn Annals. Analects : The document in which the students of Confucius recorded his teachings.\n\n: The document in which the students of Confucius recorded his teachings. jen : Human virtue, under Confucianism.\n\n: Human virtue, under Confucianism. chi : Life force or body energy, which supposedly circulates through the body along meridians.\n\n: Life force or body energy, which supposedly circulates through the body along meridians. Tao Te Ching: The book which forms the basis of Daoist philosophy.\n\nConfucianism\n\nConfucius, who lived during the 6th century BCE, was one of the foremost Chinese philosophers. He looked back on the Western Zhou period, with its strong centralized state, as an ideal. He was pragmatic and sought to reform the existing government, encouraging a system of mutual duty between superiors and inferiors. Confucius stressed tradition and believed that an individual should strive to be virtuous and respectful, and to fit into his or her place in society. After his death in 479 BCE, his students wrote down his ethical and moral teachings in the Lun-yü, or Analects .\n\nBeing a good and virtuous human in every ordinary situation was the goal of Confucianism. This virtue was called “jen,” and humans were seen as perfectible and basically good creatures. Ceremonies and rituals based on the Five Classics, especially the I Ching, were strongly instituted. Some ethical concepts included Yì (the moral disposition to do good), Lǐ (ritual norms for everyday life) and Zhì (the ability to see what is right in the behavior of others).\n\nConfucianism remained prevalent in China from the Han Dynasty in 202 BCE to the end of dynastic rule in 1911. It was reformulated during the Tang Dynasty (618-907) as Neo-Confucianism, and became the basis of imperial exams.\n\nDaoism\n\nAnother important philosopher in this period was Lao-tzu (also called Laozi), who founded Daoism (also called Taoism) during the same period as Confucianism. Lao-tzu is a legendary figure—it is uncertain if he actually existed. According to myth, Lao-tzu was born around 604 BCE as an old man. As he left his home to live a life of solitude, he was asked by the city gatekeeper to write down his thoughts. He did so in a book called Tao Te Ching, and was never seen again.\n\nDaoism advocated that the individual should follow a mysterious force, called The Way (dao), of the universe and act in accordance with nature. Daoism stressed the oneness of all things, and was strictly individualistic, as opposed to Confucianism, which advocated acting as society expected.\n\nDaoism as a religion arose over time, and involved the worship of gods and ancestors, the cultivation of “chi” energy, a system of morals, and the use of alchemy to achieve immortality. It is still practice today.\n\nLegalism\n\nAlthough Confucianism and Daoism are the Chinese philosophies that have endured most to this day, even more important to this early period was a lesser-known philosophy called Legalism. This held that humans are inherently bad and need to be kept in line by a strong state. According to Legalism, the state was far more important than the individual. While Legalism held that laws should be clear and public and that everyone should be subject to them, it also contended that rulers had supreme power and must use stealth and secrecy to remain in power. Legalists also believed that society must strive to dominate other societies.\n\nLegalists could be divided into three types. The first was concerned with shi, or the investment of the position of ruler with power (rather than the person) and the necessity of obtaining facts to rule well. The second was concerned with fa, or laws, regulations, and standards. This meant all were equal under the ruler, and the state was run by law, not a ruler. The third was the concept of shu, or tactics to keep the state safe. Legalism was generally in competition with Confucianism, which advocated a just and reciprocal relationship between the state and its subjects.\n\nMohism\n\nMohism emerged around the same time as the other philosophies discussed here, under the philosopher Mozi (c. 470-391 BCE). The most well-known concept under Mohism was “impartial care,” also known as “universal love.” This meant that people should care equally about other people, regardless of their true relationship to that person. This opposed the ideas of Confucianism, which said that love should be greater for close relationships. Mohism also stressed the ideas of self-restraint, reflection and authenticity.\n\nMohism also stated that all people should be equal in their material benefit and in their protection from harm. Society could be improved by having it function like an organism, with a uniform moral compass. Those who were qualified should receive jobs, and thus the ruler would be surrounded by people of talent and skill. An unrighteous ruler would result in seven disasters for the state, including neglect of military defense, repression, illusions about strength, distrust, famine, and more."}, {"url": "https://www.newworldencyclopedia.org/entry/Zhou_Dynasty", "page_content": "\n\n\n\nZhou Dynasty (1050–771 B.C.E. ) in China Boundaries of the Western(1050–771) in China\n\nThe Zhou Dynasty (Chinese: 周朝; Pinyin: Zhōu Cháo; Wade-Giles: Chou Ch`ao) (1022 B.C.E. to 256 B.C.E. ) followed the Shang (Yin) dynasty and preceded the Qin dynasty in China. The Zhou dynasty lasted longer than any other in Chinese history, and the use of iron was introduced to China during this time. The dynasty also spans the period in which the written script evolved from the ancient stage as seen in early Western Zhou bronze inscriptions, to the beginnings of the modern stage, in the form of the archaic clerical script of the late Warring States period.\n\nThe Zhou introduced the notion of the Mandate of Heaven, that is, that the king or emperor reigned as the direct representative of the gods. The belief developed that the earthly bureaucracy mirrors the heavenly, with the earth as the yang (masculine) aspect and heaven as the yin (feminine) aspect. It was essential to maintain harmony and balance between the two spheres, and what happens on earth influences heaven, and vice-versa. The ideal is to live life in harmony with forces of the universe, to flow with, not against, the natural rhythms of life and of nature (wu-wei). Thus, at a very early period, the Chinese developed an empathetic relationship with the natural world, which respected nature.\n\nThe long-lasting Zhou dynasty gave stability to a large area of China for almost a millennium, allowing people to develop a sense of mutual responsibility and a shared view of life. Family responsibilities and duties towards the state were stressed. The concept of the Mandate of Heaven has something in common with the European doctrine of the divine right of kings, except that as that developed in medieval Europe (almost two thousand years later) it saw rebellion against the king as an unthinkable sin. The Chinese dogma recognized from the outset that the ruler could forfeit the Mandate, if his rule did not benefit the people. This was also emphasized by the great teacher, Confucius (551-479 B.C.E. ), who lived during the Zhou dynasty at Lu, where he advised the government. He advocated humane co-operation, politeness and virtuous living (Ren, ethics, humaneness). Instead of coercing his subjects, the ruler should love them and lead by setting a virtuous example. Confucius taught that a polite, well ordered society in which everyone had a prescribed role, would banish hatred and war.\n\nContemporary governments too often allow vested interests to dominate their agendas and to influence their policies for the benefit of these interests rather than of the electorate. The radical idea that rulers should love their subject, and work for their welfare, was alive and well in China during the Zhou dynasty. Those who understand history from a providential point of view could well conclude that the length of the Zhou dynasty's reign was a consequence of their enjoying the Mandate of Heaven.\n\nDid you know? The Mandate of Heaven, requiring rulers to rule justly, was introduced by the Zhou Dynasty of China In the Chinese historical tradition, the rulers of the Zhou displaced the Shang and legitimized their rule by invoking the Mandate of Heaven, the notion that the ruler (the \"son of heaven\") governed by divine right (granted by the Supreme God of Heaven) but that his dethronement would prove that he had lost the mandate. The doctrine explained and justified the demise of the Xia and Shang dynasties and at the same time supported the legitimacy of present and future rulers. The Zhou dynasty was founded by the Ji family and had its capital at Hào (near the present-day city of Xi'an). Sharing the language and culture of the Shang (Yin), the early Zhou rulers, through conquest and colonization, gradually extended Shang (Yin) culture through much of China Proper north of the Yangtze River. According to the Zhou, the Shang had ruled unethically, squandering the resources of the kingdom. The mandate required rulers to rule justly. Each succeeding generation had to justify the dynasty's continued claim to hold the mandate. Negligence and abuse could revoke the mandate. The will of the people, ultimately, sanctioned the king's rule. Fēngjiàn (封建) Western Zhou dynasty vase with glass inlays, fourth-third century B.C.E. , British Museum In the West, the Zhou period is often described as feudal because the Zhou's early rule invites comparison with medieval rule in Europe. However, historians debate the meaning of the term feudal; the more appropriate term for the Zhou Dynasty's political arrangement would be from the Chinese language itself: the Fēngjiàn (封建) system. The Zhou amalgam of city-states became progressively centralized and established increasingly impersonal political and economic institutions. These developments, which probably occurred in the later Zhou period, were manifested in greater central control over local governments and a more routinized agrarian taxation. Western and Eastern Zhou Initially the Ji family was able to control the country firmly. In 771 B.C.E. , after King You of Zhou had replaced his queen with a concubine, the capital was sacked by the joint force of the queen's father, who was the powerful Marquess of Shen, and a nomadic tribe. The queen's son, King Ping of Zhou, was proclaimed the new king by the nobles from the states of Zheng, Lü, Qin and the Marquess of Shen. The capital was moved eastward in 722 B.C.E. to Luoyang in present-day Henan Province. Because of this shift, historians divide the Zhou era into the Western Zhou (Xī Zhōu), lasting up until 771 B.C.E. , and the Eastern Zhou (Dōng Zhōu) from 770 up to 256 B.C.E. The beginning year of the Western Zhou has been disputed—1122 B.C.E. , 1027 B.C.E. and other years within the hundred years from late twelfth century B.C.E. to late eleventh century B.C.E. have been proposed. Chinese historians take 841 B.C.E. as the first year of consecutive annual dating of the history of China, based on the Records of the Grand Historian by Sima Qian. The Eastern Zhou corresponds roughly to two sub-periods. The first, from 722 to 481 B.C.E. , is called the Spring and Autumn Period, after a famous historical chronicle of the time; the second, which extends slightly past the 256 B.C.E. end date of the Eastern Zhou, is known as the Warring States period (480 to 221 B.C.E. ). This discrepancy is due to the fact that the last Zhou king's reign ended in 256, 35 years before the beginning of the Qin dynasty which ended the Warring States period. Decline With the royal line broken, the power of the Zhou court gradually diminished; the fragmentation of the kingdom accelerated. From Ping Wang onwards, the Zhou kings ruled in name only, with true power lying in the hands of powerful nobles. Towards the end of the Zhou Dynasty, the nobles did not even bother to acknowledge the Ji family symbolically and declared themselves to be kings. They wanted to be the king of the kings. Finally, the dynasty was obliterated by Qin Shi Huang's unification of China in 221 B.C.E. The Zhou had always had a concern for unity but in the end they could not sustain the unity of their empire, and lost the mandate of heaven. Agriculture Agriculture in Zhou dynasty was intensive and in many cases directed by the government. All farming lands were owned by nobles, who then gave their land to their serfs, similar to European feudalism. For example, a piece of land was divided into nine squares in the shape of the character for \"water well,\" jing (井), with the grain from the middle square taken by the government and that of surrounding squares kept by individual farmers. This way, the government was able to store surplus food (such as rice) and distribute them in times of famine or poor harvest. Some important manufacturing sectors during this period include bronze making, which was integral in making weapons and farming tools. Again, these industries were dominated by the nobility who direct the production of such materials. Legacy The Zhou dynasty left a rich legacy. It gave stability and a large measure of peace to a large area of China from the eleventh to the third centuries B.C.E. During this period, the people developed a culture and a way of life and a world-view that bound them together within a common universe. This paved the way for the unification of China by the Qin king, Shih Hunag-ti in 221 B.C.E. Confucius, who lived during the Zhou dynasty, laid the foundations of what became Confucian thought, much of which concerned the correct ordering of society. Much Chinese thought focused less on individual issues of morality, although they were discussed than on social responsibility, on the duties of subjects and rulers. Morality and benevolence were key concerns. A fundamental concern was balance and harmony, within society, between the rulers and the ruled, heaven and earth, the human and natural worlds. At the heart of Confucius' teaching was the concept of the (chun-tzu) (gentleman), who has cultivated wisdom (chi), love of humanity (ren), courage (yung) and righteousness (yi). Confucius championed the idea that education can improve the individual and that if all people were educated, universal peace would become a reality. Confucius was a shih, a new type of civil servant whose appointment was based on ability, not birth. Laozi also lived during this period, possibly born in 600 B.C.E. , from whose teaching Daoism developed. Laozi is famous for his concept of wu-wei—that is, ride nature, do not try to conquer it. By going with the flow, opposites can be reconciled and ethical conduct becomes natural. He taught that that reality is two-sided; yin (feminine; dark, cool, moist) and yang (masculine; hot, dry, bright). Both are necessary and equal and nothing is exclusively either (all are a blend of both). These (and all apparent opposites) need to be kept in balance and harmony to avoid chaos. Zhou dynasty kings Personal name Posthumous name Reign years1 Name by which most commonly known Ji Fa\n\nWuwang\n\n1046 B.C.E. -1043 B.C.E. 1 Zhou Wuwang\n\n(King Wu of Zhou) Ji Song\n\nChengwang\n\n1042 B.C.E. -1021 B.C.E. 1 Zhou Chengwang\n\n(King Cheng of Zhou) Ji Zhao\n\nKangwang\n\n1020 B.C.E. -996 B.C.E. 1 Zhou Kangwang\n\n(King Kang of Zhou) Ji Xia\n\nZhaowang\n\n995 B.C.E. -977 B.C.E. 1 Zhou Zhaowang\n\n(King Zhao of Zhou) Ji Man\n\nMuwang\n\n976 B.C.E. -922 B.C.E. 1 Zhou Muwang\n\n(King Mu of Zhou) Ji Yihu\n\nGongwang\n\n922 B.C.E. -900 B.C.E. 1 Zhou Gongwang\n\n(King Gong of Zhou) Ji Jian\n\nYiwang\n\n899 B.C.E. -892 B.C.E. 1 Zhou Yiwang\n\nKing Yi of Zhou) Ji Pifang\n\nXiaowang\n\n891 B.C.E. -886 B.C.E. 1 Zhou Xiaowang\n\n(King Xiao of Zhou) Ji Xie\n\nYiwang\n\n885 B.C.E. -878 B.C.E. 1 Zhou Yiwang\n\n(King Yi of Zhou) Ji Hu\n\nLiwang\n\n877 B.C.E. -841 B.C.E. 1 Zhou Liwang\n\n(King Li of Zhou) Gonghe (regency)\n\n841 B.C.E. -828 B.C.E. Gonghe Ji Jing\n\nXuanwang\n\n827 B.C.E. -782 B.C.E. Zhou Xuanwang\n\n(King Xuan of Zhou) Ji Gongsheng\n\nYouwang\n\n781 B.C.E. -771 B.C.E. Zhou Youwang\n\n(King You of Zhou) End of Western Zhou / Beginning of Eastern Zhou Ji Yijiu\n\nPingwang\n\n770 B.C.E. -720 B.C.E. Zhou Pingwang\n\n(King Ping of Zhou) Ji Lin\n\nHuanwang\n\n719 B.C.E. -697 B.C.E. Zhou Huanwang\n\n(King Huan of Zhou) Ji Tuo\n\nZhuangwang\n\n696 B.C.E. -682 B.C.E. Zhou Zhuangwang\n\n(King Zhuang of Zhou) Ji Huqi\n\nXiwang\n\n681 B.C.E. -677 B.C.E. Zhou Xiwang\n\n(King Xi of Zhou) Ji Lang\n\nHuiwang\n\n676 B.C.E. -652 B.C.E. Zhou Huiwang\n\n(King Hui of Zhou) Ji Zheng\n\nXiangwang\n\n651 B.C.E. -619 B.C.E. Zhou Xiangwang\n\n(King Xiang of Zhou) Ji Renchen\n\nQingwang\n\n618 B.C.E. -613 B.C.E. Zhou Qingwang\n\n(King Qing of Zhou) Ji Ban\n\nKuangwang\n\n612 B.C.E. -607 B.C.E. Zhou Kuangwang\n\n(King Kuang of Zhou) Ji Yu\n\nDingwang\n\n606 B.C.E. -586 B.C.E. Zhou Dingwang\n\n(King Ding of Zhou) Ji Yi\n\nJianwang\n\n585 B.C.E. -572 B.C.E. Zhou Jianwang\n\n(King Jian of Zhou) Ji Xiexin\n\nLingwang\n\n571 B.C.E. -545 B.C.E. Zhou Lingwang\n\n(King Ling of Zhou) Ji Gui\n\nJingwang\n\n544 B.C.E. -521 B.C.E. Zhou Jingwang\n\n(King Jing of Zhou) Ji Meng\n\nDaowang\n\n520 B.C.E. Zhou Daowang\n\n(King Dao of Zhou) Ji Gai\n\nJingwang\n\n519 B.C.E. -476 B.C.E. Zhou Jingwang\n\n(King Jing of Zhou (Ji Gai)) Ji Ren\n\nYuanwang\n\n475 B.C.E. -469 B.C.E. Zhou Yuanwang\n\n(King Yuan of Zhou) Ji Jie\n\nZhendingwang\n\n468 B.C.E. -442 B.C.E. Zhou Zhendingwang\n\n(King Zhending of Zhou) Ji Quji\n\nAiwang\n\n441 B.C.E. Zhou Aiwang\n\n(King Ai of Zhou) Ji Shu\n\nSiwang\n\n441 B.C.E. Zhou Siwang\n\n(King Si of Zhou) Ji Wei\n\nKaowang\n\n440 B.C.E. -426 B.C.E. Zhou Kaowang\n\n(King Kao of Zhou) Ji Wu\n\nWeiliewang\n\n425 B.C.E. -402 B.C.E. Zhou Weiliewang\n\n(King Weilie of Zhou) Ji Jiao\n\nAnwang\n\n401 B.C.E. -376 B.C.E. Zhou Anwang\n\n(King An of Zhou) Ji Xi\n\nLiewang\n\n375 B.C.E. -369 B.C.E. Zhou Liewang\n\n(King Lie of Zhou) Ji Bian\n\nXianwang\n\n368 B.C.E. -321 B.C.E. Zhou Xianwang\n\n(King Xian of Zhou) Ji Ding\n\nShenjingwang\n\n320 B.C.E. -315 B.C.E. Zhou Shenjingwang\n\n(King Shenjing of Zhou) Ji Yan\n\nNanwang\n\n314 B.C.E. -256 B.C.E. Zhou Nanwang\n\n(King Nan of Zhou) Huiwang\n\n255 B.C.E. -249 B.C.E. Zhou Huiwang2\n\n(King Hui of Eastern Zhou) 1 The first generally accepted date in Chinese history is 841 B.C.E. , the beginning of the Gonghe\n\nregency. All dates prior to this are the subject of often vigorous dispute. The dates provided here\n\nare those put forward by The Xia-Shang-Zhou Chronology Project, the work of scholars\n\nsponsored by the Chinese government which reported in 2000. They are given only as a guide. 2 Nobles of the Ji family proclaimed King Hui as King Nan's successor after their capital, Luoyang,\n\nfell to Qin forces in 256 B.C.E. However Zhou resistance did not last long in the face of the Qin\n\nadvance and so King Nan is widely considered to have been the last emperor of the Zhou dynasty. References ISBN links support NWE through referral fees Gernet, Jacques. A History of Chinese Civilization . Cambridge: Cambridge University Press, 1996. ISBN 978-0521497817\n\n. Cambridge: Cambridge University Press, 1996. ISBN 978-0521497817 Hucker, Charles O. China to 1850: A Short History . Stanford< CA: Stanford University Press, 1978. ISBN 978-0804709583\n\n. Stanford< CA: Stanford University Press, 1978. ISBN 978-0804709583 Li, Xueqin. Eastern Zhou and Qin Civilizations . New Haven, CT: Yale University Press, 1986. ISBN 978-0300032864\n\n. New Haven, CT: Yale University Press, 1986. ISBN 978-0300032864 Shaughnessy, Edward L. Sources of Western Zhou History: Inscribed Bronze Vessels . Berkeley, CA: University of California Press, 1992. ISBN 978-0520070288\n\n. Berkeley, CA: University of California Press, 1992. ISBN 978-0520070288 Schirokauer, Conrad, and Miranda Brown. A Brief History of Chinese Civilization. Florence, KY: Wadsworth Publishing, 2006. Credits New World Encyclopedia writers and editors rewrote and completed the Wikipedia article in accordance with New World Encyclopedia standards. This article abides by terms of the Creative Commons CC-by-sa 3.0 License (CC-by-sa), which may be used and disseminated with proper attribution. Credit is due under the terms of this license that can reference both the New World Encyclopedia contributors and the selfless volunteer contributors of the Wikimedia Foundation. To cite this article click here for a list of acceptable citing formats.The history of earlier contributions by wikipedians is accessible to researchers here: Zhou Dynasty history The history of this article since it was imported to New World Encyclopedia: Note: Some restrictions may apply to use of individual images which are separately licensed.\n\nIn the Chinese historical tradition, the rulers of the Zhou displaced the Shang and legitimized their rule by invoking the Mandate of Heaven, the notion that the ruler (the \"son of heaven\") governed by divine right (granted by the Supreme God of Heaven) but that his dethronement would prove that he had lost the mandate. The doctrine explained and justified the demise of the Xia and Shang dynasties and at the same time supported the legitimacy of present and future rulers. The Zhou dynasty was founded by the Ji family and had its capital at Hào (near the present-day city of Xi'an). Sharing the language and culture of the Shang (Yin), the early Zhou rulers, through conquest and colonization, gradually extended Shang (Yin) culture through much of China Proper north of the Yangtze River.\n\nAccording to the Zhou, the Shang had ruled unethically, squandering the resources of the kingdom. The mandate required rulers to rule justly. Each succeeding generation had to justify the dynasty's continued claim to hold the mandate. Negligence and abuse could revoke the mandate. The will of the people, ultimately, sanctioned the king's rule.\n\nFēngjiàn (封建)\n\nB.C.E. , British Museum Western Zhou dynasty vase with glass inlays, fourth-third century\n\nIn the West, the Zhou period is often described as feudal because the Zhou's early rule invites comparison with medieval rule in Europe. However, historians debate the meaning of the term feudal; the more appropriate term for the Zhou Dynasty's political arrangement would be from the Chinese language itself: the Fēngjiàn (封建) system. The Zhou amalgam of city-states became progressively centralized and established increasingly impersonal political and economic institutions. These developments, which probably occurred in the later Zhou period, were manifested in greater central control over local governments and a more routinized agrarian taxation.\n\nWestern and Eastern Zhou\n\nInitially the Ji family was able to control the country firmly. In 771 B.C.E. , after King You of Zhou had replaced his queen with a concubine, the capital was sacked by the joint force of the queen's father, who was the powerful Marquess of Shen, and a nomadic tribe. The queen's son, King Ping of Zhou, was proclaimed the new king by the nobles from the states of Zheng, Lü, Qin and the Marquess of Shen. The capital was moved eastward in 722 B.C.E. to Luoyang in present-day Henan Province.\n\nBecause of this shift, historians divide the Zhou era into the Western Zhou (Xī Zhōu), lasting up until 771 B.C.E. , and the Eastern Zhou (Dōng Zhōu) from 770 up to 256 B.C.E. The beginning year of the Western Zhou has been disputed—1122 B.C.E. , 1027 B.C.E. and other years within the hundred years from late twelfth century B.C.E. to late eleventh century B.C.E. have been proposed. Chinese historians take 841 B.C.E. as the first year of consecutive annual dating of the history of China, based on the Records of the Grand Historian by Sima Qian. The Eastern Zhou corresponds roughly to two sub-periods. The first, from 722 to 481 B.C.E. , is called the Spring and Autumn Period, after a famous historical chronicle of the time; the second, which extends slightly past the 256 B.C.E. end date of the Eastern Zhou, is known as the Warring States period (480 to 221 B.C.E. ). This discrepancy is due to the fact that the last Zhou king's reign ended in 256, 35 years before the beginning of the Qin dynasty which ended the Warring States period.\n\nDecline\n\nWith the royal line broken, the power of the Zhou court gradually diminished; the fragmentation of the kingdom accelerated. From Ping Wang onwards, the Zhou kings ruled in name only, with true power lying in the hands of powerful nobles. Towards the end of the Zhou Dynasty, the nobles did not even bother to acknowledge the Ji family symbolically and declared themselves to be kings. They wanted to be the king of the kings. Finally, the dynasty was obliterated by Qin Shi Huang's unification of China in 221 B.C.E. The Zhou had always had a concern for unity but in the end they could not sustain the unity of their empire, and lost the mandate of heaven.\n\nAgriculture\n\nAgriculture in Zhou dynasty was intensive and in many cases directed by the government. All farming lands were owned by nobles, who then gave their land to their serfs, similar to European feudalism. For example, a piece of land was divided into nine squares in the shape of the character for \"water well,\" jing (井), with the grain from the middle square taken by the government and that of surrounding squares kept by individual farmers. This way, the government was able to store surplus food (such as rice) and distribute them in times of famine or poor harvest. Some important manufacturing sectors during this period include bronze making, which was integral in making weapons and farming tools. Again, these industries were dominated by the nobility who direct the production of such materials.\n\nLegacy\n\nThe Zhou dynasty left a rich legacy. It gave stability and a large measure of peace to a large area of China from the eleventh to the third centuries B.C.E. During this period, the people developed a culture and a way of life and a world-view that bound them together within a common universe. This paved the way for the unification of China by the Qin king, Shih Hunag-ti in 221 B.C.E.\n\nConfucius, who lived during the Zhou dynasty, laid the foundations of what became Confucian thought, much of which concerned the correct ordering of society. Much Chinese thought focused less on individual issues of morality, although they were discussed than on social responsibility, on the duties of subjects and rulers. Morality and benevolence were key concerns. A fundamental concern was balance and harmony, within society, between the rulers and the ruled, heaven and earth, the human and natural worlds. At the heart of Confucius' teaching was the concept of the (chun-tzu) (gentleman), who has cultivated wisdom (chi), love of humanity (ren), courage (yung) and righteousness (yi). Confucius championed the idea that education can improve the individual and that if all people were educated, universal peace would become a reality. Confucius was a shih, a new type of civil servant whose appointment was based on ability, not birth.\n\nLaozi also lived during this period, possibly born in 600 B.C.E. , from whose teaching Daoism developed. Laozi is famous for his concept of wu-wei—that is, ride nature, do not try to conquer it. By going with the flow, opposites can be reconciled and ethical conduct becomes natural. He taught that that reality is two-sided; yin (feminine; dark, cool, moist) and yang (masculine; hot, dry, bright). Both are necessary and equal and nothing is exclusively either (all are a blend of both). These (and all apparent opposites) need to be kept in balance and harmony to avoid chaos.\n\nZhou dynasty kings\n\nPersonal name Posthumous name Reign years1 Name by which most commonly known Ji Fa\n\nWuwang\n\n1046 B.C.E. -1043 B.C.E. 1 Zhou Wuwang\n\n(King Wu of Zhou) Ji Song\n\nChengwang\n\n1042 B.C.E. -1021 B.C.E. 1 Zhou Chengwang\n\n(King Cheng of Zhou) Ji Zhao\n\nKangwang\n\n1020 B.C.E. -996 B.C.E. 1 Zhou Kangwang\n\n(King Kang of Zhou) Ji Xia\n\nZhaowang\n\n995 B.C.E. -977 B.C.E. 1 Zhou Zhaowang\n\n(King Zhao of Zhou) Ji Man\n\nMuwang\n\n976 B.C.E. -922 B.C.E. 1 Zhou Muwang\n\n(King Mu of Zhou) Ji Yihu\n\nGongwang\n\n922 B.C.E. -900 B.C.E. 1 Zhou Gongwang\n\n(King Gong of Zhou) Ji Jian\n\nYiwang\n\n899 B.C.E. -892 B.C.E. 1 Zhou Yiwang\n\nKing Yi of Zhou) Ji Pifang\n\nXiaowang\n\n891 B.C.E. -886 B.C.E. 1 Zhou Xiaowang\n\n(King Xiao of Zhou) Ji Xie\n\nYiwang\n\n885 B.C.E. -878 B.C.E. 1 Zhou Yiwang\n\n(King Yi of Zhou) Ji Hu\n\nLiwang\n\n877 B.C.E. -841 B.C.E. 1 Zhou Liwang\n\n(King Li of Zhou) Gonghe (regency)\n\n841 B.C.E. -828 B.C.E. Gonghe Ji Jing\n\nXuanwang\n\n827 B.C.E. -782 B.C.E. Zhou Xuanwang\n\n(King Xuan of Zhou) Ji Gongsheng\n\nYouwang\n\n781 B.C.E. -771 B.C.E. Zhou Youwang\n\n(King You of Zhou) End of Western Zhou / Beginning of Eastern Zhou Ji Yijiu\n\nPingwang\n\n770 B.C.E. -720 B.C.E. Zhou Pingwang\n\n(King Ping of Zhou) Ji Lin\n\nHuanwang\n\n719 B.C.E. -697 B.C.E. Zhou Huanwang\n\n(King Huan of Zhou) Ji Tuo\n\nZhuangwang\n\n696 B.C.E. -682 B.C.E. Zhou Zhuangwang\n\n(King Zhuang of Zhou) Ji Huqi\n\nXiwang\n\n681 B.C.E. -677 B.C.E. Zhou Xiwang\n\n(King Xi of Zhou) Ji Lang\n\nHuiwang\n\n676 B.C.E. -652 B.C.E. Zhou Huiwang\n\n(King Hui of Zhou) Ji Zheng\n\nXiangwang\n\n651 B.C.E. -619 B.C.E. Zhou Xiangwang\n\n(King Xiang of Zhou) Ji Renchen\n\nQingwang\n\n618 B.C.E. -613 B.C.E. Zhou Qingwang\n\n(King Qing of Zhou) Ji Ban\n\nKuangwang\n\n612 B.C.E. -607 B.C.E. Zhou Kuangwang\n\n(King Kuang of Zhou) Ji Yu\n\nDingwang\n\n606 B.C.E. -586 B.C.E. Zhou Dingwang\n\n(King Ding of Zhou) Ji Yi\n\nJianwang\n\n585 B.C.E. -572 B.C.E. Zhou Jianwang\n\n(King Jian of Zhou) Ji Xiexin\n\nLingwang\n\n571 B.C.E. -545 B.C.E. Zhou Lingwang\n\n(King Ling of Zhou) Ji Gui\n\nJingwang\n\n544 B.C.E. -521 B.C.E. Zhou Jingwang\n\n(King Jing of Zhou) Ji Meng\n\nDaowang\n\n520 B.C.E. Zhou Daowang\n\n(King Dao of Zhou) Ji Gai\n\nJingwang\n\n519 B.C.E. -476 B.C.E. Zhou Jingwang\n\n(King Jing of Zhou (Ji Gai)) Ji Ren\n\nYuanwang\n\n475 B.C.E. -469 B.C.E. Zhou Yuanwang\n\n(King Yuan of Zhou) Ji Jie\n\nZhendingwang\n\n468 B.C.E. -442 B.C.E. Zhou Zhendingwang\n\n(King Zhending of Zhou) Ji Quji\n\nAiwang\n\n441 B.C.E. Zhou Aiwang\n\n(King Ai of Zhou) Ji Shu\n\nSiwang\n\n441 B.C.E. Zhou Siwang\n\n(King Si of Zhou) Ji Wei\n\nKaowang\n\n440 B.C.E. -426 B.C.E. Zhou Kaowang\n\n(King Kao of Zhou) Ji Wu\n\nWeiliewang\n\n425 B.C.E. -402 B.C.E. Zhou Weiliewang\n\n(King Weilie of Zhou) Ji Jiao\n\nAnwang\n\n401 B.C.E. -376 B.C.E. Zhou Anwang\n\n(King An of Zhou) Ji Xi\n\nLiewang\n\n375 B.C.E. -369 B.C.E. Zhou Liewang\n\n(King Lie of Zhou) Ji Bian\n\nXianwang\n\n368 B.C.E. -321 B.C.E. Zhou Xianwang\n\n(King Xian of Zhou) Ji Ding\n\nShenjingwang\n\n320 B.C.E. -315 B.C.E. Zhou Shenjingwang\n\n(King Shenjing of Zhou) Ji Yan\n\nNanwang\n\n314 B.C.E. -256 B.C.E. Zhou Nanwang\n\n(King Nan of Zhou) Huiwang\n\n255 B.C.E. -249 B.C.E. Zhou Huiwang2\n\n(King Hui of Eastern Zhou) 1 The first generally accepted date in Chinese history is 841 B.C.E. , the beginning of the Gonghe\n\nregency. All dates prior to this are the subject of often vigorous dispute. The dates provided here\n\nare those put forward by The Xia-Shang-Zhou Chronology Project, the work of scholars\n\nsponsored by the Chinese government which reported in 2000. They are given only as a guide. 2 Nobles of the Ji family proclaimed King Hui as King Nan's successor after their capital, Luoyang,\n\nfell to Qin forces in 256 B.C.E. However Zhou resistance did not last long in the face of the Qin\n\nadvance and so King Nan is widely considered to have been the last emperor of the Zhou dynasty.\n\nReferences ISBN links support NWE through referral fees\n\nGernet, Jacques. A History of Chinese Civilization . Cambridge: Cambridge University Press, 1996. ISBN 978-0521497817\n\n. Cambridge: Cambridge University Press, 1996. ISBN 978-0521497817 Hucker, Charles O. China to 1850: A Short History . Stanford< CA: Stanford University Press, 1978. ISBN 978-0804709583\n\n. Stanford< CA: Stanford University Press, 1978. ISBN 978-0804709583 Li, Xueqin. Eastern Zhou and Qin Civilizations . New Haven, CT: Yale University Press, 1986. ISBN 978-0300032864\n\n. New Haven, CT: Yale University Press, 1986. ISBN 978-0300032864 Shaughnessy, Edward L. Sources of Western Zhou History: Inscribed Bronze Vessels . Berkeley, CA: University of California Press, 1992. ISBN 978-0520070288\n\n. Berkeley, CA: University of California Press, 1992. ISBN 978-0520070288 Schirokauer, Conrad, and Miranda Brown. A Brief History of Chinese Civilization. Florence, KY: Wadsworth Publishing, 2006."}, {"url": "https://human.libretexts.org/Under_Construction/History-Boundless-1581241200.epub/05%3A_Early_Chinese_Dynasties/5.03%3A_The_Zhou_Dynasty", "page_content": "The Zhou ruled until 256 BCE, when the state of Qin captured Chengzhou. However, the Mandate of Heaven philosophy carried on throughout ancient China.\n\nThe need for the Zhou to create a history of a unified China is also why some scholars think the Xia Dynasty may have been an invention of the Zhou. The Zhou needed to erase the various small states of prehistoric China from history, and replace them with the monocratic Xia Dynasty in order for their Mandate of Heaven to seem valid (i.e., to support the claim that there always would be, and always had been, only one ruler of China).\n\nThe Mandate of Heaven did not require a ruler to be of noble birth, and had no time limitations. Instead, rulers were expected to be good and just in order to keep the Mandate. The Zhou claimed that their rule was justified by the Mandate of Heaven. In other words, the Zhou believed that the Shang kings had become immoral with their excessive drinking, luxuriant living, and cruelty, and so had lost their mandate. The gods’ blessing was given instead to the new ruler under the Zhou Dynasty, which would rule China for the next 800 years.\n\nUnder the Zhou Dynasty, China moved away from worship of Shangdi (“Celestial Lord”) in favor of worship of Tian (“heaven”), and they created the Mandate of Heaven. According to this idea, there could be only one legitimate ruler of China at a time, and this ruler reigned as the “Son of Heaven” with the approval of the gods. If a king ruled unfairly he could lose this approval, which would result in his downfall. Overthrow, natural disasters, and famine were taken as a sign that the ruler had lost the Mandate of Heaven.\n\nIn 1046 BCE, the Zhou, a subject people living in the western part of the kingdom, overthrew the Shang Dynasty at the Battle of Muye. This was a battle between Shang and Zhou clans, over the Shang’s expansion. They largely had the support of the Chinese people: Di Xin (the final king of the Shang Dynasty) had become cruel, spent state money on drinking and gambling, and ignored the state. The Zhou established authority by forging alliances with regional nobles, and founded their new dynasty with its capital at Fenghao (near present-day Xi’an, in western China).\n\nSociety Under the Zhou Dynasty\n\nUnder the initial period of the Zhou Dynasty (called the Western Zhou period), a number of innovations were made, rulers were legitimized under the Mandate of Heaven, a feudal system developed, and new forms of irrigation allowed the population to expand.\n\nLearning Objectives Describe the main accomplishments of the Western Zhou period\n\nKey Takeaways Key Points The first period of Zhou rule, during which the Zhou held undisputed power over China, is known as the Western Zhou period.\n\nDuring the Western Zhou period, the focus of religion changed from the supreme god, Shangdi, to “Tian,” or heaven; advances were made in farming technology; and the feudal system was established.\n\nUnder the feudal system, the monarchy would reward loyal nobles with large pieces of land.\n\nOver time, the king grew weaker, and the lords of the feudal system grew stronger, until finally, in 711 BCE, one lord joined forces with an invading group of barbarians and killed the king. Key Terms Western Zhou period : The first period of Zhou rule, during which the Zhou held undisputed power over China (1046-771 BCE).\n\n: The first period of Zhou rule, during which the Zhou held undisputed power over China (1046-771 BCE). feudal system : A social system based on personal ownership of resources and personal fealty between a suzerain (lord) and a vassal (subject). Defining characteristics include direct ownership of resources, personal loyalty, and a hierarchical social structure reinforced by religion.\n\n: A social system based on personal ownership of resources and personal fealty between a suzerain (lord) and a vassal (subject). Defining characteristics include direct ownership of resources, personal loyalty, and a hierarchical social structure reinforced by religion. Duke of Zhou: A regent to the king who established the feudal system, and held a lot of power during the Western Zhou period.\n\nThe first period of Zhou rule, during which the Zhou held undisputed power over China, is known as the Western Zhou period. This period ended when the capital was moved eastward. A number of important innovations took place during this period: the Zhou moved away from worship of Shangdi, the supreme god under the Shang, in favor of Tian (“heaven”); they legitimized rulers, through the Mandate of Heaven (divine right to rule); they moved to a feudal system; developed Chinese philosophy; and made new advances in irrigation that allowed more intensive farming and made it possible for the lands of China to sustain larger populations.\n\nChina created a substantial amount of literature during the Zhou Dynasty. These include The Book of History and The Book of Diviners, which was used by fortune tellers. Books dedicated to songs and ceremonial rites were also created. While many of these writings have been destroyed over time, their lasting impression on history is evidence of the strength of Zhou culture.\n\nLike other river valley civilizations of the time, the people under the Zhou Dynasty followed patriarchal roles. Men chose which children would be educated and whom their daughters were married. The household usually consisted of the head male, his wife, his sons and unmarried daughters.\n\nThe feudal system in China was structurally similar to ones that followed, such as pre-imperial Macedon, Europe, and Japan. At the beginning of the Zhou Dynasty’s rule, the Duke of Zhou, a regent to the king, held a lot of power, and the king rewarded the loyalty of nobles and generals with large pieces of land. Delegating regional control in this way allowed the Zhou to maintain control over a massive land area. Under this feudal (fengjian) system, land could be passed down within families, or broken up further and granted to more people.\n\nMost importantly, the peasants who farmed the land were controlled by the feudal system. Slavery had been common during the Shang Dynasty, but this decreased and finally disappeared under the Zhou Dynasty, as social status became more fluid and transitory.\n\nWhen the Duke of Zhou stepped down, China was united and at peace, leading to years of prosperity. But this only lasted for about seventy-five years. Over time, the central power of the Zhou Dynasty slowly weakened, and the lords of the fiefs originally bestowed by the Zhou came to equal the kings in wealth and influence. They began to actively compete with them for power, and the fiefs gained independence as individual states.\n\nFinally, in 711 BCE, one rebellious noble, the Marquess of Shen, joined forces with invading barbarians, the Quanrong, to defeat the King You. No one came to the king’s defense, and he was killed. The Zhou capital was sacked by the barbarians, and with this the Western Zhou period ended."}]}