{"Zhuang of Chu faced internal strife from divided ministers.": [{"url": "http://subsites.chinadaily.com.cn/npc/2021-12/24/c_693844.htm", "page_content": "Confidence in the Political System of Chinese Socialism*\n\nSeptember 5, 2014\n\nPeople's democracy is a banner that the CPC has always held high. On our way forward, we should keep to the socialist path of making democratic political progress with Chinese features.\n\nThe way we plan and accelerate China's socialist democracy plays a decisive, comprehensive, and far-reaching role in our national political life.\n\nAt all times and almost everywhere on the planet, evidence can be found showing that the wrong choice in the path for political development leads to social unrest, national disruption, and the fall of the government. China is a large developing country. Choosing the right path for its political progress is therefore a fundamental and vital issue.\n\nDesigning and developing the national political system, we must ensure the unity of history and reality, theory and practice, and form and content.\n\nWe must take into account the realities and the prevailing conditions in China, focusing on current issues to respond to actual demands rather than copying from other models.\n\nWe must keep to the long-established track of historical heritage, cherishing the path of past development, accumulated political experience, and established political principles rather than breaking with history.\n\nA political system works to adjust political relations, establish political order, accelerate national development, and maintain national stability. This is why it cannot be judged without reference to its specific social and political conditions. It can never be all in the same key and follow the same pattern. In our political system, we should not simply imitate others when we see things that we do not have, and neither should we want to get rid of what we believe to be surplus because others do not have it. Neither of these views is correct because they are superficial and reductive.\n\nAs an old Chinese saying goes, \"To the south of the Huaihe River grow oranges, while to the north grow bitter oranges.\"1 The purpose of the saying is to highlight the influence of environment. We should draw on the achievements of other political civilizations, but we should never let them outweigh the foundations of China's own political system.\n\nChina is a country with a land area of over 9.6 million square kilometers and a population of 56 ethnic groups. Whose model should we copy? And who is qualified to throw their weight around and tell us what to do?\n\nLiving in a colorful world, we should uphold the approach of inclusiveness, modestly learn from the best of other civilizations, and digest and absorb them on an independent basis, so as to turn them into part of the best of our own. Never follow others without trying to understand them properly. In attempting to walk like a swan, the crow loses its own gait.\n\nBlindly copying the political systems of other countries will never work in China. They will never adapt to our country. Such a course of action will \"turn the tiger you are trying to draw into a dog\". It could even spell an end to the independent destiny of our country. Only a system deeply-rooted and fully nourished in our own soil is trustworthy and will serve our purposes.\n\nNo two political systems on earth are exactly alike, and no model can fit the political systems of all countries.\n\nThe Chinese people recognize that it is natural for things to be different. All countries differ in their realities. Each country is unique in its political system, which is determined by its people and has been developed and gradually refined over a long period of time on the basis of their historical heritage, cultural traditions, and social and economic development.\n\nThe strength of China's socialist political system, featuring Chinese characteristics – workable, full of vigor and vitality, and efficient – is that, past and present, it has grown on the Chinese soil. In the future, it will continue to thrive and to be deeply rooted in this soil.\n\nThe best way to evaluate whether a country's political system is democratic and efficient is to observe whether the succession of its leading body is orderly and in line with the law, whether all people can manage state affairs and social, economic and cultural affairs in conformity with legal provisions, whether the public can express their requirements without hindrance, whether all sectors can efficiently participate in the country's political affairs, whether national decisions can be made in a rational, democratic way, whether professionals in all fields can be part of the team of the national leadership and administrative systems through fair competition, whether the ruling party can serve as a leader in state affairs in accordance with the Constitution and laws, and whether the exercise of power can be kept under effective restraint and supervision.\n\nThanks to a long-term effort, we have made decisive progress in addressing such major issues.\n\nWe have replaced the life-long tenure of officials with limited terms. Today, all officials serving in government agencies are replaced in an orderly manner.\n\nWe have offered greater opportunities for the people to participate in political affairs, so that they are able to play their role as the masters of the country, on a wide range, at all levels.\n\nWe have promoted the broadest possible patriotic United Front and developed a unique socialist consultative democracy, which has brought together the wisdom and strength of all political parties, organizations, ethnic groups, social groups, and people from all walks of life.\n\nWe have striven to establish a decision-making system that tells us how people are faring, reflects public opinion, pools general wisdom, and values social strengths. We have also maximized the transparency of decision-making and provided further opportunities for the public to take part in the process, so as to ensure that all of our decisions serve the interests and aspirations of the people.\n\nWe have established and improved a system for the selection and appointment of exemplary talent, so that outstanding people from all sectors can be drawn to the causes of both the Party and the government.\n\nWe have promoted the rule of law, law-based governance and exercise of state power, and a law-based country, government and society, thus enhancing governance by law throughout the country.\n\nWe have established and refined a multilevel system for scrutiny and one for open administration system in various areas so as to guarantee that both Party and central government organs, as well as their staff, exercise their power in accordance with proper authorization and procedures.\n\nChina has implemented the state system which is a socialist state under the people's democratic dictatorship led by the working class and based on the alliance of workers and farmers, the system of people's congresses as the system of government, the system of multiparty cooperation and political consultation under the leadership of the CPC, the system of regional ethnic autonomy, and the system of community-level self-governance, featuring distinctive Chinese characteristics.\n\nThis institutional arrangement has demonstrated the following strengths:\n\n– It performs well in allowing the people to enjoy more extensive and more substantial rights and freedoms, and share more opportunities to participate in national and social governance.\n\n– It can effectively regulate the country's political relations, promote a vigorous and vital relationship among political parties, ethnic groups, religions, social groups, and compatriots at home and abroad, enhance national cohesion, and form political stability.\n\n– It can pool our resources to accomplish sizable tasks, success- fully accelerate the liberation and development of social productivity, incentivize all sectors during socialist modernization, and upgrade quality of life and standards of living.\n\n– It can effectively safeguard state independence, sovereignty, security, and the benefits of development, and maintain the well-being of both the nation and its people.\n\nOver the three decades since the introduction of the reform and opening-up policy, China has overcome rarely-seen difficulties and removed barriers to progress. As a result it has reached new heights in economic strength and overall national strength, and in people's standard of living. All ethnic groups have worked together for common prosperity and development, leading to a long-term social harmony and stability in the country. Facts prove that China's socialist democracy is bestowed with enormous vitality and the country has made the right choice for its socialist path of making political progress with Chinese characteristics, which suits China's national conditions and reinforces the position of the people as the master of the country.\n\nA country's political system defines and responds to its economic and social foundations. It can even play a decisive role. It is a key link between other systems. Therefore, we must increase self-confidence in our country's political system and strengthen our faith in and determination to follow our chosen political path of development.\n\nSocialist democracy with Chinese characteristics is something new, and good. This does not necessarily mean that China's political system is flawless, beyond improvement and incapable of development.\n\nHaving confidence in our political system does not mean being smug or complacent, nor does it mean we know best and we can ignore the outside world. Instead, we should fuse growing confidence in the system with continuous reform and innovation, and be unstinting in our efforts to improve and develop the institutional system, while maintaining the fundamental political system.\n\nAs we have always believed, the progress of our democracy and legal system is not quick enough in responding to the requirements of expanding people's democracy and promoting social and economic development. When it comes to socialist democracy, there remain further improvements to be made in its system, mechanisms, procedures, regulations, and specific operations. We should therefore double our efforts to safeguard the people's right to democracy and give full play to their creativity.\n\nWhile promoting reform in all respects, we should actively and steadily advance political reform, take the people's position as masters of the country as a fundamental principle, enhance the vitality of the Party and the country, and keep the people fully motivated.\n\nSocialist political progress means modernizing the state governance system and capacity.\n\nThe general goal of continuing reform, set at the Third Plenary Session of the 18th CPC Central Committee, concluded with two phrases: \"improving and developing the socialist system with Chinese characteristics\", and \"modernizing our national governance system and capacity\". The former defines our fundamental orientation – Chinese socialism, rather than anything else. The latter points the distinctive direction to achieve development and progress under the fundamental orientation. Each of the two is essential, and they are interdependent.\n\nThe key to socialist democracy lies in maximizing and expanding our strengths and traits.\n\nWe should give better play to the Party's core function as a leader that commands the overall situation and coordinates with all other stakeholders. We should improve the CPC's capability for scientific, democratic and law-based governance, ensure that the Party leads the people to govern the country effectively, and guarantee that our country moves forward with the leadership and in a state of unity.\n\nWe must uphold the principle that all power of the state belongs to the people, which guarantees not only democratic elections in accordance with the law but also democratic decision-making, democratic management, and democratic supervision, and avoids any risk that pre-election promises will not be kept.\n\nWe must uphold and improve the system of CPC-led multiparty cooperation and political consultation, and intensify cooperation and coordination between all social forces, so as to avoid conflicts, disputes, and internal strife among the various parties involved.\n\nWe must uphold and improve the system of regional ethnic autonomy, consolidate ethnic relations of equality, unity, mutual assistance and harmony, and achieve harmonious development of all ethnic groups, so as to guard against ethnic conflicts and misunderstandings.\n\nWe must uphold and improve the system of community-level self-governance by improving local democracy, and see that the people directly exercise their democratic rights in line with the law, and that their rights are genuine.\n\nWe must uphold and improve the system and principle of democratic centralism by enhancing the capacity and efficiency of all government agencies, stepping up their coordination and collaboration, and forming a strong force for managing our state affairs, so as to avoid internal friction.\n\nIn short, we should double our efforts in institutionalizing and standardizing socialist democracy to give free rein to the strengths of the socialist political system with Chinese characteristics, so that our Party and nation can thrive and enjoy long-lasting stability\n\n* Part of the speech at the meeting marking the 60th anniversary of the National People's Congress.\n\nNotes\n\n1 Annals of Master Yan (Yan Zi Chun Qiu).\n\n\n\n\n\n(Not to be republished for any commercial or other purposes.)"}, {"url": "https://www.ft.com/content/4527506c-c0c3-11e7-9836-b25f8adaa111", "page_content": "What is included in my trial?\n\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\n\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\n\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\n\nWhat happens at the end of my trial?\n\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for HK$549 per month.\n\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\n\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\n\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel."}, {"url": "https://plato.stanford.edu/entries/zhuangzi/", "page_content": "First published Wed Dec 17, 2014\n\nThis linguistic analysis emphasized indexical contexts especially for the evaluative terms of choices of natural paths of behavior (dàos). Zhuangzi’s foils were mainly credulous and dogmatic Confucian humanists, particularly the innate intuitionist absolutism of a type familiar from the Mencius. He also took his linguistic insights to undermine Mozi’s pragmatic utilitarian alternative to Confucianism. He engaged seriously with later Mohist, realist, linguistic theories, both acknowledging their challenge to primitive quietism (the anti-language view familiar in The Laozi) and yet remaining skeptical of the realist conclusion. His most frequent co-discussant in the text was Hui Shi, a rival linguistic relativist.\n\nPhilosophically, Zhuangzi strikes us as more the Hume of his tradition than a system builder like Plato, Aristotle or Kant. He drew skeptical and relativist implications from a naturalist approach to normative guidance. His treatment of natural dàos focused on the norms governing correct use of language. His ethical relativism grew out of an indexical model of how natural conditions shape the norms governing the use of terms.\n\nThis wide range of views of Zhuangzi stem from the style of the text. Zhuangzi’s prose style is its own distinctive literary treasure. The central feature is the parable, typified as a discussion between imaginary or real interlocutors. Typically short, pithy, and amusing, his tales are both accessible and philosophically seductive—they both entertain and make you think. A respite from the dry moralizing of Confucians, the text was always a favorite of the Chinese intellectual, literati class. The Zhuangzi also attracts modern Western readers with its thoroughgoing naturalism, philosophical subtlety, and sophisticated humor, all set in a strikingly different conceptual scheme and its distant, exotic context.\n\nSix centuries later, elements of Zhuangzi’s naturalism, along with themes found in the text attributed to Laozi helped shape Chan Buddhism (Japanese Zen)—a distinctively Chinese, naturalist blend of Daoism and Buddhism with its emphasis on focused engagement in our everyday ways of life.\n\nZhuangzi (Chuang-tzu 莊子 “Master Zhuang” late 4th century BC ) is the pivotal figure in Classical Philosophical Daoism. The Zhuangzi is a compilation of his and others’ writings at the pinnacle of the philosophically subtle Classical period in China (5th–3rd century BC ). The period was marked by humanist and naturalist reflections on normativity shaped by the metaphor of a dào—a social or a natural path. Traditional orthodoxy understood Zhuangzi as an anti-rational, credulous follower of a mystical Laozi. That traditional view dominated mainstream readings of the text. Recent archeological discoveries have largely laid that ancient orthodoxy to rest.\n\nZhuangzi flourished through the latter half of the 4th century BC roughly contemporary with Mencius, and the movement known as the School of Names (名家 ming-jia name school). Zhuangzi shows familiarity with Classical Chinese theories of pragmatic-semantics and makes his own theoretical contributions to it. The traditionally recognized figures in this school included Gongsun Long and Hui Shi—Zhuangzi’s close friend and most frequent direct philosophical discussant. With the recovery of the Later Mohist dialectical work detailing their theory of language, we find compelling evidence that the linguistic turn in Classical thinking was a widespread feature of this mature phase of the Classical period. The later Confucian thinker, Xunzi, follows Zhuangzi in reacting to and incorporating this linguistic turn in his thinking.\n\nMost of what we infer about Zhuangzi’s life, we draw from evidence within the Zhuangzi, although the Han biographers did speculate about his place of origin (the state of Meng) his personal name (Zhou), and the official posts he held (minor in Qiyuan in his home state) and period he lived (during Prince Wei reign over Chu—which ended about 327 BC ). Scholars have found it hard to confirm any details of his life from outside this text and from his being discussed by later thinkers. The text itself contains scattered stories about Zhuangzi, but given its frequent use of fantasy, even these we must season with the salt of textual skepticism. We attribute a large chunk of the extant text of the Zhuangzi to “students of Zhuangzi” but we have little hint of who his students were or if he even had students in any formal sense.\n\nA scholar working around 600 years later after the fall of the Han, Guo Xiang (d. 312), edited and reduced what he saw as a haphazardly accumulated cluster of apocryphal and possibly authentic texts. He concluded that many were added after the time Zhuangzi lived. Guo reports compressing that prior collection of writings from fifty-two chapters to thirty-three. This is the extant text on which our knowledge is based. Guo divided the chapters he had chosen into three sections: the “Inner Chapters” (1–7), the “Outer Chapters” (8–22) and the “Miscellaneous Chapters” (23–33). He attributed only the first section to the period dating from Zhuangzi’s lifetime—hence possibly originating from Zhuangzi himself. The second grouping may have included writings of a “School of Zhuangzi.” Modern scholarship assigns various sources of other influences found in both the second “outer” and final “miscellaneous” chapters. Graham drawing on work of the Chinese theorist, Kuan Feng and followed with some variation by Liu Xiaogan and Harold Roth, divides these influences into roughly four variously named groups:\n\nZhuangzi’s students or the School of Zhuangzi credited with those later writings committed most closely to the views expressed in the “inner chapters.”\n\nAuthors with egoist views associated with Yang Zhu (4th century BC ). The Mencius presented Yang’s thought as a version of an ethical egoism that rejected conventional altruistic social dàos.\n\n). The Mencius presented Yang’s thought as a version of an ethical egoism that rejected conventional altruistic social dàos. The third group Graham dubbed the ‘primitivists’. Primitivists share Yang Zhu’s antipathy to social, historical or conventional dàos—typically those supporting social norms extending beyond agricultural village life—in favor of more natural ways. This group shares attitudes with the text of the Laozi (Dàodé Jing) mixed with Yangist themes.\n\nThe final group, dominated the “miscellaneous” sections, Graham called them syncretists (eclectics) who seemingly attempted comprehensiveness by combining all points of view into a single complete dào.\n\nHowever widely assumed, Zhuangzi’s authorship of any of the “inner” chapters remains a speculative hypothesis. Guo’s original assessment that Zhuangzi did not author any of the remaining sections remains conventional scholarly wisdom, but religious Daoists treat the entire book as a Canon—The Nánhúa Zhen-Jing.\n\nCombining all these elements into a single volume reflects a familiar Classical pattern of embellishing the teachings of a master, adapting the additions to the namesake’s writing style and expanding on his themes and insights in distinctive ways. The four schools contributing to the extant text shared an emphasis on natural –usually as opposed to social-cultural, dàos. Yangism or egoism largely rejected social or moral dàos on the apparent assumption that natural guiding dàos essentially recommend self-preserving behavior. Its paradigm is the anti-social hermit. Motivation by self-interest was normatively prior to any conventional dào. They preserved their natural purity from social corruption by rejecting society’s mores.\n\nPrimitivism similarly rejected social and conventionally moral dàos (mores), but has its own conception of a natural, pre-social, typically intuitive, way of life that supports rustic, agricultural, village life. It supports populist and anarchist political tendencies.\n\nSyncretism does not reject social dàos per se, but does reject any particular dào as biased and narrow in contrast to a more, “rounded,” idealized, or comprehensive dào. This is often expressed in an ideal observer form (the sage, perfect human, or 天 tiannature:sky’s dào). These views tend toward epistemic supernaturalism—claims to superlative cognitive or religious access to some transcendently correct dào. Both tend to deny that their correct dàos can be expressed and transmitted in language or words.\n\nThe discussions in the “Inner Chapters,” particularly in the 2nd chapter, by contrast, treat language as also natural and social-conventional dàos as themselves natural dàos. It undermines the otherwise presupposed contrast of natural vs. conventional dàos. Humans are naturally social animals and execute natural causal processes when their walking, speaking, writing, and other practices leave marks in nature, (like a trail or a text) which become physically accessible to later walkers as history (stored in memory, legend, writings, or footprints etc.).\n\nThe pivotal 2nd chapter draws relativist and skeptical conclusions from its normative naturalism. It rejects the religious traditionalism of Confucianism and the Gaia-hypothesis implicit in the Mohist attempt at utilitarian naturalism. Nature provides us with many ways to go, but does not favor or command our making any choices among them. Shì-fēi 是非 (This way not that) judgments are made by living creatures in nature, not by 天 tiānnature:sky itself. We can find guiding structures, dàos, in nature but not a favored or dictated dào of nature.\n\nLike the later syncretist chapters, the “Inner Chapter” Zhuangists accept that social dàos are continuous with natural ones, but they do not endorse any imagined or alleged, comprehensive judgments from everywhere, from all natural points of view. The cosmic judgement from nowhere is a non-judgment. Zhuangists are not committed to Laozi’s conception of an exclusive choice of natural (天 tiānsky:nature) over social (人 renhuman) dàos. They are skeptical of any claim of special access to contextless guiding knowledge by alleged or self-styled sages, “ideal observers” or perfect exemplars of epistemic virtues. They accept language but also accept our natural capacity and inclination to toy with it, alter it, and mould it to our use in various situations of practical choice.\n\nZhuangzi’s exemplars are butchers, musicians, cicada catchers, wheelmakers—exemplars of mundane and focused action guidance. Each is an exemplar of one of the many ways of life (dàos) who execute their particular specialties in a highly cultivated, precise, smooth, and seemingly easily executed way. The imagined eclectic synthesis of all the various ways of life into some total-comprehensive dào is no more than de-facto restatement of their co-existence in a single natural world as optional ways of life. The cosmos makes no judgment that they should exist—though it combines them into a cosmic dào that is the history of everything. That the cosmos has this outcome does not mean it makes a human-like choice which humans could or should execute. We are ill advised to strive for skill in everything.\n\nThe eclectics were probably the last community working with the text, adding to it and carrying it into later periods. The Laozi had become enmeshed with a ruler cult worship of The Yellow Emperor. Laozi became the far more influential figure during the entire Confucian orthodoxy of the Han (206–220 BC ).\n\nThe wide range of views of Zhuangzi stem from the style of the text and the ways it has figured in China’s intellectual history as well as the ways it was caught up in the modern interaction between China and the modern, scientific West.\n\nZhuangzi’s style is the philosophical parable, typically a brief discussion or exchange between two points of view. There is slight plurality of humans among the discussants joined by natural and imaginary creatures. Its fictional characters are usually cleverly named, some are Confucian icons (Confucius or his alleged teacher, Lao Dan). Some discussants are animals (real and fictional fish, birds, snakes), a talking skull, the wind, musicians, debaters, tigers, trainers, butchers, butterflies, burglars and the myriad “pipes of nature.” Expressive brevity and subtlety of detail enhances the impact of the often complex and elusive point of the parables—they seldom explicitly formulate the moral or point explicitly. Most commonly, the author(s) end discussions in a doubting tone, a double rhetorical question or some pithy enigmatic parting shot. They may make their point by having the two parties walking away shaking their heads, agreeing only to disagree; both appreciating that they barely understand one another, and yet feeling that something has been learned from the exchange.\n\nTranslation into Western languages invites biases that are hard to avoid. The main effect is loss of the conceptual cohesion of the original, but the parables still engage our Western philosophical curiosity. We get the exhilaration of immersion in an independent philosophical tradition of comparable antiquity and richness. Readers in and out of China invariably suspect that the Zhuangzi’s appealing style is infused with philosophical genius, even as they disagree about its philosophical upshot. Indeed, much of the Zhuangzi’s philosophical appeal may stem from its seemingly deliberate open-ended texture, the interpretive malleability of its dialogues which invites, even perhaps requires, us to join the author(s) in their philosophical reflection.\n\nThis appeal stems only partly from the quality and sophistication of his episodes; each illuminated a patch of philosophical territory ending with a question for further pondering—rather like Nietzsche or the Later Wittgenstein. Each exchange presents or illustrates shards of insight with open-textured conclusions—all laced with Zhuangzi’s obvious joy in exploring paradox—particularly linguistic ones of the sort that appeal to analytic Western thinkers. Each is an expression of some natural, but perhaps inaccessible, alternative way of life. The frequent enigmatic conclusions “the answer is X” leaves interpreters arguing centuries later, Fermat-like, how X can be an answer—or what X is (e.g., “free and easy wandering,” “walking two paths,” “goblet words,” “clarity,” and so forth). Each seems easily to fit into a range of puzzles familiar to thinkers in both traditions. One suspects that we find the correct interpretation by finding our way, like Wittgenstein’s fly, out of some philosophical bottle. The correct philosophy coincides with the correct interpretation of Zhuangzi.\n\nThe traditional religious Zhuangzi narratives placed him as the disciple of Laozi, whom they regard as a quasi-divine founder of a mystical religion worshipping a mysterious entity translators tended to render as a definite descriptive term, but capitalized it as if it were a singular name, “The Dào.” Compatible philosophical treatments were versions of metaphysical monism, epistemic intuitionism (often explicitly anti-rationalist), political anarchism and a vague normative absolutism—follow The Dào. The bulk of popular and religious treatments still follow this interpretive line, treating Laozi as the earliest layer of “Daoist mystical thought” or “Lao-Zhuang” thought and situating Zhuangzi as his “follower.”\n\nThe story of the religious view of Zhuangzi starts a century after Zhuangzi lived (4th century BC ). Philosophical schools were closed, books burned and thought repressed during the superstitious Qin dynasty (221–206 BC ) which followed the classical period. This initiated China’s philosophical “Dark Age.” The more orthodox Confucian Han Dynasty (206 BC to 220) followed. Over two decades (109–91 BC ) the Han emperor’s hereditary Grand Historians, Sima Tan and Sima Qian (a father and son team), wrote an official history from the mythical Yellow Emperor (c. 3rd Millennium BC ) to the Han. It is in this account that the classification of thinkers into three concept schools, Daoist, Legalist, and School of Names first occurs. Graham speculates that the assumption of an affiliation of Zhuangzi to Laozi may have originated from the Outer Chapters. There Zhuangzi’s students used the mythical teacher of Confucius, Lao Dan or Laozi, to ridicule Confucius in a cycle of dialogues.\n\nA cult of Huang-Lao, worshipping the Yellow emperor and Laozi as divinities, had grown up in the Qin. The father and son historians were students of Huang-Lao masters. At the fall of the Han the narrative of Zhuangzi as a follower/elaborator of a semi-divine Laozi was well entrenched. The post-Han resurgence, known as Neo-Daoism, began with the editing of the received edition of, first, the Laozi (Wang Bi 226–249) then the Zhuangzi (Guo Xiang d. 312 see above). Neo-Daoist discussion practices and ideas were influential in bringing Buddhist and Chinese thought into interaction and Daoism became enmeshed with Buddhism in the popular view (especially with Chinese Chan Buddhism). A Daoist “religion”, borrowing models of religious institutions from Buddhism (monasteries, monks and nuns) influenced discourse about Daoism throughout the period of Buddhist domination of the Chinese intellectual world (achieved gradually during the Six Dynasties period 220–589 and extending through the Tang 618–907). Neo-Confucians from the medieval period on treated Buddhism and Daoism as essentially similar religions.\n\nModern text theory concerning the Zhuangzi grows from two recent discoveries.\n\nThe reconstruction of the Later Mohist dialectical works and Archeological reconstructions of the text of the Daode Jing.\n\nThe following section discusses their twin impact on our view of Zhuangzi.\n\nDevelopments at the end of the 19th and early 20th century in China led Chinese intellectuals to adopt the European concept of philosophy (哲學) with its implicit distinction from religion. This distinction was seen as pivoting on logic—the theory of proof or argument. They started to segregate their own writings which seemed most like argument, inference and logic from those sustained mainly by credulity and tradition. They began to sort out the philosophical aspects of their traditional thought from its more religious and superstitious elements. Sun Yirang’s (1848–1908) 1897 reconstruction of the Mohist Canon provided convincing evidence that analytically inspired and rigorous thinking had grown up in Classical China. This example encouraged 19th century intellectuals like Yan Fu (1854–1921) and Liang Qichao (1873–1929). They started to emphasize the ancient schools that more clearly related to the logical paradigms of Western philosophy and Mohist analytics. Hu Shih (1891–1962) continued this tradition of reconceiving and re-centering Chinese thought away from the Confucian scholasticism that had dominated since the decline of Buddhism.\n\nThe early 20th century logic-inspired reformation recently began to influence the interpretation of the Zhuangzi and the Xunzi in the west, largely inspired by Angus Graham who had observed that both ancient texts demonstrated a mastery of the technical vocabulary of Mohist linguistic theory.\n\nModern philosophical appreciation of the Zhuangzi, probably stems from Graham’s 1969 “[Zhuangzi]’s Essay on Seeing Things as Equal” (Graham 1969, predating his work on Mohism). Wryly replying to Wang Fuzhi’s speculation that Shen Dao, not Zhuangzi had authored the beloved chapter, Graham averred that whoever wrote that philosophically rich text is the person we would want to think of as Zhuangzi. Graham proposed looking at the text’s seemingly conflicting thoughts as analogous to the “inner dialogue” of a reflective thinker who formulates a view, considers then rejects it. Graham also noted the writer’s deep involvement and apparent fluency in the technical language and obscure issues arising in Classical Chinese theories of language which he then only beginning to study.\n\nGraham’s outlook conflicted overtly with a traditional Chinese narrative of a disciple Zhuangzi following a semi-divine Laozi in worship of The Mystical Dao. Zhuangzi, Graham quipped, didn’t know he was a Daoist. Graham later argued that the internal evidence suggested Zhuangzi had never seen the text of the Laozi (The Dào Dé Jing) and probably thought of Lao Dan as a Confucian. Most interpretive disputes are, to a greater or lesser degree, a result of the tension between Graham’s textual arguments and the traditional Historian’s picture of Zhuangzi as a religious mystical Daoist follower of the semi-divine Laozi, similarly worshipping “The Dào.”\n\nGraham’s textual arguments were indirectly supported by archeological discoveries of different Laozi texts. The discoveries in the early 1970s and 1990s together implied a relatively late date for the emergence of the Laozi text—probably some years after Zhuangzi had lived and perhaps overlapping the composition of a series of dialogues between Laozi and Confucius in the “Outer Chapters” section. Graham speculated that Zhuangzi’s students, who were writing the cycle of Laozi-Confucius dialogues, may have rhetorically chosen to use the legendary Lao Dan (mythical teacher of Confucius) to give him authority to lecture and ridicule the revered master.\n\nWhen we abandon the traditional identification of Zhuangzi as a Laozi follower, it opens the door for speculation about his relation to the relativist, linguistic theorist, Hui Shi, traditionally treated as belonging to the School of Names. Christoph Harbesmeier speculated he may have been either Zhuangzi’s teacher, mentor or fellow student. If he was a teacher, he came to accept his student as an equal or even superior. Zhuangzi portrays him as playing a role in Zhuangzi’s philosophical skill development as an intimate philosophical interlocutor and eventually as a foil for sharpening his analysis. Among those texts that concentrate on 名 míngnames, Hui Shi’s ten theses mark him as a relativist response to Mohist realism on the relation of names and “stuff”—focusing especially on comparative and indexical terms.\n\nWe can read Zhuangzi’s relativism, accordingly as an alternative, arguably more reflectively subtle, indexical relativism about 是非 shì-fēithis-not that judgments regarding choices of paths (dàos) of correct use of names/words/concepts as guideposts to our 行 xíngwalking:behavior. This can both explain Zhuangzi’s relativist direction of analysis and his recognition of sound Mohist/realist responses to Hui Shi’s version of that relativist direction of thought. This article develops and expands on Graham’s philosophical interpretation and emphasizes this relation to Hui Shi rather than to Laozi.\n\nBetween the traditional, piously mystical Daoist religious interpretation and that view’s nearest philosophical neighbors, lies the bulk of the interpretive historical and religious literature. Given the philosophically oriented venue of this article, what follows should not be treated as ecumenical.\n\nConfucian dàos were broadly humanist. The earliest version (Confucius 551–479 BC ) traced normativity to earlier human invention. Metaphorical trails are left by past human walkings, i.e. social practices. Language was an example of such an invented social practice which intertwined with routine activities (rituals) to yield the correct, sage-king inspired way of life—the social 道 dàopath. A later version (Mencius 372–239 BC ) focused on natural human psychology. The correct path is that to which our natural moral psychology inclines us. Humans have a 心 xīnheart-mind that is naturally shangood-at normative choice and practice.\n\nMencius may have been reacting to Mohism. Mozi (470–391 BC ) had earlier initiated a shift in focus to more natural and objective, less culturally relative way of grounding normative judgment. His claim that 天 tiānnature:sky exhibited a tendency to a course leading to human utility or well-being. So humans should use that natural norm, the 辯 biàndistinction between 利害 lì-hài benefit-harm in constructing our social dào, including the norms of language.\n\nCorrectly using terms is using them to mark the path of cooperative behaviors that lead to general human benefit—a social 道 dàopath utilitarianism, rather than a law or rule version. Nature intends us to follow its natural structures in ways that lead to universal human 利 lìbenefit. Ethical questions thus have a single correct answer in an ideally engineered and shared normative linguistic practice. Mohist utilitarian metaethics pointed to natural realism.\n\nDaoist primitivism (symbolized by the mythical Laozi and the anonymous text known as the Dàodé Jing) was, as noted above, a further trend toward a broader ethical naturalism with anti-language absolutist implications. We should forget or ignore all social norms and practices, including linguistic ones. Utility (perhaps egoistic utility) does motivate our behavior as naturally as water follows the paths created by natural contours of earth. Language should not interfere in any way with this natural guiding interaction between us and the course(es) of nature.\n\nUnderstanding the Zhuangzi is made more difficult by the huge differences not only in the philosophical context, but in the pervasive metaphors that structure and focus discussions of norms of behavior in the Chinese vs Indo-European classical traditions. His positions invite comparisons with modern metaethical naturalism but he does not focus them with concepts linked to grammatical sentences such as “laws” or “rules” (sentences in all form) or “facts” (sentence-sized chunks of reality) or “properties (realities corresponding to sentence predicates).” Zhuangzi used the traditional 道 dàopath metaphor together with the technical terminology developed in Mohism of shì-fēithis-not that, biàndistinction and kěpermissible.\n\nThe metaphor shaping most Chinese discussions of pragmatic knowing, choice and behavior was dào—a path or trail. Questions we would phrase in terms of moral propositions, laws, or principles are questions about finding, choosing and following dàos, paths or ways. Dàos can be social or natural structures that guide us in answering practical questions: what to do or how to do it. As the focus of warring Chinese conceptions of guidance, dào guidance has three phases. We must find or notice them, choose one from among those we notice, and then follow or interpret the selected dào in 行 xíngwalking:behavior. We 辯 biàndistinguish, discover and recognize them; choose or approve (shìthis:right) them or reject (fēinot-that:wrong ) them, and treat them as kěpermissible or not. Our capacity to engage in these three processes governing natural guiding structures, dàos, is an internal dào—our 德 dévirtuosity. Our 德 dévirtuosity at interacting with the web of dàos reads and interprets the path-marks thus generating our 行 xíngwalking:behavior.\n\nThe dào metaphor corresponds closely with the Western translation metaphor of ‘a way’ which, while ubiquitous in philosophical discourse, is rarely a central focus of philosophical analysis of normativity. The salient differences between the two traditions accounts of behavior are that the Chinese does not focus on sentential items (actions, events, beliefs) particularly as conclusions of belief plus desire mental arguments. Instead, it focuses on the interplay of natural processes grounded in the temporally shifting distributions of 氣 qiphysical stuff that yields path-like guidance structures for living things.\n\nConfucians and Mohists had their own theories of the both the right dàos and the right 德 dévirtuosity to use together in guiding behavior. Confucian dàos tended to be those enshrined in past practice and their version of 德 dévirtuosity tended toward the intuitive, typically appealing to 仁 rénhumanity.\n\nMohists advocated guiding reform of conventional social dàos using a natural normative 辯 biàndistinction of 利害 lì-hàibenefit-harm. For Mohists, 利害 lì-hàibenefit-harm was a 天 tiānnatural way of finding, choosing, reforming and interpreting social dàos. In contrast to Confucians, Mohists sought to elaborate their natural ways of selecting dào-like social practices as operational, objective, measurement-like processes accessible to ordinary people and not subject to training and indoctrination.\n\nChinese linguistic analysis folded naturally into similar language—it concerns ways of using words—dàos (norms) of linguistic behavior focused on word use. The more philosophically inclined schools began to see such norms of the use of words as underlying the explicit disagreements among schools about which norms or dàos to follow and how to follow them.\n\nThe discussion of norms of use are typically couched in behavioral formulations such as 取 qǔchoose, 舉 jǔ pick-out 可 kěassertible:admissible 辯 biàndistinction 指 zhǐpoint and hécombine. The core psychological attitude is 為 wéideem:do which may be expressed as a tendency (in speech, both inner and expressed) to express a 是非 shì-fēithis-not that judgment regarding the use of a word. A phonetically and semantically related tendency is 謂 wèicalling it by the term. Behaviorally, it amounts to dealing with it under that word-concept. Conversely we can shì or fēi the use of a name of some contextual object—wèicall it or wéideem it properly associated with that 名 míngname.\n\nTo 為 wéideem:do can be either to express the category assignment in one’s behavior—either speech-behavior or behaving toward the object as people would be expected to, given that they assigned the object to that category. The behavior for the category would be found in the social or natural dàopath they follow. A 為 wéideem:do state is less a mental picture of a fact (a belief) than a disposition to treat or identify some object as deserving the term in question. Instead of the western reality vs. appearance dialectic, Chinese discussion revolves around the contrast of natural (天 tiānnature:sky) dàos and human (人 rénhuman) or socially constructed, dàos. The human dàos are constructed with the help of 名 míngnames strung together into 言 yánlanguage.\n\nMozi, as we noted above, appealed to what he regarded as a natural utility standard to judge the acceptability of yánlanguage use and Confucius relied more on past usage ranging back to the mythical sage kings. Problems of justifying approvals and disapprovals of word usage led such later Confucians as Mencius, to rely more on cultivating an intuition. Since the account of cultivation typically presupposed practice in conformity with the social practice requiring justification, the threat of circularity pushed traditionalists eventually to teach about and appeal to an allegedly innate or pre-social human psychology.\n\nBy contrast, the craft–inspired Mohists went on to emphasize the use of measurement tools and operations as the standards guiding term use. They argued that such operational standards would be more accessible to ordinary people who could rely only on their “eyes and ears.” The Confucians, by contrast, were forced to flip between appealing to some cultivated authority and attributing an innate moral inclination to the existing conventional language dào to such ordinary people.\n\n是非 Shì-fēithis-not that judgments can concern choice of a dào or the interpretive performances of a chosen dào. Chinese writers similarly focused on 可 kěassertible:permissible which may be said of a dào, or of a permissible walking of some dào—including those of language use. Disagreement could be at the level of dàos, or at the interpretive level—endorsing or rejecting a 為 wéideem:do. The endorsing-rejecting 是非 shì-fēithis-not that and 可 kěpermissible behaviors themselves involve either choosing or interpreting dàos. Each time we make any of these judgments we contribute to further constructing our socially shared dào with its implied practices of 名 míngnames use.\n\nZhuangzi conforms to the general pre-Han model, using a path metaphor to discuss normativity in general. This fuels the traditional view of him as a Daoist. Most of his discussion, moreover, further conforms to the practice of focusing on social dàos—undermining treatment as religious disciple of Laozi’s insistence we follow only 天 tiānnatural dàos. What links him to a naturalist theme is his reluctance to draw the usual contrast between natural and social dàos. (Is it nature? Is it man?). Human social dàos are natural behaviors of natural animals. This grounds Zhuangzi’s pattern of talking about and with other equally natural creatures.\n\nHumans are as natural as monkeys, birds, and fish. “How can dàos be hidden such that there are authentic and artificial?” he asks rhetorically? (Harvard Yenching Zhuangzi Yinde hereafter HY 4/2/24–5) All the different social traditions expand the number and kinds of naturally existing dàos. Other animals’ walking patterns also construct natural dàos which, similarly, become available for human finding, choosing and walking.\n\nZhuangzi’s discussion, particularly in the philosophically most sophisticated second chapter, is mainly about the plurality and relativity of second-level dàos, our naturally endowed, internal dàosways of finding, choosing and following one of many natural ways of life in the maze or network presented by nature. This stance makes the complexity of the natural network only the first level of variety and possibility. Recursion of dàos explodes the complexity. A tripartite recursion follows because there are many dàos of finding, of choosing, and of translating the first level plethora. The many layered complexity of dàos of dàos yields the human sphere of life. “Fish interact in water; humans interact in dàos” (Ibid., HY 18/6/72)\n\nHe naturalizes dàos less by attending to natural physical guiding structures (e.g. dàos of water) than to the variety of human dàos presented by analogy to the variety of creatures with different dàos. Alternately, he encourages us not to assume we have found all the available ways to behave or he reflects on the variety of sources of dàos of choice or of different capacities to catch on and follow within us—our different natural organs and the range of different ways we may train or habituate them. This complexity of dào structures fuels, in turn, both his skepticism of absolutes, of authority, of ideal observers, of social dogmas and his qualified advice to leave the finding, choice and interpretation to a working out from the variety of perspectives that make up the behaving units in the particular circumstance. Dào choices are best made from the perspective of walkers.(Ibid., HY 4/2/33)\n\nThe other distinctive feature of Zhuangzi’s approach lies in the sophistication of his handling the issues of language in explicating this natural complexity of dàos. Graham interpreted a famous Zhuangzi trope (the pipes of 天 tiānnature:sky) as Zhuangzi’s way of positioning language as tiān (natural) sound.\n\nThe pipes of earth, these are the hollows everywhere; the pipes of men, these are rows of tubes. Tell me about the pipes of Heaven.’ Who is it that blows the ten thousand disputing voices, who when of themselves they stop their talk has sealed them, and puffs out of them the opinions that they choose for themselves?’ HY 3/2/4–9\n\nGraham elaborates:\n\nThese are apparently the holes in the heart through which thought courses and the mouths which utter it, so that the breath blown by heaven through the inner formations of different men issues in contradictory utterances. (Graham 1969:149)\n\nZhuangzi’s Daoism, thus, starts by removing tiānconstant nature from its role as ultimate normative authority—the role it played in virtually all the rival accounts of which dào we should follow. All dàos that are practically available at the point of choice for walking (actually existing dàos) are similarly tiān. Tiān (nature) generates dàos as it generates the 物 wùthing-kinds (humans and other animals) that find and follow them. Neither it nor the cosmos can play the role of an authority, far less of an anthropomorphic authority commanding or dictating our choice among the network of naturally existing dàos. Dàos are chosen from those found in nature, but none represents nature’s choice for us—none of the dàos in nature is the dào of nature.\n\nDialectically, Zhuangzi’s replacement for tiān’s role as source of normative guidance would be the entire complex network of dào structures that permeate the natural world. He situates us at indexed points in this network seeking paths forward from here and now, choosing from among the plethora of those accessible which, if any, to follow.\n\nThe philosophical advantage of Zhuangzi’s way of discussing dàos, thus, does not leave him suggesting that what is natural is moral (analogous to implying “ought” from “is”). Nature gives us a complex network of iterative guiding structures among which we are about to swim. In our waking hours, we continue constructing systems of contending, resolving and agreeing on 是非 shì-fēithis-not that judgments—the rejected ones buried in rubble of ongoing construction of normative language marking behavioral paths. (HY 3/2/11–13)\n\nWe recognize greater and lesser models of both—the more reflective and engaging vs. a lazier, more wordy type. As we walk through a day, we encounter attitudinal states—joy, sorrow, surprise, ennui etc. We don’t know what role these play but they seem central to our choosing activity—indeed to our having a perspective, an ‘I’. (HY 3/2/11–14)\n\nWhen we describe that entire structure, e.g. as resembling a natural network of links (dàos) between temporally and spatially indexed points we can see how it might generate talk of a single cosmic dao. All guidance is at a point in the network and available to and for some emergent object—physical, living, animal or human. The inner processes of seeking, choosing, and following dàos from node to node are themselves part of the natural network. We are not sure what the normative point of our natural reactions in walking through the nature’s maze. Each step or utterance adds a 是非 shì-fēithis-not that to the edifice of guiding discourse marking paths for ourselves and for others. It’s as if there is some natural authority guiding the construction process, though we can’t see marks of its authority. We can reliably walk paths or dàos but can't see the shape of the authority. We light on paths and react with heart-mind responses. That’s it. (Ibid., HY 4/2/14–16)\n\nHuman dàos of finding, choosing and following are capacities normally attributed to the 心 xīnheart-mind. Zhuangzi recognizes its involvement in the construction process, but is skeptical of making it a kind of natural authority. It is, after all, only one of the natural organs involved—our daily reactions include being directed by our stomachs, our eyes, etc. Why, Zhuangzi wonders, should we think they need a single authority? (HY 4/2/14–16)\n\nEven, then, if we take the 心 xīnheart-mind as an authority, it’s not clear how it can help us deal with the role of judgments of greater and lesser wisdom and different ways of using 是非 shì-fēithis-not that. Aren’t all the hearts involved in the evolving construction equally natural—the sages and the fools? (HY 4/2/21–22)\n\nAny output from our 心 xīnheart-mind into this construction of a dào to follow from here is itself a product of our having walked one of a range of possible dàos to this point. (HY 4/2/20)\n\n“To get a 是非 shì-fēithis-not that from the 心 xīnheart-mind without it’s having been constructed there is like going to Yue today and arriving yesterday, like getting something from nothing.” Even the wisest of mythical sages (Yao) can’t know how to do that! (Ibid., HY 4/2/22–23)\n\nThere are many natural ways of finding and choosing ways. Humans naturally exhibit variety in how they find or choose a course of behavior. This recursive complex of dàos of choosing is part of nature. No single one need be considered the dào of nature to the exclusion of others. They may be capacities of individuals or of social groups, embodied in their social practices. The gestalt set of past commitments and acquired inclinations to choose and interpret paths is another component of our situation or location in a complex web of dàos. The given dàos of choice are what Zhuangzi treats as 成 chéngconstructed/mature within our body as we traverse the nodes of the network of dàos. Our heart-minds reach an indexed point with a given momentum vector—a speed on an existing trajectory—this is our a point of view or perspective, complete with prior commitments to dàosways of appreciating and selecting among available paths.\n\nThese second-level dàos can also be chosen and walked correctly or incorrectly. Choosing an epistemic dào, in turn, depends on other a practically available dàos for guiding that meta-choice… and so on. Zhuangzi does not view it as a rational or logical construction, but a complicated, multi-layered natural one. He speaks of “eight 德 dévirtuosities” involved in constructing dàos and guiding expressions, starting with the indexical locatives, left and right, then human relations, then mores, divisions (categories?), distinctions (disputes), competition and then strife. (HY 5/2/55–6)\n\nA similar recursion concerns dàos of finding and interpreting dàos. This network of recursive natural guidance structures constitutes the complex network of natural dào. We rely on meta-dàos, practically available links in this network, in choosing and in interpreting practically available ground-level dàos. Humans navigate in a sea of dàos.\n\nThen who or what does the choosing? Zhuangzi’s theory here is similarly detached and natural. He focuses less on the consciousness or subjectivity of some mental substance or cognitive self or agent, but on a grammatical locus of judgment, a 我 wǒI:me within the linguistic dào structure—the grammatical indexical marks a choosing point in the conceptual and space-time structure. Like Hume’s self, without the naturally occurring grab-bag of attitudes, it would not be there to play its choosing role. The 我 wǒI:me is situated in a frame of reference with its own complicated 成 chéngcommitment trajectory in the iterative dàos of choice. The wǒI:me that knows-how is situated in existing commitments embedded in an indexed here-now in the network of ways it will assign to shì-fēithis-not that. Each shì-fēithis-not that it “shoots out” further commits it to a path. (The narrator had introduced the above “pipes of heaven” metaphor to describe a gestalt he describes as having “said farewell to my wǒI:me.”)\n\n“Its eruptions are like a repeating crossbow” expresses how it manages 是非 shì-fēithis-not that judgments. “Its resting on them like an oath or treaty” expresses how it clings to past winners, “its death is like autumn and winter” expresses how it daily declines, a weakening brought about by this (the weight of accumulated commitments?) and it cannot start the process over. “Its rejections are like tightening bonds” puts into language these aging channels. As the xīnheart-mind nears death, nothing can restore its dynamism. (HY 3/2/11–13) Joy, anger, sadness, pleasure, worrying, sighing, resisting, clinging, being drawn to, eschewing, launching, and committing, like music from empty holes, dampness generating mushrooms, these day and night replace each other before us and yet none can know from what they emerge. Let it be! Let it be! They come from where they emerge—without these, there would be no 我 wǒI:me and without a wǒI:me there would be no choosing. (HY 3/2/13–14)\n\nFor Zhuangzi, the issue is not mind or consciousness, but the behavioral inclinations and the normative authority of these roving indexical perspectives scattered within the natural dào network. Their choices of which dàos to walk furthers the construction ( 成 chéngfixing) of our perspective for the next choice.\n\nIt seems as if there is a natural authority, but we cannot find its authoritative source. There is sufficient reliability that this is walkable, but we don’t see it’s [authorizing?] shape—it has natural reality but no visible shape. (HY4/2/15–16)\n\nThe first level paths have a shape, but the dàos of correct choice and performance are inside the performer and not plainly visible.\n\nThe trend from social construction humanism toward naturalism had been gradual. Mozi’s argument for basing such constructions on a natural distinction of benefit and harm was an early step. Graham had separately theorized that Mencius developed both his response to Mozi and his account of the role of 仁 rénhumanity as arguments that Confucian ritual behavior had evolved from tiānnatural intuitive response patterns in the 心 xīnheart-mind. This implicitly endorsed Mozi’s reliance on a tiānnatural ground for the social construction of morality.\n\nGraham’s Zhuangzi then addressed this Mencian response in a passage that extends the Hume-like skepticism about any identifiable “inner self”. That should be what guides the naturally occurring emotive reactions that are necessary for a wǒI:me that chooses. It seems, he says, there must be one, but we find no evidence of it. We approve of behaviors and place our trust in its reactions but find no sign of what is authorizing or making them.\n\nHundreds of parts, nine openings and six viscera included and completed (成 chéngfixed) in place in us, with which should I feel most akin? Should I be pleased with them all? Is there a wǒI:me among them? Among them, should we deem some as rulers and as servants? Are the rulers and servants incapable of governing each other? Are they not capable of taking turns as ruler and servants? Is there a genuine ruler among them? It’s as if trying and failing to grasp its real character has no bearing on whether it is genuine. (Ibid., HY 4/2/16–18)\n\nMozi had worried that it would be circular to appeal to intuitions about the word use in a social dào to authorize that very practice, for example Confucian ritual. Being a product of ritual training. acquired intuitions could not be a sufficiently neutral way of justifying our choosing ritual as our social guide. Nor could one trained practitioner have authority over another in resolving interpretive disputes about how to execute the ritual, e.g., about how to apply the terms found in ritual texts to concrete real-time behaviors. He insisted we need a neutral, non-cultural or natural basis for such meta-choices of social practices of choosing and interpreting practices.\n\nThe narrative history of Classical thought found near the end of the Zhuangzi (Ibid., HY 90/33/1) takes off from this dispute between Confucians and Mohists. It welcomes Mozi’s implicit search for neutrality, universality, and greater objectivity. However, the school viewed the familiar debate between a utilitarian and traditional morality as interminable because Mozi’s dàoguide, like Confucius’s, starts from different standards, different 成 chéngconstructed commitments to linguistic practices. Each relies on their past practice of judging how to use the key moral 名 míngnames. Confucians would reject Mozi’s standards because they led to what Confucians view as the wrong conclusions (e.g., implied Confucians should abandon 義 yì moral rituals such as burial). The Mohists reject burial rituals because they use 義 yì morality of the social mores reformed according to their standard of general utility. The pivotal statement of Zhuangzi’s position is expressed as a riff on the relativity or dependence of 是非 shì-fēithis-not that judgments about language use on natural circumstances, naturally existing past practice, commitments and attitudinal gestalt shifts.\n\nWhere can 道 dàoguides hide such that there are genuine and artificial? Where can 言 yánlanguage hide such that there is 是 非 shì-fēithis-not that. Where can dàos hide such that they do not exist? How can a 言 yánlanguage exist and not be 可 kěassertible? Dàos hide behind small achievements and language hides behind rhetorical flourishes and elaboration. So you have the “this is right-that is wrong” of the Confucians and Mohists. Of what one says “this is right” the other says “that is wrong” and of what they say “that is wrong” says “this is right.” If you want to “wrong” what the other “rights” and “right” what the other ‘wrong’s, nothing matches 明 míngdiscerning. (Ibid., HY4/2/24–7)\n\nThough balanced in judging this impasse, the Zhuangzi’s interesting target is the Mohist aspiration to objectivity. Many stories in the text target the notion that utility is a naturally constant value—particularly the human utility that Mozi champions. Among this series of parables, the most famous, the useless tree, illustrates the relativity of usefulness to Hui Shi. (Ibid., HY 3/1/46–7)\n\nNot only are we implicitly appealing to a dào in choosing to adopt a benefit/harm standard, we are also going to appeal to interpretive dào to judge whether we have followed it correctly or not. Mozi had treated moral disputes as disagreements about how to 辯 biàndistinguish in applying terms like 義 yìmorality and 善 shàngood-at. He had also objected to Confucian reliance on acquired intuition since it made access to such judgments esoteric. He argued that standards governing such evaluative word use should be made by 法 fǎmeasurement standards that are accessible to the “eyes and ears” of ordinary people. His utility standard, Zhuangzi is suggesting, is still relative to the way of translating it to behavior.\n\nOthers in the ethical debate, notably Yang Zhu and related Primitivists, also appealed to tiān (natural constancy) as a normative arbiter. The growing awareness that norms of behavior are intertwined with norms of language use, produced another feature of this strand of thought bringing the natural world into our guidance. Primitivists came to advocate silence—letting the natural paths of the world take over completely.\n\nFor most of history, the Laozi has exemplified this rejection of language. It treated all social 道 dàospaths as implicit rejections of the natural 道 dàopath. Graham has argued that echoes of this line of thinking lay in the background of Mencius’s thought. That concern led him to attempt to substitute natural moral psychology (a natural moral disposition in human 心 xīnheart-mind) for positive social mores.\n\nA paradigm of this anti-language, silence trend (cited in the Zhuangzi’s internal history just before discussing the Laozi group ) was Shen Dao. Shen Dao postulated a “Great Dào” (essentially the actual course of cosmic history from past to future) which “even a clod of earth” will follow. We all will follow Great Dào. We can (and should) therefore abandon knowledge of how to make linguistic distinctions (是非 shì-fēithis-not that judgments) to follow Great Dào. Shen Dao, based on his version of logical determinism (i.e., There being an actual complete history of space-time entails your behavior tomorrow is included) draws an anti-normative, quietist and stoic conclusion.\n\nLater Mohist writings contain several acute critiques of such a trending pro-silence posture. Deeming all 言 yánlanguage as not-可 kěassertible is not 可 kěassertible. The explanation, later Mohists noted, lies in the asserter’s own use of 言 yánlanguage. Rejecting (fēi-ing) all shì-fēi judgments is fēi (wrong, to be rejected). Similarly self-defeating is “teaching not to teach.”\n\nZhuangzi’s “pipes of nature” metaphor signals his departure from these defective Laozi-like or Primitivist anti-language positions. Language is natural and arguments for silence are self-condemning. So the point of Zhuangzi’s own reflections on the absence of natural normative endorsement of our shì-fēithis-not that decisions should not guide us to stop making them. Making them is what we naturally do when we find our dàos in nature. It is natural for us to make a judgment, but not nature making it. Normativity arises from within nature, but nature only makes all its normative, behavior-guiding paths for us naturally available.\n\nThe Zhuangzi emphasizes the plurality of natural stances or points of view from which one may see paths of possible behavior as “natural.” For one of the paths to be available for me will be dependent on where I am and my given trajectory in the network. All the appeals to tiānnature as an authority are right in insisting their dàos are natural, but mistaken in using that as a reason to deny a similar status to the dàos of rival normative thinkers. Tiān cannot serve as an arbiter of which rival norm is correct since it equally “puffs” all of them out. This allows each to claim their choices are of tiānnatural dàos but does not allow them the corollary that their rival’s choices violate tiān. They, like us, conform with tiān’s constancies in being committed to their dàos.\n\nAny shì-fēithis:right judgment concerning a dào may be either a 因 yīndependent shì, based on prior or enacted commitments, gestalts orientations, and inner processes or it may be an arbitrary posited (為 wèido:deem) shì. Dependency arises from past (chéngfixed) commitments to the dào structures through which we worked our way to our here-now. We always encounter such choices as we are already engaged in walking along some dào. Those past dào commitments bring us to a normative stance from which successive judgments of shì-fēi and 可 kěpermissible vs. not kě arise. Zhuangzi’s pivotal illustration pairs 是 shìthis with 彼 bǐthat as near and far indexicals. His use of another indexical here signals his view that 是 shìthis:right used normatively as opposite to 非 fēinot-that:wrong is relative to a commitment index.\n\nLocal justifications for having shì-fēithis-not that or kěassertible are delivered in accordance our chéngfixed commitment momentum along the dàos that guided us to this point. This relativity of normative dependence underpins Zhuangzi’s mildly ironic, skepticism of special or extraordinary normative statuses we give to, e.g., sages. The skepticism must apply even to the quietist posture that shì-fēithis-not that judgments are “bad” or unnatural. We should doubt any transcendent or allegedly perfect, totalistic epistemic access to nature’s inexpressible normative know-how. There are no naturally ideal observers.\n\nWill the eventual result be there is both 是 shìthis:right and 彼 bǐthat? Will the eventual result be there is neither shì nor bǐ? We can call the situation of neither shì nor fēi finding its opposite the “pivot of 道 dàoguides.” The pivot sets the start of the center of a sphere from which there are inexhaustible responses—inexhaustible shì and inexhaustible fēi. Hence the saying “nothing matches 明 míngdiscernment.” (Ibid., HY 4/2/30–31)\n\nThis cautious skepticism undergirds Zhuangzi’s departure from the primitivists’. He neither thinks we should conclude that we must not issue shì-fēi judgments nor that we must reject or deny our natural, situational inclinations to shì-fēi. We should, however, adopt an attitude of epistemic modesty in making our perspective based choices and recommending our interpretations to others. That modesty arises from míngdiscerning that their perspectives, like ours, arise from within a immensely complex and complicated natural dào structure. Epistemic modesty also undergirds Zhuangzi’s openness and willingness to interact with others. If nature has a point of view, it is that one in which all actual dàos of shì-fēi-ing in nature are available as natural guiding structures. Hence nature makes no choice that implies a more absolute, or superior normative status on either perspective. Nature makes them possible candidate guiding dàos for us to choose and walk.\n\nA question implicitly and repeatedly left to the reader is what Zhuangzi means by 明 míngdiscerning. Does it amount to taking the view of nature but of nowhere in particular or is it a naturally occurring, perspective on perspectives, a recognition of the plurality of natural perspectives? He usually recommends to our attention insights gained from realizing that our choice is one among a wide range of naturally available dàos. He provokes us to realize that we may make progress and improve our guiding perspective by simulating the guiding perspectives of others. Some tales, by contrast, warn us not to expect the dàos of others to mesh with our capacities and character—as with the boy from Shouling who goes to learn the Handan way of walking, which “cripples” his original ability. Still a third outcome of the interaction, as with violent gangsters, reminds us simply to keep our distance.\n\nHowever, in the standard cases, we learn from simulating others’ perspectives, choices and interpretations of the natural dào-structures either from projecting or communicating—sharing methods and techniques we did not grasp before (new ways to use gourds or hand-salve or find ways to accommodate and interact while “walking two ways”). New accumulated insights about natural structures may improve our range of options, from our own point of view. Learning can also help us see how to walk in the natural paths together without getting in the other’s way.\n\nIn understanding other’s trajectories along their dàos, we may judge them as correct or incorrect. First, we do this from our own present perspective. We neither judge all to be right nor all to be wrong—nor even that all are equal. Certainly, not all are equally worthy of our choice. We need not judge that all are good choices for those following them—only that the grounds of their choice may be different from ours. They might still be dogmatic, careless, or unwarranted even given the situational grounds of their choice. Nothing about the naturalness of such choices arising makes them right. All this is compatible with recognizing others as natural creatures guided by natural inner processes along natural guiding dàos.\n\nWe neither seek to follow all at once or each equally—as Hui Shi seems to suggest. Nor do we resolve to follow none—as Shen Dao suggests. We do judge that we might gain from being aware of and engaging in open exchanges—as in Zhuangzi’s dialogues. We are more inclined to follow a path, and given our similarities, think we might pursue it with benefit when we know some natural being like us found and followed it. And Zhuangzi clearly does ridicule the social moralists (Confucians and Mohists) as well as Hui Shi for the narrowness of their range of choices—their failure to appreciate the richness and complexity of alternative ways of life.\n\nOur tendency to appreciate and share others’ values, to mirror their behavior cooperatively, together with our awareness of the wide variety of perspectives, many of which we judge to be worthless, mistaken, or dangerous, makes it hard to treat any projected transcendental, comprehensive viewpoint as the single answer. Zhuangzi’s “pivot of dàos,” his “view from nowhere,” is not a final shì-fēi judgment. It is the point prior to any shì-fēi and from which all diverge. Each commitment propels us down a different path at a chéngfixed momentum. We rely on chéngfixed commitments to prior shì-fēi in all shì-fēi judgment. All shì-fēi are indexed within the network. The judgment from no-where-when is no-judgment.\n\nWe learn from openness and exchange because we acquire commitments from simulating others’ path following behavior. That we progress in such exchanges is something we ourselves judge, not the cosmos. No judgment comes from some point outside of or everywhere in the network of dàos. We are naturally influenced by others’ evaluations, their judgments of our choices and their behavioral virtuosity—especially when the others are our parents, perceived superiors and respected models. These, again, are the 因 yīndependencies on which present judgments depend.\n\nThis gives Zhuangzi’s indexical relativism a different contour from Hui Shi’s. The latter structures his analysis mainly on comparatives. This leads him to a version of normative ‘error theory’ –the conclusion that we should abandon normative semantic distinctions as all wrong. Since the 辯 biàndistinctions on which they are based are relative, they are unreal. Ergo, there are no real distinctions and the world is actually one. Any distinction making judgment, any shì-fēithis-not that, unnaturally divides what is naturally one. Hui Shih’s Tenth Thesis is:\n\nFlood concern on all the 10,000 thing-kinds; The cosmos is one 體 tíunit. (HY 93/33/74)\n\nGraham, relying on his hypothesis that Zhuangzi frequently considers positions which he later rejects, had already targeted the stereotype view of Zhuangzi as agreeing with Hui Shi’s monism. Graham’s translation reveals the reductio that puts monism in a “considered and rejected” category. It amounts to the self-rebutting anti-language stance targeted by the Later Mohists—the error Zhuangzi’s naturalism of all perspectives (the “pipes of heaven”) was intended to avoid.\n\n“[H]eaven and earth were born together with me and the myriad things and I are one.” Now that we are one, can I still say anything? Now that I have called us one, did I succeed in not saying something? One and the saying make two, two and one make three. Proceeding from here even an expert calculator cannot get to the end of it, much less a plain man. (HY5/2/52–54)\n\nZhuangzi’s relativism expresses choice, commitment, and interpretive performance on analogy to natural processes involved in following a path. Commitment is setting off along a path. We have momentum and a trajectory. The shape of the path combines with these and commits us to walk on or continue in a way that depends on the discernible shape of the path. Walking a path involves staying mostly within its physical boundaries.\n\nThis account allows us to capture the flavor of Zhuangzi’s discussion which does not employ the familiar Western sentence-based metaphors of laws, rules, principles with norms of obedience, belief or propositional desire. Using the Western idiom, along with the associated practical syllogism of belief-desire explanation would give Zhuangzi the basis for a distinction between a cause and a reason—a distinction he seems not to draw in his talk of 因 yīndependence. There is a kind of inference from dàos of choice, interpretation etc. of a path and an internal feedback dào (our 德 dé virtuosity at) “reading” external paths to guide behavior.\n\nZhuangzi would not make that point in terms of deduction from a normative premise or principle. The internal and external paths themselves have a causal and normative relation to our walking behavior. A more sentential focus would similarly mean describing the outcome as an action rather than an extended course of walking/following behavior. A sentence would state the action or the intent—rather like the conclusion of a practical syllogism rather than, as as fits in this metaphorical space, as performing a role in a play or or part in a symphony.\n\nZhuangzi’s use of the path metaphor did extend to the understanding of language but, again, not with a focus on sententials. Rather than constructing dàos in sentential form, Zhuangzi construes language in dào form. The focus of ancient Chinese theory was on names on the analogy of path markers: “go past the tree, turn right and then down to the water.” Names take on importance as sign-posts along physical structures. Confucian social versions emphasized the names of social roles and statuses more than of natural kinds. Primitivist opposition to social dàos led them into the sweeping anti-naming postures that Later Mohists showed to be self-condemning.\n\nGraham’s interpretation of Zhuangzi’s pipes of nature gave him a way to evade this anti-language abyss. Human language is a natural sound. Hui Shi’s using relativist premises about names to derive an absolutist monism which threatened to collapse to the primitivist anti-distinction, anti-naming quietism. Making everything one is equivalent to denying 辯 biàndistinctions thereby denying any real basis for the shì-fēithis way-not that statuses implicit in all 名 míngnames and yánwords:language.\n\nZhuangzi’s naturalism is anti-dogmatic, it neither denies nor asserts any particular set of distinctions as authentic. Distinctions arise from indexed here-now points in the actual network of dào perspectives—by travelers on a trajectory along one of the dàos choosing 是非 shì-fēi this-not that from among multiple possible courses of behavior afforded by the cosmos. The cosmos does not select which way to make the choice.\n\nZhuangzi’s analogy of language and wind, however, had its own problems. Graham had noted that Zhuangzi returns to the metaphor nearer the middle of the dialogue, noting that here Zhuangzi seems to be taking back some of its implications. Having disposed of Mencius’s appeal to intuition and Hui Shi’s attempt to make everything normatively equal, he here addresses a more challenging position. The Later Mohists advocated a version of pragmatic-semantic realism. The Later Mohists had also argued that when a 辯 biàndistinction was formulated as a shì-fēi, e.g., one of the disputants calls it “ox” and the other “not-ox”, one of them must 勝 shèngwin i.e., 當 dānghit on it.\n\nThe Later Mohists’ version of common-sense realism incorporated social conventions. Conventions set out what 物 wùnatural-kind each term “selects out” or biàndistinguishes from the rest. We then extend that distinction to pick out new objects based on their objective similarity or difference (those accessible to “eyes and ears” of ordinary people). This is the basis of a social standard of correct word use enshrined in past practice.\n\nHui Shi, however, had undermined that simple version of realism with his observation that between any two 物 wùnatural-kinds we can find some similarity and some difference. The world, in effect, gives us many ways of establishing conventional distinctions and assigning names. The Later Mohists had failed to find an adequate account of what similarities would and would not lead to what they called 狂舉 kuāngjǔwild picking out . Zhuangzi’s analogy of language to the noises made by wind had seemed to echo Hui Shi’s normlessness about language. In this later passage, however, he revisits the wind analogy, and retreats, accepting the Mohist insight that language is more than a “natural sound.”\n\nLanguage is not blowing; those who use language, have language. (Graham translates: “Saying is not blowing breath, saying says something.) That which it languages is decidedly not yet fixed. Is the eventual result that they have (there is) language? Or there has never been language? Deeming it as different from bird calls: does that mark a distinction? Or is there no distinction?” (HY4/2/23–4) (This passage is followed by the passage cited in the “Intuition” sub-section above)\n\nThis frustrating vagueness and signature indecision in the text leaves interpreters to philosophize about what Zhuangzi’s implicit answer (明 míngdiscern:clear) might be. However, the analogy with bird calls is a fortuitous suggestion. We arrange, adapt and modulate the elements of our language to fit our environment, abilities, and opportunities (e.g., mating). Would Zhuangzi have guessed the same about birds?\n\nThe claim following that concurs that the “aboutness” of a language exists but aboutness is not fixed. This can be explicated with the above discussion of the indexicals 是 shìthis:right and 彼 bǐthat. Zhuangzi carries the diectic character over to his treatment of the ubiquitous shì-fēithis-not that that undergird the norms guiding how to use names (words). We endorse and recommend (shì this:right) our guiding terms, language and linked behavior. We may base that on our correctly following prior commitments to dàos of word use—relying on a Confucian traditional standard, the past and existing practices of our linguistic community.\n\nIn one passage, Zhuangzi allows this appeal to past or existing common practice but does not endorse it as right—merely as useful. Conventions are useful because they facilitate communication. He he adds a tone of “that is all” hinting we need not regard them as plausible candidates for being absolutely right—a single transcendent standard of use.\n\nOnly those who “break through” know how to communicate with it as a “one.” Because of this, we don’t use that strategy and instead locate things in the conventional realm. The conventional is useful; the useful, communicable, and the communicable achievable. If you hit on the achievable, you are almost there and dependent shìs end. (Ibid., HY 4/2/36–37)\n\nZhuangzi describes our past shìs of this kind as “like an oath or treaty.” (Ibid., HY 3/2/11) They have “enactment force” committing us to a dào governing their later use. We may conform to (correctly follow) and further construct our transmitted linguistic dào in expressing or performing (為 wéideeming) other things as shì-fēi. Our trajectory along our paths incorporates these accumulated commitments to prior practices of language use. As our dàos now bring us to new situations, how do we know to project the correct indexed choice from the prior history of differently-indexed behavior? That actual language behavior commits us to a linguistic dào-type, but it’s not clear what the commitment entails at this choice point. The Mohists and Confucians are both claiming, from their different directional perspectives, to be following similar commitments to existing dàos of practice.\n\nMozi’s recommending naturally or empirically available dàos for reforming shared linguistic practice was itself, Mozi thought, following existing natural practice. He even noticed that our ongoing linguistic practice rejects treating something’s merely being a shared past practice as automatically making it right. Our existing evaluation practices remind us that shared and unquestioned past practices can be wrong.\n\nMozi appealed to what he would also have regarded as a purely natural practice. Practical efficiency (lì benefit) is a standard accessible to all ordinary people’s “eyes and ears.” Each time we apply some natural, empirically guided interpretation in practice, we participate in shaping evolving normative practices (both linguistic and behavioral practices). Each such decision commits us and others to a dào of interpreting our social dào. We understand our commitment to that dào as a commitment to practice and transmit it correctly—where the standard of ‘correct’ is itself either enshrined in a past practice or in natural utility. This is the basis for Zhuangzi’s claim that social dàos, including linguistic dàos, are natural dàos—and there are many of them. Further, as the Laozi would later famously observe, dàos can be interpretively guided. They are changeable dàos.\n\nHumans, in finding ways to walk and walking them, initiate the construction of social paths, naturally and perhaps unintentionally, by leaving prints in the natural world. Zhuangzi links the path metaphor to a society’s linguistic practice thus:\n\nThat which we treat as 可 kěassertible is 可 kěassertible; that which we treat as not assertible is not assertible. Dàos are made by walking them; thing-kinds are made 然 ránso so by being called ‘so’. (Ibid., HY 4/2/33)\n\nThis sense of the immense complexity and the fluid nature of normative commitments to a dàopath underlie Zhuangzi’s skeptical themes. 明 Míngclear:discerning seems linked to the gestalt in which we accept ourselves as embedded, along with others similarly situated, in nature’s endlessly complex evolution of guiding structures. How do we know either that our past practice was correct or that we are correctly following them in this new situation, here and now, based solely on our eyes and ears?\n\nZhuangzi’s stance toward Mohist formal realism (if we disagree on a shì-fēi, one party must 勝 shèngwin) becomes clearer now. The Mohists did not specify any objective mechanism of “winning” beyond some vague suggestion of tipping a balance. However Zhuangzi’s point in response appears to track the warning function of a norm of truth (even when justified by our best available judging standards, we may still be wrong). Zhuangzi takes shèngwinning as a vague primitive in arguing that we cannot finally settle skeptical doubts by appeal to winning disputes. The main mechanism Zhuangzi discusses is appeal to a judge or authority. We appreciate that all judges will also use terms like shì-fēithis-not that indexed by their acquired commitment momentum. Their judgments, like ours, express their momentum along a dào of using these words here, now and projecting the usage to that, there, then.\n\nGiven that you and I have been brought to 辯 biàndispute and you win me over and I don’t win you over, in such a case is your distinction substantively 是 Shìthis:right? Mine substantively 非 fēi? If I win you over and you don’t win me over; is mine substantively right? And yours?; substantively wrong? Are they partly right and partly wrong? Or jointly right and jointly wrong? You and I cannot know between ourselves, so another human inherently inherits our obscurity and doubt. To whom can we go to correct us? Employing someone who agrees with you, given that they are like you, how can they correct the situation? Employing someone who agrees with me, given that they are like me, how can they correct it? Employ someone different from both me and you to correct it, given that they are different from us both, how can they correct it? Employ someone who is like both of us to correct it, given that they are like us both, how can they correct it? So you and I and others cannot know, and in these condition on what other can we rely? The changing sounds’ mutual dependence is like their conjoint autonomy. Harmonize them with glances at nature and make them dependent on eventual consensus and with that exhaust the years. (Ibid., HY 7/2/84–92)\n\nIt is not clear if the conclusion is supposed to be a solution to the skeptical problem posed or merely a way to cope constructively with complexity and uncertainty. The passage rules out any appeal to a special authority of any other point of view—while giving equal authority in the construction to all. Even where we all share some “conventional wisdom” it does not have special authority—say over other creatures. This, was implicit in Mozi’s rejection of socially agreed dàos. Zhuangzi’s notorious toying with the perspectives of animals expanded it (for naturalists). .\n\nGap-tooth asked Kingsley, “Do you know that which all natural kinds agree in shìendorse-ing?”\n\nHe answers “How would I know that?”\n\n“Then, do you know of what you don’t know?”\n\n“And how could I know that?”\n\n“So, does no natural kind know anything?”\n\n“And how would I know that? Nonetheless, let me try to put it in language. How would I know that what I call ‘knowing’ is not not-knowing? And what I call ‘not-knowing’, is knowing.” And let me try a question on you. If people sleep in the damp, they get pains and paralysis; would eels? If in a tree, they tremble in fear; would monkeys? Of the three, does any know the correct place to live? … From where I see it, the origins of goodness and morality, painting things as ‘this/right’ or ‘not-that/wrong’ are, as boundaries, both confused and complicated; how could I know how to distinguish them? (Ibid., HY 6/2/64–70)\n\nThis passage reinforces the conclusion that norms of correct word use is Zhuangzi’s core skeptical target. So we may indeed know how to act, according to some norms of using ‘know how’ and not if judged by some other dào of correct usage of the knowing/ignorant distinction. Linguistic skepticism easily metastasizes to virtually any commitment. According to which dào of projecting past practice should we judge this linguistic behavior as conforming to our commitment or not. Normative skepticism, in a use-theory is hard to contain—especially when the model of all judgments is as some indexed 是 非 shì-fēithis-not that assignment. It sweeps in metaphysics, epistemics, and semantics.\n\nA consequence is that Zhuangzi’s skepticism is broad but weak. Broad because it infects so many judgments, but weak not merely in the usual sense of denying absolute certainty, but in failing to imply that we should stop or refuse to make the judgment. It does not rest on any theory of the probability of an error, but that the concept of an error is subject to the same concerns as the original judgment. It neither undermines nor give us reason to withdraw our judgments. Appreciating that others reach their views as naturally as we do only removes our status to claim that our judgment is authentically and uniquely correct.\n\nTemporally, Zhuangzi’s skepticism is buttressed by reminding us of our own past experiences of learning, of acquiring new gestalts, of realizing that what we had considered the way, was subject to reconsideration and improvement. The skepticism does not target any specific failure in my epistemic process. It does not advise me to abandon my present course. It reminds me only to remain open to the further possibility of learning more—about what? About the world? We can do that by learning more about other natural ways of processing and how they work in the world—other dàos.\n\nIt counts as skepticism because it reminds us that we normally err on the side of overestimating than underestimating our epistemic security. We think we know and do not more often than we think we don’t know and we do. And that is because we underestimate the range of possible alternative dàos. Hence the pragmatic upshot of his skepticism is to remind us to engage with more other points of view.\n\nZhuangzi’s skepticism is weak because it acknowledges that we may apply different concepts of ‘knowing’ in different situations. Implicitly, it does not deny that we could meet some particular standard of knowing, but that we could know for every situation which standard is the right one. What standard is the right one to use for acknowledging or denying someone knows well enough to satisfy, for example, the correct dào of assertion?\n\nThis feature of Zhuangzi’s skepticism lies at the heart of the famous debate between Zhuangzi and Hui Shi about the fish-pleasure in which Zhuangzi defends a claim to know against Hui Shi’s challenge. Zhuangzi makes an assertion and Hui Shi initiates the skeptical challenge. His challenge implies that there is a favored or correct standard of knowing that turns out to be impossibly strict. All knowledge must come from inside. It’s impossibly strict because it doesn’t allow Hui Shi to issue the challenge in this conversation.\n\nZhuangzi and Hui Shi wandered over the Hao River bridge. Zhuangzi said, “those mini-fish coming from there and cruising around, relaxed and unhurried, are fish at leisure.” Hui Shi said “You are not a fish; from whence do you know the leisure of fish?” Zhuangzi retorted, “You are not me, from what perspective do you know my not knowing fish at leisure?” Hui Shi responds, “I’m not you, of course I don’t know about you; You are not a fish and that’s enough to count as you’re not knowing fish’s leisure.” Zhuangzi concludes, “Let’s return to where we started. When you said ‘from what perspective do you know fish at leisure’, you clearly knew my knowing it as you asked me. I knew it here above the Hao.” (Ibid., HY 45/17/87–91)\n\nGraham drew our attention to the role of perspective in this passage, noting that Hui Shi’s challenge to Zhuangzi’s assertion does not use the normal question form, (何 héhow do you know?) but a locative question word (安 ānwhence?). This brings the debate into alignment with Zhuangzi’s concern about the various perspectives from which to deploy a dào of word use. Here, as above, the word is 知 zhīknow. The norm of asserting, as in English, involves answering the challenge “how do you know?” What normative conditions allow me, here and now, correctly to use the term zhīknow—hence to make the assertion about these fish below me? Hui Shi both knew Zhuangzi was relying on a dào of using ‘know’ “from zhuangzi‘s here” and Hui Shi knew Zhuangzi’s situation from his own relevantly similar “here-now” and relying on the same 道 dàonorm of claiming to know from a distinct perspective. Hui Shi cannot consistently insist that a speaker can only use 知 zhīknow when he occupies the perspective of the thing known.\n\nNotice, the argument about the fish implies we have a perspective on the perspectives of others. So skepticism grounded in dependence or relativity of perspective need not be predominantly negative. Zhuangzi, here, uses it to justify a way of claiming to knowing. In many other parables, he addresses the kind of knowing that comes with a gestalt shift, especially when we see our own and others’ points of view as similar—see ourselves as others see us. This is the more comprehensive perspective Zhuangzi urges on us. We experience such gestalt shifts especially when we come appreciate we had been wrong before and now view things differently. We are confident from our own “now” that we have made epistemic progress—our new awareness seems “relatively” improved to us now. We reach a state where we judge our former perspective to be inferior to our present one. It includes insight into our relative situations. Evidently, this awareness of one’s own perspective as one of many, equally natural points of view motivates us to wonder if we have made the final correction. This enhanced awareness of ourselves as one of many perspectives is an intelligible candidate reading of Zhuangzi’s 明 míngclarity. It is harder to construct a coherent narrative for mystical and/or dogmatic readings—those that jump from an improved perspective to a perfect one.\n\nThis kind of gestalt shift leads us to reflect on how narrow our past perspective had been. It features prominently in the “Autumn Floods” Chapter 17. The Earl of the Yellow River, having thought himself as the ultimate, discovers the North Sea and announces his former error and newfound awareness of his lesser significance in “the greater path.” The North Sea Overlord tells him that he too sees himself as situated in a modest status in a still greater scheme and rejects the River Earl’s attempts to identify the North Sea’s as ultimate. He casts doubt on there being a final, ultimately small or large.\n\nThe lord of He river said, “So can I consider cosmos ‘large’ and the tip of a hair as ‘small’?” North Sea Ruo replied, “No! Thing kinds have unlimited measurement (ways of measuring); Time has no end; distinctions have no constancy, beginning and ending no inherent cause. Because of this great knowing is viewed within a range of distant and close. …We calculate that what humans know is never as great as what they do not know, their temporal extent of life is not as great as not as much as the time before life, and from the very small to try to take in the scope of the very large, is an invitation to confusion and disorder and not that from which we can gain. (Ibid., HY 42/17/14–20)\n\nCan we describe Zhuangzi’s míng as “having a sense of our limited perspective?” Credulous, dogmatic and imperious absolutists do not appreciate themselves as being in one of a variety of natural perspectives. Broad open-mindedness and mild skepticism come together in the míngclarity Zhuangzi encourages in us. It has a dual nature—an epistemically modest perspective on ourselves that arises from improving our epistemic status and encourages us to continue. It helps us appreciate that we are still as naturally situated and others with whom we may disagree and still grow. Further improvement can come from further exchange of perspectives.\n\nThe naïve Confucian-Mohist advocates of imposing a single social dào thus disrupt the natural process by which social dàos evolve in real time as we seek a harmony guided by “glances at nature.” Seeing things from another’s perspective both alerts us to how we could be wrong and makes us feel that we now understand things better than with our former, narrower perspective. Yet, the Zhuangzi repeatedly reminds us not to abandon epistemic modesty when we make epistemic progress. That we now see things from a perspective in common with another does not make us both right. Yet, the more comprehensive our perspective, the “clearer” the new gestalt should seem.\n\nThe search for this kind of perspective on ourselves and others seems to motivate Zhuangzi’s willingness to engage and interact with others, seeking to understand their perspective as having a natural status and role for them as ours does for us. This is partly illustrated by common sense examples of our judging from our own current perspective that theirs “adds something” enriching our own perspective by our own lights. Sometimes it’s dangerous to try to mix others’ perspectives with your own.\n\nAnd have you alone not heard tell of those from Shou-ling who studied walking with those in Handan? They never mastered the country’s skill and lost their original way of walking, and stumbled and crawled back. (Ibid., HY45/17/79–80)\n\nAside from its frequent usefulness from our point of view, the main benefit from the self-recognition as a natural creature embedded as are others at a perspective-point within a natural network structure is to encourage being open-minded. Part of the value is the humbling of our epistemic pride, mildly disrupting our judgment equilibrium. Without such an occasional perspective on ourselves, we too easily fall into exaggerating our epistemic exceptionalism. The reminder that we are intermingled with others in a web of natural perspectives gives us an appropriate, realistic correction. A Zhuangzi story illustrates such a moment.\n\nZhuangzi was wandering in Diaoling fields when he glimpsed a weird magpie-like-thing flying in from the south. It had a wingspan of over seven-feet and passed so close his forehead, he could feel it. Then it gathered its wings and settled in a chestnut grove. Zhuangzi thought “what bird is that? Massive wings of such power and eyes so large it couldn’t see me.” He hiked up his robe and hurriedly tiptoed closer holding his cross-bow at the ready. Then he spotted a cicada settling in the shaded shelter without a worry for itself, but a preying mantis opened its pincers about to grab it, also focused on its gain and ignoring its own bodily danger. The strange magpie burst out and harvested them both—similarly unaware of the natural dangers he faced. But Zhuangzi was suddenly seized with this thought, “We natural kinds are all interconnected! We two different species are mutually seeing things in our own ways.” He dismantled his crossbow and fled, himself now himself pursued by the game warden shouting out his crimes. (Ibid., HY 54/20/61–5)\n\nOverall, Zhuangzi clearly recommends open-minded flexibility as when he scolds Hui Shi for being tied to conventional thinking about how to use giant gourds. He illustrates it again with his story about different uses of a salve that prevents chapping. He models such openness in his conversations with cripples (righteously shunned by Confucians), freaks, thieves, strange creatures, the wind, a shadow and a skull. He imagines many other conversations illustrating the differences of perspectives, capacities and needs.\n\nWhile we cannot help making our own judgments and commitments, he seems to see tolerance and accommodation as values that follow from appreciating other natural perspectives:\n\nA monkey keeper says (to the monkeys) “I’ll give you three [rations] in the morning and four in the evening.” The monkeys seemed angry. “Ok, I’ll give you four in the morning and three in the evening.” The monkeys were happy. So with no substantive loss, he could change their anger to happiness. This is an example of a shì judgment being dependent on circumstances. So the sage uses shì-fēithis-not that judgments to harmonize and rests in the natural balance. And we can call this walking as pairs. (Ibid., HY 5/2/38–40)\n\nWe are, as it happens, capable of understanding the perspectives of others well enough to accommodate and cooperate with them, to borrow insights and to reach agreements. However, the Zhuangzi seems skeptical that we can extrapolate from this ordinary capacity to broaden our perspective to having some absolute or comprehensive insight—as it were from all points of view. Nor, as we saw above, can we assume that because the two disputants come to a resolution or agreement, it constitutes knowing from a cosmically or absolutely higher perspective. Hui Shi’s relativism, recall, does point to such an infinite expansion ending in a single universal point of view. Here, however, we are reminded that while we experience a gestalt broadening of perspective as revealing something real and significant (like waking from a dream), we cannot extrapolate from that to the claim to be able to know the final result of such gestalt leaps to broader perspectives.\n\nEven though North Sea Lord denies there is any final or ultimately broad perspective from which we can make shì-fēithis-not that judgments, the parable suggests a progressive path toward broader perspectives with those further along having the epistemic status to guide those with less comprehensive perspectives. However, arguments in Chapter 2 suggest that progress must always be judged from a moving frame of reference along a dào that is already chéngfixed in our xīnheart-mind that shoots-out the shì-fēi.\n\nOur location and trajectory makes us receptive to some and not other avenues of learning. The boy was unable to master the Handan way of walking because of the way he had already learned to walk. The monkey keeper could accommodate the monkeys, but still disagreed with them about the importance of the breakfast-dinner choice. That someone understands and agrees with both of us does not make his judgment correct. The final skepticism concerns whether these paths of progress of perspectives must or will converge on a single outcome.\n\nThe epistemic modesty implicit in Zhuangzi’s skepticism targets mainly the paternalistic, superior attitude toward other points of view exemplified by Confucian and Mohist moralistic posture. When we have an accommodation (you and I come to a common agreement) you and I may both rate it as progress. However, it does not imply we have moved to a higher state of overall insight along an absolute scale—or from any arbitrary third point of view. Exchange of points of view can be valuable to each (perhaps in different ways) and broadening perspective in this way can make us wiser—but always as judged from our already operative 成 chéngfixed dàos . We can advise and recommend our normative perspective on others, but their being able to appreciate and use it depends on their capacities, options and situation.\n\nAt this point, Zhuangzi starts to draw an analogy of dreaming and waking up to the shift in gestalt that comes when we leap to a more comprehensive perspective. At awakening, we immediately appreciate the unreality of the dream, yet within the dream, we can have a similar gestalt shift and dream of having dreamed and interpreted that deeper dream.\n\nHow do I know that loving life is not a form of ignorance? How do I know disliking death is not a weak farewell of the sort when we don’t know about the return? Miss Li Zhi cries when she is betrothed to someone’s son, and when she first goes off to the Jin state soaks her clothing with her tears; but then she arrives at the kings abode, sleeps with the king in his bed, eats fattened livestock and then starts to regret her tears. How do I know the dead do not regret their former clinging to life, We dream of eating and drinking and on awaking cry bitterly, we dream of weeping and wailing and awake in a good mood to go off hunting. When we dream, we don’t know it as a dream, and in our dreams, judge something else as a dream. On awakening, we know it was a dream, and there could be another greater awakening in which we know a greater dream, and under these the conditions the ignorant think they are as enlightened as if they had learned it by an investigation. Gentlemen to shepherds inherently do this! (Ibid., HY 6/2/78–83)\n\nSo, is there an ultimate or final possible such shift in gestalt—some final state of knowing what to do? Zhuangzi’s relativism is mildly skeptical because he cannot know either that there is not nor that there is a final or ultimate “awakening”\n\nThe dream theme is memorably carried over to the story of Zhuangzi dreaming a butterfly and/or vice versa. It seems to suggest that the gestalt sense of liberation from error may even be reciprocal. Perhaps our subsequent perspective is one from which most would move to our former perspective. Adolescent conversion can be to or from a religion.\n\nOnce before, Zhuangzi dreamt of being a butterfly, gaily butterflying and himself embodied in this sense of purpose! He knew nothing of Zhuangzi. Suddenly awakening, he then is rooted in Zhuangzi. He doesn’t know if Zhuangzi dreamt being a butterfly or a butterfly is dreaming being Zhuangzi—though there must be a difference. This is called “things change.” (Ibid., HY7/2/94)\n\nElaborating the complexity this way makes Zhuangzi’s proposals seem disappointing as solutions. They amount to mildly suggesting that we allow the exchange of views to go on without the domination of any dogma and with some vague “glances at natural constancies” and see what comes out “in the long run.”\n\nZhuangzi’s conception of dàos in nature, from a here-now to a there-then, differs from a Mohist (broadly utilitarian) naturalism. Utilitarianism is a natural constraint, an allegedly single naturally correct way for all of us to choose our course. In effect, Zhuangzi is more of a natural pluralist, with the natural outcome of morality the product of ongoing individual and social construction.\n\nDàos are in nature but not choices of nature for us. So the discussion, competition, and even strife between dàos and their advocates are factors in an ongoing natural 道 dàoguiding process. We and our circumstances change as we each find, choose and walk different naturally evolving paths.\n\nThis does not entail we should not advocate our own way. Such exchanges are part of the natural process of construction of 道 dàospaths and making them available to others. Such a dialogue of competing dàos constitutes the natural evolutional dào of guidance. Realizing this, we should not flatter ourselves, posing as the Confucian father shaping his child’s character, but as a contributor in this competition among similarly natural ways. We express perspectives located in a real world of indexed points from which we choose behavioral paths.\n\nSome characters in Zhuangzi’s dialogues wonder about exceptional figures who allegedly have abilities that justify that paternal posture—the capacity to transcend our location in points of view and to lecture all of us from a privileged perspective. The Zhuangzi’s response typically remind them that such idealized points of view are neither intelligible to us nor relevant to what we should do. Either these exceptional observers have their own naturally chéngfixed frames of reference in the natural world, or they are outside of the natural world in some unrealistically free realm. If the latter, then their views are both unintelligible and irrelevant to us. What they would do in our situation does not constitute helpful advice to us. To advocate following the advice of these ideal observers is to speak practical nonsense to non-ideal, actual actors.\n\nGap Tooth, following Kingsley’s skeptical formulation above says:\n\nSo you don’t know what is beneficial or harmful, does the “fully arrived human” necessarily not know them? Kingsley replied, “the fully arrived person becomes pure sapience, he could be in a blazing forest and not be able to feel any heat, the rivers of our civilization could freeze and he couldn’t feel any chill, devastating lighting could pulverize mountains and the wind raise a tidal wave and he could not experience surprise. Someone like that could ride on clouds and air, straddle the sun and moon, and wander beyond the four oceans. Death and life are not different for him, much less the inclinations of benefit and harm.” Master Ju Que asked master Zhang Wu, “I’ve heard from my teacher that a sagely man does not find social dealings worth engaging, doesn’t pursue utility, doesn’t avoid harm, doesn’t take delight in striving, doesn’t follow dàos, in silence says things, and in saying things is silent, and roams outside the nitty-gritty of the actual world. Master regarded this as romantic fantasy but I deem it the execution of a mysterious dào. My kind sir what do you say of this?” Zhang Wu replied, “This is something that, were the yellow emperor to hear, it would be like buzzing, and so how could the likes of Confucius come to know it? Furthermore, you have jumped to conclusions… . I’ll give you some absurd talk and you absurdly listen.” (Ibid., HY 6/2/71–7)\n\nHowever, in later chapters, Zhuangzi himself seems to recommend to us examples of such spectacular capacities—the most beautifully and elaborately expressed of which is the passage celebrating Butcher Ding.\n\nButcher Ding carved an ox for Lord Wen Hui; his point of contact, the way he inclined his torso, his foot position, the angle of his knee … gliding, flowing! The knife sang “whuaa” with nothing out of tune. It was as if he were dancing the Faun Ballet or directing an opera. Lord Wen Hui exclaimed “Ole! Splendidly done! Can talent extend even to this?. Butcher Ding gestured with his knife, explaining, “What your servant pursues is dào; which is what skill aims at. When I began to carve oxen, what I saw was nothing but the oxen. After three years, I had ceased seeing them as wholes, and now my sapience mingles so that I don’t see with my eyes, Sensory know-how ends and my sapient desires take over my performance. I rely on natural guiding structures, separate out the great chunks and steer through empty gaps depending on the anatomy. I evade places where cords and filaments intertwine, much less the large bones. A good cook gets a new knife every year; he chops! Mediocre cooks change knives monthly; they hack. My knife now has 19 years on it; it’s carved several thousand oxen and the edge is as if I had just taken it from the sharpener. Those joints have gaps, and the knife’s edge no thickness, to put something infinitesimally thin in an empty space?! Effortless! It even allows the edge wander in with ample room to play. That is why, with 19 years on it, this knife’s edge is grindstone fresh.” (Ibid., 7/3/2–8)\n\nThe Zhuangzi plays several variations on this theme. Sometimes the virtuoso performer catches cicadas on a sticky rod, another crafts chariot wheels, there are musicians, debaters, and thieves. The theme extends to animals, millipedes with their expertise in coordinating their limbs while maintaining a smooth flow, snakes flashing by while slithering on their stomachs, One implicit example is Zhuangzi’s own relation with his relativist rival and buddy, Hui Shi. Bemoaning his loss while visiting his sidekick’s grave, Zhuangzi spins a tale of a virtuoso ax-thrower who sliced specks off the nose of his crony, but lost his “knack” when his co-performer passed away. (Ibid., HY 66/24/48–51)\n\nThe tales often highlight the tranquil state that accompanies behavior that skillfully follows a natural path. The performances look and feel effortless. The spontaneity of the flow along a natural path gives performers the sense that their behavior is “world-guided” rather than internally controlled. These behaviors become second-nature. We move beyond anything like sub-vocalizing instructions, deliberating or reflecting—and yet we are concentrating intently on the behavior. The range of his examples reminds us that such satisfying states of performance can be experienced in even the most low caste and mundane of activities, including butchering, criminal skills, as well as in the finest of arts, "}, {"url": "https://daydaynews.cc/en/history/100509.html", "page_content": "On the Five Hegemonies of the Spring and Autumn Period, why did the originally dominant Chu State not inherit the hegemony of Qi State in the Battle of Pu, why did the wealthy Chu\n\nOn the Spring and Autumn Five Hegemonies, why did the dominant Chu State not inherit the hegemony of Qi State\n\nIn the eight hundred years of the Zhou Dynasty, the west and the east were divided into two parts, the west and the east for a week.\n\nThe previous week was mighty and domineering, and the next week was weak and weak. Except for the good-sounding world leader, the Central Plains has no real power, but there are dispensable mascots.\n\n(Zhou Dynasty map)\n\nAnd this turning point was the eastward migration of Zhou Ping.\n\nZhou Ping Wang is undoubtedly a tragic character. He inherits the position of his father Zhou You Wang. When he sits on it, he is a hot chair. The reason why this chair is so hot is that besides his father’s disagreement, it also matches Related to national strength.\n\nZhou Youwang’s unwillingness is well known to all. When the beacon show princes, we know the mischief of a boring emperor.\n\nActually, this is a fake history.\n\nZhou Youwang does love praise, but the story of the beacon playing with the lords is really fictional, but later generations of literati used to lay the blame on women in order to cover up the emperor's morality.\n\nTake history as a mirror. There are countless things like this. Meixi, Su Daji and the like are all seniors, and Yang Guifei and Chen Yuanyuan are all juniors.\n\n(Beauty and beauty are all in trouble)\n\nOlder and younger women carry a pot, this country turmoil is a woman’s business, and the beauties are also sad.\n\nBut so sad, what should be chaos or chaos in this world.\n\nhas experienced a beacon fire in Lishan. This week, after the Inu Rong attack and the heir's melee, it was a fact that he was sluggish. The subsequent King Zhou Ping who appeared on the stage was just following the King Qin's Shen, Lu, Xu, etc. Under the support of the princes, the new king is only.\n\nAlthough the new king Zhouping is still king, he still has the hat of the co-lord of the world.\n\nBut the strength is horrible. Most of the original thousands of miles of rivers and mountains in the Western Zhou Dynasty have become foreign countries, and the owners have changed. The new owners are the Piaoguo (now the southern city of Henan) and Xiyi that made the fire of Lishan Dog Rong.\n\n(Invasion of Dog Rong)\n\nA battle of succession to the throne and invasion of foreign enemies greatly injured Zhou’s vitality, and the territory of the Zhou royal family was actually left in northwestern Henan. A corner of the land.\n\nEast to Xingyang, west to Tongguan, south to Rushui, north to the south bank of Qinshui.\n\nAfter the four corners are enclosed, the place is only more than 600 miles away, and the terrain is narrow and sparsely populated. In terms of strength, it is not a medium-sized state. Not only that, but also constantly being attacked by the western dogs, it can be described as precarious.\n\nFor the safety of the country, the helpless King Zhou Ping succeeded to the throne. The first thing he did was to ask for help from Qin, which was not a big country at that time, and help him move to Luoyi (now Luoyang). King Qin also had the later Spring and Autumn Hegemony Zheng Guo and Chunqiu Da Hegemony Jin.\n\n(The King of Zhou Ping moved east from a big country to a small country)\n\nThen, with the help of Jin Wenhou, another king of Zhou was killed with the king, only to reluctantly unify Zhou.\n\nQin State also stepped onto the stage of history because of this turmoil.\n\nQin Xianggong, the king of Qin, who helped Zhou Ping to move eastward, paid special attention to attacking Dog Rong. He also sent troops to escort Zhou Ping to move east, and the reward was the homeland of Zhou Dynasty west of Qishan.\n\nAccording to King Zhou Ping’s statement:\n\n\"Xi Rong is fierce and innocent, plundering my Qifeng land. If the Qin State can drive away Xi Rong, then Qin will occupy the land and all belong to Qin.\n\nHolding Zhou’s Shangfang sword, originally in the state of Qin in a tribal state, through the attack, he established his own country in the old place of the Zhou Dynasty.\n\nI don’t know the ancestors of the Zhou Dynasty, the father of the Zhou Dynasty, and those who strengthen the Zhou Dynasty. King Wu, what should I think about facing unscrupulous descendants.\n\n(Beginning of the Spring and Autumn Period)\n\nAt this point, the beginning of the Eastern Zhou Dynasty, the Spring and Autumn Period and the Warring States Period opened, but this has little to do with King Zhou!\n\nDuring the Spring and Autumn Period, he moved from Ping Wangdong to Sanjia Fenjin for more than 200 years. In these 200 years, he experienced five overlords.\n\nGenerally speaking, there are two ways of saying these five tyrants!\n\nThe Spring and Autumn Five Tyrants mentioned in \"Historical Records Suoyin\" are: Qi Huan Gong, Song Xiang Gong, Jin Wengong, Qin Mu Gong, and Chuzhuang King; The Spring and Autumn Five in \"Xunzi·wangba\" Overlord: Qi Huan Gong, Jin Wengong, Chu Zhuang Wang, Wu Wang Helu, and Yue Wang Goujian.\n\nIn fact, in terms of national strength, the above two statements have their own reasons.\n\nBut in my personal opinion, this veritable overlord of Spring and Autumn is actually no more than the Three Kingdoms.\n\n(Five Dominations)\n\nThat is the representative of the Spring and Autumn Superpowers, Qi, Chu and Jin.\n\n齐国首霸， The root is of course Jiang Taigong's good foundation. The benefits of the sea and the richness of salt and iron make Qi country have unlimited potential.\n\nalso coincides with the opportunity of the times, when the world’s princes do not have the concept of fighting for hegemony, with the emergence of a peerless master, coupled with rounds of economic reforms, Qi Guo jumped up and took advantage of Zhou Wang Dayi became the overlord. Under the slogan of \"respecting the king and fighting the barbarian\", of course there is no hope and no gain.\n\n晋国之强， are all geographically advantageous, occupying the most prosperous place in the Central Plains, with a large population and large arable land. Compared with the classical era, it is the best combat power. With the help of the existence of the Ming Lord, it is not strong. No way.\n\n楚国之强， are all counterattacks after being ridiculed. The treatment of the Chu people at the time was really unbearable for all countries. Except for the Song Dynasty, which was widely criticized and ridiculed, the Spring and Autumn Countries, Most of them look down on Chu, and because of this, Chu people's disobedience and rebellion. This rebellious move included proclaiming the king early and confronting Zhou Wang.\n\nalso because of this widespread discrimination, so that the hearts of the people of Chu gradually became united, although it was not like this in the subsequent Warring States period, but in the Spring and Autumn Period, Chu was so powerful, it is an indisputable fact.\n\n(Eight Hundred Years of Chu State)\n\nA spring and autumn, two hundred years, isn't it a century-long battle between Jin and Chu after the supremacy of Qi?\n\nAs for the younger Song State, the overlord of benevolence and righteousness is just a joke.\n\nYue Wang and Wu Wang are good, but how can they be compared with each other in the past ten years?\n\nSo why Chu State, after the Five Dominations of the Spring and Autumn Period, became the last one among the three super princes, it is worth studying.\n\nIn 643 BC, the head of the Spring and Autumn Period, Qi Huangong, because the five sons of the Qi Kingdom took the lead, conquered each other, and no one cares about his father, starving to death.\n\nQi State's hegemony has also been passed away because of Qi Huangong's death, and never returns.\n\nis nothing but a turbulent country and a vacant hegemony.\n\nThe vacancy of the dominant position will of course trigger new careerists to watch. In addition to the unwilling to fail Qi, this careerist also has the southern power of Chu. As for the Jin, it was still fighting at that time, so there was no chance. There is no strength to watch.\n\nThe dispute between Qi and Chu has become the trend of the times after Qi Huan's death. There will be guidance under the\n\ntrend.\n\nThe so-called Spring River Plumbing Duck Prophet, the first to feel the changes in the world situation is undoubtedly the state of Zheng caught between Qi and Chu.\n\nThe Kingdom of Zheng can be described as a country living in the world. It is next to the Kingdom of Chu. On the left is the former boss Zhou Kingdom. On the left is the Kingdom of Jin. After a few small countries, it is the Kingdom of Qi.\n\nQi State's hegemony is sluggish, Zhou State cannot be trusted, Jin State is still in conflict, and other small countries cannot protect themselves.\n\nSuch an international situation made Zheng Wengong, who was in power at that time, a little flustered. He was originally supported by Qi. He was not afraid of Chu, but Qi was in chaos. Chu, who enjoyed annexation, could not protect himself from taking advantage of others. .\n\n(Qi Huan Gong and Guan Zhong)\n\nIt is better to take the initiative to join in instead of just waiting for death. It is also good to get a vote!\n\nSo immediately changed the door, and personally went to Chu Kingdom to make a pilgrimage to the King of Chu.\n\nAt that time, Qi Huangong, the former overlord of the world, was still in his bones. Seeing the little brother he had taken care of in this way, he probably felt cool.\n\nIt's a pity that everyone is dead and everything is dead, it's useless to say anything!\n\nChu Guo saw that as soon as Qi Huangong left, there were people surrendering, and he was very unhappy. Thinking about it, he knew the future was bright.\n\nChu State generously received Zheng Wengong, who was surrendered, and the ruling King Chu Cheng generously gave Zheng Wengong a thousand catties of copper ingots.\n\nThis gift was not given for nothing. At that time, copper was money. This was to show the strength of the country, and it was agreed with Zheng Wen. The copper for you, don’t produce weapons, and can only be used as ceremonial objects.\n\nis also a condition attached to the friendly treaty.\n\nWith this huge amount of wealth, Zheng Wengong returned to the country contentedly, and still reluctant to give up before leaving. This southern barbarian of Chu is really rich and generous.\n\nAfter Zheng Wengong’s tour of Chu State, countless countries saw opportunities and reliance as well as ways to make money, so many small countries came.\n\n(The battle for hegemony is always changing)\n\nOne year later, Chen Guo, Cai Guo, Zheng Guo, these three not too small countries are in the former place of Qi and Chu A meeting was held, and they unilaterally recognized Chu's hegemony.\n\nIf things go according to this script, it will actually be a happy scene.\n\nThe state of Chu has money and strength, and everyone benefits. In fact, it’s nothing for the overlord to give Chu.\n\ncan't hold back someone who is not convinced, this is not convinced is Song Xianggong who is the heir to the hegemony of Qi.\n\nHe couldn't see that the South Barbarian became the overlord and the rule-maker, so he sent his troops to attack Zheng Guo. When Zheng Guo saw that you actually hit me, he immediately called the boss Chu Guo.\n\nThen the famous \"War of Righteousness-War of Water\" occurred in history.\n\nThe loyal Song Xianggong's head is more axial, half-crossing and unwilling to strike, unwilling to strike ashore, and finally waiting for the Chu army to line up, the Song state's army is actually broken.\n\nI don’t understand how to become the overlord of Spring and Autumn with such a thing!\n\nSong State collapsed when touched, Song Xianggong also followed his orders and became a cloud.\n\nAs far as the international situation in 637 BC is concerned, the Central Plains countries with the highest title were defeated, and the strongest in civil strife. The later overlord of Jin, Chong'er, was still staying in Qin.\n\n(The Battle of Hongshui)\n\nThe Chu country is dominated by the family, and there are a large group of younger brothers. It seemed appropriate to be the overlord at the time.\n\nIt is a pity that at this time, Chu State was in trouble and failed!\n\nThe reason for all this is also very straightforward, and it is the personnel changes at the top of Chu State.\n\nIn the state of Chu at that time, there was a respectable Ling Yin Dougu Yutu, to what extent he was in power for 27 years, and the King of Chu obeyed his words.\n\nThis person felt that he was getting old and was about to retire, so he passed his official position to the sage Ziyu in his relatives.\n\nZiyu was also in the same vein as Dougu Yutu after the royal family. King Chu Cheng saw that this was recommended by the veteran, and he accepted it with kindness.\n\n(Chu Chengwang)\n\nThus, Ziyu became the new order of Chu.\n\nBut for the transfer of power, of course there will be a struggle, and some people questioned it at that time!\n\nDr. Lu Chen (Yinwei) said to Dougu Yutu that it is wrong for you to do this. Give it to an inexperienced newcomer, where do you put the country.\n\nDougu Yutu: Answered that this person hasOnly, what can't I tell the sage?\n\nDoctor Hu: \"Where will you put the country if you do this?\"\n\nDougu Yutu: I also use Jingguo. If a husband has a great merit but no official official, how many people can win? ——\"The Twenty-Three Years of Zuo Zhuan·Xi Gong Biography\"\n\nFrom this dialogue, it can be seen that Dougu Yutu's seat of Yutu is not only a member of his own family, but also Optimistic about the talent of Ziyu is included, but it is not a fake public benefit.\n\nAnd under the international situation at that time, it is also a good thing for the country that an enterprising newcomer replaces his own old one.\n\nZiyu is a man who is familiar with the art of war, and once also served as a military commander. He is in charge. It is not a bad thing for the state of Chu, which is committed to expansion, and he also made great contributions in the battle against Chen. , Take advantage of the trend, the king of Chu agrees, do you oppose it?\n\nIn this way, Ziyu, with the strong support of the old minister Dougu Yutu, and the default of King Chu Cheng, became the new order of Chu.\n\nWhat seemed like a joy to everyone at the time, turned out to be a mess!\n\nZiyu has obvious advantages and disadvantages, and his disadvantages are concentrated on political qualities and personal virtues.\n\n（子玉）\n\nThere is a record in \"Zuo Zhuan\" that is written like this.\n\nZiyu Ju Ling Yin, created a luxurious decoration for his mount. Before the Battle of Jin Chucheng Pu, the river god entrusted Mengziyu. \"Wake up to me, and the elk of Song Dynasty and Meng Zhu will give it to you.\"\n\nAfter waking up, I remembered what the god of river said in the dream, and was reluctant to decorate his mount, even others persuaded her.\n\nDeath and benefit the country, still or for it, how good is it? It's dung too! But if you can help the teacher, how will he Aiyan?\n\nThis jade is not moved!\n\nNo wonder the person who persuaded him later said that he did not listen to him!\n\nNon-shen defeated Yin, making Yin not diligent and self-defeating-\"Zuo Zhuan·Twenty-eight Years Biography of Xi Gong\"\n\nAlthough this is recorded in the book, but The myth is too heavy to be believed, but it reveals Ziyu's shortcomings.\n\nThat is too selfish, too small, and not focusing on national affairs. How can such a person gain the support of the Chu government and opposition?\n\nAnd this kind of doubt also became the decisive factor of the \"Battle of Chengpu\" that later decided the battle for the supremacy of Jin and Chu.\n\nBefore the expedition, King Chu Cheng expressed his dissatisfaction. In the military governance ceremony held before the expedition, King Chu Cheng appointed the original order to make Yin Dougu Yutu a military parade instead of let Yin Ziyu parade.\n\nFaced with King Chu’s doubts, Ziyu did not admit his mistake but launched a counterattack at the military parade.\n\nAfter Dougu Yutu and Juiyi ruled the army, Ziyu made another decision in Langyi.\n\n(Government Ceremony)\n\nIs this a typical case against King Chu Cheng?\n\nBefore the expedition, there was a discord between the ruler and the general in the Chu State. This is in sharp contrast with the joint efforts of the monarchs and the ministers before the Jin State's march.\n\nalso triggered a quarrel in the court of Chu State. Before the battle was fought, there was civil strife. How did the battle go?\n\nAfter the expedition, such things continued. Facing the situation where Jin Wengong and Qi Qin were allied and jointly attacked Chu, Ziyu still insisted on confronting the enemy head-on and turned a deaf ear to the order of King Chu Cheng to retain his strength and retreat.\n\nalso replied to the king of Chu saying:\n\nIf you dare, you must have merit, and I would like to hold the slander in the middle-\"Zuo Zhuan·Twenty-eight Years Biography of Xi Gong\"\n\nIn this passage, while accusing his colleague Lun Jia Xian of slandering him, he also attacked the King of Chu for not supporting himself.\n\nChu Wang was very angry when he heard Ziyu's reply.\n\nWang Nu, learn less from him, but Xiguang, Donggong and Ruoao are the only onesFrom it—\"Historical Records · The Twenty-Eight Years Biography of Gong Xi\"\n\nWhat does this passage mean, but it means that King Chu was very angry, but could not stop Ziyu's actions, because Ziyu had soldiers in his hand.\n\nThis \"Ruoao Liuzuo\" is Ziyu's private army. It is the clan pro-army of the Ziyu family Ruoao's clan. The number is about 18,000. This figure accounts for a considerable proportion of the total force of the Chu State, not to mention half. , One-third is there.\n\nKing Chu Cheng looked at him, but he was helpless. You have to fight and use your own private soldiers as a threat. It is unrealistic and dangerous to fight.\n\ncan only gamble. If you want to gamble, you can bet more. If you win, you will make a profit. So he sent another 3,000 of his own guards to strengthen Ziyu.\n\n(Battle of Chengpu)\n\nThe original intention was to appease Ziyu and urge him to fight the war seriously. Who ever thought that the kindness of the King of Chu was not as good as Ziyu's selfishness.\n\nIn the battle, Ziyu formed his own private army \"Ruao Liusao\" into his own Chinese army, let the other army of Chu form the left army, and the allied army into the right army.\n\nAfter the battle started, the right army formed by the allies was defeated by the Jin's lower army, and the left army was also defeated by the Jin's upper army. Ziyu saw that both the left and the right army were defeated and ordered the Chinese army to retreat.\n\nThis is a typical selfish act. My own private soldiers were unscathed, and the army of allies and the country was almost wiped out.\n\nEveryone has to think about it, did you guy deliberately?\n\nOf course Wang Chucheng is the same, saying angrily, you guys have a face to come back after defeating the battle!\n\nFaced with King Chu’s reproach and the pressure of public opinion from the State of Chu, Ziyu committed suicide in shame and indignation in Fangcheng Mountain.\n\nBecause of its own personnel changes, and due to internal fighting, the country of Chu lost the opportunity to become the overlord of the Spring and Autumn Period, and Jin Wengong, who defeated the Kingdom of Chu, became the overlord of the Spring and Autumn Period.\n\nAfter the victory, he did not forget Ziyu's words.\n\nIf Ziyu dies, no one in Chu can threaten Jin.\n\nWhat is the meaning of these words, but Jin Wengong understands the pattern of the Chu court, and Chu has the ambitions of this Ziyu's family, Ruoao. Without the ambitious Ruo'ao clan, Chu's enterprising spirit will be missing. Although Ziyu is not a good person, this family is threatened. He is gone and the Chu State Council has been inactive for a long time.\n\n(Chu Zhuang Wang)\n\nThe fact is indeed the case, Chu State has stopped for a long time.\n\nIt was not until the time of the king of Chuzhuang who was a \"three-year unknown and blockbuster\" hero, that the power of the clan and the royal family was gathered, and the rise of the kingdom of Chu once again became the hegemony of Chu.\n\nBut these are all things to do. Chu is such a strange country, a country that the clan and royal family never deal with.\n\n,"}, {"url": "http://eng.chinamil.com.cn/OPINIONS_209196/Opinions_209197/9849234.html", "page_content": "On July 1, France announced to suspend its involvement in NATO Sea Guardian maritime security operation in the eastern Mediterranean following tensions with Turkey. The picture shows French Navy (Marine Nationale) La Fayette-class Frigate Courbet.\n\nBy Yang Zhongjie\n\nWhile France and Turkey are still at odds, the US and Germany recently had a falling-out too. The intense strain among several NATO member states regarding regional hotspot issues and forefront military presence have captured extensive attention. The widening internal cleft is going to pose a severe test to the bloc’s alliance system.\n\nNATO’s value is questioned.\n\nFrance and Turkey have had a long history of conflicts, and the two countries have traded barbs lately on the Libyan issue as Turkey teamed with countries like Italy and Qatar to support the Libyan Government of National Accord (GNA) while France is considered in support of the Libyan National Army. French President Emmanuel Macron accused Turkey, a country that “claims to be a NATO member”, of “holding primary responsibility for the Libyan conflict”, to which Turkish foreign minister Mevlut Cavusoglu responded that Paris is a “destructive” force in Libya and “is trying to let Moscow expand its influence there.”\n\nAs to the US-German relation in which the two countries have turned from allies to partners then to strangers, foreign media generally holds Donald Trump and his “America first” strategy accountable for the constant discords and historical cold wave in the cross-Atlantic partnership. The relation between Washington and Berlin has been backpedaling in many ways, and the former’s troops withdrawal from the latter has added fuel to the flame. After the Trump administration announced to reduce the American troops stationed in Germany, German media such as Der Spiegel and Berliner Zeitung all described the decision as provocative. They took it as a symbol of the bilateral relationship turning from alliance to profound divergence. The Russian newspaper Kommersant pointed out that America’s withdrawal of troops from Germany epitomizes its worsening relation with Berlin, which has turned from Washington’s loyal ally to its main rival in Europe, as bilateral ties have fallen to a new low since the end of WWII.\n\nThe widening divide among NATO member states is generally attributed to the fact that the value of the military bloc has been questioned after the Cold War and it is losing internal cohesion. In recent years, the relationship between NATO members and Turkey has become increasingly subtle, and their constant arguments over Middle East hotspots have taken a heavy toll on NATO’s credibility. Besides, the US and Germany have entirely different stances on the Iranian nuclear agreement, the Open Skies Treaty, and other international treaties, and their conflicting statements have exerted adverse effects on NATO’s solidarity and stability.\n\nNATO’s prospect is grim.\n\nGenerally speaking, NATO members’ escalating conflicts and divergences in recent years are largely because of their inconsistent outlooks.\n\nFirst, NATO member states have a different outlook on threats, especially on main threats from the Middle East and the strategic threat from Russia. Take the Russian threat for instance. The US has successively published the new National Security Strategy and National Military Strategy, and stressed curbing the strategic threat from Russia with forefront nations in Europe. Germany, on the other hand, pays more attention to Europe’s independent defense and is much less hostile toward Russia, even eager to mend ties with it.\n\nSecond, NATO member states have different outlook on interests. The France-Turkey conflict over Libya is driven by the struggle for energy interests, while Washington and Berlin have vast divergences both in bilateral trade and in multilateral trade involving the two sides. Former US national security adviser John Bolton revealed in his new book, The Room Where It Happened: A White House Memoir, that Trump believed Germany and other European countries had done very badly in economy and trade.\n\nThird, NATO member states have a different outlook on morality and justice. The strategic thinking of the US and Turkey has always been prone to expansionism. In contrast, European countries like France and Germany uphold the Culture of Restraint and the philosophy of a civilized state, which makes it hard for them to reach a consensus on international affairs.\n\nTime, an American weekly, said NATO’s prospects are “more uncertain than ever before”.\n\nOn the one hand, as a product of the Cold War, the value of NATO’s existence has been declining. Although it’s too early to talk about its collapse as the foundation for the alliance is still in place, the deterioration of member states’ relationship has exposed the bloc to many challenges in the future. How can it align the member states on the same page regarding their main strategic rivals and the direction of military development, while further integrating their combat systems to make sure NATO can function well in a crisis state?\n\nOn the other hand, as a US vassal, NATO has been constantly intimidated by the US in the past few years. In a recent interview with a mainstream European media, German chancellor Angela Merkel, when asked about America’s reduction of troops in Germany, said Europe would reevaluate its relationship with the US if the latter is unwilling to undertake its global responsibilities as a major country. In the future, NATO members in Europe may develop an independent and combined combat system to accelerate their defense integration in order to cope with various traditional and non-traditional threats effectively."}, {"url": "https://www.archyde.com/ten-years-of-grinding-the-sword-opera-the-king-of-chu-zhuang-has-a-new-debut-jingchu-com-hubei-daily/", "page_content": "Hubei Daily News (Reporter Nong Xinyu, Correspondent Huang Ying) On March 31 and April 1, for two consecutive nights, the National Arts Fund’s 2019 large-scale stage play and rolling funding project of works – the opera “The King of Chuzhuang” Meet the audience with a revised and polished new look at the Shouyi Theater in Wuhan. Previously, the show had its first round of performances on March 10 and 11. So far, the work of the play as a rolling funding project of the National Arts Fund has come to a successful conclusion.\n\nThe opera “The King of Chuzhuang” was created and performed by the Hubei Provincial Opera and Dance Theater. The main creative team brought together a group of people from Hubei who have made great achievements in the field of stage art, such as the famous director Chen Wei, the national first-level playwright Li Sui, and the composer Wu Yuebei. . The whole play is based on the historical background of the feudal hegemony in the Spring and Autumn Period, and tells the story of the King Zhuang of Chu who faced internal and external troubles and finally led the Chu Kingdom on the road to revitalization. After its premiere in 2017, the play has appeared in major performances such as the 3rd China Opera Festival and the National Center for the Performing Arts Opera Festival, and has been widely praised by experts, scholars and audiences from all walks of life.\n\nIn 2017, the opera “The King of Chuzhuang” was funded by the National Arts Fund for the creation of large-scale stage plays and works; in 2019, it received rolling funding again. After 3 years of dormancy, the opera “The King of Chuzhuang” started rehearsal this year, and implemented “two reforms and two performances” (two rounds of polishing and revision, two rounds of performances).\n\n“The King of Chu Zhuang”, which appeared in the “Second Performance” on March 31 and April 1, has been further polished in terms of text, performance, choreography and other aspects, and fully demonstrated the latest achievements in the improvement of the repertoire.\n\nThe relevant person in charge of the Hubei Provincial Opera and Dance Theater said that it has been ten years since the opera “The King of Chuzhuang” was first conceived and staged this time. The crew has always adhered to the artistic pursuit of exquisite art, profound thinking, and excellent production. After ten years of hard work, it is committed to creating a stage masterpiece that can stand, stay, and spread, showing the persistent artistic pursuit of literary and art workers. And the strong power of Hubei opera.\n\n\n\n\n\n[Responsible editor: Liu Jianwei]"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/internal+strife.html", "page_content": "It is clear that certain elements in the country and abroad were bent on [...] exploiting the genuine demands of the [...] people to stir up internal strife and undermine [...] the nation’s political and economic security [...] and stability as well as national sovereignty. daccess-ods.un.org daccess-ods.un.org people to stiundermine 这显然表明，国内外的某 [...] 些分子一意孤行地在利用人民真正的 要 求 挑 起 内乱 ， 破坏 国家 的政治和经济安全 及稳定，并危及国家主权。 daccess-ods.un.org daccess-ods.un.org 些分子一意孤行地在利用人民真正的的政治和经济安全 及稳定，并危及国家主权。\n\nThis in turn will also help many resolve the issue of [...] violence and internal strife; it will help [...] in peacefully resolving conflicts. fao.org fao.org violencewill help 暴 力和 内乱问题，有助于和平解决冲突。 fao.org fao.org 我 们必须找到最能满足各国需求的生产模式，这反过来又将帮助许多国家解决助于和平解决冲突。\n\nThere is no conflict, [...] civil war or internal strife that cannot be [...] attributed to a lack of development, which is the main [...] reason for that conflict or civil war. daccess-ods.un.org daccess-ods.un.org civil wacannot be 突、内战或内乱不是因为 没有 发展，而缺乏发展正是冲突或内战的主要原因。 daccess-ods.un.org daccess-ods.un.org 没有任何冲没有 发展，而缺乏发展正是冲突或内战的主要原因。\n\nAlthough [...] we cannot decide everything ourselves, we really have the ability to bring about internal strife or disorder and the total destruction of this beautiful home. legco.gov.hk legco.gov.hk we cannot decide everything ourselves, we really have the ability to bring aisorder and the total destruction of this beautiful home. legco.gov.hk legco.gov.hk 香港是我們的家，雖然我們不能事事自決，但是我們的確有 能力去內鬨、內亂，把這美麗的家園完全摧毀至殘缺不全。\n\nUnfortunately, in some cases electoral processes aimed at helping States move on from [...] conflict and internal strife have run into [...] difficulties. daccess-ods.un.org daccess-ods.un.org conflictrun into 脱冲突和内战的选举进程遇到了困难。 daccess-ods.un.org daccess-ods.un.org 不幸的是，在某些情况下，旨在帮助有关各国摆遇到了困难。\n\nAt this critical moment in Hong Kong’s history, let us all work [...] together to avoid internal strife that will tear [...] us apart. legco.gov.hk legco.gov.hk together to awill tear 要被內部鬥爭所分裂。 legco.gov.hk legco.gov.hk 在香港歷史的這個關鍵時刻，讓我 們同心協力，不\n\nAs the Council is aware, there is no conflict, [...] civil war or internal strife in which the [...] development dimension does not somehow come into play. daccess-ods.un.org daccess-ods.un.org civil wahich the 突、内战或内乱不在某 种程度上牵涉发展层 面的问题。 daccess-ods.un.org daccess-ods.un.org 正如安理会所知，没 有任何冲种程度上牵涉发展层 面的问题。\n\nThese threats have become major concerns because they come on top of unresolved conflicts, regional [...] tensions and ongoing internal strife. daccess-ods.un.org daccess-ods.un.org tensions and ong 这些威胁现已成为令人关 [...] 切的重大问题，因为它们与尚未解决的冲突、区域紧 张状况和持续内部冲突交织在一起。 daccess-ods.un.org daccess-ods.un.org 切的重大问题，因为它们与尚未解决的冲突、区域紧 张状况在一起。\n\nA third speaker [...] commented that internal strife almost always [...] constituted a threat to international peace and security and [...] underlined the need for further reflection on the nature of such threats. daccess-ods.un.org daccess-ods.un.org commentedst always 言者说，内乱几乎总会对 国际和平与安全构成 威胁，强调需要进一步思考这种威胁的性质。 daccess-ods.un.org daccess-ods.un.org 第三位发国际和平与安全构成 威胁，强调需要进一步思考这种威胁的性质。\n\nThe world [...] today is witness to internal strife faced by member nations, [...] which is caused mainly by the rising price of food, [...] the high rate of unemployment among young people, and poverty. daccess-ods.un.org daccess-ods.un.org today is witnesd by member nations, 家面临内战，而引 起内战 的主 要 原因是粮食价格上涨、青年失业率高和贫困。 daccess-ods.un.org daccess-ods.un.org 当今世界，许多国原因是粮食价格上涨、青年失业率高和贫困。\n\nWhile engagement between the two parties to resolve the pending issues through [...] dialogue still continued, the fighting in [...] border areas, internal strife within some bordering [...] areas of South Sudan, delays in [...] the implementation of the Abyei agreement and on the demilitarization of the common border zone have contributed to exacerbate those tensions. daccess-ods.un.org daccess-ods.un.org border arin some bordering 虽然双方仍 [...] 在进行接触，以通过对话来解决悬而未决问题，但是边境地区的战斗，南苏丹某 些边境地区的内部纷争，落实阿 卜耶伊协议以及共同边界地区非军事化的延误， [...] 都加剧了紧张局势。 daccess-ods.un.org daccess-ods.un.org 在进行接触，以通过对话来解决悬而未决问题，但是边境地区的战斗，南苏丹某 些边境卜耶伊协议以及共同边界地区非军事化的延误，\n\nThat is why we are happy to see that, after many [...] years of war, internal strife and destruction, [...] Iraq is finally striving towards a [...] more sustainable environment of security and stability. daccess-ods.un.org daccess-ods.un.org years ofdestruction, 战争 、内 争和毁灭之 后，终于为建立更加可持续的安全与稳定 [...] 的环境而作出努力。 daccess-ods.un.org daccess-ods.un.org 这就是为什么我们乐见伊拉克在多年的后，终于为建立更加可持续的安全与稳定\n\nOne member remarked that the proposal to provide security-related funding for Somalia was unusual as the Executive Committee had not approved security-related funding for almost 20 years, [...] although many countries had experienced [...] wars, civil unrest, and other internal strife during that historical time frame. multilateralfund.org multilateralfund.org wars, civil unrest, and ong that historical time frame. 时段内很多国家经历了战争、 内乱 和 其他 内部 纷 争。 multilateralfund.org multilateralfund.org 一成员指出，关于向索马里提供与安全相关的资金 的建议不同寻常，因为执行委员会已近二十年没有核准过与安全相关的资金了，尽管在这 一历史经历了战争\n\n00s, internal strife among the chiefs [...] and struggles among the colonial Powers of Germany, Great Britain and [...] the United States led to a period of instability. daccess-ods.un.org daccess-ods.un.org By the late 18g the chiefs 酋长间的内 斗和殖民地 国家德国、大不列颠和美国之间的争夺导致一段不稳定时期。 daccess-ods.un.org daccess-ods.un.org 到 1800 年代初期，国家德国、大不列颠和美国之间的争夺导致一段不稳定时期。\n\nIt has been [...] plunged into internal strife many times in [...] its long history, but has always been able to overcome adversity [...] with grace and to emerge stronger and more united. daccess-ods.un.org daccess-ods.un.org plungedtimes in 它在其漫长的历史中多次陷入内部 冲突，但始 终能够从容克服逆境，变得更加强大和更 加团结。 daccess-ods.un.org daccess-ods.un.org 它在其漫长的历史中多终能够从容克服逆境，变得更加强大和更 加团结。\n\n00s, internal strife among the chiefs [...] of the islands of the Samoan archipelago and struggles among the colonial [...] Powers of Germany, the United Kingdom of Great Britain and Northern Ireland and the United States led to a period of instability. daccess-ods.un.org daccess-ods.un.org By the late 18g the chiefs 长间 发 生 内 斗 ， 德国 、大 不列颠及 北爱尔兰联合王国和美国等殖民强国之间的争夺造成一段时期的不稳定。 daccess-ods.un.org daccess-ods.un.org 到 1800 年代末期，萨摩亚群岛各岛屿酋不列颠及 北爱尔兰联合王国和美国等殖民强国之间的争夺造成一段时期的不稳定。\n\nIt has caused a conflict between the [...] Legislative Council and the Government, and an internal strife between Members of the Council. legco.gov.hk legco.gov.hk Legislative Council and the Government, aneen Members of the Council. 這次事件造成了立法 會跟政府有爭鬥、立法會議員之間有 內訌、 政府 的高級公務員跟一般公務員 之間有內訌爭鬥、公 務員與市民之間也有爭鬥。 legco.gov.hk legco.gov.hk 這次事件造成了立法 會跟政府有爭鬥、立法會議員之間有的高級公務員跟一般公務員 之間務員與市民之間也有爭鬥。\n\nPresident, at this point when the situation of the international community is highly [...] [...] unpredictable and the global economy is experiencing fluctuations, Hong Kong can afford no internal strife and procrastination. legco.gov.hk legco.gov.hk unpredictable and the global economy is experiencing fluctuations, Hong Kong can afforprocrastination. 主席，國際社會波譎雲詭，全球經濟政治形勢動盪莫測的今天， 香港經受不起內耗和耽誤。 legco.gov.hk legco.gov.hk 主席，國際社會波譎雲詭，全球經濟政治形勢動盪莫測的今天， 香港經受不起內耗和耽誤。\n\nThe enactment of legislation in one go after the availability of a [...] [...] roadmap has the advantage of avoiding loss and damage as a result of internal strife and dispensing with the need to discuss how to deal with the issue [...] [...] of universal suffrage during each term of office of the Chief Executive. legco.gov.hk legco.gov.hk roadmap has the advantage of avoiding loss and damage as a resuldispensing with the need to discuss how to deal with the issue 有了路線圖後，然後 作一次性立法，這個好處便是無須每屆特首也要作內耗，商討究竟如 何處理普選的問題。 legco.gov.hk legco.gov.hk 有了路線圖後，然後 作一次性立法，這個好處便是無須每屆特首也要作內耗，商討究竟如 何處理普選的問題。\n\nIn Algeria, in [...] the context of internal strife during the 1990s, [...] and in particular between 1993 and 1998, the security forces [...] and State-armed militias arrested thousands of men on suspicion of involvement in terrorist activities, in circumstances leaving the relatives of those arrested men with no knowledge of their whereabouts.109 As a result, the relatives were often forced to request the issuance of a declaration of absence from judges and officials, who were in most cases denying or concealing the whereabouts of the arrested men.110 A number of the disappeared persons are reported to have been members or sympathizers of the Islamic Salvation Front.111 76. daccess-ods.un.org daccess-ods.un.org the contexng the 1990s, 的内乱 背景 下，尤其是在 1993-1998年 间，安全部队和由政府武装的民兵逮捕了数以千计的被怀疑卷入恐怖主义活动的 [...] 男子，而这些被逮捕者的亲属无从了解他们的下落。 daccess-ods.un.org daccess-ods.un.org 在阿尔及利亚，在二十世纪九十年代下，尤其是在 1993-1998年 间，安全部队和由政府武装的民兵逮捕了数以千计的被怀疑卷入恐怖主义活动的\n\nOne-third of the world’s civil wars take place in oil-producing states.162 In addition to the havoc wreaked on a country’s economy by the so-called resource curse, oil makes it easier for insurgents to fund rebellions and aggravates ethnic grievances.163 And while countries wracked by internal conflict and massive human rights abuses have provided an investment environment free from Western [...] competition and some strategic advantages, they have brought China closer to [...] situations of conflict and internal strife. crisisgroup.org crisisgroup.org situations of conflict 163 为内部冲突和大规模 [...] 人权问题所困扰的国家，国内通常没有西方公司 的竞争，但同时还具有一些战略优势，这让中国 和冲突和内战国家越走越近。 crisisgroup.org crisisgroup.org 人权问题所困扰的国家，国内通常没有西方公司 的竞争，但同时还具有一些战略优势，这让中国近。\n\nIn a context [...] of increased internal strife within the Palestinian [...] Territories, UNESCO continued giving special attention [...] to the educational needs of vulnerable groups. unesdoc.unesco.org unesdoc.unesco.org of increin the Palestinian 坦领土上内乱日益加剧的 情况下，教科文组织继续对弱势群体的教育需求给 予特别关注。 unesdoc.unesco.org unesdoc.unesco.org 在巴勒斯情况下，教科文组织继续对弱势群体的教育需求给 予特别关注。\n\nDuring the internal strife (1986–1992) many schools [...] in the interior were destroyed or badly damaged. daccess-ods.un.org daccess-ods.un.org During6–1992) many schools 在内乱期间 (1986-1992) ，内陆地区的 许多学校被摧毁或受到严重破坏。 daccess-ods.un.org daccess-ods.un.org (1986-19许多学校被摧毁或受到严重破坏。\n\nBottom line: SMIC’s latest earnings show [...] encouraging first-quarter guidance, but the company will need [...] to avoid more internal strife to complete its [...] turnaround. youngchinabiz.com youngchinabiz.com to avoidomplete its 一句话：中芯国际最新收益报告提出第一季度指导目标，但是公司需要避 免 更多 的 内讧 以 完成 其转 变。 youngchinabiz.com youngchinabiz.com 一句话：中芯国际最新收益报告提出第一季度指导目标，但是公司需要避变。\n\nNigeria’s long-held view is that piracy is a [...] symptom of the internal strife within Somalia [...] and the absence of governance structures. daccess-ods.un.org daccess-ods.un.org symptom ofin Somalia 尼日 利亚长期以来一直认为，海盗活动是索 马 里 内部 纷争 和缺少治理架构问题的一个表象。 daccess-ods.un.org daccess-ods.un.org 尼日 利亚长期以来一直认为，海盗活动是索和缺少治理架构问题的一个表象。\n\nThis reflects a general trend towards lower social [...] tensions as a consequence of economic improvement, as well [...] as the end of internal strife in some of the [...] countries considered. bbvaresearch.com bbvaresearch.com as the enome of the 这反应了经济改善之后社会形势缓和的总体趋 势，以及一些国家内乱已经结束。 bbvaresearch.com bbvaresearch.com 这反应了经济改善之后社会形势缓和的总体趋 势，以及\n\nHowever, in case a rapid withdrawal of the force is undertaken after the elections without building the [...] capacity of the country’s security sector, the potential for the country [...] slipping into internal strife cannot be ruled out. daccess-ods.un.org daccess-ods.un.org slippingot be ruled out. 陷入 国 内冲 突 的 潜在 可能，由成功变成又一个东帝汶、刚果民主共和国或 [...] 海地。 daccess-ods.un.org daccess-ods.un.org 如果不加强该国安全部门的能力，一旦选举后特派团 部队迅速撤离，就不能排除重新可能，由成功变成又一个东帝汶、刚果民主共和国或\n\nIt would not be [...] desirable to have internal power strife between him and Mr Yu. legco.gov.hk legco.gov.hk desirable toeen him and Mr Yu. 他們之間如果出現內部權力鬥爭， 並不是好事。 legco.gov.hk legco.gov.hk 他們之間如果並不是好事。"}, {"url": "https://daydaynews.cc/en/history/164551.html", "page_content": "From the time when the King Zhou Ping moved east to Luoyang, to the end of Qin Shihuang’s extermination of the Six Kingdoms, this period of chaos that lasted for five hundred and fifty years has seen countless heroes emerge. According to the \"Chun Qiu\" compiled by Confucius and the \"Warring States Policy\" compiled by Liu Xiang, the Han people divided this period into two historical periods: the Spring and Autumn Period and the Warring States Period.\n\nWarring States Policy-Negative Jing Please Sin\n\nThe book \"Zi Zhi Tong Jian\" is huge, with a span of 1,362 years, and it was written more than 900 years ago. There are very few people who can read the complete book. It is said that Chairman Mao likes \"Tongjian Zizhi\" very much. He read it thirteen times in his life, and each time he leaves his own reading experience in the book. In today's fast life, although the way to obtain books is more and more convenient, only a few meals can buy the wisdom of the ancients. However, there are very few people who are able to read \"The Mirror of Zizhi\" with the patience. I have loved history since I was a child, and I am full of longing for that still picture. After graduating, I became an ordinary worker. He didn't touch anyone with Gao Fushuai. He was not tall, his family was not rich, his appearance was mediocre, and his qualifications were dull. Sometimes I also think that God has isolated me from all the beauty in the world, and left me with a pretentious character, maybe let me pursue my interest without distraction!\n\nDuring this period, I also wrote a lot of articles about history. Generally speaking, more than a thousand words are not enough to narrate clearly. If tens of thousands of words are clearly stated, no one will read it patiently. I think about it these days. , It is decided to divide the \"Zi Zhi Tong Jian\" into various historical periods for detailed explanation, which is roughly divided into the chaotic period and the unified period. Today, the Warring States series is the first to start, and the Warring States begins with the three divisions and advancements. Today, we will discuss the cause and effect of the three divisions.\n\nIn 403 BC, King Weilie canonized Wei Si, Zhao Ji, and Han Qian as vassals, and Jin was split into Han, Zhao, Wei and Jin. In 376 BC, King Weilie died, and the three families of Han, Zhao, and Wei jointly abolished Jin Jinggong, the last monarch of Jin, and demoted them to civilians and carve up the last remaining land of Jin. There are six hundred and sixty. The six-year state of Jin completely perished. The former overlord of the Central Plains left the world only a lonely back. So when Han, Zhao, and Wei divided up Jin, why didn’t Emperor Zhou summon the princes to pacify Jin?\n\nHan Zhao Wei Sanjia points Jin\n\nZhou Tianzi has no actual power. In 770 BC, Zhou Ping Wang moved east to Luoyang to establish the Eastern Zhou Dynasty. At this time, Zhou Tianzi’s military strength was not as good as before. In the subsequent campaign against Zheng, he was shot in the shoulder by Zheng. From then on, Zhou Wang Cancel the war against the princes. The defeat of the war allowed the princes to see the weakness of the Zhou royal family. The nations started a merger war between each other. The Emperor Zhou also lost his dignity as the sovereign state. In order to meet the normal state expenditure, the Zhou royal family had no dignity to ask the princes. Need food and grass. Facing the Jin Dynasty’s doctors, Han, Zhao, and Wei, divided up the Jin’s monarch’s territory and claimed to be a prince on his own territory, Zhou Tianzi wanted to summon the princes to conquer the Han, Zhao, and Wei families, but he did not have decent military strength, nor was he powerful. The vassal state is willing to carry out the crusade in place of Zhou Tianzi. King Zhou Weilie had just ascended to the throne. In order to win over the three families of Han, Zhao and Wei and gain their support, he canonized the three families of Han, Zhao and Wei as vassals when he was unable to fight.\n\nThe emperor Zhou lost his right to conquer-Zheng Wugong shot Zhou Huan Wang\n\nAll the princes were caught in the civil strife in which the minister seized power. It is not a special case for the officials of the Jin Dynasty to seize the power of the monarch and divide the territory of the monarch in the late Spring and Autumn Period. At the same time, almost all vassal states have fallen into the grasp of state power by the officials, the monarch has lost the dominance of the state, and even has life concerns. There is a sentence in \"The Analects\": I am afraid that Ji’s worries are not in Zhuanyu, but in Xiaoqiang. At that time, the power of the State of Lu was controlled by the three families of the Meng family, the Shusun family, and the Ji family. The monarch of the Lu State not only lost his state rights, but also was always at risk of being expelled from Sanhuan. After his succession, Lu Ai wanted to destroy Sanhuan. , But was expelled by Sanhuan, and died in Youshan. The first country to dominate in the Spring and Autumn Period, Qi State, was also caught in a situation where the government of the Qing Dynasty was struggling for power. By the time of the three divisions of the Jin Dynasty, the state rights and territory of Qi State had all fallen into the hands of the Tian family from Chen State. And exiled Qikang on the island near the sea. During the Spring and Autumn Period, the State of Qin, who dominated the Xirong area, was also caught in the chaos of Doctor Qing’s abolition of the monarch. Qin Xiaogong’s order of seeking talents has such a sentence: Those who go forward are fierce, impatient, simple, and restless. The country's internal worries, not to mention foreign affairs. During this period of time, monarchs and ministers competed with each other for the dominance of the country. The internal friction was very serious, and the hegemony of the Central Plains was gradually dying. The last hegemon in the Spring and Autumn Period was the Chu Kingdom from the Southern Barbarian Land, but all the countries in the Central Plains rejected Under the general trend of the Chu State, it seemed weird to use Chu to quell the internal strife in the Jin State.\n\nThe situation of the princes in the early Warring States period\n\nThe three kingdoms of Han, Zhao, and Wei that split from the Jin state will deduce what gorgeous chapter in the Warring States period of Tie Ma Jin Ge, and who will Blow the horn of the unification of the world?"}, {"url": "https://www.collinsdictionary.com/us/dictionary/english/internal-strife", "page_content": "Example sentences internal strife\n\nThese examples have been automatically selected and may contain sensitive content that does not reflect the opinions or policies of Collins, or its parent company HarperCollins. We welcome feedback: report an example sentence to the Collins team. Read more… These examples have been automatically selected and may contain sensitive content that does not reflect the opinions or policies of Collins, or its parent company HarperCollins.\n\nThrough all the apparent internal strife, a new power structure appears to be taking hold.\n\nThe ruling party approaches the election with growing signs of internal strife.\n\nAny cuts are sure to cause internal strife."}, {"url": "https://wiki2.org/en/King_Zhuang_of_Chu", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nKing of Chu\n\n\"Wangzi Wu\" Bronze Ding. The inscription inside the Ding documents that Prince Wu worshipped his ancestors and prayed for his offspring. Wu was a son of King Zhuang.\n\nKing Zhuang of Chu (Chinese: 楚莊王; pinyin: Chǔ Zhuāng Wáng, reigned 613-591 BC) was a monarch of the Zhou dynasty State of Chu during the Spring and Autumn period in ancient China. His personal name was Xiong Lü (Chinese: 熊旅; pinyin: Xióng Lǚ), his ancestral name was Mi (Chinese: 芈; pinyin: Mǐ), and his posthumous title was King Zhuang. He was one of the five rulers dubbed the Five Hegemons by Xunzi and attempted to wrest control of China from King Ding of Zhou.[1]\n\nThe son of King Mu of Chu, Zhuang ascended the throne in 613 BC. According to a legend in the Records of the Grand Historian, for the first three years of his reign Zhuang wasted time in pleasure seeking, but, when challenged by two courtiers, reformed his ways.[2]\n\nThe king made Sunshu Ao his chancellor. Sunshu Ao began a series of major dam-works and an enormous planned reservoir in modern-day northern Anhui province.\n\nAfter some military successes, King Zhuang attempted to usurp King Ding of Zhou. According to a well-known story, probably an invention of the Warring States period, he asked a messenger from Zhou about the weight of the legendary Nine Tripod Cauldrons which Zhou possessed, a euphemism for seeking ultimate power in China, but was rebuffed. This incident gave rise to the chengyu \"to enquire about ding in the central plains\", i.e. to have great ambitions (simplified Chinese: 问鼎中原; traditional Chinese: 問鼎中原; pinyin: wèn dǐng zhōngyuán).[2]\n\nIn the Battle of Bi, his army defeated the State of Jin. His progress from lazy regent to hegemon gave rise to the Chinese chengyu \"amaze [others] with one cry\" (simplified Chinese: 一鸣惊人; traditional Chinese: 一鳴驚人; pinyin: yī míng jīngrén).\n\nYouTube Encyclopedic\n\n1 / 3 Views: 404 277 721 4 301\n\nChinese Ding Vessels in 700 BC\n\n華晨宇《齊天》電影《悟空傳Wukong zhuan》主題曲《高清動態歌詞》\n\n大壯《我們不一樣》HD動態歌詞 Transcription\n\nReferences"}]}