{"During his tenure, William J. Flanagan, Jr. was credited with helping to reduce": [{"url": "https://infogalactic.com/info/William_J._Flanagan,_Jr.", "page_content": "From Infogalactic: the planetary knowledge core\n\nAdmiral William J.ohn Flanagan, Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.[1][2]\n\nWilliam John Flanagan, Jr. was born in 1943[3]\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School.[4]\n\nCareer\n\nThe younger Flanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in Marine Transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of Second Mate. After three years of service with American Export Lines, Flanagan accepted a full commission with the U.S. Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as her first Commanding Officer. He had now advanced to the rank of Captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of Admiral and was assigned as Commander in Chief of the Atlantic Fleet (CINCLANTFLT). At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Admiral Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service. [5] [6]\n\nMilitary Awards\n\nU.S. Military decorations\n\nReferences\n\n↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ [1] ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found.\n\n\n\n\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>"}, {"url": "https://peoplepill.com/people/william-j-flanagan-jr/", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.\n\nEarly life and education\n\nFlanagan was born in 1943. In addition to his bachelor's degree in marine transportation, Flanagan received a master's degree in political science from the American University and earned a degree from Harvard Business School.\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan accepted a commission with the United States Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.\n\nMilitary awards\n\nU.S. Military decorations"}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/flanagan-william-jr", "page_content": "Flanagan, William (Jr.)\n\nFlanagan, William (Jr.), American composer and music critic; b. Detroit, Aug. 14, 1923; d. of an overdose of barbituates in N.Y., Aug. 31, 1969. He studied composition at the Eastman School of Music in Rochester, N.Y., with Phillips and Rogers; then at the Berkshire Music Center in Tanglewood with Honegger, Berger, and Copland; also, in N.Y., with Diamond. Concurrently, he became engaged in musical journalism; was a reviewer for the N.Y. Herald Tribune (1957–60) and later wrote for Stereo Review. His style of composition was characterized by an intense pursuit of an expressive melodic line, projected on polycentric but firmly tonal harmonies.\n\nWorks\n\nDRAMATIC Opera : Bartleby (1952–57;N.Y, Jan. 24, 1961); The Ice Age (1967; unfinished); incidental music to E. Albee’s plays The Sandbox (1961), The Ballad of Bessie Smith (1961), The Ballad of the Sad Cafe (1963), and Malcolm (1966). CHAMBER: Divertimento for String Quartet (1947); Chaconne for Violin and Piano (1948). KEYBOARD : Piano : Passacaglia (1947); Sonata (1950). VOCAL: The Waters of Babylon for Voices and String Quartet (1947); Bitty in the Darbies for Chorus and Piano or Orch. (1949); A Woman of Valor for Chorus (1949); The Weeping Pleiades for Baritone and 5 Instruments (1953); The Lady of Tearful Regret for Soprano, Baritone, Flute, Clarinet, String Quartet, and Piano (1959); King Midas for Soloists and Orch. (c. 1961); Chapter from Ecclesiastes for Chorus and String Quintet (1962); Another August for Soprano, Piano, Harpsichord, and Small Orch. (1966); various songs. OTHER: 2 films scores. ORCH.: A Concert Overture (1948; N.Y., Dec. 4, 1959); Divertimento (1948; Toledo, Ohio, Jan. 9, 1960); A Concert Ode (1951; Detroit, Jan. 14, 1960); Notations (1960); Narrative (1964; Detroit, March 25, 1965).\n\n—Nicolas Slonimsky/Laura Kuhn/Dennis McIntire"}, {"url": "https://www.wikizero.com/en/William_J._Flanagan_Jr.", "page_content": "From Wikipedia the free encyclopedia\n\nAmerican admiral\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1][2]\n\nEarly life and education [ edit ]\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3][5]\n\nNaval career [ edit ]\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5][6]\n\nMilitary awards [ edit ]\n\nU.S. Military decorations"}, {"url": "https://www.24-7pressrelease.com/press-release/476229/james-h-flanagan-jr-celebrated-for-dedication-to-the-legal-profession", "page_content": "KANSAS CITY, KS, October 06, 2020 /24-7PressRelease/ -- James H. Flanagan, Jr. has been included in Marquis Who's Who. As in all Marquis Who's Who biographical volumes, individuals profiled are selected on the basis of current reference value. Factors such as position, noteworthy accomplishments, visibility, and prominence in a field are all taken into account during the selection process.\n\n\n\nMr. Flanagan first garnered inspiration for his 44 years of general law practice during his formative years while working at his local library.\n\n\n\nExhibiting particular interest in J. Edgar Hoover and the Federal Bureau of Investigation, Mr. Flanagan quickly recognized his desire to pursue a career in law because at that time the only avenues to becoming a special agent were as an attorney or as a certified public accountant. So he decided then that he would become a lawyer, and in high school he interned at the law office of William, O. Ellis in Redwood City, CA.\n\n\n\nHe obtained his undergrad degree in Political Science at Stanford University. Because he was enrolled in the NROTC program, he graduated with a commission as a Second Lieutenant in the Marine Corps Reserve. His active duty consisted primarily of Basic School and then serving as a Communications Officer with a Top-Secret Crypto clearance running the Crypto Center for the First Marine Air Wing in Japan. He then returned home and attended Stanford University Law School for a JD degree in Law. During law school he interned with the general law practice firm of Crist, Peters, and Donegan in Palo Alto, CA.\n\n\n\nAfter law school, realizing that he wanted to be in a general law practice to help people solve their legal problems, he was a legislative intern with the California Assembly Water Committee, and wrote his first book, California Water Districts. Having married his wife Charlotte while in law school, he then moved with her to Fresno, where she was raised, to practice law. Being a country boy at heart he wanted to practice law in a rural area. His first two years of practice was with the firm of Creede, Dawson, & McElrath as an associate. The next 11 years of practice was as a partner with the firm of Pettitt, Blumberg, Sherr, and Flanagan. The senior partners of those two firms became his mentors on the general practice of law in office, court, and appeals. In 1975, he left the firm and went into a solo general practice of his own until he retired in 2006.\n\n\n\nDuring his law practice Mr, Flanagan also was: a judge pro-tem in the Fresno Superior Court; a weekly newspaper columnist at two local newspapers; taught at several colleges creating and teaching courses in Water Law and Dispute Resolution; and also active in community affairs, being a member, board member, or chair of numerous community and church organizations, several of which he still writes commentaries for their monthly bulletins.\n\n\n\nHe is still an active member of Rotary (Senior Active at the North Fresno Club), the Marine Corps League (life), the Military Officers Association of America (life), and the Catholic Professional & Breakfast Club.\n\n\n\nDuring his law practice Mr. Flanagan had been a member of the California State Bar (received a commendation letter for 50 years of service), the Fresno Bar Association, the Oregon State Bar for several years, and admitted to practice before the United States Court of Appeal for the Ninth District, as well as the United States District Courts for the Northern, Southern, and Eastern Districts of California. Two of his winning appellate cases are in the California Reports.\n\n\n\nOn retirement from the practice of law in 2006, Mr. Flanagan served for 8 years on the staff of the Fresno Chamber of Commerce (after 34 years of serving various Chamber of Commerce organizations). In 2014, Mr. Flanagan left the Chamber job to finish writing a book titled Managing Conflict – Strategies to Create and Teach Resolution of Conflict, Lawyers & Judges Publishing Co. (2016). Three years later he was co-author of another book, Resolving Conflict by Mediation, a Primer, Scholars Press (2019) with Gregory J. Zubacz, Associate Provost and former Chair of the Peacemaking and Conflict Studies at Fresno Pacific University.\n\n\n\nMr. Flanagan plans to write at least three more books (Conversations without Conflict, Dinosaur Lawyer (a commentary on the disappearance of the general practitioner in both medicine and law and the effect on the public, mainly the lack of affordability of, and access to, service particularly in rural areas), and Irish Boy (a commentary of his life as the youngest of two grandsons of grandparents who were all born in the Republic of Ireland and became naturalized citizens of the U.S. after leaving behind the conflict that they referred to as \"the troubles\").\n\n\n\nAs a testament to his professional success, Mr. Flanagan has been featured in multiple editions of Who's Who in America, in the West, in the World, in American Law, and in American Education.\n\n\n\nAbout Marquis Who's Who®\n\nSince 1899, when A. N. Marquis printed the First Edition of Who's Who in America®, Marquis Who's Who® has chronicled the lives of the most accomplished individuals and innovators from every significant field of endeavor, including politics, business, medicine, law, education, art, religion and entertainment. Today, Who's Who in America® remains an essential biographical source for thousands of researchers, journalists, librarians and executive search firms around the world. Marquis® now publishes many Who's Who titles, including Who's Who in America®, Who's Who in the World®, Who's Who in American Law®, Who's Who in Medicine and Healthcare®, Who's Who in Science and Engineering®, and Who's Who in Asia®. Marquis® publications may be visited at the official Marquis Who's Who® website at www.marquiswhoswho.com.\n\n\n\n# # #"}, {"url": "https://alchetron.com/William-J-Flanagan,-Jr", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.\n\nContents\n\nFlanagan was born in 1943\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School."}, {"url": "https://theunfussycook.com/2022/03/17/what-happened-to-john-flanagan/", "page_content": "What Happened to John Flanagan? – A Descendant’s Discoveries\n\nMy quest to resolve the mysteries surrounding my 4x great-grandfather.\n\nUpdated 18 May 2023\n\nJohn Flanagan was born between 1790 and 1799 (based on the 1840 census) in VA (probably Albemarle County, since his parents, James Winwright Flanagan and Phoebe Simpson, were residing there throughout most of the decade). He married Ann M Saunders on 22 Jun 1820 in Fluvanna County VA. She was also born about 1795 according to DAR records.\n\nUntil now, few details were known about John outside of his marriage to Ann, the 1840 census in St Francis County, Arkansas, and his known son William J. I have always wanted to find out what happened to John and have been searching out details about him for the past few years. By delving into available records, I have discovered many more details beyond research that stopped in the 1960’s (as far as I can tell) with Dr. Edward Latane Flanagan and Kate Flanagan McGuire. He did not die in St Francis County; he died in Madison County, MS sometime after 1845 but before December 1853.\n\nThis study is presented as a series of events in chronological order. Most of these events are not known to most researchers, but because of what we know about John and his son William, along with 1) the emergence of a letter written in 1844 by John’s brother Simpson B Flanagan which I discovered in a Louisa County VA chancery case and 2) the compiled research papers prepared by Dr. Edward Latane Flanagan (1882-1965) which are housed at the Virginia Museum of History and Culture (formerly known as Virginia Historical Society), much new light can be shed on John.\n\nThe theory pieces together many moving parts, which should not be a surprise when researching a family that hasn’t been researched in depth for 60 years.\n\nWhen: 22 Jun 1820\n\nWhere: Fluvanna Co VA\n\nWhat: John Flanagan marries Ann M Saunders\n\nSource: “Fluvanna County, Virginia Marriage Bonds 1781-1860,” Genealogical Society of Utah, May 1938, page 29 [https://www.familysearch.org/library/books/viewer/194364/?offset=0#page=17&viewer=picture&o=&n=0&q=]\n\nWhen: 4 Nov 1821\n\nWhere: Fluvanna Co VA\n\nWhat: John and Ann’s son William J is born\n\nSource: Letter written by Henrietta (Flanagan) Moore (1849-1928) to her niece Kate (Flanagan) McGuire; postmark is illegible, but the letter is addressed to “Kate McGuire,” and Kate Flanagan married Herman McGuire in 1921. Henrietta died in 1928, so the letter was written some time in those spanning years. Henrietta was William James Flanagan’s daughter. She writes to Kate that he was born in Fluvanna Co VA.\n\nSource: Find a Grave, database and images (https://www.findagrave.com/memorial/11485553/william-james-flanagan : accessed 08 June 2022), memorial page for William James Flanagan (4 Nov 1821–28 Aug 1907), Find a Grave Memorial ID 11485553, citing Pelahatchie Cemetery, Pelahatchie, Rankin County, Mississippi, USA ; Maintained by Becky Thames-Simmons (contributor 46954069)\n\nWhen: 25 Feb 1822\n\nWhere: Fluvanna Co VA\n\nWhat: Jesse Saunders and wife Rebecca deed of gift to Ann Flanagan their daughter 392 1/3 acres which Rebecca inherited from her father John A Strange\n\nSource: Fluvanna Co VA Deed Book 8 pp 79-80, proved in open court by Jesse 25 Mar 1822 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C373-X9C3-R?i=67&cat=402676]\n\nWhen: 25 Mar 1824\n\nWhere: Virginia\n\nWhat: John and Ann’s daughter Susan Rebecca is born\n\nSource: Flanagan, Edward Latane, 1882-1965, Papers, 1871-1965 Farris-Grundfest, call number Mss1 F6135 a F-G In: x86030910043; Virginia Museum of History and Culture, Richmond VA\n\nSource: “Cemeteries of White County, Illinois (DAR), V. 03,” Daughters of the American Revolution Illinois society 1961-1963, page 90, entry for Hanmore, Susan R. Feb. 25, 1824-Mar. 25, 1906.\n\nSusan Rebecca surfaced while researching ELF’s papers at the Virginia Museum of History and Culture in Richmond. The Family Group Sheet for John and Ann (Saunders) Flanagan contains a note stating that William’s granddaughter, Effie McDonald, said that her grandfather, William Flanagan, had two sisters – Susan and Maranda who lived in Enfield IL (White County) and in Chicago and that Susan married a Kuykendall. My research shows that there was only one sister, Susan, who had a daughter Miranda Hall who married Perry Kuykendall. All told, Susan was married 3 times: 1) Isaac Mitchell, probably in AR, 2) Amos Hall in White Co IL, and 3) James B Hanmore in Gallatin Co IL. I have researched Susan extensively and will provide information about her in a separate research paper. It seems Effie was confusing details about the two women.\n\nWhen: 2 Sep 1824 and 2 Oct 1824\n\nWhere: Fluvanna Co VA\n\nWhat: John and Ann sell 236 acres to William Johnson\n\nSource: Fluvanna Co Deed Book 8 pp 526-527, proved in open court by John and Ann 2 Oct 1824 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C373-X9ZL-M?i=285&cat=402676]\n\nWhen: After 2 Oct 1824 and before 20 Aug 1827\n\nWhere: Virginia or Tennessee\n\nWhat: John’s wife Ann dies\n\nSource: No source exists for her death, but it is evidenced by the next several events\n\nWhen: 1824-1827\n\nWhat: John marries Mary Yancey\n\nWhere: Probably Giles Co TN\n\nSource: This is evidenced by the court records below.\n\nWhen: 20 Aug 1827\n\nWhere: Giles Co TN\n\nWhat: Elizabeth L Yancey appears in the county court to petition for her dower as widow of John Yancey, deceased. The petition names John’s heirs:\n\nElizabeth L Yancey, widow\n\nNancy Yancey\n\nJohn Yancey\n\nLucy Yancey\n\nPhilip Yancey\n\nJames Yancey\n\nHenry Yancey\n\nBartlett Yancey\n\nPeggy Yancey, now Peggy Gooch\n\nPolly Yancey, now Polly Flanagan\n\nThomas Yancey\n\nSally Yancey\n\nCatharine Yancey\n\nSource: Giles Co TN County Court Minutes Book “Feb 1826 to Aug 1827” pp 436-437 https://www.familysearch.org/ark:/61903/3:1:3QSQ-G9PS-K7G4?i=489&cat=195453\n\nWhen: 1826/27\n\nWhere: Tennessee\n\nWhat: John Y Flanagan is born in TN\n\nSource: “United States Census, 1850,” database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:MH5S-FXV : 19 December 2020), John Y Flannagan in household of Mary Ann Williams, Limestone, Alabama, United States; citing family , NARA microfilm publication (Washington, D.C.: National Archives and Records Administration, n.d.).\n\nSource: “United States Census, 1860”, database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:MHDP-C6P : 18 February 2021), John Y Flannagan, 1860.\n\nWhen: 18 Feb 1829\n\nWhere: Giles County TN\n\nWhat: John, James, Henry, Alfred, Bartlett, Thomas, and Nancy Yancey, all of Giles Co TN, deed 250 acres to John Flanagan\n\nSource: Giles Co TN Deed Book H pp 220-221, recorded 30 Jan 1830 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-CS5Q-N92Y-6?i=143&cat=203068]\n\nWhen: 29 Aug 1829\n\nWhere: Giles County TN\n\nWhat: Elizabeth L Yancy sells to John Flanagan her dower lands upon which she now lives, 83 1/3 acres\n\nSource: Giles Co TN Deed Book H p 375, recorded 10 Sep 1830 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-CS5Q-N929-H?i=229&cat=203068]\n\nWhen: 8 Sep 1829\n\nWhere: Limestone Co AL\n\nWhat: Circuit Court – John Flanagan use of William Miles [sic] vs. George Wells\n\nSource: Limestone Co AL Circuit Court Minutes Book 1827-1832 #177, p 311 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C3Q1-F9NS-T?i=325&cat=1003570]\n\nWells confesses that he owes John the sum of $16 and is ordered to pay within a month. There are only basic minutes for this entry; no details are written in the book. John’s brothers Samuel and Simpson both had sons named John and they were living in Limestone Co AL at this time, but neither of their sons was old enough to be the John Flanagan in this suit.\n\nWhen: 1 Jun 1830\n\nWhere: Giles Co TN\n\nWhat: US Federal Census, entry for John Flanagan\n\nSource: “United States Census, 1830,” database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:XHPM-T7V : 20 February 2021), Jno Flanagan, Giles, Tennessee, United States; citing 172, NARA microfilm publication M19, (Washington D.C.: National Archives and Records Administration, n.d.), roll 176; FHL microfilm 24,534\n\nMales\n\n2 – <5 yrs (John Y and another male child)\n\n1 – 5<10 yrs (William J)\n\n1 – 30<40 yrs (John)\n\nFemales\n\n1 – 5<10 yrs (Susan Rebecca)\n\n1 – 30<40 yrs (Mary Yancey Flanagan)\n\nWhen: 1831\n\nWhere: Fluvanna Co VA\n\nWhat: John Flanagan visits family in Fluvanna Co VA\n\nSource: Barnett M Nalley etc vs Thomas J Nalley etc, Fluvanna Co VA Chancery cause Library of Virginia Index No. 1839-007 [https://www.lva.virginia.gov/chancery/full_case_detail.asp?CFN=065-1839-007#img]\n\nAn affidavit from a chancery cause in Fluvanna Co VA in which James Flanagan’s children (John among them) sue James’s widow Mary for division of certain slaves, was (and remains today) misfiled in a cause that was occurring at the same time, Nalley v. Nalley. Though the affidavit was taken about 1839, in the affidavit, “John Flanagan made oath that when he was back in this state some where in 1831 that James Flanagan his father agreed to give him a negro girl from his house, Mrs Flanagan the wife of James Flanagan objected to my having said girl and wished my father James Flanagan to give me the negro girl Lucy which my brother William Flanagan had, Mr James Flanagan replyed that he would not do it, he would not take from one child to give to another, that he had given her to his son William Flanagan and would not take her back…”\n\nWhen: About 1831\n\nWhere: Tennessee\n\nWhat: Thomas W Flanagan is born\n\nThomas was another son of John and Mary; he will be the subject of a separate study. That he was the son of John and Mary will be demonstrated in this study’s entries dated 1853.\n\nWhen: 6 Mar 1833\n\nWhere: Limestone Co AL\n\nWhat: Circuit Court – John Flanegan v Charles C Yancy – Jury trial. Jury finds for the plaintiff, so Yancy and Francis Lock his security are ordered to pay John $25.05.\n\nSource: Limestone Co AL Circuit Court minutes, 1833-1838, p 13 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C3Q1-F9VB-D?i=575&cat=1003570]\n\nWhen: 1833\n\nWhere: Giles County TN\n\nWhat: Circuit Court – Samuel Flanagan v. Archibald McAinish\n\nSource: Giles Co TN County Court Minutes Book Feb 1833-Nov 1833, p 202 [https://www.familysearch.org/ark:/61903/3:1:3QS7-89PS-KG2W?i=379&cat=195453]\n\nThe details of this case are very vague, but according to the minutes Samuel (John’s brother) failed to prove his case, it was dismissed, and he appealed it to the circuit court.\n\nThe two interesting things about Samuel appearing in Giles County TN are 1) Samuel settled in Limestone County AL, and Limestone’s northern border shares Giles’s southern border, and 2) Archibald McAinish is a near neighbor to John Flanagan on the 1830 census\n\nWhen: 10 Jul 1834\n\nWhere: Giles County TN\n\nWhat: Hardin Creamer executes a deed of trust to John Flannagin\n\nSource: Giles Co TN Deed Book K pp 594-596 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C39N-VCYZ?i=271&cat=203068]\n\nWhen: 25 Jan 1836\n\nWhere: Giles County TN\n\nWhat: John Flanagan executes a deed of trust to Thomas Martin, with Archibald Wright as trustee, for the 250 acres noted in the above deeds but excepting the share belonging to his brother-in-law Philip Yancy.\n\nSource: Giles Co TN Deed Book L p 502-503 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C39N-V87M?i=614&cat=203068]\n\nBecause this deed references John’s brother-in-law Philip Yancy, it proves that it was John Flanagan who was married to “Polly Yancey, now Polly Flanagan” referred to in the 20 Aug 1827 petition for dower rights made by Elizabeth Yancey.\n\nThis trust deed is to secure 3 notes made by John to Thomas Martin totaling $1,110, all dated 25 Dec 1834 and due consecutively on 25 Dec 1835, 1836, and 1837. If John does not pay, then Wright will sell the land, pay Martin off, and give any extra proceeds to John. If John pays the notes, then the deed is cancelled. I did not find evidence of if, or when, this deed of trust was cancelled by John paying the notes due Thomas Martin. I also did not find instances of John later selling this land (implying he had paid the notes) nor record of Archibald Wright or Thomas Martin selling it.\n\nWhen: 1838\n\nWhere: St Francis County AR\n\nWhat: John Flanagan is taxed for 160 acres\n\nSource: St Francis Co AR Tax Lists 1832-1836, 1838 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-CSLG-SS27-F?i=785&cat=636459]\n\nJohn does not appear on the 1836 list. 1837 is not available. The next available list is for 1843/44, and he does not appear on that list.\n\nWhen: 10 Jan 1839 and 26 Jan 1839\n\nWhere: Fluvanna County VA\n\nWhat: 1. John Flanagan and Mary his wife of St Francis County AR sell to John H Timberlake the interest he has in the dower estate of his step-mother Mary Flanagan (second wife of James Winwright Flanagan).\n\n2. John Flanagan and Mary M his wife of St Francis County, AR sell to William Payne Jr of Fluvanna County VA 128 acres being the land he inherited from his father James.\n\nSource: Fluvanna Co VA Deed Book 12 p 38 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-C373-P73W-J?i=30&cat=402676]\n\nWhen: 17 Jan 1839\n\nWhere: Fluvanna County VA\n\nWhat: This affidavit is also misfiled in the Nalley vs Nalley cause (mentioned above, 1831). It again discusses the slave woman named Lucy. He states, “John Flanagan one of the distributees stated that when he was last in this country during the life of his Father that he told him that he had given her the negro girl Lucy to his son William…” The commissioners who took the affidavit state, “We have thought it most advisable as Mr John Flanagan lives in the state of Arcansas for him to make his statement on oath in writing which he has done on this sheet of paper.”\n\nSource: Barnett M Nalley etc vs Thomas J Nalley etc, Fluvanna Co VA Chancery cause Library of Virginia Index No. 1839-007 [https://www.lva.virginia.gov/chancery/full_case_detail.asp?CFN=065-1839-007#img]\n\nWhen: 16 Feb 1839\n\nWhere: Arkansas (probably St Francis Co)\n\nWhat: Mary Elizabeth Flanagan is born in AR. She married Samuel Weeks in 1853 in Alcorn County, MS and moved to San Bernardino CA and later to Los Angeles. She died in 1924 in Los Angeles, and her death certificate names her parents as John Flanagan and Mary Yancy. Their places of birth are given as SC and Unknown, respectively (provided by Lydia Simpson, her daughter), but in her census records she gives her father’s birthplace as VA and her mother’s as SC.\n\nSource: Death Certificate, Mary Weeks Stuart; California State Board of Health Local Registered No. 4129 [https://www.familysearch.org/ark:/61903/3:1:3QSQ-G9SV-92BK?i=1479&cc=2001287]\n\nWhen: 23 Apr 1839\n\nWhere: Madison, St Francis Co AR\n\nWhat: John and Ann’s daughter Susan Rebecca marries Isaac Mitchell. “At Madison, St. Francis county, on 23d ult., Isaac Mitchell, Esq., Clerk of that county, to Miss Flanagim, eldest daughter of Maj. John Flanagim, all of that place.”\n\nSource: Weekly Arkansas Gazette, Little Rock, Arkansas, 8 May 1839, page 3 https://www.newspapers.com/clip/104571169/marriage-announcement-isaac-mitchell/?xid=637\n\nWhen: 1840\n\nWhere: Tishomingo Co MS\n\nWhat: Mary Yancey Flanagan has 2 brothers living in Tishomingo C MS – James and Bartlett\n\nSource: 1840 US Federal Census, Mississippi, Tishomingo Co, p 3 lines 3 and 5 [https://www.familysearch.org/ark:/61903/3:1:33S7-9YBC-YKV?i=6&cc=1786457&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AXHTX-GH7]\n\nWhen: 1840\n\nWhere: Franks Twp, St Francis County AR\n\nWhat: US Federal Census, entry for John Flanagan\n\nSource: Year: 1840; Census Place: Franks, St Francis, Arkansas; Roll: 20; Page: 199; Family History Library Film: 0002474 [https://www.familysearch.org/ark:/61903/1:1:XHBX-2RS?from=lynx1UIV8&treeref=K2XP-2XY]\n\nMales\n\n2 – <5 yrs\n\n1 – 5<10 yrs (Thomas W Flanagan)\n\n1 – 10<15 (John Y Flanagan)\n\n1 – 15<20 (William J Flanagan)\n\n4 – 20<30\n\n1 – 40<50 (John)\n\nFemales\n\n1 – 5<10 yrs (Mary Elizabeth Flanagan)\n\n2 – 20<30\n\n1 – 30<40 yrs (Mary Yancey Flanagan)\n\nSlaves 4 males and 3 females\n\nEmployed in agriculture: 5\n\nEmployed in manufactures and trade: 1\n\nEmployed in Learned Professions and Engineers: 2\n\nSince Ann was born about 1795, if she were still living, she would fall into the same age bracket as John: 40<50; therefore, since the eldest female (presumably John’s wife) is in the 30<40 age bracket, it presents further proof that Ann died and John has remarried, and Mary Yancey fits into the 30<40 age range.\n\nThis is a house full of people. I don’t believe all these individuals are children of John and Ann or Mary. There are 2 individuals who are engaged in “Learned Professions and Engineers,” and I have serious doubts that John’s children received any sort of formal schooling outside of rural public schools. The males in the 20<30 bracket are probably individuals living at John’s household, and the 2 females in the 20<30 bracket are probably wives of 2 of those men.\n\nJohn appears on the first line of the page of this census. On the third line is Isaac Mitchell, the first husband of John’s daughter Susan Rebecca. Isaac falls into the age bracket of 20<30, while the eldest female in the household is in the 15<30 age bracket, and this would fit John’s daughter Susan Rebecca. In Isaac’s household there is also a male child under 5 years of age. It is of interest to note that there are Isaac Mitchell’s in Giles Co TN as well, but they are still in Giles Co TN after this Isaac Mitchell has gone to Arkansas, but it should be noted that the 1850 census for him shows he was born in TN; the Susan Rebecca Flanagan analysis should be consulted for more details.\n\nWhen: 1844\n\nWhere: Virginia-Alabama-Mississippi\n\nWhat: In a Fluvanna County VA chancery suit, Benjamin J Flanagan brings a suit against his uncle Simpson B Flanagan to recover money from notes that he had given to Simpson to collect for him in Alabama. Apparently what money Simpson was able to recover, he ended up spending due to financial hardship. In the suit file (the complete chancery case file is at the Library of Virginia and available online), is a letter from Simpson to Benjamin dated 17 Mar 1844 at Limestone County AL. Simpson writes:\n\n“…I received a letter from Brother John about four weeks past the first time we have heard of him in near three years. He has as usual been unfortunate. Lost four of his children & has been sick him self since last June. he wrote me he wanted to come to my house and stay the Summer for his helth. I shall look for him in a month he lives on the yazoo river in missippi..I am very Willing to Summer him if by so doing I can get him to stop the cracks of his cabbin with clay I have no doubt but you will do so tell John H I hope he will do so…”\n\nSource: Fluvanna Co VA Chancery case 1851-010, Benjamin C Flanagan vs S B Flanagan etc, Library of Virginia, Richmond Call No. 065-1851-010 [https://www.lva.virginia.gov/chancery/case_detail.asp?CFN=065-1851-010]\n\nThis passage about John is tragic. He’s lost 4 children in the past 3 years and, very telling, Simpson says John has been “as usual unfortunate.” We can only infer the unfortunate circumstances surrounding John based on what we know, but some items we can list from this letter and other sources are:\n\nFour of his children died between 1841 and 1844.\n\nHe lost his wife Ann Saunders in VA or TN between 1824 and 1827.\n\nSince I cannot locate record of further transactions regarding his 250 acres of Yancey land in Giles Co TN, he may have lost that property due to failure to pay the 3 notes to Thomas Martin.\n\nAccording to ELF’s family group sheet for John Flanagan, his great-grandson Claiborne McDonald wrote to ELF in 1961 that, according to John’s son William J, John had purchased a farm in Lynchburg VA on the James River, but when dams were built on the river, it flooded his land and he lost the farm and was never able to recover financial recompense for the loss. I have not been able to locate any evidence of this, but there is no reason to doubt it. When this incident occurred I cannot say, but probably sometime between 1824 and 1827…between leaving Fluvanna Co VA and moving to Giles Co TN.\n\nHis health was in such a poor state that he felt the need to travel to his brother in Limestone Co AL to live in the Spring of 1844 in hopes of recovering.\n\nLastly, Simpson’s last statement is a mystery, “I have no doubt but you will do so tell John H I hope he will do so.” Is he asking Benjamin to write John to encourage him to summer with Simpson? Who is John H? Did our John Flanagan have a middle initial “H”?\n\nAt the same time of the date of this letter, a chancery suit was being pursued in Louisa County VA over a land dispute among family members concerning property once owned by John Flanagan’s grandfather (James Flanagan d. 1752 in Louisa Co VA). In the suit, John and Benjamin and Benjamin’s siblings were suing John’s other siblings over division of James’s property. Benjamin and his siblings were not the same generation as John; they were the children of John’s deceased brother, James W Flanagan (d. 1842). Because of this suit, Simpson probably felt certain that Benjamin would be in touch with John and would encourage him to spend the summer with Simpson.\n\nWhen: 1844 (circa)\n\nWhere: Mississippi\n\nWhat: Daniel W Flanagan is born in Mississippi\n\nSource: 1850 census, Limestone Co AL, p 36a [https://www.familysearch.org/ark:/61903/3:1:S3HY-6S2F-TV?i=73&cc=1401638&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AMH5S-FX2]\n\nWhen: 1845\n\nWhere: Rankin County MS\n\nWhat: John Flagin appears on the Mississippi State Census of 1845. In this household are 2 males and 4 females\n\nSource: 1845 Mississippi State Census Returns, Rankin County, page 5 [https://www.familysearch.org/ark:/61903/3:1:33S7-9PWR-F4?from=lynx1UIV8&treeref=K2XP-2XY&i=4]\n\nWhen: 1845\n\nWhere: Rankin County MS\n\nWhat: John Flanagan appears on the personal property tax list\n\nSource: Rankin Co MS Personal Property Tax Lists 1845 Box 3759 [https://www.familysearch.org/ark:/61903/3:1:33S7-9PGL-9RHX?from=lynx1UIV8&treeref=K2XP-2XY&i=8]\n\nHe is taxed for a clock valued at $20, 1 white poll tax, 4 slaves ages 6-59, 3 slaves under age 5.\n\nWhen: 19 Jan 1846\n\nWhere: Rankin County, MS\n\nWhat: William J, son of John and Ann (Saunders) Flanagan, marries Julia A M Seymour (daughter of John Fletcher Seymour and Rachel Rebecca Abernathy)\n\nSource: Bible and Cemetery Records, Birmingham Genealogical Society, 1962, p. 39, Flanagan Family Bible [https://archive.org/details/biblecemeteryrec00birm/page/n81/mode/2up]\n\nWhen: 1845 to 1 Jun 1848\n\nWhere: Unknown\n\nWhat: Has Mary divorced John? Or did he die and she remarry?\n\nSource: See 1848, 1853 event involving Daniel, Thomas, Mary and John Flanagan.\n\nWhen: Before 1 Jun 1848\n\nWhere: Unknown and Giles Co TN, Limestone Co AL\n\nWhat: Mary has remarried to a Williams as evidenced by the 1850 census (see later entry) and the land grant shown below.\n\nSource: See next two entries.\n\nWhen: 1 Jun 1848\n\nWhere: Limestone Co AL and Giles Co TN\n\nWhat: Mary Ann Williams of Giles Co TN is granted land in Limestone Co AL: NE1/4 SW1/4 S9 T1 R4W\n\nSource: US Dept of the Interior Bureau of Land Management General Land Office Records, Certificate 12830, Mary Anne Williams of Giles County Tennessee [https://glorecords.blm.gov/details/patent/default.aspx?accession=AL3630__.170&docClass=STA&sid=eoj4iztu.vfv#patentDetailsTabIndex=1]\n\nThis location is very close to the Tennessee border of Giles County TN.\n\nWhen: 1 Jun 1850\n\nWhere: Limestone Co AL\n\nWhat: Mary A Williams and 3 Flanagan children enumerated on the US Census\n\nSource: 1850 census, Limestone Co AL, p 36a [https://www.familysearch.org/ark:/61903/3:1:S3HY-6S2F-TV?i=73&cc=1401638&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AMH5S-FX2]\n\nMary Ann Williams, 42, b. NC\n\nJohn Y Flannagan, 23, b. TN\n\nMary E Flannagan, 11, b. AR\n\nDaniel W Flannagan, 6, b. MS\n\nWhen: 1 Jun 1850\n\nWhere: Limestone Co AL\n\nWhat: US Census Slave Schedule\n\nSource: 1850 US Federal Census Slave Schedules, Limestone Co AL [https://www.ancestry.com/imageviewer/collections/8055/images/ALM432_20-0173?pId=234573]\n\nMary M Williams\n\n1 Female age 38 (black)\n\n1 Male age 15 (black)\n\n1 Male age 11 (black)\n\n1 Male age 8 (mulatto)\n\n1 Male age 7 (black)\n\n1 Female age 6 (black)\n\n1 Male age 3 (mulatto)\n\nWhile the middle initial “M” conflicts with the census (though it agrees with the Fluvanna Co VA deed record), the neighbors on the slave enumeration sequentially match those on the regular census (Jeremiah Jacobs, James Brundridge)\n\nWhen: Aft. 1 Jun 1850 but Bef. 26 Jun 1850\n\nWhere: Limestone Co AL (probably)\n\nWhat: George Williams is born\n\nSource: See entry for 28 Oct 1850\n\nWhen: 26 Sep 1850\n\nWhere: Limestone Co AL\n\nWhat: Mary A Williams has died. Probate Court 26 Sep 1850\n\nSource: Limestone Co AL Probate Minutes Vol S p 24; Note: Not available on familysearch.org [https://www.ancestry.com/imageviewer/collections/8799/images/007652233_00860]\n\nWilliam G Roberson (neighbor to Mary Ann Williams in 1850) granted letters of administration on the estate of Mary A Williams, late of Limestone Co, deceased. “She has been dead for the space of more than three months and no one of the Heirs has applied for letters of administration. Enters bond of $400, George H Roberson surety.” James Hodges, Ephraim Evans, William A Andrews, Preston Morris, and Asa Graham appointed to appraise Mary’s estate. Public sale of Mary’s personal property is ordered by the court.\n\nWhen: 28 Oct 1850\n\nWhere: Limestone Co AL\n\nWhat: Probate Court 28 Oct 1850\n\nSource: Limestone Co AL Probate Minutes Vol S p 35; Note: not available on familysearch.org [https://www.ancestry.com/imageviewer/collections/8799/images/007652233_00865]\n\nThe appraisers of Mary’s estate returned their valuation. Roberson files his account of the sales of Mary’s estate. Roberson petitions the court to sell Mary’s real estate:\n\n“It is ordered by the Court that Citation issue to the Heair of said decd requiring him to be and appear before the Judge of this Court at the Courthouse…2nd Monday in December Next and show cause if any he can why the Prayer of said Petitioner should not then be granted. And it is further ordered that Alex S McKinney be appointed Guardian ad litem of George Williams Infant child of said deceased to defend him in this behalf.”\n\nWhen: 9 Dec 1850\n\nWhere: Limestone County AL\n\nWhat: Mary A Williams’ admr vs Heirs of Mary A Williams on a Petition to sell real estate\n\nSource: Limestone Co AL Probate Minutes Vol S p 52; Note: not available on familsearch.org [https://www.ancestry.com/imageviewer/collections/8799/images/007652233_00874]\n\n“This day came the petitioner and this cause coming on to be heard on the Petition answer and the Deposition filed in the cause, And it appearing to the satisfaction of the Court that the Prayer of the petitioner should be granted. It is ordered and decreed by the Court that William G Robinson expose to public sale administrator of the Estate of Mary A Williams deceased Expose to public sale according to Law the Real Estate in said Petition Mentioned to wit, the North East quarter of the South West quarter of Section Nine in Township one Range four Containing Thirty Nine and 94/100 [74/100?] acres, on a Credit of Twelve Months first giving at least forty days notice of the time and place of said Sale…and that he Make due Report thereof to this Court within the time limited by law.”\n\nI would love to see this deposition!\n\nWhen: 4 Aug 1851\n\nWhere: Limestone County AL\n\nWhat: John Y Flanagan marries Rebecca F McMasters, marriage performed by S. B. Flannagan\n\nSource: Limestone Co AL Marriage Book 1832-1862 no. 2510 p 655 [https://t2a6aafcfaed629fe.starter1ua.preservica.com/uncategorized/IO_737e2551-df5c-4c89-822f-f45775b9a780/]\n\nFrom the marriage record, it is not certain in what capacity Simpson B Flanagan was acting when he performed the marriage. At one time he was a county commissioner and a justice of the peace.\n\nSide note: It may be that Rebecca F McMasters is Rebecca F Yancey who married Jonathan McMasters (this is not proven by any documentation; there are a couple website entries that state Rebecca Frances Yancey, daughter of Alfred Moore Yancey, married Jonathan McMasters, and there is no additional information about her on that page except that she died 6 Jul 1885 in New Orleans LA and that Jonathan died before 1850. There are two sources that I have combined for this information: https://www.wikitree.com/wiki/Yancey-1645 and https://yanceyfamilygenealogy.org/alfred2.htm. Neither cite sources, so the information should be used with caution.\n\nWhen: 1 Mar 1852\n\nWhere: Limestone Co AL\n\nWhat: John Y Flanagan enters a trust deed for $105 with Simpson B Flanagan as trustee and Presly Hobbs as creditor. The security is a slave boy named Ben, about 13 years of age. If John does not pay the amount due Hobbs, Simpson will sell Ben, pay Hobbs $105 and give any excess to John; if the sale of the slave does not satisfy the debt, Simpson agrees to pay the difference. In the margin, notation is made that Hobbs received payment on Jan 23, 1853.\n\nSource: Limestone Co AL Deed Book 8, p 574 [https://t2a6aafcfaed629fe.starter1ua.preservica.com/uncategorized/IO_16baa369-76b6-4560-9195-99bd2f463543/]\n\nThe due date given in the deed is the same date that the deed was made, so I think it’s an error and the due date should be Mar 1, 1853.\n\nIs Ben the male slave enumerated under Mary M Williams in 1850 who is age 11? Probably.\n\nWhen: 2 Nov 1853\n\nWhere: Tishomingo Co MS\n\nWhat: Mary Flannigan (daughter of John and Mary) marries Samuel Weeks\n\nSource: Tishomingo Co MS Marriage Bonds 1850-1853 (1852-1855) p 389 [https://www.familysearch.org/ark:/61903/3:1:3QS7-99KW-P9Q2?i=4&cat=244294]\n\nWhen: 14 Dec 1853\n\nWhere: Tishomingo Co MS\n\nWhat: Thomas W Flanagan is granted guardianship of his brother Daniel W Flanagan\n\nTishomingo Co Probate Book 5 p 135-136, 14 Dec 1853 court:\n\nSource: Tishomingo Co Probate Book 5 p 135-136 [https://www.familysearch.org/ark:/61903/3:1:3QS7-L9QC-DP9N?i=73&cc=2036959&cat=255679]\n\n“The petition of Thomas W Flanngan shows that John Flanagan late of the county of Madison in said state deceased left one child to wit Daniel W Flanagan who is now a minor under the age of fourteen years That said minor is entitled as heir at law of the said John Flanagan deceased who died intestate to a small real and personal estate estimated at one hundred fifty dollars for said heirs share and your petitioner is advised that a legal guardian is necessary for the protection of the interest of said minor therein.\n\n“Your petitioner would further represent that Mary M Flanagan is the mother and natural guardian of said minor has relinquished her right to letters of guardianship under the statute and your petition being one of the next of kin and therefore entitled under the statute to letters of guardianship of said minor\n\n“Your petitioner moved by his natural love and affection and anxious to secure and protect all the rights of said minors at law in the distribution of said estate of said decedent Therefore prays that letters of administration…“\n\nTishomingo Co Probate Book M, Dec 1853 term:\n\nSource: Tishomingo Co Probate Book M, Dec 1853 term [https://www.familysearch.org/ark:/61903/3:1:3QS7-L9QC-8HYB?i=222&cc=2036959&cat=255679]\n\n“Upon reading and filing the petition of T W Flanagan. It appearing to the satisfaction of the court that he is the brother of the said Daniel W. Flanagan, and that said minor is under the age of fourteen years, It is ordered that Letters of guardianship be granted to the said T W Flanagan of the person & estate of the said Daniel W., …”\n\nIf the value of John’s estate is equal to $150 per heir, and we consider the following children that we know of are living – William, Rebecca, John Y, Thomas W, Mary, Daniel – then the estate is estimated at $900. If baby George is still living, he would not be an heir since John was not his father.\n\nIt is interesting that Thomas mentions Mary as Mary Flanagan.\n\nI have been reviewing the Madison Co probate books page by page and have found nothing about John’s estate. Also, the index to the Tishomingo records indicate there is a further record in Book P (begins 1859/60), but that book is not available online.\n\nWhen: 17 Feb 1855\n\nWhere: Limestone County AL\n\nWhat: William G Robinson, Administrator of the Estate of Mary Ann Williams deceased sells to James Andrews for $160, Mary’s property described as NE1/4 SW1/4 S9 T1 R4W, 40 12/100 acres.\n\nSource: Limestone Co AL Deed Book 9 p 349-350 [https://t2a6aafcfaed629fe.starter1ua.preservica.com/uncategorized/IO_fce62984-e428-4a6d-9bb9-523b410c138b/]\n\nWhen: 1855\n\nWhere: Franklin Co AR\n\nWhat: Mary Williams is taxed for 160 acres of land\n\nSource: Franklin Co AR tax list, 1855 [https://www.familysearch.org/ark:/61903/3:1:3Q9M-CSTT-ZSSF-S?i=231&cat=636459]\n\nHer brother Bartlett Yancey is also taxed for land, under the list of non-resident owners.\n\nWhen: 1 Sep 1856\n\nWhere: Franklin Co AR\n\nWhat: Mary Williams enters land grant in Franklin Co AR, T9 R28W, NW qtr of Section 35\n\nSource: US Dept of the Interior Bureau of Land Management General Land Office Records, Certificate 12830, Mary Williams of Franklin County Arkansas [https://glorecords.blm.gov/details/patent/default.aspx?accession=AR1820__.351&docClass=STA&sid=ts0fyqj4.5lo#patentDetailsTabIndex=1]\n\nI am working on tracking the disposal of this property, whether by deed, probate or some other means, such as tax sales, to see if any children were involved.\n\nWhen: 26 Oct 1856\n\nWhere: Franklin Co AR\n\nWhat: Mary Williams age 47 marries William Northum age 64\n\nSource: Franklin Co AR Marriage Book AA p 152 [https://www.familysearch.org/ark:/61903/3:1:S3HT-XH1Q-2DK?i=188&cc=1417439&cat=265160]\n\nSource: Franklin Co AR Probate Packets 1835-1958 (there are 53 pages in this probate packet) [https://www.familysearch.org/ark:/61903/3:1:3QS7-89W3-RV8Y?i=220&wc=M7QX-2WG%3A353228001%2C353461501&cc=2061549]\n\nThe index to the marriage book says “Mary” while the actual record looks like “May.” William’s probate record shows that “Mary” is correct.\n\nWhen: 1856 (circa)\n\nWhere: Arkansas\n\nWhat: Sarah E Weeks, daughter of Samuel Weeks and Mary E Flanagan is born\n\nSource: 1860 US Census, San Bernardino City, San Bernardino Co CA p 20 [https://www.familysearch.org/ark:/61903/3:1:33SQ-GYBP-V2Y?i=19&cc=1473181&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AMDKX-YT8]\n\nWhen: 1860\n\nWhere: Sebastian County AR\n\nWhat: Bartlett Yancey (brother of Mary Yancey Flanagan) enumerated in Sebastian Co AR, which is immediately SW of Franklin Co, the two counties sharing a section of border\n\nSource: 1860 US Census, Bates Twp, Sebastian Co AR, p 132 [https://www.familysearch.org/ark:/61903/3:1:33SQ-GYBF-9YT8?i=6&wc=7QJZ-P4Q%3A1589422280%2C1589422697%2C1589422864&cc=1473181]\n\nWhen: 1860\n\nWhere: Franklin Co AR\n\nWhat: Daniel Flanagan (age 15 b MS) appears in the household of Mary Northum (age 50 b NC) in Franklin Co AL. Mary owns land valued at $200 and personal property valued at $550; the slave schedule shows Daniel (not Mary) owning 3 slaves Female age 40, Male age 8, Male age 5.\n\nSource: 1860 US Census, Mill Creek Twp, Franklin Co AR p 93 [https://www.familysearch.org/ark:/61903/3:1:33SQ-GYB2-9XN7?i=1&cc=1473181&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AM8WM-T53]\n\nWhen: 1860\n\nWhere: Limestone Co AL\n\nWhat: John Y Flanagan enumerated Limestone Co AL with wife Rebecca and a nine month old male child, name enumerated as “unknown.”\n\nSource: 1860 US Census, District No. 2, Limestone Co AL, p 92 [https://www.familysearch.org/ark:/61903/3:1:33SQ-GYBD-9M1B?i=91&cc=1473181&personaUrl=%2Fark%3A%2F61903%2F1%3A1%3AMHDP-C6P]\n\nWhen: 1861\n\nWhere: Franklin Co AR\n\nWhat: William Northum dies, and Mary is administrator of his estate.\n\nSource: Franklin Co AR Probate Packets 1835-1958 (there are 53 pages in this probate packet) [https://www.familysearch.org/ark:/61903/3:1:3QS7-89W3-RV8Y?i=220&wc=M7QX-2WG%3A353228001%2C353461501&cc=2061549]\n\nIn the probate case file, there is mention of their having separated, which explains why they aren’t living together in 1860.\n\nWhen: 1863\n\nWhere: Limestone Co AL and Chattanooga TN\n\nWhat: John Y Flanagan is conscripted (drafted) into the Confederate army 29 Aug 1863 at Limestone Co AL and captured at Chattanooga by the Union army 24 Oct 1863. He was taken to the POW camp at Louisville KY, and at that place he takes the oath of allegiance to the USA in November and is ordered to go north of the Ohio River until further orders. Another document concerning John says he took the oath of allegiance and deserted.\n\nSource: https://www.fold3.com/image/251574490 – there are 2 images for John Y Flanagan.\n\nSource: For the POW camp ledger record, see https://www.familysearch.org/ark:/61903/3:1:33S7-95SN-Q3Q?i=199&wc=M8VN-9NL%3A203216001%2C203227301&cc=1916234\n\nSource: US Civil War Prisoner of War Records 1861-1865, ancestry.com [https://www.ancestry.com/imageviewer/collections/1124/images/M598_39-0112?pId=261681]\n\nWhen: 18 Sep 1866\n\nWhere: Franklin Co AR\n\nWhat: D W Flanagan age 21 marries Catherine McFerren age 19\n\nSource: Arkansas, County Marriages, 1837-1957, familysearch.org, DGS 4401662, entry for D W Fanagan and Catherine McFerren Arkansas, County Marriages, 1837-1957; https://familysearch.org/ark:/61903/3:1:S3HT-XH1Q-KBS?cc=1417439&wc=QDM2-H65%3A1589733567\n\nWhen: Jun 1869\n\nWhere: Franklin Co AR\n\nWhat: Bartlett Yancey (Mary Yancey Flanagan’s brother) dies per the 1870 mortality schedule\n\nSource: Ancestry.com – U.S., Federal Census Mortality Schedules, 1850-1885\n\nWhen: 1870\n\nWhere: Franklin Co AR\n\nWhat: Daniel Flanagan is enumerated as “Robert” age 23 b. AR on the 1870 census for Franklin Co AR. In the household is wife Catherine age 23 b. AR and daughter Mary age 1. Also in the household is Mary Northan age 58 b. TN. Enumerated immediately below is the household of John Flanagan age 40 b. TN and wife Loucinda age 35 b. TN.\n\nSource: United States Census, 1870; https://familysearch.org/ark:/61903/3:1:S3HY-DRLQ-8P4?cc=1438024&wc=K2F7-VZ9%3A518654201%2C518793501%2C518724901\n\nIs perhaps John Y Flanagan joining the family in Arkansas? Where has he been since deserting the army in 1863? He does not appear on the Mill Creek Twp AR tax lists in 1870 or surrounding years, and if he was a resident he would have at least been taxed for a poll. Was he just passing through? Where did he go?\n\nNotes and Questions:\n\nRegarding Simpson’s 1844 letter in which he states John is living on the Yazoo River in MS, there are 7 counties through which the Yazoo flows: Leflore, Holmes, Humphreys, Yazoo, Sharkey, Issaquena, Warren; these counties need to be searched.\n\nMary and John’s daughter Mary and her husband Samuel Weeks named a son “Simpson Brooks Weeks.” Could this somehow tie in with her uncle, Simpson B Flanagan; he seems to have been quite kind to John and his family. And was Simpson B Flanagan’s middle name Brooks?\n\nThe 28 Oct 1850 probate record: This heir mentioned in the singular must be the infant George Williams mentioned in the same court entry, whose guardian is Alexander McKinney, and who was probably not previously recorded in Mary’s estate records. The suit brought by Robison implies multiple heirs (Mary A Williams admr vs. Heirs of Mary A Williams), so it is certain that other children have been recorded.\n\nNone of the deed indexes are available online, and almost none of the probate records for Limestone Co have been indexed, so page-by-page review is required. A probate book covering 1854-1856 that is key to this research is lost, per the Limestone Co AL Archives website. I have not finished paging through the probate records that still exist and hope to find additional information about Mary’s estate.\n\nThe inventory and sales records for Mary’s estate do not exist in the county court’s collection of records. In fact, there are no record books at Limestone Co for inventories and sales of any kind, unless they are contained in an estate file – but estate files prior to 1865 do not exist, at least online. Limestone Co had a destructive courthouse fire in 1862, per familysearch.org wiki.\n\nWhat happened to George Williams, infant of Mary and her unknown husband Williams?\n\nStating the obvious, the probate records for Mary Williams in Limestone County AL are problematic in that we also find Daniel W Flanagan living with Mary Northum (remember Mary Williams married William Northum in Franklin Co AR in 1856) in Franklin Co AR in 1860 and 1870. Did she die, or just desert? The records of land sale by William Robinson (estate administrator) matches the land patented by Mary Williams in 1848. But is this deceased Mary Williams the same Mary who was the mother of John Y, Mary E, Thomas W and Daniel W? Because the probate files don’t exist, it may be next to impossible to find out. I have always wondered how young Daniel would have ended up all the way out in Arkansas at such a young age, on his own. Finding the marriage record for William Northum and Mary Williams was an “aha” moment, but it doesn’t resolve the conflict with the probate records in Limestone County. Remember, none of the Limestone probate records name heirs except for one George Williams."}, {"url": "https://wiki.alquds.edu/?query=William_J._Flanagan_Jr.", "page_content": "American admiral\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1][2]\n\nEarly life and education [ edit ]\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3][5]\n\nNaval career [ edit ]\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5][6]\n\nMilitary awards [ edit ]\n\nU.S. Military decorations"}, {"url": "https://www.psychologicalscience.org/observer/john-clemans-flanagan-pioneering-psychologist-1916-1996", "page_content": "John C. Flanagan’s more than 60 years of leadership and educational research leave an invaluable legacy to behavioral scientists, especially to those who work in organized settings. He laid plans for and successfully carried out several projects of unprecedented magnitude, often employing newly developed methodology and always aimed directly at the improvement of human performance. His careful planning and continuing insistence on quality performance. His careful planning and continuing insistence on quality performance both of himself and his staff resulted in many usable products and provided excellent training for young researchers.\n\nJohn was born on January 7, 1906, into what became a family of six children. His mother was a teacher and his father a clergyman whose liberal views did not suit conservative congregations which he severed, so the family relocated often.\n\nAn early demonstration of John’s powers of persuasion, fueled with his passion to play football, enabled him to get his parents’ approval to stay out of school a year in the hops of growing enough during his senior year to make this high school team. During his freshman year in the School of Engineering at the University of Washington, he made his numerals on the freshman team. Because electrical engineering labs conflicted with football practice, John transferred to the School of Education, majoring in physics and minoring in math. His athletic ambition was finally realized as starting quarterback on the Washington varsity in his senior year.\n\nAfter receiving his BS degree in 1929, he coached a high school football team and taught math. Nourishing his growing interest in measurement, John attended a seminar at Yale during the summer of 1931, led by prominent figures such as E.L. Thorndike and Truman L. Kelley. On return to Seattle, his MA was awarded in 1932 followed by an offer of an assistantship at Harvard from Kelley, under whom he received his PhD in mental measurement in 1934. John got ajob at the Cooperative Test Service and also worked on a project for the Army Air Corps. As an interviewer on this project, John hired an Air Corps Captain on leave at the time. As OUr entry into the war seemed imminent, the Air Corps began to expand rapidly. John’s former employee, Captain Griffiss, was promoted to major and made head of the research division in the Air Force’s Medical Corps. He recommended Flanagan as the “practical psychologist” the Air Corps needed to develop a new program of selection and classification that would identify trainees capable of learning to fly. John went on active duty on July 15, 1941, assembled a staff, and directed theAviation Psychology program throughout World War II. After the war, five members of his staff later became presidents of the American Psychological Association.\n\nThroughout the program, Colonel Flanagan insisted on careful and comprehensive validation of tests in the classification battery before introduction to the current battery. Most validation used the immediately available criterion: success in training. While such validation studies were routinely made, John himself sought measurable criteria of performance in combat as the ultimate criterion. For this purpose he was allowed to fly several missions over Europe with crews of the Eighth Air Force. Another critical validation effort was made when 1,000 trainees were given the full battery of tests, the scores of which were kept in confidence until the project was over. A clear relationship between “stanine” composite scores and subsequent performance emerged.\n\nThe research under Flanagan’s direction spanned almost the full range of psychology. After the war, a total of 19 volumes documenting the program’s work were printed and distributed by the Government Printing Office, providing a rich source of information on this, the largest psychological program undertaken up to that time.\n\nThe success of the Aviation Psychology Program led directly to Flanagan’s founding of the American Institutes for Research (AJR) in 1946. He did so with the encouragement and assistance of the University of Pittsburgh, where he had accepted a professorship. He purposefully created AJR as a not-for-profit organization to assure that “… its institutional objectives would not be complicated with the incentive for personal profits.” His objectives were “… to contribute to the science of human behavior and the fuller development and utilization of mankind’s capacities and potential.” The hallmark of his career was the ability to make ambitious plans and carry them out successfully.\n\nThe major expansion of air travel immediately following World War IT created a recruiting problem for the airlines. John responded by modifying the procedures used for the Army Air Force to reflect the requirements of the civilian sector and the new aircraft. For more than 20 years afterward, practically all of the major airlines relied on AIR to supply the data essential for the selection of pilots, copilots, and flight engineers.\n\nBeginning in 1915, the National Board of Medical Examiners in Philadelphia had administered, examined to be used in certifying doctors as being qualified to practice medicine. National Board tests were typically administered after the second and fourth years of the medical education program, and a third examination, Part III, was administered after the completion of the first year of residency. In 1959 the Part III examination was based on the observation of each candidate’s performance in examining real patients in hospital settings from coast to coast. The National Board has become dismayed with this test’s unreliability and turned to AIR for assistance. AIR quickly discovered that there was no precise definition of clinical competence and set out to create one by visiting hospitals and gathering from senior physicians several thousand reports of effective and ineffective medical practice, using Flanagan’s critical incident technique. AIR developed specifications for a new test relating test situations to the definition of competence. The National Board has used this model for the development of new Part III examinations since 1960.\n\nIn the 1960s, colonialism ended throughout Africa. The new nations had only a few individuals with education sufficient to meet the needs of an independent nation. The United States Agency for International Development established a large number of technical training institutes, but unfortunately, the Agency found that the performance of those selected for training was unsatisfactory. AIR was awarded a contract to solve the problem. The task was to identify- among those individuals who had grown up in a bush environment and could not read or write in any language- those who had the potential to become skilled technicians and possibly climb the ladder to a variety of advanced degrees. AIR’s program was successfully implemented in 19 developing countries.\n\nIn 1960 Flanagan initiated Project Talent, a massive survey of more than 400,000 high school students throughout the United States. To follow up on the needs revealed by project Talent, Flanagan developed Project PLAN-Program for Learning in Accordance with Needs, an entire curriculum from grades one through 12 designed to meet the individual needs of all students. This was one of the earliest and most comprehensive individualized computer-assisted learning programs.\n\nFollowing the PLAN project, Flanagan and his staff used his critical incident method to develop a “Quality of Life” scale that is still used in current research. In fact, the critical incident method has been used be researchers all over the world as a way of getting a sound start on new areas of research.\n\nAmong the honors Flanagan received were: Legion of Merit by the Army Air Corps, Raymond F. Longacre Award of the Aero-Medical Association, Edward Lee Thorndike Award of the APA Division of Educational Psychology, 1976 Distinguished Professional Contribution Award of APA, Phi Delta Kappa Award for Outstanding Contributions to Education, Development and Research, ETS Award for Distinguished Service to Measurement; Professional Practice Award of APA’s Division of Industrial/Organizational Psychology.\n\nJohn Flanagan met the objectives he stated, not only in AIR but in his personal life. He made substantial contributions to the science of human behavior and together with the talented staff he attracted to AIR, he improved the functioning of social institutions so that they could better help individuals achieve their personal goals as well as contribute to society."}, {"url": "http://everything.explained.today/William_J._Flanagan%2c_Jr./", "page_content": "William J. Flanagan Jr. Explained\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1] [2]\n\nEarly life and education\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3] [5]\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5] [6]\n\nMilitary awards\n\nU.S. Military decorations\n\nReferences"}]}