{"William J. Flanagan, Jr. is a member of the Democratic Party.": [{"url": "https://www.ualberta.ca/president/bill-flanagan-biography.html", "page_content": "Bill Flanagan became the 14th president and vice-chancellor of the University of Alberta in July 2020. Born and raised in Alberta, he has been recognized for his transformative and entrepreneurial leadership.\n\nAs soon as he was appointed, President Flanagan launched the largest and most ambitious program of academic and administrative restructuring ever undertaken by a Canadian university. With a vision for the University of Alberta for Tomorrow (UAT), he set the goal of turning the university’s acute financial pressures into a strategic transformation, repositioning the U of A for long-term success.\n\nWith the creation of an entirely new and university-wide operating model, UAT dramatically enhanced the efficiency of administrative services through the establishment of shared service centres and the introduction of new technologies. By 2023, the U of A will have permanently reduced its administrative costs by $127 million annually.\n\nWith the establishment of three new colleges — the College of Social Sciences and Humanities, the College of Natural and Applied Science, and the College of Health Sciences — the university grouped 13 existing faculties into three discipline-aligned colleges, with the goal of elevating interdisciplinary teaching and research with global impacts. With a more dynamic, nimble and aligned academic structure, the university is now positioned to be an even stronger driver of economic growth, innovation and creativity in Alberta, Canada and the world.\n\nWith UAT, a significantly higher proportion of funding and resources now goes directly into classrooms and research, generating greater impact while enabling the university to more quickly and collaboratively drive international research opportunities that address the world’s greatest challenges.\n\nThe transformation and associated savings achieved under UAT since 2020 are unprecedented in Canadian post-secondary history. The University of Alberta is now more sustainable, poised for ambitious enrolment growth and prepared to lead globally with purpose. Amid these profound changes, the university has continued to advance in international rankings, recently placing fifth in Canada and 92nd in the world — its best showing ever. The University of Alberta also ranked 11th globally in the 2022 Times Higher Education Impact Ranking, which assesses universities’ impact in relation to the United Nations’ Sustainable Development Goals.\n\nPrior to his appointment at the U of A, President Flanagan served as dean of law from 2005 to 2019 at Queen’s University in Kingston, Ont. Through his transformative vision during his tenure, he led major initiatives elevating the delivery of education in law: the establishment of the faculty’s PhD program; the founding of the Centre for Law in the Contemporary Workplace; a major expansion of the business law program; an online undergraduate Certificate in Law Program; an online Graduate Diploma in Legal Services Management, and a new online Graduate Diploma in Immigration and Citizenship Law.\n\nIn addition to his academic leadership roles, President Flanagan has an extensive record of service and engagement in the broader community. His dedicated work in support of HIV/AIDS research and initiatives has made him a well-recognized and respected public figure. He is the former chair and a current director of the Canadian Foundation for AIDS Research’s National Working Group and served as board chair of the AIDS Committee of Toronto — Canada’s largest community-based HIV service organization — as well as on the Ontario HIV Treatment Network and Canada AIDS Russia Project. In recognition of his community service, he was named to the Honour Roll of the Ontario AIDS Network in 2011.\n\nCurrently, President Flanagan is a member of the Universities Canada Research Committee. From 2011 to 2014, he was president of the Council of Canadian Law Deans and served on the National Action Committee on Access to Justice in Civil and Family Matters.\n\nPresident Flanagan holds a BA (English and Philosophy) from Carleton University, a JD from the University of Toronto, a DEA in International Economic Law from Université Paris I-Sorbonne, and an LLM from Columbia University. He joined the Faculty of Law at Queen’s University in 1991, where he founded the faculty’s International Law Program at the Queen’s University Bader International Study Centre at Herstmonceux Castle in the U.K. His scholarly work spans property law, corporate law and international trade law.\n\nBill Flanagan is married to his husband Saffron Sri, a registered dietitian who works in the healthcare sector.\n\nBiographie de Bill Flanagan\n\nBill Flanagan est devenu le 14ème président et vice-chancelier de l'Université de l'Alberta en juillet 2020. Né et ayant grandi en Alberta, il est reconnu pour son leadership transformateur et entrepreneurial.\n\nDès sa nomination, le président Flanagan a lancé le programme de restructuration académique et administrative le plus important et le plus ambitieux jamais entrepris par une université canadienne. Avec une vision pour l'Université de l'Alberta de demain (UAD), il a fixé l'objectif d’utiliser les pressions financières aiguës de l'université pour effectuer une transformation stratégique, repositionnant l'Université de l’Alberta pour un succès à long terme.\n\nAvec la création d'un nouveau modèle opérationnel entièrement nouveau et à l’échelle de l’université, l’UAD a considérablement amélioré l'efficacité des services administratifs en établissant des centres de services partagés et en introduisant de nouvelles technologies. D'ici 2023, l'Université de l’Alberta aura réduit de manière permanente ses coûts administratifs de 127 millions de dollars par an.\n\nAvec l’établissement de trois nouveaux collèges - le Collège des sciences sociales et humaines, le Collège des sciences naturelles et appliquées et le Collège des sciences de la santé - l'université a regroupé 13 facultés existantes en trois collèges alignés sur le plan disciplinaire, dans le but d'élever l'enseignement et la recherche interdisciplinaires aux impacts mondiaux. Avec une structure académique plus dynamique, agile et alignée, l'université est maintenant positionnée pour être un moteur encore plus fort de croissance économique, d'innovation et de créativité en Alberta, au Canada et dans le monde.\n\nAvec l’UAD, une proportion significativement plus élevée du financement et des ressources est désormais directement attribuée aux salles de classe et à la recherche, générant un impact plus important tout en permettant à l'université de conduire plus rapidement et de manière plus collaborative des opportunités de recherche internationales qui répondent aux grands défis du monde.\n\nLa transformation et les économies associées réalisées dans le cadre de l’UAD depuis 2020 sont sans précédent dans l'histoire de l'enseignement postsecondaire canadien. L'Université de l'Alberta est maintenant plus durable, prête pour une croissance ambitieuse des inscriptions et préparée à mener avec intention au niveau mondial. Durant ces changements profonds, l'université a continué à progresser dans les classements internationaux, se plaçant récemment au cinquième rang au Canada et au 92ème dans le monde - son meilleur classement jamais atteint. L'Université de l'Alberta s'est également placée au 11ème rang mondial dans le classement de l'impact de l’éducation supérieure du Times de 2022, qui évalue l'impact des universités par rapport aux objectifs de développement durable des Nations Unies.\n\nAvant sa nomination à l'Université de l’Alberta, le président Flanagan a été doyen de la Faculté de droit de l'Université Queen's à Kingston, en Ontario, de 2005 à 2019. Grâce à sa vision transformative pendant son mandat, il a dirigé des initiatives majeures visant à améliorer l'enseignement du droit : la création du programme de doctorat de la faculté; la fondation du Centre pour le droit dans le milieu du travail contemporain; une importante expansion du programme de droit des affaires; un programme virtuel de certificat de premier cycle en droit; un diplôme d'études supérieures en ligne en gestion des services juridiques; et un nouveau diplôme d'études supérieures en ligne en droit de l'immigration et de la citoyenneté.\n\nEn plus de ses fonctions de leadership universitaire, le président Flanagan possède un vaste palmarès de service et d'engagement dans la communauté plus large. Son travail dévoué en soutien à la recherche sur le VIH/sida et à des initiatives connexes l'a rendu célèbre et respecté dans le domaine public. Il est l'ancien président et le directeur actuel du Groupe de travail national de la Fondation canadienne de recherche sur le sida et a été président du conseil d'administration du Comité sur le sida de Toronto, la plus grande organisation de services communautaires pour le VIH du Canada. Il a également été membre du réseau de traitement du VIH en Ontario et du projet Sida-Canada-Russie. En reconnaissance de son service communautaire, il a été nommé au tableau d'honneur du Réseau ontarien de lutte contre le sida en 2011.\n\nPrésentement, le président Flanagan est membre du Comité de recherche d'Universités Canada. De 2011 à 2014, il a été président du Conseil des doyens de droit du Canada et a siégé au Comité d'action national sur l'accès à la justice en matière civile et familiale.\n\nLe président Flanagan est titulaire d'un baccalauréat en anglais et philosophie de l'Université Carleton, d'un baccalauréat en droit de l'Université de Toronto, d'un DEA en droit économique international de l'Université Paris I-Sorbonne et d'une maîtrise en droit de l'Université Columbia. Il a rejoint la Faculté de droit de l'Université Queen's en 1991, où il a fondé le programme de droit international au Centre d'études internationales Bader de l'Université Queen's, au château d'Herstmonceux, au Royaume-Uni. Ses travaux scientifiques couvrent le droit de la propriété, le droit des sociétés et le droit commercial international.\n\nBill Flanagan est marié à son époux Saffron Sri, un diététicien autorisé qui travaille dans le secteur de la santé."}, {"url": "https://www.dailypress.com/news/dp-xpm-19960513-1996-05-13-9605130049-story.html", "page_content": "Bud Flanagan isn’t all business. He just sounds that way.\n\nAs he should. Adm. William J. Flanagan Jr. is commander-in-chief of Atlantic Fleet, one of the Navy’s two largest commands. From his headquarters at the sprawling Norfolk Naval Base, he controls the destiny of 17 naval bases, 208 ships, 1,300 aircraft, 131,000 officers and sailors, and a $10 billion annual budget. His corporate equivalent would be the chief executive officer of the 130th-ranked Fortune 500 company.\n\nThe parallels don’t stop with the figures; Flanagan brings a distinctly businesslike approach to the command. At times, he sounds more like a CEO than a senior naval officer.\n\n“I want to be able to give the American public a better product for less money in the future,” Flanagan says. “I want us to become as efficient as we can. I want us to protect the investment that the generous American taxpayers have put in our hands.”\n\nFlanagan has plenty of commander in him, too – as well as a strict sense of right and wrong that grew naturally from his father, a lifelong policeman, and strong Roman Catholic roots. When he learned in October 1995 that the Navy had kept a 95-year-old York County woman from selling a parcel of property crossed by ancient, unused Navy railroad tracks, Flanagan wasted no words.\n\nHis response: “Fix it today.” It was.\n\nFlanagan, 53, looks both parts. Silver-haired, barrel-chested and sharp-eyed, he displays, despite a slight uneasiness at the interview process, a confident, commanding presence. Although he enjoys the trappings of his four-star position, friends say he’s no martinet. In fact, they say, he is a gregarious and highly social man.\n\n“I think he’s much easier going and more down-to-earth than most flag officers,” said retired Rear Adm. Maurice Bresnahan, an old school chum.\n\nThose qualities are reflected in his leadership style. Whether commanding a fleet, a ship, or overseeing the Navy’s dealings with Congress, Flanagan “believes in the family concept,” said Capt. Don Nash, twice a Flanagan associate and now top assistant to the deputy commander of U.S. Atlantic Command. Flanagan, Nash said, empowers people to do their jobs while encouraging them to work as a team. “He inspires people to do more than they think they can do,” he said.\n\n“Nobody doubts who the boss is, but nobody feels that they are subservient to him,” Nash said.\n\nWhile Flanagan may look the part, his “company” most assuredly does not. Unlike some CEOs, Flanagan doesn’t produce a tangible product for market. He turns out combat-ready aircraft carrier battle groups.\n\nFlanagan has six of these. Although the ships and crews already exist, they must be maintained, trained and ready to deploy every six months on a rotating basis.\n\nAmerican taxpayers incur an enormous expense for the services provided by Flanagan’s organization. Each carrier group’s 18-month cycle of preparation and deployment costs $500 million.\n\nIn addition to this huge expense, Flanagan must do as much as his predecessors with less; post-Cold War reductions have shrunk his fleet, but the Navy’s deployment schedule hasn’t changed. Those realities make Flanagan look hard at shaving costs and making his vast operation more efficient.\n\nFlanagan, a Harvard Business School graduate, has a strong affinity for concepts such as efficiency. “My view is that there’s a lot of principles involved in the business world that we need to employ,” he says.\n\nEfficiency is spelled two ways for Flanagan. One is at it is applied to the art of warfighting, practiced at its highest level.\n\n“If we’re going to bring this force somewhere to employ it in anger, it’s got to be able to do so at a very, very high rate of efficiency, and bring all our people home,” Flanagan said. “That’s really the goal.”\n\nThe other efficiency is strictly monetary. The fleet’s $10 billion budget and increasing pressure to reduce federal spending demand that money be saved wherever possible.\n\nBut while fiscal thriftiness has a strong appeal for Flanagan, he says it also produces benefits for the operational commanders who receive his forces.\n\n“The efficiencies that we’re able to realize will be passed on to these operational commanders in terms of force availability,” Flanagan says. “And I think that’s critical.”\n\nTo realize the savings, Flanagan said, the fleet is taking a fresh look at its accounting practices – the means it uses to calculate the “cost of goods sold.”\n\n“We know now what those are,” he said. “We’re in the process of building a management accounting system to better account for what it is we spend and how it is we spend it.\n\n“I think those are two very key things.”\n\nFlanagan is also saving money through more efficient management of his floating assets. His ships, unless laid up for extended maintenance, must spend six months of each 18-month cycle on overseas deployments to the Mediterranean. But Atlantic Fleet ships also patrol the Caribbean Sea and points further south, and conduct joint operations with allies in that region.\n\nFlanagan, who was 2nd Fleet commander prior to assuming the top job at Atlantic Fleet, realized that about 25 percent of his available forces were at any given time required to be at sea for Caribbean duty. So, he reasoned, “why don’t we build a force that operates exclusively in this region?”\n\nBy doing so, Flanagan said, the operators of those ships would become experts on the regional mission instead of spending additional time being trained for every possible contingency the Atlantic Fleet could face, the standard for ships preparing for Med cruises.\n\nThe result of that sort of thinking was the formation of the Western Hemisphere Group, a group of selected ships based in Mayport, Fla., that operates solely in Caribbean and South Atlantic waters.\n\n“I think that we improved the product, and I think that we did it at less cost,” Flanagan said.\n\nIn addition, Flanagan, along with his Pacific Fleet counterpart, Adm. Ronald J. Zlatoper, has created a fleetwide, money-saving training schedule for ships preparing to go overseas. By keeping his ships near the U.S. coast instead of sailing to the Caribbean for the third and final phase of their training, Flanagan shaves 3,000 miles off each ship’s round trip and cuts the time spent doing such training in half.\n\nFlanagan and Zlatoper have also combined efforts to streamline the two organizations’ training and operational procedures. Over the years, the two fleets, one based in Norfolk, the other in Pearl Harbor, Hawaii, had developed into distinct and separate cultures – so much so that, according to Zlatoper aide Capt. Steve Clawson, ships from the two fleets meeting at sea could not, as recently as 15 years ago, effectively communicate or work together.\n\nNow, that’s changing. “We decided that we would work together,” Zlatoper said recently. “Our predecessors started working to coordinate the two fleets, and we’ve continued that.”\n\nZlatoper gives Flanagan much of the credit for making the project a success. “From my estimation, he has really brought the flag officers of the surface fleet together better than anyone in my memory,” Zlatoper said.\n\nFlanagan could also gain future savings for his fleet by way of a previously proposed project that, although it remains in the planning stages, could have significant impact on Hampton Roads.\n\nFlanagan wants to combine public and private transportation assets to make the region a highly effective launching pad for massive numbers of troops en route to an overseas crisis. This “intermodal transportation system” would combine highway, rail, and port operations in a manner that would serve both military and commercial needs more efficiently.\n\nIn one example of cost-sharing, Flanagan would provide easements to Norfolk Naval Base property to allow the adjacent Norfolk International Terminal to expand its commercial operations. At the same time, NIT would take on the Navy’s cargo-handling operation, saving tax dollars.\n\n“The way I’m looking at it is, how can we do something that’ll benefit the military, and as a result benefit the United States, in terms of being able to mobilize if we have to with the greatest efficiency … at the same time, how can all of this benefit the community?” Flanagan said.\n\nThis sort of thinking is what has attracted the attention of the region’s business, civic and government leaders, who have included Flanagan on the organizing committee for the Hampton Roads Public/Private Partnership, a new group being organized in hopes of improving regional cooperation on economic issues. Flanagan says that given the Navy’s size here, that’s as it should be.\n\n“The Navy puts about $11 billion a year in this economy,” he said. “That’s a significant contribution, and it makes us the largest contributor of anyone in this region.”\n\nDespite his drive to maximize potential and efficiency, Flanagan takes the time to listen.\n\nHe says he believes in a workplace where honest dissent from the party line can be expressed without fear of retribution. His leadership style is deliberate, and stems from a sense of purpose that others say Flanagan possessed even as a young man.\n\n“He was always focused,” said Neil Nightingale, chief of police in the Cape Cod town of Barnstable, where Flanagan grew up. “He always knew where he wanted to go.” Nightingale worked for Flanagan’s father, the former deputy chief, from whom the son inherited the nickname “Bud.”\n\nNightingale remembers the younger Flanagan as “always well-behaved and polite. He was not a rowdy … he was always a straight arrow.”\n\n“I knew he was destined for big things,” said George Gillis, a friend and classmate of Flanagan’s at the Massachusetts Maritime Academy in nearby Buzzard’s Bay. “He was so personable, so disciplined, so dedicated. When he wanted something, he got it.”\n\nFlanagan spent some of his youthful summers caddying at a golf club frequented by the Kennedy clan. But in addition to walking the greens, he, like many other Cape Cod youths, worked on lobster and fishing boats. Both of his grandfathers were sea captains. Life at sea intrigued him.\n\nAt the maritime academy, Flanagan lived on a ship; dormitories weren’t then an option. “We did every single job a sailor does on a ship,” said Bresnahan, now the assistant to the academy president. “That stood me in good stead, and I’m sure it did Bud Flanagan.”\n\nThe course work didn’t come easy. “We had a tough regimen here, and he struggled like the rest of us,” Bresnahan said. “Academically. It’s a tough school. It didn’t come easy.”\n\nIn 1964, Flanagan graduated and set forth, armed with a degree in marine transportation and a 3rd Class Coast Guard license. While some of his classmates began their Navy careers, Flanagan chose to follow in the footsteps of his grandfathers and join the U.S. Merchant Marine. He served three years, sailing with American Export-Isbrandtsen Lines out of New York.\n\nMeanwhile, U.S. involvement in Vietnam had grown from an advisory role to full-blown war. In 1967, Flanagan accepted a full Naval commission and sailed west. He served on two ships during that war, and hasn’t looked back to civilian life.\n\nFlanagan was selected to be the 1973-74 Chief of Naval Operations Fellow, serving under Admirals Elmo R. Zumwalt and James L. Holloway III. In 1975, he commanded his first ship, USS Bronstein. In 1979, at age 35, he was named one of the U.S. Jaycees’ Ten Outstanding Young Americans – along with Vietnam War hero and Pittsburgh Steelers running back “Rocky” Bleier, and Arkansas Gov. Bill Clinton.\n\nThe following year, he began a three-year hitch as the first commander of the USS Kidd, a new class of guided missile destroyer. In 1988 – his 19th year of service – Flanagan was selected for promotion to rear admiral. He subsequently served as commander of Destroyer Squadron Five in San Diego and of the Norfolk-based Second Fleet. In October 1994, he assumed his present command, and donned his fourth star.\n\nFlanagan’s meteoric rise through the ranks makes some think he’s a logical candidate to rise even higher in the U.S. military hierarchy. But Flanagan downplays such possibilities, refuses to speculate on the future, and says he’s focused on his present work.\n\n“I didn’t come here to use this as a springboard to some other opportunity,” Flanagan says he has repeatedly told his staff, “but rather, just to make sure that we got this done as well as we could.”\n\nTHE FLANAGAN LEADERSHIP PHILOSOPHY\n\n1. Add wisdom from the top down. “In other words, if you know something, and obviously you do, because you’re in a senior position, then you’ve got to share that with your subordinates. When it comes time for them to take your position, they’ll do it not as well, but better than you.”\n\n2. Take fear out of the workplace. “It’s not a sin to make a mistake. We learn from them. It’s an attitude that if we approach this with openness, and goodwill, and moral purpose, we’ll get improvement.”\n\n3. You’ve got to have optimism. “The fleet’s as big as the fleet is right now. It’s the best fleet we’ve got. I’ve never heard a man win a fight that went into it thinking he was going to lose. I don’t think we’re going to lose anything, and we all need to think that way. We have a new Navy that’s restructured, and that’s important to have confidence in, and to build on.”\n\nADM. WILLIAM J. FLANAGAN JR.\n\nAge: 53\n\nOccupation: Commander of the U.S. Navy Atlantic Fleet\n\nHome: The Missouri House, Norfolk Naval Base\n\nFamily: Married to the former Barbara Ann Brendes. he has three daughters: Margaret, 18, Elizabeth, 22, and Kathryn, 23\n\nEducation: Bachelor’s degree in maritime transportation, Massachusetts Maritime Academy; Master’s degree in political science, American University; graduate, Harvard Business School\n\nAwards: Defense Distringuished Service Medal; Legion of Merit (4); Meritorious Service Medal with Gold Star; Navy Commendation Medal (2); Combat Action Ribbon; Meritorious Service Ribbon"}, {"url": "https://infogalactic.com/info/William_J._Flanagan,_Jr.", "page_content": "From Infogalactic: the planetary knowledge core\n\nAdmiral William J.ohn Flanagan, Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.[1][2]\n\nWilliam John Flanagan, Jr. was born in 1943[3]\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School.[4]\n\nCareer\n\nThe younger Flanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in Marine Transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of Second Mate. After three years of service with American Export Lines, Flanagan accepted a full commission with the U.S. Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as her first Commanding Officer. He had now advanced to the rank of Captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of Admiral and was assigned as Commander in Chief of the Atlantic Fleet (CINCLANTFLT). At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Admiral Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service. [5] [6]\n\nMilitary Awards\n\nU.S. Military decorations\n\nReferences\n\n↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ [1] ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found.\n\n\n\n\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>"}, {"url": "https://wiki2.org/en/William_J._Flanagan_Jr.", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican admiral\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1][2]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 1 962 11 099 2 607 622 3 123\n\nCommencement 2016\n\nPython With Spyder 13: For Loops\n\n2010 Quinnipiac University Undergraduate Commencement\n\nAcademic Achievement Recognition Evening (April 27, 2020)\n\n2011 Quinnipiac University Undergraduate Commencement Transcription\n\nEarly life and education\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3][5]\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5][6]\n\nMilitary awards\n\nU.S. Military decorations\n\nReferences"}, {"url": "https://peoplepill.com/people/william-j-flanagan-jr/", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.\n\nEarly life and education\n\nFlanagan was born in 1943. In addition to his bachelor's degree in marine transportation, Flanagan received a master's degree in political science from the American University and earned a degree from Harvard Business School.\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan accepted a commission with the United States Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.\n\nMilitary awards\n\nU.S. Military decorations"}, {"url": "https://prabook.com/web/william_j.flanagan/2910519", "page_content": "William J. Flanagan\n\nlawyer\n\nAugust 20, 1952 Elizabeth, New Jersey, United States\n\nWorked at Groom and Nordberg, Chartered. Admitted to the bar, 1977, Virginia. 1978, District of Columbia. Phi Beta Kappa. Articles Editor, American Criminal Law Review, 1976-1977. Law Clerk for Honorary Thomas A. Flannery, United States. District Judge for the District of Columbia, 1977-1978. Assistant Counsel for Regulations, United States. Department of Labor, Office of the Solicitor, Plan Benefits Security Division, Washington, District of Columbia, 1983-1986."}, {"url": "https://alchetron.com/William-J-Flanagan,-Jr", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.\n\nContents\n\nFlanagan was born in 1943\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School."}, {"url": "https://wiki.alquds.edu/?query=William_J._Flanagan_Jr.", "page_content": "American admiral\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1][2]\n\nEarly life and education [ edit ]\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3][5]\n\nNaval career [ edit ]\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5][6]\n\nMilitary awards [ edit ]\n\nU.S. Military decorations"}, {"url": "http://everything.explained.today/William_J._Flanagan%2c_Jr./", "page_content": "William J. Flanagan Jr. Explained\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1] [2]\n\nEarly life and education\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3] [5]\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5] [6]\n\nMilitary awards\n\nU.S. Military decorations\n\nReferences"}, {"url": "https://popularbio.com/william-j-flanagan-jr/", "page_content": "Updated On April 30, 2023\n\nWilliam J. Flanagan, Jr. estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is William J. Flanagan, Jr. in 2019-2020? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nWilliam J. Flanagan, Jr. was born in United States on March 27, 1943.\n\nOn Popular Bio, He is one of the successful Military Officer. He has ranked on the list of those famous people who were born on March 27, 1943. He is one of the Richest Military Officer who was born in United States. He also has a position among the list of Most popular Military Officer. William J. Flanagan, Jr. is 1 of the famous people in our database with the age of 76 years old.\n\nShort Profile First Name William Last Name Flanagan, Profession Military Officer Age 76 years old Birth Sign Aries Birth Date March 27, 1943 Birth Place United States Country United States\n\nWilliam J. Flanagan, Jr. Net Worth\n\nWilliam J. Flanagan, Jr. estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is William J. Flanagan, Jr. in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Military Officer William J. Flanagan, Jr.’s net worth is $1-5 Million at the age of 76 years old. He earned the money being a professional Military Officer. He is from United States.\n\nWilliam J. Flanagan, Jr.’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 Under Review Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Military Officer (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nWilliam J. Flanagan, Jr. current age 76 years old. William J. Flanagan, Jr.’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is William J. Flanagan, Jr. Dating?\n\nWilliam J. Flanagan, Jr. keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at William J. Flanagan, Jr. past relationships, ex-girlfriends and previous hookups. William J. Flanagan, Jr. prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About William J. Flanagan, Jr."}]}