{"William J. Flanagan, Jr. was a member of the Cranston City Council from 1990 to 2003.": [{"url": "https://www.dailypress.com/news/dp-xpm-19960513-1996-05-13-9605130049-story.html", "page_content": "Bud Flanagan isn’t all business. He just sounds that way.\n\nAs he should. Adm. William J. Flanagan Jr. is commander-in-chief of Atlantic Fleet, one of the Navy’s two largest commands. From his headquarters at the sprawling Norfolk Naval Base, he controls the destiny of 17 naval bases, 208 ships, 1,300 aircraft, 131,000 officers and sailors, and a $10 billion annual budget. His corporate equivalent would be the chief executive officer of the 130th-ranked Fortune 500 company.\n\nThe parallels don’t stop with the figures; Flanagan brings a distinctly businesslike approach to the command. At times, he sounds more like a CEO than a senior naval officer.\n\n“I want to be able to give the American public a better product for less money in the future,” Flanagan says. “I want us to become as efficient as we can. I want us to protect the investment that the generous American taxpayers have put in our hands.”\n\nFlanagan has plenty of commander in him, too – as well as a strict sense of right and wrong that grew naturally from his father, a lifelong policeman, and strong Roman Catholic roots. When he learned in October 1995 that the Navy had kept a 95-year-old York County woman from selling a parcel of property crossed by ancient, unused Navy railroad tracks, Flanagan wasted no words.\n\nHis response: “Fix it today.” It was.\n\nFlanagan, 53, looks both parts. Silver-haired, barrel-chested and sharp-eyed, he displays, despite a slight uneasiness at the interview process, a confident, commanding presence. Although he enjoys the trappings of his four-star position, friends say he’s no martinet. In fact, they say, he is a gregarious and highly social man.\n\n“I think he’s much easier going and more down-to-earth than most flag officers,” said retired Rear Adm. Maurice Bresnahan, an old school chum.\n\nThose qualities are reflected in his leadership style. Whether commanding a fleet, a ship, or overseeing the Navy’s dealings with Congress, Flanagan “believes in the family concept,” said Capt. Don Nash, twice a Flanagan associate and now top assistant to the deputy commander of U.S. Atlantic Command. Flanagan, Nash said, empowers people to do their jobs while encouraging them to work as a team. “He inspires people to do more than they think they can do,” he said.\n\n“Nobody doubts who the boss is, but nobody feels that they are subservient to him,” Nash said.\n\nWhile Flanagan may look the part, his “company” most assuredly does not. Unlike some CEOs, Flanagan doesn’t produce a tangible product for market. He turns out combat-ready aircraft carrier battle groups.\n\nFlanagan has six of these. Although the ships and crews already exist, they must be maintained, trained and ready to deploy every six months on a rotating basis.\n\nAmerican taxpayers incur an enormous expense for the services provided by Flanagan’s organization. Each carrier group’s 18-month cycle of preparation and deployment costs $500 million.\n\nIn addition to this huge expense, Flanagan must do as much as his predecessors with less; post-Cold War reductions have shrunk his fleet, but the Navy’s deployment schedule hasn’t changed. Those realities make Flanagan look hard at shaving costs and making his vast operation more efficient.\n\nFlanagan, a Harvard Business School graduate, has a strong affinity for concepts such as efficiency. “My view is that there’s a lot of principles involved in the business world that we need to employ,” he says.\n\nEfficiency is spelled two ways for Flanagan. One is at it is applied to the art of warfighting, practiced at its highest level.\n\n“If we’re going to bring this force somewhere to employ it in anger, it’s got to be able to do so at a very, very high rate of efficiency, and bring all our people home,” Flanagan said. “That’s really the goal.”\n\nThe other efficiency is strictly monetary. The fleet’s $10 billion budget and increasing pressure to reduce federal spending demand that money be saved wherever possible.\n\nBut while fiscal thriftiness has a strong appeal for Flanagan, he says it also produces benefits for the operational commanders who receive his forces.\n\n“The efficiencies that we’re able to realize will be passed on to these operational commanders in terms of force availability,” Flanagan says. “And I think that’s critical.”\n\nTo realize the savings, Flanagan said, the fleet is taking a fresh look at its accounting practices – the means it uses to calculate the “cost of goods sold.”\n\n“We know now what those are,” he said. “We’re in the process of building a management accounting system to better account for what it is we spend and how it is we spend it.\n\n“I think those are two very key things.”\n\nFlanagan is also saving money through more efficient management of his floating assets. His ships, unless laid up for extended maintenance, must spend six months of each 18-month cycle on overseas deployments to the Mediterranean. But Atlantic Fleet ships also patrol the Caribbean Sea and points further south, and conduct joint operations with allies in that region.\n\nFlanagan, who was 2nd Fleet commander prior to assuming the top job at Atlantic Fleet, realized that about 25 percent of his available forces were at any given time required to be at sea for Caribbean duty. So, he reasoned, “why don’t we build a force that operates exclusively in this region?”\n\nBy doing so, Flanagan said, the operators of those ships would become experts on the regional mission instead of spending additional time being trained for every possible contingency the Atlantic Fleet could face, the standard for ships preparing for Med cruises.\n\nThe result of that sort of thinking was the formation of the Western Hemisphere Group, a group of selected ships based in Mayport, Fla., that operates solely in Caribbean and South Atlantic waters.\n\n“I think that we improved the product, and I think that we did it at less cost,” Flanagan said.\n\nIn addition, Flanagan, along with his Pacific Fleet counterpart, Adm. Ronald J. Zlatoper, has created a fleetwide, money-saving training schedule for ships preparing to go overseas. By keeping his ships near the U.S. coast instead of sailing to the Caribbean for the third and final phase of their training, Flanagan shaves 3,000 miles off each ship’s round trip and cuts the time spent doing such training in half.\n\nFlanagan and Zlatoper have also combined efforts to streamline the two organizations’ training and operational procedures. Over the years, the two fleets, one based in Norfolk, the other in Pearl Harbor, Hawaii, had developed into distinct and separate cultures – so much so that, according to Zlatoper aide Capt. Steve Clawson, ships from the two fleets meeting at sea could not, as recently as 15 years ago, effectively communicate or work together.\n\nNow, that’s changing. “We decided that we would work together,” Zlatoper said recently. “Our predecessors started working to coordinate the two fleets, and we’ve continued that.”\n\nZlatoper gives Flanagan much of the credit for making the project a success. “From my estimation, he has really brought the flag officers of the surface fleet together better than anyone in my memory,” Zlatoper said.\n\nFlanagan could also gain future savings for his fleet by way of a previously proposed project that, although it remains in the planning stages, could have significant impact on Hampton Roads.\n\nFlanagan wants to combine public and private transportation assets to make the region a highly effective launching pad for massive numbers of troops en route to an overseas crisis. This “intermodal transportation system” would combine highway, rail, and port operations in a manner that would serve both military and commercial needs more efficiently.\n\nIn one example of cost-sharing, Flanagan would provide easements to Norfolk Naval Base property to allow the adjacent Norfolk International Terminal to expand its commercial operations. At the same time, NIT would take on the Navy’s cargo-handling operation, saving tax dollars.\n\n“The way I’m looking at it is, how can we do something that’ll benefit the military, and as a result benefit the United States, in terms of being able to mobilize if we have to with the greatest efficiency … at the same time, how can all of this benefit the community?” Flanagan said.\n\nThis sort of thinking is what has attracted the attention of the region’s business, civic and government leaders, who have included Flanagan on the organizing committee for the Hampton Roads Public/Private Partnership, a new group being organized in hopes of improving regional cooperation on economic issues. Flanagan says that given the Navy’s size here, that’s as it should be.\n\n“The Navy puts about $11 billion a year in this economy,” he said. “That’s a significant contribution, and it makes us the largest contributor of anyone in this region.”\n\nDespite his drive to maximize potential and efficiency, Flanagan takes the time to listen.\n\nHe says he believes in a workplace where honest dissent from the party line can be expressed without fear of retribution. His leadership style is deliberate, and stems from a sense of purpose that others say Flanagan possessed even as a young man.\n\n“He was always focused,” said Neil Nightingale, chief of police in the Cape Cod town of Barnstable, where Flanagan grew up. “He always knew where he wanted to go.” Nightingale worked for Flanagan’s father, the former deputy chief, from whom the son inherited the nickname “Bud.”\n\nNightingale remembers the younger Flanagan as “always well-behaved and polite. He was not a rowdy … he was always a straight arrow.”\n\n“I knew he was destined for big things,” said George Gillis, a friend and classmate of Flanagan’s at the Massachusetts Maritime Academy in nearby Buzzard’s Bay. “He was so personable, so disciplined, so dedicated. When he wanted something, he got it.”\n\nFlanagan spent some of his youthful summers caddying at a golf club frequented by the Kennedy clan. But in addition to walking the greens, he, like many other Cape Cod youths, worked on lobster and fishing boats. Both of his grandfathers were sea captains. Life at sea intrigued him.\n\nAt the maritime academy, Flanagan lived on a ship; dormitories weren’t then an option. “We did every single job a sailor does on a ship,” said Bresnahan, now the assistant to the academy president. “That stood me in good stead, and I’m sure it did Bud Flanagan.”\n\nThe course work didn’t come easy. “We had a tough regimen here, and he struggled like the rest of us,” Bresnahan said. “Academically. It’s a tough school. It didn’t come easy.”\n\nIn 1964, Flanagan graduated and set forth, armed with a degree in marine transportation and a 3rd Class Coast Guard license. While some of his classmates began their Navy careers, Flanagan chose to follow in the footsteps of his grandfathers and join the U.S. Merchant Marine. He served three years, sailing with American Export-Isbrandtsen Lines out of New York.\n\nMeanwhile, U.S. involvement in Vietnam had grown from an advisory role to full-blown war. In 1967, Flanagan accepted a full Naval commission and sailed west. He served on two ships during that war, and hasn’t looked back to civilian life.\n\nFlanagan was selected to be the 1973-74 Chief of Naval Operations Fellow, serving under Admirals Elmo R. Zumwalt and James L. Holloway III. In 1975, he commanded his first ship, USS Bronstein. In 1979, at age 35, he was named one of the U.S. Jaycees’ Ten Outstanding Young Americans – along with Vietnam War hero and Pittsburgh Steelers running back “Rocky” Bleier, and Arkansas Gov. Bill Clinton.\n\nThe following year, he began a three-year hitch as the first commander of the USS Kidd, a new class of guided missile destroyer. In 1988 – his 19th year of service – Flanagan was selected for promotion to rear admiral. He subsequently served as commander of Destroyer Squadron Five in San Diego and of the Norfolk-based Second Fleet. In October 1994, he assumed his present command, and donned his fourth star.\n\nFlanagan’s meteoric rise through the ranks makes some think he’s a logical candidate to rise even higher in the U.S. military hierarchy. But Flanagan downplays such possibilities, refuses to speculate on the future, and says he’s focused on his present work.\n\n“I didn’t come here to use this as a springboard to some other opportunity,” Flanagan says he has repeatedly told his staff, “but rather, just to make sure that we got this done as well as we could.”\n\nTHE FLANAGAN LEADERSHIP PHILOSOPHY\n\n1. Add wisdom from the top down. “In other words, if you know something, and obviously you do, because you’re in a senior position, then you’ve got to share that with your subordinates. When it comes time for them to take your position, they’ll do it not as well, but better than you.”\n\n2. Take fear out of the workplace. “It’s not a sin to make a mistake. We learn from them. It’s an attitude that if we approach this with openness, and goodwill, and moral purpose, we’ll get improvement.”\n\n3. You’ve got to have optimism. “The fleet’s as big as the fleet is right now. It’s the best fleet we’ve got. I’ve never heard a man win a fight that went into it thinking he was going to lose. I don’t think we’re going to lose anything, and we all need to think that way. We have a new Navy that’s restructured, and that’s important to have confidence in, and to build on.”\n\nADM. WILLIAM J. FLANAGAN JR.\n\nAge: 53\n\nOccupation: Commander of the U.S. Navy Atlantic Fleet\n\nHome: The Missouri House, Norfolk Naval Base\n\nFamily: Married to the former Barbara Ann Brendes. he has three daughters: Margaret, 18, Elizabeth, 22, and Kathryn, 23\n\nEducation: Bachelor’s degree in maritime transportation, Massachusetts Maritime Academy; Master’s degree in political science, American University; graduate, Harvard Business School\n\nAwards: Defense Distringuished Service Medal; Legion of Merit (4); Meritorious Service Medal with Gold Star; Navy Commendation Medal (2); Combat Action Ribbon; Meritorious Service Ribbon"}, {"url": "https://peoplepill.com/people/william-j-flanagan-jr/", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.\n\nEarly life and education\n\nFlanagan was born in 1943. In addition to his bachelor's degree in marine transportation, Flanagan received a master's degree in political science from the American University and earned a degree from Harvard Business School.\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan accepted a commission with the United States Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.\n\nMilitary awards\n\nU.S. Military decorations"}, {"url": "https://www.wikitrusted.com/william-j-flanagan-jr-wiki-networth-age/", "page_content": "William A. better known by the Family name , is a popular Activist. he was born on , in Unknown\n\nentered the career as Activist In his early life after completing his formal education\n\nWilliam J. Flanagan Jr. Biography First Name William A. Name William J. Flanagan Jr. Complete Family Name Date of Birth Birth Day Birth Years Birth Place Unknown Birth City Birth Country Unknown Nationality Unknown Race Being Updated Ethnicity Being Updated Sun sign, Horoscope, Zodiac Sign Cancer Famous As Activist Also Known for Activist Occupation Activist Years active Started Career In How Old he was when he started his career? Being Updated\n\nNet Worth\n\nWilliam A.‘s estimated net worth, monthly and yearly salary, primary source of income, cars, lifestyle, and much more information have been updated below.\n\nWilliam A. who brought in $3 million and $5 million Networth William A. collected most of his earnings from his Yeezy sneakers While he had exaggerated over the years about the size of his business, the money he pulled in from his profession real–enough to rank as one of the biggest celebrity cashouts of all time. his Basic income source is mostly from being a successful Activist.\n\nhis has a whopping net worth of $5 to $10 million. In addition to his massive social media following actor\n\nWilliam J. Flanagan Jr. Net Worth Estimated Net Worth in 2023 $1 Million to $5 Million Approx Previous Year’s Net Worth (2022) Being Updated Annual Salary Being Updated Income Source Activist\n\nWilliam J. Flanagan Jr. Height, Weight and Body Measurement Height Weight Not Known Chest Size Not Known Waist Size Being Updated Shoe Size Being Updated Hair Color Being Updated Eye Color Being Updated Body Type Being Updated Sexual Orientation Being Updated\n\nWilliam J. Flanagan Jr. Family, Parents, Siblings Spouse Parent Ric Flair (father) Children 3 Father Jean-Paul Lecanu Mother Cheryl Bridges Siblings Martin Flanagan, Sister Being Updated Brother Being Updated\n\nCurrent Affairs, Relation Ships, Dating What was marital status? (Single, Engaged, Married, Fiancée in Relation or Divorce) Being Updated was having any relationship affair? Being Updated Who was girlfriend/Boyfriend? Being Updated\n\nWilliam J. Flanagan Jr. Awards and Honors Awards Commonwealth Writers’ Prize Honors Being Updated"}, {"url": "https://www.cranstonri.gov/about/city-council/", "page_content": "Form of Government\n\n\n\nOn November 3, 1998, the voters of the City of Cranston approved a referendum amending the Cranston Home Rule Charter changing its form of government from a mayor form of government to a mayor/council form of government\n\n\n\nCity Council\n\n\n\nThe Cranston City Council is comprised of six wards and three city-wide councilmembers. The current council was elected on November 8, 2022, took office on January 2, 2023, and their terms expire on January 6, 2025. To find your current ward and Councilperson click below:\n\nFind Your Councilperson\n\nThe Cranston City Council meets on the 4th Monday of every month. When it falls on a holiday, the Council may meet on Tuesday. Note that in December, the regular meeting is held on the third Monday.\n\n\n\nMeetings are held at 7 p.m. in Council Chambers, which is located on the 3rd Floor of City Hall. All meetings are open to the public with two opportunities for public speaking: one on matters listed on the Docket, and the other is an open session in which the public can speak on any matter.\n\n\n\nCouncil meetings are video streamed live and can be viewed by clicking on the button below:\n\n\n\nClick Here\n\n\n\n\n\nSpecial meetings are called on an as-needed basis, and are advertised in the Cranston Herald or Providence Journal. All Council meetings, including Committee meetings, are posted on the Secretary of State's website and also on the City's website under Calendar.\n\n\n\nMatters requiring Council action or approval are introduced as New Business at either a regular or special council meeting called for that purpose. All new matters are referred either to Committee or the City Council for public hearing, which is advertised.\n\n2023-2025 Council Committees\n\n2023-2024 City Council Rules\n\nProperties Plowed By The City"}, {"url": "https://wiki2.org/en/William_J._Flanagan_Jr.", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican admiral\n\nAdmiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, United States Atlantic Fleet from 1994 to 1996.[1][2]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 1 962 11 099 2 607 622 3 123\n\nCommencement 2016\n\nPython With Spyder 13: For Loops\n\n2010 Quinnipiac University Undergraduate Commencement\n\nAcademic Achievement Recognition Evening (April 27, 2020)\n\n2011 Quinnipiac University Undergraduate Commencement Transcription\n\nEarly life and education\n\nFlanagan was born in 1943[3] in Jesup, Georgia.[4] In addition to his bachelor's degree in marine transportation, Flanagan received a Master of Arts degree in political science from the American University in 1974 and graduated from Harvard Business School in 1980.[3][5]\n\nNaval career\n\nFlanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in marine transportation and an ensign's commission in the Naval Reserve, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of second mate. After three years of service with American Export Lines, Flanagan reported for active duty with the United States Navy on May 15, 1967 as a lieutenant (junior grade).[3]\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as the ship's first commanding officer. He had now advanced to the rank of captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of admiral and was assigned as Commander in Chief of the Atlantic Fleet. At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service.[5][6]\n\nMilitary awards\n\nU.S. Military decorations\n\nReferences"}, {"url": "https://infogalactic.com/info/William_J._Flanagan,_Jr.", "page_content": "From Infogalactic: the planetary knowledge core\n\nAdmiral William J.ohn Flanagan, Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.[1][2]\n\nWilliam John Flanagan, Jr. was born in 1943[3]\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School.[4]\n\nCareer\n\nThe younger Flanagan graduated from the Massachusetts Maritime Academy in 1964 with a Bachelor of Science degree in Marine Transportation, joining the Merchant Marine and working for American Export-Isbrandtsen Lines out of New York, where he achieved the grade of Second Mate. After three years of service with American Export Lines, Flanagan accepted a full commission with the U.S. Navy in 1967.\n\nOn June 27, 1981, Flanagan reported to commissioning crew of USS Kidd (DDG-993) as her first Commanding Officer. He had now advanced to the rank of Captain. Flannagan commanded the guided missile destroyer—the lead ship of her class—on her first deployment to the Mediterranean Sea and the Indian Ocean.\n\nOn October 5, 1994, Flanagan was promoted to the rank of Admiral and was assigned as Commander in Chief of the Atlantic Fleet (CINCLANTFLT). At the end of his tenure in this position, he was responsible for more than 200,000 Navy and Marine Corps personnel, 220 vessels, 1,500 aircraft, and 27 shore installations. Admiral Flanagan stepped down from commanding the Atlantic Fleet on December 20, 1996, and retired shortly thereafter after approximately thirty years of naval service. [5] [6]\n\nMilitary Awards\n\nU.S. Military decorations\n\nReferences\n\n↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ [1] ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found.\n\n\n\n\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>"}, {"url": "https://www.findagrave.com/memorial/173233771/william-j-flanagan", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://alchetron.com/William-J-Flanagan,-Jr", "page_content": "Admiral William John Flanagan Jr. (born March 27, 1943) is a retired United States Navy four star admiral who served as Commander in Chief, U.S. Atlantic Fleet (CINCLANTFLT) from 1994 to 1996.\n\nContents\n\nFlanagan was born in 1943\n\nIn addition to his bachelor's degree in Marine Transportation, Flanagan received a Master's degree in Political Science from the American University and earned a degree from Harvard Business School."}, {"url": "https://www.findagrave.com/memorial/87027408/william-j-flanagan", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.tributearchive.com/obituaries/22224833/william-james-flanagan/", "page_content": "William James Flanagan\n\nWilliam J. Flanagan, of Malden, died Thursday, December 4, 2008 at the Kaplan Family Hospice House in Danvers, he was 78. Born on July 22, 1930 in Stoneham, he was the son of the late William F. and Eleanor L. (Kierstdad) Flanagan. Bill and his family moved to Malden when he was very young. Bill was educated and raised in Malden and was a graduate of Malden Catholic High School with the Class of 1948. He worked for a short time in manufacturing before enlisting in the US Coast Guard on August 18, 1951. He served during the Korean War aboard the USCG Cutter Bibb, a ship that held the distinction for the most submarines sunk during World War II. Bill was honorably discharged on August 30, 1954 and had attained the rank of Electrician's Mate, 2nd Class.\n\nDuring his time in the Coast Guard, Bill married his sweetheart Jeanne Marie Kelly. The two shared over 40 years together until Jeanne's passing in July of 1993. After Bill was discharged from the Coast Guard, he and Jeanne settled in Malden to raise their family. He began working as an electrician for the AW Ashton Fuel Company, then for Miller Electric in Cambridge, before finally taking a position with the New England Telephone Company, now known as Verizon. He worked for the company for 32 years until his retirement in 1988.\n\nBill was very active in the Malden community. He was a current member of the Knights of Columbus and in the past, held the rank of Worthy Warden. Bill also served as the Commissioner of the Malden Public Works for 6 years under former Mayor Conway. He was very involved in Malden politics and even ran for city counselor once. Bill was a member of the Immaculate Conception Parish in Malden and at one point was a member of the choir. Even in his retired years, Bill still enjoyed keeping busy with his hands. He enjoyed helping out his family around their houses with small carpentry jobs and electrical issues. Bill also had a fondness for tinkering with automobiles and was an avid golfer for many years.\n\nBill survived by his children, William J. and Janet Flanagan, Jr. and their children, Luke and Casey, of Old Beth Page, NY, Michael D. and Carol Flanagan and their children, Erin, Patrick, and Kelli, of Malden, Patricia A. Flanagan and her children, Matthew and Christopher DeFinis of Peabody, Thomas P. and Amy Flanagan and their children, Kelsey and Justin of Saline, MI, Kathleen T. and Rick Finch and their children, Ryan and Kyle of Malden, Janice M. and Sean Farren and their children, Colin and Sean Michael of Stoneham, and Sean P. and Sheri Flanagan and their children Olivia and Grace of Ayer, and his siblings, Kathleen Curran of Malden, John Flanagan of Maine, Arthur Flanagan of Marshfield, Mary Duhy of Stoneham, and Margaret Ann Geraughty of Malden.\n\nFuneral from the Weir-MacCuish Golden Rule Funeral Home, 144 Salem Street, Malden, on Tuesday, December 9, 2008 at 7:45 AM followed by a Mass of Christian Burial in Immaculate Conception Parish, 10 Fellsway East, Malden, at 9 AM. Father Richard J. Mehm, Pastor of Immaculate Conception Parish will be presiding. Bill will be buried with his wife at private service held at a later date in the Holyhood Cemetery, Brookline.\n\nVisitation will be held in the funeral home on Monday, December 8, 2008 from 4 to 8 PM.\n\nIn lieu of flowers, contributions in Bill's memory may be made to the Hospice of the North Shore, 75 Sylvan Street, Suite B102, Danvers, MA 01923.\n\n(781) 322-0834"}]}