{"K. S. Manilal obtained his B.Sc. degree from the University of Madras in 1945 and his M.Sc. degree from the University of Kerala in 1947.": [{"url": "https://peoplepill.com/people/k-s-manilal/", "page_content": "Professor Kattungal Subramaniam Manilal (Malayalam: കാട്ടുങ്ങൽ സുബ്രഹ്മണ്യം മണിലാൽ) (born 17 September 1938) is an Emeritus of the University of Calicut, a botany scholar and taxonomist, who devoted over 35 years of his life to research, translation and annotation work of the Latin botanical treatise Hortus Malabaricus. This epic effort brought to light the main contents of the book, a wealth of botanical information on Malabar that had largely remained inaccessible to English-speaking scholars, because the entire text was in the Latin language..\n\nDespite the existence of Hendrik van Rheede's Hortus Malabaricus over the last three centuries, the correct taxonomic identity of many plants listed in Hortus Malabaricus, their medicinal properties, methods of use, etc., as described and codified by renowned traditional medical authorities of 17th century India remained inaccessible to English language based scholars, until Manilal commenced publication of research papers and books on Hortus Malabaricus.\n\nManilal efforts ultimately resulted in an English edition of Hortus Malabaricus, for the first time, 325 years after its original publication from Amsterdam. The English edition contains a word by word translation of all the twelve volumes of the book, retaining the original style of language. Medicinal properties of plants are translated and interpreted, with commentaries on their Malayalam names given by Van Rheede. In addition, the correct scientific identity of all plants, acceptable under ICBN are set out along with their important synonyms and basionyms.\n\nWhilst the scope of Manilal's contributions to botany extend far beyond the research and publications around Hortus Malabaricus, his research work on Hortus Malabaricus alone are of botanical and socio-historic significance, and can be broadly classified under two heads:\n\nBotanical and Medicinal aspects of Hortus Malabaricus; and\n\nHistorical, Political, Social and Linguistic aspects of Hortus Malabaricus.\n\nManilal has over 198 published research papers and 15 books to his credit as author and co-author. He and his associates have credits to discovering over 14 species of flowering plants, varieties and combinations new to science. Manilal is the Founder President of the Indian Association for Angiosperm Taxonomy (IAAT).\n\nBirth, early life and interest in Hortus Malabaricus\n\nManilal was born in Cochin on 17 September 1938. He is one of three children born to his parents; father Advocate Kattungal A. Subramaniam (b:1914~d:1973) and mother K. K. Devaki (b:1919~d:1989). Manilal's father, K. A. Subramaniam, was besides being a practising advocate, also a writer, who authored the biography of Sahodaran Ayyapan. Manial's Kattungal family members are natives of North Paravur in Kerala, India.\n\nAs a young boy, Manilal's interest in Hortus Malabaricus was inspired by his father, whose avid reading habits and enthusiasm for sociology exposed Manilal to a collection of books, and more specifically newspaper cuttings on Hortus Malabaricus during the late 1940s and 1950s.\n\nManilal schooled initially at the Government Boys’ High School, Kodungallur and later at the Government S.R.V. Boys’ High School, Ernakulam. He enrolled for undergraduate studies in Botany at the Maharaja's College, Ernakulam, following which, he secured MSc Botany and PhD Degrees from University Teaching Department, Sagar, in Madhya Pradesh.\n\nDuring his post-graduate studies, while on a study tour to the Forest Research Institute in Dehra Dun, Manilal was able to see, for the first time, a set of volumes of the original Hortus Malabaricus. This was set of volumes acquired by the Institute's library during the days of the British Raj, when the Institute was called the Imperial Forest College. Manilal remarks “it fired my imagination!” on seeing a Latin book in which the names of plants were also written in native Malayalam language. Manilal maintained his interest in the book through his studies and professional life until 1969, when he commenced serious work on the transliteration of Hortus Malabaricus.\n\nMajor research and academic achievements\n\nBotanical and medicinal aspects of Hortus Malabaricus\n\nFrontispiece of the original Latin Hortus Malabaricus Frontispiece of the original Latin Hortus Malabaricus\n\nAs Hortus Malabaricus is a pre-Linnaean book, the scientific names of plants, equivalent to local Malayalam names, were not included. Since voucher specimens for the book are also not known to exist, the correct identity of many of the plants described was unclear and not verifiable to original specimens. Earlier attempts, over three centuries, by European and Indian botanists to correctly identify all specimens were futile. Under two research projects; one sponsored by the U.G.C. (1975–1978) and the other by the Smithsonian Institution (1984–1987), Manilal collected all plants, described in Hortus Malabaricus, from localities in Malabar from where they were originally collected in the 17th century. Specimens were subjected to detailed studies and their correct identities were established in consultation with research institutes in Europe and USA. Based on this work, initially a concise reference book: An Interpretation of Van Rheede's Hortus Malabaricus, was published (with his collaborators) from Berlin (1988), by the IAPT. This remains the only book by Indian authors published by them (IAPT) till date and is an essential resource in study on the taxonomy of Southeast Asian plants.\n\nHistorical, political, social and linguistic aspects of Hortus Malabaricus\n\nThe compilation and publication of Hortus Malabaricus is intimately connected with the history of India, politics of the 17th century Netherlands and the then social conditions of Malabar. It is also an important source of information, and the oldest printed, authentic document, on the evolution of Malayalam language and script. Manilal studied these aspects for over 35 years bringing to light many interesting facts, some of which were included in his book: Botany & History of Hortus Malabaricus, published from Rotterdam and Delhi (1980). Another book, in Malayalam: A study on the role of Itty Achudan in the compilation of Hortus Malabaricus, was published from Kozhikode in 1996.\n\nVan Rheede's motivation to compile a book on the natural plant wealth of Malabar was to prove his belief that Malabar is self-sufficient in all requirements of military and commerce and hence that Cochin was better suited to be the south east Asian Headquarters of the Dutch overseas forces, compared to Colombo in Ceylon.\n\nInformation is also available in the text of Hortus Malabaricus not only about the vegetation in 17th century Malabar, but also about the general social conditions prevalent in those days. Significant inferences could also be drawn on some of these matters, indirectly from the data available in the book. Several research papers have been published by Manilal on these topics. Some more, particularly on the different Numerals and Numerical Systems used in Hortus and their sociological implications and significances in the Indian society, are under preparation.\n\nTaxonomic and biodiversity studies in Kerala\n\nManilal pioneered taxonomic research and biodiversity studies in Kerala by training a genre of young taxonomists and identifying and cataloguing local plants in biodiversity-rich South India. A comprehensive study on the flora of the Greater Kozhikode area, consisting of the western sectors of the present day Kozhikode and Malappuram districts, covering an area of about 600 km2. was started in 1969. When completed in 1975, this work resulted in recording about one thousand species of flowering plants from the region, including several species recorded for the first time in India and importantly seven species new to science. Based on this work, a book: Flora of Calicut, was published (from Dehra Dun), and was taken as a model for subsequent research in India.\n\nResearch and revelations at Silent Valley\n\nIn the 1970s, when a proposal to build a hydro-electric project in Silent Valley triggered political controversy in Kerala due to an impending ecological disaster, the Government of Kerala appointed an experts’ committee of scientists to study, inventorise and report on Silent Valley's flora and fauna. The experts’ committee reported that the forests there could not be classified as tropical evergreen rainforests and that they contain only 240 species of flowering plants, which are also found elsewhere, and also that the Valley does not possess any new or rare species. Despite protests by environmentalists the State Government was about to go ahead with the project, only awaiting a clearance form the Central Government. At this juncture, the Department of Science and Technology (India) accepted Manilal's proposal to study the flora of Silent Valley and also required him to make a general study of the ecological status of the forests.\n\nOver a four-year period commencing 1981, Manilal and research assistants undertook a study that brought to light:\n\nA record of nearly 1,000 species of flowering plants;\n\nSeven species new to science;\n\nSeveral plants believed to be found only in Sri Lanka, Philippines, etc.;\n\nSome species which were believed to be extinct, such as the Malabar Daffodil , which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris;\n\n, which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris; Rare medicinal plants until then known to grow only in the islands of Philippines;\n\nMany endemics of the neighbouring countries, where their existence was threatened, were found to have migrated to these forests for safety.\n\nFurther Manilal's study found that the Silent Valley forests fulfilled required parameters of tropical evergreen rainforests and, therefore, could be rightly so classified. His work was soon considered as model of how taxonomists could assist in solving socio-environmental issues; and many scientists and journalists from Europe, Africa and South America visited Silent Valley to study the working of this project.\n\nOrchids of Kerala\n\nDetailed studies of the orchid wealth of Kerala were started by Manilal in the late 1970s, including their taxonomy, anatomy, biology and floral evolution, which are essential for any further studies on their hybridisation. During these studies, contrary to the highest expectations, over 215 species of orchids were collected, including species that were till then believed to be extinct, like the ladies' slipper orchid Paphiopedilum druryii.\n\nOrigin and evolution of the flower\n\nManilal has led studies on the directions of evolution of flowers and the structure and anatomy of various floral organs in cash crops such as coconut palms, grasses (rice), orchids, compositae (sun flower), rubiales (coffee), etc. Many enigmas in these subjects could be solved, and results were published in around 45 research papers. These studies have, besides seeing the flower as the most significant part of the plant, with biological, commercial, aesthetic, evolutionary and taxonomic importance, also promoted success in hybridisation and breeding experiments, to create new high-yielding varieties.\n\nRadioactive resistant marine phyto-planktonic algae\n\nAs the beaches in southern Kerala and Tamil Nadu (particularly in the Districts of Kollam and Nagarcoil) have natural deposits of radioactive minerals causing genetic damage to flora and fauna, Manilal undertook studies to familiarise with the techniques of research in the field of radiation ecology. These studies were undertaken at the Marine Biology Laboratory of North Wales University at Menai Bridge, Wales. The Royal Society of London granted Manilal a Visiting Scientist-ship for this work for two years in 1971–1972.\n\nTwo species of marine phyto-planktonic algae were discovered, which could withstand a very high degree of radioactivity. It was found that these species could absorb and adsorb as much as 40 times their body weight of the radioactive Thorium compounds from surrounding seawater, and continue to live normally. In the 1970s these findings were farfetched to be accepted for publication in a journal in U.K. However, on Manilal's return to India, a part of these findings was published in the journal Current Science (1975), by the Indian Institute of Science. About ten years later, some British scientists did a similar work and their results were published in the prestigious U.K. journal Nature, and wide publicity in the press as a biotechnological break-through. Manilal's experiments (and the subsequent work by the British scientists) show that such marine planktonic algae could be used to quickly and safely clean up ocean surfaces where radio-active materials have accumulated, by cultivating such algae in a specific area and later removing them from there.\n\nIndian Association for Angiosperm Taxonomy (IAAT)\n\nManilal was instrumental in establishing the Indian Association for Angiosperm Taxonomy (IAAT). Manilal, as founder President, established IAAT in the year 1990 with its Headquarters located at the Department of Botany, University of Calicut, Kozhikode, India. The IAAT works to promote the science of Angiosperm Taxonomy in India, to provide a common forum for Angiosperm taxonomists in India to organise meetings, hold discussions and exchange ideas on scientific and academic matters, and encourage collaborative work among taxonomists. The IAAT publishes a journal Rheedea (named after Hendrik van Rheede). The Indian Association for Angiosperm Taxonomy works as an affiliate of the International Association for Plant Taxonomy.\n\nFrom 1969 Manilal commenced training research students in Taxonomy (leading to PhD degree in the subject), with a view to attain self-sufficiency in Taxonomy. During the years 1972–1998, he and his students discovered over 240 new species of flowering plants and several new records for India from Kerala, and published many research papers in Taxonomy in national and international journals.\n\nBiomass Research Centre\n\nA Biomass Research Centre was established by Manilal in the University of Calicut, with funding from the Ministry of Non-conventional Energy Sources. The Centre does research and field experiments to establish the (taxonomic) identification of fast-growing fuel-wood trees suitable for various agro-climatic zones of Kerala.\n\nSummary of Manilal's discoveries\n\nNew species and varieties discovered, and combinations established by Manilal and his research associates are summarised are follows:\n\nNew species discovered in Silent Valley\n\nLiparis indiraii Manilal & S.Kumar\n\nEria tiagii Manilal & S.Kumar\n\nHydnocarpus pendulus Manilal, Sabu & Sivar.\n\nRobiquetia josephiana Manilal & S.Kumar\n\nSauropus saksenianus Manilal, Sabu & Sivar.\n\nCucumella silentvaleyii Manilal, Sabu & Mathew\n\nOberonia bisaccata Manilal & S.Kumar\n\nNew species discovered under biodiversity studies\n\nHedyotis erecta Manilal & Sivar.\n\nCinnamomum nicolsonianum Manilal & Shylaja\n\nBulbophyllum rheedei Manilal & S.Kumar\n\nHeliotropium keralense Sivar. & Manilal\n\nBorreria malabarica Sivar. & Manilal\n\nPhyllanthus kozhikodianus Sivar. & Manilal\n\nHabenaria indica S.Kumar & Manilal\n\nNew varieties of flowering plants discovered\n\nBorreria stricta (L. f.) K.Schum. var. rosea ; Sivar. & Manilal\n\nvar. ; Borreria articularis (L. f.) F.N.Williams var. hispida Sivar. & Manilal\n\nvar. Portulaca oleracea L. var. linearifolia Sivar. & Manilal\n\nNew combinations established\n\nThunbergia bicolour (Wight) Manilal & Suresh\n\nEria chandrasekharanii (Bharg. & Moh.) S.Kumar & Manilal\n\nLater declassified per ICBN provisions, as names of species may change with more information gathered.\n\nNotable awards and positions held\n\nAwards\n\nOfficer of the Order of Orange-Nassau award (Dutch: Orde van Oranje-Nassau) by Her Majesty Queen Beatrix of the Netherlands. (The Consul General of the Kingdom of the Netherlands, Ms. Marijke A. van Drunen Littel conferred this honour on 1 May 2012, at Kozhikode, Kerala, India.)\n\nE.K. Janaki Ammal National Award for Taxonomy (2003) – Constituted by The Ministry of Environment and Forests\n\nY. D. Tyagi Gold Medal (1998) – by the Indian Association of Angiosperm Taxonomy (IAAT)\n\nVishwambhar Puri Medal (1990) – by The Indian Botanical Society\n\nPositions\n\nChief Editor, Rheedea, The Journal of Indian Association of Angiosperm Taxonomy (1991–present)\n\nPresident, Botanical Society of India (1999)\n\nTreasurer, Botanical Society of India (1984–1986)\n\nFounding President, Indian Association of Angiosperm Taxonomy (1991)\n\nChairman, CRIKSC (Centre for Research in Indigenous Knowledge, Science & Culture)\n\non YouTube\n\nPublication of the English and Malayalam versions of Hortus Malabaricus\n\nPublisher's appeal for donation of royalties\n\nHortus Malabaricus as transliterated by Manilal was published in English and Malayalam languages in 2003 and 2008 respectively. Manilal's copyright, as author of the English and Malayalam versions, was bequeathed, free of royalties, to the publishers, the University of Kerala. This assignment of rights was a gesture by Manilal in good faith and in response to a specific appeal from the then Vice-Chancellor of the University of Kerala, that the University wanted to generate funds from this publication for utilisation of such royalty incomes toward re-publication of old Malayalam classical works, which are out of print, and not forecasted to generate a viable level of income due to limited sale of such classical works.\n\nBook-release functions conducted by the publishers\n\nIn a recorded interview with Manilal in August 2008, he expressed his regret and frustration at the manner in which the publishers subjected him to digression from the publication project soon after he legally assigned his rights as author. Apparently there was a move to exclude Manilal's name from the book (2003), but was reinstated on account of questions raised by the academic community. On 14 August 2008, the University of Kerala officials again conducted a function at Thiruvananthapuram to formally release the Malayalam edition of Hortus Malabaricus. The book was released by the Governor of Kerala (also Chancellor of the University), at the function; where due recognition was not given to Manilal as author of the book, nor were arrangements in place to felicitate the author at the function. [1]. The former Vice-Chancellor of University of Kerala who initiated the project, B. Ekbal, was also not invited to this function.\n\nBooks authored by K. S. Manilal\n\n2012. MANILAL, K.S. Hortus Malabaricus and the Socio-Cultural Heritage of India . Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode.\n\n. Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode. 2008. MANILAL, K.S. Van Rheede's Hortus Malabaricus. Malayalam Edition , with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5)\n\n, with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5) 2004. MANILAL, K.S. & C. SATHISH KUMAR Orchid Memories: A tribute to Gunnar Seidenfaden . Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1)\n\n. Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1) 2003. MANILAL, K.S. Van Rheede’s Hortus Malabaricus. English Edition , with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4)\n\n, with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4) 1998. MANILAL, K.S. & M.S. MUKTESH KUMAR A Handbook on Taxonomy Training . DST, New Delhi.\n\n. DST, New Delhi. 1998. MANILAL, K.S. & K. RAVEENDRAKUMAR Companion to Gamble’s Flora: Additions to the Flora of Kerala since Gamble (1935) . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1996. MANILAL, K.S. Hortus Malabaricus and Itty Achuden: A study on the role of Itty Achuden in the compilation of Hortus Malabaricus (In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0).\n\n(In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0). 1996. MANILAL, K.S. Directory of Indian Taxonomists . Mentor books, Kozhikode.\n\n. Mentor books, Kozhikode. 1996. MANILAL, K.S. & A.K. PANDEY Taxonomy and Plant Conservation . C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4)\n\n. C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4) 1994. SATHISH KUMAR, C. & K.S. MANILAL A Catalogue of Indian Orchids . Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X).\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X). 1993. MANILAL, K.S. & C. SATHISH KUMAR Field Key for the Identification of the Native Orchids of Kerala . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1988. NICOLSON, D.H.,C.R. SURESH & K.S. MANILAL An Interpretation of Van Rheede’s Hortus Malabaricus . International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile)\n\n. International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile) 1988. MANILAL, K.S. Flora of Silent Valley Tropical Rain Forests of India . Department of Science & Technology, Government of India, Kozhikode.\n\n. Department of Science & Technology, Government of India, Kozhikode. 1982. MANILAL, K.S. & V.V. SIVARAJAN The Flora of Calicut: The Flowering Plants of the Greater Calicut Area . Bishen Singh Mahendrapal Singh, Dehra Dun.\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. 1980. MANILAL, K.S. The Botany & History of Hortus Malabaricus . A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4).\n\n. A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4). 1976. MANILAL, K.S. & V.V.SIVARAJAN Flowering Plants of the Calicut University Campus. University of Calicut, Kerala. India.\n\nThe standard author abbreviation is used to indicate this individual as the author when citing a botanical name."}, {"url": "https://researchmatters.in/news/prof-k-s-manilal-among-padma-awardees-2020-under-science-and-engineering", "page_content": "Bengaluru\n\n26 Jan 2020\n\nAmong the illustrious list of Padma awardees for 2020 declared on the eve of Republic Day, the Government of India has announced Padma Shri to Prof Kattungal Subramaniam Manilal under Science and Engineering discipline. He is among the eight of 118 Padma Shri awardees under this discipline.\n\nPadma Awards are one of the highest civilian Awards in India. The Awards are given in various disciplines spanning the fields of art, social work, public affairs, science and engineering, trade and industry, medicine, literature and education, sports and civil service. ‘Padma Vibhushan’ is awarded for exceptional and distinguished service; ‘Padma Bhushan’ for distinguished service of a high order and ‘Padma Shri’ for distinguished service in any field. Among the 7 Padma Vibhushan, 16 Padma Bhushan and 118 Padma Shri Awards that the President of Indian approved this year, only 33 have been awarded to women.\n\nProf K. S. Manilal is a botanist and taxonomist, best known for his research, translation, and annotation of Hendrik van Rheede’s 17th century Latin botanical treatise, Hortus Malabaricus. The document extensively details the biodiversity and medicinal properties of over 700 indigenous plants in the Malabar region of Kerala.\n\nBefore Manilal’s translation of this enormous 12 volume document into English and Malayalam, most of the information in this Latin treatise had largely remained inaccessible to the world. Manilal also authored 198 published research papers and 15 books on taxonomy and botany, of which a significant proportion was devoted to discussing the medico-botanical aspects, or the historical, socio-political and linguistic significance of Hortus Malabaricus.\n\nAlong with his students, Manilal has discovered around 14 species of flowering plants and recorded the existence of nearly 1,000 flowering plant species, including some like the Malabar Daffodil, which was previously thought to be extinct. Currently, he is an Emeritus Professor of botany at Calicut University, Kerala. He is also credited for establishing the Indian Association for Angiosperm Taxonomy.\n\nEarlier, Prof K S Manilal was featured under Ek Pradarshini - The Best of Indian Science exhibits during the Nobel Prize Series - India 2018 held at Goa. The National Centre for Biological Sciences (NCBS) at Bengaluru had also held an exhibition of Hortus Malabaricus in 2008."}, {"url": "https://alchetron.com/K-S-Manilal", "page_content": "Professor Kattungal Subramaniam Manilal (Malayalam: കാട്ടുങ്ങൽ സുബ്രഹ്മണ്യം മണിലാൽ) (born 17 September 1938) is an Emeritus of the University of Calicut, a botany scholar and taxonomist, who devoted over 35 years of his life to research, translation and annotation work of the Latin botanical treatise Hortus Malabaricus. This epic effort brought to light the main contents of the book, a wealth of botanical information on Malabar that had largely remained inaccessible to English-speaking scholars, because the entire text was in the Latin language..\n\nDespite the existence of Hendrik van Rheede's Hortus Malabaricus over the last three centuries, the correct taxonomic identity of many plants listed in Hortus Malabaricus, their medicinal properties, methods of use, etc., as described and codified by renowned traditional medical authorities of 17th century India remained inaccessible to English language based scholars, until Manilal commenced publication of research papers and books on Hortus Malabaricus.\n\nManilal efforts ultimately resulted in an English edition of Hortus Malabaricus, for the first time, 325 years after its original publication from Amsterdam. The English edition contains a word by word translation of all the twelve volumes of the book, retaining the original style of language. Medicinal properties of plants are translated and interpreted, with commentaries on their Malayalam names given by Van Rheede. In addition, the correct scientific identity of all plants, acceptable under ICBN are set out along with their important synonyms and basionyms.\n\nWhilst the scope of Manilal's contributions to botany extend far beyond the research and publications around Hortus Malabaricus, his research work on Hortus Malabaricus alone are of botanical and socio-historic significance, and can be broadly classified under two heads:\n\nManilal has over 198 published research papers and 15 books to his credit as author and co-author. He and his associates have credits to discovering over 14 species of flowering plants, varieties and combinations new to science. Manilal is the Founder President of the Indian Association for Angiosperm Taxonomy (IAAT).\n\nBirth, early life and interest in Hortus Malabaricus\n\nManilal was born in Cochin on 17 September 1938. He is one of three children born to his parents; father Advocate Kattungal A. Subramaniam (b:1914~d:1973) and mother K. K. Devaki (b:1919~d:1989). Manilal's father, K. A. Subramaniam, was besides being a practising advocate, also a writer, who authored the biography of Sahodaran Ayyapan. Manial's Kattungal family members are natives of North Paravur in Kerala, India.\n\nAs a young boy, Manilal's interest in Hortus Malabaricus was inspired by his father, whose avid reading habits and enthusiasm for sociology exposed Manilal to a collection of books, and more specifically newspaper cuttings on Hortus Malabaricus during the late 1940s and 1950s.\n\nManilal schooled initially at the Government Boys’ High School, Kodungallur and later at the Government S.R.V. Boys’ High School, Ernakulam. He enrolled for undergraduate studies in Botany at the Maharaja's College, Ernakulam, following which, he secured MSc Botany and PhD Degrees from University Teaching Department, Sagar, in Madhya Pradesh.\n\nDuring his post-graduate studies, while on a study tour to the Forest Research Institute in Dehra Dun, Manilal was able to see, for the first time, a set of volumes of the original Hortus Malabaricus. This was set of volumes acquired by the Institute's library during the days of the British Raj, when the Institute was called the Imperial Forest College. Manilal remarks “it fired my imagination!” on seeing a Latin book in which the names of plants were also written in native Malayalam language. Manilal maintained his interest in the book through his studies and professional life until 1969, when he commenced serious work on the transliteration of Hortus Malabaricus.\n\nBotanical and medicinal aspects of Hortus Malabaricus\n\nAs Hortus Malabaricus is a pre-Linnaean book, the scientific names of plants, equivalent to local Malayalam names, were not included. Since voucher specimens for the book are also not known to exist, the correct identity of many of the plants described was unclear and not verifiable to original specimens. Earlier attempts, over three centuries, by European and Indian botanists to correctly identify all specimens were futile. Under two research projects; one sponsored by the U.G.C. (1975–1978) and the other by the Smithsonian Institution (1984–1987), Manilal collected all plants, described in Hortus Malabaricus, from localities in Malabar from where they were originally collected in the 17th century. Specimens were subjected to detailed studies and their correct identities were established in consultation with research institutes in Europe and USA. Based on this work, initially a concise reference book: An Interpretation of Van Rheede's Hortus Malabaricus, was published (with his collaborators) from Berlin (1988), by the IAPT. This remains the only book by Indian authors published by them (IAPT) till date and is an essential resource in study on the taxonomy of Southeast Asian plants.\n\nHistorical, political, social and linguistic aspects of Hortus Malabaricus\n\nThe compilation and publication of Hortus Malabaricus is intimately connected with the history of India, politics of the 17th century Netherlands and the then social conditions of Malabar. It is also an important source of information, and the oldest printed, authentic document, on the evolution of Malayalam language and script. Manilal studied these aspects for over 35 years bringing to light many interesting facts, some of which were included in his book: Botany & History of Hortus Malabaricus, published from Rotterdam and Delhi (1980). Another book, in Malayalam: A study on the role of Itty Achudan in the compilation of Hortus Malabaricus, was published from Kozhikode in 1996.\n\nVan Rheede's motivation to compile a book on the natural plant wealth of Malabar was to prove his belief that Malabar is self-sufficient in all requirements of military and commerce and hence that Cochin was better suited to be the south east Asian Headquarters of the Dutch overseas forces, compared to Colombo in Ceylon.\n\nInformation is also available in the text of Hortus Malabaricus not only about the vegetation in 17th century Malabar, but also about the general social conditions prevalent in those days. Significant inferences could also be drawn on some of these matters, indirectly from the data available in the book. Several research papers have been published by Manilal on these topics. Some more, particularly on the different Numerals and Numerical Systems used in Hortus and their sociological implications and significances in the Indian society, are under preparation.\n\nTaxonomic and biodiversity studies in Kerala\n\nManilal pioneered taxonomic research and biodiversity studies in Kerala by training a genre of young taxonomists and identifying and cataloguing local plants in biodiversity-rich South India. A comprehensive study on the flora of the Greater Kozhikode area, consisting of the western sectors of the present day Kozhikode and Malappuram districts, covering an area of about 600 km2. was started in 1969. When completed in 1975, this work resulted in recording about one thousand species of flowering plants from the region, including several species recorded for the first time in India and importantly seven species new to science. Based on this work, a book: Flora of Calicut, was published (from Dehra Dun), and was taken as a model for subsequent research in India.\n\nResearch and revelations at Silent Valley\n\nIn the 1970s, when a proposal to build a hydro-electric project in Silent Valley triggered political controversy in Kerala due to an impending ecological disaster, the Government of Kerala appointed an experts’ committee of scientists to study, inventorise and report on Silent Valley's flora and fauna. The experts’ committee reported that the forests there could not be classified as tropical evergreen rainforests and that they contain only 240 species of flowering plants, which are also found elsewhere, and also that the Valley does not possess any new or rare species. Despite protests by environmentalists the State Government was about to go ahead with the project, only awaiting a clearance form the Central Government. At this juncture, the Department of Science and Technology (India) accepted Manilal's proposal to study the flora of Silent Valley and also required him to make a general study of the ecological status of the forests.\n\nOver a four-year period commencing 1981, Manilal and research assistants undertook a study that brought to light:\n\nA record of nearly 1,000 species of flowering plants;\n\nSeven species new to science;\n\nSeveral plants believed to be found only in Sri Lanka, Philippines, etc.;\n\nSome species which were believed to be extinct, such as the Malabar Daffodil, which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris;\n\nRare medicinal plants until then known to grow only in the islands of Philippines;\n\nMany endemics of the neighbouring countries, where their existence was threatened, were found to have migrated to these forests for safety.\n\nFurther Manilal's study found that the Silent Valley forests fulfilled required parameters of tropical evergreen rainforests and, therefore, could be rightly so classified. His work was soon considered as model of how taxonomists could assist in solving socio-environmental issues; and many scientists and journalists from Europe, Africa and South America visited Silent Valley to study the working of this project.\n\nOrchids of Kerala\n\nDetailed studies of the orchid wealth of Kerala were started by Manilal in the late 1970s, including their taxonomy, anatomy, biology and floral evolution, which are essential for any further studies on their hybridisation. During these studies, contrary to the highest expectations, over 215 species of orchids were collected, including species that were till then believed to be extinct, like the ladies' slipper orchid Paphiopedilum druryii.\n\nOrigin and evolution of the flower\n\nManilal has led studies on the directions of evolution of flowers and the structure and anatomy of various floral organs in cash crops such as coconut palms, grasses (rice), orchids, compositae (sun flower), rubiales (coffee), etc. Many enigmas in these subjects could be solved, and results were published in around 45 research papers. These studies have, besides seeing the flower as the most significant part of the plant, with biological, commercial, aesthetic, evolutionary and taxonomic importance, also promoted success in hybridisation and breeding experiments, to create new high-yielding varieties.\n\nRadioactive resistant marine phyto-planktonic algae\n\nAs the beaches in southern Kerala and Tamil Nadu (particularly in the Districts of Kollam and Nagarcoil) have natural deposits of radioactive minerals causing genetic damage to flora and fauna, Manilal undertook studies to familiarise with the techniques of research in the field of radiation ecology. These studies were undertaken at the Marine Biology Laboratory of North Wales University at Menai Bridge, Wales. The Royal Society of London granted Manilal a Visiting Scientist-ship for this work for two years in 1971–1972.\n\nTwo species of marine phyto-planktonic algae were discovered, which could withstand a very high degree of radioactivity. It was found that these species could absorb and adsorb as much as 40 times their body weight of the radioactive Thorium compounds from surrounding seawater, and continue to live normally. In the 1970s these findings were farfetched to be accepted for publication in a journal in U.K. However, on Manilal's return to India, a part of these findings was published in the journal Current Science (1975), by the Indian Institute of Science. About ten years later, some British scientists did a similar work and their results were published in the prestigious U.K. journal Nature, and wide publicity in the press as a biotechnological break-through. Manilal's experiments (and the subsequent work by the British scientists) show that such marine planktonic algae could be used to quickly and safely clean up ocean surfaces where radio-active materials have accumulated, by cultivating such algae in a specific area and later removing them from there.\n\nIndian Association for Angiosperm Taxonomy (IAAT)\n\nManilal was instrumental in establishing the Indian Association for Angiosperm Taxonomy (IAAT). Manilal, as founder President, established IAAT in the year 1990 with its Headquarters located at the Department of Botany, University of Calicut, Kozhikode, India. The IAAT works to promote the science of Angiosperm Taxonomy in India, to provide a common forum for Angiosperm taxonomists in India to organise meetings, hold discussions and exchange ideas on scientific and academic matters, and encourage collaborative work among taxonomists. The IAAT publishes a journal Rheedea (named after Hendrik van Rheede). The Indian Association for Angiosperm Taxonomy works as an affiliate of the International Association for Plant Taxonomy.\n\nFrom 1969 Manilal commenced training research students in Taxonomy (leading to PhD degree in the subject), with a view to attain self-sufficiency in Taxonomy. During the years 1972–1998, he and his students discovered over 240 new species of flowering plants and several new records for India from Kerala, and published many research papers in Taxonomy in national and international journals.\n\nBiomass Research Centre\n\nA Biomass Research Centre was established by Manilal in the University of Calicut, with funding from the Ministry of Non-conventional Energy Sources. The Centre does research and field experiments to establish the (taxonomic) identification of fast-growing fuel-wood trees suitable for various agro-climatic zones of Kerala.\n\nSummary of Manilal's discoveries\n\nNew species and varieties discovered, and combinations established by Manilal and his research associates are summarised are follows:\n\nNew species discovered in Silent Valley\n\nLiparis indiraii Manilal & C.S.Kumar\n\nEria tiagii Manilal & C.S.Kumar\n\nHydnocarpus pendulus Manilal, T.Sabu & Sivar.\n\nRobiquetia josephiana Manilal & C.S.Kumar\n\nSauropus saksenianus Manilal, Prasann. & Sivar.\n\nCucumella silentvaleyi Manilal, T.Sabu & P.J.Mathew\n\nOberonia bisaccata Manilal & C.S.Kumar\n\nNew species discovered under biodiversity studies\n\nHedyotis erecta Manilal & Sivar.\n\nCinnamomum nicolsonianum Manilal & Shylaja\n\nBulbophyllum rheedei Manilal & C.S.Kumar\n\nHeliotropium keralense Sivar. & Manilal\n\nBorreria malabarica Sivar. & Manilal\n\nPhyllanthus kozhikodianus Sivar. & Manilal\n\nHabenaria indica C.S.Kumar & Manilal\n\nNew varieties of flowering plants discovered\n\nBorreria stricta (L. f.) K.Schum. var. rosea; Sivar. & Manilal\n\nBorreria articularis (L. f.) F.N.Williams var. hispida Sivar. & Manilal\n\nPortulaca oleracea L. var. linearifolia Sivar. & Manilal\n\nNew combinations established\n\nThunbergia bicolour (Wight) Manilal & Suresh\n\nEria chandrasekharanii (Bharg. & Moh.) C.S.Kumar & Manilal\n\nAwards\n\nOfficer of the Order of Orange-Nassau award (Dutch: Orde van Oranje-Nassau) by Her Majesty Queen Beatrix of the Netherlands. (The Consul General of the Kingdom of the Netherlands, Ms. Marijke A. van Drunen Littel conferred this honour on 1 May 2012, at Kozhikode, Kerala, India.)\n\nE.K. Janaki Ammal National Award for Taxonomy (2003) – Constituted by The Ministry of Environment and Forests\n\nY. D. Tyagi Gold Medal (1998) – by the Indian Association of Angiosperm Taxonomy (IAAT)\n\nVishwambhar Puri Medal (1990) – by The Indian Botanical Society\n\nPositions\n\nChief Editor, Rheedea, The Journal of Indian Association of Angiosperm Taxonomy (1991–present)\n\nPresident, Botanical Society of India (1999)\n\nTreasurer, Botanical Society of India (1984–1986)\n\nFounding President, Indian Association of Angiosperm Taxonomy (1991)\n\nChairman, CRIKSC (Centre for Research in Indigenous Knowledge, Science & Culture)\n\nPlants named in honour of Prof. K.S. Manilal (Eponyms)\n\nLindernia manilaliana Sivar. (Kew Bull. 31: 151. 1976)\n\nFimbristylis manilaliana Govind. (Rheedea 8(1): 87, f. 1. 1998)\n\nCyathocline manilaliana C.P.Raju & R.R.V.Raju (Rheedea 9 (2): 151-154. 1999)\n\nSchoenorchis manilaliana M. Kumar & Sequiera (Kew Bull. 55: 241. 2000)\n\nCololejeunea manilalia Manju, Chandini & K.P.Rajesh (Acta Bot. Hung. 59(1–2): 262, 1–2. 2017)\n\nPublisher's appeal for donation of royalties\n\nHortus Malabaricus as transliterated by Manilal was published in English and Malayalam languages in 2003 and 2008 respectively. Manilal's copyright, as author of the English and Malayalam versions, was bequeathed, free of royalties, to the publishers, the University of Kerala. This assignment of rights was a gesture by Manilal in good faith and in response to a specific appeal from the then Vice-Chancellor of the University of Kerala, that the University wanted to generate funds from this publication for utilisation of such royalty incomes toward re-publication of old Malayalam classical works, which are out of print, and not forecasted to generate a viable level of income due to limited sale of such classical works.\n\nBook-release functions conducted by the publishers\n\nIn a recorded interview with Manilal in August 2008, he expressed his regret and frustration at the manner in which the publishers subjected him to digression from the publication project soon after he legally assigned his rights as author. Apparently there was a move to exclude Manilal's name from the book (2003), but was reinstated on account of questions raised by the academic community. On 14 August 2008, the University of Kerala officials again conducted a function at Thiruvananthapuram to formally release the Malayalam edition of Hortus Malabaricus. The book was released by the Governor of Kerala (also Chancellor of the University), at the function; where due recognition was not given to Manilal as author of the book, nor were arrangements in place to felicitate the author at the function. [1]. The former Vice-Chancellor of University of Kerala who initiated the project, B. Ekbal, was also not invited to this function.\n\nBooks authored by K. S. Manilal\n\n2012. MANILAL, K.S. Hortus Malabaricus and the Socio-Cultural Heritage of India. Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode.\n\n2008. MANILAL, K.S. Van Rheede's Hortus Malabaricus. Malayalam Edition, with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5)\n\n2004. MANILAL, K.S. & C. SATHISH KUMAR Orchid Memories: A tribute to Gunnar Seidenfaden. Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1)\n\n2003. MANILAL, K.S. Van Rheede’s Hortus Malabaricus. English Edition, with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4)\n\n1998. MANILAL, K.S. & M.S. MUKTESH KUMAR A Handbook on Taxonomy Training. DST, New Delhi.\n\n1998. MANILAL, K.S. & K. RAVEENDRAKUMAR Companion to Gamble’s Flora: Additions to the Flora of Kerala since Gamble (1935). Mentor Books, Kozhikode.\n\n1996. MANILAL, K.S. Hortus Malabaricus and Itty Achuden: A study on the role of Itty Achuden in the compilation of Hortus Malabaricus (In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0).\n\n1996. MANILAL, K.S. Directory of Indian Taxonomists. Mentor books, Kozhikode.\n\n1996. MANILAL, K.S. & A.K. PANDEY Taxonomy and Plant Conservation. C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4)\n\n1994. SATHISH KUMAR, C. & K.S. MANILAL A Catalogue of Indian Orchids. Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X).\n\n1993. MANILAL, K.S. & C. SATHISH KUMAR Field Key for the Identification of the Native Orchids of Kerala. Mentor Books, Kozhikode.\n\n1988. NICOLSON, D.H., C.R. SURESH & K.S. MANILAL An Interpretation of Van Rheede’s Hortus Malabaricus. International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile)\n\n1988. MANILAL, K.S. Flora of Silent Valley Tropical Rain Forests of India. Department of Science & Technology, Government of India, Kozhikode.\n\n1982. MANILAL, K.S. & V.V. SIVARAJAN The Flora of Calicut: The Flowering Plants of the Greater Calicut Area. Bishen Singh Mahendrapal Singh, Dehra Dun.\n\n1980. MANILAL, K.S. The Botany & History of Hortus Malabaricus. A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4)."}, {"url": "https://english.stackexchange.com/questions/49722/did-i-get-or-take-my-degree-from-or-in-the-university-of-somewhere", "page_content": "Firstly, a master's degree is not proper and therefore does not require capitalization, but personally I've seen several highly professional institutions spell it both ways.\n\nSeeing as how all three of those sentences are grammatically sound, it's more a question of etiquette or regional custom. Like Peter Shor was saying, it's not wrong to say that you took your master's degree in somewhere but you may have to use caution repeating prepositions.\n\ne.g. I took my master's degree in astrophysics in the University of Somewhere\n\nUsing in twice is potentially awkward in situations where you may need to elaborate on your area of study.\n\nTo answer your question, all of those examples are grammatically strong and should get the message across appropriately anywhere you go.\n\nOn an editorial note, however, there are some ways to bypass this dilemma by opting for more colorful words:\n\nI (received, earned, attained) a master's degree after (studying in/at, attending, graduating from) the University of Somewhere.\n\nPlay it right and you'll sound like a Nobel Laureate, but all of your sentences will work well; none of them is really noticeably better, even on paper."}, {"url": "https://sites.chem.utoronto.ca/penglab/content/people", "page_content": "Kirsten Yeung PhD Candidate kirsten.yeung@mail.utoronto.ca Kirsten Yeung received her Hon. BSc. from the University of Toronto where she had the opportunity to do international undergraduate research at the Chinese University of Hong Kong studying the toxicological effects of microplastics in zebrafish with the King group. She is currently working on her Master's project with the Peng Group at UofT. She is interested in the characterization of toxicological profiles by quinones using proteomics. In her spare time, Kirsten enjoys writing prose, swimming, and eating her way through the gastronomical city of Toronto.\n\nSteven Kutarna PhD Candidate steven.kutarna@mail.utoronto.ca Steven completed an Honours Specialization BSc. in Chemistry at the University of Western Ontario in 2015. He also has an MEng. in Chemical Engineering from the University of Toronto, where he worked on the electrochemistry of lead deposition on nickel alloys. He joined the Peng group as a PhD student, and is currently researching advanced mass spectrometry techniques for the analysis of halogenated organic chemicals in both consumer products and the Great Lakes watershed. In his spare time, Steven enjoys singing, skiing, learning languages, and running games of D&D.\n\nDavid Ross Hall PhD Candidate davidross.hall@mail.utoronto.ca Hailing from Blind River, Northern Ontario, Dave briefly flirted with a career as a paramedic before deciding to study chemistry. He obtained his B.Sc (Hons) degree from Mount Allison University in 2017, where he majored in Chemistry and minored in Biology and Biochemistry. During his undergraduate studies, he conducted research investigating the surface patterning of nanoparticles at the air-water interface under the supervision of Dr. Meli. He joined the Peng group in May of 2017, and his current research focuses on the development of chemo-proteomic methods to elucidate the physical protein targets of environmental contaminants. Typically, Dave spends his time either complaining about being in the lab, or complaining about not being in the lab."}, {"url": "http://www.ece.ualberta.ca/~kshankar/People.html", "page_content": "Associate Professor Electrical & Computer Engineering\n\nResearch Officer, NRC National Institute of Nanotechnology (NINT)\n\nDr. Karthik Shankar received his B.Tech degree in 2000 from the Indian Institute of Technology-Madras, India, where he was awarded the prestigious Governors Gold Medal for all-round excellence from his graduating class. Dr. Shankar was an Eastman Kodak Research Fellow in 2003. He received his M.S. and Ph.D. degrees in Electrical Engineering at Penn State University. He joined the department of Electrical & Computer Engineering at the University of Alberta as an Assistant Professor in the Aug 2009 and was promoted to Associate Professor with full tenure in July 2013. He is the author of 60 refereed publications and has delivered numerous talks at major international conferences such as the Meetings of the Materials Research Society, the SPIE, the Device Research Conference and the Electronic Materials Conference. He is also listed as an inventor on six provisional patent applications. In 2010, he received the PetroCanada Young Innovator Award.\n\nResearch Interests:\n\nSemiconducting nanotube and nanowire arrays, Bottom-up nanofabrication, Excitonic processes and devices, Photovoltaics, Photoelectrochemistry, Organic light emitting diodes (OLEDs), and Organic thin film transistors (OTFTs)."}, {"url": "https://cmps.ok.ubc.ca/about/contact/mohamed-shehata/", "page_content": "Research Summary\n\nComputer vision; video and image processing; intelligent cameras; biomedical applications; new algorithms for emerging industrial applications and software design of video surveillance systems.\n\nBiography\n\nMohamed S. Shehata obtained his B.Sc. degree with honors in 1996, his M.Sc. degree in computer engineering in 2001 from Zagazig University, Egypt, and then his Ph.D. in 2005 from the University of Calgary, Canada. Following his Ph.D., he worked as a Post-doctoral Fellow at the University of Calgary; after that, he joined Intelliview Technologies Inc. as the Vice-President of the Engineering and Research. Dr. Shehata joined Memorial University in January 2013 as an assistant Professor and then as an Associate Professor in January 2019. In August 2019, Dr. Shehata joined the department of Computer Science, Math, Physics, and Statistics at the University of British Columbia, and became an adjunct professor in the department of Computer Engineering at Memorial University. Dr. Shehata served as the IEEE Newfoundland section chair from 2017-2019. He is also the Editor in Chief of the IEEE Candian Journal of Electrical and Computer Engineering.\n\nWebsites\n\nPersonal website\n\nDegrees\n\nB.Sc., M.Sc. (Zagazig University)\n\nPhD (Calgary)\n\nP.Eng., Senior member IEEE\n\nSelected Publications & Presentations\n\nGoogle Scholar"}, {"url": "https://thewire.in/the-sciences/hortus-malabaricus-van-rheede-ks-manilal-botany-itty-achuden", "page_content": "Some books just get under your skin. Like flagposts, they could draw and guide you at different points of your life. Others, especially religious works, lay the tracks on which lives run. Then there are a few that make you fall hopelessly in love with them because they approximate human infatuation, drawing you in at one moment, mystifying you at others, frustrating and delighting you. But they grow on you, so entwining themselves with your life that at some point it becomes impossible to separate the strands.\n\nFor Kattungal Subramaniam Manilal, a retired professor of botany at the University of Calicut, the love started early. It was an oddly matched couple – a tall, reserved, bespectacled man and Hortus Malabaricus, an elaborately illustrated 17th-century Latin book on the trees and plants of the Malabar region of Kerala. It defined Manilal’s life and career; he would update and translate this mammoth 2,400-page, 12-volume work into English, revealing it to be one of the finest collaborations between east and west.\n\nThe task was mind-boggling. Each of the 742 plants mentioned in Hortus had to be tracked down to the areas they were originally collected from over 300 years ago, and then identified anew because modern taxonomic classification has changed significantly in this period. It showed a book that went far beyond plants, to shed light on the society, culture, science and language of its time.\n\nNow 80 and having suffered a stroke, Manilal remembers little, but signs of Hortus Malabaricus are strewn liberally over more than 50 years of his life. There are half a dozen books he wrote, many more papers and the recollections of colleagues, students and his wife, Jyotsna, who says that for a man “so reticent that often she did not know what he felt”, the Hortus was a “passion”.\n\nManilal first chanced upon this remarkable book in his father’s clippings from Malayalam newspapers of the 1950s, when he was still in school. Much later, as a postgraduate student of botany, he visited the Forest Research Institute in Dehradun, which had a complete set of the original volume of the book. He says it “fired (his) imagination” to find a 300-year-old Latin book of botany with names in Malayalam. He spent four days poring over the volumes and made a list of all the Malayalam names.\n\nThough he couldn’t understand the Latin text, one line from the description of a plant caught his attention. “The plant’s part,” it read translated, “if applied on the left toe improves the clarity of vision in the right eye.” The medicinal properties of the plant were known but how on Earth was the connection between the left toe and the right eye established?\n\nAt that moment, Manilal knew that he had to know what the rest of the book held.\n\nThe Hortus Malabaricus was the brainchild of Hendrik Adriaan Van Rheede Tot Drakenstein (Van Rheede), an aristocrat and soldier in the Dutch East India Company who rose rapidly through the ranks to become the Dutch Governor of Cochin in 1663.\n\nFor the Dutch and the Portuguese, Malabar was a land of abundance – of wood, spices and medicinal plants. For centuries the trade in these commodities had been controlled by Arab merchants who later introduced them to the West.\n\nVan Rheede’s motivations for a work cataloging the plants of the region were varied. One was economic: Arab traders sourced the ingredients for the medicines his soldiers needed from the Malabar, sold them in the West, from where the Dutch would have to import them at great expense. Procuring the medicinal plants and manufacturing medicines locally could save a lot of money.\n\nVan Rheede was also a keen naturalist, mesmerised by the luxuriance of the land he governed. He writes in the preface to the third volume of Hortus Malabaricus:\n\nAfter I had been with the Indians for a considerable number of years and on account of my office fairly often had to make journeys through very well-cultivated regions, on the way I observed large, lofty and dense forests. I saw that they were pleasing through the marvelous variety of trees, which was so great that it would be difficult to find two trees of the same kind in the same forest if one were to search for this. I rather frequently saw many ivies of various kinds climbing to one tree and moreover shooting up in the very branches of trees…so that it was often very pleasant to see on one tree displayed leaves, flowers, and fruits of ten or twelve different kinds.\n\nThe last reason was political. His superior, Admiral Rijcklof Volckertsz van Goens, was keen on making Colombo the second eastern capital of the Dutch, after Jakarta. Van Rheede was staunchly opposed to this. Documenting the medicine, food and timber riches of the Malabar would – he hoped – convince authorities in The Hague to make Cochin the second capital instead.\n\nWork on the Hortus began in 1663, and continued for the next 30 years. The first volume of the book was published in Amsterdam in 1678, a few years after Van Rheede left India, and the final in 1693, two years after his death on board a ship off the coast of Bombay.\n\nMaterial for the book was first written in Portuguese in Cochin, then translated to the Dutch and finally to Latin in Amsterdam. When he first started work on the Hortus Malabaricus in 1964, almost exactly three centuries after Van Rheede had, Manilal knew that Latin would be his first hurdle.\n\nManilal enlisted the help of a local priest who, starting with the line on the connection between the left toe and the right eye, translated small segments of the work. However, to proceed further, Manilal realised he would need to learn the language. Every month he would travel to Kochi for a few days to learn the language from another priest. But even after he became somewhat familiar, he realised that the Hortus was even more difficult and technical. Each volume, Manilal says, took him three to four years. “Now I look back and wonder how I did it,” he was quoted as saying a few years ago. But then the language also turned out to be the easiest part.\n\nThe botanical samples documented in the Hortus Malabaricus were collected by Van Rheede on his travels in the region. Plants around Cochin were easily collected but for those found elsewhere, Van Rheede writes they often had to “wait a whole year, and sometimes even longer, until we could secure one of their flowers or fruits.” When travelling by water to the interiors “to rebuke … some Malabar prince or other”, Van Rheede would often order a party of 200 men to leave the ship and wander through the forest collecting as many different plants as they could find. They would return “laden with plants collected from here, there and everywhere, to (the) warships”.\n\nManilal had to follow in Van Rheede’s footsteps quite literally, tracking down and collecting botanical samples from the locales mentioned in the Hortus. This was because the Hortus Malabaricus was written before Carl Linnaeus’s famous work Species Plantarum, in which the Swedish botanist first laid down the rules that form the basis of modern taxonomy. Botanical classification before that was whimsical and ad hoc, varying between authors. As a result plants, had multiple names, often long and convoluted.\n\nIf Hortus Malabaricus was to be relevant, all the plants it featured would have to be classified according to the modern International Code of Botanical Nomenclature. Either Van Rheede’s original collection, which he had shipped to Amsterdam, would have to be accessed, failing which the plants would have to be re-collected with the help of clues from the Hortus.\n\nThe original collection seemed to have vanished. Manilal made efforts to hunt it down, even going to Moscow at one point after a rumour that it might be there. He couldn’t succeed.\n\nManilal decided to hunt down the plants, scouring Hortus for every possible clue to their location and appearance. It was going to be a time consuming and expensive process, so he applied for grants. The University Grants Commission (1975-1978) and the Smithsonian Institution (1984-1987) agreed to fund the project. To help with the collection Manilal roped in C.R. Suresh, a student of his who was studying plant morphology.\n\nOver the seven years covered by the grants, they travelled across the length of Kerala – “from Kasargod” at the northern tip “to Trivandrum”, almost 500 km to the south, says Suresh. They would travel together, but since Manilal had university work to attend to, Suresh would often be on his own. “But there were some plants Manilal sir insisted on tracking down himself,” Suresh says, “particularly those specimens where he was also interested in seeing the surroundings – the geography and other plants that grew alongside.”\n\nThey managed to track down 741 plants. That was all but one of the plants mentioned in Hortus.\n\nThe first obstacle to this was pinning down the original locations. Place names had changed over the centuries. Other names were garbled in the tortuous translation from Malayalam to Portuguese, Dutch and then to Latin. In many cases, plants couldn’t be found in the original locations so the team had to scout farther afield.\n\nOften they would have to venture deep into forests, where elephants and snakes were a common hazard. Suresh was also troubled by allergenic plants, of which he says there were many. “Then”, he laughs, “there were local problems. With our bags full of plants of all shapes and sizes, we looked like madmen and had a difficult time explaining what we were doing to the villagers.”\n\nAt times the work was laborious. Getting fruits and flowers from plants would often require repeat visits at different times of the year. Suresh recounts instances on such trips when they were unable to locate the same plant, which meant they would have to start anew with another specimen.\n\nThen came the equally arduous process of identification, which involved extensive consultations with botanists around the world, and trips to labs and collections abroad. Manilal would use occasional travel to conferences abroad to sneak visits to them.\n\nBy 1988, the work was complete. In that year, Manilal, Suresh and Dan Nicolson of the Smithsonian Institution published a book entitled ‘An Interpretation of Van Rheede’s Hortus Malabaricus’, listing all the plants collected by Van Rheede in modern nomenclature.\n\nFor most people, this is where it would have ended. Manilal had a full-time job at the University of Calicut with teaching responsibilities, and continued to work in other areas.\n\nAt the time of a controversy about the proposed construction of a hydro-electric project in the Silent Valley, the Kerala government commissioned Manilal to undertake a four-year study of the area’s flora. His team recorded 1,000 species of flowering plants of which seven were new and others that were endangered. He also worked extensively on the orchids of Kerala, collecting over 215 species, led studies on the anatomy of cash crops like coconut palm and coffee, and researched species of marine algae that were resistant to radioactivity. But in every spare moment and interstice, he would return to his first love, because for him things were just beginning to get interesting.\n\nOther books had been written on the flora of India – but what distinguished Hortus Malabaricus was its emphasis on, and acknowledgement of, local knowledge. While Van Rheede was responsible for collecting the botanical samples, Itty Achuden, chief of the Collatt family of traditional physicians, identified them and listed their medical and agricultural uses. Achuden’s role in the Hortus Malabaricus is mentioned prominently, affirmed in two certificates at the very start.\n\nInterestingly, even though he belonged to the lower Ezhava (labour) caste, Achuden had been recommended for the task by Vir Kerala Varma, the king of Cochin. Three Konkani Brahmins, whose roles have also been acknowledged in the book, worked under him. Achuden was far more knowledgeable about the local plants than the Brahmins, whose knowledge was largely restricted to providing information from their traditional text, Mahanighandu, a pharmacological glossary that lists 400 medicinal plants from different parts of India in Sanskrit. Manilal was fascinated by this deference to knowledge over caste.\n\nVan Rheede had also been similarly fascinated. “I often attended a most delightful entertainment,” he says, “for instance when these gentile philosophers disagreed and disputed with each other by weight of arguments. Indeed they disputed and strongly defended their own opinions, but with incredible modesty, such as you might miss in the most distinguished philosophers of the world.”\n\nNone of the traditional medical texts of Achuden’s family are extant. Nor, Manilal realised, was there any mention of him elsewhere. The Hortus was the only remaining repository of this knowledge. And of the plants mentioned in it, the medical uses of 139 weren’t to be found in any other text. Had it not been for Achuden’s contribution, the significance would have been lost to the world. For Manilal, cataloguing these medical properties and uses was imperative to protecting India’s intellectual property, which, according to Jyotsna Manilal, he felt strongly about.\n\nAs Manilal delved deeper into Achuden’s life, he was also drawn into an exploration of this historical interaction between caste and knowledge, which seemed to stand in sharp contrast to the modern terms of their relationship. He explored this in ‘A Study on the Role of Itty Achuden in the Compilation of Hortus Malabaricus’, a Malayalam book published in 1996.\n\nEvery aspect of the Hortus Malabaricus led the besotted Manilal down a different path. The juxtaposition of two different dialects of Malayalam in Hortus – one of which is not used today – became an opportunity to investigate the evolution of Malayalam as well. He explored the considerable impact the book had on Linnaeus; Species Plantarum has more than 250 references to it. Manilal even investigated the identify of the artist who made the frontispiece of the original volume that depicted Flora, the Roman goddess of flowers, sitting and holding a rake in front of what seems like a very ornate greenhouse. To her right, holding various plants, stand the Malabari physician and the three Konkani Brahmins who were so central to this book.\n\nIn Manilal’s reimagining, the botany of Hortus Malabaricus was inextricably entwined with the eventful historical period it belonged to. He made these connections come alive. After he retired from academia in 1999, Manilal devoted himself entirely to the Hortus, the English version of which was released in 2003. He had signed off his copyright to the University of Calicut, which, in an act of cruel and petty politicking, did not invite him to the book release. But he was undeterred and continued working. According to Jyotsna, “He never really said very much about it.” The Malayalam edition followed a few years later.\n\nIn 2006, Manilal suffered a stroke, leading to the loss of mobility on his right side. But he was not done yet; his work on the Hortus Malabaricus was far from complete. He taught himself to type with only his left hand to complete his last book: ‘Hortus Malabaricus and the Socio-Cultural Heritage of India’. It was published in 2012, the same year Queen Beatrix of the Netherlands conferred a state honour on him for his work on the Hortus. Sadly, there has been little recognition in India of his work – not that Manilal cares. The Hortus Malabaricus was his first love, mission and crowning glory. And love is often its own reward.\n\nAkshai Jain is a Delhi-based journalist."}, {"url": "https://www.sci.cuhk.edu.hk/en-gb/faculty/people/deanery", "page_content": "Prof. Song received his B.Sc. in Chemical Engineering from Dalian University of Technology, China in 1982, M.Sc. and Ph.D. in Applied Chemistry from Osaka University, Japan in 1986 and 1989 respectively. He was a Distinguished Professor of Fuel Science, Professor of Chemical Engineering and Director of the EMS Energy Institute at the Pennsylvania State University, University Park in the USA before joining CUHK. His original and innovative research contributions to catalysis, adsorption, CO2 capture and conversion, and energy and clean fuels research have been widely recognised by many awards and honours such as George A. Olah Award and Henry H. Storch Award from American Chemical Society (ACS), Fellow of ACS, Distinguished Researcher Award from ACS Energy & Fuels Division, and Distinguished Fulbright Scholar from the US-UK Fulbright Commission.\n\nProf. Jiang graduated from the South China Agricultural University in 1984, then proceeded and obtained his Master degree and Ph.D. from University of British Columbia in 1992 and Simon Fraser University in Canada in 1996 respectively. Prof. Jiang joined the CUHK in 2000, where he received Faculty Exemplary Teaching Award, Outstanding Fellow of the Faculty and Research Excellence Award. He obtained the Croucher Senior Research Fellowship in year 2009-10 and again in 2015-16; and also the Ministry of Education (MOE) Higher Education Outstanding Scientific Research Output Awards for the third time (2009, 2013 & 2017). He is the Choh-Ming Li Professor of Life Sciences, Director of Centre for Cell and Developmental Biology as well as Director of RGC-AoE Centre for Organelle Biogenesis and Function.\n\nProf. Kwan received his B.Sc. degree with first class honours and Ph.D. degree in Biochemistry from the University of Hong Kong in 1990 and 1997 respectively. He then pursued his postdoctoral training and became the instructor in the University of Texas M.D. Anderson Cancer Center in USA. He joined CUHK in 2006 and was awarded the Young Researcher Award in 2008. He also received the Faculty Exemplary Teaching Award twice, in 2009 and 2013, in recognition of his contribution in teaching. Prof. Kwan has been the first Programme Director of the Natural Sciences Programme since 2014.\n\nProf. Wong obtained his B.Sc. degree with first class honours in Mathematical Sciences from the Hong Kong Baptist University in 1997 and Ph.D. in Mathematics from the Hong Kong University of Science and Technology in 2001. He joined CUHK in same year and was a founding Co-Director of the Quantitative Finance and Risk Management programme and Director of the MSc in Risk Management Science programme. He received the Vice-Chancellor's Exemplary Teaching Award twice in 2015 and 2020 as a recognition of his outstanding contribution in teaching.\n\nProf. Shannon Au graduated from Portsmouth University, UK. She received her Ph.D. degree in Molecular Genetics and Structural Biology at the University of Hong Kong. She then pursued her postdoctoral trainings in protein x-ray crystallography at the University of Hong Kong, the University of Oxford and the Institute of Cancer Research, UK. She joined CUHK in 2003 as an Assistant Professor in the Department of Biochemistry. She was appointed as Assistant Dean (Student Affairs) of the Faculty of Science in August 2015.\n\nProf. Ngai obtained his B.Sc. degree with first class honours and Ph.D. in Chemistry from CUHK in 1999 and 2003 respectively. He then pursued his postdoctoral training in Germany and USA before joining CUHK as a Research Assistant Professor in 2006. Prof. Ngai received the Croucher Fellowship in 2003 and many other teaching and research awards like Faculty Exemplary Teaching Award, Research Excellence Award, Young Researcher Award thereafter. His research interests center on various areas of surface and colloid science."}, {"url": "https://people.sutd.edu.sg/~shengyuan_yang/members/", "page_content": "\n\nLinqiang Xu, Visiting PhD Student\n\nLinqiang is from the city of Zhangzhou, Fujian province, China. Now he is a PhD student at School of Physics, Peking University. His research interests mainly focus on the contact properties of 2D material-metal interface and transport properties of sub-10 nm FET. He joined RLQM as a visiting PhD student in November 2022.\n\nEmail: xulq@pku.edu.cn\n\n“Stay Hungry. Stay Foolish.”\n\n\n\nKaijuan Pang, Visiting PhD Student\n\nKaijuan is from the city of Jinzhong, Shanxi province, China. She is a PhD student at Harbin Institute of Technology. Her previous research mainly focused on the first-principles calculation of 2D Janus multiferroic materials. She has been visiting RLQM since Oct 2022.\n\nResearch Focus: SHG of 2D Janus materials; electronic properties of 2D multiferroic materials\n\n“Pardon all men, but never thyself.”\n\n\n\nHengfu Lin, Visiting Professor from Wuhan University of Science and Technology\n\nHengfu is from Ji’an, Jiangxi, China. He received his B.S. degree from Southwest University in 2009, and PhD degree from institute of physics of CAS in 2015. Now he is an Associate Professor at Department of Applied Physics, Wuhan University of Science and Technology. He has been visiting RLQM since Oct 2022. His research interest is on studying two dimensional materials by computational and theoretical methods, especially on materials with semiconductor, magnetism, and topological characters.\n\nEmail: hflin@wust.edu.cn\n\n“Be self-consistent”\n\n\n\nYuanyuan Wang, Postdoctoral Research Fellow\n\nYuanyuan comes from Cangzhou, Hebei province, China. She obtained her PhD degree in condensed matter physics from Shandong University in 2022. Her previous research interest focuses on the study of 2D valleytronic materials through theoretical modeling and density functional theory calculations. She also has interest in modeling and simulation of excited-state properties using many-body perturbation theory. She joined RLQM in Oct 2022.\n\nEmail: pwangyy93@gmail.com\n\n“A great journey starts with a single step.”\n\n\n\nYanfeng Ge, Senior Research Fellow\n\nYanfeng is from Shijiazhuang, Hebei province, China. He received the PhD degree in theoretical physics from Beijing Institute of Technology, Beijing, in 2016. Then he joined Yanshan University, School of Science. Now he is an associate professor at Yanshan University. He has been conducting research at RLQM since May 2022.\n\nResearch Focus: Electron-phonon interactions from first principles, two-dimensional materials\n\nEmail: yfge@ysu.edu.cn\n\n“Face the past with the least lamentation, face present with the least waste and with the most dream to face future.”\n\n\n\nYiwei Zhao, Visiting PhD Student\n\nYiwei is from the city of Lanzhou, China. She is a PhD student at Xi’an Jiaotong University. Her previous research mainly focused on the phase transition of 2D materials (such as monolayer transition metal dichalcogenides) and field-effect transistors based on these materials. She has been visiting RLQM since Apr 2022.\n\nEmail: zhaoyiwei@stu.xjtu.edu.cn\n\n“Be yourself; everyone else is already taken.” —Oscar Wilde\n\n\n\nZeying Zhang, Senior Research Fellow\n\nZeying is from the city of Shuozhou, Shanxi province, China. He received his B.S. degree from Shandong University, China in 2013, and PhD degree from Beijing Institute of Technology, China in 2019. He also studied at the TU-Darmstadt as a joint PhD student for two years. Now he is an associate professor at College of Mathematics and Physics, Beijing University of Chemical Technology. He joined RLQM in Jun 2022. His current research interest is mainly focused on magnetic topological materials and high throughput materials design.\n\nEmail: zhangzeyingvv@gmail.com\n\n“The bread will have of, the milk will also have of.”\n\n\n\nRuiling Gao, Visiting PhD Student\n\nRuiling comes from Linfen, Shanxi province, China. She obtained her Master’s degree from Shanxi Normal University. Now she is a PhD student at the Department of Physics, Shanghai University. She has been visiting RLQM since March 2022.\n\nResearch Focus: Quantum anomalous Hall effect, low-dimensional materials, heterostructures\n\nEmail: ruilinggao@shu.edu.cn\n\n“Every little helps a mickle!”\n\n\n\nJin Cao, Former Visiting PhD Student\n\nJin Cao comes from Henan province, China. He is a PhD student at the School of Physics at Beijing Institute of Technology. His research mainly focuses on the transport and nonlinear optical properties of topological materials. He works at RLQM as a joint training PhD student from Nov 2021 to Nov 2022.\n\nEmail: caojin.phy@gmail.com\n\n“You are very much on time, and in your time zone destiny set up for you.”\n\n\n\nXiao-Ping Li, Former Visiting PhD Student\n\nXiao-Ping Li comes from Inner Mongolia Municipality, China. He obtained his Bachelor’s degree in physics from Inner Mongolia University in 2016. Then he continued his study for PhD in the School of Physics at Beijing Institute of Technology. His research interest is on topological quantum phases and their material realizations. He visited RLQM from Nov 2021 to May 2022.\n\nEmail: xpli@bit.edu.cn\n\n“Haste makes waste.”\n\n\n\nLiying Wang, Former Visiting Professor from Tianjin University\n\nLiying is from Xingtai, Hebei province, China. She received her PhD degree in Materials Science and Engineering from Hebei University of Technology, Tianjin, in 2015. Then she joined Tianjin University, School of Science. Now she is a Senior Engineer at Tianjin University. She visited RLQM from Dec 2021 to Dec 2022.\n\nResearch Focus: DFT and experiment studies of spintronic materials, low-dimensional functional materials and heterostructures\n\nEmail: liying.wang@tju.edu.cn\n\n“Today is the best day!”\n\n\n\nHui Wang, Postdoctoral Research Fellow\n\nWang Hui is from Qingdao, Shandong province, China. She obtained her Bachelor’s degree in physics from Xiamen University. From 2015 to 2020, she studied in the School of Physics at Peking University and obtained the PhD degree in condensed matter physics. She joined RLQM as a Research Fellow in Oct 2021.\n\nResearch Focus: electronic and transport properties of 2D materials\n\nEmail: wanghui11.sg@gmail.com\n\n“Keep moving!”\n\n\n\nXukun Feng, PhD Student\n\nFeng Xukun is from the city Weifang, Shandong Province, China. He obtained his B.Sc. from Ocean University of China and M.Sc. from Shandong University. His previous research was on the first-principles study of 2D multiferroic materials. He joined RLQM as a PhD student in September 2021.\n\nEmail: xukun_feng@mymail.sutd.edu.sg\n\n“Nothing is impossible for a willing heart.”\n\n\n\nXiangyue Liu, Former Visiting PhD Student\n\nXiangyue is from the city of Xinyang, Henan province, China. She received her Master’s degree in condensed matter physics from Sichuan University in 2019. Now she is a PhD student at the College of Physics, Sichuan University. She visited RLQM from Jul 2021 to Jun 2022.\n\nResearch Focus: photo-excited carrier dynamics, 2D heterostructures, dynamic properties of interfaces\n\nEmail: xiangyueliuscu@163.com\n\n“One today is worth two tomorrows.”\n\n\n\nYilv Guo, Former Visiting PhD Student\n\nYilv Guo is from the city of Wuxi, Jiangsu province, China. She obtained her Bachelor’s degree from Hunan Normal University. Now she is a PhD student at the School of Physics, Southeast University. She visited RLQM from Jul 2021 to Jun 2022.\n\nResearch Focus: 2D magnetic materials\n\nEmail: ylguo1009@foxmail.com\n\n“Will is power.”\n\n\n\nShiying Guo, Former Visiting PhD Student\n\nShiying received her Bachelor’s degree in materials science and engineering from Nanjing University of Science and Technology in 2016. Now she is a PhD student in the Key Laboratory of Advanced Display Materials and Devices, Nanjing University of Science and Technology. Her current research interests are concentrated on exploring 2D material applications in electronic and optoelectronic devices. She visited RLQM from Jun 2021 to Jun 2022.\n\nEmail: guosy@njust.edu.cn\n\n\n\nXiamin Hao, Former Visiting PhD Student\n\nXiamin comes from Shanxi province, China. She obtained the B.Sc. degree in Physics from Taiyuan Normal University and the M.Sc. degree in condensed matter physics from Beihang University. Then she continued her study at Beihang University for PhD’s degree in condensed matter physics. She visited RLQM from Jun 2021 to Jun 2022.\n\nResearch Focus: theoretical design and control of low-dimensional topological materials\n\nEmail: haoxm@buaa.edu.cn\n\n“Have you somewhat to do tomorrow, do it today.”\n\n\n\nQian-Qian Wang, PhD Student\n\nQian-Qian is from Yuzhou, Henan Province, China. She obtained Bachelor’s degree in engineering from The University of Shanghai for Science and Technology in 2016, and Master’s degree in physics from The East China Normal University in 2019. She also studied at the Institute of Physics, CAS as a joint master student for one year in 2018. Her previous research was on the first-principles study of strongly correlated materials. She joined RLQM as a PhD student in Sep 2020.\n\nEmail: qianqian_wang@mymail.sutd.edu.sg\n\n“I enjoy the life and do not need ways of escape.” —Gakki\n\n\n\nYuexin Huang, Postdoctoral Research Fellow\n\nYuexin comes from Guangxi, China. He obtained his PhD degree in physics from University of Science and Technology of China (USTC) in 2016. Then he continued to work at USTC as a postdoc from 2016 to 2019. He joined RLQM as a Research Fellow in Dec 2019.\n\nResearch Focus: quantum information, cavity physics, ultracold atoms, topological and many-body physics.\n\nEmail: hyx979@qq.com\n\n\n\nHao Guo, Former Visiting PhD Student\n\nGuo Hao comes from Hengshui, Hebei Province, China. He is a PhD student at the Department of Mechanics and Engineering in Sichuan University. His research interest is in studying the ferroelectric and thermoelectric properties of 2D materials. He visited RLQM from Nov 2019 to Nov 2020.\n\nGuo Hao is currently a Professor at Hebei Normal University of Science and Technology, Qinhuangdao, China.\n\nResearch Focus: ferroelectric and thermoelectric materials\n\n“Keep learning, keep improving.”\n\n\n\nJiao-Jiao Zhu, PhD Student\n\nZhu Jiaojiao is from the city Xiangyang, China. She obtained her B.Sc. and M.Sc. degrees from the School of Physical Science and Technology, Lanzhou University. Her previous research was on the experimental study of rechargeable batteries. She joined RLQM as a PhD student in September 2019.\n\n“Don’t worry, be happy.”\n\n\n\nGuangzhao Wang, Former Visiting Professor from Yangtze Normal University\n\nGuangzhao comes from Linzhou, Henan Province, China. He obtained his PhD degree in Solid State Physics and Chemistry from Southwest University in 2017. Then he joined Yangtze Normal University. He visited RLQM from Sep 2019 to Sep 2021.\n\nResearch Focus: photocatalytic water-splitting; energy storage materials; 2D heterostructures\n\nEmail: wangyan6930@yznu.edu.cn\n\n“Go your own way regardless of what others say.”\n\n\n\nJianzhou Zhao, Former Senior Research Fellow\n\nJianzhou comes from Anyang, a city of Henan in China. He obtained his PhD degree from the China Academy of Engineering Physics (CAEP) in 2012. He worked in the Institute of Physics CAS as a postdoc from 2012 to 2015. Then he joined the Southwest University of Science and Technology as a Lecturer. He visited ETH Zurich from 11/2017 to 12/2018, and University of Zurich from 03/2019 to 05/2019. He worked at RLQM as a postdoctoral research fellow from Jul 2019 to Jul 2021.\n\nResearch Focus: strongly correlated materials, DFT+DMFT, topological materials\n\nEmail: jianzhou_zhao@sutd.edu.sg\n\n\n\nLiwen Zhang, Former Visiting PhD Student\n\nZhang Liwen comes from Xiaoyi, Shanxi Province, China. She is a PhD student at the Institute of Laser Spectroscopy, Shanxi University. Her research direction is quantum transport in molecular and nanoscale electronics, targeting at spintronics, photovoltaics, and transistor device applications. She visited RLQM from Jul 2019 to Oct 2019.\n\n“Never against your heart”\n\n\n\nRunwu Zhang, Former Research Assistant\n\nRun-Wu Zhang is from Tianjin, China. He is a PhD student in the School of Physics at Beijing Institute of Technology. His research interest is on the novel symmetry-protected topological states of matter and their physical properties. He worked at RLQM as a research assistant from May 2019 to Nov. 2019.\n\nResearch Focus: topological quantum functional materials, magnetic materials, novel layered materials.\n\nEmail: zhangrunwu@163.com\n\n“Stay Hungry, Stay Foolish!”\n\n\n\nWenhui Wang, Former Postdoctoral Research Fellow\n\nWenhui comes from Anqing, Anhui Province, China. She obtained her Ph.D. degree from University of Science and Technology of China in 2016. After that, she worked as a joint postdoctoral researcher at Shenzhen University and Birmingham University. She was a postdoc research fellow at RLQM from 2019 to 2020. Her research interest is on two-dimensional materials, photonic crystals, topological materials, and dynamics in plasmas.\n\nWenhui is currently a Postdoctoral Research Fellow at Fribourg University.\n\n“To know what you know and what you do not know, that is true knowledge.” —Confucius\n\n\n\nHao Chen, Former Visiting Master Student\n\nChen Hao is from the city of Weifang, Shandong province, China. He obtained his Bachelor’s degree from Qufu Normal University. Then he joined the Center for Quantum Transport and Thermal Energy Science at Nanjing Normal University. He visited RLQM from Mar 2019 to Jul 2019.\n\nResearch Focus: chiral phonons in 2D materials, quasi 1D topological materials, transport phenomena\n\nEmail: 2879537924@qq.com\n\n“The harder, the more fortunate.”\n\n\n\nRuichun Xiao, Former Visiting Postdoctoral Research Fellow\n\nRuichun was born in Oct. 1989 at Huaibei, Anhui Province, China. He obtained his Ph.D. degree from University of Science and Technology of China in 2018, then he became a postdoctoral research fellow at Soochow University. He visited RLQM from Mar 2019 to May 2019.\n\nRuichun is currently an Associate Professor at Anhui University.\n\n“The ant is the most industrious animal, but it most be scanty in words.” —Franklin\n\n\n\nJunping Hu, Former Research Fellow\n\nHu Junping was born in April 1985 (Aries) at Xinyu, Jiangxi Province, China. In 2015, he visited RLQM for one year. He obtained his PhD degree from Beijing Institute of Technology in 2016, after which he became a Professor at Nanchang Institute of Technology. He joined RLQM again as a research fellow from 2018 to 2019.\n\nResearch Focus: battery electrode materials; 2D materials\n\nHobbies: badminton; music; and making friends\n\nEmail: jphu@nit.edu.cn\n\n“A bird in the hand is worth ten in the forest.”\n\n\n\nShan Guan, Former Visiting PhD Student\n\nGuan Shan is from Luoyang, China. He visited RLQM from 2014 to 2017. He obtained his PhD degree from Beijing Institute of Technology in 2018. His research is focused on the investigation of electronic, mechanical, optical, and plasmonic properties of novel materials using first-principles calculations. He wishes to have close collaborations with friends from experimental groups. Anyone who would like to play basketball, or go hiking and travelling together is welcome to contact him.\n\nGuan Shan is currently a Researcher at Institute of Semiconductors, Chinese Academy of Sciences.\n\nResearch Focus: 2D materials and 2D electrides\n\nHobbies: basketball; movie making; cycling; hiking\n\nEmail: sguan2012@163.com\n\n“No basketball, no life.”\n\n\n\nYing Liu, Former PhD Student\n\nLiu Ying is from the city Daqing in the northeast of China. She obtained her B.Sc. and M.Sc. degrees in Theoretical Physics from the Northeast Normal University at Changchun, with First Class Honours. Her previous research was on the study of strongly correlated spin models. She studied at RLQM from 2015 to 2020.\n\nAfter graduation, Liu Ying became an Associate Professor at Hebei University of Technology, Tianjin, China.\n\nResearch Focus: electronic and transport properties of topological materials\n\nEmail: ying_liu@mymail.sutd.edu.sg\n\n“I am on the road to become a female doctor.”\n\n\n\nXiaolong Feng, Former PhD Student\n\nFeng Xiaolong comes from Huangshi, Hubei. He obtained his BSc in Optical Information Science and Technology from Huazhong University of Science and Technology in 2012. Later he got his Master’s degree in Condensed Matter Physics from The University of Chinese Academy of Sciences in 2015. After working for three years, he joined RLQM as a PhD student in Sep 2018 and graduated in Sep 2022.\n\nXiaolong is current a Postdoctoral Research Fellow working at Max Planck Institute at Dresden.\n\nResearch Focus: topological materials; transport effect\n\nEmail: xiaolong_feng@mymail.sutd.edu.sg\n\n“I know one thing that I know nothing.” —Socrates\n\n\n\nJu Zhou, Former Visiting PhD Student\n\nZhou Ju comes from Wenzhou, Zhejiang Province, China. He obtained his Bachelor’s degree in Physics from Zhejiang Normal University in 2016. Then he studied in Soochow University for his PhD degree in Condensed Matter Physics. He visited RLQM from Jan 2019 to Feb 2019.\n\nResearch Focus: two-dimensional materials; first-principles calculations\n\n“Get busy living or get busy dying.” —Stephen King\n\n\n\nPengxia Zhou, Former Visiting Professor from Nantong University\n\nProf. Zhou is from Hejin city, Shanxi province, China. She received her B.S. degree from Yangzhou University in 2004. Then, she joined Nantong University as a lecturer. From 2011 to 2015, she studied at Nanjing University and obtained the Ph.D. degree in condensed matter physics. She visited RLQM as a visiting scholar from Oct 2017 to Feb 2018.\n\nResearch Focus: multiferroic properties of perovskite superlattices and 2D materials, first-principles calculations\n\n“Learning without thinking leads to confusion; thinking without learning ends in danger.” —The Analects of Confucius\n\n\n\nGang Liu, Former Visiting Professor from Jiangxi Normal University\n\nProf. Liu visited RLQM from July 2015 to January 2016. He is a table tennis champion.\n\nResearch Focus: DFT study of physical and chemical properties of novel materials\n\n\n\nShan-Shan Wang, Former PhD Student\n\nWang Shan Shan is from the city of Zhengzhou, China. She obtained her Bachelor’s degree in Nuclear Physics from School of Nuclear Science and Technology of Lanzhou University in 2015. She joined RLQM as a PhD student in September 2015 and graduated in May 2019. She claims to have a very short reflex arc.\n\nAfter graduation, Shan Shan became an Associate Professor at Southeast University, Nanjing, China.\n\nResearch Focus: topological materials and 2D materials\n\nEmail: wangss@seu.edu.cn\n\n“Physics put the dream in my reality.”\n\n\n\nPei Yang, Former Visiting PhD Student\n\nYang Pei is from Qingyang, a small city in the northwest of China. He obtained his Bachelor degree in Applied Physics from Tianjin Polytechnic University. Then he studied in Beijing Institute of Technology for the Master’s, and now for his PhD degree in computational condensed matter physics. He visited RLQM in 2016. His research interest is on the study of photo-voltaic and photo-catalytic materials using first-principles methods.\n\nYang Pei is currently a Postdoctoral Research Fellow at Shenzhen University.\n\nHobbies: Chinese history; economy and political science\n\n“What does not destroy me, makes me stronger!”\n\n\n\nCong Chen, Former Visiting PhD Student Chen Cong comes from Zhejiang, China. He obtained his Bachelor’s degree in Applied Physics from Beihang University. Then he continued his study at Beihang for his PhD’s degree in condensed matter physics. He visited RLQM from Jan 2017 to Jul 2020. Chen Cong is now a Research Fellow at University of Hong Kong. Research Focus: topological materials study from first-principles calculations “Growing Strong”\n\n\n\nYunwei Zhang, Former Research Assistant\n\nYunwei comes from Changchun, Jilin Province, China. She obtained her Bachelor’s degree in physics from Jilin University in 2009, and then continued to study for the PhD degree in condensed matter physics in the State Key Lab of Superhard Materials, Jilin University. She visited RLQM from Jan 2017 to Jul 2017.\n\nYunwei is currently an Associate Professor at Sun Yat-sen University, Guangzhou, China.\n\nResearch Focus: intelligent structure searching; materials under high pressures; inorganic electride materials\n\nEmail: zhangyunw@mail.sysu.edu.cn\n\n“What makes you different right now, makes you stand out later in life.”\n\n\n\nSi Li, Former Postdoctoral Research Fellow\n\nLi Si is from the city of Yongzhou, Hunan province, China. He is a PhD student in the School of Physics at Beijing Institute of Technology. He stayed at RLQM as a visiting PhD student from 2017 to 2019. After graduation, he became an Associate Professor at Hunan Normal University. He re-joined RLQM as a research fellow from Dec 2019 to Dec 2020.\n\nSince 2021, Li Si became a Professor at Northwest University, Xi’an, China.\n\nEmail: sili@nwu.edu.cn\n\n“The wise are free from perplexities; the virtuous from anxiety; and the bold from fear.”\n\n—Confucius\n\n\n\nWeikang Wu, Former PhD Student\n\nWu Weikang is from Binzhou, Shandong province, China. He obtained his B.S. and M.Eng. from School of Materials Science and Engineering at Shandong University, Jinan. He studied at RLQM as a PhD student from 2016 to 2020.\n\nAfter graduation, Weikang worked as a Research Fellow at Nanyang Technological University, Singapore. He became a Professor at Shandong University since 2022.\n\nHobbies: table tennis; reading\n\nEmail: wuweikang_keith@hotmail.com\n\n“Learn and live.”\n\n\n\nBo Tai, Former PhD Student\n\nTai Bo comes from Nanjing, China. He obtained his Bachelor’s degree in Opto-electronic Information Engineering from China Jiliang University. He joined RLQM first as a research assistant in Aug 2016 and then as a PhD in Jan 2017. He graduated in Sep 2022.\n\nResearch Focus: 2D materials; condensed matter theory\n\n“We are all in the gutter, but some of us are looking at the stars.” —Oscar Wilde\n\n\n\nHuiying Liu, Former Postdoctoral Research Fellow\n\nLiu Huiying is from the city of Puyang, Henan, in the middle of China. She obtained her Bachelor degree in physics from Sichuan University. From 2012 to 2018, she studied at the International Center for Quantum Materials at Peking University and obtained the Ph.D. degree in condensed matter physics. Her previous research was on nonequilibrium superconductivity and superconducting liquid. She worked at RLQM as a Postdoctoral Research Fellow from Jul 2018 to Aug 2021.\n\nHuiying is current an Associate Professor at Beihang University.\n\nResearch Focus: quantum transport, superconductivity, topological materials, nonlinear transport\n\nEmail: liuhuiying@pku.edu.cn\n\n\n\nYalong Jiao, Former Postdoctoral Research Fellow\n\n\n\nJiao Yalong is from Handan, Hebei province, China. He received his PhD degree in energy and process engineering from Queensland University of Technology (Australia) in February 2018. He worked at RLQM as a postdoctoral research fellow from June 2018 to June 2019. After RLQM, Yalong became a Humboldt Scholarship Research Fellow at Theoretische Chemie, Technische Universität Dresden.\n\nSince 2021, Yalong became a Professor at Hebei Normal University.\n\nResearch Focus: two-dimensional materials, novel electronic properties, structure search and design\n\nEmail: yalong.jiao@hebtu.edu.cn\n\n“Structures are predictable, but life is not. Cherish every beautiful day and cherish the time with your family.”\n\n\n\nZiming Zhu, Former Postdoctoral Research Fellow\n\nZiming Zhu is from Hunan province, China. He earned his PhD degree in the condensed matter physics from Xi’an Jiaotong University at the end of 2016. Then he jointed Hunan Normal University as a lecturer. He worked at RLQM from Sep 2017 to Sep 2018.\n\nZiming is currently an Associate Professor at Hunan Normal University.\n\nResearch Focus: novel topological materials, surface diffusion, phonon transport\n\nEmail: ziming_zhu@bit.edu.cn\n\n“Sharp tools make good work.”\n\n\n\nTing-Ting Zhang, Former Visiting PhD Student\n\nTing-Ting Zhang comes from Jieyang, Guangdong Province, China. She received her Bachelor’s degree in Applied Physics from South China University of Technology in 2013. Then she continued her study in the Institute of Physics, Chinese Academy of Sciences, Beijing and obtained her PhD’s degree in condensed matter physics. She visited RLQM in 2018.\n\nTing-Ting is currently an Admin Officer at Institute of Physics, Beijing.\n\nResearch Focus: topological materials and two-dimensional materials\n\n“Live beautifully, dream passionately”\n\n\n\nZhi-Ming Yu, Former Postdoctoral Research Fellow\n\nYu Zhiming is from Jiangxi, China. He obtained his PhD degree in theoretical condensed matter physics from RenMin University of China in 2014. Then he worked as a postdoc research fellow in Beijing Institute of Technology from 2014 to 2016. He has been visiting RLQM from March to September 2016. He worked at RLQM as a postdoctoral research fellow from Oct. 2016 to Oct. 2019. After RLQM, Zhi-Ming became a Professor at Beijing Institute of Technology. Research Focus: electronic and transport properties of topological materials; topological effects in condensed matter “The night is long that never finds the day.” —Shakespeare\n\n\n\nXiaoming Zhang, Former Postdoctoral Research Fellow\n\nZhang Xiaoming comes from Chengde, a city in the north part of China. Many Chinese people have known about Xiaoming since their childhood from textbooks, together with Xiaohong, Xiaogang, Xiaoqiang…(lol) He received his Ph.D. degree from Institute of Physics, Chinese Academy of Sciences, Beijing. He worked at RLQM as a postdoctoral researcher from 2015 to 2018.\n\nXiaoming is currently a Professor at Hebei University of Technology.\n\nResearch Focus: topological materials; battery electrode materials; other novel materials\n\nHobbies: football (crazy); reading; traveling\n\n“Just do it!”\n\n\n\nXian-Lei Sheng, Former Research Fellow\n\nDr. Sheng Xianlei is from Puyang city, Henan province, China. He received his B.S. degree from Xidian University in 2006. From 2006 to 2011, he was studying in the University of Chinese Academy of Sciences, and obtained his Ph.D. in condensed matter physics. Then, he worked as a postdoctoral researcher and visiting scholar in several institutions including California State University Northridge, Institute of Physics Chinese Academy of Sciences, and University of Delaware. In 2015, he joined Beihang University as a Lecturer. He conducted research at RLQM from Sep. 2016 to Sep. 2019.\n\nXian-Lei is currently a Professor at Beihang University.\n\nResearch Focus: [1] Topological materials study from first-principles calculation; [2] Novel electronic device design from Non-equilibrium Green’s Function + density functional theory (DFT) method; [3] First-principles calculations on strongly correlated electron systems using DFT+U, DFT+Gutzwiller and DFT+dynamical mean field theory methods.\n\nWebpage: https://sites.google.com/site/shengxianlei06/home\n\n“Do something, think everything!”\n\n\n\nShengyuan Yang, Principal Investigator\n\nProf. Yang is from Nanjing, China. He studied Electrical Engineering at Tsinghua University for one year. Then he transferred to The University of Hong Kong in 2002 and obtained a B.Sc. degree in Mathematics/Physics in 2005. He joined the condensed matter theory group at The University of Texas at Austin and received the Ph.D. in Physics degree in 2011. He worked as an imaging geophysicist in CGG (US) Services at Houston from 2011 to 2013. He joined SUTD in the summer of 2013.\n\nResearch Focus: condensed matter theory; topological effects; electronic and transport properties of materials; topological materials; 2D materials\n\nEmail: shengyuan_yang@sutd.edu.sg\n\nWebpage: https://smt.sutd.edu.sg/people/faculty/yangshengyuan\n\n“It is not enough for one to have only this life and this world; he ought to have another poetic world as well.” —Wang Xiaobo"}]}