{"K. S. Manilal obtained degree from the University of Kerala in 1947.": [{"url": "https://researchmatters.in/news/prof-k-s-manilal-among-padma-awardees-2020-under-science-and-engineering", "page_content": "Bengaluru\n\n26 Jan 2020\n\nAmong the illustrious list of Padma awardees for 2020 declared on the eve of Republic Day, the Government of India has announced Padma Shri to Prof Kattungal Subramaniam Manilal under Science and Engineering discipline. He is among the eight of 118 Padma Shri awardees under this discipline.\n\nPadma Awards are one of the highest civilian Awards in India. The Awards are given in various disciplines spanning the fields of art, social work, public affairs, science and engineering, trade and industry, medicine, literature and education, sports and civil service. ‘Padma Vibhushan’ is awarded for exceptional and distinguished service; ‘Padma Bhushan’ for distinguished service of a high order and ‘Padma Shri’ for distinguished service in any field. Among the 7 Padma Vibhushan, 16 Padma Bhushan and 118 Padma Shri Awards that the President of Indian approved this year, only 33 have been awarded to women.\n\nProf K. S. Manilal is a botanist and taxonomist, best known for his research, translation, and annotation of Hendrik van Rheede’s 17th century Latin botanical treatise, Hortus Malabaricus. The document extensively details the biodiversity and medicinal properties of over 700 indigenous plants in the Malabar region of Kerala.\n\nBefore Manilal’s translation of this enormous 12 volume document into English and Malayalam, most of the information in this Latin treatise had largely remained inaccessible to the world. Manilal also authored 198 published research papers and 15 books on taxonomy and botany, of which a significant proportion was devoted to discussing the medico-botanical aspects, or the historical, socio-political and linguistic significance of Hortus Malabaricus.\n\nAlong with his students, Manilal has discovered around 14 species of flowering plants and recorded the existence of nearly 1,000 flowering plant species, including some like the Malabar Daffodil, which was previously thought to be extinct. Currently, he is an Emeritus Professor of botany at Calicut University, Kerala. He is also credited for establishing the Indian Association for Angiosperm Taxonomy.\n\nEarlier, Prof K S Manilal was featured under Ek Pradarshini - The Best of Indian Science exhibits during the Nobel Prize Series - India 2018 held at Goa. The National Centre for Biological Sciences (NCBS) at Bengaluru had also held an exhibition of Hortus Malabaricus in 2008."}, {"url": "https://peoplepill.com/people/k-s-manilal/", "page_content": "Professor Kattungal Subramaniam Manilal (Malayalam: കാട്ടുങ്ങൽ സുബ്രഹ്മണ്യം മണിലാൽ) (born 17 September 1938) is an Emeritus of the University of Calicut, a botany scholar and taxonomist, who devoted over 35 years of his life to research, translation and annotation work of the Latin botanical treatise Hortus Malabaricus. This epic effort brought to light the main contents of the book, a wealth of botanical information on Malabar that had largely remained inaccessible to English-speaking scholars, because the entire text was in the Latin language..\n\nDespite the existence of Hendrik van Rheede's Hortus Malabaricus over the last three centuries, the correct taxonomic identity of many plants listed in Hortus Malabaricus, their medicinal properties, methods of use, etc., as described and codified by renowned traditional medical authorities of 17th century India remained inaccessible to English language based scholars, until Manilal commenced publication of research papers and books on Hortus Malabaricus.\n\nManilal efforts ultimately resulted in an English edition of Hortus Malabaricus, for the first time, 325 years after its original publication from Amsterdam. The English edition contains a word by word translation of all the twelve volumes of the book, retaining the original style of language. Medicinal properties of plants are translated and interpreted, with commentaries on their Malayalam names given by Van Rheede. In addition, the correct scientific identity of all plants, acceptable under ICBN are set out along with their important synonyms and basionyms.\n\nWhilst the scope of Manilal's contributions to botany extend far beyond the research and publications around Hortus Malabaricus, his research work on Hortus Malabaricus alone are of botanical and socio-historic significance, and can be broadly classified under two heads:\n\nBotanical and Medicinal aspects of Hortus Malabaricus; and\n\nHistorical, Political, Social and Linguistic aspects of Hortus Malabaricus.\n\nManilal has over 198 published research papers and 15 books to his credit as author and co-author. He and his associates have credits to discovering over 14 species of flowering plants, varieties and combinations new to science. Manilal is the Founder President of the Indian Association for Angiosperm Taxonomy (IAAT).\n\nBirth, early life and interest in Hortus Malabaricus\n\nManilal was born in Cochin on 17 September 1938. He is one of three children born to his parents; father Advocate Kattungal A. Subramaniam (b:1914~d:1973) and mother K. K. Devaki (b:1919~d:1989). Manilal's father, K. A. Subramaniam, was besides being a practising advocate, also a writer, who authored the biography of Sahodaran Ayyapan. Manial's Kattungal family members are natives of North Paravur in Kerala, India.\n\nAs a young boy, Manilal's interest in Hortus Malabaricus was inspired by his father, whose avid reading habits and enthusiasm for sociology exposed Manilal to a collection of books, and more specifically newspaper cuttings on Hortus Malabaricus during the late 1940s and 1950s.\n\nManilal schooled initially at the Government Boys’ High School, Kodungallur and later at the Government S.R.V. Boys’ High School, Ernakulam. He enrolled for undergraduate studies in Botany at the Maharaja's College, Ernakulam, following which, he secured MSc Botany and PhD Degrees from University Teaching Department, Sagar, in Madhya Pradesh.\n\nDuring his post-graduate studies, while on a study tour to the Forest Research Institute in Dehra Dun, Manilal was able to see, for the first time, a set of volumes of the original Hortus Malabaricus. This was set of volumes acquired by the Institute's library during the days of the British Raj, when the Institute was called the Imperial Forest College. Manilal remarks “it fired my imagination!” on seeing a Latin book in which the names of plants were also written in native Malayalam language. Manilal maintained his interest in the book through his studies and professional life until 1969, when he commenced serious work on the transliteration of Hortus Malabaricus.\n\nMajor research and academic achievements\n\nBotanical and medicinal aspects of Hortus Malabaricus\n\nFrontispiece of the original Latin Hortus Malabaricus Frontispiece of the original Latin Hortus Malabaricus\n\nAs Hortus Malabaricus is a pre-Linnaean book, the scientific names of plants, equivalent to local Malayalam names, were not included. Since voucher specimens for the book are also not known to exist, the correct identity of many of the plants described was unclear and not verifiable to original specimens. Earlier attempts, over three centuries, by European and Indian botanists to correctly identify all specimens were futile. Under two research projects; one sponsored by the U.G.C. (1975–1978) and the other by the Smithsonian Institution (1984–1987), Manilal collected all plants, described in Hortus Malabaricus, from localities in Malabar from where they were originally collected in the 17th century. Specimens were subjected to detailed studies and their correct identities were established in consultation with research institutes in Europe and USA. Based on this work, initially a concise reference book: An Interpretation of Van Rheede's Hortus Malabaricus, was published (with his collaborators) from Berlin (1988), by the IAPT. This remains the only book by Indian authors published by them (IAPT) till date and is an essential resource in study on the taxonomy of Southeast Asian plants.\n\nHistorical, political, social and linguistic aspects of Hortus Malabaricus\n\nThe compilation and publication of Hortus Malabaricus is intimately connected with the history of India, politics of the 17th century Netherlands and the then social conditions of Malabar. It is also an important source of information, and the oldest printed, authentic document, on the evolution of Malayalam language and script. Manilal studied these aspects for over 35 years bringing to light many interesting facts, some of which were included in his book: Botany & History of Hortus Malabaricus, published from Rotterdam and Delhi (1980). Another book, in Malayalam: A study on the role of Itty Achudan in the compilation of Hortus Malabaricus, was published from Kozhikode in 1996.\n\nVan Rheede's motivation to compile a book on the natural plant wealth of Malabar was to prove his belief that Malabar is self-sufficient in all requirements of military and commerce and hence that Cochin was better suited to be the south east Asian Headquarters of the Dutch overseas forces, compared to Colombo in Ceylon.\n\nInformation is also available in the text of Hortus Malabaricus not only about the vegetation in 17th century Malabar, but also about the general social conditions prevalent in those days. Significant inferences could also be drawn on some of these matters, indirectly from the data available in the book. Several research papers have been published by Manilal on these topics. Some more, particularly on the different Numerals and Numerical Systems used in Hortus and their sociological implications and significances in the Indian society, are under preparation.\n\nTaxonomic and biodiversity studies in Kerala\n\nManilal pioneered taxonomic research and biodiversity studies in Kerala by training a genre of young taxonomists and identifying and cataloguing local plants in biodiversity-rich South India. A comprehensive study on the flora of the Greater Kozhikode area, consisting of the western sectors of the present day Kozhikode and Malappuram districts, covering an area of about 600 km2. was started in 1969. When completed in 1975, this work resulted in recording about one thousand species of flowering plants from the region, including several species recorded for the first time in India and importantly seven species new to science. Based on this work, a book: Flora of Calicut, was published (from Dehra Dun), and was taken as a model for subsequent research in India.\n\nResearch and revelations at Silent Valley\n\nIn the 1970s, when a proposal to build a hydro-electric project in Silent Valley triggered political controversy in Kerala due to an impending ecological disaster, the Government of Kerala appointed an experts’ committee of scientists to study, inventorise and report on Silent Valley's flora and fauna. The experts’ committee reported that the forests there could not be classified as tropical evergreen rainforests and that they contain only 240 species of flowering plants, which are also found elsewhere, and also that the Valley does not possess any new or rare species. Despite protests by environmentalists the State Government was about to go ahead with the project, only awaiting a clearance form the Central Government. At this juncture, the Department of Science and Technology (India) accepted Manilal's proposal to study the flora of Silent Valley and also required him to make a general study of the ecological status of the forests.\n\nOver a four-year period commencing 1981, Manilal and research assistants undertook a study that brought to light:\n\nA record of nearly 1,000 species of flowering plants;\n\nSeven species new to science;\n\nSeveral plants believed to be found only in Sri Lanka, Philippines, etc.;\n\nSome species which were believed to be extinct, such as the Malabar Daffodil , which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris;\n\n, which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris; Rare medicinal plants until then known to grow only in the islands of Philippines;\n\nMany endemics of the neighbouring countries, where their existence was threatened, were found to have migrated to these forests for safety.\n\nFurther Manilal's study found that the Silent Valley forests fulfilled required parameters of tropical evergreen rainforests and, therefore, could be rightly so classified. His work was soon considered as model of how taxonomists could assist in solving socio-environmental issues; and many scientists and journalists from Europe, Africa and South America visited Silent Valley to study the working of this project.\n\nOrchids of Kerala\n\nDetailed studies of the orchid wealth of Kerala were started by Manilal in the late 1970s, including their taxonomy, anatomy, biology and floral evolution, which are essential for any further studies on their hybridisation. During these studies, contrary to the highest expectations, over 215 species of orchids were collected, including species that were till then believed to be extinct, like the ladies' slipper orchid Paphiopedilum druryii.\n\nOrigin and evolution of the flower\n\nManilal has led studies on the directions of evolution of flowers and the structure and anatomy of various floral organs in cash crops such as coconut palms, grasses (rice), orchids, compositae (sun flower), rubiales (coffee), etc. Many enigmas in these subjects could be solved, and results were published in around 45 research papers. These studies have, besides seeing the flower as the most significant part of the plant, with biological, commercial, aesthetic, evolutionary and taxonomic importance, also promoted success in hybridisation and breeding experiments, to create new high-yielding varieties.\n\nRadioactive resistant marine phyto-planktonic algae\n\nAs the beaches in southern Kerala and Tamil Nadu (particularly in the Districts of Kollam and Nagarcoil) have natural deposits of radioactive minerals causing genetic damage to flora and fauna, Manilal undertook studies to familiarise with the techniques of research in the field of radiation ecology. These studies were undertaken at the Marine Biology Laboratory of North Wales University at Menai Bridge, Wales. The Royal Society of London granted Manilal a Visiting Scientist-ship for this work for two years in 1971–1972.\n\nTwo species of marine phyto-planktonic algae were discovered, which could withstand a very high degree of radioactivity. It was found that these species could absorb and adsorb as much as 40 times their body weight of the radioactive Thorium compounds from surrounding seawater, and continue to live normally. In the 1970s these findings were farfetched to be accepted for publication in a journal in U.K. However, on Manilal's return to India, a part of these findings was published in the journal Current Science (1975), by the Indian Institute of Science. About ten years later, some British scientists did a similar work and their results were published in the prestigious U.K. journal Nature, and wide publicity in the press as a biotechnological break-through. Manilal's experiments (and the subsequent work by the British scientists) show that such marine planktonic algae could be used to quickly and safely clean up ocean surfaces where radio-active materials have accumulated, by cultivating such algae in a specific area and later removing them from there.\n\nIndian Association for Angiosperm Taxonomy (IAAT)\n\nManilal was instrumental in establishing the Indian Association for Angiosperm Taxonomy (IAAT). Manilal, as founder President, established IAAT in the year 1990 with its Headquarters located at the Department of Botany, University of Calicut, Kozhikode, India. The IAAT works to promote the science of Angiosperm Taxonomy in India, to provide a common forum for Angiosperm taxonomists in India to organise meetings, hold discussions and exchange ideas on scientific and academic matters, and encourage collaborative work among taxonomists. The IAAT publishes a journal Rheedea (named after Hendrik van Rheede). The Indian Association for Angiosperm Taxonomy works as an affiliate of the International Association for Plant Taxonomy.\n\nFrom 1969 Manilal commenced training research students in Taxonomy (leading to PhD degree in the subject), with a view to attain self-sufficiency in Taxonomy. During the years 1972–1998, he and his students discovered over 240 new species of flowering plants and several new records for India from Kerala, and published many research papers in Taxonomy in national and international journals.\n\nBiomass Research Centre\n\nA Biomass Research Centre was established by Manilal in the University of Calicut, with funding from the Ministry of Non-conventional Energy Sources. The Centre does research and field experiments to establish the (taxonomic) identification of fast-growing fuel-wood trees suitable for various agro-climatic zones of Kerala.\n\nSummary of Manilal's discoveries\n\nNew species and varieties discovered, and combinations established by Manilal and his research associates are summarised are follows:\n\nNew species discovered in Silent Valley\n\nLiparis indiraii Manilal & S.Kumar\n\nEria tiagii Manilal & S.Kumar\n\nHydnocarpus pendulus Manilal, Sabu & Sivar.\n\nRobiquetia josephiana Manilal & S.Kumar\n\nSauropus saksenianus Manilal, Sabu & Sivar.\n\nCucumella silentvaleyii Manilal, Sabu & Mathew\n\nOberonia bisaccata Manilal & S.Kumar\n\nNew species discovered under biodiversity studies\n\nHedyotis erecta Manilal & Sivar.\n\nCinnamomum nicolsonianum Manilal & Shylaja\n\nBulbophyllum rheedei Manilal & S.Kumar\n\nHeliotropium keralense Sivar. & Manilal\n\nBorreria malabarica Sivar. & Manilal\n\nPhyllanthus kozhikodianus Sivar. & Manilal\n\nHabenaria indica S.Kumar & Manilal\n\nNew varieties of flowering plants discovered\n\nBorreria stricta (L. f.) K.Schum. var. rosea ; Sivar. & Manilal\n\nvar. ; Borreria articularis (L. f.) F.N.Williams var. hispida Sivar. & Manilal\n\nvar. Portulaca oleracea L. var. linearifolia Sivar. & Manilal\n\nNew combinations established\n\nThunbergia bicolour (Wight) Manilal & Suresh\n\nEria chandrasekharanii (Bharg. & Moh.) S.Kumar & Manilal\n\nLater declassified per ICBN provisions, as names of species may change with more information gathered.\n\nNotable awards and positions held\n\nAwards\n\nOfficer of the Order of Orange-Nassau award (Dutch: Orde van Oranje-Nassau) by Her Majesty Queen Beatrix of the Netherlands. (The Consul General of the Kingdom of the Netherlands, Ms. Marijke A. van Drunen Littel conferred this honour on 1 May 2012, at Kozhikode, Kerala, India.)\n\nE.K. Janaki Ammal National Award for Taxonomy (2003) – Constituted by The Ministry of Environment and Forests\n\nY. D. Tyagi Gold Medal (1998) – by the Indian Association of Angiosperm Taxonomy (IAAT)\n\nVishwambhar Puri Medal (1990) – by The Indian Botanical Society\n\nPositions\n\nChief Editor, Rheedea, The Journal of Indian Association of Angiosperm Taxonomy (1991–present)\n\nPresident, Botanical Society of India (1999)\n\nTreasurer, Botanical Society of India (1984–1986)\n\nFounding President, Indian Association of Angiosperm Taxonomy (1991)\n\nChairman, CRIKSC (Centre for Research in Indigenous Knowledge, Science & Culture)\n\non YouTube\n\nPublication of the English and Malayalam versions of Hortus Malabaricus\n\nPublisher's appeal for donation of royalties\n\nHortus Malabaricus as transliterated by Manilal was published in English and Malayalam languages in 2003 and 2008 respectively. Manilal's copyright, as author of the English and Malayalam versions, was bequeathed, free of royalties, to the publishers, the University of Kerala. This assignment of rights was a gesture by Manilal in good faith and in response to a specific appeal from the then Vice-Chancellor of the University of Kerala, that the University wanted to generate funds from this publication for utilisation of such royalty incomes toward re-publication of old Malayalam classical works, which are out of print, and not forecasted to generate a viable level of income due to limited sale of such classical works.\n\nBook-release functions conducted by the publishers\n\nIn a recorded interview with Manilal in August 2008, he expressed his regret and frustration at the manner in which the publishers subjected him to digression from the publication project soon after he legally assigned his rights as author. Apparently there was a move to exclude Manilal's name from the book (2003), but was reinstated on account of questions raised by the academic community. On 14 August 2008, the University of Kerala officials again conducted a function at Thiruvananthapuram to formally release the Malayalam edition of Hortus Malabaricus. The book was released by the Governor of Kerala (also Chancellor of the University), at the function; where due recognition was not given to Manilal as author of the book, nor were arrangements in place to felicitate the author at the function. [1]. The former Vice-Chancellor of University of Kerala who initiated the project, B. Ekbal, was also not invited to this function.\n\nBooks authored by K. S. Manilal\n\n2012. MANILAL, K.S. Hortus Malabaricus and the Socio-Cultural Heritage of India . Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode.\n\n. Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode. 2008. MANILAL, K.S. Van Rheede's Hortus Malabaricus. Malayalam Edition , with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5)\n\n, with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5) 2004. MANILAL, K.S. & C. SATHISH KUMAR Orchid Memories: A tribute to Gunnar Seidenfaden . Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1)\n\n. Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1) 2003. MANILAL, K.S. Van Rheede’s Hortus Malabaricus. English Edition , with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4)\n\n, with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4) 1998. MANILAL, K.S. & M.S. MUKTESH KUMAR A Handbook on Taxonomy Training . DST, New Delhi.\n\n. DST, New Delhi. 1998. MANILAL, K.S. & K. RAVEENDRAKUMAR Companion to Gamble’s Flora: Additions to the Flora of Kerala since Gamble (1935) . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1996. MANILAL, K.S. Hortus Malabaricus and Itty Achuden: A study on the role of Itty Achuden in the compilation of Hortus Malabaricus (In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0).\n\n(In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0). 1996. MANILAL, K.S. Directory of Indian Taxonomists . Mentor books, Kozhikode.\n\n. Mentor books, Kozhikode. 1996. MANILAL, K.S. & A.K. PANDEY Taxonomy and Plant Conservation . C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4)\n\n. C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4) 1994. SATHISH KUMAR, C. & K.S. MANILAL A Catalogue of Indian Orchids . Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X).\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X). 1993. MANILAL, K.S. & C. SATHISH KUMAR Field Key for the Identification of the Native Orchids of Kerala . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1988. NICOLSON, D.H.,C.R. SURESH & K.S. MANILAL An Interpretation of Van Rheede’s Hortus Malabaricus . International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile)\n\n. International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile) 1988. MANILAL, K.S. Flora of Silent Valley Tropical Rain Forests of India . Department of Science & Technology, Government of India, Kozhikode.\n\n. Department of Science & Technology, Government of India, Kozhikode. 1982. MANILAL, K.S. & V.V. SIVARAJAN The Flora of Calicut: The Flowering Plants of the Greater Calicut Area . Bishen Singh Mahendrapal Singh, Dehra Dun.\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. 1980. MANILAL, K.S. The Botany & History of Hortus Malabaricus . A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4).\n\n. A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4). 1976. MANILAL, K.S. & V.V.SIVARAJAN Flowering Plants of the Calicut University Campus. University of Calicut, Kerala. India.\n\nThe standard author abbreviation is used to indicate this individual as the author when citing a botanical name."}, {"url": "https://www.newindianexpress.com/states/kerala/2020/jan/26/natl-laurel-for-malayalis-2094680.html", "page_content": "By Express News Service\n\nSri M: Social reformer, educationist and spiritual guide\n\nT'Puram: Born into a Muslim family as Mumtaz Ali Khan in Thiruvananthapuram in 1949, Sri M is a social reformer, educationist and spiritual guide. His discourses are not just confined to yoga and Upanishads, but also borrow extensively from the religious traditions of Buddhists, Christians, Jews and Sufis, in an attempt to bring people of all faiths together. Sri M’s most noted feat was a 15-month walk stretching 7,500km from Kanyakumari to Kashmir, spreading the message of peace. He has also undertaken various initiatives, including the Satsang Foundation and Manav Ekta Mission. In 2011, he wrote his memoir 'Apprenticed to a Himalayan Master – A Yogi’s Autobiography'.\n\nMadhava Menon: Contribution to legal education\n\nT’Puram: N R Madhava Menon, who was conferred Padma Bhushan posthumously, is considered to be the father of modern legal education in India. He died last year, aged 84, after losing a battle with liver cancer. He founded the National Law School of India University (NLSIU) in Bengaluru in 1986 and was the brain behind the five-year integrated LLB programme. Menon served the NLSIU as its founding vice-chancellor for 12 years. Dr Menon then founded the National University of Juridical Sciences in Kolkata where he served as founder vice-chancellor from 1998 to 2003. In 2003, he received the Padma Shri for his outstanding contribution to legal education. He retired in 2006 as the founder-director of the National Judicial Academy.\n\nSathyanarayanan: A social movement through libraries\n\nT’Puram: Sathyanarayanan Mundayoor, aka Uncle Moosa, has roots in Thrissur district but has spent most of his life with the tribal people of Arunachal Pradesh. He has been instrumental in creating a lasting library culture in Arunachal Pradesh. The 65-year-old has also made an indelible impact on the education and empowerment of tribal children in remote areas of the border state through his Lohit Youth Library Network. Uncle Moosa is the name Sathyanarayanan took when he began writing a column for children in a local newspaper. Sathya-narayanan came to Arunachal in 1979 when he was 25 years old to work in one of the schools run by the Vivekananda Kendra. In 1998, he decided to use libraries as a social movement.\n\nPankajakshi: A deserving recognition for ‘nokkuvidya’\n\nKottayam: Finally, the hands which handled the strings and wooden poles that enlivened several mythical characters on stage, got due recognition. When the Padma Shri comes to 'Moozhikkal' at Monippally here, it is obviously a deserving recognition for Pankajakshi, who dedicated her life to prop up a dying and delicate ancestral art form, 'nokkuvidya pavakali'. Pankajakshi, who was barely 12 when she was initiated into the art form, can now heave a sigh of relief. Though, Pankajakshi is unable to perform the art at present following a massive stroke around six years ago, she was visibly delighted when the news was conveyed to her. Her granddaughter K S Renjini, is now the sole practitioner of art form.\n\nChandrasekharan Nair: Championing the cause of Hindi\n\nT'Puram : As someone who relentlessly campaigned to have Hindi declared as the country's official language, N Chandrasekharan Nair is known for establishing the Kerala Hindi Sahitya Academy in Thiruvananthapuram in 1982 for promoting Hindi literature in Kerala. Born at Sasthamkotta in Kollam in 1924, Nair has made a name for himself as poet, novelist, dramatist, storyteller, research scholar, and painter. His autobiography was released in 2008. Recognising his lifetime contribution to the propagation of Hindi across the world, Nair was bestowed with the Vishva Hindi Samman by the Ministry of External Affairs. He has authored more than 60 books in Hindi, of which more than a dozen have been prescribed by various Indian universities.\n\nKunjol: A national honour for social crusader\n\nKochi: For M K Kunjol, 84, spreading the values of Hindu dharma and spirituality among the downtrodden through social work has been his life's mission. Born into a backward family as the child of Kurumban and Vallothi at Kottappadi near Perumbavur on May 8, 1937, Kunjol had his early education at St Rita LP School and Ashramam High School in Perumbavur. The turning point in Kunjol's life came when he met Agamananda Swami at Kaladi Ashramam. Kunjol undertook many assignments to spread the message of love and caring. He also spearh-eaded various Renaissance movements in association with many Hindu organis-ations. He has won Ambedkar Award for his works aimed at social reformation of the backward communities.\n\nManilal: A name synonymous with Hortus Malabaricus\n\nKozhikode: Academic and researcher K S Manilal, whose name figures in the list of Padma awardees, is synonymous with 'Hortus Malabaricus' which is regarded as the bible of flaura of the Western Ghats. Manilal devoted 35 years of his life on conducting research and translating the 12\n\nvolumes of Hortus Malabaricus. A former University of Calicut Emeritus, botany scholar and taxonomist, Manilal's efforts helped bring out the world's first English edition of Hortus Malabaricus, 325 years after its publication. Later, he also published its Malayalam version. For his commendable efforts, he was accorded the highest civilian award by The Netherlands, from where Hendrik Van Rheede, the original author of Hortus Malabaricus hails.\n\nSri M: Social reformer, educationist and spiritual guide T'Puram: Born into a Muslim family as Mumtaz Ali Khan in Thiruvananthapuram in 1949, Sri M is a social reformer, educationist and spiritual guide. His discourses are not just confined to yoga and Upanishads, but also borrow extensively from the religious traditions of Buddhists, Christians, Jews and Sufis, in an attempt to bring people of all faiths together. Sri M’s most noted feat was a 15-month walk stretching 7,500km from Kanyakumari to Kashmir, spreading the message of peace. He has also undertaken various initiatives, including the Satsang Foundation and Manav Ekta Mission. In 2011, he wrote his memoir 'Apprenticed to a Himalayan Master – A Yogi’s Autobiography'. Madhava Menon: Contribution to legal educationgoogletag.cmd.push(function() {googletag.display('div-gpt-ad-8052921-2'); }); T’Puram: N R Madhava Menon, who was conferred Padma Bhushan posthumously, is considered to be the father of modern legal education in India. He died last year, aged 84, after losing a battle with liver cancer. He founded the National Law School of India University (NLSIU) in Bengaluru in 1986 and was the brain behind the five-year integrated LLB programme. Menon served the NLSIU as its founding vice-chancellor for 12 years. Dr Menon then founded the National University of Juridical Sciences in Kolkata where he served as founder vice-chancellor from 1998 to 2003. In 2003, he received the Padma Shri for his outstanding contribution to legal education. He retired in 2006 as the founder-director of the National Judicial Academy. Sathyanarayanan: A social movement through libraries T’Puram: Sathyanarayanan Mundayoor, aka Uncle Moosa, has roots in Thrissur district but has spent most of his life with the tribal people of Arunachal Pradesh. He has been instrumental in creating a lasting library culture in Arunachal Pradesh. The 65-year-old has also made an indelible impact on the education and empowerment of tribal children in remote areas of the border state through his Lohit Youth Library Network. Uncle Moosa is the name Sathyanarayanan took when he began writing a column for children in a local newspaper. Sathya-narayanan came to Arunachal in 1979 when he was 25 years old to work in one of the schools run by the Vivekananda Kendra. In 1998, he decided to use libraries as a social movement. Pankajakshi: A deserving recognition for ‘nokkuvidya’ Kottayam: Finally, the hands which handled the strings and wooden poles that enlivened several mythical characters on stage, got due recognition. When the Padma Shri comes to 'Moozhikkal' at Monippally here, it is obviously a deserving recognition for Pankajakshi, who dedicated her life to prop up a dying and delicate ancestral art form, 'nokkuvidya pavakali'. Pankajakshi, who was barely 12 when she was initiated into the art form, can now heave a sigh of relief. Though, Pankajakshi is unable to perform the art at present following a massive stroke around six years ago, she was visibly delighted when the news was conveyed to her. Her granddaughter K S Renjini, is now the sole practitioner of art form. Chandrasekharan Nair: Championing the cause of Hindi T'Puram : As someone who relentlessly campaigned to have Hindi declared as the country's official language, N Chandrasekharan Nair is known for establishing the Kerala Hindi Sahitya Academy in Thiruvananthapuram in 1982 for promoting Hindi literature in Kerala. Born at Sasthamkotta in Kollam in 1924, Nair has made a name for himself as poet, novelist, dramatist, storyteller, research scholar, and painter. His autobiography was released in 2008. Recognising his lifetime contribution to the propagation of Hindi across the world, Nair was bestowed with the Vishva Hindi Samman by the Ministry of External Affairs. He has authored more than 60 books in Hindi, of which more than a dozen have been prescribed by various Indian universities. Kunjol: A national honour for social crusader Kochi: For M K Kunjol, 84, spreading the values of Hindu dharma and spirituality among the downtrodden through social work has been his life's mission. Born into a backward family as the child of Kurumban and Vallothi at Kottappadi near Perumbavur on May 8, 1937, Kunjol had his early education at St Rita LP School and Ashramam High School in Perumbavur. The turning point in Kunjol's life came when he met Agamananda Swami at Kaladi Ashramam. Kunjol undertook many assignments to spread the message of love and caring. He also spearh-eaded various Renaissance movements in association with many Hindu organis-ations. He has won Ambedkar Award for his works aimed at social reformation of the backward communities. Manilal: A name synonymous with Hortus Malabaricus Kozhikode: Academic and researcher K S Manilal, whose name figures in the list of Padma awardees, is synonymous with 'Hortus Malabaricus' which is regarded as the bible of flaura of the Western Ghats. Manilal devoted 35 years of his life on conducting research and translating the 12 volumes of Hortus Malabaricus. A former University of Calicut Emeritus, botany scholar and taxonomist, Manilal's efforts helped bring out the world's first English edition of Hortus Malabaricus, 325 years after its publication. Later, he also published its Malayalam version. For his commendable efforts, he was accorded the highest civilian award by The Netherlands, from where Hendrik Van Rheede, the original author of Hortus Malabaricus hails."}, {"url": "https://alchetron.com/K-S-Manilal", "page_content": "Professor Kattungal Subramaniam Manilal (Malayalam: കാട്ടുങ്ങൽ സുബ്രഹ്മണ്യം മണിലാൽ) (born 17 September 1938) is an Emeritus of the University of Calicut, a botany scholar and taxonomist, who devoted over 35 years of his life to research, translation and annotation work of the Latin botanical treatise Hortus Malabaricus. This epic effort brought to light the main contents of the book, a wealth of botanical information on Malabar that had largely remained inaccessible to English-speaking scholars, because the entire text was in the Latin language..\n\nDespite the existence of Hendrik van Rheede's Hortus Malabaricus over the last three centuries, the correct taxonomic identity of many plants listed in Hortus Malabaricus, their medicinal properties, methods of use, etc., as described and codified by renowned traditional medical authorities of 17th century India remained inaccessible to English language based scholars, until Manilal commenced publication of research papers and books on Hortus Malabaricus.\n\nManilal efforts ultimately resulted in an English edition of Hortus Malabaricus, for the first time, 325 years after its original publication from Amsterdam. The English edition contains a word by word translation of all the twelve volumes of the book, retaining the original style of language. Medicinal properties of plants are translated and interpreted, with commentaries on their Malayalam names given by Van Rheede. In addition, the correct scientific identity of all plants, acceptable under ICBN are set out along with their important synonyms and basionyms.\n\nWhilst the scope of Manilal's contributions to botany extend far beyond the research and publications around Hortus Malabaricus, his research work on Hortus Malabaricus alone are of botanical and socio-historic significance, and can be broadly classified under two heads:\n\nManilal has over 198 published research papers and 15 books to his credit as author and co-author. He and his associates have credits to discovering over 14 species of flowering plants, varieties and combinations new to science. Manilal is the Founder President of the Indian Association for Angiosperm Taxonomy (IAAT).\n\nBirth, early life and interest in Hortus Malabaricus\n\nManilal was born in Cochin on 17 September 1938. He is one of three children born to his parents; father Advocate Kattungal A. Subramaniam (b:1914~d:1973) and mother K. K. Devaki (b:1919~d:1989). Manilal's father, K. A. Subramaniam, was besides being a practising advocate, also a writer, who authored the biography of Sahodaran Ayyapan. Manial's Kattungal family members are natives of North Paravur in Kerala, India.\n\nAs a young boy, Manilal's interest in Hortus Malabaricus was inspired by his father, whose avid reading habits and enthusiasm for sociology exposed Manilal to a collection of books, and more specifically newspaper cuttings on Hortus Malabaricus during the late 1940s and 1950s.\n\nManilal schooled initially at the Government Boys’ High School, Kodungallur and later at the Government S.R.V. Boys’ High School, Ernakulam. He enrolled for undergraduate studies in Botany at the Maharaja's College, Ernakulam, following which, he secured MSc Botany and PhD Degrees from University Teaching Department, Sagar, in Madhya Pradesh.\n\nDuring his post-graduate studies, while on a study tour to the Forest Research Institute in Dehra Dun, Manilal was able to see, for the first time, a set of volumes of the original Hortus Malabaricus. This was set of volumes acquired by the Institute's library during the days of the British Raj, when the Institute was called the Imperial Forest College. Manilal remarks “it fired my imagination!” on seeing a Latin book in which the names of plants were also written in native Malayalam language. Manilal maintained his interest in the book through his studies and professional life until 1969, when he commenced serious work on the transliteration of Hortus Malabaricus.\n\nBotanical and medicinal aspects of Hortus Malabaricus\n\nAs Hortus Malabaricus is a pre-Linnaean book, the scientific names of plants, equivalent to local Malayalam names, were not included. Since voucher specimens for the book are also not known to exist, the correct identity of many of the plants described was unclear and not verifiable to original specimens. Earlier attempts, over three centuries, by European and Indian botanists to correctly identify all specimens were futile. Under two research projects; one sponsored by the U.G.C. (1975–1978) and the other by the Smithsonian Institution (1984–1987), Manilal collected all plants, described in Hortus Malabaricus, from localities in Malabar from where they were originally collected in the 17th century. Specimens were subjected to detailed studies and their correct identities were established in consultation with research institutes in Europe and USA. Based on this work, initially a concise reference book: An Interpretation of Van Rheede's Hortus Malabaricus, was published (with his collaborators) from Berlin (1988), by the IAPT. This remains the only book by Indian authors published by them (IAPT) till date and is an essential resource in study on the taxonomy of Southeast Asian plants.\n\nHistorical, political, social and linguistic aspects of Hortus Malabaricus\n\nThe compilation and publication of Hortus Malabaricus is intimately connected with the history of India, politics of the 17th century Netherlands and the then social conditions of Malabar. It is also an important source of information, and the oldest printed, authentic document, on the evolution of Malayalam language and script. Manilal studied these aspects for over 35 years bringing to light many interesting facts, some of which were included in his book: Botany & History of Hortus Malabaricus, published from Rotterdam and Delhi (1980). Another book, in Malayalam: A study on the role of Itty Achudan in the compilation of Hortus Malabaricus, was published from Kozhikode in 1996.\n\nVan Rheede's motivation to compile a book on the natural plant wealth of Malabar was to prove his belief that Malabar is self-sufficient in all requirements of military and commerce and hence that Cochin was better suited to be the south east Asian Headquarters of the Dutch overseas forces, compared to Colombo in Ceylon.\n\nInformation is also available in the text of Hortus Malabaricus not only about the vegetation in 17th century Malabar, but also about the general social conditions prevalent in those days. Significant inferences could also be drawn on some of these matters, indirectly from the data available in the book. Several research papers have been published by Manilal on these topics. Some more, particularly on the different Numerals and Numerical Systems used in Hortus and their sociological implications and significances in the Indian society, are under preparation.\n\nTaxonomic and biodiversity studies in Kerala\n\nManilal pioneered taxonomic research and biodiversity studies in Kerala by training a genre of young taxonomists and identifying and cataloguing local plants in biodiversity-rich South India. A comprehensive study on the flora of the Greater Kozhikode area, consisting of the western sectors of the present day Kozhikode and Malappuram districts, covering an area of about 600 km2. was started in 1969. When completed in 1975, this work resulted in recording about one thousand species of flowering plants from the region, including several species recorded for the first time in India and importantly seven species new to science. Based on this work, a book: Flora of Calicut, was published (from Dehra Dun), and was taken as a model for subsequent research in India.\n\nResearch and revelations at Silent Valley\n\nIn the 1970s, when a proposal to build a hydro-electric project in Silent Valley triggered political controversy in Kerala due to an impending ecological disaster, the Government of Kerala appointed an experts’ committee of scientists to study, inventorise and report on Silent Valley's flora and fauna. The experts’ committee reported that the forests there could not be classified as tropical evergreen rainforests and that they contain only 240 species of flowering plants, which are also found elsewhere, and also that the Valley does not possess any new or rare species. Despite protests by environmentalists the State Government was about to go ahead with the project, only awaiting a clearance form the Central Government. At this juncture, the Department of Science and Technology (India) accepted Manilal's proposal to study the flora of Silent Valley and also required him to make a general study of the ecological status of the forests.\n\nOver a four-year period commencing 1981, Manilal and research assistants undertook a study that brought to light:\n\nA record of nearly 1,000 species of flowering plants;\n\nSeven species new to science;\n\nSeveral plants believed to be found only in Sri Lanka, Philippines, etc.;\n\nSome species which were believed to be extinct, such as the Malabar Daffodil, which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris;\n\nRare medicinal plants until then known to grow only in the islands of Philippines;\n\nMany endemics of the neighbouring countries, where their existence was threatened, were found to have migrated to these forests for safety.\n\nFurther Manilal's study found that the Silent Valley forests fulfilled required parameters of tropical evergreen rainforests and, therefore, could be rightly so classified. His work was soon considered as model of how taxonomists could assist in solving socio-environmental issues; and many scientists and journalists from Europe, Africa and South America visited Silent Valley to study the working of this project.\n\nOrchids of Kerala\n\nDetailed studies of the orchid wealth of Kerala were started by Manilal in the late 1970s, including their taxonomy, anatomy, biology and floral evolution, which are essential for any further studies on their hybridisation. During these studies, contrary to the highest expectations, over 215 species of orchids were collected, including species that were till then believed to be extinct, like the ladies' slipper orchid Paphiopedilum druryii.\n\nOrigin and evolution of the flower\n\nManilal has led studies on the directions of evolution of flowers and the structure and anatomy of various floral organs in cash crops such as coconut palms, grasses (rice), orchids, compositae (sun flower), rubiales (coffee), etc. Many enigmas in these subjects could be solved, and results were published in around 45 research papers. These studies have, besides seeing the flower as the most significant part of the plant, with biological, commercial, aesthetic, evolutionary and taxonomic importance, also promoted success in hybridisation and breeding experiments, to create new high-yielding varieties.\n\nRadioactive resistant marine phyto-planktonic algae\n\nAs the beaches in southern Kerala and Tamil Nadu (particularly in the Districts of Kollam and Nagarcoil) have natural deposits of radioactive minerals causing genetic damage to flora and fauna, Manilal undertook studies to familiarise with the techniques of research in the field of radiation ecology. These studies were undertaken at the Marine Biology Laboratory of North Wales University at Menai Bridge, Wales. The Royal Society of London granted Manilal a Visiting Scientist-ship for this work for two years in 1971–1972.\n\nTwo species of marine phyto-planktonic algae were discovered, which could withstand a very high degree of radioactivity. It was found that these species could absorb and adsorb as much as 40 times their body weight of the radioactive Thorium compounds from surrounding seawater, and continue to live normally. In the 1970s these findings were farfetched to be accepted for publication in a journal in U.K. However, on Manilal's return to India, a part of these findings was published in the journal Current Science (1975), by the Indian Institute of Science. About ten years later, some British scientists did a similar work and their results were published in the prestigious U.K. journal Nature, and wide publicity in the press as a biotechnological break-through. Manilal's experiments (and the subsequent work by the British scientists) show that such marine planktonic algae could be used to quickly and safely clean up ocean surfaces where radio-active materials have accumulated, by cultivating such algae in a specific area and later removing them from there.\n\nIndian Association for Angiosperm Taxonomy (IAAT)\n\nManilal was instrumental in establishing the Indian Association for Angiosperm Taxonomy (IAAT). Manilal, as founder President, established IAAT in the year 1990 with its Headquarters located at the Department of Botany, University of Calicut, Kozhikode, India. The IAAT works to promote the science of Angiosperm Taxonomy in India, to provide a common forum for Angiosperm taxonomists in India to organise meetings, hold discussions and exchange ideas on scientific and academic matters, and encourage collaborative work among taxonomists. The IAAT publishes a journal Rheedea (named after Hendrik van Rheede). The Indian Association for Angiosperm Taxonomy works as an affiliate of the International Association for Plant Taxonomy.\n\nFrom 1969 Manilal commenced training research students in Taxonomy (leading to PhD degree in the subject), with a view to attain self-sufficiency in Taxonomy. During the years 1972–1998, he and his students discovered over 240 new species of flowering plants and several new records for India from Kerala, and published many research papers in Taxonomy in national and international journals.\n\nBiomass Research Centre\n\nA Biomass Research Centre was established by Manilal in the University of Calicut, with funding from the Ministry of Non-conventional Energy Sources. The Centre does research and field experiments to establish the (taxonomic) identification of fast-growing fuel-wood trees suitable for various agro-climatic zones of Kerala.\n\nSummary of Manilal's discoveries\n\nNew species and varieties discovered, and combinations established by Manilal and his research associates are summarised are follows:\n\nNew species discovered in Silent Valley\n\nLiparis indiraii Manilal & C.S.Kumar\n\nEria tiagii Manilal & C.S.Kumar\n\nHydnocarpus pendulus Manilal, T.Sabu & Sivar.\n\nRobiquetia josephiana Manilal & C.S.Kumar\n\nSauropus saksenianus Manilal, Prasann. & Sivar.\n\nCucumella silentvaleyi Manilal, T.Sabu & P.J.Mathew\n\nOberonia bisaccata Manilal & C.S.Kumar\n\nNew species discovered under biodiversity studies\n\nHedyotis erecta Manilal & Sivar.\n\nCinnamomum nicolsonianum Manilal & Shylaja\n\nBulbophyllum rheedei Manilal & C.S.Kumar\n\nHeliotropium keralense Sivar. & Manilal\n\nBorreria malabarica Sivar. & Manilal\n\nPhyllanthus kozhikodianus Sivar. & Manilal\n\nHabenaria indica C.S.Kumar & Manilal\n\nNew varieties of flowering plants discovered\n\nBorreria stricta (L. f.) K.Schum. var. rosea; Sivar. & Manilal\n\nBorreria articularis (L. f.) F.N.Williams var. hispida Sivar. & Manilal\n\nPortulaca oleracea L. var. linearifolia Sivar. & Manilal\n\nNew combinations established\n\nThunbergia bicolour (Wight) Manilal & Suresh\n\nEria chandrasekharanii (Bharg. & Moh.) C.S.Kumar & Manilal\n\nAwards\n\nOfficer of the Order of Orange-Nassau award (Dutch: Orde van Oranje-Nassau) by Her Majesty Queen Beatrix of the Netherlands. (The Consul General of the Kingdom of the Netherlands, Ms. Marijke A. van Drunen Littel conferred this honour on 1 May 2012, at Kozhikode, Kerala, India.)\n\nE.K. Janaki Ammal National Award for Taxonomy (2003) – Constituted by The Ministry of Environment and Forests\n\nY. D. Tyagi Gold Medal (1998) – by the Indian Association of Angiosperm Taxonomy (IAAT)\n\nVishwambhar Puri Medal (1990) – by The Indian Botanical Society\n\nPositions\n\nChief Editor, Rheedea, The Journal of Indian Association of Angiosperm Taxonomy (1991–present)\n\nPresident, Botanical Society of India (1999)\n\nTreasurer, Botanical Society of India (1984–1986)\n\nFounding President, Indian Association of Angiosperm Taxonomy (1991)\n\nChairman, CRIKSC (Centre for Research in Indigenous Knowledge, Science & Culture)\n\nPlants named in honour of Prof. K.S. Manilal (Eponyms)\n\nLindernia manilaliana Sivar. (Kew Bull. 31: 151. 1976)\n\nFimbristylis manilaliana Govind. (Rheedea 8(1): 87, f. 1. 1998)\n\nCyathocline manilaliana C.P.Raju & R.R.V.Raju (Rheedea 9 (2): 151-154. 1999)\n\nSchoenorchis manilaliana M. Kumar & Sequiera (Kew Bull. 55: 241. 2000)\n\nCololejeunea manilalia Manju, Chandini & K.P.Rajesh (Acta Bot. Hung. 59(1–2): 262, 1–2. 2017)\n\nPublisher's appeal for donation of royalties\n\nHortus Malabaricus as transliterated by Manilal was published in English and Malayalam languages in 2003 and 2008 respectively. Manilal's copyright, as author of the English and Malayalam versions, was bequeathed, free of royalties, to the publishers, the University of Kerala. This assignment of rights was a gesture by Manilal in good faith and in response to a specific appeal from the then Vice-Chancellor of the University of Kerala, that the University wanted to generate funds from this publication for utilisation of such royalty incomes toward re-publication of old Malayalam classical works, which are out of print, and not forecasted to generate a viable level of income due to limited sale of such classical works.\n\nBook-release functions conducted by the publishers\n\nIn a recorded interview with Manilal in August 2008, he expressed his regret and frustration at the manner in which the publishers subjected him to digression from the publication project soon after he legally assigned his rights as author. Apparently there was a move to exclude Manilal's name from the book (2003), but was reinstated on account of questions raised by the academic community. On 14 August 2008, the University of Kerala officials again conducted a function at Thiruvananthapuram to formally release the Malayalam edition of Hortus Malabaricus. The book was released by the Governor of Kerala (also Chancellor of the University), at the function; where due recognition was not given to Manilal as author of the book, nor were arrangements in place to felicitate the author at the function. [1]. The former Vice-Chancellor of University of Kerala who initiated the project, B. Ekbal, was also not invited to this function.\n\nBooks authored by K. S. Manilal\n\n2012. MANILAL, K.S. Hortus Malabaricus and the Socio-Cultural Heritage of India. Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode.\n\n2008. MANILAL, K.S. Van Rheede's Hortus Malabaricus. Malayalam Edition, with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5)\n\n2004. MANILAL, K.S. & C. SATHISH KUMAR Orchid Memories: A tribute to Gunnar Seidenfaden. Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. (ISBN 81-900324-6-1)\n\n2003. MANILAL, K.S. Van Rheede’s Hortus Malabaricus. English Edition, with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-57-4)\n\n1998. MANILAL, K.S. & M.S. MUKTESH KUMAR A Handbook on Taxonomy Training. DST, New Delhi.\n\n1998. MANILAL, K.S. & K. RAVEENDRAKUMAR Companion to Gamble’s Flora: Additions to the Flora of Kerala since Gamble (1935). Mentor Books, Kozhikode.\n\n1996. MANILAL, K.S. Hortus Malabaricus and Itty Achuden: A study on the role of Itty Achuden in the compilation of Hortus Malabaricus (In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.(ISBN 81-900324-1-0).\n\n1996. MANILAL, K.S. Directory of Indian Taxonomists. Mentor books, Kozhikode.\n\n1996. MANILAL, K.S. & A.K. PANDEY Taxonomy and Plant Conservation. C.B.S. Publishers & Distributors, New Delhi. (ISBN 81-239-0444-4)\n\n1994. SATHISH KUMAR, C. & K.S. MANILAL A Catalogue of Indian Orchids. Bishen Singh Mahendrapal Singh, Dehra Dun. (ISBN 81-211-0100-X).\n\n1993. MANILAL, K.S. & C. SATHISH KUMAR Field Key for the Identification of the Native Orchids of Kerala. Mentor Books, Kozhikode.\n\n1988. NICOLSON, D.H., C.R. SURESH & K.S. MANILAL An Interpretation of Van Rheede’s Hortus Malabaricus. International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile)\n\n1988. MANILAL, K.S. Flora of Silent Valley Tropical Rain Forests of India. Department of Science & Technology, Government of India, Kozhikode.\n\n1982. MANILAL, K.S. & V.V. SIVARAJAN The Flora of Calicut: The Flowering Plants of the Greater Calicut Area. Bishen Singh Mahendrapal Singh, Dehra Dun.\n\n1980. MANILAL, K.S. The Botany & History of Hortus Malabaricus. A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. (ISBN 90-6191-071-4)."}, {"url": "https://wiki2.org/en/K._S._Manilal", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nIndian botany scholar and taxonomist\n\nKattungal Subramaniam Manilal (Malayalam: കാട്ടുങ്ങൽ സുബ്രഹ്മണ്യം മണിലാൽ) (born 17 September 1938) is an Emeritus of the University of Calicut,[1] a botany scholar and taxonomist, who devoted over 35 years of his life to research, translation and annotation work of the Latin botanical treatise Hortus Malabaricus.[2] This epic effort brought to light the main contents of the book, a wealth of botanical information on Malabar that had largely remained inaccessible to English-speaking scholars, because the entire text was in the Latin language.\n\nIn January 2020, Manilal was conferred with the Padma Shri award, the fourth-highest civilian honour of India, for his contribution in the field of Science and Engineering.[3][4]\n\nDespite the existence of Hendrik van Rheede's Hortus Malabaricus over the last three centuries, the correct taxonomic identity of many plants listed in Hortus Malabaricus, their medicinal properties, methods of use, etc., as described and codified by renowned traditional medical authorities of 17th century India remained inaccessible to English language based scholars, until Manilal commenced publication of research papers and books on Hortus Malabaricus.\n\nManilal's efforts ultimately resulted in an English edition of Hortus Malabaricus, for the first time, 325 years after its original publication from Amsterdam. The English edition contains a word by word translation of all the twelve volumes of the book, retaining the original style of language. Medicinal properties of plants are translated and interpreted, with commentaries on their Malayalam names given by Van Rheede. In addition, the correct scientific identity of all plants, acceptable under ICBN are set out along with their important synonyms and basionyms.\n\nWhilst the scope of Manilal's contributions to botany extend far beyond the research and publications around Hortus Malabaricus, his research work on Hortus Malabaricus alone are of botanical and socio-historic significance, and can be broadly classified under two heads:\n\nBotanical and Medicinal aspects of Hortus Malabaricus; and\n\nHistorical, Political, Social and Linguistic aspects of Hortus Malabaricus.\n\nManilal has over 198 published research papers and 15 books to his credit as author and co-author.[5] He and his associates have credits to discovering over 14 species of flowering plants, varieties and combinations new to science. Dr. Manilal is the Founder President of the Indian Association for Angiosperm Taxonomy (IAAT).[6]\n\nYouTube Encyclopedic\n\n1 / 1 Views: 865\n\nMod-01 Lec-18 A Science Initiative in Ayurveda (ASIIA) Transcription\n\nBirth, early life and interest in Hortus Malabaricus\n\nManilal was born in Cochin on 17 September 1938. He is one of three children born to his parents; father Advocate Kattungal A. Subramaniam (b:1914~d:1973) and mother K. K. Devaki (b:1919~d:1989).[5] Manilal's father, K. A. Subramaniam, was besides being a practising advocate, also a writer, who authored the biography of Sahodaran Ayyapan. Manial's Kattungal family members are natives of North Paravur in Kerala, India.\n\nAs a young boy, Manilal's interest in Hortus Malabaricus was inspired by his father, whose avid reading habits and enthusiasm for sociology exposed Manilal to a collection of books, and more specifically newspaper cuttings on Hortus Malabaricus during the late 1940s and 1950s.\n\nManilal schooled initially at the Government Boys' High School, Kodungallur and later at the Government S.R.V. Boys' High School, Ernakulam. He enrolled for undergraduate studies in botany at the Maharaja's College, Ernakulam, following which, he secured MSc Botany and PhD Degrees from University Teaching Department, Sagar, in Madhya Pradesh.\n\nDuring his post-graduate studies, while on a study tour to the Forest Research Institute in Dehra Dun,[7] Manilal was able to see, for the first time, a set of volumes of the original Hortus Malabaricus. This was set of volumes acquired by the institute's library during the days of the British Raj, when the institute was called the Imperial Forest College. Manilal remarks \"it fired my imagination!” on seeing a Latin book in which the names of plants were also written in native Malayalam language. Manilal maintained his interest in the book through his studies and professional life until 1969, when he commenced serious work on the transliteration of Hortus Malabaricus.\n\nHe presently stays in Kozhikode.[8]\n\nMajor research and academic achievements\n\nBotanical and medicinal aspects of Hortus Malabaricus\n\nFrontispiece of the original Latin Hortus Malabaricus\n\nAs Hortus Malabaricus is a pre-Linnaean book, the scientific names of plants, equivalent to local Malayalam names, were not included. Since voucher specimens for the book are also not known to exist, the correct identity of many of the plants described was unclear and not verifiable to original specimens. Earlier attempts, over three centuries, by European and Indian botanists to correctly identify all specimens were futile. Under two research projects; one sponsored by the U.G.C. (1975–1978) and the other by the Smithsonian Institution (1984–1987), Manilal collected all plants, described in Hortus Malabaricus, from localities in Malabar from where they were originally collected in the 17th century. Specimens were subjected to detailed studies and their correct identities were established in consultation with research institutes in Europe and USA.[9] Based on this work, initially a concise reference book: An Interpretation of Van Rheede's Hortus Malabaricus, was published (with his collaborators) from Berlin (1988), by the IAPT. This remains the only book by Indian authors published by them (IAPT) till date and is an essential resource in study on the taxonomy of Southeast Asian plants.\n\nRichard H. Grove, in his book 'Green Imperialism: Colonial Expansion, Tropical Island Edens and the Origins', states that Itty Achudan and his team selected the plants which were to be drawn and included in Hortus Malabaricus, with accurate identification and mentioning of vernacular (local) name of the plants.[10] Itty Achudan also disclosed the medicinal and other uses of the plants which was known to him from his own experience as a herbal physician and from the 'palmleaf scripture' carried by his family as 'wealth of knowledge'. Achudan dictated the material, in his native Malayalam language, which was then translated into Latin. Hortus Malabaricus was compiled over a period of nearly 30 years and published in Amsterdam during 1678–1693.[11]\n\nHistorical, political, social and linguistic aspects of Hortus Malabaricus\n\nThe compilation and publication of Hortus Malabaricus is intimately connected with the history of India, politics of the 17th century Netherlands and the then social conditions of Malabar. It is also an important source of information, and the oldest printed, authentic document, on the evolution of Malayalam language and script. Manilal studied these aspects for over 35 years bringing to light many interesting facts, some of which were included in his book: Botany & History of Hortus Malabaricus, published from Rotterdam and Delhi (1980). Another book, in Malayalam: A study on the role of Itty Achudan in the compilation of Hortus Malabaricus, was published from Kozhikode in 1996.\n\nIn the research paper published in the journal Global Histories, entitled 'Plants, Power and Knowledge: An Exploration of the Imperial Networks and the Circuits of Botanical Knowledge and Medical Systems on the Western Coast of India Against the Backdrop of European Expansionism', Malavika Binny states that Kerala had medical traditions that existed even prior to Ayurvedic tradition. As per the author, Ezhava Tradition of Healing Practices or 'Ezhava vaidyam',as it is called, was prominent among other medical traditions that existed in Kerala which involved a considerable contribution from Buddhism which was a major force from the sixth century to about the eleventh century. This Buddhist tradition of treatment of diseases using plants and the knowledge of the indigenous plants preserved by the Ezhavas was exploited by the European endeavour as suggested by the inclusion of Itty Achuden in the compilation of Hortus Malabaricus which is basically an ethno-botanical treatise on the flora of Malabar.[12] Van Rheede's motivation to compile a book on the natural plant wealth of Malabar was to prove his belief that Malabar is self-sufficient in all requirements of military and commerce and hence that Cochin was better suited to be the south east Asian Headquarters of the Dutch overseas forces, compared to Colombo in Ceylon.\n\nInformation is also available in the text of Hortus Malabaricus not only about the vegetation in 17th century Malabar, but also about the general social conditions prevalent in those days. Significant inferences could also be drawn on some of these matters, indirectly from the data available in the book. Several research papers have been published by Manilal on these topics. Some more, particularly on the different Numerals and Numerical Systems used in Hortus and their sociological implications and significances in the Indian society, are under preparation.\n\nTaxonomic and biodiversity studies in Kerala\n\nManilal pioneered taxonomic research and biodiversity studies in Kerala by training a genre of young taxonomists and identifying and cataloguing local plants in biodiversity-rich South India. A comprehensive study on the flora of the Greater Kozhikode area, consisting of the western sectors of the present day Kozhikode and Malappuram districts, covering an area of about 600 km2. was started in 1969. When completed in 1975, this work resulted in recording about one thousand species of flowering plants from the region, including several species recorded for the first time in India and importantly seven species new to science. Based on this work, a book: Flora of Calicut, was published (from Dehra Dun), and was taken as a model for subsequent research in India.\n\nResearch and revelations at Silent Valley\n\nIn the 1970s, when a proposal to build a hydro-electric project in Silent Valley triggered political controversy in Kerala due to an impending ecological disaster, the Government of Kerala appointed an experts' committee of scientists to study, inventorise and report on Silent Valley's flora and fauna. The experts' committee reported that the forests there could not be classified as tropical evergreen rainforests and that they contain only 240 species of flowering plants, which are also found elsewhere, and also that the Valley does not possess any new or rare species. Despite protests by environmentalists the State Government was about to go ahead with the project, only awaiting a clearance form the Central Government. At this juncture, the Department of Science and Technology (India) accepted Manilal's proposal to study the flora of Silent Valley and also required him to make a general study of the ecological status of the forests.\n\nOver a four-year period commencing 1981, Manilal and research assistants undertook a study that brought to light:\n\nA record of nearly 1,000 species of flowering plants;\n\nSeven species new to science;\n\nSeveral plants believed to be found only in Sri Lanka, Philippines, etc.;\n\nSome species which were believed to be extinct, such as the Malabar Daffodil , which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris;\n\n, which was last seen in 1850 by a scientist named Thomas C. Jerdon in Nilgiris; Rare medicinal plants until then known to grow only in the islands of Philippines;\n\nMany endemics of the neighbouring countries, where their existence was threatened, were found to have migrated to these forests for safety.\n\nFurther Manilal's study found that the Silent Valley forests fulfilled required parameters of tropical evergreen rainforests and, therefore, could be rightly so classified. His work was soon considered as model of how taxonomists could assist in solving socio-environmental issues; and many scientists and journalists from Europe, Africa and South America visited Silent Valley to study the working of this project.\n\nOrchids of Kerala\n\nDetailed studies of the orchid wealth of Kerala were started by Manilal in the late 1970s, including their taxonomy, anatomy, biology and floral evolution, which are essential for any further studies on their hybridisation. During these studies, contrary to the highest expectations, over 215 species of orchids were collected, including species that were till then believed to be extinct, like the ladies' slipper orchid Paphiopedilum druryii.\n\nOrigin and evolution of the flower\n\nManilal has led studies on the directions of evolution of flowers and the structure and anatomy of various floral organs in cash crops such as coconut palms, grasses (rice), orchids, compositae (sun flower), rubiales (coffee), etc. Many enigmas in these subjects could be solved, and results were published in around 45 research papers. These studies have, besides seeing the flower as the most significant part of the plant, with biological, commercial, aesthetic, evolutionary and taxonomic importance, also promoted success in hybridisation and breeding experiments, to create new high-yielding varieties.\n\nRadioactive resistant marine phyto-planktonic algae\n\nAs the beaches in southern Kerala and Tamil Nadu (particularly in the Districts of Kollam and Nagarcoil) have natural deposits of radioactive minerals causing genetic damage to flora and fauna, Manilal undertook studies to familiarise with the techniques of research in the field of radiation ecology. These studies were undertaken at the Marine Biology Laboratory of North Wales University at Menai Bridge, Wales. The Royal Society of London granted Manilal a Visiting Scientist-ship for this work for two years in 1971–1972.\n\nTwo species of marine phyto-planktonic algae were discovered, which could withstand a very high degree of radioactivity. It was found that these species could absorb and adsorb as much as 40 times their body weight of the radioactive Thorium compounds from surrounding seawater, and continue to live normally. In the 1970s these findings were farfetched to be accepted for publication in a journal in U.K. However, on Manilal's return to India, a part of these findings was published in the journal Current Science (1975), by the Indian Institute of Science. About ten years later, some British scientists did a similar work and their results were published in the prestigious U.K. journal Nature, and wide publicity in the press as a biotechnological break-through. Dr. Manilal's experiments (and the subsequent work by the British scientists) show that such marine planktonic algae could be used to quickly and safely clean up ocean surfaces where radio-active materials have accumulated, by cultivating such algae in a specific area and later removing them from there.\n\nIndian Association for Angiosperm Taxonomy (IAAT)\n\nManilal was instrumental in establishing the Indian Association for Angiosperm Taxonomy (IAAT). Manilal, as founder President, established IAAT in the year 1990 with its headquarters located at the Department of Botany, University of Calicut, Kozhikode, India. The IAAT works to promote the science of Angiosperm Taxonomy in India, to provide a common forum for Angiosperm taxonomists in India to organise meetings, hold discussions and exchange ideas on scientific and academic matters, and encourage collaborative work among taxonomists. The IAAT publishes a journal Rheedea (named after Hendrik van Rheede). The Indian Association for Angiosperm Taxonomy works as an affiliate of the International Association for Plant Taxonomy.\n\nFrom 1969 Manilal commenced training research students in Taxonomy (leading to PhD degree in the subject), with a view to attain self-sufficiency in Taxonomy. During the years 1972–1998, he and his students discovered over 240 new species of flowering plants and several new records for India from Kerala, and published many research papers in Taxonomy in national and international journals.\n\nBiomass Research Centre\n\nA Biomass Research Centre was established by Manilal in the University of Calicut, with funding from the Ministry of Non-conventional Energy Sources. The Centre does research and field experiments to establish the (taxonomic) identification of fast-growing fuel-wood trees suitable for various agro-climatic zones of Kerala.\n\nSummary of Manilal's discoveries\n\nNew species and varieties discovered, and combinations established by Manilal and his research associates are summarised are follows:\n\nNew species discovered in Silent Valley[13]\n\nLiparis indiraii Manilal & C.S.Kumar\n\nEria tiagii Manilal & C.S.Kumar\n\nHydnocarpus pendulus Manilal, T.Sabu & Sivar.\n\nRobiquetia josephiana Manilal & C.S.Kumar\n\nSauropus saksenianus Manilal, Prasann. & Sivar.\n\nCucumella silentvaleyi Manilal, T.Sabu & P.J.Mathew\n\nOberonia bisaccata Manilal & C.S.Kumar\n\nNew species discovered under biodiversity studies\n\nHedyotis erecta Manilal & Sivar.\n\nCinnamomum nicolsonianum Manilal & Shylaja\n\nBulbophyllum rheedei Manilal & C.S.Kumar\n\nHeliotropium keralense Sivar. & Manilal\n\nBorreria malabarica Sivar. & Manilal\n\nPhyllanthus kozhikodianus Sivar. & Manilal\n\nHabenaria indica C.S.Kumar & Manilal\n\nNew varieties of flowering plants discovered\n\nBorreria stricta (L. f.) K.Schum. var. rosea ; Sivar. & Manilal\n\nvar. ; Borreria articularis (L. f.) F.N.Williams var. hispida Sivar. & Manilal\n\nvar. Portulaca oleracea L. var. linearifolia Sivar. & Manilal\n\nNew combinations established\n\nThunbergia bicolour (Wight) Manilal & Suresh\n\nEria chandrasekharanii (Bharg. & Moh.) C.S.Kumar & Manilal\n\nNotable awards and positions held\n\nAwards\n\nPadma Shri award by Government of India (2020)\n\nOfficer of the Order of Orange-Nassau award (Dutch: Orde van Oranje-Nassau) by Her Majesty Queen Beatrix of the Netherlands. (The Consul General of the Kingdom of the Netherlands, Ms. Marijke A. van Drunen Littel conferred this honour on 1 May 2012, at Kozhikode, Kerala, India. [14] )\n\n) E.K. Janaki Ammal National Award for Taxonomy (2003) – Constituted by The Ministry of Environment and Forests\n\nY. D. Tyagi Gold Medal (1998) – by the Indian Association of Angiosperm Taxonomy (IAAT)\n\nVishwambhar Puri Medal (1990) – by The Indian Botanical Society\n\nPositions\n\nChief Editor, Rheedea, The Journal of Indian Association of Angiosperm Taxonomy (1991–present)\n\nPresident, Botanical Society of India (1999)\n\nTreasurer, Botanical Society of India (1984–1986)\n\nFounding President, Indian Association of Angiosperm Taxonomy (1991)\n\nChairman, CRIKSC (Centre for Research in Indigenous Knowledge, Science & Culture)\n\nPlants named in honour of Manilal (Eponyms)\n\nLindernia manilaliana Sivar. (Kew Bull. 31: 151. 1976)\n\nSivar. (Kew Bull. 31: 151. 1976) Fimbristylis manilaliana Govind. (Rheedea 8(1): 87, f. 1. 1998)\n\nGovind. (Rheedea 8(1): 87, f. 1. 1998) Cyathocline manilaliana C.P.Raju & R.R.V.Raju (Rheedea 9 (2): 151–154. 1999)\n\nC.P.Raju & R.R.V.Raju (Rheedea 9 (2): 151–154. 1999) Schoenorchis manilaliana M. Kumar & Sequiera (Kew Bull. 55: 241. 2000)\n\nM. Kumar & Sequiera (Kew Bull. 55: 241. 2000) Cololejeunea manilali Manju, Chandini & K.P.Rajesh (Acta Bot. Hung. 59(1–2): 262, 1–2. 2017)\n\nManju, Chandini & K.P.Rajesh (Acta Bot. Hung. 59(1–2): 262, 1–2. 2017) Fissidens manilalia Manju, C.N., Manjula, K.M. & K.P. Rajesh (The Bryologist 120 (3): 263–269. 2017)\n\nManju, C.N., Manjula, K.M. & K.P. Rajesh (The Bryologist 120 (3): 263–269. 2017) Isachne manilaliana Sunil, K.M.P. Kumar & Thomas (Webbia 72: 161–164. 2017)\n\nPublication of the English and Malayalam versions of Hortus Malabaricus\n\nPublisher's appeal for donation of royalties\n\nHortus Malabaricus as transliterated by Manilal was published in English and Malayalam languages in 2003 and 2008 respectively. Manilal's copyright, as author of the English and Malayalam versions, was bequeathed, free of royalties, to the publishers, the University of Kerala.[15] This assignment of rights was a gesture by Manilal in good faith and in response to a specific appeal from the then Vice-Chancellor of the University of Kerala, that the university wanted to generate funds from this publication for utilisation of such royalty incomes toward re-publication of old Malayalam classical works, which are out of print, and not forecasted to generate a viable level of income due to limited sale of such classical works.\n\nBook-release functions conducted by the publishers\n\nIn a recorded interview with Manilal in August 2008, he expressed his regret and frustration at the manner in which the publishers subjected him to digression from the publication project soon after he legally assigned his rights as author. Apparently there was a move to exclude Manilal's name from the book (2003), but was reinstated on account of questions raised by the academic community.[15] On 14 August 2008, the University of Kerala officials again conducted a function at Thiruvananthapuram to formally release the Malayalam edition of Hortus Malabaricus. The book was released by the Governor of Kerala (also Chancellor of the university), at the function; where due recognition was not given to Manilal as author of the book, nor were arrangements in place to felicitate the author at the function. [2]. The former Vice-Chancellor of University of Kerala who initiated the project, B. Ekbal, was also not invited to this function.\n\nBooks authored\n\n2012. MANILAL, K.S. Hortus Malabaricus and the Socio-Cultural Heritage of India . Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode.\n\n. Indian Association of Angiosperm Taxonomy (IAAT), Kozhikode. 2008. MANILAL, K.S. Van Rheede's Hortus Malabaricus. Malayalam Edition , with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5)\n\n, with Annotations and Modern Botanical Nomenclature (12 Vols.) University of Kerala, Trivandrum. (ISBN 81-86397-82-5) 2004. MANILAL, K.S. & C. SATHISH KUMAR Orchid Memories: A tribute to Gunnar Seidenfaden . Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. ( ISBN 81-900324-6-1)\n\n. Mentor Books, Kozhikode and Indian Association for Angiosperm Taxonomy, Kozhikode. ( ISBN 81-900324-6-1) 2003. MANILAL, K.S. Van Rheede’s Hortus Malabaricus. English Edition , with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. ( ISBN 81-86397-57-4)\n\n, with Annotations and Modern Botanical Nomenclature. (12 Vols.) University of Kerala, Trivandrum. ( ISBN 81-86397-57-4) 1998. MANILAL, K.S. & M.S. MUKTESH KUMAR A Handbook on Taxonomy Training . DST, New Delhi.\n\n. DST, New Delhi. 1998. MANILAL, K.S. & K. RAVEENDRAKUMAR Companion to Gamble’s Flora: Additions to the Flora of Kerala since Gamble (1935) . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1996. MANILAL, K.S. Hortus Malabaricus and Itty Achuden: A study on the role of Itty Achuden in the compilation of Hortus Malabaricus (In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.( ISBN 81-900324-1-0).\n\n(In Malayalam). Mentor Books, Kozhikode/ P.K.Brothers, Kozhikode.( ISBN 81-900324-1-0). 1996. MANILAL, K.S. Directory of Indian Taxonomists . Mentor books, Kozhikode.\n\n. Mentor books, Kozhikode. 1996. MANILAL, K.S. & A.K. PANDEY Taxonomy and Plant Conservation . C.B.S. Publishers & Distributors, New Delhi. ( ISBN 81-239-0444-4)\n\n. C.B.S. Publishers & Distributors, New Delhi. ( ISBN 81-239-0444-4) 1994. SATHISH KUMAR, C. & K.S. MANILAL A Catalogue of Indian Orchids . Bishen Singh Mahendrapal Singh, Dehra Dun. ( ISBN 81-211-0100-X).\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. ( ISBN 81-211-0100-X). 1993. MANILAL, K.S. & C. SATHISH KUMAR Field Key for the Identification of the Native Orchids of Kerala . Mentor Books, Kozhikode.\n\n. Mentor Books, Kozhikode. 1988. NICOLSON, D.H., C.R. SURESH & K.S. MANILAL An Interpretation of Van Rheede’s Hortus Malabaricus . International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile)\n\n. International Association of Plant Taxonomists, Berlin, Germany/ Koeltz Scientific Books, Konigstein, Germany. (ISSN 0080-0694 Regnum Vegetabile) 1988. MANILAL, K.S. Flora of Silent Valley Tropical Rain Forests of India . Department of Science & Technology, Government of India, Kozhikode.\n\n. Department of Science & Technology, Government of India, Kozhikode. 1982. MANILAL, K.S. & V.V. SIVARAJAN The Flora of Calicut: The Flowering Plants of the Greater Calicut Area . Bishen Singh Mahendrapal Singh, Dehra Dun.\n\n. Bishen Singh Mahendrapal Singh, Dehra Dun. 1980. MANILAL, K.S. The Botany & History of Hortus Malabaricus . A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. ( ISBN 90-6191-071-4).\n\n. A.A.Balkema, Rotterdam, Netherlands/ Oxford & IBH, New Delhi. ( ISBN 90-6191-071-4). 1976. MANILAL, K.S. & V.V.SIVARAJAN Flowering Plants of the Calicut University Campus. University of Calicut, Kerala. India.\n\nis used to indicate this person as the author when botanical name.[16] The standard author abbreviation is used to indicate this person as the author when citing\n\nReferences\n\nPublished paper – \"On the English edition of Van Rheede's Hortus Malabaricus by K. S. Manilal (2003)\" by H.Y. Mohan Ram.\n\nThe Botany and History of Hortus Malabaricus – by Manilal, K. S. – A. A. Balkema, Rotterdam, Netherlands/Oxford & IBH, New Delhi, 1980.\n\nManju, C.N., Chandini, V.K. and Rajesh, K.P., 2017. Cololejeunea manilalia (Lejeuneaceae, Marchantiophyta), a new species from the Western Ghats of India. Acta Botanica Hungarica, 59(1-2), pp.261-268.\n\nVideo resources"}, {"url": "https://english.stackexchange.com/questions/49722/did-i-get-or-take-my-degree-from-or-in-the-university-of-somewhere", "page_content": "Firstly, a master's degree is not proper and therefore does not require capitalization, but personally I've seen several highly professional institutions spell it both ways.\n\nSeeing as how all three of those sentences are grammatically sound, it's more a question of etiquette or regional custom. Like Peter Shor was saying, it's not wrong to say that you took your master's degree in somewhere but you may have to use caution repeating prepositions.\n\ne.g. I took my master's degree in astrophysics in the University of Somewhere\n\nUsing in twice is potentially awkward in situations where you may need to elaborate on your area of study.\n\nTo answer your question, all of those examples are grammatically strong and should get the message across appropriately anywhere you go.\n\nOn an editorial note, however, there are some ways to bypass this dilemma by opting for more colorful words:\n\nI (received, earned, attained) a master's degree after (studying in/at, attending, graduating from) the University of Somewhere.\n\nPlay it right and you'll sound like a Nobel Laureate, but all of your sentences will work well; none of them is really noticeably better, even on paper."}, {"url": "https://www.keralauniversity.ac.in/publications", "page_content": "Advaitasataka as the name indicates is a treatise on the main tenets of Advaita Vedanta in hundred stanzas. The work is based on more than a dozen manuscripts.\n\nA critical commentary on the Abhijnanashakuntala of Kalidasa. The author cites various views of other commentators on the differentproblems which concern the drama, as well as the portions in the textitself and argues to establish his own particular points of view.\n\nAn authoritative Malayalam literary history by Ulloor S. Parameswara Aiyer. The book is in two volumes. Gives a detailed description of the developmental history of Malayalam language and literature, and the literary history of Sanskrit as well.\n\nHortus Malabaricus published during the period 1678- 1693 from Amsterdam, is the first printed book on the plant wealth of Malabar and is the most important source of information on the plants of India and South East Asia. This twelve volume treatise was compiled by the then Dutch Governor of Malabar at Cochin, Hendrik Adriaan Van Rheede, and contains the indigenous pre-ayurvedic knowledge of the hereditary medical practitioners of Malabar. The book contains illustrations of 742 plants belonging to 691 modern species, their descriptions with pictorial representations, medicinal and other uses. The sketches drawn by efficient artists help us to easily identify the plants that have grown in our backyards. It is the Malayalam translation of the English version of Hortus Malabaricus published by the University of Kerala in the year 2003.\n\nThe book is a short history of the painting tradition and sculpture of Kerala from mural to modern period. The approach is interdisciplinary and tries to give a brief account of the change in the concept, expression and sensibility in the Art Scenario of Kerala.\n\nThe history of Malayalam Language in the background of prehistory and external history within the framework of modern linguistics. The author has made use of the descriptive analysis of old texts and modern dialects of Malayalam prepared by scholars from various Universities, which made this study an authoritative one.\n\nDirector\n\nShri.Dr.T.K. Santhoshkumar\n\nPhone : 2386365 (O)\n\nMobile : 9447460721\n\nEmail : publication@keralauniversity.ac.in\n\n\n\nSales Emporium Phone : 2305738\n\nStore Keeper Phone : 2386430\n\nABOUT\n\nThe Department of Publications started functioning in July 1938 as a unique institution of the Travancore University. At the time of its establishment no other University in India had organized such an establishment devoted solely to the publication on scholarly works. The department was established with the following objectives:-\n\nTo provide Malayalam with an adequate terminology to meet the demands of the progress in civilization and the discoveries in Science and Art in modern times.\n\nTo publish popular works on Science and general culture.\n\nTo translate the World Classics.\n\nTo collect source materials to pave the way for a comprehensive and accurate history of Kerala and its culture.\n\nThus, the Department of Publications was started with the object of enriching Malayalam language and literature. During its formative stage it brought out a series of glossaries, popular science books, translations from classics and original books written by scholars from outside. Six Glossaries were published on Mathematics, Chemistry, Physics, Botany, Zoology and Education. The other works included translations of Marcus Aurilius, Plutarch’s Lives, Montaigne’s Essays etc. An edition of Srimat Bhagavat Gita and a treatise on Sanskrit Grammar titled 'Saraswathi Kantabharanam' were also brought out. The department also undertook the publication of scholarly extension lectures delivered by eminent persons under the auspices of the University.\n\nHortus Malabaricus\n\nDuring these remarkable years of publishing work, the most acclaimed work of the Department of Publications has been the publishing of 'Hortus Malabaricus' in 2003. 'Hortus Malabaricus', published from Amsterdam in 12 volumes during 1678-1693, compiled and printed by Hendrik Adriaan van Rheede tot Draakestein, the then Dutch Governor of Cochin, a princely state of India, is the oldest comprehensive printed book on the natural plant wealth of Asia and of the tropics. This book gives vivid details of the medicinal properties of plants, the respective diseases for which they were used for treatment and the modes of treatment as known to the ancient, renowned traditional physicians of Malabar(Kerala). This work also throws light over the cultural, social, political, historical and linguistic conditions of India as well as Kerala. In 2008, the Department of Publications released the Malayalam edition of the work."}, {"url": "https://books.google.com/books/about/Botany_and_history_of_Hortus_Malabaricus.html?id=2HE_AAAAYAAJ", "page_content": "Shop for Books on Google Play\n\nBrowse the world's largest eBookstore and start reading today on the web, tablet, phone, or ereader.\n\nGo to Google Play Now »"}, {"url": "https://thewire.in/the-sciences/hortus-malabaricus-van-rheede-ks-manilal-botany-itty-achuden", "page_content": "Some books just get under your skin. Like flagposts, they could draw and guide you at different points of your life. Others, especially religious works, lay the tracks on which lives run. Then there are a few that make you fall hopelessly in love with them because they approximate human infatuation, drawing you in at one moment, mystifying you at others, frustrating and delighting you. But they grow on you, so entwining themselves with your life that at some point it becomes impossible to separate the strands.\n\nFor Kattungal Subramaniam Manilal, a retired professor of botany at the University of Calicut, the love started early. It was an oddly matched couple – a tall, reserved, bespectacled man and Hortus Malabaricus, an elaborately illustrated 17th-century Latin book on the trees and plants of the Malabar region of Kerala. It defined Manilal’s life and career; he would update and translate this mammoth 2,400-page, 12-volume work into English, revealing it to be one of the finest collaborations between east and west.\n\nThe task was mind-boggling. Each of the 742 plants mentioned in Hortus had to be tracked down to the areas they were originally collected from over 300 years ago, and then identified anew because modern taxonomic classification has changed significantly in this period. It showed a book that went far beyond plants, to shed light on the society, culture, science and language of its time.\n\nNow 80 and having suffered a stroke, Manilal remembers little, but signs of Hortus Malabaricus are strewn liberally over more than 50 years of his life. There are half a dozen books he wrote, many more papers and the recollections of colleagues, students and his wife, Jyotsna, who says that for a man “so reticent that often she did not know what he felt”, the Hortus was a “passion”.\n\nManilal first chanced upon this remarkable book in his father’s clippings from Malayalam newspapers of the 1950s, when he was still in school. Much later, as a postgraduate student of botany, he visited the Forest Research Institute in Dehradun, which had a complete set of the original volume of the book. He says it “fired (his) imagination” to find a 300-year-old Latin book of botany with names in Malayalam. He spent four days poring over the volumes and made a list of all the Malayalam names.\n\nThough he couldn’t understand the Latin text, one line from the description of a plant caught his attention. “The plant’s part,” it read translated, “if applied on the left toe improves the clarity of vision in the right eye.” The medicinal properties of the plant were known but how on Earth was the connection between the left toe and the right eye established?\n\nAt that moment, Manilal knew that he had to know what the rest of the book held.\n\nThe Hortus Malabaricus was the brainchild of Hendrik Adriaan Van Rheede Tot Drakenstein (Van Rheede), an aristocrat and soldier in the Dutch East India Company who rose rapidly through the ranks to become the Dutch Governor of Cochin in 1663.\n\nFor the Dutch and the Portuguese, Malabar was a land of abundance – of wood, spices and medicinal plants. For centuries the trade in these commodities had been controlled by Arab merchants who later introduced them to the West.\n\nVan Rheede’s motivations for a work cataloging the plants of the region were varied. One was economic: Arab traders sourced the ingredients for the medicines his soldiers needed from the Malabar, sold them in the West, from where the Dutch would have to import them at great expense. Procuring the medicinal plants and manufacturing medicines locally could save a lot of money.\n\nVan Rheede was also a keen naturalist, mesmerised by the luxuriance of the land he governed. He writes in the preface to the third volume of Hortus Malabaricus:\n\nAfter I had been with the Indians for a considerable number of years and on account of my office fairly often had to make journeys through very well-cultivated regions, on the way I observed large, lofty and dense forests. I saw that they were pleasing through the marvelous variety of trees, which was so great that it would be difficult to find two trees of the same kind in the same forest if one were to search for this. I rather frequently saw many ivies of various kinds climbing to one tree and moreover shooting up in the very branches of trees…so that it was often very pleasant to see on one tree displayed leaves, flowers, and fruits of ten or twelve different kinds.\n\nThe last reason was political. His superior, Admiral Rijcklof Volckertsz van Goens, was keen on making Colombo the second eastern capital of the Dutch, after Jakarta. Van Rheede was staunchly opposed to this. Documenting the medicine, food and timber riches of the Malabar would – he hoped – convince authorities in The Hague to make Cochin the second capital instead.\n\nWork on the Hortus began in 1663, and continued for the next 30 years. The first volume of the book was published in Amsterdam in 1678, a few years after Van Rheede left India, and the final in 1693, two years after his death on board a ship off the coast of Bombay.\n\nMaterial for the book was first written in Portuguese in Cochin, then translated to the Dutch and finally to Latin in Amsterdam. When he first started work on the Hortus Malabaricus in 1964, almost exactly three centuries after Van Rheede had, Manilal knew that Latin would be his first hurdle.\n\nManilal enlisted the help of a local priest who, starting with the line on the connection between the left toe and the right eye, translated small segments of the work. However, to proceed further, Manilal realised he would need to learn the language. Every month he would travel to Kochi for a few days to learn the language from another priest. But even after he became somewhat familiar, he realised that the Hortus was even more difficult and technical. Each volume, Manilal says, took him three to four years. “Now I look back and wonder how I did it,” he was quoted as saying a few years ago. But then the language also turned out to be the easiest part.\n\nThe botanical samples documented in the Hortus Malabaricus were collected by Van Rheede on his travels in the region. Plants around Cochin were easily collected but for those found elsewhere, Van Rheede writes they often had to “wait a whole year, and sometimes even longer, until we could secure one of their flowers or fruits.” When travelling by water to the interiors “to rebuke … some Malabar prince or other”, Van Rheede would often order a party of 200 men to leave the ship and wander through the forest collecting as many different plants as they could find. They would return “laden with plants collected from here, there and everywhere, to (the) warships”.\n\nManilal had to follow in Van Rheede’s footsteps quite literally, tracking down and collecting botanical samples from the locales mentioned in the Hortus. This was because the Hortus Malabaricus was written before Carl Linnaeus’s famous work Species Plantarum, in which the Swedish botanist first laid down the rules that form the basis of modern taxonomy. Botanical classification before that was whimsical and ad hoc, varying between authors. As a result plants, had multiple names, often long and convoluted.\n\nIf Hortus Malabaricus was to be relevant, all the plants it featured would have to be classified according to the modern International Code of Botanical Nomenclature. Either Van Rheede’s original collection, which he had shipped to Amsterdam, would have to be accessed, failing which the plants would have to be re-collected with the help of clues from the Hortus.\n\nThe original collection seemed to have vanished. Manilal made efforts to hunt it down, even going to Moscow at one point after a rumour that it might be there. He couldn’t succeed.\n\nManilal decided to hunt down the plants, scouring Hortus for every possible clue to their location and appearance. It was going to be a time consuming and expensive process, so he applied for grants. The University Grants Commission (1975-1978) and the Smithsonian Institution (1984-1987) agreed to fund the project. To help with the collection Manilal roped in C.R. Suresh, a student of his who was studying plant morphology.\n\nOver the seven years covered by the grants, they travelled across the length of Kerala – “from Kasargod” at the northern tip “to Trivandrum”, almost 500 km to the south, says Suresh. They would travel together, but since Manilal had university work to attend to, Suresh would often be on his own. “But there were some plants Manilal sir insisted on tracking down himself,” Suresh says, “particularly those specimens where he was also interested in seeing the surroundings – the geography and other plants that grew alongside.”\n\nThey managed to track down 741 plants. That was all but one of the plants mentioned in Hortus.\n\nThe first obstacle to this was pinning down the original locations. Place names had changed over the centuries. Other names were garbled in the tortuous translation from Malayalam to Portuguese, Dutch and then to Latin. In many cases, plants couldn’t be found in the original locations so the team had to scout farther afield.\n\nOften they would have to venture deep into forests, where elephants and snakes were a common hazard. Suresh was also troubled by allergenic plants, of which he says there were many. “Then”, he laughs, “there were local problems. With our bags full of plants of all shapes and sizes, we looked like madmen and had a difficult time explaining what we were doing to the villagers.”\n\nAt times the work was laborious. Getting fruits and flowers from plants would often require repeat visits at different times of the year. Suresh recounts instances on such trips when they were unable to locate the same plant, which meant they would have to start anew with another specimen.\n\nThen came the equally arduous process of identification, which involved extensive consultations with botanists around the world, and trips to labs and collections abroad. Manilal would use occasional travel to conferences abroad to sneak visits to them.\n\nBy 1988, the work was complete. In that year, Manilal, Suresh and Dan Nicolson of the Smithsonian Institution published a book entitled ‘An Interpretation of Van Rheede’s Hortus Malabaricus’, listing all the plants collected by Van Rheede in modern nomenclature.\n\nFor most people, this is where it would have ended. Manilal had a full-time job at the University of Calicut with teaching responsibilities, and continued to work in other areas.\n\nAt the time of a controversy about the proposed construction of a hydro-electric project in the Silent Valley, the Kerala government commissioned Manilal to undertake a four-year study of the area’s flora. His team recorded 1,000 species of flowering plants of which seven were new and others that were endangered. He also worked extensively on the orchids of Kerala, collecting over 215 species, led studies on the anatomy of cash crops like coconut palm and coffee, and researched species of marine algae that were resistant to radioactivity. But in every spare moment and interstice, he would return to his first love, because for him things were just beginning to get interesting.\n\nOther books had been written on the flora of India – but what distinguished Hortus Malabaricus was its emphasis on, and acknowledgement of, local knowledge. While Van Rheede was responsible for collecting the botanical samples, Itty Achuden, chief of the Collatt family of traditional physicians, identified them and listed their medical and agricultural uses. Achuden’s role in the Hortus Malabaricus is mentioned prominently, affirmed in two certificates at the very start.\n\nInterestingly, even though he belonged to the lower Ezhava (labour) caste, Achuden had been recommended for the task by Vir Kerala Varma, the king of Cochin. Three Konkani Brahmins, whose roles have also been acknowledged in the book, worked under him. Achuden was far more knowledgeable about the local plants than the Brahmins, whose knowledge was largely restricted to providing information from their traditional text, Mahanighandu, a pharmacological glossary that lists 400 medicinal plants from different parts of India in Sanskrit. Manilal was fascinated by this deference to knowledge over caste.\n\nVan Rheede had also been similarly fascinated. “I often attended a most delightful entertainment,” he says, “for instance when these gentile philosophers disagreed and disputed with each other by weight of arguments. Indeed they disputed and strongly defended their own opinions, but with incredible modesty, such as you might miss in the most distinguished philosophers of the world.”\n\nNone of the traditional medical texts of Achuden’s family are extant. Nor, Manilal realised, was there any mention of him elsewhere. The Hortus was the only remaining repository of this knowledge. And of the plants mentioned in it, the medical uses of 139 weren’t to be found in any other text. Had it not been for Achuden’s contribution, the significance would have been lost to the world. For Manilal, cataloguing these medical properties and uses was imperative to protecting India’s intellectual property, which, according to Jyotsna Manilal, he felt strongly about.\n\nAs Manilal delved deeper into Achuden’s life, he was also drawn into an exploration of this historical interaction between caste and knowledge, which seemed to stand in sharp contrast to the modern terms of their relationship. He explored this in ‘A Study on the Role of Itty Achuden in the Compilation of Hortus Malabaricus’, a Malayalam book published in 1996.\n\nEvery aspect of the Hortus Malabaricus led the besotted Manilal down a different path. The juxtaposition of two different dialects of Malayalam in Hortus – one of which is not used today – became an opportunity to investigate the evolution of Malayalam as well. He explored the considerable impact the book had on Linnaeus; Species Plantarum has more than 250 references to it. Manilal even investigated the identify of the artist who made the frontispiece of the original volume that depicted Flora, the Roman goddess of flowers, sitting and holding a rake in front of what seems like a very ornate greenhouse. To her right, holding various plants, stand the Malabari physician and the three Konkani Brahmins who were so central to this book.\n\nIn Manilal’s reimagining, the botany of Hortus Malabaricus was inextricably entwined with the eventful historical period it belonged to. He made these connections come alive. After he retired from academia in 1999, Manilal devoted himself entirely to the Hortus, the English version of which was released in 2003. He had signed off his copyright to the University of Calicut, which, in an act of cruel and petty politicking, did not invite him to the book release. But he was undeterred and continued working. According to Jyotsna, “He never really said very much about it.” The Malayalam edition followed a few years later.\n\nIn 2006, Manilal suffered a stroke, leading to the loss of mobility on his right side. But he was not done yet; his work on the Hortus Malabaricus was far from complete. He taught himself to type with only his left hand to complete his last book: ‘Hortus Malabaricus and the Socio-Cultural Heritage of India’. It was published in 2012, the same year Queen Beatrix of the Netherlands conferred a state honour on him for his work on the Hortus. Sadly, there has been little recognition in India of his work – not that Manilal cares. The Hortus Malabaricus was his first love, mission and crowning glory. And love is often its own reward.\n\nAkshai Jain is a Delhi-based journalist."}, {"url": "https://www.usingenglish.com/forum/threads/obtain-a-degree-from-at.211132/", "page_content": "'the University of York'── quoted from http://www.oxfordlearnersdictionaries.com/definition/english/university\n\n\n\nWhy 'the' can be used before 'University of York' but not before 'University of London'? Why 'the' can be used before 'University of York' but not before 'University of London'?\n\nbhaisahab Moderator Staff member Joined Apr 12, 2008 Member Type Retired English Teacher Native Language British English Home Country England Current Location Ireland Aug 1, 2014\n\n#7 It can be used. You asked if it should be used. There is no obligation to do so in the context of the OP's sentence.\n\nT Tdol Editor, UsingEnglish.com Staff member Joined Nov 13, 2002 Member Type Native Language British English Home Country UK Current Location Japan Aug 1, 2014\n\n#9 I would use the University of London in that sentence."}]}