{"Jeanine Riley began her career as a dancer in the Broadway production of Bye Bye Birdie in 1960.": [{"url": "https://www.rottentomatoes.com/celebrity/jeannine_riley", "page_content": "Highest Rated: 69% Electra Glide in Blue (1973)\n\nLowest Rated: 40% The Big Mouth (1967)\n\nBirthday: Oct 1, 1940\n\nBirthplace: Madera, California, USA\n\nJeannine Riley was an actress who graced the silver screen many times throughout her Hollywood career. Riley marked her early career with roles in the Rosalind Russell dramatic adaptation \"Five Finger Exercise\" (1962), \"Petticoat Junction\" (CBS, 1963-1970) and \"The Big Mouth\" (1967) with Jerry Lewis. She then acted in \"Hee Haw!\" (1968-1995), the dramedy \"The Comic\" (1969) with Dick Van Dyke and \"Of Thee I Sing\" (CBS, 1972-73). She also appeared in \"Dusty's Trail\" (1973). Later in her career, Riley acted in \"Electra Glide in Blue\" (1973)."}, {"url": "https://biographytribune.com/what-happened-to-actress-jeannine-riley-her-bio-height-husband-net-worth-today-petticoat-junction-children/", "page_content": "• Jeannine Brooke Riley is an American actress, best known for her role in the series “Petticoat Junction”.\n\n• She has a net worth of $4 million, earned through a successful acting career.\n\n• She started her acting career in the early 1960s and has since appeared in numerous television shows and feature films.\n\n• She starred in the sitcom “Petticoat Junction” and the comedy variety series “Hee Haw”.\n\n• She married twice but there are no reported children from her marriages.\n\nKnown for movies\n\nPetticoat Junction (1963-1965)\n\nas Billie Jo Bradley Electra Glide in Blue (1973)\n\nas Jolene Dusty's Trail (1973-1974)\n\nas Lulu McQueen Strike Me Deadly (1963)\n\nas Lori Grant\n\nShort Info Fact Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton.\n\n﻿﻿﻿﻿\n\nWho is Jeannine Riley?\n\nJeannine Brooke Riley was born on 1 October 1940, in Madera, California USA, and is an actress, perhaps still best known for her role as Billie Jo Bradley in the series entitled “Petticoat Junction”, appearing in the first two seasons of the show during the mid-‘60s.\n\nThe Riches of Jeannine Riley\n\nHow rich is Jeannine Riley? As of late-2018, sources estimate a net worth that is at $4 million, earned through a successful career in acting. She’s also appeared in numerous other television shows and feature films throughout her career, and as she continues her endeavors even well into her ‘70s, it is expected that her wealth will also continue to increase.\n\nCareer Beginnings\n\nWhile virtually no information is available about Jeannine’s early life, it is known that she developed an interest in acting at a young age. She started her career in the early 1960s, appearing in small or uncredited roles in projects such as “Five Finger Exercise”. In 1963, she was cast in the sitcom “Petticoat Junction” in the role of Billie Jo Bradley, set in the Shady Rest Hotel run by Kate Bradley, her three daughters and her uncle. The series was created after the success of “The Beverly Hillbillies” and the success of this show led to the spin-off entitled “Green Acres”.\n\nShe stayed with the show until 1965, then decided to leave the series to pursue more film work, replaced by Gunila Hutton and later Meredith MacRae during the latter seasons. Jeannine then started to do film work in the late 1960s, appearing in “The Big Mouth” as Bambi Berman, filmed in San Diego and featuring Frank De Vol as an on-screen narrator.\n\nThe 3 original Bradley Sisters…Betty Jo {Linda Kaye Henning}, Bobbi Jo {Pat Woodell}, and Billie Jo {Jeannine Riley.} Posted by Debbie Spivey on Saturday, January 26, 2019\n\nCareer Prominence\n\nThe following year Riley was cast in “Fever Heat”, which was directed by Russell S. Doughten and starring alongside Nick Adams and Norman Alden. In 1969 she was cast in the film “The Comic”, co-written and co-produced by Carl Reiner and starring Dick Van Dyke, Michele Lee and Mickey Rooney in a film inspired by the end of the silent film era.\n\nAfter that she returned to television, as she was cast in a regular role in the comedy variety series entitled “Hee Haw” during the same year, which was set in fictional rural Kornfield Kounty, and inspired by “Rowan & Martin’s Laugh-In”. The show centered on rural culture and country music, with hosts Buck Owens as well as Roy Clark, but would often feature scantily clad women in stereotypical farmer’s daughters attire, who came to be known as the Hee Haw Honeys. She stayed with the show for three years, and then joined another show in “Dusty’s Trail”, in which she played Lulu McQueen, a western-theme take-off of Ginger Grant from “Gilligan’s Island”, also starring Forrest Tucker and Bob Denver.\n\nLater Career\n\nOver the next few years, Jeannine had small roles in television shows such as “The Wild Wild West”, “Route 66”, and “The Man from U.N.C.L.E.” She then featured in the film “Electra Glide in Blue”, which starred Robert Blake as a motorcycle cop alongside Billy “Green” Bush, and based on the Harley-Davidson Electra Glide motorcycle used by traffic police. During the same year, she had an uncredited role in “The Outfit”, actually appearing as a prostitute in an adaptation of the novel of the same name by Richard Stark under the pseudonym Donald E. Westlake.\n\nAs the years progressed, Jeannine took fewer roles; she was a part of the 1980s project entitled “Lone Star Bar & Grill” as Arlene, and one of her last projects was the 1991 film entitled “Timebomb”, which starred Michael Biehn, Richard Jordan and Patsy Kensit.\n\nPersonal Life\n\nFor her personal life, it is known that Riley married Gary Groom in 1965 but their marriage ended in divorce in 1972. She married once more in 1974 to Irwin Radnitz but it was also a marriage that ended in divorce. There are no reported children from her marriages.\n\nSince retiring from acting work, very little information has been shared about her. One of the reasons is due to the fact that she does not have any accounts on major social media websites. In 2016, a book was released entitled “X Child Stars: Where Are They Now”, written by Kathy Garver and Fred Ascher, which contained a profile of her along with her career. Many sources speculate that since ending her acting career, she focused more on other endeavors, and likely another marriage and a family, but there is no evidence to confirm these speculations.\n\nFacts # Fact 1 Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton. Pictures Movies Actress Title Year Status Character Timebomb 1991 Landlady High Mountain Rangers 1988 TV Series Marge Russell Lone Star Bar & Grill 1983 Arlene Like Normal People 1979 TV Movie Donna (as Jennine Riley) James at 16 1978 TV Series Rochelle Nashville 99 1977 TV Series Dusty's Trail 1973-1974 TV Series Lulu McQueen The Outfit 1973 Prostitute (uncredited) Electra Glide in Blue 1973 Jolene Of Thee I Sing 1972 TV Movie Hotel Chambermaid Love, American Style 1969-1971 TV Series Cindy Lou (segment \"Love and the Traveling Salesman\") / Maria (segment \"Love and the Big Date\") / Marylou Haskins (segment \"Love and the Wild Party\") The Comic 1969 Lorraine Margaret Bell Gomer Pyle: USMC 1969 TV Series Wendy Sparks Fever Heat 1968 Sandy Richards The Wild Wild West 1967 TV Series Aimee Baldwin Li'l Abner 1967 TV Movie Daisy Mae Sheriff Who 1967 TV Movie Betsy The Big Mouth 1967 Bambi Berman The Man from U.N.C.L.E. 1966-1967 TV Series Nina Lillette / Andy Francis Occasional Wife 1966 TV Series Linda Mister Roberts 1966 TV Series My Brother the Angel 1966 TV Series Dolores The Adventures of Ozzie & Harriet 1963-1965 TV Series Pam / Susan Convoy 1965 TV Series Suzie Mae Humbolt Petticoat Junction 1963-1965 TV Series Billie Jo Bradley Strike Me Deadly 1963 Lori Grant The Virginian 1963 TV Series Amelia Pryor Wagon Train 1963 TV Series Susan Forbes My Three Sons 1962 TV Series Kim Route 66 1962 TV Series Molly Cross Father of the Bride 1962 TV Series Five Finger Exercise 1962 Girl (uncredited) Soundtrack Title Year Status Character Petticoat Junction 1963-1965 TV Series performer - 8 episodes Self Title Year Status Character Hee Haw 1969-1971 TV Series Herself The New Truth and Consequences 1970 TV Series Herself The Real Tom Kennedy Show 1970 TV Series Herself The Hollywood Squares 1970 TV Series Guest Appearance The Ed Sullivan Show 1964 TV Series Singer\n\nSource: IMDb"}, {"url": "https://justrichest.com/jeannine-riley-bio/", "page_content": "Jeannine Riley hit it big in the 60s when she scored a role as Billie Jo Bradley in the series Petticoat Junction. She appeared on the show’s first two seasons which lasted up until the mid-1960s and then had memorable stints in a string of other productions, including Route 66, The Man From U.N.C.L, Fever heat, and The Comic.\n\nHowever, she probably stopped enjoying acting as she started to scale back on her appearances in the ’90s and soon, she left the limelight completely. Her last film role was as Landlady in the 1991 film Timebomb. Since this role, Jeannine has not appeared in any film or does she plan to do so soon. However, her exit from the spotlight without officially announcing her retirement has many people wondering where she is now and what lead to her disappearance.\n\nJeannine Riley’s Biography\n\nJeannine Riley was born in Madera, California USA, on 1st October 1940 and named Jeannine Brooke Riley. From the look of things, the actress must’ve been one of the most enigmatic actresses in her time as there is no information about her. Not even her educational history, or childhood, despite the terrific fame she enjoyed during her active years in the film industry. The much that is known about her is that she began her acting career professionally in 1962 with a role in the Rosalind Russell drama Five Finger Exercise.\n\nShe followed the role up with an appearance in Father of the Bride, My Three Sons and Route 66. At age 23, she appeared in the suspense drama Strike Me Deadly with Gary Clarke and Steve Ihnat. She went on to work with Ihnat in The Fourposter – a stage play.\n\nAt this point, she had started to gradually climb the prestigious career ladder. Her performances in Wagon Train and The Virginian helped to solidify her position in the limelight and drew the interest of CBS. It also prepared a stage for her star-making role in Petticoat Junction (1963) as one of the daughters of Kate Bradley – played by Bea Benaderet. The role remains what she is known for to date.\n\nMeanwhile, she was not the first choice for the role. Sharon Tate was chosen for it but the actress lost the slot when she got involved in nude photoshoots, mostly because explicit contents were seen as somewhat a taboo at that time. Luckily, Jeannine was picked to replace Tate when her role was recast.\n\nAfter two seasons of the series, Jeannine Riley left and was replaced by Gunilla Hutton. Even after she left the show, life stayed kind to her acting career as she made more TV appearances including guest-starring on Ozzie and Harriet. She also played a part on the Smothers Brothers Show. In 1967, she secured roles in different films; The Big Mouth, The Wild, Gomer Pyle and a lot more.\n\nThe following year, she worked with Nick Adams in Fever Heat (1968), which is among the last films of the actor before his demise. After a few more acting works in the 1960s, her next appearance was in 1973 – in Electra Glide in Blue. At this point, Hollywood was beginning to accept nudity and Jeannine was willing to show some skin. Her nude scenes in the movie made her an instant star but Jeannine probably wanted something else as her presence on TV started to reduce following this role. In 1991, she left completely after starring in the film, Timebomb.\n\nHer Family\n\nAs mentioned earlier, Jeannine Riley doesn’t let people into matters concerning her private life. So, nothing is known about her siblings, parents, or any other relative. It is, however, known that she has been married twice and none of her marriages survived the test of time. Her first marriage was to Gary Grom in 1965. It failed in 1972 and in less than two years after their divorce, Jeannine married Irwin Radnitz which ended in a similar manner. None of her marriages or past relationships produced a child and since then, her love life has been blurred from the public.\n\nRead Also: Who Was Ann Sothern?\n\nWhere Is Jeannine Riley Now?\n\nNobody is sure of what Jeannine has been up to since 1991 when she left the spotlight. She probably wants nothing more than people knowing less about her as she is not even active on social media either, making it very difficult to dig out anything about her. But there are rumors that she left the acting scene possibly to focus on her family while others have taken the view that she pursued a different career. Nonetheless, these rumors haven’t been confirmed to-this-date. In this regard, her whereabouts remain a mystery."}, {"url": "https://doyouremember.com/157936/jeannine-riley-career-then-now", "page_content": "Billie Jo Bradley was a model of ambition and unbridled hope and awe in Petticoat Junction and none other than Jeannine Riley debuted the role in 1963. Two others would follow, but not before Riley left a permanent mark on the show and set the stage for seven seasons of Billie Jo greatness. But what about Riley herself? What trajectory did her career follow? In short, one her character would have been proud of.\n\nJeannine Riley was born on October 1, 1940, and grew up in California for much of her upbringing after her father left for the Army and her family planted roots in Madera. She learned acting and the ways of show business in the Pasadena Playhouse while also performing ballet. She started working on television and an uncredited role in the 1962 movie Five Finger Exercise before television work arose in greater succession. Early credits included Father of the Bride, My Three Sons, Route 66, and The Beauty Contest. Indeed, her easy, approachable grace helped pave the way for more and more prominence on TV not long into her career.\n\nWhy did Jeannine Riley leave ‘Petticoat Junction’?\n\nHer career had just begun in 1962 and still Jeannine Riley managed to turn some important heads. Namely, CBS producers noticed her while she acted in Wagon Train and The Virginian and as rural shows dominated televisions, they wanted Riley for their next big project: Petticoat Junction. With the rural purge still a decade away, the wholesome series joined the ranks of Beverly Hillbillies and The Andy Griffith Show as a recipe for success. Initially, actress and model Sharon Tate was slated to originate the role of Billie Jo, but after a nude photoshoot, she was deemed too risque for a series sponsored by Ivory Soap; Riley ended up winning the role of 300 other hopefuls.\n\nRiley channeled that easy charisma into her role and won hearts on-screen and off. But just like her character possessed endless aspirations, so too did Riley, and after two years she bowed out of the series to pursue a film career, as well as try out some other shows, including Gilligan’s Island and Hee Haw. She did make it into movies as planned, such as The Big Mouth and Fever Heat. One of her most prominent roles came in 1973 as Lulu McQueen in Dusty’s Trail, which saw Riley as a kind of Ginger Grant in a western reimagining of Gilligan’s Island complete with Bob Denver himself and Lori Saunders.\n\nIt’s about time to be a bolder woman\n\nRiley wanted to break away from roles that cast her on the basis of her looks alone but found this a difficult endeavor. New opportunities grew fewer. Her final film came with 1991’s Timebomb, a science-fiction action movie starring Michael Biehn. She retired that same year but stays involved in the industry in other ways; the 2016 book X Child Stars: Where Are They Now? offers a look at her life and career. Her personal life included marriage first to Gary Groom from 1965 to 1972, then Irwin Radnitz in 1974 until they too divorced.\n\nWhile Riley is not reported to have any children, she has still used her life’s experiences to guide the next generation. In typical Billie Jo fashion, she wants to see women be successful, something she herself is familiar with. In 2020, she penned the book The Bolder Woman: It’s About Time, all about encouraging and instructing women on how they can follow their dreams at any age. “Come along with me as I reveal how I overcame my own fear of aging and being labeled an old woman just because I’d reached a certain number of years,” Riley invites readers. “Your many years of living has brought you this far, so why stop now?”\n\nWe certainly hope Riley doesn’t stop for a long time!"}, {"url": "https://www.playbill.com/article/celebrate-the-61st-anniversary-of-bye-bye-birdie-on-broadway", "page_content": "The original Broadway production of Bye Bye Birdie opened at the Martin Beck Theatre April 14, 1960. The production, directed and choreographed by Gower Champion, played 607 performances before closing October 7, 1961. The musical would garner eight Tony Award nominations, winning four including Best Musical.\n\nBye Bye Birdie tells the story of the MacAfee family and the residents of Sweet Apple, Ohio, who go topsy-turvy when teen idol Conrad Birdie comes to town to serenade one lucky fan before he joins the army. The production featured music by Charles Strouse, lyrics by Lee Adams, and book by Michael Stewart.\n\nclose gallery 0 of Celebrate the 61st Anniversary of Bye Bye Birdie on Broadway Celebrate the 61st Anniversary of Bye Bye Birdie on Broadway 16 PHOTOS Dick Gautier and cast of Bye Bye Birdie Chita Rivera and Dick Van Dyke in Bye Bye Birdie Cast of Bye Bye Birdie Susan Watson in Bye Bye Birdie Dick Van Dyke and Chita Rivera in Bye Bye Birdie Friedman-Abeles/©NYPL for the Performing Arts Next Slide Chita Rivera, Dick Van Dyke, and cast of Bye Bye Birdie Susan Watson, Marijane Maricle, Paul Lynde, and Johnny Borden in Bye Bye Birdie Susan Watson, Dick Gautier, Dick Van Dyke, and cast of Bye Bye Birdie Chita Rivera in Bye Bye Birdie Chita Rivera and cast of Bye Bye Birdie Chita Rivera and cast of Bye Bye Birdie Chita Rivera in Bye Bye Birdie Chita Rivera and cast of Bye Bye Birdie Kay Medford, Dick Van Dyke, Chita Rivera, and dancer in Bye Bye Birdie Dick Gautier and cast of Bye Bye Birdie Dick Gautie and cast in Bye Bye Birdie You may also like From Ragtime to Shuffle Along: Celebrating Brian Stokes Mitchell's Greatest Stage Roles\n\nCelebrate Broadway Legend Chita Rivera\n\nLook Back at The Visit on Broadway Starring Chita Rivera\n\nThe production starred Chita Rivera as Rose Grant, Dick Van Dyke as Albert Peterson, Dick Gautier as Conrad Birdie, Paul Lynde as Mr. MacAfee, Kay Medford as Mae Peterson, Michael J. Pollard as Hugo Peabody, and Susan Watson as Kim MacAfee. Rounding out the cast were Jessica Albright, Ed Becker, Vicki Belmonte, George Blackwell, Johnny Borden, Lynn Bowin, Kenny Burrell, John Coyle, Dick Crowley, Dori Davis, Jerry Dodge, Barbara Doherty, Lada Edmund, Tracy Everitt, Don Farnworth, Bud Fleming, Penny Ann Green, Amelia Haas, Lee Howard, Gary Howe, Will Jordan, Judy Keirn, Allen Knowles, Kasimir Kokich, Ed Kresley, Sharon Lerit, Marijane Maricle, Marissa Mason, Jeannine Masterson, Pat McEnnis, Tony Mordente, Oran Osburn, Louise Quick, Charles Nelson Reilly, Norma Richardson, Jimmy Sisco, Bob Spencer, Dean Stolber, Michael Vita, and Karin Wolfe with Carmen Alvarez and Charles Nelson Reilly as standys and Penny Ann Green and Ed Kresley as swings.\n\nBye Bye Birdie features scenic design by Robert Randolph, costume design by Miles White, lighting design by Peggy Clark, and film sequences by Robert J. McCarty in association with Robert Gaffney, and stage management by Michael Thoma and Edward Nayor. Visit the Playbill Vault for the complete cast and creative team."}, {"url": "https://www.amazon.com/prime-video/actor/Jeannine-Riley/nm0727065/", "page_content": "Jeannine Riley\n\nBlonde bombshell Jeannine Brooke Riley was born in Madera, California on October 1, 1940 and started her movie and TV career in 1962 with an unbilled movie part in the Rosalind Russell drama Five Finger Exercise (1962) and roles on the TV shows \"Father of the Bride\" and \"Route 66,\" not to mention an episode of \"My Three Sons\" aptly entitled \"The Beauty Contest.\" The next year she co-starred with Gary Clarke and Steve Ihnat in the low-budget suspense drama Strike Me Deadly (1963); later that year she and Ihnat also appeared together in the stage play \"The Fourposter.\"\n\nWhile showing off her allure in western series \"Wagon Train\" and \"The Virginian,\" Jeannine came to the attention of CBS producers who were on a TV rural roll with the huge series hits \"The Andy Griffith Show\" and \"The Beverly Hillbillies\". At the time, Hillbilly cast member Bea Benaderet (as Cousin Pearl) had just been given the green light to star in her own bucolic series, Petticoat Junction (1963), playing Kate Bradley, a hotel-owning widowed mother of three beautiful nubile daughters. The flirty role of daughter Billie Jo Bradley was at first given to actress Sharon Tate, but when word came out that she had posed nude in photo shoots, they were forced to dismiss her from the wholesome Ivory-Soap-sponsored series before scandal and controversy could cause damage. The part was recast and Jeannine won the role.\n\nThe actress was ideal as the Daisy Mae-like eldest daughter who attracted men like bees to honey, much to the envy of her impressionable younger sisters. Jeannine played the role for two years before both she and Pat Woodell (as sister Bobbie Jo) opted out of the series. While Jeannine wanted to move into film work, Woodell, who went on to marry and divorce Gary Clarke, Jeannine's film co-star in Strike Me Deadly (1963), desired a singing career. Jeannine and Pat were replaced in 1965 by Gunilla Hutton and Lori Saunders.\n\nWhile the actress continued on with TV guest roles on \"Ozzie and Harriet,\" \"The Man From U.N.C.L.E.,\" and \"Occasional Wife,\" and as a on \"The sometimes-sexy foil on \"The Smothers Brothers Show,\" she found breaking away from her bombshell trappings too difficult and was soon appearing as sexpot Bambi Berman in the Jerry Lewis film vehicle The Big Mouth (1967), and in unsold pilots of Sheriff Who (1967) and Li'l Abner (1967); in this latter she finally got to play the voluptuous Daisy Mae character. Guest episodes of \"The Wild, Wild West\" and \"Gomer Pyle\" also showed a return to familiar territory.\n\nAfter starring with Nick Adams in one of his last films before his untimely death, the action drama Fever Heat (1968), Jeannine showed up in her first quality film showcase, albeit a smaller part, with The Comic (1969), a moving showcase for nimble Dick Van Dyke as a silent screen star. She found an even better role as dancer/barmaid babe Jolene opposite biker Robert Blake in the cult film Electra Glide in Blue (1973), sharing some potent nude scenes.\n\nBack in the country fold on series TV, she appeared in two seasons of the cornpone musical variety show Hee Haw (1969), in which she was featured as a Daisy Mae-like foil in silly skits. A couple years later she was cast in the \"Gilligan's Island\"-inspired TV western Dusty's Trail (1973) with Bob Denver and Forrest Tucker co-starring as Gilligan/Skipper-like characters; Jeannine's Lulu McQueen was a dead-on take on the pneumatic Ginger Grant role. Petticoat Junction (1963) co-star Lori Saunders co-starred in the series as innocent Betsy McGuire, a variation of the Mary Ann character. It lasted one season.\n\nSince then, however, the availability of parts has sharply declined; Jeannine's last credits were the films Lone Star Bar & Grill (1983) and Timebomb (1991)."}, {"url": "https://jeannineriley.com/", "page_content": "Ladies, the question isn’t about how to live longer, it’s about how to live BETTER. And the simple truth is, ‘you’ need to step up and make that happen.\n\nHow? First off, you need to go from just being older, to living Bolder. Secondly, it’s about time you took a closer look at the dreams you set aside so many years ago, or the new ones you’ve been afraid to give a try, just because of what others might say or think.\n\n‘Horse Pucky!” Once I show you how and why you need to do these two things today, you’ll wish I had written this gritty little book 10 years sooner. I know I do. So, go ahead, have some fun and be Bolder."}, {"url": "https://www.nj.com/entertainment/2022/01/how-this-jersey-girl-danced-her-way-into-broadway-history.html", "page_content": "Even in a theatrical season like no other, Lorin Latarro managed to make history.\n\nLatarro, from Fairfield, choreographed or directed four shows this season, some off- and some on Broadway. And, she’s working on Broadway-bound “Almost Famous” and “The Outsiders.” All of this propels her into a rarified class: Women choreographers who had multiple shows staged in the same season.\n\nJust before the pandemic, a record number of women were choreographing Broadway shows.\n\nOver the years, Susan Stroman twice had two shows open in a season, and Agnes de Mille did so three times. But how to count this jagged season with openings, closings, and re-openings? Ultimately, the answer is a precious few women have achieved this height. Latarro had been unaware that she was in these ranks but smiled wide at being in a pantheon with de Mille and Stroman.\n\nNone of this was overnight, she explains to NJ Advance Media over two Zoom interviews.\n\n“I skipped no steps,” Latarro says from a Manhattan studio. “I went from dancer on stage to dance captain, to assisting choreographers to associate choreographic positions and then choreography. The good news about that is that I do not have imposter syndrome. I feel like I know how to solve problems and how to deal with people and make a show happen.”\n\nOver the past year, she choreographed “The Visitor,” “Waitress” (revising some steps since its 2016 premiere), and “Mrs. Doubtfire.” Latarro also directed “Is There Still Sex in the City?” which had a brief run downtown but closed permanently in December when Candace Bushnell tested positive for COVID-19.\n\nIn the one-woman show, Bushnell recounted her career from relationships columnist to best-selling author behind the TV series, two films, and a new chapter of “Sex and the City” now streaming. The director’s touches elicited the best responses from the audience.\n\nWhenever Bushnell mentioned her shoes (Carrie Bradshaw is the fictionalized Bushnell, so the shoe love is real), the stage’s back wall featuring exquisite footwear would light up. When Bushnell’s dogs trotted on stage, that, too, was Latarro’s idea.\n\nLorin Latarro choreographs and directs. In December, she did both for a flash birthday dance for her pal Hank Azaria to surprise his wife, KatieWright, in Central Park.Matthew Murphy\n\nWithin days of “Sex” shuttering, “Waitress” also closed early because of breakthrough COVID cases in the company. Admittedly, it was a jolt.\n\n“It’s sad to tell a cast that you’re not coming back on Tuesday,” Latarro says. “It’s not a normal way to close the show. The most heartbreaking of closings I’ve ever had have always had at least two weeks’ notice.”\n\nThough saddened, she was focused on what’s next. Listening to Latarro, it’s clear she’s challenging herself to see what else she can create, how to use dance to tell a story.\n\nLatarro, 43, became enchanted with Broadway at her first show, “The King and I,” and followed that with “Annie.”\n\nGrowing up in Essex County, her dad, dentist, John Campolattaro, and mom, Eileen Campolattaro, enrolled Latarro in her first dance lessons at what was Miss Sandy School of Dance with Sandra Coyte. Latarro also studied at Dance Theater in Fairfield and The New Jersey School of Ballet in Florham Park before her parents started driving her into Manhattan for classes at Broadway Dance Center.\n\nLatarro started to choreograph while at Juilliard, then danced with Momix Inc.\n\n“It was really groupthink,” she says of that company. “You get to really be creative.”\n\nDancer and choreographer Lorin Latarro has studied many genres of dance and still takes ballet class.\n\nShe began landing Broadway roles, from her debut as a replacement in the ensemble of 1999′s “Kiss Me Kate” to being chosen for the original cast of the 2002 version of “Man of La Mancha” and performing in revivals of “A Chorus Line,” and “Guys and Dolls.”\n\nBy 2010, Latarro added associate choreographer to her credits and has kept going. By the time she worked on “Scandalous,” a short-lived musical from Kathie Lee Gifford, Latarro had earned the rank of the choreographer.\n\nEven in some shows best forgotten, like “Scandalous,” or those that received mixed reviews, like “Mrs. Doubtfire,” the choreography stood out. “Doubtfire,” which opened in December, is on hiatus because of the omicron surge. It’s scheduled to return March 15.\n\nTo flesh out the character of Mrs. Doubtfire, Robin Williams, who starred in the movie, had studied the mannerisms of a beloved Juilliard security guard, Nora. Latarro, another Juilliard grad, also knew her.\n\n“Nora had a very particular gait, and everything about her was very particular,” Latarro says. “Nora is burned in my head as Mrs. Doubtfire, for sure.”\n\nLatarro’s choreography is not easily pigeon-holed. Even in Doubtfire, she wove in tap, traditional Broadway moves, hip-hop and flamenco. Ballet is evident in certain lifts, swing filters into some shows, as do modern steps. She has studied and danced it all.\n\nShe well remembers what it was like being that kid who just wanted to dance and offers a bit of advice for young dancers.\n\n“You can’t fake dancing,” says the woman who still takes class and has her 3-year-old daughter in ballet. “And that’s one of the reasons I love it. Just do the work, be happy to be there. If you just stay with it, the more dance styles you can do, the more you will be hired.\n\n“And for choreography, it really is about asking the question of why and what do I want to say about this?” she adds. “How do I want to physicalize this idea?”\n\nEven with 16 Broadway credits to her name, Latarro retains the enthusiasm of the Fairfield girl mesmerized by those bright lights.\n\n“I love Broadway,” she Latarro says. “I love theater, and this was a dream come true for me. And it still is. It’s still a dream every day.”\n\nJacqueline Cutler may be reached at jacqueline.cutler@gmail.com. Find NJ.com on Facebook."}, {"url": "https://www.connollycove.com/old-hollywood-late-1920s-1960s-the-golden-age-of-hollywood/", "page_content": "When you hear Old Hollywood your mind automatically goes to the glamour and the glitz of the Golden Age of Hollywood.\n\nAlthough not many of us grew up in this era, it is a time in history that is still honoured today. The legends of Old Hollywood will live on forever with their names on the Hollywood walk of fame, their faces on our screens and their memories embedded in our minds.\n\nThe Old Hollywood sign was originally Hollywoodland\n\nHistory of Old Hollywood\n\nThe beginning of the Old Hollywood era is marked by the introduction of sound films. Changing from silent films to “the talkies” was a changing point in Hollywood and with it came a rise to global cinema.In 1927, “The Jazz Singer” was the first film to use synchronized dialogue and it marked the beginning of the end for silent films. The Academy Awards also began that same year and Warner Bros. received an Honorary Award for their pioneering on “The Jazz Singer”. The movie was not nominated as Best Picture as it was deemed unfair to put a “talkie” up against silent movies.\n\nThe Old Hollywood era is understood to be the time when Hollywood dominated the film industry. Hollywood was the American dream for actors and actresses who hoped to make it onto the big screen. Old Hollywood is considered one of the most successful eras of filmmaking, with endless classics produced during this time. Sound films brought stardom to Hollywood.\n\nDuring the Golden Age of Hollywood there were five main studios that were producing movies in Hollywood. Each studio used prefered actors and actresses and also often followed a certain genre of film in the majority of their movies. You will recognise these studio names from your favourite Old Hollywood movies;\n\nMetro-Goldwyn-Mayer or MGM : MGM was the biggest studio during this time and it was ran by Louis B. Mayer alongside Irving Thalberg. Mayer is also credited for organising the very first Academy Awards in 1927. During the Golden Age of Hollywood, MGM produced Academy Award winning films such as Gone with the Wind, The Wizard of Oz, Ben-Hur and West Side Story. MGM is still today one of the biggest studios still producing many Award winning films after the Old Hollywood era, including The Silence of the Lambs, Rain Man and Dances with Wolves. It is also responsible for the incredibly successful film franchises James Bond and Rocky. The roaring lion is the symbol for MGM.\n\nParamount Pictures : Paramount Pictures have been around for over 100 years and they are the last remaining major studio still based in Hollywood out of the five major studios that once stood during the Golden Age of Hollywood. Paramount Pictures was founded by Adolph Zukor and W. W. Hodkinson and the famous Paramount logo that we have come to know so well was inspired by a mountain peak in Hodkinson’s childhood home and the 22 stars represent the 22 film stars that were signed with Paramount. Some of Paramounts most successful films during the Golden Age of Hollywood were The Ten Commandments, Sunset Boulevard, The Greatest Show on Earth and White Christmas.\n\nWarner Brothers : Warner Bros. was founded in 1923 by four brothers, Harry, Albert, Samuel and Jack Warner. Warner Brothers quickly made a name as one of the Big Five in Hollywood when they revolutionized the film industry by producing The Jazz SInger in 1927. Warner Bros is well known for contributing to many classic films throughout the Golden Age of Hollywood, for example, Casablanca, Rebel Without a Cause and My Fair Lady.\n\n20th Century Fox : 20th Century Fox was founded in 1935 after the mergence of Twentieth Century Pictures, which was founded by Joseph Schenck and Darryl F. Zanuck and the Fox Film Corporation, which was founded by William Fox. 20th Century had stars such as Shirley Temple and Betty Grable featured in their musicals. Well known Old Hollywood films that 20th Century Fox produced are The Grapes of Wrath, The King and I and South Pacific, All About Eve and Cleopatra. 20th Century Fox was well known for their musicals and westerns.\n\nRKO: Radio-Keith-Orpheum, RKO Pictures was founded in 1928 when David Sarnoff, general manager of RCA and Joseph Kennedy’s FBO merged together. When RKO formed they declared that they would only make films with sound and that they did. RKO had stars such as Fred Astaire, Ginger Rogers, Katharine Hepburn and Cary Grant signed with them for movies. Some recognisable films that RKO are responsible for during the Golden Age of Hollywood are King Kong, Citizen Kane, Top Hat and Notorious. RKO also distributed films such as It’s a Wonderful Life, Snow White and the Seven Dwarfs and Pinocchio\n\nAlthough it didn’t make the Big Five during the Golden Age of Hollywood, Universal Pictures were also in operation at the time and produced some classics.\n\nUniversal : Universal Pictures was founded in 1912 by Carl Laemmle, Mark Dintenfass, Charles O. Baumann, Adam Kessel, Pat Powers, William Swanson, David Horsley, Robert H. Cochrane, and Jules Brulatour and it is the fourth oldest major film studio in the world. During the Golden Age of Hollywood, Universal Pictures produced greats such as To Kill a Mockingbird, The Birds, Spartacus and Dracula.\n\nOld Hollywood Glamour\n\nIt has been 60 years since the Golden Age of Hollywood, yet we are still trying to copy and recreate that stunning Hollywood glamour that encompassed Old Hollywood. Old Hollywood Glamour was elegance, sophistication and style. The biggest Hollywood stars were always dressed up to the nines and their casual wear would be nowhere near what we would consider casual today. Make-up, hair and clothes were always perfect and stars had their own unique looks which portrayed their personalities.\n\nStars went to great lengths in order to achieve and maintain Hollywood’s standards of how they should look, from hair transplants, dying their hair and changing their brows. Old Hollywood glamour was about simple, elegant make-up which showed the best version of the stars. It was about tiny waists and stylish clothes. The Old Hollywood glamour look usually looked far more glamorous than the actually reality of it.\n\nSome great books about Old Hollywood glamour are “Timeless: A Century of Iconic Looks” by Louise Young, “Styling the Stars: Lost Treasures from the Twentieth Century Fox Archive” by Angela Cartwright and Tom McLaren, “Costume Design in the Movies: An Illustrated Guide to the Work of 157 Great Designers” by Elizabeth Leese and “Edith Head’s Hollywood” by Paddy Calistro.\n\nOld Hollywood Stars\n\nDuring the Golden Age of Hollywood in order to become a star you had to have a combination of acting, dancing and singing skills. If you couldn’t do all three then you had to be incredible good in one field or just have a face made for the screen. Old Hollywood actors and actresses were idolised and became stars, they saw stardom that no other actor will ever see. The glamour, the glitz and the drama was on another level and it was these stars that started the Hollywood Walk of Fame.\n\nOld Hollywood Actresses\n\nMarilyn Monroe was and still is today a pop cultural icon from the Golden Age of Hollywood\n\nAudrey Hepburn\n\nBreakfast at Tiffany’s is one of the most iconic films to come from Old Hollywood\n\nAudrey Hepburn was a Belgian-born actress who rose to stardom after her outstanding performance as Gigi in Broadway’s “Gigi”. Hepburn trained as a ballet dancer in her youth, the elegance, posture and determination she learnt from her lessons never left her. Her first film role was Roman Holiday (1953) in which she won the Academy Award for Best Actress. Audrey Hepburn is one of the most recognisable faces from the Golden Age of Hollywood.\n\nMovies : Breakfast at Tiffany’s, My Fair Lady, Roman Holiday, Sabrina, Funny Face\n\nBooks : “Enchantment: The Life of Audrey Hepburn” by Donald Spoto, “Audrey & Givenchy: A Fashion Love Affair” by Cindy De La Hoz, “Audrey Hepburn Treasures” by Ella Erwin, et al., “Audrey: The 50’s” by David Wills\n\nSophia Loren\n\nSophia Loren is an Italian film actress who earned international success for her role in classic Hollywood movies. Sophia Loren was widely recognised for her beauty and acting talents, delivering both comedic and dramatic performances throughout her career. Sophia Loren won an Academy Award in 1962, she made history as the first performer to win an Academy Award for a foreign-language role with her performance in the French film Two Women.\n\nMovies : Houseboat, It Started in Naples, The Pride and the Passion, Yesterday, Today and Tomorrow.\n\nBooks : “Sophia Loren: A Life In Pictures” by Candice Bal, “Yesterday, Today, Tomorrow: My Life” by Sophia Loren, “Sophia Loren’s Recipes & Memories” by Sophia Loren\n\nAva Gardner\n\nAva Gardner was an American film actress who was scouted by MGM because of her utter beauty. Throughout her acting career, Ava went on to perform in a huge range of films from musicals, romance, drama and sci-fi. Her performance in Mogambo was recognised and she was nominated for an Academy Award for Best Actress. Aside from her acting career, Ava Gardner was also in the spotlight for her highly publicised marriage to singer Frank Sinatra.\n\nMovies : The Killers, Mogambo, Show Boat, The Barefoot Contessa, On The Beach\n\nBooks : “Ava Gardner: The Secret Conversations” by Ava Gardner and Peter Evans, “Ava Gardner (Turner Classic Movies): A Life in Movies” by Kendra Bean, “Ava Gardner: Love is Nothing” by Lee Server\n\nMarilyn Monroe\n\nThis number from Old Hollywood has been recreated numerous times.\n\nMarilyn Monroe is probably the first star that comes to mind when most of us think about Old Hollywood. She is without a doubt one of the biggest pop culture icons in our time and although her life wasn’t very long her legacy will live on forever. Norma Jeane began her career as a model and then changed her name to Marilyn Monroe as she pursued an acting career. In the height of her career, Monroe tragically passed away from a supposable drug overdose. Monroe’s performances have been forever stuck in our minds and are constantly recreated such as her Diamonds are a Girl’s Bestfriend number and that iconic scene in the Seven Year Itch.\n\nMovies : Some Like It Hot, Gentleman Prefer Blondes, How To Marry A Millionaire, The Seven Year Itch, The Misfits.\n\nBooks : “Marilyn Monroe: Metamorphosis” by David Wills, “Marilyn: Norma Jeane” by Gloria Steinem, “Marilyn Monroe: The Private Life of a Public Icon” by Charles Casillo\n\nElizabeth Taylor\n\nElizabeth Taylor’s sixty year acting career makes her one of the biggest Old Hollywood icons. Throughout her career, Elizabeth Taylor’s talent was recognised by five Oscar nominations and two Best Actress Award wins. She became the first actor to negotiate a $1 million dollar contract for her role in Cleopatra. Despite her talent, Taylor’s acting career wasn’t the only thing that the public focused on, there was huge interest in Elizabeth’s personal life in particular her eight marriages to seven different men.\n\nMovies : Cleopatra, Cat On A Hot Tin Roof, A Place in The Sun, Who’s Afraid of Virginia Woolf, Giant\n\nBooks : “Liz: An Intimate Biography of Elizabeth Taylor” by C. David Heymann, “Elizabeth: The Biography of Elizabeth Taylor” by J. Randy Taraborrelli, “Elizabeth: The Life of Elizabeth Taylor” by Alexander Walker\n\nVivien Leigh\n\nVivien Leigh was a British film actress and is best known for her portrayal of Scarlett O’Hara in Gone with the Wind, which earned her the Academy Award for Best Actress. Not only did she win this award once but twice, she also won the Academy Award for Best Actress for her role as Blanche in A Streetcar Named Desire. In both roles Leigh played strong-willed Southern women.\n\nMovies : Gone With The Wind, A Streetcar Named Desire, Waterloo Bridge, Anna Karenina\n\nBooks : “Vivien Leigh: A Biography” by Anne Edwards, “Truly Madly: Vivien Leigh, Laurence Olivier and the Romance of the Century” by Stephen Galloway, “Vivien Leigh” by Hugo Vickers\n\nGrace Kelly\n\nGrace Kelly’s acceptance speech at the 1955 Oscars for winning The Country Girl Best Actor during the Golden Age of Hollywood\n\nGrace Kelly’s Old Hollywood story is unlike any other. After a highly successful acting career throughout the 1950’s, acting alongside, Frank Sinatra, Cary Grant and Bing Crosby to name a few, working with Alfred Hitchcock and winning the Academy Award for Best Actress in The Country Girl, Grace Kelly decided to leave Hollywood behind for love. In 1956, Grace Kelly became Princess Grace of Monaco when she married Prince Rainier III of Monaco. Her final film which was released that same year was High Society. In 1982, Grace Kelly tragically died after suffering from a stroke while driving her car in France.\n\nMovies : The Country Girl, To Catch A Thief, High Society, Rear Window\n\nBooks : “Remembering Grace” by Howell Conant, “Grace Kelly: A Life From Beginning to End” by Hourly History, “High Society: The Life of Grace Kelly” by Donald Spoto\n\nIngrid Bergman\n\nIngrid Bergman was a Swedish actress who took Hollywood by a storm with her outstanding presence onscreen. Bergman starred in some of Hollywood’s most iconic films and her performance in these films was recognised by many Academy Award nominations. It was her performances in Gaslight which got her first Academy Award for Best Actress. Ingrid Bergman was banned from Hollywood due to her affair with the Italian director Roberto Rossellini, however after a few years she made the comeback of all comebacks with her performance in Anastasia which earned her second Academy Award for Best Actress.\n\nMovies : Gaslight, Casablanca, Joan of Arc, Notorious, Anastasia, Indiscreet\n\nBooks : “Ingrid: Ingrid Bergman, a Personal Biography” by Charlotte Chandler, “Ingrid Bergman: My Story ” by Ingrid Bergman\n\nMaureen O’Hara\n\nMaureen O’Hara is an Irish-American Actress who began her acting career at the Abbey Theatre in Dublin. Maureen O’Hara was known for playing strong-minded women on the big screen and performed in many western and action movies, performing her own stunts. Maureen O’Hara had great on-screen chemistry with John Wayne and starred alongside him in five films throughout her career.\n\nMovies : The Quiet Man,The Hunchback Of Notre Dame, Miracle on 34th Street, The Parent Trap, McLintock!\n\nBooks : “Tis Herself: A Memoir Book” by John Nicoletti and Maureen O’Hara, “Maureen O’Hara: The Biography” by Aubrey Malone\n\nRita Hayworth\n\nRita Hayworth was one of the best actresses, dancers and singers Old Hollywood ever saw\n\nRita Hayworth was an American film actress, singer and dancer who rose to fame as a result of her breakout role in “Gilda”. Rita’s persona in Gilda and her beauty gave her the nickname of “The Love Goddess”. Her glamorous looks only added to her immense talent on the screen. Although Rita Hayworth has a successful career her personal life lacked the love she yearned for with all of her marriages ending in divorce.\n\nMovies : Gilda, Cover Girl, Pal Joey, The Lady From Shanghai, Separate Tables, Only Angels Have Wings\n\nBooks : “If This Was Happiness: A Biography of Rita Hayworth” by Barbara Leaming, “Rita Hayworth: A Memoir” by James Hill, “The Life of Rita Hayworth” by Susan Barrington\n\nLauren Bacall\n\nLauren Bacall was an American actress who began her career as a model and became an overnight sensation after her debut film To Have And Have Not. It was while filming this movie, Lauren met her husband Humphrey Bogart. The pair had a very loving marriage however their romance was put to an end when Bogart sadly passed away 11 years into their marriage. Bacalls talent was recognised with Academy Award nominations and Tony award victories.\n\nMovies : The Big Sleep, To Have And Have Not, How to Marry A Millionaire, Designing Woman\n\nBooks : “Lauren Bacall by Myself” by Lauren Bacall, “By Myself and Then Some” by Lauren Bacall\n\nAnn-Margret\n\nAnn-Margret is a Swedish American actress who always had a love for dancing from a very young age. This love for dance allowed Ann-Margret to pursue theatre and eventually pursue a career in acting. In her most famous films, Ann-Margret starred alongside Elvis Presley, the pair had great chemistry on screen and were fan favourites.\n\nMovies : Viva Las Vegas, Pocketful of Miracles, The Cincinnati Kid, Bye Bye Birdie\n\nBooks : “Ann Margret: My Story” by Ann Margret, “Ann Margret: A Dream Come True : A Photo Extravaganza and Memoir” by Neal Peters\n\nGreta Garbo\n\nGreta Garbo transitioned from silent films to “talkies” and was one of the greatest stars of all time during the Golden Age of Hollywood\n\nGreta Garbo was a Swedish-American actress and is regarded by many the greatest actress ever on screen. Greta Garbo began her career as a silent film actress and she transitioned well into the “talkies” with “Anna Christie” being the first movie that “Garbo talks!” At the age of 36, Garbo decided to leave Hollywood after making only 28 movies. In the movie Grand Hotel, Garbo’s character mutter the famous line” I just want to be alone”, a line that was fitting to Greta Garbo herself.\n\nMovies : Ninotchka, Grand Hotel, Camille, Anna Karenina , Anna Christie\n\nBooks : “Garbo: Her Life, Her Films” by Gottlieb, “Greta Garbo: A Life Apart” by Karen Swenson\n\nNatalie Wood\n\nNatalie Wood started acting from the young age of five and successfully made it into the film industry as an adult, a transition not many child actors succeed in. Her breakout role as a child actor was Miracle on 34th Street and her role in Rebel Without a Cause showed her talents as a teenage actress, even earning an Academy Award nomination for her role as Judy. Not only did Wood act but she also sang and performed in musicals’ West Side Story and Gypsy. Wood tragically died in 1981 when she supposedly drowned while vacationing on her yacht, although the events around her death have never been fully solved.\n\nMovies : The Great Race, Splendour in the Grass, Miracle On 34th Street, Rebel Without A Cause, West Side Story\n\nBooks : “Natalie Wood: The Complete Biography” by Suzanne Finstad, “Natasha: The Biography of Natalie Wood” by Suzanne Finstad, “Natalie Wood (Turner Classic Movies): Reflections on a Legendary Life” by Manoah Bowman\n\nJoan Crawford\n\nJoan Crawford began her career as a dancer on Broadway and in nightclubs. Her breakthrough performance was Mildred Pierce in 1945 for which she won the Academy Award for Best Actress. Joan Crawford was also given wide recognition for her role on What Ever Happened To Baby Jane, which she starred alongside Bette Davis. The series “Feud” came out in 2017, retelling the famous feud that the two world famous actors had while on set. A year after Crawford’s death, her adoptive daughter released a memoir “Mommie Dearest” depicting Crawford as an abusive mother.\n\nMovies : What Ever Happened to Baby Jane, Mildred Pierce, The Woman, Johnny Guitar\n\nBooks : “Conversations with Joan Crawford” by Roy Newquist, “Joan Crawford: A Biography” by Bob Thomas\n\nDoris Day\n\nDoris Day’s musicals are still much loved today as they were during the Golden Age of Hollywood\n\nDoris Day appeared in many classic films and musicals throughout her career. Doris Day began her career as a signer and then went on to become an actress. She was able to combine her two talents in many of her movies. In many of her films Doris Day played strong witted wholesome characters who knew their own mind. She starred alongside Rock Hudson in three of her most popular films. She also had her very own tv show “The Doris Day Show”.\n\nMovies : Calamity Jane. Pillow Talk, That Touch of Minx, Send Me No Flowers, Lover Come Back\n\nBooks : “Doris Day: Her Own Story” by A. E. Hotchner, “Doris Day: Images of a Hollywood Icon” by Michael Feinstein\n\nBette Davis\n\nBette Davis began her acting career on stage in Broadway and had a rocky transition from the stage to screen. After Universal dropped her, Warner Brothers saw Davis’ potential as an onscreen star and took her on. However, Bette Davis wasn’t given any roles that allowed her to truly shine as the star she was until she begged Warner Bros to lend her out to RKO and took Warner Bros on in a legal battle. Bette Davis won two Oscars throughout her career.\n\nMovies : What Ever Happened To Baby Jane, All ABout Eve, Now,Voyager, Mr. Skeffington\n\nBooks : “Miss D & Me: Life with the Invincible Bette Davis” by Kathryn Sermak, “The Lonely Life: An Autobiography” by Bette Davis, “This ‘N That” by Bette Davis\n\nKatharine Hepburn\n\nKatharine Hepburn was an American film actress who cemented her name in Old Hollywood by earning twelve Academy nominations and achieving a record of four Academy awards for her outstanding performances. This is an achievement no other actor has been able to match since. Over her 60 year career, she starred alongside her love Spencer Tracy in nine films.\n\nMovies : Long Day’s Journey Into Night , The African Queen,The Philadelphia Story, Guess Who’s Coming to Dinner\n\nJudy Garland\n\n“Somewhere Over The Rainbow” is one of the most iconic songs from Old Hollywood\n\nJudy Garland is probably best known for her role in The Wizard of Oz in which she played the leading role of Dorothy Gale. She earned the Academy Award for this amazing performance and stunning vocals with “Somewhere over the Rainbow”. Garland’s Old Hollywood story is that of a tragic tale. Throughout her short career she had a strong onscreen partnership with Mickey Rooney. Judy struggled throughout her career and tragically died of an overdose way before her time.\n\nMovies : The Wizard of Oz, A Star is Born, Meet Me in St. Louis, Easter Parade\n\nBooks : “Get Happy: The Life of Judy Garland” by Gerald Clarke, “Judy Garland on Judy Garland: Interviews and Encounters” by Randy L Schmidt\n\nOlivia de Havilland\n\nOlivia de Havilland was born in Japan and moved over to America when she was still a child. After acting on theatre in A Midsummer’s Night Dream, De Havilland landed her first film role in the film adaptation of the Shakespeare play. Olivia de Havilland had a total of nine on-screen appearances with Australian actor, Errol Flynn. Both herself and her sister Joan Fontaine won an Oscar for Best Actress, de Havilland won the Academy Award for her performance in the Heiress and in To Each His Own. De Havilland is remembered for her outstanding talent but also for taking on the studio system when she went against and beat Warner Bros in a legal battle over her contract extension.\n\nMovies : Gone With The Wind, The Heiress, The Adventures of Robin Hood, Captain Blood\n\nBooks : “Olivia de Havilland and the Golden Age of Hollywood” by Ellis Amburn, “Every Frenchman Has One” by Olivia de Havilland, “Olivia de Havilland: Lady Triumphant” by Victoria Amador\n\nGina Lollobrigida\n\nGina Lollobrigida is an Italian actress who wowed Hollywood with her beauty and talents. Gina began her career as a model and soon made her way up the acting ranks. After starring in many European films she landed her debut Hollywood film with Beat the Devil. Lollobrigida acted in many genres of film but had great success in her comedic films such as Come September and Buona Sera, Mrs. Campbell. At the age of 95, Gina is showing no signs of slowing down, with her recently announcing her plans to run in the next general election.\n\nMovies : Come September, The Hunchback of Notre Dame, Trapeze, Solomon & Sheba, Buona Sera, Mrs. Campbell\n\nBooks : “Imperial Gina: Strictly Unauthorized Biography of Gina Lollobrigida” by Luis Canales, “Italia mia” by Gina Lollobrigida\n\nShirley Temple\n\nShirley Temple was an incredible tap dancer, singer and performer and was one of Old Hollywood’s greatest child stars\n\nShirley Temple is Old Hollywood’s biggest child star starring in many moving musicals. Temple’s dancing numbers and spirited singers got people through the hardships of the Great Depression and her appearance onscreen was a ray of sunshine and escapism for the people of America. Shirley Temple failed to make the transition from childhood stardom to acting as an adult and her acting career came to an end as her teenage years did.\n\nMovies : Heidi, The Little Princess, Captain January, The Little Colonel\n\nBooks : “Child Star: An Autobiography” by Shirley Temple Black, “Shirley Temple: American Princess” by Anne Edwards, “The Little Girl Who Fought the Great Depression: Shirley Temple and 1930s America” by John F. Kasson\n\nJane Russell\n\nJane Russell was one of Old Hollywood’s greatest stars showing her acting talents, dancing skills and vocal capabilities in a range of her movies. Russell rose to fame from her role in The Outlaw and is probably best known for playing the role of Dorothy Shaw alongside Marilyn Monroe in Gentlemen Prefer Blondes. Jane Russell went on to have a career in the music industry and even appeared on Broadway.\n\nMovies : Gentlemen Prefer Blondes, The Paleface, Son Of Paleface, His Kind of Woman\n\nBooks : “Jane Russell: My Path and My Detours : An Autobiography ” by Jane Russell, “Mean…Moody…Magnificent!: Jane Russell and the Marketing of a Hollywood Legend” by Christina Rice\n\nTippi Hedren\n\nTippi Hedren is an Old Hollywood American actress and former fashion model who played the leading lady in two of Hitchcock’s famous blockbusters, The Birds and Marnie. At the age of 92, Tippi Hedren’s career has lasted for over 70 years starring in many films and tv series throughout. Tippi Hedren’s acting talents were passed down to her family. She is the mother to Melanie Griffith, a famous actress and film producer and her granddaughter is Dakota Johnson, who has also starred in top Hollywood films.\n\nMovies : The Birds, Marnie, A Countess From Hong Kong,\n\nBooks : “Tippi: A Memoir” by Tippi Hedren\n\nDeborah Kerr\n\n“Getting to know you” was one of the most popular songs from the movie “The King and I”\n\nDeborah Kerr was a British actress who was known for her roles in some of Old Hollywood’s most iconic movies. After a successful start to her acting career in British cinema , Kerr decided to make the move to America’s MGM at the age of 26. Deborah was cast-typed as proper English lady in her roles until she took a risk and took on the role of an adulteress in An Affair to Remember, which was a huge success. In the film, From Here to Eternity, Kerr and Burt Lancaster’s famous beach scene kiss became one of the most iconic scenes in Old Hollywood history.\n\nMovies : From Here To Eternity, An Affair to Remember, The King and I, Black Narcissus\n\nBooks : “Deborah Kerr: A Biography” by Michelangelo Capua, “Deborah Kerr” by Sarah Street\n\nLucille Ball\n\nThe fun-loving and bubbly Lucille Ball will forever be remembered as Old Hollywood’s favourite comedic actress. Although she starred in many hit comedy movies, Lucille Ball is probably best known for her highly popular tv programme, I Love Lucy. Lucille acted alongside her husband Desi Arnaz. The show was a comedic take on their own lives. Not only were the couple the stars of the show but it was their own production company Desilu that produced it. After the couple divorced, Lucille bought Arnaz’s share in the company and she became the first woman to lead a Hollywood studio.\n\nMovies : Yours, Mines & Ours, Stage Door, Lured, Five Came Back, The Big Street\n\nBooks : “Love Lucy” by Lucille Ball, “Lucille: The Life of Lucille Ball” by Kathleen Brady\n\nGinger Rogers\n\nWhen you hear Ginger Rogers your mind goes immediately to Fred Astaire, whom she danced many a times with on the screen. The famous dancing duo appeared in a total of ten movies together. Ginger Rogers was an American, singer, actress and incredible dancer. Although best known for her dancing, Rogers won an Academy Award for her performance as Kitty Foyle in the film by the same name. Winning this award recognised Roger as not only a dancer but a dramatic actor.\n\nMovies : Top Hat, Swing Time, Kitty Foyle, 42nd Street, Flying Down to Rio\n\nBooks : “Ginger: My Story” by Ginger Rogers, “Ginger Rogers: The Shocking Truth!” by Harry Harrison, “Fred Astaire and Ginger Rogers: The Story of Hollywood’s Most Famous Dancers” by Charles River Editors\n\nDebbie Reynolds\n\nOld Hollywood trio, Debbie Reynolds, Donald O’Connor and Gene Kelly had excellent onscreen chemistry\n\nDebbie Reynolds was an American actress, singer and dancer who let her charming personality to shine on the screen. Reynolds amazing talent was often overshadowed by her dramatic personal life during the 1950’s when her husband Eddie Fisher left her and their two children for Elizabeth Taylor, causing one of the biggest scandals in Hollywood. While her career was striving, Reynolds had no luck with her love life, with her second husband Harry Karl who gambled away all her money leaving Debbie to declare bankruptcy not long after. Her acting talents spread to her children, with her daughter Carrie Fisher starring as Princess Leia in Star Wars.\n\nMovies : Singing in the Rain, My Six Loves, How The West Was Won, The Tender Trap, The Unsinkable Molly Brown\n\nBooks : “Unsinkable” by Debbie Reynolds, “Debbie: My LIfe” by Debbie Reynolds, “Make ‘Em Laugh: Short-Term Memories of Longtime Friends ” by Debbie Reynolds\n\nKim Novak\n\nKim Novak is one of the few Old Hollywood stars that is still alive today. Kim Novak is probably best known for her iconic role in Alfred Hitchcock’s Vertigo, in which she played the role of two woman. She acted alongside singer Frank Sinatra in two films, Pal Joey and The Man With The Golden Arm. Kim Novak is now retired from acting and enjoys painting and is a mental health activist at the age of 89.\n\nMovies : Vertigo, Pal Joey, Kiss Me Stupid, The Man With The Golden Arm, Picnic, Bell Book and Candle\n\nBooks : “Kim Novak: Reluctant Goddess” by Brown Peter Harry\n\nEva Marie Saint\n\nEva Marie Saint is an American film actress who has had a career in the film industry spanning over seven decades. Eva Marie Saint began her career on the best foot possible, with her performance in her debut film On The Waterfront, starring alongside Marlon Brando earned her the Academy Award for Best Supporting Actress.Her most memorable character was as one of “Hitchcock’s Blondes” playing Eve Kendal in North By Northwest. At 98 years of she is one of the longest living Academy Award winners.\n\nMovies : North By Northwest, By The WaterFront, Grand Prix, Exodus\n\nHattie McDaniel\n\nHattie McDaniel was overcome with emotion when accepting her first historic Oscar during the Golden Age of Hollywood\n\nHattie McDaniel made history by becoming the first African American to be nominated for and win an Oscar for her outstanding performance in Gone with the Wind in which she played the role as Mammy. When Hattie lost her job headlining at a nightclub, Sam Pick’s Suburban Inn due to the Great Depression, she saw no other option than to get a one way ticket to Hollywood. Performing was in the McDaniel’s blood with Hattie’s sister Etta and brother Sam also successful Hollywood actors.\n\nMovies : Gone With The Wind, The Little Colonel, Showboat, Vivacious Lady, Alice Adams\n\nBooks : “Hattie McDaniel: Black Ambition, White Hollywood ” by Jill Watts, “Hattie: The Life of Hattie McDaniel” by Carlton Jackson\n\nVera-Ellen\n\nVera-Ellen was an American film actress and dancer, starring in many musicals throughout her career. In 1939, Vera-Ellen made her Broadway debut in Very Warm May and went on to perform in other Broadway musicals. It was her Broadway presence that drew the attention of MGM and began Vera-Ellen’s Hollywood career. Vera-Ellen only appeared in 14 Hollywood films, however those she performed in are still remembered today, starring alongside the best Hollywood actors such as Danny Kaye, Gene Kelly and Fred Astaire. The memorable Christmas classic, the musical White Christmas still remains a fan favourite and is shown every year on our tv screens.\n\nMovies : On The Town, White Christmas, Three Little Words, The Belle Of New York\n\nBooks : “Vera-Ellen: The Magic and the Mystery” by David Soren\n\nJane Fonda\n\nJane Fonda is still a very much loved personality in Hollywood, who at the age of 84 is still acting and is a prominent activist. Jane is the daughter of Henry Fonda, a famous Old Hollywood star who was known for his role in The Grapes of Wrath. Fonda began her career as a model and then pursued acting. During her acting career, Fonda performances were recognised with nominations and two Oscar win during the 70’s winning Best Actress for Klute and Coming Home. Fonda went on to release highly successful fitness videos in the 80’s. Besides her acting career, Fonda is known for being a political and environmental activist and describes herself as a feminist.\n\nMovies : Raging Kitty, The Chase, Barbarella, The Chapman Report, Walk on the Wild Side\n\nBooks : “My Life So Far” by Jane Fonda, “Jane Fonda: The Private Life of a Public Woman” by Patricia Bosworth\n\nJulie Andrews\n\nSupercalifragilisticexpialidocious is one of the most famous Old Hollywood songs from Mary Poppins\n\nJulie Andrews is a British actress and singer who made quite the name for herself in Old Hollywood. Julie Andrews made her radio debut in 1946 at just 10 years old with her stepfather Ted Andrews in the BBC variety show. In her teenage years, Andrews performed in many pantomimes which paved the way for her Broadway debut in The Boy Friend at just 18 years of age. Two years later, she was chosen to play Eliza Doolittle in the musical My Fair Lady. Although Andrews hadn’t much acting experience she was praised for her outstanding performance. Julie Andrews won the Oscar for Best Actress for her performance as Mary Poppins.\n\nMovies : Mary Poppins, The Sound of Music, Thoroughly Modern Millie, Torn Curtain\n\nBooks : “Home: A Memoir of My Early Years” by Julie Andrews, “Home Work: A Memoir of My Hollywood Years” by Julie Andrews, “Julie Andrews” by Richard Stirling\n\nAngela Lansbury\n\nAngela Lansbury is an English actress who discovered her talent for acting when she moved to America with her mother. In her film debut Gaslight, Lansbury earned herself an Academy Award nomination and again the following year for her performance in The Picture of Dorian Gray. At 96 years of age, Angela Lansbury has shown her talents on film, tv and theatre for over seven decades. She is probably best known for her role as Jessica Fox in the crime drama Murder, She Wrote.\n\nMovies : Gaslight, The Picture of Dorian Gray, The Three Musketeers,The Manchurian Candidate\n\nBooks : “Balancing Act: The Authorized Biography of Angela Lansbury” by Martin Gottfried,\n\nOld Hollywood Actors\n\nFrank Sinatra was one of the most beloved Hollywood stars during the Golden Age of Hollywood\n\nHumphrey Bogart\n\nFamous Old Hollywood scene from Casablanca with Bogart and Bergman\n\nThrough his iconic performances, Humphrey Bogart cemented himself in Old Hollywood history as one of the greatest actors of all time. His performances in Casablanca and The Canine Mutiny earned him Oscar nominations and in 1952 he was awarded the Academy Award for Best Actor for his role as Charlie Allnut in The African Queen. It was from his movie Casablanca that the famous line “Here’s Looking at You Kid” came from.\n\nMovies : Casablanca, The Treasure of the Sierra Madre, The Maltese Falcon, Sabrina, The African Queen\n\nBooks : “Bogart: In Search of My Father” by Stephen Humphrey Bogart, “Bogart” by Ann M. Sperber & Eric Lax\n\nCary Grant\n\nCary Grant was an English actor who’s handsome looks and charming personality made him one of the most loved actors during the Golden Age of Hollywood. Cary Grant performed in comedic films such as Houseboat, dramatic films and action/thriller films throughout his career. It was his performances in Alfred Hitchcock’s films that stand out among the rest and are his most memorable performances such as To Catch a Thief and Notorious.\n\nMovies : To Catch A Thief, Charade, An Affair to Remember, North By Northwest, Houseboat\n\nBooks : “Cary Grant: A Brilliant Disguise” by Scott Eyman, “Cary Grant, the Making of a Hollywood Legend” by Mark Glancy, “Cary Grant: A Class Apart” by Graham McCann\n\nClark Gable\n\nClark Gable is an iconic Old Hollywood start and was referred to by many “The King of Hollywood”. His performances were recognised by three Academy Award nominations and he won the Best Actor Academy Award for It Happened One Night, a movie he didn’t even want to do. Clarke left Hollywood for awhile after the tragic death of his wife comedic, actress Carole Lombard who died in a plane crash. On his return and later in his career, Gable gave some of his most memorable performance such as The Hucksters and Mogambo.\n\nMovies : Gone With The Wind, The Misfits, Mogambo, Mutiny On The Bounty, It Happened One Night\n\nBooks : “Clark Gable: In His Own Words” by Clark Gable, “Clark Gable: A Portrait of a Misfit” by Jane Ellen Wayne, “Clark Gable: A Biography” by Warren G Harris\n\nFrank Sinatra\n\nFrank Sinatra starring in High Society alongside Bing Crosby and Grace Kelly- Well, Did You Evah\n\nNicknamed as “Ole Blue Eyes” for his steely blue eyes and smooth demeanour, Frank Sinatra was one of the greatest singers of the 20th Century and his Jazz music is still celebrated today. Sinatra became one of the top film stars in Hollywood with quality performances awarding him Academy Award nominations. For his performance in Here to Eternity, Sinatra earned the Oscar for best supporting actor. Sinatra is one of the few stars to be able to manage both a music career and acting career at such an equal level of success. Sinatra was also a member of the Ratpack, alongside Sammy Davis Jr. and Dean Martin, who performed as a group in Las Vegas.\n\nMovies : Pal Joey, High Society, Young at Heart, From Here to Eternity, On the Town, Ocean’s Eleven\n\nBooks : “Frank: The Making of a Legend” by James Kaplan, “Sinatra: The Chairman” by James Kaplan, “Sinatra: Behind the Legend” by J. Randy Taraborrelli\n\nJames Dean\n\nThe life of Old Hollywood star James Dean is that of a tragic and thrilling one. James Dean was one of the most swoon worthy stars in Hollywood. Dean had an incredible future ahead of him in the film industry, however he only got to act in three films before his devastating death in 1955 resulting from a car accident. James Dean was the first actor to receive Academy Award nomination posthumously and remains still today the only actor to receive two.\n\nMovies : Rebel WIthout a Cause, Giant, East of Eden\n\nBooks : “The Real James Dean: Intimate Memories from Those Who Knew Him Best” by Peter L. Winkler, “The Photography of James Dean” by Charles P. Quinn, “James Dean” by Dennis Stock\n\nJames Stewart\n\nJames Stewart was an American actor and decorated military pilot who is remembered by his timeless performances in classic films during Old Hollywood. James Stewart’s performances were rewarded with many Oscar nominations and in 1941 he took home the Academy Award for Best Actor for his outstanding performance in The Philadelphia Story. One of Stewarts most memorable films is It’s a Wonderful Life which has gone down as one of the most beloved movies of all time.\n\nMovies : It’s a Wonderful Life, Rear Window, Vertigo, Harvey, Mr. Smith Goes To Washington\n\nBooks : “Jimmy Stewart and His Poems” by James Stewart, “Pieces of Time: The Life of James Stewart” by Gary Fishgall, “Jimmy Stewart: A Biography” by Marc Eliot\n\nMarlon Brando\n\nIn 1973, Sacheen Littlefeather refused Brando’s Oscar on his behalf and highlighted the treatment of Native American by Hollywood\n\nMarlon Brando was one of Old Hollywood’s finest method actors who produced compelling and passionate performances throughout his career which spanned over five decades. Marlon’s outstanding performances were acknowledged by many Academy Award nominations, in 1954 he took home the Oscar for Best Actor for his role as Terry Malloy in On The Waterfront. Later in life, Brando starred in probably the best movie of his whole career, The Godfather, which earned him his second Oscar, however Brando refused the award due to the treatment of Native Americans in the film industry.\n\nMovies : On the Waterfront, Guys & Dolls, Julius Caesar, A Streetcar Named Desire, The Wild One\n\nBooks : “Brando: Songs My Mother Taught Me” by Marlon Brando\n\nFred Astaire\n\nWhen we think of Old Hollywood there are a few performers that come to mind and Fred Astaire is certainly one of them. Fred Astaire starred alongside some of the biggest actors and actress in Hollywood throughout his film career. Astaire was very much an all-rounder of a performer he could sing, act and without a doubt he could dance. Fred Astaire was a brilliant choreographer and is credited for ten of his movies including Top Hat and Funny Face. His tv variety show An Evening with Fred Astaire won an incredible nine Emmy awards.\n\nMovies : Funny Face, Top Hat, Easter Parade, Swing Time, Bandwagon\n\nBooks : “Steps in Time: An Autobiography” by Fred Astaire, “Fred Astaire: His Friend’s Talk” by Sarah Giles, “Fred Astaire Style” by G. Bruce Boyer\n\nGregory Peck\n\nGregory Peck is one of Old Hollywood’s most respected film stars with a career spanning for nearly six decades which included over sixty films. Pecks outstanding performance on the screen didn’t go unnoticed with five Academy Awards nominations to his name and one Oscar for his role as Atticus Finch in To Kill A Mockingbird. Peck’s performance in this film was outstanding and To Kill A Mockingbird has gone down as one of the all time classics. The author of the book, Harper Lee commended Peck’s performance by saying “Atticus Finch gave Gregory Peck an opportunity to play himself.”\n\nMovies : Roman Holiday, To Kill a Mockingbird, Spellbound, Twelve O’Clock High, Moby Dick\n\nBooks : “Gregory Peck: A Biography” by Gary Fishgall, “Gregory Peck: A Charmed Life” by Lynn Haney, “American Legends: The Life of Gregory Peck” by Charles River Editors\n\nCharlie Chaplin\n\nCharlie Chaplin is one of the most recognisable faces from the Golden Age of Hollywood\n\nCharlie Chaplin is synonymous with Old Hollywood. Chaplin was an English comedy performer and filmmaker and has gone down in history as one of the film industry’s most iconic figures. Chaplin’s first feature length film was The Kid and in it he introduced Jackie Coogan, who became on of Hollywood’s first and most successful child star. Chaplin won his first Academy Award for his film The Circus in 1929. Chaplin often played the character which was named “The Tramp” in many of his films. In 1940, Chaplin made his first ever talkie with The Dictator and he certainly used his voice to send a message.\n\nMovies : The Great Dictator, Modern Times, City Lights, The Kid, The Gold Rush\n\nBooks : “My Autobiography” by Charles Chaplin, “Chaplin: His Life And Art” by David Robinson, “Charlie Chaplin’s Own Story” by Charles Chaplin\n\nLaurence Olivier\n\nLaurence Olivier was an English actor and director who was and still is highly regarded as one of the most significant stars of Old Hollywood. Olivier’s contributions to the film and theatre industry have been recognised in many ways. The Society of West End Theatre Awards were renamed as the Laurence Olivier Awards. These prestigious awards are given out in recognition of excellence in professional theatre in London. Throughout his long career he was nominated for 12 Academy Awards in three different categories, actor, producer, and director. He won two Academy Awards in total, one for Best Actor in Hamlet.\n\nMovies : The Prince and The Showgirl, Wuthering Heights, Hamlet, Spartacus, Rebecca\n\nBooks : “Confessions of an Actor: The Autobiography” by Laurence Olivier, “On Acting” by Laurence Olivier, “Laurence Olivier In His Own Words” by Laurence Olivier\n\nJohn Wayne\n\nJohn Wayne, originally known as Marion Morrison, was an American actor who starred in many Westerns and war movies and today is regarded as an American icon. Nicknamed “The Duke”, Wayne began his career in Hollywood as a prop man and it was in 1930 that director Raoul Walsh saw potential in John and gave him his acting debut in The Big Trail. Wayne produced his first film in 1947 with Angel and the Badman, the first of many that he would both star and produce in. Wayne had a very successful onscreen partnership with Maureen O’Hara and a thriving behind the camera partnership with director John Ford.\n\nMovies : The Searchers, McLintock!, The Quiet Man, Rio Bravo, Red River\n\nBooks : “John Wayne: The Man Behind the Myth” by Michael Munn, “John Wayne Speaks: The Ultimate John Wayne Quote Book ” by Mark Orwoll, “John Wayne: A Life From Beginning to End” by Hourly History\n\nGene Kelly\n\nDuring the Golden Age of Hollywood, Gene Kelly dances with Jerry the Mouse in Anchors Aweigh\n\nOn par with Fred Astaire, Gene Kelly was an all-rounder of Old Hollywood. Throughout his incredible career during the Golden Age of Hollywood Gene Kelly was an actor, dancer, singer, choreographer, director and producer. Gene Kelly’s athletic dance style and animated personality transformed the Hollywood musical scene. In 1942, Kelly scored his debut film For Me & My Gal, in which he starred alongside Judy Garland. Gene Kelley was truly an innovator and during his time in Hollywood he made history by becoming the first person to dance with cartoons. Yes you read that right, in his movie Anchors Aweigh, Kelly did a dance scene with the world famous mouse Jerry, from the duo Tom & Jerry.\n\nMovies : Singing in the Rain, An American in Paris, The Pirate, On The Town, Anchors Aweigh\n\nBooks : “Gene Kelly: The Making of a Creative Legend” by Earl Hess & Pratibha A. Dabholkar, “Gene Kelly: A Life of Dance and Dreams” by Alvin Yudkoff, “He’s Got Rhythm: The Life and Career of Gene Kelly” by Cynthia Brideson\n\nSidney Poitier\n\nSidney Poitier was the first Black actor to win an Academy Award. The Bahamian American actor won the Oscar for Best Actor in 1963 for his performance in the film Lilies of the Field. Poitiers acting talents and presence on the screen shone throughout his career during the Golden Age of Hollywood. Sidney Poitier was a film actor and director who starred and directed many highly acclaimed films throughout his career including A Patch of Blue, A Raisin in the Sun and Stir Crazy. Poitier’s career spanned over seven decades and the actor passed away in 2022 at the age of 94.\n\nMovies : In The Heat of The Night, A Raisin in the Sun, The Defiant Ones, Lilies of the Field\n\nBooks :”This Life” by Sidney Poitier, “Life Beyond Measure” by Sidney Poitier, “The Measure of a Man: A Spiritual Autobiography” by Sidney Poitier\n\nPaul Newman\n\nPaul Newman was not only loved because of his good looks and charisma but because of his compelling performances that caught the attention of so many on the screen. In 1953, Newman made his debut appearance and also met Joanne Woodward, an understudy at the time. The two feel in love and married in 1958, remaining married until Paul’s death in 2008. Their relationships was one of the most sweetest and endearing relationships in Hollywood, where commitment and loyalty was few and far found. The two were Hollywood’s unshakable and favourite couple. Although many of Newman’s performance were nominated for Academy Awards it wasn’t until later in his career that he would finally win the prestigious Oscar.\n\nMovies : Cat on a Hot Tin Roof, Hud, Butch Cassidy and The Sundance Kid, The Hustler\n\nBooks : “The Extraordinary Life of an Ordinary Man: A Memoir” by Paul Newman, “Paul Newman: A Life” by Shawn Levy, “Paul Newman: Blue-Eyed Cool” by James Clarke\n\nDick Van Dyke\n\nDick Van Dyke is one of Old Hollywood’s most beloved actors.\n\nDick Van Dyke is one of Old Hollywood’s most cherished performers. Van Dyke became a much loved actor by fans for his charm, comedic wit and his not-so-serious personality. Dick Van Dyke grew in popularity after his comedic show “The Dick Van Dyke Show” which received many accolades. The American actor went on to star in the favourite classic musicals such as Mary Poppins and Chitty Chitty Bang Bang. At 96 years of age, Van Dyke still hasn’t lost it starring in Mary Poppins Returns in 2018.\n\nMovies : Mary Poppins, Chitty Chitty Bang Bang, Bye Bye Birdie, What a Way To Go!\n\nBooks : “My Lucky Life in and Out of Show Business” by Dick Van Dyke, “Keep Moving: And Other Tips and Truths About Living Well Longer” by Dick Van Dyck\n\nMontgomery Clift\n\nMontgomery Clift began his acting career on Broadway and was begged by Old Hollywood directors to appear on the big screen. Montgomery, nicknamed Monty, agreed to come to Hollywood after 12 years of turning down film proposals, it was the John Wayne film Red River which finally took his interest. During his career, Clift received many Academy Award nominations, unfortunately he never took home the Oscar and his career was cut short in 1966 when Clift died from a heart attack at the young age of 45.\n\nMovies : A Place in the Sun, The Misfits, The Heiress, Judgement at Nuremberg, Red River\n\nBooks : “Montgomery Clift: A Biography” by Patricia Bosworth, “Montgomery Clift: The Revealing Biography of a Hollywood Enigma” By Maurice Leonard\n\nRock Hudson\n\nRock Hudson was one of the most recognisable faces in Old Hollywood, starring alongside huge stars such as Gina Lollobrigida, Elizabeth Taylor and James Dean. Hudson demanded the screen as a tall, dark and handsome character who fans swooned over. Hudson had a great friendship with Doris Day, whom he shared the screen with many times. In July 1985, Hudson announced that he was suffering from acquired immune deficiency syndrome otherwise known as AIDS. During this time there was huge stigma around AIDS, and Hudsons announcement shocked the media. Only a short three months after his announcement, Rock Hudson sadly passed away as a result from the disease.\n\nMovies : Pillow Talk, Lover Come Back, Come September, Send Me No Flowers,\n\nBooks : “All That Heaven Allows : A Biography of Rock Hudson” by Mark Griffin, “Rock Hudson: His Story” by Rock Hudson\n\nBing Crosby\n\nBing Crosby starred in White Christmas, an Old Hollywood classic\n\nBing Crosby is one of the most successful recording artists of all time and like Frank Sinatra he too made an equally successful and respected career as both a singer and an actor. From 1944-1948, Crosby was Old Hollywood’s top box-office star. Throughout his acting career Bing Crosby starred, co-starred, narrated or had a cameo appearance in a total of 104 films. His career spans for nearly five decades and he was one of the first multi-media stars in Hollywood.\n\nMovies : High Society, White Christmas, The Country Girl, Holiday Inn, Going My Way\n\nBooks : “Bing Crosby: A Pocketful of Dreams – The Early Years 1903 – 1940” by Gary Giddins, “Bing Crosby: Swinging on a Star: The War Years, 1940-1946” by Gary Giddins, “Call Me Lucky” by Bing Crosby\n\nSteve McQueen\n\nSteve McQueen was known as the real cool dude of Old Hollywood. His performances in action and western movies were widely acclaimed such as The Magnificent Seven and The Great Escape. Although Steve McQueen had many memorable movies he earned only one Oscar nomination in his career for his performance in Sand Pebbles. McQueen was one of the most popular actors during his time and is still remembered today as one of Old Hollywood’s most captivating performers.\n\nMovies : The Great Escape, The Magnificent Seven, The Thomas Crown Affair, Bullitt, The Cincinnati Kid\n\nBooks : “Steve McQueen: A Biography” by Marc Eliot, “McQueen: The Biography” by Christopher Sandford, “Steve McQueen: The Salvation of an American Icon ” by Greg Laurie\n\nRichard Burton\n\nRichard Burton made his Hollywood debut in the 1952 film My Cousin Rachel and his performance earned him his first of many Academy nods. From then on Burton’s success only grew and he reached international stardom when he played the role of Mark Anthony in Cleopatra alongside Elizabeth Taylor, who he would go on to marry not once but twice. Their romance started in an affair while on set and the marriages ended in divorce. The two stars acted opposite each other in a total of eleven movies.\n\nMovies : Cleopatra, The Taming of the Shrew, Who’s Afraid of Virginia Woolf, Becket\n\nBooks : “The Richard Burton Diaries” by Richard Burton, “Rich: The Life of Richard Burton” by Melvyn Bragg, “Richard Burton: Prince of Players” by Michael Munn\n\nMickey Rooney\n\nMickey Rooney is an Old Hollywood Legend\n\nMickey Rooney was another star who successfully transitioned from the silent era of films to the talkies and also from a child actor to a successful adult actor, a feat not everyone could achieve. Mickey Rooney’s career was boosted by the beloved character he played Andy Hardy, who appeared in nearly 20 films. Rooney also acted opposite Garland in many films throughout his career. Adding to a hugely successful film career, Rooney appeared in television with his own show “The Mickey Rooney Show” from 1954 until 1955.\n\nMovies : Breakfast at Tiffany’s, Babes in Arms, Boys Town, National Velvet, Love Finds Andy Hardy\n\nBooks : “Life is Too Short” by Mickey Rooney, “The Life and Times of Mickey Rooney” by Richard A. Lertzman\n\nTony Curtis\n\nTony Curtis had a career that spanned over 70 years during the Golden Age of Hollywood. Curtis earned his first and only Academy Award nomination for his performance in The Defiant ones, looking back on how successful Tony Curtis is today it is hard to imagine that he was never nominated again. Curtis’ daughter Jamie Lee Curtis, followed in her father and mother, Janet Leigh’s footsteps and has become a Hollywood legend herself.\n\nMovies : Operation Petticoat, Some Like It Hot, The Great Imposter, Sweet Smell of Success, The Defiant Ones\n\nBooks :”Tony Curtis: The Autobiography” by Tony Curtis, “Some Like It Hot: Me, Marilyn and the Movie” by Tony Curtis. “American Prince: A Memoir” by Tony Curtis & Peter Golenbock\n\nTop 10 Old Hollywood Movies\n\nOld Hollywood produced hundreds of amazing movies and musicals for us to enjoy. Old Hollywood movies are simply classics that have stood the test of time, with many of them still enjoyed today. Here are a list of the most memorable Old Hollywood Movies that were made during the Golden Age of Hollywood.\n\nGone with The Wind (1939)\n\nGone with the Wind is arguably one of the greatest Old Hollywood films ever made.\n\nGone with the Wind was released in 1939 and is the film adaptation of the novel by the same name which was written in 1936 by Margaret Mitchell. The film stars Vivien Leigh as Scarlett O’Hara, daughter of a Georgia plantation owner, Leslie Howard as Ashley Wilkes, Scarlett’s romantic interest, Olivia de Havilland as Melanie Hamilton, Ashley’s wife and Clark Gable as Rhett Butler, Scarlett’s husband. The film is set during the American Civil War and follows Scarlett’s love affair between Wilkes and Butler.\n\nThe famous line “Frankly my dear, I don’t give a damn” came from Clark Gable’s character in the movie. Gone with the Wind won eight Academy Awards including Best Picture, Best Actress in a Leading Role (Vivien Leigh) and Best Actress in a Supporting Role, Hattie McDaniel.\n\nBreakfast At Tiffany’s (1961)\n\nBreakfast At Tiffany’s is based on the Truman Capote’s novel. It follows the story of Holly Golightly, an expensive escort who is searching for a rich, older man to marry but meets a young struggling writer, Paul Varjak played by George Peppard, who moves into her apartment instead. Paul quickly falls in love with Holly, however it takes Holly longer to realise her feelings for Paul.\n\nThe Wizard of Oz (1939)\n\nThis Old Hollywood musical is still remains a fan favourite today.\n\nThe Wizard of Oz is a musical adaptation of L. Frank Baum’s novel The Wonderful Wizard of Oz. The movie follows Dorothy who is played by Judy Garland, and her dog Toto who find themselves in Munchkinland in the land of Oz after a Tornado lifted their Kansas home to the unknown land. Dorothy follows the Yellow Brick Road to the Emerald City to meet the Wizard of Oz so that she can go back home to Kansas. On her adventure she meets a Scarecrow that needs a brain, a TinMan that needs a heart and a Cowardly Lion that needs a courage.\n\nCasablanca (1942)\n\nHumphrey Bogart, plays Rick Blaine, a nightclub owner in Casablanca, who discovers his old flame Ilsa, who is played by Ingrid Bergman is in town with her husband, Victor Laszlo, played by Paul Henreid. Blaine must help Ilsa and her husband to flee the country while fighting his growing feelings for Ilsa.\n\nRoman Holiday (1953)\n\nRoman Holiday is a charming and hilarious Old Hollywood film.\n\nRoman Holiday is a fun filled movie based in Rome which follows Audrey Hepburn’s character, princess Anne. One night in Rome, an overwhelmed and bored Anne goes on an adventure for a night in the Italian capital. When princess Anne falls asleep on a park bench she is found by American reporter, Joe Bradley, played by Gregory Peck. When Joe finds out that Anne is actually a princess he bets his editor that he can get an exclusive interview with her. However, Joe doesn’t expect to fall for the princess during the process.\n\nSingin’ In The Rain (1952)\n\nSingin’ in The Rain is a musical which tells the story of the transition from silent films to `talkies’. Don, played by Gene Kelly and Lina, played by Jean Hagen are used to be cast repeatedly as a romantic couple, but things change when their newest film is remade into a musical and Don has the voice for the new singing part but Lina doesn’t. Kathy, played by Debbie Reynolds is a young aspiring actress, who is chosen to record over Lina’s voice for the new movie. Singin’ in the Rain is full of memorable music and dance numbers.\n\nHigh Society (1956)\n\nHigh Society sees the greatest stars of Old Hollywood sharing the screen.\n\nHigh Society is one of those classic old Hollywood films that just stays with you. The catchy songs and beautiful costumes are hard to forget. The film follows Tracy Samantha Lord, played by Grace Kelly as she prepares for her wedding day she is wrapped up in love triangle with her ex-husband Jazz artist C.K. Dexter Haven, played by Bing Crosby and magazine reporter, Frank Sinatra. Both men work hard to convince Tracy that he is the best choice, but Tracy can only choose one. With Sinatra and Crosby in one movie, you just know the music will be spectacular.\n\nGentlemen Prefer Blondes (1953)\n\nWho could forget that iconic Marilyn Monroe number in Gentlemen Prefer Blondes? Lorelei Lee, played by Marilyn Monroe is a beautiful showgirl engaged to Gus Esmond, played by Tommy Noonan. Gus’ rich father, however, Esmond Sr., thinks that Lorelei is just after his money. When Lorelei goes on a cruise with her best friend, Dorothy Shaw, played by Jane Russell, Ernie Malone, played by Elliott Reid, a private detective, is hired by Esmond Sr. to follow her and report any behaviour that would bring the marriage to an end.\n\nHouseboat (1958)\n\nOld Hollywood Classic, Houseboat is a firm family favourite.\n\nCary Grant plays Tom Winston, a father of three who is struggling to raise his children after the death of his wife. When Tom meets the beautiful Cinzia Zaccardi, played by Sophia Loren at a concert, he hires her as a nanny. Little does Tom know that Cinzia is actually a socialite on the run from her father and there’s one slight problem, she has no experience with cleaning, cooking or raising children.\n\nTo Catch a Thief (1955)\n\nFormer burglar John Robie, played by Cary Grant, finds himself trying to clear his name when a series of robberies are committed in his style. John begins following Francie, played by Grace Kelly,suspecting her expensive jewels may be next on the burglars list. However, when Francies jewels are stolen she suspects John, putting an end to their romance. John must then find the burglar to not only clear his name but to win back Francie.\n\nThe Golden Age of Hollywood\n\nThere are so many other great Old Hollywood movies that should be watched and trying to choose just ten to put in a list was a struggle. The Golden Age of Hollywood produced without a doubt some of the greatest movies ever made. Old Hollywood certainly had its ups and downs and not everything is as glamorous as we wish to remember but one thing is for sure, it has certainly left an everlasting mark on our society and defined an era."}, {"url": "https://www.allmusic.com/artist/jeannie-c-riley-mn0000232701/biography", "page_content": "Few artists in the history of country music became famous as fast as Jeannie C. Riley. Her second single, \"Harper Valley P.T.A.,\" was a runaway hit immediately upon release in 1968; it sold over five million copies in the United States and was the first song by a female artist to top the country and pop charts at the same time. The song also set the template for much of Riley's career to follow, singing songs about the harder side of life and small-town scandal, as seen through the eyes of a down-to-earth woman with a proud spirit and a strong voice -- buoyed by the unapologetic Texas twang of her instrument. The accessible but unabashed country sound of Riley's music took on a softer tone after she embraced Christianity in the late '70s and released albums like 1979's Wings to Fly and 1981's From Harper Valley to the Mountain Top. By the '90s, Riley's recording career had faded out and a struggle with depression kept her out of the public eye for most of the decade, but she made a low-key comeback in the early 2000s, hosting a radio show and returning to live performing.\n\nJeannie C. Riley was born Jeanne Carolyn Stephenson on October 19, 1945 in the small Texas town of Stamford. Her father made his living as a mechanic and her mother had a career of her own as a nurse. Growing up in Texas, Riley grew to love music, and dreamed that her talent could be the key to a better way of life. Riley made her public debut as a singer in the early '60s at a performance hosted by her uncle Johnny Moore, a country singer who had scored a few regional hits. Local country fans were impressed with Riley's performance, and she began singing regularly at Moore's monthly jamborees. She had yet to graduate from high school when she married her boyfriend, Mickey Riley, in December 1962, and they welcomed a daughter, Kim Michelle Riley, in January 1966. Meanwhile, Weldon Myrick, a pedal steel guitarist who had played at several of Riley's jamboree shows in Texas, had relocated to Nashville and felt that rising star Connie Smith sounded a great deal like her. Myrick encouraged Riley to come to Nashville and pursue a career as a singer, and in time Riley and Mickey packed their bags and moved to Music City. She worked as a secretary at Passkey Records while cutting demos in her spare time and eventually struck a deal with Little Darlin' Records, a Nashville label co-founded by Johnny Paycheck. In 1967, Little Darlin' issued her debut single, \"You Write the Music\" b/w \"What About Them.\" Riley would cut an album's worth of material for Little Darlin' but after her first 45 flopped, they declined to release a second single.\n\nRiley's career seemed stuck in neutral until Shelby Singleton, a producer and promotions man who had helped make a fistful of records hits, heard a publishing demo she had recorded for a tune called \"The Old Town Drunk.\" Singleton had recently launched his own country label, Plantation Records, and was eager to cut a tune written by Tom T. Hall about a woman standing up to small-town hypocrites on her daughter's behalf. Singleton believed Riley had the right voice for the song, so he bought out her deal with Little Darlin' and brought her to the studio to cut the song. While initially Riley didn't think much of the song, she gave it a go, and in less than an hour she had cut \"Harper Valley P.T.A.\" Upon the single's release, both country and pop radio enthusiastically embraced it, even though some C&W stations blanched at the song's depiction of small town sinfulness, and rock stations usually passed on songs that made no concession to the crossover market. In August 1968, \"Harper Valley P.T.A.\" hit the top of the pop and country charts; it was the first time a female artist would manage this feat, and it wouldn't happen again until 1980, when Dolly Parton released \"9 to 5.\"\n\nIn a matter of weeks, Riley went from obscurity to stardom as \"Harper Valley P.T.A.\" became a cultural phenomenon and Little Darlin' wasted no time releasing their Riley material on a 1968 album called Sock Soul; in 1969 Capitol would repackage the same LP under the title The Songs of Jeannie C. Riley. It was trounced in the marketplace by Riley's first album for Plantation, called Harper Valley U.S.A., which topped the country album chart and rose to number 12 on the pop survey. The song also earned Riley a Grammy award for Best Female Country Vocal Performance. \"Harper Valley P.T.A.\" proved to be Riley's first and last single to cross into the Pop Top 40, but she became a frequent presence on network television in 1969 and 1970, starring in her own TV special (titled, of course, Harper Valley P.T.A.) and appearing on The Ed Sullivan Show, The Johnny Cash Show, The Bob Hope Show, American Bandstand, and The Glen Campbell Goodtime Hour, as well as touring frequently. Riley continued to enjoy success on the country charts, landing ten more singles in the Country Top 40 between December 1968 and October 1971. (Five of them -- \"The Girl Most Likely,\" \"There Never Was a Time,\" Country Girl,\" \"Oh, Singer,\" and \"Good Enough to Be Your Wife\" -- made the Top Ten.) Riley also knocked out five more albums for Plantation during the same period, but after a dispute between her and Singleton, who she believed was paying her less than her due, she left the label and signed with MGM Records. Her first single for MGM, \"Houston Blues,\" arrived in November 1971, and in 1972 she enjoyed two more Country Top 40 singles, \"Give Myself a Party\" and \"Good Morning Country Rain.\" However, after \"When Love Has Gone Away\" hit number 44 in March 1973, it would mark the last time Riley released a 45 than rose above 50 on the Country Singles charts. Short-lived deals with Mercury and Warner Bros. resulted in singles that made little impression, and while Riley continued to tour, her most successful release of this period was the soundtrack album to a 1978 film adaptation of Harper Valley U.S.A., starring Barbara Eden.\n\nAs Riley struggled with an unhappy marriage, a career on the downturn, and financial woes, she experienced a spiritual rebirth and became a born again Christian. In 1979, she released an album of Christian-themed music, Wings to Fly, and in 1981, she brought out From Harper Valley to the Mountain Top, which appeared at the same time as her memoir of the same name. Throughout the '80s, Riley put her primary focus on spiritual music, though she still recorded secular material on the albums Total Woman (1984) and Jeannie C. Riley (1986), the latter of which found her re-recording \"Harper Valley P.T.A.\" The album Here's Jeannie C. arrived in 1991, but a dispute with her manager in the early '90s put Riley back in legal and financial trouble, and she developed a severe case of clinical depression, which prevented her from working for close to six years. By 2000, Riley had recovered her mental and physical health, and became the host of a weekly radio series titled Inside Nashville Country, as well as performing live, speaking to Christian groups, and writing. In 2019, \"Harper Valley P.T.A.\" was added to the Grammy Hall of Fame, intended to recognize recordings of lasting merit and significance."}]}