{"Jeanine Riley also appeared in the films The Wheeler Dealers (1963) and The Ghost and Mr. Chicken (1966).": [{"url": "https://www.tcm.com/tcmdb/title/95463/the-wheeler-dealers", "page_content": "James Garner,James Garner brought the breezy good-old-boy persona that had made him a star on TV'sto the big-screen with this 1963 comedy set in the wilds of Wall Street. He stars as a Texas millionaire (or is he?) out to double his fortune (if any) who gets bilked into buying bogus stocks (or are they?) by a pretty financial analyst (Lee Remick, whose beauty and charm are among the few things you can be sure of).Garner had become a star when he managed to shift the Warner Bros. seriesfrom standard western to offbeat satire shortly after its 1957 debut. But when the studio took him off salary during a writers' strike - and refused to let him work anywhere else - he quit, leading to a lawsuit that successfully ended his contract. It also kept him pretty much out of work for two years. He returned to movies in 1962 with a straight dramatic role in(1961), a film that performed poorly at the box-office despite the high-powered teaming of Audrey Hepburn and Shirley MacLaine. Then he had a comic success working with producer Martin Ransohoff and writer Ira Wallach on(1962). When Ransohoff picked up the rights to George J.W. Goodman's novel about Wall Street cowboys, it seemed the perfect way to bring the good-hearted con artist routine Garner had developed on television to the big screen. Released in the same year as three other hits - the World War II action adventureand the Doris Day comediesandhelped establish Garner as a major screen presence, kicking off a very successful decade on the big screenmarked a successful change of pace for leading lady Remick. Primarily a dramatic actress, she had just scored an Oscar® nomination as Jack Lemmon's alcoholic wife in(1962). That had followed a series of powerful dramas in which she played everything from the small-town vixen in(1959) to a simple farm woman in(1960). With, she proved that was equally adept at comedy, a genre she rarely got to play on the big screen, though she had appeared in numerous musicals during her days as a Broadway dancer.Adding to the film's success was a supporting cast of versatile comic actors. Louis Nye and Pat Harrington, Jr. had both established themselves as members of the comic repertory company working on Steve Allen's TV show, while John Astin would soon play his most famous role, Gomez Addams, in Ransohoff's TV adaptation of. Also on hand were Patricia Crowley, star of the sitcom version of(1965-67) and currently a regular on the ABC daytime drama, and Jim Backus, just before embarking on a three-hour tour as Thurston Howell III onProducer: Martin RansohoffDirector: Arthur HillerScreenplay: George J.W. Goodman, Ira Wallach, based on Goodman's novelCinematography: Charles LangArt Direction: George W. Davis, Addison HehrMusic: Frank De VolCast: James Garner (Henry Tyroon), Lee Remick (Molly Thatcher), Phil Harris (Ray Jay), Chill Wills (Jay Ray), Louis Nye (Stanislas), John Astin (Hector Vanson), Jim Backus (Bullard Bear), Patricia Crowley (Eloise), Pat Harrington, Jr. (Buddy Zack), Howard McNear (Mr. Wilson).C-106m. Letterboxed.by Frank Miller\n\nThe Wheeler Dealers\n\n\"You don't go wheelin' 'n' dealin' for money. You do it for fun. Money's just the way you keep score.\" James Garner, The Wheeler Dealers James Garner brought the breezy good-old-boy persona that had made him a star on TV's Maverick to the big-screen with this 1963 comedy set in the wilds of Wall Street. He stars as a Texas millionaire (or is he?) out to double his fortune (if any) who gets bilked into buying bogus stocks (or are they?) by a pretty financial analyst (Lee Remick, whose beauty and charm are among the few things you can be sure of). Garner had become a star when he managed to shift the Warner Bros. series Maverick from standard western to offbeat satire shortly after its 1957 debut. But when the studio took him off salary during a writers' strike - and refused to let him work anywhere else - he quit, leading to a lawsuit that successfully ended his contract. It also kept him pretty much out of work for two years. He returned to movies in 1962 with a straight dramatic role in The Children's Hour (1961), a film that performed poorly at the box-office despite the high-powered teaming of Audrey Hepburn and Shirley MacLaine. Then he had a comic success working with producer Martin Ransohoff and writer Ira Wallach on Boy's Night Out (1962). When Ransohoff picked up the rights to George J.W. Goodman's novel about Wall Street cowboys, it seemed the perfect way to bring the good-hearted con artist routine Garner had developed on television to the big screen. Released in the same year as three other hits - the World War II action adventure The Great Escape and the Doris Day comedies The Thrill of It All and Move Over, Darling - The Wheeler Dealers helped establish Garner as a major screen presence, kicking off a very successful decade on the big screen The Wheeler Dealers marked a successful change of pace for leading lady Remick. Primarily a dramatic actress, she had just scored an Oscar® nomination as Jack Lemmon's alcoholic wife in Days of Wine and Roses (1962). That had followed a series of powerful dramas in which she played everything from the small-town vixen in Anatomy of a Murder (1959) to a simple farm woman in Wild River (1960). With The Wheeler Dealers, she proved that was equally adept at comedy, a genre she rarely got to play on the big screen, though she had appeared in numerous musicals during her days as a Broadway dancer. Adding to the film's success was a supporting cast of versatile comic actors. Louis Nye and Pat Harrington, Jr. had both established themselves as members of the comic repertory company working on Steve Allen's TV show, while John Astin would soon play his most famous role, Gomez Addams, in Ransohoff's TV adaptation of The Addams Family. Also on hand were Patricia Crowley, star of the sitcom version of Please Don't Eat the Daisies (1965-67) and currently a regular on the ABC daytime drama Port Charles, and Jim Backus, just before embarking on a three-hour tour as Thurston Howell III on Gilligan's Island. Producer: Martin Ransohoff Director: Arthur Hiller Screenplay: George J.W. Goodman, Ira Wallach, based on Goodman's novel Cinematography: Charles Lang Art Direction: George W. Davis, Addison Hehr Music: Frank De Vol Cast: James Garner (Henry Tyroon), Lee Remick (Molly Thatcher), Phil Harris (Ray Jay), Chill Wills (Jay Ray), Louis Nye (Stanislas), John Astin (Hector Vanson), Jim Backus (Bullard Bear), Patricia Crowley (Eloise), Pat Harrington, Jr. (Buddy Zack), Howard McNear (Mr. Wilson). C-106m. Letterboxed. by Frank Miller"}, {"url": "https://www.imdb.com/title/tt0057681/reviews", "page_content": "3 /10\n\nWarning: Spoilers\n\n**this review contains spoilers**\n\n\n\nFinally got a chance to catch this movie on TCM the other day, and what a disappointment it was. I mean, this movie seemed like a slam-dunk from the description. James Garner, fresh from Maverick, playing a Texas oilman who isn't above a con or two. And Lee Remick, one of the most beautiful women in the movies, playing a stock analyst. Put 'em in one of those big, glossy Hollywood comedies they made in the early sixties, with all the wonderful character actors who were around at the time, like Jim Backus and Pat Harrington, and you have a heckuva package.\n\n\n\nSo I always wondered why all the movie-review books gave it a mediocre rating.\n\n\n\nWell, now I know. This movie just doesn't make any sense. It's incoherent. Garner and Remick are immensely appealing, and I especially would have liked to have bumped into Remick on Wall Street in 1963, though if I had I wonder if I would have retained the power of speech, so gorgeous she was. But you know, to be successful, a movie needs more than actors. It also needs a storyline that works.\n\n\n\nThis one? Well, it starts out with Garner drilling for oil in Texas, and hitting a dry hole. He discovers he and his company are broke and he needs to go to New York to raise some money. He has some leases that are about to expire.\n\n\n\nSo he goes to Wall Street and immediately convinces three financiers to put up $300,000. That's all the money he asked them for. So is the problem solved? I dunno. The movie doesn't tell us.\n\n\n\nThen Garner goes to a brokerage and tries to sell the owner on buying stock in his company. Okay, so maybe that $300,000 didn't solve the problem. Who knows? Anyway, here he meets Lee Remick.\n\n\n\nShe has another mission. She has to sell stock in a widget firm or else she'll be fired. She figures Garner is her mark. Okay, not a bad setup. Romance ensues, with all the usual complications.\n\n\n\nHere we start seeing the stuff that doesn't make sense. Garner buys a restaurant. I guess he wants to impress Remick. But he's broke, scrambling for cash. Huh?\n\n\n\nThen he hooks up with a painter, disappears for a week in Europe and starts buying up abstract paintings. I guess it's because he thinks Remick is into abstract art. There's some blather about how the whole thing is a tax dodge. He can make ten cents on the dollar by donating to museums. But again, he's broke, his company needs every dime. Huh?\n\n\n\nThree fellow Texans arrive on the scene, apparently so eager to invest in Garner's schemes that they flew after him to New York in their private jet. Does he pitch them on his drilling venture? No. He sells them on joining the painting scheme instead. Huh?\n\n\n\nThere's a throwaway line in there somewhere, indicating that the Texans aren't keen on oil ventures. Okay, I'll grant the movie that -- it's a stab at logic -- but Garner never even tries to ask them for money. Here we are at the halfway point of the movie and this is the last time we even get a hint about his problems in Texas. This whole idea is abandoned. We never find out what happens to Garner's Texas drilling venture.\n\n\n\nNow we get into an entirely new storyline. Garner, for some unexplained reason, decides to run up the price of the widget company stock. What is the scheme? What is the con? I don't get it.\n\n\n\nIs Garner planning to purchase stock on the cheap, then resell it? The final scene of the movie belies that. He purchased four percent of the stock and his buddies purchased 48 percent, and all of them kept every penny. So it wasn't a swindle. Okay, fine. But why does he expend 20 minutes of comedic gyration on running up the price?\n\n\n\nActually, the widget company stock sounds like a steal. Turns out the widget company is a holding company for AT&T stock, bought on the cheap befoie WWI, and the principals have been collecting fat dividends ever since. Why wouldn't Garner try to acquire a controlling interest as cheaply as possible? He could liquidate the widget company and make money by selling the AT&T stock. If this was the plan, that might make sense, but the movie owes it to viewers to explain it. And in this scenario it wouldn't make any sense for Garner to run up the price of the stock. Anyway, Garner doesn't even seem to recognize that the widget company has value. I just don't get it. Huh?\n\n\n\nAnd while this was playing out, I wanted to scream -- what about the Texas drilling venture? Anyway, all this is backdrop to the lovely romance between Garner and Remick, and it all culminates in a securities-fraud trial. The two of them do what they're supposed to, they're cute as heck and all that. But I say the \"heart\" part of the story doesn't work if the \"head\" part is a failure."}, {"url": "https://mttdb.com/movie/the-wheeler-dealers-1963/", "page_content": "The Wheeler Dealers (1963)\n\n107\n\nOverview:\n\nHenry J. Tyroone leaves Texas, where his oil wells are drying up, and arrives in New York with a lot of oil money to play with in the stock market. He meets stock analyst Molly Thatcher, who tries to ignore the lavish attention he spends on her but ...\n\nDirected by:\n\nProduced by:\n\nKeywords:"}, {"url": "https://www.amazon.com/prime-video/actor/Jeannine-Riley/nm0727065/", "page_content": "Jeannine Riley\n\nBlonde bombshell Jeannine Brooke Riley was born in Madera, California on October 1, 1940 and started her movie and TV career in 1962 with an unbilled movie part in the Rosalind Russell drama Five Finger Exercise (1962) and roles on the TV shows \"Father of the Bride\" and \"Route 66,\" not to mention an episode of \"My Three Sons\" aptly entitled \"The Beauty Contest.\" The next year she co-starred with Gary Clarke and Steve Ihnat in the low-budget suspense drama Strike Me Deadly (1963); later that year she and Ihnat also appeared together in the stage play \"The Fourposter.\"\n\nWhile showing off her allure in western series \"Wagon Train\" and \"The Virginian,\" Jeannine came to the attention of CBS producers who were on a TV rural roll with the huge series hits \"The Andy Griffith Show\" and \"The Beverly Hillbillies\". At the time, Hillbilly cast member Bea Benaderet (as Cousin Pearl) had just been given the green light to star in her own bucolic series, Petticoat Junction (1963), playing Kate Bradley, a hotel-owning widowed mother of three beautiful nubile daughters. The flirty role of daughter Billie Jo Bradley was at first given to actress Sharon Tate, but when word came out that she had posed nude in photo shoots, they were forced to dismiss her from the wholesome Ivory-Soap-sponsored series before scandal and controversy could cause damage. The part was recast and Jeannine won the role.\n\nThe actress was ideal as the Daisy Mae-like eldest daughter who attracted men like bees to honey, much to the envy of her impressionable younger sisters. Jeannine played the role for two years before both she and Pat Woodell (as sister Bobbie Jo) opted out of the series. While Jeannine wanted to move into film work, Woodell, who went on to marry and divorce Gary Clarke, Jeannine's film co-star in Strike Me Deadly (1963), desired a singing career. Jeannine and Pat were replaced in 1965 by Gunilla Hutton and Lori Saunders.\n\nWhile the actress continued on with TV guest roles on \"Ozzie and Harriet,\" \"The Man From U.N.C.L.E.,\" and \"Occasional Wife,\" and as a on \"The sometimes-sexy foil on \"The Smothers Brothers Show,\" she found breaking away from her bombshell trappings too difficult and was soon appearing as sexpot Bambi Berman in the Jerry Lewis film vehicle The Big Mouth (1967), and in unsold pilots of Sheriff Who (1967) and Li'l Abner (1967); in this latter she finally got to play the voluptuous Daisy Mae character. Guest episodes of \"The Wild, Wild West\" and \"Gomer Pyle\" also showed a return to familiar territory.\n\nAfter starring with Nick Adams in one of his last films before his untimely death, the action drama Fever Heat (1968), Jeannine showed up in her first quality film showcase, albeit a smaller part, with The Comic (1969), a moving showcase for nimble Dick Van Dyke as a silent screen star. She found an even better role as dancer/barmaid babe Jolene opposite biker Robert Blake in the cult film Electra Glide in Blue (1973), sharing some potent nude scenes.\n\nBack in the country fold on series TV, she appeared in two seasons of the cornpone musical variety show Hee Haw (1969), in which she was featured as a Daisy Mae-like foil in silly skits. A couple years later she was cast in the \"Gilligan's Island\"-inspired TV western Dusty's Trail (1973) with Bob Denver and Forrest Tucker co-starring as Gilligan/Skipper-like characters; Jeannine's Lulu McQueen was a dead-on take on the pneumatic Ginger Grant role. Petticoat Junction (1963) co-star Lori Saunders co-starred in the series as innocent Betsy McGuire, a variation of the Mary Ann character. It lasted one season.\n\nSince then, however, the availability of parts has sharply declined; Jeannine's last credits were the films Lone Star Bar & Grill (1983) and Timebomb (1991)."}, {"url": "https://www.moviefone.com/movie/the-wheeler-dealers/1038853/where-to-watch/", "page_content": "Watch 'The Wheeler Dealers' Online\n\nLooking to feast your eyes on 'The Wheeler Dealers' on your TV or mobile device at home? Hunting down a streaming service to buy, rent, download, or watch the Arthur Hiller-directed movie via subscription can be confusing, so we here at Moviefone want to do the heavy lifting.\n\n\n\nWe've listed a number of streaming and cable services - including rental, purchase, and subscription options - along with the availability of 'The Wheeler Dealers' on each platform when they are available. Now, before we get into the nitty-gritty of how you can watch 'The Wheeler Dealers' right now, here are some details about the Filmways Pictures comedy flick.\n\n\n\nReleased November 14th, 1963, 'The Wheeler Dealers' stars James Garner, Lee Remick, Phil Harris, Chill Wills The G movie has a runtime of about 1 hr 47 min, and received a user score of 66 (out of 100) on TMDb, which assembled reviews from 15 well-known users.\n\n\n\nYou probably already know what the movie's about, but just in case... Here's the plot: \"Henry J. Tyroone leaves Texas, where his oil wells are drying up, and arrives in New York with a lot of oil money to play with in the stock market. He meets stock analyst Molly Thatcher, who tries to ignore the lavish attention he spends on her but ...\"\n\n\n\n'The Wheeler Dealers' is currently available to rent, purchase, or stream via subscription on Apple iTunes, Google Play Movies, Vudu, Amazon Video, Microsoft Store, YouTube, and DIRECTV ."}, {"url": "https://www.moviefone.com/movie/the-wheeler-dealers/1038853/main/", "page_content": "The Wheeler Dealers (1963) \"He really wasn't out to make $1,000,000. He already had that!\"\n\nAudience Score 66 G 1 hr 47 min Comedy\n\nHenry J. Tyroone leaves Texas, where his oil wells are drying up, and arrives in New York with a lot of oil money to play with in the stock market. He meets stock analyst Molly Thatcher, who tries to ignore the lavish attention he spends on her but ..."}, {"url": "https://www.imdb.com/title/tt0057681/reviews", "page_content": "3 /10\n\nWarning: Spoilers\n\n**this review contains spoilers**\n\n\n\nFinally got a chance to catch this movie on TCM the other day, and what a disappointment it was. I mean, this movie seemed like a slam-dunk from the description. James Garner, fresh from Maverick, playing a Texas oilman who isn't above a con or two. And Lee Remick, one of the most beautiful women in the movies, playing a stock analyst. Put 'em in one of those big, glossy Hollywood comedies they made in the early sixties, with all the wonderful character actors who were around at the time, like Jim Backus and Pat Harrington, and you have a heckuva package.\n\n\n\nSo I always wondered why all the movie-review books gave it a mediocre rating.\n\n\n\nWell, now I know. This movie just doesn't make any sense. It's incoherent. Garner and Remick are immensely appealing, and I especially would have liked to have bumped into Remick on Wall Street in 1963, though if I had I wonder if I would have retained the power of speech, so gorgeous she was. But you know, to be successful, a movie needs more than actors. It also needs a storyline that works.\n\n\n\nThis one? Well, it starts out with Garner drilling for oil in Texas, and hitting a dry hole. He discovers he and his company are broke and he needs to go to New York to raise some money. He has some leases that are about to expire.\n\n\n\nSo he goes to Wall Street and immediately convinces three financiers to put up $300,000. That's all the money he asked them for. So is the problem solved? I dunno. The movie doesn't tell us.\n\n\n\nThen Garner goes to a brokerage and tries to sell the owner on buying stock in his company. Okay, so maybe that $300,000 didn't solve the problem. Who knows? Anyway, here he meets Lee Remick.\n\n\n\nShe has another mission. She has to sell stock in a widget firm or else she'll be fired. She figures Garner is her mark. Okay, not a bad setup. Romance ensues, with all the usual complications.\n\n\n\nHere we start seeing the stuff that doesn't make sense. Garner buys a restaurant. I guess he wants to impress Remick. But he's broke, scrambling for cash. Huh?\n\n\n\nThen he hooks up with a painter, disappears for a week in Europe and starts buying up abstract paintings. I guess it's because he thinks Remick is into abstract art. There's some blather about how the whole thing is a tax dodge. He can make ten cents on the dollar by donating to museums. But again, he's broke, his company needs every dime. Huh?\n\n\n\nThree fellow Texans arrive on the scene, apparently so eager to invest in Garner's schemes that they flew after him to New York in their private jet. Does he pitch them on his drilling venture? No. He sells them on joining the painting scheme instead. Huh?\n\n\n\nThere's a throwaway line in there somewhere, indicating that the Texans aren't keen on oil ventures. Okay, I'll grant the movie that -- it's a stab at logic -- but Garner never even tries to ask them for money. Here we are at the halfway point of the movie and this is the last time we even get a hint about his problems in Texas. This whole idea is abandoned. We never find out what happens to Garner's Texas drilling venture.\n\n\n\nNow we get into an entirely new storyline. Garner, for some unexplained reason, decides to run up the price of the widget company stock. What is the scheme? What is the con? I don't get it.\n\n\n\nIs Garner planning to purchase stock on the cheap, then resell it? The final scene of the movie belies that. He purchased four percent of the stock and his buddies purchased 48 percent, and all of them kept every penny. So it wasn't a swindle. Okay, fine. But why does he expend 20 minutes of comedic gyration on running up the price?\n\n\n\nActually, the widget company stock sounds like a steal. Turns out the widget company is a holding company for AT&T stock, bought on the cheap befoie WWI, and the principals have been collecting fat dividends ever since. Why wouldn't Garner try to acquire a controlling interest as cheaply as possible? He could liquidate the widget company and make money by selling the AT&T stock. If this was the plan, that might make sense, but the movie owes it to viewers to explain it. And in this scenario it wouldn't make any sense for Garner to run up the price of the stock. Anyway, Garner doesn't even seem to recognize that the widget company has value. I just don't get it. Huh?\n\n\n\nAnd while this was playing out, I wanted to scream -- what about the Texas drilling venture? Anyway, all this is backdrop to the lovely romance between Garner and Remick, and it all culminates in a securities-fraud trial. The two of them do what they're supposed to, they're cute as heck and all that. But I say the \"heart\" part of the story doesn't work if the \"head\" part is a failure."}, {"url": "https://letterboxd.com/film/the-wheeler-dealers/", "page_content": "Oh, isn't it amazing how I sparkle so early in the morning?\n\nI LOVE LEE REMICK ABOVE ALL. She is that woman. She's got that presence.\n\nThis movie weirdly holds up--and not just since my last viewing in 2010 when I was 16 that I specifically remember writing a blog post about 😭--it holds up today. It's a truly dizzy look at American capitalism and stock market bros shenanigans in particular.\n\nFrom start to finish--inspired!\n\nLee Remick and James Garner should have been a screen pair for real, but at least we got Lee Remick and Jack Lemmon for life.\n\n(What doesn't hold up: a casually and cheerfully spoken slur to describe a type of Spanish one character speaks. 😠)"}, {"url": "https://celebs.filmifeed.com/wiki/jeannine-riley/", "page_content": "Blonde bombshell Jeannine Brooke Riley was born in Madera, California on October 1, 1940 and started her movie and TV career in 1962 with an unbilled movie part in the Rosalind Russell drama Five Finger Exercise (1962) and roles on the TV shows “Father of the Bride” and “Route 66,” not to mention an episode of “My Three Sons” aptly entitled “The Beauty Contest. The next year, she acted with Gary Clarke and Steve Ihnat in the low-budget suspense thriller Strike Me Deadly (1963). Towards the end of the same year, she and Ihnat also performed together in the stage play The Fourposter. While showing off her allure in western series Wagon Train” and “The Virginian,” Jeannine came to the attention of CBS producers who were on a TV rural roll with the huge series hits “The Andy Griffith Show” and “The Beverly Hillbillies”. At the time, Hillbilly cast member Bea Benaderet (as Cousin Pearl) had just been given the green light to star in her own bucolic series, Petticoat Junction (1963), playing Kate Bradley, a hotel-owning widowed mother of three beautiful nubile daughters. Actress Sharon Tate was initially cast in the role of the flirtatious daughter Billie Jo Bradley. However, when it was discovered that she had posed nude in photo shoots, they were forced to remove her from the family-friendly series sponsored by Ivory Soap before scandal and controversy could cause damage. Jeannine was the successful candidate when the role was recast. The actress was perfect for the role of the Daisy Mae-like oldest daughter who drew men to her like bees to honey, much to the enviousness of her younger sisters who were more easily influenced. Both Jeannine and Pat Woodell, who portrayed her sister Bobbie Jo, decided to leave the series after two years of playing their respective roles on the show. While Jeannine had her sights set on a future in the film industry, Woodell had his sights set on the music industry. Woodell would later marry and divorce Gary Clarke, who starred with Jeannine in the film Strike Me Deadly (1963). In 1965, Gunilla Hutton and Lori Saunders were cast in the roles that had previously been occupied by Jeannine and Pat. While the actress continued on with TV guest roles on “Ozzie and Harriet,” “The Man From U.N.C.L.E.,” and “Occasional Wife,” and as a on “The sometimes-sexy foil on “The Smothers Brothers Show,” she soon appeared as sexpot Bambi Berman in the Jerry Lewis film vehicle The Big Mouth (1967), and in unsold pilots of Sheriff Who (1967) and Li’l Abner (1967); in There was also a return to ground previously covered in guest episodes of “The Wild, Wild West” and “Gomer Pyle,” respectively. After starring alongside Nick Adams in one of his final films before his untimely death, the action drama Fever Heat (1968), Jeannine appeared in her first quality film showcase, albeit in a smaller part, with The Comic (1969), which was a moving showcase for nimble Dick Van Dyke as a silent screen star. The film was a showcase for Dick Van Dyke’s ability to portray a silent screen star. She landed an even greater part as the dancer and barmaid hottie Jolene alongside the biker Robert Blake in the cult film Electra Glide in Blue (1973), in which the two of them had some intense naked moments. Back in the country fold on series TV, she appeared in two seasons of the cornpone musical variety show Hee Haw (1969), in which she was featured as a Daisy Mae-like foil in silly skits. A couple years later she was cast in the “Gilligan’s Island”-inspired TV western Dusty’s Trail (1973) with Bob Denver and Forrest Tucker co-starring as Gilligan/Skipper-like characters; Jeannine’s Lulu McQueen was a dead-on take on the pneumatic Ginger Grant role. Born on October 1, 1940, Jeannine Riley hails from Madera, United States. As in 2023, Jeannine Riley's age is 82 years. Check below for more deets about Jeannine Riley. This page will put a light upon the Jeannine Riley bio, wiki, age, birthday, family details, affairs, controversies, caste, height, weight, rumors, lesser-known facts, and more. Edit Profile\n\nJeannine Riley Biography:\n\nJeannine Riley Age and Birthday Jeannine Riley was born on October 1, 1940 in Madera, United States.\n\nJeannine Riley Wiki:\n\nEdit Profile\n\nJeannine Riley Family Details Jeannine Riley‘ father’s name is N/A and Jeannine Riley‘ mother’s name is N/A.\n\nJeannine Riley Trivia Jeannine Riley was born in Madera, United States.\n\nJeannine Riley‘s birth sign is Libra.\n\nBlonde bombshell Jeannine Brooke Riley was born in Madera, California on October 1, 1940 and started her movie and TV career in 1962 with an unbilled movie part in the Rosalind Russell drama Five Finger Exercise (1962) and roles on the TV shows “Father of the Bride” and “Route 66,” not to mention an episode of “My Three Sons” aptly entitled “The Beauty Contest. The next year, she acted with Gary Clarke and Steve Ihnat in the low-budget suspense thriller Strike Me Deadly (1963). Towards the end of the same year, she and Ihnat also performed together in the stage play The Fourposter. While showing off her allure in western series Wagon Train” and “The Virginian,” Jeannine came to the attention of CBS producers who were on a TV rural roll with the huge series hits “The Andy Griffith Show” and “The Beverly Hillbillies”. At the time, Hillbilly cast member Bea Benaderet (as Cousin Pearl) had just been given the green light to star in her own bucolic series, Petticoat Junction (1963), playing Kate Bradley, a hotel-owning widowed mother of three beautiful nubile daughters. Actress Sharon Tate was initially cast in the role of the flirtatious daughter Billie Jo Bradley. However, when it was discovered that she had posed nude in photo shoots, they were forced to remove her from the family-friendly series sponsored by Ivory Soap before scandal and controversy could cause damage. Jeannine was the successful candidate when the role was recast. The actress was perfect for the role of the Daisy Mae-like oldest daughter who drew men to her like bees to honey, much to the enviousness of her younger sisters who were more easily influenced. Both Jeannine and Pat Woodell, who portrayed her sister Bobbie Jo, decided to leave the series after two years of playing their respective roles on the show. While Jeannine had her sights set on a future in the film industry, Woodell had his sights set on the music industry. Woodell would later marry and divorce Gary Clarke, who starred with Jeannine in the film Strike Me Deadly (1963). In 1965, Gunilla Hutton and Lori Saunders were cast in the roles that had previously been occupied by Jeannine and Pat. While the actress continued on with TV guest roles on “Ozzie and Harriet,” “The Man From U.N.C.L.E.,” and “Occasional Wife,” and as a on “The sometimes-sexy foil on “The Smothers Brothers Show,” she soon appeared as sexpot Bambi Berman in the Jerry Lewis film vehicle The Big Mouth (1967), and in unsold pilots of Sheriff Who (1967) and Li’l Abner (1967); in There was also a return to ground previously covered in guest episodes of “The Wild, Wild West” and “Gomer Pyle,” respectively. After starring alongside Nick Adams in one of his final films before his untimely death, the action drama Fever Heat (1968), Jeannine appeared in her first quality film showcase, albeit in a smaller part, with The Comic (1969), which was a moving showcase for nimble Dick Van Dyke as a silent screen star. The film was a showcase for Dick Van Dyke’s ability to portray a silent screen star. She landed an even greater part as the dancer and barmaid hottie Jolene alongside the biker Robert Blake in the cult film Electra Glide in Blue (1973), in which the two of them had some intense naked moments. Back in the country fold on series TV, she appeared in two seasons of the cornpone musical variety show Hee Haw (1969), in which she was featured as a Daisy Mae-like foil in silly skits. A couple years later she was cast in the “Gilligan’s Island”-inspired TV western Dusty’s Trail (1973) with Bob Denver and Forrest Tucker co-starring as Gilligan/Skipper-like characters; Jeannine’s Lulu McQueen was a dead-on take on the pneumatic Ginger Grant role. Edit Profile\n\nGoogle Search Trends of Jeannine Riley Jeannine Riley‘s search trend from the last 12 months (The below graph report is directly fetched from the ‘Google Trends’):\n\nFAQs\n\nJeannine Riley was born on October 1, 1940.\n\nAs in 2023, Jeannine Riley's age is 82 years.\n\nJeannine Riley‘s birth sign is Libra.\n\nJeannine Riley was born in Madera, United States.\n\nAs per the report, Jeannine Riley lives in Madera, California, United States.\n\nJeannine Riley‘s hobbies are Reading, photography, learning, traveling, internet surfing and to name a few.\n\nJeannine Riley holds nationality.\n\nJeannine Riley‘s Instagram profile link read as .\n\nMost searched terms about Jeannine Riley on the Internet are Jeannine Riley age, Jeannine Riley wiki, Jeannine Riley photos, Jeannine Riley lover, Jeannine Riley instagram, Jeannine Riley facebook, Jeannine Riley family, Jeannine Riley salary, Jeannine Riley height, Jeannine Riley bio, Jeannine Riley income, Jeannine Riley house, Jeannine Riley latest news, Jeannine Riley tiktok, Jeannine Riley dating, Jeannine Riley musically.\n\nFact Check:\n\nWe strive for accuracy and fairness. If you see something that doesn’t look right, Contact Us. Edit Profile"}, {"url": "https://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-27570", "page_content": "Movie details\n\n\"He really wasn't out to make $1,000,000. He already had that!\". Henry J. Tyroone leaves Texas, where his oil wells are drying up, and arrives in New York with a lot of oil money to play with in the stock market. He meets stock analyst Molly Thatcher, who tries to ignore the lavish attention he spends on her but ...\n\nMovie rating: 6.5 / 10 (1392)\n\nDirected by: Arthur Hiller - George J.W. Goodman - Ira Wallach\n\nWriter credits: George J.W. Goodman\n\nCast: James Garner - Lee Remick - Phil Harris - Chill Wills - Jim Backus\n\nAKA: Camas separadas, Separate Beds\n\n"}]}