{"Jeanine Riley is best known for her role as Billie Jo Bradley on the television series Petticoat Junction (1964–1970).": [{"url": "https://doyouremember.com/157936/jeannine-riley-career-then-now", "page_content": "Billie Jo Bradley was a model of ambition and unbridled hope and awe in Petticoat Junction and none other than Jeannine Riley debuted the role in 1963. Two others would follow, but not before Riley left a permanent mark on the show and set the stage for seven seasons of Billie Jo greatness. But what about Riley herself? What trajectory did her career follow? In short, one her character would have been proud of.\n\nJeannine Riley was born on October 1, 1940, and grew up in California for much of her upbringing after her father left for the Army and her family planted roots in Madera. She learned acting and the ways of show business in the Pasadena Playhouse while also performing ballet. She started working on television and an uncredited role in the 1962 movie Five Finger Exercise before television work arose in greater succession. Early credits included Father of the Bride, My Three Sons, Route 66, and The Beauty Contest. Indeed, her easy, approachable grace helped pave the way for more and more prominence on TV not long into her career.\n\nWhy did Jeannine Riley leave ‘Petticoat Junction’?\n\nHer career had just begun in 1962 and still Jeannine Riley managed to turn some important heads. Namely, CBS producers noticed her while she acted in Wagon Train and The Virginian and as rural shows dominated televisions, they wanted Riley for their next big project: Petticoat Junction. With the rural purge still a decade away, the wholesome series joined the ranks of Beverly Hillbillies and The Andy Griffith Show as a recipe for success. Initially, actress and model Sharon Tate was slated to originate the role of Billie Jo, but after a nude photoshoot, she was deemed too risque for a series sponsored by Ivory Soap; Riley ended up winning the role of 300 other hopefuls.\n\nRiley channeled that easy charisma into her role and won hearts on-screen and off. But just like her character possessed endless aspirations, so too did Riley, and after two years she bowed out of the series to pursue a film career, as well as try out some other shows, including Gilligan’s Island and Hee Haw. She did make it into movies as planned, such as The Big Mouth and Fever Heat. One of her most prominent roles came in 1973 as Lulu McQueen in Dusty’s Trail, which saw Riley as a kind of Ginger Grant in a western reimagining of Gilligan’s Island complete with Bob Denver himself and Lori Saunders.\n\nIt’s about time to be a bolder woman\n\nRiley wanted to break away from roles that cast her on the basis of her looks alone but found this a difficult endeavor. New opportunities grew fewer. Her final film came with 1991’s Timebomb, a science-fiction action movie starring Michael Biehn. She retired that same year but stays involved in the industry in other ways; the 2016 book X Child Stars: Where Are They Now? offers a look at her life and career. Her personal life included marriage first to Gary Groom from 1965 to 1972, then Irwin Radnitz in 1974 until they too divorced.\n\nWhile Riley is not reported to have any children, she has still used her life’s experiences to guide the next generation. In typical Billie Jo fashion, she wants to see women be successful, something she herself is familiar with. In 2020, she penned the book The Bolder Woman: It’s About Time, all about encouraging and instructing women on how they can follow their dreams at any age. “Come along with me as I reveal how I overcame my own fear of aging and being labeled an old woman just because I’d reached a certain number of years,” Riley invites readers. “Your many years of living has brought you this far, so why stop now?”\n\nWe certainly hope Riley doesn’t stop for a long time!"}, {"url": "https://biographytribune.com/what-happened-to-actress-jeannine-riley-her-bio-height-husband-net-worth-today-petticoat-junction-children/", "page_content": "• Jeannine Brooke Riley is an American actress, best known for her role in the series “Petticoat Junction”.\n\n• She has a net worth of $4 million, earned through a successful acting career.\n\n• She started her acting career in the early 1960s and has since appeared in numerous television shows and feature films.\n\n• She starred in the sitcom “Petticoat Junction” and the comedy variety series “Hee Haw”.\n\n• She married twice but there are no reported children from her marriages.\n\nKnown for movies\n\nPetticoat Junction (1963-1965)\n\nas Billie Jo Bradley Electra Glide in Blue (1973)\n\nas Jolene Dusty's Trail (1973-1974)\n\nas Lulu McQueen Strike Me Deadly (1963)\n\nas Lori Grant\n\nShort Info Fact Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton.\n\n﻿﻿﻿﻿\n\nWho is Jeannine Riley?\n\nJeannine Brooke Riley was born on 1 October 1940, in Madera, California USA, and is an actress, perhaps still best known for her role as Billie Jo Bradley in the series entitled “Petticoat Junction”, appearing in the first two seasons of the show during the mid-‘60s.\n\nThe Riches of Jeannine Riley\n\nHow rich is Jeannine Riley? As of late-2018, sources estimate a net worth that is at $4 million, earned through a successful career in acting. She’s also appeared in numerous other television shows and feature films throughout her career, and as she continues her endeavors even well into her ‘70s, it is expected that her wealth will also continue to increase.\n\nCareer Beginnings\n\nWhile virtually no information is available about Jeannine’s early life, it is known that she developed an interest in acting at a young age. She started her career in the early 1960s, appearing in small or uncredited roles in projects such as “Five Finger Exercise”. In 1963, she was cast in the sitcom “Petticoat Junction” in the role of Billie Jo Bradley, set in the Shady Rest Hotel run by Kate Bradley, her three daughters and her uncle. The series was created after the success of “The Beverly Hillbillies” and the success of this show led to the spin-off entitled “Green Acres”.\n\nShe stayed with the show until 1965, then decided to leave the series to pursue more film work, replaced by Gunila Hutton and later Meredith MacRae during the latter seasons. Jeannine then started to do film work in the late 1960s, appearing in “The Big Mouth” as Bambi Berman, filmed in San Diego and featuring Frank De Vol as an on-screen narrator.\n\nThe 3 original Bradley Sisters…Betty Jo {Linda Kaye Henning}, Bobbi Jo {Pat Woodell}, and Billie Jo {Jeannine Riley.} Posted by Debbie Spivey on Saturday, January 26, 2019\n\nCareer Prominence\n\nThe following year Riley was cast in “Fever Heat”, which was directed by Russell S. Doughten and starring alongside Nick Adams and Norman Alden. In 1969 she was cast in the film “The Comic”, co-written and co-produced by Carl Reiner and starring Dick Van Dyke, Michele Lee and Mickey Rooney in a film inspired by the end of the silent film era.\n\nAfter that she returned to television, as she was cast in a regular role in the comedy variety series entitled “Hee Haw” during the same year, which was set in fictional rural Kornfield Kounty, and inspired by “Rowan & Martin’s Laugh-In”. The show centered on rural culture and country music, with hosts Buck Owens as well as Roy Clark, but would often feature scantily clad women in stereotypical farmer’s daughters attire, who came to be known as the Hee Haw Honeys. She stayed with the show for three years, and then joined another show in “Dusty’s Trail”, in which she played Lulu McQueen, a western-theme take-off of Ginger Grant from “Gilligan’s Island”, also starring Forrest Tucker and Bob Denver.\n\nLater Career\n\nOver the next few years, Jeannine had small roles in television shows such as “The Wild Wild West”, “Route 66”, and “The Man from U.N.C.L.E.” She then featured in the film “Electra Glide in Blue”, which starred Robert Blake as a motorcycle cop alongside Billy “Green” Bush, and based on the Harley-Davidson Electra Glide motorcycle used by traffic police. During the same year, she had an uncredited role in “The Outfit”, actually appearing as a prostitute in an adaptation of the novel of the same name by Richard Stark under the pseudonym Donald E. Westlake.\n\nAs the years progressed, Jeannine took fewer roles; she was a part of the 1980s project entitled “Lone Star Bar & Grill” as Arlene, and one of her last projects was the 1991 film entitled “Timebomb”, which starred Michael Biehn, Richard Jordan and Patsy Kensit.\n\nPersonal Life\n\nFor her personal life, it is known that Riley married Gary Groom in 1965 but their marriage ended in divorce in 1972. She married once more in 1974 to Irwin Radnitz but it was also a marriage that ended in divorce. There are no reported children from her marriages.\n\nSince retiring from acting work, very little information has been shared about her. One of the reasons is due to the fact that she does not have any accounts on major social media websites. In 2016, a book was released entitled “X Child Stars: Where Are They Now”, written by Kathy Garver and Fred Ascher, which contained a profile of her along with her career. Many sources speculate that since ending her acting career, she focused more on other endeavors, and likely another marriage and a family, but there is no evidence to confirm these speculations.\n\nFacts # Fact 1 Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton. Pictures Movies Actress Title Year Status Character Timebomb 1991 Landlady High Mountain Rangers 1988 TV Series Marge Russell Lone Star Bar & Grill 1983 Arlene Like Normal People 1979 TV Movie Donna (as Jennine Riley) James at 16 1978 TV Series Rochelle Nashville 99 1977 TV Series Dusty's Trail 1973-1974 TV Series Lulu McQueen The Outfit 1973 Prostitute (uncredited) Electra Glide in Blue 1973 Jolene Of Thee I Sing 1972 TV Movie Hotel Chambermaid Love, American Style 1969-1971 TV Series Cindy Lou (segment \"Love and the Traveling Salesman\") / Maria (segment \"Love and the Big Date\") / Marylou Haskins (segment \"Love and the Wild Party\") The Comic 1969 Lorraine Margaret Bell Gomer Pyle: USMC 1969 TV Series Wendy Sparks Fever Heat 1968 Sandy Richards The Wild Wild West 1967 TV Series Aimee Baldwin Li'l Abner 1967 TV Movie Daisy Mae Sheriff Who 1967 TV Movie Betsy The Big Mouth 1967 Bambi Berman The Man from U.N.C.L.E. 1966-1967 TV Series Nina Lillette / Andy Francis Occasional Wife 1966 TV Series Linda Mister Roberts 1966 TV Series My Brother the Angel 1966 TV Series Dolores The Adventures of Ozzie & Harriet 1963-1965 TV Series Pam / Susan Convoy 1965 TV Series Suzie Mae Humbolt Petticoat Junction 1963-1965 TV Series Billie Jo Bradley Strike Me Deadly 1963 Lori Grant The Virginian 1963 TV Series Amelia Pryor Wagon Train 1963 TV Series Susan Forbes My Three Sons 1962 TV Series Kim Route 66 1962 TV Series Molly Cross Father of the Bride 1962 TV Series Five Finger Exercise 1962 Girl (uncredited) Soundtrack Title Year Status Character Petticoat Junction 1963-1965 TV Series performer - 8 episodes Self Title Year Status Character Hee Haw 1969-1971 TV Series Herself The New Truth and Consequences 1970 TV Series Herself The Real Tom Kennedy Show 1970 TV Series Herself The Hollywood Squares 1970 TV Series Guest Appearance The Ed Sullivan Show 1964 TV Series Singer\n\nSource: IMDb"}, {"url": "https://justrichest.com/jeannine-riley-bio/", "page_content": "Jeannine Riley hit it big in the 60s when she scored a role as Billie Jo Bradley in the series Petticoat Junction. She appeared on the show’s first two seasons which lasted up until the mid-1960s and then had memorable stints in a string of other productions, including Route 66, The Man From U.N.C.L, Fever heat, and The Comic.\n\nHowever, she probably stopped enjoying acting as she started to scale back on her appearances in the ’90s and soon, she left the limelight completely. Her last film role was as Landlady in the 1991 film Timebomb. Since this role, Jeannine has not appeared in any film or does she plan to do so soon. However, her exit from the spotlight without officially announcing her retirement has many people wondering where she is now and what lead to her disappearance.\n\nJeannine Riley’s Biography\n\nJeannine Riley was born in Madera, California USA, on 1st October 1940 and named Jeannine Brooke Riley. From the look of things, the actress must’ve been one of the most enigmatic actresses in her time as there is no information about her. Not even her educational history, or childhood, despite the terrific fame she enjoyed during her active years in the film industry. The much that is known about her is that she began her acting career professionally in 1962 with a role in the Rosalind Russell drama Five Finger Exercise.\n\nShe followed the role up with an appearance in Father of the Bride, My Three Sons and Route 66. At age 23, she appeared in the suspense drama Strike Me Deadly with Gary Clarke and Steve Ihnat. She went on to work with Ihnat in The Fourposter – a stage play.\n\nAt this point, she had started to gradually climb the prestigious career ladder. Her performances in Wagon Train and The Virginian helped to solidify her position in the limelight and drew the interest of CBS. It also prepared a stage for her star-making role in Petticoat Junction (1963) as one of the daughters of Kate Bradley – played by Bea Benaderet. The role remains what she is known for to date.\n\nMeanwhile, she was not the first choice for the role. Sharon Tate was chosen for it but the actress lost the slot when she got involved in nude photoshoots, mostly because explicit contents were seen as somewhat a taboo at that time. Luckily, Jeannine was picked to replace Tate when her role was recast.\n\nAfter two seasons of the series, Jeannine Riley left and was replaced by Gunilla Hutton. Even after she left the show, life stayed kind to her acting career as she made more TV appearances including guest-starring on Ozzie and Harriet. She also played a part on the Smothers Brothers Show. In 1967, she secured roles in different films; The Big Mouth, The Wild, Gomer Pyle and a lot more.\n\nThe following year, she worked with Nick Adams in Fever Heat (1968), which is among the last films of the actor before his demise. After a few more acting works in the 1960s, her next appearance was in 1973 – in Electra Glide in Blue. At this point, Hollywood was beginning to accept nudity and Jeannine was willing to show some skin. Her nude scenes in the movie made her an instant star but Jeannine probably wanted something else as her presence on TV started to reduce following this role. In 1991, she left completely after starring in the film, Timebomb.\n\nHer Family\n\nAs mentioned earlier, Jeannine Riley doesn’t let people into matters concerning her private life. So, nothing is known about her siblings, parents, or any other relative. It is, however, known that she has been married twice and none of her marriages survived the test of time. Her first marriage was to Gary Grom in 1965. It failed in 1972 and in less than two years after their divorce, Jeannine married Irwin Radnitz which ended in a similar manner. None of her marriages or past relationships produced a child and since then, her love life has been blurred from the public.\n\nRead Also: Who Was Ann Sothern?\n\nWhere Is Jeannine Riley Now?\n\nNobody is sure of what Jeannine has been up to since 1991 when she left the spotlight. She probably wants nothing more than people knowing less about her as she is not even active on social media either, making it very difficult to dig out anything about her. But there are rumors that she left the acting scene possibly to focus on her family while others have taken the view that she pursued a different career. Nonetheless, these rumors haven’t been confirmed to-this-date. In this regard, her whereabouts remain a mystery."}, {"url": "https://alchetron.com/Jeannine-Riley", "page_content": "Jeannine Riley (born October 1, 1940 in Madera, California, USA) is an American actress.\n\nContents\n\nRiley has appeared in guest roles on numerous television series (Route 66, The Man from U.N.C.L.E., The Wild Wild West) and a few feature films such as The Big Mouth (1967), Fever Heat (1968), The Comic (1969) and Electra Glide in Blue (1973).\n\nAlso made a guest appearance in an episode of The Virginian.\n\nShe is perhaps best known for her role as Billie Jo Bradley on the first two seasons of the CBS sitcom Petticoat Junction (1963–1965). Riley left the series in 1965 to pursue movies, and she was replaced by Gunilla Hutton for season three and by Meredith MacRae from seasons four to seven. She also had a regular cast member role on the comedy variety series Hee Haw (1969–1971).\n\nShe played Lulu McQueen (a take-off on Ginger Grant, played by Tina Louise, from Gilligan's Island) on the western sitcom Dusty's Trail, which aired from 1973 to 1974."}, {"url": "https://www.moviefone.com/celebrity/jeannine-riley/1825556/main/", "page_content": "From Wikipedia, the free encyclopedia Jeannine Riley Born Jeannine Brooke Riley October 1, 1940 (age 77) Madera, California, U.S. Occupation Actress Years active 1962–1991 She appeared in guest roles on numerous television series (Route 66, The Man from U.N.C.L.E., The Wild Wild West) and a few feature films such as The Big Mouth (1967), Fever Heat (1968), The Comic (1969) and Electra Glide in Blue (1973).\n\nAlso made a guest appearance in an episode of The Virginian. She may be best-known for her role as Billie Jo Bradley on the first two seasons of the CBS sitcom Petticoat Junction (1963–1965). Riley left the series in 1965 to pursue movies, and she was replaced by Gunilla Hutton for season three and by Meredith MacRae from seasons four to seven. She also had a regular cast member role on the comedy variety series Hee Haw (1969-71).\n\nShe played Lulu McQueen (a take-off on Ginger Grant, played by Tina Louise, from Gilligan's Island)"}, {"url": "https://articlebio.com/jeannine-rley", "page_content": "Billie Jo Bradley from CBS sitcom Petticoat Junction, Jeannine Riley is an American actress active from 1962 to 1991. She is also known for her roles in Electra Glide in Blue, Dusty's Trail, and Timebomb.\n\nShort-Biography: Age And Nationality\n\nJeannine Riley was born Jeannine Brooke Riley on October 1, 1940, in Madera, California, the United States of America. As of May 20121, she is at the age of 80. She is an American citizen and belongs to white ethnicity.\n\nRiley always kept her private life confidential. The details of her parents, siblings, and education are still unavailable.\n\nCareer Highlights: Popular Movies And TV Roles\n\nThe veteran actress made her acting debut with the television series Dr. Kildare in 1962. The same year, she appeared in films and series like Five Finger Exercise, Father of the Bride, Route 66, and My Three Sons.\n\nEventually, Riley played various roles in some episodes of TV shows such as Wagon Train, The Virginian, Strike Me Deadly, and The Ed Sullivan Show. From 1963 to 1965, she came to the spotlight as Billie Jo Bradley in the CBS sitcom Petticoat Junction starring Bea Benaderet, Edgar Buchanan, Linda Kaye Henning, and Lori Saunders.\n\nCAPTION: Petticoat Junction actress Jeannine Riley SOURCE: P-Interest\n\nAdditionally, 80 years old actress is also a notable part of movies and TV shows such as Convoy, My Brother the Angel, Occasional Wife, The Man from U.N.C.L.E., The Wild Wild West, and Love, American Style. In 1973, she portrayed Jolene in the film Electra Glide in Blue starring Robert Blake, Mitchell Ryan, and Elisha Cook.\n\nPetticoat Junction star's other notable acting credits include Dusty's Trail, Nashville 99, James at 16, Like Normal People, Lone Star Bar & Grill, High Mountain Ranger, and Timebomb.\n\nHow Much Is Her Net Worth?\n\nWith the experience of almost 3 decades in the entertainment industry, Petticoat Junction actress has gathered an impressive sum of dollars. During her active years, she earned a salary of hundreds of thousands from her movies and series.\n\nProfessional from 1962 to 1991, Jeannine Riley has an estimated net worth of $1 million in May 2021.\n\nRelationship History: Husband And Childern\n\nThe legendary former actress Jeannine has been twice married and divorced in her life. First of all, she tied the knot with her first husband, Gary Groom on June 24, 1965. Later, citing irreconcilable differences, the couple divorced.\n\nAfter 9 long years, Riley exchanged wedding vows with her second spouse Irwin Radnitz. Unfortunately, their relationship also could not last and the duo split from each other.\n\nSince then, Dusty's Trail's actress neither has talked about her private life nor she is spotted with anyone. She also does not have any kids.\n\nWhere Is Jeannie Riley Now?\n\nIt would not be wrong to state that Riley just disappeared from the limelight after her retirement in 1991. She has always preferred to stay away from the public eye even when she was of the popular faces of the TV world, so, it did not come as s surprise when she just vanished from Hollywood.\n\nCAPTION: Legendary actress Jeannine Riley was active in the entertainment world from 1962 to 1991. SOURCE: Listal\n\nThough no one actually knows where is she now and what is she doing, one thing is sure that she is living the life, she always wanted."}, {"url": "https://bodysize.org/en/jeannine-riley/", "page_content": "Jeannine Brooke Riley (born October 1, 1940, Madera, California) is an American actress.\n\nShe appeared in guest roles on numerous television series (Route 66, The Man from U.N.C.L.E., The Wild Wild West) and a few feature films such as The Big Mouth (1967), Fever Heat (1968), The Comic (1969) and Electra Glide in Blue (1973). Also made a guest appearance in an episode of The Virginian.\n\nShe may be best known for her role as Billie Jo Bradley on the first two seasons of the CBS sitcom Petticoat Junction (1963–1965). Riley left the series in 1965 to pursue movies, and she was replaced by Gunilla Hutton for season three and by Meredith MacRae from seasons four to seven. She also had a regular cast member role on the comedy variety series Hee Haw (1969–71). She played Lulu McQueen (a take-off on Ginger Grant, played by Tina Louise, from Gilligan's Island) on the western sitcom Dusty's Trail, which aired from 1973-74."}, {"url": "https://jeannineriley.com/about-jeannine/", "page_content": "Born in California’s bountiful San Joaquin Valley, between Yosemite and Carmel, Jeannine’s career path was influenced early on at the local movie theater. It was there she first experienced the limitless power of imagination and creativity, realizing she too could create something from nothing. It was so very real and magical, all at the same time.\n\n\n\nOn the big screen, she co-starred with legends such as Dick Van Dyke, Jerry Lewis, and Carl Reiner, before earning a Cannes Film Festival nomination for Best New Actress in her role opposite Robert Blake in Electra Glide in Blue.\n\n\n\nThen, in the early 80s, Jeannine had an epiphany and was compelled to put her career aside to follow a different calling. For the next 25 years, she dedicated her life to the spiritual path, often traveling to India to study with living masters. Over the years, she grew from being the student to becoming a certified teacher of meditation. Later, after developing her unique seminars on ‘The Inner Stage’ and ‘Creativity,’ Jeannine traveled from Maui to Taos, Idyllwild to Sundance, Hollywood to New York, and many other venues stimulating the minds of actors, writers, and people from all walks of life.\n\nToday, at the amazing age of 80, Jeannine has embarked on a new speaking career centered around her new book, ‘The Bolder Woman.’ This gritty, unabridged message will rock the way today’s society uses that tight, confining box called ‘old age’ to pigeon-hole women over the age of 60—solely because of a number.\n\nSo, for all you brave and curious ladies who are ready to go from just being older to living Bolder, climb aboard for the ride of your life.\n\n\n\n“Old Age is no place for sissies.”\n\nBette Davis"}, {"url": "https://www.thefamouspeople.com/profiles/gunilla-hutton-44117.php", "page_content": "Since a tender age, Gunilla displayed a keen interest in acting. She was majorly inclined to the world of theater and even participated in several school plays and shows. Following her graduation, Gunilla began her career, both as a singer and an actor.\n\nGunilla was born Gunilla Wiklund, on May 15, 1944, in Gothenburg, the second-largest city of Sweden. She later moved to the US, where she attended 'Arlington Heights High School' in Fort Worth, Texas.\n\nRecommended Lists:\n\nCareer\n\nGunilla made her acting debut with the black-and-white 'CBS' sitcom 'Petticoat Junction.' She essayed the role of the blonde daughter of ‘Kate Bradley,’ ‘Billie Jo Bradley,’ for 34 episodes, from 1965 to 1966. Gunilla took over the role from Jeannine Riley. After Gunilla ended her stint on the show, her role was played by Meredith MacRae. Meredith appeared on the show from 1966 until the end of the show in 1970.\n\nToward the end of her stint in 'Petticoat Junction,' Gunilla appeared in a 1965 episode of the mystery crime-drama series 'Perry Mason.' Her next significant TV project was the 'CBS' variety country music show 'Hee Haw.' Gunilla was a regular cast member (238 episodes, from 1969 to 1992) on the show, which featured the fictional rural Kornfield Kounty. The series was later aired on 'TNN' and finally on 'RFD-TV.'\n\nMeanwhile, Gunilla appeared in a few more game and variety shows. She appeared as a panelist on the ‘NBC’ panel game show 'Match Game' (5 episodes in 1974) and the 'CBS' (later 'ABC') game show 'Password.' In 1979, she played ‘Nora Hayman’ in two episodes of the ‘ABC’ comedy/drama series 'The Love Boat,' which was majorly shot on the cruise ship 'S.S. Pacific Princess.' The following year, Gunilla was seen as ‘Raquel’ in the comedy TV movie 'Murder Can Hurt You.' She appeared as ‘Priscilla’ in an episode of the 'ABC' series 'Fantasy Island' and as ‘Lady Godiva’ in another episode of the same series. In 1983, she appeared in three episodes of the ‘ABC’ (later ‘CBS’ and in syndication) game show 'Family Feud.'\n\nIn addition to her acting projects, Gunilla simultaneously continued her stint as a singer. However, her career in the music industry was short-lived. In 1972, she released her debut single, 'Greatest Story Ever Told'/'You Can Say the Prettiest Things Sometimes,' under 'Dial Records.' In the subsequent years, she released 'Chowchilla Dust'/'We've Got Old Fashioned Love for ‘Green Mountain,' 'You're Gonna Get Loved'/'See the Lady Cryin' for 'ABC/Dot.' Her final release was 'Cody'/'The End of Our Love Song' for ‘ABC/Dot’ in 1975."}, {"url": "https://allstarbio.com/jeannine-riley-bio-husband-net-worth-age-movies/", "page_content": "Quick Facts of Jeannine Riley Full Name Jeannine Riley\n\nNet Worth $1 Million\n\nDate of Birth 01 October, 1940\n\nNickname Jeannine\n\nMarital Status Divorced\n\nBirthplace Madera, California, United States\n\nEthnicity White\n\nProfession Actress\n\nNationality American\n\nEye colour Brown\n\nHair colour Blonde\n\nHeight 5 feet 6 inches (1.68m)\n\nChildren 2\n\nHoroscope Libra\n\nAn American actress Jeannine Riley is known for her role as Billie Jo Bradley on the first two seasons of an American sitcom Petticoat Junction and also as a regular cast member role on the comedy variety series Hee Haw.\n\nThis American actress married twice in her life. However, Riley’s marriage failed. If so what is she doing now? Is she dating anyone? Let’s know more about Jeannine Riley.\n\nJeannine Riley Bio, Wiki\n\nJeannine Riley was born on October 1, 1940, in Madera, California under the zodiac sign Libra. She is American by nationality and belongs to white ethnic background. Asides her date of birth, there is no any details available about her childhood, as well as her academic background.\n\nWho is Jeannine Riley Husband?\n\nJeannie Riley has been married twice in her life. Initially, she got hitched with her boyfriend Gary Groom on 24 June 1965. However, the couple did not continue their relationship for a long time so they separated as per both their interests.\n\nAfter the divorced with Gary, Jeannie began dating Irwin Radnitz and tied the knot on 1 June 1974 in front of their few friends and family. Likewise her first marriage, Jeannie second marriage did not go for a long time as the couple separated.\n\nAs of now, Jeannie is living a single life.\n\nAlso Read: George O. Gore II Bio, Wiki, Net Worth, Girlfriend, Age\n\nJeannine Riley Net Worth\n\nJeannine Riley has collected a huge amount of money through his career as an actress. Her net worth is estimated to be around $1 Million as of 2019. It is not surprising looking at her successful career that she earned a decent amount of fortune.\n\nFurther, Jeannine has not disclosed the details of her salary but she earns the average salary of an American actress/ actor which is $50,110. So, Riley might be earning in the same range.\n\nWith the heavy amount of money, Jeannie must be living a luxurious life.\n\nAlso Read: Lisa Bolivar Bio, Wiki, Age, Net Worth, Husband & Career\n\nJeannine Riley Career\n\nJeannine Riley is an Amerinca actor. She began her acting career in a 1962 American drama film Five Finger Exercise she shared the screen along with Rosalind Russell Jack Hawkins, Richard Beymer. After that, she played the role of Lori Grant in Strike Me Deadly.\n\nIn addition, Riley also appeared as a guest role on the TV series Route 66, The Man from U.N.C.L.E., The Wild Wild West and others. Likewise, she also performed in a few feature films such as The Big Mouth (1967), Fever Heat (1968), The Comic (1969) and others.\n\nLikewise, Jeannie also had a regular cast member on the comedy series Hee Haw. In the show, she played along with Roy Acuff, Gordie Tapp, Grandpa Jones, and others."}]}