{"Jeanine Riley appeared in the spin-off series Green Acres (1965–1971).": [{"url": "https://biographytribune.com/what-happened-to-actress-jeannine-riley-her-bio-height-husband-net-worth-today-petticoat-junction-children/", "page_content": "• Jeannine Brooke Riley is an American actress, best known for her role in the series “Petticoat Junction”.\n\n• She has a net worth of $4 million, earned through a successful acting career.\n\n• She started her acting career in the early 1960s and has since appeared in numerous television shows and feature films.\n\n• She starred in the sitcom “Petticoat Junction” and the comedy variety series “Hee Haw”.\n\n• She married twice but there are no reported children from her marriages.\n\nKnown for movies\n\nPetticoat Junction (1963-1965)\n\nas Billie Jo Bradley Electra Glide in Blue (1973)\n\nas Jolene Dusty's Trail (1973-1974)\n\nas Lulu McQueen Strike Me Deadly (1963)\n\nas Lori Grant\n\nShort Info Fact Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton.\n\n﻿﻿﻿﻿\n\nWho is Jeannine Riley?\n\nJeannine Brooke Riley was born on 1 October 1940, in Madera, California USA, and is an actress, perhaps still best known for her role as Billie Jo Bradley in the series entitled “Petticoat Junction”, appearing in the first two seasons of the show during the mid-‘60s.\n\nThe Riches of Jeannine Riley\n\nHow rich is Jeannine Riley? As of late-2018, sources estimate a net worth that is at $4 million, earned through a successful career in acting. She’s also appeared in numerous other television shows and feature films throughout her career, and as she continues her endeavors even well into her ‘70s, it is expected that her wealth will also continue to increase.\n\nCareer Beginnings\n\nWhile virtually no information is available about Jeannine’s early life, it is known that she developed an interest in acting at a young age. She started her career in the early 1960s, appearing in small or uncredited roles in projects such as “Five Finger Exercise”. In 1963, she was cast in the sitcom “Petticoat Junction” in the role of Billie Jo Bradley, set in the Shady Rest Hotel run by Kate Bradley, her three daughters and her uncle. The series was created after the success of “The Beverly Hillbillies” and the success of this show led to the spin-off entitled “Green Acres”.\n\nShe stayed with the show until 1965, then decided to leave the series to pursue more film work, replaced by Gunila Hutton and later Meredith MacRae during the latter seasons. Jeannine then started to do film work in the late 1960s, appearing in “The Big Mouth” as Bambi Berman, filmed in San Diego and featuring Frank De Vol as an on-screen narrator.\n\nThe 3 original Bradley Sisters…Betty Jo {Linda Kaye Henning}, Bobbi Jo {Pat Woodell}, and Billie Jo {Jeannine Riley.} Posted by Debbie Spivey on Saturday, January 26, 2019\n\nCareer Prominence\n\nThe following year Riley was cast in “Fever Heat”, which was directed by Russell S. Doughten and starring alongside Nick Adams and Norman Alden. In 1969 she was cast in the film “The Comic”, co-written and co-produced by Carl Reiner and starring Dick Van Dyke, Michele Lee and Mickey Rooney in a film inspired by the end of the silent film era.\n\nAfter that she returned to television, as she was cast in a regular role in the comedy variety series entitled “Hee Haw” during the same year, which was set in fictional rural Kornfield Kounty, and inspired by “Rowan & Martin’s Laugh-In”. The show centered on rural culture and country music, with hosts Buck Owens as well as Roy Clark, but would often feature scantily clad women in stereotypical farmer’s daughters attire, who came to be known as the Hee Haw Honeys. She stayed with the show for three years, and then joined another show in “Dusty’s Trail”, in which she played Lulu McQueen, a western-theme take-off of Ginger Grant from “Gilligan’s Island”, also starring Forrest Tucker and Bob Denver.\n\nLater Career\n\nOver the next few years, Jeannine had small roles in television shows such as “The Wild Wild West”, “Route 66”, and “The Man from U.N.C.L.E.” She then featured in the film “Electra Glide in Blue”, which starred Robert Blake as a motorcycle cop alongside Billy “Green” Bush, and based on the Harley-Davidson Electra Glide motorcycle used by traffic police. During the same year, she had an uncredited role in “The Outfit”, actually appearing as a prostitute in an adaptation of the novel of the same name by Richard Stark under the pseudonym Donald E. Westlake.\n\nAs the years progressed, Jeannine took fewer roles; she was a part of the 1980s project entitled “Lone Star Bar & Grill” as Arlene, and one of her last projects was the 1991 film entitled “Timebomb”, which starred Michael Biehn, Richard Jordan and Patsy Kensit.\n\nPersonal Life\n\nFor her personal life, it is known that Riley married Gary Groom in 1965 but their marriage ended in divorce in 1972. She married once more in 1974 to Irwin Radnitz but it was also a marriage that ended in divorce. There are no reported children from her marriages.\n\nSince retiring from acting work, very little information has been shared about her. One of the reasons is due to the fact that she does not have any accounts on major social media websites. In 2016, a book was released entitled “X Child Stars: Where Are They Now”, written by Kathy Garver and Fred Ascher, which contained a profile of her along with her career. Many sources speculate that since ending her acting career, she focused more on other endeavors, and likely another marriage and a family, but there is no evidence to confirm these speculations.\n\nFacts # Fact 1 Jeannine Riley and Steve Ihnat co-starred together in the play, \"The Fourposter\", put on by the Sherman Oaks Playhouse for two months, from mid-April to mid-August, 1953. The play was directed by Roy Morton. Pictures Movies Actress Title Year Status Character Timebomb 1991 Landlady High Mountain Rangers 1988 TV Series Marge Russell Lone Star Bar & Grill 1983 Arlene Like Normal People 1979 TV Movie Donna (as Jennine Riley) James at 16 1978 TV Series Rochelle Nashville 99 1977 TV Series Dusty's Trail 1973-1974 TV Series Lulu McQueen The Outfit 1973 Prostitute (uncredited) Electra Glide in Blue 1973 Jolene Of Thee I Sing 1972 TV Movie Hotel Chambermaid Love, American Style 1969-1971 TV Series Cindy Lou (segment \"Love and the Traveling Salesman\") / Maria (segment \"Love and the Big Date\") / Marylou Haskins (segment \"Love and the Wild Party\") The Comic 1969 Lorraine Margaret Bell Gomer Pyle: USMC 1969 TV Series Wendy Sparks Fever Heat 1968 Sandy Richards The Wild Wild West 1967 TV Series Aimee Baldwin Li'l Abner 1967 TV Movie Daisy Mae Sheriff Who 1967 TV Movie Betsy The Big Mouth 1967 Bambi Berman The Man from U.N.C.L.E. 1966-1967 TV Series Nina Lillette / Andy Francis Occasional Wife 1966 TV Series Linda Mister Roberts 1966 TV Series My Brother the Angel 1966 TV Series Dolores The Adventures of Ozzie & Harriet 1963-1965 TV Series Pam / Susan Convoy 1965 TV Series Suzie Mae Humbolt Petticoat Junction 1963-1965 TV Series Billie Jo Bradley Strike Me Deadly 1963 Lori Grant The Virginian 1963 TV Series Amelia Pryor Wagon Train 1963 TV Series Susan Forbes My Three Sons 1962 TV Series Kim Route 66 1962 TV Series Molly Cross Father of the Bride 1962 TV Series Five Finger Exercise 1962 Girl (uncredited) Soundtrack Title Year Status Character Petticoat Junction 1963-1965 TV Series performer - 8 episodes Self Title Year Status Character Hee Haw 1969-1971 TV Series Herself The New Truth and Consequences 1970 TV Series Herself The Real Tom Kennedy Show 1970 TV Series Herself The Hollywood Squares 1970 TV Series Guest Appearance The Ed Sullivan Show 1964 TV Series Singer\n\nSource: IMDb"}, {"url": "https://www.classic-tv.com/shows/green-acres", "page_content": "Green Acres is a sitcom starring Eddie Albert and Eva Gabor about a couple that moves from New York City to a country farm. Produced by Filmways as a sister show to Petticoat Junction, the series aired on CBS from 1965 until 1971.\n\nCast & Characters\n\nEddie Albert as Oliver Wendell Douglas\n\nEva Gabor as Lisa Douglas\n\nPat Buttram as Mr. Haney\n\nTom Lester as Hank Kimball\n\nHank Patterson as Fred Ziffel\n\nBarbara Pepper as Doris Ziffel (1965-1969)\n\nFran Ryan as Doris Ziffel (1969-1970)\n\nFrank Cady as Sam Drucker\n\nKay E. Kuter as Newt Kiley (1965-1970)\n\nSid Melton as Alf Monroe (1966-1969)\n\nMary Grace Canfield as Ralph Monroe (1966-1971)\n\nJudy McConnel as Darlene Wheeler (1970-1971)\n\nBroadcast History\n\nFirst Telecast: September 15, 1965\n\nLast Telecast: September 7, 1971\n\nNetwork: CBS\n\nSeasons: 6\n\nEpisodes: 170\n\nView list of all Green Acres episodes\n\nOriginal Primetime TV Schedule: September 1965- September 1968, Wednesday 9:00-9:30pm\n\nSeptember 1968- September 1969, Wednesday 9:30-10:00pm\n\nSeptember 1969- September 1970, Saturday 9:00-9:30pm\n\nSeptember 1970- September 1971, Tuesday 8:00-8:30pm September 15, 1965September 7, 1971170\n\nTheme Song Lyrics & Opening Intro\n\nGreen acres is the place for me.\n\nFarm livin' is the life for me.\n\nLand spreadin' out so far and wide\n\nKeep Manhattan, just give me that countryside.\n\nNew York is where I'd rather stay.\n\nI get allergic smelling hay.\n\nI just adore a penthouse view.\n\nDah-ling I love you but give me Park Avenue.\n\n...The chores.\n\n...The stores.\n\n...Fresh air.\n\n...Times Square\n\nYou are my wife.\n\nGood bye, city life.\n\nGreen Acres we are there.\n\nWatch opening intro:\n\n\n\nListen to theme song:\n\nYour browser does not support the audio element.\n\n\n\nPurchase theme song:\n\n\n\nBuy Green Acres on DVD\n\nSeason 1\n\n\n\nSeason 2\n\n\n\nSeason 3\n\n\n\nWatch Green Acres Online\n\nThe Green Acres Shop\n\nBooks\n\n\n\nGreen Acres Photo Gallery\n\nGreen Acres Trivia\n\nNew York lawyer Oliver Wendell Douglas longs for a simpler way of life. So he buys a farm, sight unseen, and moves there to live off the land, much to the chagrin of his socialite wife, Lisa. The collision of small-town life and Lisa's sophisticated ways - she insists on wearing full-length gowns and ostentatious jewelry, even on the farm - provide much of the humor in the show. Two to Four pigs were used on the TV show each year for \"Arnold the Pig\". The first one was male and all the others were female.Eva Gabor was married 5 times and once said, \"Marriage is too interesting an experiment to be tried only once.\"Bea Benaderet had starring roles in several other TV shows including \"The George Burns and Gracie Allen Show\", \"The Beverly Hillbillies\", and \"Petticoat Junction\". She also starred as Mrs. Atterbury on the, \"My Favorite Husband Radio Show\" starring Lucille Ball. Lucille Ball actually wanted Bea to play the role of Ethel Mertz on her series, \"I Love Lucy\" but Bea couldn't do it due to her contract with the \"George Burns and Gracie Allen Show\". Unfortunately, Bea died during Green Acres' time on the air. They explained her disappearance by saying that she went off to visit her sister. In her final \"appearance\" her character was actually played by a \"stand-in\" that was only shown from the back and had no lines.Everyone who watched Green Acres remembers Arnold the pig but there were many other named animals on the show. At one point or another during the show's run the Douglases had a cown named Eleanor, a duck named Drobney, and a dog named Mignon. Mr. Haney also had a dog named Cynthia who just happened to be in love with Arnold the Pig!Eddie Albert was a circus trapeze flier before becoming a stage and radio actor.The idea for this TV show was conceived from the 1950s radio program, \"Granby's Green Acres\" but the TV show is considered a \"spin-off\" of the series, \"Petticoat Junction\". Several of the Green Acres characters had appeared on Petticoat Junction before Green Acres ever aired. Both series took place in and near the same town. Characters from both series often showed up on the other series. There was also an exchanging of characters between Green Acres and \"The Beverly Hillbillies\"."}, {"url": "https://www.tvobscurities.com/2009/08/q-and-a-green-acres-spin-offs/", "page_content": "I get a lot of e-mails from people asking me about television shows, made-for-TV movies or miniseries they remember from years or decades past. I try to answer each question as best I can. Every now and then I like to dig through my inbox and pull out a few choice e-mails to answer here at Television Obscurities for everyone to read. Keep reading for today’s questions and answers.\n\nIt appears, based solely on information from TV.com (here and here) as well as the Internet Movie Database, that the final two episodes of Green Acres were indeed backdoor pilots for proposed spin-offs. The first, “Hawaiian Honeymoon” (originally broadcast March 16th, 1971) saw Oliver and Lisa Douglas heading to Hawaii for a fifth honeymoon. Trouble arises when another couple are accidentally also booked in the honeymoon suite. Visitors to the hotel, operated by a man and his college-age daughter, would have provided the humor in the suggested spin-off.\n\nThe final episode of Green Acres provided the second attempt. “The Ex-Secretary” (originally broadcast April 28th, 1971) is described above by K11j527. It starred Elaine Joyce as Carol Rush, former secretary to Oliver Douglas (Eddie Albert’s character), as she tries to keep her boss (played by Richard Deacon) from getting taken in by a con man. Eddie Albert and Eva Gabor had only limited scenes in the episode. Unfortunately, I can’t find any contemporary sources that indicate either of these episodes were backdoor pilots. However, it does seem plausible.\n\nGiven the amount of time needed to plot an episode, write a script, film it and finish post-production, the fact that two episodes of the final season of Green Acres were actually backdoor pilots suggests that the producers were aware that the show was going to be cancelled at the end of the 1970-1971 season. Perhaps they saw the tide turning against so-called rural sitcoms.\n\nIf anyone can shed light on these two episodes and confirm that they actually were backdoor pilots, please post in the comments."}, {"url": "https://ctva.biz/US/Comedy/GreenAcres.htm", "page_content": "ctva\n\nComedy Search\n\nCTVA US Comedy - \"Green Acres\" (Filmways/CBS)(1965-71) Eddie Albert & Eva Gabor\n\nCTVA\n\nThe Classic TV Archive - US Comedy Series\n\nThe Beverly Hillbillies (1962-71) Petticoat Junction (1963-70) Green Acres (1965-71)\n\nGreen Acres (1965-71)\n\nEpisode Guide compiled by The Classic TV Archive\n\nreferences:\n\nLibrary of Congress (telnet://locis.loc.gov)\n\nInternet Movie Database (http:/www.us.imdm.com)\n\nGreen Acres (season 1) (CBS) (1965-1966)\n\nGreen Acres (season 2) (CBS) (1966-1967)\n\nGreen Acres (season 3) (CBS) (1967-1968)\n\nGreen Acres (season 4) (CBS) (1968-1969)\n\nGreen Acres (season 5) (CBS) (1969-1970)\n\nGreen Acres (season 6) (CBS) (1970-1971)\n\n-----------\n\nGREEN ACRES\n\n-----------\n\nFilmways Television production\n\nfor\n\nCBS (Wednesdays 9:00 pm EST)(seasons 1-3, 1965-68)\n\nCBS (Wednesdays 9:30 pm EST)(season 4, 1968-69)\n\nCBS (Saturdays 9:00pm EST)(season 5, 1969-70)\n\nCBS (Tuesdays 8:00pm EST)(season 6, 1970-71)\n\nProduced by Paul Henning / Created by Jay Sommers\n\n\n\nUS Comedy series 1965-71 170 episodes x 30 min color (6 seasons)\n\nstarring\n\nEddie Albert as Oliver Wendell Douglas\n\nEva Gabor as Lisa Douglas\n\nco-starring\n\nPat Buttram as Mr. Haney (1965-1971)\n\nTom Lester as Eb Dawson (1965-1971)\n\nAlvy Moore as Hank Kimball (1965-1971)\n\nHank Patterson as Fred Ziffel (1965-1971)\n\nBarbara Pepper as Dris Ziffel (1965-1969)\n\nFran Ryan as Dris Ziffel (1969-1970)\n\nFrank Cady as Sam Drucker (1965-1971)\n\nKay E. Kuter as Newt Kiley (1965-1970)\n\nSid Melton as Alf Monroe (1966-1969)\n\nMary Grace Canfield as Ralph Monroe (1966-1971)\n\nJudy McConnell as Darlene Wheeler (1970-1971)\n\n\n\nPremise:\n\nA city lawyer moves his luxury-loving wife out to a farm. A sort of 'Beverly Hillbillies' in reverse.\n\n\n\nOne of two spin-off series from\n\nThe Beverly Hillbillies (1962-71) 274 episodes starring Buddy Ebsen\n\nThe other spin-off was\n\nPetticoat Junction (1963-70) 220 episodes starring Bea Benaderet and Edgar Buchanan\n\n\n\n\"Green Acres\" theme\n\nby Vic Mizzy\n\nGreen acres is the place for me. Farm livin’ is the life for me.\n\nLand spreadin’ out so far and wide. Keep Manhattan, just give me that countryside.\n\nNew York is where I’d rather stay. I get allergic smelling hay.\n\nI just adore a penthouse view.\n\nDah-ling I love you but give me Park Avenue.\n\nThe chores, The stores.\n\nFresh air, Times Square\n\nYou are my wife, Good bye, city life.\n\nGreen Acres we are there.\n\n################ Green Acres #################\n\n##############################################\n\n##############################################"}, {"url": "https://www.grunge.com/1019569/the-untold-truth-of-green-acres/", "page_content": "\"Green Acres\": It was definitely the place to be ... at least for half an hour at a time, over the course of the 170 episodes that first aired between 1965 and 1971 ... and in perpetuity since. It's really no wonder that it's remained pretty popular, because there really is something to the idea. No matter how much of a self-professed city-slicker someone is, there's still something undeniably inviting about the prospect of living somewhere with fresh air, infinite greenery, more than a few animals, and fresh veg right from the garden ... especially post-2020. That is, of course, the premise: A husband and wife move from the big city to the country, and hilarity — usually over their ineptitude — ensues.\n\nWhile most people might remember the television show, it didn't start out that way. According to Sitcom Queens, the show was based on a radio show — also created by show writer Jay Sommers — that debuted in 1950. It was called \"Granby's Green Acres,\" and the Granby in question was a banker instead of a lawyer. The premise was the same, and the television show ended up being much, much more successful.\n\nStill, even those who know the theme song by heart and dream of having their very own pet pig named Arnold still might not know these obscure facts about this classic TV sitcom."}, {"url": "https://clickamericana.com/media/television-shows/green-acres-theme-song-lyrics-1965-1971", "page_content": "For six seasons and 170 episodes, the sitcom “Green Acres” aired on national TV. This was yet another take on the fish-out-of-water trope — but this time, the rich folks left Manhattan by choice to go live on a farm. It was a little unusual for the time in that every spisode was shot in color. And very typical for the time, every episode also featured a laugh track. The cast included Eddie Albert (as Oliver Wendell Douglas), Eva Gabor (as Lisa Douglas), Tom Lester (Eb Dawson), Frank Cady (Sam Drucker), Pat Buttram (Mr Eustace Haney) and Alvy Moore (Hank Kimball).\n\n“Green Acres” debuts on CBS (1965)\n\nEddie Albert, eager actor who says he never turns down any role, will star in his first television comedy series, “Green Acres.” He portrays a kind of reverse rube — a New York lawyer who abandons the city to become a farmer.\n\n“It’s not ‘King Lear,’ but I think it’ll be entertaining,” Albert said. “Eva Gabor plays my wife, and she is sensational. Wait ’til you see Eva in a negligee and a $150,000 square-cut necklace, feedings pigs with one hand and flipping pancakes with the other.”\n\nWATCH IT NOW: See “Green Acres” via streaming video or DVD!\n\nWednesday nights\n\n“Green Acres” will be televised by the Columbia Broadcasting System each Wednesday from 9 to 9:30pm, beginning September 14 [1965].\n\n“It will be in living, vibrating color — unique and bizarre,” Albert said. “There will be enough situations to carry the show 40 years, although it might pail on you by then.”\n\n“Green Acres” will have a direct tie-in with “Petticoat Junction,” another CBS rural life show that will be returning for its third season. As Oliver Wendell Douglas, Albert will reside in the Hooterville Valley, near the Hamlet known as Petticoat Junction.\n\n“I expect to appear in at least one scene on ‘Petticoat Junction’ each week,” Albert said. “Bea Benaderet, Edgar Buchanan and others will work on my show, and I will work on theirs. Edgar and Eva make quite a combination.”\n\nWork together\n\nPaul Henning and Jay Sommers work together as producers of both shows. Sommers is listed as the initiator of “Green Acres” and Henning has credit for starting “Petticoat Junction.” Henning also is the producer and initiator of “The Beverly Hillbillies,” returning for its fourth season on CBS. All three shows are filmed on adjoining sound stages at Filmways Studios in Hollywood.\n\nAlbert, whose career includes the stage, motion pictures, television, radio and nightclubs. said he did not think his new role would be vastly different from other things he had done.\n\nI’ve worked in practically everything,” he said. “I never turn down anything. I love to work. On ‘Green Acres,’ I will play it straight, but the situations will be funny. I’ll give it sincere playing. My show will not be as a broad as ‘The Beverly Hillbillies’ or ‘Petticoat Junction.”\n\nMORE: The Beverly Hillbillies: Theme song & lyrics (1962-1971)\n\n“Green Acres” theme song and opening credits (1965)\n\n“Green Acres” theme song lyrics\n\nSung by Eddie Albert and Eva Gabor\n\nGreen Acres is the place to be\n\nFarm livin’ is the life for me\n\nLand spreadin’ out so far and wide\n\nKeep Manhattan — just give me that countryside\n\nNew York is where I’d rather stay\n\nI get allergic smelling hay\n\nI just adore a penthouse view\n\nDarling, I love you, but give me Park Avenue\n\n… The chores!\n\n… The stores!\n\n… Fresh air!\n\n… Times Square!\n\nYou are my wife.\n\nGoodbye, city life.\n\nGreen Acres — we are there\n\nMeet Green Acres’ Eddie Albert\n\nQuad-City Times (Davenport, Iowa) August 27, 1965\n\nHOLLYWOOD — Eddie Albert, as the polished New York lawyer, and Eva Gabor, his city-loving wife with the Hungarian accent, move to the country, a familiar place called Hooterville in ‘Green Acres,” the new CBS Wednesday night comedy to be wedged in between ‘Beverly Hillbillies’ and “Dick Van Dyke” this fall.\n\nHooterville happens to be home grounds for Tuesday night’s ‘Petticoat Junction,” thus allowing casts from both shows to intermingle in TV’s first cross-pollination attempt. This summer, “Green Acres” stars Albert and Gabor made two episodes for their own series, then appeared in two “Petticoat Junction” comedies. If the intermingling keeps up fans will have to watch both shows to find out what is going on.\n\nOf course, this is exactly what creators Paul Henning and Jay Sommers, who also run “Beverly Hillbillies” and “Petticoat Junction,” have in mind. Actor Albert hasn’t been asked to walk in on the Hillbillies, but fans shouldn’t be surprised to see Eddie, on a half-hour earlier. grinning at Granny.\n\nEddie compares “Green Acres” to “The Egg And I,” the successful book and picture about city folks learning to live in the country. “Arguments about city life versus country living have been going on since Euripides,” said Albert. ‘We’re taking another crack at it.”\n\nMisbegotten farm\n\nRight off the bat. Albert as Oliver Wendell Douglas, is hoodwinked into buying a misbegotten farm from a foxy drawlin’ fool played by Pat Buttram. The opening show finds the Douglases in their fancy New York apartment, getting ready to ship their stylish furniture to the country while wife Lisa (Eva Ga- bor) rebels with fervor.\n\n“Eva is playing herself,” Albert) continued. ‘The further she goes with her Hungarian accent and her regal mannerisms, the greater the comedy. When Eva tries to teach Bea Benedaret (“Petticoat Junction’s” Kate Bradley) how to make Hungarian goulash we’ll get laughs.’\n\nKate Bradley and her three daughters, Uncle Joe and the two train loving idiots on ‘Petticoat Junction’ will mix freely in “Green Acres” stories, so fans will only have to get used to stars Albert and Gabor. The folksiness of the Tuesday night show, often an overpowering breeze, is expected to be counterbalanced by the airs of Miss Gabor and the grins of Mr. Albert.\n\nDuring the last few years, Albert has been on the road entertaining with his guitar. coming home for a few weeks to guest star on series like Rawhide.” “Dr. Kildare” and “Voyage to the Bottom of The Sea.”\n\nThe freelance actor’s life isn’t what it’s cracked up to be, says Eddie. “You come home and you take parts you might normally turn down, just because you’re in town for a few days. Even when you’re out fishing for four days, you wonder what’s going on in the studios.”\n\nSo, when Paul Henning and Jay Sommers came to Eddie with “Green Acres,” the freelance actor turned respectable and signed. ‘Do you know what doing a series means?” Albert went on. “After a season’s filming, I’ll be free to do other things like travel from March through June. Who else gets four months off a year? Not a college professor, or a lawyer or a freelance actor. Only series performers.\n\n“Right now, I’m trying to think of projects for those four free months that will take me far away.”\n\nEddie wants to take his guitar, visit Russia and do a show on it. With a camera, he’d like to go down the Nile, the Rhine, the Danube and the Amazon. As the star of a successful TV series, Albert would have the name to encourage backers for such projects.”\n\n“I’d like to go skin diving on the Great Barrier Reef of Australia, or visit the Easter Island,” the dreamer continued. “I tell you there’s nothing like seeing the world on an expense account.”\n\nMeet Green Acres’ Eve Gabor\n\nQuad-City Times (Davenport, Iowa) November 5, 1965\n\nHOLLYWOOD — There was an air of quiet contentment on the “Green Acres” stage five at General Service Studio. Clad in a handsome gown, Eva Gabor nibbled on cold chicken, cheese and a pear, while Eddie Albert dug in the Gabor hamper for his lunch of chicken provided by Eva’s cook.\n\n“Chicken every day this week,” said Albert, working on a wing. “Why all the necks, Eva?”\n\nEva wouldn’t rise to the bait. “Take a nap darling, or you’ll be grumpy,” she said in a wifely tone.\n\nStars Albert and Gabor gre old friends, and on the set treat each other like an affectionate married couple. Miss Gabor pats, kisses and feeds her co-star, and even takes Yoga exercises with Albert in the Gabor tradition of keeping their men happy.\n\n‘Today, we are having a letdown,” said Eva. “It is like the day after the opening night in the theater. The latest ratings came out this morning and we are up high. Our show is a success. I tell you that is a nice feeling. There is nothing like success to keep you from getting bored.”\n\nOn a two – day notice Miss Gabor left her New York home and husband, Richard Brown, Wall Street broker who now commutes to Hollywood, to play the role of Lisa Douglas, the city-loving, sophisticated wife of Oliver Wendell Douglas, the New York lawyer who wants to take up farming.\n\nNone of Eva’s relatives were enthusiastic about the idea, but the youngest Gabor came anyway, and has found herself in a runaway folksy hit, a far cry from the well-established Gabor image.\n\nThe Gabor accent, an opposite from the country folk drawlin’ which prevails on the CBS series, hasn’t been tampered with. ‘The thicker the accent, the stronger the character,” says Albert with approval.\n\n“I can’t stand an accent really,” said Eva. “But I can’t do anything with mine. I tried for years to get rid of it and gave it up.”\n\nThe Gabor Hungarian accent seems crystal clear to most Americans, noted Eva. ‘Even our writers are beginning to talk Ifke me.” But she has trouble with some words. When Eva says car it sounds like cow.\n\n“Last winter in Puerto Rico I got into trouble with those two words,” Eva explained. “While driving down the road I hit a cow and called in to report the accident. Naturally, I was misunderstood, and the whole police force came out under the impression I had struck a car. I am not crazy about my accent.”\n\nThe writers see more in Eva than just a handsome, perfumed woman who walks through scenes and kisses her husband now and then. “They’re making me an acrobat,” says she. “Goose feathers are thrown at me. I’m doused in a shower, and this morning I was standing on a bucket for hours.” She’s not just window dressing.\n\nMiss Gabor takes all this without shrieking. “Gabors are supposed to be temperamental, but I’m not,” she said.\n\n“I have good discipline because I have been in the theater a long time, and I know you don’t fiddle around. Besides, I love this show.”"}, {"url": "https://www.cheatsheet.com/entertainment/green-acres-could-a-reboot-still-happen.html/", "page_content": "It seems that just about every TV show or movie is getting a reboot or spinoff. Perhaps the most successful and long-running example is the Star Wars franchise. In an era where everything old is new again, fans of Green Acres are wondering if the show could be rebooted for a whole new generation.\n\n‘Green Acres’ was a hit comedy set in rural America\n\nCheer up, Lisa! Tonight is the series premiere of Green Acres on MeTV as we start the series all over again! Tune in at 9:30P | 8:30C! pic.twitter.com/1QBG6VEwlO — MeTV (@MeTV) September 14, 2020\n\nAccording to IMDb, Green Acres aired from 1965 to 1971 for a total of 170 episodes. The show starred Eddie Albert and Eva Gabor, who played the roles of Oliver Wendell Douglas and Lisa Douglas. The couple left behind their hectic New York City life for farming in rural Hooterville. Lisa Douglas’s elegance and lack of domestic skills provided much of the comedy.\n\nJust like the town of Springfield in The Simpsons, viewers never found out exactly where Hooterville was. The ambiguity of setting the show in an “every man’s” small town only added to its appeal.\n\nTwo ‘Green Acres’ spinoffs fell flat\n\nBy the early 1970s, CBS was also airing two other rural-themed shows, Petticoat Junction and The Beverly Hillbillies. The network was eager to change its image and wanted to start featuring shows in urban and contemporary settings. All three shows were canceled as part of CBS’s “rural purge.” Viewers didn’t know it at the time, but the last two episodes of Green Acres were actually pilots for spinoff shows.\n\nAccording to MeTV, the second to the last episode had the Douglases going to Hawaii for a “fifth honeymoon.” This episode prominently featured the hotel owner and his daughter. CBS hoped to capitalize on the exotic location and younger cast members. The working title for this pilot was called Pam, after the hotel owner’s daughter.\n\nAnd in the very last episode of Green Acres, Oliver Douglas writes a letter to his former secretary, Carol. The rest of the episode’s plot centers around Carol, for whom that pilot was named after. There is a very good reason why TV viewers don’t remember Pam or Carol. Neither pilot took off, and the two spinoff shows were canceled right along with Green Acres.\n\n‘Return to Green Acres’\n\nBy 1990, Green Acres had been off the air for almost 20 years. Fans, as well as a new generation, were ready to be reintroduced to the show they so dearly loved. According to IMDb, Return to Green Acres aired on May 18, 1990. The made for TV movie starred many of the same characters, including Eva Gabor, Eddie Albert, and Tom Lester.\n\nAnd Paris Hilton recently revealed that Green Acres influenced The Simple Life. Prior to filming, Hilton says she was told, “We want this to be Green Acres meets Clueless and we want you to play into the character of you don’t know what you’re doing.”\n\nWhat does the future hold for ‘Green Acres’ fans?\n\nIn recent years, both Mental Floss and Deadline have reported that both a feature film and a Broadway play were in the works. However, nothing has come to fruition yet and the future of these projects haven’t been made public.\n\nInsider recently reported on upcoming reboots, remakes, and spin-offs, but sadly, Green Acres isn’t one of them. And if there is a reboot of Green Acres, it would have to feature an all-new cast. In April 2020, the show’s last surviving cast member, Tom Lester, who played farmhand Eb Dawson, passed away.\n\nLuckily, Green Acres’ fans can still watch episodes on Prime Video and MeTV."}, {"url": "http://classic-tv.com/shows/green-acres", "page_content": "Green Acres is a sitcom starring Eddie Albert and Eva Gabor about a couple that moves from New York City to a country farm. Produced by Filmways as a sister show to Petticoat Junction, the series aired on CBS from 1965 until 1971.\n\nCast & Characters\n\nEddie Albert as Oliver Wendell Douglas\n\nEva Gabor as Lisa Douglas\n\nPat Buttram as Mr. Haney\n\nTom Lester as Hank Kimball\n\nHank Patterson as Fred Ziffel\n\nBarbara Pepper as Doris Ziffel (1965-1969)\n\nFran Ryan as Doris Ziffel (1969-1970)\n\nFrank Cady as Sam Drucker\n\nKay E. Kuter as Newt Kiley (1965-1970)\n\nSid Melton as Alf Monroe (1966-1969)\n\nMary Grace Canfield as Ralph Monroe (1966-1971)\n\nJudy McConnel as Darlene Wheeler (1970-1971)\n\nBroadcast History\n\nFirst Telecast: September 15, 1965\n\nLast Telecast: September 7, 1971\n\nNetwork: CBS\n\nSeasons: 6\n\nEpisodes: 170\n\nView list of all Green Acres episodes\n\nOriginal Primetime TV Schedule: September 1965- September 1968, Wednesday 9:00-9:30pm\n\nSeptember 1968- September 1969, Wednesday 9:30-10:00pm\n\nSeptember 1969- September 1970, Saturday 9:00-9:30pm\n\nSeptember 1970- September 1971, Tuesday 8:00-8:30pm September 15, 1965September 7, 1971170\n\nTheme Song Lyrics & Opening Intro\n\nGreen acres is the place for me.\n\nFarm livin' is the life for me.\n\nLand spreadin' out so far and wide\n\nKeep Manhattan, just give me that countryside.\n\nNew York is where I'd rather stay.\n\nI get allergic smelling hay.\n\nI just adore a penthouse view.\n\nDah-ling I love you but give me Park Avenue.\n\n...The chores.\n\n...The stores.\n\n...Fresh air.\n\n...Times Square\n\nYou are my wife.\n\nGood bye, city life.\n\nGreen Acres we are there.\n\nWatch opening intro:\n\n\n\nListen to theme song:\n\nYour browser does not support the audio element.\n\n\n\nPurchase theme song:\n\n\n\nBuy Green Acres on DVD\n\nSeason 1\n\n\n\nSeason 2\n\n\n\nSeason 3\n\n\n\nWatch Green Acres Online\n\nThe Green Acres Shop\n\nBooks\n\n\n\nGreen Acres Photo Gallery\n\nGreen Acres Trivia\n\nNew York lawyer Oliver Wendell Douglas longs for a simpler way of life. So he buys a farm, sight unseen, and moves there to live off the land, much to the chagrin of his socialite wife, Lisa. The collision of small-town life and Lisa's sophisticated ways - she insists on wearing full-length gowns and ostentatious jewelry, even on the farm - provide much of the humor in the show. Two to Four pigs were used on the TV show each year for \"Arnold the Pig\". The first one was male and all the others were female.Eva Gabor was married 5 times and once said, \"Marriage is too interesting an experiment to be tried only once.\"Bea Benaderet had starring roles in several other TV shows including \"The George Burns and Gracie Allen Show\", \"The Beverly Hillbillies\", and \"Petticoat Junction\". She also starred as Mrs. Atterbury on the, \"My Favorite Husband Radio Show\" starring Lucille Ball. Lucille Ball actually wanted Bea to play the role of Ethel Mertz on her series, \"I Love Lucy\" but Bea couldn't do it due to her contract with the \"George Burns and Gracie Allen Show\". Unfortunately, Bea died during Green Acres' time on the air. They explained her disappearance by saying that she went off to visit her sister. In her final \"appearance\" her character was actually played by a \"stand-in\" that was only shown from the back and had no lines.Everyone who watched Green Acres remembers Arnold the pig but there were many other named animals on the show. At one point or another during the show's run the Douglases had a cown named Eleanor, a duck named Drobney, and a dog named Mignon. Mr. Haney also had a dog named Cynthia who just happened to be in love with Arnold the Pig!Eddie Albert was a circus trapeze flier before becoming a stage and radio actor.The idea for this TV show was conceived from the 1950s radio program, \"Granby's Green Acres\" but the TV show is considered a \"spin-off\" of the series, \"Petticoat Junction\". Several of the Green Acres characters had appeared on Petticoat Junction before Green Acres ever aired. Both series took place in and near the same town. Characters from both series often showed up on the other series. There was also an exchanging of characters between Green Acres and \"The Beverly Hillbillies\"."}]}