{"Jeanine Riley also appeared in the television movie Return to Green Acres (1990).": [{"url": "https://eleven-magazine.com/green-acres-cast/", "page_content": "Let’s start with are any of the Green Acres cast members still alive? Well, Tom Lester was the last main member survivor up to 2020. But in April 2020, he passed away. The iconic TV show produced a lot of entertaining moments and episodes. Some say it was the prequel to the Marvel Cinematic Universe. What happened to the cast of Green Acres?\n\nBefore creating Green Acres, producer Paul Henning created The Beverly Hillbillies and Petticoat Junction. And then he teamed up with Jay Sommers to create Green Acres. All three shows worked together. The show ran for six seasons from 1965 to 1971. They produced a total of 170 episodes and then had a reunion movie in 1990.\n\nYou can now get the sitcom on DVD or VHS release. During its run, Green Acres received solid ratings. But the concept is what we all remember. Green Acres is a sister show to Petticoat Junction. Let’s take a look at what happened to the cast of Green Acres.\n\nEddie Albert – Oliver Wendell Douglas\n\nThe American actor and activist got popular before stepping on the set of Green Acres. He received an Academy Award nomination in 1954 for his performance in Roman Holiday. He appeared in several movies before making the change to television.\n\nIn the 1950s, Albert appeared in The Fuller Brush Girl, The Sun Also Rises, Carrie, Roman Holiday, Oklahoma, Who’s Got the Action, and more.\n\nDuring the 1950s, he even had his own daytime variety program, The Eddie Albert Show. And then from 1954, he hosted Saturday Night Live for some time.\n\nFollowing the end of Green Acres, he went on a small hiatus. In 1975, he accepted a big role for the crime drama Switch. That was after four years of absence from the small screen. And at the age of 69. The show had two solid seasons, but ratings started going down during the third season. CBS canceled it after 70 episodes.\n\nIn 1972, he also appeared in the movie The Heartbreak Kid. He received an Oscar nomination for that role for Best Supporting Actor.\n\nIn 1995, he got diagnosed with Alzheimer’s disease. He exercised regularly until shortly before his death. He died of pneumonia in May 2005 at the age of 99.\n\nEva Gabor – Lisa Douglas\n\nThe Hungarian-American actress played the second half of the duo on Green Acres. That role made her famous, playing the wife of Eddie Albert’s character.\n\nFollowing the end of the show, she mostly did voice work. Eva voiced Duchess in the Disney movie The Aristocats and Miss Bianca in The Rescuers. She found success as an actress in Hollywood, actress on Broadway, and as a voice actor.\n\nDisney loved her European-accented voice for a couple of projects. In 1983, she and Albert reunited on Broadway in You Can’t Take It with You.\n\nEva used her popularity in Hollywood to launch her business career. In 1972, she launched her fashion collection.\n\nSome might say that her legacy is marriages and divorces. She got married five times but had no children. Gabor died in Los Angeles in July 1995 from respiratory failure and pneumonia.\n\nTom Lester – Ed Dawson\n\nUp until 2020, Tom served as the last surviving main cast member of Green Acres. But that changed in April 2020. The American actor and evangelist reached stardom as Ed Dawson on Green Acres.\n\nFun fact: he won the role because of his farming skills. He said he won the role because he knew how to milk a cow. And he was the only one with those skills. Luckily, he grew up on a farm in Mississippi, which helped him in the role.\n\nLester’s character started as a recurring one but got promoted to a main one because of the show’s and character’s popularity. Lester also appeared in episodes of the two other CBS series, Petticoat Junction and The Beverly Hillbillies. He played a part in nearly all Green Acres episodes. He took a small break during the first half of the 1967-68 season because of mononucleosis illness.\n\nAfter the show ended, he returned to his parents’ house in Mississippi. He did some occasional movie or TV role. During the 1980s, he had guest roles in Little House on the Prairie, Knight Rider, Love, American Style, and some more.\n\nIn 1990, he returned to Green Acres for the reunion movie. In his later years, he traveled the nation and preached a message of faith and obedience to the people. He also participated in autograph shows and fan forums. Often, he dressed up as Ed Dawson.\n\nHe formed a great relationship with Eddie Albert, referring to him as his “surrogate father”. In April 2020, he died because of complications of Parkinson’s disease.\n\nPatt Buttram – Mr. Haney\n\nPatt got famous for his distinctive voice. In his own words, his voice never quite made it through puberty. Buttram served in the US Army Air Force during World War II. Following his return to the US, he united with Gene Autry. The two worked in more than 40 movies and television shows together.\n\nThat is how he got the part in Green Acres. Following the end of the show, he used his voice for work. Patt did voice work for Disney animated movies, including Napoleon in The Aristocats, Sheriff of Nottingham in Robin Hood, Luke in The Rescuers. He also took part in Who Framed Roger Rabbit and provided a recurring voice for Cactus Jake in Garfield and Friends.\n\nHe died in 1994 at the age of 78 due to kidney failure. In 1988, Buttnam got his star on the Hollywood Walk of Fame.\n\nFrank Cady – Sam Drucker\n\nFrank is an interesting actor. He studied journalism and drama at Stanford. He even worked on the campus humor magazine. After graduation, he got an apprenticeship at the Westminster Theater in London, and he appeared in four plays.\n\nHe returned to Stanford for graduate studies and a position as a teaching assistant. There he met his future wife, Shirley Katherine Jones.\n\nCady also served in the military up to his discharge in 1946. Following his discharge, he had a couple of roles in plays, leading to movie roles and television roles.\n\nGreen Acres actually served as his last role. Following the end of the television series, he also appeared in the reunion movie.\n\nAfter the end of the show, he started writing humorous poems, parodies of songs, and limericks. Frank died in June 2012, at the age of 96.\n\nAlvy Moore – Hank Kimball\n\nBefore getting a big part in Green Acres, Moore had a couple of guest and supporting roles in movies and television shows. The show helped him reach new career heights.\n\nFollowing the end of the show, he continued with guest appearances in shows like The Dick Van Dyke Show, Little House on the Prairie, and more. And then in the 1980s, he appeared in cult horror movies like Scream, Intruder, The Horror Show, and more."}, {"url": "https://people.com/tv/tom-lester-dead-parkinsons-disease-green-acres-star-81/", "page_content": "Actor Tom Lester has died. He was 81.\n\nThe star died on Monday in Nashville, Tennessee, due to complications from Parkinson’s disease, his brother Michael Lester announced on Facebook.\n\nHe died in the home of his fiancée and longtime caregiver, Jackie Peters, his brother shared.\n\nLester is most known for his role as Eb Dawson on the TV series Green Acres, which follows a New York City attorney and his wife as they attempt to live as genteel farmers.\n\nThe series first aired in 1965 and ran for six seasons before ending in 1971.\n\n“He was the only connection with the youth the show had,” Green Acres director Richard L. Bare said of Lester to the TV Academy’s The Interviews series in 2003, Deadline reported.\n\nLester reprised his role as Dawson in the TV movie Return to Green Acres in 1990.\n\nLester is believed to have been the last surviving cast member of Green Acres, according to The Hollywood Reporter.\n\nHe also portrayed the character Eb Dawson in the hit series The Beverly Hillbillies and Petticoat Junction.\n\nLester also landed a number of film roles including his part as Riley in the 1974 movie Benji and Cousin Jake in Gordy. He also starred in Charo and the Sergeant as Sgt. Hank Palmer.\n\nWalt Disney Television\n\nLester was born in Jackson Mississippi in 1938, according to his IMDb bio, and spent his childhood on his grandfather’s farm on which he shucked corn, fished, picked cotton and hunted.\n\nBefore taking his talents to Hollywood, Lester graduated from the University of Mississippi, earning a degree in biology and chemistry.\n\nOf his career in acting, Lester said his friends told him in an undated interview, according to The Hollywood Reporter, “You’re crazy. You’ll never be able to do that. You’re too tall, too skinny, too ugly. You’ve got a Southern accent, and you’ll never make it in the motion picture business.”\n\nAlbert L. Ortega/WireImage\n\nAside from his career in Hollywood, Lester remained an active member of his Mississippi farming community.\n\nIn 1997, he was the recipient of Mississippi’s Wildlife Farmer of the Year award.\n\nIn the Facebook announcement, Lester’s brother announced that there will be a graveside service on Friday, April 24.\n\n“Death leaves heartache, no one can heal. Love leaves a memory, no one can steal,” Michael wrote on Facebook."}, {"url": "https://factsverse.com/how-each-green-acres-cast-member-died/", "page_content": "Did you grow up watching the hilarious sitcom Green Acres? It was a wonderful story about New Yorkers Oliver Wendell Douglas and his wife Lisa who decide to ditch the chaos of the city to enjoy the relaxation of rural life!\n\nYet, the cast of characters they came across made their lives in the country as crazy and adventurous as one would imagine!\n\nThe show was created by Jay Sommers and was written by Sommers, Dick Chevillat, and a crew of other great writers. But what made the show a massive success was the Green Acres Cast.\n\nSadly, the main cast members have now left us. Let’s look back at their incredible lives and careers…. Join Facts Verse to learn about the details How Each Green Acres Cast Member Died.\n\nALVY MOORE\n\nAlvy Moore played the role of Hank Kimball. Hank was a hilarious parody of local government bureaucrats who always get in the way! Yet, such was the charm that Alvy Moore had that Hank Kimball became one of the favorite characters on the show.\n\nApart from his role as Hank Kimball, Alvy Moore was also known for appearing in many TV commercials. He also had bit parts in some of America’s most popular TV shows including Newhart, The Beverly Hillbillies, Love American Style, Little House on the Prairie, The Waltons, and Frasier.\n\nAlvy was born in Vincennes, Indiana and studied Drama at the Indiana State Teachers College. He served in World War 2 and fought in the Battle of Iwo Jima. Upon returning to the United states, he began his acting career on stage – with the Pasadena Playhouse.\n\nHis film career included many popular comedies of the Golden Era, including Gentlemen Prefer Blondes. He also acted in A Boy and His Dog – which he also co-produced, The Wackiest Ship in The Army, and War of the Worlds.\n\nHe died at the age of 75 in 1997.\n\nBefore we tell you more about how each Green Acres cast member died, please like this video and subscribe to our channel for more current news and interesting stories. Now, back to the video…\n\n____________________________________________________________________________\n\nPAT BUTTRAM\n\nIt was a sad day for Green Acres fans when Pat Buttram left us. He played the salesman and con man Mr. Haney on the show!\n\nMr. Haney was always trying to find a way to make a quick buck through his various schemes. His idiosyncratic behavior made him, arguably, the most popular character from Green Acres.\n\nSo, who was the mastermind behind the role? Pat Buttram was born Maxwell Emmett Buttram in Addison, Alabama in 1915.\n\nHe was the son of a Methodist Minister and considered entering the Ministry himself. He studied at Birmingham-Southern College to pursue his future career as a Minister.\n\nBut, it was during his time in college that he acted in plays and performed on his local radio station. He had been bitten by the acting bug and decided to pursue acting as his career.\n\nIn the 1940s, he moved to Hollywood to try his luck. He eventually became a sidekick to Gene Autry and appeared with him in over 40 films and in several episodes of Gene Autry’s TV show.\n\nBut it was his role as Mr. Haney that made Pat Buttram a major star. He played the character from 1965 to 1971 and it remains the role which many fans remember him by. Because of Pat Buttram’s unique voice, he also voiced many animated characters.\n\nHe did voice acting work for animated films such as Robin Hood, The Rescuers, and The Aristocats. His final role was in A Goofy Movie which was released posthumously.\n\nHe died at the age of 78 in 1994 from kidney failure. He has a Star on the Hollywood Walk of Fame as well as one on the Alabama Stars of Fame in Birmingham. Join Facts Verse to learn about the details How Each Green Acres Cast Member Died.\n\n____________________________________________________________________________\n\nFRANK CADY\n\nFrank Cady died in 2012 at the age of 96. He was a popular character who was best known for his character Sam Drucker whom he played on Petticoat Junction, The Beverly Hillbillies, and, of course, Green Acres.\n\nSam Drucker was the owner of the local general store in Hooterville. The character was the average Joe who wanted to do good by his community. That’s why, apart from his work at the general store, Sam Drucker also worked as a newspaper editor, fireman, postman, constable, notary, and a justice of the peace! Quite an impressive resume isn’t it?\n\nApart from his role as Sam Drucker, Frank Cady also had a recurring role as Doc Williams on The Adventures of Ozzie and Harriet. He also appeared in many classic films such as Ace In The Hole alongside Kirk Douglas, Rear Window, The Indian Fighter, The Bad Seed, The Million Dollar Duck, Hearts of the West, and Zandy’s Bride.\n\nHis final role was none other as Sam Drucker in the TV movie, Return to Green Acres!\n\nHe was born in 1915 in Susanville, California. Frank studied Drama at Stanford University and then appeared in plays at the Westminster Theater in London. He later served in the US Air Force in World War 2. He began his career with several small, and often uncredited roles, in feature films including D.O.A., The Asphalt Jungle, and When Worlds Collide.\n\nBut for Green Acres fans, we’ll always remember him as Sam Drucker!\n\n____________________________________________________________________________\n\n\n\nTOM LESTER\n\nTom Lester played the character Eb Dawson who was the local farmhand. The role was fitting for Tom Lester as he himself grew up working on his grandfather’s farm.\n\nHe died at age 81 in 2020, making him the last main cast member of Green Acres to pass away.\n\nHe studied Chemistry at the University of Mississippi and worked as a teacher in Oklahoma before he decided to pursue acting. When he was cast as Eb Dawson in Green Acres he beat out the competition not just for his incredible acting, but also because he was the only actor who actually knew how to milk a cow!\n\nAfter his work on Green Acres, he also had roles in shows such as Petticoat Junction and The Beverly Hillbillies. His TV career continued with shows such as Little House on the Prairie and Knight Rider.\n\nHis film career including roles in films such as Benji and Gordy. Apart from his career as an actor, Tom Lester would also travel around the country to speak to religious groups and youth groups about the Christian faith.\n\nHis love for farming never ended. He would split his time between Hollywood and his 250 acre timber farm in Mississippi. In fact, he won the “Wildlife Farmer of the Year” award in 1997.\n\nBut for Green Acres fans, we’ll remember him as good ol’ Eb Dawson! Join Facts Verse to learn about the details How Each Green Acres Cast Member Died.\n\nEDDIE ALBERT AND EVA GABOR\n\nGreen Acres made many Americans romanticize of leaving the craziness of their cities to the simpler life of the countryside. It showed us the beauty of the natural landscapes, small towns, and rural culture of our country.\n\nAnd for that, we have to thank Oliver Wendell Douglas and his wife Lisa. They were played by Eddie Albert and Eva Gabor who are sadly no longer with us.\n\nEddie Albert was born in Illinois in 1906. He grew up in Minneapolis and worked as a newspaper delivery boy during his childhood. During his high school years, he joined the Drama Club and began to hone his acting skills.\n\nHowever, he decided not to pursue an acting career. He majored in business at the University of Minnesota and decided to become an entrepreneur. However, The Great Depression hit upon his graduation, and he struggled to find employment.\n\nAmong the various odd jobs he took included working as a trapeze performer and as a nightclub singer. He even later co-hosted a radio show. It was clear that his love for performing had come back and he decided to pursue an acting career.\n\nIn Green Acres, he played Oliver Wendell Douglas who was a New York lawyer who wanted to escape the madness of New York to live in the idyllic countryside. Apart from his work in Green Acres, he appeared in the TV shows Switch and Falcon Crest. He also appeared in the films Roman Holiday and The Heartbreak Kid – both which earned him an Oscar nomination for Best Supporting Actor.\n\nEddie continued to have a prolific career in film and television after his work on Green Acres. He died at age 99 in 2005.\n\nLisa Douglas was played by Eva Gabor. She was born in Hungary and emigrated to the United States after her first marriage to Swedish doctor, Eric Drimmer.\n\nLisa began her acting career with a role in the 1941 film Forced Landing. She continued to act in films and soon graduated to television as well. She even had a short-lived talk show called The Eva Gabor Show.\n\nBut it was her role in Green Acres that really resonated with audiences. She herself loved her work on the show. She later said that her experience with the show was “the best six years of my life. I adored every minute of it.”\n\nIn her later career, she did voice acting for many animated films. She reunited with her Green Acres co-star Pat Buttram in both The Aristocats and The Rescuers.\n\nEva Gabor died in 1995 due to complications from pneumonia.\n\n\n\nAre you a fan of Green Acres? The show was one of the best sitcoms America has produced and one that reminds us of simpler and happier times.\n\nSo that brings up the question:\n\nDo you think that a show like Green Acres with its simplicity would work today? Or have our tastes changed that the show would be considered dated?\n\nLet’s hear your thoughts in the comments.\n\nIf you liked this story, be sure to hit the ‘like’ button and be sure to Subscribe to FactsVerse for more great stories! Hit the bell icon to receive regular notifications!\n\nWe’ll see you in the next video!"}, {"url": "https://nostalgiacentral.com/television/tv-by-decade/tv-shows-1960s/green-acres/", "page_content": "1 9 6 5 – 1 9 7 1 (USA)\n\n170 x 30 minute episodes\n\n“Darlink I love you, but give me Park Avenue . . . “\n\nTV producer Paul Henning had already struck gold with his rural sitcoms The Beverly Hillbillies and Petticoat Junction when he was approached by writer Jay Sommers, suggesting Henning make a TV version of his 13-episode 1950 CBS radio series Granby’s Green Acres (itself based on S J Perelman’s 1942 book Acres And Pains).\n\nHenning saw the potential in the idea, a mirror-image format to The Beverly Hillbillies, with powerful New York City lawyer Oliver Douglas (Eddie Albert) and his socialite wife Lisa (Eva Gabor, sister of Zsa Zsa) leaving Manhattan for the countryside and having to come to terms with the rather primitive conditions of their new rural home just outside Hooterville, Illinois – the fictional home of Petticoat Junction.\n\nLisa feared she’d be a fish-out-of-water in the country, missing her beloved Park Avenue shops, but hubby Oliver was hell-bent on enjoying the rural pleasures that Hooterville offered and persuaded his wife to move away from her beloved New York.\n\nThe twist was that when they arrived in their new home it was Lisa who quickly adapted to the backwater, easily making friends and solving country problems with her big-city solutions.\n\nSeriously scatty, it was almost as if she was oblivious to her surroundings and continued to live exactly as she had in Manhattan.\n\nLawyer Oliver, on the other hand, despite his willingness to live as a son of the soil, never quite pulled it off, failing to master the country dwellers’ insane logic, although Lisa grasped it easily.\n\nOliver was destined to become the ultimate straight man in a hick town whose bizarre residents pushed rural behaviour to surreal limits.\n\nAlthough Green Acres made occasional references to The Beverly Hillbillies and shared a general store with Petticoat Junction, this series was in a class by itself and easily surpassed the other two comedies.\n\nWhile the lead characters were capable enough it was the fantastic collection of finely cast minor characters that gave Green Acres most of its appeal – folks such as the quirkily-voiced hornswaggling conman Mr Haney (Pat Buttram); county agent Hank Kimball (Alvy Moore); gormless handyman Eb (Tom Lester); bumbling house builders Alf Monroe (Sid Melton) and his sister Ralph (Mary Grace Canfield); pig farmer Fred Ziffel (Hank Patterson) and his wife, Doris (Barbara Pepper) who treated their 250-pound pet pig Arnold as if he was their son, and many others.\n\nBut there was also much playfulness involving the TV medium itself. For example, screen credits occasionally appeared on unusual props (like the local newspaper), and characters regularly made references to other TV shows.\n\nAll in all, Green Acres was closer to Twin Peaks and Northern Exposure than to traditional sitcoms, although it sported a high groan factor of terrible puns and malapropisms usually delivered by Lisa in her thick Hungarian accent.\n\nThere was also a generous quota of in-jokes and running gags: Lisa’s hotcakes; Oliver’s speeches; the oddball electricity system; the building of the bedroom wall that was never finished, and plenty more.\n\nGreen Acres was cancelled in 1971 when CBS consciously targeted a younger demographic audience and purged its so-called “rural comedies.”\n\nOn 18 May 1990, CBS aired a two-hour TV movie, Return To Green Acres, with Eddie Albert, Eva Gabor and many of the remaining original cast re-creating their earlier roles.\n\nIn this, Oliver and Lisa prevented a ruthless real-estate tycoon from razing Hooterville in order to build a city of mini-malls, homes, parking lots and fast-food restaurants.\n\nA Green Acres movie for the big screen was also planned in the late 1990s, with Bette Midler allegedly cast in the Eva Gabor role. It failed to materialise.\n\nOliver Wendell Douglas\n\nEddie Albert\n\nLisa Douglas\n\nEva Gabor\n\nMr Haney\n\nPat Buttram\n\nEb Dawson\n\nTom Lester\n\nHank Kimball\n\nAlvy Moore\n\nSam Drucker\n\nFrank Cady\n\nFred Ziffel\n\nHank Patterson\n\nDoris Ziffel\n\nBarbara Pepper (1)\n\nFran Ryan (2)\n\nAlf Monroe\n\nSid Melton\n\nRalph Monroe\n\nMary Grace Canfield\n\nArnold Ziffel\n\nArnold the Pig\n\nVideo"}, {"url": "https://www.moviefone.com/movie/return-to-green-acres/1088634/main/", "page_content": "Return to Green Acres (1990)\n\nAudience Score 40 NR 1 hr 32 min Comedy\n\nTv movie that reunites most the show's cast members. The Douglases move back to New York. But when Haney tries to get everyone's property so that a developer can build on them, the residents go to New York to get Douglas to help them. But he's a little hesitant."}, {"url": "https://nostalgiacentral.com/television/tv-by-decade/tv-shows-1960s/green-acres/", "page_content": "1 9 6 5 – 1 9 7 1 (USA)\n\n170 x 30 minute episodes\n\n“Darlink I love you, but give me Park Avenue . . . “\n\nTV producer Paul Henning had already struck gold with his rural sitcoms The Beverly Hillbillies and Petticoat Junction when he was approached by writer Jay Sommers, suggesting Henning make a TV version of his 13-episode 1950 CBS radio series Granby’s Green Acres (itself based on S J Perelman’s 1942 book Acres And Pains).\n\nHenning saw the potential in the idea, a mirror-image format to The Beverly Hillbillies, with powerful New York City lawyer Oliver Douglas (Eddie Albert) and his socialite wife Lisa (Eva Gabor, sister of Zsa Zsa) leaving Manhattan for the countryside and having to come to terms with the rather primitive conditions of their new rural home just outside Hooterville, Illinois – the fictional home of Petticoat Junction.\n\nLisa feared she’d be a fish-out-of-water in the country, missing her beloved Park Avenue shops, but hubby Oliver was hell-bent on enjoying the rural pleasures that Hooterville offered and persuaded his wife to move away from her beloved New York.\n\nThe twist was that when they arrived in their new home it was Lisa who quickly adapted to the backwater, easily making friends and solving country problems with her big-city solutions.\n\nSeriously scatty, it was almost as if she was oblivious to her surroundings and continued to live exactly as she had in Manhattan.\n\nLawyer Oliver, on the other hand, despite his willingness to live as a son of the soil, never quite pulled it off, failing to master the country dwellers’ insane logic, although Lisa grasped it easily.\n\nOliver was destined to become the ultimate straight man in a hick town whose bizarre residents pushed rural behaviour to surreal limits.\n\nAlthough Green Acres made occasional references to The Beverly Hillbillies and shared a general store with Petticoat Junction, this series was in a class by itself and easily surpassed the other two comedies.\n\nWhile the lead characters were capable enough it was the fantastic collection of finely cast minor characters that gave Green Acres most of its appeal – folks such as the quirkily-voiced hornswaggling conman Mr Haney (Pat Buttram); county agent Hank Kimball (Alvy Moore); gormless handyman Eb (Tom Lester); bumbling house builders Alf Monroe (Sid Melton) and his sister Ralph (Mary Grace Canfield); pig farmer Fred Ziffel (Hank Patterson) and his wife, Doris (Barbara Pepper) who treated their 250-pound pet pig Arnold as if he was their son, and many others.\n\nBut there was also much playfulness involving the TV medium itself. For example, screen credits occasionally appeared on unusual props (like the local newspaper), and characters regularly made references to other TV shows.\n\nAll in all, Green Acres was closer to Twin Peaks and Northern Exposure than to traditional sitcoms, although it sported a high groan factor of terrible puns and malapropisms usually delivered by Lisa in her thick Hungarian accent.\n\nThere was also a generous quota of in-jokes and running gags: Lisa’s hotcakes; Oliver’s speeches; the oddball electricity system; the building of the bedroom wall that was never finished, and plenty more.\n\nGreen Acres was cancelled in 1971 when CBS consciously targeted a younger demographic audience and purged its so-called “rural comedies.”\n\nOn 18 May 1990, CBS aired a two-hour TV movie, Return To Green Acres, with Eddie Albert, Eva Gabor and many of the remaining original cast re-creating their earlier roles.\n\nIn this, Oliver and Lisa prevented a ruthless real-estate tycoon from razing Hooterville in order to build a city of mini-malls, homes, parking lots and fast-food restaurants.\n\nA Green Acres movie for the big screen was also planned in the late 1990s, with Bette Midler allegedly cast in the Eva Gabor role. It failed to materialise.\n\nOliver Wendell Douglas\n\nEddie Albert\n\nLisa Douglas\n\nEva Gabor\n\nMr Haney\n\nPat Buttram\n\nEb Dawson\n\nTom Lester\n\nHank Kimball\n\nAlvy Moore\n\nSam Drucker\n\nFrank Cady\n\nFred Ziffel\n\nHank Patterson\n\nDoris Ziffel\n\nBarbara Pepper (1)\n\nFran Ryan (2)\n\nAlf Monroe\n\nSid Melton\n\nRalph Monroe\n\nMary Grace Canfield\n\nArnold Ziffel\n\nArnold the Pig\n\nVideo"}, {"url": "https://news.amomama.com/85216-heres-happened-eb-green-acres-series-end.html", "page_content": "Tom Lester is best known for his role as Eb Dawson on the television series, Green Acres . Here's what happened to the legendary actor after his hit show ended.\n\nAdvertisement\n\nAccording to KXRB, Lester beat out 400 other actors to play the character of Eb Dawson after a screen test.\n\nHe got the role because he was the only one who could milk a cow in real life.\n\nThe actor then appeared in nearly every Green Acres episode between 1965–71. Unfortunately, the hit series was canceled after six seasons.\n\nAfter Green Acres, Lester was forever typecast as Eb Dawson. He decided to return to his parent's home in Laurel, Mississippi, but continued to do an occasional movie or TV role.\n\nAdvertisement\n\nDuring the mid-1970s to early 1980s, Lester appeared on several shows, including Little House on the Prairie, Marcus Welby, M.D., Knight Rider and Love, American Style.\n\nIn 1991, he was picked to play the adult Pete Maravich in the film about the future basketball hall-of-famer's youth, The Pistol: The Birth of a Legend.\n\nThough Lester, who is also a farmer, took a hiatus from acting, he still participates in autograph shows and fan forums. He often dressed as Eb Dawson.\n\nAdvertisement\n\nFor many years, Lester has been a Christian speaker who travels the nation, preaching a message of faith and obedience.\n\nIn 1997, he was the recipient of Mississippi's \"Wildlife Farmer of the Year\" award.\n\nLester tied the knot with Kaylie in July 2007 at the age of 68. The couple lives on the 250-acre family farm in Vossburg, Mississippi.\n\nIn 2014, Lester starred with Ray Stevens and Victoria Jackson in the family-oriented show, Campin' Buddies.\n\nIn that same year, with the death of Mary Grace Canfield, Lester became the only surviving regular cast member of Green Acres.\n\nBorn in Laurel, Mississippi, Lester's legacy has influenced and is still influencing his hometown in many ways."}, {"url": "https://people.com/tv/tom-lester-dead-parkinsons-disease-green-acres-star-81/", "page_content": "Actor Tom Lester has died. He was 81.\n\nThe star died on Monday in Nashville, Tennessee, due to complications from Parkinson’s disease, his brother Michael Lester announced on Facebook.\n\nHe died in the home of his fiancée and longtime caregiver, Jackie Peters, his brother shared.\n\nLester is most known for his role as Eb Dawson on the TV series Green Acres, which follows a New York City attorney and his wife as they attempt to live as genteel farmers.\n\nThe series first aired in 1965 and ran for six seasons before ending in 1971.\n\n“He was the only connection with the youth the show had,” Green Acres director Richard L. Bare said of Lester to the TV Academy’s The Interviews series in 2003, Deadline reported.\n\nLester reprised his role as Dawson in the TV movie Return to Green Acres in 1990.\n\nLester is believed to have been the last surviving cast member of Green Acres, according to The Hollywood Reporter.\n\nHe also portrayed the character Eb Dawson in the hit series The Beverly Hillbillies and Petticoat Junction.\n\nLester also landed a number of film roles including his part as Riley in the 1974 movie Benji and Cousin Jake in Gordy. He also starred in Charo and the Sergeant as Sgt. Hank Palmer.\n\nWalt Disney Television\n\nLester was born in Jackson Mississippi in 1938, according to his IMDb bio, and spent his childhood on his grandfather’s farm on which he shucked corn, fished, picked cotton and hunted.\n\nBefore taking his talents to Hollywood, Lester graduated from the University of Mississippi, earning a degree in biology and chemistry.\n\nOf his career in acting, Lester said his friends told him in an undated interview, according to The Hollywood Reporter, “You’re crazy. You’ll never be able to do that. You’re too tall, too skinny, too ugly. You’ve got a Southern accent, and you’ll never make it in the motion picture business.”\n\nAlbert L. Ortega/WireImage\n\nAside from his career in Hollywood, Lester remained an active member of his Mississippi farming community.\n\nIn 1997, he was the recipient of Mississippi’s Wildlife Farmer of the Year award.\n\nIn the Facebook announcement, Lester’s brother announced that there will be a graveside service on Friday, April 24.\n\n“Death leaves heartache, no one can heal. Love leaves a memory, no one can steal,” Michael wrote on Facebook."}, {"url": "https://news.amomama.com/85216-heres-happened-eb-green-acres-series-end.html", "page_content": "Tom Lester is best known for his role as Eb Dawson on the television series, Green Acres . Here's what happened to the legendary actor after his hit show ended.\n\nAdvertisement\n\nAccording to KXRB, Lester beat out 400 other actors to play the character of Eb Dawson after a screen test.\n\nHe got the role because he was the only one who could milk a cow in real life.\n\nThe actor then appeared in nearly every Green Acres episode between 1965–71. Unfortunately, the hit series was canceled after six seasons.\n\nAfter Green Acres, Lester was forever typecast as Eb Dawson. He decided to return to his parent's home in Laurel, Mississippi, but continued to do an occasional movie or TV role.\n\nAdvertisement\n\nDuring the mid-1970s to early 1980s, Lester appeared on several shows, including Little House on the Prairie, Marcus Welby, M.D., Knight Rider and Love, American Style.\n\nIn 1991, he was picked to play the adult Pete Maravich in the film about the future basketball hall-of-famer's youth, The Pistol: The Birth of a Legend.\n\nThough Lester, who is also a farmer, took a hiatus from acting, he still participates in autograph shows and fan forums. He often dressed as Eb Dawson.\n\nAdvertisement\n\nFor many years, Lester has been a Christian speaker who travels the nation, preaching a message of faith and obedience.\n\nIn 1997, he was the recipient of Mississippi's \"Wildlife Farmer of the Year\" award.\n\nLester tied the knot with Kaylie in July 2007 at the age of 68. The couple lives on the 250-acre family farm in Vossburg, Mississippi.\n\nIn 2014, Lester starred with Ray Stevens and Victoria Jackson in the family-oriented show, Campin' Buddies.\n\nIn that same year, with the death of Mary Grace Canfield, Lester became the only surviving regular cast member of Green Acres.\n\nBorn in Laurel, Mississippi, Lester's legacy has influenced and is still influencing his hometown in many ways."}, {"url": "https://www.latimes.com/entertainment/tv/la-xpm-2012-jun-10-la-et-st-green-acres-frank-cady-dead-20120610-story.html", "page_content": "Frank Cady, 96, a character actor who played Hooterville general-store proprietor Sam Drucker on the TV sitcoms “Green Acres” and “Petticoat Junction,” died Friday at his home in Wilsonville, Ore., said his daughter, Catherine Turk. No specific cause was given.\n\nLike Mr. Haney, Eb Dawson, Hank Kimball and Arnold the Pig, Cady’s Sam Drucker was a supporting cast member on “Green Acres” to lawyer Oliver Wendell Douglas and his socialite wife, Lisa, played by Eddie Albert and Eva Gabor, who had ditched the high life in New York City for the charms of a farm in Hooterville.\n\nCady played Drucker for the entire run of “Green Acres” on CBS, from 1965 to 1971, when it was canceled. The show continued to air for years in syndication. He also portrayed Drucker on “Petticoat Junction” and “The Beverly Hillbillies,” programs that shared some secondary characters. He reprised the role for the 1990 TV movie “Return to Green Acres.”\n\nAdvertisement\n\nPHOTOS: Notable deaths of 2012\n\nCady had a recurring role as Doc Williams on “The Adventures of Ozzie and Harriet” and had guest roles in TV series beginning in the early 1950s. He also had small parts in films, most notably Alfred Hitchcock’s “Rear Window,” and appeared in Southern California stage productions.\n\nHe was born Sept. 8, 1915, in the Lassen County town of Susanville and studied drama at Stanford University. After serving in the military during World War II, he worked as a radio broadcaster before landing acting jobs.\n\nCady and his wife, Shirley, moved to Oregon in the 1990s. She died in 2008.\n\nReflecting on his TV career, Cady told the Portland Oregonian in 1995, “You get typecast. I’m remembered for those shows and not for some pretty good acting jobs I did other times. I suppose I ought to be grateful for that. Because otherwise I wouldn’t be remembered at all. I’ve got to be one of the luckiest guys in the world.”\n\nRELATED:\n\nVic Mizzy, 93, wrote ‘Green Acres’ theme song\n\nEddie Albert, 99, versatile stage and screen actor\n\nEva Gabor, 74, actress and younger sister of Zsa Zsa Gabor\n\n\n\n"}]}