{"Hilda Kuper was an anthropologist and author.": [{"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.howold.co/person/hilda-kuper/biography", "page_content": "Hilda Kuper Biography\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and *ociating with the Swaziland's royal family after she was awarded with a grant by the International African Ins*ute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Wi*ersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Ins*ute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With *istance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the har*ment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny. Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947.\n\n. Oxford University Press. 1947. The uniform of colour, a study of white-black relationships in Swaziland . 1947.\n\n. 1947. African systems of kinship and marriage . 1950.\n\n. 1950. The Shona and Ndebele of Southern Rhodesia . 1954.\n\n. 1954. An Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956.\n\n. 1956. An ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959.\n\n. 1959. Indian people in Natal . 1960.\n\n. 1960. The Swazi: a South African kingdom . New York, Holt, Rinehart and Winston. 1963.\n\n. New York, Holt, Rinehart and Winston. 1963. African law: adaptation and development . 1965.\n\n. 1965. Bite of hunger: a novel of Africa . 1965.\n\n. 1965. Urbanization and migration in West Africa . 1965.\n\n. 1965. A witch in my heart: a play set in Swaziland in the 1930s . 1970.\n\n. 1970. Sobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970.\n\n. 1970. South Africa: human rights and genocide. 1981.\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016. Retrieved 26 October 2016.\n\nExternal links"}, {"url": "https://peoplepill.com/people/hilda-kuper/", "page_content": "Hilda Beemer Kuper, née Beemer (23 August 1911 – 1992), was a social anthropologist most notable for her extensive work on Swazi culture.\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nAward Awarding body Year Rivers Memorial Medal Royal Anthropological Institute 1961 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation 1969 Honorary doctorate University of Swaziland 1990\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny.\n\nPublications"}, {"url": "https://www.goodreads.com/book/show/3296596-the-swazi", "page_content": "The Land of the Lion and Lady Elephant\n\n\n\nOver half a century ago, Swaziland, the size of Hawai'i, had barely 250,000 inhabitants. Though the huge majority were African, whites owned much of the land. The king, \"The Lion\" and queen mother, \"The Lady Elephant\" ruled, but more in name than in fact. Hilda Kuper lived and studied there from 1934 to 1945, with a few more visits in the late 1950s. So, in short, this study published in 1964 is quite outdated. It is part of the vast Holt, Rinehart and Winston series of anthropological studies by (usually) well-known scholars. Kuper is no exception. This is a very short, succinct summary of many aspects of Swazi culture. It shows considerable thought and expertise though no voice is given to the Swazi themselves, as was usual in those days. It follows a format common to the whole series. It does include a fair bit of history, which was not always the case in the anthropology of those times. The study contains material on political structure, kinship and family, religion, work and economic relations, education, and the effects of Christianity and western culture in general. The Swazi did not suffer the hammerings of fortune which befell the Zulu, Xhosa, and others, managing to maintain a semblance of their freedom under their traditional rulers. Many Swazi men migrated to work in the mines and fields of South Africa, still the case. Today, the population numbers more like 1.38 million, but due to the ravages of AIDS, at the highest rate in the world (26% of population with HIV), the life expectancy of Swazilanders is one of the lowest in the world. They have experienced trouble balancing traditional ways and a monarchy with the winds of change that blow ever stronger. Problems of land tenure, evident from Kuper's book, still have not been solved. If you are curious about Swazi tradition and how it looked in an earlier time, you could give this book a shot. It could be useful for comparative studies in culture for first year anthropology students, but it is now social history rather than a contemporary work. That's why I have given it only three stars, though the work is good."}, {"url": "https://abbysgondek.com/portfolio/fatima-meer-and-hilda-kuper-jewish-muslim-collaborations-in-research-on-indian-south-africans/", "page_content": "Dr. Abby Gondek, Morgenthau Scholar-in-Residence, FDR Library, Hyde Park, NY\n\nPhD Global and Socio-cultural Studies, Florida International University\n\nMA African and African Diaspora Studies, FIU\n\nMA Women’s Studies, SDSU\n\nFor the roundtable: The politics of knowledge in jewish women’s activism @ NWSA 2019\n\nNovember 14, 2019 in San Francisco, CA\n\nHilda Kuper with Fatima Meer and Gisele Maquet, in front of Hilda’s home on Warner Ave. in Los Angeles, 1984/5. Kuper family photograph collection, courtesy Mary Kuper. Fatima’s daughter, Shamim, posited that Fatima must have come to visit Hilda during 1985 when Fatima was a Visiting Lecturer at Swarthmore. Gisele Maquet’s husband, Jacques Maquet, was an anthropologist at UCLA (with Hilda).\n\nAbstract\n\nFatima Meer (1928-2010), a feminist sociologist of Indian Muslim (on her paternal side) and Jewish descent (on her maternal grandfather’s side) in South Africa, collaborated with Hilda Kuper (1911-1992), a Jewish anthropologist (born in Rhodesia), producing “The Indian Elites in Natal, South Africa” (1956). Meer conducted fieldwork and influenced Kuper’s Indian People in Natal (1960) as well as Kuper’s play The Decision (1957). One of the themes in Meer’s work was black and Indian women’s experiences of racism and sexism and the use of suicide as a mode of resistance within apartheid South Africa (1976). This presentation explores how Kuper and Meer influenced each other’s writings and anti-apartheid activism.\n\nOrganization\n\nI begin with an explanation of Hilda Kuper & Fatima Meer and then move into their collaboration, focusing on the publications they wrote together or that were thematically connected. In part 3, I detail the timeline of their relationship. In the last section, I describe Hilda’s play The Decision, influenced by her research with Fatima Meer and discuss their overlapping themes such as suicide and different types of elites within the Indian community in South Africa.\n\nPart 1: Intro to Hilda Kuper & Fatima Meer\n\nHilda Kuper was born in 1911 in Bulawayo, Rhodesia, grew up in Johannesburg, South Africa and received her anthropological training with Winifred Hoernlé at the University of Witwatersrand and Bronislaw Malinowski at the London School of Economics. Kuper’s first fieldwork involved studying the impact of liquor laws on black women in Johannesburg. Later her research sites expanded to Swaziland and Indian communities in Durban, Natal, South Africa, where she formed a life-long friendship and research partnership with sociologist, Fatima Meer, who was of South African, Indian, Muslim and Jewish descent. Their collaboration will be the focus of this presentation.\n\nHilda Kuper at her home in Los Angeles, 1974, at a party organized for her students, photograph by Dawn Chatty\n\nThrough Hilda’s marriage to Leo Kuper she became involved in non-violent apartheid protests as one of the founders of the Liberal Party and was forced to leave South Africa; she eventually became a Professor of Anthropology at UCLA.\n\nHilda Kuper (center) with Leo Kuper, her husband (behind), and Max Gluckman, her old friend and anthropology colleague from the University of Witwatersrand in Johannesburg, (at the right) at Watts Towers, Los Angeles. Hilda Kuper Papers, UCLA Special Collections, Box 45, Folder 20. For more information on the connection between Max Gluckman and Hilda Kuper see Andrew Bank, p. 193, n. 17\n\nIn her theorizing about black women, Hilda took a “Swazi point of view,” arguing that Westernization weakened women’s position. She portrayed Swazi women and Indian South African women as the victims of colonization as well as patriarchal indigenous systems.\n\nHilda’s initial interests in law, acting, languages and history, morphed into her career as a legal and political anthropologist, novelist and playwright. Durkheim and French sociology were also highly influential, as both Hilda and her research collaborator, Fatima Meer, wrote about suicide and women of color in Southern Africa.\n\nHilda’s graduate student at UCLA, David Kuby, said the following of her Jewish identity:\n\n“Jewish, British and African are quite a combination of values not easily put into one neat box and there was a comfortable, very human dimension of Hilda that was humble and nonjudgmental that made one feel very accepted in our imperfections despite Hilda’s high standards for scholarship and social justice work.” -David Kuby, December 29, 2016, e-mail correspondence\n\nThe information in this section comes from a brief bio I wrote of Hilda, based on my dissertation. You can find the full bio I wrote here on my academia.edu page and the excerpt from it was published at Bustle.com.\n\nFatima Meer and Nelson Mandela at her home in 1995, image by Richard Shorey\n\n“Meer’s Gujrati grandfather, Ismail, had arrived in South Africa as a trader from Surat on the east coast of India in the 1880s. Her father, Moosa Meer, was the editor of Indian Views, a weekly in Urdu and English. Her mother, Ameena, was a white woman [whose father was Jewish] originally called Rachel. The Meer household was a mixture of Muslim Gujarati traditions and liberal political activism; Fatima combined the two.”\n\nWajid, Arjumand. 2010. “Fatima Meer: Academic and Activist.” The Hindu, March 30, 2010.\n\n“At a time when most Indian girls were helping their mothers in the kitchen making samosas, this young woman was leading protest marches and challenging the most oppressive system in the world.” Winnie Mandela\n\nFrom the Wajid obituary of Fatima Meer, March 30, 2010.\n\nAn article about Fatima’s artwork that was created while she was in the Women’s Gaol in Johannesburg has just come out this October in the New Yorker magazine. I visited the Gaol in March 2017, while in Johannesburg for my dissertation research. You can also learn about Fatima’s art work during her imprisonment here.\n\n“Morning in the Prison Yard” by Fatima Meer, a photograph I took of her painting, one of many displayed on this mesh-like canvas throughout the women’s gaol. Photo by Abby Gondek, March 26, 2017\n\nPhotograph of myself taking a photo of the display for the wash-house courtyard. This was one of the most traumatic areas in the prison because I learned that female prisoners had to wash all of the clothing, including the male prisoners’ pants, which were oftentimes stained with blood (likely from being raped or lashed). These are images from the Women’s Gaol in downtown Johannesburg, where Fatima Meer was detained (in 1976) and painted scenes from her daily life in the prison. The painting on the left contains the following explanation written by Meer: “The two prisoners in the foreground are carrying our bath water from the kitchen. The other prisoner brings our flask of boiling water. The awaiting trial prisoners line up for breakfast on the left. The ‘convicted’ line up on the right. The three prisoners facing the wall are waiting for sanitary pads. They will get three each for the day.”\n\n“…in 1976, [Fatima Meer] was held for six months, without trial, under the apartheid government’s Terrorism Act. Her crime was an attempt to organize a mass rally with the activist Steve Biko, after police shot at and killed student protesters in the township of Soweto.” Anakwa Dwamena, October 23, 2019, The New Yorker\n\nPart 2: Writing collaboration\n\nHilda collaborated with Fatima Meer on a project about Indian South Africans in Durban, Natal (Kuper and Meer 1956).\n\nThis network visualization developed using nodegoat, a project of Lab1100, displays the connections between the publications of Hilda Kuper and Fatima Meer.\n\nThis network visualization displays the publications written by Hilda Kuper and Fatima Meer. “Indian Elites in Natal” (1956), co-authored by Kuper and Meer, shared a thematic focus on Indian South Africans and protest with Hilda’s book Indian People in Natal (1960), for which Fatima Meer acted as a research assistant. “Indian Elites” also shared an emphasis on Indian ethnic groups, such as Tamil and Hindustani, with Hilda’s play The Decision (1957). All three of these works, contrasted the “African” (meaning black) and Indian South African populations. Note the connection between Violaine Junod’s “Report on a Study of the Coloured ‘Social Elite’ in London” (1952) and Hilda Kuper and Fatima Meer’s “Indian Elites in Natal” (1956). Violaine Junod was close to both Hilda Kuper and Fatima Meer (Junod n.d.). Fatima Meer described the Kupers and Violaine Junod as her “most constant friends” during the Treason Trials in 1956 (Meer 2017, 169).\n\nJunod, Violaine. n.d. “Violaine Junod Letters to Hilda Kuper, Correspondence from 1970s-80s.” Box 52. Folder 7. Los Angeles, CA: Hilda Kuper Papers, Box 52, Folder 7, UCLA Special Collections, Charles E. Young Research Library.\n\nMeer, Fatima. 2017. Fatima Meer: Memories of Love and Struggle. Edited by Shamim Meer. Cape Town: Kwela Books.\n\nPart 3: Hilda and Fatima’s relationship\n\nHilda met Fatima Meer in 1952 when Hilda moved to Durban, where her husband Leo Kuper, received a Sociology chair position at the University of Natal. It was Leo, the new head of the department, who allowed Fatima to rewrite her sociology honors exam (after she had been failed by a racist Afrikaner Nationalist lecturer); she passed with “flying colours” (Meer 2017, 150-151).\n\nFatima was Hilda’s research assistant for Kuper’s book Indian People in Natal (Kuper 1960, x). The Institute of Community and Family Health in the Newlands neighborhood in Durban funded this research (Meer 2017, 155). Fatima’s fieldwork notebooks in the Hilda Kuper Papers, elaborate the effect of Indian immigration to South Africa upon caste affiliation, marriage traditions, legally required medical care, and labor strikes. Meer also tracked and summarized the ship logs by sex, age, caste, religion, village, and marriage status (Kuper et al. 1953). In her autobiography, Fatima refers to “filling in dozens of these reporter’s notebooks” but unfortunately, she was dismissed after only a year from this position at the Institute of Community and Family Health because of her anti-apartheid activism and radicalism; Hilda and Fatima were both shocked (2017, 158). Hilda clearly used Fatima’s notes in Indian People in Natal in Chapter 1 regarding migration and Chapter 2 on changes in caste affiliation post-migration.\n\nKuper, Hilda, Fatima Meer, R. Singh. 1953. “Hilda Kuper Papers, Box 14 (Fatima Meer and R. Singh Fieldnotes).” Los Angeles: UCLA Special Collections.\n\nHilda Kuper’s transnational migrations & fieldwork, a geographical visualization, developed using nodegoat, a project of Lab1100\n\nHilda conducted fieldwork in Durban in three Indian suburbs from 1953-1957 with funding from the Council for Social and Industrial Research. She worked with Indian health educators who were trained by the Institute of Community and Family Health including four women Miss N. Perumal, Mrs. Padmini Govindoo, Sally Naidoo and Violet Padayachee. In addition to Fatima Meer, Mrs. Radhi Singh assisted Hilda (Bank 2016, 218-221; Kuper 1960, x).\n\nBank, Andrew. 2016. Pioneers of the Field: South Africa’s Women Anthropologists. London, England: Cambridge University Press, International African Institute.\n\nThe Kuper home was a central site for anti-apartheid solidarity across racial lines. On November 9, 1952, Leo collaborated with the joint ANC-Indian Congress political rally at Red Square in Durban; he wrote about his experiences in Passive Resistance in South Africa (1955). Leo was arrested in 1956 with Alan Paton and four Indian Congress members for their participation in the “assembly of the Native” in the Gandhi Library Hall in Durban; this is where they launched a defense fund for the 156 Treason Trialists. Hilda was arrested earlier in 1956 with Fatima Meer at a women’s march protesting new laws that extended the pass system to “non-European” women (Bank 2016, 217–18). Also in 1956, the Kupers “solicited a loan” and “stood guarantor” for Fatima and her husband Ismail Meer, so that they could get the capital to build their house, since non-whites could not get loans at that time (Meer 2017, 163).\n\nHilda was “combative with non-progressive colleagues” and was excluded from a departmental research trip to Swaziland, despite her expertise (Russell 1994, 146). By the late 1950s, the apartheid police increasingly harassed Leo and Hilda, spies attended their lectures, and Leo was threatened with a banning order; eventually Hilda instigated their departure from South Africa (Golomski 2011, 4; Moran 1988, 198).\n\nRussell, Margo. 1994. “OBITUARY: Hilda Kuper, 1911-92.” Africa 64 (1): 145–49.\n\nGolomski, Casey. 2011. “Hilda Kuper, Anthropology, History.” In University of Swaziland, UNISWA, History Staff Seminar Series, 21. University of Swaziland, Department of Theology and Religious Studies.\n\nMoran, Katy. 1988. “Hilda Beemer Kuper (1911- ).” In Women Anthropologists: Selected Biographies, edited by Ute Gacs, Aisha Khan, Jerrie McIntyre, and Ruth Weinberg, 194–201. Urbana: University of Illinois Press.\n\nIn 1970, Hilda wrote to Fatima from Los Angeles to express that she was “so delighted” with Fatima’s book (Portrait of Indian South Africans, 1969) that she and Leo felt Fatima should submit it for a Ph.D.\n\n“The photographs are fascinating and the text is rich in perception.” Kuper, Hilda. 1970. “Hilda Kuper to Fatima Meer and Ismail Meer, March 20, 1970.” Los Angeles, CA: Hilda Kuper Papers, Box 41, Folder 9, UCLA Special Collections, Charles E. Young Research Library.\n\nIn closing, Hilda wrote, “There is so much to talk about that cannot be expressed in letters. We think of you very often and send you much, much love” (Kuper 1970). In her autobiography, Fatima wrote that Hilda Kuper “considered the manuscript so good that she canvassed the head of department to award me a doctorate for it” (Meer 2017, 186).\n\nIn this letter from Hilda to Fatima, Hilda explains that she is about to visit her daughter Mary in Israel, before going to Swaziland (in 1970 Hilda became a Swazi citizen). Hilda complements Fatima on her new book and expresses how much both she and Leo think of Fatima and send much love. Hilda Kuper Papers, Box 41, Folder 9.\n\nPart 4: The Decision\n\nThe Decision (1957) is a tragic play written by Hilda Kuper in which the female lead character is punished through death, for the patriarchal and racist hierarchical structure of her society. In this play, Savitree, a girl from a high caste Hindi speaking family in Durban, in Natal province, South Africa, fell in love with a Tamil Christian boy, Siva, whose family was from Southern India.\n\nThe cover page for the program of Hilda’s 1957 version of The Decision, performed in Durban by medical students at the University of Natal. Sondra Hale personal collection of Hilda Kuper’s creative writing at UCLA, Anthropology Department.\n\nTheir different ethnicities and religions, as well as the fact that Siva was active in the Indian National Congress and the passive resistance movement, marked Siva as “other” and unmarriageable (61). One version of the story closed when Savitree set fire to herself and died because her family forbade her to be with Siva (Kuper 1993, 63).\n\nKuper, Hilda. 1993. A Witch in My Heart: Short Stories and Poems. Edited by Nancy Schmidt. Madison: African Studies Program, University of Wisconsin–Madison. https://books.google.com/books?id=bh5aAAAAMAAJ&pgis=1.\n\nIn a different version of the play, Savitree sacrificed herself by marrying the man her family decided she should marry (Kuper 1957, 30–31).\n\nKuper, Hilda. 1957. “The Decision: A Contemporary South African Indian Play.” Durban Medical Students Drama Group. Los Angeles, CA: Sondra Hale Personal Collection, UCLA Anthropology Department, Haines Hall 391.\n\nDirectly before Siva heard the news of Savitree’s suicide (in the 1993 version) he told his activist friends that Indian South African families imprison their daughters in domestic roles, preventing their freedom. Siva’s friend Rajid Naidoo argued:\n\n“African women are a major force in African politics, but few Indian women are active in political affairs.” Hilda Kuper, 1993\n\nThis implied that the problem was within Indian culture, rather than South African culture as a whole. Siva’s friend Chetty remarked that the women should “free themselves” rather than waiting for men to do so, upon which Siva discovered that Savitree killed herself, causing the reader to wonder if this was Savitree’s way of “freeing herself” (Kuper 1993, 63).\n\nIn the 1957 version of the play, Siva’s words close the play:\n\n“all I wanted is to be myself and let others be themselves.” Hilda Kuper, 1957\n\nHe contended that Savitree should not have had to sacrifice herself for her family out of the “strength of her affection for others, for those who had brought her up.” Siva emphasized that her loyalty should not lie with her family alone but with the “family of the people of the world” (31).\n\nPerhaps, this was Kuper’s message for unity rather than separation between not only Indian South Africans, but also all South Africans.\n\nIntriguingly, Kuper revealed that she had never published the play because a few Indian couples confronted her after a performance of the play in Durban (by Indian medical students) to inform her they would sue her for writing about their families. Though she did not know these families Hilda\n\n“realized that I had struck a very vulnerable center and Indians were already scapegoated for much of the antagonisms so sadly I put the manuscript aside” but she was revising it for publication in the months before her death (Schmidt 1993, 1, n.5). Schmidt, Nancy J. 1993. “Introduction.” In A Witch in My Heart: Short Stories and Poems, 1–3. Madison: African Studies Program, University of Wisconsin–Madison.\n\nHilda had written about a case very similar to the one she depicted in her play, in her 1960 book, Indian People in Natal (for which Fatima was a research assistant).\n\n“By no means unusual is the case of the girl from an orthodox Hindi speaking family who fell in love with a Tamil boy; on discovering this, her parents married her to a man of their own choice. From the beginning the girl was most unhappy with her in-laws, and after one of her frequent visits home she threatened to commit suicide if forced to return to them.” Hilda Kuper, Indian People in Natal, 1960, p. 136\n\nThe Decision echoes some of the findings from a paper about Indian elites in Natal, co-written by Fatima Meer and Hilda Kuper (1956). They described two primary elite groups: the protest and compromise elites.\n\n“The protest elites, led mainly by intellectuals, identify with Non-Europeans and ‘oppressed people’ in general; the compromise elites operate as a defensive and exclusive minority” (Kuper and Meer 1956, 145). Kuper, Hilda, and Fatima Meer. 1956. “Indian Elites in Natal, South Africa.” In Social Science Conference, University of Natal, Institute for Social Research, 129–45. Durban, Natal, South Africa: University of Natal, Institute for Social Research.\n\nSiva was part of the protest elite, while Savitree’s family represented the compromise elites. Meer and Kuper found that original caste differences between Indian immigrants were fading because of the\n\n“upward mobility of the ex-indentured and the downward pressure from the Europeans, and it appears that the Indian elite of the future will relate more to the Non-Europeans in general than to specific sectional groups.” Kuper and Meer, 1956, p. 145\n\nInterestingly, despite caste distinctions fading, ethnic differences were not, for example between Tamil, Telegu and Hindustani, which are clearly displayed in Hilda’s play since Savitree’s Hindustani family disapproved of Siva because he was Tamil (Kuper 1957; Kuper and Meer 1956, 130).\n\nThis article about Indian elites echoes (thought does not cite) Violaine Junod’s findings from 1952 about protest and compromise leaders among the “coloured” social elite in Britain. Compromise leaders were the intermediaries between white and black groups, serving as non-political token “coloured” spokespeople “on show” in a “zoo situation” within white organizations, which were “sympathetic” to “colonial” issues. Compromise leaders had no direct ties to either colonial nationalist governments or to policy makers and were seen as “acting white” (Banton 1960:151-153). In contrast, protest leaders had close links with colonial nationalist movements, denounced white racism, and held defiant attitudes toward whites supposedly “sympathetic” to the cause. Protest leaders were esteemed by “coloured” community members but disliked by whites (Banton 1960:152).\n\nBanton, Michael. 1960. White and Coloured: The Behavior of British People towards Coloured Immigrants. 2nd ed. New Brunswick, N.J.: Rutgers University Press.\n\nFatima and Hilda’s findings related to Indians and suicide are interconnected.\n\n“From the official figures of ‘self inflicted deaths’ published for Durban, the number of Indians who took their own lives is roughly the same as of Europeans, both being proportionately higher than the number of Africans and Coloureds; but when to these figures is added deaths in the category of ‘accidental burning’ – and burning is the traditional method of committing suicide among Hindus -the Indians outnumber all other racial groups.” Hilda Kuper, 1960, p. 173\n\nThis is one of the tables from Fatima Meer’s 1976 Race and Suicide in South Africa, p. 236. In the earlier period, 1940-60, Indian women had the highest mean suicide rate (16.2) among women and were only second to White males. In the later period, Indian women’s suicide rate increased to 26.4 (yet all groups increased) but this rate was less than that of Coloured women, as well as four other race-gender groups.\n\n\n\nThis table (23b) from Fatima Meer’s 1976 Race and Suicide, emphasizes that the huge majority of Indian women who committed suicide were housewives. This was also true of Coloured women, but the Indian women’s percentage was much higher. Not pictured here is table 23a: of African women who committed suicide, 63.9% were housewives, while 53.7% of white women who committed suicide were housewives. See pages 249-250.\n\nConclusion\n\nFatima Meer and Hilda Kuper collaborated both political and theoretically, through their shared research interests. Hilda supported Fatima unconditionally (both financially and academically) while Fatima conducted foundational fieldwork which informed Hilda’s writing, both academic and creative (through Hilda’s play The Decision). Some of the key themes that they developed were the differences between Black women and Indian women in terms of involvement in South African politics. Fatima investigated the differences in suicide rates by race, gender, class and occupation in South Africa in the mid-20th century. Hilda explored a specific instance of suicide through her fictional play, which was based on the research she had conducted with Fatima. They also shared an interest in different types of elites, protest v. compromise elites, and they investigated how caste differences were becoming less important while ethnic differences were not, as evidenced in Hilda’s play, The Decision.\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License."}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.howold.co/person/hilda-kuper/biography", "page_content": "Hilda Kuper Biography\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and *ociating with the Swaziland's royal family after she was awarded with a grant by the International African Ins*ute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Wi*ersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Ins*ute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With *istance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the har*ment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny. Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947.\n\n. Oxford University Press. 1947. The uniform of colour, a study of white-black relationships in Swaziland . 1947.\n\n. 1947. African systems of kinship and marriage . 1950.\n\n. 1950. The Shona and Ndebele of Southern Rhodesia . 1954.\n\n. 1954. An Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956.\n\n. 1956. An ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959.\n\n. 1959. Indian people in Natal . 1960.\n\n. 1960. The Swazi: a South African kingdom . New York, Holt, Rinehart and Winston. 1963.\n\n. New York, Holt, Rinehart and Winston. 1963. African law: adaptation and development . 1965.\n\n. 1965. Bite of hunger: a novel of Africa . 1965.\n\n. 1965. Urbanization and migration in West Africa . 1965.\n\n. 1965. A witch in my heart: a play set in Swaziland in the 1930s . 1970.\n\n. 1970. Sobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970.\n\n. 1970. South Africa: human rights and genocide. 1981.\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016. Retrieved 26 October 2016.\n\nExternal links"}, {"url": "https://peoplepill.com/people/hilda-kuper/", "page_content": "Hilda Beemer Kuper, née Beemer (23 August 1911 – 1992), was a social anthropologist most notable for her extensive work on Swazi culture.\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nAward Awarding body Year Rivers Memorial Medal Royal Anthropological Institute 1961 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation 1969 Honorary doctorate University of Swaziland 1990\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny.\n\nPublications"}, {"url": "https://abbysgondek.com/portfolio/fatima-meer-and-hilda-kuper-jewish-muslim-collaborations-in-research-on-indian-south-africans/", "page_content": "Dr. Abby Gondek, Morgenthau Scholar-in-Residence, FDR Library, Hyde Park, NY\n\nPhD Global and Socio-cultural Studies, Florida International University\n\nMA African and African Diaspora Studies, FIU\n\nMA Women’s Studies, SDSU\n\nFor the roundtable: The politics of knowledge in jewish women’s activism @ NWSA 2019\n\nNovember 14, 2019 in San Francisco, CA\n\nHilda Kuper with Fatima Meer and Gisele Maquet, in front of Hilda’s home on Warner Ave. in Los Angeles, 1984/5. Kuper family photograph collection, courtesy Mary Kuper. Fatima’s daughter, Shamim, posited that Fatima must have come to visit Hilda during 1985 when Fatima was a Visiting Lecturer at Swarthmore. Gisele Maquet’s husband, Jacques Maquet, was an anthropologist at UCLA (with Hilda).\n\nAbstract\n\nFatima Meer (1928-2010), a feminist sociologist of Indian Muslim (on her paternal side) and Jewish descent (on her maternal grandfather’s side) in South Africa, collaborated with Hilda Kuper (1911-1992), a Jewish anthropologist (born in Rhodesia), producing “The Indian Elites in Natal, South Africa” (1956). Meer conducted fieldwork and influenced Kuper’s Indian People in Natal (1960) as well as Kuper’s play The Decision (1957). One of the themes in Meer’s work was black and Indian women’s experiences of racism and sexism and the use of suicide as a mode of resistance within apartheid South Africa (1976). This presentation explores how Kuper and Meer influenced each other’s writings and anti-apartheid activism.\n\nOrganization\n\nI begin with an explanation of Hilda Kuper & Fatima Meer and then move into their collaboration, focusing on the publications they wrote together or that were thematically connected. In part 3, I detail the timeline of their relationship. In the last section, I describe Hilda’s play The Decision, influenced by her research with Fatima Meer and discuss their overlapping themes such as suicide and different types of elites within the Indian community in South Africa.\n\nPart 1: Intro to Hilda Kuper & Fatima Meer\n\nHilda Kuper was born in 1911 in Bulawayo, Rhodesia, grew up in Johannesburg, South Africa and received her anthropological training with Winifred Hoernlé at the University of Witwatersrand and Bronislaw Malinowski at the London School of Economics. Kuper’s first fieldwork involved studying the impact of liquor laws on black women in Johannesburg. Later her research sites expanded to Swaziland and Indian communities in Durban, Natal, South Africa, where she formed a life-long friendship and research partnership with sociologist, Fatima Meer, who was of South African, Indian, Muslim and Jewish descent. Their collaboration will be the focus of this presentation.\n\nHilda Kuper at her home in Los Angeles, 1974, at a party organized for her students, photograph by Dawn Chatty\n\nThrough Hilda’s marriage to Leo Kuper she became involved in non-violent apartheid protests as one of the founders of the Liberal Party and was forced to leave South Africa; she eventually became a Professor of Anthropology at UCLA.\n\nHilda Kuper (center) with Leo Kuper, her husband (behind), and Max Gluckman, her old friend and anthropology colleague from the University of Witwatersrand in Johannesburg, (at the right) at Watts Towers, Los Angeles. Hilda Kuper Papers, UCLA Special Collections, Box 45, Folder 20. For more information on the connection between Max Gluckman and Hilda Kuper see Andrew Bank, p. 193, n. 17\n\nIn her theorizing about black women, Hilda took a “Swazi point of view,” arguing that Westernization weakened women’s position. She portrayed Swazi women and Indian South African women as the victims of colonization as well as patriarchal indigenous systems.\n\nHilda’s initial interests in law, acting, languages and history, morphed into her career as a legal and political anthropologist, novelist and playwright. Durkheim and French sociology were also highly influential, as both Hilda and her research collaborator, Fatima Meer, wrote about suicide and women of color in Southern Africa.\n\nHilda’s graduate student at UCLA, David Kuby, said the following of her Jewish identity:\n\n“Jewish, British and African are quite a combination of values not easily put into one neat box and there was a comfortable, very human dimension of Hilda that was humble and nonjudgmental that made one feel very accepted in our imperfections despite Hilda’s high standards for scholarship and social justice work.” -David Kuby, December 29, 2016, e-mail correspondence\n\nThe information in this section comes from a brief bio I wrote of Hilda, based on my dissertation. You can find the full bio I wrote here on my academia.edu page and the excerpt from it was published at Bustle.com.\n\nFatima Meer and Nelson Mandela at her home in 1995, image by Richard Shorey\n\n“Meer’s Gujrati grandfather, Ismail, had arrived in South Africa as a trader from Surat on the east coast of India in the 1880s. Her father, Moosa Meer, was the editor of Indian Views, a weekly in Urdu and English. Her mother, Ameena, was a white woman [whose father was Jewish] originally called Rachel. The Meer household was a mixture of Muslim Gujarati traditions and liberal political activism; Fatima combined the two.”\n\nWajid, Arjumand. 2010. “Fatima Meer: Academic and Activist.” The Hindu, March 30, 2010.\n\n“At a time when most Indian girls were helping their mothers in the kitchen making samosas, this young woman was leading protest marches and challenging the most oppressive system in the world.” Winnie Mandela\n\nFrom the Wajid obituary of Fatima Meer, March 30, 2010.\n\nAn article about Fatima’s artwork that was created while she was in the Women’s Gaol in Johannesburg has just come out this October in the New Yorker magazine. I visited the Gaol in March 2017, while in Johannesburg for my dissertation research. You can also learn about Fatima’s art work during her imprisonment here.\n\n“Morning in the Prison Yard” by Fatima Meer, a photograph I took of her painting, one of many displayed on this mesh-like canvas throughout the women’s gaol. Photo by Abby Gondek, March 26, 2017\n\nPhotograph of myself taking a photo of the display for the wash-house courtyard. This was one of the most traumatic areas in the prison because I learned that female prisoners had to wash all of the clothing, including the male prisoners’ pants, which were oftentimes stained with blood (likely from being raped or lashed). These are images from the Women’s Gaol in downtown Johannesburg, where Fatima Meer was detained (in 1976) and painted scenes from her daily life in the prison. The painting on the left contains the following explanation written by Meer: “The two prisoners in the foreground are carrying our bath water from the kitchen. The other prisoner brings our flask of boiling water. The awaiting trial prisoners line up for breakfast on the left. The ‘convicted’ line up on the right. The three prisoners facing the wall are waiting for sanitary pads. They will get three each for the day.”\n\n“…in 1976, [Fatima Meer] was held for six months, without trial, under the apartheid government’s Terrorism Act. Her crime was an attempt to organize a mass rally with the activist Steve Biko, after police shot at and killed student protesters in the township of Soweto.” Anakwa Dwamena, October 23, 2019, The New Yorker\n\nPart 2: Writing collaboration\n\nHilda collaborated with Fatima Meer on a project about Indian South Africans in Durban, Natal (Kuper and Meer 1956).\n\nThis network visualization developed using nodegoat, a project of Lab1100, displays the connections between the publications of Hilda Kuper and Fatima Meer.\n\nThis network visualization displays the publications written by Hilda Kuper and Fatima Meer. “Indian Elites in Natal” (1956), co-authored by Kuper and Meer, shared a thematic focus on Indian South Africans and protest with Hilda’s book Indian People in Natal (1960), for which Fatima Meer acted as a research assistant. “Indian Elites” also shared an emphasis on Indian ethnic groups, such as Tamil and Hindustani, with Hilda’s play The Decision (1957). All three of these works, contrasted the “African” (meaning black) and Indian South African populations. Note the connection between Violaine Junod’s “Report on a Study of the Coloured ‘Social Elite’ in London” (1952) and Hilda Kuper and Fatima Meer’s “Indian Elites in Natal” (1956). Violaine Junod was close to both Hilda Kuper and Fatima Meer (Junod n.d.). Fatima Meer described the Kupers and Violaine Junod as her “most constant friends” during the Treason Trials in 1956 (Meer 2017, 169).\n\nJunod, Violaine. n.d. “Violaine Junod Letters to Hilda Kuper, Correspondence from 1970s-80s.” Box 52. Folder 7. Los Angeles, CA: Hilda Kuper Papers, Box 52, Folder 7, UCLA Special Collections, Charles E. Young Research Library.\n\nMeer, Fatima. 2017. Fatima Meer: Memories of Love and Struggle. Edited by Shamim Meer. Cape Town: Kwela Books.\n\nPart 3: Hilda and Fatima’s relationship\n\nHilda met Fatima Meer in 1952 when Hilda moved to Durban, where her husband Leo Kuper, received a Sociology chair position at the University of Natal. It was Leo, the new head of the department, who allowed Fatima to rewrite her sociology honors exam (after she had been failed by a racist Afrikaner Nationalist lecturer); she passed with “flying colours” (Meer 2017, 150-151).\n\nFatima was Hilda’s research assistant for Kuper’s book Indian People in Natal (Kuper 1960, x). The Institute of Community and Family Health in the Newlands neighborhood in Durban funded this research (Meer 2017, 155). Fatima’s fieldwork notebooks in the Hilda Kuper Papers, elaborate the effect of Indian immigration to South Africa upon caste affiliation, marriage traditions, legally required medical care, and labor strikes. Meer also tracked and summarized the ship logs by sex, age, caste, religion, village, and marriage status (Kuper et al. 1953). In her autobiography, Fatima refers to “filling in dozens of these reporter’s notebooks” but unfortunately, she was dismissed after only a year from this position at the Institute of Community and Family Health because of her anti-apartheid activism and radicalism; Hilda and Fatima were both shocked (2017, 158). Hilda clearly used Fatima’s notes in Indian People in Natal in Chapter 1 regarding migration and Chapter 2 on changes in caste affiliation post-migration.\n\nKuper, Hilda, Fatima Meer, R. Singh. 1953. “Hilda Kuper Papers, Box 14 (Fatima Meer and R. Singh Fieldnotes).” Los Angeles: UCLA Special Collections.\n\nHilda Kuper’s transnational migrations & fieldwork, a geographical visualization, developed using nodegoat, a project of Lab1100\n\nHilda conducted fieldwork in Durban in three Indian suburbs from 1953-1957 with funding from the Council for Social and Industrial Research. She worked with Indian health educators who were trained by the Institute of Community and Family Health including four women Miss N. Perumal, Mrs. Padmini Govindoo, Sally Naidoo and Violet Padayachee. In addition to Fatima Meer, Mrs. Radhi Singh assisted Hilda (Bank 2016, 218-221; Kuper 1960, x).\n\nBank, Andrew. 2016. Pioneers of the Field: South Africa’s Women Anthropologists. London, England: Cambridge University Press, International African Institute.\n\nThe Kuper home was a central site for anti-apartheid solidarity across racial lines. On November 9, 1952, Leo collaborated with the joint ANC-Indian Congress political rally at Red Square in Durban; he wrote about his experiences in Passive Resistance in South Africa (1955). Leo was arrested in 1956 with Alan Paton and four Indian Congress members for their participation in the “assembly of the Native” in the Gandhi Library Hall in Durban; this is where they launched a defense fund for the 156 Treason Trialists. Hilda was arrested earlier in 1956 with Fatima Meer at a women’s march protesting new laws that extended the pass system to “non-European” women (Bank 2016, 217–18). Also in 1956, the Kupers “solicited a loan” and “stood guarantor” for Fatima and her husband Ismail Meer, so that they could get the capital to build their house, since non-whites could not get loans at that time (Meer 2017, 163).\n\nHilda was “combative with non-progressive colleagues” and was excluded from a departmental research trip to Swaziland, despite her expertise (Russell 1994, 146). By the late 1950s, the apartheid police increasingly harassed Leo and Hilda, spies attended their lectures, and Leo was threatened with a banning order; eventually Hilda instigated their departure from South Africa (Golomski 2011, 4; Moran 1988, 198).\n\nRussell, Margo. 1994. “OBITUARY: Hilda Kuper, 1911-92.” Africa 64 (1): 145–49.\n\nGolomski, Casey. 2011. “Hilda Kuper, Anthropology, History.” In University of Swaziland, UNISWA, History Staff Seminar Series, 21. University of Swaziland, Department of Theology and Religious Studies.\n\nMoran, Katy. 1988. “Hilda Beemer Kuper (1911- ).” In Women Anthropologists: Selected Biographies, edited by Ute Gacs, Aisha Khan, Jerrie McIntyre, and Ruth Weinberg, 194–201. Urbana: University of Illinois Press.\n\nIn 1970, Hilda wrote to Fatima from Los Angeles to express that she was “so delighted” with Fatima’s book (Portrait of Indian South Africans, 1969) that she and Leo felt Fatima should submit it for a Ph.D.\n\n“The photographs are fascinating and the text is rich in perception.” Kuper, Hilda. 1970. “Hilda Kuper to Fatima Meer and Ismail Meer, March 20, 1970.” Los Angeles, CA: Hilda Kuper Papers, Box 41, Folder 9, UCLA Special Collections, Charles E. Young Research Library.\n\nIn closing, Hilda wrote, “There is so much to talk about that cannot be expressed in letters. We think of you very often and send you much, much love” (Kuper 1970). In her autobiography, Fatima wrote that Hilda Kuper “considered the manuscript so good that she canvassed the head of department to award me a doctorate for it” (Meer 2017, 186).\n\nIn this letter from Hilda to Fatima, Hilda explains that she is about to visit her daughter Mary in Israel, before going to Swaziland (in 1970 Hilda became a Swazi citizen). Hilda complements Fatima on her new book and expresses how much both she and Leo think of Fatima and send much love. Hilda Kuper Papers, Box 41, Folder 9.\n\nPart 4: The Decision\n\nThe Decision (1957) is a tragic play written by Hilda Kuper in which the female lead character is punished through death, for the patriarchal and racist hierarchical structure of her society. In this play, Savitree, a girl from a high caste Hindi speaking family in Durban, in Natal province, South Africa, fell in love with a Tamil Christian boy, Siva, whose family was from Southern India.\n\nThe cover page for the program of Hilda’s 1957 version of The Decision, performed in Durban by medical students at the University of Natal. Sondra Hale personal collection of Hilda Kuper’s creative writing at UCLA, Anthropology Department.\n\nTheir different ethnicities and religions, as well as the fact that Siva was active in the Indian National Congress and the passive resistance movement, marked Siva as “other” and unmarriageable (61). One version of the story closed when Savitree set fire to herself and died because her family forbade her to be with Siva (Kuper 1993, 63).\n\nKuper, Hilda. 1993. A Witch in My Heart: Short Stories and Poems. Edited by Nancy Schmidt. Madison: African Studies Program, University of Wisconsin–Madison. https://books.google.com/books?id=bh5aAAAAMAAJ&pgis=1.\n\nIn a different version of the play, Savitree sacrificed herself by marrying the man her family decided she should marry (Kuper 1957, 30–31).\n\nKuper, Hilda. 1957. “The Decision: A Contemporary South African Indian Play.” Durban Medical Students Drama Group. Los Angeles, CA: Sondra Hale Personal Collection, UCLA Anthropology Department, Haines Hall 391.\n\nDirectly before Siva heard the news of Savitree’s suicide (in the 1993 version) he told his activist friends that Indian South African families imprison their daughters in domestic roles, preventing their freedom. Siva’s friend Rajid Naidoo argued:\n\n“African women are a major force in African politics, but few Indian women are active in political affairs.” Hilda Kuper, 1993\n\nThis implied that the problem was within Indian culture, rather than South African culture as a whole. Siva’s friend Chetty remarked that the women should “free themselves” rather than waiting for men to do so, upon which Siva discovered that Savitree killed herself, causing the reader to wonder if this was Savitree’s way of “freeing herself” (Kuper 1993, 63).\n\nIn the 1957 version of the play, Siva’s words close the play:\n\n“all I wanted is to be myself and let others be themselves.” Hilda Kuper, 1957\n\nHe contended that Savitree should not have had to sacrifice herself for her family out of the “strength of her affection for others, for those who had brought her up.” Siva emphasized that her loyalty should not lie with her family alone but with the “family of the people of the world” (31).\n\nPerhaps, this was Kuper’s message for unity rather than separation between not only Indian South Africans, but also all South Africans.\n\nIntriguingly, Kuper revealed that she had never published the play because a few Indian couples confronted her after a performance of the play in Durban (by Indian medical students) to inform her they would sue her for writing about their families. Though she did not know these families Hilda\n\n“realized that I had struck a very vulnerable center and Indians were already scapegoated for much of the antagonisms so sadly I put the manuscript aside” but she was revising it for publication in the months before her death (Schmidt 1993, 1, n.5). Schmidt, Nancy J. 1993. “Introduction.” In A Witch in My Heart: Short Stories and Poems, 1–3. Madison: African Studies Program, University of Wisconsin–Madison.\n\nHilda had written about a case very similar to the one she depicted in her play, in her 1960 book, Indian People in Natal (for which Fatima was a research assistant).\n\n“By no means unusual is the case of the girl from an orthodox Hindi speaking family who fell in love with a Tamil boy; on discovering this, her parents married her to a man of their own choice. From the beginning the girl was most unhappy with her in-laws, and after one of her frequent visits home she threatened to commit suicide if forced to return to them.” Hilda Kuper, Indian People in Natal, 1960, p. 136\n\nThe Decision echoes some of the findings from a paper about Indian elites in Natal, co-written by Fatima Meer and Hilda Kuper (1956). They described two primary elite groups: the protest and compromise elites.\n\n“The protest elites, led mainly by intellectuals, identify with Non-Europeans and ‘oppressed people’ in general; the compromise elites operate as a defensive and exclusive minority” (Kuper and Meer 1956, 145). Kuper, Hilda, and Fatima Meer. 1956. “Indian Elites in Natal, South Africa.” In Social Science Conference, University of Natal, Institute for Social Research, 129–45. Durban, Natal, South Africa: University of Natal, Institute for Social Research.\n\nSiva was part of the protest elite, while Savitree’s family represented the compromise elites. Meer and Kuper found that original caste differences between Indian immigrants were fading because of the\n\n“upward mobility of the ex-indentured and the downward pressure from the Europeans, and it appears that the Indian elite of the future will relate more to the Non-Europeans in general than to specific sectional groups.” Kuper and Meer, 1956, p. 145\n\nInterestingly, despite caste distinctions fading, ethnic differences were not, for example between Tamil, Telegu and Hindustani, which are clearly displayed in Hilda’s play since Savitree’s Hindustani family disapproved of Siva because he was Tamil (Kuper 1957; Kuper and Meer 1956, 130).\n\nThis article about Indian elites echoes (thought does not cite) Violaine Junod’s findings from 1952 about protest and compromise leaders among the “coloured” social elite in Britain. Compromise leaders were the intermediaries between white and black groups, serving as non-political token “coloured” spokespeople “on show” in a “zoo situation” within white organizations, which were “sympathetic” to “colonial” issues. Compromise leaders had no direct ties to either colonial nationalist governments or to policy makers and were seen as “acting white” (Banton 1960:151-153). In contrast, protest leaders had close links with colonial nationalist movements, denounced white racism, and held defiant attitudes toward whites supposedly “sympathetic” to the cause. Protest leaders were esteemed by “coloured” community members but disliked by whites (Banton 1960:152).\n\nBanton, Michael. 1960. White and Coloured: The Behavior of British People towards Coloured Immigrants. 2nd ed. New Brunswick, N.J.: Rutgers University Press.\n\nFatima and Hilda’s findings related to Indians and suicide are interconnected.\n\n“From the official figures of ‘self inflicted deaths’ published for Durban, the number of Indians who took their own lives is roughly the same as of Europeans, both being proportionately higher than the number of Africans and Coloureds; but when to these figures is added deaths in the category of ‘accidental burning’ – and burning is the traditional method of committing suicide among Hindus -the Indians outnumber all other racial groups.” Hilda Kuper, 1960, p. 173\n\nThis is one of the tables from Fatima Meer’s 1976 Race and Suicide in South Africa, p. 236. In the earlier period, 1940-60, Indian women had the highest mean suicide rate (16.2) among women and were only second to White males. In the later period, Indian women’s suicide rate increased to 26.4 (yet all groups increased) but this rate was less than that of Coloured women, as well as four other race-gender groups.\n\n\n\nThis table (23b) from Fatima Meer’s 1976 Race and Suicide, emphasizes that the huge majority of Indian women who committed suicide were housewives. This was also true of Coloured women, but the Indian women’s percentage was much higher. Not pictured here is table 23a: of African women who committed suicide, 63.9% were housewives, while 53.7% of white women who committed suicide were housewives. See pages 249-250.\n\nConclusion\n\nFatima Meer and Hilda Kuper collaborated both political and theoretically, through their shared research interests. Hilda supported Fatima unconditionally (both financially and academically) while Fatima conducted foundational fieldwork which informed Hilda’s writing, both academic and creative (through Hilda’s play The Decision). Some of the key themes that they developed were the differences between Black women and Indian women in terms of involvement in South African politics. Fatima investigated the differences in suicide rates by race, gender, class and occupation in South Africa in the mid-20th century. Hilda explored a specific instance of suicide through her fictional play, which was based on the research she had conducted with Fatima. They also shared an interest in different types of elites, protest v. compromise elites, and they investigated how caste differences were becoming less important while ethnic differences were not, as evidenced in Hilda’s play, The Decision.\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License."}]}