{"Hilda Kuper was born in Johannesburg, South Africa.": [{"url": "https://yourstory.com/herstory/2022/08/from-kittur-rani-chennamma-to-hilda-kuper-these-women-shaped-history", "page_content": "In every field throughout history, women have made immense contributions. However, their roles have rarely been highlighted. Often due to sexism, or bias towards male perspectives the contributions of women have been given a raw deal. Women that we should have been reading about in our history textbooks were pushed into oblivion. There are even instances of men taking credit for women’s work. From ancient times to recent history, many contributions of women have been discounted and even neglected by the patriarchal society.\n\n\n\n\n\nLet us look at a few women in history who have changed the world in more ways than one:\n\n\n\n\n\nDra. Paulina Luisi:\n\n\n\n\n\nBorn to Argentinian parents, Dra. Paulina Luisi was the first woman in Uruguay to earn the equivalent of a bachelor’s degree. As the first female medical student, she had to face a lot of harassment from her own classmates. Paulina founded the Uruguayan branch of the National Women’s Council in 1916. Uruguay became the second Latin American country to grant full voting rights for women. Luisi, who was in Europe at that time, came back to Uruguay to fight elections. By the 1940s, she was the most important female voice of the Socialist party. She spoke in favour of women’s rights- legal and political.\n\n\n\n\n\nHilda Kuper:\n\n\n\n\n\nBorn in Bulawaya, Rhodesia, and growing up in Johannesburg, South Africa, Kuper’s fieldwork was on the impact of liquor laws on Black women in Johannesburg. Her research expanded to Swaziland and Indian communities in Durban. Her marriage with Leo Kuper and subsequent involvement in non-violent apartheid protests changed the course of her life. She became one of the founders of the Liberal Party which resulted in her being shunted out of South Africa. She worked as a Professor of Anthropology at UCLA. Based on her research, she theorised that Westernization weakened Swazi and Indian South African women.\n\n\n\n\n\nKittur Rani Chennamma:\n\n\n\n\n\nThe Indian Queen of Kittur became a symbol of the independence movement in India because of her rebellion against the British forces. She married Raja Mallasaraja at the age of 15. Chennamma's husband died in 1824 leaving behind a son and an unstable kingdom. Her son also passed the same year, which is when she adopted Shivalingappa as an heir to the throne.\n\n\n\n\n\nAccording to the Doctrine of Lapse, if the ruler of a state dies childless, then the right to rule goes to the State. Chennamma sent a letter to the British pleading her case, but it was turned down. War broke out. Both the forces lost a lot of men, and during the second attack, Chennamma was captured by the British and sent to prison for life. She died on February 2, 1829.\n\n\n\n\n\nBegum Royeka :\n\nShe was a Bengali feminist thinker and political activist from British India (present day Bangladesh). She is considered as a pioneer of women’s liberation in South Asia. She believed that the lack of education for women was the reason for their poor economic standing. Royeka established the first school aimed at Muslim girls in Kolkata. In 1916, she founded the Muslim Women’s Assocation.\n\n\n\n\n\nShe was deeply involved in debates, conferences and speeches regarding the rights of women. BBC ranked Royeka number 6 in BBC’s poll of the ‘Greatest Bengali of all time.’ She wrote a number of poems, essays, novels, short stories, etc., in which she urged women to fight against atrocities and break the cycle of discrimination.\n\n\n\n\n\nJeannette Rankin:\n\nShe was an American women’s rights advocate and politician, and the first woman to hold federal office in the United States. In 1941, she was the only member of Congress who voted against the declaration of war on Japan after the Pearl Harbor incident. She introduced legislation which eventually became the 19th Constitutional Amendment which granted unrestricted voting rights to women in the US. Rankin strongly believed that the corruption prevalent in the United States government during her time was because of the lack of women’s participation.\n\n\n\n\n\nThese women deserve to be better known, and more importantly, deserve to occupy the annals of history with more prominence. Their contributions have been unfairly neglected and downplayed for a long time. Let these stories inspire you to fight for future generations of women. You can counteract the overshadowing of these important women by reading about them and discussing them with your peers."}, {"url": "https://oac.cdlib.org/view?docId=hb5g50061q;doc.view=content&chunk.id=div00059&toc.depth=1&brand=oac4&anchor.id=0", "page_content": "Hilda Kuper, Anthropology: Los Angeles\n\n1911-1992 Professor Emerita\n\nHilda Beemer was born in Bulawayo, Zimbabwe (then Rhodesia), into a family of Viennese Jewish immigrants. She grew up in Johannesburg and went to Witwatersrand University for her undergraduate studies. She received there the B.A. degree in anthropology. In 1932, she came to London, where she studied under the charismatic teacher Bronislaw Malinowski at the London School of Economics, where she obtained the M.A. and Ph.D. degrees in social anthropology.\n\nIn 1934, she was awarded a grant by the International African Institute of London to study the Swazi. So began her lifelong association with Swaziland and its royal family. Her first books were on the Swazi, An African Aristocracy and The Uniform of Colour, both published in 1947. Her last was a revised edition of The Swazi: A South African Kingdom; published in 1986, it brings the Swazi history up to 1983.\n\nFor almost six decades, she was committed to the study, defense, and illustration of the Swazi traditions as embodied in the social and political vision of King Sobhuza II, a friend from the thirties to the eighties--he died in 1982. In 1970, three years after Swaziland became an independent state, Sobhuza granted her Swazi citizenship. Later he appointed her his official biographer. She wrote the authoritative history of his reign--in fact the history of Swaziland in the twentieth century, as Sobhuza was born in 1899. The book, Sobhuza II, Ngwenyama and King of Swaziland, was published in 1978.\n\nIn 1936, Hilda married Leo Kuper, a South African lawyer who later trained for a Ph.D. in sociology (eventually he became head of the sociology department at the University of Natal and then professor of sociology at UCLA). With him, Hilda was active in political movements;\n\n― 155 ―\n\nthe Kupers were among the founding members of the Liberal Party. Convinced that social reform could be achieved through knowledge, she studied the Indian community of Durban (, 1960). During that period she also published two detailed ethnographies,, 1952, and, 1955, faithfully conforming to the famous outline of the Ethnographic Survey of Africa.\n\nHilda Kuper's main career was academic. While in South Africa, she taught at the Universities of Witwatersrand and Natal, and held visiting positions at the Universities of Birmingham and North Carolina. In 1961, harassment of opposition intellectuals having increased in South Africa, the Kupers left the country and settled in the United States.\n\nIn 1963, Hilda Kuper joined the Department of Anthropology at UCLA, where she was an influential and inspirational teacher. Until her retirement in 1977, she offered a variety of courses and seminars on the traditional societies of Africa, and on specialized topics such as British social anthropology, biography in anthropology, and fiction as a means of understanding the thought and affectivity of another culture. Her two works of fiction, a novel, The Bite of Hunger, 1965, and a play, A Witch in my Heart, 1970, are brilliant examples of intuitive communication of deep meanings that complement the knowledge of another culture gained by discursive scholarship. Because of her clear, warm, and convincing teaching style, she was recalled in 1989 to create a new course, Destruction and Survival of Indigenous Societies.\n\nHilda Kuper was awarded the Rivers Memorial Medal for field work by the Royal Anthropological Institute in 1961 and an honorary doctorate of letters by the University of Swaziland in 1990.\n\nHilda Kuper's contributions to anthropology are considerable in substance and interpretation. In substance, she has enriched the body of ethnographic knowledge--still the foundation of anthropology--by her thorough and meticulous descriptions of the Swazi and Shona cultures. In interpretation, she has demonstrated that strict reasoning and sharp argumentation do not preclude insight and empathy, that a generous and fearless advocacy is compatible with an honest and complete presentation of all the facts, and that an appreciation of ancient traditions does not divert from urgent contemporary issues.\n\nHilda Kuper was survived by her husband, Leo, who died in 1994, and two daughters, Jenny and Marry, and three grandchildren.\n\nWolf Leslau Jacques Maquet Charles Nixon"}, {"url": "https://abbysgondek.com/portfolio/fatima-meer-and-hilda-kuper-jewish-muslim-collaborations-in-research-on-indian-south-africans/", "page_content": "Dr. Abby Gondek, Morgenthau Scholar-in-Residence, FDR Library, Hyde Park, NY\n\nPhD Global and Socio-cultural Studies, Florida International University\n\nMA African and African Diaspora Studies, FIU\n\nMA Women’s Studies, SDSU\n\nFor the roundtable: The politics of knowledge in jewish women’s activism @ NWSA 2019\n\nNovember 14, 2019 in San Francisco, CA\n\nHilda Kuper with Fatima Meer and Gisele Maquet, in front of Hilda’s home on Warner Ave. in Los Angeles, 1984/5. Kuper family photograph collection, courtesy Mary Kuper. Fatima’s daughter, Shamim, posited that Fatima must have come to visit Hilda during 1985 when Fatima was a Visiting Lecturer at Swarthmore. Gisele Maquet’s husband, Jacques Maquet, was an anthropologist at UCLA (with Hilda).\n\nAbstract\n\nFatima Meer (1928-2010), a feminist sociologist of Indian Muslim (on her paternal side) and Jewish descent (on her maternal grandfather’s side) in South Africa, collaborated with Hilda Kuper (1911-1992), a Jewish anthropologist (born in Rhodesia), producing “The Indian Elites in Natal, South Africa” (1956). Meer conducted fieldwork and influenced Kuper’s Indian People in Natal (1960) as well as Kuper’s play The Decision (1957). One of the themes in Meer’s work was black and Indian women’s experiences of racism and sexism and the use of suicide as a mode of resistance within apartheid South Africa (1976). This presentation explores how Kuper and Meer influenced each other’s writings and anti-apartheid activism.\n\nOrganization\n\nI begin with an explanation of Hilda Kuper & Fatima Meer and then move into their collaboration, focusing on the publications they wrote together or that were thematically connected. In part 3, I detail the timeline of their relationship. In the last section, I describe Hilda’s play The Decision, influenced by her research with Fatima Meer and discuss their overlapping themes such as suicide and different types of elites within the Indian community in South Africa.\n\nPart 1: Intro to Hilda Kuper & Fatima Meer\n\nHilda Kuper was born in 1911 in Bulawayo, Rhodesia, grew up in Johannesburg, South Africa and received her anthropological training with Winifred Hoernlé at the University of Witwatersrand and Bronislaw Malinowski at the London School of Economics. Kuper’s first fieldwork involved studying the impact of liquor laws on black women in Johannesburg. Later her research sites expanded to Swaziland and Indian communities in Durban, Natal, South Africa, where she formed a life-long friendship and research partnership with sociologist, Fatima Meer, who was of South African, Indian, Muslim and Jewish descent. Their collaboration will be the focus of this presentation.\n\nHilda Kuper at her home in Los Angeles, 1974, at a party organized for her students, photograph by Dawn Chatty\n\nThrough Hilda’s marriage to Leo Kuper she became involved in non-violent apartheid protests as one of the founders of the Liberal Party and was forced to leave South Africa; she eventually became a Professor of Anthropology at UCLA.\n\nHilda Kuper (center) with Leo Kuper, her husband (behind), and Max Gluckman, her old friend and anthropology colleague from the University of Witwatersrand in Johannesburg, (at the right) at Watts Towers, Los Angeles. Hilda Kuper Papers, UCLA Special Collections, Box 45, Folder 20. For more information on the connection between Max Gluckman and Hilda Kuper see Andrew Bank, p. 193, n. 17\n\nIn her theorizing about black women, Hilda took a “Swazi point of view,” arguing that Westernization weakened women’s position. She portrayed Swazi women and Indian South African women as the victims of colonization as well as patriarchal indigenous systems.\n\nHilda’s initial interests in law, acting, languages and history, morphed into her career as a legal and political anthropologist, novelist and playwright. Durkheim and French sociology were also highly influential, as both Hilda and her research collaborator, Fatima Meer, wrote about suicide and women of color in Southern Africa.\n\nHilda’s graduate student at UCLA, David Kuby, said the following of her Jewish identity:\n\n“Jewish, British and African are quite a combination of values not easily put into one neat box and there was a comfortable, very human dimension of Hilda that was humble and nonjudgmental that made one feel very accepted in our imperfections despite Hilda’s high standards for scholarship and social justice work.” -David Kuby, December 29, 2016, e-mail correspondence\n\nThe information in this section comes from a brief bio I wrote of Hilda, based on my dissertation. You can find the full bio I wrote here on my academia.edu page and the excerpt from it was published at Bustle.com.\n\nFatima Meer and Nelson Mandela at her home in 1995, image by Richard Shorey\n\n“Meer’s Gujrati grandfather, Ismail, had arrived in South Africa as a trader from Surat on the east coast of India in the 1880s. Her father, Moosa Meer, was the editor of Indian Views, a weekly in Urdu and English. Her mother, Ameena, was a white woman [whose father was Jewish] originally called Rachel. The Meer household was a mixture of Muslim Gujarati traditions and liberal political activism; Fatima combined the two.”\n\nWajid, Arjumand. 2010. “Fatima Meer: Academic and Activist.” The Hindu, March 30, 2010.\n\n“At a time when most Indian girls were helping their mothers in the kitchen making samosas, this young woman was leading protest marches and challenging the most oppressive system in the world.” Winnie Mandela\n\nFrom the Wajid obituary of Fatima Meer, March 30, 2010.\n\nAn article about Fatima’s artwork that was created while she was in the Women’s Gaol in Johannesburg has just come out this October in the New Yorker magazine. I visited the Gaol in March 2017, while in Johannesburg for my dissertation research. You can also learn about Fatima’s art work during her imprisonment here.\n\n“Morning in the Prison Yard” by Fatima Meer, a photograph I took of her painting, one of many displayed on this mesh-like canvas throughout the women’s gaol. Photo by Abby Gondek, March 26, 2017\n\nPhotograph of myself taking a photo of the display for the wash-house courtyard. This was one of the most traumatic areas in the prison because I learned that female prisoners had to wash all of the clothing, including the male prisoners’ pants, which were oftentimes stained with blood (likely from being raped or lashed). These are images from the Women’s Gaol in downtown Johannesburg, where Fatima Meer was detained (in 1976) and painted scenes from her daily life in the prison. The painting on the left contains the following explanation written by Meer: “The two prisoners in the foreground are carrying our bath water from the kitchen. The other prisoner brings our flask of boiling water. The awaiting trial prisoners line up for breakfast on the left. The ‘convicted’ line up on the right. The three prisoners facing the wall are waiting for sanitary pads. They will get three each for the day.”\n\n“…in 1976, [Fatima Meer] was held for six months, without trial, under the apartheid government’s Terrorism Act. Her crime was an attempt to organize a mass rally with the activist Steve Biko, after police shot at and killed student protesters in the township of Soweto.” Anakwa Dwamena, October 23, 2019, The New Yorker\n\nPart 2: Writing collaboration\n\nHilda collaborated with Fatima Meer on a project about Indian South Africans in Durban, Natal (Kuper and Meer 1956).\n\nThis network visualization developed using nodegoat, a project of Lab1100, displays the connections between the publications of Hilda Kuper and Fatima Meer.\n\nThis network visualization displays the publications written by Hilda Kuper and Fatima Meer. “Indian Elites in Natal” (1956), co-authored by Kuper and Meer, shared a thematic focus on Indian South Africans and protest with Hilda’s book Indian People in Natal (1960), for which Fatima Meer acted as a research assistant. “Indian Elites” also shared an emphasis on Indian ethnic groups, such as Tamil and Hindustani, with Hilda’s play The Decision (1957). All three of these works, contrasted the “African” (meaning black) and Indian South African populations. Note the connection between Violaine Junod’s “Report on a Study of the Coloured ‘Social Elite’ in London” (1952) and Hilda Kuper and Fatima Meer’s “Indian Elites in Natal” (1956). Violaine Junod was close to both Hilda Kuper and Fatima Meer (Junod n.d.). Fatima Meer described the Kupers and Violaine Junod as her “most constant friends” during the Treason Trials in 1956 (Meer 2017, 169).\n\nJunod, Violaine. n.d. “Violaine Junod Letters to Hilda Kuper, Correspondence from 1970s-80s.” Box 52. Folder 7. Los Angeles, CA: Hilda Kuper Papers, Box 52, Folder 7, UCLA Special Collections, Charles E. Young Research Library.\n\nMeer, Fatima. 2017. Fatima Meer: Memories of Love and Struggle. Edited by Shamim Meer. Cape Town: Kwela Books.\n\nPart 3: Hilda and Fatima’s relationship\n\nHilda met Fatima Meer in 1952 when Hilda moved to Durban, where her husband Leo Kuper, received a Sociology chair position at the University of Natal. It was Leo, the new head of the department, who allowed Fatima to rewrite her sociology honors exam (after she had been failed by a racist Afrikaner Nationalist lecturer); she passed with “flying colours” (Meer 2017, 150-151).\n\nFatima was Hilda’s research assistant for Kuper’s book Indian People in Natal (Kuper 1960, x). The Institute of Community and Family Health in the Newlands neighborhood in Durban funded this research (Meer 2017, 155). Fatima’s fieldwork notebooks in the Hilda Kuper Papers, elaborate the effect of Indian immigration to South Africa upon caste affiliation, marriage traditions, legally required medical care, and labor strikes. Meer also tracked and summarized the ship logs by sex, age, caste, religion, village, and marriage status (Kuper et al. 1953). In her autobiography, Fatima refers to “filling in dozens of these reporter’s notebooks” but unfortunately, she was dismissed after only a year from this position at the Institute of Community and Family Health because of her anti-apartheid activism and radicalism; Hilda and Fatima were both shocked (2017, 158). Hilda clearly used Fatima’s notes in Indian People in Natal in Chapter 1 regarding migration and Chapter 2 on changes in caste affiliation post-migration.\n\nKuper, Hilda, Fatima Meer, R. Singh. 1953. “Hilda Kuper Papers, Box 14 (Fatima Meer and R. Singh Fieldnotes).” Los Angeles: UCLA Special Collections.\n\nHilda Kuper’s transnational migrations & fieldwork, a geographical visualization, developed using nodegoat, a project of Lab1100\n\nHilda conducted fieldwork in Durban in three Indian suburbs from 1953-1957 with funding from the Council for Social and Industrial Research. She worked with Indian health educators who were trained by the Institute of Community and Family Health including four women Miss N. Perumal, Mrs. Padmini Govindoo, Sally Naidoo and Violet Padayachee. In addition to Fatima Meer, Mrs. Radhi Singh assisted Hilda (Bank 2016, 218-221; Kuper 1960, x).\n\nBank, Andrew. 2016. Pioneers of the Field: South Africa’s Women Anthropologists. London, England: Cambridge University Press, International African Institute.\n\nThe Kuper home was a central site for anti-apartheid solidarity across racial lines. On November 9, 1952, Leo collaborated with the joint ANC-Indian Congress political rally at Red Square in Durban; he wrote about his experiences in Passive Resistance in South Africa (1955). Leo was arrested in 1956 with Alan Paton and four Indian Congress members for their participation in the “assembly of the Native” in the Gandhi Library Hall in Durban; this is where they launched a defense fund for the 156 Treason Trialists. Hilda was arrested earlier in 1956 with Fatima Meer at a women’s march protesting new laws that extended the pass system to “non-European” women (Bank 2016, 217–18). Also in 1956, the Kupers “solicited a loan” and “stood guarantor” for Fatima and her husband Ismail Meer, so that they could get the capital to build their house, since non-whites could not get loans at that time (Meer 2017, 163).\n\nHilda was “combative with non-progressive colleagues” and was excluded from a departmental research trip to Swaziland, despite her expertise (Russell 1994, 146). By the late 1950s, the apartheid police increasingly harassed Leo and Hilda, spies attended their lectures, and Leo was threatened with a banning order; eventually Hilda instigated their departure from South Africa (Golomski 2011, 4; Moran 1988, 198).\n\nRussell, Margo. 1994. “OBITUARY: Hilda Kuper, 1911-92.” Africa 64 (1): 145–49.\n\nGolomski, Casey. 2011. “Hilda Kuper, Anthropology, History.” In University of Swaziland, UNISWA, History Staff Seminar Series, 21. University of Swaziland, Department of Theology and Religious Studies.\n\nMoran, Katy. 1988. “Hilda Beemer Kuper (1911- ).” In Women Anthropologists: Selected Biographies, edited by Ute Gacs, Aisha Khan, Jerrie McIntyre, and Ruth Weinberg, 194–201. Urbana: University of Illinois Press.\n\nIn 1970, Hilda wrote to Fatima from Los Angeles to express that she was “so delighted” with Fatima’s book (Portrait of Indian South Africans, 1969) that she and Leo felt Fatima should submit it for a Ph.D.\n\n“The photographs are fascinating and the text is rich in perception.” Kuper, Hilda. 1970. “Hilda Kuper to Fatima Meer and Ismail Meer, March 20, 1970.” Los Angeles, CA: Hilda Kuper Papers, Box 41, Folder 9, UCLA Special Collections, Charles E. Young Research Library.\n\nIn closing, Hilda wrote, “There is so much to talk about that cannot be expressed in letters. We think of you very often and send you much, much love” (Kuper 1970). In her autobiography, Fatima wrote that Hilda Kuper “considered the manuscript so good that she canvassed the head of department to award me a doctorate for it” (Meer 2017, 186).\n\nIn this letter from Hilda to Fatima, Hilda explains that she is about to visit her daughter Mary in Israel, before going to Swaziland (in 1970 Hilda became a Swazi citizen). Hilda complements Fatima on her new book and expresses how much both she and Leo think of Fatima and send much love. Hilda Kuper Papers, Box 41, Folder 9.\n\nPart 4: The Decision\n\nThe Decision (1957) is a tragic play written by Hilda Kuper in which the female lead character is punished through death, for the patriarchal and racist hierarchical structure of her society. In this play, Savitree, a girl from a high caste Hindi speaking family in Durban, in Natal province, South Africa, fell in love with a Tamil Christian boy, Siva, whose family was from Southern India.\n\nThe cover page for the program of Hilda’s 1957 version of The Decision, performed in Durban by medical students at the University of Natal. Sondra Hale personal collection of Hilda Kuper’s creative writing at UCLA, Anthropology Department.\n\nTheir different ethnicities and religions, as well as the fact that Siva was active in the Indian National Congress and the passive resistance movement, marked Siva as “other” and unmarriageable (61). One version of the story closed when Savitree set fire to herself and died because her family forbade her to be with Siva (Kuper 1993, 63).\n\nKuper, Hilda. 1993. A Witch in My Heart: Short Stories and Poems. Edited by Nancy Schmidt. Madison: African Studies Program, University of Wisconsin–Madison. https://books.google.com/books?id=bh5aAAAAMAAJ&pgis=1.\n\nIn a different version of the play, Savitree sacrificed herself by marrying the man her family decided she should marry (Kuper 1957, 30–31).\n\nKuper, Hilda. 1957. “The Decision: A Contemporary South African Indian Play.” Durban Medical Students Drama Group. Los Angeles, CA: Sondra Hale Personal Collection, UCLA Anthropology Department, Haines Hall 391.\n\nDirectly before Siva heard the news of Savitree’s suicide (in the 1993 version) he told his activist friends that Indian South African families imprison their daughters in domestic roles, preventing their freedom. Siva’s friend Rajid Naidoo argued:\n\n“African women are a major force in African politics, but few Indian women are active in political affairs.” Hilda Kuper, 1993\n\nThis implied that the problem was within Indian culture, rather than South African culture as a whole. Siva’s friend Chetty remarked that the women should “free themselves” rather than waiting for men to do so, upon which Siva discovered that Savitree killed herself, causing the reader to wonder if this was Savitree’s way of “freeing herself” (Kuper 1993, 63).\n\nIn the 1957 version of the play, Siva’s words close the play:\n\n“all I wanted is to be myself and let others be themselves.” Hilda Kuper, 1957\n\nHe contended that Savitree should not have had to sacrifice herself for her family out of the “strength of her affection for others, for those who had brought her up.” Siva emphasized that her loyalty should not lie with her family alone but with the “family of the people of the world” (31).\n\nPerhaps, this was Kuper’s message for unity rather than separation between not only Indian South Africans, but also all South Africans.\n\nIntriguingly, Kuper revealed that she had never published the play because a few Indian couples confronted her after a performance of the play in Durban (by Indian medical students) to inform her they would sue her for writing about their families. Though she did not know these families Hilda\n\n“realized that I had struck a very vulnerable center and Indians were already scapegoated for much of the antagonisms so sadly I put the manuscript aside” but she was revising it for publication in the months before her death (Schmidt 1993, 1, n.5). Schmidt, Nancy J. 1993. “Introduction.” In A Witch in My Heart: Short Stories and Poems, 1–3. Madison: African Studies Program, University of Wisconsin–Madison.\n\nHilda had written about a case very similar to the one she depicted in her play, in her 1960 book, Indian People in Natal (for which Fatima was a research assistant).\n\n“By no means unusual is the case of the girl from an orthodox Hindi speaking family who fell in love with a Tamil boy; on discovering this, her parents married her to a man of their own choice. From the beginning the girl was most unhappy with her in-laws, and after one of her frequent visits home she threatened to commit suicide if forced to return to them.” Hilda Kuper, Indian People in Natal, 1960, p. 136\n\nThe Decision echoes some of the findings from a paper about Indian elites in Natal, co-written by Fatima Meer and Hilda Kuper (1956). They described two primary elite groups: the protest and compromise elites.\n\n“The protest elites, led mainly by intellectuals, identify with Non-Europeans and ‘oppressed people’ in general; the compromise elites operate as a defensive and exclusive minority” (Kuper and Meer 1956, 145). Kuper, Hilda, and Fatima Meer. 1956. “Indian Elites in Natal, South Africa.” In Social Science Conference, University of Natal, Institute for Social Research, 129–45. Durban, Natal, South Africa: University of Natal, Institute for Social Research.\n\nSiva was part of the protest elite, while Savitree’s family represented the compromise elites. Meer and Kuper found that original caste differences between Indian immigrants were fading because of the\n\n“upward mobility of the ex-indentured and the downward pressure from the Europeans, and it appears that the Indian elite of the future will relate more to the Non-Europeans in general than to specific sectional groups.” Kuper and Meer, 1956, p. 145\n\nInterestingly, despite caste distinctions fading, ethnic differences were not, for example between Tamil, Telegu and Hindustani, which are clearly displayed in Hilda’s play since Savitree’s Hindustani family disapproved of Siva because he was Tamil (Kuper 1957; Kuper and Meer 1956, 130).\n\nThis article about Indian elites echoes (thought does not cite) Violaine Junod’s findings from 1952 about protest and compromise leaders among the “coloured” social elite in Britain. Compromise leaders were the intermediaries between white and black groups, serving as non-political token “coloured” spokespeople “on show” in a “zoo situation” within white organizations, which were “sympathetic” to “colonial” issues. Compromise leaders had no direct ties to either colonial nationalist governments or to policy makers and were seen as “acting white” (Banton 1960:151-153). In contrast, protest leaders had close links with colonial nationalist movements, denounced white racism, and held defiant attitudes toward whites supposedly “sympathetic” to the cause. Protest leaders were esteemed by “coloured” community members but disliked by whites (Banton 1960:152).\n\nBanton, Michael. 1960. White and Coloured: The Behavior of British People towards Coloured Immigrants. 2nd ed. New Brunswick, N.J.: Rutgers University Press.\n\nFatima and Hilda’s findings related to Indians and suicide are interconnected.\n\n“From the official figures of ‘self inflicted deaths’ published for Durban, the number of Indians who took their own lives is roughly the same as of Europeans, both being proportionately higher than the number of Africans and Coloureds; but when to these figures is added deaths in the category of ‘accidental burning’ – and burning is the traditional method of committing suicide among Hindus -the Indians outnumber all other racial groups.” Hilda Kuper, 1960, p. 173\n\nThis is one of the tables from Fatima Meer’s 1976 Race and Suicide in South Africa, p. 236. In the earlier period, 1940-60, Indian women had the highest mean suicide rate (16.2) among women and were only second to White males. In the later period, Indian women’s suicide rate increased to 26.4 (yet all groups increased) but this rate was less than that of Coloured women, as well as four other race-gender groups.\n\n\n\nThis table (23b) from Fatima Meer’s 1976 Race and Suicide, emphasizes that the huge majority of Indian women who committed suicide were housewives. This was also true of Coloured women, but the Indian women’s percentage was much higher. Not pictured here is table 23a: of African women who committed suicide, 63.9% were housewives, while 53.7% of white women who committed suicide were housewives. See pages 249-250.\n\nConclusion\n\nFatima Meer and Hilda Kuper collaborated both political and theoretically, through their shared research interests. Hilda supported Fatima unconditionally (both financially and academically) while Fatima conducted foundational fieldwork which informed Hilda’s writing, both academic and creative (through Hilda’s play The Decision). Some of the key themes that they developed were the differences between Black women and Indian women in terms of involvement in South African politics. Fatima investigated the differences in suicide rates by race, gender, class and occupation in South Africa in the mid-20th century. Hilda explored a specific instance of suicide through her fictional play, which was based on the research she had conducted with Fatima. They also shared an interest in different types of elites, protest v. compromise elites, and they investigated how caste differences were becoming less important while ethnic differences were not, as evidenced in Hilda’s play, The Decision.\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License."}, {"url": "https://www.howold.co/person/hilda-kuper/biography", "page_content": "Hilda Kuper Biography\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and *ociating with the Swaziland's royal family after she was awarded with a grant by the International African Ins*ute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Wi*ersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Ins*ute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With *istance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the har*ment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny. Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947.\n\n. Oxford University Press. 1947. The uniform of colour, a study of white-black relationships in Swaziland . 1947.\n\n. 1947. African systems of kinship and marriage . 1950.\n\n. 1950. The Shona and Ndebele of Southern Rhodesia . 1954.\n\n. 1954. An Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956.\n\n. 1956. An ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959.\n\n. 1959. Indian people in Natal . 1960.\n\n. 1960. The Swazi: a South African kingdom . New York, Holt, Rinehart and Winston. 1963.\n\n. New York, Holt, Rinehart and Winston. 1963. African law: adaptation and development . 1965.\n\n. 1965. Bite of hunger: a novel of Africa . 1965.\n\n. 1965. Urbanization and migration in West Africa . 1965.\n\n. 1965. A witch in my heart: a play set in Swaziland in the 1930s . 1970.\n\n. 1970. Sobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970.\n\n. 1970. South Africa: human rights and genocide. 1981.\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016. Retrieved 26 October 2016.\n\nExternal links"}, {"url": "https://peoplepill.com/people/hilda-kuper/", "page_content": "Hilda Beemer Kuper, née Beemer (23 August 1911 – 1992), was a social anthropologist most notable for her extensive work on Swazi culture.\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nAward Awarding body Year Rivers Memorial Medal Royal Anthropological Institute 1961 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation 1969 Honorary doctorate University of Swaziland 1990\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny.\n\nPublications"}, {"url": "https://oac.cdlib.org/findaid/ark:/13030/tf1b69n737/", "page_content": "Description Hilda Kuper (1911- ) was a professor of Anthropology at UCLA (1963-78) specializing in South Africa, Swaziland, and the Swazi. The collection consists of Dr. Kuper's correspondence, manuscripts, notes, notebooks, photographs, research, and teaching materials.\n\nBackground Hilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), University of Witwatersrand; Ph.D, London School of Economics (1942); Professor of Anthropology, UCLA (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nExtent 35.0 Linear Feet (70 boxes and 8 oversize boxes)\n\nRestrictions Property rights to the physical objects belong to UCLA Library Special Collections. All other rights, including copyright, are retained by the creators and their heirs. It is the responsibility of the researcher to determine who holds the copyright and pursue the copyright owner or his or her heir for permission to publish where The UC Regents do not hold the copyright."}, {"url": "https://snaccooperative.org/view/69001278", "page_content": "Hilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), Univ. of Witwatersrand; Ph. D, London School of Economics (1942); Professor of Anthropology, Univ. of CA, Los Angeles (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nFrom the description of Papers, ca. 1930-1992. (University of California, Los Angeles). WorldCat record id: 41570517\n\nBiography\n\nHilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), University of Witwatersrand; Ph.D, London School of Economics (1942); Professor of Anthropology, UCLA (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nFrom the guide to the Hilda Kuper papers, ca. 1930-1992, (University of California, Los Angeles. Library Special Collections.)"}, {"url": "https://www.sahistory.org.za/people/ellen-phyllis-hellman", "page_content": "Ellen Hellmann was born in Johannesburg, South Africa on August 25, 1908. She was the daughter of Bernard Kaumheimer, who emigrated to South Africa from Bavaria, Germany in 1894, and Chlothilde Theilheimer. Hellman was educated at Barnato Park and at the classical section of the Commercial High School. She then attended the University of the Witwatersrand where, as a student of social anthropology, she came into contact with Agnes Winifred Hoernlé, who encouraged Ellen to do research among urban Africans.\n\nShe was a distinguished social anthropologist and a dedicated worker for education, welfare and race relations. Hellman studied at the University of Witwatersrand in the Department of Social Anthropology and African Administration under its first head of department, Agnes Winifred Hoernlé, who was one of South Africa's major ethnographers and a pioneering student of what was called “race relations”. Hellman’s fellow students included some of the most famous South African anthropologists, notably Max Gluckman, Hilda Kuper, and Eileen and Jack Krige.\n\nIn 1940 Ellen Hellmann became the first woman to obtain a D.Phil. degree at the University of Witwatersrand. Her dissertation, Early school leaving among African school children and the occupational opportunities open to the African juveniles, was published as Problems of Urban Bantu Youth (1940).\n\nHellman is credited with introducing Wulf Sachs, a doctor and psychoanalyst and the author of Black Hamlet, to his informant, John Chavafambira, at the end of 1933. The subtitle explains it as an account of The Mind of An African Negro Revealed by Psychoanalysis. The book was first published in 1937 and republished in 1947 as Black Anger.\n\nEllen Hellman, then a young anthropologist at the University of the Witwatersrand, was in the process of researching an MA thesis on the slum area Rooiyard in New Doornfontein. John Chavafambira was an important informant, performing a vital mediating role between Hellmann and the Rooiyard community. In 1948, at the instigation of Max Gluckman, director of the Rhodes-Livingstone Institute, Hellman's work was finally published as Rooiyard: A Sociological Survey of an Urban Native Slum Yard (reprinted 1969). This pioneering study of the process of proletarianisation and the inter-war conditions of urban African life, bears the strong imprint of “culture contact” theory, an approach which came to exert a dominant influence on South African social anthropology from the mid-1930s onwards.\n\nIn March 1932 she married Joseph Michael Hellmann, an attorney, and they had one daughter. After Joseph Michael Hellmann died in 1941, she married Dr. Bodo Koch in 1948. Her research, into the appalling conditions under which urban black Africans lived, imbued Hellmann with the desire to play a part in alleviating those conditions. She joined the multiracial Joint Council of Europeans and Bantu, serving first as secretary and later as chairperson; but she was to make her greatest contribution as a prominent figure in the South African Institute of Race Relations (SAIRR). As a leading executive member of that organization she brought her highly respected academic skills to the compilation and submission of evidence to various important government commissions. Among these were the Commission for Socio-economic Development of the Native Areas of South Africa (1955), known as the Tomlinson Commission, and the Commission of Inquiry into the Riots at Soweto and Elsewhere, which operated from June 16, 1976 to February 28, 1977, known as the Cillie Commission.\n\nApart from her work at the SAIRR, Hellmann chaired the Isaacson Bursary Fund for Africans that was linked to the SAIRR, and lectured at the Jan Hofmeyr School of Social Work, training Africans students to become social workers. She was also honorary treasurer of the African Welfare centre in Alexandra, a black township on the outskirts of Johannesburg. Her opposition to the apartheid regime led her into active politics and she was a founding member of the liberal Progressive Party, serving on its executive from 1959 to 1971. She also held office in the Witwatersrand branch of the South African Institute for International Affairs and was involved in many Jewish organizations, including the South African Jewish Board of Deputies, the representative body of South African Jewry, of which she was an executive member from 1940 to 1950.\n\nEllen Hellmann was of the firm opinion that South African Jews could not separate the problems that concerned the Jewish community from those concerning all South Africans, regardless of colour or creed. No group could view its own future without an awareness of the tensions and disunity prevailing in South African society at large and Jewish South Africans, she felt, needed to be more aware of the necessity for engagement with the actual conditions prevailing in South Africa.\n\nIn 1970 Sir Arthur Snelling, British Ambassador to South Africa, presented Ellen Hellmann with the Royal African Society’s medal for “dedicated service to Africa”. The presentation ceremony took place in the Johannesburg headquarters of the South African Institute of Race Relations (SAIRR). The venue was most appropriate as Ellen Hellmann had been identified with the work of the SAIRR since its inception on May 9, 1929 and had played a crucial role in realising the Institute’s objective of a just and multi-racial society in South Africa. She headed many of the various committees of the SAIRR and was its president from 1954 to 1965. As chairperson of the important Research Committee, she set high standards for precise research and contributed enormously to the excellent reputation enjoyed by the SAIRR publications and its annual Race Relations Survey, which she edited.\n\nEllen was also a member of the Progressive Party from 1959 to 1971. The University of the Witwatersrand awarded Ellen Hellmann an Honorary Doctorate in Law in 1968.\n\nThese were fitting tributes to a compassionate and vigorous fighter who was committed to the peaceful struggle for a broad-based society of justice and equal opportunity.\n\nEllen Hellmann died in Johannesburg in November 1982 at the age of seventy-four.\n\nSelected Works by Ellen Hellman"}, {"url": "https://kids.kiddle.co/Hilda_Kuper", "page_content": "Hilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992) was a social anthropologist most notable for her extensive work on Swazi culture.\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nAward Awarding body Year Rivers Memorial Medal Royal Anthropological Institute 1961 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation 1969 Honorary doctorate University of Swaziland 1990\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny. Her nephew, Adam Kuper, is also an anthropologist."}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}], "Hilda Kuper obtained a B.A. in English and History from the University of the Witwatersrand in 1929 and a Ph.D. in anthropology from the London School of Economics in 1936.": [{"url": "https://www.wikiwand.com/en/Hilda_Kuper", "page_content": "Hilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992[1]) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and associating with the Swaziland's royal family after she was awarded with a grant by the International African Institute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\nSouth African anthropologist\n\nQuick facts: Hilda Kuper, Born, Died, Nationality, Spouse... ▼\n\n\n\n"}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://snaccooperative.org/view/69001278", "page_content": "Hilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), Univ. of Witwatersrand; Ph. D, London School of Economics (1942); Professor of Anthropology, Univ. of CA, Los Angeles (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nFrom the description of Papers, ca. 1930-1992. (University of California, Los Angeles). WorldCat record id: 41570517\n\nBiography\n\nHilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), University of Witwatersrand; Ph.D, London School of Economics (1942); Professor of Anthropology, UCLA (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nFrom the guide to the Hilda Kuper papers, ca. 1930-1992, (University of California, Los Angeles. Library Special Collections.)"}, {"url": "https://oac.cdlib.org/findaid/ark:/13030/tf1b69n737/", "page_content": "Description Hilda Kuper (1911- ) was a professor of Anthropology at UCLA (1963-78) specializing in South Africa, Swaziland, and the Swazi. The collection consists of Dr. Kuper's correspondence, manuscripts, notes, notebooks, photographs, research, and teaching materials.\n\nBackground Hilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), University of Witwatersrand; Ph.D, London School of Economics (1942); Professor of Anthropology, UCLA (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nExtent 35.0 Linear Feet (70 boxes and 8 oversize boxes)\n\nRestrictions Property rights to the physical objects belong to UCLA Library Special Collections. All other rights, including copyright, are retained by the creators and their heirs. It is the responsibility of the researcher to determine who holds the copyright and pursue the copyright owner or his or her heir for permission to publish where The UC Regents do not hold the copyright."}, {"url": "https://wiki2.org/en/Hilda_Kuper", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992[1]) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and associating with the Swaziland's royal family after she was awarded with a grant by the International African Institute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland.[2][4] In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland.[4] With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa.[4] Here Kuper learned siSwati and pursued her fieldwork.[4] This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban.[4] During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960).[2][4] In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal[2][4]\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA.[2][4] In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA.[2][4] Kuper was a popular teacher,[2] and In 1969 won a Guggenheim fellowship.[3]\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.[5]\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny.[2][4] Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947. [6]\n\nThe uniform of colour, a study of white-black relationships in Swaziland . 1947. [7]\n\nAfrican systems of kinship and marriage . 1950. [8]\n\nThe Shona and Ndebele of Southern Rhodesia . 1954. [9]\n\nAn Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956. [10]\n\nAn ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959. [11]\n\nIndian people in Natal . 1960. [12]\n\nThe Swazi: a South African kingdom [13]\n\nAfrican law: adaptation and development . 1965. [14]\n\nBite of hunger: a novel of Africa . 1965. [15]\n\nUrbanization and migration in West Africa . 1965. [16]\n\nA witch in my heart: a play set in Swaziland in the 1930s . 1970. [17]\n\nSobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970. [18]\n\nSouth Africa: human rights and genocide. 1981. [19]\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016 ."}, {"url": "https://books.google.com/books/about/The_Swazi.html?id=-4MZDgAAQBAJ", "page_content": "Routledge is proud to be re-issuing this landmark series in association with the International African Institute. The series, published between 1950 and 1977, brings together a wealth of previously un-co-ordinated material on the ethnic groupings and social conditions of African peoples.\n\nConcise, critical and (for its time) accurate, the Ethnographic Survey contains sections as follows:\n\nPhysical Environment\n\nLinguistic Data\n\nDemography\n\nHistory & Traditions of Origin\n\nNomenclature\n\nGrouping\n\nCultural Features: Religion, Witchcraft, Birth, Initiation, Burial\n\nSocial & Political Organization: Kinship, Marriage, Inheritance, Slavery, Land Tenure, Warfare & Justice\n\nEconomy & Trade\n\nDomestic Architecture\n\nEach of the 50 volumes will be available to buy individually, and these are organized into regional sub-groups: East Central Africa, North-Eastern Africa, Southern Africa, West Central Africa, Western Africa, and Central Africa Belgian Congo.\n\nThe volumes are supplemented with maps, available to view on routledge.com or available as a pdf from the publishers."}, {"url": "https://www.taylorfrancis.com/books/mono/10.4324/9781315306476/shona-ndebele-southern-rhodesia-hilda-kuper-hughes-van-velsen", "page_content": "Routledge is proud to be re-issuing this landmark series in association with the International African Institute. The series, published between 1950 and 1977, brings together a wealth of previously un-co-ordinated material on the ethnic groupings and social conditions of African peoples.\n\nConcise, critical and (for its time) accurate, the Ethnographic Survey contains sections as follows:\n\nPhysical Environment\n\nLinguistic Data\n\nDemography\n\nHistory & Traditions of Origin\n\nNomenclature\n\nGrouping\n\nCultural Features: Religion, Witchcraft, Birth, Initiation, Burial\n\nSocial & Political Organization: Kinship, Marriage, Inheritance, Slavery, Land Tenure, Warfare & Justice\n\nEconomy & Trade\n\nDomestic Architecture\n\nEach of the 50 volumes will be available to buy individually, and these are organized into regional sub-groups: East Central Africa, North-Eastern Africa, Southern Africa, West Central Africa, Western Africa, and Central Africa Belgian Congo.\n\nThe volumes are supplemented with maps, available to view on routledge.com or available as a pdf from the publishers."}, {"url": "https://abbysgondek.com/portfolio/fatima-meer-and-hilda-kuper-jewish-muslim-collaborations-in-research-on-indian-south-africans/", "page_content": "Dr. Abby Gondek, Morgenthau Scholar-in-Residence, FDR Library, Hyde Park, NY\n\nPhD Global and Socio-cultural Studies, Florida International University\n\nMA African and African Diaspora Studies, FIU\n\nMA Women’s Studies, SDSU\n\nFor the roundtable: The politics of knowledge in jewish women’s activism @ NWSA 2019\n\nNovember 14, 2019 in San Francisco, CA\n\nHilda Kuper with Fatima Meer and Gisele Maquet, in front of Hilda’s home on Warner Ave. in Los Angeles, 1984/5. Kuper family photograph collection, courtesy Mary Kuper. Fatima’s daughter, Shamim, posited that Fatima must have come to visit Hilda during 1985 when Fatima was a Visiting Lecturer at Swarthmore. Gisele Maquet’s husband, Jacques Maquet, was an anthropologist at UCLA (with Hilda).\n\nAbstract\n\nFatima Meer (1928-2010), a feminist sociologist of Indian Muslim (on her paternal side) and Jewish descent (on her maternal grandfather’s side) in South Africa, collaborated with Hilda Kuper (1911-1992), a Jewish anthropologist (born in Rhodesia), producing “The Indian Elites in Natal, South Africa” (1956). Meer conducted fieldwork and influenced Kuper’s Indian People in Natal (1960) as well as Kuper’s play The Decision (1957). One of the themes in Meer’s work was black and Indian women’s experiences of racism and sexism and the use of suicide as a mode of resistance within apartheid South Africa (1976). This presentation explores how Kuper and Meer influenced each other’s writings and anti-apartheid activism.\n\nOrganization\n\nI begin with an explanation of Hilda Kuper & Fatima Meer and then move into their collaboration, focusing on the publications they wrote together or that were thematically connected. In part 3, I detail the timeline of their relationship. In the last section, I describe Hilda’s play The Decision, influenced by her research with Fatima Meer and discuss their overlapping themes such as suicide and different types of elites within the Indian community in South Africa.\n\nPart 1: Intro to Hilda Kuper & Fatima Meer\n\nHilda Kuper was born in 1911 in Bulawayo, Rhodesia, grew up in Johannesburg, South Africa and received her anthropological training with Winifred Hoernlé at the University of Witwatersrand and Bronislaw Malinowski at the London School of Economics. Kuper’s first fieldwork involved studying the impact of liquor laws on black women in Johannesburg. Later her research sites expanded to Swaziland and Indian communities in Durban, Natal, South Africa, where she formed a life-long friendship and research partnership with sociologist, Fatima Meer, who was of South African, Indian, Muslim and Jewish descent. Their collaboration will be the focus of this presentation.\n\nHilda Kuper at her home in Los Angeles, 1974, at a party organized for her students, photograph by Dawn Chatty\n\nThrough Hilda’s marriage to Leo Kuper she became involved in non-violent apartheid protests as one of the founders of the Liberal Party and was forced to leave South Africa; she eventually became a Professor of Anthropology at UCLA.\n\nHilda Kuper (center) with Leo Kuper, her husband (behind), and Max Gluckman, her old friend and anthropology colleague from the University of Witwatersrand in Johannesburg, (at the right) at Watts Towers, Los Angeles. Hilda Kuper Papers, UCLA Special Collections, Box 45, Folder 20. For more information on the connection between Max Gluckman and Hilda Kuper see Andrew Bank, p. 193, n. 17\n\nIn her theorizing about black women, Hilda took a “Swazi point of view,” arguing that Westernization weakened women’s position. She portrayed Swazi women and Indian South African women as the victims of colonization as well as patriarchal indigenous systems.\n\nHilda’s initial interests in law, acting, languages and history, morphed into her career as a legal and political anthropologist, novelist and playwright. Durkheim and French sociology were also highly influential, as both Hilda and her research collaborator, Fatima Meer, wrote about suicide and women of color in Southern Africa.\n\nHilda’s graduate student at UCLA, David Kuby, said the following of her Jewish identity:\n\n“Jewish, British and African are quite a combination of values not easily put into one neat box and there was a comfortable, very human dimension of Hilda that was humble and nonjudgmental that made one feel very accepted in our imperfections despite Hilda’s high standards for scholarship and social justice work.” -David Kuby, December 29, 2016, e-mail correspondence\n\nThe information in this section comes from a brief bio I wrote of Hilda, based on my dissertation. You can find the full bio I wrote here on my academia.edu page and the excerpt from it was published at Bustle.com.\n\nFatima Meer and Nelson Mandela at her home in 1995, image by Richard Shorey\n\n“Meer’s Gujrati grandfather, Ismail, had arrived in South Africa as a trader from Surat on the east coast of India in the 1880s. Her father, Moosa Meer, was the editor of Indian Views, a weekly in Urdu and English. Her mother, Ameena, was a white woman [whose father was Jewish] originally called Rachel. The Meer household was a mixture of Muslim Gujarati traditions and liberal political activism; Fatima combined the two.”\n\nWajid, Arjumand. 2010. “Fatima Meer: Academic and Activist.” The Hindu, March 30, 2010.\n\n“At a time when most Indian girls were helping their mothers in the kitchen making samosas, this young woman was leading protest marches and challenging the most oppressive system in the world.” Winnie Mandela\n\nFrom the Wajid obituary of Fatima Meer, March 30, 2010.\n\nAn article about Fatima’s artwork that was created while she was in the Women’s Gaol in Johannesburg has just come out this October in the New Yorker magazine. I visited the Gaol in March 2017, while in Johannesburg for my dissertation research. You can also learn about Fatima’s art work during her imprisonment here.\n\n“Morning in the Prison Yard” by Fatima Meer, a photograph I took of her painting, one of many displayed on this mesh-like canvas throughout the women’s gaol. Photo by Abby Gondek, March 26, 2017\n\nPhotograph of myself taking a photo of the display for the wash-house courtyard. This was one of the most traumatic areas in the prison because I learned that female prisoners had to wash all of the clothing, including the male prisoners’ pants, which were oftentimes stained with blood (likely from being raped or lashed). These are images from the Women’s Gaol in downtown Johannesburg, where Fatima Meer was detained (in 1976) and painted scenes from her daily life in the prison. The painting on the left contains the following explanation written by Meer: “The two prisoners in the foreground are carrying our bath water from the kitchen. The other prisoner brings our flask of boiling water. The awaiting trial prisoners line up for breakfast on the left. The ‘convicted’ line up on the right. The three prisoners facing the wall are waiting for sanitary pads. They will get three each for the day.”\n\n“…in 1976, [Fatima Meer] was held for six months, without trial, under the apartheid government’s Terrorism Act. Her crime was an attempt to organize a mass rally with the activist Steve Biko, after police shot at and killed student protesters in the township of Soweto.” Anakwa Dwamena, October 23, 2019, The New Yorker\n\nPart 2: Writing collaboration\n\nHilda collaborated with Fatima Meer on a project about Indian South Africans in Durban, Natal (Kuper and Meer 1956).\n\nThis network visualization developed using nodegoat, a project of Lab1100, displays the connections between the publications of Hilda Kuper and Fatima Meer.\n\nThis network visualization displays the publications written by Hilda Kuper and Fatima Meer. “Indian Elites in Natal” (1956), co-authored by Kuper and Meer, shared a thematic focus on Indian South Africans and protest with Hilda’s book Indian People in Natal (1960), for which Fatima Meer acted as a research assistant. “Indian Elites” also shared an emphasis on Indian ethnic groups, such as Tamil and Hindustani, with Hilda’s play The Decision (1957). All three of these works, contrasted the “African” (meaning black) and Indian South African populations. Note the connection between Violaine Junod’s “Report on a Study of the Coloured ‘Social Elite’ in London” (1952) and Hilda Kuper and Fatima Meer’s “Indian Elites in Natal” (1956). Violaine Junod was close to both Hilda Kuper and Fatima Meer (Junod n.d.). Fatima Meer described the Kupers and Violaine Junod as her “most constant friends” during the Treason Trials in 1956 (Meer 2017, 169).\n\nJunod, Violaine. n.d. “Violaine Junod Letters to Hilda Kuper, Correspondence from 1970s-80s.” Box 52. Folder 7. Los Angeles, CA: Hilda Kuper Papers, Box 52, Folder 7, UCLA Special Collections, Charles E. Young Research Library.\n\nMeer, Fatima. 2017. Fatima Meer: Memories of Love and Struggle. Edited by Shamim Meer. Cape Town: Kwela Books.\n\nPart 3: Hilda and Fatima’s relationship\n\nHilda met Fatima Meer in 1952 when Hilda moved to Durban, where her husband Leo Kuper, received a Sociology chair position at the University of Natal. It was Leo, the new head of the department, who allowed Fatima to rewrite her sociology honors exam (after she had been failed by a racist Afrikaner Nationalist lecturer); she passed with “flying colours” (Meer 2017, 150-151).\n\nFatima was Hilda’s research assistant for Kuper’s book Indian People in Natal (Kuper 1960, x). The Institute of Community and Family Health in the Newlands neighborhood in Durban funded this research (Meer 2017, 155). Fatima’s fieldwork notebooks in the Hilda Kuper Papers, elaborate the effect of Indian immigration to South Africa upon caste affiliation, marriage traditions, legally required medical care, and labor strikes. Meer also tracked and summarized the ship logs by sex, age, caste, religion, village, and marriage status (Kuper et al. 1953). In her autobiography, Fatima refers to “filling in dozens of these reporter’s notebooks” but unfortunately, she was dismissed after only a year from this position at the Institute of Community and Family Health because of her anti-apartheid activism and radicalism; Hilda and Fatima were both shocked (2017, 158). Hilda clearly used Fatima’s notes in Indian People in Natal in Chapter 1 regarding migration and Chapter 2 on changes in caste affiliation post-migration.\n\nKuper, Hilda, Fatima Meer, R. Singh. 1953. “Hilda Kuper Papers, Box 14 (Fatima Meer and R. Singh Fieldnotes).” Los Angeles: UCLA Special Collections.\n\nHilda Kuper’s transnational migrations & fieldwork, a geographical visualization, developed using nodegoat, a project of Lab1100\n\nHilda conducted fieldwork in Durban in three Indian suburbs from 1953-1957 with funding from the Council for Social and Industrial Research. She worked with Indian health educators who were trained by the Institute of Community and Family Health including four women Miss N. Perumal, Mrs. Padmini Govindoo, Sally Naidoo and Violet Padayachee. In addition to Fatima Meer, Mrs. Radhi Singh assisted Hilda (Bank 2016, 218-221; Kuper 1960, x).\n\nBank, Andrew. 2016. Pioneers of the Field: South Africa’s Women Anthropologists. London, England: Cambridge University Press, International African Institute.\n\nThe Kuper home was a central site for anti-apartheid solidarity across racial lines. On November 9, 1952, Leo collaborated with the joint ANC-Indian Congress political rally at Red Square in Durban; he wrote about his experiences in Passive Resistance in South Africa (1955). Leo was arrested in 1956 with Alan Paton and four Indian Congress members for their participation in the “assembly of the Native” in the Gandhi Library Hall in Durban; this is where they launched a defense fund for the 156 Treason Trialists. Hilda was arrested earlier in 1956 with Fatima Meer at a women’s march protesting new laws that extended the pass system to “non-European” women (Bank 2016, 217–18). Also in 1956, the Kupers “solicited a loan” and “stood guarantor” for Fatima and her husband Ismail Meer, so that they could get the capital to build their house, since non-whites could not get loans at that time (Meer 2017, 163).\n\nHilda was “combative with non-progressive colleagues” and was excluded from a departmental research trip to Swaziland, despite her expertise (Russell 1994, 146). By the late 1950s, the apartheid police increasingly harassed Leo and Hilda, spies attended their lectures, and Leo was threatened with a banning order; eventually Hilda instigated their departure from South Africa (Golomski 2011, 4; Moran 1988, 198).\n\nRussell, Margo. 1994. “OBITUARY: Hilda Kuper, 1911-92.” Africa 64 (1): 145–49.\n\nGolomski, Casey. 2011. “Hilda Kuper, Anthropology, History.” In University of Swaziland, UNISWA, History Staff Seminar Series, 21. University of Swaziland, Department of Theology and Religious Studies.\n\nMoran, Katy. 1988. “Hilda Beemer Kuper (1911- ).” In Women Anthropologists: Selected Biographies, edited by Ute Gacs, Aisha Khan, Jerrie McIntyre, and Ruth Weinberg, 194–201. Urbana: University of Illinois Press.\n\nIn 1970, Hilda wrote to Fatima from Los Angeles to express that she was “so delighted” with Fatima’s book (Portrait of Indian South Africans, 1969) that she and Leo felt Fatima should submit it for a Ph.D.\n\n“The photographs are fascinating and the text is rich in perception.” Kuper, Hilda. 1970. “Hilda Kuper to Fatima Meer and Ismail Meer, March 20, 1970.” Los Angeles, CA: Hilda Kuper Papers, Box 41, Folder 9, UCLA Special Collections, Charles E. Young Research Library.\n\nIn closing, Hilda wrote, “There is so much to talk about that cannot be expressed in letters. We think of you very often and send you much, much love” (Kuper 1970). In her autobiography, Fatima wrote that Hilda Kuper “considered the manuscript so good that she canvassed the head of department to award me a doctorate for it” (Meer 2017, 186).\n\nIn this letter from Hilda to Fatima, Hilda explains that she is about to visit her daughter Mary in Israel, before going to Swaziland (in 1970 Hilda became a Swazi citizen). Hilda complements Fatima on her new book and expresses how much both she and Leo think of Fatima and send much love. Hilda Kuper Papers, Box 41, Folder 9.\n\nPart 4: The Decision\n\nThe Decision (1957) is a tragic play written by Hilda Kuper in which the female lead character is punished through death, for the patriarchal and racist hierarchical structure of her society. In this play, Savitree, a girl from a high caste Hindi speaking family in Durban, in Natal province, South Africa, fell in love with a Tamil Christian boy, Siva, whose family was from Southern India.\n\nThe cover page for the program of Hilda’s 1957 version of The Decision, performed in Durban by medical students at the University of Natal. Sondra Hale personal collection of Hilda Kuper’s creative writing at UCLA, Anthropology Department.\n\nTheir different ethnicities and religions, as well as the fact that Siva was active in the Indian National Congress and the passive resistance movement, marked Siva as “other” and unmarriageable (61). One version of the story closed when Savitree set fire to herself and died because her family forbade her to be with Siva (Kuper 1993, 63).\n\nKuper, Hilda. 1993. A Witch in My Heart: Short Stories and Poems. Edited by Nancy Schmidt. Madison: African Studies Program, University of Wisconsin–Madison. https://books.google.com/books?id=bh5aAAAAMAAJ&pgis=1.\n\nIn a different version of the play, Savitree sacrificed herself by marrying the man her family decided she should marry (Kuper 1957, 30–31).\n\nKuper, Hilda. 1957. “The Decision: A Contemporary South African Indian Play.” Durban Medical Students Drama Group. Los Angeles, CA: Sondra Hale Personal Collection, UCLA Anthropology Department, Haines Hall 391.\n\nDirectly before Siva heard the news of Savitree’s suicide (in the 1993 version) he told his activist friends that Indian South African families imprison their daughters in domestic roles, preventing their freedom. Siva’s friend Rajid Naidoo argued:\n\n“African women are a major force in African politics, but few Indian women are active in political affairs.” Hilda Kuper, 1993\n\nThis implied that the problem was within Indian culture, rather than South African culture as a whole. Siva’s friend Chetty remarked that the women should “free themselves” rather than waiting for men to do so, upon which Siva discovered that Savitree killed herself, causing the reader to wonder if this was Savitree’s way of “freeing herself” (Kuper 1993, 63).\n\nIn the 1957 version of the play, Siva’s words close the play:\n\n“all I wanted is to be myself and let others be themselves.” Hilda Kuper, 1957\n\nHe contended that Savitree should not have had to sacrifice herself for her family out of the “strength of her affection for others, for those who had brought her up.” Siva emphasized that her loyalty should not lie with her family alone but with the “family of the people of the world” (31).\n\nPerhaps, this was Kuper’s message for unity rather than separation between not only Indian South Africans, but also all South Africans.\n\nIntriguingly, Kuper revealed that she had never published the play because a few Indian couples confronted her after a performance of the play in Durban (by Indian medical students) to inform her they would sue her for writing about their families. Though she did not know these families Hilda\n\n“realized that I had struck a very vulnerable center and Indians were already scapegoated for much of the antagonisms so sadly I put the manuscript aside” but she was revising it for publication in the months before her death (Schmidt 1993, 1, n.5). Schmidt, Nancy J. 1993. “Introduction.” In A Witch in My Heart: Short Stories and Poems, 1–3. Madison: African Studies Program, University of Wisconsin–Madison.\n\nHilda had written about a case very similar to the one she depicted in her play, in her 1960 book, Indian People in Natal (for which Fatima was a research assistant).\n\n“By no means unusual is the case of the girl from an orthodox Hindi speaking family who fell in love with a Tamil boy; on discovering this, her parents married her to a man of their own choice. From the beginning the girl was most unhappy with her in-laws, and after one of her frequent visits home she threatened to commit suicide if forced to return to them.” Hilda Kuper, Indian People in Natal, 1960, p. 136\n\nThe Decision echoes some of the findings from a paper about Indian elites in Natal, co-written by Fatima Meer and Hilda Kuper (1956). They described two primary elite groups: the protest and compromise elites.\n\n“The protest elites, led mainly by intellectuals, identify with Non-Europeans and ‘oppressed people’ in general; the compromise elites operate as a defensive and exclusive minority” (Kuper and Meer 1956, 145). Kuper, Hilda, and Fatima Meer. 1956. “Indian Elites in Natal, South Africa.” In Social Science Conference, University of Natal, Institute for Social Research, 129–45. Durban, Natal, South Africa: University of Natal, Institute for Social Research.\n\nSiva was part of the protest elite, while Savitree’s family represented the compromise elites. Meer and Kuper found that original caste differences between Indian immigrants were fading because of the\n\n“upward mobility of the ex-indentured and the downward pressure from the Europeans, and it appears that the Indian elite of the future will relate more to the Non-Europeans in general than to specific sectional groups.” Kuper and Meer, 1956, p. 145\n\nInterestingly, despite caste distinctions fading, ethnic differences were not, for example between Tamil, Telegu and Hindustani, which are clearly displayed in Hilda’s play since Savitree’s Hindustani family disapproved of Siva because he was Tamil (Kuper 1957; Kuper and Meer 1956, 130).\n\nThis article about Indian elites echoes (thought does not cite) Violaine Junod’s findings from 1952 about protest and compromise leaders among the “coloured” social elite in Britain. Compromise leaders were the intermediaries between white and black groups, serving as non-political token “coloured” spokespeople “on show” in a “zoo situation” within white organizations, which were “sympathetic” to “colonial” issues. Compromise leaders had no direct ties to either colonial nationalist governments or to policy makers and were seen as “acting white” (Banton 1960:151-153). In contrast, protest leaders had close links with colonial nationalist movements, denounced white racism, and held defiant attitudes toward whites supposedly “sympathetic” to the cause. Protest leaders were esteemed by “coloured” community members but disliked by whites (Banton 1960:152).\n\nBanton, Michael. 1960. White and Coloured: The Behavior of British People towards Coloured Immigrants. 2nd ed. New Brunswick, N.J.: Rutgers University Press.\n\nFatima and Hilda’s findings related to Indians and suicide are interconnected.\n\n“From the official figures of ‘self inflicted deaths’ published for Durban, the number of Indians who took their own lives is roughly the same as of Europeans, both being proportionately higher than the number of Africans and Coloureds; but when to these figures is added deaths in the category of ‘accidental burning’ – and burning is the traditional method of committing suicide among Hindus -the Indians outnumber all other racial groups.” Hilda Kuper, 1960, p. 173\n\nThis is one of the tables from Fatima Meer’s 1976 Race and Suicide in South Africa, p. 236. In the earlier period, 1940-60, Indian women had the highest mean suicide rate (16.2) among women and were only second to White males. In the later period, Indian women’s suicide rate increased to 26.4 (yet all groups increased) but this rate was less than that of Coloured women, as well as four other race-gender groups.\n\n\n\nThis table (23b) from Fatima Meer’s 1976 Race and Suicide, emphasizes that the huge majority of Indian women who committed suicide were housewives. This was also true of Coloured women, but the Indian women’s percentage was much higher. Not pictured here is table 23a: of African women who committed suicide, 63.9% were housewives, while 53.7% of white women who committed suicide were housewives. See pages 249-250.\n\nConclusion\n\nFatima Meer and Hilda Kuper collaborated both political and theoretically, through their shared research interests. Hilda supported Fatima unconditionally (both financially and academically) while Fatima conducted foundational fieldwork which informed Hilda’s writing, both academic and creative (through Hilda’s play The Decision). Some of the key themes that they developed were the differences between Black women and Indian women in terms of involvement in South African politics. Fatima investigated the differences in suicide rates by race, gender, class and occupation in South Africa in the mid-20th century. Hilda explored a specific instance of suicide through her fictional play, which was based on the research she had conducted with Fatima. They also shared an interest in different types of elites, protest v. compromise elites, and they investigated how caste differences were becoming less important while ethnic differences were not, as evidenced in Hilda’s play, The Decision.\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License."}, {"url": "https://www.taylorfrancis.com/books/mono/10.4324/9781315306797/swazi-hilda-kuper", "page_content": "Routledge is proud to be re-issuing this landmark series in association with the International African Institute. The series, published between 1950 and 1977, brings together a wealth of previously un-co-ordinated material on the ethnic groupings and social conditions of African peoples.\n\nConcise, critical and (for its time) accurate, the Ethnographic Survey contains sections as follows:\n\nPhysical Environment\n\nLinguistic Data\n\nDemography\n\nHistory & Traditions of Origin\n\nNomenclature\n\nGrouping\n\nCultural Features: Religion, Witchcraft, Birth, Initiation, Burial\n\nSocial & Political Organization: Kinship, Marriage, Inheritance, Slavery, Land Tenure, Warfare & Justice\n\nEconomy & Trade\n\nDomestic Architecture\n\nEach of the 50 volumes will be available to buy individually, and these are organized into regional sub-groups: East Central Africa, North-Eastern Africa, Southern Africa, West Central Africa, Western Africa, and Central Africa Belgian Congo.\n\nThe volumes are supplemented with maps, available to view on routledge.com or available as a pdf from the publishers."}, {"url": "https://www.perlego.com/book/1480996/an-african-aristocracy-rank-among-the-swazi-pdf", "page_content": "1. Conditions of Work and the Status of the Investigator\n\nI MET Sobhuza II, Chief of the ‘primitive people’ I was to study, attending the New Education Conference at the Witwatersrand University in July 1934. Sobhuza II, Ingwenyama (Lion) of the Swazi nation, had travelled nearly 300 miles from his home in the Protectorate to hear a series of lectures in English by world-famous educationalists and anthropologists.\n\nMost educated Africans, more particularly detribalized Africans and men with little standing in tribal life, distrust anthropology. They see in it a weapon to keep natives in their ‘traditional milieu’ (arbitrarily stripped of actions judged ‘barbarous’ by Europeans) and to prevent them on pseudo-scientific grounds—retaining the ‘soul of the people’, their ‘primitive mentality’—from assimilating European culture. Sobhuza, on the other hand, is interested in anthropology; he has read a number of books on the subject, subscribes to anthropological journals, enjoys descriptions of the customs of other people, and is proud of his own. He one day explained, ‘Anthropology makes possible comparison and selection of lines of further development. European culture is not all good; ours is often better. We must be able to choose how to live, and for that we must see how others live. I do not want my people to be imitation Europeans, but to be respected for their own laws and customs.’ In the hierarchical Swazi society, the support of the Ingwenyama is an essential prerequisite for the acceptance of any stranger, and without his sympathetic assistance anthropological research would have been difficult.\n\nI spent over two years in the Swaziland Protectorate. My first visit, beginning October 1934, lasted sixteen months. I returned in September 1936 for another eight months’ intensive research. Since then I have been back for short periods to check up data, to witness ceremonies, and to pay friendly visits. In Johannesburg, where I have lived since I left Swaziland, I worked with a number of Swazi, some newcomers from the country, others old city-dwellers.\n\nIn the Protectorate I stayed in native homesteads. My headquarters was Loƃamba, the capital. At my disposal was the most Westernized house in the village—a square brick room with a wooden door about six feet high, glass windows, and a partition dividing the room into two sections. In it were a few leather chairs—the only chairs in the capital and used mainly for European guests. Till I arrived, this special hut was occupied by the most important relatives of the Ingwenyama on their state calls to the capital.\n\nFrom Loƃamba I travelled to various principalities, and in Swazi society it was taken for granted that, except when I went to a ceremony in a commoner’s family, I should stay in the homestead of the chief. ‘At the homes of the great appear the laws of our people’, Umnyakaza Gweƃu, my retainer, often explained. ‘The chief alone can arrange for you to see all you wish and call anyone to speak to you.’ The co-operation I received from the subjects depended largely on the character of the chiefs.\n\nUmnyakaza was ‘given me’ by Sobhuza as my umfana. The basic meaning of umfana is ‘boy’; in the context of political relations it is a subject bound by personal loyalty. His position is very different from that of a servant to a European. The umfana becomes a member of the over-lord’s intimate circle of dependents, regards him as a father and is treated much like a son. Umnyakaza, a warrior from Sobhuza’s own bodyguard, acted as my teacher, interpreter, cook, and travelling companion. In addition to an unusually extensive Swazi and Zulu vocabulary, he had a grasp of Sesotho, spoke a graphic, ungrammatical English, a smattering of Afrikaans, and a few words of Portuguese. Intelligent and neurotic, with moods veering from sullen depression to unrestrained gaiety, he believed he was possessed of spirits, and when last I heard of him, he was roving the hills, undergoing the painful training of a diviner. In addition to Umnyakaza, who went everywhere with me and worked for me in Johannesburg for six months, Sobhuza selected other assistants and companions for special occasions.\n\nDespite the open friendship of Sobhuza, the dominant attitude towards me, especially the attitude of the semi-educated Swazi, was fear and suspicion; they were afraid that I was a spy—a European who had ingratiated her way into the confidence of the rulers in order to betray them later. I was maƃalana, a scribe; in my right hand I held the most dangerous of all spears, the pen, and in my left an impenetrable shield, my notebook. I was introduced by the governor of the capital to the council of the nation as ‘a European brought by the Lion (Sobhuza). Fear her, respect her. Forget not she is a European. The King says her work is to show we are not wild animals, we do not live in the mountains, we have our laws. Do not trouble her.’ Sobhuza’s patronage made the people superficially friendly, but it was a hard task to win their confidence. As a woman once said, pityingly, ‘We deceive you like anything because you are white.’\n\nI established intimate contact with a limited circle of people, and these I used as my main informants. The rest of the community were actors in the situations that are the laboratory experiments of the anthropologist: I wrote down words and watched their behaviour, but the individuals themselves were of little assistance for detailed discussions, since I had not broken down their reserve, antagonism, and suspicion. In selecting cases for intensive interviewing, I bore in mind factors of birth, education, age, and religious belief.\n\nTo obtain information, I used the techniques of observation, genealogies, texts, essays set to schoolchildren, interviews, letters from Swazi to each other and to me, and questionnaires. I have used the orthography decided upon by a conference held in 1933, except for the spelling of occasional proper names which are more familiar in other forms, e.g. Sobhuza instead of Sobuza.\n\nIt was essential to learn the language as quickly and thoroughly as possible. Most Swazi know little or no English; the few who speak it fluently still use Swazi in their homes. Educated Swazi preferred to write their texts for me in Zulu (the dialect related to Swazi and used in the schools) rather than in English. English is a foreign tongue dealing with foreign concepts, and when a man speaks English his behaviour and mode of thought seem to change. A Swazi teacher once commented ‘I only enjoy selling cattle when I speak English.’ The significance of this remark is appreciated when one knows the reluctance of the average Swazi to part with his cattle. The process of learning Swazi was of great assistance to me, for seeing a European struggle to acquire their language seemed to give people a certain satisfaction and pleasure, while I think that teaching it to me gave them a sense of importance. They were tolerant of blunders, proud of progress, and they expressed their joy when they did not constantly have to repeat and explain their statements. Then only did they themselves speak freely and not in a peculiar garbled language (a parallel of the European’s pidgin English), which they thought was easier for me to understand.\n\nIt was also necessary for me to grasp other tools of their culture in order to break down the barrier between black and white. I learned to grind grain and make beer; I participated in dancing, singing, the judging of cases, and so on. Often I identified myself with a particular section of actors: at wedding ceremonies I went as a member sometimes of the bride’s and sometimes of the groom’s group; sometimes with the mother-in-law, sometimes with the sisters; at work parties I sometimes sat and distributed food with the host, and sometimes toiled with the workers. When I started field work, I was only allowed to join in the activities of the girls; after my marriage a new status was mine, and wives considered me their equal and treated me as a confidante. As a woman the sphere of my participation was restricted and my data on certain topics reflects this. Just as each individual has only a circumscribed knowledge of his culture, so each status group has its bias and limitations.\n\nComplete identification with the Swazi was neither possible nor, from the point of view of obtaining a comprehensive picture of Swazi life, desirable or necessary. In the Protectorate black and white are closely interdependent. To understand modern Swazi culture, it is necessary to study situations of black and white co-operation, antagonism, and segregation, and the direction of European control. The two colour groups are interdependent, but distinct in culture and interests. To have ‘gone native’ would have ruined any chance of obtaining data from most of the Europeans.\n\nThe anthropologist is inevitably an influence in the lives of the natives, and vice versa. Through me a number of Swazi saw for the first time a typewriter, camera, petrol lamp, collapsible bath, and other material elements of Western civilization. The headmaster of the national school and I, on Sobhuza’s request, took about forty children to the Empire Exhibition in Johannesburg (1936), where they gazed with wonder on a new world. Apart from goods introduced or increased by me, I, as an anthropologist, was used as a source of knowledge on European modes of thought and action. Questions put to informants were returned—with interest. Moreover, I was in a position different from that usually held by the European. I did not blame, try to convert, or seek labourers. I represented a type with whom the Swazi are rarely in contact—the liberal intellectual. The greatest honour shown me by the Swazi was when Sobhuza and his Councillors asked me to become ‘headmaster’ of the Swazi National School during the absence, on active service, of Mr. T. Keen.\n\nOn entering any community a new arrival is automatically assigned a ‘place’. No man or woman can remain in complete isolation; he (or she) is forced to participate to some degree in the life around. Nor can a community admit within its bounds any member who acts without reference to his (or her) fellow men.\n\nA stranger is catalogued on arrival. In Swaziland the first and most important quality noted is skin colour. Everyone falls automatically into the ‘white’, ‘black’, or ‘coloured’ group, and is expected to conform to the attitudes of that group. Throughout the book, therefore, I use the term ‘white’ as synonymous with Europeans; ‘black’ with African, native, and Bantu; ‘coloured’ with Eur-African (the result of miscegenation between Africans and Europeans, and also between coloureds, Africans, or Europeans, as well as of unions within the coloured group itsel.f) Secondly, obvious economic factors such as type of equipment, make of car, and spending power, affect the classification. Thirdly, different Churches in this small ‘Christian country’ create their own categories of believer and heathen. Fourthly, in the backward Protectorate, occupations are limited and there is both a jealous monopoly of existing trades and a suspicion of ‘the specialist’, more especially one whose calling is unfamiliar. The anthropologist, in the same way as government official, chief, trader, or anyone else, is accorded a definite position in the society he investigates. Anthropologists were no novelty to Europeans in Swaziland, but each anthropologist evoked specific reactions. Finally, characteristics such as nationality, sex, education, age, evoke fairly stereotyped patterns of behaviour.\n\nThe reactions are not uniform; they vary with different classes of the population. By class I mean, in this book, a group distinguished from others by economic and social standards. The Europeans in Swaziland fall roughly into three classes: the upper—leading government officials, professional men, big traders, prosperous landowners, and mine managers; the middle—small traders, farm managers, and lower Civil Servants; and the lower—labelled the ‘poor whites’. The Swazi are not yet stratified into economic classes, though there is a growing tendency towards this division. In their own society they differentiate primarily the noble-born from the commoner.\n\nAssociational interests, interests of a group or groups organized for particular purposes, also affect the attitudes towards the anthropologist. Government officials considered research might assist administration. Farmers and miners were suspicious lest I disorganize labour, and certain missionaries read into my work an attempt to revive traditional religious practices.\n\nThe anthropologist reacts according to his own training and interests to the people among whom he works. This inevitably affects both the facts he selects from the welter of data he records and the interpretation he gives to them. I am handicapped by not being able to publish certain data: my friendship with Sobhuza gave me important information that I bound myself not to disclose. Secondly, I am prevented from using certain documents for fear of being involved in cases of defamation. Thirdly, some official correspondence was shown to me, provided that I did not make it public. Fourthly, and this is most important, my own outlook has undoubtedly affected my interpretation of the facts. This does not mean that I came to Swaziland to prove a preconceived thesis. The process of scientific rationalization is not so conscious.\n\nOriginally I intended to write a general monograph. I collected innumerable facts and fitted them into stereotyped headings—Economics, Politics, Religion, Magic, and so on. After a few months in the field, the ‘pattern’ of the culture slowly emerged for me. Unfortunately, I persevered in collecting all the usual material of an ethnographic account. Even after I left Swaziland I devoted some months to forcing these facts into the artificial chapters of a standard monograph. Finally, I decided to write on what appeared to me the essential orientation of Swazi life— rank. The question arose: Did my evaluation of the facts agree with that of the Swazi? I discussed the matter with informants in Johannesburg; the problem when formulated was an intellectual abstraction that they had not considered. I discussed specific situations and posed definite questions. The final interpretation was mine as a sociologist. My facts, I hope, will not be challenged; my assessment may. No human being can be objective in his interpretation and evaluation of social facts; the colour, the class, the creed directs thought and classification. Anthropological doctrines have time and again been proved to reflect social currents, for anthropology deals with crucial issues in society and anthropologists themselves are involved in these issues. All the investigator can do is to attempt to guard against arbitrarily selecting facts which he is aware can be refuted by the facts he has consciously omitted.\n\nThis book will meet with criticism, not only by Europeans, but also by educated Swazi. Anthropologists in most parts of the world are no longer describing the lives of illiterates, unable to speak for themselves or to judge the books to which they contribute the living substance.\n\n2. The Scope of the Book\n\nThis book is not an all-embracing monograph on Swazi culture. The material is co-ordinated and presented from the approach of rank and status—the social evaluation of individuals and groups. Much of the data that I collected has therefore been omitted as irrelevant, and will be published separately. For further information on the Swazi, the reader is referred to books and articles cited in the bibliography.\n\nNor does this volume cover the whole rank situation in modern Swaziland. It deals exclusively with the traditional orientation, and thereby involves an arbitrary limitation. To complete the picture, we require a description of European domination, accomplished by European culture agents—administrators, farmers, missionary recruiters, and traders—and the changing alinements which they caused in the traditional structure. This section has been omitted for reasons of space, and will be published independently.\n\nRank is measurement of social status. A graded scale of individuals and of social groups exists in every society. Almost any conceivable factors—wealth, birth, colour, age, sex, occupation, creed, ability—may be culturally selected as bases for discrimination. The factors vary in force and recognized importance; they are integrated in such a way as to form a coherent system characterized by dominant emphasis. The stress may be on one or more factors, associated with similar or diverse groups. Within the social framework every action is intelligible and is evaluated by the people concerned.\n\nA study of the Swazi in the twentieth century is largely an analysis of the privileges of pigmentation and pedigree and of the way in which they affect and are affected by other cultural principles. Rank controls the behaviour of individuals and groups; it determines their rights, obligations, and attitudes. In any social situation the modes of action and of thought depend primarily on whether the actors are black or white, nobles or commoners, men or women, adults or children, specialists or laymen, married or unmarried, or fall into any other category of relationships evaluated by the people in the society. Every human being combines a number of such categories or statuses and co-ordinates them psychologically as best he can. Within the course of a few hours, one and the same man may act as father, son, headman, specialist in ritual, and judge. For each occasion the pattern is more or less culturally determined and the response fairly automatic, though sometimes there are conflicting status obligations which each individual resolves, only partly, for himself or herself.\n\nThe average individual is never conscious either of the sum total of the status norms in his society or of his own limitations. He has a distorted vision and a partial knowledge dictated by his participation in, rather than his observation of, his cultural surroundings. A European and a native, a king and a slave, a man and a woman, often hold different points of view because each is a stranger in the world of the other. The transitory existence of individuals is usually soon forgotten and the ritual that is enacted on their deaths marks them primarily as status types in a continuous culture scheme.\n\nWithin the scheme there must be some consistency. It would be an impossible situation if wealth gave power, yet natives, recognized as the inferior group, owned the best property in the country; or if pedigree bestowed honour in politics while religion denied any benefits to the aristocracy of birth. Consistency is, however, rarely the result of conscious effort: a planned society is unknown to most peoples, and even leaders who have deliberately introduced radical changes have not per..."}]}