{"An African Aristocracy: Rank Among the Swazi was written by Hilda Kuper and published in 1944.": [{"url": "https://www.amazon.co.uk/African-Aristocracy-Ethnographic-Studies-Century/dp/1138586129", "page_content": "Select Your Cookie Preferences\n\nWe use cookies and similar tools that are necessary to enable you to make purchases, to enhance your shopping experiences and to provide our services, as detailed in our Cookie Notice. We also use these cookies to understand how customers use our services (for example, by measuring site visits) so we can make improvements.\n\nIf you agree, we’ll also use cookies to complement your shopping experience across the Amazon stores as described in our Cookie Notice. This includes using first- and third-party cookies, which store or access standard device information such as a unique identifier. Third parties use cookies for their purposes of displaying and measuring personalised ads, generating audience insights, and developing and improving products. Click ‘Customise Cookies’ to decline these cookies, make more detailed choices, or learn more. You can change your choices at any time by visiting Cookie Preferences, as described in the Cookie Notice. To learn more about how and for what purposes Amazon uses personal information (such as Amazon Store order history), please visit our Privacy Notice."}, {"url": "https://www.abebooks.com/9780197241431/African-Aristocracy-Rank-Among-Swazi-0197241433/plp", "page_content": "Kuper, Hilda\n\nPublished by Oxford University Press, E-059 (1961) ISBN 10: 0197241433 ISBN 13: 9780197241431 Used Hardcover Quantity: 1\n\nBook Description Hardcover. Condition: Very Good. Hardcover. 8vo. Published for the International African Institute by the Oxford University Press, London, UK. 1961. Xii, 251 pgs. Illustrated with black and white plates. Reprint with new preface. DJ has shelf-wear present to the DJ extremities (chip present to the rear panel of the DJ). Bound in cloth boards with titles present to the spine. Boards have light shelf-wear present to the extremities. Previous owner's name present to the FFEP. Text is clean and free of marks. Binding tight and solid. Originally published in 1947 and reprinted with a new preface in 1961, this book is based on field studies and gives an account of the social organization of the Swazi, wiith special reference to the aristocratic structure of their society and the way in which birth and rank determine social relationships and activities. The book provides a historical picture of the Swazi and the part played by them during the period of European expansion in British and Boer conflicts in South Africa. The economic structure of a society based on agriculture and the influence exerted over every aspect of social activity by the conservative and aristocratic political hierarchy is analyzed and post-War changes and their effect upon the Swazi also reviewed. E-059; 264 pages. Seller Inventory # 58217\n\nMore information about this seller | Contact this seller"}, {"url": "https://www.perlego.com/book/1480996/an-african-aristocracy-rank-among-the-swazi-pdf", "page_content": "1. Conditions of Work and the Status of the Investigator\n\nI MET Sobhuza II, Chief of the ‘primitive people’ I was to study, attending the New Education Conference at the Witwatersrand University in July 1934. Sobhuza II, Ingwenyama (Lion) of the Swazi nation, had travelled nearly 300 miles from his home in the Protectorate to hear a series of lectures in English by world-famous educationalists and anthropologists.\n\nMost educated Africans, more particularly detribalized Africans and men with little standing in tribal life, distrust anthropology. They see in it a weapon to keep natives in their ‘traditional milieu’ (arbitrarily stripped of actions judged ‘barbarous’ by Europeans) and to prevent them on pseudo-scientific grounds—retaining the ‘soul of the people’, their ‘primitive mentality’—from assimilating European culture. Sobhuza, on the other hand, is interested in anthropology; he has read a number of books on the subject, subscribes to anthropological journals, enjoys descriptions of the customs of other people, and is proud of his own. He one day explained, ‘Anthropology makes possible comparison and selection of lines of further development. European culture is not all good; ours is often better. We must be able to choose how to live, and for that we must see how others live. I do not want my people to be imitation Europeans, but to be respected for their own laws and customs.’ In the hierarchical Swazi society, the support of the Ingwenyama is an essential prerequisite for the acceptance of any stranger, and without his sympathetic assistance anthropological research would have been difficult.\n\nI spent over two years in the Swaziland Protectorate. My first visit, beginning October 1934, lasted sixteen months. I returned in September 1936 for another eight months’ intensive research. Since then I have been back for short periods to check up data, to witness ceremonies, and to pay friendly visits. In Johannesburg, where I have lived since I left Swaziland, I worked with a number of Swazi, some newcomers from the country, others old city-dwellers.\n\nIn the Protectorate I stayed in native homesteads. My headquarters was Loƃamba, the capital. At my disposal was the most Westernized house in the village—a square brick room with a wooden door about six feet high, glass windows, and a partition dividing the room into two sections. In it were a few leather chairs—the only chairs in the capital and used mainly for European guests. Till I arrived, this special hut was occupied by the most important relatives of the Ingwenyama on their state calls to the capital.\n\nFrom Loƃamba I travelled to various principalities, and in Swazi society it was taken for granted that, except when I went to a ceremony in a commoner’s family, I should stay in the homestead of the chief. ‘At the homes of the great appear the laws of our people’, Umnyakaza Gweƃu, my retainer, often explained. ‘The chief alone can arrange for you to see all you wish and call anyone to speak to you.’ The co-operation I received from the subjects depended largely on the character of the chiefs.\n\nUmnyakaza was ‘given me’ by Sobhuza as my umfana. The basic meaning of umfana is ‘boy’; in the context of political relations it is a subject bound by personal loyalty. His position is very different from that of a servant to a European. The umfana becomes a member of the over-lord’s intimate circle of dependents, regards him as a father and is treated much like a son. Umnyakaza, a warrior from Sobhuza’s own bodyguard, acted as my teacher, interpreter, cook, and travelling companion. In addition to an unusually extensive Swazi and Zulu vocabulary, he had a grasp of Sesotho, spoke a graphic, ungrammatical English, a smattering of Afrikaans, and a few words of Portuguese. Intelligent and neurotic, with moods veering from sullen depression to unrestrained gaiety, he believed he was possessed of spirits, and when last I heard of him, he was roving the hills, undergoing the painful training of a diviner. In addition to Umnyakaza, who went everywhere with me and worked for me in Johannesburg for six months, Sobhuza selected other assistants and companions for special occasions.\n\nDespite the open friendship of Sobhuza, the dominant attitude towards me, especially the attitude of the semi-educated Swazi, was fear and suspicion; they were afraid that I was a spy—a European who had ingratiated her way into the confidence of the rulers in order to betray them later. I was maƃalana, a scribe; in my right hand I held the most dangerous of all spears, the pen, and in my left an impenetrable shield, my notebook. I was introduced by the governor of the capital to the council of the nation as ‘a European brought by the Lion (Sobhuza). Fear her, respect her. Forget not she is a European. The King says her work is to show we are not wild animals, we do not live in the mountains, we have our laws. Do not trouble her.’ Sobhuza’s patronage made the people superficially friendly, but it was a hard task to win their confidence. As a woman once said, pityingly, ‘We deceive you like anything because you are white.’\n\nI established intimate contact with a limited circle of people, and these I used as my main informants. The rest of the community were actors in the situations that are the laboratory experiments of the anthropologist: I wrote down words and watched their behaviour, but the individuals themselves were of little assistance for detailed discussions, since I had not broken down their reserve, antagonism, and suspicion. In selecting cases for intensive interviewing, I bore in mind factors of birth, education, age, and religious belief.\n\nTo obtain information, I used the techniques of observation, genealogies, texts, essays set to schoolchildren, interviews, letters from Swazi to each other and to me, and questionnaires. I have used the orthography decided upon by a conference held in 1933, except for the spelling of occasional proper names which are more familiar in other forms, e.g. Sobhuza instead of Sobuza.\n\nIt was essential to learn the language as quickly and thoroughly as possible. Most Swazi know little or no English; the few who speak it fluently still use Swazi in their homes. Educated Swazi preferred to write their texts for me in Zulu (the dialect related to Swazi and used in the schools) rather than in English. English is a foreign tongue dealing with foreign concepts, and when a man speaks English his behaviour and mode of thought seem to change. A Swazi teacher once commented ‘I only enjoy selling cattle when I speak English.’ The significance of this remark is appreciated when one knows the reluctance of the average Swazi to part with his cattle. The process of learning Swazi was of great assistance to me, for seeing a European struggle to acquire their language seemed to give people a certain satisfaction and pleasure, while I think that teaching it to me gave them a sense of importance. They were tolerant of blunders, proud of progress, and they expressed their joy when they did not constantly have to repeat and explain their statements. Then only did they themselves speak freely and not in a peculiar garbled language (a parallel of the European’s pidgin English), which they thought was easier for me to understand.\n\nIt was also necessary for me to grasp other tools of their culture in order to break down the barrier between black and white. I learned to grind grain and make beer; I participated in dancing, singing, the judging of cases, and so on. Often I identified myself with a particular section of actors: at wedding ceremonies I went as a member sometimes of the bride’s and sometimes of the groom’s group; sometimes with the mother-in-law, sometimes with the sisters; at work parties I sometimes sat and distributed food with the host, and sometimes toiled with the workers. When I started field work, I was only allowed to join in the activities of the girls; after my marriage a new status was mine, and wives considered me their equal and treated me as a confidante. As a woman the sphere of my participation was restricted and my data on certain topics reflects this. Just as each individual has only a circumscribed knowledge of his culture, so each status group has its bias and limitations.\n\nComplete identification with the Swazi was neither possible nor, from the point of view of obtaining a comprehensive picture of Swazi life, desirable or necessary. In the Protectorate black and white are closely interdependent. To understand modern Swazi culture, it is necessary to study situations of black and white co-operation, antagonism, and segregation, and the direction of European control. The two colour groups are interdependent, but distinct in culture and interests. To have ‘gone native’ would have ruined any chance of obtaining data from most of the Europeans.\n\nThe anthropologist is inevitably an influence in the lives of the natives, and vice versa. Through me a number of Swazi saw for the first time a typewriter, camera, petrol lamp, collapsible bath, and other material elements of Western civilization. The headmaster of the national school and I, on Sobhuza’s request, took about forty children to the Empire Exhibition in Johannesburg (1936), where they gazed with wonder on a new world. Apart from goods introduced or increased by me, I, as an anthropologist, was used as a source of knowledge on European modes of thought and action. Questions put to informants were returned—with interest. Moreover, I was in a position different from that usually held by the European. I did not blame, try to convert, or seek labourers. I represented a type with whom the Swazi are rarely in contact—the liberal intellectual. The greatest honour shown me by the Swazi was when Sobhuza and his Councillors asked me to become ‘headmaster’ of the Swazi National School during the absence, on active service, of Mr. T. Keen.\n\nOn entering any community a new arrival is automatically assigned a ‘place’. No man or woman can remain in complete isolation; he (or she) is forced to participate to some degree in the life around. Nor can a community admit within its bounds any member who acts without reference to his (or her) fellow men.\n\nA stranger is catalogued on arrival. In Swaziland the first and most important quality noted is skin colour. Everyone falls automatically into the ‘white’, ‘black’, or ‘coloured’ group, and is expected to conform to the attitudes of that group. Throughout the book, therefore, I use the term ‘white’ as synonymous with Europeans; ‘black’ with African, native, and Bantu; ‘coloured’ with Eur-African (the result of miscegenation between Africans and Europeans, and also between coloureds, Africans, or Europeans, as well as of unions within the coloured group itsel.f) Secondly, obvious economic factors such as type of equipment, make of car, and spending power, affect the classification. Thirdly, different Churches in this small ‘Christian country’ create their own categories of believer and heathen. Fourthly, in the backward Protectorate, occupations are limited and there is both a jealous monopoly of existing trades and a suspicion of ‘the specialist’, more especially one whose calling is unfamiliar. The anthropologist, in the same way as government official, chief, trader, or anyone else, is accorded a definite position in the society he investigates. Anthropologists were no novelty to Europeans in Swaziland, but each anthropologist evoked specific reactions. Finally, characteristics such as nationality, sex, education, age, evoke fairly stereotyped patterns of behaviour.\n\nThe reactions are not uniform; they vary with different classes of the population. By class I mean, in this book, a group distinguished from others by economic and social standards. The Europeans in Swaziland fall roughly into three classes: the upper—leading government officials, professional men, big traders, prosperous landowners, and mine managers; the middle—small traders, farm managers, and lower Civil Servants; and the lower—labelled the ‘poor whites’. The Swazi are not yet stratified into economic classes, though there is a growing tendency towards this division. In their own society they differentiate primarily the noble-born from the commoner.\n\nAssociational interests, interests of a group or groups organized for particular purposes, also affect the attitudes towards the anthropologist. Government officials considered research might assist administration. Farmers and miners were suspicious lest I disorganize labour, and certain missionaries read into my work an attempt to revive traditional religious practices.\n\nThe anthropologist reacts according to his own training and interests to the people among whom he works. This inevitably affects both the facts he selects from the welter of data he records and the interpretation he gives to them. I am handicapped by not being able to publish certain data: my friendship with Sobhuza gave me important information that I bound myself not to disclose. Secondly, I am prevented from using certain documents for fear of being involved in cases of defamation. Thirdly, some official correspondence was shown to me, provided that I did not make it public. Fourthly, and this is most important, my own outlook has undoubtedly affected my interpretation of the facts. This does not mean that I came to Swaziland to prove a preconceived thesis. The process of scientific rationalization is not so conscious.\n\nOriginally I intended to write a general monograph. I collected innumerable facts and fitted them into stereotyped headings—Economics, Politics, Religion, Magic, and so on. After a few months in the field, the ‘pattern’ of the culture slowly emerged for me. Unfortunately, I persevered in collecting all the usual material of an ethnographic account. Even after I left Swaziland I devoted some months to forcing these facts into the artificial chapters of a standard monograph. Finally, I decided to write on what appeared to me the essential orientation of Swazi life— rank. The question arose: Did my evaluation of the facts agree with that of the Swazi? I discussed the matter with informants in Johannesburg; the problem when formulated was an intellectual abstraction that they had not considered. I discussed specific situations and posed definite questions. The final interpretation was mine as a sociologist. My facts, I hope, will not be challenged; my assessment may. No human being can be objective in his interpretation and evaluation of social facts; the colour, the class, the creed directs thought and classification. Anthropological doctrines have time and again been proved to reflect social currents, for anthropology deals with crucial issues in society and anthropologists themselves are involved in these issues. All the investigator can do is to attempt to guard against arbitrarily selecting facts which he is aware can be refuted by the facts he has consciously omitted.\n\nThis book will meet with criticism, not only by Europeans, but also by educated Swazi. Anthropologists in most parts of the world are no longer describing the lives of illiterates, unable to speak for themselves or to judge the books to which they contribute the living substance.\n\n2. The Scope of the Book\n\nThis book is not an all-embracing monograph on Swazi culture. The material is co-ordinated and presented from the approach of rank and status—the social evaluation of individuals and groups. Much of the data that I collected has therefore been omitted as irrelevant, and will be published separately. For further information on the Swazi, the reader is referred to books and articles cited in the bibliography.\n\nNor does this volume cover the whole rank situation in modern Swaziland. It deals exclusively with the traditional orientation, and thereby involves an arbitrary limitation. To complete the picture, we require a description of European domination, accomplished by European culture agents—administrators, farmers, missionary recruiters, and traders—and the changing alinements which they caused in the traditional structure. This section has been omitted for reasons of space, and will be published independently.\n\nRank is measurement of social status. A graded scale of individuals and of social groups exists in every society. Almost any conceivable factors—wealth, birth, colour, age, sex, occupation, creed, ability—may be culturally selected as bases for discrimination. The factors vary in force and recognized importance; they are integrated in such a way as to form a coherent system characterized by dominant emphasis. The stress may be on one or more factors, associated with similar or diverse groups. Within the social framework every action is intelligible and is evaluated by the people concerned.\n\nA study of the Swazi in the twentieth century is largely an analysis of the privileges of pigmentation and pedigree and of the way in which they affect and are affected by other cultural principles. Rank controls the behaviour of individuals and groups; it determines their rights, obligations, and attitudes. In any social situation the modes of action and of thought depend primarily on whether the actors are black or white, nobles or commoners, men or women, adults or children, specialists or laymen, married or unmarried, or fall into any other category of relationships evaluated by the people in the society. Every human being combines a number of such categories or statuses and co-ordinates them psychologically as best he can. Within the course of a few hours, one and the same man may act as father, son, headman, specialist in ritual, and judge. For each occasion the pattern is more or less culturally determined and the response fairly automatic, though sometimes there are conflicting status obligations which each individual resolves, only partly, for himself or herself.\n\nThe average individual is never conscious either of the sum total of the status norms in his society or of his own limitations. He has a distorted vision and a partial knowledge dictated by his participation in, rather than his observation of, his cultural surroundings. A European and a native, a king and a slave, a man and a woman, often hold different points of view because each is a stranger in the world of the other. The transitory existence of individuals is usually soon forgotten and the ritual that is enacted on their deaths marks them primarily as status types in a continuous culture scheme.\n\nWithin the scheme there must be some consistency. It would be an impossible situation if wealth gave power, yet natives, recognized as the inferior group, owned the best property in the country; or if pedigree bestowed honour in politics while religion denied any benefits to the aristocracy of birth. Consistency is, however, rarely the result of conscious effort: a planned society is unknown to most peoples, and even leaders who have deliberately introduced radical changes have not per..."}, {"url": "https://www.ebooks.com/en-us/book/96174302/an-african-aristocracy/hilda-kuper/", "page_content": "Page count shown is an approximation provided by the publisher. The actual page count will vary based on various factors such your device's screen size and font-size.\n\nOriginally published in 1947 and reprinted with a new preface in 1961, this book is based on field studies and gives an account of the social organization of the Swazi, wiith special reference to the aristocratic structure of their society and the way in which birth and rank determine social relationships and activities. The book provides a historical picture of the Swazi and the part played by them during the period of European expansion in British and Boer conflicts in South Africa. The economic structure of a society based on agriculture and the influence exerted over every aspect of social activity by the conservative and aristocratic political hierarchy is analyzed and post-War changes and their effect upon the Swazi also reviewed.\n\nThis title will be released on . This eBook is no longer available for sale. This eBook is not available in your country.\n\nYou can read this ebook online in a web browser, without downloading anything or installing software.\n\nAfter you've bought this ebook, you can choose to download either the PDF version or the ePub, or both.\n\nThis ebook is available in:\n\nThis ebook is available in file types:\n\nYou can read this eBook on any device that supports DRM-free EPUB or DRM-free PDF format.\n\nThe publisher has supplied this book in DRM Free form with digital watermarking.\n\nDigital Rights Management (DRM)\n\nThe publisher has supplied this book in encrypted form, which means that you need to install free software in order to unlock and read it.\n\nRequired software\n\nTo read this ebook on a mobile device (phone or tablet) you'll need to install one of these free apps:\n\nTo download and read this eBook on a PC or Mac:"}, {"url": "https://www.bookshare.org/browse/book/3581058", "page_content": "An African Aristocracy: Rank Among the Swazi\n\nView larger image By: Hilda Kuper Sign Up Now! Already a Member? Log In\n\nYou must be logged into Bookshare to access this title. Learn about membership options, or view our freely available titles. Synopsis Originally published in 1947 and reprinted with a new preface in 1961, this book is based on field studies and gives an account of the social organization of the Swazi, wiith special reference to the aristocratic structure of their society and the way in which birth and rank determine social relationships and activities. The book provides a historical picture of the Swazi and the part played by them during the period of European expansion in British and Boer conflicts in South Africa. The economic structure of a society based on agriculture and the influence exerted over every aspect of social activity by the conservative and aristocratic political hierarchy is analyzed and post-War changes and their effect upon the Swazi also reviewed. Copyright: 1961 Book Details Book Quality: Publisher Quality Book Size: 252 Pages ISBN-13: 9780429997969 Related ISBNs: 9781138586123, 9781138585508, 9780429504792 Publisher: Taylor and Francis Date of Addition: 08/23/20 Copyrighted By: International African Institute Adult content: No Language: English Has Image Descriptions: No Categories: Nonfiction , Social Studies Submitted By: Bookshare Staff Usage Restrictions: This is a copyrighted book. Reviews No Rating Yet No Rating Yet\n\n"}, {"url": "https://africasacountry.com/2023/04/reading-list-joel-marie-cabrita", "page_content": "My new biography of Regina Gelana Twala tells the story of a woman written out of history. Twala (1908-1968) was a remarkable woman—a political activist in South Africa and Eswatini, she co-founded Eswatini’s first political party and represented the country at pan-African gatherings in Nkrumah’s Ghana. She was also a literary giant, writing as many as five manuscripts (all unpublished, and all but one lost to us). Twala additionally wrote hundreds of newspaper and magazine articles. However, despite her achievements, Twala is today forgotten by everyone outside her immediate family.\n\nIn Written Out: The Silencing of Regina Gelana Twala, I answer the question as to why such a talented woman has been forgotten by history. The answer is multi-faceted, invoking prejudices of both race and gender. Politicians, editors, and academics all conspired to block Twala from publishing her work and ensured that her legacy was erased after her death in 1968.\n\nGiven that my biography of Twala deals with a formidable intellectual who has consistently been denied recognition, I would like to think not about my own reading list, but rather about the books that shaped Regina Twala’s life and career. Not all of these books were positive influences. Formative books and reading experiences could constrain, silence, and side-line as well as they could emancipate and inspire. In a 1938 letter to her second husband, Dan Twala, Twala made passing reference to “that library of mine.” What might some of the books in “that library” have been?\n\nThe Bible: The Bible would undoubtedly have to be my top pick for Twala. She was born, raised, and educated in the Methodist mission station of Indaleni, near Richmond in then Natal, and she attended the Congregationalist Adams College. She would probably have read the American missionary 1883 isiZulu translation of the Bible (a revised version would only be published in the 1950s). Daily Bible reading shaped Twala’s 60 years of life. As was the case for many educated South Africans of her generation, Twala thought biblically; her language, idioms, and vocabulary were all inflected with the rhythms and resonances of the Judeo-Christian canon. We can’t understand Twala without appreciating the significance of her daily soaks in scriptural texts, and the way in which this book shaped her politics, her creativity, and even her love life.\n\nBantu World: Writers like Twala were often denied opportunities to publish books. Instead, their publishing outlet was in supposedly ephemeral platforms, such as newspapers. In fact, one of Twala’s most formative reading experiences was her immersion in weekly newspapers—more affordable to purchase than books. They contained new literature as serialized novels and short stories, and they offered political commentary and news. During the decades Twala lived in Natal and Johannesburg, her favorite newspaper was the popular Bantu World. Twala weekly pored over its scintillating columns, read its Women’s Pages, absorbed its news items, and stayed abreast of gossip with its Who’s Who section. She regularly clipped out articles she found particularly interesting. By the mid-1930s, Twala had turned from reader to writer, penning a column under the pseudonym of “Mademoiselle” that would make her one of the newspaper’s most popular correspondents.\n\nNatal Code of Native Law: This slim volume (republished in 1932 by the government printer) was unfortunately one that Twala was intimately familiar with. The Natal Code set out the legislation that governed Black Africans’ lives in the province. It established a parallel system of legislation to European law, trapping Africans in “traditional” norms and providing the legal structure that justified their subordination. Twala’s early life in South Africa was an exercise in negotiating its strictures. As a young woman she applied for “emancipation” from the Code on the grounds of her education (invoking its Section 28). While seeking her separation from her first husband, Percy Khumalo, she was governed by its draconian dictates regarding African marriage and divorce. In an argument with her lover, Dan Twala, she scathingly accused him of not grasping the legal intricacies of her unhappy predicament: “You make me sick. I am not going to send you the Natal Code because you don’t understand the technic [sic] of the law. You are a cow so far as that is concerned.”\n\nPorgy: Twala first read the white Southerners Dorothy and DuBose Heyward’s play Porgy in the late 1930s (and the play was itself an adaption of DuBose Heyward’s 1925 novel of the same name and would later become the material for George Gershwin’s famous opera, Porgy and Bess). Twala was one of many South Africans who read and admired the play in this decade. While Black Americans criticized the play’s reiteration of tropes of Black criminality, the reception was far warmer amongst South African readers who found its portrayal of urban vice and downfall resonated with many of their own concerns about cities like Johannesburg. Twala wholeheartedly empathized with its tale of doomed love, finding Bess and Porgy’s predicament a sad mirror of her own affair with Dan Twala. Throughout 1938 and 1939, Twala worked on extracting and adapting the play for performance by Dan’s Bantu Dramatic Society in Johannesburg.\n\nAn African Aristocracy: The South African anthropologist Hilda Kuper wrote An African Aristocracy: Rank Among the Swazi in 1947. The book quickly cemented Kuper’s reputation as the foremost ethnographer of the emaSwati people. Yet Twala’s changing relationship with African Aristocracy provides a microcosm of her own evolution as a scholar of Swati culture. Initially, Twala was deferential to the book’s expertise, respectfully citing Kuper in her own written work. Yet by the 1960s, Twala had no patience with white scholars who claimed expertise on African societies In 1964, she publicly dismissed Kuper’s book as “dated,”surely a swipe at the fact that Kuper had at this point not visited Eswatini in 20 years. Kuper, however, would get her revenge on her old student. After Twala’s death in 1968, Kuper refused a plea to help publish Twala’s final manuscript. Instead, Kuper buried the work in her UCLA study. I came across this manuscript a few years ago while going through Kuper’s personal papers in the UCLA archive. I would twin these two books—African Aristocracy with Twala’s final unpublished book—as an indictment of the difficulties Black female scholars like Twala faced in comparison to the acclaim that far more easily greeted their white counterparts. Even more pointedly, the reputation of a book like African Aristocracy was achieved by Hilda Kuper squashing the careers of rival scholars like Twala."}, {"url": "https://www.perlego.com/book/1480996/an-african-aristocracy-rank-among-the-swazi-pdf", "page_content": "1. Conditions of Work and the Status of the Investigator\n\nI MET Sobhuza II, Chief of the ‘primitive people’ I was to study, attending the New Education Conference at the Witwatersrand University in July 1934. Sobhuza II, Ingwenyama (Lion) of the Swazi nation, had travelled nearly 300 miles from his home in the Protectorate to hear a series of lectures in English by world-famous educationalists and anthropologists.\n\nMost educated Africans, more particularly detribalized Africans and men with little standing in tribal life, distrust anthropology. They see in it a weapon to keep natives in their ‘traditional milieu’ (arbitrarily stripped of actions judged ‘barbarous’ by Europeans) and to prevent them on pseudo-scientific grounds—retaining the ‘soul of the people’, their ‘primitive mentality’—from assimilating European culture. Sobhuza, on the other hand, is interested in anthropology; he has read a number of books on the subject, subscribes to anthropological journals, enjoys descriptions of the customs of other people, and is proud of his own. He one day explained, ‘Anthropology makes possible comparison and selection of lines of further development. European culture is not all good; ours is often better. We must be able to choose how to live, and for that we must see how others live. I do not want my people to be imitation Europeans, but to be respected for their own laws and customs.’ In the hierarchical Swazi society, the support of the Ingwenyama is an essential prerequisite for the acceptance of any stranger, and without his sympathetic assistance anthropological research would have been difficult.\n\nI spent over two years in the Swaziland Protectorate. My first visit, beginning October 1934, lasted sixteen months. I returned in September 1936 for another eight months’ intensive research. Since then I have been back for short periods to check up data, to witness ceremonies, and to pay friendly visits. In Johannesburg, where I have lived since I left Swaziland, I worked with a number of Swazi, some newcomers from the country, others old city-dwellers.\n\nIn the Protectorate I stayed in native homesteads. My headquarters was Loƃamba, the capital. At my disposal was the most Westernized house in the village—a square brick room with a wooden door about six feet high, glass windows, and a partition dividing the room into two sections. In it were a few leather chairs—the only chairs in the capital and used mainly for European guests. Till I arrived, this special hut was occupied by the most important relatives of the Ingwenyama on their state calls to the capital.\n\nFrom Loƃamba I travelled to various principalities, and in Swazi society it was taken for granted that, except when I went to a ceremony in a commoner’s family, I should stay in the homestead of the chief. ‘At the homes of the great appear the laws of our people’, Umnyakaza Gweƃu, my retainer, often explained. ‘The chief alone can arrange for you to see all you wish and call anyone to speak to you.’ The co-operation I received from the subjects depended largely on the character of the chiefs.\n\nUmnyakaza was ‘given me’ by Sobhuza as my umfana. The basic meaning of umfana is ‘boy’; in the context of political relations it is a subject bound by personal loyalty. His position is very different from that of a servant to a European. The umfana becomes a member of the over-lord’s intimate circle of dependents, regards him as a father and is treated much like a son. Umnyakaza, a warrior from Sobhuza’s own bodyguard, acted as my teacher, interpreter, cook, and travelling companion. In addition to an unusually extensive Swazi and Zulu vocabulary, he had a grasp of Sesotho, spoke a graphic, ungrammatical English, a smattering of Afrikaans, and a few words of Portuguese. Intelligent and neurotic, with moods veering from sullen depression to unrestrained gaiety, he believed he was possessed of spirits, and when last I heard of him, he was roving the hills, undergoing the painful training of a diviner. In addition to Umnyakaza, who went everywhere with me and worked for me in Johannesburg for six months, Sobhuza selected other assistants and companions for special occasions.\n\nDespite the open friendship of Sobhuza, the dominant attitude towards me, especially the attitude of the semi-educated Swazi, was fear and suspicion; they were afraid that I was a spy—a European who had ingratiated her way into the confidence of the rulers in order to betray them later. I was maƃalana, a scribe; in my right hand I held the most dangerous of all spears, the pen, and in my left an impenetrable shield, my notebook. I was introduced by the governor of the capital to the council of the nation as ‘a European brought by the Lion (Sobhuza). Fear her, respect her. Forget not she is a European. The King says her work is to show we are not wild animals, we do not live in the mountains, we have our laws. Do not trouble her.’ Sobhuza’s patronage made the people superficially friendly, but it was a hard task to win their confidence. As a woman once said, pityingly, ‘We deceive you like anything because you are white.’\n\nI established intimate contact with a limited circle of people, and these I used as my main informants. The rest of the community were actors in the situations that are the laboratory experiments of the anthropologist: I wrote down words and watched their behaviour, but the individuals themselves were of little assistance for detailed discussions, since I had not broken down their reserve, antagonism, and suspicion. In selecting cases for intensive interviewing, I bore in mind factors of birth, education, age, and religious belief.\n\nTo obtain information, I used the techniques of observation, genealogies, texts, essays set to schoolchildren, interviews, letters from Swazi to each other and to me, and questionnaires. I have used the orthography decided upon by a conference held in 1933, except for the spelling of occasional proper names which are more familiar in other forms, e.g. Sobhuza instead of Sobuza.\n\nIt was essential to learn the language as quickly and thoroughly as possible. Most Swazi know little or no English; the few who speak it fluently still use Swazi in their homes. Educated Swazi preferred to write their texts for me in Zulu (the dialect related to Swazi and used in the schools) rather than in English. English is a foreign tongue dealing with foreign concepts, and when a man speaks English his behaviour and mode of thought seem to change. A Swazi teacher once commented ‘I only enjoy selling cattle when I speak English.’ The significance of this remark is appreciated when one knows the reluctance of the average Swazi to part with his cattle. The process of learning Swazi was of great assistance to me, for seeing a European struggle to acquire their language seemed to give people a certain satisfaction and pleasure, while I think that teaching it to me gave them a sense of importance. They were tolerant of blunders, proud of progress, and they expressed their joy when they did not constantly have to repeat and explain their statements. Then only did they themselves speak freely and not in a peculiar garbled language (a parallel of the European’s pidgin English), which they thought was easier for me to understand.\n\nIt was also necessary for me to grasp other tools of their culture in order to break down the barrier between black and white. I learned to grind grain and make beer; I participated in dancing, singing, the judging of cases, and so on. Often I identified myself with a particular section of actors: at wedding ceremonies I went as a member sometimes of the bride’s and sometimes of the groom’s group; sometimes with the mother-in-law, sometimes with the sisters; at work parties I sometimes sat and distributed food with the host, and sometimes toiled with the workers. When I started field work, I was only allowed to join in the activities of the girls; after my marriage a new status was mine, and wives considered me their equal and treated me as a confidante. As a woman the sphere of my participation was restricted and my data on certain topics reflects this. Just as each individual has only a circumscribed knowledge of his culture, so each status group has its bias and limitations.\n\nComplete identification with the Swazi was neither possible nor, from the point of view of obtaining a comprehensive picture of Swazi life, desirable or necessary. In the Protectorate black and white are closely interdependent. To understand modern Swazi culture, it is necessary to study situations of black and white co-operation, antagonism, and segregation, and the direction of European control. The two colour groups are interdependent, but distinct in culture and interests. To have ‘gone native’ would have ruined any chance of obtaining data from most of the Europeans.\n\nThe anthropologist is inevitably an influence in the lives of the natives, and vice versa. Through me a number of Swazi saw for the first time a typewriter, camera, petrol lamp, collapsible bath, and other material elements of Western civilization. The headmaster of the national school and I, on Sobhuza’s request, took about forty children to the Empire Exhibition in Johannesburg (1936), where they gazed with wonder on a new world. Apart from goods introduced or increased by me, I, as an anthropologist, was used as a source of knowledge on European modes of thought and action. Questions put to informants were returned—with interest. Moreover, I was in a position different from that usually held by the European. I did not blame, try to convert, or seek labourers. I represented a type with whom the Swazi are rarely in contact—the liberal intellectual. The greatest honour shown me by the Swazi was when Sobhuza and his Councillors asked me to become ‘headmaster’ of the Swazi National School during the absence, on active service, of Mr. T. Keen.\n\nOn entering any community a new arrival is automatically assigned a ‘place’. No man or woman can remain in complete isolation; he (or she) is forced to participate to some degree in the life around. Nor can a community admit within its bounds any member who acts without reference to his (or her) fellow men.\n\nA stranger is catalogued on arrival. In Swaziland the first and most important quality noted is skin colour. Everyone falls automatically into the ‘white’, ‘black’, or ‘coloured’ group, and is expected to conform to the attitudes of that group. Throughout the book, therefore, I use the term ‘white’ as synonymous with Europeans; ‘black’ with African, native, and Bantu; ‘coloured’ with Eur-African (the result of miscegenation between Africans and Europeans, and also between coloureds, Africans, or Europeans, as well as of unions within the coloured group itsel.f) Secondly, obvious economic factors such as type of equipment, make of car, and spending power, affect the classification. Thirdly, different Churches in this small ‘Christian country’ create their own categories of believer and heathen. Fourthly, in the backward Protectorate, occupations are limited and there is both a jealous monopoly of existing trades and a suspicion of ‘the specialist’, more especially one whose calling is unfamiliar. The anthropologist, in the same way as government official, chief, trader, or anyone else, is accorded a definite position in the society he investigates. Anthropologists were no novelty to Europeans in Swaziland, but each anthropologist evoked specific reactions. Finally, characteristics such as nationality, sex, education, age, evoke fairly stereotyped patterns of behaviour.\n\nThe reactions are not uniform; they vary with different classes of the population. By class I mean, in this book, a group distinguished from others by economic and social standards. The Europeans in Swaziland fall roughly into three classes: the upper—leading government officials, professional men, big traders, prosperous landowners, and mine managers; the middle—small traders, farm managers, and lower Civil Servants; and the lower—labelled the ‘poor whites’. The Swazi are not yet stratified into economic classes, though there is a growing tendency towards this division. In their own society they differentiate primarily the noble-born from the commoner.\n\nAssociational interests, interests of a group or groups organized for particular purposes, also affect the attitudes towards the anthropologist. Government officials considered research might assist administration. Farmers and miners were suspicious lest I disorganize labour, and certain missionaries read into my work an attempt to revive traditional religious practices.\n\nThe anthropologist reacts according to his own training and interests to the people among whom he works. This inevitably affects both the facts he selects from the welter of data he records and the interpretation he gives to them. I am handicapped by not being able to publish certain data: my friendship with Sobhuza gave me important information that I bound myself not to disclose. Secondly, I am prevented from using certain documents for fear of being involved in cases of defamation. Thirdly, some official correspondence was shown to me, provided that I did not make it public. Fourthly, and this is most important, my own outlook has undoubtedly affected my interpretation of the facts. This does not mean that I came to Swaziland to prove a preconceived thesis. The process of scientific rationalization is not so conscious.\n\nOriginally I intended to write a general monograph. I collected innumerable facts and fitted them into stereotyped headings—Economics, Politics, Religion, Magic, and so on. After a few months in the field, the ‘pattern’ of the culture slowly emerged for me. Unfortunately, I persevered in collecting all the usual material of an ethnographic account. Even after I left Swaziland I devoted some months to forcing these facts into the artificial chapters of a standard monograph. Finally, I decided to write on what appeared to me the essential orientation of Swazi life— rank. The question arose: Did my evaluation of the facts agree with that of the Swazi? I discussed the matter with informants in Johannesburg; the problem when formulated was an intellectual abstraction that they had not considered. I discussed specific situations and posed definite questions. The final interpretation was mine as a sociologist. My facts, I hope, will not be challenged; my assessment may. No human being can be objective in his interpretation and evaluation of social facts; the colour, the class, the creed directs thought and classification. Anthropological doctrines have time and again been proved to reflect social currents, for anthropology deals with crucial issues in society and anthropologists themselves are involved in these issues. All the investigator can do is to attempt to guard against arbitrarily selecting facts which he is aware can be refuted by the facts he has consciously omitted.\n\nThis book will meet with criticism, not only by Europeans, but also by educated Swazi. Anthropologists in most parts of the world are no longer describing the lives of illiterates, unable to speak for themselves or to judge the books to which they contribute the living substance.\n\n2. The Scope of the Book\n\nThis book is not an all-embracing monograph on Swazi culture. The material is co-ordinated and presented from the approach of rank and status—the social evaluation of individuals and groups. Much of the data that I collected has therefore been omitted as irrelevant, and will be published separately. For further information on the Swazi, the reader is referred to books and articles cited in the bibliography.\n\nNor does this volume cover the whole rank situation in modern Swaziland. It deals exclusively with the traditional orientation, and thereby involves an arbitrary limitation. To complete the picture, we require a description of European domination, accomplished by European culture agents—administrators, farmers, missionary recruiters, and traders—and the changing alinements which they caused in the traditional structure. This section has been omitted for reasons of space, and will be published independently.\n\nRank is measurement of social status. A graded scale of individuals and of social groups exists in every society. Almost any conceivable factors—wealth, birth, colour, age, sex, occupation, creed, ability—may be culturally selected as bases for discrimination. The factors vary in force and recognized importance; they are integrated in such a way as to form a coherent system characterized by dominant emphasis. The stress may be on one or more factors, associated with similar or diverse groups. Within the social framework every action is intelligible and is evaluated by the people concerned.\n\nA study of the Swazi in the twentieth century is largely an analysis of the privileges of pigmentation and pedigree and of the way in which they affect and are affected by other cultural principles. Rank controls the behaviour of individuals and groups; it determines their rights, obligations, and attitudes. In any social situation the modes of action and of thought depend primarily on whether the actors are black or white, nobles or commoners, men or women, adults or children, specialists or laymen, married or unmarried, or fall into any other category of relationships evaluated by the people in the society. Every human being combines a number of such categories or statuses and co-ordinates them psychologically as best he can. Within the course of a few hours, one and the same man may act as father, son, headman, specialist in ritual, and judge. For each occasion the pattern is more or less culturally determined and the response fairly automatic, though sometimes there are conflicting status obligations which each individual resolves, only partly, for himself or herself.\n\nThe average individual is never conscious either of the sum total of the status norms in his society or of his own limitations. He has a distorted vision and a partial knowledge dictated by his participation in, rather than his observation of, his cultural surroundings. A European and a native, a king and a slave, a man and a woman, often hold different points of view because each is a stranger in the world of the other. The transitory existence of individuals is usually soon forgotten and the ritual that is enacted on their deaths marks them primarily as status types in a continuous culture scheme.\n\nWithin the scheme there must be some consistency. It would be an impossible situation if wealth gave power, yet natives, recognized as the inferior group, owned the best property in the country; or if pedigree bestowed honour in politics while religion denied any benefits to the aristocracy of birth. Consistency is, however, rarely the result of conscious effort: a planned society is unknown to most peoples, and even leaders who have deliberately introduced radical changes have not per..."}, {"url": "https://www.abebooks.com/9780841905818/African-Aristocracy-Rank-Among-Swazi-0841905819/plp", "page_content": "Kuper, Hilda\n\nPublished by Holmes & Meier Publishers (1980) ISBN 10: 0841905819 ISBN 13: 9780841905818 Used Hardcover Quantity: 1\n\nBook Description Hardcover. Condition: Good. No Jacket. Pages can have notes/highlighting. Spine may show signs of wear. ~ ThriftBooks: Read More, Spend Less. Seller Inventory # G0841905819I3N00\n\nMore information about this seller | Contact this seller"}, {"url": "https://www.amazon.co.uk/African-Aristocracy-Ethnographic-Studies-Century/dp/1138586129", "page_content": "Select Your Cookie Preferences\n\nWe use cookies and similar tools that are necessary to enable you to make purchases, to enhance your shopping experiences and to provide our services, as detailed in our Cookie Notice. We also use these cookies to understand how customers use our services (for example, by measuring site visits) so we can make improvements.\n\nIf you agree, we’ll also use cookies to complement your shopping experience across the Amazon stores as described in our Cookie Notice. This includes using first- and third-party cookies, which store or access standard device information such as a unique identifier. Third parties use cookies for their purposes of displaying and measuring personalised ads, generating audience insights, and developing and improving products. Click ‘Customise Cookies’ to decline these cookies, make more detailed choices, or learn more. You can change your choices at any time by visiting Cookie Preferences, as described in the Cookie Notice. To learn more about how and for what purposes Amazon uses personal information (such as Amazon Store order history), please visit our Privacy Notice."}, {"url": "https://www.ebooks.com/en-us/book/96174302/an-african-aristocracy/hilda-kuper/", "page_content": "Page count shown is an approximation provided by the publisher. The actual page count will vary based on various factors such your device's screen size and font-size.\n\nOriginally published in 1947 and reprinted with a new preface in 1961, this book is based on field studies and gives an account of the social organization of the Swazi, wiith special reference to the aristocratic structure of their society and the way in which birth and rank determine social relationships and activities. The book provides a historical picture of the Swazi and the part played by them during the period of European expansion in British and Boer conflicts in South Africa. The economic structure of a society based on agriculture and the influence exerted over every aspect of social activity by the conservative and aristocratic political hierarchy is analyzed and post-War changes and their effect upon the Swazi also reviewed.\n\nThis title will be released on . This eBook is no longer available for sale. This eBook is not available in your country.\n\nYou can read this ebook online in a web browser, without downloading anything or installing software.\n\nAfter you've bought this ebook, you can choose to download either the PDF version or the ePub, or both.\n\nThis ebook is available in:\n\nThis ebook is available in file types:\n\nYou can read this eBook on any device that supports DRM-free EPUB or DRM-free PDF format.\n\nThe publisher has supplied this book in DRM Free form with digital watermarking.\n\nDigital Rights Management (DRM)\n\nThe publisher has supplied this book in encrypted form, which means that you need to install free software in order to unlock and read it.\n\nRequired software\n\nTo read this ebook on a mobile device (phone or tablet) you'll need to install one of these free apps:\n\nTo download and read this eBook on a PC or Mac:"}]}