{"Hilda Kuper was a founding member of the International Council of Women of the Darker Races.": [{"url": "https://muse.jhu.edu/article/774533", "page_content": "The International Council of Women of the Darker Races of the World (ICWDR) was founded in 1922 by prominent members of the National Association of Colored Women (NACW). This exclusive council, initially comprising eighteen well-educated and highly respected middle-class African American women, was actively engaged in a variety of political agendas and social reform efforts locally and nationally. Situating discrimination of African Americans across the United States into the larger context of ongoing global European and American racialized colonial oppression and imperialist interventionism, this group of women pursued a Pan-Africanist agenda promoting “racial uplift” by “undermin[ing] American racism within larger global processes of racism, imperialism, and eventually decolonization” (Materson 2009: 36). More specifically, these reformers directed their energies toward a transnational endeavor of raising the racial consciousness of women of “darker complexions” across the globe by creating reading and conversation groups. These groups would “study any question or all questions in a systematic way, relative to the darker races. No matter whether these races are races willing to be affiliated with us or not,” as member Margaret Murray put it, with the aim of fostering solidarity based on shared history as oppressed people “of the darker races” (Washington 1923).\n\nAlthough a majority of the founding members—women such as Mary [End Page 271] Church Terrell; Addie W. Hunton; Mrs. Booker T. Washington, Margaret Murray Washington; Maggie L. Walker; and Mary B. Talbert—were also actively involved in other women’s rights groups such as the International Council of Women, International Alliance of Women / International Women’s Suffrage Alliance, Women’s International League for Peace and Freedom, and the National Association of Colored Women. As Black women they recognized the necessity and importance of a transnational forum that would highlight the shared oppressions of racialized minority women, a focus that existing women’s organizations had yet to address. Expanding W. E. B. Du Bois’s Pan-Africanist approach to include gender as a political issue and organizing strategy, the ICWDR’s members were ambitious and optimistic about the organization’s ability to unify women on a global level and to garner international support for progressive social change that would improve the disadvantaged status of African-descended women worldwide (Rief 2004: 218).\n\nUnfortunately, their membership exclusivity based on social class, along with the extensive responsibilities of council members already committed to various personal, professional, and political causes, ultimately led to the ICWDR disbanding sometime in the early 1940s.1 Nonetheless, although the organization itself faded away, the ideological principles on which it was founded acted as a “transition site between nineteenth-century strategies of racial uplift and newer global race consciousness ideas, [and] was an antecedent to the women of color feminism that would emerge in the late twentieth century” (Materson 2009: 36). The ICWDR archival piece that follows highlights how the internationalist, feminist, antiracist and decolonizing orientations of the council employed strategies that unified, advanced, and sought to address the disadvantaged condition of women of the “darker races” globally. [End Page 272]"}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/kuper-hilda-b-1911-1992", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://yourstory.com/herstory/2022/08/from-kittur-rani-chennamma-to-hilda-kuper-these-women-shaped-history", "page_content": "In every field throughout history, women have made immense contributions. However, their roles have rarely been highlighted. Often due to sexism, or bias towards male perspectives the contributions of women have been given a raw deal. Women that we should have been reading about in our history textbooks were pushed into oblivion. There are even instances of men taking credit for women’s work. From ancient times to recent history, many contributions of women have been discounted and even neglected by the patriarchal society.\n\n\n\n\n\nLet us look at a few women in history who have changed the world in more ways than one:\n\n\n\n\n\nDra. Paulina Luisi:\n\n\n\n\n\nBorn to Argentinian parents, Dra. Paulina Luisi was the first woman in Uruguay to earn the equivalent of a bachelor’s degree. As the first female medical student, she had to face a lot of harassment from her own classmates. Paulina founded the Uruguayan branch of the National Women’s Council in 1916. Uruguay became the second Latin American country to grant full voting rights for women. Luisi, who was in Europe at that time, came back to Uruguay to fight elections. By the 1940s, she was the most important female voice of the Socialist party. She spoke in favour of women’s rights- legal and political.\n\n\n\n\n\nHilda Kuper:\n\n\n\n\n\nBorn in Bulawaya, Rhodesia, and growing up in Johannesburg, South Africa, Kuper’s fieldwork was on the impact of liquor laws on Black women in Johannesburg. Her research expanded to Swaziland and Indian communities in Durban. Her marriage with Leo Kuper and subsequent involvement in non-violent apartheid protests changed the course of her life. She became one of the founders of the Liberal Party which resulted in her being shunted out of South Africa. She worked as a Professor of Anthropology at UCLA. Based on her research, she theorised that Westernization weakened Swazi and Indian South African women.\n\n\n\n\n\nKittur Rani Chennamma:\n\n\n\n\n\nThe Indian Queen of Kittur became a symbol of the independence movement in India because of her rebellion against the British forces. She married Raja Mallasaraja at the age of 15. Chennamma's husband died in 1824 leaving behind a son and an unstable kingdom. Her son also passed the same year, which is when she adopted Shivalingappa as an heir to the throne.\n\n\n\n\n\nAccording to the Doctrine of Lapse, if the ruler of a state dies childless, then the right to rule goes to the State. Chennamma sent a letter to the British pleading her case, but it was turned down. War broke out. Both the forces lost a lot of men, and during the second attack, Chennamma was captured by the British and sent to prison for life. She died on February 2, 1829.\n\n\n\n\n\nBegum Royeka :\n\nShe was a Bengali feminist thinker and political activist from British India (present day Bangladesh). She is considered as a pioneer of women’s liberation in South Asia. She believed that the lack of education for women was the reason for their poor economic standing. Royeka established the first school aimed at Muslim girls in Kolkata. In 1916, she founded the Muslim Women’s Assocation.\n\n\n\n\n\nShe was deeply involved in debates, conferences and speeches regarding the rights of women. BBC ranked Royeka number 6 in BBC’s poll of the ‘Greatest Bengali of all time.’ She wrote a number of poems, essays, novels, short stories, etc., in which she urged women to fight against atrocities and break the cycle of discrimination.\n\n\n\n\n\nJeannette Rankin:\n\nShe was an American women’s rights advocate and politician, and the first woman to hold federal office in the United States. In 1941, she was the only member of Congress who voted against the declaration of war on Japan after the Pearl Harbor incident. She introduced legislation which eventually became the 19th Constitutional Amendment which granted unrestricted voting rights to women in the US. Rankin strongly believed that the corruption prevalent in the United States government during her time was because of the lack of women’s participation.\n\n\n\n\n\nThese women deserve to be better known, and more importantly, deserve to occupy the annals of history with more prominence. Their contributions have been unfairly neglected and downplayed for a long time. Let these stories inspire you to fight for future generations of women. You can counteract the overshadowing of these important women by reading about them and discussing them with your peers."}, {"url": "https://www.taylorfrancis.com/books/mono/10.4324/9781315306476/shona-ndebele-southern-rhodesia-hilda-kuper-hughes-van-velsen", "page_content": "Routledge is proud to be re-issuing this landmark series in association with the International African Institute. The series, published between 1950 and 1977, brings together a wealth of previously un-co-ordinated material on the ethnic groupings and social conditions of African peoples.\n\nConcise, critical and (for its time) accurate, the Ethnographic Survey contains sections as follows:\n\nPhysical Environment\n\nLinguistic Data\n\nDemography\n\nHistory & Traditions of Origin\n\nNomenclature\n\nGrouping\n\nCultural Features: Religion, Witchcraft, Birth, Initiation, Burial\n\nSocial & Political Organization: Kinship, Marriage, Inheritance, Slavery, Land Tenure, Warfare & Justice\n\nEconomy & Trade\n\nDomestic Architecture\n\nEach of the 50 volumes will be available to buy individually, and these are organized into regional sub-groups: East Central Africa, North-Eastern Africa, Southern Africa, West Central Africa, Western Africa, and Central Africa Belgian Congo.\n\nThe volumes are supplemented with maps, available to view on routledge.com or available as a pdf from the publishers."}, {"url": "https://www.britannica.com/topic/International-Council-of-Women", "page_content": "International Council of Women (ICW), organization, founded in 1888, that works with agencies around the world to promote health, peace, equality, and education.\n\nFounded by Susan B. Anthony, May Wright Sewell, and Frances Willard, among others, the ICW held its first convention March 25–April 1, 1888, in Washington, D.C. Nine countries—England, Ireland, France, Norway, Denmark, Finland, India, Canada, and the United States—sent 49 delegates. Though the council’s primary goal was the advancement of women, it did not demand woman suffrage so as not to alienate the more conservative members. A constitution was drafted with international assemblies to be held every five years and national meetings occurring every three. The early international conferences were extensively covered by the press, especially the 1899 meeting in which Anthony met Queen Victoria.\n\nIn the 1920s the ICW and its standing committees worked with the League of Nations, and following World War II it became a consultant to the United Nations. With more than 70 member countries, the ICW has been headquartered in Paris since 1963. Officers are elected by delegates from national boards at triennial international congresses. The council is affiliated with numerous agencies, including, from 1981, the World Health Organization."}, {"url": "https://wiki2.org/en/Hilda_Kuper", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992[1]) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and associating with the Swaziland's royal family after she was awarded with a grant by the International African Institute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Witwatersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Institute to study in Swaziland.[2][4] In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland.[4] With assistance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa.[4] Here Kuper learned siSwati and pursued her fieldwork.[4] This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban.[4] During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960).[2][4] In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal[2][4]\n\nIn 1961 the Kupers moved to Los Angeles, to escape the harassment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA.[2][4] In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA.[2][4] Kuper was a popular teacher,[2] and In 1969 won a Guggenheim fellowship.[3]\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.[5]\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny.[2][4] Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947. [6]\n\nThe uniform of colour, a study of white-black relationships in Swaziland . 1947. [7]\n\nAfrican systems of kinship and marriage . 1950. [8]\n\nThe Shona and Ndebele of Southern Rhodesia . 1954. [9]\n\nAn Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956. [10]\n\nAn ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959. [11]\n\nIndian people in Natal . 1960. [12]\n\nThe Swazi: a South African kingdom [13]\n\nAfrican law: adaptation and development . 1965. [14]\n\nBite of hunger: a novel of Africa . 1965. [15]\n\nUrbanization and migration in West Africa . 1965. [16]\n\nA witch in my heart: a play set in Swaziland in the 1930s . 1970. [17]\n\nSobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970. [18]\n\nSouth Africa: human rights and genocide. 1981. [19]\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016 ."}, {"url": "https://www.howold.co/person/hilda-kuper/biography", "page_content": "Hilda Kuper Biography\n\nSouth African anthropologist\n\nHilda Beemer Kuper (née Beemer; 23 August 1911 – 23 April 1992) was a social anthropologist most notable for her extensive work on Swazi culture. She started studying the Swazi culture and *ociating with the Swaziland's royal family after she was awarded with a grant by the International African Ins*ute of London. She studied and illustrated Swazi traditions embodied in the political vision of King Sobhuza II, who later became a close friend. King Sobhuza II personally awarded Kuper with Swazi citizenship in 1970.\n\n\n\n\n\nEarly life\n\nBorn to Lithuanian Jewish and Austrian Jewish parents in Bulawayo, Southern Rhodesia, Kuper moved to South Africa after the death of her father. She studied at the University of the Wi*ersrand and, afterwards, at the London School of Economics under Malinowski.\n\nDoctoral fieldwork and anthropological career\n\nIn 1934, Kuper won a fellowship from the International African Ins*ute to study in Swaziland. In July of that year, while at an education conference in Johannesburg, she met Sobhuza II, paramount chief and later king of Swaziland. With *istance from Sobhuza and Malinowski, Kuper moved to the royal village of Lobamba and was introduced to Sobhuza's mother, the queen mother Lomawa. Here Kuper learned siSwati and pursued her fieldwork. This phase of Kuper's researches into Swazi culture culminated in the two-part dissertation, An African Aristocracy: Rank among the Swazi (1947) and The Uniform of Colour: a Study of White–Black Relationships in Swaziland (1947).\n\nIn the early 1950s, Kuper moved to Durban. During that decade, she focused her studies on the Indian community in the Natal region, as summarised in Indian People in Natal (1960). In 1953, Kuper received a senior lectureship at the University of Natal in Durban. In addition to her academic work, together with her husband, Leo Kuper, she helped to found the Liberal Party in Natal\n\nIn 1961 the Kupers moved to Los Angeles, to escape the har*ment of liberals that was increasingly prevalent in apartheid South Africa, and to enable Leo to accept a professorship in sociology at UCLA. In 1963 Kuper published The Swazi: a South African Kingdom and was herself appointed professor of anthropology at UCLA. Kuper was a popular teacher, and In 1969 won a Guggenheim fellowship.\n\nIn 1978, Kuper published an extensive, official biography of Sobhuza II, King Sobhuza II, Ngwenyama and King of Swaziland.\n\nAwards\n\nPersonal life\n\nKuper married Leo Kuper in 1936. They had two daughters, Mary and Jenny. Her nephew, Adam Kuper, is also an anthropologist.\n\nPublications\n\nAn African aristocracy: rank among the Swazi . Oxford University Press. 1947.\n\n. Oxford University Press. 1947. The uniform of colour, a study of white-black relationships in Swaziland . 1947.\n\n. 1947. African systems of kinship and marriage . 1950.\n\n. 1950. The Shona and Ndebele of Southern Rhodesia . 1954.\n\n. 1954. An Ethnographic Description of a Tamil-Hindu Marriage in Durban . 1956.\n\n. 1956. An ethnographic description of Kavady, a Hindu ceremony in South Africa . 1959.\n\n. 1959. Indian people in Natal . 1960.\n\n. 1960. The Swazi: a South African kingdom . New York, Holt, Rinehart and Winston. 1963.\n\n. New York, Holt, Rinehart and Winston. 1963. African law: adaptation and development . 1965.\n\n. 1965. Bite of hunger: a novel of Africa . 1965.\n\n. 1965. Urbanization and migration in West Africa . 1965.\n\n. 1965. A witch in my heart: a play set in Swaziland in the 1930s . 1970.\n\n. 1970. Sobhuza II, Ngwenyama and King of Swaziland: the story of an hereditary ruler and his country . 1970.\n\n. 1970. South Africa: human rights and genocide. 1981.\n\nReferences\n\nBank, Andrew (2016). Pioneers of the Field. Wits University Press. Archived from the original on 24 October 2016. Retrieved 26 October 2016.\n\nExternal links"}, {"url": "https://oac.cdlib.org/findaid/ark:/13030/tf1b69n737/", "page_content": "Description Hilda Kuper (1911- ) was a professor of Anthropology at UCLA (1963-78) specializing in South Africa, Swaziland, and the Swazi. The collection consists of Dr. Kuper's correspondence, manuscripts, notes, notebooks, photographs, research, and teaching materials.\n\nBackground Hilda Kuper was born in Rhodesia (Zimbabwe), 1911; married Leo Kuper (1935); BA (1935) and MA (1934), University of Witwatersrand; Ph.D, London School of Economics (1942); Professor of Anthropology, UCLA (1963-78) as well as lecturer at various universities; recipient of numerous awards and fellowships; author of several books and articles, she is best known for her work on South Africa, Swaziland, and the Swazi.\n\nExtent 35.0 Linear Feet (70 boxes and 8 oversize boxes)\n\nRestrictions Property rights to the physical objects belong to UCLA Library Special Collections. All other rights, including copyright, are retained by the creators and their heirs. It is the responsibility of the researcher to determine who holds the copyright and pursue the copyright owner or his or her heir for permission to publish where The UC Regents do not hold the copyright."}]}