{"James Blair was educated at the College of William and Mary.": [{"url": "https://www.britannica.com/biography/James-Blair", "page_content": "James Blair, (born May 1656, Banffshire, Scotland—died April 18, 1743, Williamsburg, Va. [U.S.]), clergyman and founder (1693) of the College of William and Mary, Williamsburg, Va., the second oldest institution of higher learning in the United States.\n\nBlair was ordained in the Church of England (1679) but was deprived of his parish in Edinburgh in 1681 for refusing to take an oath supporting the legitimate claim of the Roman Catholic duke of York (afterward James II) as heir to the throne. In 1685 he left for North America, where he was elected rector of Varina parish, Henrico county, Va.\n\nAppointed bishop’s representative in Virginia in 1689, Blair proposed (1691) the founding of a college. With the endorsement of the Virginia General Assembly he returned to England to secure from the English sovereigns William III and Mary II a charter and a grant of funds for the college, which was named for its royal patrons. The charter was granted on Feb. 8, 1693. As the first president of the college, Blair proved to be a canny and expert fund-raiser, extracting money from people of all ranks and persuasions and, especially, from the estate of the natural philosopher Robert Boyle. He served for 50 years, one of the longest tenures of any university president."}, {"url": "https://ourhistory.is.ed.ac.uk/index.php?title=James_Blair_(1656-1743)", "page_content": "James Blair (1656-1743) was a graduate of Edinburgh University who founded the College of William and Mary, the second-oldest university in the USA.\n\nBeginnings\n\nThe son of Peter Blair (d. 1673), minister of St Cuthbert's, Edinburgh, he matriculated at Edinburgh University in 1669 and graduated MA on 21 July 1673. After completing his theological studies, he was ordained in 1679 and appointed to the parish of Cranston in the Presbytery of Dalkeith. In December 1681 he was deprived of the post when, like many Scottish clergymen, he refused to swear the test oath which would mean acknowledging the Catholic James, Duke of York and Albany (the future King James VII and II) as head of the Church of Scotland on his succession to the throne. With assistance from Laurence Charteris (c1625-1700), his former Professor of Divinity (who had resigned his chair rather than submit to the oath), Blair sought refuge in London, where he became an under-clerk of the master of the rolls.\n\nEmigration\n\nIn 1685, Henry Compton, Bishop of London, appointed Blair to Henrico parish in Virginia. Four years after emigrating, Blair was appointed the Bishop's commissary in the colony. In 1694 he was transferred to James City parish, then in 1710 to Bruton parish, a post he held for the rest of his life. His marriage to Sarah Harrison (1670-1713), daughter of a prominent planter, brought Blair powerful political connections. He increased his personal fortune by acquiring land and partnering his brother Archibald who opened a trading store in Williamsburg.\n\nCollege of William and Mary\n\nAt a convention of the clergy of Virginia in 1690, Blair proposed establishing a college to educate candidates for the ministry, noting that since the establishment of the colony in 1607, there had been a serious shortage of ministers. The plan was approved, and Blair successfully sought financial support from key political contacts, including Francis Nicholson, Governor of Virginia. In view of Blair's influential London contacts, he was then sent to England in 1691 to obtain a royal charter and endowment for the institution. A charter for the College of William and Mary was granted on 8 February 1693, with Henry Compton designated Chancellor and Blair President. On his return to Virginia, Blair was rewarded for his success by being appointed to the colonial council, a position he would hold for nearly half-a-century.\n\nThe college based at Middle Plantation (later renamed Williamsburg under Blair's initiative) opened in 1695. Initially, however, its financial situation was weak, and it had difficulty attracting tutors. The college was practically destroyed by fire in 1705 and only rebuilt in 1716. In 1726, Blair returned to England for a year to raise funds for the college with the assistance of Edmund Gibson, Bishop of London. By 1729, the college was finally on a secure enough footing to permit Blair to enter formally into his duties as President.\n\nRelated Pages\n\nSources\n\nJames B. Bell, 'Blair, James (1655/6–1743)', Oxford Dictionary of National Biography (Oxford: Oxford University Press, 2004)\n\n(Oxford: Oxford University Press, 2004) Parke Rouse, Jr., James Blair of Virginia (Chapel Hill: University of North Carolina Press, 1971)\n\nBlair is sometimes recorded as the son of Robert Blair, Church of Scotland minister of Alvah, Banffshire (for example in Park Rouse's biography above), but this is almost certainly an error."}, {"url": "https://encyclopediavirginia.org/entries/blair-james-ca-1655-1743/", "page_content": "Early Years Blair was probably born in Edinburgh, Scotland, around 1655, the eldest of three sons and four daughters of Peter Blair, a clergyman, and Mary Hamilton Blair. After beginning his formal education at Marischal College, Aberdeen, Blair studied at the University of Edinburgh from 1669 to 1673, when he received the degree of master of arts. He remained at Edinburgh for several additional years studying theology. In the summer of 1679 he was ordained by John Paterson, bishop of Edinburgh. Henry, Bishop of London That same summer Blair was appointed minister at Cranstoun Parish, a few miles outside Edinburgh. He remained two and a half years, serving, according to the bishop, “with exemplary diligence, care and gravity,” although a dispute with parish landowners over his reimbursement for repairs to the manse suggests that the combative nature that he later exhibited in Virginia was already well developed. In December 1681 Blair was removed from his parish after he refused to subscribe to a test oath that the Scottish Parliament imposed because it would have required him to accept the Roman Catholic duke of York as head of the Scottish church when he became king. Blair left for England, where he gained the support of Gilbert Burnet, a fellow Scottish cleric who later became bishop of Salisbury. Burnet secured Blair a clerkship in the Rolls Office and provided him an opportunity to meet other influential Anglican clerics, including Henry Compton, who as bishop of London had jurisdiction over the Anglican church in the American colonies. Compton persuaded Blair to accept an appointment in Virginia as rector of Henrico Parish (then frequently referred to as Varina Parish).\n\nIn Virginia Sarah Harrison Blair Blair’s career advanced rapidly after his arrival in Virginia late in 1685. Preaching at other parish churches as well as at his own, he came to know and be known to members of the colony’s most important families. Within two years he made the first of many land purchases, and on June 2, 1687, he married seventeen-year-old Sarah Harrison, of Surry County. The marriage was unhappy. At the wedding she adamantly refused to assent to the portion of the ceremony obliging her to obey her husband. They apparently had no children, and she may have become an alcoholic. Sarah Harrison Blair died on May 5, 1713, and James Blair lived another thirty years as a widower. Blair’s marriage brought him into the inner circle of the colony’s leading families, and his relatives often dominated the influential governor’s Council. His ecclesiastical career prospered. In mid-May 1690 a new lieutenant governor, Francis Nicholson, arrived in Virginia, bringing a commission of December 15, 1689, from Bishop Compton naming Blair commissary, or the bishop’s representative with authority to preside over the Anglican clergy of the colony in administrative matters. Often thought to have been the first to hold that office in Virginia, Blair had in fact been preceded in the post by John Clayton. Royal Charter for the College of William and Mary Blair moved without delay to establish his authority by calling a convocation of the clergy for July 23, 1690. Neither his Scottish origins nor his tendency to side with the Virginia laity in religious affairs endeared him to the larger number of his fellow clerics, who often opposed him vigorously, especially in the infrequent convocations that he called. The convocations held in August 1705 and April 1719 proved particularly rancorous. In the latter meeting his fellow clergymen unsuccessfully challenged the validity of his ordination in Scotland, a move that could have lost him his influential positions as rector and commissary. Blair’s initial convocation was more auspicious, however, for he there first advanced “Several Propositions” for the founding of a college in the colony and won enthusiastic support. In cooperation with Nicholson, who deserves to rank with Blair as a cofounder, he cultivated the support of Virginia’s political leaders. By June 1691 Blair left for England to seek the backing of King William, Queen Mary, and others. His mission required almost two years and resulted in the grant of a royal charter for the College of William and Mary on February 8, 1693, as well as substantial public and private financial support.\n\nEducation and Politics Sir Edmund Andros Blair returned to Virginia in triumph. Named president for life in the charter, he launched the new college on land acquired at the crossroads settlement of Middle Plantation a few miles from the capital at Jamestown. His task was not easy. In his absence enthusiasm for the project had declined, and Sir Edmund Andros, the new governor, was openly hostile. Blair nonetheless managed to inaugurate one branch of the institution, its grammar school, and to commence construction of a building. Over Andros’s objections Blair also secured a place on the Council, taking his seat for the first time on July 18, 1694. The next year he consolidated his position when he became rector of James City Parish, close to the seat of government as well as the new college. Blair’s relations with the governor soon worsened, and following his public criticism of Andros and the other councillors, they suspended him on April 26, 1695. He was reinstated on September 25, 1696, but suspended again on April 20, 1697. The infighting between Blair and Andros culminated in the summer of 1697 when, with financial and political backing from Francis Nicholson, Blair returned to England to present his grievances to ecclesiastical and political authorities. A key hearing before the archbishop of Canterbury and bishop of London was a one-sided affair with Blair able to speak in person to the sympathetic panel. The absent Andros was primarily represented by the young William Byrd (1674–1744), who was never allowed to deliver the lengthy brief he had prepared. On May 31, 1698, Andros was granted permission to resign and return to England on personal business. The Present State of Virginia, and the College. During his English sojourn Blair collaborated with two other men experienced in the government of Virginia, Henry Hartwell and Edward Chilton, in preparing a long report for the newly created Board of Trade on the state of affairs of the colony and how to improve it. Published nearly thirty years later as The Present State of Virginia, and the College (1727), it quickly became one of the more influential contemporary books about the condition of Virginia and the lives of Virginians at the end of the seventeenth century. Nicholson succeeded Andros as governor in December 1698 shortly after Blair’s return to Virginia. Blair was eventually reappointed to the Council, taking his seat on June 9, 1701, and serving for the remainder of his life. Although he cooperated with Nicholson in 1699 in a successful effort to move the capital from Jamestown to Middle Plantation, which was renamed Williamsburg, the two equally imperious men came into conflict during the next few years. The ill will culminated in Blair’s second trip to England to lobby for the removal of a governor. He left in 1703, bearing a petition that he and five other Council members had signed. Nicholson was at a distinct disadvantage due to his inability to appear in person, the death early in the hearings of his principal defender, and the capture by the French of the vessel carrying his supporting documentation. On April 5, 1705, the Board of Trade removed Nicholson as governor of Virginia. Old Bruton Church, Williamsburg, Virginia, in the Time of Lord Dunmore Blair’s success was, however, hardly complete. Nicholson remained a trustee of the college and continued with the support of most of Virginia’s Anglican clergy to oppose Blair’s direction of the college and his attempts to govern the colonial church. Then on October 29, 1705, the main college building caught fire and burned to its exterior walls. The resultant inquiry stirred further animosity between Blair and his opponents. In 1710 the death of one of his most outspoken clerical opponents, Solomon Whateley, afforded Blair the opportunity to become rector of Bruton Parish Church in Williamsburg, and for more than a decade he had no serious difficulty with Governor Edward Nott or his successor, Lieutenant Governor Alexander Spotswood. Blair used the time to solidify his position with Virginia political leaders. By that time, too, his brother Archibald Blair (by 1665–1733), a physician who had also immigrated to Virginia, had established himself as a successful Williamsburg merchant in a firm in which James Blair, to his considerable profit, became a silent partner. Alexander Spotswood Rebuilding the college was a more serious challenge, but Blair made the first of two rescues of William and Mary from the brink of failure. With the help of Spotswood and others, he found new money in England and America, began reconstruction of the college building that was first occupied by 1716 and largely completed by 1721, and for the first time expanded instruction beyond the grammar school by appointing a master of the Indian School and the first professor of natural philosophy and mathematics, Hugh Jones. As early as 1718 or 1719, however, Blair became embroiled in a controversy with Spotswood. The issues at stake had more to do with religious and political matters than with the college, and they again brought Blair into conflict with his fellow clerics, including the faculty. In 1721 he set off for England again. On this occasion, however, Spotswood was already in difficulty with his superiors on other grounds, and thus the commissary’s role in his dismissal has often been overemphasized, adding to Blair’s not entirely deserved reputation as a breaker of governors. The trip afforded Blair an opportunity to arrange for publication in London of Our Saviour’s Divine Sermon on the Mount (1722), a five-volume collection of 117 sermons he had delivered between 1707 and 1721. True to character, Blair was dissatisfied with sales, but the sermons were reprinted in four volumes in 1740 and in Danish in 1761. The sermons dealt more with matters of morality and personal conduct than with doctrine, a reminder that, despite his other concerns and interests, Blair was an active parish minister throughout his long career.\n\nLater Years The Bodleian Plate Engraved Copperplate of Colonial-Era Williamsburg\n\nPrint Made from Bodleian Copperplate\n\nHugh Drysdale Blair was in his late sixties when he returned from England on the same ship with the new lieutenant governor,. Blair appeared to be at the height of his power in the political establishment of Virginia. Yet despite its new building the college that he had founded and headed for more than three decades was once again on the verge of extinction, with a dearth of funds and students and a curriculum confined to precollegiate instruction in the grammar and Indian schools. Blair set to work and by the end of the 1720s had achieved nothing less than a second founding of the institution, helped again by a period in which few political issues diverted him from the task. A round of new construction added the Brafferton (1723) to house the Indian school and the library, a chapel wing on the main building (1732), and a president’s house (1733). The crowning achievements, however, were the preparation of the first college statutes in 1727; the hiring for the first time of the full complement of six masters, including professors of moral and natural philosophy and divinity; and with those preconditions met, the transfer of the original charter of 1693 into the hands of the president and masters on August 15, 1729. Blair was able to use his secure position in the social and political elite of Virginia to contribute significantly to the evolution of autonomous institutions in the colony. Rather than an outpost of imperial culture controlled by a largely English clerical faculty, under Blair’s guidance William and Mary became a college governed primarily by prominent colonists who sat on its board of visitors and shaped it to serve their educational goals. Likewise, Blair’s actions as commissary aided the development of an established Anglican church dominated by laymen who ran its parish vestries, a model that more closely resembled the operations of the church in Scotland during Blair’s youth and ministry in that country than it did the functioning of the parent Church of England during the eighteenth century. Blair’s relations with Lieutenant Governor William Gooch, the last chief executive on whose Council he served, were amicable. Gooch’s private opinion of Blair was negative, but he resolved to “kill him with kindness.” By then Blair was declining in health and vigor. In his last years he retained all of his official positions as president of the college, commissary, parish rector, and councillor, although he was not always able to perform all of his duties. The senior member of the Council, Blair served as president (in effect, acting governor) from October 15, 1740, to July 1741 while Gooch was away on a military expedition to the West Indies. Ruins of the Churchyard, Jamestown. The childless Blair had a sizable estate to dispose of when he composed his will in 1743. He made several charitable bequests, including £100 for teaching poor children and £500 for the education of a clergyman. He left his books to the library of the College of William and Mary and the remainder of his estate, estimated at £10,000, to his favorite nephew John Blair (ca. 1687–1771), whose education he had overseen. James Blair died in Williamsburg of a gangrenous rupture on April 18, 1743. He was buried beside his wife in the Jamestown churchyard."}, {"url": "https://scrc-kb.libraries.wm.edu/james-blair-1656-1743", "page_content": "William & Mary President: James Blair\n\nTerm Served: 1693 - 1743\n\nSucceeded by: William Dawson 1743 - 1752\n\nCHARLES BRIDGES\n\nEnglish, 1672–1747\n\n\n\nPortrait of Reverend James Blair (circa 1656–1743)\n\nWilliam & Mary President, 1693–1743\n\n\n\ncirca 1735-1743\n\nCourtesy of the Muscarelle Museum of Art\n\nThe Reverend James Blair, the first president of William & Mary, was born in Banffshire, Scotland and educated at Marischal College (University of Aberdeen). Blair was president of the College from its founding in 1693 until his death on April 18, 1743. As commissary of the Bishop of London, James Blair had a tremendous influence on the established Virginia church. Blair wed Sara Harrison in 1687.\n\nStatue of James Blair by Lewis Cohen\n\nAn oil painting of James Blair by Charles Bridges is owned by William & Mary and in the collection of the Muscarelle Museum of Art. A statue of James Blair was installed between Tyler Hall and Blair Hall during Homecoming Week 1993 as part of the College's tercentenary celebration. The statue was sculpted by Lewis Cohen, professor of art and art history at William & Mary. Cohen estimated that he created 25 to 30 models of Blair before he found a look with which he was happy.\n\nHis grandnephew, John Blair, served as an associate justice of the United States Supreme Court.\n\nMaterial in the Special Collections Research Center\n\nJames Blair in SCRC Database\n\nFurther Reading"}, {"url": "https://encyclopediavirginia.org/entries/slavery-at-the-college-of-william-and-mary/", "page_content": "The Founding and Early Years The Bodleian Plate Engraved Copperplate of Colonial-Era Williamsburg\n\nPrint Made from Bodleian Copperplate\n\nWilliamsburg royal charter tobacco From its earliest days, the College of William and Mary independed on financing derived directly and indirectly from the exploitation of enslaved people. This included the tuition paid by wealthy plantation owners; taxes, fees, and revenues allocated to the college by its(“a penny per pound, for every pound of tobacco”); and lands it owned and leased that were worked by enslaved men and women. The most generous founding donors of the college included Micajah Perry and Thomas Lane, merchants whose money came from trading in bothand human beings. The construction of the college’s main building in 1695 (later the Wren Building) involved forced labor. Though skilled masons were brought from England, the hard labor was done by enslaved workers owned by the contractor. Two other enslaved men were leased from James Blair, an Anglican minister and the college’s powerful president for life. Enslaved workers also built the Brafferton, a house originally used as a school for Indians (1723), and the President’s House (1732), both of which still stand, as well as structures long gone, including privies, a slave quarters, and an observatory. Reverend James Blair The first documented enslaved person at the College of William and Mary appeared in an affidavit by James Blair dated May 1, 1704. It mentions “a Negro man” owned by Blair and ordered by him in 1702 to break down a locked door; Blair’s wife’s “maid, who lay in a Closet just by” may also have been enslaved. The first enslaved person known to be owned by the college was a man named Price, a gift in 1704 from Governor Francis Nicholson and valued at £30. Price was followed over the decades by an unknown number of others, most of them recorded only in lost documents. Some of these enslaved people were leased; others are present in the surviving bursar’s books behind shadowy entries for medical, clothing, and shoe expenses. Most people were not named: “paid hire a Negro Wench 2 years”; “paid Mr Allen hire of a Negro.” Entries also record expenses for several coffins (a burial ground for enslaved laborers has yet to be discovered) and even for purchases of hops, pork, beef, mutton, and butter from enslaved workers at the Nottoway Quarter, a working plantation acquired by the college in 1718 for £150. For an additional £476 the college purchased seventeen enslaved people who worked 2,119 acres of tobacco. The farm’s profits paid for scholarships, known as Nottoway Foundations, for less wealthy students. On February 27, 1729, James Blair and Stephen Fouace, the last surviving member of the original board of visitors, formally transferred governing authority of the college from the original founders to the president and masters, or members of the faculty. Included in the transfer were “all the negro slaves by the said trustees, from time to time purchased, now living upon the said lands or any part of them or parcel thereof and their increase.”\n\nEnslaved Community Carte des Environs de Williamsburg en Virginie Enslaved people from early on lived where they worked: throughout the college’s main building, as well as in the President’s House, the Brafferton, and kitchens. In The Present State of Virginia (1724), Hugh Jones, a master at the college from 1717 to 1721, wrote that the difficulties in controlling students were exacerbated by “the many Servants lodged in the College and the several Doors and Ways to get out of it.” He argued that the need for a separate slave quarter was compelling. “There [is] a very great Occasion for a Quarter for the Negroes and inferior servants belonging to the College,” he wrote, “for these not only take up a great deal of Room and are noisy and nasty, but also have often made me and others apprehensive of the great Danger of being burnt with the College, thro’ their Carelessness and Drowsiness.” At least one slave quarter was eventually built, but it is not known where or when. A map of the Williamsburg area made in 1782 by the French cartographer Jean-Nicholas Desandrouins shows structures close to the gardens and orchards west of the college that may have been quarters. Other buildings, such as kitchens, also served as slave quarters. A List of Negroes at College “A List of Negroes at College” is the only surviving catalog of men, women, and children enslaved by the College of William and Mary and dates from about 1780. The one-page document includes the names “Winkfield, Daniell, Dick—almost a invalid, Pompey, Adam, Nedd, old Lucy—a invalid, old Kate a invalid, Nanny a invalid, Effy—not much better.” It also includes people enslaved by the college but hired out for income: “Lemon, James, Letty, Charlott, Frankey, Betty and two Gerrels,” plus “Mr. Bellini’s three, Molly, Mass, and Lucy.” Some others are named in college minutes, where, for example, on December 24, 1778, the president and masters “Resolved, That a Negro Man called Nero be purchased of Dr Jas Carter, & that the President be desired to make the purchase for any sum not exceeding 500 £.” Only a few details are known about any of men, women, and children enslaved by or at William and Mary. In 1777, the college prepared to lease or sell the Nottoway Quarter. The minutes of a meeting of the president and masters, dated December 29, 1777, direct that “all the Negroes, stock & Utensils” also were to be sold, while “two Negro Fellows & a boy [were to] be ordered down from the Nottoway Quarter, to supply the place of Hirelings in the College.” The advertisement in the Virginia Gazette, published on November 28, 1777, specified that “about thirty likely [i.e., capable or strong] Negroes” were on offer “for ready Money.” On December 29, 1779, the president and masters resolved that “Winkfield, Bob, Lemon, Adam, & Pompey be retained for cleaning the College & other necessary Purposes.” A pseudonymous letter, published in the Virginia Gazette on November 30, 1775, addressed Winkfield as the “Superintendent of the hall of William and Mary College”: “No one, of your colour, has ever established a more respectable character than yourself … You have ever been distinguished for your spirit and candour.” Jottings on a preserved copy of the paper describe Winkfield as the son of “old Liverpool, the Ferryman.” George Tucker Lemon shows up in the bursar’s accounts more than others—selling produce to the college and receiving a Christmas bonus in 1808, a food allowance in 1815, medicine in 1816, and, in 1817, a coffin. “Old Lemon, one of the slaves then belonging to the college,” appears in George Tucker‘s antislavery novel The Valley of Shenandoah (1824), helping the protagonist move in as a student at the college and fetching his mail; he is recalled especially for his oyster dinners, another sign of his entrepreneurship. And he is evoked in a 1797 letter as, perhaps, the namesake for what appears to be a team or group of students competing in an obscure way with other groups.\n\nSale Reverend James Madison Under financial pressure during the American Revolution, the Reverend James Madison, who served as president of the College of William and Mary from 1777 to 1812, cut back on services provided by the school to students while outsourcing others. He hired out the enslaved people the college owned. On December 18, 1779, the college announced in the Virginia Gazette that, among other things, “commons,” or the serving of meals,” shall cease at the College. The President and Professors shall allow to some sober and discreet male person, the use of the college kitchen and garden. They shall also hire to him the negroes accustomed to labour in the same, taking bond with security.” College leaders explained that “a sufficient number of slaves shall be reserved for cleaning the college,” and any others that remained “shall be hired out at publick auction.” In the minutes of their December 14, 1780, meeting, the president and masters resolved that the men, women, and children enslaved at Nottoway Quarter be sold, “disposed of in Exchange for Lands” within a hundred miles of Williamsburg. A few weeks later, on January 1, 1781, the steward was directed “to hire out the Negroes belonging to ye College, except those necessary for ye College, & [adjoining] Farm, ye Persons hiring them to pay their Taxes & clothe them.” Lord Dunmore’s Proclamation During the war the British offered freedom to those enslaved men who joined its army, prompting the Reverend Madison to write his brother, William Madison, on July 21, 1781, that “the College is entirely broke up … It is particularly necessary to move the few Negroes we have, as I know nothing but a lucky accident prevented most of them from joining the enemy.” After the war and in light of serious damages to the college, the president and masters resolved, in September 1782, “that so many of the Negroes not employed about the College be Sold to defray the Expense of repairing the Buildings.”"}, {"url": "https://www.liquisearch.com/james_blair_virginia/college_of_william_and_mary", "page_content": "College of William and Mary\n\nThe trip to London proved successful. Blair was supported in his efforts by John Tillotson, who was the Archbishop of Canterbury. In 1693, a charter was granted for The College of William and Mary in Virginia, named to honor King William and Queen Mary, the reigning joint monarchs of Great Britain, Blair was made president of the new school for life.\n\nAfter Blair returned to Virginia, the trustees of the new college bought a parcel of 330 acres (1.3 km2) from Thomas Ballard for the new school. The location chosen was at Middle Plantation, a high point on the Virginia Peninsula so named because its was equidistant from the James and York Rivers. Middle Plantation had served as a fortress during periodic conflicts with the Native Americans since its establishment in 1632. Blair established his home at nearby Rich Neck Plantation.\n\nThe College was given a seat in the House of Burgesses. Financial income was to come by taxation of a penny per pound on tobacco exported from Maryland and Virginia to countries other than England, and from other similar sources, such as an export duty on furs and animal skins. The new school opened in temporary buildings in 1694. Properly called the \"College Building,\" the first version of the Wren Building was built at Middle Plantation beginning on August 8, 1695 and occupied by 1700. Today, the Wren Building is the oldest academic structure in continuous use in America. (Incidentally, it is called the \"Wren Building\" because tradition has it that the building was designed by the famed English architect Sir Christopher Wren who had designed St. Paul's Cathedral in London. His actual involvement with the College Building completed in 1700 is disputed by some historians)."}, {"url": "https://prabook.com/web/james.blair/3732661", "page_content": "James Blair\n\nclergyman educator Missionary\n\n1655 (age 88) Banffshire, Scotland, United Kingdom\n\nIn 1679 he settled as a minister of the Scottish Episcopal Church near Edinburgh. Two years later, because he scrupled to sign the Scottish Test Act, he was deprived of a living anywhere in Scotland. He went to London, where he became acquainted with Henry Compton, the bishop of London, who persuaded him to go to Virginia as a missionary. After 5 years in Virginia, Blair was appointed commissary (deputy) to the bishop of London, with authority to supervise the discipline of the Anglican clergy, though without the power to confirm baptisms or ordain American-born ministers. In one of his first acts he convened the clergy to urge them to found a college. They readily complied with a plan for a grammar school, a philosophical college, and a divinity school, which soon won the approval of Governor Francis Nicholson and the General Assembly. In 1691 Blair went to England to obtain a charter and funds for the college. When he returned to Virginia 2 years later, he was the first president and rector of the board of visitors of the College of William and Mary, founded \"to the End that the Church of Virginia may be furnished with a Seminary of Ministers of the Gospel, and that the Youth may be piously educated in good Letters and Manners, and that the Christian Faith may be propagated amongst the Western Indians, to the Glory of Almighty God. \" For its first 36 years the college was no more than a grammar school, without enough funds to hire the six professors contemplated in the charter. Some of the blame must be laid to Blair; he did no teaching yet demanded his annual salary of £150, which cut deeply into the college's funds. And although Blair could have done much for the college from the seat on the governor's council he assumed in 1694, his feuds with a succession of governors eroded his influence and alienated both the clergy and the gentry. When he died on April 18, 1743, he left an estate of £10, 000 to a nephew and only his library and £500 to the college."}, {"url": "https://www.encyclopedia.com/people/philosophy-and-religion/protestant-christianity-biographies/james-blair", "page_content": "James Blair\n\nThe British educator James Blair (1655-1743) was commissary of Virginia for the bishop of London and founder and first president of the College of William and Mary.\n\nBorn to a Presbyterian minister and his wife in Scotland, James Blair attended Marischal College, Aberdeen, for 2 years. He received a master of arts degree from the University of Edinburgh, where he remained to study divinity. In 1679 he settled as a minister of the Scottish Episcopal Church near Edinburgh. Two years later, because he scrupled to sign the Scottish Test Act, he was deprived of a living anywhere in Scotland. He went to London, where he became acquainted with Henry Compton, the bishop of London, who persuaded him to go to Virginia as a missionary.\n\nAfter 5 years in Virginia, Blair was appointed commissary (deputy) to the bishop of London, with authority to supervise the discipline of the Anglican clergy, though without the power to confirm baptisms or ordain American-born ministers. In one of his first acts he convened the clergy to urge them to found a college. They readily complied with a plan for a grammar school, a philosophical college, and a divinity school, which soon won the approval of Governor Francis Nicholson and the General Assembly.\n\nIn 1691 Blair went to England to obtain a charter and funds for the college. When he returned to Virginia 2 years later, he was the first president and rector of the board of visitors of the College of William and Mary, founded \"to the End that the Church of Virginia may be furnished with a Seminary of Ministers of the Gospel, and that the Youth may be piously educated in good Letters and Manners, and that the Christian Faith may be propagated amongst the Western Indians, to the Glory of Almighty God.\"\n\nFor its first 36 years the college was no more than a grammar school, without enough funds to hire the six professors contemplated in the charter. Some of the blame must be laid to Blair; he did no teaching yet demanded his annual salary of £150, which cut deeply into the college's funds. And although Blair could have done much for the college from the seat on the governor's council he assumed in 1694, his feuds with a succession of governors eroded his influence and alienated both the clergy and the gentry.\n\nBlair brought a measure of English religion and culture to colonial Virginia through his control of the Anglican Church and promotion of education. When he died on April 18, 1743, he left an estate of £10,000 to a nephew and only his library and £500 to the college.\n\nFurther Reading\n\nThe introduction by Hunter Dickinson Farish in the 1940 reprint of Henry Hartwell, James Blair, and Edward Chilton, The Present State of Virginia, and The College (1727), contains useful information on Blair. A short study of Blair's life is Daniel E. Motley, Life of Commissary James Blair, Founder of William and Mary College, series 19, no. 10, of the Johns Hopkins University Studies in Historical and Political Science (1901). For background see Philip Alexander Bruce, Institutional History of Virginia in the Seventeenth Century (2 vols., 1910; repr. 1964); Richard L. Morton, Colonial Virginia (2 vols., 1960); and Clifford Dowdey, The Virginia Dynasties (1969). □"}, {"url": "https://tribetrek.wm.edu/items/show/13", "page_content": "Text\n\nThe Reverend James Blair (1655-1748) was the founding president of William & Mary. A statue of James Blair was installed between Tyler Hall and Blair Hall during Homecoming Week 1993 as part of the William & Mary’s Tercentenary celebration. The statue was sculpted by Lewis Cohen, professor of art and art history at William & Mary.\n\nJames Blair was born in Scotland and educated at Marischal College (University of Aberdeen) and the University of Edinburgh where he received a Master of Arts. Blair was president of the university from its founding in 1693 until his death on April 18, 1743. While president of William & Mary, Blair also served as rector of Bruton Parish Church. As commissary of the Bishop of London, James Blair had a tremendous influence on the established Virginia church.\n\n"}, {"url": "https://encyclopediavirginia.org/james-blair/", "page_content": "MEDIA\n\nAnglican minister James Blair stands for a portrait in Williamsburg, in or around 1735. Blair was commissary, or the representative of the Bishop of London, with authority to preside over the Anglican clergy in America. He also was the cofounder of the College of William and Mary and served as its president for fifty years until his death in 1743. Seen in the distance behind Blair is the college's Wren Building, the oldest college building in the United States, which, according to tradition, was designed by the famous English architect Sir Christopher Wren. Originally built between 1695 and 1700, the Wren Building was gutted by fire in 1705, 1859, and 1862. This is a rare view of the building as it appeared after its reconstruction in the wake of the 1705 conflagration.\n\nThough unsigned, this painting was probably executed by the English artist Charles Bridges, who came to Williamsburg in 1735 and stayed in the Virginia colony until at least 1743."}], "James Blair studied law in England.": [{"url": "https://www.britannica.com/biography/James-Blair", "page_content": "James Blair, (born May 1656, Banffshire, Scotland—died April 18, 1743, Williamsburg, Va. [U.S.]), clergyman and founder (1693) of the College of William and Mary, Williamsburg, Va., the second oldest institution of higher learning in the United States.\n\nBlair was ordained in the Church of England (1679) but was deprived of his parish in Edinburgh in 1681 for refusing to take an oath supporting the legitimate claim of the Roman Catholic duke of York (afterward James II) as heir to the throne. In 1685 he left for North America, where he was elected rector of Varina parish, Henrico county, Va.\n\nAppointed bishop’s representative in Virginia in 1689, Blair proposed (1691) the founding of a college. With the endorsement of the Virginia General Assembly he returned to England to secure from the English sovereigns William III and Mary II a charter and a grant of funds for the college, which was named for its royal patrons. The charter was granted on Feb. 8, 1693. As the first president of the college, Blair proved to be a canny and expert fund-raiser, extracting money from people of all ranks and persuasions and, especially, from the estate of the natural philosopher Robert Boyle. He served for 50 years, one of the longest tenures of any university president."}, {"url": "https://www.archives.gov/founding-docs/founding-fathers-virginia", "page_content": "The Founding Fathers: Virginia\n\nJohn Blair, Virginia\n\nScion of a prominent Virginia family, Blair was born at Williamsburg in 1732. He was the son of John Blair, a colonial official and nephew of James Blair, founder and first president of the College of William and Mary. Signer Blair graduated from that institution and studied law at London's Middle Temple. Thereafter, he practiced at Williamsburg. In the years 1766-70 he sat in the Virginia House of Burgesses as the representative of William and Mary. From 1770 to 1775 he held the position of clerk of the colony's council.\n\nAn active patriot, Blair signed the Virginia Association of June 22, 1770, which pledged to abandon importation of British goods until the Townshend Duties were repealed. He also underwrote the Association of May 27, 1774, calling for a meeting of the colonies in a Continental Congress and supporting the Bostonians. He took part in the Virginia constitutional convention (1776), at which he sat on the committee that framed a declaration of rights as well as the plan for a new government. He next served on the Privy Council (1776-78). In the latter year, the legislature elected him as a judge of the General Court, and he soon took over the chief justiceship. In 1780 he won election to Virginia's high chancery court, where his colleague was George Wythe.\n\nBlair attended the Constitutional Convention religiously but never spoke or served on a committee. He usually sided with the position of the Virginia delegation. And, in the commonwealth ratifying convention, Blair helped win backing for the new framework of government.\n\nIn 1789 Washington named Blair as an associate justice of the U.S. Supreme Court, where he helped decide many important cases. Resigning that post in 1796, he spent his remaining years in Williamsburg. A widower, his wife (born Jean Balfour) having died in 1792, he lived quietly until he succumbed in 1800. He was 68 years old. His tomb is in the graveyard of Bruton Parish Church.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-GW-533b)\n\nJames Madison, Virginia\n\nThe oldest of 10 children and a scion of the planter aristocracy, Madison was born in 1751 at Port Conway, King George County, VA, while his mother was visiting her parents. In a few weeks she journeyed back with her newborn son to Montpelier estate, in Orange County, which became his lifelong home. He received his early education from his mother, from tutors, and at a private school. An excellent scholar though frail and sickly in his youth, in 1771 he graduated from the College of New Jersey (later Princeton), where he demonstrated special interest in government and the law. But, considering the ministry for a career, he stayed on for a year of postgraduate study in theology.\n\nBack at Montpelier, still undecided on a profession, Madison soon embraced the patriot cause, and state and local politics absorbed much of his time. In 1775 he served on the Orange County committee of safety; the next year at the Virginia convention, which, besides advocating various Revolutionary steps, framed the Virginia constitution; in 1776-77 in the House of Delegates; and in 1778-80 in the Council of State. His ill health precluded any military service.\n\nIn 1780 Madison was chosen to represent Virginia in the Continental Congress (1780-83 and 1786-88). Although originally the youngest delegate, he played a major role in the deliberations of that body. Meantime, in the years 1784-86, he had again sat in the Virginia House of Delegates. He was a guiding force behind the Mount Vernon Conference (1785), attended the Annapolis Convention (1786), and was otherwise highly instrumental in the convening of the Constitutional Convention in 1787. He had also written extensively about deficiencies in the Articles of Confederation.\n\nMadison was clearly the preeminent figure at the convention. Some of the delegates favored an authoritarian central government; others, retention of state sovereignty; and most occupied positions in the middle of the two extremes. Madison, who was rarely absent and whose Virginia Plan was in large part the basis of the Constitution, tirelessly advocated a strong government, though many of his proposals were rejected. Despite his poor speaking capabilities, he took the floor more than 150 times, third only after Gouverneur Morris and James Wilson. Madison was also a member of numerous committees, the most important of which were those on postponed matters and style. His journal of the convention is the best single record of the event. He also played a key part in guiding the Constitution through the Continental Congress.\n\nPlaying a lead in the ratification process in Virginia, too, Madison defended the document against such powerful opponents as Patrick Henry, George Mason, and Richard Henry Lee. In New York, where Madison was serving in the Continental Congress, he collaborated with Alexander Hamilton and John Jay in a series of essays that in 1787-88 appeared in the newspapers and were soon published in book form as The Federalist (1788). This set of essays is a classic of political theory and a lucid exposition of the republican principles that dominated the framing of the Constitution.\n\nIn the U.S. House of Representatives (1789-97), Madison helped frame and ensure passage of the Bill of Rights. He also assisted in organizing the executive department and creating a system of federal taxation. As leaders of the opposition to Hamilton's policies, he and Jefferson founded the Democratic-Republican Party.\n\nIn 1794 Madison married a vivacious widow who was 16 years his junior, Dolley Payne Todd, who had a son; they were to raise no children of their own. Madison spent the period 1797-1801 in semiretirement, but in 1798 he wrote the Virginia Resolutions, which attacked the Alien and Sedition Acts. While he served as Secretary of State (1801-9), his wife often served as President Jefferson's hostess.\n\nIn 1809 Madison succeeded Jefferson. Like the first three Presidents, Madison was enmeshed in the ramifications of European wars. Diplomacy had failed to prevent the seizure of U.S. ships, goods, and men on the high seas, and a depression wracked the country. Madison continued to apply diplomatic techniques and economic sanctions, eventually effective to some degree against France. But continued British interference with shipping, as well as other grievances, led to the War of 1812.\n\nThe war, for which the young nation was ill prepared, ended in stalemate in December 1814 when the inconclusive Treaty of Ghent which nearly restored prewar conditions, was signed. But, thanks mainly to Andrew Jackson's spectacular victory at the Battle of New Orleans (Chalmette) in January 1815, most Americans believed they had won. Twice tested, independence had survived, and an ebullient nationalism marked Madison's last years in office, during which period the Democratic-Republicans held virtually uncontested sway.\n\nIn retirement after his second term, Madison managed Montpelier but continued to be active in public affairs. He devoted long hours to editing his journal of the Constitutional Convention, which the government was to publish 4 years after his death. He served as co-chairman of the Virginia constitutional convention of 1829-30 and as rector of the University of Virginia during the period 1826-36. Writing newspaper articles defending the administration of Monroe, he also acted as his foreign policy adviser.\n\nMadison spoke out, too, against the emerging sectional controversy that threatened the existence of the Union. Although a slaveholder all his life, he was active during his later years in the American Colonization Society, whose mission was the resettlement of slaves in Africa.\n\nMadison died at the age of 85 in 1836, survived by his wife and stepson.\n\nImage: Courtesy of the Collection of Gilcrease Museum, Tulsa\n\nGeorge Mason, Virginia\n\nIn 1725 George Mason was born to George and Ann Thomson Mason. When the boy was 10 years old his father died, and young George's upbringing was left in the care of his uncle, John Mercer. The future jurist's education was profoundly shaped by the contents of his uncle's 1500-volume library, one-third of which concerned the law.\n\nMason established himself as an important figure in his community. As owner of Gunston Hall he was one of the richest planters in Virginia. In 1750 he married Anne Eilbeck, and in 23 years of marriage they had five sons and four daughters. In 1752 he acquired an interest in the Ohio Company, an organization that speculated in western lands. When the crown revoked the company's rights in 1773, Mason, the company's treasurer, wrote his first major state paper, Extracts from the Virginia Charters, with Some Remarks upon Them.\n\nDuring these years Mason also pursued his political interests. He was a justice of the Fairfax County court, and between 1754 and 1779 Mason was a trustee of the city of Alexandria. In 1759 he was elected to the Virginia House of Burgesses. When the Stamp Act of 1765 aroused outrage in the colonies, George Mason wrote an open letter explaining the colonists' position to a committee of London merchants to enlist their support.\n\nIn 1774 Mason again was in the forefront of political events when he assisted in drawing up the Fairfax Resolves, a document that outlined the colonists' constitutional grounds for their objections to the Boston Port Act. Virginia's Declaration of Rights, framed by Mason in 1776, was widely copied in other colonies, served as a model for Jefferson in the first part of the Declaration of Independence, and was the basis for the federal Constitution's Bill of Rights.\n\nThe years between 1776 and 1780 were filled with great legislative activity. The establishment of a government independent of Great Britain required the abilities of persons such as George Mason. He supported the disestablishment of the church and was active in the organization of military affairs, especially in the West. The influence of his early work, Extracts from the Virginia Charters, is seen in the 1783 peace treaty with Great Britain, which fixed the Anglo-American boundary at the Great Lakes instead of the Ohio River. After independence, Mason drew up the plan for Virginia's cession of its western lands to the United States.\n\nBy the early 1780s, however, Mason grew disgusted with the conduct of public affairs and retired. He married his second wife, Sarah Brent, in 1780. In 1785 he attended the Mount Vernon meeting that was a prelude to the Annapolis convention of 1786, but, though appointed, he did not go to Annapolis.\n\nAt Philadelphia in 1787 Mason was one of the five most frequent speakers at the Constitutional Convention. He exerted great influence, but during the last 2 weeks of the convention he decided not to sign the document.\n\nMason's refusal prompts some surprise, especially since his name is so closely linked with constitutionalism. He explained his reasons at length, citing the absence of a declaration of rights as his primary concern. He then discussed the provisions of the Constitution point by point, beginning with the House of Representatives. The House he criticized as not truly representative of the nation, the Senate as too powerful. He also claimed that the power of the federal judiciary would destroy the state judiciaries, render justice unattainable, and enable the rich to oppress and ruin the poor. These fears led Mason to conclude that the new government was destined to either become a monarchy or fall into the hands of a corrupt, oppressive aristocracy.\n\nTwo of Mason's greatest concerns were incorporated into the Constitution. The Bill of Rights answered his primary objection, and the 11th amendment addressed his call for strictures on the judiciary.\n\nThroughout his career Mason was guided by his belief in the rule of reason and in the centrality of the natural rights of man. He approached problems coolly, rationally, and impersonally. In recognition of his accomplishments and dedication to the principles of the Age of Reason, Mason has been called the American manifestation of the Enlightenment. Mason died on October 7, 1792, and was buried on the grounds of Gunston Hall.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-CP-121)\n\nJames McClurg, Virginia\n\nJames McClurg was born near Hampton, VA, in 1746. He attended the College of William and Mary and graduated in 1762. McClurg then studied medicine at the University of Edinburgh and received his degree in 1770. He pursued postgraduate medical studies in Paris and London and published Experiments upon the Human Bile and Reflections on the Biliary Secretions (1772) in London. His work and writings were well-received and respected by the medical community, and his article was translated into several languages. In 1773 McClurg returned to Virginia and served as a surgeon in the state militia during the Revolution.\n\nBefore the end of the war the College of William and Mary appointed McClurg its professor of anatomy and medicine. The same year, 1779, he married Elizabeth Seldon. James McClurg's reputation continued to grow, and he was regarded as one of the most eminent physicians in Virginia. In 1820 and 1821 he was president of the state medical society.\n\nIn addition to his medical practice, McClurg pursued politics. In 1782 James Madison advocated McClurg's appointment as secretary of foreign affairs for the United States but was unsuccessful. When Richard Henry Lee and Patrick Henry declined to serve as representatives to the Constitutional Convention in 1787, McClurg was asked to join Virginia's delegation. In Philadelphia McClurg advocated a life tenure for the President and argued for the ability of the federal government to override state laws. Even as some at the convention expressed apprehension of the powers allotted to the presidency, McClurg championed greater independence of the executive from the legislative branch. He left the convention in early August, however, and did not sign the Constitution.\n\nJames McClurg's political service did not end with the convention. During George Washington's administration McClurg served on Virginia's executive council. He died in Richmond, VA, on July 9, 1823.\n\nEdmund Randolph, Virginia\n\nOn August 10, 1753, Edmund Randolph was born in Tazewell Hall, Williamsburg, VA. His parents were Ariana Jenings and John Randolph. Edmund attended the College of William and Mary and continued his education by studying the law under his father's tutelage.\n\nWhen the Revolution broke out, father and son followed different paths. John Randolph, a Loyalist, followed the royal governor, Lord Dunmore, to England, in 1775. Edmund then lived with his uncle Peyton Randolph, a prominent figure in Virginia politics. During the war Edmund served as an aide-de-camp to General Washington and also attended the convention that adopted Virginia's first state constitution in 1776. He was the convention's youngest member at age 23. Randolph married Elizabeth Nicholas in 1776.\n\nRandolph continued to advance in the political world. He became mayor of Williamsburg and Virginia's attorney-general. In 1779 he was elected to the Continental Congress, and in November 1786 Randolph became Governor of Virginia. In 1786 he was a delegate to the Annapolis Convention.\n\nFour days after the opening of the federal convention in Philadelphia, on May 29, 1787, Edmund Randolph presented the Virginia Plan for creating a new government. This plan proposed a strong central government composed of three branches, legislative, executive, and judicial, and enabled the legislative to veto state laws and use force against states that failed to fulfill their duties. After many debates and revisions, including striking the section permitting force against a state, the Virginia Plan became in large part the basis of the Constitution.\n\nThough Randolph introduced the highly centralized Virginia Plan, he fluctuated between the Federalist and Antifederalist points of view. He sat on the Committee of Detail that prepared a draft of the Constitution, but by the time the document was adopted, Randolph declined to sign. He felt it was not sufficiently republican, and he was especially wary of creating a one-man executive. He preferred a three-man council since he regarded \"a unity in the Executive\" to be the \"foetus of monarchy.\" In a Letter . . . on the Federal Constitution, dated October 10, 1787, Randolph explained at length his objections to the Constitution. The old Articles of Confederation were inadequate, he agreed, but the proposed new plan of union contained too many flaws. Randolph was a strong advocate of the process of amendment. He feared that if the Constitution were submitted for ratification without leaving the states the opportunity to amend it, the document might be rejected and thus close off any hope of another plan of union. However, he hoped that amendments would be permitted and second convention called to incorporate the changes.\n\nBy the time of the Virginia convention for ratification, Randolph supported the Constitution and worked to win his state's approval of it. He stated his reason for his switch: \"The accession of eight states reduced our deliberations to the single question of Union or no Union.\"\n\nUnder President Washington, Edmund Randolph became Attorney General of the United States. After Thomas Jefferson resigned as Secretary of State, Randolph assumed that post for the years 1794-95. During the Jefferson-Hamilton conflict he tried to remain unaligned. After retiring from politics in 1795, Randolph resumed his law practice and was regarded as a leading figure in the legal community. During his retirement he wrote a history of Virginia. When Aaron Burr went on trial for treason in 1807, Edmund Randolph acted as his senior counsel. In 1813, at age 60 and suffering from paralysis, Randolph died while visiting Nathaniel Burwell at Carter Hall. His body is buried in the graveyard of the nearby chapel.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-CCD-40)\n\nGeorge Washington, Virginia\n\nThe eldest of six children from his father's second marriage, George Washington was born into the landed gentry in 1732 at Wakefield Plantation, VA. Until reaching 16 years of age, he lived there and at other plantations along the Potomac and Rappahannock Rivers, including the one that later became known as Mount Vernon. His education was rudimentary, probably being obtained from tutors but possibly also from private schools, and he learned surveying. After he lost his father when he was 11 years old, his half-brother Lawrence, who had served in the Royal Navy, acted as his mentor. As a result, the youth acquired an interest in pursuing a naval career, but his mother discouraged him from doing so.\n\nAt the age of 16, in 1748, Washington joined a surveying party sent out to the Shenandoah Valley by Lord Fairfax, a land baron. For the next few years, Washington conducted surveys in Virginia and present West Virginia and gained a lifetime interest in the West. In 1751-52 he also accompanied Lawrence on a visit he made to Barbados, West Indies, for health reasons just before his death.\n\nThe next year, Washington began his military career when the royal governor appointed him to an adjutantship in the militia, as a major. That same year, as a gubernatorial emissary, accompanied by a guide, he traveled to Fort Le Boeuf, PA, in the Ohio River Valley, and delivered to French authorities an ultimatum to cease fortification and settlement in English territory. During the trip, he tried to better British relations with various Indian tribes.\n\nIn 1754, winning the rank of lieutenant colonel and then colonel in the militia, Washington led a force that sought to challenge French control of the Ohio River Valley, but met defeat at Fort Necessity, PA - an event that helped trigger the French and Indian War (1754-63). Late in 1754, irked by the dilution of his rank because of the pending arrival of British regulars, he resigned his commission. That same year, he leased Mount Vernon, which he was to inherit in 1761.\n\nIn 1755 Washington reentered military service with the courtesy title of colonel, as an aide to Gen. Edward Braddock, and barely escaped death when the French defeated the general's forces in the Battle of the Monongahela, PA. As a reward for his bravery, Washington rewon his colonelcy and command of the Virginia militia forces, charged with defending the colony's frontier. Because of the shortage of men and equipment, he found the assignment challenging. Late in 1758 or early in 1759, disillusioned over governmental neglect of the militia and irritated at not rising in rank, he resigned and headed back to Mount Vernon.\n\nWashington then wed Martha Dandridge Custis, a wealthy widow and mother of two children. The marriage produced no offspring, but Washington reared those of his wife as his own. During the period 1759-74, he managed his plantations and sat in the Virginia House of Burgesses. He supported the initial protests against British policies; took an active part in the nonimportation movement in Virginia; and, in time, particularly because of his military experience, became a Whig leader.\n\nBy the 1770s, relations of the colony with the mother country had become strained. Measured in his behavior but strongly sympathetic to the Whig position and resentful of British restrictions and commercial exploitation, Washington represented Virginia at the First and Second Continental Congresses. In 1775, after the bloodshed at Lexington and Concord, Congress appointed him as commander in chief of the Continental Army. Overcoming severe obstacles, especially in supply, he eventually fashioned a well-trained and disciplined fighting force.\n\nThe strategy Washington evolved consisted of continual harassment of British forces while avoiding general actions. Although his troops yielded much ground and lost a number of battles, they persevered even during the dark winters at Valley Forge, PA, and Morristown, NJ. Finally, with the aid of the French fleet and army, he won a climactic victory at the Battle of Yorktown, VA, in 1781.\n\nDuring the next 2 years, while still commanding the agitated Continental Army, which was underpaid and poorly supplied, Washington denounced proposals that the military take over the government, including one that planned to appoint him as king, but supported army petitions to the Continental Congress for proper compensation. Once the Treaty of Paris (1783) was signed, he resigned his commission and returned once again to Mount Vernon. His wartime financial sacrifices and long absence, as well as generous loans to friends, had severely impaired his extensive fortune, which consisted mainly of his plantations, slaves, and landholdings in the West. At this point, however, he was to have little time to repair his finances, for his retirement was brief.\n\nDissatisfied with national progress under the Articles of Confederation, Washington advocated a stronger central government. He hosted the Mount Vernon Conference (1785) at his estate after its initial meetings in Alexandria, though he apparently did not directly participate in the discussions. Despite his sympathy with the goals of the Annapolis Convention (1786), he did not attend. But, the following year, encouraged by many of his friends, he presided over the Constitutional Convention, whose success was immeasurably influenced by his presence and dignity. Following ratification of the new instrument of government in 1788, the electoral college unanimously chose him as the first President.\n\nThe next year, after a triumphal journey from Mount Vernon to New York City, Washington took the oath of office at Federal Hall. During his two precedent-setting terms, he governed with dignity as well as restraint. He also provided the stability and authority the emergent nation so sorely needed, gave substance to the Constitution, and reconciled competing factions and divergent policies within the government and his administration. Although not averse to exercising presidential power, he respected the role of Congress and did not infringe upon its prerogatives. He also tried to maintain harmony between his Secretary of State Thomas Jefferson and Secretary of the Treasury Alexander Hamilton, whose differences typified evolving party divisions from which Washington kept aloof.\n\nYet, usually leaning upon Hamilton for advice, Washington supported his plan for the assumption of state debts, concurred in the constitutionality of the bill establishing the Bank of the United States, and favored enactment of tariffs by Congress to provide federal revenue and protect domestic manufacturers.\n\nWashington took various other steps to strengthen governmental authority, including suppression of the Whisky Rebellion (1794). To unify the country, he toured the Northeast in 1789 and the South in 1791. During his tenure, the government moved from New York to Philadelphia in 1790, he superintended planning for relocation to the District of Columbia, and he laid the cornerstone of the Capitol (1793).\n\nIn foreign affairs, despite opposition from the Senate, Washington exerted dominance. He fostered United States interests on the North American continent by treaties with Britain and Spain. Yet, until the nation was stronger, he insisted on the maintenance of neutrality. For example, when the French Revolution created war between France and Britain, he ignored the remonstrances of pro-French Jefferson and pro-English Hamilton.\n\nAlthough many people encouraged Washington to seek a third term, he was weary of politics and refused to do so. In his \"Farewell Address\" (1796), he urged his countrymen to forswear party spirit and sectional differences and to avoid entanglement in the wars and domestic policies of other nations.\n\nWashington enjoyed only a few years of retirement at Mount Vernon. Even then, demonstrating his continued willingness to make sacrifices for his country in 1798 when the nation was on the verge of war with France he agreed to command the army, though his services were not ultimately required. He died at the age of 67 in 1799. In his will, he emancipated his slaves.\n\nImage: Courtesy of National Portrait Gallery, Smithsonian Institution\n\nGeorge Wythe, Virginia\n\nGeorge Wythe, the second of Thomas and Margaret Wythe's three children, was born in 1726 on his family's plantation on the Back River in Elizabeth City County, VA. Both parents died when Wythe was young, and he grew up under the guardianship of his older brother, Thomas. Though Wythe was to become an eminent jurist and teacher, he received very little formal education. He learned Latin and Greek from his well-educated mother, and he probably attended for a time a grammar school operated by the College of William and Mary.\n\nWythe's brother later sent him to Prince George County to read law under an uncle. In 1746, at age 20, he joined the bar, moved to Spotsylvania County, and became associated with a lawyer there. In 1747 he married his partner's sister, Ann Lewis, but she died the next year. In 1754 Lt. Gov. Robert Dinwiddie appointed him as acting colonial attorney general, a position that he held for only a few months. The next year, Wythe's brother died and he inherited the family estate. He chose, however, to live in Williamsburg in the house that his new father-in-law, an architect, designed and built for him and his wife, Elizabeth Taliaferro. They married in 1755, and their only child died in infancy.\n\nAt Williamsburg, Wythe immersed himself in further study of the classics and the law and achieved accreditation by the colonial supreme court. He served in the House of Burgesses from the mid-1750s until 1775, first as delegate and after 1769 as clerk. In 1768 he became mayor of Williamsburg, and the next year he sat on the board of visitors of the College of William and Mary. During these years he also directed the legal studies of young scholars, notably Thomas Jefferson. Wythe and Jefferson maintained a lifelong friendship, first as mentor and pupil and later as political allies.\n\nWythe first exhibited revolutionary leanings in 1764 when Parliament hinted to the colonies that it might impose a stamp tax. By then an experienced legislator, he drafted for the House of Burgesses a remonstrance to Parliament so strident that his fellow delegates modified it before adoption. Wythe was one of the first to express the concept of separate nationhood for the colonies within the British empire.\n\nWhen war broke out, Wythe volunteered for the army but was sent to the Continental Congress. Although present from 1775 through 1776, Wythe exerted little influence and signed the Declaration of Independence after the formal signing in August 1776. That same year, Wythe, Jefferson, and Edmund Pendleton undertook a 3-year project to revise Virginia's legal code. In 1777 Wythe also presided as speaker of the Virginia House of Delegates.\n\nAn appointment as one of the three judges of the newly created Virginia high court of chancery followed in 1778. For 28 years, during 13 of which he was the only chancellor, Wythe charted the course of Virginia jurisprudence. In addition, he was an ex officio member of the state superior court.\n\nWythe's real love was teaching. In 1779 Jefferson and other officials of the College of William and Mary created the first chair of law in a U.S. institution of higher learning and appointed Wythe to fill it. In that position, he educated America's earliest college-trained lawyers, among them John Marshall and James Monroe. In 1787 he attended the Constitutional Convention but played an insignificant role. He left the proceedings early and did not sign the Constitution. The following year, however, he was one of the Federalist leaders at the Virginia ratifying convention. There he presided over the Committee of the Whole and offered the resolution for ratification.\n\nIn 1791, the year after Wythe resigned his professorship, his chancery duties caused him to move to Richmond, the state capital. He was reluctant to give up his teaching, however, and opened a private law school. One of his last and most promising pupils was young Henry Clay.\n\nIn 1806, in his eightieth year, Wythe died at Richmond under mysterious circumstances, probably of poison administered by his grandnephew and heir, George Wythe Sweeney. Reflecting a lifelong aversion to slavery, Wythe emancipated his slaves in his will. His grave is in the yard of St. John's Episcopal Church in Richmond.\n\nBack to Main Founding Fathers Page"}, {"url": "https://encyclopediavirginia.org/entries/blair-james-ca-1655-1743/", "page_content": "Early Years Blair was probably born in Edinburgh, Scotland, around 1655, the eldest of three sons and four daughters of Peter Blair, a clergyman, and Mary Hamilton Blair. After beginning his formal education at Marischal College, Aberdeen, Blair studied at the University of Edinburgh from 1669 to 1673, when he received the degree of master of arts. He remained at Edinburgh for several additional years studying theology. In the summer of 1679 he was ordained by John Paterson, bishop of Edinburgh. Henry, Bishop of London That same summer Blair was appointed minister at Cranstoun Parish, a few miles outside Edinburgh. He remained two and a half years, serving, according to the bishop, “with exemplary diligence, care and gravity,” although a dispute with parish landowners over his reimbursement for repairs to the manse suggests that the combative nature that he later exhibited in Virginia was already well developed. In December 1681 Blair was removed from his parish after he refused to subscribe to a test oath that the Scottish Parliament imposed because it would have required him to accept the Roman Catholic duke of York as head of the Scottish church when he became king. Blair left for England, where he gained the support of Gilbert Burnet, a fellow Scottish cleric who later became bishop of Salisbury. Burnet secured Blair a clerkship in the Rolls Office and provided him an opportunity to meet other influential Anglican clerics, including Henry Compton, who as bishop of London had jurisdiction over the Anglican church in the American colonies. Compton persuaded Blair to accept an appointment in Virginia as rector of Henrico Parish (then frequently referred to as Varina Parish).\n\nIn Virginia Sarah Harrison Blair Blair’s career advanced rapidly after his arrival in Virginia late in 1685. Preaching at other parish churches as well as at his own, he came to know and be known to members of the colony’s most important families. Within two years he made the first of many land purchases, and on June 2, 1687, he married seventeen-year-old Sarah Harrison, of Surry County. The marriage was unhappy. At the wedding she adamantly refused to assent to the portion of the ceremony obliging her to obey her husband. They apparently had no children, and she may have become an alcoholic. Sarah Harrison Blair died on May 5, 1713, and James Blair lived another thirty years as a widower. Blair’s marriage brought him into the inner circle of the colony’s leading families, and his relatives often dominated the influential governor’s Council. His ecclesiastical career prospered. In mid-May 1690 a new lieutenant governor, Francis Nicholson, arrived in Virginia, bringing a commission of December 15, 1689, from Bishop Compton naming Blair commissary, or the bishop’s representative with authority to preside over the Anglican clergy of the colony in administrative matters. Often thought to have been the first to hold that office in Virginia, Blair had in fact been preceded in the post by John Clayton. Royal Charter for the College of William and Mary Blair moved without delay to establish his authority by calling a convocation of the clergy for July 23, 1690. Neither his Scottish origins nor his tendency to side with the Virginia laity in religious affairs endeared him to the larger number of his fellow clerics, who often opposed him vigorously, especially in the infrequent convocations that he called. The convocations held in August 1705 and April 1719 proved particularly rancorous. In the latter meeting his fellow clergymen unsuccessfully challenged the validity of his ordination in Scotland, a move that could have lost him his influential positions as rector and commissary. Blair’s initial convocation was more auspicious, however, for he there first advanced “Several Propositions” for the founding of a college in the colony and won enthusiastic support. In cooperation with Nicholson, who deserves to rank with Blair as a cofounder, he cultivated the support of Virginia’s political leaders. By June 1691 Blair left for England to seek the backing of King William, Queen Mary, and others. His mission required almost two years and resulted in the grant of a royal charter for the College of William and Mary on February 8, 1693, as well as substantial public and private financial support.\n\nEducation and Politics Sir Edmund Andros Blair returned to Virginia in triumph. Named president for life in the charter, he launched the new college on land acquired at the crossroads settlement of Middle Plantation a few miles from the capital at Jamestown. His task was not easy. In his absence enthusiasm for the project had declined, and Sir Edmund Andros, the new governor, was openly hostile. Blair nonetheless managed to inaugurate one branch of the institution, its grammar school, and to commence construction of a building. Over Andros’s objections Blair also secured a place on the Council, taking his seat for the first time on July 18, 1694. The next year he consolidated his position when he became rector of James City Parish, close to the seat of government as well as the new college. Blair’s relations with the governor soon worsened, and following his public criticism of Andros and the other councillors, they suspended him on April 26, 1695. He was reinstated on September 25, 1696, but suspended again on April 20, 1697. The infighting between Blair and Andros culminated in the summer of 1697 when, with financial and political backing from Francis Nicholson, Blair returned to England to present his grievances to ecclesiastical and political authorities. A key hearing before the archbishop of Canterbury and bishop of London was a one-sided affair with Blair able to speak in person to the sympathetic panel. The absent Andros was primarily represented by the young William Byrd (1674–1744), who was never allowed to deliver the lengthy brief he had prepared. On May 31, 1698, Andros was granted permission to resign and return to England on personal business. The Present State of Virginia, and the College. During his English sojourn Blair collaborated with two other men experienced in the government of Virginia, Henry Hartwell and Edward Chilton, in preparing a long report for the newly created Board of Trade on the state of affairs of the colony and how to improve it. Published nearly thirty years later as The Present State of Virginia, and the College (1727), it quickly became one of the more influential contemporary books about the condition of Virginia and the lives of Virginians at the end of the seventeenth century. Nicholson succeeded Andros as governor in December 1698 shortly after Blair’s return to Virginia. Blair was eventually reappointed to the Council, taking his seat on June 9, 1701, and serving for the remainder of his life. Although he cooperated with Nicholson in 1699 in a successful effort to move the capital from Jamestown to Middle Plantation, which was renamed Williamsburg, the two equally imperious men came into conflict during the next few years. The ill will culminated in Blair’s second trip to England to lobby for the removal of a governor. He left in 1703, bearing a petition that he and five other Council members had signed. Nicholson was at a distinct disadvantage due to his inability to appear in person, the death early in the hearings of his principal defender, and the capture by the French of the vessel carrying his supporting documentation. On April 5, 1705, the Board of Trade removed Nicholson as governor of Virginia. Old Bruton Church, Williamsburg, Virginia, in the Time of Lord Dunmore Blair’s success was, however, hardly complete. Nicholson remained a trustee of the college and continued with the support of most of Virginia’s Anglican clergy to oppose Blair’s direction of the college and his attempts to govern the colonial church. Then on October 29, 1705, the main college building caught fire and burned to its exterior walls. The resultant inquiry stirred further animosity between Blair and his opponents. In 1710 the death of one of his most outspoken clerical opponents, Solomon Whateley, afforded Blair the opportunity to become rector of Bruton Parish Church in Williamsburg, and for more than a decade he had no serious difficulty with Governor Edward Nott or his successor, Lieutenant Governor Alexander Spotswood. Blair used the time to solidify his position with Virginia political leaders. By that time, too, his brother Archibald Blair (by 1665–1733), a physician who had also immigrated to Virginia, had established himself as a successful Williamsburg merchant in a firm in which James Blair, to his considerable profit, became a silent partner. Alexander Spotswood Rebuilding the college was a more serious challenge, but Blair made the first of two rescues of William and Mary from the brink of failure. With the help of Spotswood and others, he found new money in England and America, began reconstruction of the college building that was first occupied by 1716 and largely completed by 1721, and for the first time expanded instruction beyond the grammar school by appointing a master of the Indian School and the first professor of natural philosophy and mathematics, Hugh Jones. As early as 1718 or 1719, however, Blair became embroiled in a controversy with Spotswood. The issues at stake had more to do with religious and political matters than with the college, and they again brought Blair into conflict with his fellow clerics, including the faculty. In 1721 he set off for England again. On this occasion, however, Spotswood was already in difficulty with his superiors on other grounds, and thus the commissary’s role in his dismissal has often been overemphasized, adding to Blair’s not entirely deserved reputation as a breaker of governors. The trip afforded Blair an opportunity to arrange for publication in London of Our Saviour’s Divine Sermon on the Mount (1722), a five-volume collection of 117 sermons he had delivered between 1707 and 1721. True to character, Blair was dissatisfied with sales, but the sermons were reprinted in four volumes in 1740 and in Danish in 1761. The sermons dealt more with matters of morality and personal conduct than with doctrine, a reminder that, despite his other concerns and interests, Blair was an active parish minister throughout his long career.\n\nLater Years The Bodleian Plate Engraved Copperplate of Colonial-Era Williamsburg\n\nPrint Made from Bodleian Copperplate\n\nHugh Drysdale Blair was in his late sixties when he returned from England on the same ship with the new lieutenant governor,. Blair appeared to be at the height of his power in the political establishment of Virginia. Yet despite its new building the college that he had founded and headed for more than three decades was once again on the verge of extinction, with a dearth of funds and students and a curriculum confined to precollegiate instruction in the grammar and Indian schools. Blair set to work and by the end of the 1720s had achieved nothing less than a second founding of the institution, helped again by a period in which few political issues diverted him from the task. A round of new construction added the Brafferton (1723) to house the Indian school and the library, a chapel wing on the main building (1732), and a president’s house (1733). The crowning achievements, however, were the preparation of the first college statutes in 1727; the hiring for the first time of the full complement of six masters, including professors of moral and natural philosophy and divinity; and with those preconditions met, the transfer of the original charter of 1693 into the hands of the president and masters on August 15, 1729. Blair was able to use his secure position in the social and political elite of Virginia to contribute significantly to the evolution of autonomous institutions in the colony. Rather than an outpost of imperial culture controlled by a largely English clerical faculty, under Blair’s guidance William and Mary became a college governed primarily by prominent colonists who sat on its board of visitors and shaped it to serve their educational goals. Likewise, Blair’s actions as commissary aided the development of an established Anglican church dominated by laymen who ran its parish vestries, a model that more closely resembled the operations of the church in Scotland during Blair’s youth and ministry in that country than it did the functioning of the parent Church of England during the eighteenth century. Blair’s relations with Lieutenant Governor William Gooch, the last chief executive on whose Council he served, were amicable. Gooch’s private opinion of Blair was negative, but he resolved to “kill him with kindness.” By then Blair was declining in health and vigor. In his last years he retained all of his official positions as president of the college, commissary, parish rector, and councillor, although he was not always able to perform all of his duties. The senior member of the Council, Blair served as president (in effect, acting governor) from October 15, 1740, to July 1741 while Gooch was away on a military expedition to the West Indies. Ruins of the Churchyard, Jamestown. The childless Blair had a sizable estate to dispose of when he composed his will in 1743. He made several charitable bequests, including £100 for teaching poor children and £500 for the education of a clergyman. He left his books to the library of the College of William and Mary and the remainder of his estate, estimated at £10,000, to his favorite nephew John Blair (ca. 1687–1771), whose education he had overseen. James Blair died in Williamsburg of a gangrenous rupture on April 18, 1743. He was buried beside his wife in the Jamestown churchyard."}, {"url": "https://encyclopediavirginia.org/entries/jefferson-thomas-and-the-practice-of-law/", "page_content": "Legal Training Jefferson attended the College of William and Mary, in Williamsburg, from 1760 to 1762. After ending his studies, he was back in Williamsburg by 1763, this time to study law. No formal law schools existed at the time; instead, students spent years serving as apprentices or clerks to established attorneys. Jefferson studied under George Wythe, with whom he had formed a close bond while in college. An eminent lawyer with liberal views on religion, slavery, and republicanism, Wythe saw little benefit in the drudgery of traditional legal training and preferred to have his students read law reports and foundational English legal writings, such as those by Sir Edward Coke. (Jefferson later came to strongly dislike the commentaries of Sir William Blackstone, insisting that American law was being degraded by the increasing use of that work, at the expense of Coke, in the training of lawyers.) Wythe paired this academic foundation with the practical training necessary to understand how Virginia landowners managed their own affairs and those of the colony. He accomplished the latter by sending his students to observe cases being argued before the General Court and by supervising moot-court exercises. These two aspects of Jefferson’s legal training—the study of law as political philosophy and as practical grounding for the management of plantation property—served Jefferson’s gentry clients well, but they also shaped Jefferson’s intellectual and political roles in nation-building. In the decades to come, the law played a critical role in Jefferson’s project to create, as he wrote in his Autobiography (1821), a “system by which every fibre would be eradicated of antient or future aristocracy; and a foundation laid for a government truly republican.” Upon being examined late in 1765 by a panel of three men—Wythe, Jefferson’s cousin John Randolph, and Robert Carter Nicholas—Jefferson qualified to practice before Virginia’s county courts. He chose to practice at the General Court, however, a bar that required another year’s wait for admission. He attended his first session in October 1767, and in so doing became the youngest member of an elite group. In his eight years of practice, only ten other lawyers qualified to practice before the General Court.\n\nBuilding a Practice With the exception of a few men trained in Britain’s Inns of Court and admitted as barristers there, Virginia lawyers were prohibited from practicing in both the county courts and the General Court. This meant that General Court lawyers like Jefferson could specialize in representing clients with business in the capital, where the court convened. Additionally, of those lawyers admitted to practice in Williamsburg, Jefferson, in Albemarle County, resided the farthest west, making him well positioned to serve clients at the forefront of westward migration and investment. As a result, Jefferson’s practice grew rapidly, with his first cases involving the quieting of titles. A procedure by which clients sought to be assured that their land titles were legitimate, quieting required someone to research government records to check that the title had been properly registered and its quitrents paid. The Crown collected a fee called a quitrent on lands patented in its colonies, but in Virginia, it was common practice for buyers, and especially land speculators, to avoid paying the quitrent by taking out a warrant of survey on a piece of land and holding it indefinitely, without a patent. Other owners allowed their patents to lapse without the land-use requirements having been met, leaving titles open to challenge and even grant to another claimant. Jefferson generally tasked such research to several agents in Williamsburg, but on those occasions when actual title challenges occurred, he dutifully represented his clients before a judge. Still, a large practice built on transactions allowed Jefferson, not a skilled public speaker, to spend less time inside a courtroom than other lawyers, and to instead exploit his meticulous attention to detail and his deep knowledge of English law. Soon becoming an expert in the highly complex world of estate law, Jefferson was especially active in drawing wills and in offering counsel to other attorneys on difficult matters related to wills and trusts. In order to build his practice, Jefferson acquainted himself with county-court lawyers by regularly traveling to western counties on those days when local attorneys gathered to do their courts’ business. Occasionally he had the good fortune to be introduced to the local bar by someone such as John Madison Sr., the clerk of the Augusta County Court, whose son Jefferson had met while a student. As the Virginia colony’s westernmost county, Augusta lay over the Blue Ridge Mountains in the Shenandoah Valley and extended as far west as the Mississippi River. By the end of 1768, his first full year of practice, Jefferson had visited eight other western counties as well as several to the east of Albemarle. Meanwhile, Jefferson’s knowledge of the personnel and workings of legal institutions in Williamsburg became a lucrative source of clients, and he soon was able to build a network of attorneys who brought him business from dozens of counties across the colony. Although it took him five days on horseback, he made the 120-mile trip to Williamsburg three times a year—for the April and October sessions of the General Court and for the June meeting of the governor’s Council. His collaborations there with such men as Wythe, Thomson Mason, Edmund Pendleton, John Blair Jr., and John Randolph enhanced his reputation and, moreover, provided contact with the leading attorneys of the county bar, which, in turn, brought him more business. With such an advantage, Jefferson was able to gradually reduce his travel and limit his regular trips beyond Albemarle to Williamsburg and Staunton, the seat of Augusta County.\n\nLand and the Law Jefferson’s involvement in the land business, which included his own dealings, represented the largest number of cases that he handled. For Jefferson, the frontier became central to his vision of a successful republic: it provided yeoman freeholders enough land for their subsistence, but land ownership also provided the common interests by which such men banded together as citizens of a single nation. Yet what Jefferson saw of the land market offered troubling reminders of the elitist quality of society and politics, and how that pattern was being replicated on the frontier. Wealthy landowners in the eastern Tidewater were granted vast tracts of land by the colony, and ambitious speculators assembled dozens of grants into baronial holdings. Jefferson represented many of these men and provided necessary counsel for their land acquisitions. Yet at the same time—especially after an embarrassing venture in support of speculators backfired—he also represented many small landholders. In fact, such clients made up the vast majority of those whose land claims he handled; more than four out of five clients dealt in small to middling tracts of 400 acres or less. Jefferson’s practice, therefore, was hardly a simple matter of preserving the status quo. When he asserted that “Those who labour in the earth are the chosen people of God,” he was not just reflecting on a way of life; he was articulating his belief that the personal autonomy of the freeholder was essential to the creation of the “government truly republican” that he envisioned. By this way of thinking, land served as more than an economic commodity. It also had social and political purpose. Its accumulation by a few families threatened to reproduce the world of rural England, with a small number of landed aristocrats and a large body of renters. It was a situation that concerned many in Virginia—including some of its wealthiest citizens, who recognized that such an unwieldy accumulation of property prevented land from circulating and being put into productive use. The use of primogeniture and entail epitomized this system. These feudal English property rules, respectively, kept land in the hands of a single heir (the eldest son) and protected it from answering any debts accumulated by spendthrift offspring; the result, Jefferson complained in his Autobiography, was the “accumulation and perpetuation of wealth, in select families.” Far preferable, he believed, was the distribution of lands “appropriated in small quantities.” To circumvent these rules required a skilled lawyer such as Jefferson, who could disencumber large blocks of land for clients. His efforts against primogeniture and entail did not end in the courtroom, and after the American colonies declared independence he drafted the statutes that helped to abolish the system—entail in 1776 and primogeniture in 1785.\n\nThree Cases By handling land cases, Jefferson witnessed the tension between the interests of wealthy landowners and small landholders. Jefferson himself, however, moved in Virginia’s upper echelons of society and politics. And by dint of this social prestige, coupled with his legal acumen, he was entrusted with a variety of often-delicate cases, two of which put him in the middle of warring elite families. In Bolling v. Bolling (1771), Jefferson argued against his old teacher, George Wythe. The case involved a dispute between two brothers, Robert Bolling and Archibald Bolling, over the will of their brother Edward Bolling, who had died the year before. Already connected to the family—Jefferson’s sister Mary Jefferson Bolling was married to a fourth brother, John Bolling—Jefferson agreed on September 13, 1771, to represent the defendant, Robert Bolling. Jefferson’s and Wythe’s arguments, preserved in a 239-page handwritten manuscript, were often highly technical and for that reason were presented to a qualified arbitrator rather than to the lay members of the General Court. The prevailing party in Bolling v. Bolling is not known, but the case has been hailed for the erudition of its arguments and for what it reveals about the law in Jefferson’s time. According to the historian Bernard Schwartz, the case “strikingly demonstrates that American law was still essentially the common law” and that “with regard to both substance and technique, Westminster Hall and the Virginia General Court were not as far apart as they might have seemed.” John Murray, Fourth Earl of Dunmore Two years later, Jefferson became involved in another family dispute, this one centered on a sensational scandal. The marriage between Dr. James Blair, of Williamsburg, and Catherine “Kitty” Eustace, of New York, consecrated in 1771, dissolved quickly amid rumors of Blair’s “incompetence” and an affair between Kitty Blair and the governor, John Murray, earl of Dunmore. Sometime around November 25, 1772, when he made note of the case in his account book, Jefferson was asked to investigate the possibility of divorce, for which there was no legal precedent in Virginia. Jefferson took notes outlining the history of divorce and how legislation granting it might read, but such a bill was never presented to the General Assembly. Then, on December 26, Dr. Blair died, and, in apparent contradiction to Virginia law, his will left the widow no portion of the estate. In Blair v. Blair—an appeal before the General Court after the James City County Court denied Kitty Blair’s claim—Virginia’s attorney general, John Randolph (acting privately), and Patrick Henry argued on behalf of the widow, while Edmund Pendleton and James Mercer argued on behalf of the estate. Jefferson also was retained by the estate but did not participate in oral arguments. He later provided a thorough account of the arguments made and the case’s outcome, in favor of Kitty Blair. Jefferson did not always represent elite interests, however. As a student, he had closely examined all the major precedents concerning the status of slavery in English law and concluded that it had no basis in either common law or statute. In the course of his practice, he became known as an advocate for those whose enslavement he could challenge in novel ways based on precedent and statutory interpretation. The most famous of these cases was Howell v. Netherland (1770). Samuel Howell was a mixed-race indentured servant whose grandmother had been a free white woman; his grandfather was black. While Virginia law prescribed that the offspring of white women and black men be made servants until they reached the age of thirty-one, their children’s children were held to no such commitment. (If a child’s mother was black, then the law had long been clear: her children were slaves.) “Now it is plain,” Jefferson maintained, applying a strict construction to the law, “the plaintiff does not come within the description of the act.” Without positive law, no legal means existed to enforce the enslavement, and natural law thus governed: “under that law we are all born free.” Howell lost his case, but Jefferson charged him no fee, a practice he followed in six other suits for freedom.\n\nLaw and Liberties Declaration of Independence Jefferson’s interest in natural law, as opposed to common law or the statutes written by legislatures, dated back to his early legal studies. While under Wythe’s tutelage, Jefferson had meticulously “commonplaced,” or summarized, the reports of English judges. In doing so, he found himself attracted to the writings of a particular group of judges who had been active during the tumultuous seventeenth century. Their decisions provided Jefferson with precedents and principles for his developing philosophy of rights. Although Jefferson’s philosophy is commonly seen as one of natural rights assured, as he wrote in the Declaration of Independence, by “the Laws of Nature and of Nature’s God,” he actually drew far more heavily on an English “whig” tradition of resistance to arbitrary power. Jefferson later wrote about how, when he wrote summaries, he “sometimes mix[ed] my own reflections on the subject … [T]hey were written at a time of life when I was bold in the pursuit of knolege, never fearing to follow truth and reason to whatever results they led, & bearding every authority which stood in their way.” Sr. Edward Coke Lord Chief Justice Among the authorities who influenced him most were Sir Edward Coke, who championed the guarantees of the Magna Carta (1215) in Parliament’s opposition to the Crown early in the seventeenth century, and Sir John Holt, chief justice of the King’s Bench from 1689 to 1710, whom Jefferson called “the greatest lawyer England ever had, except Coke.” From them he assembled his own principles of government based on personal freedom and limited government. Jefferson’s “Summary View of the Rights of British America,” written as instructions for Virginia’s delegation to the First Continental Congress in July 1774, rejected the feudal origins of American rights. Instead, he drew heavily on principles of land law to argue that the colonists held their rights, like their property, in freehold and beyond royal demands. His Declaration of Independence presented the liberties of Americans as held in trust by the Crown. In violating those liberties, King George III forfeited his role as trustee. Though he had seen the importance of judicial opposition to tyranny, Jefferson remained skeptical of broad judicial authority. As such, he firmly believed that judges must adhere to the will of the people by interpreting laws faithfully, according to a strict construction of their language. He also sharply criticized Virginia’s first constitution for its lack of a bill of rights, believing that it left the power of the General Assembly dangerously unrestrained."}, {"url": "https://www.qmul.ac.uk/law/people/academic-staff/items/blair.html", "page_content": "Profile\n\nSir William (Bill) Blair is a Professor of Financial Law and Ethics at Queen Mary University of London, Centre for Commercial Law Studies (CCLS), Queen Mary University of London (QMUL) and a member of the Institute of Banking and Finance Law, CCLS.\n\nBill is also an Associate Member of leading barristers’ Chambers at 3 Verulam Buildings (3VB), London, in the International Advisory and Dispute Resolution Unit (IADRU) from which he is now sitting as an international arbitrator.\n\nAs a leading practitioner in the field of international banking and finance, he became a QC (Queen’s Counsel) in 1994 and was Chair of the Commercial Bar Association between 2003 and 2005.\n\nBill served as a High Court Judge in England and Wales for nearly ten years and was Judge in Charge of the London Commercial Court from 2016 helping to establish the specialist Financial List and the Standing International Forum of Commercial Courts. He has handed down many decisions in the field of arbitration and had overall responsibility for the arbitration cases as Judge in Charge. He continues to sit occasionally in the Court.\n\nBill sits as a Deputy Judge of the Court of First Instance of the High Court of Hong Kong SAR, China, and in 2018 sat as a Judge of the Qatar International Court. He currently sits as an international arbitrator in ICSID and LCIA cases, and he is in the Beijing International Arbitration Center’s Panel of Arbitrators.\n\nIn 2018, he was appointed a member of the International Commercial Expert Committee of the Supreme People’s Court of the People’s Republic of China, and he is Chair of the Enforcement Decision Making Committee of the Bank of England\n\nAt the European Union level, he is President of the Board of Appeal of the European Supervisory Authorities. He is a member of London’s Financial Markets Law Committee and chairs the Monetary Law Committee of the International Law Association. He is a member of the Expert Working Group on Commercial Dispute Resolution of the Chinese and UK judiciaries, and an expert adviser to the Oxford University OBOR Institute.\n\nBill graduated from Oxford University, and holds or has held visiting Professorships at the London School of Economics (LSE), Peking University Law School (PKU), East China University of Political Science and Law (ECUPL), is Cheng Yu Tung Visiting Professor, Faculty of Law, University of Hong Kong (HKU), and a Fellow of the Oxford University Commercial Law Centre. He is a member of P.R.I.M.E. Finance's Advisory Board and its Panel of Experts.\n\nIn 2018, Bill joined the Ethics Committee of Digital Catapult’s AI Machine Intelligence Garage."}, {"url": "https://www.britannica.com/biography/Tony-Blair", "page_content": "First term\n\nBlair enjoyed a 179-seat majority in the House of Commons—the biggest parliamentary majority in the history of the Labour Party and the largest majority of any party since 1935. Inspired by sociologist Anthony Giddens, he described his philosophy of government as the “Third Way.” Blair claimed that his policies were designed to enable social democracy to respond to the challenges of the worldwide market economy and to equip citizens to cope with what Giddens called “the major revolutions of our time,” including globalization. Perhaps the most coherent view about Blair’s search for the Third Way was that it was an endeavour to discover a form of progressive politics distinguishing itself from the conservatism of both left and right. Blair frequently looked for advice from businessmen who had come to prominence earlier, under the Conservative prime minister Thatcher. Private firms were given an important role in financing state infrastructure projects, despite widespread criticism that this financing was on terms often disadvantageous to the taxpayer.\n\nBlair gave control of the economic agenda to Gordon Brown, his chancellor of the Exchequer and eventual successor. The Blair government’s first major initiative—and perhaps its boldest—granted the Bank of England the power to determine interest rates without government consultation, a policy that had not appeared in the party’s platform. The government also immediately signed the Maastricht Treaty’s Social Chapter and turned its attention to brokering a peace agreement between republicans and unionists in Northern Ireland. Blair initiated reforms in the House of Commons, modernizing the format of “Prime Minister’s Question Time,” during which the prime minister answers questions from members of Parliament. During his first year in office, he organized referenda that created devolved assemblies in Scotland and Wales and developed a joint committee to coordinate constitutional and other policies with the opposition Liberal Democrats.\n\nBlair also gave important powers to unelected advisers, notably media consultant Alistair Campbell. The marketing image they adopted, known as “Cool Britannia,” suggested that Britain was a dynamic and successful country that had reinvented itself after years of decline and internal division. New Labour eagerly sought the approval of the mass-circulation press, particularly conservative tabloids such as The Sun, by embracing celebrity culture as well as respect for traditions, including the monarchy.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn May 1998 Blair led a successful referendum campaign to create a new assembly for London and to establish the city’s first directly elected mayor. That year Blair also helped to negotiate the Good Friday Agreement (Belfast Agreement), which was ratified overwhelmingly in both Ireland and Northern Ireland and which created an elected devolved power-sharing assembly in Northern Ireland for the first time since 1972. Blair also eliminated all but 92 of the hereditary members of the House of Lords as the prelude to more-extensive reforms of that chamber.\n\nThe population began to grow skeptical of Blair as a new election approached, as it became clear that his government remained highly centralized and that he had no plans for overdue reforms in the public services. Opinion polls found that there was public concern regarding financial misbehaviour in government, manipulation of the media, the granting of honours to individuals who contributed to Labour Party funds, nepotism, and other actions that put the interests of business before ordinary citizens."}, {"url": "https://en.law.pku.edu.cn/newsevents/global/32309.htm", "page_content": "On January 8, 2017, William Blair, Judge of the High Court of England and Wales, was invited to visit our institute and was appointed Distinguished Visiting Professor of Peking University Law School. Sir Robin Knowles, Judge of the High Court of England and Wales, visited our institute as well. Dean Zhang Shouwen , Associate Dean Guo Li and Professor Lou Jianbo and the two judges cordially met, talked about the Peking University Law School and the Sino-British cooperation in the development of the rule of law.\n\n\n\n\n\nOn behalf of the law school, Dean Zhang Shouwen extended a warm welcome to Mr. Blair’s visit and reviewed the scene of the first visit to Peking University Law School by Justice Blair in May 2016. Judge Blair and the teachers and the students of the School of Law had a cordial and friendly chat. Judge Blair is a famous legal scholar, has a profound knowledge in the field of theoretical research in commercial law and financial law, and also has a wealth of practical experience in the judiciary. Peking University Law School sincerely invited Blair to be a visiting professor of our school. We believe that Mr. Blair’s joining will play a vital role in the discipline construction, legal research and personnel training of law schools and will greatly promote closer and in-depth cooperation between Peking University Law School and the British academic and professional institutions.\n\nJustice Blair thanked Dean Zhang Shouwen and Peking University Law School for his warm reception, and was very pleased to be able to visit Peking University Law School again. He had a deep memory of the previous visit to Peking University Law School, the students’ active thinking, accurate expression left him a deep impression. He is very honored to be a visiting professor at Peking University Law School,and he will work hard with the teachers and students of the law school to carry out relevant academic activities and promote the construction and development of disciplines. Justice Blair also briefed the current situation of cooperation between the High Court of England and Wales and the Supreme People’s Court of China. Following last May, the delegation of the Supreme Court of the United Kingdom, Liao Baijia, visited China, and after the visit Vice President He Rong of China's Supreme People's Court led a delegation to visit Britain. The Chinese and British sides promoted the establishment of the Judicial Expert Working Group. Justice Blair and Justice North have not only pursued the first meeting of the Chinese and English Judges' Expert Working Group, but also hope to take this opportunity to further explore how to strengthen the research and cooperation of the Supreme Court in the field of commercial justice.\n\nSubsequently, Dean Zhang Shouwen awarded Justice Blair the letter of appointment for Peking University Law School visiting professor. Justice Blair was pleased to accept the letter and took photos.\n\n\n\n\n\nAttached by brief introduction of Sir Blair,Judge of the High Court of England and Wales:\n\nSir William Blair graduated from Oxford University, where he studied banking law and financial law and represented many domestic and international disputes and cases and provided counseling services.\n\nJustice Blair became Queen's Counsel in 1994 and served as Chairman of the Commercial Bar Association from 2003 to 2005.In 2008, he was appointed judge of the High Court of England and Wales.Currently he served as president of the commercial court.\n\nPrior to March 2011, Blair served as Chairman of the Qatar Financial Center Superintendent's Office and became Chairman of the EMEA Appeals Board in 2012. He is a former member of the Council of Comparative Law and International Law Institute and a member of the London Financial Markets Law Committee and Chairman of the International Law Association's Currency Law Committee (MOCOM-ILA). This organization brings together financial law and leaders in the legal and ethical areas of financial engineering, an informal group that focuses on financial industry standards.\n\nJustice Blair visited Peking University Law School on May 26, 2016, and had friendly exchanges with teachers and students on legal education, practice and cooperation."}, {"url": "https://www.theguardian.com/uk/2000/may/21/tonyblair.politics4", "page_content": "The new Leo Blair has been born into a life of privilege and stability that could not be more different from the world his grandfather - who he is named after - entered in August 1923.\n\nLeo senior was the son of travelling entertainers who gave him up to a poor Clydeside shipyard worker, James Blair, and his wife, Mary. But details of his origins were shrouded in mystery, with Leo himself unaware of much of his 'real' family's life.\n\nMary Blair was determined to obliterate her foster child's true beginnings. While he was away on active service in the Second World War, she told his mother and his half-sisters that he was missing, presumed dead. They accepted her story.\n\nIt was only after Tony Blair became Labour leader that press articles prompted a reunion which enabled Leo to fit the scattered pieces of his life together.\n\nHis real parents, Celia Ridgeway and Charles Parsons, were not married when Leo was born in Filey, North Yorkshire. Celia was the daughter of a wealthy West Sussex landowner. She married at 17 and had two daughters, Jenefee and Pauline, before she became a dancer and started a relationship with Leo's father. The social stigma, combined with the family's lifestyle, prompted his parents to give up their baby to the Blairs, who they met while on tour in Glasgow.\n\nMary had had two miscarriages and feared she would never have children. She adored Leo, who accompanied her on left-wing rallies. When he left school he worked as a copy boy on the Communist Party newspaper Daily Worker and was secretary of the Scottish Young Communist League from 1938 to 1941.\n\nWhile he was away during the war, Mary Blair burned the contents of a biscuit tin he kept under his bed: treasured letters, cards and photographs from his sisters and real mother, whom he had last seen when he was 13. Celia had come to ask if she might have Leo back but Mary, apparently, threatened to kill herself. Leo had by then decided that 'Ma Blair' was his real mother and opted to stay in Glasgow.\n\nLeo challenged Mary about the missing tin but he did not know she had killed him off. He did not question the sudden halt in the once-regular flow of correspondence from his blood relatives, believing he had been forgotten by them.\n\nA year after he returned from the army, Leo changed his name by deed poll from Leo Charles Augusta Parsons to Leo Charles Lynton Blair - names inherited by his youngest son.\n\nA classic self-made man, Leo studied law in his spare time and became a barrister and a law lecturer at Durham University. His ambition to be a somebody led him to radical reform of his politics. He became chairman of the Durham Conservative Association and was an admirer of Thatcher and Tebbit.\n\nHe spent considerable energy grooming his son Tony who, at 12, stood as a Conservative 'candidate' in his school's mock elections. Leo's own political dreams were effectively dashed two years earlier when he suffered a stroke, aged 40.\n\nBy 1995, Tony was leader of the Labour Party and Leo, then chairing the industrial tribunal in Shrewsbury where he now lives, underwent another political conversion at the age of 71. He joined the Labour Party, citing objections to rail privatisation and pride at his son's achievement.\n\nThe publicity about Blair's leadership caught the attention of Leo's half-sister Pauline Harding in 1994; by then she was 90 years old, living in Ealing and still in possession of a last, battered photograph of her half-brother.\n\nShe contacted the Blair family and this led to a reunion which Jenefee was too senile to attend. After 50 years apart, the meeting at the Islington home of Leo's oldest son, Bill, was emotional. Leo recalled: 'Pauline and I were so overcome we stood hugging each other and she kept saying: \"What wasted years? What wasted years?\"'\n\nTony Blair has spoken of his closeness to his father, whom he has described as a 'very ambitious man, successful, a go-getter'. But Leo remains his own man. He and his second wife, Olwyn (his first wife Hazel, Tony's mother, died of throat cancer in 1975) are believed to have taken out private health insurance earlier this year - a propaganda coup for the Tory party."}, {"url": "https://adb.anu.edu.au/biography/tait-sir-james-blair-14882", "page_content": "by J. D. Merralls\n\nSir James Blair Tait (1890-1983), barrister and company director, was born on 15 October 1890 at Geelong, Victoria, second son of New South Wales-born John Tait, bank accountant, and his Victorian-born wife Margaret Agnes, née Thomson. James was educated at the Geelong College, then worked as an accountant and law clerk while he studied law part time at the University of Melbourne (LL.B, 1916). On 5 January 1917 he enlisted in the Australian Flying Corps, Australian Imperial Force. In June he sailed for England where he served as a transport driver then qualified as a pilot. Commissioned in June 1918, he flew on operations in France with No.3 Squadron from September and rose to lieutenant that month. His AIF appointment was terminated in Australia on 16 July 1919.\n\nTait signed the roll of counsel of the Victorian Bar on 11 September 1919 and became the third, and last, pupil in the chambers of (Sir) Owen Dixon. Drawing upon his accountancy experience, he tended to concentrate as a barrister on commercial and taxation work, often representing the Commonwealth commissioner of taxation. His dry style of advocacy was not suited to work before juries. On 24 May 1922 at St Cuthbert’s Presbyterian Church, Brighton, he married Annie Frances Howard. They had a son and a daughter. In the 1920s he was the author and co-author of several books on company law and accountancy.\n\nDuring World War II Tait was chairman of the Australian Hirings Commission, which was responsible for the leasing of properties for defence purposes. He refused the rank of brigadier and served as a civilian. Maintaining his professional practice, he appeared, usually for the Commonwealth, in many cases involving the validity and operation of the national security regulations, which governed much of civil life during the war. On 9 January 1945 he took silk. The Commonwealth retained him as one of its twelve counsel in the 1948 bank nationalisation case. In 1950 Tait was appointed by the incoming Liberal-Country Party government as chairman of a committee of inquiry into stevedoring practices; the report criticised the conduct of both the companies and unions.\n\nClosely involved with the Victorian Bar, Tait was a councillor (1939-74), chairman (1952-53) and treasurer (1957-74). He was also a director (1939-61) of the company that owned Selborne Chambers. When the need for further accommodation became pressing in the 1950s, Tait was one of a small group which, despite opposition from some influential senior barristers, organised the construction of Owen Dixon Chambers as the home of the Bar. He was the first chairman (1961-79) of the company that owned and operated those chambers. Without his commercial relationship with banks and insurance companies it is doubtful whether they could have been built.\n\nTait was knighted in 1963. His wife Annie had died the previous year, and on 29 September 1964 he married his deceased brother’s widow, Edith Sophie Charlotte Thomson-Tait (née Rogers), in St Faith’s Chapel, Westminster Abbey, London. Withdrawing from active practice in 1969, Tait supervised the barristers’ superannuation fund until 1982. He became both an elder statesman of the Bar and the guardian of the material interests of many of its members. A set of chambers, later acquired for the Bar but since demolished, was named in his honour.\n\nFrom 1939 Tait had been a director, often chairman, of many companies, among them the Equity Trustees’ Executors & Agency Co. Ltd, the Colonial Mutual Life Assurance Society Ltd, Grouped Holdings Australia Ltd, Robertson & Mullens Pty Ltd and Godfrey Phillips International Pty Ltd. He remained an active company director until well into his eighties. As chairman of Equity Trustees he was involved in public controversy in 1972 over the company’s refusal to register the transfer of shares to interests believed to be seeking to control the company. The company’s action led to its suspension from stock exchange quotation. He held to the company’s position until the threat to its independence abated.\n\nSir James died on 4 July 1983 at Mont Park and was cremated with Anglican rites. Predeceased (1974) by his son, he was survived by his wife and the daughter of his first marriage. In outward appearance he was a somewhat reserved, austere man, a characteristic that was accentuated because he outlived most of his contemporaries. The Victorian Bar in Owen Dixon Chambers holds a portrait by Paul Fitzgerald."}, {"url": "https://allthingsliberty.com/2017/06/scandalous-divorce-case-influenced-declaration-independence/", "page_content": "During the hot, humid Philadelphia summer of 1776, the writing of the Declaration of Independence was just another Congressional housekeeping chore which the delegates decided would have to be done to explain to people everywhere why the vote for American independence had just happened. As Thomas Jefferson later described it: “an appeal to the tribunal of the world was deemed proper for our justification.”[1] If John Adams had known the importance that history would place upon the legalistic piece of parchment, there’s no doubt he would’ve held on to the sub-committee assignment for his own composition and his own immortality. But as it was, Adams was bogged down by being on an extensive number of committees, many of which he chaired,[2] and he was overloaded with work. The Declaration writing sub-committee[3] assigned the writing of the document (or ironically Adams possibly could’ve assigned it away from himself) to the new guy, Thomas Jefferson, a recently arrived Continental Congress delegate from Virginia.\n\nJefferson knew what had to be said in the justification for separation, having silently sat through the many long Congressional debates. Once tasked with the assignment, he probably started arranging the thoughts and statements in a logical order, drawing from Enlightenment theories that he was very familiar with,[4] coupled with thoughts and phrases from the recent document by his friend George Mason, the Virginia Declaration of Rights. The Declaration of Independence’s famous list of gripes about King George III could be picked up and re-shuffled from Jefferson’s most recent assistance with the Virginia Constitution. Jefferson would also probably mentally recall details from the recent Declaration of the Causes and Necessity of Taking Up Arms, and Jefferson’s own searing indictment of British tyranny, A Summary View of the Rights of British America. Overall, many decades later he recalled in writing the Declaration, “I know only that I turned to neither book or pamphlet while writing it,”[5] “nor yet copied from any particular and previous writing.”[6] Whether Jefferson was mis-remembering details from nearly fifty years earlier doesn’t really matter. Jefferson knew the “natural rights” material cold. However, it was his eloquent phrasing and poetic cadence, especially of the Declaration’s preamble, that still rings out as the anthem of an entire nation. Adams’ version of the Declaration might’ve been a real legalistic yawner.\n\nBut of course, always-angry Adams would later poo-poo Jefferson’s inspired sources. “There is not an idea in it, but what had been hackney’d in Congress for two years before.”[7] Sounding like an unemotional librarian, Adams added,\n\nLook in the Journal of Congress 1774 for the Declaration of the Rights of the Colonies, and in the Journal of 1776. Month of May for a Resolution of Independence. Then consider Whether the Declaration of Independence of 4. July 1776 is any thing more than a juvenile declamation founded on those two Documents.[8]\n\nBut while those two hash it out, we might look back to 1772 to perhaps another inspirational source for Jefferson, when he was first actively weighing out the legality and sovereignty that British law still had upon the American colonists. His deep examination of a particular legal case may have been the first inklings of what would become a justification for a logical break from the mother country, and so would require a Declaration to explain it. It would be a scandalous Virginia divorce case, ironically, that could have been an early source of Jefferson’s first thoughts on the subject of the dissolution of unions. “The case of Blair v. Blair[9]… foreshadowed much of what was to come on a greater scale: the argument for divorce from Britain.”[10]\n\n“Permission to treat the bride as hostile?”\n\nIn November of 1772 divorce was much on the mind of Thomas Jefferson. No, not for himself. In fact, Thomas had just married Martha Wayles Skelton eleven months earlier. Their first baby, Martha, called “Patsy,” had just been born in September 1772, one month premature, but would survive and grow to become Jefferson’s longest living acknowledged child.\n\nJefferson had just accepted a sensational divorce case from John Blair, Jr. his College of William and Mary law cohort. Blair, who had just recently been appointed time clerk of Williamsburg’s Royal Governor’s Council, needed to distance himself from the case which involved his brother’s marriage. In the meantime, Jefferson had been well aware of the popular, shocking and sordid details of the marital case between Dr. James Blair, the brother of Jefferson’s friend, and Blair’s bride, Catherine “Kitty” Eustace, younger than her groom by ten years. In fact, everyone in Williamsburg was aware of the Blair wedding scandal and savored every detail. To bring you up to date on the case points:\n\nIn 1770, James Blair had just finished medical school in Edinburgh, Scotland and was looking forward to a thriving medical practice in Virginia. But he was suddenly stricken with seizures from an unspecified disease. A trip to the curative waters in Bath, England didn’t seem to help, although the symptoms had lessened. So Dr. Blair returned to Williamsburg and started his career in medicine, probably hoping that the mystery illness had no lasting effects.\n\nIn the meantime in 1769 and again in 1770, two lovely women, a mother and daughter duo fresh from New York, were noticed visiting Norfolk, Virginia. Following the death of her husband, Dr. John Eustace, Margaret Eustace had started traveling with her young daughter, Catherine “Kitty” Eustace, whom she called “Kitt.” The two Eustace women traveling unescorted hadn’t escaped the attention of Norfolk residents, especially of local merchant James Parker and his wife. Every town needed its nosey gossip mongers, and Parker appears to fit the bill in colonial Norfolk. His gossipy letters to fellow merchant (and Eustace family friend) Charles Steuart in Portsmouth, Virginia will be frequently quoted in this story, because they give insight into the case and because they’re hilarious.\n\nIn August 1770, Mrs. James Parker dropped a polite line to Steuart saying, “Mrs. Eustace and her pretty daughter [are] really two very agreeable ladies.”[11]\n\nBy late spring 1771, however, Dr. Blair’s wealthy father, John Blair, Sr., was ill and ready to make out his will. The senior Blair had been in the House of Burgesses and was four times acting Virginia governor. The Blair family had founded the College of William and Mary. He had much wealth and extensive land holdings in Virginia and around Williamsburg, including having owned the Raleigh Tavern. The John Blair house on Duke of Gloucester Street in Williamsburg is still one of its oldest buildings. It wasn’t a hidden secret in Williamsburg that young Dr. Blair was soon to inherit a small fortune.\n\nIn May 1771 gossipy ol’ Jim Parker was penning this bulletin to Steuart:\n\nKitty Eustace, the chip which you forwarded to this country, is to be married immediately after the General Court to Doctor Blair … I think the doctor will marry more than one … The mother and her must go together. She’s a clever, managing sort of a lady and has played her cards exceedingly well.[12]\n\nSo the wedding bells rang out in Williamsburg on May 21, 1771 for the happy groom and bride, Dr. and Mrs. Blair. Apparently, (from all references read) the marriage broke up immediately, if not the next day. The blushing bride moved in with her mom, just down the street “not 100 paces off,”[13] and sued her husband for three separate claims, one of which is what we call alimony today.\n\nWhen Kitty told the court there would be no arbitration, the court denied all of her claims and ordered a reconciliation of the newlyweds. Because social pressure decreed a wife does not abandon her husband (and because she had no other choice for a livelihood really), Kitty moved back in with her doctor husband. For four months, all of Williamsburg then watched for signs of renewed “felicity” between the couple, but they were disappointed and gossip seemed to turn dull again. Until September, 1771.\n\nThat’s when the new royal governor rolled into Williamsburg. He was the flamboyant Scotsman, John Murray, the Fourth Earl of Dunmore. He had been a family friend of the Eustace’s in New York, and it didn’t hurt that in the Royal Court of St. James he and King George III had been childhood friends and had shared a common tutor. It wasn’t long after his arrival before Kitty was bringing welcome wagon gifts to the new guy in town. Hushed rumors began taking wings again, this time that Mrs. Blair and the Earl were having an affair! Everyone seemed to know it; well, except for Dr. Blair. Following an uncomfortable dinner party attended by many residents, including Dr. and Mrs. Blair, the mother-in-law, and Dr. Blair’s sister Anne at the Governor’s Palace in May 1772, Nosey Parker reported to Steuart,\n\nA most damnable fuss has been at Williamsburg with Dr. Blair and his rib. Nothing was talked of but separation … but … they are seemingly reconciled and she was to let him make a push the night we left the Court.[14]\n\nAnd yet a couple of weeks later, on June 12, a new Parker dispatch to Steuart went out:\n\nThere’s nothing yet done at Williamsburg in Kitty’s case. We thought the matter was entirely settled … but it seems she jumped out of bed and would do nothing …. There never was such a piece of work, Her thing is talked of all over the country.[15]\n\nThe very public soap opera continued when on July 18 Kitty sent Anne Blair, her sister-in-law, a confidential letter in which she admitted she hadn’t married Dr. Blair for love (shocker). She headed the letter, “My dearest Nanny, the sister of my Heart” and confessed it was only the Blair family affection for her that enabled “me to discharge the most rigid duties of a good wife.” But Kitty also shared the “Indignities” she had had to suffer “from cruel & hard hearted Strangers.”[16]\n\nIn a still-yet bizarre side note, in the boarding house run by Kitty’s mother, Margaret Eustace, one of her boarders and College of William and Mary student St. George Tucker was shown an unsigned, anonymous letter to Margaret containing a good gossipy statement. The letter said, “I have believed & Experience will confirm it that Doctor Blair is incompetent,”[17] which in colonial marital terms does not mean “ineffectual.” Tucker, a little taken back by his land-lady’s disclosure, suggested she just ignore it.\n\nBut amazingly, somehow in tattle tale Williamsburg, the content of the anonymous letter started spreading everywhere. A special delivery communication went out on November 18, from Nosey Parker to Steuart:\n\nMatters are now come to an open rupture at Williamsburg. The old lady persists her daughter is still a maid, and that the Dr. never has and indeed cannot do as a man should do.[18]\n\nDr. Blair was not amused about the rumors. But when he’d also heard that there might be a thing going on between his wife and the governor, Blair dashed off a fiery note to His Lordship. Dunmore read the letter and called in John Blair, the doctor’s brother and Jefferson’s friend. He threatened that if Dr. Blair didn’t retract his letter, John would be forever unemployed with the Governor’s Council – and probably in all of Williamsburg or Virginia. Dr. Blair gave in and retracted the letter, but was totally exasperated. It seems that Kitty Blair had filed in court, again, for “separate maintenance” (a.k.a. alimony).\n\nTo counter her latest filing, Dr. Blair wanted a divorce. John Blair asked Jefferson for help. The problem was that getting a divorce in colonial Virginia was impossible.\n\nThe Right to Divorce, Whether Couples or Continents\n\nVirginia, like other southern colonies, was still tightly bound to old English law. It literally took an Act of Parliament through a British ecclesiastical court to get a divorce, and even then it was actually just an annulment. Rarely, one could get a kind-of -divorce “from bed and board.” But that was what we call a legal separation today and even after that, the two parties could not remarry. Even more rare was a divorce through an English criminal court, but that was extremely expensive. There had been only one of those since 1699 in England.\n\nSo divorce, as so many other things (like selling colonial tobacco on the British market for whatever price it sold for) left Americans helpless to control large aspects of their lives. Colonists had started to feel like second-class people, having to blindly obey laws from a kingdom across the ocean. Jefferson, like fellow Virginian George Washington, was feeling more like an insignificant subject ruled by an inflexible British system of growing oppression, in which the colonists had no voice. A change in the ancient English divorce law in Virginia could be seen at least as a small step up the American ladder of self-rule. Thomas Jefferson accepted the divorce case.\n\nFor a solid month, from November 25, 1772, the date of Jefferson’s retainer in Dr. Blair’s case,[19] to December 26, 1772, Jefferson studied the philosophy and theories of divorce from his law library at Monticello. As always, he took extensive notes on the subject, which still exist. He pondered subjects as the justifiable grounds for separation, the pros and cons of keeping together an abusive bond, and many other conditions he listed – which could be easily read as the same reasons that would be debated a little over three years later in the Continental Congress in Philadelphia.\n\nFrom a legal precedence, Jefferson was justifying the change in divorce law (and potentially, American independence) on the premise that after a colony was established or “seated” a continent away, restrictive English laws were null and void in that colony. So in the case of Virginia and Jamestown, settled officially in 1607, England’s ecclesiastical divorce laws wouldn’t be valid in Virginia. In fact, Jefferson reasoned, Parliament had no legislative power to even rule for or against them within Jefferson’s “country”[20] of Virginia.\n\nFinally, Jefferson’s divorce notes include the phrase “natural rights,” a theory that he was already very familiar with from Enlightenment thought. It simply stated that personal human rights emanate not from Parliamentary laws, but exist in the state of nature granted by God.[21] It was also an overarching ideal woven throughout the Declaration of Independence.\n\nInitially, through the case of Blair v. Blair, Thomas Jefferson was planning on changing divorce law in Virginia for the benefit of his client. But he was also indirectly making another small dent in the total control that Great Britain exercised in directing virtually every aspect of American life, without, of course, any American representation in British Parliament. When the Virginia General Assembly reconvened in spring 1773, Jefferson planned on proposing a bill he was writing, allowing a special legislative divorce for Dr. Blair. The plan was all set.\n\nBut unfortunately, on December 26, 1772, Dr. James Blair died.\n\nHe had been at the Albemarle County house of his uncle, Dr. George Gilmer (or “Gilmour”),[22] and no foul play was suspected. The plans for the divorce and the Virginia legislative divorce bill were of course shelved. But Dr. Blair had one last card to play after his death. Contrary to social custom and Virginia law, he had left Kitty zero dollars or anything in his last will and testament. Kitty sued in James City County court for her lawful inheritance of the huge estate which included in Williamsburg “two parcels … houses and Lotts,”[23] “Tenements”[24] and elsewhere two large plantations and slaves (called “dower rights”) that James had inherited from his wealthy father, John Blair, Sr., at his death in November 1771. But Kitty’s latest suit was denied on February 14, 1773. Jefferson charged no fee to his friend, John, for providing the estate defense.[25] So Kitty took her appeal to the General Court of Virginia, where William Byrd III was co-judge along with (coincidentally) her old friend Lord Dunmore.\n\nJohn Blair, Jr., the doctor’s brother and the estate executor, smelled a victory for Kitty. So he hired Edmund Pendleton and James Mercer as defense attorneys. He also again hired his old school friend Thomas Jefferson, but for reasons unclear Jefferson seemed to act as only a consultant to the other two attorneys. He did, however, take tons of notes during the trial, as always.\n\nKitty Eustace Blair was intent on winning. So she hired Virginia’s attorney general (and Jefferson’s cousin) John Randolph, who moonlighted as a lawyer, along with fiery orator and legend Patrick Henry. Jefferson probably groaned because although he and Henry agreed completely on issues of tyranny and liberty, Jefferson couldn’t stand the guy when it came to legal case preparation. He hated Henry’s pompous oratories and sloppy discipline of the facts, saying of his arguments during this case “Henry for the plaintiff avoided, as was his custom, entering the lists of the law, running wild in the field of fact.”[26]\n\nThe Final Round of Blair v. Blair\n\nThe final Blair v. Blair case with its celebrated cast finally rolled into General Court, and was argued and decided on November 3, 1773. Of note, much testimony seemed to revolve around the sexual aspects of the primary characters. In Jefferson’s summary notes, he wrote that “The evidence was voluminous and indecent.”[27] Nosey Parker would’ve loved it. But the introduction of an adultery charge wasn’t to be heard in court, since that particular charge died when Dr. Blair and the divorce died. Besides, it would be awkward when one of the adultery suspects was one of the presiding judges. Instead, the tantalizing subject of marital consummation was mostly on the docket, since that was the litmus test if there truly was a legitimate marriage, which in turn would entitle Kitty to her lawful share of the estate. The courtroom, as you can guess, was packed to the walls and overflowing to the outside.\n\nRandolph advanced the weird theory that Kitty may have consummated the marriage physically, but not mentally. Henry had more of a reasonable legal argument that: a.) If the Blair’s had exchanged wedding vows and had retired to the “nuptial bed,”[28] then: b.) the whole thing could be considered a done deal. But: c.) if for some reason, a consummation hadn’t taken place because of “Dr. Blair’s impotence,”[29] then the legal doctrine of “tender and refusal”[30] applied. Meaning the wife was a player in the game, but the husband “opted out,” as it were.\n\nThe estate defense put on a good case stipulating over and over that the marriage was not consummated, a fact that both parties agreed on. The explicit details of consummation were not delved into by the defense because as Jefferson wrote “Ideas of decency require it to be secret.”[31] Much to the disappointment of the spectators.\n\nBut, surprise: Kitty won. She and her mom were jubilant. Margaret wrote to a family friend and lawyer in North Carolina, Thomas Burke, of her love of “my worthy friend [Patrick] Henry”; “He, they say, shined in the cause of justice backed by the law.”[32] Which I’m sure Jefferson would’ve wretched to have heard. The materialistic mother-in-law also noted to Burke, “All is settled respecting lands, negroes, money and the rest of the personal estate.”[33] No one questioned the possible bias of the judge, Lord Dunmore, who knew that once Kitty was financially rewarded, any other rumors of their earlier liaison adventures would be moot.\n\nA month later, in December 1773 Kitty was cashing out by running this ad in the Virginia Gazette: “On the 1st Day of January next will be sold to the highest Bidder, at publick Auction, at the Plantation of Doctor James Blair, deceased, in the Forks of Hanover County, one Moiety of all the said James’s personal Estate at that Place, consisting of CATTLE, HOGS, PLANTATION UTENSILS, etc. etc. At the same Time and Place will be rented out, to the best Bidder, all my Dower in the said Blair’s Lands and Slaves; among the Slaves there are six Workers.” The ad continues that on “Tuesday the 4th of January next” a similar everything-must-go “publick Auction” will be held at the deceased Blair’s Chickahominy Plantation in New Kent. The ad is signed “Catherine Blair.”[34]\n\nEven though Jefferson and the defendant hadn’t prevailed in Blair v. Blair, he “… had laid the groundwork for the dissolution of the union between colonies and mother country which took place three and a half years later.”[35]\n\nIf you’re wondering about the sordid aftermath: Kitty herself wrote to Blair (signing the letter – “C. Blair”) almost exactly a year later, while still living in Williamsburg. She had written under her signature “How long I shall be distinguished by this name I cannot positively say.”[36]\n\nShe didn’t have to wait for too long. Kitty married well again on February 8, 1777 to a prominent, rising Georgian star named Maj. Seth John Cuthbert.[37] Cuthbert had been a distinguished officer in the 2nd Georgia Continental Battalion; within two years of his marriage to Kitty, he was president of the Supreme Executive Council of Georgia (1779), and Georgia’s state treasurer (1784-1786) following the Revolutionary War.\n\nIt appears that Kitty’s mother also moved with the newlyweds to Savannah, Chatham County, Georgia to all begin their wedded bliss there. A few months later, however, it was noticed that Kitty Blair Cuthbert was back in Williamsburg, husband-less this time. The complete story is unknown, but Major Cuthbert later married a woman named Mary Clay in 1785 and they had two sons in the mid-to-late 1780s. He died in Savannah in September 1788 and Mary Cuthbert was officially listed as his widow.\n\nWhat happened to Kitty Cuthbert? No one knows. But it appears that Kitty died that same year (1788) because the November 13, 1788 edition of the Georgia Gazette listed Margaret Eustace of Chatham County petitioning to be estate executor of “Catherine Cuthbert (formerly Catherine Blair).” Two Cuthbert widows in 1788?\n\nSeth Cuthbert had married his second wife, Mary, before the death of his first wife, Kitty, from whom there are no records of a divorce. The Cuthbert family blames the confusion on record errors.\n\nJohn Blair, Jr., Jefferson’s schoolmate, made out better. Later, he was a Virginia delegate to the Constitutional Convention. Then in 1789, President George Washington nominated him to the United States Supreme Court.\n\n[1] Thomas Jefferson to Henry Lee, May 8, 1825, Founders Online, National Archives.\n\n[2] “During this time Adams served in a total of ninety committees, of which he chaired twenty. At the end of 1777 John Adams was simultaneously involved in twenty six committees, he was chairman of eight.” The John Adams Historical Society, http://www.john-adams-heritage.com/role-in-congress/ , accessed April 27, 2017.\n\n[3] Composed of John Adams, Benjamin Franklin, Robert R. Livingston, Roger Sherman, and Thomas Jefferson.\n\n[4] “… in the elementary books of public right, as Aristotle, Cicero, Locke, Sidney Etc.” Thomas Jefferson to Henry Lee, May 8, 1825, Founders Online, National Archives.\n\n[5] Thomas Jefferson to James Madison, August 30, 1823, Founders Online, National Archives.\n\n[6] Thomas Jefferson to Henry Lee, May 8, 1825, Founders Online, National Archives.\n\n[7] John Adams to Timothy Pickering, August 6, 1822, Founders Online, National Archives,\n\n[8] John Adams to Richard Rush, July 22, 1816, Founders Online, National Archives.\n\n[9] Later in his life, Jefferson had listed what he’d considered his three most important cases: Howell v. Netherland (1770), Bolling v. Bolling (1771), and Blair v. Blair (1772).\n\n[10] James Kranish, Flight from Monticello: Thomas Jefferson at War (New York: Oxford University Press, 2010), 32.\n\n[11] “15 Aug 1770,” Charles Steuart Papers (MS 5040, f. 76); Charles Steuart Papers, Manuscript DMS 55.4, John D. Rockefeller, Jr. Library, Colonial Williamsburg Foundation; and in Frank L. Dewey, Thomas Jefferson, Lawyer (University Press of Virginia, Charlottesville, 1986), 59; Chapter 7 in the Dewey book, entitled “A Williamsburg Scandal: Notes on Divorce,” is considered the most thorough record of Blair v. Blair. Frank L. Dewey is a noted legal scholar.\n\n[12] “3 May 1771,” Charles Steuart Papers (MS 5025, f. 265), and in Dewey, Thomas Jefferson, Lawyer, 59.\n\n[13] Dewey, Thomas Jefferson, Lawyer, 59; also in “An Argument Before the General Court of Colonial Virginia“; Transcription from Jefferson’s original source summary notes: http://www.encyclopediavirginia.org/_An_Argument_Before_the_General_Court_of_Colonial_Virginia_1773, accessed April 29, 2017.\n\n[14] “25 May 1772,” Charles Steuart Papers (MS 5027, ff. 159); and in Dewey, Thomas Jefferson, Lawyer, 59.\n\n[15] “12 June 1772,” Charles Steuart Papers (MS 5027, ff. 178); and in Dewey, Thomas Jefferson, Lawyer, 60.\n\n[16] This letter is in the papers preserved by St. George Tucker in the “Tucker-Coleman Papers, 1664-1945” in Williamsburg: “Tucker-Coleman Papers, Special Collections Research Center, Swem Library, College of William and Mary;” also in Dewey, Thomas Jefferson, Lawyer, 60.\n\n[17] Ibid.\n\n[18] “18 Nov 1772,” Charles Steuart Papers (MS 5027, ff. 249); Dewey, Thomas Jefferson, Lawyer, 62.\n\n[19] “Nov. [25], 1772 Catharine Blair wife of James Blair M. D. (Wmsbgh.) v. the sd. James Blair. A bill in Chancery for a specific performance of the condn. of a bond which was to give her half the estate of def. Empld. by def. if it should be brot. on again.” “Memorandum Books, 1772,” Founders Online, National Archives.\n\n[20] Jefferson often referred to Virginia as his “country.”\n\n[21] Jefferson often lower-cased “god.”\n\n[22] The Virginia Gazette (Purdie and Dixon) of December 31, 1772, announced: “Deaths: Doctor James Blair of this City: at Doctor Gilmour’s in Albemarle, where he lately went upon a Visit.”\n\n[23] The death of James’s father in November 1771 left James and his siblings very well off. Along with large real estate holdings and slaves, James was left the “Sum of One thousand Pounds” and other sizable bequeathing in his will: http://research.history.org/DigitalLibrary/view/index.cfm?doc=ResearchReports%5CRR1493.xml&highlight=#s18 , accessed April 29, 2017.\n\n[24] Ibid.\n\n[25] “Feb. [14], 1773. Catherine Blair (Wmsburgh.) v. John Blair (Wmsburgh.). Empld. by def. Charge no fee.” “Memorandum Books, 1773,” Founders Online, National Archives.\n\n[26] “An Argument Before the General Court of Colonial Virginia;” Transcription from Jefferson’s original source summary notes: “An Argument before the General Court of Colonial Virginia Anne Blair widow of Dr. Blair v. John Blair his executor” (Jefferson mistakenly wrote “Anne” instead of “Catherine”. Dr. Blair had a sister named Anne). http://www.encyclopediavirginia.org/_An_Argument_Before_the_General_Court_of_Colonial_Virginia_1773, accessed April 28, 2017.\n\n[27] Ibid.\n\n[28] Ibid.\n\n[29] Ibid.\n\n[30] Ibid.\n\n[31] Ibid.\n\n[32] Mrs. Eustace to Thomas Burke, November 4, 1773, The Thomas Burke Papers, #104, Southern Historical Collection, The Wilson Library, University of North Carolina at Chapel Hill; also in Dewey, Thomas Jefferson, Lawyer, 64.\n\n[33] Dewey, Thomas Jefferson, Lawyer, 64.\n\n[34] The Virginia Gazette (Purdie & Dixon), December 30, 1773.\n\n[35] Willard Sterne Randall, Thomas Jefferson – A Life (New York, Henry Holt and Company, 1993), 164.\n\n[36] C. (Kitty) Blair to Thomas Burke, November 18, 1774, The Thomas Burke Papers; and in Dewey, Thomas Jefferson, Lawyer, 64.\n\n[37] Called “J.J. Cuthbert” in William and Mary College Quarterly Historical Magazine, Volume 7, January 1899, No. 3, “Diary of John Blair,” 134."}]}