{"James Blair practiced law in South Carolina.": [{"url": "https://www.lawyerdb.org/Lawyer/Jim-Blair/", "page_content": "Lawyer\n\nJames A. Blair, III\n\nUniversity of Texas at Austin, B.A., 1987; Dallas Theological Seminary, Cert., 1989 Syracuse University College of Law, J.D., 1993\n\n55 E. Camperdown Way, Fourth Floor, 29601 P.O. Box 10648 Greenville , SC 29603\n\n, graduated from, is now employed by Nexsen Pruet, LLC atWhile being a member of He is a member of Rotary International, the International Council of Shopping Centers, and is the President of the University of Texas' South Carolina Texas Exes alumni chapter., James A. Blair, III is one of the more than one million lawyers in United States. Before choosing James A. Blair, III as your lawyer, you should consider whether James A. Blair, III offers free consultation, (if not) how much the initial interview costs, if there is any hidden attorney fees, what's the fee schedule, whether he or she has good community reputation and is able to provide a list of good references. You can also contact the Board of Professional Responsibility of the state bar, to find out if James A. Blair, III has ever been placed under any disciplinary actions. Please be aware that, though James A. Blair, III's office is located at Greenville, SC, he or she might belong to the bar association of other states.You should also ask how long the lawyer has been in practice, how much experience he or she has in cases like yours, and more importantly, the outcomes of those cases! Focus of the lawyer's practice and years of experience are also very important factors in your evaluation process. The more focused the lawyer's practice areas, the better service he or she could provide. So do not make decisions solely on one or two factors. Only hire lawyers you feel comfortable with as they will represent you and your interests, and you will be sharing private details about your life with them.James A. Blair, III has been admitted in 1993, South Carolina; U.S. Tax Court; U.S. District Court, Fourth Circuit; U.S. Court of Appeals, Fourth Circuit. His or her practice areas include Real Estate Law; Real Estate.James A. Blair, III's college and law school education includes University of Texas at Austin, B.A., 1987; Dallas Theological Seminary, Cert., 1989, Syracuse University College of Law, J.D., 1993. Other biographical background includes Representation of a commercial lender in an acquisition loan for a portion of a commercial/industrial park.. You should contact other lawyers and law firms nearby before choosing your legal representatives.If you are the owner or employee of Nexsen Pruet, LLC, and want to update the information, please create a new account and then Claim & Edit Nexsen Pruet, LLC. If you want to add your attorney firm, please create a new account"}, {"url": "https://lawyers.findlaw.com/profile/view/3221028_1", "page_content": "Use the up and down arrows to increase or decrease the rating\n\nHow would you rate your overall experience with this lawyer?\n\nYour opinion matters\n\nPlease share your opinion of working with this attorney. Do not reveal personal information or details about your case. All submitted reviews are shared with the attorney prior to publishing.\n\nYour feedback must be at least 50 characters.\n\nYour review must be at least 50 characters"}, {"url": "https://www.attorneys.org/james-a-blair-1170526", "page_content": "Is this your Attorney Profile?\n\nAbout James A Blair\n\nJames A Blair practices bankruptcy law in Greenville, SC, at Nelson Mullins Riley and Scarborough. James is a member of the South Carolina bar with 30 years of legal experience."}, {"url": "https://www.lawyer.com/james-allbright-blair-sc.html", "page_content": "\n\nLawyers with longer memberships tend to have more experience so we use the Membership date to help prioritize lawyer listings on search pages.\n\nVerified Credentials Date Verified\n\nAbove credentials have been verified independently by Lawyer.com."}, {"url": "https://www.lawyer.com/james-allbright-blair.html", "page_content": "\n\nLawyers with longer memberships tend to have more experience so we use the Membership date to help prioritize lawyer listings on search pages.\n\nVerified Credentials Date Verified\n\nAbove credentials have been verified independently by Lawyer.com."}, {"url": "https://law.justia.com/cases/south-carolina/supreme-court/1981/21358-1.html", "page_content": "275 S.C. 529 (1981)\n\n273 S.E.2d 536\n\nThe STATE, Respondent, v. Charles BLAIR, Appellant.\n\n21358\n\nSupreme Court of South Carolina.\n\nJanuary 5, 1981.\n\n*530 George E. Crosland, Jr. and John I. Rogers, III, Bennettsville, and Daniel T. Brailsford of Williams & Williams, Columbia, for appellant.\n\n*531 Atty. Gen. Daniel R. McLeod and Asst. Attys. Gen. Kay G. Crowe and Lindy P. Funkhouser, Columbia, and Sol. J. Dupre Miller, Bennettsville, for respondent.\n\nJanuary 5, 1981.\n\nGREGORY, Justice:\n\nAppellant Blair appeals his conviction of murder for the shooting death of his grandmother.\n\nBlair was charged with this crime in October 1977. That same month, pursuant to Section 44-23-410, Code of Laws of South Carolina (1976), the Honorable James A. Spruill, Jr., Circuit Judge, committed Blair to the South Carolina Department of Mental Health for examination and observation to determine his competency to stand trial. Section 44-23-410 provides:\n\n\"Whenever a judge of the circuit court, county court, or family court has reason to believe that a person on trial before him, charged with the commission of a criminal offense, is not fit to stand trial because such person lacks the capacity to understand the proceedings against him or to assist in his own defense as a result of a lack of mental capacity, the judge shall:\n\n(1) Order examination of such person by two examiners designated by the Department of Mental Health or the Mental Retardation Department or both; such examination shall be made within fifteen days after the court's order, or\n\n(2) Order such person committed for examination and observation to an appropriate facility for a period not to exceed fifteen days... The report of such examination shall be admissible as evidence in subsequent hearings pursuant to § 44-23-430....\"\n\nA report was issued January 6, 1978 declaring Blair incompetent to stand trial.\n\nOn June 15, 1978, the Richland County Probate Court, following a sanity hearing, determined Blair was no longer *532 mentally ill and returned him to the jurisdiction of the General Sessions Court.\n\nOn August 16, 1979, again pursuant to § 44-23-410, the Honorable C. Anthony Harris, Circuit Judge, ordered Blair recommitted to the Department of Mental Health for the purpose of determining his then competency to stand trial. In a report filed with the Marlboro County Clerk of Court on November 19, 1979, the staff of the Department of Mental Health concluded Blair was suffering from \"schizophrenia, paranoid type, not psychotic now,\" but that he was capable of standing trial.\n\nThereafter, neither party requested nor did the court order a hearing on the issue of Blair's competency to stand trial pursuant to § 44-23-430, Code of Laws of South Carolina (Cum. Supp. 1979), which provides:\n\n\"Upon receiving the report of the designated examiners the court shall set a date for and notify the person and his counsel of a hearing on the issue of his fitness to stand trial. The person shall be entitled to be present at such hearing and to be represented by counsel....\" (emphasis added)\n\nAt trial, Blair's only defense was insanity. The jury found him guilty of murder.\n\nAppellant Blair argues the trial court erred in failing to conduct a competency hearing pursuant to § 44-23-430. The State contends Blair waived the right by failing to request the hearing. In a similar case, the United States Supreme Court found a sanity hearing cannot be waived. Pate v. Robinson, 383 U.S. 375, 86 S. Ct. 836, 15 L.Ed. (2d) 815 (1966). In Pate, the accused failed to demand a sanity hearing. The hearing was provided by Illinois law. The Supreme Court found the fact counsel placed the accused's sanity in issue throughout the proceedings indicated the right was not waived. In the case at bar, Blair's sanity was the crucial issue throughout the trial. Therefore, *533 we find failure to request the hearing did not waive the right to such hearing.\n\nSince the right was not waived, the question becomes whether the hearing should have been held. Section 44-23-430 provides a competency to stand trial hearing \"shall\" be held after a psychiatric examination has been ordered under § 44-23-410.\n\nThe word \"shall\" may be construed as permissive to effect legislative intent, particularly when the statute directs a court to determine certain matters. 82 C.J.S. Satutes, § 380, at p. 881 (1953). However, a statutory provision is generally regarded as mandatory where the power or duty to which it relates is for the security or protection of private rights. 73 Am. Jur. (2d) Statutes, § 27, at p. 284 (1974); 82 C.J.S., supra. The statute is designed to protect the accused's right to a fair trial by a due process determination of his competency and fitness to stand trial.\n\nThe standard for determining whether an accused is entitled to a competency to stand trial hearing has been set forth in a recent case interpreting Pate v. Robinson, supra:\n\n\"The import of our decision in Pate v. Robinson is that evidence of a defendant's irrational behavior, his demeanor at trial and any prior medical opinion on competence to stand trial are all relevant in determining whether further inquiry is required, but that even one of these factors, standing alone, may, in some circumstances, be sufficient.\" Drope v. Missouri, 420 U.S. 162, 180, 95 S. Ct. 896, 43 L.Ed. (2d) 103 (1975).\n\nBlair had a history of mental disorders and past admissions to State Hospital in addition to a past adjudication of incompetence to stand trial in this case. Given these factors and mandatory wording of the statute, we conclude a competency to stand trial hearing should have been held.\n\n*534 In reversing the order of the trial judge and remanding the case for a competency to stand trial hearing, we follow a procedure enunciated in State v. Hamilton, 251 S.C. 1, 7, 159 S.E. (2d) 607 (1968). There, this Court remanded for a hearing to determine whether the police had probable cause to make the arrest in a murder case. This Court stated if, after the hearing, it was determined probable cause did not exist, an order reversing the conviction should be entered and a new trial granted. If, on the other hand, the hearing revealed the officers did have probable cause, the conviction would be upheld.\n\nSimilarly, on remand, if the hearing reveals Blair was incompetent to stand trial, an order reversing his conviction should be entered and a new trial granted when he is presently competent to stand trial. However, if the hearing reveals Blair was competent to stand trial, the conviction will stand.\n\nWe find the other exceptions raised by appellant to be without merit, and we dismiss them under Rule 23 of the Rules and Practice of this Court.\n\nRemanded with Instructions.\n\nLEWIS, C.J., and LITTLEJOHN, NESS and HARWELL, JJ., concur."}, {"url": "https://www.findagrave.com/memorial/7374147/james-blair", "page_content": "US Congressman. Nicknamed \"The Waxhaw Giant\". Elected to represent South Carolina's 9th District in the US House of Representatives, he served four terms, from 1821 to 1822 and from 1829 until his death. Blair was born in South Carolina's Waxhaw Settlement to a family of Irish-Scots immigrants. He became Sheriff of the Lancaster District while in his early 20s, and in 1818 was elected General of the State Militia's 8th Brigade. From roughly 1820 he operated a successful plantation along the Lynches River in the Kershaw District. Blair won his first term in the US House as a Republican only to resign after 14 months, citing \"personal concerns\", and for a time he seemed content with life as a gentleman planter. But the rise of the Nullifier Party - whose members claimed that individual states had the right to overrule federal laws - was abhorrent to his Unionist beliefs. He won reelection to Congress as a dedicated Jacksonian. Blair was one of Washington's more colorful figures of his era, both loved and feared by his colleagues. At 6'6\" and 350 pounds, he was renowned for his physical strength and tales of his incendiary temper, drinking and fighting were legion. Future South Carolina Governor and US Senator James Henry Hammond was one of several men he challenged to duels, though in this case a peaceful settlement was reached. His behavior grew even more erratic in later years, when he began mixing alcohol and morphine to alleviate the pain of rheumatism. In December 1832, Blair brutally assaulted newspaper editor Duff Green for comparing Unionists to Tories (Americans loyal to Britain during the Revolution) because of their opposition to States' Rights. The journalist was left with several broken bones and Blair was fined $350. On another occasion, while attending the theatre, the Congressman was so displeased with the performance he drew his pistol and shot at one of the actors. Washington society was horrified. In a fit of depression not long afterwards, Blair turned his gun on himself. He was the first US Congressman to commit suicide while in office. Burial was at Congressional Cemetery in Washington DC.\n\nUS Congressman. Nicknamed \"The Waxhaw Giant\". Elected to represent South Carolina's 9th District in the US House of Representatives, he served four terms, from 1821 to 1822 and from 1829 until his death. Blair was born in South Carolina's Waxhaw Settlement to a family of Irish-Scots immigrants. He became Sheriff of the Lancaster District while in his early 20s, and in 1818 was elected General of the State Militia's 8th Brigade. From roughly 1820 he operated a successful plantation along the Lynches River in the Kershaw District. Blair won his first term in the US House as a Republican only to resign after 14 months, citing \"personal concerns\", and for a time he seemed content with life as a gentleman planter. But the rise of the Nullifier Party - whose members claimed that individual states had the right to overrule federal laws - was abhorrent to his Unionist beliefs. He won reelection to Congress as a dedicated Jacksonian. Blair was one of Washington's more colorful figures of his era, both loved and feared by his colleagues. At 6'6\" and 350 pounds, he was renowned for his physical strength and tales of his incendiary temper, drinking and fighting were legion. Future South Carolina Governor and US Senator James Henry Hammond was one of several men he challenged to duels, though in this case a peaceful settlement was reached. His behavior grew even more erratic in later years, when he began mixing alcohol and morphine to alleviate the pain of rheumatism. In December 1832, Blair brutally assaulted newspaper editor Duff Green for comparing Unionists to Tories (Americans loyal to Britain during the Revolution) because of their opposition to States' Rights. The journalist was left with several broken bones and Blair was fined $350. On another occasion, while attending the theatre, the Congressman was so displeased with the performance he drew his pistol and shot at one of the actors. Washington society was horrified. In a fit of depression not long afterwards, Blair turned his gun on himself. He was the first US Congressman to commit suicide while in office. Burial was at Congressional Cemetery in Washington DC.\n\nBio by: Bobb Edwards"}, {"url": "https://rosenhagood.com/attorney/alex-cash/", "page_content": "North Carolina native Alex B. Cash concentrates his practice on representing individual clients in the areas of family law and personal injury cases.\n\nAlex earned his law degree from the University of North Carolina at Chapel Hill. He has practiced law with Rosen Hagood since 1991 and is a senior equity member of the firm.\n\nHighly active with the state’s community of trial attorneys, Alex was elected to serve as President for the South Carolina Association of Justice (SCAJ) during 2016-2017. SCAJ is an organization dedicated to protecting individual rights and has in excess of 1,300 members in South Carolina. As a member of SCAJ he has also served as the president-elect, vice president, secretary/treasurer, and on the board of governors. He is AV Preeminent rated by Martindale-Hubbell and recognized by Super Lawyers in the field of family law. Alex was previously nominated by his peers and became a member of the National Trial Lawyers “Top 100 Trial Lawyers” in South Carolina (2008-present). Alex was also nominated by his peers and became a member of the National Association of Distinguished Counsel “Top One Percent” in 2015.\n\nIn addition, Alex is a member of the Family Law Section of the South Carolina Bar, American Bar Association, American Association for Justice, and the Southern Trial Lawyers Association. During the past couple of years, Alex has been a guest lecturer at the Charleston School of Law for the family law class. He has spoken at a variety of continuing legal education seminars about family law issues. Alex is the co-author of “Negligence” published in South Carolina Jurisprudence. He is also the co-author of supplement to “Marital and Relational Torts” published in South Carolina Jurisprudence.\n\nAlex graduated magna cum laude from Florida State University and received a Master of Music with Distinction from Indiana University. He has performed with numerous orchestras, including the Spoleto Orchestra in both Charleston and Italy."}, {"url": "https://www.spokeo.com/James-Blair/South-Carolina", "page_content": "Showing 5 records from over 100 Criminal Records & Traffic Violations that matched the name James Blair:\n\nDisclaimer: By using this website, you accept the Spokeo Terms of Use. Spokeo is not a consumer reporting agency as defined by the Fair Credit Reporting Act (FCRA). This site should not be used to make decisions about employment, tenant screening, or any purpose covered by the FCRA.\n\n\n\nThe records were matched using first and last name only. The records below may not pertain to the individual that you're looking for, and may or may not pertain to the same charge. Please make your own determination of the relevance of these court records."}], "James Blair was admitted to the bar in 1760": [{"url": "https://www.britannica.com/biography/James-Blair", "page_content": "James Blair, (born May 1656, Banffshire, Scotland—died April 18, 1743, Williamsburg, Va. [U.S.]), clergyman and founder (1693) of the College of William and Mary, Williamsburg, Va., the second oldest institution of higher learning in the United States.\n\nBlair was ordained in the Church of England (1679) but was deprived of his parish in Edinburgh in 1681 for refusing to take an oath supporting the legitimate claim of the Roman Catholic duke of York (afterward James II) as heir to the throne. In 1685 he left for North America, where he was elected rector of Varina parish, Henrico county, Va.\n\nAppointed bishop’s representative in Virginia in 1689, Blair proposed (1691) the founding of a college. With the endorsement of the Virginia General Assembly he returned to England to secure from the English sovereigns William III and Mary II a charter and a grant of funds for the college, which was named for its royal patrons. The charter was granted on Feb. 8, 1693. As the first president of the college, Blair proved to be a canny and expert fund-raiser, extracting money from people of all ranks and persuasions and, especially, from the estate of the natural philosopher Robert Boyle. He served for 50 years, one of the longest tenures of any university president."}, {"url": "https://encyclopediavirginia.org/james-blair/", "page_content": "MEDIA\n\nAnglican minister James Blair stands for a portrait in Williamsburg, in or around 1735. Blair was commissary, or the representative of the Bishop of London, with authority to preside over the Anglican clergy in America. He also was the cofounder of the College of William and Mary and served as its president for fifty years until his death in 1743. Seen in the distance behind Blair is the college's Wren Building, the oldest college building in the United States, which, according to tradition, was designed by the famous English architect Sir Christopher Wren. Originally built between 1695 and 1700, the Wren Building was gutted by fire in 1705, 1859, and 1862. This is a rare view of the building as it appeared after its reconstruction in the wake of the 1705 conflagration.\n\nThough unsigned, this painting was probably executed by the English artist Charles Bridges, who came to Williamsburg in 1735 and stayed in the Virginia colony until at least 1743."}, {"url": "https://encyclopediavirginia.org/entries/blair-james-ca-1655-1743/", "page_content": "Early Years Blair was probably born in Edinburgh, Scotland, around 1655, the eldest of three sons and four daughters of Peter Blair, a clergyman, and Mary Hamilton Blair. After beginning his formal education at Marischal College, Aberdeen, Blair studied at the University of Edinburgh from 1669 to 1673, when he received the degree of master of arts. He remained at Edinburgh for several additional years studying theology. In the summer of 1679 he was ordained by John Paterson, bishop of Edinburgh. Henry, Bishop of London That same summer Blair was appointed minister at Cranstoun Parish, a few miles outside Edinburgh. He remained two and a half years, serving, according to the bishop, “with exemplary diligence, care and gravity,” although a dispute with parish landowners over his reimbursement for repairs to the manse suggests that the combative nature that he later exhibited in Virginia was already well developed. In December 1681 Blair was removed from his parish after he refused to subscribe to a test oath that the Scottish Parliament imposed because it would have required him to accept the Roman Catholic duke of York as head of the Scottish church when he became king. Blair left for England, where he gained the support of Gilbert Burnet, a fellow Scottish cleric who later became bishop of Salisbury. Burnet secured Blair a clerkship in the Rolls Office and provided him an opportunity to meet other influential Anglican clerics, including Henry Compton, who as bishop of London had jurisdiction over the Anglican church in the American colonies. Compton persuaded Blair to accept an appointment in Virginia as rector of Henrico Parish (then frequently referred to as Varina Parish).\n\nIn Virginia Sarah Harrison Blair Blair’s career advanced rapidly after his arrival in Virginia late in 1685. Preaching at other parish churches as well as at his own, he came to know and be known to members of the colony’s most important families. Within two years he made the first of many land purchases, and on June 2, 1687, he married seventeen-year-old Sarah Harrison, of Surry County. The marriage was unhappy. At the wedding she adamantly refused to assent to the portion of the ceremony obliging her to obey her husband. They apparently had no children, and she may have become an alcoholic. Sarah Harrison Blair died on May 5, 1713, and James Blair lived another thirty years as a widower. Blair’s marriage brought him into the inner circle of the colony’s leading families, and his relatives often dominated the influential governor’s Council. His ecclesiastical career prospered. In mid-May 1690 a new lieutenant governor, Francis Nicholson, arrived in Virginia, bringing a commission of December 15, 1689, from Bishop Compton naming Blair commissary, or the bishop’s representative with authority to preside over the Anglican clergy of the colony in administrative matters. Often thought to have been the first to hold that office in Virginia, Blair had in fact been preceded in the post by John Clayton. Royal Charter for the College of William and Mary Blair moved without delay to establish his authority by calling a convocation of the clergy for July 23, 1690. Neither his Scottish origins nor his tendency to side with the Virginia laity in religious affairs endeared him to the larger number of his fellow clerics, who often opposed him vigorously, especially in the infrequent convocations that he called. The convocations held in August 1705 and April 1719 proved particularly rancorous. In the latter meeting his fellow clergymen unsuccessfully challenged the validity of his ordination in Scotland, a move that could have lost him his influential positions as rector and commissary. Blair’s initial convocation was more auspicious, however, for he there first advanced “Several Propositions” for the founding of a college in the colony and won enthusiastic support. In cooperation with Nicholson, who deserves to rank with Blair as a cofounder, he cultivated the support of Virginia’s political leaders. By June 1691 Blair left for England to seek the backing of King William, Queen Mary, and others. His mission required almost two years and resulted in the grant of a royal charter for the College of William and Mary on February 8, 1693, as well as substantial public and private financial support.\n\nEducation and Politics Sir Edmund Andros Blair returned to Virginia in triumph. Named president for life in the charter, he launched the new college on land acquired at the crossroads settlement of Middle Plantation a few miles from the capital at Jamestown. His task was not easy. In his absence enthusiasm for the project had declined, and Sir Edmund Andros, the new governor, was openly hostile. Blair nonetheless managed to inaugurate one branch of the institution, its grammar school, and to commence construction of a building. Over Andros’s objections Blair also secured a place on the Council, taking his seat for the first time on July 18, 1694. The next year he consolidated his position when he became rector of James City Parish, close to the seat of government as well as the new college. Blair’s relations with the governor soon worsened, and following his public criticism of Andros and the other councillors, they suspended him on April 26, 1695. He was reinstated on September 25, 1696, but suspended again on April 20, 1697. The infighting between Blair and Andros culminated in the summer of 1697 when, with financial and political backing from Francis Nicholson, Blair returned to England to present his grievances to ecclesiastical and political authorities. A key hearing before the archbishop of Canterbury and bishop of London was a one-sided affair with Blair able to speak in person to the sympathetic panel. The absent Andros was primarily represented by the young William Byrd (1674–1744), who was never allowed to deliver the lengthy brief he had prepared. On May 31, 1698, Andros was granted permission to resign and return to England on personal business. The Present State of Virginia, and the College. During his English sojourn Blair collaborated with two other men experienced in the government of Virginia, Henry Hartwell and Edward Chilton, in preparing a long report for the newly created Board of Trade on the state of affairs of the colony and how to improve it. Published nearly thirty years later as The Present State of Virginia, and the College (1727), it quickly became one of the more influential contemporary books about the condition of Virginia and the lives of Virginians at the end of the seventeenth century. Nicholson succeeded Andros as governor in December 1698 shortly after Blair’s return to Virginia. Blair was eventually reappointed to the Council, taking his seat on June 9, 1701, and serving for the remainder of his life. Although he cooperated with Nicholson in 1699 in a successful effort to move the capital from Jamestown to Middle Plantation, which was renamed Williamsburg, the two equally imperious men came into conflict during the next few years. The ill will culminated in Blair’s second trip to England to lobby for the removal of a governor. He left in 1703, bearing a petition that he and five other Council members had signed. Nicholson was at a distinct disadvantage due to his inability to appear in person, the death early in the hearings of his principal defender, and the capture by the French of the vessel carrying his supporting documentation. On April 5, 1705, the Board of Trade removed Nicholson as governor of Virginia. Old Bruton Church, Williamsburg, Virginia, in the Time of Lord Dunmore Blair’s success was, however, hardly complete. Nicholson remained a trustee of the college and continued with the support of most of Virginia’s Anglican clergy to oppose Blair’s direction of the college and his attempts to govern the colonial church. Then on October 29, 1705, the main college building caught fire and burned to its exterior walls. The resultant inquiry stirred further animosity between Blair and his opponents. In 1710 the death of one of his most outspoken clerical opponents, Solomon Whateley, afforded Blair the opportunity to become rector of Bruton Parish Church in Williamsburg, and for more than a decade he had no serious difficulty with Governor Edward Nott or his successor, Lieutenant Governor Alexander Spotswood. Blair used the time to solidify his position with Virginia political leaders. By that time, too, his brother Archibald Blair (by 1665–1733), a physician who had also immigrated to Virginia, had established himself as a successful Williamsburg merchant in a firm in which James Blair, to his considerable profit, became a silent partner. Alexander Spotswood Rebuilding the college was a more serious challenge, but Blair made the first of two rescues of William and Mary from the brink of failure. With the help of Spotswood and others, he found new money in England and America, began reconstruction of the college building that was first occupied by 1716 and largely completed by 1721, and for the first time expanded instruction beyond the grammar school by appointing a master of the Indian School and the first professor of natural philosophy and mathematics, Hugh Jones. As early as 1718 or 1719, however, Blair became embroiled in a controversy with Spotswood. The issues at stake had more to do with religious and political matters than with the college, and they again brought Blair into conflict with his fellow clerics, including the faculty. In 1721 he set off for England again. On this occasion, however, Spotswood was already in difficulty with his superiors on other grounds, and thus the commissary’s role in his dismissal has often been overemphasized, adding to Blair’s not entirely deserved reputation as a breaker of governors. The trip afforded Blair an opportunity to arrange for publication in London of Our Saviour’s Divine Sermon on the Mount (1722), a five-volume collection of 117 sermons he had delivered between 1707 and 1721. True to character, Blair was dissatisfied with sales, but the sermons were reprinted in four volumes in 1740 and in Danish in 1761. The sermons dealt more with matters of morality and personal conduct than with doctrine, a reminder that, despite his other concerns and interests, Blair was an active parish minister throughout his long career.\n\nLater Years The Bodleian Plate Engraved Copperplate of Colonial-Era Williamsburg\n\nPrint Made from Bodleian Copperplate\n\nHugh Drysdale Blair was in his late sixties when he returned from England on the same ship with the new lieutenant governor,. Blair appeared to be at the height of his power in the political establishment of Virginia. Yet despite its new building the college that he had founded and headed for more than three decades was once again on the verge of extinction, with a dearth of funds and students and a curriculum confined to precollegiate instruction in the grammar and Indian schools. Blair set to work and by the end of the 1720s had achieved nothing less than a second founding of the institution, helped again by a period in which few political issues diverted him from the task. A round of new construction added the Brafferton (1723) to house the Indian school and the library, a chapel wing on the main building (1732), and a president’s house (1733). The crowning achievements, however, were the preparation of the first college statutes in 1727; the hiring for the first time of the full complement of six masters, including professors of moral and natural philosophy and divinity; and with those preconditions met, the transfer of the original charter of 1693 into the hands of the president and masters on August 15, 1729. Blair was able to use his secure position in the social and political elite of Virginia to contribute significantly to the evolution of autonomous institutions in the colony. Rather than an outpost of imperial culture controlled by a largely English clerical faculty, under Blair’s guidance William and Mary became a college governed primarily by prominent colonists who sat on its board of visitors and shaped it to serve their educational goals. Likewise, Blair’s actions as commissary aided the development of an established Anglican church dominated by laymen who ran its parish vestries, a model that more closely resembled the operations of the church in Scotland during Blair’s youth and ministry in that country than it did the functioning of the parent Church of England during the eighteenth century. Blair’s relations with Lieutenant Governor William Gooch, the last chief executive on whose Council he served, were amicable. Gooch’s private opinion of Blair was negative, but he resolved to “kill him with kindness.” By then Blair was declining in health and vigor. In his last years he retained all of his official positions as president of the college, commissary, parish rector, and councillor, although he was not always able to perform all of his duties. The senior member of the Council, Blair served as president (in effect, acting governor) from October 15, 1740, to July 1741 while Gooch was away on a military expedition to the West Indies. Ruins of the Churchyard, Jamestown. The childless Blair had a sizable estate to dispose of when he composed his will in 1743. He made several charitable bequests, including £100 for teaching poor children and £500 for the education of a clergyman. He left his books to the library of the College of William and Mary and the remainder of his estate, estimated at £10,000, to his favorite nephew John Blair (ca. 1687–1771), whose education he had overseen. James Blair died in Williamsburg of a gangrenous rupture on April 18, 1743. He was buried beside his wife in the Jamestown churchyard."}, {"url": "https://www.nps.gov/parkhistory/online_books/declaration/bio45.htm", "page_content": "Biographical Sketches\n\n\n\n\n\nJAMES SMITH\n\nPennsylvania\n\nJames Smith James Smith, a lawyer who had emigrated from Ireland to the Colonies, represented the Pennsylvania back-country in Revolutionary conventions and the Continental Congress. He also helped draft the Pennsylvania constitution. Smith, the second son in a large family, was born in northern Ireland about 1719. When he was around 10 years old, his father emigrated to America and settled on acreage west of the Susquehanna River in York County, Pa. James studied surveying and classical languages at Rev. Francis Alison's academy in New London, Pa., and then read law in the office of his elder brother at Lancaster. He was admitted to the bar in 1745 and moved westward to the Shippensburg vicinity in Cumberland County. A lack of clients and surveying work caused him about 1750 to relocate eastward to York, where he married a decade later. Although he was the only lawyer in town until 1769, he experienced difficulty in recruiting clients. Probably for this reason, during the years 1771-78 he undertook iron manufacturing, but the venture failed and he lost £5,000. Smith early emerged as a local Whig leader. In 1774, at a provincial convention in Philadelphia, he supported nonimportation measures and advocated an intercolonial congress. That same year, at York he raised a militia company, in which he served as captain and later honorary colonel. At two provincial meetings in 1775-76, he championed the interests of the western counties and helped formulate resolutions calling for independence, the strengthening of defenses, and establishment of a new provincial government. During the latter year, he sat on the drafting committee in the State constitutional convention. Elected to Congress (1776-78) on July 20, 1776, after the vote on independence had been taken, he arrived in Philadelphia in time to sign the Declaration. Among his colleagues he gained a reputation as a wit, conversationalist, and eccentric. During the period 1779-82 Smith held various State offices: one-term legislator, judge of the Pennsylvania high court of errors and appeals, brigadier general in the militia, and State counselor during the Wyoming Valley land dispute between Pennsylvania and Connecticut. In 1785 he turned down reelection to Congress because of his age. His major activity prior to his retirement in 1801 was the practice of law. Smith died at about the age of 87 in 1806 at York, survived by two of his five children. His grave is in the First Presbyterian Church Cemetery. Drawing: Watercolor, ca. 1760, by an unknown artist, The R. W. Norton Art Gallery, Shreveport, La.\n\nhttp://www.cr.nps.gov/history/online_books/declaration/bio45.htm\n\nLast Updated: 04-Jul-2004"}, {"url": "https://www.wikitree.com/wiki/Blair-5849", "page_content": "James Blair\n\nabout 1760 in Ireland Bornin\n\nSon of [father unknown] and [mother unknown]\n\n[sibling(s) unknown]\n\nMary Moore Husband of— married [date unknown] [location unknown]\n\nDescendants\n\nSampson Blair Father of\n\nabout 1806 at about age 46 in Montgomery County, Virginia, United States [uncertain] Diedin [uncertain]\n\nProfile last modified 11 Feb 2019 | Created 29 Mar 2018\n\nThis page has been accessed 292 times.\n\nBiography\n\nJames Blair's marriage to Mary Moore in Chester County, Penn. is confirmed by a letter of transfer by Rev. Carmichael, pastor of the Presbyterian Church at the \"Forks of the Brandywine, dated 1784. This letter was found among the possessions of Jerome Blair, the nephew of Sampson Blair, of Wythe County, Virginia.\n\nSources\n\nLetter of transfer from Forks of the Brandywine Presbyterian Church, 1784, found in the possession of Jerome Blair, grandson of James Blair. Appraisal records in Montgomery County, VA confirm that James Blair died there ca. 1806. His wife and their children arrived in Wythe County ca. 1810, where they engaged in engineering iron furnaces. A letter from Sampson Blair, son of James, confirms that the family went at least as far as Lee County to blast these furnaces.\n\nThe 1880 census lists the birth place of the father of William Blair, a sibling of Sampson Blair, as Ireland. The gravestone of Andrew Blair, the unmarried sibling of the above two Blair brothers, gives his parents as James and Mary Blair. (Walton Furnace, Wythe County, VA)"}, {"url": "https://encyclopediavirginia.org/entries/jefferson-thomas-and-the-practice-of-law/", "page_content": "Legal Training Jefferson attended the College of William and Mary, in Williamsburg, from 1760 to 1762. After ending his studies, he was back in Williamsburg by 1763, this time to study law. No formal law schools existed at the time; instead, students spent years serving as apprentices or clerks to established attorneys. Jefferson studied under George Wythe, with whom he had formed a close bond while in college. An eminent lawyer with liberal views on religion, slavery, and republicanism, Wythe saw little benefit in the drudgery of traditional legal training and preferred to have his students read law reports and foundational English legal writings, such as those by Sir Edward Coke. (Jefferson later came to strongly dislike the commentaries of Sir William Blackstone, insisting that American law was being degraded by the increasing use of that work, at the expense of Coke, in the training of lawyers.) Wythe paired this academic foundation with the practical training necessary to understand how Virginia landowners managed their own affairs and those of the colony. He accomplished the latter by sending his students to observe cases being argued before the General Court and by supervising moot-court exercises. These two aspects of Jefferson’s legal training—the study of law as political philosophy and as practical grounding for the management of plantation property—served Jefferson’s gentry clients well, but they also shaped Jefferson’s intellectual and political roles in nation-building. In the decades to come, the law played a critical role in Jefferson’s project to create, as he wrote in his Autobiography (1821), a “system by which every fibre would be eradicated of antient or future aristocracy; and a foundation laid for a government truly republican.” Upon being examined late in 1765 by a panel of three men—Wythe, Jefferson’s cousin John Randolph, and Robert Carter Nicholas—Jefferson qualified to practice before Virginia’s county courts. He chose to practice at the General Court, however, a bar that required another year’s wait for admission. He attended his first session in October 1767, and in so doing became the youngest member of an elite group. In his eight years of practice, only ten other lawyers qualified to practice before the General Court.\n\nBuilding a Practice With the exception of a few men trained in Britain’s Inns of Court and admitted as barristers there, Virginia lawyers were prohibited from practicing in both the county courts and the General Court. This meant that General Court lawyers like Jefferson could specialize in representing clients with business in the capital, where the court convened. Additionally, of those lawyers admitted to practice in Williamsburg, Jefferson, in Albemarle County, resided the farthest west, making him well positioned to serve clients at the forefront of westward migration and investment. As a result, Jefferson’s practice grew rapidly, with his first cases involving the quieting of titles. A procedure by which clients sought to be assured that their land titles were legitimate, quieting required someone to research government records to check that the title had been properly registered and its quitrents paid. The Crown collected a fee called a quitrent on lands patented in its colonies, but in Virginia, it was common practice for buyers, and especially land speculators, to avoid paying the quitrent by taking out a warrant of survey on a piece of land and holding it indefinitely, without a patent. Other owners allowed their patents to lapse without the land-use requirements having been met, leaving titles open to challenge and even grant to another claimant. Jefferson generally tasked such research to several agents in Williamsburg, but on those occasions when actual title challenges occurred, he dutifully represented his clients before a judge. Still, a large practice built on transactions allowed Jefferson, not a skilled public speaker, to spend less time inside a courtroom than other lawyers, and to instead exploit his meticulous attention to detail and his deep knowledge of English law. Soon becoming an expert in the highly complex world of estate law, Jefferson was especially active in drawing wills and in offering counsel to other attorneys on difficult matters related to wills and trusts. In order to build his practice, Jefferson acquainted himself with county-court lawyers by regularly traveling to western counties on those days when local attorneys gathered to do their courts’ business. Occasionally he had the good fortune to be introduced to the local bar by someone such as John Madison Sr., the clerk of the Augusta County Court, whose son Jefferson had met while a student. As the Virginia colony’s westernmost county, Augusta lay over the Blue Ridge Mountains in the Shenandoah Valley and extended as far west as the Mississippi River. By the end of 1768, his first full year of practice, Jefferson had visited eight other western counties as well as several to the east of Albemarle. Meanwhile, Jefferson’s knowledge of the personnel and workings of legal institutions in Williamsburg became a lucrative source of clients, and he soon was able to build a network of attorneys who brought him business from dozens of counties across the colony. Although it took him five days on horseback, he made the 120-mile trip to Williamsburg three times a year—for the April and October sessions of the General Court and for the June meeting of the governor’s Council. His collaborations there with such men as Wythe, Thomson Mason, Edmund Pendleton, John Blair Jr., and John Randolph enhanced his reputation and, moreover, provided contact with the leading attorneys of the county bar, which, in turn, brought him more business. With such an advantage, Jefferson was able to gradually reduce his travel and limit his regular trips beyond Albemarle to Williamsburg and Staunton, the seat of Augusta County.\n\nLand and the Law Jefferson’s involvement in the land business, which included his own dealings, represented the largest number of cases that he handled. For Jefferson, the frontier became central to his vision of a successful republic: it provided yeoman freeholders enough land for their subsistence, but land ownership also provided the common interests by which such men banded together as citizens of a single nation. Yet what Jefferson saw of the land market offered troubling reminders of the elitist quality of society and politics, and how that pattern was being replicated on the frontier. Wealthy landowners in the eastern Tidewater were granted vast tracts of land by the colony, and ambitious speculators assembled dozens of grants into baronial holdings. Jefferson represented many of these men and provided necessary counsel for their land acquisitions. Yet at the same time—especially after an embarrassing venture in support of speculators backfired—he also represented many small landholders. In fact, such clients made up the vast majority of those whose land claims he handled; more than four out of five clients dealt in small to middling tracts of 400 acres or less. Jefferson’s practice, therefore, was hardly a simple matter of preserving the status quo. When he asserted that “Those who labour in the earth are the chosen people of God,” he was not just reflecting on a way of life; he was articulating his belief that the personal autonomy of the freeholder was essential to the creation of the “government truly republican” that he envisioned. By this way of thinking, land served as more than an economic commodity. It also had social and political purpose. Its accumulation by a few families threatened to reproduce the world of rural England, with a small number of landed aristocrats and a large body of renters. It was a situation that concerned many in Virginia—including some of its wealthiest citizens, who recognized that such an unwieldy accumulation of property prevented land from circulating and being put into productive use. The use of primogeniture and entail epitomized this system. These feudal English property rules, respectively, kept land in the hands of a single heir (the eldest son) and protected it from answering any debts accumulated by spendthrift offspring; the result, Jefferson complained in his Autobiography, was the “accumulation and perpetuation of wealth, in select families.” Far preferable, he believed, was the distribution of lands “appropriated in small quantities.” To circumvent these rules required a skilled lawyer such as Jefferson, who could disencumber large blocks of land for clients. His efforts against primogeniture and entail did not end in the courtroom, and after the American colonies declared independence he drafted the statutes that helped to abolish the system—entail in 1776 and primogeniture in 1785.\n\nThree Cases By handling land cases, Jefferson witnessed the tension between the interests of wealthy landowners and small landholders. Jefferson himself, however, moved in Virginia’s upper echelons of society and politics. And by dint of this social prestige, coupled with his legal acumen, he was entrusted with a variety of often-delicate cases, two of which put him in the middle of warring elite families. In Bolling v. Bolling (1771), Jefferson argued against his old teacher, George Wythe. The case involved a dispute between two brothers, Robert Bolling and Archibald Bolling, over the will of their brother Edward Bolling, who had died the year before. Already connected to the family—Jefferson’s sister Mary Jefferson Bolling was married to a fourth brother, John Bolling—Jefferson agreed on September 13, 1771, to represent the defendant, Robert Bolling. Jefferson’s and Wythe’s arguments, preserved in a 239-page handwritten manuscript, were often highly technical and for that reason were presented to a qualified arbitrator rather than to the lay members of the General Court. The prevailing party in Bolling v. Bolling is not known, but the case has been hailed for the erudition of its arguments and for what it reveals about the law in Jefferson’s time. According to the historian Bernard Schwartz, the case “strikingly demonstrates that American law was still essentially the common law” and that “with regard to both substance and technique, Westminster Hall and the Virginia General Court were not as far apart as they might have seemed.” John Murray, Fourth Earl of Dunmore Two years later, Jefferson became involved in another family dispute, this one centered on a sensational scandal. The marriage between Dr. James Blair, of Williamsburg, and Catherine “Kitty” Eustace, of New York, consecrated in 1771, dissolved quickly amid rumors of Blair’s “incompetence” and an affair between Kitty Blair and the governor, John Murray, earl of Dunmore. Sometime around November 25, 1772, when he made note of the case in his account book, Jefferson was asked to investigate the possibility of divorce, for which there was no legal precedent in Virginia. Jefferson took notes outlining the history of divorce and how legislation granting it might read, but such a bill was never presented to the General Assembly. Then, on December 26, Dr. Blair died, and, in apparent contradiction to Virginia law, his will left the widow no portion of the estate. In Blair v. Blair—an appeal before the General Court after the James City County Court denied Kitty Blair’s claim—Virginia’s attorney general, John Randolph (acting privately), and Patrick Henry argued on behalf of the widow, while Edmund Pendleton and James Mercer argued on behalf of the estate. Jefferson also was retained by the estate but did not participate in oral arguments. He later provided a thorough account of the arguments made and the case’s outcome, in favor of Kitty Blair. Jefferson did not always represent elite interests, however. As a student, he had closely examined all the major precedents concerning the status of slavery in English law and concluded that it had no basis in either common law or statute. In the course of his practice, he became known as an advocate for those whose enslavement he could challenge in novel ways based on precedent and statutory interpretation. The most famous of these cases was Howell v. Netherland (1770). Samuel Howell was a mixed-race indentured servant whose grandmother had been a free white woman; his grandfather was black. While Virginia law prescribed that the offspring of white women and black men be made servants until they reached the age of thirty-one, their children’s children were held to no such commitment. (If a child’s mother was black, then the law had long been clear: her children were slaves.) “Now it is plain,” Jefferson maintained, applying a strict construction to the law, “the plaintiff does not come within the description of the act.” Without positive law, no legal means existed to enforce the enslavement, and natural law thus governed: “under that law we are all born free.” Howell lost his case, but Jefferson charged him no fee, a practice he followed in six other suits for freedom.\n\nLaw and Liberties Declaration of Independence Jefferson’s interest in natural law, as opposed to common law or the statutes written by legislatures, dated back to his early legal studies. While under Wythe’s tutelage, Jefferson had meticulously “commonplaced,” or summarized, the reports of English judges. In doing so, he found himself attracted to the writings of a particular group of judges who had been active during the tumultuous seventeenth century. Their decisions provided Jefferson with precedents and principles for his developing philosophy of rights. Although Jefferson’s philosophy is commonly seen as one of natural rights assured, as he wrote in the Declaration of Independence, by “the Laws of Nature and of Nature’s God,” he actually drew far more heavily on an English “whig” tradition of resistance to arbitrary power. Jefferson later wrote about how, when he wrote summaries, he “sometimes mix[ed] my own reflections on the subject … [T]hey were written at a time of life when I was bold in the pursuit of knolege, never fearing to follow truth and reason to whatever results they led, & bearding every authority which stood in their way.” Sr. Edward Coke Lord Chief Justice Among the authorities who influenced him most were Sir Edward Coke, who championed the guarantees of the Magna Carta (1215) in Parliament’s opposition to the Crown early in the seventeenth century, and Sir John Holt, chief justice of the King’s Bench from 1689 to 1710, whom Jefferson called “the greatest lawyer England ever had, except Coke.” From them he assembled his own principles of government based on personal freedom and limited government. Jefferson’s “Summary View of the Rights of British America,” written as instructions for Virginia’s delegation to the First Continental Congress in July 1774, rejected the feudal origins of American rights. Instead, he drew heavily on principles of land law to argue that the colonists held their rights, like their property, in freehold and beyond royal demands. His Declaration of Independence presented the liberties of Americans as held in trust by the Crown. In violating those liberties, King George III forfeited his role as trustee. Though he had seen the importance of judicial opposition to tyranny, Jefferson remained skeptical of broad judicial authority. As such, he firmly believed that judges must adhere to the will of the people by interpreting laws faithfully, according to a strict construction of their language. He also sharply criticized Virginia’s first constitution for its lack of a bill of rights, believing that it left the power of the General Assembly dangerously unrestrained."}, {"url": "https://prabook.com/web/francis.blair_sr./3735276", "page_content": "Francis Blair Sr.\n\neditor journalist politician\n\nApril 12, 1791 (age 84) Abingdon, Virginia, United States\n\nIn 1817, he was admitted to the bar, although he never practiced due to a vocal defect. He took to journalism, and became a contributor to Amos Kendall's paper, an influential paper in Frankfort. He contributed political articles to the Argus, edited by his friend Amos Kendall, and became clerk of the state circuit court and president of the Commonwealth Bank. When Andrew Jackson was elected in 1828, Kendall went to Washington as an adviser, and Blair became the editor of the Argus. He produced powerful editorials defending Jacksonian policies and, upon Kendall's recommendation, Jackson brought him to the capital in 1830 to establish an administration newspaper, the Washington Globe. John C. Rives of Virginia joined him as business manager, and they made the Globe one of the most potent political organs in the country. In 1833 they made an important contribution to contemporary political education (and to later historians) by beginning publication of an impartial report of the daily proceedings in Congress, the Congressional Globe (today replaced by the government publication Congressional Record). Blair and Jackson became good friends, and Blair's articles in the Globe were faithful expressions of the President's views. Blair would consult with Jackson in the White House, taking notes on scraps of paper held on his knees as the President spoke, then would hurry off to convert these into slashing editorials. Blair attacked Henry Clay's American Plan of protective tariffs and internal improvements, the U. S. Bank, and the nullification doctrines of John C. Calhoun's South Carolina; he advocated hard money and the interests of the \"common man\" against the men of wealth. His editorials charged the Whigs with trying to enlarge the rights of property so much \"as to swallow up and annihilate those of persons\" and pledged the Democratic party to preserve the rights of the people. Blair worked for the nomination of Van Buren in 1844. But when James K. Polk was elected president, Blair offered to continue the Globe as the Democratic administration paper. Polk refused, fearing that the journalist was not friendly toward him, and he was right. Blair referred to Polk's narrow, rigid mind, his pettiness, and his ungenerous attitude. Blair remarked in 1848 that the voters were indifferent about the election because they \"had tried Tyler and Polk, and yet the country has not been materially hurt. If two such Presidents cannot injure the nation, nothing can!\" Silver Spring, Blair's country home just outside Washington in Maryland, became the political mecca for Jacksonians during this period. However, Blair departed from many of his associates in 1848, when he supported the Free Soil cause. He had never been associated with abolitionism, but he said Van Buren's letters and speeches that year had converted him to the necessity of opposing the slave power. In 1852 he was prepared to back Thomas Hart Benton for the Free Soil nomination but later approved the Democrats' nomination of Franklin Pierce. When Pierce appointed \"Southern radicals\" to his Cabinet, Blair felt that Northern and moderate Democrats had been betrayed; and when the 1854 Kansas-Nebraska Bill passed—opening up the territories to slavery—Blair was roused to fight. Blair was active in the Republican cause in 1856; and in 1860, although he would have preferred an \"old Democrat, \" he joined vigorously in the campaign for Lincoln and became the new president's valued adviser. In 1864 Blair met privately with Jefferson Davis in Richmond, Va. , in an attempt to end the war, and he arranged the futile Hampton Roads Conference of 1865. After the war he wanted the Union restored \"as it was, \" and opposed the Radical Republican program for the South. The old Jacksonian unionist, Francis Preston Blair, Sr. died on October 18, 1876."}, {"url": "https://www.findagrave.com/memorial/6786028/james-thomas-blair", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://adb.anu.edu.au/biography/blair-sir-james-william-5266", "page_content": "by J. C. H. Gill\n\nSir James William Blair (1870-1944), politician, barrister and judge, was born at Coalfalls, Ipswich, Queensland, on 16 May 1870, younger son of Gordon Blair, a Scots customs officer, and his wife Julia, née Droughton. Educated at first by his Irish mother—a strong personality—he later attended Ipswich West State School, then Ipswich Grammar School from 6 March 1882 to the end of 1888 when he passed the University of Sydney senior public examination. In 1889 he was reading in Brisbane for the preliminary Bar examinations with F. ff. Swanwick, a barrister and schoolmaster who had been a member of parliament. He lived with Swanwick, published some newspaper verse and was admitted to the Queensland Bar on 6 March 1894 on the motion of Dr A. H. Boone.\n\nBlair made friends in 1894 with another 'native son', the then attorney-general T. J. Byrnes, and the two shared chambers until Byrnes's death in 1898. Over twenty years later Blair said, 'I was a hero-worshipper. Byrnes was my hero'. Already considered a master of both written and spoken English, Blair also possessed other attributes valuable in public speaking: he could be forceful, his voice was particularly pleasant and he had many 'graces of speech'. He was junior counsel for the Crown in prosecuting directors of the Queensland National Bank, and was briefed in the libel actions, Hoolan v. Directors of the Eagle and Jarvis v. Charters Towers Evening Telegraph. In the criminal jurisdiction he was counsel on appeal in the Kenniff trial. He had laid the reputation for the later widely held belief in his profession that, 'if the need arose, Jimmy Blair could make a jury weep'.\n\nAssociation with the politicians Swanwick and Byrnes had its effect. On 11 March 1902 Blair contested a general election as an independent candidate for Ipswich which then returned two members to the Legislative Assembly. He was placed second to T. B. Cribb, a member since 1896 who had been treasurer from February 1901. Blair achieved some notoriety by papering Ipswich with heart-shaped cards about an inch square: some said 'In the hearts of the people', others bore the humble legend 'Give Jimmy a vote'. There was only one Jimmy on the ballot paper and sufficient electors gave him a vote.\n\nFor one who subsequently gained a reputation as something of a bon viveur, Blair's parliamentary policy suggested either that the crusading zeal of a young man had not yet faded or that he could shrewdly assess his strongly Nonconformist constituents. He opposed Sunday opening of public houses and favoured rigorous enforcement of the Licensing Act and the introduction of local option without compensation; bars should be restricted to the hours imposed on shops by the Factories and Shops Act and should be closed on polling days. He also favoured more stringent enforcement of the Gambling Act, the minimization of Sunday labour, suppression of Sunday trading and prohibition of the sale of tobacco to children. His education policy sought to restrict government scholarships to State grammar schools, and envisaged a take-over by the State of the grammar schools and the grant to them of more scholarships. State-school parent-committees should not have to contribute to the repair of schools and school-residences. In other fields he sought extension of the Factories and Shops Act to the whole State, and the opening of polls under the Act not only to ratepayers but to all electors.\n\n(Sir) Arthur Morgan formed a coalition government with Labor's W. H. Browne on 17 September 1903. Needing a lawyer for attorney-general, he invited Blair, who thus became a minister at 33 and ex officio leader of the Queensland Bar. He was given the additional portfolio of mines on 27 April 1904 and retained both offices under Kidston. He was out of office during the brief reign of the Philp government from November 1907 but he regained his former portfolios when Kidston resumed power on 18 February 1908.\n\nBlair's first major bill became the Worker's Compensation Act of 1905—a useful protective addition to the industrial laws. It was published with annotations in 1906 with Blair, T. W. McCawley and Thomas Macleod as joint editors. The preface claimed that the Act introduced a principle well known in the United Kingdom but hitherto unknown in Queensland law. In 1905 he and Macleod had revised and edited R. A. Ranking's Queensland Police Code and Justices' Manual of the Criminal Law. Blair had little success with his mining legislation: the 1905 Mining Act amendment bill was rejected, and a 1906 bill to consolidate and amend the laws relating to mining fields, mines and mining lapsed after the second reading. His Children's Court Act of 1907, which took offenders under seventeen into special closed courts, was a success, but his technical instruction bill of the same year was not returned by the Legislative Council.\n\nIn the first session of the seventeenth parliament in 1908 Blair produced and steered through parliament two measures that were to play a part nine years later in the T. J. Ryan government's efforts to abolish the Legislative Council. In November 1907 the council had refused to pass a trades disputes bill and an election Act amendment bill. Kidston sought to appoint enough councillors to have these measures passed. Lord Chelmsford, the governor, refused this on the ground that Kidston had no mandate to increase the size of the Upper House. Kidston asked for a dissolution, was refused, and resigned. Philp tried to form a government, was defeated, and thereupon sought and, to Kidston's consternation, was granted a dissolution. On Kidston's return to power with a large following in February 1908, he sought to resolve future conflicts with the Upper House by constitutional means. First, Blair brought down an amendment of the Constitution repealing the clause in section 9 (amendment of the Constitution) which required a two-thirds majority on the second and third readings of bills for amendment. This paved the way for a further amendment—the Parliamentary Bills Referendum Act—under which measures rejected by the council, or which it refused in two consecutive sessions to pass in the form which the assembly desired, could be submitted to the people by way of referendum and, if approved, automatically become law.\n\nDuring the parliamentary recess in 1908, Blair made a 3500 mile (5632 km) motor trip in his 1905 Panhard with four companions through outback Queensland. It enabled him to educate himself in the needs of remote districts, and attracted world-wide interest as automotive pioneering. Given the condition of the roads—where they existed—it was a remarkable achievement; Blair felt he had demonstrated 'the utility of motor transit in the heart of Queensland'.\n\nKidston had spent the recess in the United Kingdom. On his return, he decided that the government could survive only by a fusion with the Opposition. Some Opposition members had to be brought into the cabinet and Blair was one of the ministers displaced. It was said that Kidston promised to compensate him with a seat on the southern Supreme Court bench, and that he had accepted, but he was in fact offered a seat on the northern bench so that C. E. Chubb, who had been there for over fifteen years, could be transferred to Brisbane. Blair refused and had to wait fourteen years for another approach. With Peter Airey and George Kerr, who had also lost portfolios, Blair then led what was called 'the Independent Opposition'. He could have been a thorn in Kidston's side, but came to his rescue in October 1910 when Ryan and Edward Macartney were hammering home the auditor-general's criticism of government expenditure on the University of Queensland. He was unable, however, to stomach Kidston's offer to bear the cost of opposition by the Queensland Tramway Employees' Association to an application for registration under the Commonwealth Arbitration Act by the rival Australian Tramway Employees' Union; the latter ceased work on 19 January 1912. As other unions became involved, the dispute escalated into a general strike. Although Blair actively preached moderation throughout, and persuaded the Ipswich railway workers to go back, his mining constituents and the waterside workers remained out some time longer.\n\nD. F. Denham, who had succeeded Kidston as premier in February 1911, called a general election for 27 April 1912 as soon as the strike had collapsed. A requisition signed by nearly a thousand voters invited Blair to accept nomination as the government candidate for Ipswich. He accepted and worked with a committee of crusty conservatives and former Labor supporters who had 'thrown off the Trades Hall yoke', and who admired his stand in the strike.\n\nHaving been re-elected, Blair returned to the ministry on 3 September as secretary for public instruction, replacing K. McD. Grant who had resigned on a point of principle. He held office until 1 June 1915, usually deputizing on legal matters for Attorney-General T. O'Sullivan who sat in the council. In this last phase of his political career, Blair was responsible for further social legislation. The Criminal Code was amended in 1913 to raise the age of consent from 14 to 17 and to provide elaborately for the protection of girls. The Testator's Family Maintenance Act (1914) gave the court discretion to prevent unjust disinheritance of immediate family. The Friendly Societies Act was also amended that year to permit them to become the only corporate owners of pharmacies in Queensland. State secondary school scholarships, instead of being awarded by competition, went to all those who qualified, and scholarship-extensions were granted to those who passed the junior public examination.\n\nAfter Labor's sweeping victory in the general election of 22 May 1915, the government majority of 22 became a minority of 18. Blair, who had declined Denham's endorsement, stood again as an independent and lost his seat to D. A. Gledson, a Labor candidate, by 400 votes. The mining areas of his electorate abandoned him completely. He claimed to have been sick throughout the campaign and, when it ended, he spent several days in hospital.\n\nHenceforth Blair concentrated on his legal practice. In 1917 he appeared with Ryan for the government in the Legislative Council referendum case, arguing the validity of the constitutional legislation he had had passed in 1908. The State Full Court declared both Acts invalid. The High Court of Australia unanimously reversed this decision and declared that the Legislative Council could be abolished by an Act in accordance with the Parliamentary Bills Referendum Act. Blair was also in great demand as a counsel in criminal cases.\n\nThe Judges Retirement Act (1921) removed a number of over-age judges, and Blair accepted the position on the northern bench offered him by Labor Premier E. G. Theodore in 1922. He and his wife moved their home to Townsville. On 24 January 1923 he was transferred to the central bench at Rockhampton. When McCawley died prematurely on 16 April 1925, Blair succeeded him as chief justice on 24 April, spending his first few days of office arranging a memorial fund. From 1930 he acted as deputy governor for brief periods, served as administrator in April 1932 pending the arrival of Sir Leslie Orme Wilson, and was formally appointed lieutenant-governor on 23 May 1933. On 1 June 1930 he had been knighted on the instigation of the A. E. Moore government, and on 3 June 1935 was appointed K.C.M.G.—seemingly directly by the King whose jubilee year it was, for his name did not appear on the Commonwealth list and the W. Forgan Smith government made no recommendations.\n\nThere were three classic cases in Blair's term as chief justice. In 1929 the Country National Progressive ministry set up a royal commission to investigate the purchase by its Labor predecessors of two mines at Mungana in North Queensland. The report condemned W. McCormack and Theodore, both former premiers, and the government immediately proceeded against them and two others for conspiracy, seeking £30,000 in damages. Although complex and highly technical, the case created intense interest and political passion because it was said to be designed expressly to destroy the career of Theodore, then Federal treasurer. The trial lasted twenty-one days before Blair and a jury of four, and was decided in favour of the defendants. Newspapers of all political colours agreed that his 4½-hour summing-up was extremely fair. The suggestion, under a thin fictional veil, of his venality in Frank Hardy's political novel Power without Glory rests on no more than malicious contemporary gossip.\n\nIn October 1939 Blair presided over an extraordinary criminal trial. On 4 August 1937 members of the League for Social Justice had invaded a Labor caucus meeting in the old Legislative Council chamber at Parliament House, armed with batons, coils of barbed wire and hammers. They were committed for trial on charge of 'assembly in such a manner as to cause fear that they would tumultuously disturb the peace'. With so many accused, the trial had to be held in the Brisbane City Hall. Although Blair made it perfectly clear to the jury that he believed all the accused to be guilty, they were all found not guilty.\n\nBlair's third cause célèbre is known as the Ithaca election petition. Edward Hanlon, a Labor minister and member for Ithaca, was opposed in 1938 by George Webb of the Protestant Labour Party and won by only 456 votes. Webb appealed to Mr Justice Edward Douglas, sitting as an elections tribunal, that Hanlon in his campaign had distributed illegal leaflets: the appeal was upheld. Hanlon's counter-appeal to the Full Court was sustained and Webb's application for leave to appeal to the High Court was refused. Douglas felt aggrieved by the removal of judicial pension rights in 1922 by the Labor government and was concerned at what he saw as threats to judicial independence. Resentment at the reversal of his decision in the Ithaca petition case and suspicion of Blair's attitude over the pensions issue finally boiled over into a statement published in the Brisbane Truth on 22 October 1944. He asserted that Blair had suppressed a pension plan for judges submitted to him for consideration by the government, had received a salary as lieutenant-governor, and had been given large undisclosed payments by the government without statutory authority. Other judges united in condemning Douglas but Blair, now retired, maintained a dignified silence. Questions asked in parliament and statements in the ensuing controversy made in clear that Douglas was mistaken on the pensions question, that Blair had not received any salary as lieutenant-governor, and that the alleged undisclosed payments were in fact the salary equivalent of accumulated periods of sabbatical leave.\n\nIn the parliamentary debates on the establishment of the University of Queensland, Blair had argued unsuccessfully for the waiving of all fees and in 1915-16 became a member of the senate. He was reappointed in 1926 and was elected chancellor in 1927. He moved immediately to improve the university's primitive accommodation and by 1930 had accepted a gift of 200 acres (81 ha) at St Lucia from Dr J. O. Mayne. The work of creating a new campus occupied much of his time, but World War II prevented its completion before his death.\n\nIn 1912-13 Blair was a committee-member of the Ipswich Grammar School Old Boys' Association and became joint patron of its Brisbane branch in 1932. He held office also in both the Queensland Scottish Union and the Queensland Irish Association. A notable athlete in his youth, he was later president of the Queensland Rugby Union. Ipswich district cricket competitions of the early twentieth century included a team called Blair's. In his later years he became more interested in the turf and was president of Tattersall's Club in 1911-22. He was also a member of the Queensland and Johnsonian clubs.\n\nOn 16 May 1940 Blair retired from the bench but remained lieutenant-governor and chancellor of the university. He died of cerebro-vascular disease on 18 November 1944 at the Mater Misericordiae Hospital in South Brisbane, leaving an estate valued for probate at £3718. After a service at St John's Cathedral, the state funeral proceeded to Bulimba cemetery. He was survived by his wife May Christina, née Gibson, nineteen years his junior, whom he had married on 29 February 1912 at St Andrew's Church of England, South Brisbane; they had no children.\n\nBlair was regarded as something of a dandy: he frequently wore a 'white gardenia in his buttonhole and a silk handkerchief peeping from his breast pocket'. Like all public men he had his detractors—he was venal, he was weak, he 'married beneath him' because of that weakness, and he lacked dignity. Others saw outstanding gifts which took him, a native son of the people, to some of the highest offices in the State, and delighted in his colourful personality, his gift of ready and apt speech, his wit and love of humour, his kindness of heart and genuine interest in his fellow men."}, {"url": "https://scvahistory.org/courtofappeals/b/blair-john-1779-1789/bibliography-and-research-collections-john-blair-jr-1779-1789/", "page_content": "Further reading:\n\nPeter Graham Fish, Federal Justice in the Mid-Atlantic South: United States Courts from Maryland to the Carolinas, 1789-1835 (2002) and John O. Peters, From Marshall to Moussaoui: Federal Justice in the Eastern District of Virginia (2013) treat Blair’s service on the U.S. Supreme Court (1789-1795).\n\nElliott J. Drinard, “John Blair, Jr., 1732-1800, ” Proceedings of the 38th Annual Meeting of the Virginia State Bar Association (1926).\n\nMark F. Fernandez, “John Blair, Jr. (1782-1800), ” Dictionary of Virginia Biography (1998).\n\nMark D. Hall, “John Blair: a Safe and Conscientious Judge,” in Scott Douglas Gerber, ed., Seriatum: the Supreme Court before Marshall, (New York: New York University Press, 1998).\n\nAndre C. Laviano, “John Blair, Jr.” in Clare Cushman, ed., The Supreme Court Justices: Illustrated Biographies, 1789-2012, (Supreme Court Historical Society, 2012).\n\nJerome D. Traver, Uncovering the past at Taskinas Plantation: the eighteenth- century estate of John Blair, Jr. a Virginia signer of the U.S. Constitution and appointee to the first U.S. Supreme Court: a program of archaeological testing and documentation of the cultural heritage of York River State Park for Thomas Cervanak (May 2003), available at the Colonial Williamsburg Foundation Library, Williamsburg.\n\nHenry T. Wickham, “Address . . . at a special session of the United States Circuit Court of Appeals for the Third Circuit, held at Philadelphia, Pa., Tuesday, May sixth, 1913, on the occasion of the presentation on behalf of the Virginia Bar Association of a portrait of Hon. John Blair, Jr., from 1789 to 1796 a justice of the Supreme Court of the United States,” Virginia State Bar Association (1913).\n\nResearch collections:\n\nCollege of William and Mary (Special Collections Research Center, Swem Library)\n\nWilliamsburg, Va.\n\nBlair, Banister, Braxton, Horner, and Whiting Papers, 1760-1890; 8 items.\n\nLetters from John Blair (1732-1800) to his sister, Mary Blair Braxton Burwell, 1777-1796.\n\nBlair Family Papers, 1741-1792; 6 items.\n\nLegal documents; includes a deposition, 1787 and n.d., of John Blair (1732-1800) concerning a lawsuit in the Superior Court of Chatham County, Ga. (Margaret Eustace vs. Seth John Cuthbert) which concerned the estate of his brother, James Blair (1741-1772).\n\nWilliam and Thomas Dawson Papers, 1721-1775; 96 items.\n\nCorrespondence (negative photostats).\n\nLibrary of Virginia (Personal Papers Collection)\n\nRichmond, Va.\n\nTucker-Ewell Papers, 1770-1893; 183 leaves; correspondence.\n\nThe Morgan Library and Museum\n\nNew York, NY\n\nLetter; 1781.\n\nLetter to Thomas Nelson, 1781 July 15, requesting a flag for Mrs. Tazewell “for the purpose of endeavouring to recover the Slaves she has lost…it being the Case of a worthy Widow, reduced to a considerable Degree of Distress, by an almost total Desertion of her Family Servants.”\n\nUniversity of Virginia (Albert and Shirley Small Special Collections Library)\n\nCharlottesville, Va.\n\nLetter, 1800.\n\nJohn Blair writes to James Monroe regarding appointments in Madison County, Virginia, 1800 May 20."}]}