{"In 1774, Blair was elected to the Continental Congress, where he served until 1776.": [{"url": "https://www.history.com/topics/american-revolution/the-continental-congress", "page_content": "The Continental Congress served as the government of the 13 American colonies, and later the United States, from 1774 to 1789. The First Continental Congress, comprised of delegates from the colonies, met in 1774 in reaction to the Intolerable Acts, a series of measures imposed by the British government after the colonies resisted new taxes. In 1775, the Second Continental Congress convened after the Revolutionary War had already begun. In 1776, it took the momentous step of declaring America’s independence from Britain. Five years later, the Congress ratified the first national constitution, the Articles of Confederation, under which the country would be governed until 1789, when it was replaced by the U.S. Constitution.\n\nBritain and the Imperial Crises\n\nVCG Wilson/Corbis/Getty Images A sheet of penny revenue stamps printed by Britain for the American colonies, after the Stamp Act of 1765.\n\nThroughout most of colonial history, the British Crown was the only political institution that united the American colonies. The Imperial Crises of the 1760s and 1770s, found England saddled with crippling debt, incurred in large part by wars such as the French and Indian War.\n\nThe British government responded by increasing taxes on the American colonists, which drove the colonies toward greater unity. Americans throughout the 13 colonies united in opposition to the new system of imperial taxation initiated by the British government in 1765.\n\nThe Stamp Act of that year–the first direct, internal tax imposed on the colonists by the British Parliament–inspired concerted resistance within the colonies. Nine colonial assemblies sent delegates to the Stamp Act Congress, an extralegal convention that met to coordinate the colonies’ response to the new tax. Although the Stamp Act Congress was short-lived, it hinted at the enhanced unity among the colonies that would soon follow.\n\nDid you know? Almost every significant political figure of the American Revolution served in the Continental Congress, including Samuel Adams, John Adams, John Hancock, John Jay, Alexander Hamilton, Thomas Jefferson, Benjamin Franklin, James Madison, Patrick Henry and George Washington.\n\nColonial opposition effectively killed the Stamp Act and brought about its repeal in 1766. The British government did not abandon its claim to the authority to pass laws for the colonies, however, and would make repeated attempts to exert its power over them in the years to follow.\n\nTaxation Without Representation\n\nIn response to the violence of the Boston Massacre of 1770 and new taxes like the Tea Act of 1773, a group of frustrated colonists protested taxation without representation by dumping 342 chests of tea into Boston Harbor on the night of December 16, 1773 – an event known to history as Boston Tea Party.\n\nColonists continued to coordinate their resistance to new imperial measures, but between 1766 until 1774, they did so primarily through committees of correspondence, which exchanged ideas and information, rather than through a united political body.\n\nThe First Continental Congress\n\nOn September 5, 1774, delegates from each of the 13 colonies—except Georgia, which was fighting a Native American uprising and was dependent on the British for military supplies—met at Carpenters’ Hall in Philadelphia as the First Continental Congress to organize colonial resistance to the Intolerable Acts (or Coercive Acts) recently passed by the British Parliament.\n\nThe delegates included a number of future luminaries, such as future presidents John Adams of Massachusetts and George Washington of Virginia, and future U.S. Supreme Court Chief Justice and diplomat John Jay of New York. The Congress was structured with emphasis on the equality of participants, and to promote free debate.\n\nAfter much discussion, the Congress issued a Declaration of Rights, affirming its loyalty to the British Crown but disputing the British Parliament’s right to tax it without representation in the parliament. The Congress also passed the Articles of Association, which called on the colonies to stop importing goods from the British Isles beginning on December 1, 1774, if the Intolerable Acts were not repealed.\n\nShould Britain fail to redress the colonists’ grievances in a timely manner, the Congress declared, then it would reconvene on May 10, 1775, and the colonies would cease to export goods to Britain on September 10, 1775. After proclaiming these measures, the First Continental Congress disbanded on October 26, 1774.\n\nSecond Continental Congress\n\nAs promised, Congress reconvened at Independence Hall in Philadelphia as the Second Continental Congress on May 10, 1775–and by then the American Revolution had already begun.\n\nThe British army in Boston had met with armed resistance on the morning of April 19, 1775, when it marched out to the towns of Lexington and Concord to seize a cache of weapons held by colonial Patriots who had ceased to recognize the authority of the royal government of Massachusetts.\n\nThe colonists drove the British expedition back to Boston and laid siege to the town. The Revolutionary War had begun.\n\nFighting for Reconciliation\n\nAlthough the Congress professed its abiding loyalty to the British Crown, it also took steps to preserve its rights by dint of arms. On June 14, 1775, a month after it reconvened, it created a united colonial fighting force, the Continental Army. The next day, it named George Washington as the new army’s commander in chief.\n\nThe following month, the Continental Congress issued its “Declaration of the Causes and Necessity of Taking Up Arms,” penned by John Dickinson of Pennsylvania, a veteran of the First Congress whose “Letters from a Farmer of Pennsylvania” (1767) had helped arouse opposition to earlier imperial measures, and by a newcomer from Virginia, Thomas Jefferson.\n\nIn an effort to avoid a full-scale war, Congress coupled this declaration with the Olive Branch Petition, a personal appeal to Britain’s King George III, asking him to help the colonists resolve their differences with Britain. The king dismissed the petition out of hand.\n\nCommon Sense, Divided Loyalties\n\nFor over a year, the Continental Congress supervised a war against a country to which it proclaimed its loyalty. In fact, both the Congress and the people it represented were divided on the question of independence even after a year of open warfare against Great Britain.\n\nEarly in 1776, a number of factors began to strengthen the call for separation. In his stirring pamphlet “Common Sense,” published in January of that year, the British immigrant Thomas Paine laid out a convincing argument in favor of independence.\n\nAt the same time, many Americans came to realize that their military might not be capable of defeating the British Empire on its own. Independence would allow it to form alliances with Britain’s powerful rivals—and France was at the forefront of everyone’s mind. Meanwhile, the war itself evoked hostility toward Britain among the citizenry, paving the way for independence.\n\nDeclaration of Independence\n\nIn the spring of 1776, the provisional colonial governments began to send new instructions to their congressional delegates, obliquely or directly allowing them to vote for independence. The provisional government of Virginia went further: It instructed its delegation to submit a proposal for independence before Congress.\n\nOn June 7, Virginia delegate Richard Henry Lee complied with his instructions. Congress postponed a final vote on the proposal until July 1, but appointed a committee to draft a provisional declaration of independence for use should the proposal pass.\n\nThe committee consisted of five men, including John Adams and Benjamin Franklin of Pennsylvania. But the declaration was primarily the work of one man, Thomas Jefferson, who penned an eloquent defense of the natural rights of all people, of which, he charged, Parliament and the king had tried to deprive the American nation.\n\nThe Continental Congress made several revisions to Jefferson’s draft, removing, among other things, an attack on the institution of slavery; but on July 4, 1776, the Congress voted to approve the Declaration of Independence.\n\nWaging the War\n\nThe Declaration of Independence allowed Congress to seek alliances with foreign countries, and the fledgling U.S. formed its most important alliance early in 1778 with France, without the support of which America might well have lost the Revolutionary War.\n\nIf the Franco-American alliance was one of Congress’s greatest successes, funding and supplying the war were among its worst failures. Lacking a pre-existing infrastructure, Congress struggled throughout the war to provide the Continental Army with adequate supplies and provisions.\n\nExacerbating the problem, Congress had no mechanism to collect taxes to pay for the war; instead, it relied on contributions from the states, which generally directed whatever revenue they raised toward their own needs. As a result, the paper money issued by Congress quickly came to be regarded as worthless.\n\nThe Articles of Confederation\n\nCongress’s inability to raise revenue would bedevil it for its entire existence, even after it created a constitution, known as the Articles of Confederation, to define its powers. Drafted and adopted by the Congress in 1777 but not ratified until 1781, it effectively established the United States as a collection of 13 sovereign states, each of which had an equal voice in Congress (which became officially known as the Congress of the Confederation) regardless of population.\n\nUnder the Articles, congressional decisions were made based on a state-by-state vote, and the Congress had little ability to enforce its decisions. The Articles of Confederation would prove incapable of governing the new nation in a time of peace, but they did not seriously undermine the war effort, both because the war was effectively winding down before the Articles took effect, and because Congress ceded many executive war powers to General Washington.\n\nTreaty of Paris\n\nCongress’s final triumph came in 1783 when it negotiated the Treaty of Paris, officially ending the Revolutionary War. The Congressional delegates Franklin, Jay and Adams secured a favorable peace for the U.S. that included not only the recognition of independence, but also claim to almost all of the territory south of Canada and east of the Mississippi River.\n\nOn November 25, 1783, the last British troops evacuated New York City. The Revolutionary War was over and Congress had helped to see the country through.\n\nHowever, the Articles of Confederation proved an imperfect instrument for a nation at peace with the world. The years immediately following the end of the Revolutionary War in 1783 presented the young American nation with a series of difficulties that Congress could not adequately remedy: dire financial straits, interstate rivalries and domestic insurrection.\n\nLegacy of the Continental Congress\n\nA movement developed for constitutional reform, culminating in the Philadelphia Convention of 1787. The delegates at the convention decided to scrap the Articles of Confederation completely and create a new system of government.\n\nIn 1789, the new U.S. Constitution went into effect and the Continental Congress adjourned forever and was replaced by the U.S. Congress. Although the Continental Congress did not function well in a time of peace, it had steered the nation through one of its worst crises, declared its independence and helped to win a war to secure that independence.\n\nREAD MORE: What Did the Three Continental Congresses Do?\n\nSources\n\nContinental Congress, 1774–1781. U.S. Department of State. Office of the Historian.\n\nFirst Continental Congress. George Washington’s Mount Vernon.\n\nThe Continental Congress. PBS: American Experience.\n\nContinental and Confederation Congresses. U.S. House of Representatives: History, Art & Archives.\n\nThe Second Continental Congress and the Declaration of Independence. National Park Service."}, {"url": "https://www.britannica.com/topic/Continental-Congress", "page_content": "Continental Congress, in the period of the American Revolution, the body of delegates who spoke and acted collectively for the people of the colony-states that later became the United States of America. The term most specifically refers to the bodies that met in 1774 and 1775–81 and respectively designated as the First Continental Congress and the Second Continental Congress.\n\nIn the spring of 1774 the British Parliament’s passage of the Intolerable (Coercive) Acts, including the closing of the port of Boston, provoked keen resentment in the colonies. The First Continental Congress, convened in response to the Acts by the colonial Committees of Correspondence, met in Philadelphia on September 5, 1774. Fifty-six deputies represented all the colonies except Georgia. Peyton Randolph of Virginia was unanimously elected president, thus establishing usage of that term as well as “Congress.” Charles Thomson of Pennsylvania was elected secretary and served in that office during the 15-year life of the Congress.\n\nBritannica Quiz U.S. Constitutional History Quiz\n\nTo provide unity, delegates gave one vote to each state regardless of its size. The First Continental Congress included Patrick Henry, George Washington, John and Samuel Adams, John Jay, and John Dickinson. Meeting in secret session, the body rejected a plan for reconciling British authority with colonial freedom. Instead, it adopted a declaration of personal rights, including life, liberty, property, assembly, and trial by jury. The declaration also denounced taxation without representation and the maintenance of the British army in the colonies without their consent. Parliamentary regulation of American commerce, however, was willingly accepted.\n\nIn October 1774 the Congress petitioned the crown for a redress of grievances accumulated since 1763. In an effort to force compliance, it called for a general boycott of British goods and eventual nonexportation of American products, except rice, to Britain or the British West Indies. Its last act was to set a date for another Congress to meet on May 10, 1775, to consider further steps.\n\nBefore that Second Continental Congress assembled in the Pennsylvania State House, hostilities had already broken out between Americans and British troops at Lexington and Concord, Massachusetts. New members of the Second Congress included Benjamin Franklin and Thomas Jefferson. John Hancock and John Jay were among those who served as president. The Congress “adopted” the New England military forces that had converged upon Boston and appointed Washington commander in chief of the American army on June 15, 1775. It also acted as the provisional government of the 13 colony-states, issuing and borrowing money, establishing a postal service, and creating a navy. Although the Congress for some months maintained that the Americans were struggling for their rights within the British Empire, it gradually cut tie after tie with Britain until separation was complete. On July 2, 1776, with New York abstaining, the Congress “unanimously” resolved that “these United Colonies are, and of right ought to be, free and independent states.” Two days later it solemnly approved this Declaration of Independence. The Congress also prepared the Articles of Confederation, which, after being sanctioned by all the states, became the first U.S. constitution in March 1781.\n\nThe Articles placed Congress on a constitutional basis, legalizing the powers it had exercised since 1775. To underline this distinction, the Congress that met under the Articles of Confederation is often referred to as the Congress of the Confederation, or the Confederation Congress. This Congress continued to function until the new Congress, elected under the present Constitution, met in 1789."}, {"url": "https://www.nationalgeographic.org/encyclopedia/continental-congress/", "page_content": "The Continental Congress was a group of delegates who worked together to act on behalf of the North American colonies in the 1770s. Beginning with the Sugar Act in 1764, the British Parliament passed a series of laws that were unpopular with many colonists in the North American colonies. The colonists came together in what came to be known as the Committees of Correspondence to discuss their rights and how to respond to the acts that they believed trampled on those rights. These committees began to work together to forge a cooperative, united approach.\n\n\n\nIn 1774, matters came to a head after Britain passed the Coercive Acts, a series of acts that the colonists called the Intolerable Acts. These acts, which included the closing of the port of Boston and establishing British military rule in Massachusetts, were intended to punish the colony of Massachusetts for the infamous Boston Tea Party and to force that colony to pay for the lost tea. Britain also hoped to isolate the rebels in Massachusetts and dissuade other colonies from similar acts of defiance. In response, the Committees of Congress called for a meeting of delegates . On September 5, 1774, 56 delegates met in Philadelphia, Pennsylvania. This First Continental Congress represented all the 13 colonies, except Georgia. It included some of the finest leaders in the land, including George Washington, Patrick Henry, John Adams, Samuel Adams, and John Jay. The group elected Peyton Randolph of Virginia as its president.\n\n\n\nThe group met in secret to discuss how the colonies should respond to what they perceived to be an imposition of their rights. At this meeting, the Congress adopted a Declaration of Rights and Grievances. They declared that their rights as Englishmen included life, liberty, property, and trial by jury. The declaration denounced taxation without representation. The Congress called for a boycott of British goods and petitioned King George III for a remedy for their grievances. Before departing, the Congress agreed to meet again on May 10, 1775.\n\n\n\nBy the time this Second Continental Congress convened, hostilities had already broken out between British troops and its American colonists at Lexington, Massachusetts, and Concord, Massachusetts. The Congress agreed to a coordinated military response and appointed George Washington as commander of the American militia. On July 4, 1776, the delegates cut all remaining ties with England by unanimously approving the Declaration of Independence.\n\n\n\nFor the duration of the Revolutionary War, the Continental Congress served as a provisional, or temporary, government of the American colonies. The Congress drafted the Articles of Confederation, the first constitution of the United States, which went into effect in 1781. Under this government , the Continental Congress gave way to the Confederation Congress, which included many of the same delegates . This group continued to provide leadership to the new country until a new Congress, elected under the new Constitution passed in 1789, went into effect.\n\n\n\n"}, {"url": "https://www.archives.gov/founding-docs/founding-fathers-virginia", "page_content": "The Founding Fathers: Virginia\n\nJohn Blair, Virginia\n\nScion of a prominent Virginia family, Blair was born at Williamsburg in 1732. He was the son of John Blair, a colonial official and nephew of James Blair, founder and first president of the College of William and Mary. Signer Blair graduated from that institution and studied law at London's Middle Temple. Thereafter, he practiced at Williamsburg. In the years 1766-70 he sat in the Virginia House of Burgesses as the representative of William and Mary. From 1770 to 1775 he held the position of clerk of the colony's council.\n\nAn active patriot, Blair signed the Virginia Association of June 22, 1770, which pledged to abandon importation of British goods until the Townshend Duties were repealed. He also underwrote the Association of May 27, 1774, calling for a meeting of the colonies in a Continental Congress and supporting the Bostonians. He took part in the Virginia constitutional convention (1776), at which he sat on the committee that framed a declaration of rights as well as the plan for a new government. He next served on the Privy Council (1776-78). In the latter year, the legislature elected him as a judge of the General Court, and he soon took over the chief justiceship. In 1780 he won election to Virginia's high chancery court, where his colleague was George Wythe.\n\nBlair attended the Constitutional Convention religiously but never spoke or served on a committee. He usually sided with the position of the Virginia delegation. And, in the commonwealth ratifying convention, Blair helped win backing for the new framework of government.\n\nIn 1789 Washington named Blair as an associate justice of the U.S. Supreme Court, where he helped decide many important cases. Resigning that post in 1796, he spent his remaining years in Williamsburg. A widower, his wife (born Jean Balfour) having died in 1792, he lived quietly until he succumbed in 1800. He was 68 years old. His tomb is in the graveyard of Bruton Parish Church.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-GW-533b)\n\nJames Madison, Virginia\n\nThe oldest of 10 children and a scion of the planter aristocracy, Madison was born in 1751 at Port Conway, King George County, VA, while his mother was visiting her parents. In a few weeks she journeyed back with her newborn son to Montpelier estate, in Orange County, which became his lifelong home. He received his early education from his mother, from tutors, and at a private school. An excellent scholar though frail and sickly in his youth, in 1771 he graduated from the College of New Jersey (later Princeton), where he demonstrated special interest in government and the law. But, considering the ministry for a career, he stayed on for a year of postgraduate study in theology.\n\nBack at Montpelier, still undecided on a profession, Madison soon embraced the patriot cause, and state and local politics absorbed much of his time. In 1775 he served on the Orange County committee of safety; the next year at the Virginia convention, which, besides advocating various Revolutionary steps, framed the Virginia constitution; in 1776-77 in the House of Delegates; and in 1778-80 in the Council of State. His ill health precluded any military service.\n\nIn 1780 Madison was chosen to represent Virginia in the Continental Congress (1780-83 and 1786-88). Although originally the youngest delegate, he played a major role in the deliberations of that body. Meantime, in the years 1784-86, he had again sat in the Virginia House of Delegates. He was a guiding force behind the Mount Vernon Conference (1785), attended the Annapolis Convention (1786), and was otherwise highly instrumental in the convening of the Constitutional Convention in 1787. He had also written extensively about deficiencies in the Articles of Confederation.\n\nMadison was clearly the preeminent figure at the convention. Some of the delegates favored an authoritarian central government; others, retention of state sovereignty; and most occupied positions in the middle of the two extremes. Madison, who was rarely absent and whose Virginia Plan was in large part the basis of the Constitution, tirelessly advocated a strong government, though many of his proposals were rejected. Despite his poor speaking capabilities, he took the floor more than 150 times, third only after Gouverneur Morris and James Wilson. Madison was also a member of numerous committees, the most important of which were those on postponed matters and style. His journal of the convention is the best single record of the event. He also played a key part in guiding the Constitution through the Continental Congress.\n\nPlaying a lead in the ratification process in Virginia, too, Madison defended the document against such powerful opponents as Patrick Henry, George Mason, and Richard Henry Lee. In New York, where Madison was serving in the Continental Congress, he collaborated with Alexander Hamilton and John Jay in a series of essays that in 1787-88 appeared in the newspapers and were soon published in book form as The Federalist (1788). This set of essays is a classic of political theory and a lucid exposition of the republican principles that dominated the framing of the Constitution.\n\nIn the U.S. House of Representatives (1789-97), Madison helped frame and ensure passage of the Bill of Rights. He also assisted in organizing the executive department and creating a system of federal taxation. As leaders of the opposition to Hamilton's policies, he and Jefferson founded the Democratic-Republican Party.\n\nIn 1794 Madison married a vivacious widow who was 16 years his junior, Dolley Payne Todd, who had a son; they were to raise no children of their own. Madison spent the period 1797-1801 in semiretirement, but in 1798 he wrote the Virginia Resolutions, which attacked the Alien and Sedition Acts. While he served as Secretary of State (1801-9), his wife often served as President Jefferson's hostess.\n\nIn 1809 Madison succeeded Jefferson. Like the first three Presidents, Madison was enmeshed in the ramifications of European wars. Diplomacy had failed to prevent the seizure of U.S. ships, goods, and men on the high seas, and a depression wracked the country. Madison continued to apply diplomatic techniques and economic sanctions, eventually effective to some degree against France. But continued British interference with shipping, as well as other grievances, led to the War of 1812.\n\nThe war, for which the young nation was ill prepared, ended in stalemate in December 1814 when the inconclusive Treaty of Ghent which nearly restored prewar conditions, was signed. But, thanks mainly to Andrew Jackson's spectacular victory at the Battle of New Orleans (Chalmette) in January 1815, most Americans believed they had won. Twice tested, independence had survived, and an ebullient nationalism marked Madison's last years in office, during which period the Democratic-Republicans held virtually uncontested sway.\n\nIn retirement after his second term, Madison managed Montpelier but continued to be active in public affairs. He devoted long hours to editing his journal of the Constitutional Convention, which the government was to publish 4 years after his death. He served as co-chairman of the Virginia constitutional convention of 1829-30 and as rector of the University of Virginia during the period 1826-36. Writing newspaper articles defending the administration of Monroe, he also acted as his foreign policy adviser.\n\nMadison spoke out, too, against the emerging sectional controversy that threatened the existence of the Union. Although a slaveholder all his life, he was active during his later years in the American Colonization Society, whose mission was the resettlement of slaves in Africa.\n\nMadison died at the age of 85 in 1836, survived by his wife and stepson.\n\nImage: Courtesy of the Collection of Gilcrease Museum, Tulsa\n\nGeorge Mason, Virginia\n\nIn 1725 George Mason was born to George and Ann Thomson Mason. When the boy was 10 years old his father died, and young George's upbringing was left in the care of his uncle, John Mercer. The future jurist's education was profoundly shaped by the contents of his uncle's 1500-volume library, one-third of which concerned the law.\n\nMason established himself as an important figure in his community. As owner of Gunston Hall he was one of the richest planters in Virginia. In 1750 he married Anne Eilbeck, and in 23 years of marriage they had five sons and four daughters. In 1752 he acquired an interest in the Ohio Company, an organization that speculated in western lands. When the crown revoked the company's rights in 1773, Mason, the company's treasurer, wrote his first major state paper, Extracts from the Virginia Charters, with Some Remarks upon Them.\n\nDuring these years Mason also pursued his political interests. He was a justice of the Fairfax County court, and between 1754 and 1779 Mason was a trustee of the city of Alexandria. In 1759 he was elected to the Virginia House of Burgesses. When the Stamp Act of 1765 aroused outrage in the colonies, George Mason wrote an open letter explaining the colonists' position to a committee of London merchants to enlist their support.\n\nIn 1774 Mason again was in the forefront of political events when he assisted in drawing up the Fairfax Resolves, a document that outlined the colonists' constitutional grounds for their objections to the Boston Port Act. Virginia's Declaration of Rights, framed by Mason in 1776, was widely copied in other colonies, served as a model for Jefferson in the first part of the Declaration of Independence, and was the basis for the federal Constitution's Bill of Rights.\n\nThe years between 1776 and 1780 were filled with great legislative activity. The establishment of a government independent of Great Britain required the abilities of persons such as George Mason. He supported the disestablishment of the church and was active in the organization of military affairs, especially in the West. The influence of his early work, Extracts from the Virginia Charters, is seen in the 1783 peace treaty with Great Britain, which fixed the Anglo-American boundary at the Great Lakes instead of the Ohio River. After independence, Mason drew up the plan for Virginia's cession of its western lands to the United States.\n\nBy the early 1780s, however, Mason grew disgusted with the conduct of public affairs and retired. He married his second wife, Sarah Brent, in 1780. In 1785 he attended the Mount Vernon meeting that was a prelude to the Annapolis convention of 1786, but, though appointed, he did not go to Annapolis.\n\nAt Philadelphia in 1787 Mason was one of the five most frequent speakers at the Constitutional Convention. He exerted great influence, but during the last 2 weeks of the convention he decided not to sign the document.\n\nMason's refusal prompts some surprise, especially since his name is so closely linked with constitutionalism. He explained his reasons at length, citing the absence of a declaration of rights as his primary concern. He then discussed the provisions of the Constitution point by point, beginning with the House of Representatives. The House he criticized as not truly representative of the nation, the Senate as too powerful. He also claimed that the power of the federal judiciary would destroy the state judiciaries, render justice unattainable, and enable the rich to oppress and ruin the poor. These fears led Mason to conclude that the new government was destined to either become a monarchy or fall into the hands of a corrupt, oppressive aristocracy.\n\nTwo of Mason's greatest concerns were incorporated into the Constitution. The Bill of Rights answered his primary objection, and the 11th amendment addressed his call for strictures on the judiciary.\n\nThroughout his career Mason was guided by his belief in the rule of reason and in the centrality of the natural rights of man. He approached problems coolly, rationally, and impersonally. In recognition of his accomplishments and dedication to the principles of the Age of Reason, Mason has been called the American manifestation of the Enlightenment. Mason died on October 7, 1792, and was buried on the grounds of Gunston Hall.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-CP-121)\n\nJames McClurg, Virginia\n\nJames McClurg was born near Hampton, VA, in 1746. He attended the College of William and Mary and graduated in 1762. McClurg then studied medicine at the University of Edinburgh and received his degree in 1770. He pursued postgraduate medical studies in Paris and London and published Experiments upon the Human Bile and Reflections on the Biliary Secretions (1772) in London. His work and writings were well-received and respected by the medical community, and his article was translated into several languages. In 1773 McClurg returned to Virginia and served as a surgeon in the state militia during the Revolution.\n\nBefore the end of the war the College of William and Mary appointed McClurg its professor of anatomy and medicine. The same year, 1779, he married Elizabeth Seldon. James McClurg's reputation continued to grow, and he was regarded as one of the most eminent physicians in Virginia. In 1820 and 1821 he was president of the state medical society.\n\nIn addition to his medical practice, McClurg pursued politics. In 1782 James Madison advocated McClurg's appointment as secretary of foreign affairs for the United States but was unsuccessful. When Richard Henry Lee and Patrick Henry declined to serve as representatives to the Constitutional Convention in 1787, McClurg was asked to join Virginia's delegation. In Philadelphia McClurg advocated a life tenure for the President and argued for the ability of the federal government to override state laws. Even as some at the convention expressed apprehension of the powers allotted to the presidency, McClurg championed greater independence of the executive from the legislative branch. He left the convention in early August, however, and did not sign the Constitution.\n\nJames McClurg's political service did not end with the convention. During George Washington's administration McClurg served on Virginia's executive council. He died in Richmond, VA, on July 9, 1823.\n\nEdmund Randolph, Virginia\n\nOn August 10, 1753, Edmund Randolph was born in Tazewell Hall, Williamsburg, VA. His parents were Ariana Jenings and John Randolph. Edmund attended the College of William and Mary and continued his education by studying the law under his father's tutelage.\n\nWhen the Revolution broke out, father and son followed different paths. John Randolph, a Loyalist, followed the royal governor, Lord Dunmore, to England, in 1775. Edmund then lived with his uncle Peyton Randolph, a prominent figure in Virginia politics. During the war Edmund served as an aide-de-camp to General Washington and also attended the convention that adopted Virginia's first state constitution in 1776. He was the convention's youngest member at age 23. Randolph married Elizabeth Nicholas in 1776.\n\nRandolph continued to advance in the political world. He became mayor of Williamsburg and Virginia's attorney-general. In 1779 he was elected to the Continental Congress, and in November 1786 Randolph became Governor of Virginia. In 1786 he was a delegate to the Annapolis Convention.\n\nFour days after the opening of the federal convention in Philadelphia, on May 29, 1787, Edmund Randolph presented the Virginia Plan for creating a new government. This plan proposed a strong central government composed of three branches, legislative, executive, and judicial, and enabled the legislative to veto state laws and use force against states that failed to fulfill their duties. After many debates and revisions, including striking the section permitting force against a state, the Virginia Plan became in large part the basis of the Constitution.\n\nThough Randolph introduced the highly centralized Virginia Plan, he fluctuated between the Federalist and Antifederalist points of view. He sat on the Committee of Detail that prepared a draft of the Constitution, but by the time the document was adopted, Randolph declined to sign. He felt it was not sufficiently republican, and he was especially wary of creating a one-man executive. He preferred a three-man council since he regarded \"a unity in the Executive\" to be the \"foetus of monarchy.\" In a Letter . . . on the Federal Constitution, dated October 10, 1787, Randolph explained at length his objections to the Constitution. The old Articles of Confederation were inadequate, he agreed, but the proposed new plan of union contained too many flaws. Randolph was a strong advocate of the process of amendment. He feared that if the Constitution were submitted for ratification without leaving the states the opportunity to amend it, the document might be rejected and thus close off any hope of another plan of union. However, he hoped that amendments would be permitted and second convention called to incorporate the changes.\n\nBy the time of the Virginia convention for ratification, Randolph supported the Constitution and worked to win his state's approval of it. He stated his reason for his switch: \"The accession of eight states reduced our deliberations to the single question of Union or no Union.\"\n\nUnder President Washington, Edmund Randolph became Attorney General of the United States. After Thomas Jefferson resigned as Secretary of State, Randolph assumed that post for the years 1794-95. During the Jefferson-Hamilton conflict he tried to remain unaligned. After retiring from politics in 1795, Randolph resumed his law practice and was regarded as a leading figure in the legal community. During his retirement he wrote a history of Virginia. When Aaron Burr went on trial for treason in 1807, Edmund Randolph acted as his senior counsel. In 1813, at age 60 and suffering from paralysis, Randolph died while visiting Nathaniel Burwell at Carter Hall. His body is buried in the graveyard of the nearby chapel.\n\nImage: Courtesy of National Archives, Records of Exposition, Anniversary, and Memorial Commissions (148-CCD-40)\n\nGeorge Washington, Virginia\n\nThe eldest of six children from his father's second marriage, George Washington was born into the landed gentry in 1732 at Wakefield Plantation, VA. Until reaching 16 years of age, he lived there and at other plantations along the Potomac and Rappahannock Rivers, including the one that later became known as Mount Vernon. His education was rudimentary, probably being obtained from tutors but possibly also from private schools, and he learned surveying. After he lost his father when he was 11 years old, his half-brother Lawrence, who had served in the Royal Navy, acted as his mentor. As a result, the youth acquired an interest in pursuing a naval career, but his mother discouraged him from doing so.\n\nAt the age of 16, in 1748, Washington joined a surveying party sent out to the Shenandoah Valley by Lord Fairfax, a land baron. For the next few years, Washington conducted surveys in Virginia and present West Virginia and gained a lifetime interest in the West. In 1751-52 he also accompanied Lawrence on a visit he made to Barbados, West Indies, for health reasons just before his death.\n\nThe next year, Washington began his military career when the royal governor appointed him to an adjutantship in the militia, as a major. That same year, as a gubernatorial emissary, accompanied by a guide, he traveled to Fort Le Boeuf, PA, in the Ohio River Valley, and delivered to French authorities an ultimatum to cease fortification and settlement in English territory. During the trip, he tried to better British relations with various Indian tribes.\n\nIn 1754, winning the rank of lieutenant colonel and then colonel in the militia, Washington led a force that sought to challenge French control of the Ohio River Valley, but met defeat at Fort Necessity, PA - an event that helped trigger the French and Indian War (1754-63). Late in 1754, irked by the dilution of his rank because of the pending arrival of British regulars, he resigned his commission. That same year, he leased Mount Vernon, which he was to inherit in 1761.\n\nIn 1755 Washington reentered military service with the courtesy title of colonel, as an aide to Gen. Edward Braddock, and barely escaped death when the French defeated the general's forces in the Battle of the Monongahela, PA. As a reward for his bravery, Washington rewon his colonelcy and command of the Virginia militia forces, charged with defending the colony's frontier. Because of the shortage of men and equipment, he found the assignment challenging. Late in 1758 or early in 1759, disillusioned over governmental neglect of the militia and irritated at not rising in rank, he resigned and headed back to Mount Vernon.\n\nWashington then wed Martha Dandridge Custis, a wealthy widow and mother of two children. The marriage produced no offspring, but Washington reared those of his wife as his own. During the period 1759-74, he managed his plantations and sat in the Virginia House of Burgesses. He supported the initial protests against British policies; took an active part in the nonimportation movement in Virginia; and, in time, particularly because of his military experience, became a Whig leader.\n\nBy the 1770s, relations of the colony with the mother country had become strained. Measured in his behavior but strongly sympathetic to the Whig position and resentful of British restrictions and commercial exploitation, Washington represented Virginia at the First and Second Continental Congresses. In 1775, after the bloodshed at Lexington and Concord, Congress appointed him as commander in chief of the Continental Army. Overcoming severe obstacles, especially in supply, he eventually fashioned a well-trained and disciplined fighting force.\n\nThe strategy Washington evolved consisted of continual harassment of British forces while avoiding general actions. Although his troops yielded much ground and lost a number of battles, they persevered even during the dark winters at Valley Forge, PA, and Morristown, NJ. Finally, with the aid of the French fleet and army, he won a climactic victory at the Battle of Yorktown, VA, in 1781.\n\nDuring the next 2 years, while still commanding the agitated Continental Army, which was underpaid and poorly supplied, Washington denounced proposals that the military take over the government, including one that planned to appoint him as king, but supported army petitions to the Continental Congress for proper compensation. Once the Treaty of Paris (1783) was signed, he resigned his commission and returned once again to Mount Vernon. His wartime financial sacrifices and long absence, as well as generous loans to friends, had severely impaired his extensive fortune, which consisted mainly of his plantations, slaves, and landholdings in the West. At this point, however, he was to have little time to repair his finances, for his retirement was brief.\n\nDissatisfied with national progress under the Articles of Confederation, Washington advocated a stronger central government. He hosted the Mount Vernon Conference (1785) at his estate after its initial meetings in Alexandria, though he apparently did not directly participate in the discussions. Despite his sympathy with the goals of the Annapolis Convention (1786), he did not attend. But, the following year, encouraged by many of his friends, he presided over the Constitutional Convention, whose success was immeasurably influenced by his presence and dignity. Following ratification of the new instrument of government in 1788, the electoral college unanimously chose him as the first President.\n\nThe next year, after a triumphal journey from Mount Vernon to New York City, Washington took the oath of office at Federal Hall. During his two precedent-setting terms, he governed with dignity as well as restraint. He also provided the stability and authority the emergent nation so sorely needed, gave substance to the Constitution, and reconciled competing factions and divergent policies within the government and his administration. Although not averse to exercising presidential power, he respected the role of Congress and did not infringe upon its prerogatives. He also tried to maintain harmony between his Secretary of State Thomas Jefferson and Secretary of the Treasury Alexander Hamilton, whose differences typified evolving party divisions from which Washington kept aloof.\n\nYet, usually leaning upon Hamilton for advice, Washington supported his plan for the assumption of state debts, concurred in the constitutionality of the bill establishing the Bank of the United States, and favored enactment of tariffs by Congress to provide federal revenue and protect domestic manufacturers.\n\nWashington took various other steps to strengthen governmental authority, including suppression of the Whisky Rebellion (1794). To unify the country, he toured the Northeast in 1789 and the South in 1791. During his tenure, the government moved from New York to Philadelphia in 1790, he superintended planning for relocation to the District of Columbia, and he laid the cornerstone of the Capitol (1793).\n\nIn foreign affairs, despite opposition from the Senate, Washington exerted dominance. He fostered United States interests on the North American continent by treaties with Britain and Spain. Yet, until the nation was stronger, he insisted on the maintenance of neutrality. For example, when the French Revolution created war between France and Britain, he ignored the remonstrances of pro-French Jefferson and pro-English Hamilton.\n\nAlthough many people encouraged Washington to seek a third term, he was weary of politics and refused to do so. In his \"Farewell Address\" (1796), he urged his countrymen to forswear party spirit and sectional differences and to avoid entanglement in the wars and domestic policies of other nations.\n\nWashington enjoyed only a few years of retirement at Mount Vernon. Even then, demonstrating his continued willingness to make sacrifices for his country in 1798 when the nation was on the verge of war with France he agreed to command the army, though his services were not ultimately required. He died at the age of 67 in 1799. In his will, he emancipated his slaves.\n\nImage: Courtesy of National Portrait Gallery, Smithsonian Institution\n\nGeorge Wythe, Virginia\n\nGeorge Wythe, the second of Thomas and Margaret Wythe's three children, was born in 1726 on his family's plantation on the Back River in Elizabeth City County, VA. Both parents died when Wythe was young, and he grew up under the guardianship of his older brother, Thomas. Though Wythe was to become an eminent jurist and teacher, he received very little formal education. He learned Latin and Greek from his well-educated mother, and he probably attended for a time a grammar school operated by the College of William and Mary.\n\nWythe's brother later sent him to Prince George County to read law under an uncle. In 1746, at age 20, he joined the bar, moved to Spotsylvania County, and became associated with a lawyer there. In 1747 he married his partner's sister, Ann Lewis, but she died the next year. In 1754 Lt. Gov. Robert Dinwiddie appointed him as acting colonial attorney general, a position that he held for only a few months. The next year, Wythe's brother died and he inherited the family estate. He chose, however, to live in Williamsburg in the house that his new father-in-law, an architect, designed and built for him and his wife, Elizabeth Taliaferro. They married in 1755, and their only child died in infancy.\n\nAt Williamsburg, Wythe immersed himself in further study of the classics and the law and achieved accreditation by the colonial supreme court. He served in the House of Burgesses from the mid-1750s until 1775, first as delegate and after 1769 as clerk. In 1768 he became mayor of Williamsburg, and the next year he sat on the board of visitors of the College of William and Mary. During these years he also directed the legal studies of young scholars, notably Thomas Jefferson. Wythe and Jefferson maintained a lifelong friendship, first as mentor and pupil and later as political allies.\n\nWythe first exhibited revolutionary leanings in 1764 when Parliament hinted to the colonies that it might impose a stamp tax. By then an experienced legislator, he drafted for the House of Burgesses a remonstrance to Parliament so strident that his fellow delegates modified it before adoption. Wythe was one of the first to express the concept of separate nationhood for the colonies within the British empire.\n\nWhen war broke out, Wythe volunteered for the army but was sent to the Continental Congress. Although present from 1775 through 1776, Wythe exerted little influence and signed the Declaration of Independence after the formal signing in August 1776. That same year, Wythe, Jefferson, and Edmund Pendleton undertook a 3-year project to revise Virginia's legal code. In 1777 Wythe also presided as speaker of the Virginia House of Delegates.\n\nAn appointment as one of the three judges of the newly created Virginia high court of chancery followed in 1778. For 28 years, during 13 of which he was the only chancellor, Wythe charted the course of Virginia jurisprudence. In addition, he was an ex officio member of the state superior court.\n\nWythe's real love was teaching. In 1779 Jefferson and other officials of the College of William and Mary created the first chair of law in a U.S. institution of higher learning and appointed Wythe to fill it. In that position, he educated America's earliest college-trained lawyers, among them John Marshall and James Monroe. In 1787 he attended the Constitutional Convention but played an insignificant role. He left the proceedings early and did not sign the Constitution. The following year, however, he was one of the Federalist leaders at the Virginia ratifying convention. There he presided over the Committee of the Whole and offered the resolution for ratification.\n\nIn 1791, the year after Wythe resigned his professorship, his chancery duties caused him to move to Richmond, the state capital. He was reluctant to give up his teaching, however, and opened a private law school. One of his last and most promising pupils was young Henry Clay.\n\nIn 1806, in his eightieth year, Wythe died at Richmond under mysterious circumstances, probably of poison administered by his grandnephew and heir, George Wythe Sweeney. Reflecting a lifelong aversion to slavery, Wythe emancipated his slaves in his will. His grave is in the yard of St. John's Episcopal Church in Richmond.\n\nBack to Main Founding Fathers Page"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/adams-continental-congresses/", "page_content": "The First Continental Congress formed in response to the British Parliament's passage of the Intolerable Acts (called the Coercive Acts in England), which aimed to punish Massachusetts for the Boston Tea Party. In 1773 rebels unconvincingly disguised as Mohawk Indians boarded three docked ships in Boston Harbor and dumped 90,000 pounds of tea overboard. England moved swiftly to punish this act of blatant disrespect. The Intolerable Acts closed the busy port until the colonists repaid the damage caused by the Tea Party, installed a British general as governor of the colony, unilaterally changed the colony's charter, and even revoked certain liberties, including the right to hold meetings.\n\nCourtesy: Library of Congress\n\nThe First Meeting Towards Independence\n\nOn September 5, 1774, delegates from 12 of the 13 colonies met for the first time at Carpenter's Hall in Philadelphia. Only Georgia didn't send a representative. John Adams served as one of four Massachusetts delegates and quickly established himself as a strong proponent for independence. He said independence, not reconciliation, could be the colonies' only course. It was a radical idea. Many of the delegates feared more trade boycotts and brutalization in a war that could not be won, but Adams knew that war was unavoidable if freedom was to be secured. During these congressional sessions, he earned the nickname the \"Atlas of Independence.\"\n\nDemands in Place\n\nBy the time the First Continental Congress adjourned in October 1774, significant steps had been taken toward Adams' goal. The colonies had formed a united front: If one colony was attacked, the other colonies would defend it. Under The Declaration and Resolves, the Congress condemned British Parliament and King George III for interfering in colonial matters and granted each colony the right to a colonial treasury and legislature. The Congress also passed the Suffolk Resolves in defiance of the Intolerable Acts (which would be repealed in 1778); set up the Continental Association to enforce a national embargo of trade with Great Britain; and called for the training of a colonial militia. Lastly the Continental Congress issued a petition, the Declaration of Rights and Grievances, to King George, a portion of which was written by John Adams. Something of a precursor to the Declaration of Independence, it called for greater American autonomy and limits on Parliament's power over the colonies.\n\nA Change of Tone\n\nBy the time the Second Continental Congress convened on May 10, 1775, with delegates from all 13 colonies in attendance, war had begun, and the tone of the Congress had changed. In a letter to Abigail, Adams described the delegates as falling into three camps: the loyalists who hadn't yet forsworn allegiance to the king; the middle third, who were too cautious to take a stand on either side of the issue; and those who believed independence must be the goal of the war. Adams, of course, was the truest of the true blue.\n\nCourtesy: Library of Congress\n\nTaking Action, Undecided Folly\n\nThe first session of the Second Continental Congress lasted from May to July, the second from September to December 1775. The Congress acted as a makeshift central government, creating the Continental Army, electing George Washington as its commander and issuing paper currency. It asked each colony to provide soldiers and money for the new army, issued a declaration allowing colonists to use their weapons, and reopened American ports in defiance of the Navigation Act. Yet the Congress still could not reach a consensus on independence. Although all the delegates recognized that America was at war, not all were prepared to relinquish ties to the British crown. Pennsylvania's John Dickinson called the goal of independence \"suicidal folly.\" In July 1775 he drew up the Olive Branch Petition, which asked King George III for changes in governance, but did not threaten to end American allegiance. Over Adams' protest, Dickinson's petition was sent. The king refused to look at it.\n\nCongress Uses Common Sense\n\nBy the summer of 1776, with many revolutionary battles already fought and lost, Congressional sentiment had swung almost unanimously toward independence, with a big boost from Thomas Paine's rousing pamphlet Common Sense. On June 7, 1776, Virginia's Richard Henry Lee put forth a resolution that proclaimed the colonies \"free and independent states ... absolved from all allegiance to the British Crown. ...\" In less than a month, the Second Continental Congress completed its most definitive task: the adoption of Thomas Jefferson's Declaration of Independence on July 4, 1776.\n\nA Legacy\n\nThe Continental Congress continued to function until 1781 when it was supplemented by another, nearly similar body, under the Articles of Confederation. During all these war years, the Continental Congress managed America's political, military, and diplomatic needs."}, {"url": "https://www.britannica.com/biography/John-Adams-president-of-United-States/Continental-Congress", "page_content": "In the summer of 1774, Adams was elected to the Massachusetts delegation that joined the representatives from 12 of 13 colonies in Philadelphia at the First Continental Congress. He and his cousin, Samuel Adams, quickly became the leaders of the radical faction, which rejected the prospects for reconciliation with Britain. His “Novanglus” essays, published early in 1775, moved the constitutional argument forward another notch, insisting that Parliament lacked the authority not just to tax the colonies but also to legislate for them in any way. (Less than a year earlier, Thomas Jefferson had made a similar argument against parliamentary authority in A Summary View of the Rights of British America.)\n\nBy the time the Second Continental Congress convened in 1775, Adams had gained the reputation as “the Atlas of independence.” Over the course of the following year, he made several major contributions to the patriot cause destined to ensure his place in American history. First, he nominated George Washington to serve as commander of the fledging Continental Army. Second, he selected Jefferson to draft the Declaration of Independence. (Both decisions were designed to ensure Virginia’s support for the revolution.) Third, he dominated the debate in the Congress on July 2–4, 1776, defending Jefferson’s draft of the declaration and demanding unanimous support for a decisive break with Great Britain. Moreover, he had written Thoughts on Government, which circulated throughout the colonies as the major guidebook for the drafting of new state constitutions. In it, among other concerns, he contemplated the sort of representative assembly that would be most conducive to good government:\n\nIt should be in miniature an exact portrait of the people at large. It should think, feel, reason, and act like them. That it may be the interest of this assembly to do strict justice at all times, it should be an equal representation, or, in other words, equal interests among the people should have equal interests in it. Great care should be taken to effect this, and to prevent unfair, partial, and corrupt elections.\n\nAdams remained the central figure of the Continental Congress for the following two years. He drafted the Plan of Treaties in July 1776, a document that provided the framework for a treaty with France and that almost inadvertently identified the strategic priorities that would shape American foreign policy over the next century. He was the unanimous choice to head the Board of War and Ordnance and was thereby made in effect a one-man war department responsible for raising and equipping the American army and creating from scratch an American navy. As the prospects for a crucial wartime alliance with France improved late in 1777, he was chosen to join Benjamin Franklin in Paris to conduct the negotiations. In February 1778 he sailed for Europe, accompanied by 10-year-old John Quincy."}, {"url": "https://www.history.com/topics/american-revolution/benjamin-franklin", "page_content": "One of the leading figures of early American history, Benjamin Franklin (1706-1790) was a statesman, author, publisher, scientist, inventor and diplomat. Born into a Boston family of modest means, Franklin had little formal education. He went on to start a successful printing business in Philadelphia and grew wealthy. Franklin was deeply active in public affairs in his adopted city, where he helped launch a lending library, hospital and college and garnered acclaim for his experiments with electricity, among other projects. During the American Revolution , he served in the Second Continental Congress and helped draft the Declaration of Independence in 1776. He also negotiated the 1783 Treaty of Paris that ended the Revolutionary War (1775-83). In 1787, in his final significant act of public service, he was a delegate to the convention that produced the U.S. Constitution .\n\nBenjamin Franklin’s Early Years\n\nBenjamin Franklin was born on January 17, 1706, in colonial Boston. His father, Josiah Franklin (1657-1745), a native of England, was a candle and soap maker who married twice and had 17 children. Franklin’s mother was Abiah Folger (1667-1752) of Nantucket, Massachusetts, Josiah’s second wife. Franklin was the eighth of Abiah and Josiah’s 10 offspring.\n\nDid you know? Benjamin Franklin is the only Founding Father to have signed all four of the key documents establishing the U.S.: the Declaration of Independence (1776), the Treaty of Alliance with France (1778), the Treaty of Paris establishing peace with Great Britain (1783) and the U.S. Constitution (1787).\n\nFranklin’s formal education was limited and ended when he was 10; however, he was an avid reader and taught himself to become a skilled writer. In 1718, at age 12, he was apprenticed to his older brother James, a Boston printer. By age 16, Franklin was contributing essays (under the pseudonym Silence Dogood) to a newspaper published by his brother. At age 17, Franklin ran away from his apprenticeship to Philadelphia, where he found work as a printer. In late 1724, he traveled to London, England, and again found employment in the printing business.\n\nBenjamin Franklin: Printer and Publisher\n\nBenjamin Franklin returned to Philadelphia in 1726, and two years later opened a printing shop. The business became highly successful producing a range of materials, including government pamphlets, books and currency. In 1729, Franklin became the owner and publisher of a colonial newspaper, the Pennsylvania Gazette, which proved popular—and to which he contributed much of the content, often using pseudonyms. Franklin achieved fame and further financial success with “Poor Richard’s Almanack,” which he published every year from 1733 to 1758. The almanac became known for its witty sayings, which often had to do with the importance of diligence and frugality, such as “Early to bed and early to rise, makes a man healthy, wealthy and wise.”\n\nIn 1730, Franklin began living with Deborah Read (c. 1705-74), the daughter of his former Philadelphia landlady, as his common-law wife. Read’s first husband had abandoned her; however, due to bigamy laws, she and Franklin could not have an official wedding ceremony. Franklin and Read had a son, Francis Folger Franklin (1732-36), who died of smallpox at age 4, and a daughter, Sarah Franklin Bache (1743-1808). Franklin had another son, William Franklin (c. 1730-1813), who was born out of wedlock. William Franklin served as the last colonial governor of New Jersey, from 1763 to 1776, and remained loyal to the British during the American Revolution. He died in exile in England.\n\nBenjamin Franklin and Philadelphia\n\nAs Franklin’s printing business prospered, he became increasingly involved in civic affairs. Starting in the 1730s, he helped establish a number of community organizations in Philadelphia, including a lending library (it was founded in 1731, a time when books weren’t widely available in the colonies, and remained the largest U.S. public library until the 1850s), the city’s first fire company, a police patrol and the American Philosophical Society, a group devoted to the sciences and other scholarly pursuits.\n\nFranklin also organized the Pennsylvania militia, raised funds to build a city hospital and spearheaded a program to pave and light city streets. Additionally, Franklin was instrumental in the creation of the Academy of Philadelphia, a college which opened in 1751 and became known as the University of Pennsylvania in 1791.\n\nFranklin also was a key figure in the colonial postal system. In 1737, the British appointed him postmaster of Philadelphia, and he went on to become, in 1753, joint postmaster general for all the American colonies. In this role he instituted various measures to improve mail service; however, the British dismissed him from the job in 1774 because he was deemed too sympathetic to colonial interests. In July 1775, the Continental Congress appointed Franklin the first postmaster general of the United States, giving him authority over all post offices from Massachusetts to Georgia. He held this position until November 1776, when he was succeeded by his son-in-law. (The first U.S. postage stamps, issued on July 1, 1847, featured images of Benjamin Franklin and George Washington.)\n\nBenjamin Franklin's Inventions\n\nIn 1748, Franklin, then 42 years old, had expanded his printing business throughout the colonies and become successful enough to stop working. Retirement allowed him to concentrate on public service and also pursue more fully his longtime interest in science. In the 1740s, he conducted experiments that contributed to the understanding of electricity, and invented the lightning rod, which protected buildings from fires caused by lightning. In 1752, he conducted his famous kite experiment and demonstrated that lightning is electricity. Franklin also coined a number of electricity-related terms, including battery, charge and conductor.\n\nIn addition to electricity, Franklin studied a number of other topics, including ocean currents, meteorology, causes of the common cold and refrigeration. He developed the Franklin stove, which provided more heat while using less fuel than other stoves, and bifocal eyeglasses, which allow for distance and reading use. In the early 1760s, Franklin invented a musical instrument called the glass armonica. Composers such as Ludwig Beethoven (1770-1827) and Wolfgang Mozart (1756-91) wrote music for Franklin’s armonica; however, by the early part of the 19th century, the once-popular instrument had largely fallen out of use.\n\nREAD MORE: 11 Surprising Facts About Benjamin Franklin\n\nBenjamin Franklin and the American Revolution\n\nIn 1754, at a meeting of colonial representatives in Albany, New York, Franklin proposed a plan for uniting the colonies under a national congress. Although his Albany Plan was rejected, it helped lay the groundwork for the Articles of Confederation, which became the first constitution of the United States when ratified in 1781.\n\nIn 1757, Franklin traveled to London as a representative of the Pennsylvania Assembly, to which he was elected in 1751. Over several years, he worked to settle a tax dispute and other issues involving descendants of William Penn (1644-1718), the owners of the colony of Pennsylvania. After a brief period back in the U.S., Franklin lived primarily in London until 1775. While he was abroad, the British government began, in the mid-1760s, to impose a series of regulatory measures to assert greater control over its American colonies. In 1766, Franklin testified in the British Parliament against the Stamp Act of 1765, which required that all legal documents, newspapers, books, playing cards and other printed materials in the American colonies carry a tax stamp. Although the Stamp Act was repealed in 1766, additional regulatory measures followed, leading to ever-increasing anti-British sentiment and eventual armed uprising in the American colonies.\n\nFranklin returned to Philadelphia in May 1775, shortly after the Revolutionary War (1775-83) had begun, and was selected to serve as a delegate to the Second Continental Congress, America’s governing body at the time. In 1776, he was part of the five-member committee that helped draft the Declaration of Independence, in which the 13 American colonies declared their freedom from British rule. That same year, Congress sent Franklin to France to enlist that nation’s help with the Revolutionary War. In February 1778, the French signed a military alliance with America and went on to provide soldiers, supplies and money that proved critical to America’s victory in the war.\n\nAs minister to France starting in 1778, Franklin helped negotiate and draft the 1783 Treaty of Paris that ended the Revolutionary War.\n\nBenjamin Franklin’s Later Years\n\nIn 1785, Franklin left France and returned once again to Philadelphia. In 1787, he was a Pennsylvania delegate to the Constitutional Convention. (The 81-year-old Franklin was the convention’s oldest delegate.) At the end of the convention, in September 1787, he urged his fellow delegates to support the heavily debated new document. The U.S. Constitution was ratified by the required nine states in June 1788, and George Washington (1732-99) was inaugurated as America’s first president in April 1789.\n\nFranklin died a year later, at age 84, on April 17, 1790, in Philadelphia. Following a funeral that was attended by an estimated 20,000 people, he was buried in Philadelphia’s Christ Church cemetery. In his will, he left money to Boston and Philadelphia, which was later used to establish a trade school and a science museum and fund scholarships and other community projects.\n\nMore than 200 years after his death, Franklin remains one of the most celebrated figures in U.S. history. His image appears on the $100 bill, and towns, schools and businesses across America are named for him."}, {"url": "https://encyclopediavirginia.org/entries/bland-richard-1710-1776/", "page_content": "Bland managed his inherited plantations, joined many of his friends and family members in speculating in land, studied law and qualified to practice before the colony’s General Court, and exhibited a litigious streak. At his death his estate included thirty slaves. An erudite and highly intelligent man and a dedicated student of history and law, Bland assembled a large, excellent library as well as many valuable original documents for a history of the colony that he never wrote. Thomas Jefferson, who acquired some of the most useful books and records after Bland’s death, later described him as “the most learned and logical” of all the leading men of that generation. Bland’s eyes were failing him by October 1774, when his acquaintance Roger Atkinson described him as having “something of the look of musty old Parch[men]ts w’ch he handleth & studieth much.”\n\nPolitical Career\n\nBland served on the Prince George County Court and sat on the local parish vestry, where he sometimes officiated as a lay reader. Like his father before him he sat on the board of visitors of the College of William and Mary. Elected to the House of Burgesses from Prince George County in the spring of 1742, Bland remained in the Virginia legislature without a break until his death more than thirty-four years later. He quickly became a leading burgess with high positions on the most important committees and frequently chaired one or more standing committees or the committee of the whole. His able pen and extensive knowledge of law and history almost always got him onto critical drafting committees for important bills and resolutions concerning Virginia and its place in the British empire. Bland ranked with speaker John Robinson and Peyton Randolph as one of the most influential and productive burgesses during the last quarter century of the colonial period. Following Robinson’s death, Bland lost a bid for becoming speaker to Randolph.\n\nDuring the 1750s and 1760s Bland took a leading role in defending the colony’s use of paper money to finance its part in Great Britain’s war against France. Late in November 1764 he helped to frame the colony’s first protests against the Stamp Act, but it is unclear whether, as was later reported, he opposed or was even present when Patrick Henry introduced a second, more inflammatory set of resolutions the following year. Later in the 1760s Bland was a key draftsman of the assembly’s stern objections to the Townshend Acts. In addition he opposed creation of an American bishopric to govern the colonial Church of England and maintained that local vestries, rather than the General Court or the bishop of London through the colonial commissary, had full authority over the parishes and the right to select and provide for the support of their ministers. At every turn Bland argued for colonial control of colonial affairs and against any extension of British control over Virginia’s internal political and economic life. Between 1753 and 1774 his newspaper articles, public letters, and pamphlets made him one of the best-known Virginians of his day. Bland’s cultivated mind and spirited pen helped lay the groundwork for revolution, although revolution was never his goal nor independence his purpose. Rather, as each new political crisis strained the relationships between the General Assembly and the royal governor, between colony and Parliament, and between colony and Crown, he gradually developed and asserted Virginia’s constitutional and legal claim—and ultimately its moral claim under natural law—to a large measure of self-government.\n\nBland first emerged as a defender of Virginia’s rights during the pistole fee controversy. He helped draft the burgesses’ resolutions of November 1753 charging that Lieutenant Governor Robert Dinwiddie‘s imposition without legislative approval of a fee of one pistole for signing and affixing the colonial seal to land patents was “of dangerous Consequence to the Liberties of his Majesty’s faithful Subjects, and to the Constitution of this Government.” In response to Dinwiddie’s assertion that he had a right to impose the fee as a part of the royal prerogative, Bland likened the controversy to the struggles of Parliament with Charles I in the 1630s and asserted that just as levying a tax in England was illegal without parliamentary action, so too no fee could legally be imposed in Virginia without approval by the people’s representatives in the General Assembly. He almost went so far as to maintain that even the royal prerogative could not operate contrary to the laws and legal customs of the colony. Bland spelled out his reasoning in a short essay entitled “A Modest and True State of the Case,” now better known as A Fragment on the Pistole Fee, the title under which it was first published in 1891.\n\nBland acquired a much wider fame during the protracted debates following the adoption in 1758 of the second of the so-called Two Penny Acts, both of which he had helped to write. Passed in the wake of tobacco crop failures, the laws, which applied to all transactions and contractual obligations payable in tobacco, permitted parish vestries to substitute for one year a cash payment of approximately two pence per pound of tobacco in lieu of 16,000 pounds of tobacco and cask, which was the legal annual salary of ministers. The laws raised important and complex issues, including whether the General Assembly could amend or repeal the statute establishing ministers’ salaries without first obtaining royal consent, whether the assembly’s acts diminished ministerial salaries unfairly, and whether these questions could be properly adjudicated in the colony’s courts. Bland fired early salvos in a pamphlet war on these subjects. In A Letter to the Clergy of Virginia, in Which The Conduct of the General-Assembly is vindicated, Against The Reflexions contained in a Letter to the Lords of Trade and Plantations, from the Lord-Bishop of London, published in Williamsburg in 1760, Bland attacked the leaders of the Virginia clergy and the bishop of London while adducing legal precedents and constitutional and practical justifications for the assembly’s actions. He stated that in emergencies the General Assembly of Virginia had the right to do whatever was necessary for the good of the colony, royal instructions to colonial governors notwithstanding. Four years later, after Landon Carter and commissary John Camm had entered the bitter and highly personal debates, Bland published an extended satiric dialogue, Colonel Dismounted: or the Rector Vindicated, in a Letter addressed to His Reverence: Containing A Dissertation upon the Constitution of the Colony, which blasted Camm by name and asserted more boldly than anyone had before that for all strictly provincial purposes the General Assembly of Virginia was the only representative body that could tax or legislate for the colony. In developing his argument Bland distinguished between acts of Parliament made to regulate imperial affairs and those of a purely local nature, a distinction used later in 1764 and in 1765 to help justify the actions of the House of Burgesses and most other colonial assemblies in North America that were busy contesting the power of Parliament to lay a stamp tax on the colonists.\n\nAfter the Stamp Act crisis, Bland undertook to refute the theory of virtual representation used by defenders of that law against the colonial objection to taxation without representation. In An Inquiry into the Rights of the British Colonies (1766), he took his previous arguments several steps further by denying that Parliament had the authority to lay a tax on a colony or pass legislation respecting its internal affairs. Bland’s pamphlet directly challenged Parliament’s dominance in the British empire. It emphasized instead the importance of representative assemblies in the governance of the colonies and brought to the forefront the power of natural rights as a counterbalance to parliamentary or even royal power and authority."}, {"url": "https://www.history.com/topics/american-revolution/john-hancock", "page_content": "American Revolution leader John Hancock (1737-1793) was a signer of the Declaration of Independence in 1776 and a governor of Massachusetts. The colonial Massachusetts native was raised by his uncle, a wealthy Boston merchant. When his uncle died, Hancock inherited his lucrative shipping business. In the mid-1760s, as the British government began imposing regulatory measures to assert greater authority over its American colonies, anti-British sentiment and unrest grew among the colonists. Hancock used his wealth and influence to aid the movement for American independence. He was president of the Second Continental Congress from 1775 to 1777, when the Declaration of Independence was adopted and the United States was born. From 1780 to 1785, Hancock was the first governor of the Commonwealth of Massachusetts. He was reelected in 1787 and served until his death in 1793.\n\nJohn Hancock’s Early Years and Family\n\nJohn Hancock was born on January 23 (or January 12, according to the calendar in use at the time), 1737, in Braintree (present-day Quincy), Massachusetts. After his clergyman father died when Hancock was a boy, he was raised by his aunt and uncle, Thomas Hancock (1703-1764), a wealthy merchant, in their elegant Boston mansion.\n\nDid you know? Boston's 60-story John Hancock Tower (also called Hancock Place) is the city's tallest building. It was named for the John Hancock insurance company, which was named for the Massachusetts statesman. In Chicago, the 100-story John Hancock Center was the sixth-tallest building in the United States as of 2010.\n\nAfter graduating from Harvard College in 1754, Hancock went to work for his uncle. When Thomas Hancock, who was childless, died in 1764, his nephew inherited his lucrative import-export business and became one of the richest men in New England. Hancock would later earn a reputation for being generous and using his personal wealth for public projects; however, he also received criticism from some people, including fellow Revolutionary leader Samuel Adams (1722-1803), for his conspicuously lavish lifestyle.\n\nIn 1775, Hancock married Dorothy Quincy (1747-1830), the daughter of a Boston merchant and magistrate. The couple had two children, a boy and a girl, neither of whom survived to adulthood.\n\nThe Road to Revolution\n\nIn 1765, John Hancock entered local politics when he was elected a Boston selectman. The following year, he won election to the Massachusetts colonial legislature. Around this same time, the British Parliament began imposing a series of regulatory measures, including tax laws, to gain further control over its 13 American colonies. The colonists opposed these measures, particularly the tax laws, arguing that only their own representative assemblies impose tax them. Over the next decade, anti-British sentiment among the colonists intensified and eventually led to the outbreak of the American Revolutionary War (1775-1783).\n\nHancock came into direct conflict with the British in 1768, when one of his merchant ships, the Liberty, was seized in Boston Harbor by British customs officials who claimed Hancock had illegally unloaded cargo without paying the required taxes. Hancock was a popular figure in Boston, and the seizure of his ship led to angry protests by local residents. In the ensuing months and years, Hancock became increasingly involved in the movement for American independence. Massachusetts was at the center of this movement, and Boston, in particular, was dubbed the “Cradle of Liberty.”\n\nA Wanted Man\n\nIn 1774, John Hancock was elected president of the Massachusetts Provincial Congress, which declared itself an autonomous government. In December of the same year, he was chosen as a Massachusetts delegate to the Second Continental Congress, which served as the governing body of the United States during the American Revolution.\n\nHancock’s revolutionary activities made him a target for British authorities. In 1775, he and fellow patriot Samuel Adams avoided arrest in Lexington, Massachusetts, after Paul Revere (1735-1818) made his legendary nighttime ride to warn them the British were coming.\n\nJohn Hancock’s Famous Signature\n\nIn May 1775, John Hancock was elected president of the Continental Congress, which was meeting in Philadelphia. The next month, the Congress chose George Washington (1732-1799) as commander of the Continental Army. (According to some accounts, Hancock had eyed the role for himself.) During the eight years of war that followed, Hancock used his wealth and influence to help fund the army and revolutionary cause.\n\nOn July 4, 1776, Congress adopted the Declaration of Independence, a document drafted by Thomas Jefferson (1743-1826) stating that the 13 American colonies were free from British rule. The document also detailed the importance of individual rights and freedoms. As president of the Continental Congress, Hancock is credited as the first signer of the Declaration of Independence. His prominent, stylish signature became famous. (According to legend, Hancock boldly inscribed his name so the English king would not need glasses to read it.) Today, the term “John Hancock” is synonymous with “signature.”\n\nJohn Hancock’s Governorship and Later Years\n\nAfter resigning as head of the Continental Congress in 1777, Hancock had his chance for military glory in 1778, when he led some 5,000 Massachusetts soldiers in an attempt to recapture Newport, Rhode Island, from the British. Although the mission was a failure, Hancock remained a popular figure. He went on to help frame the Massachusetts Constitution, adopted in 1780, and was elected governor of Massachusetts by a wide margin that same year.\n\nDuring his tenure as governor, Massachusetts was plagued by sharp inflation, and a number of farmers defaulted on loans and ended up in prison. In the face of the mounting political crisis, Hancock, who was suffering from gout, resigned the governorship in 1785. The following year, an armed uprising by Massachusetts farmers that later became known as Shay’s Rebellion broke out. The rebellion ended in early 1787, and Hancock was reelected governor that same year. He did not attend the 1787 Constitutional Convention in Philadelphia; however, he presided over his home state’s 1788 convention to ratify the U.S. Constitution and gave a speech in favor of ratification.\n\nIn 1789, Hancock was a candidate in the first U.S. presidential election, but received only four electoral votes out of a total 138 cast. George Washington garnered 69 votes, while John Adams (1735-1826) captured 36 votes, earning the two men the presidency and vice presidency, respectively.\n\nHancock remained governor of Massachusetts until his death at age 56 on October 8, 1793. Following an extravagant funeral, he was buried at Boston’s Granary Burying Ground."}, {"url": "https://www.let.rug.nl/usa/biographies/john-blair/", "page_content": "A Biography of John Blair 1732-1800\n\nScion of a prominent Virginia family, Blair was born at Williamsburg in 1732. He was the son of John Blair, a colonial official and nephew of James Blair, founder and first president of the College of William and Mary. Signer Blair graduated from that institution and studied law at London's Middle Temple. Thereafter, he practiced at Williamsburg. In the years 1766-70 he sat in the Virginia House of Burgesses as the representative of William and Mary. From 1770 to 1775 he held the position of clerk of the colony's council.\n\nAn active patriot, Blair signed the Virginia Association of June 22, 1770, which pledged to abandon importation of British goods until the Townshend Duties were repealed. He also underwrote the Association of May 27, 1774, calling for a meeting of the colonies in a Continental Congress and supporting the Bostonians. He took part in the Virginia constitutional convention (1776), at which he sat on the committee that framed a declaration of rights as well as the plan for a new government. He next served on the Privy Council (1776-78). In the latter year, the legislature elected him as a judge of the General Court, and he soon took over the chief justiceship. In 1780 he won election to Virginia's high chancery court, where his colleague was George Wythe.\n\nBlair attended the Constitutional Convention religiously but never spoke or served on a committee. He usually sided with the position of the Virginia delegation. And, in the commonwealth ratifying convention, Blair helped win backing for the new framework of government.\n\nIn 1789 Washington named Blair as an associate justice of the U.S. Supreme Court, where he helped decide many important cases. Resigning that post in 1796, he spent his remaining years in Williamsburg. A widower, his wife (born Jean Balfour) having died in 1792, he lived quietly until he succumbed in 1800. He was 68 years old. His tomb is in the graveyard of Bruton Parish Church."}]}