{"Stuart Scott was a contributor to ESPN's Sunday NFL Countdown, NBA Countdown and Baseball Tonight.": [{"url": "https://www.theatlantic.com/entertainment/archive/2015/01/stuart-scott-brought-sports-broadcasting-back-to-earth/384193/", "page_content": "For the sports-obsessed American in the mid-1990s, ESPN's SportsCenter was just about the only way you could catch the day's scores, news, and gossip without having to wait for the next day's paper. The show's format was simple. Two anchors—usually thirty-ish white men wearing conservative suits—would report the day's events in a wry, detached style familiar from decades of broadcast news.\n\nThis doesn't mean that the anchors were all alike. You had Chris Berman's goofy nicknames and Howard Cosell-isms; Dan Patrick's arch, sardonic musings; and Keith Olbermann's caffeinated, high-brow style. Each seemed to approach sports coverage as if they were letting the viewer in on an inside joke. \"This is just sports, after all,\" they seemed to say.\n\n\"I'll write that because I'm going to write like I talk.\"\n\nThen came Stuart Scott.\n\nFirst there was the inescapable fact of his race. When Scott, who died from cancer Sunday at the age of 49, debuted on ESPN2 in 1993, he became one of the network's few African American personalities who hadn't made his name as a professional athlete. But something else was different about Scott. When narrating highlights, his voice rose. He got excited. He reacted to a slam dunk or touchdown pass with an emphatic \"boo-ya!\" He used words and phrases and contractions that you didn't hear on television. Scott's style wasn't just \"hip-hop,\" as ESPN CEO John Skipper called it in a tribute to Scott released Sunday. It was talking about sports in the same way that fans, watching the game in their living room, do.\n\nUnsurprisingly, Scott's style sparked controversy. ESPN viewers complained that they couldn't understand a word he said; that he was too hip. In a 2003 USA Today piece that solicited reader comments about the broadcaster, fans seemed to love and revile him in equal measure. Many praised him for revitalizing an iconic show. But others were less enthusiastic. \"He tries too hard not to be funny,\" said one. \"Scott attempts to make the show about him. He is not the game,\" said another. Brett Walker of Tallahassee, Florida, got more to the point: \"Stuart Scott is very knowledgable about sports, but the way he presents them in hip-hop fashion is obnoxious.\"\n\nThrough it all, Scott stuck with his style. And ESPN stuck with him. Over the years, Scott emerged as one of the network's most familiar faces, graduating from SportsCenter duties into a wider range of roles. He covered the World Series, the NBA Finals, and the Super Bowl. He interviewed Tiger Woods and Michael Jordan. He played a videotaped basketball game with President Obama. Once a novelty at ESPN, Scott eventually became an institution.\n\nAnd as the Internet became a dominant source of sports coverage, Scott's style—blending sports and culture—became more common. On its website, ESPN launched Page 2 and then Page 3, sites that combined sports commentary with coverage of celebrities and entertainment. In 2001, the network took a chance on a hyper-opinionated Boston sports fan then blogging for AOL, hiring him to write the occasional guest column. 14 years later, that fan—Bill Simmons—is arguably ESPN's biggest star and most important personality.\n\nChanges were also felt beyond ESPN's garden walls. Bleacher Report, a website founded in 2007 that provided a platform for amateur writers to publish articles about their favorite teams, was acquired in 2012 by TBS for a sum rumored to be just under $200 million.\n\nThrough it all, Scott continued to go about his work on ESPN. But in November 2007, at age 42, he was diagnosed with cancer, beginning a fight that ultimately claimed his life. In July of last year, a gaunt-looking Scott accepted the \"Jimmy V Perseverance Award\" at the ESPY's, ESPN's long-running awards gala. Introduced by Kiefer Sutherland, Scott spoke movingly about his battle with cancer, insisting that the positive, energetic way he lived his life—rather than his illness—would be his legacy. A star-studded crowd of athletes, actors, and ESPN talent gave him a tearful standing ovation.\n\nBut Scott's real legacy may actually be how his style—once considered radical—is now so commonly imitated as to be virtually unnoticeable. This, Scott would say, was no accident. In a 2002 segment of NPR's On the Media, Scott revealed his approach to his anchoring duties. \"Writing is better if it's kept simple. Every sentence doesn't need to have perfect noun/verb agreement. I've said 'ain't' on the air. Because I sometimes use 'ain't' when I'm talking. Cincinnati Bengals thought that they were going to go 12 and 4 this year—man, they ain't going 12 and 4!\"\n\n\"I'll write that because I'm going to write like I talk.\"\n\nIt's a simple enough message. But without Stuart Scott, it's one that may never have surfaced."}, {"url": "https://www.espn.com/espn/story/_/id/12123191/stuart-scott-changed-language-sports", "page_content": "So here's what Stuart Scott's teammates could see that viewers couldn't. They couldn't see him suffer through a chemotherapy session at, say, 10 a.m., catch a quick nap and maybe a small bite, put himself through a kickboxing class or some other rigorous physical routine in an attempt to strengthen his body for its fight with cancer, show up at the studio to prepare for a Friday night NBA doubleheader that might require us to work until 1 a.m., and plow right through the evening without so much as a bad word for or to anybody.\n\nStuart Scott was a TV journalism pioneer just by being himself on camera. Rich Arden/ESPN Images\n\nThat scenario, or something like it, played out way too often during the last seven years of Stuart's 49. He'd close his eyes during the commercial breaks at times. There were trips to the bathroom that we knew included violent illness. There's not a person in the Bristol studios who didn't say at some point, \"Stuart, seriously, you shouldn't work tonight,\" and his response pretty damn frequently was: \"Bro, I'm good.\"\n\nAnd he was ... to the last drop.\n\nWe were from the same place, the South Side of Chicago, but approached what we did in radically different ways, which is why I didn't know exactly what to make of Stuart when I first saw him on-camera in the early 1990s. I was as intimately familiar with Pookie and Ray Ray as he was, but didn't think they belonged in a delivery of the day's sports news.\n\nI was brought up in a buttoned-up world of traditional journalism where the person reporting/commenting/analyzing didn't call attention to himself. Stuart, very deliberately and without much fear, was in the process of taking us to a new world of sports coverage, one where you let your emotion come pouring out much of the time, where personality would infuse the coverage. It wasn't just that a Scott-delivered story sounded \"blacker\" -- and it did, it sounded younger, and hipper, had greater edge and connected with an entire population of viewers who had been ignored. Not every reference to music needed to be the Beatles or Rolling Stones, not for those of us who preferred Earth, Wind & Fire or Chuck D. More than anybody working then or now, Stuart Scott changed the very language used to discuss sports every day. He updated it, freshened it, made it more inclusive. And he took hell for it.\n\nHow nerdy is it, looking back, to have felt that Stuart was some kind of pioneer for simply wanting to be himself on television? But he was exactly that, and because that evolution took the better part of 20 years, there is now an entire generation of young media folks, black and white, male and female, who don't feel the need to conform, and that is an enormous and admirable part of his professional legacy.\n\nWhen I think of ESPN, I'm in many ways stuck in the 1990s, the days before I actually started working there. While there are dozens of talented and dedicated people at the network, ESPN's Mount Rushmore, to me anyway, is Chris Berman/Dan Patrick/Bob Ley/Stuart Scott. They were the faces on the front line who took the network from fledgling to global entertainment giant.\n\nStuart Scott got into great shape in his fight against cancer -- and then counseled Michael Wilbon on getting healthier. Rich Arden/ESPN Images\n\nAnd what I loved is that Stuart, who was no shrinking violet, was fine with his role in all of it, being the transitional figure he was and taking the mood from buttoned-up to cool. He was also smart enough, particularly the last five years, to ignore the morons and bigots on Twitter, the noise and intolerance of it all.\n\nOne of the things Stuart shared with St. Louis Post-Dispatch columnist Bryan Burwell, besides death from cancer in the primes of their lives, was the ability to be so upbeat and good-natured in the face of withering criticism from people who didn't want their morning newspaper or evening news to move one inch from what it had been in whiter times.\n\nOur business, not that I'm particularly proud of this, is full of cynics, smart-asses, know-it-alls who don't actually know all that much. Everybody has become Simon Cowell, turning most every conversation into an intolerant rant. Not Stuart. He was up, upbeat, full of energy, always had something good to say. Always was good to the young production assistants in Bristol or on location. At 2 o'clock in the morning, most of us are irritable as hell and want to kill the producer for having us tape another \"SportsCenter\" segment; Stuart was perpetually ready to roll. \"Are we about to do LIVE TV?\" he'd bellow. Jon Barry and I would snarl. Magic and Stuart were always good to go.\n\nThough we were all acutely aware that the cancer had returned, I couldn't see Stuart dying young until recently, when the signs were too overwhelming. He was all over me about changing my eating habits after I suffered a heart attack in January 2008. Health concerns were at the center of texts and phone calls for longer than I want to admit. Just a few weeks after the heart attack, it was Stuart, on the Sunday before my son, Matthew, was born, who said to me: \"You have to believe what I'm about to tell you. You have to enjoy all the stuff you think you're going to hate about becoming a dad. Enjoy giving him a bath. Enjoy changing his stinky diapers. Enjoy getting peed on. Enjoy him drooling on your favorite tie just as you're about to walk out of the house to go on the air. Enjoy all of it. Be a hands-on dad. Enjoy it when he spills stuff all over you and when you get a pair of feet in your back when you haven't had any sleep.\"\n\nMichael Wilbon, seen here with son Matthew and Stuart Scott, says Scott gave him great advice about being a dad. Hyon Smith\n\nTo this day -- and I told Stuart this three or four years ago -- his advice on what to enjoy about early fatherhood is the most memorable counsel I received on the topic. I give that speech to expectant dads now and tell them I'm stealing every word of it from Stuart Scott, who was such a wonderful dad to Taelor and Sydni.\n\nWhen ballplayers say what they miss most when someone moves on is the hang, believe them. It's how people who wouldn't otherwise know each other gradually become like family. The NBA season, particularly the interminable playoffs, would be our time. You're down about bailing on your family for two months, but eager to engage with your professional family. For the past 10 years, for me, that's meant being on the road nonstop with Magic Johnson, Tim Legler, Avery Johnson, Jalen Rose, my man Jon Barry, Hannah Storm, Lisa Salters, Stephen A., Doris Burke, Mike Breen and Jeff Van Gundy, Dan Patrick and Mark Jackson, Mike Tirico, Chris Mullin, Hubie Brown and the late Dr. Jack Ramsay . . . and more recently, Sage Steele, Brian Windhorst, J.A. Adande, Heather Cox and Doug Collins (and that doesn't even count the producers and staffers, nor the many friends from TNT).\n\nAnd always Stuart Scott.\n\nCovering the playoffs without him and his spirit is unthinkable. Being a Chicago kid (he was born there, and his family moved to North Carolina when he was a young teenager), there's a reference Stuart would get, from the movie \"Cooley High\" . . . and already he's not here when I need him, because Stuart always recalled memorable movie lines with total precision, something I'm not any good at. Anyway, there's a scene toward the end of the movie where a crew of young 'uns mourning the death of murdered friend Cochise, played by Lawrence Hilton-Jacobs, are assembling under the \"L\" tracks. And I think Preach, played by Glynn Turman, suggests they should pour one for the brothas who aren't there.\n\nThe first thing we need to do, and it doesn't have to wait until the playoffs, is pour one for the brothas who are no longer with us, Bryan Burwell and Stuart Scott, without whom the discussion of sports or anything we wander into will, sadly, no longer have the flavor they helped give it."}, {"url": "https://www.thefamouspeople.com/profiles/stuart-scott-49535.php", "page_content": "While in college, he played wide receiver and defensive back on the club football team, joined Alpha Phi Alpha fraternity and became a part of the student radio station, WXYC.\n\nWhile in high school, he took interest in athletics and ran tracks along with playing football. For his college education, he went to the University of North Carolina and graduated in speech communication in 1987.\n\nHe completed his 9th and 10th grade from Mount Tabor High School and thereafter went to Richard J. Reynolds High School for the next two years. He graduated from there in 1983.\n\nAs Scott turned seven, the entire family moved to Winston-Salem in North Carolina.\n\nStuart Scott was born on 19th July 1965 in Chicago, Illinois and was the youngest child of O. Ray and Jacqueline Scott. His father was a postal inspector. He had two sisters, Susan and Synthia and a brother, Stephen.\n\nRecommended Lists:\n\nCareer\n\nAfter completing his graduation, Stuart Scott joined WPDE-TV in Florence as a news reporter and weekend sports anchor. It was during his tenure here between 1987 and 1988 that he came up with his popular catchphrase ‘as cool as the other side of the pillow’.\n\nHe next worked for WRAL-TV 5 in Raleigh as a news reporter between 1988 and 1990. He followed this up by working as a sports reporter and sports anchor for WESH, the NBC affiliated television channel serving in Orlando.\n\nAl Jaffe, ESPN's vice president for talent, was searching for a sportscaster who could effectively engage the younger audience. He found in Scott exactly what he was looking for and hired him in 1993 to work at ESPN.\n\nHis first show was ESPN2's ‘SportsNight’ program in which he did a short sportscast ‘SportsSmash’ twice an hour. He also became the host for ‘Edge NFL Matchup’, a show that aired once a week and showcased some of the select football games of last seven days.\n\nWhen Keith Olbermann shifted from ‘SportsNight’ for ESPN's ‘SportsCenter’, Scott replaced him as the anchor of the show.\n\nBesides hosting, he also became one of the top field reporters for ESPN’s sports programme.\n\nIn 1995, he covered for ESPN Major League Baseball’s (MLB) playoffs and the National Collegiate Athletic Association’s (NCAA) Final Four basketball tournament.\n\nIn 1997-1998, he covered the National Basketball Association’s (NBA) Finals and directly interviewed the well-known basketball player, Michael Jordan.\n\nHe was seen in the 1997 season of ‘NFL Primetime’ a Sunday night National Football League highlight show. Starting 1997, he also began covering the finals of NFL and continued to do so till 2014.\n\nContinue Reading Below\n\nHe served as a co-host of Sunday NFL Countdown from 1999–2001. During this time, he also became the anchor for ‘SportsCenter’ where he worked with other important fellow sportscaster and sports journalist like Steve Levy, Kenny Mayne, Dan Patrick and Rich Eisen.\n\nBeginning 1997 and up till 2013, he consistently appeared in ‘This is SportsCenter’ commercials too.\n\nWhen the Monday Night Football moved from ABC to ESPN, Scott presented its ‘Monday Night Countdown’ and post-game SportsCenter coverage.\n\nIn 2002, he was given the responsibilities of studio host for NBA on ESPN and in 2008, he assumed the same responsibilities for ABC’s NBA coverage, which included the NBA Finals.\n\nStuart Scott became popular for his usage of catch phrases, some of the most famous ones being ‘Boo-yah!’, ‘Hallah’, ‘He must be the bus driver cuz he was takin' him to school’, ‘Just call him butter 'cause he's on a roll’ and ‘It's your world, kid ... The rest of us are still paying rent’.\n\nScott regularly wrote the Holla Column for ‘ESPN the Magazine’. He anchored numerous games and reality show for ESPN like ‘Stump the Schwab’, ‘Teammates’, and ‘Dream Job’. He also presented David Blaine's ‘Drowned Alive’ special and another special – ‘AFV: The Sports Edition’ - for ‘America's Funniest Home Videos’.\n\nHe co-authored his memoir ‘Every Day I Fight’ along with Larry Platt. The book came out in March 2015.\n\nHe has worked in quite a few films and television series and also made an appearance in a music video by rappers LL Cool J and Luke.\n\nSome of his film credits include ‘He Got Game’ (1998), ‘The Kid’ (2000), ‘Drumline’ (2002), ‘Herbie: Fully Loaded’ (2005), ‘The Game Plan’ (2007) and ‘Just Wright’ (2010).\n\nContinue Reading Below"}, {"url": "https://time.com/3652980/stuart-scott-impact/", "page_content": "Stuart Scott’s impact can be measured in Sunday’s outpouring of affection for him after news of his death, at 49 from cancer, broke. It cut across all sports, all silos of American culture, from LeBron James to Tiger Woods to Barack Obama to Nicki Minaj. It can be seen in Hannah Storm, the seasoned television professional who couldn’t hold back her tears while eulogizing her colleague on live TV Sunday morning, or Rich Eisen, Scott’s straight-man for many years on ESPN’s SportsCenter, who cut into the NFL Network’s pregame playoff coverage to offer a raw, touching tribute.\n\nScott’s legacy can be seen, and will be felt, in his last ESPN appearance, the speech he delivered at the ESPY awards in July, upon accepting the Jimmy V Perseverance Award. “It was a miracle that he was even there,” says ESPN senior vice president Mark Gross, one of Scott’s first producers at the network. “He was in tough shape.” Scott’s colleague and friend, ESPN anchor Sage Steele, was afraid that Scott, weak from his cancer battle, might fall down the stairs as he walked onto the stage. But he didn’t, and Scott nailed it. “When you die, that does not mean that you lose to cancer. You beat cancer by how you live, why you live, and the manner in which you live,” he said. “So live. Live. Fight like hell. And when you get too tired to fight, lay down and rest, and let somebody else fight for you.”\n\nSay what you want about ESPN’s stranglehold on sports media. Sure, the debate shows can stink, some SportsCenter schtick gets tiring. But between Scott’s virtuoso performance in July, and Jim Valvano’s “Never Give Up” speech back in 1993, the network’s personalities have offered two of the most most memorable rallying cries against that awful disease. Nothing but goosebumps.\n\nNeed more evidence of Scott’s singular impact? Just think about how hard it is to remember that he once had many haters. Scott got hate mail, because he infused his broadcast with hip-hop references. “Some of the viewing audience wasn’t used to it, wasn’t with it,” says Gross. “But Stuart never backed off.” Over the past decade, every time Scott showed up to anchor an NBA Finals, or a Monday Night Football game, it was a reminder to those who watched his early days at ESPN, in the mid-1990s, that Scott’s style more than prevailed. It became the standard.\n\nWhen Scott came along, sure, there had been African-American broadcasters at ESPN. And there had been SportsCenter catchphrases. But no one was saying “yo” and “brotha” on the air. No one was screaming “Booyah!” No one said “Swoopes there it is,” paying clear homage to hip-hop songs and culture, when WNBA player Sheryl Swoopes made nice play.\n\nAt a time when hip-hop was ascendent, in both the inner-cities and amongst the white kids at the suburban shopping malls, no one on SportsCenter was talking directly to them, until Stuart Scott. No one had that swagger. No one, to borrow Scott’s best metaphor, was “as cool as the other side of the pillow.”\n\nAnd sure, many folks wanted those kids to turn their music down. But in the end, Jay Z became royalty. Obama got elected. And Stuart Scott made it to Monday Night Football, the NBA Finals, and Saturday Night Live.\n\n“Yes, he brought hip-hop into the conversation,” SportsCenter anchor Jay Harris said in Scott’s ESPN.com obituary. “But I would go further than that. He brought in the barber shop, the church, R&B, soul music. Soul, period.”\n\nLord knows that sports, too often ruthless and crass, can use it. RIP Stuart. We’ll dearly miss your spirit. Your soul.\n\nWrite to Sean Gregory at sean.gregory@time.com."}, {"url": "https://www.espn.com/nba/story/_/id/12118675/nba-nba-world-remembers-espn-stuart-scott", "page_content": "Stuart Scott, a longtime anchor at ESPN, died at the age of 49. He inspired his colleagues with his talent, his work ethic, his personality and his devotion to his daughters. (14:52)\n\nFollowing the sad news of the passing of Stuart Scott, the NBA world took to Twitter to pay tribute to the longtime ESPN anchor, who lost his battle with cancer Sunday morning at the age of 49.\n\nCooler than the other side of the pillow! https://t.co/9EgMeTlC2V - NBA (@NBA) January 4, 2015\n\nAlways loved the feeling turning on SportsCenter and seeing @StuartScott as the anchor. Always Inspired passion and paved a new way! #RIP — Stephen Curry (@StephenCurry30) January 4, 2015\n\n.@StuartScott reminded us all of the importance of life beyond ourselves. An example of how to appreciate every moment. #RIP — Carmelo Anthony (@carmeloanthony) January 4, 2015\n\nDamn. Stuart Scott, an original and a beauty. - Steve Nash (@SteveNash) January 4, 2015\n\nStuart Scott redefined his profession. My condolences to his family and friends. #coolastheothersideofthepillow #RIPStuartScott - Jason Collins (@jasoncollins98) January 4, 2015\n\nRest in peace Stuart Scott , you will be terribly missed. Thank you for everything, love u brother pic.twitter.com/nbqrsm8ejr — SHAQ (@SHAQ) January 4, 2015\n\nRIP Stuart Scott you inspired many and changed the way people looked at sports... Forever as cool as the other side of the pillow - Blake Griffin (@blakegriffin32) January 4, 2015\n\nToday is a sad day as we mourn the loss of my dear friend, Stuart Scott. He will be greatly missed by all. — Earvin Magic Johnson (@MagicJohnson) January 4, 2015\n\nThe memories we make with someone is all we will have one day.. Dwyane Wade and Mark Jackson Discover Stuart Scot...: http://t.co/ENggkQ84Nw - DWade (@DwyaneWade) January 4, 2015\n\nCan't believe you're gone from us! I am deeply saddened because not only will not be replaced as a... http://t.co/2MMLgFR6lf - LeBron James (@KingJames) January 4, 2015\n\nRIP Stuart, I hope we can remember your example brother. #fightertilltheend - Bruce Bowen (@Bowen12) January 4, 2015\n\nGoing to miss my favorite SportsCenter anchor. @StuartScott may you rest in peace my friend. — Dennis Rodman (@dennisrodman) January 4, 2015\n\nThanks to Stuart Scott for the professional standard he set. And most of all for the friendship http://t.co/qMR4HcSOfc - J.A. Adande (@jadande) January 4, 2015\n\nThe great Stuart Scott will be missed. He was a legend who revolutionized sports broadcasting. But even more, he was a great man and father. - Chris Broussard (@Chris_Broussard) January 4, 2015\n\nRIP Stuart Scott. Was an honor to meet you and watch you on @SportsCenter growing up. You will be missed. - Chandler Parsons (@ChandlerParsons) January 4, 2015\n\nStill so hard to believe, one the greatest people I've ever met is gone....a guy I've looked up to... http://t.co/LUKjDtirGC - Danny Green (@DGreen_14) January 4, 2015\n\nStuart Scott was a man of incredible strength, courage & talent. He has have forever changed the world of sports broadcasting. Prayers up �� - grant hill (@realgranthill33) January 4, 2015\n\nRIP Stuart Scott. You will be missed by all who have been lucky enough to cross paths with you. pic.twitter.com/5Q9P8brhii - Ty Lawson (@TyLawson3) January 4, 2015\n\nStuart Scott had SportsCenter so live!! His punch lines were one of a kind #RIP - Isaiah Thomas (@Isaiah_Thomas) January 4, 2015\n\nRIP to Staurt Scott.. Sad to see him go. Truly an inspiration on how to not let anything hold you back! - Shane Larkin (@ShaneLarkin_3) January 4, 2015"}, {"url": "https://www.businessinsider.com/espn-anchor-stuart-scott-has-died-2015-1", "page_content": "Scott at the ESPYs. Getty Images\n\nESPN anchor Stuart Scott has died at the age of 49.\n\nHe had battled cancer since 2007.\n\nScott worked for ESPN for 21 years, becoming one of the network's most recognizable anchors on SportsCenter and other studio shows.\n\n\"ESPN and everyone in the sports world have lost a true friend and a uniquely inspirational figure in Stuart Scott,\" ESPN president John Skipper said in a statement.\n\nScott talked about his fight with cancer in a moving speech at the 2014 ESPYs.\n\n\"When you die, that does not mean that you lose to cancer. You beat cancer by how you live, why you live, and the manner in which you live,\" he said in the speech. \"So live. Live. Fight like hell. And when you get too tired to fight, lay down and rest, and let somebody else fight for you.\"\n\nESPN released the following statement:\n\nStuart Scott, a dedicated family man and one of ESPN’s signature SportsCenter anchors, has died after a courageous and inspiring battle with cancer. He was 49.\n\nScott is survived by his two daughters, Taelor, 19, and Sydni, 15; his parents, O. Ray and Jacqueline Scott; and his three siblings Stephen Scott, Synthia Kearney, Susan Scott and their families. His girlfriend, Kristin Spodobalski, was with Stuart and cared for him every step of the way and along with support from his loving family, close friends and colleagues, he went through several surgeries, chemotherapy, radiation and clinical trials to stay strong and ward off cancer for as long as humanly possible.\n\n“ESPN and everyone in the sports world have lost a true friend and a uniquely inspirational figure in Stuart Scott,” said ESPN president John Skipper. “Who engages in mixed martial arts training in the midst of chemotherapy treatments? Who leaves a hospital procedure to return to the set? His energetic and unwavering devotion to his family and to his work while fighting the battle of his life left us in awe, and he leaves a void that can never be replaced.”\n\nOn July 16, 2014, Scott accepted the Jimmy V Perseverance Award at the ESPYs. During his speech, he expressed the following sentiment about his two daughters: “Taelor and Sydni, I love you guys more than I will ever be able to express. You two are my heartbeat. I am standing on this stage here tonight because of you.”\n\nDuring his ESPY speech, Scott shared his approach to fighting cancer. “I also realized something else recently,” he said. “I said, I’m not losing. I’m still here. I’m fighting. I’m not losing. But I’ve got to amend that. When you die, that does not mean that you lose to cancer. You beat cancer by how you live, why you live, and the manner in which you live. So live. Live. Fight like hell.”\n\nFor 21 years, years Scott was one of ESPN’s and ABC Sports’ most recognizable and quotable personalities and one of the most popular sportscasters around the world. His catchphrases, including his most famous “Boo-ya” and “As cool as the other side of the pillow,” have become an integral part of pop culture. While Scott became instantly known for his enthusiasm and colorful descriptions, he was always proud of the facts he would weave into his storytelling, recognizing that every great story is based in fact.\n\nAfter joining the network in 1993 for the launch of ESPN2, Scott became a leading voice on ESPN’s SportsCenter, where he anchored the 11pm show. Over the years, his talent and work ethic led to many additional high-profile assignments including major hosting roles on NFL and NBA programming. During his career with ESPN, Scott covered a slew of major events, including the NBA Finals, Super Bowl, Major League Baseball playoffs and World Series, the NCAA Final Four and more.\n\nFrom 2007-2011 Scott was the host of ABC Sports’ weekly NBA Sunday studio show, ESPN’s NBA studio show, and served as a host during the NBA Finals Trophy presentation each year. Scott also hosted numerous ESPN and ABC series and specials, including Dream Job, Stump The Schwab, ESPN’s 25th Anniversary Special, and The ESPY Red Carpet Show.\n\nIn addition to this busy TV schedule, Scott had also worked as a regular contributor to ESPN: The Magazine, ESPN Radio, and ESPN.com.\n\nScott was featured in countless This is SportsCenter commercials, which he so enjoyed.\n\nMost recently, Scott was in the anchor chair alongside his longtime partner, Steve Levy, when ESPN re-launched SportsCenter on a new set.\n\nScott not only interviewed most of the world’s top athletes, he interviewed top celebrities, newsmakers, and politicians. Stuart interviewed and played a televised game of one-on-one basketball with President Barack Obama, one of his two interviews with the President, and conducted numerous one-on-one interviews with the likes of Tiger Woods, Michael Jordan, Denzel Washington and President Clinton.\n\nHollywood and Madison Avenue also took notice of Scott’s wide appeal; he was featured in numerous high-profile commercial campaigns. He appeared on many TV shows, sitcoms, feature films and music videos and was parodied in a Saturday Night Live skit.\n\nOver the years, Scott earned numerous awards and honors. He was recently honored with the NABJ Award of Merit, received a Rammy Award which pays tribute to superlative performances in athletics, academics and sports from his beloved alma mater, UNC-Chapel Hill, and was a guest of honor at the 14th annual “An Evening with Heroes” celebration in Indianapolis, which benefits the Heroes Foundation. In 2011 he was honored by The V Foundation with “The Spirit of Jimmy V Award.” He was instrumental in raising hundreds of thousands of dollars for The V Foundation, Livestrong, and participated in Stand Up To Cancer campaigns as well donating time to raise awareness and funds for numerous other charities.\n\nHe always said a personal and professional highlight for him came in 2004, when he was requested by U.S. soldiers to be a part of “ESPN’s SportsCenter: Salute the Troops” effort, in which he and fellow anchors hosted a week of programs originating in Kuwait.\n\nPrior to joining ESPN, Scott worked at local stations in Orlando, Florida; Raleigh, North Carolina and Florence, South Carolina. He was graduated from the University of North Carolina in 1987. One of his proudest moments came when he served as the commencement speaker at his alma mater in 2001.\n\nAt North Carolina he played wide receiver and defensive back for a club football team.\n\nHe was diagnosed with cancer in November 2007, and dealt with recurring bouts of the disease. He met the challenge as he did everything in his life – with determination, a courageous fighting spirit and an always positive attitude that impacted and inspired everyone who knew him.\n\nHere's Scott accepting the Jimmy V Perseverance Award at the ESPYs in 2014:\n\nRich Eisen was Scott's coanchor on SportsCenter for many years. Now at the NFL Network, Eisen made a poignant statement regarding Scott on live TV after the news of his death:\n\nScott's style — energetic and playful with language borrowed from the hip-hop world — made him one of the most influential broadcasters of his era. To get a sense of what made him so great, here he is announcing the highlights of the 1998 Duke-North Carolina game:\n\nPresident Barack Obama, an avid ESPN viewer, released the following statement:\n\nI will miss Stuart Scott. Twenty years ago, Stu helped usher in a new way to talk about our favorite teams and the day's best plays. For much of those twenty years, public service and campaigns have kept me from my family — but wherever I went, I could flip on the TV and Stu and his colleagues on SportsCenter were there. Over the years, he entertained us, and in the end, he inspired us — with courage and love. Michelle and I offer our thoughts and prayers to his family, friends, and colleagues."}, {"url": "https://www.espn.com/espn/story/_/id/12118296/stuart-scott-espn-anchor-dies-age-49", "page_content": "Stuart Scott, a longtime anchor at ESPN, died at the age of 49. He inspired his colleagues with his talent, his work ethic, his personality and his devotion to his daughters. (14:52)\n\nStuart Scott, a longtime anchor at ESPN, died Sunday morning at the age of 49.\n\nAmong the features of the new ESPN studio in Bristol is a wall of catchphrases made famous by on-air talent over the years. An amazing nine of them belong to one man -- from his signature \"Boo-Yah!\" to \"As cool as the other side of the pillow\" to \"He must be the bus driver cuz he was takin' him to school.\"\n\nThat man is Stuart Scott, and his contributions to the sports lexicon are writ large. But they are only one aspect of his legacy. When he passed away, he left behind so much more. He inspired his colleagues with his sheer talent, his work ethic and his devotion to his daughters, Taelor, 19, and Sydni, 15. He defied convention and criticism to help bring this network into a new century. He spoke to the very athletes he was talking about with a flair and a style that ESPN president John Skipper says, \"changed everything.\"\n\n\"He didn't just push the envelope,\" says sports radio host and former ESPN anchor Dan Patrick. \"He bulldozed the envelope.\"\n\nScott was remembered through an outpouring of tributes by athletes, colleagues and fans on Twitter and statements from his alma mater, the University of North Carolina, which said that \"his legacy will live on in many ways -- as a friend, a son, a father, a professional and forever, a Tar Heel,\" and President Barack Obama.\n\n\"I will miss Stuart Scott. Twenty years ago, Stu helped usher in a new way to talk about our favorite teams and the day's best plays. For much of those twenty years, public service and campaigns have kept me from my family -- but wherever I went, I could flip on the TV and Stu and his colleagues on SportsCenter were there. Over the years, he entertained us, and in the end, he inspired us -- with courage and love. Michelle and I offer our thoughts and prayers to his family, friends, and colleagues,\" the president said.\n\nMoments of silence were held at sporting events around the United States on Sunday, including the NFL wild-card games between the Cincinnati Bengals vs. Indianapolis Colts and Detroit Lions vs. Dallas Cowboys; the Mavericks-Cavaliers NBA game in Cleveland and at several college basketball games.\n\nScott saved his best for his last year on the air. At the ESPYS on July 16, shortly before his 49th birthday and following another round of cancer surgery, Stuart accepted the Jimmy V Award for Perseverance with strength, humor, grace and these eloquent words: \"When you die, it does not mean that you lose to cancer. You beat cancer by how you live, why you live, and in the manner in which you live.\"\n\nStuart Scott made famous the catchphrases \"Boo-Yah!\" and \"As cool as the other side of the pillow.\" Rich Arden/ESPN Images\n\nSo while the grief is deep at ESPN over the death of Stuart Scott, so is our gratitude. He was as popular on campus as he was in the airports he passed through and on the sidelines he worked over the last 22 years. He brought so much to the party, and he will continue to do so, through the people he inspired, and the language that he liberated, and the audience that will remember him.\n\nSteve Levy, who came to ESPN shortly before Stuart in August 1993 and served as his co-host for the first \"SportsCenter\" from the new studio last June, put it this way: \"I think the audience recognized that when Stuart was on, there was going to be something special. And to his credit, he brought something special every night he was on.\"\n\n\"SportsCenter\" anchor Jay Harris, who grew up watching -- and hoping to be -- Stuart, says, \"Think about that phrase, 'As cool as the other side of the pillow.' It's a hot, stifling night. You're having trouble sleeping. But then you think to turn the pillow over, and, wow, it's cool, and it feels so good.\n\n\"Well, that's who Stuart is. He is 'the other side of pillow,' the man who made sportscasting cool. God bless whoever it was who thought to rearrange the bedding at ESPN.\"\n\nStuart was born in Chicago, but he, along with two sisters and a brother, spent his formative years in North Carolina, where their father was a postal inspector who always had time to play after work. Stuart went to R.J. Reynolds High in Winston-Salem and then the University of North Carolina, where he played wide receiver and defensive back on the club football team, joined Alpha Phi Alpha and worked at the student radio station, WXYC. After graduating in 1987 with a degree in speech communication, Stuart was hired by WPDE-TV in Florence, South Carolina. He says that's where he first came up with the pillow metaphor. \"People say I stole it from a movie,\" he told an interviewer in 1998, \"but I first thought of that and said it on my first job ... I just liked it.\"\n\nStuart Scott was diagnosed with cancer in November 2007 and dealt with recurring bouts of the disease. Courtesy ESPN\n\nHis career path took him from Florence to Raleigh, North Carolina, to Orlando, Florida, and in his pre-ESPN clips, you can feel his energy, hear his music and sense his on-camera charisma. At WESH, the NBC affiliate in Orlando, he first met ESPN producer Gus Ramsey, who was beginning his own career. Says Ramsey, \"You knew the second he walked in the door that it was a pit stop, and that he was gonna be this big star somewhere someday. He went out and did a piece on the rodeo, and he nailed it just like he would nail the NBA Finals for ESPN.\"\n\nHe first met ESPN anchor Chris Berman in Tampa, Florida. \"He stuck out his hand and said, 'One day I look forward to working with you,'\" Berman said. \"And I said, 'Well, I tell you what, we'll save you a seat.' And I'm really thrilled that he was right on. [Later] I said, 'Stu, maybe you were the Swami.'\"\n\nThe person most responsible for bringing Stuart to Bristol was Al Jaffe, ESPN's vice president for talent, who was looking for sportscasters who might appeal to a younger audience for ESPN2. \"One of the producers on a story we were doing on the Orlando Magic told me about this young guy he really liked. I followed up and found out that Stuart's contract was up soon. He sent me a tape, and even then, he had an amazing presence -- I felt the viewer would sit up and take notice when he was on the air.\"\n\nHis first real ESPN assignments were for \"SportsSmash,\" a short sportscast twice an hour on ESPN2's \"SportsNight\" program. When Keith Olbermann graduated from \"SportsNight\" to ESPN's \"SportsCenter,\" Stuart took his place in the anchor chair. \"He was like a ball of fire walking in the door,\" says ESPN senior vice president Mark Gross, a coordinating producer at the time. \"I had never met anybody like Stuart Scott.\""}, {"url": "https://espnpressroom.com/us/press-releases/2014/06/stuart-scott-to-be-honored-with-the-jimmy-v-perseverance-award-at-the-2014-espys/", "page_content": "It may be his unique style and flashy vocabulary that make Stuart Scott one of sports’ most recognizable broadcasters, but it is his unbreakable spirit that will be celebrated on July 16 at The 2014 ESPYS presented by Capital One. Scott will be honored with the Jimmy V Perseverance Award for the passion and determination he has displayed in the face of ongoing personal challenges.\n\nScott’s broadcasting career started early as on-air talent at the student-run radio station at the University of North Carolina. After graduating, he went right into reporting for various local TV stations in both South Carolina and North Carolina. Scott joined ESPN in 1993 for the launch of ESPN2 and his role at the company has consistently grown over the years as he developed into one of the iconic voices of SportsCenter. Scott has also served as a lead host for various NFL, MLB and NBA programs including Monday Night Countdown, NFL Primetime, Sunday NFL Countdown and the NBA Finals. Scott has secured many exclusive, one-on-one interviews with notable figures including Michael Jordan, Tiger Woods, President Clinton and President Barack Obama.\n\nScott’s successful career was forced to take a back seat when he was first diagnosed with appendiceal cancer in November of 2007. He underwent two surgeries and months of chemotherapy before he was given a clean bill of health. Only two years later, the cancer returned. Scott’s most recent surgery was in September 2013 and he is presently continuing with medical treatments. To treat both his body and his mind, Scott has taken to fighting his cancer in the gym, with intense mixed martial arts and cross-training workouts. Despite what is now a public battle with the disease, Scott continues his high-profile role at ESPN and focuses on being a dedicated father to his two daughters.\n\n“Stuart’s story is truly one of perseverance as he consistently displays strength, resilience and even humor while combating this terrible disease,” said ESPN president, John Skipper. “Given how much Stuart has actively supported The V Foundation through the years from within ESPN, it is an honor to now present him with the Jimmy V Perseverance Award to celebrate the inspiration he provides to so many around him.”\n\nScott commented: “I make a living with words and can’t remember the last time I was at a loss for them…until learning about this amazing honor. I was literally speechless. I’ve had the honor of presenting this very award before and I’ve always been in awe of the recipients. To now be a part of what they stand for is beyond description. Thank you V Foundation and thank you Jim Valvano for STILL guiding us all these years…we won’t give up…we won’t EVER give up.”\n\nThe Jimmy V Perseverance Award was named after, and inspired by, the late Jimmy Valvano who became the award’s raison d’être at the 1993 ESPYS. While battling cancer, Valvano gave an emotional acceptance speech that included his famous words “Don’t Give Up . . . Don’t Ever Give Up!”®. Valvano passed away less than two months later, but his words were never forgotten. The Jimmy V Award is given to a deserving member of the sporting world who has overcome great obstacles through perseverance and determination. In 2007, Women’s College basketball coach Kay Yow became the very first recipient of the Jimmy V Award. Past recipients include Eric LeGrand, Anthony Robles, George Karl and Dick and Rick Hoyt.\n\nAbout The V Foundation\n\nThe V Foundation for Cancer Research was founded in 1993 by ESPN and the late Jim Valvano, legendary North Carolina State basketball coach and ESPN commentator. Since inception, The V Foundation has funded more than $115 million in cancer research grants nationwide. It awards 100 percent of all direct cash donations to cancer research and related programs. Due to generous donors, the Foundation has an endowment that covers administrative expenses. The Foundation awards peer-reviewed grants through a competitive awards process strictly supervised by a Scientific Advisory Board. For more information on The V Foundation or to make a donation, please visit www.jimmyv.org.\n\nThe ESPYS\n\nThe ESPYS gather top celebrities from sports and entertainment to commemorate the past year in sports by recognizing major sports achievements, reliving unforgettable moments and saluting the leading performers and performances. The 2014 ESPYS marks the shows 22nd telecast and will recognize both sport-specific achievements, such as “Best MLB Player” and “Best WNBA Player,” and best-in-sport winners, such as “Best Team” or “Best Female Athlete” that pit nominees from different sports against each other.\n\nThe 2014 ESPYS, hosted by Drake, will be televised live Wednesday, July 16, at 9 p.m. ET on ESPN from Nokia Theatre L.A. LIVE in Los Angeles. For additional ESPYS news and information, please follow the official ESPYS Twitter handle: @ESPYS. Tickets to The 2014 ESPYS are available for public purchase at AXS.com.\n\n-30-\n\nMedia contacts:\n\nJay Jay Nesheim, 646-547-5839/ [email protected]\n\nJennifer Cingari, 646-547-5840/ [email protected]"}, {"url": "https://www.sportskeeda.com/mma/news-who-stuart-scott-late-sportscaster-ufc-paid-tribute-espn-s-v-week", "page_content": "Stuart Scott was an American sportscaster who tragically passed away on January 4, 2015, due to appendiceal cancer. Scott's last public appearance was on July 16, 2014, when he received the Jimmy V Award at the ESPY Awards for his ongoing battle against cancer.\n\nScott covered the NBA and the NFL during his time with ESPN. He stood out in his profession with his unique style of blending hip-hop culture and sports in a way that had never been seen before on television. As a result, Scott gained a following among younger sports fans.\n\nAccording to former ESPN president John Skipper, Scott's flair and style \"changed everything\" in sports commentary. Meanwhile, fellow ESPN anchor Stan Verrett said Scott was a trailblazer \"not only because he was black... but because of his style, his demeanor, his presentation.\"\n\nCheck out Stuart Scott's iconic speech at the ESPY Awards below:\n\nAs part of ESPN’s 15th Annual V Week for Cancer Research, the leading sports media company dedicated content and programming to drive awareness and raise funds for the V Foundation.\n\nThe UFC teams up with ESPN to honor Stuart Scott\n\nThis year, the UFC has once again teamed up with its broadcast partner ESPN to dedicate a telecast titled \"Fight Like Hell Night\" in honor of Scott. The segment was inspired by Stuart’s remarkable \"Fight like hell!\" quote from his ESPY speech paired with his love of the UFC.\n\nThe V Foundation @TheVFoundation Tonight, @UFC is honoring Stuart Scott's courageous spirit to ‘Fight Like Hell’! Tune into “Fight Like Hell” Night which will feature Stuart Scott-related content all throughout fight night and the UFC will be donating $100,000 to the Stuart Scott Memorial Cancer Research Fund. Tonight, @UFC is honoring Stuart Scott's courageous spirit to ‘Fight Like Hell’! Tune into “Fight Like Hell” Night which will feature Stuart Scott-related content all throughout fight night and the UFC will be donating $100,000 to the Stuart Scott Memorial Cancer Research Fund. https://t.co/FzyB0vPpkN\n\nThe UFC Fight Night: Font vs. Aldo telecast featured vignettes centered around Stuart’s speech and the MMA promotion's ongoing battle against cancer. The UFC stated:\n\n\"We are proud to support the Stuart Scott Memorial Cancer Research Fund, which supports cutting-edge cancer research and funds outstanding minority scientists.\"\n\nEarlier this year, the UFC lost a valued member of its community after hair and makeup stylist Suzy Friton lost her battle with breast cancer. The promotion also announced that, in honor of Friton's life, they will be teaming up with V Foundation to support fight cancer and help those suffering from it.\n\nPoll : 0 votes"}, {"url": "https://www.espn.com/espn/citizenship/story/_/page/Stuart-Scott-ENSPIRE-Award/stuart-scott-enspire-award", "page_content": "Stuart Scott ENSPIRE Award\n\nIn honor of Stuart Scott, this award celebrates people that have taken risk and used an innovative approach to helping the disadvantaged through the power of sports. Successful candidates will personify the ethos of fairness, ethics, respect and fellowship with others.\n\n2021 Stuart Scott ENSPIRE Award Honorees\n\nFrank Kipp\n\nFrank Kipp\n\nIn 2003, Frank Kipp founded and opened Blackfeet Nation Boxing Club at the Blackfeet Indian Reservation in Montana to help all children with bullying, suicide prevention and drug and alcohol prevention, while also providing these kids with a safe place for them to find belonging and learn the art of boxing. Kipp has devoted his life to teaching, training and mentoring more than 500 of the club's fighters, where they learn how to fight for respect, identity, acknowledgement, protection and survival. The club provides a safe harbor for those who want to learn and protect themselves - when Kipp saw that some of his fighters were coming to the gym hungry, he started serving meals after training sessions and opened a clothing and food bank out of a warehouse until the building was taken away. When kids were underdressed, he found them clothes and gear. And in a year when the pandemic devastated the reservation, Kipp never stopped fighting for the young people of Blackfeet Nation.\n\nESPN Images\n\nJoe Torre\n\nLike so many children, Baseball Hall of Famer and four-time World Series Champion Joe Torre grew up in a violent home where he watched his mother endure abuse from his father, and consequentially never felt safe. As an adult, Torre realized too many children also live and suffer with this fear and are unaware of how to ask for help. Torre founded the Joe Torre Safe at Home Foundation (SAH) to empower and provide healing services to traumatized youth exposed to violence, while educating them to end the cycle of domestic violence and save lives. Each year, SAH provides services to more than 19,000 young people in schools and communities, many of whom are impacted by trauma and violence. SAH's multi-faceted school-based program, Margaret's Place - named after Torre's mother - provides integrated and comprehensive healing services to youth, and has reached over 109,000 young people, with 95% of students noting they are more hopeful about the future and 94% sharing they feel safer. And with Council on Criminal Justice reporting that domestic violence incidents have increased due to COVID-19 lockdown orders, SAH is committed to providing additional support to children so they can overcome these traumatic experiences.\n\nESPN Images\n\nTom Walter and Kevin Jordan\n\nAfter learning his student-athlete, Kevin Jordan, was in desperate need of a new kidney, Wake Forest Baseball Coach Tom Walter successfully donated his kidney to Jordan just days before the 2011 season, exemplifying an important lesson that despite being of different generations and backgrounds, their blood was the same. The two have since shared a special bond and remained close. Nearly ten years after the transplant, the world watched a video of George Floyd's murder, which led to Jordan talking with Walter, about his fear, frustration and hurt, and how they - and their story of togetherness - could impact positive change. After several conversations, the coach and his former player created Get In the Game to educate and empower young people to take action in their homes, schools and communities and build a more diverse and equitable society. In its inaugural season, Get In the Game launched programs for middle and high school students, facilitated by trained educators, where youth, known as \"GameChangers,\" integrate principles of self-inquiry, cross-cultural communication and social movement strategy to foster challenging yet meaningful conversations on race and social justice, and inspire each other to be more intentional about listening, speaking up and taking action.\n\nPast Winners\n\n2020 Honorees\n\nHilinski Family\n\nAfter their son Tyler, the former quarterback at Washington State, tragically took his own life, Mark and Kym Hilinski created Hilinski's Hope Foundation (H3H) to raise awareness around mental health and ultimately honor their son. H3H is helping colleges and universities across the United States save lives, eliminate stigma and scale mental wellness programs for student athletes, and thus far has raised over half a million dollars to fund these programs. By sharing Tyler's story, H3H connects students with mental health resources, and the foundation also assists universities to institutionalize best practices. Since its inception in 2018, H3H has visited and sent mental health professionals to more than 50 schools and universities. H3H also has attended and spoken at over two dozen conferences, impacting more than 50,000 people. Together with a group of students from Washington State, H3H launched 3 FOR 3 Burpee challenge in 2019 to 'get up for those who are down' to destigmatize mental illness. Hilinski's Hope recently organized a call-to-action for colleges and universities nationwide to participate in the inaugural College Football Mental Health Awareness Week, October 3-10, in conjunction with Mental Illness Awareness Week, October 4-10. The week will kick off on October 3, known as 3DAY, honoring Tyler, those lost, and those suffering and will culminate with World Mental Health Day on October 10.\n\nWNBA and WNBPA\n\nThis year, the WNBA and WNBPA announced a groundbreaking, eight-year collective bargaining agreement that charts a new course for women's professional sports. The strategic and unified collaboration between the league and the players' association resulted in a landmark pact that will serve as a template to other professional women - in sport and other sectors of society. The CBA features significant investments by the team owners, including; increases player salary and compensation; motherhood and family planning elements; and quality of life enhancements such as mental health benefits and domestic/intimate partner violence counseling. Additionally, the WNBA and the players have worked together and will continue to stand up and speak out on behalf of injustice and marginalized communities. The players have demonstrated 144 united and unwavering black, brown, and white voices committed to voting rights, supporting #BlackLivesMatter and a consistent and continuing denouncement of police brutality and excessive force. Together the bold advocacy of the league and the players has included promoting equality and opportunity in sport through these social justice efforts, and through the #HerTimeToPlay program, participating in LGBTQ+ pride demonstrations against discrimination and hosting breast cancer awareness events.\n\nMaryam Shojaei\n\nSince 1979, hardline conservatives in Iran enforced an unwritten rule to exclude women from attending men's soccer matches, citing the inappropriate environment of \"profane language\" and \"half-naked men\" (the athletes). Beginning in 2014, Maryam Shojaei anonymously addressed and criticized the ban on social media. She continued her activism a year later, when she traveled to Australia to attend the Asian Football Confederation Tournament and held a banner throughout the game, which called for Iranian women to be allowed to enter stadiums, and it caught the attention the media. A few months later, Shojaei attended the FIFA Women's World Cup in Canada where she also displayed the banner and gained international interest, forming a coalition with global human rights and sports activists. In 2018, the international coalition helped Shojaei create the #NoBan4Women petition, and she traveled to the FIFA World Cup in Russia. Despite her banner receiving prior approval to display, as the extensive global news coverage it received, Shojaei was detained and her banner was confiscated after the first match. However, Shojaei persisted and the #NoBan4Women petition - which received hundreds of thousands of signatures - shifted focus from the Iranian Football Federation's discrimination against women to FIFA's responsibility to enforce their own human rights and gender discrimination policies. Throughout 2019, Shojaei and the coalition maintained public and private pressure on FIFA to uphold its own policies or disqualify Iran from the World Cup qualifier match for noncompliance. By October, FIFA sent a delegation to Iran allowing access for thousands of Iranian women and girls to attend the match qualifier match.\n\n2019 Honorees\n\nLina Khalifeh\n\nKhalifeh, a Taekwondo champion with 20 gold medals under her belt from national and international competitions, saw first-hand that women in her home country of Jordan, and all over the Middle East, were experiencing high levels of domestic violence. She created SheFighter, the first women's-only, self-defense school in the Middle East, to empower women both physically and psychologically through martial arts. Since its inception in 2012, Khalifeh has trained more than 18,000 women globally, as well as 4,000 Syrian refugees, has grown to studios in over 35 countries, as she works with women all over the world to learn self-defense and inspires them to take on active roles in society.\n\nTyler Trent\n\nTrent, the legendary Purdue fan's story of courage and hope inspired and captivated a nation throughout his battle with the rare bone cancer osteosarcoma. Relentless in his battle, he never allowed cancer to prevent him from living out his dreams in sports journalism and serving others. He spent the final days of his life at home in hospice care, but Trent was committed to sharing his story to raise money to eradicate the disease and improve the lives of others who face a similar battle. The Indiana native rose to national recognition and befriended many members of the sports industry, using his new platform to encourage fans to donate to cancer research -- raising more than $2.2 million for Purdue University, the Riley Hospital for Children at Indiana University Health and the V Foundation.\n\n2018 Honorees\n\nDavid Robinson\n\nNBA Legend David Robinson epitomizes leadership through service, giving considerable care to be strategic, thoughtful and impactful in his approach to philanthropy. He uses his learnings from his decades of service to mentor and counsel other athletes on how to make strategic and lasting social change. Sixteen years ago, Robinson followed his dream of helping to create equal access to education for all students in his hometown of San Antonio. Despite being told it was too difficult of a challenge, he took a risk and launched what was then called Carver Academy. It began as a small parochial school serving 120 elementary students. But through ingenuity and hard work, it grew into a publicly-funded charter school that now enrolls more than 1,100 mostly low-income Hispanic and African American students. Over the last 16 years, every single child has matriculated to college. Robinson has been innovative in sustaining his support, starting his own private equity firm that sets aside 10% of its profits to fund his good deeds. Robinson is also the recipient of 2002-03 NBA J. Walter Kennedy Citizenship Award and the 2008 Mannie Jackson Human Spirit Award.\n\nGlobal Sports Mentoring Program\n\nThe Global Sports Mentoring Program (GSMP) was created in 2012 by the U.S. Department of State and espnW to engage, inspire, and empower a new generation of women and girls through sports. Administered by the Center for Sport, Peace, and Society at the University of Tennessee, the GSMP pairs emerging women leaders from around the world with American women senior executives from top organizations in sports and business. During the program, mentors share valuable leadership skills and work with emerging leaders in developing strategic action plans aimed at creating sports opportunities for underserved women and girls in their home countries. Since 2012, the 99 graduates of the program have returned home to launch NGOs, affect public policy, and transform communities by providing access and opportunity to girls where none previously existed. Collectively, the emerging leaders have directly impacted more than 225,000 individuals through their work.\n\n2017 Honorees\n\nStephanie McMahon\n\nWWE Chief Brand Officer Stephanie McMahon has the unique opportunity both as an on screen performer and the primary spokesperson for WWE's corporate social responsibility initiatives to help raise funds and awareness for partners including Make-A-Wish, Special Olympics, Susan G. Komen, Boys & Girls Clubs of America, and Be a STAR, WWE's anti-bullying program. Her innovative approach to giving back is highlighted through her passion for pediatric cancer research, which began after meeting 8-year-old WWE fan Connor Michalek, who was battling medulloblastoma, a rare tumor that affects the brain and spinal cord. Connor formed a special connection with Stephanie, Paul \"Triple H\" Levesque and many WWE Superstars, who were enamored with his energy and determination to fight his debilitating form of cancer. When Connor lost his battle in 2014, Stephanie and Paul honored him by creating Connor's Cure, a fund at the Children's Hospital of Pittsburgh, where Connor was being treated. Under McMahon's leadership, WWE expanded Connor's Cure into a national fund in partnership with the V Foundation for Cancer Research. To date, Connor's Cure has raised more than $1.5 million and assisted 240 families around the world.\n\nOrlando City Soccer Club #OrlandoUnited\n\nOn June 12, 2016, a gunman opened fire at a popular gay nightclub in Orlando killing 49 people. Six days later, Orlando City SC held the first professional sporting event following the tragic attack in Central Florida. Though it came with risk, the club and its dedicated supporters crafted a bold, inspired and innovative response. Every aspect of the match was a dedication to those whose lives were lost-from the inspirational music played at pregame, down to the rainbow-colored corner flags on the field. The families of the victims along with first responders were recognized before the game. Every Orlando City SC player wore #OrlandoUnited patches on their jersey, black armbands and rainbow wristbands. At the 49th minute of play, the game was intentionally stopped for the first time in MLS history for a moment of silence to honor the 49 victims. A section of seats was left empty at midfield, filled only with a single colorful balloon-later to be memorialized with 49 dedicated rainbow-colored seats in Section 12 of the club's new stadium. The club, in its second year in the league, took a stand to define their character and commitment for respect and inclusion. And their commitment continues: Orlando City SC has already raised $500,000 for the OneOrlando Fund.\n\nThe Ross Initiative in Sports for Equality\n\nIn October 2015, Miami Dolphins Owner Stephen Ross took a risk by driving awareness to the conversation of race relations in the United States. He established the Ross Initiative in Sports for Equality (RISE) to harness the unifying power of sports to improve race relations and drive social progress. Ross has worked tirelessly on the project, engaging and personally recruiting influential leaders to be part of RISE's board of directors, including all of the major sports league commissioners and sports broadcast executives. Since its founding, RISE programs have reached more than 30,000 students, coaches and athletic staff. Innovative programs include the RISE High School Leadership program, which empowers coaches and student-athletes to be leaders in discussing and addressing matters of racism. After completion, 92% said they have the skills to have difficult conversations about race. RISE also has partnered with the Detroit Police Athletic League directly linking youth with law enforcement, thereby creating conversation and shared relationships. In teaming up with the NBA and the New Orleans Pelicans on the Saturday Morning Hoops program, which includes participation from officers in the New Orleans Police Department, 89% of youth stated they felt trusted and appreciated by the police.\n\n2016 Honorees\n\nBillie Jean King\n\nFor decades Billie Jean King used her platform as a tennis star to champion equal pay and opportunity for all. From advocating for the passage of Title IX, to founding the Women's Sports Foundation in an effort to increase girls' access to sports, King has paved the way for equality in women's sports. In 2014, she embarked on a new phase of her journey for inclusion: the Billie Jean King Leadership Initiative, whose sole focus is to move the needle on issues impacting diverse talent in the workplace. With women and minorities vastly underrepresented in executive positions, King is using research to inspire future leaders and to motivate people in positions of power to promote diverse identities.\n\nRobert Kraft\n\nRobert Kraft has donated hundreds of millions to charities since becoming the owner of the New England Patriots-yet it's not just the number that's impressive, but the innovative and personal way he's leaving an imprint on communities across the region. Kraft is a fierce advocate for ensuring all residents of New England have access to quality health care. To that end, he's investing millions of dollars to attract the best clinicians to assist the most underserved populations through the community healthcare systems. He started a fellowship that provides coursework at Harvard, mentoring, clinical practice and even a student-loan repayment of $50,000 per year in return for a three-year commitment to community health following completion of the program.\n\n2015 University of Missouri Football Team\n\nRacial tensions were becoming increasingly strained at the University of Missouri last fall. Frustrations gave rise to protests - one of the most notable coming when a student at the school began a hunger strike. Students were demanding action, and the Mizzou Tigers football team stepped in and announced that they would boycott their upcoming game unless changes were made. The players took a huge risk - their scholarships could have been revoked and their futures hung in the balance. But their actions indicated it was a risk worth taking to help bring action to this critical issue.\n\n2015 Honorees\n\n\"Like A Girl\" Campaign\n\nAlways, the world's leading feminine care brand, launched a social experiment to address the drop in confidence girls experience at puberty and change the negative perception of the phrase \"like a girl\" into one that means downright amazing things. Through a viral video that later aired as a Super Bowl commercial, the Always #LikeAGirl campaign challenged girls, boys, women and men worldwide to change the way they think about and use phrases like \"throw like a girl\" and \"run like girl\" which proved to have a profound impact. Prior to viewing the film, only 19% of girls had a positive association toward the phrase \"like a girl.\" After watching the video, 76% of girls ages 16-24 no longer see the phrase as an insult, and two out of three men who watched said they would stop or think twice before using \"like a girl\" as an insult.\n\nMLB Commissioner Emeritus Allan H. (Bud) and Suzanne L. (Sue) Selig\n\nBud and Sue Selig have helped transform how leagues and sport gives back. At the urging of the Seligs, MLB granted the $10 million founding donation that launched Stand Up To Cancer (SU2C) in 2008. Since then, the Seligs have helped raise tens of millions of dollars for groundbreaking cancer research through SU2C's Innovative Research Grant, the first of which was named in their honor, and they are responsible for MLB's continued support for cancer research. The Seligs also paved the way for professional sports to become more sustainable, with Bud being called \"the single most influential environmental advocate in the history of sports\" by the Green Sports Alliance. Under his watch, MLB was the first league to distribute environmental advice and measurement tools to all stadium operators. It was the first league to use public service announcements to educate fans about environmental stewardship and to green its All-Star Game and league championships. Selig received the Lifetime Achievement Award from the Jackie Robinson Foundation, which aids academically distinguished minority students, and the Chairman's Award from Boys & Girls Clubs of America. Selig is a major supporter of his alma mater, the University of Wisconsin-Madison, as well as Marquette University.\n\nSeattle Seahawks Head Coach Pete Carroll\n\nPete Carroll is committed to helping people be the best they can be on and off the field. Carroll works to identify what is unique about each person, understand and help them create a vision for what they want to be and then keep them connected to that vision. It is in this approach that has led to life-changing impact. Coach Carroll incorporated this philosophy to help transform communities and make them better places to live through his violence prevention efforts via A Better LA and A Better Seattle. He was instrumental to bring Free The Children's We Act & We Day to the U.S. and Seattle in 2013. Annually, students earn their tickets to We Day by completing one local and one global action on any issue of their choice. This program is unique because it provides youth from all types of backgrounds a platform to become agents of change and leaders regardless of their circumstances.\n\nYou Can Play\n\nThe You Can Play Project is working to change the sometimes homophobic culture of locker rooms and sports venues with a message that athletes should be judged on athletic skill and ability, not sexual orientation or other discriminatory factors. Inspired by the late Brendan Burke, an openly gay hockey player at Miami University and son of Calgary Flames president of hockey operations Brian Burke, the organization is spreading a message of tolerance, inclusion and equality. Today, You Can Play has been represented in video messages by athletes from every professional sports league in North America, all saying they would support a gay teammate who would contribute to a team's success."}]}