{"Mark Fite was born in Los Angeles, California.": [{"url": "https://en-academic.com/dic.nsf/enwiki/11699398", "page_content": "Mark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA.[1]\n\nFite graduated from the University of Iowa with a Bachelor of Arts in Communications and Theater Arts.\n\nReferences\n\nPersondata Name Fite, Mark Alternative names Short description American actor Date of birth Place of birth Illinois Date of death Place of death\n\n\n\n"}, {"url": "https://www.wallofcelebrities.com/celebrities/mark-fite/biography.html", "page_content": "Mark Fite - Biography\n\nMark Fite is an American actor and comedian. Besides his work in film and television, he has been very active in theatre, voiceover, comedy, improvisation, and commercials. Originally from the Midwest, Fite graduated from the University of Iowa with a Bachelor's degree in Communications and Theatre Arts. He resides in Los Angeles, California.\n\n\n\nFite is a founding member of the L.A. based comedy group Two Headed Dog, along with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. Known for their absurd characters, offbeat sketches, and loose improvisation, their antics have taken them to New York City, San Francisco, Atlanta, and Hawaii. Locally, Two Headed Dog has enjoyed many venues over the years, particularly Largo, Theatre Theater, and The Steve Allen Theater, where they have developed new material and presented multiple shows including Sashay Gigante and Clowntown City Limits.\n\n\n\nBesides Two Headed Dog, Fite is well known for creating original roles in many other hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, and Girly Magazine Party.\n\n\n\nFite has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, and The San Francisco Comedy Festival. He has also made multiple appearances at Lucha Va Voom and Brookledge Follies.\n\n\n\nHe has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\n\n\nA few favorite productions include Mitch Watson's Klub at the Actors' Gang, Justin Tanner's Wife Swappers at Third Stage, and in 2009, the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse.\n\n\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants (multiple episodes), Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio.\n\n\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Happy Endings, Courting Courtney, Mystery Cave, Janeane From Des Moines, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\n"}, {"url": "https://radaris.com/p/Mark/Fite/", "page_content": "Wellington, CO • Loveland, CO • Colorado Springs, CO • Fountain, CO • Penrose, CO\n\nWellington, CO • Loveland, CO • Colorado Springs, CO • Fountain, CO • Penrose, CO\n\nThank you Thank You Jeff Daniel Phillips, Paul Marchand (DP, Editor), Bridget Phillips (stylist), Josefine Wissenberg (make up), Johnny Walker (hair), Stephen Heath (funny business),(more funny business)\n\nLaura Jean - \"Better Than Me\" Directed By Jeff Daniel Phillips\n\nThings get tense in this classic scene from International Ghost Investigators., Ron Lynch, Dave Higgins, Paul Greenberg.\n\nClips from THE TONY MARTINI VARIETY HOUR. Live from the Three Clubs in HOLLYWOOD.\n\nChannel Frederator has Morgan Freeman and his family in their thoughts, prayers, and wishes during this trying time for them. We wish him a very speedy recovery. Get Well Morgan! Your friends at Channel Frederator Nitescores an interview with movie star Morgan Freeman about his latest project....\n\nRampant violence and sexism in the music industry. Nite's taking on the most offensive and repulsive music out there. Schism of The Wang Warriors is our guest. Niteby Dan Meth &Vitelli Starring: Dan Meth as Penalty,Vitelli as Lloyd, Steve Ofori as Schism Animated by: Daisy Edw...\n\nThe sacred institution of marriage is under fire tonight when Penalty's wife calls in and and dishes the dirt on Lloyd. Could this be the fight to end all fights? Niteby Dan Meth &Vitelli Starring: Dan Meth as Penalty,Vitelli as Lloyd, Jackie Clarke as Jackie Animated by: Daisy Edw...\n\nAlternative physical comedy starring Jay Johnston and Eric Hoffman. Two German brothers who are so stupid they'll fight over anything! Made with the help ofRivers, Mike Berson, Deron Grams.\n\nFAQ: Learn more about our top result for Mark Fite\n\nMark Fite's address is 1004 Rustique Dr, Fountain, CO 80817.\n\nMark Fite's phone number is (407) 298-4487.\n\nMark Fite's is 43 years old.\n\nMark Fite's email address is noblea***@collegeclub.com. We have 2 additional emails on file for Mark\n\nWe have marriage records for 12 people named Mark Fite.\n\nMark Fite was born on 1979.\n\nYou can find arrest records for Mark Fite in our background checks if they exist.\n\nYou can use the radar feature if you want to find out if someone is looking for you at radaris.com. Visit the website and turn on the radar to get new notifications on people looking for you.\n\nYes. Radaris has developed an application compatible with iOS and Android smartphones. To download this app, visit radaris.com and scroll down to the bottom of the page, where you will find links to the app.\n\nIf a person works for a publicly known company, you can always find their employer on radaris.com. All you need is to run the company's name using the business lookup feature on the site."}, {"url": "https://www.spokeo.com/Mark-Fite/California", "page_content": "Showing 5 records of 7 Criminal Records & Traffic Violations that matched the name Mark Fite:\n\nDisclaimer: By using this website, you accept the Spokeo Terms of Use. Spokeo is not a consumer reporting agency as defined by the Fair Credit Reporting Act (FCRA). This site should not be used to make decisions about employment, tenant screening, or any purpose covered by the FCRA.\n\n\n\nThe records were matched using first and last name only. The records below may not pertain to the individual that you're looking for, and may or may not pertain to the same charge. Please make your own determination of the relevance of these court records."}, {"url": "https://www.ancientfaces.com/person/mark-e-fite-birth-1962/95152174", "page_content": "Add Mark's birthday or the date he died to see a list of historic events that occurred during Mark's lifetime. Refresh the page for new events.\n\nIn 1962, in the year that Mark E. Fite was born, on August 5th, actress and sex symbol Marilyn Monroe died in Brentwood California. She was ruled to have died from suicide due to a drug overdose. There has been controversy regarding the circumstances ever since, due to her relationships with Jack and Bobby Kennedy.\n\nIn 1972, on September 5th, the Palestinian terrorist group Black September, with the assistance of German neo-nazis, kidnapped and killed 11 Israeli athletes at the Olympic Games in Munich. The attackers crept into the Olympic Village and abducted the athletes while they were sleeping. A German policeman was also killed.\n\nIn 1980, on December 8th, ex-Beatle John Lennon was shot and killed by Mark David Chapman in front of his home - the Dakota - in New York City. Chapman was found guilty of murder and still remains in jail.\n\nIn 1981, on August 1st, MTV debuted. It was the first music video TV channel. The first music video played was the Buggles' \"Video Killed the Radio Star\" - the second was Pat Benatar's \"You Better Run\".\n\nIn 1996, on April 3rd, Theodore Kaczynski (nicknamed the Unabomber) was arrested. His mailed or hand-delivered bombs, sent between 1978 and 1995, killed three people and injured 23 others. Diagnosed as suffering from paranoid schizophrenia, Kaczynski is serving 8 life sentences without the possibility of parole."}, {"url": "https://www.spokeo.com/Mark-Fite/California/Santa-Cruz/p40133471058", "page_content": "Mark David Fite, Age 53 Unlock Profile\n\n* Historical, vital, and court records and search results may require an additional purchase. Spokeo's database, while extensive, does not contain all U.S. warrant, arrest, court, or other related records. The presence or absence of records for any individual is not a guarantee of any kind. Results for this person or the person you are looking for are not guaranteed to appear in search results. Counts may not reflect the number of records that will appear in search results.\n\nCustomer Testimonials"}, {"url": "https://simple.wikipedia.org/wiki/Mark_Fite", "page_content": "Fite in 2012\n\nMark Elliott Fite is an American actor and comedian.\n\nFite is a founding member of comedy troupe 2 Headed Dog with comedians Jim Turner, Dave Allen and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits and Wife Swappers.\n\nHe has appeared in television series including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D., Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bone Show, Friends, Seinfeld and NewsRadio."}, {"url": "https://www.rottentomatoes.com/celebrity/mark_fite", "page_content": "Highest Rated: 25% Off the Lip (2004)\n\nLowest Rated: 25% Off the Lip (2004)\n\nBirthday: Not Available\n\nBirthplace: Not Available\n\nMark Fite was a vibrant source of comedy on the big screen, bringing laughter and joy to many audiences over the course of his Hollywood career. Fite worked on a variety of projects during his early entertainment career, including \"I'm Gonna Git You Sucka\" with Keenen Ivory Wayans (1988), the Will Smith and Bill Pullman blockbuster \"Independence Day\" (1996) and \"Living Single\" (Fox, 1992-98). He also contributed to \"Seinfeld\" (NBC, 1989-1998), \"The Fabulous Baker Boys\" (1989) and \"The Kennedy Assassinations: Coincidence or Conspiracy\" (1991-92). His film career continued throughout the nineties in productions like the Matthew Broderick box office smash action picture \"Godzilla\" (1998), the Billy Burke comedy \"Dill Scallion\" (1999) and \"Stuart Bliss\" (1999). He also appeared in the Edward Norton action flick \"Fight Club\" (1999). Most recently, Fite voiced characters in the Antonio Banderas hit children's sequel \"The SpongeBob Movie: Sponge Out of Water\" (2015)."}, {"url": "https://www.wikizero.com/en/Mark_Fite", "page_content": "From Wikipedia the free encyclopedia\n\nAmerican actor and comedian\n\nMark Elliott Fite is an American actor and comedian.\n\nCareer [ edit ]\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.[1]\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.[2]\n\nIn 2016, Fite performed on stage with the Los Angeles Philharmonic at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nReferences [ edit ]\n\n\n\n"}]}