{"Mark Fite attended the University of California, Los Angeles.": [{"url": "https://www.wallofcelebrities.com/celebrities/mark-fite/biography.html", "page_content": "Mark Fite - Biography\n\nMark Fite is an American actor and comedian. Besides his work in film and television, he has been very active in theatre, voiceover, comedy, improvisation, and commercials. Originally from the Midwest, Fite graduated from the University of Iowa with a Bachelor's degree in Communications and Theatre Arts. He resides in Los Angeles, California.\n\n\n\nFite is a founding member of the L.A. based comedy group Two Headed Dog, along with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. Known for their absurd characters, offbeat sketches, and loose improvisation, their antics have taken them to New York City, San Francisco, Atlanta, and Hawaii. Locally, Two Headed Dog has enjoyed many venues over the years, particularly Largo, Theatre Theater, and The Steve Allen Theater, where they have developed new material and presented multiple shows including Sashay Gigante and Clowntown City Limits.\n\n\n\nBesides Two Headed Dog, Fite is well known for creating original roles in many other hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, and Girly Magazine Party.\n\n\n\nFite has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, and The San Francisco Comedy Festival. He has also made multiple appearances at Lucha Va Voom and Brookledge Follies.\n\n\n\nHe has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\n\n\nA few favorite productions include Mitch Watson's Klub at the Actors' Gang, Justin Tanner's Wife Swappers at Third Stage, and in 2009, the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse.\n\n\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants (multiple episodes), Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio.\n\n\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Happy Endings, Courting Courtney, Mystery Cave, Janeane From Des Moines, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/11699398", "page_content": "Mark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA.[1]\n\nFite graduated from the University of Iowa with a Bachelor of Arts in Communications and Theater Arts.\n\nReferences\n\nPersondata Name Fite, Mark Alternative names Short description American actor Date of birth Place of birth Illinois Date of death Place of death\n\n\n\n"}, {"url": "https://www.spokeo.com/Mark-Fite/California", "page_content": "Showing 5 records of 7 Criminal Records & Traffic Violations that matched the name Mark Fite:\n\nDisclaimer: By using this website, you accept the Spokeo Terms of Use. Spokeo is not a consumer reporting agency as defined by the Fair Credit Reporting Act (FCRA). This site should not be used to make decisions about employment, tenant screening, or any purpose covered by the FCRA.\n\n\n\nThe records were matched using first and last name only. The records below may not pertain to the individual that you're looking for, and may or may not pertain to the same charge. Please make your own determination of the relevance of these court records."}, {"url": "https://www.usnews.com/best-colleges/ucla-1315", "page_content": "University of California, Los Angeles is a public institution that was founded in 1919. It has a total undergraduate enrollment of 32,119 (fall 2021), its setting is urban, and the campus size is 419 acres. It utilizes a quarter-based academic calendar. University of California, Los Angeles' ranking in the 2022-2023 edition of Best Colleges is National Universities, #20. Its in-state tuition and fees are $13,804; out-of-state tuition and fees are $44,830.\n\nLocated in LA’s Westwood neighborhood, five miles from the Pacific Ocean, UCLA encompasses the College of Letters and Sciences and a number of graduate schools and programs, including the highly ranked Anderson School of Management, Henry Samueli School of Engineering and Applied Science, School of Law and David Geffen School of Medicine. UCLA also has a prestigious School of Theater, Film and Television, and School of Dentistry. The Ronald Reagan UCLA Medical Center is one of the top-ranked hospitals in the country.\n\nUCLA’s Southern California campus spans more than 400 acres and is located near the coast. A busy walkway known as the Bruin Walk connects the residence halls to the heart of campus. UCLA guarantees students housing for three years. The school offers more than 1,000 student organizations, including media groups and more than 65 Greek chapters, which represent about 13% of the student body.\n\nUCLA fields both men's and women's teams in basketball, cross country, golf, soccer, tennis, track and field, volleyball and water polo. Male athletes also compete in baseball and football, while women can also join beach volleyball, gymnastics, rowing, softball, and swimming and diving teams. The UCLA Bruins compete in the Pac-12 Conference of NCAA’s Division I and are well known for their water polo teams."}, {"url": "https://www.fitelawgroup.com/professionals-2/", "page_content": "Attorney\n\nJennifer Fite\n\nJennifer Fite is known as a tenacious fighter who protects her client’s interests as though they were her own.\n\nJennifer was born in Virginia and moved with her family several times before laying down roots near Greenville, South Carolina. Her first paying job was cleaning out dryers at the local laundromat for $1 each. After high school graduation, she moved to Los Angeles, C.A. to attend the University of Southern California. Years later, she decided to follow in her father’s footsteps and pursue a law degree at Southern Illinois University, Carbondale where she met her now husband, Berin. After graduation, they moved to Phoenix, Arizona.\n\nJennifer has worked on a variety of matters from plaintiff’s personal injury, bad faith and product liability to insurance defense construction defect cases. Berin began the Law Office of Berin A Fite in 2007 and business quickly grew. Jennifer joined the firm in 2008 to help manage the caseload and eventually they changed the name to Fite Law Group.\n\nThe car accident and wrongful death cases that the firm handles are particularly significant to Jennifer, as she lost a dear friend at the age of 19 to a drunk driver. Although the process of making a claim to an insurance company can never replace a lost friend or family member, she takes pride in the work she does to make negligent drivers responsible for the damage they do and make the roads a safer place.\n\nJennifer and Berin have three children and a wide variety of pets. She considers herself a lifelong learner and enjoys reading, writing, and watching movies.\n\nSERVICES:\n\nCar accidents\n\nCatastrophic injury\n\nWrongful death\n\nInsurance bad faith\n\nDog bites\n\nBicycle accidents\n\nPersonal Injury, plaintiffs\n\nCOURT AND BAR ADMISSIONS:\n\nState Bar of Arizona\n\nAll Arizona Courts (2002)\n\nUnited States District Court, District of Arizona (2003)\n\nUnited States Supreme Court (2012)\n\nPROFESSIONAL ASSOCIATIONS:\n\nArizona Trial Lawyers Association\n\nAmerican Association for Justice\n\nArizona Women Lawyers Association\n\nUSC Alumni Club of Phoenix\n\nMensa\n\nEDUCATION:\n\nJennifer Fite attended the University of Southern California and graduated in 1996 with a B.A. in International Relations and an emphasis in Global Issues and Institutions. After living and working in Los Angeles, she went on to study at the Southern Illinois University Carbondale School of Law, the same law school her father attended, graduating in 2001 with a Juris Doctorate."}, {"url": "https://www.losangeles.university/about-us/", "page_content": "OUR CORE VALUES\n\nExcellence\n\nAiming to be the best distance learning university of all by developing confidence and ambition in our students to reach their maximum potential\n\nRespect\n\nExchanging creative ideas openly and respecting differences ethnically with commitment.\n\nIntegrity\n\nDevoted to delivering the highest standards of education with consistency, honesty and building trust within our communities\n\nExploration\n\nExploring thirst for knowledge in education and discovering more pathways to success\n\nCreativity\n\nWe respect the creativity of each of our students and giving them an environment to learn, inspire and discuss their creative and innovative ideas with the staff of LAUC in order to convert imagination into reality."}, {"url": "https://www.ucla.edu/academics", "page_content": "Academics\n\nWhat course will your future take?\n\nUCLA is a world-class research university nestled into a training ground for your talents: the global city of Los Angeles. Here, your effort will amount to more than just a fulfilling career, because everything we do, we do to better the community. Whether you want to change a life, a generation or the whole world, it all starts with the courses you take at UCLA."}, {"url": "https://www.nndb.com/edu/471/000068267/", "page_content": "NNDB MAPPER\n\n\n\n\n\nFreemasons 3\n\n\n\nRequires Flash 7+ and Javascript.\n\nBibliographies NNDB has added thousands of bibliographies for people, organizations, schools, and general topics, listing more than 50,000 books and 120,000 other kinds of references. They may be accessed by the \"Bibliography\" tab at the top of most pages, or via the \"Related Topics\" box in the sidebar. Please feel free to suggest books that might be critical omissions.\n\n"}], "Mark Fite studied theater.": [{"url": "https://www.wallofcelebrities.com/celebrities/mark-fite/biography.html", "page_content": "Mark Fite - Biography\n\nMark Fite is an American actor and comedian. Besides his work in film and television, he has been very active in theatre, voiceover, comedy, improvisation, and commercials. Originally from the Midwest, Fite graduated from the University of Iowa with a Bachelor's degree in Communications and Theatre Arts. He resides in Los Angeles, California.\n\n\n\nFite is a founding member of the L.A. based comedy group Two Headed Dog, along with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. Known for their absurd characters, offbeat sketches, and loose improvisation, their antics have taken them to New York City, San Francisco, Atlanta, and Hawaii. Locally, Two Headed Dog has enjoyed many venues over the years, particularly Largo, Theatre Theater, and The Steve Allen Theater, where they have developed new material and presented multiple shows including Sashay Gigante and Clowntown City Limits.\n\n\n\nBesides Two Headed Dog, Fite is well known for creating original roles in many other hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, and Girly Magazine Party.\n\n\n\nFite has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, and The San Francisco Comedy Festival. He has also made multiple appearances at Lucha Va Voom and Brookledge Follies.\n\n\n\nHe has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\n\n\nA few favorite productions include Mitch Watson's Klub at the Actors' Gang, Justin Tanner's Wife Swappers at Third Stage, and in 2009, the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse.\n\n\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants (multiple episodes), Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio.\n\n\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Happy Endings, Courting Courtney, Mystery Cave, Janeane From Des Moines, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\n"}, {"url": "https://peoplepill.com/people/mark-fite/", "page_content": "Mark Fite is an American actor and comedian.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.\n\nIn 2016, Fite performed on stage with the L.A. Philharmonic Orchestra at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program."}, {"url": "https://couchtuner0.com/celebrity/mark-fite/ksNidmlk70", "page_content": "Mark Fite\n\nMark Fite is an American actor and comedian. Originally from the Midwest, Fite graduated from the University of Iowa with a degree in Communications and Theatre Arts. In Los Angeles, he has worked wit ...Show More\n\nMark Fite is an American actor and comedian. Originally from the Midwest, Fite graduated from the University of Iowa with a degree in Communications and Theatre Arts. In Los Angeles, he has worked with several prestigious theatre companies such as The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival. In 2009, he appeared in the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse. Fite is a founding member of the Los Angeles based comedy group Two Headed Dog and has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, The San Francisco Comedy Festival, and Tenacious D's Festival Supreme in 2015. Fite is well known for creating original roles in many long running hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, Girly Magazine Party, and Clowntown City Limits. He has also made multiple appearances at L.A. favorites Lucha VaVoom and the Brookledge Follies. Fite has appeared in numerous television shows, including SpongeBob SquarePants (25 episodes), Parenthood, Mike & Molly, Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, The Naked Truth, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, SpongeBob SquarePants 2, Off The Lip, Happy Endings, Courting Courtney, Janeane From Des Moines, Mystery Cave, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell. Hide"}, {"url": "https://fahrenheitmagazine.com/en/modern-art/Visual/the-laws-theater-and-land-art-by-harvey-fite", "page_content": "Harvey Fite He was an artist and sculptor stonemason of the current land art; his most recognized monumental work is “Opus 40”, a set of millions of blue stones that he carved himself.\n\nThe intervention of the landscape is called land art or art of the land, a trend that emerged in the United States and England in the 60s and 70s when artists broke with the art market, which only allowed the use of artistic materials and exhibited in closed spaces such as museums or galleries.\n\nLand art artists create sculptures and installations with flowers, leaves, stems, sand, mud, stones, snow, or water. The works are left without maintenance so that the materials are reintegrated into nature.\n\nAmong the representatives of this current are Walter de Maria, Nils udo, Nancy holt, Roy Staab, Peter Hutchinson, Alan Sonfist, Betty beaumontJohn Pfahl Richard Shilling y Andy Goldsworthy, among many others.\n\nHarvey Fite was born in Pennylvannia, United States, in 1903. At first he studied law, but was more attracted to the theater.\n\nFite discovered his knack for sculpture while working in a theater company in WoodstockAs he waited for his turn to perform backstage, he found a piece of wood and began to carve it with his knife.\n\nIn the 30s, Fite acquired a bluestone quarry in Suagerties, a rural town in upstate New York. Inside the property he built a house and carved the stones into a stony environment of ramps, passageways, pools and fountains that he named Opus 40.\n\nThe sculptor thought it would take him 40 years to finish his greatest work, which is why he called it that.\n\nFite died in 1976 after falling from a height of more than three meters while working in Opus 40Since then his wife opened the space to the public to also exhibit other pieces of wood and stone that the author made.\n\nThe place is so iconic that it lends itself to live concerts, or to celebrate weddings."}, {"url": "https://simple.wikipedia.org/wiki/Mark_Fite", "page_content": "Fite in 2012\n\nMark Elliott Fite is an American actor and comedian.\n\nFite is a founding member of comedy troupe 2 Headed Dog with comedians Jim Turner, Dave Allen and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits and Wife Swappers.\n\nHe has appeared in television series including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D., Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bone Show, Friends, Seinfeld and NewsRadio."}, {"url": "https://www.rottentomatoes.com/celebrity/mark_fite", "page_content": "Highest Rated: 25% Off the Lip (2004)\n\nLowest Rated: 25% Off the Lip (2004)\n\nBirthday: Not Available\n\nBirthplace: Not Available\n\nMark Fite was a vibrant source of comedy on the big screen, bringing laughter and joy to many audiences over the course of his Hollywood career. Fite worked on a variety of projects during his early entertainment career, including \"I'm Gonna Git You Sucka\" with Keenen Ivory Wayans (1988), the Will Smith and Bill Pullman blockbuster \"Independence Day\" (1996) and \"Living Single\" (Fox, 1992-98). He also contributed to \"Seinfeld\" (NBC, 1989-1998), \"The Fabulous Baker Boys\" (1989) and \"The Kennedy Assassinations: Coincidence or Conspiracy\" (1991-92). His film career continued throughout the nineties in productions like the Matthew Broderick box office smash action picture \"Godzilla\" (1998), the Billy Burke comedy \"Dill Scallion\" (1999) and \"Stuart Bliss\" (1999). He also appeared in the Edward Norton action flick \"Fight Club\" (1999). Most recently, Fite voiced characters in the Antonio Banderas hit children's sequel \"The SpongeBob Movie: Sponge Out of Water\" (2015)."}, {"url": "https://www.shine.cn/feature/entertainment/2209019969/", "page_content": "The two plays, \"When We Two Parted\" and \"Symmetry Breaking,\" will serve as the opening performances for the newly renovated theater in Shanghai's downtown Yangpu District.\n\nTwo intelligentsia-themed stage plays will raise the curtain for Theater Young, a newly renovated theater in Shanghai's downtown Yangpu District.\n\nThe two plays, \"When We Two Parted\" and \"Symmetry Breaking,\" are presented by Beijing-based troupe The Nine, which was established by a group of Peking University graduates a decade ago.\n\nBoth plays center on the story and personal pursuit of Chinese intelligentsia. \"When We Two Parted\" depicts the friendship and mutual influence between a pair of women physics scientists, highlighting a feminist approach.\n\nTi Gong\n\n\"Symmetry Breaking\" is a scientific term, which is also a metaphor for the fate of the three protagonists in the play. They seek scientific breakthroughs and challenge tradition in a turbulent era.\n\nAccording to The Nine founder Zhu Hongxuan, who is also the director and playwright of both dramas, the choice of the theme reflects the pursuit and culture of the troupe.\n\n\"Apart from fame and wealth, there are other valuable things that are worth pursuing – the belief and persistence in idealism,\" she observed.\n\nTi Gong\n\nAccording to Zhu, about 30 percent of the troupe members are graduates of Peking University, while the rest are from other walks of life, involving industries like Internet, commerce and education.\n\n\"The Nine's background decides that we might be more familiar with intelligentsia, but it won't limit the theme of our creation,\" Zhu said. \"We encourage the diverted development of the troupe and its members. As long as a story or a kind of spirit is worth telling and spreading, we will work on it.\"\n\nIn the new performance season, Theater Young plans to introduce more stage works by troupes with university and college background, aiming to build a \"utopia\" for daring young creators to display their experimental and innovative creations.\n\nTi Gong\n\n• \"When We Two Parted\"\n\nDates: September 2-4, 2pm and 7:30pm\n\n\n\n• \"Symmetry Breaking\"\n\nDates: September 10-12, 2pm, 7:30pm\n\n\n\nTickets: 180-480 yuan\n\nVenue: Theater Young\n\nAddress: 1155 Kongjiang Rd"}, {"url": "https://www.shine.cn/feature/entertainment/2112039047/", "page_content": "After three years of renovation, Theater Young, a new performing arts venue in Yangpu District, will welcome theatergoers in March.\n\nTheater Young, a new performing arts venue in Yangpu District, will welcome theatergoers in March.\n\nPreviously known as the Yangpu Grand Theater, the venue on Kongjiang Road has undergone three years of renovation, and now boasts two performing halls – a 1,020-seat main hall and a 168-seat smaller space.\n\nThe new theater will present stage drama performances as well as other innovative artistic activities. The word \"young\" in its new name was chosen as it sounds similar to \"yang,\" as in Yangpu District. It also manifests the theater's aim to entice young audiences with more creative performances.\n\nTi Gong\n\nA series of pre-launch events entitled \"Theater Everywhere\" have been organized by Theater Young to build good relations with future audiences. Activities included improvisational drama, performance art, ambient music and virtual-reality films.\n\n\n\nBecause the theater is still under construction, the events were held at various landmarks in Yangpu District, including Shanghai International Fashion Center, the Changyang Campus and the riverside space along the Huangpu River.\n\n\"We selected different locations to echo the 'Theater Everywhere' theme,\" said Li Shihan, an employee of Theater Young.\n\n\n\n\"Art merges into daily life, which will be one of the new theater's objectives. Audiences not only watch, but participate in the creation of artistic productions,\" she added.\n\n\n\n\"Future performances will be held both in and out of the theater. High-tech elements will be involved.\"\n\nTi Gong\n\nTi Gong\n\nA VR film viewing, one of the most recent \"Theater Everywhere\" activities held at Changyang Campus, showcases the integration of technology and theater performance.\n\nParticipants watched \"Or Bit,\" a 360-degree avant-garde dance film by Zhang Daming, a veteran director and visual and stage designer.\n\nZhang said the film was created upon the idea that dance is regarded as a process of change through different elements in space. While the dancers move in the film, the camera, as a virtual character, has its own movement design.\n\nThe director also wants to discuss how to guide attention in an immersive environment through the work.\n\nTi Gong\n\nWearing VR equipment, the audience \"searches\" for dancers in the 15-minute film. The changing distance between the camera and the performers evokes emotional tension.\n\nBefore the viewing, Zhang had randomly picked residents in Yangpu District to watch \"Or Bit.\" Viewers included workers helping to construct the new theater. Startled by the incredible vividness of the VR film, their reactions were captured in pictures and exhibited during the event.\n\n\"We are pleased audiences in neighboring areas welcome new art forms with an open mind,\" Li said.\n\n\n\n\"We are organizing other artistic activities in the district,\" she added. \"Vitality, leading edge and multiform are key words for Theater Young's future.\""}, {"url": "https://www.shine.cn/feature/entertainment/2301305643/", "page_content": "DrumTower West Theater brings a series of avant-garde stage plays to Shanghai audiences. The troupe is working alongside Theater Young's Green Box, planning a full year of shows.\n\nTheater Young is giving stage to avant-garde and experimental drama, presenting DrumTower West Theater performances to Shanghai audiences, on a long-term run this year.\n\nAs one of the country's leading independent drama troupes, Beijing-based DrumTower West Theater specializes in modern and alternative productions. Some of their signature work, including \"The Pillowman,\" has helped them to build a reputation among domestic theatergoers.\n\nUnder their latest cooperation with Theater Young, which is located in Yangpu District, DrumTower West Theater is bringing a handful of their popular plays to Theater Young's 168-seat Green Box starting from March.\n\nTi Gong\n\nThe four plays \"Listen To Your Inner Ape,\" \"Le Trio en mi bémol,\" \"A Broken Suspense,\" and \"Her Last Six Eggs\" have been announced as the first batch of programs for the Green Box. Nearly 100 performances of the four plays have been scheduled through the rest of the year.\n\n\"Listen To Your Inner Ape\" will raise its curtain for a year-long showcase, with its first performance scheduled on March 30.\n\nThe monodrama is based on Franz Kafka's 1917 fiction \"A Report to an Academy,\" featuring actor Li Tengfei.\n\nIn the story, an ape named Red Peter, who has learned to behave like a human, presents to an academy the story of how he effected his transformation, and raises questions about humanity and freedom.\n\nTi Gong\n\nYoung director He Yufan's \"Le Trio en mi bémol\" is adapted from French director Éric Rohmer's theatrical comedy of the same name. In the play, Paul and Adèle were once lovers, but separated. The key of Mozart's E-flat might also be the key to their ambiguous relationship.\n\n\"A Broken Suspense\" is written and directed by actor Wang Zichuan. In the story, four actors put on a strike, forcing the director to change the script and complete the performance with the help of a volunteer.\n\nThe play premiered in 2012, and the latest version to be performed in Shanghai will star actor Jin Guangfa.\n\nTi Gong\n\n\"Her Last Six Eggs\" centers on women's fertility anxiety. It's inspired by the country's first case of a single woman freezing her eggs. The 35-year-old protagonist endures a series of trouble before reconciling with herself.\n\nTickets for the first round of 12 performances will be put on sale on Thursday. More performance schedules will be announced later.\n\nApart from the performances, Theater Young and DrumTower West Theater will join hands to organize performance-themed lectures and cultural salons for Shanghai audiences this year. The two parties also plan to produce more new drama works together in the future.\n\nTi Gong\n\nPerformance info\n\nListen To Your Inner Ape\n\nDates: March 30-April 2, 2pm/7:30pm\n\nLe Trio en mi bémol\n\nDates: April 20-23, 7:30pm\n\nA Broken Suspense\n\nDates: June 8-11, 2pm/7:30pm\n\nVenue: Theater Young\n\nAddress: 1155 Kongjiang Rd 控江路1155号"}], "Mark Fite studied film.": [{"url": "https://www.rottentomatoes.com/celebrity/mark_fite", "page_content": "Highest Rated: 25% Off the Lip (2004)\n\nLowest Rated: 25% Off the Lip (2004)\n\nBirthday: Not Available\n\nBirthplace: Not Available\n\nMark Fite was a vibrant source of comedy on the big screen, bringing laughter and joy to many audiences over the course of his Hollywood career. Fite worked on a variety of projects during his early entertainment career, including \"I'm Gonna Git You Sucka\" with Keenen Ivory Wayans (1988), the Will Smith and Bill Pullman blockbuster \"Independence Day\" (1996) and \"Living Single\" (Fox, 1992-98). He also contributed to \"Seinfeld\" (NBC, 1989-1998), \"The Fabulous Baker Boys\" (1989) and \"The Kennedy Assassinations: Coincidence or Conspiracy\" (1991-92). His film career continued throughout the nineties in productions like the Matthew Broderick box office smash action picture \"Godzilla\" (1998), the Billy Burke comedy \"Dill Scallion\" (1999) and \"Stuart Bliss\" (1999). He also appeared in the Edward Norton action flick \"Fight Club\" (1999). Most recently, Fite voiced characters in the Antonio Banderas hit children's sequel \"The SpongeBob Movie: Sponge Out of Water\" (2015)."}, {"url": "https://simple.wikipedia.org/wiki/Mark_Fite", "page_content": "Fite in 2012\n\nMark Elliott Fite is an American actor and comedian.\n\nFite is a founding member of comedy troupe 2 Headed Dog with comedians Jim Turner, Dave Allen and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits and Wife Swappers.\n\nHe has appeared in television series including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D., Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bone Show, Friends, Seinfeld and NewsRadio."}, {"url": "https://www.flickchart.com/Charts.aspx?actor=Mark+Fite", "page_content": "Build A Custom Chart\n\nFilter By Decade/Year 21st Century The 2020s The 2010s The 2000s The 1990s The 1980s The 1970s The 1960s The 1950s The 1940s The 1930s The 1920s The 1910s The 1900s The 1890s The 1880s --- 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906 1905 1904 1903 1902 1901 1900 1899 1898 1897 1896 1895 1894 1893 1892 1891 1890\n\nFilter By Genre 2010 Florida Film Festival 2010 SXSW Festival Absurd Comedy Action Action Comedy Action Thriller Actuality Film Addiction Drama Adventure Adventure Comedy Adventure Drama Alien Invasion Films Americana Animal Picture Animated Musical Animation Anime Anthology Film Anti-War Film Apocalyptic Film Australian New Wave Avant-garde / Experimental Based-on-18th-Century-Literature Based-on-19th-Century-Literature Based-on-20th-Century-Literature Based-on-21st-Century-Literature Based-on-a-True-Story Based-on-Comics Based-on-Manga Based-on-Shakespeare Based-on-Television Based-on-Theatre Beach Party Film Berlin School Biker Film Biography Biopic Black Comedy Blaxploitation Body Horror Bollywood British New Wave British Noir Buddy Film Cannibal Film Canuxploitation Caper Carsploitation Cartoon Chase Movie Childhood Drama City Symphony film Combat Films Comedy Comedy Drama Comedy of Errors Comedy of Manners Comedy Thriller Comedy Western Coming-of-Age Commedia all’italiana Con Artist / Hustler Concert Film Costume Adventure Costume Horror Costume Romance Courtroom Drama Crime Crime Comedy Crime Drama Crime Thriller Cross-Dressing / Gender-Bending Culture and Society Cyberpunk / Tech Noir Cyborg / Android / Robot Czechoslovak New Wave Dance Film Detective Film Direct-to-Stream Disaster Film Docudrama Documentary Dogme 95 Domestic Comedy Drama Dystopian Film Ensemble Film Epic Erotic Drama Erotic Thriller Escape Film Essay Film Exploitation Film Fairy Tales and Legends Family Family Drama Family-Oriented Adventure Family-Oriented Comedy Family-Oriented Drama Family-Oriented Fantasy Fantasy Fantasy Adventure Fantasy Comedy Farce Female-Directed Film Feminist Film Femme Fatale Film Noir Folk Horror Foreign Language Film Found Footage Film French Impressionist Film French New Wave Gangster Film Gay and Lesbian Film German Expressionist Film Ghost Film Giallo Girls-with-Guns Glamorized Spy Film Gothic Film Grey Area Gross-Out Comedy Haunted House Film Heaven-Can-Wait Fantasies Heavenly Comedy Heroic Bloodshed Historical Epic Historical Film History Hitman / Assassin Film Holiday Film Home Invasion Film Hong Kong New Wave Horror Horror Comedy Hybrid Western Hyperlink Film Iranian New Wave Italian Neorealism Japanese New Wave J-Horror Jidaigeki Jukebox Musical Jungle Film Juvenile Delinquency Film K-Horror Krimi Film Law and Crime Made-for-Television Magic Realism Marriage Drama Martial Arts Media Documentary Media Satire Medical Drama Melodrama Message Movie Military and War Military Comedy Mindbender Mini-Series Mockumentary Monster Film Mountain Film Mumblecore Music Musical Musical Comedy Musical Drama Musical Romance Mystery Natural Horror New French Extremism New German Cinema New Hollywood Newspaper Film Ninja Film Odd Couple Film Outlaw Ozploitation Paranoid Thriller Parody/Spoof Period Film Pink Eiga Police Comedy Police Detective Film Police Drama Polish Film School Political Drama Political Satire Political Thriller Politics and Government Poliziotteschi Post-Apocalyptic Film Post-Noir Pre-Code Hollywood Prehistoric Fantasy Prison Film Prostitution Film Psychological Drama Psychological Horror Psychological Sci-Fi Psychological Thriller Religious Comedy Religious Drama Religious Horror Reunion Films Revenge Film Revisionist Western Road Movie Rock Musical Romance Romanian New Wave Romantic Adventure Romantic Comedy Romantic Drama Romantic Epic Romantic Fantasy Romantic Mystery Rural Drama Sadistic Horror Samurai Film Satire Science Fiction Sci-Fi Action Sci-Fi Comedy Sci-Fi Disaster Film Sci-Fi Horror Screwball Comedy Sea Adventure Serial Serial Killer Film Sex Comedy Sex Horror Shark Film Shocksploitation Short Film Showbiz Comedy Showbiz Drama Silent Film Singing Cowboy Slapstick Slasher Film Slice of Life Slow Cinema Social History Social Issues Social Problem Film Sociology Softcore Sex Film Sophisticated Comedy Space Adventure Spaghetti Western Splatter Film Sports and Recreation Sports Comedy Sports Drama Spy Comedy Spy Film Stand-up Comedy Stoner Comedy Stop-Motion Superhero Film Supernatural Comedy Supernatural Drama Supernatural Horror Supernatural Thriller Surrealist Film Survival Film Swashbuckler Sword-and-Sandal Sword-and-Sorcery Teen Movie Thriller Time Travel Film Tokusatsu Traditional Western Tragi-comedy True Crime Unglamorized Spy Film Urban Comedy Urban Drama Vampire Film Video Game War War Adventure War Drama War Epic War Romance Werewolf Film Western Whodunit Witchcraft Women-in-Prison Workplace Comedy Wuxia Film Yakuza Film Yugoslav Black Wave Zombie Film\n\nFilter By Franchise 1,000 Noir Films: They Shot Dark Pictures, Didn't They? 1001 Movies You Must See Before You Die 2011 AFI Film Festival 2011 Fantastic Fest 2011 Florida Film Festival 2011 SXSW Festival 2012 AFI Film Festival 2012 Fantastic Fest 2012 SXSW Festival 2012 TCM Fest 20th Century Fox Cinema Classics Collection 20th Century Fox Marquee Musicals 3 Ninjas 84th Academy Awards Nominated 85th Academy Awards Nominated 86th Academy Awards Nominated 87th Academy Awards Nominated 88 Films 88th Academy Awards Nominated 89th Academy Awards Nominated A.V. Club's 50 Best Films of the 90s A.V. Club's The New Cult Canon A24 Films AACTA Award for Best Film Nominated AACTA Award for Best Film Winning AACTA International Award for Best Film Winning Abbott and Costello Academy Award Best Cinematography Nominated Academy Award Best Cinematography Winning Academy Award Best Foreign Language Film Nominated Academy Award Best Foreign Language Film Winning Academy Award Best Picture Nominated Academy Award Best Picture Winning Academy Award for Best Adapted Screenplay Winning Academy Award for Best Animated Feature Film Nominated Academy Award for Best Animated Feature Film Winning Academy Award for Best Animated Short Film Nominated Academy Award for Best Animated Short Film Winning Academy Award for Best Documentary Feature Nominated Academy Award for Best Documentary Feature Winning Academy Award for Best Original Screenplay Nominated Academy Award for Best Original Screenplay Winning Academy Award for Best Production Design Nominated Academy Award for Best Production Design Winning Academy Award for Best Short Film Winning Academy Award Nominated The Advocate's Top 175 Essential Films of All Time for LGBT Viewers AFI's 100 Years...100 Cheers AFI's 100 Years...100 Laughs AFI's 100 Years...100 Movies 10th Anniversary Edition AFI's 100 Years...100 Passions AFI's 100 Years...100 Thrills AFI's Greatest Movie Musicals After Dark Horrorfest Airport Alamo Drafthouse 100 Alice in Wonderland Alien Allan Quatermain Allied Artists Pictures Amanda Award for Best Norwegian Film Winning Amblin Entertainment American Film Theatre American International Pictures American Pie American Zoetrope Amicus Productions The Amityville Horror Anchor Bay Entertainment Andy Hardy AnimEigo Annapurna Pictures Annie Award for Best Animated Feature Nominated Annie Award for Best Animated Feature Winning Apatow Productions April Fool's Argos Films Arrow Films Arthaus Arthouse Films Artificial Eye ASA Film Åsa-Nisse Asterix The Asylum Austin Powers Babylon 5 Back to the Future The Bad News Bears Bad Robot Productions BAFTA Award for Best British Film Nominated BAFTA Award for Best British Film Winning BAFTA Award for Best Film Nominated BAFTA Award for Best Film Winning BAFTA Award for Best Foreign Language Film Nominated BAFTA Award for Best Foreign Language Film Winning A Band Apart Barbie Batman Battlestar Galactica BBC Films BBC's 100 Greatest American Films Belgian Film Critics Association Grand Prix Winning Betty Boop Beverly Hills Cop BFI Big Golden Arena for Best Film Winning Billion-Dollar Film Club Blade The Blair Witch Project Bleeding Skull's Best Trash-Horror Films of the 1980s Bloody Disgusting Selects Bloody Earth Films Blue Underground Blumhouse Productions Bodil Award for Best Danish Film Winning Bosko Boston Blackie Boston Society of Film Critics Award for Best Film Winning Boston Society of Film Critics Award for Best Foreign Language Film Winning The Bowery Boys Bratz Breaking Glass Pictures Bring it On British Lion Films Brooksfilms Buddy Bugs Bunny Bulldog Drummond Busan International Film Festival New Currents Award Winning Cahiers du cinéma: Top 10 Lists Camp Motion Pictures Canadian Screen Award for Best Picture Nominated Canadian Screen Award for Best Picture Winning Cannes Camera d’Or Winning Cannes Caméra d'Or Winning Cannes Grand Prix Cannes Grand Prix du Festival International du Film Cannes Jury Prize Cannes Palme d'Or Winning Cannes Prix du scénario Cannes Prix Un Certain Regard Cannon Films Captain America Carolco Pictures Carry On Castle Rock Entertainment César Award for Best Film Nominated César Award for Best Film Winning Channel Four Films Charles Dickens Charlie Brown Charlie Chan Cheech & Chong Chemical Burn Entertainment Chicago Film Critics Association Award for Best Film Winning Children of the Corn Child's Play The Chronicles of Narnia The Chronicles of Riddick Cinema 16 Cinema Epoch Cinema Eye's 25 Most Influential Documentaries The Cinema Guild The Cinemaholic's 100 Best Japanese Movies of All Time The Cinemaholic's 100 Best Movies of All Time CinemaScope Cinerama The Cisco Kid Cities of Love CJ Entertainment CMV-Laservision Code Red Coffin Joe Cohen Film Collection Complex's 100 Best Movies Of The Complex Decade Complex's 50 Indie Movies You Need to See Before You Die Complex's 50 Most Disturbing Movies Complex's 50 Worst Romantic Comedies Concorde Pictures Conjuring Universe The Criterion Collection Criterion Eclipse Critics' Choice Documentary Awards Winning Critics' Choice Movie Award for Best Documentary Feature Winning Critics' Choice Movie Award for Best Foreign Language Film Winning Critics' Choice Movie Award for Best Picture Winning Critters Crocodile Dundee Crown International Pictures Crystal Globe Grand Prix Award Winning Cult Epics Daffy Duck Danger After Dark Danielle Steel Dark Horse Comics Dark Shadows Dark Sky Films David di Donatello Award for Best Film Winning DC Comics DC Extended Universe De Laurentiis Entertainment Group Death Race Death Wish Detriot Film Critics Society Award for Best Film Winning Die Hard Dimension Extreme Dimension Films Dirty Harry Discotek Media Discworld Doctor Who Donald Duck Dr. Seuss Dracula Drafthouse Films Dragon Ball Dragon Dynasty DreamWorks Animation DreamWorks SKG Droopy Ealing Studios East Side Kids Edgar Allan Poe Edgar Wallace Elder's Best Film You've Never Seen Elder's Film That Changed My Life Elmer Fudd Elmore Leonard Embassy Pictures Empire Award for Best British Film Winning Empire Award for Best Comedy Winning Empire Award for Best Film Winning Empire Award for Best Horror Winning Empire Award for Best Sci-Fi/Fantasy Winning Empire Award for Best Thriller Winning Empire International Pictures Empire Magazine's 100 Best Films of World Cinema Empire Magazine's 50 Worst Movies Ever Ernest ESPN Films EuropaCorp European Film Award for Best Film Nominated European Film Award for Best Film Winning The Evil Dead The Exorcist The Eye Facets Video The Falcon Fangoria Films Fantastic Four Fantoma The Fast and the Furious Father of Four Fear Itself Female Convict Scorpion Film Comment Selects Film Movement Film Ventures International FilmDistrict Filmfare Award for Best Film Winning Final Destination First Run Features Flickchart Road Trip The Fly Focus Features Foghorn Leghorn Forbidden Hollywood Fox 2000 Pictures Fox Cinema Archives Fox Searchlight Pictures Frankenstein Free Willy French Syndicate of Cinema Critics Prix Léon Moussinac French Syndicate of Cinema Critics Prix Méliès Winning Friday The 13th Fu Manchu Full Moon Features G.I. Joe Gamera Gaumont Gdynia Film Festival Winning Genie Award for Best Motion Picture Nominated Genie Award for Best Motion Picture Winning German Film Award for Best Feature Film Winning Ghost House Pictures Ghost in the Shell Ghoulies Global Lens Collection The Godfather Godzilla Gold Hugo Winning Golden Bear for Best Film Winning Golden Calf for Best Feature Film Winning Golden Globe Award for Best Motion Picture Drama Winning Golden Globe Award for Best Motion Picture Musical or Comedy Winning Golden Globe Nominated Golden Harvest Golden Leopard Winning Golden Lion Winning Golden Raspberry Award for Worst Picture Golden Raspberry Award for Worst Picture Nominated Goofy Goya Award for Best European Film Winning Goya Award for Best Film Goya Award for Best Iberoamerican Film Winning Grand Prix des Amériques Winning The Green Hornet Green Lantern Grindhouse Releasing The Grudge Guldbagge Award for Best Swedish Film Nominated Guldbagge Award for Best Swedish Film Winning H.G. Wells H.P. Lovecraft The Hallmark Channel Halloween Hammer Film Productions Hannibal Lecter Happy Madison Productions Harry Palmer Harry Potter HBO Films Hellboy Hellraiser Hen's Tooth Video Herbie the Love Bug Hercules Highlander Hildegarde Withers The Hills Have Eyes The Hire The Hollywood Reporter's Hollywood's 100 Favorite Films Home Alone Hong Kong Category III Hong Kong Film Awards Best Film Winning Hong Kong Film Critics Society Award for Best Film winning Hornblower The Howling Hulk The Human Condition The Hunger Games Ice Age Icon Productions IFC Films IFC Midnight IFFR Tiger Award Winning Illumination Entertainment Ilsa IMAX Independent Spirit Award for Best Film Nominated Independent Spirit Award for Best Film Winning Independent Spirit Award for Best Foreign Film Nominated Independent Spirit Award for Best Foreign Film Winning Independent Spirit John Cassavetes Award Winning Indiana Jones Indiewire's 100 All-Time Greatest Films Directed by Women Indiewire's 100 Best Movies of the 2010s Inner Sanctum Mysteries The Invisible Man Ip Man Iron Man Jack Ryan Jackass James Bond Jason Bourne Jaws John le Carré Jolly Frolics Jönssonligan Jungle Jim Jurassic Park Kamen Rider The Karate Kid King Kong Kino International Kino Lorber Studio Classics Koch Lorber Korean Film Archive's Top 100 Korean Films L.A. Noire 'Golden Film Reels' Collection Lakeshore Entertainment The Land Before Time Laurel and Hardy Legendary Pictures LEGO Leonard Maltin’s 151 Best Movies You’ve Never Seen Leprechaun Lethal Weapon Lifetime Television Lionsgate Entertainment Lippert Pictures Little White Lies's 100 Great Movies By Female Directors Little Women Living Dead London Film Critics' Circle Award for Film of the Year London Film Critics' Circle British Film of the Year Winning London Film Critics' Circle Foreign Language Film of the Year Winning Lone Wolf and Cub Looney Tunes The Lord of the Rings Love, Death & Robots Lucasfilm Lucky Luke Lucky Stars Lupin III Lux Prize Nominated Lux Prize Winning Ma and Pa Kettle Mad Max Madagascar Madman Films Magnet Releasing The Magnificent Seven Magnolia Pictures Maisie Malibu Bay Films The Man from U.N.C.L.E. Martin Beck Marvel Cinematic Universe Marvel Comics Marvin the Martian Marx Brothers Masters of Cinema Masters of Horror The Matrix Meatballs Meet The Parents Menemsha Films Merchant Ivory Productions Merrie Melodies Merry Film MGM Classics Collection Michael Crichton Mickey Mouse Midnite Movies Millennium Millennium Films Miramax Films Mission: Impossible Mondo Macabro Monogram Pictures Monster High Monster Pictures Monty Python Moscow International Film Festival Top Prize Winning Mr. Moto MTV Films MTV Movie Award for Best Movie Nominated MTV Movie Award for Best Movie Winning The Mummy The Muppets Music Box Films Mya Communication Mystery Science Theater 3000 Mythica NAACP Image Award for Outstanding Motion Picture Winning The Naked Gun Naruto National Board of Review Award for Best Film Winning National Film Registry National Lampoon National Society of Film Critics Award for Best Film Winning Netflix Originals New Horizons Picture Corp New Line Cinema New World Pictures New York Film Critics Circle Award for Best Film Winning New York Film Critics Circle Award for Best Foreign Language Film Winning Night of the Demons A Nightmare on Elm Street Nikkatsu No Foolin' Nordic Council Film Prize Nominated Nordic Council Film Prize Winning Nordisk Film NoShame Films Odeon Entertainment Best of British Collection Olive Films The Olsen Gang The Omen Online Film Critics Society Award for Best Picture Winning Open Road Films Orion Pictures Oscilloscope OSS 117 Other Cinema Palisades Tartan Palm Pictures Paramount Vantage Paranormal Activity Paste Magazine's 100 Best “B Movies” of All Time Paste Magazine's 100 Best Documentaries of All Time Paste Magazine's 100 Best Film Noirs of All Time Paste Magazine's 100 Best Martial Arts Movies of All Time Paste Magazine's 100 Best Silent Films of All Time Paste Magazine's 40 Best Films from the Netherlands Pathfinder Pictures Pekka Puupää Pepé Le Pew Phantasm Philip K. Dick The Pink Panther Piranha Pirates of the Caribbean Pixar Animation Studios Planet of the Apes Platinum Dunes PM Entertainment Pokémon Police Academy Poltergeist Popeye Porky Pig Predator Private Snafu Prix Jean Vigo Prix Louis-Delluc Producers Guild of America Award for Best Theatrical Motion Picture Winning Producers Releasing Corporation Prom Night Psycho The Punisher Puppet Master Queer Palm Nominated Queer Palm Winning Quentin Tarantino's Cinematic Influences RadiusTWC Rambo The Rank Organisation Raro Video Ray Harryhausen REC Red Peony Gambler Redemption Films Regency Films Relativity Media Republic Pictures Resident Evil Retromedia Entertainment Retro-Seduction Cinema Revenge of the Nerds Revolution Studios The Ring RKO Pictures Road to... Roadside Attractions Robin Hood RoboCop Rocky Roger Ebert's Great Movies Roger Rabbit Rolling Thunder Pictures Rue Morgue's 200 Alternative Horror Films You Need To See Rush Hour Saga Studio The Saint Samuel Goldwyn Company San Diego Film Critics Society Award for Best Film Winning The Santa Clause Sartana Satellite Award for Best Documentary Film Winning Satellite Award for Best Film Nominated Satellite Award for Best Film Winning Satellite Award for Best Foreign Language Film Winning Saturday Night Live Saturn Award for Best Fantasy Film Winning Saturn Award for Best Horror or Thriller Film Nominated Saturn Award for Best Horror or Thriller Film Winning Saturn Award for Best International Film Nominated Saturn Award for Best International Film Winning Saturn Award for Best Science Fiction Film Nominated Saturn Award for Best Science Fiction Film Winning Saw Scanners Scary Movie Scooby-Doo Scorpion Releasing Scream Scream Factory Screamfest Best Picture Winning Screen Gems Second Run Seduction Cinema Seventh Art Severin Films Shadow Distribution Shaft Shameless Screen Entertainment Sharknado Sharpe Shaw Brothers Studios Sherlock Holmes Shôchiku Shock-O-Rama Shout! Factory Shrek Shriek Show SIFF Golden Space Needle Winning Sight & Sound's Greatest Films of All Time Poll Silent Night, Deadly Night Silly Symphonies Silver Bear Jury Grand Prix Winning The Skywalker Saga Slant Magazine's 100 Best Films of the 1990s Slant Magazine's 100 Essential Films Slant Magazine's 50 Essential LGBT Films Slant Magazine's 'Best of the Aughts' Sleepaway Camp Sleepy Eyes Of Death Something Weird Video Sony Martini Movies Sony Pictures Choice Collection Sony Pictures Classics Speedy Gonzales Spider-Man Spike Lee's Essential Film List Spy Kids Spyglass Entertainment Star Trek Star Wars Stargate The Stepfather Stephen King Stockholm International Film Festival Bronze Horse Winning Strand Releasing Stray Cat Rock Studio Ghibli StudioCanal Subspecies Subversive Cinema Summit Entertainment Sundance Film Festival Grand Jury Prize Documentary Winning Sundance Film Festival Grand Jury Prize Dramatic Winning Sundance Selects Sunn Classic Pictures Suomen Filmiteollisuus Superman The Sweeney Syfy Originals Sylvester the Cat Synapse Films Tales from the Crypt Talkartoons Tarzan Taz TCM Underground Teenage Mutant Ninja Turtles The Terminator The Texas Chainsaw Massacre They Shoot Pictures, Don't They? They Shoot Pictures, Don't They? Top 1000 of the 21st Century They Shoot Zombies, Don't They? Top 1000 Horror Movies The Thin Man THINKFilm Thor The Three Musketeers The Three Stooges TIFF Best Canadian Feature Film Winning Tigon British Film Productions Time Out: Hong Kong's 100 Greatest Hong Kong Films Time Out: London's 100 Best Bollywood Movies Time Out: London's 100 Best British Films Time Out: London's 100 Best Comedy Movies Time Out: London's 100 Best Horror Films Time Out: London's 100 Best Romantic Movies Time Out: London's 100 Best Sci-Fi Movies Time Out: London's 50 Greatest Monster Movies Time Out: London's 50 Greatest Westerns Time Out: New York's 100 Best Action Movies Time Out: New York's 100 Best Animated Movies Time Out: New York's 100 Best Movies of All Time Time Out: New York's 50 Best Foreign Films Time Out: New York's 50 Most Controversial Movies Time Out: Paris's 100 Best French Films Tintin Titanus TLA Releasing Todd-AO Toei Toho Tokyo Sakura Grand Prix Winning Tokyo Shock Tom and Jerry Torchy Blane Toronto Film Critics Association Award for Best Film Winning Toronto International Film Festival People's Choice Award Winning Touchstone Pictures The Toxic Avenger Toy Story Trancers Transformers Transilvania International Film Festival Winning Tremors Tribeca Film Tribeca Film Festival Best Documentary Feature Winning Tribeca Film Festival Best Narrative Feature Winning Trimark Pictures TriStar Pictures Troma Entertainment Troublemaker Studios Turner Classic Movies TWC-Dimension Tweety Bird The Twilight Saga Twilight Time Underworld Unearthed Films United Artists Universal International Pictures Universal Monsters Universal Soldier Universal Vault Series Unseen Cinema Uuno Turhapuro Val Lewton VCI Entertainment VeggieTales The Vengeance Trilogy Venice Film Festival Special Jury Prize Winning Vestron Pictures Video Nasties Village Roadshow Pictures Vinegar Syndrome VistaVision Wallander Walt Disney Animation Studios Walt Disney Cartoons Walt Disney Pictures Warner Archive Collection Warner Bros. Animation Warner Bros. Cartoons Warner Bros.-Seven Arts Washington D.C. Area Film Critics Association Award for Best Film Winning Washington D.C. Area Film Critics Association Award for Best Foreign Language Film Winning The Weinstein Company Well Go USA The Whistler Wild Bunch Wild East Productions WildEye Releasing Wile E. Coyote and Road Runner Winnetou Winnie the Pooh Witchcraft The Wizard of Oz Wizard World Louisville 2014 Wolf Man Working Title Films Writers Guild of America's 101 Funniest Screenplays Writers Guild of America's 101 Greatest Screenplays Wrong Turn WWE Studios X-Men Yosemite Sam Zatoichi Zeitgeist Films Zentropa Entertainments Zorro\n\nSort by: Ranking Sort by: Newest Added To Site Sort by: Newest Added By User Sort by: Release Date\n\nHere are a few examples of ways\n\nyou can filter the charts:"}, {"url": "https://www.filmtronic.com/reviews/name/mark-fite", "page_content": "This series describes the cases and agents of the Strategic Homeland...\n\nThis series describes the cases and agents of the Strategic Homeland Intervention, Enforcement and Logistics Division. Cast: Clark Gregg as Phil...\n\nThis series describes the life of the members of the Braverman family....\n\nThis series describes the life of the members of the Braverman family. Cast: Peter Krause as Adam Braverman 103 episodes 2010-2015, Lauren Graha...\n\nThis series is about two couples and their single friend. These people have...\n\nThis series is about two couples and their single friend. These people have relationships at different stages in life. They experience the fun and...\n\n7.5 This drama series is the lives (personal and professional) of five surgical... greys-anatomy\n\nGreys Anatomy Drama | Romance\n\nThis drama series is the lives (personal and professional) of five surgical interns. It also details the lives of their supervisors. Cast: Ellen...\n\n...go to review\n\nThis drama series is the lives (personal and professional) of five surgical interns. It also details the lives of their supervisors. Cast: Ellen...\n\n7.9 This series describes the cases of the FBI Behavioral Analysis Unit (BAU).... criminal-minds\n\nCriminal Minds Crime | Drama\n\nThis series describes the cases of the FBI Behavioral Analysis Unit (BAU). This is an advanced group of 'profilers' who analyze the nation's most...\n\n...go to review\n\nThis series describes the cases of the FBI Behavioral Analysis Unit (BAU). This is an advanced group of 'profilers' who analyze the nation's most...\n\n7.5 This series describes the intriguing cases of the Naval Criminal... ncis\n\nNcis Action | Crime | Drama\n\nThis series describes the intriguing cases of the Naval Criminal Investigative Service in Washington, D.C. The response team is led by special age...\n\n...go to review\n\nThis series describes the intriguing cases of the Naval Criminal Investigative Service in Washington, D.C. The response team is led by special age...\n\n8.3 This series is about the adventures of a talking sea sponge. He works at a... spongebob-squarepants\n\nSpongebob Squarepants Animation | Comedy\n\nThis series is about the adventures of a talking sea sponge. He works at a fast food restaurant. He also attends a boating school. He lives in a p...\n\n...go to review\n\nThis series is about the adventures of a talking sea sponge. He works at a fast food restaurant. He also attends a boating school. He lives in a p...\n\n6.8 This series is about a sixteen-year-old high school student that finds out... sabrina-the-teenage-witch\n\nSabrina The Teenage Witch Comedy\n\nThis series is about a sixteen-year-old high school student that finds out she's a witch. Her two aunts are also witches and they help her to cont...\n\n...go to review\n\nThis series is about a sixteen-year-old high school student that finds out she's a witch. Her two aunts are also witches and they help her to cont...\n\n7.5 This series is a office sitcom. It explores office politics and the... newsradio\n\nNewsradio Comedy | Romance\n\nThis series is a office sitcom. It explores office politics and the relationships between the staff of 'WNYX NewsRadio' station. It is set in New...\n\n...go to review\n\nThis series is a office sitcom. It explores office politics and the relationships between the staff of 'WNYX NewsRadio' station. It is set in New...\n\n6.2 This series follows the life and times of six twenty to thirty-somethings.... friends\n\nFriends Comedy\n\nThis series follows the life and times of six twenty to thirty-somethings. These friends live in Manhattan. Cast: Jennifer Aniston as Rachel Gre...\n\n...go to review\n\nThis series follows the life and times of six twenty to thirty-somethings. These friends live in Manhattan. Cast: Jennifer Aniston as Rachel Gre...\n\n9.2 The adventures of a neurotic New York City Stand-up Comedian Jerry Seinfeld... seinfeld"}, {"url": "https://www.imdb.com/filmosearch/?page=2&role=nm0280051&sort=moviemeter,asc", "page_content": "13+ | 22 min | Comedy, Romance\n\n8.5 Rate this 1 2 3 4 5 6 7 8 9 10 8.5 / 10 X\n\nJoey has a dream about Monica and becomes convinced he is in love with her. Meanwhile, Phoebe finds a police badge in Central Perk, and Ross tries to get his new sofa into his apartment.\n\nDirector: Andrew Tsao | Stars: Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc\n\nVotes: 4,824"}, {"url": "https://www.flickchart.com/Charts.aspx?actor=Mark+Fite&decade=2000", "page_content": "Build A Custom Chart\n\nFilter By Decade/Year 21st Century The 2020s The 2010s The 2000s The 1990s The 1980s The 1970s The 1960s The 1950s The 1940s The 1930s The 1920s The 1910s The 1900s The 1890s The 1880s --- 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906 1905 1904 1903 1902 1901 1900 1899 1898 1897 1896 1895 1894 1893 1892 1891 1890\n\nFilter By Genre 2010 Florida Film Festival 2010 SXSW Festival Absurd Comedy Action Action Comedy Action Thriller Actuality Film Addiction Drama Adventure Adventure Comedy Adventure Drama Alien Invasion Films Americana Animal Picture Animated Musical Animation Anime Anthology Film Anti-War Film Apocalyptic Film Australian New Wave Avant-garde / Experimental Based-on-18th-Century-Literature Based-on-19th-Century-Literature Based-on-20th-Century-Literature Based-on-21st-Century-Literature Based-on-a-True-Story Based-on-Comics Based-on-Manga Based-on-Shakespeare Based-on-Television Based-on-Theatre Beach Party Film Berlin School Biker Film Biography Biopic Black Comedy Blaxploitation Body Horror Bollywood British New Wave British Noir Buddy Film Cannibal Film Canuxploitation Caper Carsploitation Cartoon Chase Movie Childhood Drama City Symphony film Combat Films Comedy Comedy Drama Comedy of Errors Comedy of Manners Comedy Thriller Comedy Western Coming-of-Age Commedia all’italiana Con Artist / Hustler Concert Film Costume Adventure Costume Horror Costume Romance Courtroom Drama Crime Crime Comedy Crime Drama Crime Thriller Cross-Dressing / Gender-Bending Culture and Society Cyberpunk / Tech Noir Cyborg / Android / Robot Czechoslovak New Wave Dance Film Detective Film Direct-to-Stream Disaster Film Docudrama Documentary Dogme 95 Domestic Comedy Drama Dystopian Film Ensemble Film Epic Erotic Drama Erotic Thriller Escape Film Essay Film Exploitation Film Fairy Tales and Legends Family Family Drama Family-Oriented Adventure Family-Oriented Comedy Family-Oriented Drama Family-Oriented Fantasy Fantasy Fantasy Adventure Fantasy Comedy Farce Female-Directed Film Feminist Film Femme Fatale Film Noir Folk Horror Foreign Language Film Found Footage Film French Impressionist Film French New Wave Gangster Film Gay and Lesbian Film German Expressionist Film Ghost Film Giallo Girls-with-Guns Glamorized Spy Film Gothic Film Grey Area Gross-Out Comedy Haunted House Film Heaven-Can-Wait Fantasies Heavenly Comedy Heroic Bloodshed Historical Epic Historical Film History Hitman / Assassin Film Holiday Film Home Invasion Film Hong Kong New Wave Horror Horror Comedy Hybrid Western Hyperlink Film Iranian New Wave Italian Neorealism Japanese New Wave J-Horror Jidaigeki Jukebox Musical Jungle Film Juvenile Delinquency Film K-Horror Krimi Film Law and Crime Made-for-Television Magic Realism Marriage Drama Martial Arts Media Documentary Media Satire Medical Drama Melodrama Message Movie Military and War Military Comedy Mindbender Mini-Series Mockumentary Monster Film Mountain Film Mumblecore Music Musical Musical Comedy Musical Drama Musical Romance Mystery Natural Horror New French Extremism New German Cinema New Hollywood Newspaper Film Ninja Film Odd Couple Film Outlaw Ozploitation Paranoid Thriller Parody/Spoof Period Film Pink Eiga Police Comedy Police Detective Film Police Drama Polish Film School Political Drama Political Satire Political Thriller Politics and Government Poliziotteschi Post-Apocalyptic Film Post-Noir Pre-Code Hollywood Prehistoric Fantasy Prison Film Prostitution Film Psychological Drama Psychological Horror Psychological Sci-Fi Psychological Thriller Religious Comedy Religious Drama Religious Horror Reunion Films Revenge Film Revisionist Western Road Movie Rock Musical Romance Romanian New Wave Romantic Adventure Romantic Comedy Romantic Drama Romantic Epic Romantic Fantasy Romantic Mystery Rural Drama Sadistic Horror Samurai Film Satire Science Fiction Sci-Fi Action Sci-Fi Comedy Sci-Fi Disaster Film Sci-Fi Horror Screwball Comedy Sea Adventure Serial Serial Killer Film Sex Comedy Sex Horror Shark Film Shocksploitation Short Film Showbiz Comedy Showbiz Drama Silent Film Singing Cowboy Slapstick Slasher Film Slice of Life Slow Cinema Social History Social Issues Social Problem Film Sociology Softcore Sex Film Sophisticated Comedy Space Adventure Spaghetti Western Splatter Film Sports and Recreation Sports Comedy Sports Drama Spy Comedy Spy Film Stand-up Comedy Stoner Comedy Stop-Motion Superhero Film Supernatural Comedy Supernatural Drama Supernatural Horror Supernatural Thriller Surrealist Film Survival Film Swashbuckler Sword-and-Sandal Sword-and-Sorcery Teen Movie Thriller Time Travel Film Tokusatsu Traditional Western Tragi-comedy True Crime Unglamorized Spy Film Urban Comedy Urban Drama Vampire Film Video Game War War Adventure War Drama War Epic War Romance Werewolf Film Western Whodunit Witchcraft Women-in-Prison Workplace Comedy Wuxia Film Yakuza Film Yugoslav Black Wave Zombie Film\n\nFilter By Franchise 1,000 Noir Films: They Shot Dark Pictures, Didn't They? 1001 Movies You Must See Before You Die 2011 AFI Film Festival 2011 Fantastic Fest 2011 Florida Film Festival 2011 SXSW Festival 2012 AFI Film Festival 2012 Fantastic Fest 2012 SXSW Festival 2012 TCM Fest 20th Century Fox Cinema Classics Collection 20th Century Fox Marquee Musicals 3 Ninjas 84th Academy Awards Nominated 85th Academy Awards Nominated 86th Academy Awards Nominated 87th Academy Awards Nominated 88 Films 88th Academy Awards Nominated 89th Academy Awards Nominated A.V. Club's 50 Best Films of the 90s A.V. Club's The New Cult Canon A24 Films AACTA Award for Best Film Nominated AACTA Award for Best Film Winning AACTA International Award for Best Film Winning Abbott and Costello Academy Award Best Cinematography Nominated Academy Award Best Cinematography Winning Academy Award Best Foreign Language Film Nominated Academy Award Best Foreign Language Film Winning Academy Award Best Picture Nominated Academy Award Best Picture Winning Academy Award for Best Adapted Screenplay Winning Academy Award for Best Animated Feature Film Nominated Academy Award for Best Animated Feature Film Winning Academy Award for Best Animated Short Film Nominated Academy Award for Best Animated Short Film Winning Academy Award for Best Documentary Feature Nominated Academy Award for Best Documentary Feature Winning Academy Award for Best Original Screenplay Nominated Academy Award for Best Original Screenplay Winning Academy Award for Best Production Design Nominated Academy Award for Best Production Design Winning Academy Award for Best Short Film Winning Academy Award Nominated The Advocate's Top 175 Essential Films of All Time for LGBT Viewers AFI's 100 Years...100 Cheers AFI's 100 Years...100 Laughs AFI's 100 Years...100 Movies 10th Anniversary Edition AFI's 100 Years...100 Passions AFI's 100 Years...100 Thrills AFI's Greatest Movie Musicals After Dark Horrorfest Airport Alamo Drafthouse 100 Alice in Wonderland Alien Allan Quatermain Allied Artists Pictures Amanda Award for Best Norwegian Film Winning Amblin Entertainment American Film Theatre American International Pictures American Pie American Zoetrope Amicus Productions The Amityville Horror Anchor Bay Entertainment Andy Hardy AnimEigo Annapurna Pictures Annie Award for Best Animated Feature Nominated Annie Award for Best Animated Feature Winning Apatow Productions April Fool's Argos Films Arrow Films Arthaus Arthouse Films Artificial Eye ASA Film Åsa-Nisse Asterix The Asylum Austin Powers Babylon 5 Back to the Future The Bad News Bears Bad Robot Productions BAFTA Award for Best British Film Nominated BAFTA Award for Best British Film Winning BAFTA Award for Best Film Nominated BAFTA Award for Best Film Winning BAFTA Award for Best Foreign Language Film Nominated BAFTA Award for Best Foreign Language Film Winning A Band Apart Barbie Batman Battlestar Galactica BBC Films BBC's 100 Greatest American Films Belgian Film Critics Association Grand Prix Winning Betty Boop Beverly Hills Cop BFI Big Golden Arena for Best Film Winning Billion-Dollar Film Club Blade The Blair Witch Project Bleeding Skull's Best Trash-Horror Films of the 1980s Bloody Disgusting Selects Bloody Earth Films Blue Underground Blumhouse Productions Bodil Award for Best Danish Film Winning Bosko Boston Blackie Boston Society of Film Critics Award for Best Film Winning Boston Society of Film Critics Award for Best Foreign Language Film Winning The Bowery Boys Bratz Breaking Glass Pictures Bring it On British Lion Films Brooksfilms Buddy Bugs Bunny Bulldog Drummond Busan International Film Festival New Currents Award Winning Cahiers du cinéma: Top 10 Lists Camp Motion Pictures Canadian Screen Award for Best Picture Nominated Canadian Screen Award for Best Picture Winning Cannes Camera d’Or Winning Cannes Caméra d'Or Winning Cannes Grand Prix Cannes Grand Prix du Festival International du Film Cannes Jury Prize Cannes Palme d'Or Winning Cannes Prix du scénario Cannes Prix Un Certain Regard Cannon Films Captain America Carolco Pictures Carry On Castle Rock Entertainment César Award for Best Film Nominated César Award for Best Film Winning Channel Four Films Charles Dickens Charlie Brown Charlie Chan Cheech & Chong Chemical Burn Entertainment Chicago Film Critics Association Award for Best Film Winning Children of the Corn Child's Play The Chronicles of Narnia The Chronicles of Riddick Cinema 16 Cinema Epoch Cinema Eye's 25 Most Influential Documentaries The Cinema Guild The Cinemaholic's 100 Best Japanese Movies of All Time The Cinemaholic's 100 Best Movies of All Time CinemaScope Cinerama The Cisco Kid Cities of Love CJ Entertainment CMV-Laservision Code Red Coffin Joe Cohen Film Collection Complex's 100 Best Movies Of The Complex Decade Complex's 50 Indie Movies You Need to See Before You Die Complex's 50 Most Disturbing Movies Complex's 50 Worst Romantic Comedies Concorde Pictures Conjuring Universe The Criterion Collection Criterion Eclipse Critics' Choice Documentary Awards Winning Critics' Choice Movie Award for Best Documentary Feature Winning Critics' Choice Movie Award for Best Foreign Language Film Winning Critics' Choice Movie Award for Best Picture Winning Critters Crocodile Dundee Crown International Pictures Crystal Globe Grand Prix Award Winning Cult Epics Daffy Duck Danger After Dark Danielle Steel Dark Horse Comics Dark Shadows Dark Sky Films David di Donatello Award for Best Film Winning DC Comics DC Extended Universe De Laurentiis Entertainment Group Death Race Death Wish Detriot Film Critics Society Award for Best Film Winning Die Hard Dimension Extreme Dimension Films Dirty Harry Discotek Media Discworld Doctor Who Donald Duck Dr. Seuss Dracula Drafthouse Films Dragon Ball Dragon Dynasty DreamWorks Animation DreamWorks SKG Droopy Ealing Studios East Side Kids Edgar Allan Poe Edgar Wallace Elder's Best Film You've Never Seen Elder's Film That Changed My Life Elmer Fudd Elmore Leonard Embassy Pictures Empire Award for Best British Film Winning Empire Award for Best Comedy Winning Empire Award for Best Film Winning Empire Award for Best Horror Winning Empire Award for Best Sci-Fi/Fantasy Winning Empire Award for Best Thriller Winning Empire International Pictures Empire Magazine's 100 Best Films of World Cinema Empire Magazine's 50 Worst Movies Ever Ernest ESPN Films EuropaCorp European Film Award for Best Film Nominated European Film Award for Best Film Winning The Evil Dead The Exorcist The Eye Facets Video The Falcon Fangoria Films Fantastic Four Fantoma The Fast and the Furious Father of Four Fear Itself Female Convict Scorpion Film Comment Selects Film Movement Film Ventures International FilmDistrict Filmfare Award for Best Film Winning Final Destination First Run Features Flickchart Road Trip The Fly Focus Features Foghorn Leghorn Forbidden Hollywood Fox 2000 Pictures Fox Cinema Archives Fox Searchlight Pictures Frankenstein Free Willy French Syndicate of Cinema Critics Prix Léon Moussinac French Syndicate of Cinema Critics Prix Méliès Winning Friday The 13th Fu Manchu Full Moon Features G.I. Joe Gamera Gaumont Gdynia Film Festival Winning Genie Award for Best Motion Picture Nominated Genie Award for Best Motion Picture Winning German Film Award for Best Feature Film Winning Ghost House Pictures Ghost in the Shell Ghoulies Global Lens Collection The Godfather Godzilla Gold Hugo Winning Golden Bear for Best Film Winning Golden Calf for Best Feature Film Winning Golden Globe Award for Best Motion Picture Drama Winning Golden Globe Award for Best Motion Picture Musical or Comedy Winning Golden Globe Nominated Golden Harvest Golden Leopard Winning Golden Lion Winning Golden Raspberry Award for Worst Picture Golden Raspberry Award for Worst Picture Nominated Goofy Goya Award for Best European Film Winning Goya Award for Best Film Goya Award for Best Iberoamerican Film Winning Grand Prix des Amériques Winning The Green Hornet Green Lantern Grindhouse Releasing The Grudge Guldbagge Award for Best Swedish Film Nominated Guldbagge Award for Best Swedish Film Winning H.G. Wells H.P. Lovecraft The Hallmark Channel Halloween Hammer Film Productions Hannibal Lecter Happy Madison Productions Harry Palmer Harry Potter HBO Films Hellboy Hellraiser Hen's Tooth Video Herbie the Love Bug Hercules Highlander Hildegarde Withers The Hills Have Eyes The Hire The Hollywood Reporter's Hollywood's 100 Favorite Films Home Alone Hong Kong Category III Hong Kong Film Awards Best Film Winning Hong Kong Film Critics Society Award for Best Film winning Hornblower The Howling Hulk The Human Condition The Hunger Games Ice Age Icon Productions IFC Films IFC Midnight IFFR Tiger Award Winning Illumination Entertainment Ilsa IMAX Independent Spirit Award for Best Film Nominated Independent Spirit Award for Best Film Winning Independent Spirit Award for Best Foreign Film Nominated Independent Spirit Award for Best Foreign Film Winning Independent Spirit John Cassavetes Award Winning Indiana Jones Indiewire's 100 All-Time Greatest Films Directed by Women Indiewire's 100 Best Movies of the 2010s Inner Sanctum Mysteries The Invisible Man Ip Man Iron Man Jack Ryan Jackass James Bond Jason Bourne Jaws John le Carré Jolly Frolics Jönssonligan Jungle Jim Jurassic Park Kamen Rider The Karate Kid King Kong Kino International Kino Lorber Studio Classics Koch Lorber Korean Film Archive's Top 100 Korean Films L.A. Noire 'Golden Film Reels' Collection Lakeshore Entertainment The Land Before Time Laurel and Hardy Legendary Pictures LEGO Leonard Maltin’s 151 Best Movies You’ve Never Seen Leprechaun Lethal Weapon Lifetime Television Lionsgate Entertainment Lippert Pictures Little White Lies's 100 Great Movies By Female Directors Little Women Living Dead London Film Critics' Circle Award for Film of the Year London Film Critics' Circle British Film of the Year Winning London Film Critics' Circle Foreign Language Film of the Year Winning Lone Wolf and Cub Looney Tunes The Lord of the Rings Love, Death & Robots Lucasfilm Lucky Luke Lucky Stars Lupin III Lux Prize Nominated Lux Prize Winning Ma and Pa Kettle Mad Max Madagascar Madman Films Magnet Releasing The Magnificent Seven Magnolia Pictures Maisie Malibu Bay Films The Man from U.N.C.L.E. Martin Beck Marvel Cinematic Universe Marvel Comics Marvin the Martian Marx Brothers Masters of Cinema Masters of Horror The Matrix Meatballs Meet The Parents Menemsha Films Merchant Ivory Productions Merrie Melodies Merry Film MGM Classics Collection Michael Crichton Mickey Mouse Midnite Movies Millennium Millennium Films Miramax Films Mission: Impossible Mondo Macabro Monogram Pictures Monster High Monster Pictures Monty Python Moscow International Film Festival Top Prize Winning Mr. Moto MTV Films MTV Movie Award for Best Movie Nominated MTV Movie Award for Best Movie Winning The Mummy The Muppets Music Box Films Mya Communication Mystery Science Theater 3000 Mythica NAACP Image Award for Outstanding Motion Picture Winning The Naked Gun Naruto National Board of Review Award for Best Film Winning National Film Registry National Lampoon National Society of Film Critics Award for Best Film Winning Netflix Originals New Horizons Picture Corp New Line Cinema New World Pictures New York Film Critics Circle Award for Best Film Winning New York Film Critics Circle Award for Best Foreign Language Film Winning Night of the Demons A Nightmare on Elm Street Nikkatsu No Foolin' Nordic Council Film Prize Nominated Nordic Council Film Prize Winning Nordisk Film NoShame Films Odeon Entertainment Best of British Collection Olive Films The Olsen Gang The Omen Online Film Critics Society Award for Best Picture Winning Open Road Films Orion Pictures Oscilloscope OSS 117 Other Cinema Palisades Tartan Palm Pictures Paramount Vantage Paranormal Activity Paste Magazine's 100 Best “B Movies” of All Time Paste Magazine's 100 Best Documentaries of All Time Paste Magazine's 100 Best Film Noirs of All Time Paste Magazine's 100 Best Martial Arts Movies of All Time Paste Magazine's 100 Best Silent Films of All Time Paste Magazine's 40 Best Films from the Netherlands Pathfinder Pictures Pekka Puupää Pepé Le Pew Phantasm Philip K. Dick The Pink Panther Piranha Pirates of the Caribbean Pixar Animation Studios Planet of the Apes Platinum Dunes PM Entertainment Pokémon Police Academy Poltergeist Popeye Porky Pig Predator Private Snafu Prix Jean Vigo Prix Louis-Delluc Producers Guild of America Award for Best Theatrical Motion Picture Winning Producers Releasing Corporation Prom Night Psycho The Punisher Puppet Master Queer Palm Nominated Queer Palm Winning Quentin Tarantino's Cinematic Influences RadiusTWC Rambo The Rank Organisation Raro Video Ray Harryhausen REC Red Peony Gambler Redemption Films Regency Films Relativity Media Republic Pictures Resident Evil Retromedia Entertainment Retro-Seduction Cinema Revenge of the Nerds Revolution Studios The Ring RKO Pictures Road to... Roadside Attractions Robin Hood RoboCop Rocky Roger Ebert's Great Movies Roger Rabbit Rolling Thunder Pictures Rue Morgue's 200 Alternative Horror Films You Need To See Rush Hour Saga Studio The Saint Samuel Goldwyn Company San Diego Film Critics Society Award for Best Film Winning The Santa Clause Sartana Satellite Award for Best Documentary Film Winning Satellite Award for Best Film Nominated Satellite Award for Best Film Winning Satellite Award for Best Foreign Language Film Winning Saturday Night Live Saturn Award for Best Fantasy Film Winning Saturn Award for Best Horror or Thriller Film Nominated Saturn Award for Best Horror or Thriller Film Winning Saturn Award for Best International Film Nominated Saturn Award for Best International Film Winning Saturn Award for Best Science Fiction Film Nominated Saturn Award for Best Science Fiction Film Winning Saw Scanners Scary Movie Scooby-Doo Scorpion Releasing Scream Scream Factory Screamfest Best Picture Winning Screen Gems Second Run Seduction Cinema Seventh Art Severin Films Shadow Distribution Shaft Shameless Screen Entertainment Sharknado Sharpe Shaw Brothers Studios Sherlock Holmes Shôchiku Shock-O-Rama Shout! Factory Shrek Shriek Show SIFF Golden Space Needle Winning Sight & Sound's Greatest Films of All Time Poll Silent Night, Deadly Night Silly Symphonies Silver Bear Jury Grand Prix Winning The Skywalker Saga Slant Magazine's 100 Best Films of the 1990s Slant Magazine's 100 Essential Films Slant Magazine's 50 Essential LGBT Films Slant Magazine's 'Best of the Aughts' Sleepaway Camp Sleepy Eyes Of Death Something Weird Video Sony Martini Movies Sony Pictures Choice Collection Sony Pictures Classics Speedy Gonzales Spider-Man Spike Lee's Essential Film List Spy Kids Spyglass Entertainment Star Trek Star Wars Stargate The Stepfather Stephen King Stockholm International Film Festival Bronze Horse Winning Strand Releasing Stray Cat Rock Studio Ghibli StudioCanal Subspecies Subversive Cinema Summit Entertainment Sundance Film Festival Grand Jury Prize Documentary Winning Sundance Film Festival Grand Jury Prize Dramatic Winning Sundance Selects Sunn Classic Pictures Suomen Filmiteollisuus Superman The Sweeney Syfy Originals Sylvester the Cat Synapse Films Tales from the Crypt Talkartoons Tarzan Taz TCM Underground Teenage Mutant Ninja Turtles The Terminator The Texas Chainsaw Massacre They Shoot Pictures, Don't They? They Shoot Pictures, Don't They? Top 1000 of the 21st Century They Shoot Zombies, Don't They? Top 1000 Horror Movies The Thin Man THINKFilm Thor The Three Musketeers The Three Stooges TIFF Best Canadian Feature Film Winning Tigon British Film Productions Time Out: Hong Kong's 100 Greatest Hong Kong Films Time Out: London's 100 Best Bollywood Movies Time Out: London's 100 Best British Films Time Out: London's 100 Best Comedy Movies Time Out: London's 100 Best Horror Films Time Out: London's 100 Best Romantic Movies Time Out: London's 100 Best Sci-Fi Movies Time Out: London's 50 Greatest Monster Movies Time Out: London's 50 Greatest Westerns Time Out: New York's 100 Best Action Movies Time Out: New York's 100 Best Animated Movies Time Out: New York's 100 Best Movies of All Time Time Out: New York's 50 Best Foreign Films Time Out: New York's 50 Most Controversial Movies Time Out: Paris's 100 Best French Films Tintin Titanus TLA Releasing Todd-AO Toei Toho Tokyo Sakura Grand Prix Winning Tokyo Shock Tom and Jerry Torchy Blane Toronto Film Critics Association Award for Best Film Winning Toronto International Film Festival People's Choice Award Winning Touchstone Pictures The Toxic Avenger Toy Story Trancers Transformers Transilvania International Film Festival Winning Tremors Tribeca Film Tribeca Film Festival Best Documentary Feature Winning Tribeca Film Festival Best Narrative Feature Winning Trimark Pictures TriStar Pictures Troma Entertainment Troublemaker Studios Turner Classic Movies TWC-Dimension Tweety Bird The Twilight Saga Twilight Time Underworld Unearthed Films United Artists Universal International Pictures Universal Monsters Universal Soldier Universal Vault Series Unseen Cinema Uuno Turhapuro Val Lewton VCI Entertainment VeggieTales The Vengeance Trilogy Venice Film Festival Special Jury Prize Winning Vestron Pictures Video Nasties Village Roadshow Pictures Vinegar Syndrome VistaVision Wallander Walt Disney Animation Studios Walt Disney Cartoons Walt Disney Pictures Warner Archive Collection Warner Bros. Animation Warner Bros. Cartoons Warner Bros.-Seven Arts Washington D.C. Area Film Critics Association Award for Best Film Winning Washington D.C. Area Film Critics Association Award for Best Foreign Language Film Winning The Weinstein Company Well Go USA The Whistler Wild Bunch Wild East Productions WildEye Releasing Wile E. Coyote and Road Runner Winnetou Winnie the Pooh Witchcraft The Wizard of Oz Wizard World Louisville 2014 Wolf Man Working Title Films Writers Guild of America's 101 Funniest Screenplays Writers Guild of America's 101 Greatest Screenplays Wrong Turn WWE Studios X-Men Yosemite Sam Zatoichi Zeitgeist Films Zentropa Entertainments Zorro\n\nSort by: Ranking Sort by: Newest Added To Site Sort by: Newest Added By User Sort by: Release Date\n\nHere are a few examples of ways\n\nyou can filter the charts:"}, {"url": "https://www.moviemeter.com/movies/top-5-best-movies-starring-mark-fite", "page_content": "Top 5 best movies with Mark Fite\n\nBased on MovieMeter ratings, these are the 5 best movies with Mark Fite\n\nAre you looking for a good movie starring Mark Fite? This is a list of the best 5 movies with actor Mark Fite and highly rated on MovieMeter.\n\n\n\nClick on a title of a movie to find more information about movie."}, {"url": "https://www.learningwoodstockartcolony.com/post/a-profile-of-the-life-and-art-of-visionary-sculptor-harvey-fite-of-opus-40", "page_content": "By Bruce Weber\n\nHarvey Fite Working on Quarry Family,\n\nWith Original Placement of Flame, Prayer and Quarry Family,\n\nc. 1945-1950\n\nOpus 40\n\nSt. Stephen’s College,\n\nAnnandale-on-Hudson, n.d.\n\n\n\n\n\nVisionary sculptor Harvey Fite, creator of the pioneering earthwork Opus 40, on the grounds of a former commercial bluestone quarry in the High Woods section of Saugerties, New York, was born on Christmas day in 1903 in Pittsburgh, Pennsylvania.(1) His family moved to Brunner, Texas when he was an infant, and soon after his father Thomas acquired a farm in nearby Victoria. After completing high school in Houston, Fite attended Houston Law School from 1923-1926, but decided to abandon law and join the ministry. He enrolled at St. Stephen’s College in Annandale-on-Hudson, New York through a scholarship secured for him by his bishop; the institution was devoted to preparing young men for the Episcopal ministry. In addition to the scholarship, he also earned his way through college by doing carpentry and manual work while studying in the classics program.\n\nMaverick Theatre Program\n\nWith Image of the Interior, 1936\n\nWoodstock Public Library District\n\nMatinee Performance\n\nof Jitney Players, n.d.\n\nBilly Rose Theatre Division,\n\nNew York Public Library\n\n\n\n\n\nIn the spring of 1929, Fite discovered a notice on the school bulletin board announcing the summer season of the Maverick Theatre Company. Aspiring now to a career as an actor he joined the company and moved into a cabin at the Maverick art colony across the Hudson River in West Hurley, New York, a short distance from Woodstock. At the end of the summer season he joined a stock company, known as the Jitney Players, that performed restoration plays, including Shakespeare. This was followed by a period as an actor at the Bulgarov Russian Theatre in New York City. During rehearsals and breaks in the performance, Fite began to occupy his time by whittling discarded seamstresseis’ spools and other bits of wood that he found backstage, and discovered whittling to be a source of pleasure and creativity.\n\nWoodstock School of Painting,\n\nWith Instructor Listing, 1931\n\nClassroom Barns of\n\nJudson Smith Property,\n\nOhayo Mountain Road, Woodstock\n\n\n\n\n\nFrom 1931-1933, Fite lived in Princeton, New Jersey in a barn on the farm of Louis Corti, one of his former professors at St. Stephens. He worked at a variety of odd jobs, and developed a serious interest in carving. In 1933 Fite returned to upstate New York where he was employed as the registrar of the Woodstock School of Painting, and attended classes in painting with Judson Smith and Henry Lee McFee, and drawing with Konrad Cramer.(2) He became a full-time resident of the Maverick, where its founder Hervey White encouraged his interest in visual art.\n\nBard College Production of\n\nWuthering Heights,\n\nHarvey Fite Standing\n\nBeside Fireplace, 1935\n\nBard College Archives\n\nCorrado Vigni\n\nCorrado Vigni (1888-1956)\n\nEdda Mussolini Ciano, c. 1935\n\nGelatin silver print\n\nGetty Images\n\n\n\n\n\nIn 1933, St. Stephens College dropped its religious mandate. Columbia University in New York assumed a paternal responsibility for the school, renamed it Bard College, and changed its status to a college of liberal arts. Fite was originally hired to teach drama, and wrote, directed and performed in school productions. He encouraged the administration to include an art department, which he soon headed. During his summers off from teaching in 1935 and 1936, Fite studied sculpture in Florence, Italy with Corrado Vigni, who is best known for the public sculptures he created throughout Italy during the Fascist era.\n\nWendell Jones (1899-1956)\n\nTomas Penning in High Woods Studio,\n\nc. 1946-1948\n\nGelatin silver print\n\n\n\n\n\nFollowing his return from Italy in 1937, Fite studied stone carving techniques with Tomas Penning at his studio in the High Woods section of Saugerties in the Hudson Valley.(3) He continued, however, to also work in a traditional manner. In March 1939, his four beautifully modeled and perfectly cast figures Alma Mater, Victoria, The American Tragedy, and The Last Mile were exhibited at Vassar College in Poughkeepsie, New York. As a sign of his growing interest in direct carving, Fite included samples of wood and a group of tools typically used in carving. At some point in the 1930s he may also have sought out instruction in Woodstock from Alfeo Faggi, who in the 1920s established a reputation as a major America’s sculptor of religious subjects, created in a modern style and spirit.\n\nView of Grand Plaza in Mayan Ruins of Copan, Honduras, 8th Century\n\nGetty Images\n\nTomas and Elizabeth Penning, Bluestone House, c. 1950\n\nWoodstock Artists\n\nAssociation Archives\n\nJohn Kleinhans (b 1942)\n\nFormer Quarry Pool and Bluestone Patio of Tomas and Elizabeth Penning, High Woods, 2020\n\nTomas Penning (1905-1982)\n\nNude with Vase, Penning Property, High Woods, c. 1935-1936\n\nBluestone\n\nPenning Family Archives\n\nTomas Penning (1905-1982)\n\nBou Saada Furlough, Penning Property, High Woods, 1948\n\nBluestone\n\nPenning Family Archives\n\n\n\n\n\nFite spent the summer of 1938 in Honduras where he was hired by the Carnegie Corporation as a technical advisor in the reconstruction of the grand plaza in the Copan district. He debated the idea of choosing whether he wanted to spend his life reconstructing what man had destroyed, or to spend it creating what he believed man would eventually destroy.(4) The Woodstock writer and bookstore owner Sylvia Day reported that after his return from Honduras and “visiting the Penning's in High Woods and seeing what could be done with an abandoned [bluestone] quarry he searched the countryside for three months [for a quarry of his own].”(5) Fite was Inspired by Penning’s passion for bluestone as a medium in his art, and what he had accomplished with bluestone on his property, where he designed and oversaw the construction of a house, studio, and patio in the native stone, and placed sculpture on the grounds silhouetted against the woods, sky and distant mountains.(6)\n\nHarvey Fite at the Bluestone Quarry\n\nHarvey Fite’s Former House,\n\nGrounds of Opus 40\n\n\n\n\n\nFite initially tried to purchase property on the Maverick to begin what he now envisioned as a large sculpture project, but Hervey White turned him down. He then tramped in the area of High Woods in search of property he hoped would have a combination of quarry, water and a view. In December 1938 he purchased a long-abandoned quarry, about a mile from Penning’s property, from the German-born widow of the last quarryman for $376.25. Fite then set about clearing the overgrown property with the machete he brought back from Honduras, and created a path from the roadway onto the property. Fite built a house a short distance from the quarry’s edge utilizing parts of old barns and abandoned houses, and installed the timbers inside out, so the velvety gray surface of the weather-beaten timbers fashioned the interior walls. Among his sources was an old barn from Princeton, and one that stood on the artists Konrad and Florence Ballin Cramer’s property in Woodstock.(7)\n\nSquare Dancing at the Wilgus\n\nCounty Store, n.d.\n\nPenning Family Archives\n\n[Tomas Penning at Right of Center]\n\n\n\n\n\nFite had many friends among the farmers and old quarry families of High Woods. If especially heavy lifting was required he organized old fashioned bees among his neighbors to secure their assistance. He attended the Saturday night square dances at the Wilgus Country Store. He was a member of the local group Cheats and Swings, and joined them in giving exhibitions of square dancing. He hosted popular swimming parties on his property, in which he invited his local artist friends and their children. He used a 30-foot boom structure as a diving platform for visitors to his 60-foot-long quarry pool.\n\nHarvey and Barbara Fite at Opus 40, Next to Tomorrow, n.d.\n\nOpus 40\n\n\"Harvey Fite Marries\n\nMrs. Barbara Richards,\"\n\nKingston Daily Freeman,\n\nNovember 27, 1944, p. 3\n\n\n\n\n\nIn 1943, Fite was introduced to Barbara Richards by the painter and art writer Norbert Heerman at a dinner party in Woodstock, where she had recently moved from New York with her two children. Richards was raised and educated in Europe, where her father, the artist Frank P. Fairbanks, was head of the School of Fine Arts at the American Academy in Rome. Fairbanks had a short career as a film actress in Italy, and in 1941 was divorced from the United States foreign officer J. Bartlett Richards. Upon visiting the quarry site in High Woods she wondered about the audacity of anyone who believed they could shape what appeared as a sea of rocks. Fite later said to her: “This is my spider web, and the right fly will get trapped.”(8) The couple married in November 1944.\n\n\n\n\n\nOriginal Placement of Sculpture\n\nat Opus 40,Including Flame,\n\nQuarry Family and Prayer, n.d.\n\nOpus 40\n\nOriginal Placement of Sculpture\n\nat Opus 40,Including Flame\n\nPrayer and Tomorrow, n.d.\n\nSchleicher Family Archives\n\nHarvey Fite Working on Quarry Family,\n\nWith Original Placement of Flame, Prayer and Quarry Family,\n\nc. 1945-1950\n\nOpus 40\n\n\n\n\n\nIn early 1940, Fite began to work toward his dream of designing and building a sculptural landscape not far from the foot of Overlook Mountain. He planned to create a series of works to stand upon his sculptural landscape, which would celebrate the brotherhood of man, and the assimilation of the races, tied together into something roughly equivalent to a Hindu Temple or a medieval cathedral. The idea for undertaking a race based project may have been spurred by Malvina Hoffman's The Races of Man, which she executed over the course of 1930-1933 for the Field Museum of Natural History in Chicago, and includes thirty full length figures, thirty busts and one hundred and fifty facial masks. Upon its completion The Races of Man occupied the museum’s one hundred and sixty foot long Hall of Man.\n\n\n\n\n\nFite first called his project \"High Woods.\" His stepson Tad Richards relates that he \"really resisted giving it a name at all. It didn't become ’Opus 40‘ until after the monolith was raised [in the early 1960s].\"(9) Envious of musical composers’ freedom to title their works simply Opus 1 or Opus 2, Fite at that time settled on the name Opus 40, calculating that it would take him at least 40 years to finish what he originally envisioned, whose construction and style was spurred on by his study of the massive stone monuments and structures of ancient Mesoamerica, particularly of the Mayan civilization.\n\nIn 1938, Fite compared Mayan architecture to that of Classical Greek sculpture of the 5th and 4th centuries BC, and expressed his belief that the art of Greek sculpture of this time \"lies in the perfect idealization of a factual reality [whereas the] greatness of Mayan sculpture lies in a totally different motivation. 'Pure art is not a matter of science or manual dexterity. It is intellectual and philosophic, and the artist must satisfy the aesthetic sense by working with the limitations of his material. The Maya did exactly this. On this premise, the sculpture of Copan is more pure art than the art of the fourth and fifth century Greek.'\" (10)\n\n\n\n\n\nTo help envision his monumental undertaking Fite traveled over the next several decades to see ancient sculpture in its native setting in South America, Central America, Asia and Africa. In around 1962, Fite decided that the pedestals for his series of sculptures and the surrounding bluestone structures had grown into a sculpture all unto itself, and moved the series of works to the outskirts of the property. “After all,” he asked, “how could they compare with this?”(11)\n\nE, Davis (?-?)\n\nCaricature of Havvey Fite, 1945\n\nThe Hue and Cry, June 16, 1945, p. 2\n\n\n\n\n\nIn the June 16, 1945 issue of the Woodstock magazine The Hue and Cry, the Maverick author Henry Morton Robinson praised Fite for his perseverance in twisting “stubborn beauty out of the most recalcitrant stone . . . because he is more stubborn than the stone itself. . . . he has transformed a quarry-dump into a minor wonder of the world because he had the vision to see beauty where others saw only a heap of ugly debris. [In time] bluestone’s natural color modulates to weathered gray and silver. . . . The only drawback to working with this ageless stone is the fearful challenge it hurls at the sculptor. Says Fite, ‘The man who carves bluestone must create a design of lasting dignity, or his work will live to mock him.’”(12) The article in The Hue and Cry also featured a caricature of a smiling Harvey Fite by artist E. Davis.\n\nOpus 40, 1970s\n\nFour Views of Areas of Opus 40\n\nFrom Various Dates\n\n\n\n\n\n\n\n\n\n\n\n\n\nOver the course of the 1940s and early to mid 1950s, Opus 40 underwent a major part of its construction. The painter Ralph Moseley, who wrote a master’s thesis on Opus 40 while attending Bard College, has pointed out that by the “late 1950s and 1960s his forms became less complex and more restrained. The plethora of sizes and rapid curves which dominates the early parts gives way in the later sections to larger, more simplified masses which are arranged in open, regular spacing. The curves are drawn out and are gentler and create a measured pulse . . . .”(13) Interestingly, Fite chose to build Opus 40 around existing trees on the site, and to incorporate them into the overall design.\n\n\n\n\n\nDuring a visit in the summer of 1945 the New York art critic Emily Genauer became a fan. In a column for the New York World Telegram, she raved about how the “[ramps and terraces] grade and curve [and] seem the subtlest echo of the distant hills themselves. Their color is perfectly suited to the surroundings – deep blue-gray warmed by the rust of iron deposits left by centuries of dripping water.”(14)\n\nQuarrymans Museum, Opus 40\n\n\n\n\n\nFollowing Fite’s retirement in 1969 from teaching at Bard, he purportedly worked incessantly and refused to waste an hour of daylight. Over the decades he covered Opus 40’s six and a half acres of ramps, platforms, pools and hidden passageways with finely fitted bluestone. He used specially made chisels forged in black diamond steel with inserted carbide tips, as well as traditional quarryman’s tools, including hammers, chisels, drills, blasting powder, and a huge hand-powered boom with a flat wooden tray for moving rocks. Many of these tools are now on display in the Quarryman’s Museum on the property of Opus 40 which Fite initially assembled in 1969. He acquired many of the tools from retired quarrymen of the area.\n\nMaria La Yacona (1926-2019)\n\nHarvey Fite at Work on Opus 40, 1950\n\n\n\n\n\nMany photographs were taken of a physically fit and stripped-to-the-waste Fite at work on his demanding and backbreaking creation. Reputedly, some locals dubbed the shirtless artist \"Superman.\"(15)\n\nHarvey Fite (1903-1976)\n\nFlame, 1943-1944\n\nHarvey Fite (1903-1976)\n\nTomorrow, 1943-1944\n\nHarvey Fite (1903-1976)\n\nPrayer, 1943-1944\n\nHarvey Fite (1903-1976)\n\nQuarry Family, begun about 1945\n\n\n\n\n\n\n\n\n\nHarvey Fite (1903-1976)\n\nMaquettes for Flame, Tomorrow and Quarry Family, c. 1943-1945\n\n\n\n\n\nFlame was originally the centerpiece of Opus 40. It was surrounded by Quarry Family on the right, Prayer below, and Tomorrow on the left. The ensemble of sculptures, which Fite began working on in 1943, was meant to show a composite of cultures merging over the course of history, and eventually burning out. From the start Flame looked lost in the massive scale of the project.\n\n\n\n\n\nFite explained that the bottom of Flame \"is Greek fluting, the pelvis is Oriental, the torso Renaissance, and the head and raised arms are totally abstract, going off into flame shapes so that the whole was meant to show a composite of cultures as they historically merge and burn themselves out.” (16) Flame, Tomorrow and Prayer were part of a solo exhibition Fite held on the sculptor’s property in August 1945, which included 35 works created in a wide variety of materials.\n\nHarvey Fite (1903-1976)\n\nOpus 40\n\nShotwell Memorial, Artist’s Cemetery, Woodstock, c. 1948-1952\n\nHervey Fite (1903-1976)\n\nOpus 40\n\n\n\n\n\nIn 1952, a huge stone was found in a nearby streambed in the town of Ruby. Due to a dispute over the ownership of the stone it took 12 years before Fite could get clear title. One of the single most challenging problems in the construction of Opus 40 was the raising of the nine-ton monolith in the place of Flame. It was successfully pulled into an upright position by a method invented by the ancient Egyptians. The year the stone was discovered in Ruby the same method had been used by a team of workers to lift the Shotwell Memorial (also made of bluestone, and conceived by Penning and designed in part by Penning and Bruno Zimm) into place at Woodstock’s Artist’s Cemetery. At Opus 40 stone swirls and sweeps and curls together in rhythm to meet at the monolith, which sweeps upward into the sky.\n\nBarbara Fite - The Sunday Times-Union, August 29, 1976\n\nRobert Smithson (1938-1973)\n\nBroken Circle, 1971\n\nEmmen, The Netherlands\n\nRobert Morris (1931-2018)\n\nThe Grand Rapids Project, 1974\n\nGrand Rapids, Michigan\n\n\n\n\n\nToday Opus 40 is run by the non-profit organization Opus 40, Inc., established by Barbara Fite, which cares for and promotes the site. It is regarded as a precedent for the monumental sculptures that were created by the generation of earth artists who emerged in the 1960s and 1970s, including Robert Smithson, Robert Morris, Michael Heizer, Carl Andre and Nancy Holt. In 1977, the art historian John Beardsley compared Opus 40 with Smithson’s Broken Circle and Morris’ Grand Rapids Project because of their creative reclamation of the landscape.(17)\n\nHarvey Fite Woking\n\nin House Studio,\n\nWorking on Bather,\n\nearly to mid 1940s\n\nOpus 40\n\nHarvey Fite (1903-1976)\n\nJamaican Mother and Child, 1945\n\nCarved ivory-Lignum\n\nAlbany Institute of History and Art\n\nHarvey Fite (1903-1976)\n\nAbstract Figure, 1962\n\nEbony\n\nWoodstock Artists Association\n\nand Museum\n\n\n\n\n\nIn his independent sculptures, Fite generally favored figurative and animal subjects, and worked in stone, wood and bronze. In addition to bluestone, he employed marble, mahogany, cipollino, alabaster, onyx, ivory, brownstone, ebony, black walnut, among other materials. His subjects, like those of John B. Flannagan, an influential direct carver who worked on the Maverick, were frequently suggested to him by the shape of the material he ran across.\n\n\n\n\n\nAt the Maverick, Fite had the opportunity to associate with Flannagan, as well as sculptors Eugenie Gershoy, Hannah Small and Raoul Hague, who followed Flannagan's example as direct carvers. Art historian and curator John P. Murphy believes Fite's adoption of universal themes as the subject matter for his figurative sculptures was influenced by the lessons he learned from his study of Flannagan's work, and as an outgrowth of his familiarity with the ideas of the mythologist, writer and lecturer Joseph Campbell, whom he also knew on the Maverick in West Hurley.(18)\n\nJohn B. Flannagan (1895-1942)\n\nMother and Child, 1932-1933\n\nGranite\n\nFrances Lehman Loeb\n\nArt Center, Vassar College\n\nJohn B. Flannagan (1895-1942)\n\nStanding Ram, 1927-1939\n\nCarved Stone\n\nBrooklyn Museum\n\nJohn B, Flannagan (1895-1942)\n\nPraying Woman, 1924\n\nRosewood\n\nReview of Exhibition of John B. Flannagan, Orient Gallery,\n\nBard College, The Bardian\n\nNovember 5. 1937, p. 3\n\n\n\n\n\nFlannagan had a strong influence on the style, expression and character of some of Fite's early efforts, particularly in their pared down simplicity, goal of making a simple direct statement with such ease that the work seems hardly to be carved but to have endured always, and alignment with the spiritual or animistic forces of nature, Flannagan's art may have also helped open Fite's eyes to the indigenous art of the Aztec, Mayan and Inca civilizations in Central and South America. It was Fite and Penning who were undoubtedly responsible for the exhibition of a small group of Flannagan's sculptures at the Orient Gallery at Bard College in the fall of 1937, which was reviewed by Henry J. Wellwether in the November issue of The Bardian.\n\nHarvey Fite (1903-1976)\n\nMan and Mermaid, n.d.\n\nWood\n\nWoodstock Artists Association\n\nand Museum\n\nHarvey Fite (1903-1976)\n\nAnd His Anger Waxed Hot, 1948\n\nWalnut\n\nHarvey Fite (1903-1976)\n\nGluttony, c. 1951\n\nTravertine\n\nArticle on Harvey Fite\n\nExhibition in Paris, 1960\n\nHarvey Fite Scrapbook\n\n\n\n\n\nFite adopted different styles depending on the subject and his interests at the time, and his sculptures were inspired by a broad range of sources. His pieces range from the traditionally conceived Jamaican Mother and Child to the more experimental Abstract Figure, created in ebony and featuring a black marble base. In his sculpture Fite rendered the spectrum of human emotions, ranging from the romantic enthusiasm of young lovers to the fiery anger of the biblical Moses, represented in And His Anger\n\nWaxed Hot.\n\nHarvey Fite (1903-1976)\n\nDance II, c. 1965\n\nBlack walnut\n\nHarvey Fite (1903-1976)\n\nDance VI, 1967\n\nBlack Walnut\n\nWoodstock Artists Association\n\nand Museum\n\nConstantin Brancusi (1876-1957)\n\nBird in Space, 1932-1940\n\nPolished brass\n\nGuggenheim Museum\n\n\n\n\n\nIn the mid-1960s, Fite created a series of wood sculptures inspired by the art of dance. The works developed as an outgrowth of his lifelong love and gift for dance. When he was in his early twenties he was accepted as a student to the Denishawn Dance Studio in New York City (the same studio where Martha Graham studied), but turned it down because he had failed to receive a paying scholarship. Fite was an excellent ball room and square dancer. The striking simplicity and soaring elegance of Dance VI brings to mind Brancusi’s Bird in Space.\n\n\n\n\n\nDance VI was donated to the Woodstock Artists Association by Barbara Fite, who was the head of the association’s first acquisitions committee. Harvey Fite often showed at the association, where he gave a talk in 1956 on stone carvings from around the world. Fite also exhibited in group showings around the country, and had solo showings in New York City, Cleveland, Ohio, Rome and Paris. From 1945 to 1947, his work was included in the annual of the Whitney Museum of American Art in New York. In late 1950, he had a joint exhibition with the painter Ben Johnson at the S. S. Seahorse Gallery in Woodstock, and in 1969 he had a solo exhibition at the Polari Gallery, located next to the Woodstock Playhouse. A memorial exhibition of Fite's work was held in 1977 at the Woodstock Artists Association.\n\nHarvey Fite Working on\n\nKeystone Masonry, n.d.\n\nGelatin silver print\n\nOpus 40\n\nHarvey Fite with Mars, 1958\n\nNorman Kent, \"A Sculptor's Quarry,\"\n\nAmerican Artist, January 1958, p. 31\n\nOpus 40 with View From a Distance\n\nof Overlook Mountain,\n\nMay 2022\n\n\n\n\n\nHarvey Fite died in 1976 as the result of bizarre accident. He was driving a tractor at the edge of the quarry on his property when its gears jammed. The machine went into reverse, and Fite toppled over the edge of the quarry and struck his head on the bluestone twelve feet below. Fite’s ashes were spread over the stones of Opus 40. Following his tragic death, just four years short of the span he envisioned to complete his astonishing life’s work, the Woodstock artist and musician John Pike summed up his friend’s life and aspirations in a few succinct and apt words: “[Harvey Fite] lost his life doing what he wanted most – working on Opus 40.“(19)\n\n\n\n\n\n(1) I would like to thank Tad Richards for sharing a digital file of the Harvey Fite scrapbook in his possession. A photocopy of the scrapbook is found in the Harvey Fite files in the Woodstock Artists Association Archives. Additionally, Richards in the author of the highly informative kOpus 40: The First 40 Years: Pictures Taken from the Opus 40 Archives (Privately Printed, 2012). I would like to thank Caroline Crumpacker, Executive Diector, Opus 40, for generously assisting with my research and providing a selection of photographic images of Opus 40.\n\n(2) “Fite to Show Figures Carved from Bluestone,” Catskill Mountain Star, August 17, 1945, otherwise unidentified article in Harvey Fite Scrapbook. McFee is noted as Fite’s painting teacher in Tram Combs, “Barbara Fite on Opus 40,” Woodstock Times, August 27, 1987, p. 48.\n\n(3) Ralph Moseley, “Opus 40: A Historical Perspective,” Bard-St. Stephen’s Alumni Magazine 11 (February 1968): p. 4. Moseley became friendly with Penning at the Byrdcliffe home of Betty and Holiister Sturgis, where he had the opportunity to directly discuss Penning’s relationship with Fite. I had the opportunity to discuss Moseley's relationship with Penning in a telephone conversation held in January 2020.\n\n(4) “Thumb Box Sketch,” otherwise unidentified newspaper clipping, Harvey Fite Scrapbook. This article probably appeared in the Catskill Mountain Star.\n\n(5) Sylvia Day, “Thumb Box Sketches: Harvey Fite,” Catskill Mountain Star, July 14, 1950, p. 3. ( 6) ”Fite to Show Figures Carved from Bluestone,” Catskill Mountain Star, August 17, 1945, otherwise unidentified article, Harvey Fite Scrapbook. For a recent study of Penning's life and career see the author’s essay “Native Stone: The Art of Tomas Penning,“ in Native Stone: The Art of Tomas Penning (1905-1982) (Woodstock, New York, Woodstock School of Art, 2021), pp. 7-47. Also see the three essays exploring aspects of Penning’s life and career in learningwoodstockartcolony.com.\n\n(7) This information was related to the author by Gordon Taylor (brother-in-law of the artists Konrad and Florence Ballin Cramer) in an interview of July 25, 2018. For information about the construction of the house see Gledhill Cameron, “Life of a Modern Pioneer Can be Fun: Sculptor and Wife Discover It Adds Up to Happiness,” New York World-Telegram, June 20, 1945, otherwise unidentified article in Harvey Fite Scrapbook.\n\n(8) Fite is quoted in Tram Combs, p. 45\n\n(9) Email from Tad Richards, May 27, 2022.\n\n(10) \"Mayas vs Greeks: Bard Professor Says he Prefers Former,\" New York Sun, March 4, 1938. otherwise unidentified article, Harvey Fite Scrapbook.\n\n(11) Fite is quoted in “Task at an Abandoned Quarry,” otherwise unidentified article, Harvey Fite Scrapbook.\n\n(12) Henry Morton Robinson, \"Woodstock Profiles No 1,\" The Hue and Cry 1 (June 16, 1945): 2. Robnson is identified as the author in a typescript of the article, titled “From an Abandoned Stone-Pile, An American Sculptor is Quarrying Immortality,” Harvey Fite Scrapbook.\n\n(13) Moseley, p. 5. Additionally, Ralph Moseley is the author of “Opus 40: A Sculpture by Harvey Fite,” M.A. Thesis, Hunter College, 1967. Fite’s art also is the subject of a chapter in John P. Murphy, “Back to the Garden: The Woodstock Artists’ Colony,” Ph.D. dissertation, Northwestern University, 2017, pp. 269-281. I would like to thank Tad Richards and John P. Murphy for sharing copies with the author. In his dissertation (p. 271), Murphy suggests that the architecture of the bluestone quarry amphitheater on the Maverick may have had a role in inspiring Opus 40.\n\n(14) Emily Genauer, “Fite’s Acropolis in the Woods,” New York World-Telegram, September 1, 1945, otherwise unidentified article, Harvey Fite Scrapbook\n\n(15) Maria La Yacona, \"'Acropolis in the Catskills,\" Parade Magazine, 1950, otherwise unidentified article, Harvey Fite Scrapbook.\n\n(16) Fite is quoted in Moseley, “Opus 40: A Historical Perspective,” p. 4.\n\n(17) John Beardsley, Probing the Earth: Contemporary Land Projects (Washington, D.C.: Smithsonian Institution Press, 1977), p. 35.\n\n(18) Murphy, “Back to the Garden: The Woodstock Artists’ Colony,” p. 272.\n\n(19 ) Pike is quoted in Peter Kutschera, “Sculptor’s Opus Without an End,” The Times Herald Record, May 11, 1976, otherwise unidentified article, Harvey Fite Scrapbook.\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.chronogram.com/arts/opus-40-bard-college-collaborate-on-effort-to-buy-historic-fite-house-16505693", "page_content": "click to enlarge Harvey Fite's sculpture The Bather next to Fite House.\n\nclick to enlarge Fite House, as seen from the adjacent Opus 40 sculpture.\n\nclick to enlarge Harvey Fite carving a sculpture in his Fite House studio.\n\nThe management of Saugerties outdoor sculpture center Opus 40 recently announced plans to work with Bard College and local philanthropists to purchase the adjacent Fite House, which was designed and built by site founder and artist Harvey Fite in the 1930s, in order to preserve it as part of the historic park. Fundraising websites for the effort and a benefit concert have been set up.Harvey and Barbara Fite’s private home, the house has also been the home of their descendants for over 30 years. Opus 40 and Bard College, where Harvey Fite studied and taught, have united in an effort to acquire the house in a way that continues the Fites’ vision of an integrated Opus 40. Their aim is to prevent Fite House from going into private hands, likely for commercial purposes, and separating Harvey Fite’s masterpiece sculpture from his home. With Fite’s descendants desiring to sell the house, the transaction needs to take place by the end of the year.“We all know the Fite House belongs with Opus 40,” says Jonathan Richards, Harvey Fite’s stepson. “It is an integral part of the living, planning, and working environment that went into the creation of Harvey’s masterpiece. Harvey designed and built his house to be a vantage point to observe and plan his work on the quarry, he configured it to be a part of the artistic whole, and he and Barbara spent many evenings sitting at the upstairs picture window contemplating and discussing the growth of the sculpture as it evolved.”“We have already raised most of the purchase price through our board, a foundation, and several generous individuals, and are now working together to raise the final $300,000 within the next month, if possible, in order to acquire the house at the amount and on the timetable that works for the Richards family,” explains Dr. Jonathan Becker, executive vice president of Bard College and president of Opus 40’s board of directors.Information about contributing directly or via Indiegogo is available online."}, {"url": "https://www.learningwoodstockartcolony.com/post/a-profile-of-the-life-and-art-of-visionary-sculptor-harvey-fite-of-opus-40", "page_content": "By Bruce Weber\n\nHarvey Fite Working on Quarry Family,\n\nWith Original Placement of Flame, Prayer and Quarry Family,\n\nc. 1945-1950\n\nOpus 40\n\nSt. Stephen’s College,\n\nAnnandale-on-Hudson, n.d.\n\n\n\n\n\nVisionary sculptor Harvey Fite, creator of the pioneering earthwork Opus 40, on the grounds of a former commercial bluestone quarry in the High Woods section of Saugerties, New York, was born on Christmas day in 1903 in Pittsburgh, Pennsylvania.(1) His family moved to Brunner, Texas when he was an infant, and soon after his father Thomas acquired a farm in nearby Victoria. After completing high school in Houston, Fite attended Houston Law School from 1923-1926, but decided to abandon law and join the ministry. He enrolled at St. Stephen’s College in Annandale-on-Hudson, New York through a scholarship secured for him by his bishop; the institution was devoted to preparing young men for the Episcopal ministry. In addition to the scholarship, he also earned his way through college by doing carpentry and manual work while studying in the classics program.\n\nMaverick Theatre Program\n\nWith Image of the Interior, 1936\n\nWoodstock Public Library District\n\nMatinee Performance\n\nof Jitney Players, n.d.\n\nBilly Rose Theatre Division,\n\nNew York Public Library\n\n\n\n\n\nIn the spring of 1929, Fite discovered a notice on the school bulletin board announcing the summer season of the Maverick Theatre Company. Aspiring now to a career as an actor he joined the company and moved into a cabin at the Maverick art colony across the Hudson River in West Hurley, New York, a short distance from Woodstock. At the end of the summer season he joined a stock company, known as the Jitney Players, that performed restoration plays, including Shakespeare. This was followed by a period as an actor at the Bulgarov Russian Theatre in New York City. During rehearsals and breaks in the performance, Fite began to occupy his time by whittling discarded seamstresseis’ spools and other bits of wood that he found backstage, and discovered whittling to be a source of pleasure and creativity.\n\nWoodstock School of Painting,\n\nWith Instructor Listing, 1931\n\nClassroom Barns of\n\nJudson Smith Property,\n\nOhayo Mountain Road, Woodstock\n\n\n\n\n\nFrom 1931-1933, Fite lived in Princeton, New Jersey in a barn on the farm of Louis Corti, one of his former professors at St. Stephens. He worked at a variety of odd jobs, and developed a serious interest in carving. In 1933 Fite returned to upstate New York where he was employed as the registrar of the Woodstock School of Painting, and attended classes in painting with Judson Smith and Henry Lee McFee, and drawing with Konrad Cramer.(2) He became a full-time resident of the Maverick, where its founder Hervey White encouraged his interest in visual art.\n\nBard College Production of\n\nWuthering Heights,\n\nHarvey Fite Standing\n\nBeside Fireplace, 1935\n\nBard College Archives\n\nCorrado Vigni\n\nCorrado Vigni (1888-1956)\n\nEdda Mussolini Ciano, c. 1935\n\nGelatin silver print\n\nGetty Images\n\n\n\n\n\nIn 1933, St. Stephens College dropped its religious mandate. Columbia University in New York assumed a paternal responsibility for the school, renamed it Bard College, and changed its status to a college of liberal arts. Fite was originally hired to teach drama, and wrote, directed and performed in school productions. He encouraged the administration to include an art department, which he soon headed. During his summers off from teaching in 1935 and 1936, Fite studied sculpture in Florence, Italy with Corrado Vigni, who is best known for the public sculptures he created throughout Italy during the Fascist era.\n\nWendell Jones (1899-1956)\n\nTomas Penning in High Woods Studio,\n\nc. 1946-1948\n\nGelatin silver print\n\n\n\n\n\nFollowing his return from Italy in 1937, Fite studied stone carving techniques with Tomas Penning at his studio in the High Woods section of Saugerties in the Hudson Valley.(3) He continued, however, to also work in a traditional manner. In March 1939, his four beautifully modeled and perfectly cast figures Alma Mater, Victoria, The American Tragedy, and The Last Mile were exhibited at Vassar College in Poughkeepsie, New York. As a sign of his growing interest in direct carving, Fite included samples of wood and a group of tools typically used in carving. At some point in the 1930s he may also have sought out instruction in Woodstock from Alfeo Faggi, who in the 1920s established a reputation as a major America’s sculptor of religious subjects, created in a modern style and spirit.\n\nView of Grand Plaza in Mayan Ruins of Copan, Honduras, 8th Century\n\nGetty Images\n\nTomas and Elizabeth Penning, Bluestone House, c. 1950\n\nWoodstock Artists\n\nAssociation Archives\n\nJohn Kleinhans (b 1942)\n\nFormer Quarry Pool and Bluestone Patio of Tomas and Elizabeth Penning, High Woods, 2020\n\nTomas Penning (1905-1982)\n\nNude with Vase, Penning Property, High Woods, c. 1935-1936\n\nBluestone\n\nPenning Family Archives\n\nTomas Penning (1905-1982)\n\nBou Saada Furlough, Penning Property, High Woods, 1948\n\nBluestone\n\nPenning Family Archives\n\n\n\n\n\nFite spent the summer of 1938 in Honduras where he was hired by the Carnegie Corporation as a technical advisor in the reconstruction of the grand plaza in the Copan district. He debated the idea of choosing whether he wanted to spend his life reconstructing what man had destroyed, or to spend it creating what he believed man would eventually destroy.(4) The Woodstock writer and bookstore owner Sylvia Day reported that after his return from Honduras and “visiting the Penning's in High Woods and seeing what could be done with an abandoned [bluestone] quarry he searched the countryside for three months [for a quarry of his own].”(5) Fite was Inspired by Penning’s passion for bluestone as a medium in his art, and what he had accomplished with bluestone on his property, where he designed and oversaw the construction of a house, studio, and patio in the native stone, and placed sculpture on the grounds silhouetted against the woods, sky and distant mountains.(6)\n\nHarvey Fite at the Bluestone Quarry\n\nHarvey Fite’s Former House,\n\nGrounds of Opus 40\n\n\n\n\n\nFite initially tried to purchase property on the Maverick to begin what he now envisioned as a large sculpture project, but Hervey White turned him down. He then tramped in the area of High Woods in search of property he hoped would have a combination of quarry, water and a view. In December 1938 he purchased a long-abandoned quarry, about a mile from Penning’s property, from the German-born widow of the last quarryman for $376.25. Fite then set about clearing the overgrown property with the machete he brought back from Honduras, and created a path from the roadway onto the property. Fite built a house a short distance from the quarry’s edge utilizing parts of old barns and abandoned houses, and installed the timbers inside out, so the velvety gray surface of the weather-beaten timbers fashioned the interior walls. Among his sources was an old barn from Princeton, and one that stood on the artists Konrad and Florence Ballin Cramer’s property in Woodstock.(7)\n\nSquare Dancing at the Wilgus\n\nCounty Store, n.d.\n\nPenning Family Archives\n\n[Tomas Penning at Right of Center]\n\n\n\n\n\nFite had many friends among the farmers and old quarry families of High Woods. If especially heavy lifting was required he organized old fashioned bees among his neighbors to secure their assistance. He attended the Saturday night square dances at the Wilgus Country Store. He was a member of the local group Cheats and Swings, and joined them in giving exhibitions of square dancing. He hosted popular swimming parties on his property, in which he invited his local artist friends and their children. He used a 30-foot boom structure as a diving platform for visitors to his 60-foot-long quarry pool.\n\nHarvey and Barbara Fite at Opus 40, Next to Tomorrow, n.d.\n\nOpus 40\n\n\"Harvey Fite Marries\n\nMrs. Barbara Richards,\"\n\nKingston Daily Freeman,\n\nNovember 27, 1944, p. 3\n\n\n\n\n\nIn 1943, Fite was introduced to Barbara Richards by the painter and art writer Norbert Heerman at a dinner party in Woodstock, where she had recently moved from New York with her two children. Richards was raised and educated in Europe, where her father, the artist Frank P. Fairbanks, was head of the School of Fine Arts at the American Academy in Rome. Fairbanks had a short career as a film actress in Italy, and in 1941 was divorced from the United States foreign officer J. Bartlett Richards. Upon visiting the quarry site in High Woods she wondered about the audacity of anyone who believed they could shape what appeared as a sea of rocks. Fite later said to her: “This is my spider web, and the right fly will get trapped.”(8) The couple married in November 1944.\n\n\n\n\n\nOriginal Placement of Sculpture\n\nat Opus 40,Including Flame,\n\nQuarry Family and Prayer, n.d.\n\nOpus 40\n\nOriginal Placement of Sculpture\n\nat Opus 40,Including Flame\n\nPrayer and Tomorrow, n.d.\n\nSchleicher Family Archives\n\nHarvey Fite Working on Quarry Family,\n\nWith Original Placement of Flame, Prayer and Quarry Family,\n\nc. 1945-1950\n\nOpus 40\n\n\n\n\n\nIn early 1940, Fite began to work toward his dream of designing and building a sculptural landscape not far from the foot of Overlook Mountain. He planned to create a series of works to stand upon his sculptural landscape, which would celebrate the brotherhood of man, and the assimilation of the races, tied together into something roughly equivalent to a Hindu Temple or a medieval cathedral. The idea for undertaking a race based project may have been spurred by Malvina Hoffman's The Races of Man, which she executed over the course of 1930-1933 for the Field Museum of Natural History in Chicago, and includes thirty full length figures, thirty busts and one hundred and fifty facial masks. Upon its completion The Races of Man occupied the museum’s one hundred and sixty foot long Hall of Man.\n\n\n\n\n\nFite first called his project \"High Woods.\" His stepson Tad Richards relates that he \"really resisted giving it a name at all. It didn't become ’Opus 40‘ until after the monolith was raised [in the early 1960s].\"(9) Envious of musical composers’ freedom to title their works simply Opus 1 or Opus 2, Fite at that time settled on the name Opus 40, calculating that it would take him at least 40 years to finish what he originally envisioned, whose construction and style was spurred on by his study of the massive stone monuments and structures of ancient Mesoamerica, particularly of the Mayan civilization.\n\nIn 1938, Fite compared Mayan architecture to that of Classical Greek sculpture of the 5th and 4th centuries BC, and expressed his belief that the art of Greek sculpture of this time \"lies in the perfect idealization of a factual reality [whereas the] greatness of Mayan sculpture lies in a totally different motivation. 'Pure art is not a matter of science or manual dexterity. It is intellectual and philosophic, and the artist must satisfy the aesthetic sense by working with the limitations of his material. The Maya did exactly this. On this premise, the sculpture of Copan is more pure art than the art of the fourth and fifth century Greek.'\" (10)\n\n\n\n\n\nTo help envision his monumental undertaking Fite traveled over the next several decades to see ancient sculpture in its native setting in South America, Central America, Asia and Africa. In around 1962, Fite decided that the pedestals for his series of sculptures and the surrounding bluestone structures had grown into a sculpture all unto itself, and moved the series of works to the outskirts of the property. “After all,” he asked, “how could they compare with this?”(11)\n\nE, Davis (?-?)\n\nCaricature of Havvey Fite, 1945\n\nThe Hue and Cry, June 16, 1945, p. 2\n\n\n\n\n\nIn the June 16, 1945 issue of the Woodstock magazine The Hue and Cry, the Maverick author Henry Morton Robinson praised Fite for his perseverance in twisting “stubborn beauty out of the most recalcitrant stone . . . because he is more stubborn than the stone itself. . . . he has transformed a quarry-dump into a minor wonder of the world because he had the vision to see beauty where others saw only a heap of ugly debris. [In time] bluestone’s natural color modulates to weathered gray and silver. . . . The only drawback to working with this ageless stone is the fearful challenge it hurls at the sculptor. Says Fite, ‘The man who carves bluestone must create a design of lasting dignity, or his work will live to mock him.’”(12) The article in The Hue and Cry also featured a caricature of a smiling Harvey Fite by artist E. Davis.\n\nOpus 40, 1970s\n\nFour Views of Areas of Opus 40\n\nFrom Various Dates\n\n\n\n\n\n\n\n\n\n\n\n\n\nOver the course of the 1940s and early to mid 1950s, Opus 40 underwent a major part of its construction. The painter Ralph Moseley, who wrote a master’s thesis on Opus 40 while attending Bard College, has pointed out that by the “late 1950s and 1960s his forms became less complex and more restrained. The plethora of sizes and rapid curves which dominates the early parts gives way in the later sections to larger, more simplified masses which are arranged in open, regular spacing. The curves are drawn out and are gentler and create a measured pulse . . . .”(13) Interestingly, Fite chose to build Opus 40 around existing trees on the site, and to incorporate them into the overall design.\n\n\n\n\n\nDuring a visit in the summer of 1945 the New York art critic Emily Genauer became a fan. In a column for the New York World Telegram, she raved about how the “[ramps and terraces] grade and curve [and] seem the subtlest echo of the distant hills themselves. Their color is perfectly suited to the surroundings – deep blue-gray warmed by the rust of iron deposits left by centuries of dripping water.”(14)\n\nQuarrymans Museum, Opus 40\n\n\n\n\n\nFollowing Fite’s retirement in 1969 from teaching at Bard, he purportedly worked incessantly and refused to waste an hour of daylight. Over the decades he covered Opus 40’s six and a half acres of ramps, platforms, pools and hidden passageways with finely fitted bluestone. He used specially made chisels forged in black diamond steel with inserted carbide tips, as well as traditional quarryman’s tools, including hammers, chisels, drills, blasting powder, and a huge hand-powered boom with a flat wooden tray for moving rocks. Many of these tools are now on display in the Quarryman’s Museum on the property of Opus 40 which Fite initially assembled in 1969. He acquired many of the tools from retired quarrymen of the area.\n\nMaria La Yacona (1926-2019)\n\nHarvey Fite at Work on Opus 40, 1950\n\n\n\n\n\nMany photographs were taken of a physically fit and stripped-to-the-waste Fite at work on his demanding and backbreaking creation. Reputedly, some locals dubbed the shirtless artist \"Superman.\"(15)\n\nHarvey Fite (1903-1976)\n\nFlame, 1943-1944\n\nHarvey Fite (1903-1976)\n\nTomorrow, 1943-1944\n\nHarvey Fite (1903-1976)\n\nPrayer, 1943-1944\n\nHarvey Fite (1903-1976)\n\nQuarry Family, begun about 1945\n\n\n\n\n\n\n\n\n\nHarvey Fite (1903-1976)\n\nMaquettes for Flame, Tomorrow and Quarry Family, c. 1943-1945\n\n\n\n\n\nFlame was originally the centerpiece of Opus 40. It was surrounded by Quarry Family on the right, Prayer below, and Tomorrow on the left. The ensemble of sculptures, which Fite began working on in 1943, was meant to show a composite of cultures merging over the course of history, and eventually burning out. From the start Flame looked lost in the massive scale of the project.\n\n\n\n\n\nFite explained that the bottom of Flame \"is Greek fluting, the pelvis is Oriental, the torso Renaissance, and the head and raised arms are totally abstract, going off into flame shapes so that the whole was meant to show a composite of cultures as they historically merge and burn themselves out.” (16) Flame, Tomorrow and Prayer were part of a solo exhibition Fite held on the sculptor’s property in August 1945, which included 35 works created in a wide variety of materials.\n\nHarvey Fite (1903-1976)\n\nOpus 40\n\nShotwell Memorial, Artist’s Cemetery, Woodstock, c. 1948-1952\n\nHervey Fite (1903-1976)\n\nOpus 40\n\n\n\n\n\nIn 1952, a huge stone was found in a nearby streambed in the town of Ruby. Due to a dispute over the ownership of the stone it took 12 years before Fite could get clear title. One of the single most challenging problems in the construction of Opus 40 was the raising of the nine-ton monolith in the place of Flame. It was successfully pulled into an upright position by a method invented by the ancient Egyptians. The year the stone was discovered in Ruby the same method had been used by a team of workers to lift the Shotwell Memorial (also made of bluestone, and conceived by Penning and designed in part by Penning and Bruno Zimm) into place at Woodstock’s Artist’s Cemetery. At Opus 40 stone swirls and sweeps and curls together in rhythm to meet at the monolith, which sweeps upward into the sky.\n\nBarbara Fite - The Sunday Times-Union, August 29, 1976\n\nRobert Smithson (1938-1973)\n\nBroken Circle, 1971\n\nEmmen, The Netherlands\n\nRobert Morris (1931-2018)\n\nThe Grand Rapids Project, 1974\n\nGrand Rapids, Michigan\n\n\n\n\n\nToday Opus 40 is run by the non-profit organization Opus 40, Inc., established by Barbara Fite, which cares for and promotes the site. It is regarded as a precedent for the monumental sculptures that were created by the generation of earth artists who emerged in the 1960s and 1970s, including Robert Smithson, Robert Morris, Michael Heizer, Carl Andre and Nancy Holt. In 1977, the art historian John Beardsley compared Opus 40 with Smithson’s Broken Circle and Morris’ Grand Rapids Project because of their creative reclamation of the landscape.(17)\n\nHarvey Fite Woking\n\nin House Studio,\n\nWorking on Bather,\n\nearly to mid 1940s\n\nOpus 40\n\nHarvey Fite (1903-1976)\n\nJamaican Mother and Child, 1945\n\nCarved ivory-Lignum\n\nAlbany Institute of History and Art\n\nHarvey Fite (1903-1976)\n\nAbstract Figure, 1962\n\nEbony\n\nWoodstock Artists Association\n\nand Museum\n\n\n\n\n\nIn his independent sculptures, Fite generally favored figurative and animal subjects, and worked in stone, wood and bronze. In addition to bluestone, he employed marble, mahogany, cipollino, alabaster, onyx, ivory, brownstone, ebony, black walnut, among other materials. His subjects, like those of John B. Flannagan, an influential direct carver who worked on the Maverick, were frequently suggested to him by the shape of the material he ran across.\n\n\n\n\n\nAt the Maverick, Fite had the opportunity to associate with Flannagan, as well as sculptors Eugenie Gershoy, Hannah Small and Raoul Hague, who followed Flannagan's example as direct carvers. Art historian and curator John P. Murphy believes Fite's adoption of universal themes as the subject matter for his figurative sculptures was influenced by the lessons he learned from his study of Flannagan's work, and as an outgrowth of his familiarity with the ideas of the mythologist, writer and lecturer Joseph Campbell, whom he also knew on the Maverick in West Hurley.(18)\n\nJohn B. Flannagan (1895-1942)\n\nMother and Child, 1932-1933\n\nGranite\n\nFrances Lehman Loeb\n\nArt Center, Vassar College\n\nJohn B. Flannagan (1895-1942)\n\nStanding Ram, 1927-1939\n\nCarved Stone\n\nBrooklyn Museum\n\nJohn B, Flannagan (1895-1942)\n\nPraying Woman, 1924\n\nRosewood\n\nReview of Exhibition of John B. Flannagan, Orient Gallery,\n\nBard College, The Bardian\n\nNovember 5. 1937, p. 3\n\n\n\n\n\nFlannagan had a strong influence on the style, expression and character of some of Fite's early efforts, particularly in their pared down simplicity, goal of making a simple direct statement with such ease that the work seems hardly to be carved but to have endured always, and alignment with the spiritual or animistic forces of nature, Flannagan's art may have also helped open Fite's eyes to the indigenous art of the Aztec, Mayan and Inca civilizations in Central and South America. It was Fite and Penning who were undoubtedly responsible for the exhibition of a small group of Flannagan's sculptures at the Orient Gallery at Bard College in the fall of 1937, which was reviewed by Henry J. Wellwether in the November issue of The Bardian.\n\nHarvey Fite (1903-1976)\n\nMan and Mermaid, n.d.\n\nWood\n\nWoodstock Artists Association\n\nand Museum\n\nHarvey Fite (1903-1976)\n\nAnd His Anger Waxed Hot, 1948\n\nWalnut\n\nHarvey Fite (1903-1976)\n\nGluttony, c. 1951\n\nTravertine\n\nArticle on Harvey Fite\n\nExhibition in Paris, 1960\n\nHarvey Fite Scrapbook\n\n\n\n\n\nFite adopted different styles depending on the subject and his interests at the time, and his sculptures were inspired by a broad range of sources. His pieces range from the traditionally conceived Jamaican Mother and Child to the more experimental Abstract Figure, created in ebony and featuring a black marble base. In his sculpture Fite rendered the spectrum of human emotions, ranging from the romantic enthusiasm of young lovers to the fiery anger of the biblical Moses, represented in And His Anger\n\nWaxed Hot.\n\nHarvey Fite (1903-1976)\n\nDance II, c. 1965\n\nBlack walnut\n\nHarvey Fite (1903-1976)\n\nDance VI, 1967\n\nBlack Walnut\n\nWoodstock Artists Association\n\nand Museum\n\nConstantin Brancusi (1876-1957)\n\nBird in Space, 1932-1940\n\nPolished brass\n\nGuggenheim Museum\n\n\n\n\n\nIn the mid-1960s, Fite created a series of wood sculptures inspired by the art of dance. The works developed as an outgrowth of his lifelong love and gift for dance. When he was in his early twenties he was accepted as a student to the Denishawn Dance Studio in New York City (the same studio where Martha Graham studied), but turned it down because he had failed to receive a paying scholarship. Fite was an excellent ball room and square dancer. The striking simplicity and soaring elegance of Dance VI brings to mind Brancusi’s Bird in Space.\n\n\n\n\n\nDance VI was donated to the Woodstock Artists Association by Barbara Fite, who was the head of the association’s first acquisitions committee. Harvey Fite often showed at the association, where he gave a talk in 1956 on stone carvings from around the world. Fite also exhibited in group showings around the country, and had solo showings in New York City, Cleveland, Ohio, Rome and Paris. From 1945 to 1947, his work was included in the annual of the Whitney Museum of American Art in New York. In late 1950, he had a joint exhibition with the painter Ben Johnson at the S. S. Seahorse Gallery in Woodstock, and in 1969 he had a solo exhibition at the Polari Gallery, located next to the Woodstock Playhouse. A memorial exhibition of Fite's work was held in 1977 at the Woodstock Artists Association.\n\nHarvey Fite Working on\n\nKeystone Masonry, n.d.\n\nGelatin silver print\n\nOpus 40\n\nHarvey Fite with Mars, 1958\n\nNorman Kent, \"A Sculptor's Quarry,\"\n\nAmerican Artist, January 1958, p. 31\n\nOpus 40 with View From a Distance\n\nof Overlook Mountain,\n\nMay 2022\n\n\n\n\n\nHarvey Fite died in 1976 as the result of bizarre accident. He was driving a tractor at the edge of the quarry on his property when its gears jammed. The machine went into reverse, and Fite toppled over the edge of the quarry and struck his head on the bluestone twelve feet below. Fite’s ashes were spread over the stones of Opus 40. Following his tragic death, just four years short of the span he envisioned to complete his astonishing life’s work, the Woodstock artist and musician John Pike summed up his friend’s life and aspirations in a few succinct and apt words: “[Harvey Fite] lost his life doing what he wanted most – working on Opus 40.“(19)\n\n\n\n\n\n(1) I would like to thank Tad Richards for sharing a digital file of the Harvey Fite scrapbook in his possession. A photocopy of the scrapbook is found in the Harvey Fite files in the Woodstock Artists Association Archives. Additionally, Richards in the author of the highly informative kOpus 40: The First 40 Years: Pictures Taken from the Opus 40 Archives (Privately Printed, 2012). I would like to thank Caroline Crumpacker, Executive Diector, Opus 40, for generously assisting with my research and providing a selection of photographic images of Opus 40.\n\n(2) “Fite to Show Figures Carved from Bluestone,” Catskill Mountain Star, August 17, 1945, otherwise unidentified article in Harvey Fite Scrapbook. McFee is noted as Fite’s painting teacher in Tram Combs, “Barbara Fite on Opus 40,” Woodstock Times, August 27, 1987, p. 48.\n\n(3) Ralph Moseley, “Opus 40: A Historical Perspective,” Bard-St. Stephen’s Alumni Magazine 11 (February 1968): p. 4. Moseley became friendly with Penning at the Byrdcliffe home of Betty and Holiister Sturgis, where he had the opportunity to directly discuss Penning’s relationship with Fite. I had the opportunity to discuss Moseley's relationship with Penning in a telephone conversation held in January 2020.\n\n(4) “Thumb Box Sketch,” otherwise unidentified newspaper clipping, Harvey Fite Scrapbook. This article probably appeared in the Catskill Mountain Star.\n\n(5) Sylvia Day, “Thumb Box Sketches: Harvey Fite,” Catskill Mountain Star, July 14, 1950, p. 3. ( 6) ”Fite to Show Figures Carved from Bluestone,” Catskill Mountain Star, August 17, 1945, otherwise unidentified article, Harvey Fite Scrapbook. For a recent study of Penning's life and career see the author’s essay “Native Stone: The Art of Tomas Penning,“ in Native Stone: The Art of Tomas Penning (1905-1982) (Woodstock, New York, Woodstock School of Art, 2021), pp. 7-47. Also see the three essays exploring aspects of Penning’s life and career in learningwoodstockartcolony.com.\n\n(7) This information was related to the author by Gordon Taylor (brother-in-law of the artists Konrad and Florence Ballin Cramer) in an interview of July 25, 2018. For information about the construction of the house see Gledhill Cameron, “Life of a Modern Pioneer Can be Fun: Sculptor and Wife Discover It Adds Up to Happiness,” New York World-Telegram, June 20, 1945, otherwise unidentified article in Harvey Fite Scrapbook.\n\n(8) Fite is quoted in Tram Combs, p. 45\n\n(9) Email from Tad Richards, May 27, 2022.\n\n(10) \"Mayas vs Greeks: Bard Professor Says he Prefers Former,\" New York Sun, March 4, 1938. otherwise unidentified article, Harvey Fite Scrapbook.\n\n(11) Fite is quoted in “Task at an Abandoned Quarry,” otherwise unidentified article, Harvey Fite Scrapbook.\n\n(12) Henry Morton Robinson, \"Woodstock Profiles No 1,\" The Hue and Cry 1 (June 16, 1945): 2. Robnson is identified as the author in a typescript of the article, titled “From an Abandoned Stone-Pile, An American Sculptor is Quarrying Immortality,” Harvey Fite Scrapbook.\n\n(13) Moseley, p. 5. Additionally, Ralph Moseley is the author of “Opus 40: A Sculpture by Harvey Fite,” M.A. Thesis, Hunter College, 1967. Fite’s art also is the subject of a chapter in John P. Murphy, “Back to the Garden: The Woodstock Artists’ Colony,” Ph.D. dissertation, Northwestern University, 2017, pp. 269-281. I would like to thank Tad Richards and John P. Murphy for sharing copies with the author. In his dissertation (p. 271), Murphy suggests that the architecture of the bluestone quarry amphitheater on the Maverick may have had a role in inspiring Opus 40.\n\n(14) Emily Genauer, “Fite’s Acropolis in the Woods,” New York World-Telegram, September 1, 1945, otherwise unidentified article, Harvey Fite Scrapbook\n\n(15) Maria La Yacona, \"'Acropolis in the Catskills,\" Parade Magazine, 1950, otherwise unidentified article, Harvey Fite Scrapbook.\n\n(16) Fite is quoted in Moseley, “Opus 40: A Historical Perspective,” p. 4.\n\n(17) John Beardsley, Probing the Earth: Contemporary Land Projects (Washington, D.C.: Smithsonian Institution Press, 1977), p. 35.\n\n(18) Murphy, “Back to the Garden: The Woodstock Artists’ Colony,” p. 272.\n\n(19 ) Pike is quoted in Peter Kutschera, “Sculptor’s Opus Without an End,” The Times Herald Record, May 11, 1976, otherwise unidentified article, Harvey Fite Scrapbook.\n\n\n\n\n\n\n\n\n\n\n\n"}]}