{"Mark Fite is a comedian.": [{"url": "https://www.biographies.net/people/en/mark_fite", "page_content": "Who is Mark Fite?\n\nMark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs, and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA."}, {"url": "https://simple.wikipedia.org/wiki/Mark_Fite", "page_content": "Fite in 2012\n\nMark Elliott Fite is an American actor and comedian.\n\nFite is a founding member of comedy troupe 2 Headed Dog with comedians Jim Turner, Dave Allen and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits and Wife Swappers.\n\nHe has appeared in television series including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D., Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bone Show, Friends, Seinfeld and NewsRadio."}, {"url": "https://peoplepill.com/people/mark-fite/", "page_content": "Mark Fite is an American actor and comedian.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.\n\nIn 2016, Fite performed on stage with the L.A. Philharmonic Orchestra at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program."}, {"url": "https://www.wallofcelebrities.com/celebrities/mark-fite/biography.html", "page_content": "Mark Fite - Biography\n\nMark Fite is an American actor and comedian. Besides his work in film and television, he has been very active in theatre, voiceover, comedy, improvisation, and commercials. Originally from the Midwest, Fite graduated from the University of Iowa with a Bachelor's degree in Communications and Theatre Arts. He resides in Los Angeles, California.\n\n\n\nFite is a founding member of the L.A. based comedy group Two Headed Dog, along with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. Known for their absurd characters, offbeat sketches, and loose improvisation, their antics have taken them to New York City, San Francisco, Atlanta, and Hawaii. Locally, Two Headed Dog has enjoyed many venues over the years, particularly Largo, Theatre Theater, and The Steve Allen Theater, where they have developed new material and presented multiple shows including Sashay Gigante and Clowntown City Limits.\n\n\n\nBesides Two Headed Dog, Fite is well known for creating original roles in many other hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, and Girly Magazine Party.\n\n\n\nFite has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, and The San Francisco Comedy Festival. He has also made multiple appearances at Lucha Va Voom and Brookledge Follies.\n\n\n\nHe has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\n\n\nA few favorite productions include Mitch Watson's Klub at the Actors' Gang, Justin Tanner's Wife Swappers at Third Stage, and in 2009, the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse.\n\n\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants (multiple episodes), Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio.\n\n\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Happy Endings, Courting Courtney, Mystery Cave, Janeane From Des Moines, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/11699398", "page_content": "Mark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA.[1]\n\nFite graduated from the University of Iowa with a Bachelor of Arts in Communications and Theater Arts.\n\nReferences\n\nPersondata Name Fite, Mark Alternative names Short description American actor Date of birth Place of birth Illinois Date of death Place of death\n\n\n\n"}, {"url": "https://wiki2.org/en/Mark_Fite", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican actor and comedian\n\nMark Elliott Fite is an American actor and comedian.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 21 954 308 3 059 468 23 851 070\n\nBest Fight Scenes: Michael Jai White\n\nBrain on Fire Trailer #1 (2017) Chloë Grace Moretz Drama Movie HD\n\nThe Rock Reacts to His First WWE Match: 20 YEARS OF THE ROCK Transcription Contents 1 Career\n\n2 Filmography 2.1 Film 2.2 Television\n\n3 References\n\n4 External links\n\nCareer\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.[1]\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.[2]\n\nIn 2016, Fite performed on stage with the Los Angeles Philharmonic at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program.\n\nFilmography\n\nFilm\n\nTelevision\n\nReferences\n\n\n\n"}, {"url": "https://alchetron.com/Mark-Fite", "page_content": "Mark Fite is an American actor and comedian.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has also appeared in television shows including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs, and in the short film for Dior (L.A.dy Dior) .\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles."}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=26331538&lang=en", "page_content": "Mark Elliott Fite is an American actor and comedian.\n\nCareer\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.\n\nIn 2016, Fite performed on stage with the Los Angeles Philharmonic at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program.\n\nFilmography\n\nFilm\n\nTelevision\n\nReferences\n\nMark Fite at IMDb\n\n\n\n"}, {"url": "https://wikispro.com/mark-fite-wiki-networth-age/", "page_content": "Mark Fite is an American actor and comedian.\n\nScroll Down and find everything about the Mark Fite you need to know, latest relationships update, Family and how qualified he is. Mark Fite’s Estimated Net Worth, Age, Biography, Career, Social media accounts i.e. Instagram, Facebook, Twitter, Family, Wiki. Also, learn details Info regarding the Current Net worth of Mark Fite as well as Mark Fite ‘s earnings, Worth, Salary, Property, and Income.\n\nMark Fite, better known by the Family name Mark Fite, is a popular Comedian. he was born on , in Illinois. is a beautiful and populous city located in Illinois United States of America. Mark Fite entered the career as Comedian In his early life after completing his formal education\n\nFacts You Need to Know About: Mark Fite Bio Who is Mark Fite\n\nOn Wikispro, Mark is ranked in the list of most popular Comedian,s. Also, ranked in the list with that person who was born in . Have to Position Among the list of Most Popular Comedian.\n\nMark Fite Net Worth\n\nAccording to Wikipedia, Google, Forbes, IMDb, and various reliable online sources, Mark Fite’s estimated net worth is as follows. Below you can check his net worth, salary and much more from previous years.\n\nMark‘s estimated net worth, monthly and yearly salary, primary source of income, cars, lifestyle, and much more information have been updated below.\n\nMark who brought in $3 million and $5 million Networth Mark collected most of his earnings from his Yeezy sneakers While he had exaggerated over the years about the size of his business, the money he pulled in from his profession real–enough to rank as one of the biggest celebrity cashouts of all time. his Basic income source is mostly from being a successful Comedian.\n\nhis has a whopping net worth of $5 to $10 million. In addition to his massive social media following actor\n\nMark FiteNet Worth Estimated Net Worth in 2021 $1 Million to $5 Million Approx Previous Year’s Net Worth (2020) Being Updated Annual Salary Being Updated Income Source Comedian\n\nNoted, Mark Fite’s primary income source is Comedian, We are collecting information about Mark Fite Cars, Monthly/Yearly Salary, Net worth from Wikipedia, Google, Forbes, and IMDb, will update you soon.\n\nMark Fite: Age, Height & Weight\n\nMark Fite’s age years (as in 2021), height & weight. Dress & Shoe size Updated below scroll down and check all about height & weight. Dress & Shoe size.\n\nMark Social Media Activities.\n\nhe is a famous person on social media i.e. Instagram, Facebook, Twiter, Youtube, etc. Please scroll down to see information about Mark Fite Social media accounts.\n\nMark Fite Biography First Name Mark Name Mark Fite Complete Family Name Mark Fite Date of Birth Birth Day Birth Years Birth Place Illinois Birth City Birth Country United States of America Nationality/Country United States of America Race Being Updated Ethnicity Being Updated Sun sign, Horoscope, Zodiac Sign Scorpio Famous As Comedian Also Known for Comedian Occupation Comedian Years active Started Career In How Old he was when he started his career? he was only Years old when he started his career as Comedian\n\nMark Fite Height, Weight and Body Measurement Height 6 ft 2 in (188 cm) Weight Not Known Chest Size Not Known Waist Size Being Updated Shoe Size Being Updated Hair Color Being Updated Eye Color Being Updated Body Type Being Updated Sexual Orientation Being Updated\n\nMark Fite Family, Parents, Siblings Spouse Parent Wyatt Emory Cooper\n\nGloria Vanderbilt Children 7 Father Ken Englund Mother Mabel Albertson Siblings Patricia Englund, Sister Being Updated Brother Being Updated\n\nMark Fite Current Affairs, Relation Ships, Dating What was Howland Chamberlain’s marital status? (Single, Engaged, Married, Fiancée in Relation or Divorce) Being Updated was Howland Chamberlain having any relationship affair? Being Updated Who was Howland Chamberlain’s girlfriend/Boyfriend? Being Updated\n\nMark Fite Awards and Honors Awards Independent Spirit Awards Honors Being Updated"}, {"url": "https://www.wikizero.com/en/Mark_Fite", "page_content": "From Wikipedia the free encyclopedia\n\nAmerican actor and comedian\n\nMark Elliott Fite is an American actor and comedian.\n\nCareer [ edit ]\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.[1]\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.[2]\n\nIn 2016, Fite performed on stage with the Los Angeles Philharmonic at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nReferences [ edit ]\n\n\n\n"}], "Mark Fite is a member of The Groundlings.": [{"url": "https://simple.wikipedia.org/wiki/Mark_Fite", "page_content": "Fite in 2012\n\nMark Elliott Fite is an American actor and comedian.\n\nFite is a founding member of comedy troupe 2 Headed Dog with comedians Jim Turner, Dave Allen and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits and Wife Swappers.\n\nHe has appeared in television series including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D., Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bone Show, Friends, Seinfeld and NewsRadio."}, {"url": "https://www.biographies.net/people/en/mark_fite", "page_content": "Who is Mark Fite?\n\nMark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs, and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA."}, {"url": "https://en-academic.com/dic.nsf/enwiki/11699398", "page_content": "Mark Fite is an American actor and comedian. He has appeared in a number of movies and television shows. He lives in Los Angeles, California.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is well known for creating roles and performing in many hit comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers.\n\nFite has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio.\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the world premiere comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles, CA.[1]\n\nFite graduated from the University of Iowa with a Bachelor of Arts in Communications and Theater Arts.\n\nReferences\n\nPersondata Name Fite, Mark Alternative names Short description American actor Date of birth Place of birth Illinois Date of death Place of death\n\n\n\n"}, {"url": "https://peoplepill.com/people/mark-fite/", "page_content": "Mark Fite is an American actor and comedian.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.\n\nIn 2016, Fite performed on stage with the L.A. Philharmonic Orchestra at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program."}, {"url": "https://www.wallofcelebrities.com/celebrities/mark-fite/biography.html", "page_content": "Mark Fite - Biography\n\nMark Fite is an American actor and comedian. Besides his work in film and television, he has been very active in theatre, voiceover, comedy, improvisation, and commercials. Originally from the Midwest, Fite graduated from the University of Iowa with a Bachelor's degree in Communications and Theatre Arts. He resides in Los Angeles, California.\n\n\n\nFite is a founding member of the L.A. based comedy group Two Headed Dog, along with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. Known for their absurd characters, offbeat sketches, and loose improvisation, their antics have taken them to New York City, San Francisco, Atlanta, and Hawaii. Locally, Two Headed Dog has enjoyed many venues over the years, particularly Largo, Theatre Theater, and The Steve Allen Theater, where they have developed new material and presented multiple shows including Sashay Gigante and Clowntown City Limits.\n\n\n\nBesides Two Headed Dog, Fite is well known for creating original roles in many other hit comedy shows in L.A., including Bob's Holiday Office Party, The Rudy Casoni Show, and Girly Magazine Party.\n\n\n\nFite has performed at The Comedy Store, The Improv, Upright Citizens Brigade, The Comedy Festival in Las Vegas, The U.S. Comedy Arts Festival in Aspen, Los Angeles Micro-Fest, and The San Francisco Comedy Festival. He has also made multiple appearances at Lucha Va Voom and Brookledge Follies.\n\n\n\nHe has worked with several prestigious theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and The Padua Hills Playwrights' Festival where he worked with acclaimed writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\n\n\nA few favorite productions include Mitch Watson's Klub at the Actors' Gang, Justin Tanner's Wife Swappers at Third Stage, and in 2009, the world premiere comedy Matthew Modine Saves The Alpacas alongside Matthew Modine, Peri Gilpin, and French Stewart at the Geffen Playhouse.\n\n\n\nFite has appeared in numerous television shows, including SpongeBob SquarePants (multiple episodes), Grey's Anatomy, Rizzoli & Isles, Rules of Engagement, The Naked Trucker and T- Bones Show, Arliss, The Drew Carey Show, The Andy Dick Show, Tenacious D, Mr. Show, Friends, Seinfeld, and NewsRadio.\n\n\n\nFite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Happy Endings, Courting Courtney, Mystery Cave, Janeane From Des Moines, Elephant Sighs (with Ed Asner), and in 2011, a short film for Dior (L.A.dy Dior) opposite Academy Award winning actress Marion Cotillard, directed by John Cameron Mitchell.\n\n"}, {"url": "https://alchetron.com/Mark-Fite", "page_content": "Mark Fite is an American actor and comedian.\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave (Gruber) Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has also appeared in television shows including SpongeBob SquarePants, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off The Lip, Elephant Sighs, and in the short film for Dior (L.A.dy Dior) .\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles."}, {"url": "https://www.wikizero.com/en/Mark_Fite", "page_content": "From Wikipedia the free encyclopedia\n\nAmerican actor and comedian\n\nMark Elliott Fite is an American actor and comedian.\n\nCareer [ edit ]\n\nFite is a founding member of the comedy group 2 Headed Dog with comedians Jim Turner, Dave Allen, and Craig Anton. He is known for creating roles and performing in comedy shows including The Tony Martini Variety Hour, Bob's Office Party, The Rudy Casoni Show, Girly Magazine Party, Clowntown City Limits, and Wife Swappers. Fite has worked with several theatre companies in Los Angeles, including The Actors' Gang, Theater of NOTE, and Padua Hills Playwrights' Festival where he worked with writers Murray Mednick, Leon Martell, Marlane Meyer, and John Steppling.\n\nFite has performed at multiple comedy venues and festivals around the country, as well as appearing at local L.A. favorites, Lucha VaVoom and Brookledge Follies.\n\nIn the 1990s, Fite had a prominent role as \"Mark the Trasher\" on the MTV game show Trashed, on which he destroyed the prized possessions of unlucky contestants. He has since appeared in television shows including SpongeBob SquarePants, Infinity Train, Agents of S.H.I.E.L.D, Scandal, Criminal Minds, Clash-A-Rama!, Parenthood, Grey's Anatomy, Rules of Engagement, The Naked Trucker and T-Bones Show, Friends, Seinfeld, and NewsRadio. Fite's varied film credits include Fight Club, Independence Day, Godzilla, Off the Lip, Elephant Sighs, The Adventures of Pinocchio, and in the short film for Dior (L.A.dy Dior) with Academy Award Winner Marion Cotillard, directed by John Cameron Mitchell.[1]\n\nIn 2009, Fite performed in the comedy Matthew Modine Saves the Alpacas alongside Matthew Modine and French Stewart at the Geffen Playhouse in Los Angeles.[2]\n\nIn 2016, Fite performed on stage with the Los Angeles Philharmonic at Walt Disney Concert Hall in La Mer, part of the L.A. Phil Symphonies For Youth Program.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://www.ranker.com/list/famous-groundlings/user-x", "page_content": "List of Famous Groundlings Members ranked by fame and popularity. The Groundlings are a famous improv and sketch comedy group based in Los Angeles. The Groundlings School has been the training ground for some of the funniest people in Hollywood. After completing the advanced school level, participants may join the Sunday company. If a comedian is successful in the Sunday spot, they will be asked to join Groundlings main company.\n\nWho is the most famous Groundlings alumni? Funnyman Will Ferrell tops our list. Before making his way to “Saturday Night Live,” Ferrell performed with Groundlings in 1995, along with Jennifer Coolidge, Chris Katan and Cheri Oteri. Other “SNL” vets that got their start at Groundlings include Kristen Wiig, Jon Lovitz, Phil Hartman, Chris Parnell, Maya Rudolph and Taran Killam.\n\nIn 1981, Groundlings debuted their first alternative show, Paul Reubens' “Pee Wee Herman Show.” The show played at midnight and featured Reubens, Phil Hartman and John Moody. The show quickly became a huge hit prompting HBO to make it the focus of a comedy special, which somehow led to the popular kids program “Pee Wee's Playhouse.”\n\nAre you impressed by all of the great talent that has come through Groundlings? Share your thoughts in the comments section."}, {"url": "https://www.broadwayworld.com/los-angeles/article/BWW-Interview-The-Groundlings-Michael-Churven-Throws-It-All-In-To-Keep-Grounded-in-The-USA-20210924", "page_content": "The Groundlings' latest Friday/Saturday night show A GROUNDLING ON ELM STREET began previews back on The Groundlings stage live September 18, 2021.\n\nHad the chance to chat with one of The Groundlings hilarious company members, the always funny Michael Churven on his Groundlings history, his tendency to slip into his Australian drawl, and his Superman stint that kept Ed O'Neill breaking up.\n\nThank you for taking the time for this interview, Michael!\n\nMy pleasure! Thank you for having me.\n\nWhat cosmic comedy forces first brought you into The Groundlings universe?\n\nThe first time I ever saw a Groundling perform was on the British version of the TV show Whose Line Is It Anyway? when Karen Maruyama was in the cast. She was side-splittingly hilarious, and I promised myself that if I ever made it from Australia to Los Angeles, I would make a beeline for The Groundlings. When I finally did make it to Los Angeles and saw a show at The Groundlings for the first time, it was love at first sight!\n\nHow long did you perform with The Groundlings before you were promoted to Main Company Member?\n\nMy first class in Basic Improv was with the amazing Kevin Berntson in 2011 and I was invited into the Main Company in 2016, so I trained for five years in total.\n\nDid you start writing your own sketches right away? Or did you begin by supporting your fellow Groundlings' sketches?\n\nThe skill we hone at The Groundlings is to write your own character-based sketches that you will perform in. So you start writing your own sketches right away in the Writing Lab and Advanced Lab levels at The Groundlings School. It's an exhilarating process because the aim is to write something that only you can perform and that you have as much fun as possible doing in front of a live audience.\n\nDo you have a notebook or tape recorder to note the crazy, normal events of the day as possible sketch subjects?\n\nAbsolutely! I have a notebook, an audio recording app on my phone, and I surreptitiously take pictures and videos of people on my phone's camera that all serve as inspiration for creating characters or moments between people that can be the seed for a sketch. They are all just little snippets and I do it all from a distance so hopefully no one knows that they're being recorded! But you never ever know where the next piece of inspiration is going to come from, and you have to record it or it disappears from your mind. Most if not all my best characters come from observing real people and relationships.\n\nWhen did you become a Groundlings teacher?\n\nI first started teaching in 2016, shortly after being invited into the Main Company.\n\nWas it your idea to teach a Groundlings workshop at 16th St. Actors Studio in your home country?\n\nNot at first. 16th Street Actors Studio already had a great relationship with The Groundlings because an incredible founding member of The Groundlings Phyllis Katz had previously taught there. I happened to be back in Melbourne one year and the opportunity came up to teach while I was there, so it was a happy accident, but now whenever I go back to Australia, I love to let 16th Street Actors Studio and other improv and theater schools in Australia know that I'll be there because I love to bring The Groundlings style of improv and sketch to Australia. I think Australians have such a relaxed and playful attitude towards improvisation and characters. Australians just love to take the piss, so The Groundlings style works extremely well with the Australian sense of humor.\n\nDo you slip into your Australian drawl whenever you're with your fellow Aussies?\n\nYes, and I love it. And it's not just the accent. When I'm back in Australia teaching or performing, suddenly I have access to a whole vocabulary that I can't really use in the U.S. because no one would know what the hell I'm saying. So, it's a joy to let all those references and cultural allusions fly.\n\nWhat spurred you into coming to the U.S. in the early 2000s?\n\nThe adventure. And I wanted to be in a place where there was a critical mass of improv and sketch theaters that I could really dig into. I'm still on my adventure decades later.\n\nWho were your comedy idols growing up?\n\nIn the early 90s, there was a TV show in Australia called Fast Forward. It only ran for four seasons but it's probably the best sketch comedy show to ever come out of Australia, and every episode is burned on my brain. The performers were brilliant: Steve Vizard, Jane Turner, Gina Riley, Magda Szubanski (the three of whom went on to do Kath & Kim), Marg Downey, Michael Veitch, Peter Moon. They were like the Australian Saturday Night Live and I still feel inspired by them.\n\nHow old were you when you decided you wanted to be on stage?\n\nI think I saw a blank stage at a shopping mall when I was six and instinctively got up on it.\n\nWhat is the one thing a teacher or director told you that you adhere to to this day?\n\nI had Jim Rash as my director in Writing Lab at the Groundlings, and he had this extraordinary way of taking simple information and making it hilarious when it was put through the lens of a character. I remember thinking, \"Oh, you don't have to push the information and write witty dialogue. If you just write something simple and truthful, the characters and the relationship and the emotion can take care of the comedy.\"\n\nYour \"Breakfast in Bed\" sketch in GROUNDLINGS ROYAL WEDDING had me holding my sore stomach from all the laughter your non-verbal reactions caused. Do you have an especially favorite sketch that you wrote that went exceptionally well beyond your wildest imaginations?\n\nThanks! I wrote 'Breakfast in Bed' with Patty Guggenheim, and I love writing with her because we tend to write these intense relationship sketches together that don't need much dialogue. Probably my favorite sketch is called 'Jazz' about a man who is performing a variety show celebrating jazz at the Hampton Inn when suddenly in the middle of his act he can't get the lid on his CD player to close. It's another sketch with minimal dialogue and it's a fun character to play because he's really going through a tough moment but has to sing and dance through it which gets the audience on board. When I first started writing the sketch, all I knew was that I had a busted old boom box from Goodwill, but I've since performed the sketch at The Groundings and at the Just For Laughs Festival in Montreal. I could never have predicted that!\n\nIn GROUNDLINGS HALLOWEEN, you closed the show with \"Song Improv.\" Channeling The Doors' Jim Morrison, you wonderfully sing an improv-ed version of \"This Is the End,\" topping off your rocker act with gymnastic flips and tumbles. Is gymnastics one of your special skills on your resume? What other special skills do you have?\n\nYes, I love to throw in gymnastics whenever I can because it's so surprising to the audience if you can make it organic to the scene. You have to throw whatever you can at it to make the audience laugh! Ball skills, juggling, pratfalls, none of which I can do! But I love to sing and dance, so those are skills I love to throw at it.\n\nAny plans for a new edition of THE GALE?\n\nYes, I'm hoping THE GALE comes back soon. Chris Eckert does an amazing job of directing that show so I'm excited for the new edition.\n\nWould you share some good memories of your Superman stint on Modern Family?\n\nIt was such a juicy line that the writers had written for my character and when we came to rehearse it with me dressed up as this sad classically trained actor in a Superman costume doing a kids party, Ed O'Neill kept breaking. The writers had fun with the character and brought him back several more times to place him with the other families on the show, so it was such a joy to play such a sad man several times in the Modern Family world!\n\nThank you again, Michael! I look forward holding my sore stomach again with you on stage.\n\nMy pleasure! Thank you and see you at The Groundlings."}, {"url": "https://www.latimes.com/entertainment-arts/story/2020-12-22/racial-reckoning-groundlings-leonard-robinson-covid-comedy", "page_content": "Part of a year-end series revisiting the subjects of some of our most popular arts articles of the year.\n\nActor and comedian Leonard Robinson has no problem with Tom Cruise’s recent on-set rant about COVID-19 safety. After being shut in and shut down for so long, he gets why any behavior that could compromise a successful return to set or stage would be upsetting.\n\n“All you have to do is follow these protocols!” Robinson said. “Even if you believe COVID is a hoax, your paycheck doesn’t.”\n\nRobinson would know. He’s prepping to return in January to the Season 5 set of Issa Rae’s HBO comedy “Insecure,” in which he plays the recurring role of Taurean Jackson. He’ll be required to test up to five times a week, he said.\n\nAdvertisement\n\nA few months ago, Robinson tested three times before spending two days on the set of a forthcoming Kristen Bell film, “Queenpins.”\n\n“I had more testing days than shoot days,” he said.\n\nRobinson is also a main company member of the Groundlings, the sketch and improv comedy troupe that this summer, along with Upright Citizens Brigade, came under fire for a lack of diversity and inclusion. As one of three Black main company members, Robinson spoke with The Times in July about his belief that the Groundlings could and would do better in the future.\n\nFive months later, Robinson said the company has made meaningful strides. It has hired an equity and inclusion consultant who regularly holds educational and training sessions on Zoom. More attention is paid to bias when it pops up in the classroom, either with students or staff. Recruitment efforts have been amped up, as have scholarships, and the company is making room for more people to get seen onstage, he said.\n\nLeonard Robinson will return to the set of HBO’s “Insecure” in January. (Mel Melcon / Los Angeles Times)\n\nRobinson landed his first Groundlings directing gig overseeing the company’s inaugural attempt at livestreaming sketch comedy via Zoom for the annual holiday show.\n\n“The biggest challenge for me as a director was, in a strange way, just convincing them that it could be done,” Robinson said, adding that throughout the pandemic the company has done Zoom improv. But sketch, with its reliance on a script and its need for a more structured narrative, was far more difficult to pull off.\n\nDespite the obvious pitfalls of performing live without physical human interaction, Robinson said that Zoom sketch comedy has its silver linings. The Groundlings’ physical theater holds 99 seats; the Zoom theater is infinite. The holiday shows, Robinson said, were watched by about 300 people each night, some from Brazil, South Africa and Germany.\n\nThe chat room morphed into a raucous forum for laughter, commentary and communication during the shows. Even the actors were able to chime in from time to time. The more lively a chat room, the more Robinson and the cast knew a particular sketch was hitting its stride.\n\n“As much as everybody loves bingeing on Netflix, that relationship is not interactive,” Robinson said. “TV doesn’t talk back to you, it doesn’t care.”\n\nDirecting Zoom shows, Robinson said, does have one very specific quirk: “Every scene is your close-up, which is exhausting.”\n\nWith your face in the Zoom box, there is no room to have a false moment, and because the show is streaming live, nothing can be hidden in an edit. Robinson had a limited amount of Zoom views to choose from. Two boxes, or a full grid? Maybe three? How about four?\n\n“We basically pushed Zoom way past the limits of what it’s intended to do,” Robinson said.\n\nDuring a recent livestream, audience members in the chat room clearly enjoyed a series of sketches grounded in the coronavirus-era world of online communication. Jokes that tapped into the possibilities of digital miscommunication and faux pas were particular favorites.\n\nThe shows worked so well, Robinson said, that the Groundlings will likely do a few more sketch shows before summer arrives, at which point hopes are high that maybe, just maybe, actors and audiences can return to the theater. For Robinson that means doing regular stand-up at the Comedy Store in addition to his work with the Groundlings.\n\nUntil then, Robinson said, “I’ll perform as many shows online as they’ll let me.”"}]}