{"Philippe Dodard was born in Port-au-Prince, Haiti.": [{"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://haitianartsociety.org/dodard-philippe-haitian-b-1954", "page_content": "Photo by Ian Willms\n\nPhilippe Dodard, often called the Picasso of Haiti, is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas. He received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966.\n\n\n\n“I have to hear the voices. I have to feel the heartbeat. It is a way to be in contact with yourself and the universe.” PHILIPPE DODARDCredit...\n\n"}, {"url": "https://moneyinc.com/richest-people-haiti/", "page_content": "Haiti is a country with only a handful of billionaires in residence but there are some very rich families that call the popular vacation destination home. In the country, there are 10.8 million citizens with a staggering unemployment rate of 40.6 percent and an inflation rate of 14.7 percent, according to Forbes.\n\nHaiti has a free market economy where the rich can get richer with low labor costs, but the poor are hard-pressed to change their economic status with few jobs and low wages.\n\nWe were curious about who is the richest person in Haiti, and who are the richest families? We did the research to discover the ten richest people in Haiti.\n\n10. Michel Joseph Martelly Net Worth – $5 million\n\nAccording to Batmanisback, Michel Joseph Martelly is the son of Gerard and Marie Martelly. he was born in Haiti, and spent time moving from Haiti to the United States. He spent a great deal of time in Floria.\n\nHe returned to Haiti at the time when Jean Claude Duvalier was going into exile. Martelly was the president of Haiti prior to leaving. He was succeeded by Jocelerme Privert who took his place as interim president when Martelly was forced to resign amid allegations that he had committed fraud during the elections.\n\nThis made it necessary for elections to be redone after audits found inconsistencies.\n\n9. Philippe Dodard Net Worth – $102 million\n\nAccording to TopMostTen, Philippe Dodard is a graphic artist and painter from Haiti who is the ninth richest person in the country with a net worth of $102 million. Mr. Dodard was born in 1954 in Port-au-Prince. Dodard attended the PotoMitan art school with Frido Casimir, Patrick Vilarie, and Tiga Garoute. he won first prize at the Junior Seminary of St. Martial College in 1966 for one of his drawings.\n\nHe also attended the Academy of Fine Arts in 1973. he worked as a model maker for a while, then launched his own audiovisual graphic arts studio. He specializes in Graphic Design Pedagogical. In addition to being a painter, sculptor, ironworker, and jewelry maker, he also tours to provide lectures on Haitian culture.\n\n8. Clifford Apaid Net Worth – $350 million\n\nClifford Apaid attended Florida International University earning his bachelor’s degree in Information Systems Management, as well as a degree in Finance. He also earned a master’s degree in International Finance.\n\nMr. Apaid is the vice president of the Apaid Group, in the manufacturing division. He also serves on the board of directors for the SOFIHDES Development Bank in Haiti and is on the board of the Haitian Association of Industries. He also manages the business affairs for the company in the United States as well as in the Dominican Republic.\n\n7. Eric Jean Baptiste Net Worth – $500 million\n\nEric Jean Baptiste is a Haitian who is involved in the lottery industry in Haiti. He owns Pere Eternel, which is the second-largest lottery in the country. His estimated net worth is $500 million.\n\n6. Marc Antoine Acra Net Worth – $600 Million\n\nMarc Antoine Acra is a resident of Haiti known for his import and export company that does an annual business of $10 million in generating income. He is a Haitian businessman and philanthropist who attended Boston University, studying finance and marketing. He also attended MIT and has become an expert in management, sales, and marketing.\n\n5. Eric Reginald Bolous Net Worth – $620 million\n\nEric Reginald Bolous has an estimated net worth of $620 million. He was born in 2956 and is a third-generation resident of Haiti with Lebanese/Haitian ancestry. Bolous is the president of the National Chamber of Commerce and Industry in Haiti. He is a physician as well as an entrepreneur, a businessman, and a philanthropist. He also owns businesses that operate in the chain-store industry.\n\n4. Jean Bertrand Aristide Net Worth – $800 million\n\nJean Bertrand Aristide is a well-known Haitian politician who was born in Port Salut, Haiti in July of 1953. He is a Salesian order Roman Catholic priest as well as a politician. Aristide has made a name for himself representing the people of Haiti who suffer poverty and who are marginalized by the elite. Hean became the president of Haiti in 1991.\n\nHe was absent from Haiti for a number o years after being exiled to South Africa and the Central African Republic but was able to return to Haiti in 2011. He was in exile for seven years before being allowed back into his home country.\n\n3. Gregory Mevs Net Worth – $1 billion\n\nGregory Mevs owns one of the largest conglomerates in the Caribbean with holdings under the WIN Group. His interests include baseball manufacturing, a $10 million cement plant in Haiti, cooking oils, industrial parks, and other industries including warehousing and industry. Gregory Mevs and his family are among the richest persons in Haiti for 2021. The Mevs families have interests in various different industries throughout Haiti and they’re considered to be one of the richest and most powerful families throughout the country.\n\n2. Gilbert Bigio Net Worth – $1.2 billion\n\nAccording to Wikipedia, Gilbert Bigio is a retired businessman and Haitian billionaire. he founded the GB Group which has prospered and grown to make him the second richest person in the country of Haiti. He is the leader of the Haitian Jewish Community and serves as an honorary consul to the nation of Israel. His family emigrated to the country of Haiti in 1896, and Gilbert is a native Haitian.\n\n1. Denis O Brien Net Worth – $6.8 billion\n\nAccording to Quora, Denis O’Brien is the richest person in Haiti. he is an Irishman who has made billions of dollars through his investments in Digicel, the largest telecom company in Haiti. He went from nearly nothing to a large fortune with a near-monopoly on the Haitian phone market."}, {"url": "https://www.topmost10.com/haiti-richest-top-7-multi-millionaires-and-their-net-worth-in-2019/", "page_content": "Do you know who is Haiti’s richest man in June? Topmost10 presents a profile of the Millionaires in Haiti, 2019. There are still some big names in this list. They are Gilbert Baggio on the right, Clifford Apaid, Michael Madsen, Eric Jean Baptiste. But this article gives their current net worth in ascending order (from lowest to highest)\n\nTop 7 Multi-Millionaires from Haiti and their Net Worths in 2019\n\n7. Philippe Dodard\n\nestimated value is 102 million\n\nIndustry: Arts and Paintings\n\nPhilippe Dodard (born in 1954) is a graphic artist and Haitian painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first drawing prize at the Junior Seminary of St-Martial College in 1966. He studied at the PotoMitan art school with Jean-Claude “Tiga” Garoute, Patrick Vilaire and Frido Casimir.\n\nIn 1973, he entered the Academy of Fine Arts. Then he worked as a model maker and founded an audiovisual graphic arts studio. In 1978, he received a scholarship at the International School in Bordeaux, France, allowing him to specialize in Graphic Design Pedagogical.\n\nTwo years later, he received a grant from the Rotary International Foundation and toured Haiti’s Group Study Exchange to give lectures on Haitian culture. His works of art have evolved to include large sculptures, iron works and beautiful jewelry."}, {"url": "https://m.haitiopen.com/story/article/amazing-art-collection-at-the-marriott-port-au-prince/", "page_content": "The Marriott Port-au-Prince showcases art created by local Haitian artisans throughout the hotel’s guest rooms, corridors, great room, conference areas, restaurant and courtyard. The hotel’s art curator, Philippe Dodard, is a renowned Haitian artisan whose work inspired Donna Karan’s Spring 2012 collection. Dodard worked together with local artists to create the overall vision of the hotel’s decor. His own pieces appear in the hotel along with works from the following artisans:\n\n• Peter Satyr Jacmel – Painted paper machè animal masks & vessels on wall in reception area and lobby\n\n• Delve – Wood sculptures in Cafè Cho\n\n- Advertisement -\n\n• Rafaelle Castera – Photography of Haiti and people in Cafè Cho, guest rooms, ballroom foyer, and meeting spaces\n\n• Yves Delva – Voodoo flags in the great room\n\n• Mosaique Gariere – Painted tile wall in the restaurant\n\n• Jean Eddy – Metal wall art in private dining room\n\n• Cookie Villard – Light fixtures in the restaurant and great room\n\n• Sylvais – Painted paper machè vessels & tobacco leaf vases in library\n\n• Einstein Albert – Obeche wood bowls on shelves in restaurant\n\n• Ronald Mevs – Painting in boardroom\n\n• Paula Coles – Recycled t-shirt art in the ballroom\n\n• Jolimeau – Metal art in the guest room corridors\n\n• Roclor – Stone sculpture on the outside terrace In addition to displaying Haitian-made art, the Marriott Port-au-Prince also features weekly art markets where guests can buy art from local artists on the hotel grounds. On-site shops like 2nd Story Goods also feature a wide range of locally-produced art pieces for purchase."}, {"url": "https://time.com/3663893/haiti-photographers/", "page_content": "For decades, as Haiti has weathered political upheavals, coups d’état, economic crises and natural catastrophes—including the devastating earthquake that killed more than 160,000 people in 2010—photographers have nurtured an enduring, and at times tense, relationship with the small Caribbean country.\n\nHaiti’s vibrant society, pulsating energy and stunning light, combined with its tragic and violent history, consistently attract photographers of all ages and nationalities. Many of them are inspired by Alex Webb’s seminal work Under a Grudging Sun, which continues, to this day, to influence their aesthetics.\n\nWebb’s first trip to Haiti, back in 1975, transformed him—both as a photographer and as a human being. “I photographed a kind of world I had never experienced before, a world of emotional vibrancy and intensity: raw, disjointed, sometimes beautiful, often tragic,” he tells TIME. “I encountered a world that kept drawing me back, again and again.”\n\n“I have this idea that Haiti chooses you,” echoes photographer Maggie Steber, who first visited the country 35 years ago. “If she doesn’t want you there, she will do everything in her power to make you run screaming for the next plane out of there. But if she likes you, if she recognizes in you a kindred spirit, she doesn’t let you go and she wrings your heart out every day. She uses you up.” Steber’s first experience with Haiti came when she moved to New York after living in Africa; she was missing living abroad and Sipa’s director Gökşin Sipahioğlu suggested that Haiti might satisfy that craving. She arrived just when President Jean-Claude Duvalier fell in a coup d’état.\n\n“Then, everything exploded. It was thrilling. It was exciting. There was so much happening,” she recalls. “For the first time, people could really speak their mind. It was a country finally letting go after taking this deep breath. To me, that’s when the story really started to unfold. That’s when I was spellbound by it.”\n\nWhen Bruce Gilden first landed in Haiti in 1984, he rented a car with his first wife and, as he was driving to the hotel, he turned to her and said: “Where have I been my whole life?” Since then, Gilden has made 22 visits to the country. “Every time I’d go, I’d find something else to photograph,” he says. The stunning light hooked him first, but the reason he returned so often was all about the people. “They love me and I love them,” he says. “They are my people.”\n\nTogether, these photographers and many of their contemporaries have shot, published and exhibited thousands of images of Haiti—many of them with the stated goal of contributing to the dialogue about this “complicated country that has had such a difficult and tragic history,” says Webb. And yet, five years after a 7.0-magnitude earthquake destroyed large parts of Haiti and brought unprecedented attention to the country with billions of dollars of aid pledged and hundreds of NGOs setting up operations there, the situation remains grim, calling into question the photographers’ roles.\n\nSee how Haitian photographer Daniel Morel, one of the first photographers on the scene, covered the 2010 earthquake.\n\nThe deep connection many photographers feel when they first visit Haiti battles against the frustration many of them feel for a country that doesn’t seem to be able to escape its cruel fate.\n\n“I do feel a frustration because every time Haitians try to take a step forward, something happens that sends them back two steps,” Steber tells TIME. “I think it’s frustrating for a lot of photographers.” For the Miami-based photographer, Haiti’s troubled situation can be traced back to the country’s slave revolt in the early 1800s. “Haiti had the only successful slave uprising at a time when the whole world’s economy was rotating around slaves, so the world turned its back on Haiti,” she says. “In a way, Haiti seems to have been punished by fate.”\n\nIn the last five years, the number of photographers visiting the small Caribbean country has surged, coinciding with the flock of NGOs pledging to help Haitians recover from the earthquake. While the organizations “are absolutely vital in moments of crisis or natural disaster,” says Institute photographer Paolo Woods, the situation in 2015 tends to show that in the long-term, NGOs’ impact on the country remains ambiguous. “I’m often asked what’s the difference between before and after the earthquake,” Gilden adds. “There’s no difference. Haiti is poor and nobody cares.”\n\nThat’s a problem that hits home with photographers too. Though their goal is not the same as NGOs’, the nation’s poverty is ostensibly on display in their work, and they wrestle with how to show that world without harming the people in it. Photography that is not carefully considered can contribute, at times, to the reinforcement of stereotypes frequently applied to developing countries across the globe, from Africa to Latin America to Asia.\n\n“As photographers, we tend to go to places with our eyes and brains already full of images, and very often, unfortunately, we try to confirm those images,” says Paolo Woods, who moved to Haiti five years ago to work on his book State. The photographer doesn’t deny that Haiti is crippled by its unstable political situation and deep-rooted poverty, but, he says, that’s only one side of the story. “When you look at images from Haiti, you get this impression of a country that’s very far away from what it actually is,” he says. “For me, it was just a matter of looking around [to find other stories to tell.]”\n\nWoods only had to look around his hotel, where he stayed during his first month in Haiti, to find his story—one that centers on Haiti’s rich, upper-class population. “It was in December 2010, and we were getting close to the one-year anniversary of the earthquake, so a lot of journalists had come back to Haiti to do a story,” he says. “At that time, I was still living in a hotel in Port-au-Prince where a lot of media people gathered. What astonished me was that in this nice hotel, with working wifi and a swimming pool, you’d have all these photographers getting on motorbikes in the morning to go to Cité Soleil [one of the country’s poorest slums], take hundreds of images, and then come back to the hotel without ever looking at anything else.”\n\nIn the same hotel, in its lobby, restaurant and swimming pool, rich Haitians would come to wine and dine. “I thought this was interesting,” says Woods. “Who are these people? How did they make their money? How do they spend it? That became one of the multiple stories that built my book State.”\n\nIn his photographs, Gilden has tried to steer clear of the conflicts and the political mess, focusing, instead, on the everyday life of Haitians, whom, he says, he cares deeply about. Yet, his goal was never to change their lives. “I know [photographers] can’t change the world. If [we could], things would not be the same as they were 10 years ago, 20 years ago or 50 years ago.”\n\nSome photographers—Steber and Woods included—have started looking for ways to give back to Haitians, often through photographic workshops. “I teach photography with the goal of encouraging education and to empower Haitians,” says Steber. “We leave the cameras behind and we come back to teach them again and again. It’s about training them to re-seize their country, to appreciate it and to see the possibilities for themselves.”\n\nFor Woods, it’s also a way to allow Haiti to be defined, photographically, by its own people. “I often get calls from NGOs, and I always try to refer them to Haitian photographers,” he says. “It makes a lot more sense. I think a country is healthy when its own citizens can tell its story.”\n\nCertainly, Haiti, which is just a two-hour, $200 flight away from Florida, will continue to charm, attract and inspire photographers to produce “significant and deeply committed work, ranging from classical photojournalism to highly interpretive photography,” says Webb. And not just because “the country is poor, or has horrific political violence,” he adds. “There is something about the intense sense of life intertwined with the perpetual presence of death that courses through the society; something about the vibrancy of the people alongside the tragedy of their circumstances; something about a kind of beauty that co-exists with pain and sorrow. Trying to somehow come to terms with such paradoxes may well be a clue as to why the country has inspired—and continues to inspire—photographers as well as writers.”\n\nOlivier Laurent is the editor of TIME LightBox. Follow him on Twitter and Instagram @olivierclaurent\n\nAlice Gabriner, who edited this photo essay, is TIME’s International Photo Editor.\n\nContact us at letters@time.com."}, {"url": "https://galeriemarassa.com/about/", "page_content": "Michele Gardere Frisch was born in Port-au-Prince, Haiti in 1955. She is the daughter of Mrs Marie Jose Nadal and of Mr Yves Gardere.\n\nWith a degree in Art and Design of the Environment from the school of Decorated Arts in Madrid, Spain and The New England School of Art in Boston, Massachusettes (currently Suffolk University), she moved bock to Haiti after her studies and opened Galerie Marassa.\n\nShe married in 1977 Wilhelm C.H.Frisch and has a son, Wilhelm III, and two daughters, Patricia and Stephanie.\n\nSince the early days of her professional life, Michele Frisch has engaged in the promotion of culture and tourism in Haiti. She is on the board of these following organizations:\n\n• Le Musee d’Art Haitien du College St Pierre\n\n• La Fondation Culture Creation\n\n• L’Association Touristique d’Halti\n\n• La Fondation Lucienne Deschamps\n\n• Le Groupe de Support MEDISHARE\n\nThroughout the lost 30 years, Mrs Frisch has organized over 150 art exhibits with Galerie Marasso all over the world, and has participated in numerous trips and fairs for the promotion of Haiti. She has also organized numerous fund raisers to benefit social and cultural projects.\n\nMichele Frisch is the editor of the book on Philippe Dodard “Soir d’Encrier” Collection Galerie Marassa/Editions Henri Deschamps and of the book “Pour Que Vive la Ligne”, l’oeuvre Picturale de Sacha Tebo, Texte de Gerald Alexis, Collection Galerie Marossa/ Editions Deschamps."}, {"url": "https://www.uncommoncaribbean.com/haiti/checking-into-the-marriott-port-au-prince-haiti/", "page_content": "Checking Into The Marriott Port-au-Prince, Haiti\n\nYou notice it the minute you walk through the front doors – front doors held open for you with a stately grace more common of private mansions, “ritzy” hotels, or “saintly” resorts. The handsome bellman’s ready smile melts the stress of modern travel from your mind at an instant. Light earth tones, clean lines, and sophisticated Caribbean-chic art decor make it clear:\n\nThis is no ordinary hotel.\n\nAnd not just by Haiti standards either.\n\nYes, this is Haiti…\n\nSpecifically, this is the Marriott Port-au-Prince, Haiti’s newest hotel, an enclave of style and serenity in the heart of the region’s most bustling city, and a triumph of sustainable hotel development on the World Stage.\n\nThe all-new 175-room property that opened in February 2015 has recently become my home away from home on the frequent business trips I’ve been lucky enough to make to Haiti in recent years. I’ve got day job business reasons for that, sure, but even if I didn’t, you’d regularly find me here whenever I was in PAP.\n\nModern, super-comfy, and well-appointed rooms like this are one reason why…\n\n(If I’m ever late for a morning meeting in Haiti, it’s because of this bed. It literally envelopes and pampers every part of my being, soothing whatever muscles or nerves that may have been stressed throughout the day.)\n\nInventive and exclusive cocktails from new friends like Oldy help too.\n\nMore than anything else, though, I’m always struck by the great lengths that the Marriott Port-au-Prince goes to bring the best aspects of the authentic Haitian experience in through those same magical front doors for guests to enjoy.\n\nYou taste it in the cuisine at the fabulous on-site La Sirene Restaurant. Chefs here go beyond the few cursory local dishes you might find on restaurant menus in similarly styled U.S.-flagged city hotels in other parts of the Caribbean. Soup Joumou, Beef Kibby, Griot, Lambi Creole – the local culinary delights at La Sirene are worth stopping in and savoring, whether you’re staying here or not.\n\nYou also see and experience the best of authentic Haiti in the expansive and exceptional art collection at the Marriott Port-au-Prince. Expertly curated by Philippe Dodard, a renowned Haitian artisan whose work inspired Donna Karan’s Spring 2012 collection, the hotel’s treasure trove of art celebrates the works of 22 different local artists.\n\nThe works are moving, inventive, and uniquely Haitian, oftentimes employing upcycled materials (like the metal used here) to create indelible representations of Haitian history, culture, daily life, and national pride. I routinely spend a portion of each stay here simply strolling around and enjoying the art, always seeing and discovering something new; sometimes about the property, sometimes about myself, always about how special Haiti really is.\n\nNot content to simply showcase the wonders of Haiti, the Marriott Port-au-Prince was also specially designed to help preserve the country’s natural resources.\n\nFully 60% of the hotel’s hot water demands are met by thermo solar panels stretching across the roof. A one-megawatt solar farm located nearby further minimizes the hotel’s carbon footprint, a big deal in a burgeoning city largely choked most afternoons by excessive auto emissions and the smoke that comes from cooking with coal (the most common cooking fuel in Haiti).\n\nYou’d never know of the smoke or the general chaos in the surrounding streets while sitting poolside at the Marriott Port-au-Prince, though…\n\nPeace, calm, and sweet serenity in sophisticated surroundings that speak to the magic of Haiti’s past and the great potential of her future – indeed, the Marriott Port-au-Prince is anything but ordinary.\n\nFor reservations and more information, visit the Marriott Port-au-Prince online.\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave\n\nRelated Posts"}, {"url": "https://www.britannica.com/place/Port-au-Prince", "page_content": "Port-au-Prince, capital, chief port, and commercial centre of the West Indian republic of Haiti. It is situated on a magnificent bay at the apex of the Gulf of Gonâve (Gonaïves), which is protected from the open sea by the island of La Gonâve. The city was laid out in a grid pattern in 1749 by the French and called L’Hôpital. It has suffered frequently from fires, civil strife, and earthquakes. Quakes in 1751 and 1770 destroyed much of the city. In January 2010 another powerful earthquake, of magnitude 7.0, struck; its epicentre was southwest of the city, and it devastated Port-au-Prince and the surrounding region. Hundreds of thousands were killed or injured, and large swathes of the city were reduced to rubble.\n\nPort-au-Prince replaced Cap-Haïtien as the capital of the old French colony Saint-Domingue in 1770 and was retained as the capital of the newly independent country of Haiti in 1804. In 1807 its port was opened to foreign commerce. Sanitary conditions were improved during U.S. occupation (1915–34). The city’s bicentennial was commemorated in 1949 by an international exposition, the site of which is a palm-fronted promenade, now neglected and run-down.\n\nBritannica Quiz 39 of the Most Challenging World Capitals Across History\n\nUnemployment is extremely high. There are some foreign-owned factories and assembly plants in the vicinity of the airport, but, otherwise, employment is mostly to be found in the informal sector, in such activities as cooking, shelling peanuts, and selling paintings and other handicrafts. There is air service to the United States, Canada, and France as well as to other Caribbean islands; however, the area surrounding the capital’s international airport has been the site of violence, some of it caused by United Nations peacekeeping force conflicts with armed gang members. The level of tourism fluctuates with political conditions and has been in decline since the civil unrest and economic crisis of the 1980s. Tourism was also affected by the AIDS scare of the early 1980s, in which Haiti was erroneously identified as the place of origin for the disease. By the late 1980s AIDS researchers had found that tourists had brought the disease to Haiti in the 1970s, though extreme poverty and lack of education still contribute to the spread of HIV in Port-au-Prince and throughout Haiti.\n\nThe Place du Champ-de-Mars—the site of a number of historically notable structures in the centre of the city—was hit hard by the 2010 earthquake. The National Palace (rebuilt in 1918) collapsed. Other notable landmarks include the Cathedral of Notre Dame and the adjacent colonial cathedral, both of which also collapsed in the 2010 earthquake, and the National Archives, National Library, and National Museum.\n\nPort-au-Prince is the centre of the political and intellectual life of the country and is the seat of the State University of Haiti (established in 1920). A traditionally picturesque site has been the brash and bustling Iron Market, with its mostly female vendors. Recreation for the privileged centres around European-style social clubs, but the house of the local voodoo priest is still the heart of the urban poor community.\n\nMost of the Haitian elite (nearly all mulatto or nonblacks) live in the suburb of Pétionville in the 1,000–1,500-foot- (300–450-metre-) high hills southeast of Port-au-Prince. Haiti’s small but politically important Black middle class is also concentrated around Port-au-Prince. Squalor and neglect surround most of the Black urban working class even more than it does the subsistence farmer, and constant migration from the countryside continues to exacerbate their misery. Slums such as Cité Soleil are among the largest and most deprived in the Americas. Pop. (2009 est.) city, 875,978; metropolitan area, 2,296,386."}, {"url": "https://www.smithsonianmag.com/travel/explore-port-au-princes-triumphant-art-scene-180971274/", "page_content": "In the 1940s, a watercolor painter from the United States, DeWitt Peters, moved to Port-au-Prince, Haiti. When he arrived, he observed the sprawling amounts of local art—adorning everything from walls and sidewalks to the local taxi buses called \"tap-taps.\" The Indigenist movement was in full swing in Haiti; local artists were making both a name for themselves in the country and helping establish the nation's identity as separate from the United States' occupation through the art they created.\n\nAt the time, though, Haitian artists hadn’t considered that they could make money from their art. The small nation didn't even have its own art museum yet, so Peters opened Le Centre d'Art, an art gallery and school to encourage and promote local untrained artists, in 1944. Artists already popular in Haiti, including Hector Hyppolite, the Voodoo artist colloquially known as the \"grandfather of Haitian art,\" made their way to the center and took up residence there; the center provided government-funded equipment and materials many artists couldn't afford.\n\nLocally, the work produced at the center became well known, bringing in more students, most of whom were low-income locals. The government paid salaries to all the teachers, among them Peters and other accomplished Haitian artists of the time. And internationally, Haitian art took hold thanks to tourists visiting the small nation, spreading the word and bringing work back home. New York's Museum of Modern Art was the first major museum to acquire a piece of Haitian art: René Vincent’s 1940 painting Le combat des coqs (Cock Fight). The museum bought it in 1944 through Peters' work as an art dealer in Haiti; the purchase was made just before he opened the center. One of the first major Haitian art collectors was U.S. poet Selden Rodman. Since then, international leaders and celebrities, including the Kennedys (who collected paintings by Prefete Duffaut) and the Clintons (who collect Haitian paintings and metalwork), and thousands of others have collected Haitian art created by Laurent Casimir, Jean-René Jérôme, Edouard Duval-Carrié, Hector Hyppolite, Philomé Obin, and more.\n\nWhen a magnitude 7.0 earthquake hit Haiti in 2010, museums, cathedrals, art galleries, even Le Centre d'Art crumbled to the ground, destroying valuable art. Haitians began to work around the rubble, rebuilding and even creating art pieces out of crumbled walls. (An exhibition called \"PÒTOPRENS: The Urban Artists of Port-au-Prince\" is currently on display at the Museum of Contemporary Art North Miami, highlighting a group of artists that make sculptures out of earthquake debris.) The Smithsonian Institution offered assistance as well, by way of the Haiti Cultural Recovery Project, which not only rescued Haitian artworks, but also helped to rebuild Le Centre d'Art.\n\nNow, nearly a decade later, the art scene is thriving, particularly in Port-au-Prince, just 16 miles west of the historic quake's epicenter. According to Lorraine Mangones, the executive director of FOKAL, Haiti’s main cultural and educational foundation, Le Centre d'Art recently received an investment to construct a new art center and next year will begin having Caribbean artists-in-residence. Plus, repairs are underway to reopen the Museum of Haitian Art of St. Pierre College, which had about 9,000 visitors per year before the earthquake; a single room has reopened to display prized Haitian art for now.\n\nThese six spots in the capital area will show you the best of Haitian art.\n\nLe Centre d’Art\n\nLe Centre d’Art was the first art gallery in Haiti, opening more than 70 years ago as an art school and display place for art of all types. When the earthquake hit in 2010, the building was completely destroyed. An art school and gallery, with sculptures throughout the grounds, took its place in 2014, and with the Smithsonian's help, the school was able to save more than 5,000 pieces of art. Le Centre d’Art has a close relationship with the Louvre as well, and even sent its archivists to be trained at the French institution. The Louvre maintains a collection assessment of the artwork at Le Centre d'Art and runs a three-year internship program in conjunction with the school to continue the assessment and help with communications.\n\nGalerie Monnin\n\nA Swiss couple—Freda and Roger Monnin, who actively participated in the Port-au-Prince art scene since they settled in the city in 1947—opened Galerie Monnin downtown with European art in 1956. The gallery began to build a collection of sacred voodoo art in the late 60s, when the second generation signed on to help run the business. Since then, the gallery has opened in a new location in Pétionville and runs an art school as well. The collection has grown to include a consistent high-end exhibition of voodoo art, in addition to showcasing both Haitian art and artwork from artists-in-residence, including Greek painter Lilika Papagrigoriou and British artist Sally Leonard.\n\nGalerie D’Art Nader\n\nThis isn’t only the largest art gallery in the Caribbean, but also one of the largest Haitian art collections in the world. The Galerie D’Art Nader in Pétionville is owned by Georges Nader, Jr., who took over when his father, Georges S. Nader, retired as an art dealer. Nader the elder opened the original gallery in downtown Port-au-Prince in 1966, but it crumbled with the earthquake. Everything that could be salvaged (about 3,000 paintings, 1,800 of them damaged, of nearly 15,000) moved to the Pétionville location. Now the gallery's collection has more than 17,000 pieces of mostly modern art from the 1940s on. The family is planning to build a national art museum where they will exhibit 1,000 hand-picked pieces, painted by the most renowned Haitian artists—though as of yet the art list and timeline are still undisclosed.\n\nEl-Saieh Gallery\n\nThis gallery was originally opened by Issa el Saieh, a prominent musician that introduced big band music to Haiti in the 1940s and '50s. In the 1960s, el Saieh was imprisoned by Haitian president Papa Doc’s regime; according to his son—who runs the gallery now—el Saieh was held in a cell for 22 days without the ability to stand up straight or sit down fully. Once he was released (the exact reason behind his imprisonment is unclear), he opened El-Saieh Gallery, which was the second art gallery to open in the country. It instantly became a gathering space for the artistic luminaries of the time. Now, the gallery overlooks the port and boasts a large cross-section of traditional and modern Haitian art, including Vodoo sculpture by local woodcarver and artist Guyodo and colorful paintings by André Normil, an influential Haitian artist who created depictions of Noah's Ark, paradise and Carnival.\n\nGhetto Biennale\n\nThis isn’t an art gallery, but rather an event. Since 2009, the Ghetto Biennale has run every two years, hosted by the artists collective Atis Rezistans. The next installment is this year, from November 29 to December 20, with works focusing on the Haitian Revolution. The Biennale is a chance for urban untrained artists to showcase the artwork they’ve created, and for local artists to collaborate with international ones—for example, for the 2017 Biennale, local artist Love Leonce worked together with Chicago-based artist and curator Sabrina Greig on a collaborative printmaking workshop for locals and visitors. Other collaborations have included a California-based tattoo artist creating tattoos drawn by local artists, a music composition by British musician Bill Drummond performed by 100 local Haitians, and two European artists enlisting the help of Port-au-Prince residents to create a building from trash. The event is held in two different neighborhoods, Lakou Cheri and Ghetto Leanne. Themes for the event revolve around migration and freedom, and past participants have included filmmakers, lecturers, musicians, writers, architects, photographers and other artists.\n\nMarriott Port-au-Prince\n\nHotels throughout Port-au-Prince often tend to double as art galleries, with local artists creating many of the pieces on display. The Marriott Port-au-Prince was one of the first. The hotel hired local artist and art curator Philippe Dodard to stock the property with art. “I took art from both modern artists in Haiti and street artists,” says Dodard. “The art scene suffered after the earthquake, but it allowed street art to rise up again. Now I’m concerned that Haiti will be rebuilt with large buildings with no character reflecting Haitian culture.” For his part, he’s doing his best to avoid that fate with the Marriott. Pieces on display include everything from decorated vases and wall tiles to voodoo flags and fiber art. Dodard himself designed the massive iron panels in the lobby.\n\nGet the latest Travel & Culture stories in your inbox."}], "Philippe Dodard is an artist, sculptor, and painter.": [{"url": "https://expressionsgaleriedart.com/artist/philippe-dodard/", "page_content": "Biography\n\nPhilippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\n\n\nHe received the first prize in drawing at the Junior Seminary of St-Martial's College in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\n\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.[1]"}, {"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://www.galeriebelkay.com/philippe-dodard-1", "page_content": "Phillippe Dodard\n\n1954 – present\n\nDodard was born in Port-au-Prince, Haiti. A graphic artist and painter, Dodard is an alumnus of the Poto-Mitan school created by Tiga. Dodard has distinguished himself throughout his education at the Academy of Fine Arts and a scholarship to the International School in Bordeaux where he specialized in Pedagogic Graphic Design.\n\nDodard’s work has evolved to represent Haitian cultural influences, inspired Donna Karan’s fashion collection and included large sculptures, fine jewelry design and intricate iron work. His work is exhibited internationally."}, {"url": "https://peoplepill.com/people/philippe-dodard/", "page_content": "Philippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nExhibitions (Selection)\n\n2009\n\nIrreversible, an international Art Project at Cisneros Fontanals Art Fondation(Cifo), Miami Florida represented by Galerie Marassa, Haiti\n\nArte Americas 2009, with Galerie Marassa, Miami Beach convention Center.\n\n\n\n2008\n\nMetissage one man show with Galerie Marassa Haiti.\n\nArte Americas 2008, with Galerie Marassa, Miami Beach convention center, Miami Florida\n\n\n\n2007\n\nIca Fair, The international Caribbean Art fair with Galerie Marassa, The Puck Building, New York.\n\nMe and My Miror, presented by Galerie Marassa Haiti and GMI Art, Coral Gables, Florida\n\n\n\n2006\n\nThe idea of Modernity in Haitian Contemporary Art, Broward Library, Fort Lauderdale, FL\n\nLa Tohue, Galerie Jerome, Montreal, Canada.\n\nArt off the Main, Expression gallery, Soho, NY.\n\n\n\n2005\n\nGalerie Nader, Miami (solo exhibition).\n\nOrigin, wheelhorse gallery, Greenwich, Connecticut (Solo).\n\nFestival Créole, Galerie Marassa et Action Foundation, Fort-Lauderdale, FL.\n\n\n\n2004\n\nKafou Marassa, Galerie Marassa, Haiti.\n\n\n\n2003\n\nAbbaye de Daoulas : Vaudou, France.\n\nPapier Sensible, Galerie Marassa, Pétion-Ville Haiti (solo) 2002\n\nGalerie Marassa, Sculptures\n\n\n\n2001\n\nBonjour d’Haiti, first annual Haitian cultural heritage month, DASH, Miami (Solo).\n\n\n\n2000\n\nGalerie Soleil, Montreal, Canada (Solo).\n\n\n\n1999\n\n48th Venice Biennale, Italy\n\nWords of Light, Indiana Perdue University, Indianapolis (solo)\n\nRobert Ferst Center for the Art, Georgia Institute of Technology, Atlanta, Georgia (solo).\n\nA dance of celebration, with John & James Biggers, Water work Visual Art Center, NC (solo)\n\nVoile Metallique, Painting & Sculptures, Galerie Marassa, Pétion-Ville, Haiti (solo)\n\n\n\n1998\n\nDescente aux Enfers, Painting, Sculptures, Inks, with Tiga, Galerie Marassa, Haiti (solo)\n\n20 years of History: Political Cartoons by Ph. Dodard, celebration of 100 years of the Newspaper Le Nouvelliste, Musee d’Art Haitien, Haiti (solo)\n\nDe l’esclavage d’hier à notre Culture d’aujourd’hui, Arche de la Défense, Paris, France\n\nCaribbean Vision, Latin American Art Museum, Los Angeles\n\nArt Haïtien et Religion, Rettreti Art Centre, Finlande\n\n\n\n1997\n\nMirage, (Paintings, Sculptures and Inks) Galerie Marassa, Pétion-Ville, Haiti (solo)\n\nCasas de Las Americas, La Havane, Cuba\n\nCaribbean Vision, Anacostia Museum Smithsonian Institution\n\nCaribe Entranabale, Ultimo Arte, Santo Domingo, Dominican Republic\n\nCaribbean Visions, Hartford Athenaeum, Connecticut\n\n\n\n1996\n\nGalerie Lakaye, Los Angeles, California (solo)\n\nIIIe Biennale de Peinture de la Caraïbe et de l’Amérique Latine, Musée d’Art Moderne, Santo Domingo\n\n\n\n1995\n\nCentre Wifredo Lam, La Havane Cuba\n\nCaribbean Visions, Peinture et Sculpture, Center of Fine Art, Miami Florida Biennale du Dessin de la Caraïbe, Musée d’Art Moderne Santo Domingo\n\nDe Sève et d’Ecorce, chez Gerard with Galerie Marassa (solo)\n\n\n\n1994\n\nSoir d’Encrier (Ink on Paper), Heim America Fisher Island Gallery, Miami Beach, Florida (solo)\n\nDécouverte Galerie Marassa, Andres Art Gallery, Paris, France\n\nArt Asia, Hong-Kong\n\nIVe Biennale Internationale de Peinture, Cuenca, Equateur\n\n1993\n\nSoir d’Encrier Casa de Francia and Galerie Marassa, Santo Domingo (solo)\n\nThe Spirit in Haiti, Galerie Lakaye, Los Angeles, California (solo)\n\nPresentation of the Book Soir d’Encrier, Galerie Marassa, Haiti (solo)\n\n\n\n1992\n\nArt Miami 92, Galerie Marassa, Florida (solo).\n\nSoir d’Encrier, with Galerie Marassa, Haitian art Museum of College St-Pierre, Haiti (solo)\n\nImage Caraïbe, Espaces Carpeaux, Paris, France\n\n500 Years After, Art Museum of the Americas, Washington D.C.\n\n\n\n1991\n\nVision III with TIGA and Ronald Mevs, Galerie Armand Paris et Galerie Marassa\n\n\n\n1990\n\nMasque, Miroir et Totem, MPPR (Margaret Porter Public Relations), New York (solo)\n\n\n\n1988\n\nNoir et Blanc, Kay Tiga\n\n\n\n1986\n\nOpening of the Shakespeare Festival, Viscaya, Miami Florida (solo)\n\n\n\n1984\n\nL’Invisible, Colors of Dream and the Marvellous, Galerie Marassa, Haiti (solo)\n\n\n\n1982\n\nAquatisme II, Galerie Marassa Haiti (solo)\n\n\n\n1981\n\nAquatisme I, Galerie Marassa Haiti (solo)"}, {"url": "https://artsandculture.google.com/entity/%ED%95%84%EB%A6%BD-%EB%8F%84%EB%8B%A4%EB%A5%B4/m026h8n1", "page_content": "Philippe Dodard is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nShow less Read more Wikipedia"}, {"url": "https://www.nytimes.com/2014/05/31/world/americas/Philippe-Dodard-the-Picasso-of-Haiti.html", "page_content": "PORT-AU-PRINCE, Haiti — PHILIPPE DODARD, often called the Picasso of Haiti, was searching for vibrations.\n\nThis could sound ominous in a country widely devastated by an earthquake more than four years ago. Mr. Dodard says he was lucky to have survived that day. He had left a meeting at the National Palace shortly before it was destroyed, and then his car nearly ran off the road as the ground beneath it shuddered and swayed.\n\n“I was saved that day twice,” he said. “I said it must be for a reason.”\n\nBut in his studio here high on a hillside above the throng of the capital below, Mr. Dodard, 59, was speaking in metaphors, the vibration coming not from the earth but the “silent drumbeat communicating the energy of life.” His African ancestors used the drum, but his instrument is the paintbrush.\n\n“The vibration I am looking for is one color,” he said, as he touched up the blues, blacks and rusty oranges of an abstract sea goddess emerging from churning waters. “One color has the vibration of another color. It is like magic.”"}, {"url": "https://artsandculture.google.com/entity/m026h8n1?hl=fr", "page_content": "Philippe Dodard is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nAfficher moins En savoir plus Wikipédia"}, {"url": "https://alchetron.com/Philippe-Dodard", "page_content": "Philippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nContents\n\nHe received the first prize in drawing at the Junior Seminary of St-Martial's College in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nPhilippe dodard\n\n"}]}