{"Dodard's work often depicts Haitian culture and history.": [{"url": "https://www.nytimes.com/2014/05/31/world/americas/Philippe-Dodard-the-Picasso-of-Haiti.html", "page_content": "PORT-AU-PRINCE, Haiti — PHILIPPE DODARD, often called the Picasso of Haiti, was searching for vibrations.\n\nThis could sound ominous in a country widely devastated by an earthquake more than four years ago. Mr. Dodard says he was lucky to have survived that day. He had left a meeting at the National Palace shortly before it was destroyed, and then his car nearly ran off the road as the ground beneath it shuddered and swayed.\n\n“I was saved that day twice,” he said. “I said it must be for a reason.”\n\nBut in his studio here high on a hillside above the throng of the capital below, Mr. Dodard, 59, was speaking in metaphors, the vibration coming not from the earth but the “silent drumbeat communicating the energy of life.” His African ancestors used the drum, but his instrument is the paintbrush.\n\n“The vibration I am looking for is one color,” he said, as he touched up the blues, blacks and rusty oranges of an abstract sea goddess emerging from churning waters. “One color has the vibration of another color. It is like magic.”"}, {"url": "https://communityfolkartcenter.org/philippe-dodard-the-idea-of-modernity-in-haitian-contemporary-art/", "page_content": "Artist: Philippe Dodard Link\n\nSep 14, 2013 – Feb 07, 2014\n\nThis Fall, Community Folk Art Center presents “The Idea of Modernity in Haitian Contemporary Art ” featuring art work from Philippe Dodard. Through bold brush strokes and vibrant color combinations, graphic and visual artist Philippe Dodard, critically engages and empowers audiences throughout the world. Dodard, who was born and raised in Haiti, studied at the Academy of Fine Arts of Port-au-Prince and the International School of Bordeaux, France, where he explored pedagogic graphic design. Dodard’s artistic style is a direct reflection of his personal connection to various political, social, and cultural movements in Haiti.\n\nAs curator Babacar Mbow explains, “The presence of the African masks in the work of Philippe Dodard allows thinking on the richness of the intertextual relationships in African Diaspora Art. Dodard paints a mythology that is both individual and collective through the use of anaphors, for construction of an aesthetic language capable of expressing the specificity of African Diaspora culture”\n\nAs his social and political reach continues to extend, Philippe Dodard will continue to use his art as a viable platform through which social awareness, growth, and progress can be accessed and appreciated. “My work builds on the socio-historical experiences of African Diaspora and indigenous peoples of the Americas. I am interested by the crevasses of history and how they allow slippages, contours, detours, appropriations and contestations.” He says."}, {"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://haitiantimes.com/2020/01/19/reflection-through-creation-philippe-dodard-and-his-earthquake-collection/", "page_content": "By Rachele Viard\n\nThe 2010 earthquake rocked Haiti to its core. Hundreds of thousands lost their lives and thousands more were left vulnerable. Philippe Dodard, a celebrated and admired figure in the Haitian art world and abroad, used the significant and tragic event to create art and encapsulate the emotions and memories born out of the earthquake.\n\n\n\n“[At first] I could not paint because painting seemed to be a recreation to me in a period of emergency,” he said. “I was trying to help as much as I could, those who were in severe difficulties. My home in Montagne Noire was left unscathed and thus became a host house for those who were coming to help the country.”\n\n\n\nAt that moment, he was focused on what needed to be done to help the country get back on its feet. However, after an interview with a German television station about the loss of major art in museums and patrimonial places like the St. Trinity Church, his focus started to shift. During the interview, he showcased a piece titled “The Premonition” that he began one week before the earthquake. Inspiration had returned to Dodard.\n\n\n\nThe Rising\n\nSince then, the artist has painted five emotive and powerful pieces immortalizing this traumatic moment in Haitian history. The “Earthquake” collection is a reflection on the toll the catastrophe took on the land and its people. There is one painting in particular, “Rising Souls,” that Dodard believes especially captures the apocalyptic moment.\n\n\n\nDodard is not only an artist but also a man of action. He participated in an art therapy program to help those trying to cope with the trauma of the earthquake. Exploring tragedy through creative outlets can help people cope, he says.\n\n\n\n“The experience of art therapy with the 3,000 children of Plas Timoun, Djenny Seneque and the children from Champ de Mars Camp revealed how the expression of art can rebuild someone’s broken soul and restore life with love and hope,” said Dodard. “Children that could not speak after the trauma, captured the attention of others by telling their dramatic story through painting, singing, dancing, and sculpting with clay.”\n\n"}, {"url": "https://haitianartsociety.org/dodard-philippe-haitian-b-1954", "page_content": "Photo by Ian Willms\n\nPhilippe Dodard, often called the Picasso of Haiti, is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas. He received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966.\n\n\n\n“I have to hear the voices. I have to feel the heartbeat. It is a way to be in contact with yourself and the universe.” PHILIPPE DODARDCredit...\n\n"}, {"url": "https://www.msn.com/en-us/news/world/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m/ar-AA16aEJC", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://artdaily.cc/news/69928/Acclaimed-Haitian-artist-Philippe-Dodard-s-exhibition-opens-at-Frost-Art-Museum", "page_content": "MIAMI, FL .-\n\n\n\nThe exhibition, Philippe Dodard: Tradition, runs from May 7 through June 29. Dodard\u0092s work is unique and powerful, expressive and bold, and his use of ink, paint and metal is celebrated throughout Haiti\u0092s artistic community. While his Haitian influences are clearly evident, he has stretched tradition and, in doing so, created a fresh Haitian sophistication that is uniquely his own, the very definition of \u0093independence.\u0094\n\n\n\nDodard is an internationally acclaimed artist who lives and creates from his home in Haiti. As one of the Caribbean\u0092s leading contemporary artists, his success demonstrates the visionary power of Haitian visual art that has continued to command international attention. According to Dr. Carol Damian, Director & Chief Curator of the Frost Art Museum, Dodard\u0092s art is as distinctive as it is engaging. \u0093Too often, the art of Haiti is associated with naïve painters and a tourist market for colorful images of people and places that may belie the reality of their difficult existence. Dodard\u0092s is different, and at the same time quite mainstream in its relationship to international trends of painterly expressionism and abstraction that place him within a contemporary milieu. Through his art, he reveals his ancestral heritage in contemporary terms for a new definition of culture and aesthetics that is intrinsically his own, yet belongs to a global world-view.\u0094\n\n\n\nPhilippe Dodard: Tradition is curated by Michele Frisch. This exhibition is presented with the support of the Musée du Panthéon National Haïtien, and of the Miami-Dade County Tourist Development Council, the Miami-Dade County Department of Cultural Affairs and the Cultural Affairs Council, the Miami-Dade County Mayor and Board of County Commissioners.\n\nThe Patricia & Phillip Frost Art Museum at FIU celebrates Haitian Heritage Month with an exhibition of works by Haitian artist Philippe Dodard, beginning with an opening reception on Wednesday, May 7, 2014, from 6-9 pm. The reception is free and open to the public.The exhibition, Philippe Dodard: Tradition, runs from May 7 through June 29. Dodard\u0092s work is unique and powerful, expressive and bold, and his use of ink, paint and metal is celebrated throughout Haiti\u0092s artistic community. While his Haitian influences are clearly evident, he has stretched tradition and, in doing so, created a fresh Haitian sophistication that is uniquely his own, the very definition of \u0093independence.\u0094Dodard is an internationally acclaimed artist who lives and creates from his home in Haiti. As one of the Caribbean\u0092s leading contemporary artists, his success demonstrates the visionary power of Haitian visual art that has continued to command international attention. According to Dr. Carol Damian, Director & Chief Curator of the Frost Art Museum, Dodard\u0092s art is as distinctive as it is engaging. \u0093Too often, the art of Haiti is associated with naïve painters and a tourist market for colorful images of people and places that may belie the reality of their difficult existence. Dodard\u0092s is different, and at the same time quite mainstream in its relationship to international trends of painterly expressionism and abstraction that place him within a contemporary milieu. Through his art, he reveals his ancestral heritage in contemporary terms for a new definition of culture and aesthetics that is intrinsically his own, yet belongs to a global world-view.\u0094Philippe Dodard: Tradition is curated by Michele Frisch. This exhibition is presented with the support of the Musée du Panthéon National Haïtien, and of the Miami-Dade County Tourist Development Council, the Miami-Dade County Department of Cultural Affairs and the Cultural Affairs Council, the Miami-Dade County Mayor and Board of County Commissioners.\n\n\n\n\n\n\n\n"}, {"url": "https://peoplepill.com/people/philippe-dodard/", "page_content": "Philippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nExhibitions (Selection)\n\n2009\n\nIrreversible, an international Art Project at Cisneros Fontanals Art Fondation(Cifo), Miami Florida represented by Galerie Marassa, Haiti\n\nArte Americas 2009, with Galerie Marassa, Miami Beach convention Center.\n\n\n\n2008\n\nMetissage one man show with Galerie Marassa Haiti.\n\nArte Americas 2008, with Galerie Marassa, Miami Beach convention center, Miami Florida\n\n\n\n2007\n\nIca Fair, The international Caribbean Art fair with Galerie Marassa, The Puck Building, New York.\n\nMe and My Miror, presented by Galerie Marassa Haiti and GMI Art, Coral Gables, Florida\n\n\n\n2006\n\nThe idea of Modernity in Haitian Contemporary Art, Broward Library, Fort Lauderdale, FL\n\nLa Tohue, Galerie Jerome, Montreal, Canada.\n\nArt off the Main, Expression gallery, Soho, NY.\n\n\n\n2005\n\nGalerie Nader, Miami (solo exhibition).\n\nOrigin, wheelhorse gallery, Greenwich, Connecticut (Solo).\n\nFestival Créole, Galerie Marassa et Action Foundation, Fort-Lauderdale, FL.\n\n\n\n2004\n\nKafou Marassa, Galerie Marassa, Haiti.\n\n\n\n2003\n\nAbbaye de Daoulas : Vaudou, France.\n\nPapier Sensible, Galerie Marassa, Pétion-Ville Haiti (solo) 2002\n\nGalerie Marassa, Sculptures\n\n\n\n2001\n\nBonjour d’Haiti, first annual Haitian cultural heritage month, DASH, Miami (Solo).\n\n\n\n2000\n\nGalerie Soleil, Montreal, Canada (Solo).\n\n\n\n1999\n\n48th Venice Biennale, Italy\n\nWords of Light, Indiana Perdue University, Indianapolis (solo)\n\nRobert Ferst Center for the Art, Georgia Institute of Technology, Atlanta, Georgia (solo).\n\nA dance of celebration, with John & James Biggers, Water work Visual Art Center, NC (solo)\n\nVoile Metallique, Painting & Sculptures, Galerie Marassa, Pétion-Ville, Haiti (solo)\n\n\n\n1998\n\nDescente aux Enfers, Painting, Sculptures, Inks, with Tiga, Galerie Marassa, Haiti (solo)\n\n20 years of History: Political Cartoons by Ph. Dodard, celebration of 100 years of the Newspaper Le Nouvelliste, Musee d’Art Haitien, Haiti (solo)\n\nDe l’esclavage d’hier à notre Culture d’aujourd’hui, Arche de la Défense, Paris, France\n\nCaribbean Vision, Latin American Art Museum, Los Angeles\n\nArt Haïtien et Religion, Rettreti Art Centre, Finlande\n\n\n\n1997\n\nMirage, (Paintings, Sculptures and Inks) Galerie Marassa, Pétion-Ville, Haiti (solo)\n\nCasas de Las Americas, La Havane, Cuba\n\nCaribbean Vision, Anacostia Museum Smithsonian Institution\n\nCaribe Entranabale, Ultimo Arte, Santo Domingo, Dominican Republic\n\nCaribbean Visions, Hartford Athenaeum, Connecticut\n\n\n\n1996\n\nGalerie Lakaye, Los Angeles, California (solo)\n\nIIIe Biennale de Peinture de la Caraïbe et de l’Amérique Latine, Musée d’Art Moderne, Santo Domingo\n\n\n\n1995\n\nCentre Wifredo Lam, La Havane Cuba\n\nCaribbean Visions, Peinture et Sculpture, Center of Fine Art, Miami Florida Biennale du Dessin de la Caraïbe, Musée d’Art Moderne Santo Domingo\n\nDe Sève et d’Ecorce, chez Gerard with Galerie Marassa (solo)\n\n\n\n1994\n\nSoir d’Encrier (Ink on Paper), Heim America Fisher Island Gallery, Miami Beach, Florida (solo)\n\nDécouverte Galerie Marassa, Andres Art Gallery, Paris, France\n\nArt Asia, Hong-Kong\n\nIVe Biennale Internationale de Peinture, Cuenca, Equateur\n\n1993\n\nSoir d’Encrier Casa de Francia and Galerie Marassa, Santo Domingo (solo)\n\nThe Spirit in Haiti, Galerie Lakaye, Los Angeles, California (solo)\n\nPresentation of the Book Soir d’Encrier, Galerie Marassa, Haiti (solo)\n\n\n\n1992\n\nArt Miami 92, Galerie Marassa, Florida (solo).\n\nSoir d’Encrier, with Galerie Marassa, Haitian art Museum of College St-Pierre, Haiti (solo)\n\nImage Caraïbe, Espaces Carpeaux, Paris, France\n\n500 Years After, Art Museum of the Americas, Washington D.C.\n\n\n\n1991\n\nVision III with TIGA and Ronald Mevs, Galerie Armand Paris et Galerie Marassa\n\n\n\n1990\n\nMasque, Miroir et Totem, MPPR (Margaret Porter Public Relations), New York (solo)\n\n\n\n1988\n\nNoir et Blanc, Kay Tiga\n\n\n\n1986\n\nOpening of the Shakespeare Festival, Viscaya, Miami Florida (solo)\n\n\n\n1984\n\nL’Invisible, Colors of Dream and the Marvellous, Galerie Marassa, Haiti (solo)\n\n\n\n1982\n\nAquatisme II, Galerie Marassa Haiti (solo)\n\n\n\n1981\n\nAquatisme I, Galerie Marassa Haiti (solo)"}, {"url": "https://www.wlrn.org/culture/2014-05-15/large-paintings-and-metal-sculptures-are-one-artists-haitian-tradition", "page_content": "Philippe Dodard can't remember the first time he came to Miami. He lives in Haiti and has always come to visit one family member or another.\n\n\"What is interesting about Miami is every time I come back, I see something new,\" says Dodard. \"And now I see that the culture is getting more and more alive everywhere.\"\n\nBy \"culture,\" he means Miami's Haitian Heritage Museum, Haitian Compass Festival, and Haitian Heritage Month in May.\n\nDodard says the growing culture here gives young Haitians exposure to life on the island. Particularly, he says, to the Haitian students who either never lived in Haiti or left long before they could remember their roots.\n\nCarol Damian, director of the Frost Art Museum at Florida International University, invited Dodard to display his work for Haitian Heritage Month. His exhibit is called \"Tradition,\" made up of large paintings and metal sculptures.\n\n\"We want people to see it and say, 'Oh, I'm coming to a Haitian show. This isn’t what I expected. I expected to see small sort of naive paintings with palm trees, the beautiful landscape and the sea.’ And this doesn't look like that at all,\" she says.\n\nDamian describes Dodard’s art work as abstract. She says he has a \"magical way\" of transporting himself from the island and its traditions into the contemporary world.\n\n\"It's a wonderful example of the fact that Haitian art is as diverse as art anywhere,\" says Damian.\n\nDodard says his work is \"profoundly inspired from the human conditions of the Haitian people and the way they express their joy, their sorrow, their hope.\"\n\nBefore Dodard’s exhibit opened, he took a walk through his display in the Frost Museum.\n\nHe stood in front of an older acrylic painting from 1996 called \"A Coeur Ouvert.\" It depicts a Haitian woman carrying a filled basket on her head. Dodard chose orange and light yellows to recreate dawn. Around 4 a.m., he often hears these women walking past his house in La Montagne Noire, or the Black Mountain.\n\n\"I believe that women in Haiti are very powerful and very strong and they carry the weight of the whole family sometimes on their shoulders,\" he says.\n\nOn the other side of the wall where the painting hangs is a metal sculpture. It’s called \"In Memoriam.\" He made it for the 150th anniversary of the abolition of slavery in the United States.\n\n\"I used the tools that enslaved people used to work on the field,\" he says.\n\nOn the black metal of the tools, you can see small line markings Dodard says symbolize the whipping of enslaved people, but they also count the days of slavery.\n\n\"You see that the piece can... symbolize also the sugar cane machine,\" he says. \"When you look at this piece you can feel what they went through.\"\n\nWhen “Tradition” opened to the public, some observers picked up on the Haitian symbols Dodard uses throughout his work.\n\n\"We memorialize dead people a lot in Haiti, so I think that's one of the ways that his paintings kinda show tribute to his culture,\" says Haitian FIU junior Phalancia Louisy.\n\nVodou symbols appear throughout Philippe Dodard's collection. So do musical representations.\n\n\"I really like what he's doing right now,\" says retired Broward professor Shirley Bayard. \"He's involving a lot of music and dances to the art.\"\n\n\"Haiti is a very beautiful country to discover, to visit and the culture is very rich there,\" says Dodard. \"And they will see that through the collection that I am presenting.\"\n\nPhilippe Dodard's \"Tradition\" will be open at the Frost Art Museum, 10975 SW 17th St., Miami, until June 29."}, {"url": "https://www.7thheavenproperties.com/magazine/issue-4/caribbean-contemporary-art-philippe-dodard-haiti/", "page_content": "On 12th January 2010 a powerful earthquake ravaged the island of Haiti, devastating lives, homes and vital infrastructure in and around the island’s capital Port-au-Prince. Many of the city’s key landmarks, including the Presidential Palace, the National Assembly building and the Port-au-Prince Cathedral, were destroyed or severely damaged. During the two weeks following the earthquake a series of at least 52 aftershocks continued to rock Haiti.\n\nFor Haiti’s people, the impact has continued to be felt long after the aftershocks ceased. Lives were turned upside down and priorities reassessed. Haitians and their friends on the international stage channelled their energy into rebuilding people’s lives – the country’s artists were no exception.\n\nDespite its poverty, Haiti has always been culturally rich, famous for its abundance of artists and vibrant art scene. The earthquake destroyed much of Haiti’s cultural heritage. Irreplaceable artwork, sculptures and historical buildings lay in ruins. However, with such a rich cultural heritage and long artistic tradition to draw on, art has since been identified as one tool for building a sustainable future for Haiti. In the aftermath of the earthquake, one of Haiti’s most highly regarded contemporary artists, Philippe Dodard, who has turned his hand to everything from painting and graphic design to sculpture and metal work, was called upon to play his role in rebuilding the nation.\n\nBorn in 1954, Dodard was awarded his first prize for drawing in 1966 when he was just 12 years old. Drawing led him to painting, a passion he inherited from his mother, who used to produce copies of the classical French masters. During his twenties Dodard dabbled with various styles from Impressionism to Surrealism and Cubism until he developed his own style, Aquatisme. Through fluid water-like imagery he explored “the essence of spirituality” and his relationship with people and nature. As Haiti entered a period of political turmoil during the 1980’s, Dodard’s style evolved once again, into what has become his signature style: Use of bold black and white strokes of ink to capture the reality of life for people in Haiti and powerful symbols from the Haitian voodoo tradition. His “abstract expressionist” artwork, heavily influenced by African art, aims, he tells me, to “speak to your soul and appeal, not only to your sense of aesthetic, but to what humans have inside, an essential spirituality and power”, like “the beat of the silent drum that you can feel inside your body and soul.”\n\nTragically, the earthquake drowned out the beat of the drum for a time. Dodard told me about his personal experience of 12th January 2010.\n\n“My life changed that day… I almost died twice. I was at the Presidential Palace and I left 20 minutes before the earthquake, thanks to my agent who called me for a meeting. I was in a car very close to the Hotel Montana where all the houses collapsed completely. My phone was working – I told him “just keep on driving, don’t stay there” and even though the car was bumping along and he said “I can’t drive”, I told him to “just keep on driving, go.” We passed a 15 metre wall and right after that the wall collapsed on five cars behind me.”\n\nThe earthquake has had a profound impact on Dodard. Ever since, he has dedicated himself to projects which use art for the benefit of Haiti and its people. He tells me “since that time I have wanted my art to be useful for my community.” For the entire year after the earthquake he worked with Haiti’s First Lady Madame Préval on a project called Plas Timoun (The Children’s Place), which provided a safe place for Haitian children to express how they had been affected by the earthquake through art and learn to cope with the trauma. The children who participated in the project learned not only to cope with their traumatic past but to explore their creativity and hidden talents. Dodard is now a strong advocate of the power of art and its potential to contribute to Haiti’s future.\n\nBesides Plas Timoun, Dodard has worked on other projects to help rebuild the country. He played a key role in the reconstruction of the iconic Iron Market (Marche de Fer), which served as a commercial and social hub in Port-au-Prince from 1891 until the earthquake brought it down. The new market, rebuilt with as much of the original material as possible, provides a base for almost 1,000 market traders to sell their wares and stands as a potent symbol of hope for future economic and cultural regeneration.\n\nThereafter Dodard went on to work with one of the world’s most famous fashion designers, who shares a passion for Haiti and the potential of its artists. On a visit to the island, Donna Karan was inspired by his artwork, writing in her blog “no one captures Haiti’s heart and soul like artist Philippe Dodard.” Donna Karan’s Spring/Summer 2012 collection featured prints inspired by Dodard’s black and white paintings and were exhibited side by side in Miami’s Museum of Contemporary Art. He also continues to be involved in Urban Zen, the foundation she established to help develop and market the work of Haitian artisans internationally. Dodard told me about this initiative.\n\n“With Donna and her Urban Zen Foundation we are developing artisans’ skills to produce very high quality products that can be sold on the international market. Working with a designer of such a high level has helped me see how Haitian art can be promoted on the international market. We are working on developing the skills of artisans, the quality of the products and developing an understanding of how to be competitive on the international market, to ensure good service and how to conduct business sustainably.”\n\nDodard’s current primary focus is the National School of Arts (ENARTS). In January 2012 he received a phone call from President Martelli requesting he take on the role of Director of the School. Dodard accepted. The role is in many ways a natural progression of the various projects he has been involved in up until this point. He explains his hopes for the school.\n\n“It was a school that needed to developed, to be more professional, to be equipped and develop new spaces to be built. It is a challenge for an artist. I accepted the challenge and it is my main work now… I want to make the students aware of their role in developing the country and how they can contribute to it and make a living out of that.”\n\nDodard firmly believes that, with nurturing, the emerging generation of Haitian artists can make a major impact on the world stage and on Haiti’s cultural and economic regeneration.\n\n“What we have in our culture, we can really take that to sell different kinds of products and different kinds of services: performance, theatre, music, dance, fine art, fashion… The fashion industry is big – why can’t Haiti be in that market? Artisans have a big role to play in that development.”\n\nSo, with memories of the earthquake still raw and its impact still keenly felt, Dodard is firmly focussed on the future and the beat of the silent drum is reverberating more powerfully than ever.\n\nThis article was originally published in Issue 4 of The Caribbean Property Investor magazine. To read the full issue, click here."}]}