{"Philippe Dodard is considered one of the most important contemporary Haitian artists.": [{"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://www.nytimes.com/2014/05/31/world/americas/Philippe-Dodard-the-Picasso-of-Haiti.html", "page_content": "PORT-AU-PRINCE, Haiti — PHILIPPE DODARD, often called the Picasso of Haiti, was searching for vibrations.\n\nThis could sound ominous in a country widely devastated by an earthquake more than four years ago. Mr. Dodard says he was lucky to have survived that day. He had left a meeting at the National Palace shortly before it was destroyed, and then his car nearly ran off the road as the ground beneath it shuddered and swayed.\n\n“I was saved that day twice,” he said. “I said it must be for a reason.”\n\nBut in his studio here high on a hillside above the throng of the capital below, Mr. Dodard, 59, was speaking in metaphors, the vibration coming not from the earth but the “silent drumbeat communicating the energy of life.” His African ancestors used the drum, but his instrument is the paintbrush.\n\n“The vibration I am looking for is one color,” he said, as he touched up the blues, blacks and rusty oranges of an abstract sea goddess emerging from churning waters. “One color has the vibration of another color. It is like magic.”"}, {"url": "https://haitiantimes.com/2020/01/19/reflection-through-creation-philippe-dodard-and-his-earthquake-collection/", "page_content": "By Rachele Viard\n\nThe 2010 earthquake rocked Haiti to its core. Hundreds of thousands lost their lives and thousands more were left vulnerable. Philippe Dodard, a celebrated and admired figure in the Haitian art world and abroad, used the significant and tragic event to create art and encapsulate the emotions and memories born out of the earthquake.\n\n\n\n“[At first] I could not paint because painting seemed to be a recreation to me in a period of emergency,” he said. “I was trying to help as much as I could, those who were in severe difficulties. My home in Montagne Noire was left unscathed and thus became a host house for those who were coming to help the country.”\n\n\n\nAt that moment, he was focused on what needed to be done to help the country get back on its feet. However, after an interview with a German television station about the loss of major art in museums and patrimonial places like the St. Trinity Church, his focus started to shift. During the interview, he showcased a piece titled “The Premonition” that he began one week before the earthquake. Inspiration had returned to Dodard.\n\n\n\nThe Rising\n\nSince then, the artist has painted five emotive and powerful pieces immortalizing this traumatic moment in Haitian history. The “Earthquake” collection is a reflection on the toll the catastrophe took on the land and its people. There is one painting in particular, “Rising Souls,” that Dodard believes especially captures the apocalyptic moment.\n\n\n\nDodard is not only an artist but also a man of action. He participated in an art therapy program to help those trying to cope with the trauma of the earthquake. Exploring tragedy through creative outlets can help people cope, he says.\n\n\n\n“The experience of art therapy with the 3,000 children of Plas Timoun, Djenny Seneque and the children from Champ de Mars Camp revealed how the expression of art can rebuild someone’s broken soul and restore life with love and hope,” said Dodard. “Children that could not speak after the trauma, captured the attention of others by telling their dramatic story through painting, singing, dancing, and sculpting with clay.”\n\n"}, {"url": "https://www.msn.com/en-us/news/world/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m/ar-AA16aEJC", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://www.7thheavenproperties.com/magazine/issue-4/caribbean-contemporary-art-philippe-dodard-haiti/", "page_content": "On 12th January 2010 a powerful earthquake ravaged the island of Haiti, devastating lives, homes and vital infrastructure in and around the island’s capital Port-au-Prince. Many of the city’s key landmarks, including the Presidential Palace, the National Assembly building and the Port-au-Prince Cathedral, were destroyed or severely damaged. During the two weeks following the earthquake a series of at least 52 aftershocks continued to rock Haiti.\n\nFor Haiti’s people, the impact has continued to be felt long after the aftershocks ceased. Lives were turned upside down and priorities reassessed. Haitians and their friends on the international stage channelled their energy into rebuilding people’s lives – the country’s artists were no exception.\n\nDespite its poverty, Haiti has always been culturally rich, famous for its abundance of artists and vibrant art scene. The earthquake destroyed much of Haiti’s cultural heritage. Irreplaceable artwork, sculptures and historical buildings lay in ruins. However, with such a rich cultural heritage and long artistic tradition to draw on, art has since been identified as one tool for building a sustainable future for Haiti. In the aftermath of the earthquake, one of Haiti’s most highly regarded contemporary artists, Philippe Dodard, who has turned his hand to everything from painting and graphic design to sculpture and metal work, was called upon to play his role in rebuilding the nation.\n\nBorn in 1954, Dodard was awarded his first prize for drawing in 1966 when he was just 12 years old. Drawing led him to painting, a passion he inherited from his mother, who used to produce copies of the classical French masters. During his twenties Dodard dabbled with various styles from Impressionism to Surrealism and Cubism until he developed his own style, Aquatisme. Through fluid water-like imagery he explored “the essence of spirituality” and his relationship with people and nature. As Haiti entered a period of political turmoil during the 1980’s, Dodard’s style evolved once again, into what has become his signature style: Use of bold black and white strokes of ink to capture the reality of life for people in Haiti and powerful symbols from the Haitian voodoo tradition. His “abstract expressionist” artwork, heavily influenced by African art, aims, he tells me, to “speak to your soul and appeal, not only to your sense of aesthetic, but to what humans have inside, an essential spirituality and power”, like “the beat of the silent drum that you can feel inside your body and soul.”\n\nTragically, the earthquake drowned out the beat of the drum for a time. Dodard told me about his personal experience of 12th January 2010.\n\n“My life changed that day… I almost died twice. I was at the Presidential Palace and I left 20 minutes before the earthquake, thanks to my agent who called me for a meeting. I was in a car very close to the Hotel Montana where all the houses collapsed completely. My phone was working – I told him “just keep on driving, don’t stay there” and even though the car was bumping along and he said “I can’t drive”, I told him to “just keep on driving, go.” We passed a 15 metre wall and right after that the wall collapsed on five cars behind me.”\n\nThe earthquake has had a profound impact on Dodard. Ever since, he has dedicated himself to projects which use art for the benefit of Haiti and its people. He tells me “since that time I have wanted my art to be useful for my community.” For the entire year after the earthquake he worked with Haiti’s First Lady Madame Préval on a project called Plas Timoun (The Children’s Place), which provided a safe place for Haitian children to express how they had been affected by the earthquake through art and learn to cope with the trauma. The children who participated in the project learned not only to cope with their traumatic past but to explore their creativity and hidden talents. Dodard is now a strong advocate of the power of art and its potential to contribute to Haiti’s future.\n\nBesides Plas Timoun, Dodard has worked on other projects to help rebuild the country. He played a key role in the reconstruction of the iconic Iron Market (Marche de Fer), which served as a commercial and social hub in Port-au-Prince from 1891 until the earthquake brought it down. The new market, rebuilt with as much of the original material as possible, provides a base for almost 1,000 market traders to sell their wares and stands as a potent symbol of hope for future economic and cultural regeneration.\n\nThereafter Dodard went on to work with one of the world’s most famous fashion designers, who shares a passion for Haiti and the potential of its artists. On a visit to the island, Donna Karan was inspired by his artwork, writing in her blog “no one captures Haiti’s heart and soul like artist Philippe Dodard.” Donna Karan’s Spring/Summer 2012 collection featured prints inspired by Dodard’s black and white paintings and were exhibited side by side in Miami’s Museum of Contemporary Art. He also continues to be involved in Urban Zen, the foundation she established to help develop and market the work of Haitian artisans internationally. Dodard told me about this initiative.\n\n“With Donna and her Urban Zen Foundation we are developing artisans’ skills to produce very high quality products that can be sold on the international market. Working with a designer of such a high level has helped me see how Haitian art can be promoted on the international market. We are working on developing the skills of artisans, the quality of the products and developing an understanding of how to be competitive on the international market, to ensure good service and how to conduct business sustainably.”\n\nDodard’s current primary focus is the National School of Arts (ENARTS). In January 2012 he received a phone call from President Martelli requesting he take on the role of Director of the School. Dodard accepted. The role is in many ways a natural progression of the various projects he has been involved in up until this point. He explains his hopes for the school.\n\n“It was a school that needed to developed, to be more professional, to be equipped and develop new spaces to be built. It is a challenge for an artist. I accepted the challenge and it is my main work now… I want to make the students aware of their role in developing the country and how they can contribute to it and make a living out of that.”\n\nDodard firmly believes that, with nurturing, the emerging generation of Haitian artists can make a major impact on the world stage and on Haiti’s cultural and economic regeneration.\n\n“What we have in our culture, we can really take that to sell different kinds of products and different kinds of services: performance, theatre, music, dance, fine art, fashion… The fashion industry is big – why can’t Haiti be in that market? Artisans have a big role to play in that development.”\n\nSo, with memories of the earthquake still raw and its impact still keenly felt, Dodard is firmly focussed on the future and the beat of the silent drum is reverberating more powerfully than ever.\n\nThis article was originally published in Issue 4 of The Caribbean Property Investor magazine. To read the full issue, click here."}, {"url": "https://communityfolkartcenter.org/philippe-dodard-the-idea-of-modernity-in-haitian-contemporary-art/", "page_content": "Artist: Philippe Dodard Link\n\nSep 14, 2013 – Feb 07, 2014\n\nThis Fall, Community Folk Art Center presents “The Idea of Modernity in Haitian Contemporary Art ” featuring art work from Philippe Dodard. Through bold brush strokes and vibrant color combinations, graphic and visual artist Philippe Dodard, critically engages and empowers audiences throughout the world. Dodard, who was born and raised in Haiti, studied at the Academy of Fine Arts of Port-au-Prince and the International School of Bordeaux, France, where he explored pedagogic graphic design. Dodard’s artistic style is a direct reflection of his personal connection to various political, social, and cultural movements in Haiti.\n\nAs curator Babacar Mbow explains, “The presence of the African masks in the work of Philippe Dodard allows thinking on the richness of the intertextual relationships in African Diaspora Art. Dodard paints a mythology that is both individual and collective through the use of anaphors, for construction of an aesthetic language capable of expressing the specificity of African Diaspora culture”\n\nAs his social and political reach continues to extend, Philippe Dodard will continue to use his art as a viable platform through which social awareness, growth, and progress can be accessed and appreciated. “My work builds on the socio-historical experiences of African Diaspora and indigenous peoples of the Americas. I am interested by the crevasses of history and how they allow slippages, contours, detours, appropriations and contestations.” He says."}, {"url": "https://www.smithsonianmag.com/travel/in-haiti-the-art-of-resilience-53519464/", "page_content": "Six weeks had passed since a magnitude 7.0 earthquake struck Haiti, killing 230,000 people and leaving more than 1.5 million others homeless. But the ground was still shaking in the nation’s rubble-strewn capital, Port-au-Prince, and 87-year-old Préfète Duffaut wasn’t taking any chances. One of the most prominent Haitian artists of the past 50 years was sleeping in a crude tent made of plastic sheeting and salvaged wood, fearful his earthquake-damaged house would collapse at any moment.\n\n“Did you feel the tremors last night?” Duffaut asked.\n\nYes, I had felt the ground shake in my hotel room around 4:30 that morning. It was the second straight night of tremors, and I was feeling a bit stressed. But standing next to Duffaut, whose fantastical naive paintings I have admired for three decades, I resolved to put my anxieties on hold.\n\nIt was Duffaut, after all, who had lived through one of the most horrific natural disasters of modern times. Not only was he homeless in the poorest nation of the Western Hemisphere, his niece and nephew had died in the earthquake. Gone, too, were his next-door neighbors in Port-au-Prince. “Their house just completely collapsed,” Duffaut said. “Nine people were inside.”\n\nThe diabolical 15- to 20-second earthquake on January 12 also stole a sizable chunk of Duffaut’s—and Haiti’s—artistic legacy. At least three artists, two gallery owners and an arts foundation director died. Thousands of paintings and sculptures—valued in the tens of millions of dollars—were destroyed or badly damaged in museums, galleries, collectors’ homes, government ministries and the National Palace. The celebrated biblical murals that Duffaut and other Haitian artists painted at Holy Trinity Cathedral in the early 1950s were now mostly rubble. The Haitian Art Museum at College St. Pierre, run by the Episcopal Church, was badly cracked. And the beloved Centre d’Art, the 66-year-old gallery and school that jump-started Haiti’s primitive art movement—making collectors out of Jacqueline Kennedy Onassis, Bill and Hillary Clinton, the filmmaker Jonathan Demme and thousands of others—had crumbled. “The Centre d’Art is where I sold my first piece of art in the 1940s,” Duffaut said quietly, tugging on the white beard he had grown since the earthquake.\n\nDuffaut disappeared from his tent and returned a few moments later with a painting that displayed one of his trademark imaginary villages, a rural landscape dominated by winding, gravity-defying mountain roads filled with tiny people, houses and churches. Then he retrieved another painting. And another. Suddenly, I was surrounded by six Duffauts—and all were for sale.\n\nStanding beside his tent, which was covered by a tarpaulin stamped USAID, Duffaut flashed a satisfied grin.\n\n“How much?” I asked.\n\n“Four thousand dollars [each],” he said, suggesting the price local galleries would charge.\n\nNot having more than $50 in my pocket, I had to pass. But I was delighted that Préfète Duffaut was open for business. “My future paintings will be inspired by this terrible tragedy,” he told me. “What I have seen on the streets has given me a lot of ideas and added a lot to my imagination.” There was an unmistakable look of hope in the old master’s eyes.\n\n“Deye mon, gen mon,” a Haitian proverb, is Creole for “beyond the mountains, more mountains.”\n\nImpossibly poor, surviving on less than $2 a day, most Haitians have made it their life’s work to climb over, under and around obstacles, be they killer hurricanes, food riots, endemic diseases, corrupt governments or the ghastly violence that appears whenever there is political upheaval. One victim of these all too frequent calamities has been Haitian culture: even before the earthquake, this French- and Creole-speaking Caribbean island nation of nearly ten million people did not have a publicly owned art museum or even a single movie theater.\n\nStill, Haitian artists have proved astonishingly resilient, continuing to create, sell and survive through crisis after crisis. “The artists here have a different temperament,” Georges Nader Jr. told me in his fortress-like gallery in Pétionville, the once-affluent, hillside Port-au-Prince suburb. “When something bad happens, their imagination just seems to get better.” Nader’s family has been selling Haitian art since the 1960s.\n\nThe notion of making a living by creating and selling art first came to Haiti in the 1940s, when an American watercolorist named DeWitt Peters moved to Port-au-Prince. Peters, a conscientious objector to the world war then underway, took a job teaching English and was struck by the raw artistic expression he found at every turn—even on the local buses known as tap-taps.\n\nHe founded Centre d’Art in 1944 to organize and promote untrained artists, and within a few years, word had gone out that something special was happening in Haiti. During a visit to the center in 1945, André Breton, the French writer, poet and a leader of the cultural movement known as Surrealism, swooned over the work of a self-described houngan (voodoo priest) and womanizer named Hector Hyppolite, who often painted with chicken feathers. Hyppolite’s creations, on subjects ranging from still lifes to voodoo spirits to scantily clad women (presumed to be his mistresses), sold for a few dollars each. But, Breton wrote, “all carried the stamp of total authenticity.” Hyppolite died of a heart attack in 1948, three years after joining Centre d’Art and one year after his work was displayed at a triumphant (for Haiti as well as for him) United Nations-sponsored exhibition in Paris.\n\nIn the years that followed, the Haitian art market relied largely on the tourists who ventured to this Maryland-size nation, 700 or so miles from Miami, to savor its heady mélange of naive art, Creole food, smooth dark rum, hypnotic (though, at times, staged) voodoo ceremonies, high-energy carnivals and riotously colored bougainvillea. (Is it any wonder Haitian artists never lacked for inspiration?)\n\nThough tourists largely shied away from Haiti in the 1960s, when self-declared president-for-life François “Papa Doc” Duvalier ruled through terror enforced by his personal army of Tonton Macoutes, they returned after his death in 1971, when his playboy son, Jean-Claude (known as “Baby Doc”), took charge.\n\nI got my first glimpse of Haitian art when I interviewed Baby Doc in 1977. (His reign as president-for-life ended abruptly when he fled the country in 1986 for France, where he lives today at age 59 in Paris.) I was hooked the moment I bought my first painting, a $10 market scene done on a flour sack. And I was delighted that every painting, iron sculpture and sequined voodoo flag I carried home on subsequent trips gave me further insight into a culture that is a blend of West African, European, native Taíno and other homegrown influences.\n\nAlthough some nicely done Haitian paintings could be bought for a few hundred dollars, the best works by early masters such as Hyppolite and Philomé Obin (a devout Protestant who painted scenes from Haitian history, the Bible and his family’s life) eventually commanded tens of thousands of dollars. The Museum of Modern Art in New York City and the Hirshhorn in Washington, D.C. added Haitian primitives to their collections. And Haiti’s reputation as a tourist destination was reinforced by the eclectic parade of notables—from Barry Goldwater to Mick Jagger—who checked into the Hotel Oloffson, the creaky gingerbread retreat that is the model for the hotel in The Comedians, Graham Greene’s 1966 novel about Haiti.\n\nMuch of this exuberance faded in the early 1980s amid political strife and the dawn of the AIDS pandemic. U.S. officials classified Haitians as being among the four groups at highest risk for HIV infection. (The others were homosexuals, hemophiliacs and heroin addicts.) Some Haitian doctors called this designation unwarranted, even racist, but the perception stuck that a Haitian holiday was not worth the risk.\n\nThough tourism waned, the galleries that sponsored Haitian painters and sculptors targeted sales to overseas collectors and the increasing numbers of journalists, development workers, special envoys, physicians, U.N. peacekeepers and others who found themselves in the country.\n\n“Haitians are not a brooding people,” said gallery owner Toni Monnin, a Texan who moved to Haiti in the boom-time ’70s and married a local art dealer. “Their attitude is: ‘Let’s get on with it! Tomorrow is another day.’”\n\nAt the Gingerbread gallery in Pétionville, I was introduced to a 70-year-old sculptor who wore an expression of utter despondence. “I have no home. I have no income. And there are days when me and my family don’t eat,” Nacius Joseph told me. Looking for financial support, or at least a few words of encouragement, he was visiting the galleries that had bought and sold his work over the years.\n\nJoseph told gallery owner Axelle Liautaud that his days as a woodcarver, creating figures such as La Sirene, the voodoo queen of the ocean, were over. “All my tools are broken,” he said. “I can’t work. All of my apprentices, the people who helped me, have left Port-au-Prince, gone to the provinces. I’m very discouraged. I have lost everything!”\n\n“But don’t you love what you’re doing?” Liautaud asked.\n\nJoseph nodded.\n\n“Then you have to find a way to do it. This is a situation where you have to have some drive because everyone has problems.”\n\nJoseph nodded again, but looked to be near tears.\n\nThough the gallery owners were themselves hurting, many were handing out money and art supplies to keep the artists employed.\n\nAt her gallery a few blocks away, Monnin told me that in the days following the quake she distributed $14,000 to more than 40 artists. “Right after the earthquake, they simply needed money to buy food,” she said. “You know, 90 percent of the artists I work with lost their homes.”\n\nJean-Emmanuel “Mannu” El Saieh, whose late father, Issa, was one of the earliest promoters of Haitian art, was paying a young painter’s medical bills. “I just talked to him on the phone, and you don’t have to be a doctor to know he’s still suffering from shock,” El Saieh said at his gallery, just up a rutted road from the Oloffson hotel, which survived the quake.\n\nThough most of the artists I encountered had become homeless, they did not consider themselves luckless. They were alive, after all, and aware that the tremblement de terre had killed many of their friends and colleagues, such as the octogenarian owners of the Rainbow Gallery, Carmel and Cavour Delatour; Raoul Mathieu, a painter; Destimare Pierre Marie Isnel (a.k.a. Louco), a sculptor who worked with discarded objects in the downtown Grand Rue slum; and Flores “Flo” McGarrell, an American artist and film director who in 2008 moved to Jacmel (a town with splendid French colonial architecture, some of which survived the quake) to head up a foundation that supported local artists.\n\nThe day I arrived in Port-au-Prince, I heard rumors of another possible casualty—Alix Roy, a reclusive, 79-year-old painter who had been missing since January 12. I knew Roy’s work well: he painted humorous scenes from Haitian life, often chubby kids dressed up as adults in elaborate costumes, some wearing oversize sunglasses, others balancing outrageously large fruits on their heads. Although he was a loner, Roy was an adventurous sort who had also lived in New York, Puerto Rico and the Dominican Republic.\n\nA few nights later, Nader called my room at Le Plaza (one of the few hotels in the capital open for business) with some grim news. Not only had Roy died in the rubble of the gritty downtown hotel where he lived, his remains were still buried there, six weeks later. “I’m trying to find someone from the government to pick him up,” Nader said. “That’s the least the Haitian government can do for one of its best artists.”\n\nThe next day, Nader introduced me to Roy’s sister, a retired kindergarten director in Pétionville. Marléne Roy Etienne, 76, told me her older brother had rented a room on the top floor of the hotel so he could look down on the street for inspiration.\n\n“I went to look for him after the earthquake but couldn’t even find where the hotel had been because the entire street—Rue des Césars—was rubble,” she said. “So I stood in front of the rubble where I thought Alix might be and said a prayer.”\n\nEtienne’s eyes teared when Nader assured her he would continue pressing government officials to retrieve her brother’s remains.\n\n“This is hard,” she said, reaching for a handkerchief. “This is really hard.”\n\nNader had been through some challenging times himself. Although he had not lost any family members, and his gallery in Pétionville was intact, the 32-room house where his parents lived, and where his father, Georges S. Nader, had built a gallery that contained perhaps the largest collection of Haitian art anywhere, had crumbled.\n\nThe son of Lebanese immigrants, the elder Nader was long considered one of Haiti’s best-known and most successful art dealers, having established relationships with hundreds of artists since he opened a gallery downtown in 1966. He moved into the mansion in the hillside Croix-Desprez neighborhood a few years later and, in addition to the gallery, built a museum that showcased many of Haiti’s finest artists, including Hyppolite, Obin, Rigaud Benoit and Castera Bazile. When he retired a few years ago, Nader turned over the gallery and museum to his son John.\n\nThe elder Nader had been taking a nap with his wife when the quake struck at 4:53 p.m. “We were rescued within ten minutes because our bedroom did not collapse,” he told me. What Nader saw when he was led outside was horrifying. His collection had become a hideous pile of debris with thousands of paintings and sculptures buried under giant blocks of concrete.\n\n“My life’s work is gone,” Nader, 78, told me by telephone from his second home in Miami, where he has been living since the quake. Nader said he never bought insurance for his collection, which the family estimated to be worth more than $20 million.\n\nWith the rainy season approaching, Nader’s sons hired a dozen men to pick, shovel and jackhammer their way through the debris, looking for anything that could be salvaged.\n\n“We had 12,000 to 15,000 paintings here,” Georges Nader Jr. told me as we stomped through the sprawling heap, which reminded me of a bombed-out village from a World War II documentary. “We’ve recovered about 3,000 paintings and about 1,800 of those are damaged. Some other paintings were taken by looters in the first days after the earthquake.”\n\nBack at his gallery in Pétionville, Nader showed me a Hyppolite still life he had recovered. I recognized it, having admired the painting in 2009 at a retrospective at the Organization of American States’ Art Museum of the Americas in Washington. But the 20- by 20-inch painting was now broken into eight pieces. “This will be restored by a professional,” Nader said. “We have begun restoring the most important paintings we have recovered.”\n\nI heard other echoes of cautious optimism as I visited cultural sites across Port-au-Prince. A subterranean, government-run historical museum that contained some important paintings and artifacts had survived. So did a private voodoo and Taíno museum in Mariani (near the quake’s epicenter) and an ethnographic collection in Pétionville. People associated with the destroyed Holy Trinity Cathedral and Centre d’Art, as well as the Episcopal Church’s structurally feeble Haitian Art Museum, assured me that these institutions will be rebuilt. But no one could say how or when.\n\nThe United Nations has announced that 59 countries and international organizations have pledged $9.9 billion as “the down payment Haiti needs for wholesale national renewal.” But there’s no word on how much of that money, if any, will ever reach the cultural sector.\n\n“We deeply believe that Haitians living abroad can help us with the funds,” said Henry Jolibois, an artist and architect who is a technical consultant to the Haitian prime minister’s office. “For the rest, we must convince other entities in the world to participate, such as the museums and private collectors who have huge Haitian naive painting collections.”\n\nAt the Holy Trinity Cathedral 14 murals had long offered a distinctively Haitian take on biblical events. My favorite was the Marriage at Cana by Wilson Bigaud, a painter who excelled at glimpses into everyday Haitian life—cockfights, market vendors, baptismal parties, rara band parades. While some European artists portrayed the biblical event at which Christ turned water into wine as being rather formal, Bigaud’s Cana was a decidedly casual affair with a pig, rooster and two Haitian drummers looking on. (Bigaud died this past March 22 at age 79.)\n\n“That Marriage at Cana mural was very controversial,” Haiti’s Episcopal bishop, Jean Zaché Duracin, told me in his Pétionville office. “In the ’40s and ’50s many Episcopalians left the church in Haiti and became Methodists because they didn’t want these murals at the cathedral. They said, ‘Why? Why is there a pig in the painting?’ They didn’t understand there was a part of Haitian culture in these murals.”\n\nDuracin told me it took him three days to gather the emotional strength to visit Holy Trinity. “This is a great loss, not only for the Episcopal church but for art worldwide,” he said.\n\nVisiting the site myself one morning, I saw two murals that were more or less intact—The Baptism of Our Lord by Castera Bazile and Philomé Obin’s Last Supper. (A third mural, Native Street Procession, by Duffaut, has survived, says former Smithsonian Institution conservator Stephanie Hornbeck, but others were destroyed.)\n\nAt the Haitian Art Museum, chunks of concrete had fallen on some of the 100 paintings on exhibit. I spotted one of Duffaut’s oldest, largest and finest imaginary village paintings propped against a wall. A huge piece was missing from the bottom. A museum employee told me the piece had not been found. As I left, I reminded myself that although thousands of paintings had been destroyed in Haiti, thousands of others survived, and many are outside the country in private collections and institutions, including the Waterloo Center for the Arts in Iowa and the Milwaukee Art Museum, which have important collections of Haitian art. I also took comfort from conversations I had had with artists like Duffaut, who were already looking beyond the next mountain.\n\nNo one displays Haiti’s artistic resolve more than Frantz Zéphirin, a gregarious 41-year-old painter, houngan and father of 12, whose imagination is as large as his girth.\n\n“I’m very lucky to be alive,” Zéphirin told me late one afternoon in the Monnin gallery, where he was putting the finishing touches on his tenth painting since the quake. “I was in a bar on the afternoon of the earthquake, having a beer. But I decided to leave the bar when people starting talking about politics. And I’m glad I left. The earthquake came just one minute later, and 40 people died inside that bar.”\n\nZéphirin said he walked several hours, at times climbing over corpses, to get to his house. “That’s where I learned that my stepmother and five of my cousins had died,” he said. But his pregnant girlfriend was alive; so were his children.\n\n“That night, I decided I had to paint,” Zéphirin said. “So I took my candle and went to my studio on the beach. I saw a lot of death on the way. I stayed up drinking beer and painting all night. I wanted to paint something for the next generation, so they can know just what I had seen.”\n\nZéphirin led me to the room in the gallery where his earthquake paintings were hung. One shows a rally by several fully clothed skeletons carrying a placard written in English: “We need shelters, clothes, condoms and more. Please help.”\n\n“I’ll do more paintings like these,” Zéphirin said. “Each day 20 ideas for paintings pass in my head, but I don’t have enough hands to make all of them.” (Smithsonian commissioned the artist to create the painting that appears on the cover of this magazine. It depicts the devastated island nation with grave markers, bags of aid money and birds of mythic dimensions delivering flowers and gifts, such as “justice” and “health.”) In March, Zéphirin accepted an invitation to show his work in Germany. And two months later, he would head to Philadelphia for a one-man show, titled “Art and Resilience,” at the Indigo Arts Gallery.\n\nA few miles up a mountain road from Pétionville, one of Haiti’s most celebrated contemporary artists, Philippe Dodard, was preparing to bring more than a dozen earthquake-inspired paintings to Arte Américas, an annual fair in Miami Beach. Dodard showed me a rather chilling black-and-white acrylic that was inspired by the memory of a friend who perished in an office building. “I’m calling this painting Trapped in the Dark,” he said.\n\nI have no idea how Dodard, a debonair man from Haiti’s elite class whose paintings and sculptures confirm his passion for his country’s voodoo and Taíno cultures, had found time to paint. He told me he had lost several friends and family members in the quake, as well as the headquarters of the foundation he helped create in the mid-1990s to promote culture among Haitian youth. And he was busily involved in a project to convert a fleet of school buses—donated by the neighboring Dominican Republic—into mobile classrooms for displaced students.\n\nLike Zéphirin, Dodard seemed determined to work through his grief with a paintbrush in hand. “How can I continue living after one of the biggest natural disasters in the history of the world? I can’t,” he wrote in the inscription that would appear next to his paintings at the Miami Beach show. “Instead I use art to express the deep change that I see around and inside me.”\n\nFor the Haitian art community, more hopeful news was on the way. In May, the Smithsonian Institution launched an effort to help restore damaged Haitian treasures. Led by Richard Kurin, under secretary for history, art and culture, and working with private and other public organizations, the Institution established a “cultural recovery center” at the former headquarters of the U.N. Development Program near Port-au-Prince.\n\n“It’s not every day at the Smithsonian that you actually get to help save a culture,” Kurin says. “And that’s what we’re doing in Haiti.”\n\nOn June 12, after months of preparation, conservators slipped on their gloves in the Haitian capital and got to work. “Today was a very exciting day for...conservators, we got objects into the lab! Woo hoo!” the Smithsonian American Art Museum’s Hugh Shockey enthused on the museum’s Facebook page.\n\nKurin sounded equally pumped. “The first paintings we brought in were painted by Hector Hyppolite. So we were restoring those on Sunday,” he told me a week later. “Then on Monday our conservator from the American Art Museum was restoring Taíno, pre-Colombian artifacts. Then on Tuesday the paper conservator was dealing with documents dating from the era of the Haitian struggle for independence. And then the next day we were literally on the scaffolding at the Episcopal cathedral, figuring out how we’re going to preserve the three murals that survived.”\n\nThe task undertaken by the Smithsonian and a long list of partners and supporters that includes the Haitian Ministry of Culture and Communication, the International Blue Shield, the Port-au-Prince-based foundation FOKAL and the American Institute for Conservation seemed daunting; thousands of objects need restoration.\n\nKurin said the coalition will train several dozen Haitian conservators to take over when the Smithsonian bows out in November 2011. “This will be a generation-long process in which Haitians do this themselves,” he said, adding that he hopes donations from the international community will keep the project alive.\n\nAcross the United States, institutions such as the American Visionary Art Museum in Baltimore, galleries such as Indigo Arts in Philadelphia and Haitian-Americans such as Miami-based artist Edouard Duval Carrié were organizing sales and fund-raisers. And more Haitian artists were on the move—some to a three-month residency program sponsored by a gallery in Kingston, Jamaica, others to a biennial exhibition in Dakar, Senegal.\n\nPréfète Duffaut stayed in Haiti. But during an afternoon we spent together he seemed energized and, though Holy Trinity was mostly a pile of rubble, he was making plans for a new mural. “And my mural in the new cathedral will be better than the old ones,” he promised.\n\nMeanwhile, Duffaut had just finished a painting of a star he saw while sitting outside his tent one night. “I’m calling this painting The Star of Haiti,” he said. “You see, I want all of my paintings to send a message.”\n\nThe painting showed one of Duffaut’s imaginary villages inside a giant star that was hovering like a spaceship over the Haitian landscape. There were mountains in the painting. And people climbing. Before bidding the old master farewell, I asked him what message he wanted this painting to send.\n\n“My message is simple,” he said without a moment’s hesitation. “Haiti will be back.”\n\nBill Brubaker, formerly a Washington Post writer, has long followed Haitian art. In her photographs and books, Alison Wright focuses on cultures and humanitarian efforts.\n\nGet the latest Travel & Culture stories in your inbox."}, {"url": "https://www.wlrn.org/culture/2014-05-15/large-paintings-and-metal-sculptures-are-one-artists-haitian-tradition", "page_content": "Philippe Dodard can't remember the first time he came to Miami. He lives in Haiti and has always come to visit one family member or another.\n\n\"What is interesting about Miami is every time I come back, I see something new,\" says Dodard. \"And now I see that the culture is getting more and more alive everywhere.\"\n\nBy \"culture,\" he means Miami's Haitian Heritage Museum, Haitian Compass Festival, and Haitian Heritage Month in May.\n\nDodard says the growing culture here gives young Haitians exposure to life on the island. Particularly, he says, to the Haitian students who either never lived in Haiti or left long before they could remember their roots.\n\nCarol Damian, director of the Frost Art Museum at Florida International University, invited Dodard to display his work for Haitian Heritage Month. His exhibit is called \"Tradition,\" made up of large paintings and metal sculptures.\n\n\"We want people to see it and say, 'Oh, I'm coming to a Haitian show. This isn’t what I expected. I expected to see small sort of naive paintings with palm trees, the beautiful landscape and the sea.’ And this doesn't look like that at all,\" she says.\n\nDamian describes Dodard’s art work as abstract. She says he has a \"magical way\" of transporting himself from the island and its traditions into the contemporary world.\n\n\"It's a wonderful example of the fact that Haitian art is as diverse as art anywhere,\" says Damian.\n\nDodard says his work is \"profoundly inspired from the human conditions of the Haitian people and the way they express their joy, their sorrow, their hope.\"\n\nBefore Dodard’s exhibit opened, he took a walk through his display in the Frost Museum.\n\nHe stood in front of an older acrylic painting from 1996 called \"A Coeur Ouvert.\" It depicts a Haitian woman carrying a filled basket on her head. Dodard chose orange and light yellows to recreate dawn. Around 4 a.m., he often hears these women walking past his house in La Montagne Noire, or the Black Mountain.\n\n\"I believe that women in Haiti are very powerful and very strong and they carry the weight of the whole family sometimes on their shoulders,\" he says.\n\nOn the other side of the wall where the painting hangs is a metal sculpture. It’s called \"In Memoriam.\" He made it for the 150th anniversary of the abolition of slavery in the United States.\n\n\"I used the tools that enslaved people used to work on the field,\" he says.\n\nOn the black metal of the tools, you can see small line markings Dodard says symbolize the whipping of enslaved people, but they also count the days of slavery.\n\n\"You see that the piece can... symbolize also the sugar cane machine,\" he says. \"When you look at this piece you can feel what they went through.\"\n\nWhen “Tradition” opened to the public, some observers picked up on the Haitian symbols Dodard uses throughout his work.\n\n\"We memorialize dead people a lot in Haiti, so I think that's one of the ways that his paintings kinda show tribute to his culture,\" says Haitian FIU junior Phalancia Louisy.\n\nVodou symbols appear throughout Philippe Dodard's collection. So do musical representations.\n\n\"I really like what he's doing right now,\" says retired Broward professor Shirley Bayard. \"He's involving a lot of music and dances to the art.\"\n\n\"Haiti is a very beautiful country to discover, to visit and the culture is very rich there,\" says Dodard. \"And they will see that through the collection that I am presenting.\"\n\nPhilippe Dodard's \"Tradition\" will be open at the Frost Art Museum, 10975 SW 17th St., Miami, until June 29."}, {"url": "https://peoplepill.com/people/philippe-dodard/", "page_content": "Philippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nExhibitions (Selection)\n\n2009\n\nIrreversible, an international Art Project at Cisneros Fontanals Art Fondation(Cifo), Miami Florida represented by Galerie Marassa, Haiti\n\nArte Americas 2009, with Galerie Marassa, Miami Beach convention Center.\n\n\n\n2008\n\nMetissage one man show with Galerie Marassa Haiti.\n\nArte Americas 2008, with Galerie Marassa, Miami Beach convention center, Miami Florida\n\n\n\n2007\n\nIca Fair, The international Caribbean Art fair with Galerie Marassa, The Puck Building, New York.\n\nMe and My Miror, presented by Galerie Marassa Haiti and GMI Art, Coral Gables, Florida\n\n\n\n2006\n\nThe idea of Modernity in Haitian Contemporary Art, Broward Library, Fort Lauderdale, FL\n\nLa Tohue, Galerie Jerome, Montreal, Canada.\n\nArt off the Main, Expression gallery, Soho, NY.\n\n\n\n2005\n\nGalerie Nader, Miami (solo exhibition).\n\nOrigin, wheelhorse gallery, Greenwich, Connecticut (Solo).\n\nFestival Créole, Galerie Marassa et Action Foundation, Fort-Lauderdale, FL.\n\n\n\n2004\n\nKafou Marassa, Galerie Marassa, Haiti.\n\n\n\n2003\n\nAbbaye de Daoulas : Vaudou, France.\n\nPapier Sensible, Galerie Marassa, Pétion-Ville Haiti (solo) 2002\n\nGalerie Marassa, Sculptures\n\n\n\n2001\n\nBonjour d’Haiti, first annual Haitian cultural heritage month, DASH, Miami (Solo).\n\n\n\n2000\n\nGalerie Soleil, Montreal, Canada (Solo).\n\n\n\n1999\n\n48th Venice Biennale, Italy\n\nWords of Light, Indiana Perdue University, Indianapolis (solo)\n\nRobert Ferst Center for the Art, Georgia Institute of Technology, Atlanta, Georgia (solo).\n\nA dance of celebration, with John & James Biggers, Water work Visual Art Center, NC (solo)\n\nVoile Metallique, Painting & Sculptures, Galerie Marassa, Pétion-Ville, Haiti (solo)\n\n\n\n1998\n\nDescente aux Enfers, Painting, Sculptures, Inks, with Tiga, Galerie Marassa, Haiti (solo)\n\n20 years of History: Political Cartoons by Ph. Dodard, celebration of 100 years of the Newspaper Le Nouvelliste, Musee d’Art Haitien, Haiti (solo)\n\nDe l’esclavage d’hier à notre Culture d’aujourd’hui, Arche de la Défense, Paris, France\n\nCaribbean Vision, Latin American Art Museum, Los Angeles\n\nArt Haïtien et Religion, Rettreti Art Centre, Finlande\n\n\n\n1997\n\nMirage, (Paintings, Sculptures and Inks) Galerie Marassa, Pétion-Ville, Haiti (solo)\n\nCasas de Las Americas, La Havane, Cuba\n\nCaribbean Vision, Anacostia Museum Smithsonian Institution\n\nCaribe Entranabale, Ultimo Arte, Santo Domingo, Dominican Republic\n\nCaribbean Visions, Hartford Athenaeum, Connecticut\n\n\n\n1996\n\nGalerie Lakaye, Los Angeles, California (solo)\n\nIIIe Biennale de Peinture de la Caraïbe et de l’Amérique Latine, Musée d’Art Moderne, Santo Domingo\n\n\n\n1995\n\nCentre Wifredo Lam, La Havane Cuba\n\nCaribbean Visions, Peinture et Sculpture, Center of Fine Art, Miami Florida Biennale du Dessin de la Caraïbe, Musée d’Art Moderne Santo Domingo\n\nDe Sève et d’Ecorce, chez Gerard with Galerie Marassa (solo)\n\n\n\n1994\n\nSoir d’Encrier (Ink on Paper), Heim America Fisher Island Gallery, Miami Beach, Florida (solo)\n\nDécouverte Galerie Marassa, Andres Art Gallery, Paris, France\n\nArt Asia, Hong-Kong\n\nIVe Biennale Internationale de Peinture, Cuenca, Equateur\n\n1993\n\nSoir d’Encrier Casa de Francia and Galerie Marassa, Santo Domingo (solo)\n\nThe Spirit in Haiti, Galerie Lakaye, Los Angeles, California (solo)\n\nPresentation of the Book Soir d’Encrier, Galerie Marassa, Haiti (solo)\n\n\n\n1992\n\nArt Miami 92, Galerie Marassa, Florida (solo).\n\nSoir d’Encrier, with Galerie Marassa, Haitian art Museum of College St-Pierre, Haiti (solo)\n\nImage Caraïbe, Espaces Carpeaux, Paris, France\n\n500 Years After, Art Museum of the Americas, Washington D.C.\n\n\n\n1991\n\nVision III with TIGA and Ronald Mevs, Galerie Armand Paris et Galerie Marassa\n\n\n\n1990\n\nMasque, Miroir et Totem, MPPR (Margaret Porter Public Relations), New York (solo)\n\n\n\n1988\n\nNoir et Blanc, Kay Tiga\n\n\n\n1986\n\nOpening of the Shakespeare Festival, Viscaya, Miami Florida (solo)\n\n\n\n1984\n\nL’Invisible, Colors of Dream and the Marvellous, Galerie Marassa, Haiti (solo)\n\n\n\n1982\n\nAquatisme II, Galerie Marassa Haiti (solo)\n\n\n\n1981\n\nAquatisme I, Galerie Marassa Haiti (solo)"}]}