{"Philippe Dodard studied at the École des Beaux-Arts in Port-au-Prince and the École des Beaux-Arts in Paris.": [{"url": "https://www.theartstory.org/movement/beaux-arts-architecture/", "page_content": "Summary of Beaux-Arts Architecture\n\nAn imposing and often decadent style, Beaux Arts buildings combined many of the main features of classical architecture, particularly columns and symmetry, with eclectic and decorative elements drawn from other historical styles. Beaux-Arts Architecture was intended to be a French national style, but the approach also found prominence in the United States, and a handful of other locations throughout the world. It was most commonly used for public and civic buildings such as museums, art galleries, libraries, and university campuses.\n\nKey Ideas & Accomplishments\n\nBeaux Arts buildings tended to feature sculptural decoration and this could take many forms from statuary to relief panels and inscriptions. This decoration was carefully designed to communicate the purpose and identity of the building through details including the names and faces of famous individuals and relevant mythological references. Sculptural features were often complemented by additional internal and external elements such as murals and mosaics which also reflected the building's function.\n\nTechnology and industry were very important to Beaux Arts architects and this reflected wider trends of the period, most notably the Industrial Revolution. Beaux Arts architecture pioneered the use of new materials such as cast iron, pairing it with large areas of glass to create light-filled spaces. Some of the most famous Beaux Arts buildings, such as train stations, also reflect the impact of technology of people's daily lives and these can be seen as a glorification of new machinery and knowledge.\n\nClassical details continued to be prominent within the Beaux Arts canon, but these were used in an increasingly eclectic fashion. Although notions of symmetry and the widespread use of columns remained important, these were paired with features such as arched windows and doors, rustication, and raised first stories.\n\nArtworks and Artists of Beaux-Arts Architecture\n\nProgression of Art\n\n1832-70 École des Beaux-Arts Artist: Félix Duban Facing an interior courtyard, the École des Beaux-Arts building employs horizontal and vertical symmetry to create a sense of elegant balance. The raised first story of rusticated stone features a central arched doorway with arched windows on either side. Copies of noted art works, including the Apollo Belvedere, and the Dying Gaul, are placed between each of the windows, and in the horizontal band between the first and second stories, the names of noted artists, including Michelangelo and Leonardo, are inscribed. Ionic columns with a Baroque-style capital frame the second floor's arched windows, while the third floor's rectangular windows are framed by square classical columns, and small panels containing cartouches. These details create a sense of variation and hierarchy, while the windows, placed with vertical symmetry, create upward movement.\n\n\n\nThe early work on the building (1819-32) was completed by François Debret, Duban's teacher. The two became working colleagues and, then, brothers-in-law when Debret married Duban's sister. Taking over the project in 1832, Duban pioneered the Beaux-Arts style with his innovative inclusion of decorative motifs within a classical form, based upon the proportionality and rational symmetry of Roman architecture. His use of decorative columns, arched windows, garlands, cartouches, and inscriptions became defining elements of Beaux-Arts architecture. He continued to work on the project for most of his life, designing the rest of the campus to frame the central building, shown here. Stone, iron, glass - Paris, France 1838-50 Bibliothèque Sainte-Geneviève Artist: Henri Labrouste This monumental two-story building, built out of limestone, employs symmetrical columns and arches to convey a classical effect and these are combined with elements of a Renaissance palazzo. The building, occupying a wide but shallow site, is located on a hill directly across from the noted Neoclassical Panthéon (1758-90), and the garland band at the top of the first level of the library echoes a similar band on the Panthéon, mirroring and reflecting its surroundings. Inscriptions of the names of over 800 scholars on the façade help to communicate the building's purpose.\n\n\n\nVisitors enter on the lower level through a central vestibule, which is decorated with murals of gardens and busts of French scholars, symbolizing the start of the search for knowledge. The reading room takes up the entire second level and unusually, the primary decorative elements of the building were placed here, rather than on the facade. The building was particularly innovative due to its internal cast iron framework, a new architectural material, and Labrouste's design pioneered the Beaux-Arts use of the latest technologies. In the reading room, this frame is celebrated, rather than concealed, with sixteen columns supporting a dramatic barrel-vaulted ceiling. This, in addition to the large windows, create an impression of light and space. Both Labrouste's use of new materials and the openness of the reading room also had a significant influence, not only on the Beaux Arts movement, but on the later development of modern architecture. Cast iron, glass, stone, limestone, masonry - Paris, France 1851 Crystal Palace Artist: Philip Henry Delamotte In the 1800s British architecture focused on romanticized styles such as Tudor Revival and Gothic. As a result, examples of Beaux Arts buildings were rare. A dramatic and noted example, however, was Joseph Paxton's Crystal Palace (1851), designed for the Great Exhibition in London of the same year. Built initially in Hyde Park, it was later relocated to an area of South London called Penge Common, where it remained from 1854 until its accidental destruction by fire in 1936, an event that was described by Prime Minister Winston Churchill as, \"the end of an age\".\n\n\n\nBased on the model of a greenhouse, Paxton used prefabricated glass and iron, built off site and then set on concrete footings, to design the massive but light-filled exhibition space. The design of the building drew upon Beaux-Arts monumentality and symmetry but at the same time was remarkably innovative in employing industrial materials and processes, particularly the use of a new sheet glass method which made the structure possible. When created, it was the greatest area of glass ever seen in a building and it was hugely novel in that it did not require interior lighting. It's influence on the modern era is noted by historian Dora P. Crouch who wrote, \"it seemed a new kind of space had been created - an indeterminate space that would become characteristic of the next century\". 1861-74 Opéra Garnier Artist: Charles Garnier The façade of the Opéra Garnier, rising to a copper clad dome, emphasized by a pair of gilded statues on each side, and a statue of Apollo, the Greek god of art, at the center is both grand and opulent. At the same time, incorporating arched entrances on the first level and Corinthian columns on the second, the building conveys classical balance, strength, and solidity. The building's placement as the terminal axis of the Avenue de l' Opéra speaks of its importance to the community, while the many statues portraying Greek gods and busts of great composers along with marble friezes, symbolically communicate the building's purpose. Nearly eighty artists worked on the detailed ornamentation of the façade, employing a variety of materials and techniques, including new technologies such as electroplating.\n\n\n\nGarnier's design won a competition for Napoleon III's commission of the new opera building. Whilst epitomizing Beaux Arts, the design also emphasized Garnier's view that no surface should be left undecorated. The building was constructed around a metal frame and this allowed for an incredibly spacious interior, renowned for its performance spaces and its grand staircase, all lavishly and symbolically decorated. Art historian Andrew Ayers wrote, \"A giddy mixture of up-to-the-minute technology, rather prescriptive rationalism, exuberant eclecticism and astonishing opulence, Garnier's opera encapsulated the divergent tendencies and political and social ambitions of its era\".\n\n\n\nThe building was internationally influential, becoming the model for theatres in Poland, the Ukraine, Brazil, Vietnam, and India, as well as other noted structures, including the Thomas Jefferson Building of the Washington, D.C. Library of Congress. It's also taken on a noted cultural life, becoming the setting for Gaston Leroux's famous novel The Phantom of the Opera (1910), which was adapted in later films as well as in Andrew Lloyd Webber's 1986 musical. Stone, marble, cast iron, glass - Paris, France 1897-1900 The Grand Palais Artist: Charles-Louis Girault The façade of the Grand Palais emphasizes the imposing temple-like entrance by employing pairs of classical columns, and projecting towers, capped with monumental sculptures, as a framing device. Placed against a single vertical rectangular window, the statuary at the base of each tower draws the eye upward to the steel and glass barrel-vaulted roof. Wings with colonnades and statues symmetrically placed atop the balustrades create a linear flow. A grand effect is created, suggesting the sweep and range of the \"monument dedicated by the Republic to the glory of French art\", a phrase inscribed on one of its pediments.\n\n\n\nGirault was inspired by Paxton's Crystal Palace (1851) as the use of an iron and steel framework with extensive glass made it possible to have enough light in enormous exhibition spaces before the arrival of electricity. Girault's glass vaulting, iron and steel framing, and reinforced concrete were technically innovative in a building almost a half-mile long. In style, his work first introduced the use of Art Nouveau ironwork to ornament the massive building. The statue groups, created by a number of sculptors, vigorously express both the tradition and power of French art. Georges Récipon's bronze quadriga, or chariot drawn by four horses, stands on top of the end of each wing, one depicting Immortality prevailing over Time, the other Harmony triumphing over Discord.\n\n\n\nGirault studied at the École des Beaux-Arts and in 1880 won the Prix de Rome, and the Grand Palais was one of his first major commissions when he returned to Paris. He supervised and worked with the architects Henri Deglane, Albert Louvet, and Albert Thomas in creating the building, meant as the major exhibition place for the Universal Exposition of 1900. As part of the project, he also created the Petit Palais (1897-1900), a trapezoidal building that incorporated elements of French architecture from the late 1600s to early 1700s. Both buildings reinforced France's leadership in architecture and have been recognized in the modern era as historical monuments. As a result of his work, Girault received a number of royal commissions for buildings in Belgium, and his architecture became the model for other museums both in Europe and South America. Steel, iron, glass, and stone - Paris, France 1894-97 Low Memorial Library at Columbia University Artist: Charles Follen McKim A long, wide flight of stairs draws the eye upwards to the temple-like portico, a colonnade of Ionic columns and a large rotunda. The entrance, elevated above the street, conveys a sense of imposing rationality and solidity, emphasizing the importance of the pursuit of secular knowledge, as the building overshadows the two smaller religious buildings built on either side. The design combines elements from Rome's Pantheon (113-125 C.E.) with a Greek cross plan, and windows modeled from the Roman Baths of Diocletian (298-306 C.E.), situating it within the classical tradition. The design and decoration of the building, however, also reinforces its role in preserving and communicating knowledge. An inscription above the portico honors Columbia's history and the interior of the building includes various symbolic mythological figures, including busts of Athena, goddess of wisdom, Zeus, ruler of the heavens, and Apollo, god of the arts as well as depictions of the philosopher Demosthenes and the playwrights Euripides and Sophocles.\n\n\n\nMcKim was renowned for his designs of libraries, also designing the Boston Public Library and the Morgan Library in New York City in which he combined classical references with elements drawn from the Italian Renaissance, as architectural historian Leland M. Roth wrote, his \"formal training and innate sobriety provided clarity of form\". In a similar vein, art critic Christopher Grey has characterized his work as \"studied, reserved, archaeological\", and his approach necessitated that every element and material met his exacting standards.\n\n\n\nColumbia's President Seth Low, who financed the project with his own funds when the University was reluctant, commissioned the new library in 1895 as the first building of the Morningside campus. Named in honor of his father, the library, though it has been an administrative building since the 1930s, is the dominant feature of the campus and has been designated a New York City Landmark and a National Historic Landmark. Stone, Connemara marble, green Vermont marble - New York City 1902 Metropolitan Museum of Art Artist: Richard Morris Hunt The iconic entrance to the museum is composed of three grand arches, each with a keystone bust of the Greek goddess Athena, representing wisdom. The arches are framed by pairs of freestanding Giant Order columns, so named because they extend through multiple stories. Medallions depicting Old Masters, including Michelangelo, Raphael, Durer, and Rembrandt are placed on either side above the arches, pointing to the building's function. The two wings, lower and slightly set back, emphasize the grandeur of the central rectangular section. Approached by a series of steps rising up from Fifth Avenue, the building has the effect of a monumental temple of art.\n\n\n\nRichard Morris Hunt designed the façade, and, following his death, his son completed the plan. Due to funding issues, however, some of Hunt's original designs were altered considerably. For instance, the museum was built in Indiana limestone rather than the intended white marble. Hunt had also planned to include more decorative sculpture; the blocks of stone at the top of each pair of columns were to be carved to show the four great periods of art - Egyptian, Greek, Italian (Renaissance), and the modern - but, as the plan was not carried out, the heavy stones remained. Additionally, niches were created, but no statues were placed in them until 2019, when these have become the location for an annual commission. First on display were four works by Kenyan-American artist, Wangechi Mutu called The NewOnes will free Us. Despite these changes, when completed, one newspaper hailed the building as \"the most monumental example of architecture in America\" and art critic Albert Ten Eyck Gardner argued that the uncarved stones \"introduce a welcome note of rugged simplicity into an otherwise self-consciously correct Beaux Arts design\". Indiana limestone, glass, iron - New York City, New York 1903-13 Grand Central Terminal Artist: Alfred T. Fellheimer, Reed and Stern, Warren and Wetmore An icon of New York City, Grand Central Station exemplifies the stately grandeur that the Beaux-Arts style gave to major train terminals, seen as defining monuments to the industrial age. Double columns frame each of three large arch windows, their steel lattice work and glass allowing light to flood into the interior. The geometric designs on the windows and skylights reinforce notions of industry as well as pre-empting Art Deco styles. Inside, the ceiling depicts the constellations and this was designed by architect Whitney Warren along with the French artist, Paul César Helleu and emphasizes the size and openness of the main concourse.\n\n\n\nThe exterior of the building is dominated by Jules-Félix Coutan's Glory of Commerce (1911-14), a 48-foot high statue that depicts Mercury, the Greek god representing trade and travel, standing on a large 13-foot clock with Hercules, representative of physical strength, and Minerva, goddess of wisdom and guardian of cities, on either side of him. With flared wings and a fierce attitude, an eagle, representing both Zeus, ruler of the heavens, and America, stands behind Mercury. As Whitney Warren wrote at the time, the façade was an \"attempt to offer a tribute to the glory of commerce ... that this great enterprise has grown and exists, not merely from the wealth expended...but by the brain and brawn constantly concentrated upon its development\".\n\n\n\nFollowing a 1902 train collision that resulted in numerous fatalities and injuries, William J. Wilgus, New York Central railway's chief engineer, proposed that rather than a railroad yard with steam engines, the growing city needed a modern terminal with electric trains. Consequently, a design competition was held in 1903 and building began shortly afterwards. New York Central wanted their building to outshine Pennsylvania Station, on which work had begun in 1901. Although Penn Station was completed earlier, in 1910, Grand Central opened in 1914 as the largest train station in the world, covering 48 acres and including 44 platforms. In conjunction with the terminal, an area called the Grand Central Zone, surrounded the area with hotels, luxury apartment houses, and new office buildings, leading the New York Times to call it \"a monument, a civic center...a city.\" The building is designated as a U.S. National Historic Landmark and is a top tourist attraction. It has been used in countless films and television shows, where it has come to symbolize the city itself. Bedford limestone, granite, Tennessee marble, Botticino marble, Caen stone, iron, glass - New York City, New York 1939-43 Jefferson Memorial Artist: John Russell Pope, Eggers and Higgins This monument, honoring Thomas Jefferson, employs circular steps leading up to the protruding portico with its eight Ionic columns rising to a triangular pediment. The contrast between the rectangular portico and the building's colonnaded circular form, rising to a shallow dome, creates a sense of elemental and classical balance. Made of Vermont Imperial Danby white marble and open to the elements, the building resembles many classical temples, designed to be approached from any direction. At the same time, the building and its prominent location, pays homage to both the Roman Pantheon (118-125 C.E.) and Jefferson's design for the Rotunda (1822-26) at the University of Virginia. Adolph Alexander Weinman's relief, depicting five of the writers of the Declaration of Independence, is carved in the pediment.\n\n\n\nIn 1925 Pope had the winning design in the competition initiated by President Theodore Roosevelt for the proposed memorial, though Congress did not fund the project, and it wasn't until 1935 that the proposal was revived under President Franklin Roosevelt. The project was controversial at the time, as the Commission of Fine Arts argued that it would spoil the open view of Pierre L'Enfant's 1791 plan of Washington, and other argued against the cutting down of the mature cherry trees in the area. More importantly, in contrast to the rising modern style of architecture, the Beaux-Arts style was seen as out of date. As art historian Arthur Drexler wrote, \"By the last years of Beaux-Arts influence in America, a classicism stripped of the Orders and sometimes even of ornament sought to keep pace with the emerging modern style. And yet one of the last major Beaux-Arts buildings... Pope's Jefferson Memorial...reasserted classical values.\" Marble, limestone, granite Vermont Imperial Danby marble, Georgia marble, Tennessee marble, Indiana limestone, Minnesota granite, Missouri marble - Washington DC\n\nBeginnings of Beaux-Arts Architecture\n\nFrench Baroque\n\nFrench Baroque architecture (sometimes called French Classicism) combined the scale and drama of Italian Baroque with Greek and Roman theories of harmony to create monumental buildings that demonstrated power and majesty. It developed under the patronage of King Louis XIV (1643-1715) whose reign marked a period of cultural and economic prosperity for France. The Palace of Versailles (1661-1770), designed by Jules Hardouin-Mansart and Charles Le Brun, is the most famous example of the style and the building and its grounds did much to promote ideas of national identity through architecture as well as the importance of uniting design and decoration to create a complete whole (a concept later given the name Gesamtkunstwerk). These ideas informed the development of Beaux-Arts Architecture, in that it promoted the importance of unified decorative schemes and was initially viewed as a uniquely French national style.\n\nAcadémie des Beaux-Arts\n\nOriginally founded in 1648, by the 19th century, the Academy was responsible for both the official Salon, an exhibition that could make or break an artist's career, as well as an elite art school teaching painting, sculpture, and architecture. The school's system of education was highly competitive and rigorous, as students were taught in the atelier, or studio, teaching system. Each year students could compete for the Grand Prix de Rome, which included a fellowship of three to five years in Rome. By the early 1800s, however, the Academy had also become rigidly conservative with the result that innovation in painting was led by artists associated with Romanticism, Realism, and other new movements, in opposition to the tight strictures of the Academy. The Academy's approach to architecture was equally conservative, but a new generation of architects began to challenge this.\n\nLabrouste, Duban, Duc, and Vaudoyer\n\nFour students of the school, Joseph-Louis Duc, Félix Duban, Henri Labrouste and Léon Vaudoyer each won the Prix de Rome in consecutive years (1823-26), allowing them to study together in Rome at the Villa Medici. Here, they began creating innovative designs that questioned the strict standards of the school's Neoclassical aesthetic. In 1829, Labrouste's reconstruction of the temple complex in Paestum, Italy, stirred debate about the nature of classical architecture and the educational goals of the school. He argued that the site, which had been much studied as \"primitive\" as its columns were considered disproportionately short, instead reflected the artistic desire of the designers \"to create a new architecture\". This pitted Labrouste against some members the Academy as his argument necessitated questioning their long-held beliefs in the purity of classical architecture and in challenging the academic dogma of the institution, he opened up a new field of reference for architects to draw on.\n\nIncorporating elements of Baroque, Renaissance, Gothic, and Romanesque architecture into their designs, the four students sought to create a new and authentic French style. As Labrouste argued, \"a building should reflect and express the specific region in which it is built\" and Duban advocated for \"the importance of achieving a national character in architecture\". Their work was timely and reflected wider trends in historicism, including a surge in interest in the Middle Ages caused by the publication of The Hunchback of Notre Dame by Victor Hugo in 1831 and early ideas in building conservation exemplified by the creation of the Commission of Historic Monuments in 1837.\n\nDespite the early antagonism with some members of the Academy's faculty, Beaux Arts architecture was quickly accepted as a modification of the current Academic Style and began to be disseminated through the Academy itself. This may be attributed to the fact that Beaux Arts continued to draw heavily on classical aesthetics, offering continuity between the two. By the early 1830's the young architects had, not only, become leaders among their contemporaries but also received major commissions and the favor and patronage of King Louis Philippe. Duban designed the new building for their alma mater, the Académie des Beaux-Arts, which was renamed the École des Beaux-Arts in 1863 (1832-64) and Labrouste designed the Bibliothèque Sainte-Genevieve (1838-50). Becoming noted teachers, Vaudoyer, Duc, Duban, and Labrouste also taught the next generation of architects, including and Edmond Jean-Baptiste Paulin, and Charles-Auguste Questel.\n\nBeaux-Arts in America\n\nRichard Morris Hunt, the first American admitted to the École des Beaux-Arts in 1846, introduced Beaux Arts architecture to the United States, when he returned in 1855. It was, later, brought to widespread attention through the buildings of Chicago's World Columbian Exposition in 1893. Designed by noted architects, including Burnham, Atwood, and Olmstead, the monumental designs were nicknamed the White City and were seen as the perfect expression of the Gilded Age, a period of great wealth. The designs sparked the City Beautiful movement which sought to reform American architecture and urban planning along Beaux Arts lines. The tenets of the movement were adopted by various American cities, with the most notable example, the Macmillan Plan (1902-26). Named for the U.S. Senator that initiated it, it was a redesign of the National Mall in Washington D.C.\n\nAmerican architects added their own innovations to the Beaux-Arts style, as shown in Hunt's incorporation of Châteauesque features, based on French Renaissance country houses, into his designs for Biltmore House, a private mansion created for George Vanderbilt. Henry Hobson Richardson combined Beaux-Arts spatial planning with Romanesque elements to create a unique style that became known as Richardsonian Romanesque. Charles Follen McKim, William Rutherford Mead, and Stanford White, known by their firm's name McKim, Mead, and White, dominated American architecture at the fin de siècle. The firm transformed American architecture between 1879 and 1912, employing a hundred designers, executing over a thousand commissions, and pioneering a modern architectural process where they developed procedures for managing every step of a project. As the 1900's progressed, American Beaux-Arts architects, facing the challenges of the emerging modernist movement, emphasized a return to a less-ornamented and pure classical style, as shown in Henry Bacon and Daniel Chester French's famous Lincoln Monument (1914-22) in Washington D.C.\n\nConcepts and Themes\n\nArchitecture Parlante\n\nThe Beaux-Arts style emphasized architecture parlante, meaning \"speaking architecture,\" the concept that the building should engage in a dialogue with the viewer, thereby explaining its own function. As a result, each decorative element was connected to the building's purpose or situation. Words or names of noted artists or musicians were carved into steps, panels, or elevated bands, shields were placed above entrances, and panels were highly decorated with symbolic motifs. At the same time, Beaux-Arts architecture also considered the building within its wider context, representing and communicating current social values.\n\nIndustry and Technology\n\nBeaux-Arts architecture was informed by the Industrial Revolution, which began in Britain, and as economist and philosopher Friedrich Engels wrote, \"changed the whole of civil society.\" However, it was a Frenchman, Louis-Guillaume Otto, who first coined the phrase \"Industrial Revolution\" in 1799 to describe his country's race to modernize following the chaos of the French Revolution. The code civil, or Napoleonic code, was established in 1801 replacing various tariffs and guild restrictions with the rule of law, stabilizing the national currency, and creating public roads, canals, and the railway system. Mechanized factories, steam power, iron making, and the invention of machine tools led to mass production of various products and to rapid urbanization.\n\nIn this new era, Henri de Saint-Simon and Auguste Comte were the leading thinkers. Saint-Simon developed the concept of industrialism, where he argued that the recognition of the value and needs of the working class were necessary both to society and the economy. Comte, who worked for a time with Saint-Simon, developed a positivist philosophy of social evolution, believing that, \"the only knowledge available to human kind is that of science grounded in observation\". Saint-Simon and Comte's ideas influenced the leading philosophers of the 19th century, including Karl Marx, Friedrich Engels, and John Stuart Mills. The Beaux-Arts movement was informed by this rationalist and positivist approach and felt employing the technology, materials, and processes of the Industrial Revolution would create new buildings that gave expression to civic pride and social progress. In the same manner, they were particularly keen to incorporate the new technology of cast iron into their designs, creating iron frameworks that allowed buildings to be built on a grander scale, while also being more affordable and having shorter completion times.\n\nInternational Expression\n\nApart from a few specific buildings, Beaux Arts had little impact elsewhere in Europe, with architects more likely to utilize their own national styles. The style, however, had a significant effect in the United States between 1880 and 1920, where it was also known as American Renaissance or American Classicism. Interestingly, there was also a fashion for Beaux- Arts designs in Argentina where the ruling classes admired and imitated French aesthetics. The style was first introduced to the country in 1868 by Julio Dormal, a Belgian who had studied at the École des Beaux-Arts, and it continued to be employed into the modern era as seen in Bustillo and Ángel Guido's design of the monumental National Flag Memorial (1957).\n\nLater Developments - After Beaux-Arts Architecture\n\nBeaux-Arts architecture had declined in France by the beginning of the 19th century as it was overtaken by the modern movements of Art Nouveau and, later, Art Deco. The aesthetics and ideas behind Art Nouveau were a clear a rejection of Beaux Arts, although it is possible to note some common themes between the two, particularly the use of new technologies. Although Art Deco also remained a separate movement in Europe, in the United States, elements of Beaux Arts were incorporated into Art Deco designs, creating public buildings which can be seen as an amalgamation of the two. This is particularly prominent in buildings completed between 1933 and 1944 as part of the Public Works Administration, when the fusion of the two styles became known as PWA Moderne.\n\nLabrouste's work has slowly been re-evaluated in the modern era, beginning with Sigfried Gideon's 1928 argument that his pioneering and exposed iron structures can be seen as leading to the unadorned steel columns of Le Corbusier. Labrouste's rationalist approach and use of modern architecture can be seen as influencing Ludwig Mies van der Rohe and Norman Foster.\n\nFrom the 1970s some postmodern architects began to reject modern functionalism and instead sought inspiration in historic architectural styles, combining elements from different eras to create an eclectic and, sometimes, contradictory appearance. Beaux Arts features such as classical columns, arched windows, and decorative statuary made a reappearance in the designs of architects such as Robert Venturi, Thomas H. Beeby, and Robert A. M. Stern.\n\nIn 1963, following the destruction of Pennsylvania Station, a Beaux-Arts building designed by McKim, Mead and White, Henry Hope Reed Jr. launched the Classical America organization. Advocating for the practice of classical training and the appreciation of classical buildings, the organization was renamed in 2002 as the Institute of Classical Architecture and Art. The Institute has a peer-reviewed journal and a number of programs, including the Beaux Arts Atelier, which emphasizes education in classical architecture, based upon the teachings of the École des Beaux-Arts. In Belgium, Leo Krier and Maurice Cult have advocated for classical projects, and in Britain Quinlan Terry became a leading proponent of the New Classical Architecture movement. He was described in 2006 by art historian David Watkin, as \"the single most distinguished and prolific architect at work in the Classical tradition\". The American New Classical architect Thomas Gordon Smith, as chair of the School of Architecture at the University of Notre Dame, has been an influential advocate for classical studies and practices, with the result that a number of universities, including The University of Miami, Andrews University, the University of Colorado, offer classical architectural programs.\n\nCommercial architecture also continues to reflect the Beaux-Arts influence as noted resorts and upscale boutiques, employ classical facades done in ironwork. The Beaux-Arts style has also had a continued cultural presence, as its masterworks are among the most visited international tourist attractions and are used in popular media and advertising as iconic and instantly recognizable edifices that express the character of Paris, New York or other major cities.\n\nUseful Resources on Beaux-Arts Architecture"}, {"url": "https://en.parisinfo.com/paris-museum-monument/71169/Ecole-nationale-superieure-des-Beaux-arts", "page_content": "Description\n\nFormer Royal Academies in the 17th century, the \"Ecole des Beaux-Arts\" (Fine Arts School) has been located since 1816 on the site of the \"Petits Augustins\" monastery. Not to be missed : the main courtyard and the chapel des Petits Augustins and the Cour du Mûrier.\n\nTemporary exhibitions.\n\nArchitectural style\n\nClassique\n\nCollections\n\nArchitecture\n\nDessins\n\nInfographie\n\nMultimédia\n\nPeinture\n\nPhotographie\n\nSculpture\n\nVidéo\n\nEpoque des collections\n\nBaroque (XVIe - XVIIe)\n\nRococo (XVIIIe)\n\nNéoclassicisme (XVIIIe - XIXe)\n\nRomantisme (XVIIIe - XIXe)\n\nRéalisme (XIXe)\n\nImpressionnisme (XIXe)\n\nSymbolisme (XIXe)\n\nFauvisme (XXe)\n\nCubisme (XXe)\n\nModernisme (XXe)\n\nExpressionisme (XXe)\n\nFuturisme (XXe)\n\nDadaisme (XXe)\n\nSurréalisme (XXe)\n\nL'abstraction (XXe)\n\nMouvement (XXe)\n\nContemporain (XXe - XXIe)\n\nGarden\n\nThe Mulberry tree Yard (\"Cour du Mûrier): in the former cloister of the monastery Alexandre Lenoir (a famous art and architecture lover who created one of the first French museums) planted a mulberry tree, which gave its name to this shaded yard."}, {"url": "http://www.visual-arts-cork.com/education/ecole-des-beaux-arts-paris.htm", "page_content": "Origins & History\n\nThe Ecole des Beaux Arts was established in 1648 - as part of the French Academy of Fine Arts - by the powerful Cardinal Mazarin in order to train exceptional students in life drawing, painting, sculpture, engraving and architecture.\n\nFine art instruction had long been a tradition in Europe, ever since the Middle Ages when Master painters passed their artistic knowledge onto apprentices. The Ecole des Beaux Arts was considered revolutionary in its time for imitating the courses and training offered by the great Italian academies like the Florentine Academy of the Art of Design (Accademia dell'Arte del Disegno, later renamed Accademia di Belle Arti Firenze) and the Academy of St Luke in Rome (Accademia di San Luca). The first class was given in public on the 1st of February 1648 by painter Charles Le Brun (1619-1690). The original timetable ran from April to October, when daylight hours were best. In 1663 the school inaugurated the prestigious Prix de Rome, a scholarship award for students of painting, sculpture and architecture. Designed to create a taste for classical art in students, its trials lasted 3 months and were highly competitive. Famous winners of the prize included the rococo painter Francois Boucher (1720), the neoclassical artist Jacques-Louis David (1774) and the traditionalist Jean Auguste Dominique Ingres (1801). Painters who tried but failed to win the Prix de Rome include Impressionists Edouard Manet (1832\u009683) and Edgar Degas (1834\u00961917). Another who tried and failed was Jean-Leon Gerome (1824-1904) - famous for his orientalist painting and populist historical works - who eventually secured a coveted professorship at the Ecole des Beaux Arts.\n\nWorld famous graduates of the school's Architecture department include the Americans Richard Morris Hunt (1827-95) and Henry Hobson Richardson (1838-86).\n\nConservative Teaching Methods"}, {"url": "https://www.amfedarts.org/ecole-des-beaux-arts/", "page_content": "This rich overview of masterpieces from the École des Beaux-Arts—the original school of fine arts in Paris and a repository for work by Europe’s most renowned artists since the seventeenth century—includes over 140 paintings, sculptures, and works on paper dating from the seventeenth through nineteenth centuries. The focus is on epic themes such as courage, sacrifice, and death, as well as the ways that changing political and philosophical systems affected the choice and execution of these subjects. Among the featured works are paintings by Jacques Louis David, Jean-Honoré Fragonard, Anne-Louis Girodet, and Jean Auguste Dominique Ingres; sculpture by Antoine Louis Barye, Jean-Baptiste Carpeaux, Jean-Antoine Houdon, and Francois Rude; drawings by François Boucher, Leonardo da Vinci, Nicolas Poussin, Titian, and Jean Antoine Watteau; and prints by Albrecht Dürer and Rembrandt van Rijn.\n\nThe epic deeds of gods and heroes, enshrined in the Bible and the works of Homer, were the primary narratives from which both aspiring and established academicians drew their inspiration. Their ideology was rooted in the study of the idealized human form as envisioned in classical art. At the École, learning how to construct persuasive and powerful paintings from carefully delineated anatomy, expressive faces, and convincing architectural and landscape settings was understood by aspiring artists to be the route to success and recognition.\n\nGods and Heroes offers unique insight into the development of an aesthetic ideology that fostered some of western art’s most magnificent achievements. Among the masterworks included are Charles-Joseph Natoire’s Sacrifice of Manoah (1721); Joseph-Marie Vien’s David Resigns himself to the will of the Lord, who struck his kingdom of the plague (1743); Jacques-Louis David’s Erasistratus Discovers the Cause of Antiochus’s Disease (1774); and Jean-Auguste-Dominque Ingres’s Achilles Receiving the Ambassadors of Agamemnon (1801)."}, {"url": "https://www.royalacademy.org.uk/art-artists/work-of-art/academic-study-of-a-male-nude", "page_content": "Academic study of a male nude,\n\nPascal Adolphe Jean Dagnan-Bouveret Hon RA (1852 - 1929)\n\nRA Collection: Art\n\nPainted when Pascal Dagnan-Bouveret (1852-1929) was a student at the École des Beaux-Arts, Paris, this study depicts a male nude, standing in a set pose on what appears to be a rotating platform. The poses used by models at the École were typically derived from classical sculpture or from well-known academic paintings. The neutral background curtain helped artists to concentrate upon the figure and the play of directional light upon it.\n\n\n\nFrom 1869-1878, P.A.J. Dagnan-Bouveret studied at the École des Beaux-Arts, in the ateliers of Alexandre Cabanel and Jean-Léon Gérôme. In 1875 three of his works were accepted at the Salon. In 1876, the year in which this academic nude was painted, he won a first prize at the École des Beaux-Arts for painting the figure and second place in the Prix de Rome for his painting 'Priam Asking Achilles for the Body of his Son'.\n\n\n\nAfter leaving the École des Beaux-Arts, he and the genre painter Gustave Courtois (1853-1923) went to the latter's home region of Franche-Comté. There, Dagnan-Bouveret's observations of provincial life and the countryside formed the basis for many of his landsape and genre paintings. During the 1890s he focused on painting portraits and mystical religious subjects. Among the many awards he received, Dagnan-Bouveret was nominated as Chevalier of the Légion d'honneur (1885), elected a member of the Institut de France (1900) and an Honorary Royal Academician in 1908.\n\n\n\nThe English painter and sculptor J. M. Swan, R.A. (1847-1910) went to the École des Beaux-Arts, Paris in 1874, where he studied alongside Dagnan-Bouveret under Jean-Léon Gérôme. Dagnan-Bouveret presented this academic life study to Swan in 1876."}, {"url": "https://www.tate.org.uk/art/art-terms/e/ecole-des-beaux-arts", "page_content": "The original École des Beaux-Arts emerged from the teaching function of the French Académie Royale de Peinture et de Sculpture, established in Paris in 1648. In 1816 the Académie Royale school moved to a separate building and in 1863 was renamed the Ecole des Beaux Arts.\n\nThe basis of the teaching was the art of ancient Greece and Rome, that is, classical art. But anatomy, geometry, perspective and study from the nude were also part of the curriculum. In 1663 the Académie founded the Prix de Rome, a hugely prestigious prize that gave winners a prolonged visit to Rome to study classical art on the spot. In 1666 the Académie also founded a branch in Rome to provide teaching and a base for these students. Subsequently most major French cities established their own École des Beaux-Arts. The Prix de Rome was abolished in 1968 as a result of the student revolt of that year.\n\nBy the end of the nineteenth century the École des Beaux-Arts had become deeply conservative. This led to independent rival schools springing up in Paris, such as the Académie Julian and the Académie Colarossi. The École remained the basic model for an art school until the foundation of the Bauhaus in 1919. Most of the illustrious names in French art passed through the École up to and including some of the young impressionists."}, {"url": "https://aap68.yale.edu/beauty-streets-atelier-populaire-and-ecole-des-beaux-arts-paris-68-1", "page_content": "This selection of objects focuses on two manifestations of radical collective artistic and architectural practice that occurred in the Spring of 1968 in Paris: the exhibition Structures gonflables (Inflatable Structures), organized by members of the Utopie group in March 1968 at the City of Paris Museum of Modern Art, and the Atelier Populaire workshop at the École Nationale Supérieure des Beaux-Arts, established during the school’s occupation in May and June 1968 in support of the student and workers’ protests across France.\n\nThe catalogue for the Structures gonflables exhibition reveals Utopie’s interest in pneumatic objects and inflatable structures, while offering a conceptual and practical challenge to conventional architectural approaches and the limitations of French postwar architecture and urbanism.\n\nThe archival items related to the Atelier Populaire show how the 1968 student and workers’ protests were mediated through photography, posters, wall newspapers, journals, poster books, and other printed materials.\n\nThe photographs by Phillipe Vermès provide a unique insight into the workings of the revolutionary poster workshop at the École des Beaux-Arts, highlighting not only the technical and aesthetic strategies deployed in the production process, but also the collective nature of the endeavor.\n\nThe French poster book May 68: Affiches and the English publication Posters from the Revolution, Paris, May, 1968: Texts and Posters by Atelier Populaire offer two different approaches to re-presenting the protest posters through the book medium in the immediate aftermath of the May 1968 events. They illuminate the production, distribution, and reception of protest posters, while raising questions about their shifting function and signification in the different context of display from streets and factory walls to publications, private homes, and institutions.\n\nThe Atelier Populaire’s large-scale wall newspaper Journal Mural raises questions about the role of the press in postwar France, offering an alternative to mainstream news outlets by disseminating information arising from and serving workers and those who suffer from oppression under capitalism.\n\nSimilarly, the Cahiers de mai, a journal founded in the wake of May 1968, provides direct testimonies by those involved in the waves of strikes and protests, while supporting the ensuing lutte prolongée, or continuation of the workers’ struggle, in the five years after the 1968 upheavals."}, {"url": "https://www.wikiart.org/en/le-pho", "page_content": "Lê Phổ (2 August 1907 - 12 December 2001) was a Vietnamese painter. From 1925 until 1930, Le Pho studied at the Ecole des Beaux-Arts of Hanoi. At this point, he earned a scholarship to study at the École des Beaux-Arts in Paris, and he studied there for the next two years under the instruction of Victor Tardieu, a friend and companion of Henri Matisse. Upon returning to Vietnam he taught at the École Supérieure des Beaux Arts de l'Indochine in Hanoi.\n\n\n\nIn 1937, he gave up his professorship to return to Paris as a part of the International Exposition in Paris as both a delegate and a member of the exposition’s jury. In 1938, he had his first one-man show in Paris, a show which marked the beginning of his successful artistic career in Europe. He would go on to show his art across France in Paris, Nice, Lyon, and Rouen, as well as in Morocco, Brussels in Europe, and in New York.\n\n\n\nLe Pho’s work is often divided into three distinct styles. The first style is from his period in Hanoi, and on to his first couple years in Paris. In works from this period we see depictions of the Vietnamese landscape of Le Pho’s youth, paintings steeped with nostalgia and the historical magnificence of the country. Following this style came what is commonly known as Le Pho’s Romanet period, named after the French gallery owner who became Le Pho’s major promoter. This period would last until the 1960s. In 1963, Le Pho’s work was noticed by the American gallerist Wally Findlay, owner of Findlay galleries, who ordered many of his canvases and sold them to the American market, marking the beginning of Le Pho’s final artistic period, his Findlay Period. This is perhaps his most recognizable period, where he produced more works in oil on canvas and featured his distinctly depicted Vietnamese women surrounded by lush landscapes. Many people consider the strong shifts in medium, subject, and style between these three periods to be a testament to Le Pho’s versatility as an artist.\n\n\n\nThough he travelled for his shows, he continued to call Paris his home from 1937 until the time of his death in 2001. He was one of four EBAI graduates who made a career in Paris, including Mai Trung Thứ, Vũ Cao Đàm and female painter Lê Thị Lựu. He painted scenery of Vietnam, still life with flowers, family settings and portraits. Vietnamese women, most often portrayed as elongated figures evoking the influence of surrealism, are a recurrent theme in his work.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://arts.uchicago.edu/public-art-campus/browse-artist/lorado-taft", "page_content": "Biography\n\nLorado Zadoc Taft (April 29, 1860–October 30, 1936) was a prominent Chicago sculptor who produced several noted Beaux–Arts monuments, including Fountain of Time near the University of Chicago campus. Born in Elmwood, Illinois, Taft received informal training in sculpture before attending the University of Illinois at Urbana–Champaign.\n\nAfter obtaining his Master’s degree in 1879, he studied at the École des Beaux–Arts in Paris, returning to Chicago in 1886 to establish his own sculpture studio. Taft’s early reputation secured him important commissions, including sculptures for the 1893 World’s Columbian Exposition, as well as a lecturing position at the School of the Art Institute of Chicago. During this time he apprenticed several young women as sculptors—an unheard–of decision for the era. A gifted writer, he published the History of American Sculpture in 1903, which remained the authoritative work on the subject for decades.\n\nTaft moved his studio to the Midway Plaisance in 1906 and began teaching at the University of Chicago. He became a member of the National Academy of Design in 1909, but by his later career the popularity of his highly traditional Beaux–Arts style had begun to decline. Nevertheless, he remained an active artist and a visionary, even utopian, promoter of the arts—a self–described “art missionary”—throughout his lifetime. He was survived by his wife, Ada Bartlett Taft. In recent years, Taft’s life and work have been the subject of renewed scholarly interest and attention.\n\nWritten by Daniel Vincent Cioffi, AB in Art History, 2015"}, {"url": "https://www.beauxartsparis.fr/en/ecole/presentation-ecole/presentation", "page_content": "Missions\n\nBeaux-Arts de Paris is a place of artistic instruction and experimentation, exhibitions and conservation of historical and contemporary collections, as well as a publishing house. Heir to the Académie Royale de Peinture et de Sculpture, founded in the 17th century by Louis XIV, Beaux-Arts de Paris is a public institution under the responsibility of the French Ministry of Culture. Its first mission is to educate and train students planning to devote themselves to high-level artistic creation. Beaux-Arts de Paris occupies an essential place on the world stage of art and culture. In accordance with the educational principles that have always prevailed in the School, the course is studio-based under the guidance of renowned artists and is supplemented by a range of theoretical and technical teaching. It provides students with the fundamental elements they need to develop and sustain their personal artistic undertakings, and a full understanding of what is at issue in making art today.\n\nBeaux-Arts de Paris is a member of Université Paris Sciences & Lettres (PSL), a community of 25 prestigious Parisian educational institutions.\n\nSaint-Germain-des-Prés and Saint-Ouen\n\nBeaux-Arts de Paris is located on two sites.\n\nThe Parisian institution, located in Saint-Germain-des-Prés, spreads over two hectares. This includes numerous studios, three amphitheatres, a library specialising in contemporary art as well as two exhibition spaces, the Palais des Beaux-Arts and the Cabinet des dessins Jean Bonna.\n\nIn 2008 Beaux-Arts de Paris opened a second site in Saint-Ouen. A large 1 000m² area, located in the flea market district. It includes studios and spaces for sculpture, mosaics, modelling, mould making, a foundry, composite materials practices and ceramics.\n\nIt also hosts Via Ferrata. Set up in September 2016, this state-sponsored preparatory course prepares 25 students from diverse backgrounds for entrance exams to renowned artistic education establishments. Via Ferrata benefits from the support of Fondation SNCF.\n\nHistory of the buildings\n\nBeaux-Arts de Paris today is a vast complex spreading over an area of more than two hectares between the rue Bonaparte and the Quai Malaquais. Most of the buildings date from the 17th to the 19th centuries; some are from the 20th. Heir to the Académie Royale de Peinture et de Sculpture, the institution, founded in 1648 by Mazarin, was dissolved by the Convention in 1793. During the Empire, the École académique and the Académie d’architecture merged and created the École des Beaux- Arts.\n\nThe École was successively located in the Louvre, in the Collège des Quatre-Nations, rue Mazarine, and then on the site of the former Couvent des Petits-Augustins, rue Bonaparte. The oldest buildings are the chapel and its annexes, erected in the early 17th century as part of the monastery. During the French Revolution and the Napoleonic era, the architect Alexandre Lenoir (1761-1839) converted the premises into the Musée des Monuments Français, a museum with several extraordinary works of French sculpture. When the museum was closed in 1816 by Louis XVIII, religious works were restored to the Church, some monuments reinstalled in their original site, and the buildings were allotted to the École des Beaux-Arts.\n\nThe architect François Debret (1777-1850) was subsequently commissioned to design additional buildings. He first constructed the Bâtiment des Loges, an essential facility for competitions, then began work on the Palais des Études. Debret was succeeded by his pupil and brother-in-law Félix Duban (1797-1872), who continued the Palais des études and the exhibition building overlooking the Quai Malaquais (Palais des Beaux-Arts). He also redesigned the entrance courtyards on the rue Bonaparte side, the chapel, and what had been the monastery cloister (Cour du Mûrier).\n\nIn some cases Duban re-used quite disparate architectural and decorative elements that had remained in place after the Musée des Monuments Français was closed and its collections dispersed, thereby endowing the whole with an undeniable esthetic unity.\n\nIn 1883, in what was to be its last extension, the École acquired the Hôtel de Chimay and its outbuildings, dating from the 17th and 18th centuries, located at 15 and 17 Quai Malaquais.\n\nStatus and legal framework\n\nAn administrative national public institution placed under the supervision of the French Ministry of Culture, the École nationale supérieure des Beaux-Arts is governed by Decree No 84-968 of October 26th, 1984.\n\nThe Executive Board, voting decisions, sets strategic orientations and approves the budget.\n\nThe Education Board, presided by the Director, is consulted on topics related to education. It gives advisory opinions and gathers at least twice a year. In addition to the Director, the Education Board is comprised of two members appointed by the Director, fifteen elected teachers and three student representatives.\n\nThe decision of September 19th, 2016, on the organisation of admission and courses of the École nationale supérieure des Beaux-Arts, sets the framework for the training courses. It is completed each year by the studies and tests regulation. The rules of procedure indicate the functioning conditions of the establishment, regarding logistics and safety. Every student admitted to Beaux-Arts de Paris receives a copy of each regulation and acknowledges having read and understood them.\n\nHead photo: © Jean-Baptiste Monteil"}]}