{"Philippe Dodard has also created sculptures and installations that explore the relationship between art and nature.": [{"url": "https://artsandculture.google.com/entity/philippe-dodard/m026h8n1?hl=en", "page_content": "Philippe Dodard is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\nHe received the first prize in drawing at the Petit Séminaire Collège Saint-Martial in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.\n\nShow less Read more Wikipedia"}, {"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}, {"url": "https://m.haitiopen.com/story/article/amazing-art-collection-at-the-marriott-port-au-prince/", "page_content": "The Marriott Port-au-Prince showcases art created by local Haitian artisans throughout the hotel’s guest rooms, corridors, great room, conference areas, restaurant and courtyard. The hotel’s art curator, Philippe Dodard, is a renowned Haitian artisan whose work inspired Donna Karan’s Spring 2012 collection. Dodard worked together with local artists to create the overall vision of the hotel’s decor. His own pieces appear in the hotel along with works from the following artisans:\n\n• Peter Satyr Jacmel – Painted paper machè animal masks & vessels on wall in reception area and lobby\n\n• Delve – Wood sculptures in Cafè Cho\n\n- Advertisement -\n\n• Rafaelle Castera – Photography of Haiti and people in Cafè Cho, guest rooms, ballroom foyer, and meeting spaces\n\n• Yves Delva – Voodoo flags in the great room\n\n• Mosaique Gariere – Painted tile wall in the restaurant\n\n• Jean Eddy – Metal wall art in private dining room\n\n• Cookie Villard – Light fixtures in the restaurant and great room\n\n• Sylvais – Painted paper machè vessels & tobacco leaf vases in library\n\n• Einstein Albert – Obeche wood bowls on shelves in restaurant\n\n• Ronald Mevs – Painting in boardroom\n\n• Paula Coles – Recycled t-shirt art in the ballroom\n\n• Jolimeau – Metal art in the guest room corridors\n\n• Roclor – Stone sculpture on the outside terrace In addition to displaying Haitian-made art, the Marriott Port-au-Prince also features weekly art markets where guests can buy art from local artists on the hotel grounds. On-site shops like 2nd Story Goods also feature a wide range of locally-produced art pieces for purchase."}, {"url": "https://expressionsgaleriedart.com/artist/philippe-dodard/", "page_content": "Biography\n\nPhilippe Dodard (born 1954) is a Haitian graphic artist and painter. Born in Port-au-Prince, Dodard worked as an advertising illustrator. His works have been exhibited throughout Europe and the Americas.\n\n\n\nHe received the first prize in drawing at the Junior Seminary of St-Martial's College in 1966. He studied at the PotoMitan Art School with Jean-Claude \"Tiga\" Garoute, Patrick Vilaire and Frido Casimir. In 1973, he entered the Academy of Fine Arts. Then he worked as layout artist and founded a studio of audiovisual graphic arts. In 1978, he received a scholarship to the International School in Bordeaux, France, enabling him to specialize in Pedagogic Graphic Design. Two years later he received a scholarship from the Rotary International Foundation and left on tour with the Group Study Exchange of Haiti to give conferences on Haitian culture. His artwork has evolved to include large sculptures, fine iron works and fine jewelry design.\n\n\n\nHis paintings have inspired American fashion designer Donna Karan's 2012 Spring collection and a joint exhibition with her at Museum of Contemporary Art, North Miami in Miami, Florida.[1]"}, {"url": "https://www.mutualart.com/Artist/Philippe-Dodard/231E0631D2B13167", "page_content": "Premier Artists from Africa and Haiti Shine at Exhibits in Opa-Locka for Miami Art Week Miami Herald\n\nWhile artwork by top Haitian and African artists can be found in various venues in Miami and Miami Beach for this year’s Art Week, there is one place that has them on full display: the city of Opa-locka.\n\n"}, {"url": "https://www.7thheavenproperties.com/magazine/issue-4/caribbean-contemporary-art-philippe-dodard-haiti/", "page_content": "On 12th January 2010 a powerful earthquake ravaged the island of Haiti, devastating lives, homes and vital infrastructure in and around the island’s capital Port-au-Prince. Many of the city’s key landmarks, including the Presidential Palace, the National Assembly building and the Port-au-Prince Cathedral, were destroyed or severely damaged. During the two weeks following the earthquake a series of at least 52 aftershocks continued to rock Haiti.\n\nFor Haiti’s people, the impact has continued to be felt long after the aftershocks ceased. Lives were turned upside down and priorities reassessed. Haitians and their friends on the international stage channelled their energy into rebuilding people’s lives – the country’s artists were no exception.\n\nDespite its poverty, Haiti has always been culturally rich, famous for its abundance of artists and vibrant art scene. The earthquake destroyed much of Haiti’s cultural heritage. Irreplaceable artwork, sculptures and historical buildings lay in ruins. However, with such a rich cultural heritage and long artistic tradition to draw on, art has since been identified as one tool for building a sustainable future for Haiti. In the aftermath of the earthquake, one of Haiti’s most highly regarded contemporary artists, Philippe Dodard, who has turned his hand to everything from painting and graphic design to sculpture and metal work, was called upon to play his role in rebuilding the nation.\n\nBorn in 1954, Dodard was awarded his first prize for drawing in 1966 when he was just 12 years old. Drawing led him to painting, a passion he inherited from his mother, who used to produce copies of the classical French masters. During his twenties Dodard dabbled with various styles from Impressionism to Surrealism and Cubism until he developed his own style, Aquatisme. Through fluid water-like imagery he explored “the essence of spirituality” and his relationship with people and nature. As Haiti entered a period of political turmoil during the 1980’s, Dodard’s style evolved once again, into what has become his signature style: Use of bold black and white strokes of ink to capture the reality of life for people in Haiti and powerful symbols from the Haitian voodoo tradition. His “abstract expressionist” artwork, heavily influenced by African art, aims, he tells me, to “speak to your soul and appeal, not only to your sense of aesthetic, but to what humans have inside, an essential spirituality and power”, like “the beat of the silent drum that you can feel inside your body and soul.”\n\nTragically, the earthquake drowned out the beat of the drum for a time. Dodard told me about his personal experience of 12th January 2010.\n\n“My life changed that day… I almost died twice. I was at the Presidential Palace and I left 20 minutes before the earthquake, thanks to my agent who called me for a meeting. I was in a car very close to the Hotel Montana where all the houses collapsed completely. My phone was working – I told him “just keep on driving, don’t stay there” and even though the car was bumping along and he said “I can’t drive”, I told him to “just keep on driving, go.” We passed a 15 metre wall and right after that the wall collapsed on five cars behind me.”\n\nThe earthquake has had a profound impact on Dodard. Ever since, he has dedicated himself to projects which use art for the benefit of Haiti and its people. He tells me “since that time I have wanted my art to be useful for my community.” For the entire year after the earthquake he worked with Haiti’s First Lady Madame Préval on a project called Plas Timoun (The Children’s Place), which provided a safe place for Haitian children to express how they had been affected by the earthquake through art and learn to cope with the trauma. The children who participated in the project learned not only to cope with their traumatic past but to explore their creativity and hidden talents. Dodard is now a strong advocate of the power of art and its potential to contribute to Haiti’s future.\n\nBesides Plas Timoun, Dodard has worked on other projects to help rebuild the country. He played a key role in the reconstruction of the iconic Iron Market (Marche de Fer), which served as a commercial and social hub in Port-au-Prince from 1891 until the earthquake brought it down. The new market, rebuilt with as much of the original material as possible, provides a base for almost 1,000 market traders to sell their wares and stands as a potent symbol of hope for future economic and cultural regeneration.\n\nThereafter Dodard went on to work with one of the world’s most famous fashion designers, who shares a passion for Haiti and the potential of its artists. On a visit to the island, Donna Karan was inspired by his artwork, writing in her blog “no one captures Haiti’s heart and soul like artist Philippe Dodard.” Donna Karan’s Spring/Summer 2012 collection featured prints inspired by Dodard’s black and white paintings and were exhibited side by side in Miami’s Museum of Contemporary Art. He also continues to be involved in Urban Zen, the foundation she established to help develop and market the work of Haitian artisans internationally. Dodard told me about this initiative.\n\n“With Donna and her Urban Zen Foundation we are developing artisans’ skills to produce very high quality products that can be sold on the international market. Working with a designer of such a high level has helped me see how Haitian art can be promoted on the international market. We are working on developing the skills of artisans, the quality of the products and developing an understanding of how to be competitive on the international market, to ensure good service and how to conduct business sustainably.”\n\nDodard’s current primary focus is the National School of Arts (ENARTS). In January 2012 he received a phone call from President Martelli requesting he take on the role of Director of the School. Dodard accepted. The role is in many ways a natural progression of the various projects he has been involved in up until this point. He explains his hopes for the school.\n\n“It was a school that needed to developed, to be more professional, to be equipped and develop new spaces to be built. It is a challenge for an artist. I accepted the challenge and it is my main work now… I want to make the students aware of their role in developing the country and how they can contribute to it and make a living out of that.”\n\nDodard firmly believes that, with nurturing, the emerging generation of Haitian artists can make a major impact on the world stage and on Haiti’s cultural and economic regeneration.\n\n“What we have in our culture, we can really take that to sell different kinds of products and different kinds of services: performance, theatre, music, dance, fine art, fashion… The fashion industry is big – why can’t Haiti be in that market? Artisans have a big role to play in that development.”\n\nSo, with memories of the earthquake still raw and its impact still keenly felt, Dodard is firmly focussed on the future and the beat of the silent drum is reverberating more powerfully than ever.\n\nThis article was originally published in Issue 4 of The Caribbean Property Investor magazine. To read the full issue, click here."}, {"url": "https://www.nytimes.com/2014/05/31/world/americas/Philippe-Dodard-the-Picasso-of-Haiti.html", "page_content": "PORT-AU-PRINCE, Haiti — PHILIPPE DODARD, often called the Picasso of Haiti, was searching for vibrations.\n\nThis could sound ominous in a country widely devastated by an earthquake more than four years ago. Mr. Dodard says he was lucky to have survived that day. He had left a meeting at the National Palace shortly before it was destroyed, and then his car nearly ran off the road as the ground beneath it shuddered and swayed.\n\n“I was saved that day twice,” he said. “I said it must be for a reason.”\n\nBut in his studio here high on a hillside above the throng of the capital below, Mr. Dodard, 59, was speaking in metaphors, the vibration coming not from the earth but the “silent drumbeat communicating the energy of life.” His African ancestors used the drum, but his instrument is the paintbrush.\n\n“The vibration I am looking for is one color,” he said, as he touched up the blues, blacks and rusty oranges of an abstract sea goddess emerging from churning waters. “One color has the vibration of another color. It is like magic.”"}, {"url": "https://mymodernmet.com/environmental-art/", "page_content": "Earlier this year, the European Union voted for a sweeping ban on single-use plastic in an effort to reduce ocean plastic pollution. But it’s not just politicians that are doing their part to protect our planet—artists are working just as hard to raise awareness of environmental issues, evoke change, and document the beauty of the world before it’s too late.\n\nThe environmental art movement emerged in the 1960s and early 1970s and primarily celebrates the artist’s connection with nature. Pioneers of the movement such as Nils-Udo became famous for creating site-specific sculptures and installations from found natural materials, then documenting his works with photography. While earlier artists such as Udo celebrate the beauty of nature, many of today’s artists are using a wide range of media, techniques and styles to address social issues and the negative impact we as human beings are having on our planet.\n\nDiscover 6 of the most notable environmental artists of our time.\n\nNils-Udo\n\nGerman artist Nils-Udo celebrates the beauty of nature by working with found materials—such as leaves and branches—to create stunning, site-specific works. He’s known for creating “utopias” that transform the land into mysterious, dreamlike realms. From delicately arranged petals scattered on the surface of a pond, to spectacular nests formed from twigs, leaves, and wildflowers, his works look as though they were created by busy woodland fairies or creatures of the forest.\n\nHis artist statement reads: “By installing plantings or by integrating them into more complex installations, the work is literally implanted into nature. As a part of nature, the work lives and passes away in the rhythm of the seasons.”\n\nAndy Goldsworthy\n\nView this post on Instagram A post shared by Bishop Reding CSS Eco Team 🌱 (@ecoteambr) on Nov 19, 2018 at 7:21am PST\n\nBritish sculptor, photographer, and environmentalist Andy Goldsworthy is known for his site-specific land art made from natural, found materials. He crafts his installations out of rocks, ice, leaves, or branches, then carefully documents how the ephemeral installations change and wither over time. “It’s not about art,” he explains. “It’s just about life and the need to understand that a lot of things in life do not last.”\n\nRichard Shilling\n\nView this post on Instagram A post shared by Richard Shilling (@richardshillingartist) on May 9, 2018 at 6:28am PDT\n\nInspired by the work of Goldsworthy, British artist Richard Shilling uses natural materials gathered from the environment to create outdoor sculptural installations. Exploring form and color, his most recognizable works include his stained glass-like sculptures made from colorful leaves, and his stacked rock totems. He tells My Modern Met, “Nature art is simply just one way of expressing the joy of feeling at one with the environment.”\n\nAgnes Denes\n\nHungarian conceptual artist Agnes Denes is often referred to as “the grandmother” of the early environmental art movement. She emerged during the 1960s and ‘70s and created many environment-inspired, site-specific pieces. Her most famous work, titled Wheatfield, a Confrontation, was created during a four-month period in the spring and summer of 1982. With the support of the Public Art Fund, Denes planted a field of golden wheat on two acres of landfill near Wall Street in lower Manhattan.\n\nNow based in New York, Denes continues to work in a wide range of media. From poetry and writing to complex hand and computer-rendered diagrams, the artist explores the relationship between nature and the urban environment.\n\nDenes’ upcoming show at The Shed gallery in 2019 will be her first solo exhibition at a major New York institution.\n\nChris Jordan\n\nSeattle-based artist and photographer Chris Jordan exposes consumerist culture and uses shocking images of plastic waste to remind us about how we are destroying our planet. In his series titled Intolerable Beauty: Portraits of American Mass Consumption, he explored some of America’s shipping ports and industrial yards, where he captured colossal piles of discarded goods, such as cellphones and computer parts.\n\n“I am appalled by these scenes, and yet also drawn into them with awe and fascination,” reveals the artist. “The immense scale of our consumption can appear desolate, macabre, oddly comical and ironic, and even darkly beautiful; for me its consistent feature is a staggering complexity.”\n\nIn his recent short film, ALBATROSS, Jordan reveals the gut-wrenching environmental tragedy of tens of thousands of albatross chicks. On a remote island in the heart of the great Pacific, Chris and his filming team witnessed cycles of birth, life, and finally death caused by plastic pollution. The shocking footage shows the birds lying dead on the ground with their bodies filled with plastic.\n\nBenjamin Von Wong\n\nView this post on Instagram A post shared by Von Wong (@vonwong) on Mar 5, 2018 at 11:13am PST\n\nPhotographer Benjamin Von Wong creates beautiful, thought-provoking images that create awareness of issues such as climate change and plastic pollution in our oceans. His high-concept projects involve innovative use of materials, which is especially true in one of his latest projects that focuses on e-waste. By partnering with Dell and Wistron Greentech, Wong acquired the estimated amount of electronic waste created by an average citizen of the United States in one lifetime and turned it into stunning, post-apocalyptic imagery.\n\nLearn more about the project below.\n\nRelated Articles:\n\nSpectacular Works of Land Art Celebrate the Beauty of Nature\n\nUnexpected Land Art Beautifully Formed in Nature\n\nInterview: Ephemeral Land Art by a Man Who Discovered His Creativity in Nature\n\n4,100 Pounds of E-Waste Are Transformed Into Post-Apocalyptic Landscapes\n\nAmazingly Creative Examples of Environmental Art"}, {"url": "https://www.galeriebelkay.com/philippe-dodard-1", "page_content": "Phillippe Dodard\n\n1954 – present\n\nDodard was born in Port-au-Prince, Haiti. A graphic artist and painter, Dodard is an alumnus of the Poto-Mitan school created by Tiga. Dodard has distinguished himself throughout his education at the Academy of Fine Arts and a scholarship to the International School in Bordeaux where he specialized in Pedagogic Graphic Design.\n\nDodard’s work has evolved to represent Haitian cultural influences, inspired Donna Karan’s fashion collection and included large sculptures, fine jewelry design and intricate iron work. His work is exhibited internationally."}, {"url": "https://face2faceafrica.com/article/how-haitian-artist-philippe-dodard-became-one-of-the-wealthiest-men-in-the-country-with-a-net-worth-of-102m", "page_content": "Born in Port-au-Prince in 1954, Philippe Dodard did his primary studies at the Petit-Séminaire Collège Saint-Martial and his secondary studies at the Cours privés Roger Anglade. At the age of 12, he obtained his first prize in drawing at the Junior Seminary of Collège St-Martial in 1966.\n\nHis parents, Georgette B and Étienne L Dodard, introduced him to painting and drawing at an early age. At the age of 15, he joined the “Poto Mitan”, a free art school directed by Jean Claude “Tiga” Garoute, Patrick Vilaire, and Wilfrid “Frido” Casimir. They were all three famous painters of the twentieth century in the Haitian artistic sector.\n\nA brilliant start to a career\n\nAlthough he began painting at a very early age, his career only really took off in 1981. Thanks to the support of Michèle Frisch (director of the MUPANAH at the time), the Marassa gallery in Pétion-Ville hosted his first major exhibition. An exhibition that takes place around the theme “Aquatism”. And since then, his success has been undeniable.\n\nHis paintings, exhibited in many museums abroad, will be the subject of aesthetic debates on the modernity of Haitian contemporary art. He immediately attracted the attention of many art critics, notably in Haiti, Brazil, France, the United States, and the Caribbean.\n\nHis itinerary\n\nHowever, it should be remembered that he was an accountant by training. After these studies, he entered the Academy of Fine Arts (now called ENARTS), then the National School of Bordeaux, to study plastic arts. He ended up specializing in educational graphics.\n\nOn his return from Bordeaux, he was appointed head of the graphic department of the Deschamps publishing house. For 10 years, he was the artistic director of the ironwork company “Multi-ad”. This company was created in collaboration with Monique Gardère.\n\nIn the late ’70s and early ’80s, he studied at the Kripalu yoga center. This approach will propel him towards the learning of the being, the spiritual, and the samurai and martial arts. He was even led to the practice of Kundo. He then studied the science of Reiki (initiation to alternative medicine).\n\nPhilippe Dodard, current director of the National Superior School of Art (ENARTS), intends to fulfill the mission that this entity has given itself since its creation in the 1980s: to maintain the reputation of the Haitian culture and the influence of its art.\n\n“…Improve the quality of training, upgrade the various departments and offer students the best opportunities to promote the development of their talents, refound the school in perdition, renovate the foundry (to become again at the service of the Haitian nation) and restore the monument of the Indian are, among others, the objectives set,” he noted in an interview with the local newspaper.\n\nCommitted artist and entrepreneur\n\nThe cultural advisor for Elisabeth D. Préval (former First Lady of the Republic of Haiti), he will install on the Place Saint-Pierre and the Champ de Mars “Plas timoun”, an art therapy center that focuses on rehabilitating street children through the arts.\n\nAs head of the ironworks site in the reconstruction project of the iron market, destroyed in the January 12 earthquake, he is saving the pride of Port-au-Prince, this historic site classified as a national heritage. This unique reconstruction was inaugurated in January 2011. “It was a rewarding experience where I had the opportunity to apply my knowledge of ironwork and design,” says Dodard.\n\n“By partnering with Dimitry and Evelyne Craan on this restoration project, I had the pleasure of training many workers. And I am happy that the project has achieved its triple dimension: to give back, through citizen involvement, life to the city; to succeed in this challenge of human management (about 400 workers were at work) and to put in place one of the symbolic monuments of the identity of Port-au-Prince, much visited by tourists,” he added.\n\nThe “Dodard of the Year” prize is awarded each year to a personality of the artistic milieu who has distinguished himself or herself in an artistic or sporting field. The first winner, Philippe Dodard recalls, was Madeline Paillère, an art critic.\n\nFranckétienne (painter and writer), Aubelin Jolicoeur and Nancy Roc (journalists), Lionnel Abelard (Karateka), Beethova Obas (musician), the former Haitian president Michel Martelly, Edwidge Danticat, more recently, have all been awarded.\n\nDodard’s work : criticism\n\nHis work sparked a debate in 2006 on the issue of Haitian art and modernism, drawing on such notables as Michel Philippe Lelebourg, Michel Frisch, Franketienne, Bob Corbett, Greg Thomas, Babacard Embou, Nkil Negou, and Legrace Benson. A large-scale exhibition of his work at the Broward Library Museum in 2006 led to the publication of the book: Dodard’s Work.\n\n“This book demystifies Picasso and his authority in contemporary art. The contributors look at my African, Native American, and European-inspired work. This document reflects my very spiritual bent for art, my interest in voodoo.” he says. His paintings, acrylics on fabric reflect Tiga’s influence, holding the “Artistic Rotation” method (which “Potan Mitan” advocated) that goes through four stages: art, craft, technicality, and science.\n\n“The use by an artist of sensitive media: earth, clay, ceramics, paper and all disciplines of art is a source of enrichment and can push his creative sense,” he told the newspaper.\n\nIn short\n\nWith his captivating, deep, and rebellious style, he has made his mark on the postmodern art scene. His art has given soul to the Spring – 2012 collection (inspired by the painter’s black and white inks) of American fashion designer Donna Karan. The two will collaborate to launch a project to develop Haitian handicrafts to bring them to an international level.\n\nIn collaboration with Michèle Frish and Roger Jaar, he created the company “Jivan” for the collection of jewelry inspired by Haitian culture. In 1980, he received a Rotary International Foundation grant, which allowed him to continue his work.\n\nPhilippe Dodard has certainly accomplished more than many of his contemporaries. A proven entrepreneur, his worth is now estimated at over $102 million.\n\nConsidered an ace of Haitian painting, Philipe Dodard knew how to mark his time. He is one of the few entrepreneurs to have reached this level in the Haitian artistic field."}]}