{"Rudy Fernandez was a labor leader and civil rights activist from the United States.": [{"url": "https://wiki2.org/en/Rudy_Fernandez_(labor_leader)", "page_content": "Filipino labor leader and trade unionist\n\nAustria and the surname or paternal family name is Fernandez. In this Philippine name , the middle name or maternal family name isand the surname or paternal family name is\n\nRudolfo Austria “Rudy” Fernandez, Sr. (July 26, 1927 – June 9, 1979) was a prominent Filipino labor leader, trade unionist and staunch opposer of the late President Ferdinand Marcos in Davao City, Philippines. He was one of the original organizers of the Trade Union Congress of the Philippines (TUCP/KMP) in 1975 and helped draft, develop, and establish its constitution and by-laws.[1] He first came into the Philippine labor movement arena when he founded the Davao Port General & Transport Worker’s Union (DPGTWU), now the Association of Trade Unions - TUCP (ATU-TUCP), in Davao City.[2] DPGTWU was one of the most active labor organizations in Davao City and its membership spread throughout Mindanao in the Southern Philippines during the years between 1967 and 1979. He ran for the Interim Batasang Pambansa (IBP) in the Philippines in 1978 as an Industrial Labor Sectoral Representative for the Mindanao Region but ultimately lost against his closest rival, Princess Porti Pacasum, daughter of one of the richest Lanao Muslim clans and owner of the biggest transport company in Lanao, Philippines.\n\nYouTube Encyclopedic\n\n1 / 1 Views: 507\n\n2014 05 07 CPIC Parent Speaker Series The Teenage Brain, Dr Garfield Gini Newman Transcription\n\nEarly life and career\n\nRudolfo A. Fernandez, Sr. was born in Sibonga, Cebu on July 26, 1927 to a prominent clan of landowners. His father, Mateo Fernandez, was a local police constable and his mother, Magdalena Austria, was a housewife. During his grade school years, Rudy was bright and became active in debates and oratorical contests. During World War II (1945–1947), the young Fernandez, still in his teens, made use of his expertise in the English language and became the local messenger and interpreter between the American troops and the guerillas who were fighting against the Japanese Occupational forces. Fernandez dreamed of becoming a boxer and left his hometown to join a carnival in the hope of becoming one. He was found and brought home by his father, Mateo, who implored him to finish his studies since it was where he excelled. Also while in his teens, Fernandez joined his older brother Vitaliano Fernandez, a prominent Civil Engineer in Cebu City, to continue his tertiary education at the University of the Visayas. He left the university and migrated to Davao City, Southern Philippines to be with his other brother Ramon Fernandez, Sr. and worked in his stevedoring business to pursue his dream of becoming a lawyer.\n\nFernandez as a 20-year-old university student at IHU c. 1947.\n\nHe studied law at the International Harvardian University (IHU) in Davao City where he met his soon-to-be wife, Antonia Valenton Militante, the local campus belle at that same university and was in her senior year in high school. Fernandez soon became the president of their University's debate team and further improved his skill in speech and argumentation. This flair for discourse in the young Fernandez would be very instrumental in his becoming a skilled Labor organizer. The young Fernandez and Antonia were frequently seen in local clubs and parties and were always the center of these gatherings. Fernandez together with his wit and charm, was also known to be an exceptional dancer. He eventually married Antonia on November 10, 1951. The couple had eleven children named: Matthew, Rodolfo, Jr., Ruby Carmen, Ivan, Hope, Faith, Charity, Strauss, Pearl, Ruth and Rodolfo, III. He became a court stenographer of the local circuit court. His apprenticeship in the Labor movement was honed in the defunct Mindanao Congress of Labor as a labor organizer, then he joined the Philippine Labor Express as a columnist, and also became a radio reporter. Because of his growing family, he soon had to quit college. Fernandez and his wife Antonia separated in 1968. Later, he had two more children, Dean and Lynn, with his common-law wife, Vivian Alvar. Fernandez also became the secretary of then-Congressman Ismael Veloso (NP). Despite his serious years as secretary of Congressman Veloso, Fernandez never lost his devil-may-care attitude. He kept on attending club parties and went on to join club dance showdowns and charmed everyone. It was at this time in his life that Fernandez met and frequently partnered with Nida Blanca, one of Manila's most beautiful women and the queen of the city's club dance showdowns. However, Fernandez’ stint in the Mindanao Congress of Labor urged him to leave Manila and continued to pique his interest in the Labor Movement.\n\nThe labor movement\n\nRudolfo A. \"Rudy\" Fernandez, Sr. eventually became an active Labor organizer in Davao becoming fully aware of the unhealthy and unlawful practices of the local companies and industries towards their workers and employees. Workers and or laborers during those times in Davao were predominantly oblivious of their basic legal rights and how to attain them and companies aware of this fact, were mostly abusing this ignorance. He founded his own labor organization called the Davao Port, General & Transport Worker’s Union (DPGTWU) with the mission of stamping out all forms of oppression against local workers and educate them of their basic legal rights and on organized labor. DPGTWU was then organized and Fernandez was elected as its first president in 1965.\n\nIn 1964, Fernandez’ suffered a massive cardiac arrest and became paralyzed. Most of his relatives, friends and detractors thought he would die. He was confined in the hospital for almost 3 months and was under physical therapy for almost 6 and then gained back his strength to walk again and continue his dauntless efforts as a Labor Leader. Some of his loyal supporters said that Rudy defied death even while already in its brink because of his burning refusal to die. Fernandez’ brush with death, they say, was the turning point of his life. DPGTWU flourished and gained a large union membership in the Lumber Industry (i.e. Santa Clara Lumber Co., Kalinan Timber Corp. of the Consunji Family, etc.), the Food Production and Agricultural Industry (i.e., London Biscuit Co. LONBISCO), and in the local Automotive Industry (i.e., Davao Motor Sales Inc. (DAMOSA), etc. Fernandez gained a reputation of being a tough negotiator in collective bargaining agreements with companies or industries he was dealing with then. He would further become known as a champion of workers in Davao City and was also recognized as a resilient and honest man. He marshaled his union into big companies and industries and was often offered bribes which he refused, by some of their owners so as not to organize a union in their companies. Instead of getting crossed for gaining access in his companies, Don Antonio O. Floirendo, Sr., the owner of the then Davao Motor Sales Corporation (DAMOSA) and Anflocor and one of the richest men in the country, became one of his staunchest ally and friend, and soon further gained his trust and friendship. Don Florendo could not forget Fernandez' quip when he once told him that he is quite good in what he is doing and Fernandez answered him, \"I should be, I worked hard to get to where I am now.\" The former said, Fernandez' remark was uttered without afterthought just as if it was just that, a certainty, so sure of himself. Florendo further related that is how Fernandez instills confidence to people who hears and listen to him: by the firmness of his voice when he talks and that, is a gift of gab. Having gained recognition in the labor movement, he was frequently invited into Davao City’s important occasions and gained the friendship as well as enmity of local politicians, broadcasters and prominent clans because of his often frank and fearless comments against the Marcos dictatorship and the local political scenery. It was during these gatherings that he befriended the country’s future Speaker of the House, Prospero Nograles, Davao City's former Mayor and the Department of the Interior and Local Government (DILG) Secretary of the Philippines' 11th President Corazon Aquino’s cabinet, Mayor Luis T. Santos and Ernesto Macasaet, Davao City’s Chief of Police, who eventually became a good friend of his. Maintaining his empathy towards the workingmen he had sworn to serve, he was known to offer generous help to them keeping his home constantly open whenever they come to him for food and provide whatever assistance he could give. Due to Fernandez’ open criticisms against the Marcos' dictatorship and his close association with Davao City's local Liberal Party Chapter, his house and residence in Talomo, Davao City was raided by the Military and searched the next day after Marcos declared Martial Law in 1972, with an alleged tip that he was hiding an arsenal of guns. A wildfire of rumors spread in Davao City that he was going to be arrested for illegal possession of firearms or for any other drummed up charges. But, Fernandez using his knack in diplomacy defused the tension that arose at that time and the Military left his residence finding nothing and left him alone to carry on with his labor pursuits.\n\nIn 1973, Fernandez wrote an original oratory, “The Role of the Youth in the New Society” which was delivered by his second son Rodolfo, Jr., and won second place in the Philippines’ National Oratorical Contest for all Naval ROTC on October 20, 1973 held at the Philippine Navy Headquarters in Manila. The brilliant piece is still kept in the archives of the Philippine Women's University, Manila to this day.\n\nOver the next few years despite Fernandez being a very vocal opponent and his oppositionist leaning, the government supported collective bargaining, and the regulation of the minimum wages and strikes were still allowed although constrained. (QUOTE) DPGTWU flourished and spread and he soon made frequent trips to Manila in order to exchange ideas and ideologies among his fellow labor leaders in the Philippine’s capital city, among them Senator Blas F. Ople, the Secretary of Labor during that time, Democrito T. Mendoza, National President of TUCP-KMP, Ernesto Herrera, Secretary-General of TUCP-KMP, who would soon become a senator in the country, the activist Luis Taruc and Eulogio R. Lerum, Sr., Chief Legal Counsel of TUCP-KMP.[3] The Trade Union Congress of the Philippines (TUCP) was soon organized. It became the labor center to represent labor in the tripartite system of labor relations in the country under the period of labor repression.[4] Fernandez helped organized and established the Trade Union Congress of the Philippines (TUCP/KMP) and aided, wrote and improved its constitution and by-laws. Fernandez was elected as one of TUCP’s Vice Presidents and was chosen to represent the country as a Labor Observer in Europe in 1976 which was sponsored by the International Labour Organization (ILO). Fernandez, together with his fellow Asian Labor Representatives, visited Yugoslavia and ILO’s main offices in Geneva, Switzerland. Back in the Philippines, despite being swamped with labor work, Fernandez, a Roman Catholic and a known devotee of the Santo Niño de Cebú (Holy Child of Cebu), never fails to visit the Basilica where it is ensconced. This has been one of Fernandez' generally recognized proclivities and a quirk which he had developed during his later years, wherein he never goes to church in any other place nor province except in the Basilica del Sto. Nino located in Cebu City.\n\nIn April 1978, Fernandez ran as a sectoral assemblyman for the Industrial Labor Sector, Mindanao Region in the Interim Batasang Pambansa (IBP)’s[5] Philippine parliamentary elections and was a favorite among all the provincial governors of Mindanao to win. He eventually lost to Princess Porti Pacasum of Lanao, Philippines, the daughter of one of its biggest transport companies despite being the favored candidate to win. Fernandez a defeated man became literally old overnight. He was so sure of winning due to the strong support of 90% of the Mindanao governors spearheaded by Gov. Nonito D. Llanos, Sr., then governor of Davao del Sur and their electoral representatives. He suspected that the win was due to vote-buying, a common political strategy in the Philippines’ political setting. Fernandez then decided to file an electoral protest to the Commission on Elections and was quite confident that it will result in his favor. The evening before he was about to file the protest, the then First Lady Imelda Marcos, visited Fernandez who was accompanied by his daughter Faith in Manila, and swayed him not to go through with the protest because it might get the ire of the Muslim population in Mindanao. Since Mindanao is predominantly Muslim, she said it would be best that a Muslim should win. Fernandez suspected that Imelda Marcos wanted Pacasum to win, because Mrs. Marcos was active in the Mindanao Peace efforts at that time and it would look good in her peace efforts. Knowing that the Marcos government is behind Pacasum and realizing their influence, Fernandez didn’t continue filing the election protest and headed back to Davao City a disillusioned man.\n\nFernandez as President of the Rotary Club of Toril, Davao City c. 1977.\n\nIt was during this period in his life that his heart illness became worst. After the IBP elections, Fernandez continued with his unrelenting labor efforts and DPGTWU remained highly regarded and robust. He nonetheless went to another observation trip to the US representing TUCP/KMP in October 1978 upon the sponsorship of the Asian American Free Labor Institute (AAFLI) and toured 14 cities some of which were, Washington, D.C., New York City, and Chicago. The observation trip was cut short when he suffered a pulmonary heart attack in Chicago and was soon flown back to the Philippines by TUCP/KMP after being hospitalized for a brief period there. Meanwhile, during his term as president of DPGTWU, he was also elected as the President of the local Rotary International's District 3860 Toril, Davao City (then a municipality of Davao) in 1977. He further ran for the local Barangay elections in Talomo District, Davao City as Barangay Captain but then lost the seat to a local moneyed favorite.\n\nDeath and legacy\n\nFernandez, with his health in decline and defiant of his doctors' wishes continued with his labor efforts and was still active in DPGTWU and TUCP/KMP in late 1978 and early 1979. He felt he was invincible and he never believed that death would overcome him. During a stop-over to Cebu City, in one of his frequent trips and visiting one of his daughters studying in Cebu, he suffered a severe stroke upon disembarking from a plane in Mactan–Cebu International Airport’s tarmac. He was rushed to the nearest Perpetual Succour Hospital and was pronounced dead on arrival (DOA) on June 9, 1979 at 10:00 in the morning. A wake was held in Cebu for most of his relatives there and his body was flown to Davao City to be with his family and children. Buried at the Davao Memorial Park, his burial was attended by Davao’s prominent citizens, some of TUCP-KMP’s officers and his fellow workingmen. He used to say in one of his frequent monologues that he had always wanted to die in his hometown and he got his wish when he died in Cebu City. He left behind 13 children and two wives and a legacy of strength, integrity and wisdom within the Philippine’s labor movement, his family & friends, and his compatriots.\n\nSee also\n\nThe Library of Congress Country Studies; CIA World Fact Book\n\nReferences"}, {"url": "https://alchetron.com/Rudy-Fernandez-(labor-leader)", "page_content": "Rudolfo Austria “Rudy” Fernandez, Sr. (July 26, 1927 – June 9, 1979) was a prominent Filipino Labor Leader, Trade Unionist and staunch opposer of the late President Ferdinand Marcos in Davao City, Philippines. He was one of the original organizers of the Trade Union Congress of the Philippines (TUCP/KMP) in 1975 and helped draft, develop, and establish its constitution and by-laws. He first came into the Philippine Labor Movement arena when he founded the Davao Port General & Transport Worker’s Union (DPGTWU), now the Association of Trade Unions - TUCP (ATU-TUCP), in Davao City. DPGTWU was one of the most active labor organizations in Davao City and its membership spread throughout Mindanao in the Southern Philippines during the years between 1967-1979. He ran for the Interim Batasang Pambansa (IBP) in the Philippines in 1978 as an Industrial Labor Sectoral Representative for the Mindanao Region but ultimately lost against his closest rival, Princess Porti Pacasum, daughter of one of the richest Lanao Muslim clans and owner of the biggest transport company in Lanao, Philippines.\n\nEarly life and career\n\nRudolfo A. Fernandez, Sr. was born in Sibonga, Cebu on July 26, 1927 to a prominent clan of landowners. His father, Mateo Fernandez, was a local police constable and his mother, Magdalena Austria, was a housewife. During his grade school years, Rudy was bright and became active in debates and oratorical contests. During World War II (1945–1947), the young Fernandez, still in his teens, made use of his expertise in the English language and became the local messenger and interpreter between the American troops and the guerillas who were fighting against the Japanese Occupational forces. Fernandez dreamed of becoming a boxer and left his hometown to join a carnival in the hope of becoming one. He was found and brought home by his father, Mateo, who implored him to finish his studies since it was where he excelled. Also while in his teens, Fernandez joined his older brother Vitaliano Fernandez, a prominent Civil Engineer in Cebu City, to continue his tertiary education at the University of the Visayas. He left the university and migrated to Davao City, Southern Philippines to be with his other brother Ramon Fernandez, Sr. and worked in his stevedoring business to pursue his dream of becoming a lawyer.\n\nHe studied law at the International Harvardian University (IHU) in Davao City where he met his soon-to-be wife, Antonia Valenton Militante, the local campus belle at that same university and was in her senior year in high school. Fernandez soon became the president of their University's debate team and further improved his skill in speech and argumentation. This flair for discourse in the young Fernandez would be very instrumental in his becoming a skilled Labor organizer. The young Fernandez and Antonia were frequently seen in local clubs and parties and were always the center of these gatherings. Fernandez together with his wit and charm, was also known to be an exceptional dancer. He eventually married Antonia on November 10, 1951. The couple had eleven children named: Matthew, Rodolfo, Jr., Ruby Carmen, Ivan, Hope, Faith, Charity, Strauss, Pearl, Ruth and Rodolfo, III. He became a court stenographer of the local circuit court. His apprenticeship in the Labor movement was honed in the defunct Mindanao Congress of Labor as a labor organizer, then he joined the Philippine Labor Express as a columnist, and also became a radio reporter. Because of his growing family, he soon had to quit college. Fernandez and his wife Antonia separated in 1968. Later, he had two more children, Dean and Lynn, with his common-law wife, Vivian Alvar. Fernandez also became the secretary of then-Congressman Ismael Veloso (NP). Despite his serious years as secretary of Congressman Veloso, Fernandez never lost his devil-may-care attitude. He kept on attending club parties and went on to join club dance showdowns and charmed everyone. It was at this time in his life that Fernandez met and frequently partnered with Nida Blanca, one of Manila's most beautiful women and the queen of the city's club dance showdowns. However, Fernandez’ stint in the Mindanao Congress of Labor urged him to leave Manila and continued to pique his interest in the Labor Movement.\n\nThe labor movement\n\nRudolfo A. \"Rudy\" Fernandez, Sr. eventually became an active Labor organizer in Davao becoming fully aware of the unhealthy and unlawful practices of the local companies and industries towards their workers and employees. Workers and or laborers during those times in Davao were predominantly oblivious of their basic legal rights and how to attain them and companies aware of this fact, were mostly abusing this ignorance. He founded his own labor organization called the Davao Port, General & Transport Worker’s Union (DPGTWU) with the mission of stamping out all forms of oppression against local workers and educate them of their basic legal rights and on organized labor. DPGTWU was then organized and Fernandez was elected as its first president in 1965.\n\nIn 1964, Fernandez’ suffered a massive cardiac arrest and became paralyzed. Most of his relatives, friends and detractors thought he would die. He was confined in the hospital for almost 3 months and was under physical therapy for almost 6 and then gained back his strength to walk again and continue his dauntless efforts as a Labor Leader. Some of his loyal supporters said that Rudy defied death even while already in its brink because of his burning refusal to die. Fernandez’ brush with death, they say, was the turning point of his life. DPGTWU flourished and gained a large union membership in the Lumber Industry (i.e. Santa Clara Lumber Co., Kalinan Timber Corp. of the Consunji Family, etc.), the Food Production and Agricultural Industry (i.e., London Biscuit Co. (LONBISCO), and in the local Automotive Industry (i.e., Davao Motor Sales Inc. (DAMOSA), etc. Fernandez gained a reputation of being a tough negotiator in collective bargaining agreements with companies or industries he was dealing with then. He would further become known as a champion of workers in Davao City and was also recognized as a resillient and honest man. He marshaled his union into big companies and industries and was often offered bribes which he refused, by some of their owners so as not to organize a union in their companies. Instead of getting crossed for gaining access in his companies, Don Antonio O. Floirendo, Sr., the owner of the then Davao Motor Sales Corporation (DAMOSA) and Anflocor and one of the richest men in the country, became one of his staunchest ally and friend, and soon further gained his trust and friendship. Don Florendo could not forget Fernandez' quip when he once told him that he is quite good in what he is doing and Fernandez answered him, \"I should be, I worked hard to get to where I am now.\" The former said, Fernandez' remark was uttered without afterthought just as if it was just that, a certainty, so sure of himself. Florendo further related that is how Fernandez instills confidence to people who hears and listen to him: by the firmness of his voice when he talks and that, is a gift of gab. Having gained recognition in the labor movement, he was frequently invited into Davao City’s important occasions and gained the friendship as well as enmity of local politicians, broadcasters and prominent clans because of his often frank and fearless comments against the Marcos dictatorship and the local political scenery. It was during these gatherings that he befriended the country’s future Speaker of the House, Prospero Nograles, Davao City's former Mayor and the Department of the Interior and Local Government (DILG) Secretary of the Philippines' 11th President Corazon Aquino’s cabinet, Mayor Luis T. Santos and Ernesto Macasaet, Davao City’s Chief of Police, who eventually became a good friend of his. Maintaining his empathy towards the workingmen he had sworn to serve, he was known to offer generous help to them keeping his home constantly open whenever they come to him for food and provide whatever assistance he could give. Due to Fernandez’ open criticisms against the Marcos' dictatorship and his close association with Davao City's local Liberal Party Chapter, his house and residence in Talomo, Davao City was raided by the Military and searched the next day after Marcos declared Martial Law in 1972, with an alleged tip that he was hiding an arsenal of guns. A wildfire of rumors spread in Davao City that he was going to be arrested for illegal possession of firearms or for any other drummed up charges. But, Fernandez using his knack in diplomacy defused the tension that arose at that time and the Military left his residence finding nothing and left him alone to carry on with his labor pursuits.\n\nIn 1973, Fernandez wrote an original oratory, “The Role of the Youth in the New Society” which was delivered by his second son Rodolfo, Jr., and won second place in the Philippines’ National Oratorical Contest for all Naval ROTC on October 20, 1973 held at the Philippine Navy Headquarters in Manila. The brilliant piece is still kept in the archives of the Philippine Women's University, Manila to this day.\n\nOver the next few years despite Fernandez being a very vocal opponent and his oppositionist leaning, the government supported collective bargaining, and the regulation of the minimum wages and strikes were still allowed although constrained. (QUOTE) DPGTWU flourished and spread and he soon made frequent trips to Manila in order to exchange ideas and ideologies among his fellow labor leaders in the Philippine’s capital city, among them Senator Blas F. Ople, the Secretary of Labor during that time, Democrito T. Mendoza, National President of TUCP-KMP, Ernesto Herrera, Secretary-General of TUCP-KMP, who would soon become a senator in the country, the activist Luis Taruc and Eulogio R. Lerum, Sr., Chief Legal Counsel of TUCP-KMP. The Trade Union Congress of the Philippines (TUCP) was soon organized. It became the labor center to represent labor in the tripartite system of labor relations in the country under the period of labor repression. Fernandez helped organized and established the Trade Union Congress of the Philippines (TUCP/KMP) and aided, wrote and improved its constitution and by-laws. Fernandez was elected as one of TUCP’s Vice Presidents and was chosen to represent the country as a Labor Observer in Europe in 1976 which was sponsored by the International Labour Organization (ILO). Fernandez, together with his fellow Asian Labor Representatives, visited Yugoslavia and ILO’s main offices in Geneva, Switzerland. Back in the Philippines, despite being swamped with labor work, Fernandez, a Roman Catholic and a known devotee of the Santo Niño de Cebú (Holy Child of Cebu), never fails to visit the Basilica where it is ensconced. This has been one of Fernandez' generally recognized proclivities and a quirk which he had developed during his later years, wherein he never goes to church in any other place nor province except in the Basilica del Sto. Nino located in Cebu City.\n\nIn April 1978, Fernandez ran as a sectoral assemblyman for the Industrial Labor Sector, Mindanao Region in the Interim Batasang Pambansa (IBP)’s Philippine parliamentary elections and was a favorite among all the provincial governors of Mindanao to win. He eventually lost to Princess Porti Pacasum of Lanao, Philippines, the daughter of one of its biggest transport companies despite being the favored candidate to win. Fernandez a defeated man became literally old overnight. He was so sure of winning due to the strong support of 90% of the Mindanao governors spearheaded by Gov. Nonito D. Llanos, Sr., then governor of Davao del Sur and their electoral representatives. He suspected that the win was due to vote-buying, a common political strategy in the Philippines’ political setting. Fernandez then decided to file an electoral protest to the Commission on Elections and was quite confident that it will result in his favor. The evening before he was about to file the protest, the then First Lady Imelda Marcos, visited Fernandez who was accompanied by his daughter Faith in Manila, and swayed him not to go through with the protest because it might get the ire of the Muslim population in Mindanao. Since Mindanao is predominantly Muslim, she said it would be best that a Muslim should win. Fernandez suspected that Imelda Marcos wanted Pacasum to win, because Mrs. Marcos was active in the Mindanao Peace efforts at that time and it would look good in her peace efforts. Knowing that the Marcos government is behind Pacasum and realizing their influence, Fernandez didn’t continue filing the election protest and headed back to Davao City a disillusioned man.\n\nIt was during this period in his life that his heart illness became worst. After the IBP elections, Fernandez continued with his unrelenting labor efforts and DPGTWU remained highly regarded and robust. He nonetheless went to another observation trip to the US representing TUCP/KMP in October 1978 upon the sponsorship of the Asian American Free Labor Institute (AAFLI) and toured 14 cities some of which were, Washington, D.C., New York City, and Chicago. The observation trip was cut short when he suffered a pulmonary heart attack in Chicago and was soon flown back to the Philippines by TUCP/KMP after being hospitalized for a brief period there. Meanwhile, during his term as president of DPGTWU, he was also elected as the President of the local Rotary International's District 3860 Toril, Davao City (then a municipality of Davao) in 1977. He further ran for the local Barangay elections in Talomo District, Davao City as Barangay Captain but then lost the seat to a local moneyed favorite.\n\nDeath and legacy\n\nFernandez, with his health in decline and defiant of his doctors' wishes continued with his labor efforts and was still active in DPGTWU and TUCP/KMP in late 1978 and early 1979. He felt he was invincible and he never believed that death would overcome him. During a stop-over to Cebu City, in one of his frequent trips and visiting one of his daughters studying in Cebu, he suffered a severe stroke upon disembarking from a plane in Mactan-Cebu International Airport’s tarmac. He was rushed to the nearest Perpetual Succour Hospital and was pronounced dead on arrival (DOA) on June 9, 1979 at 10:00 in the morning. A wake was held in Cebu for most of his relatives there and his body was flown to Davao City to be with his family and children. Buried at the Davao Memorial Park, his burial was attended by Davao’s prominent citizens, some of TUCP-KMP’s officers and his fellow workingmen. He used to say in one of his frequent monologues that he had always wanted to die in his hometown and he got his wish when he died in Cebu City. He left behind 13 children and two wives and a legacy of strength, integrity and wisdom within the Philippine’s labor movement, his family & friends, and his compatriots."}, {"url": "https://teamster.org/2021/02/civil-rights-and-the-labor-movement-a-historical-overview/", "page_content": "Eric Arnesen\n\nThe George Washington University\n\nAnyone familiar with the labor movement today knows that organized labor is a heterogeneous group – African Americans, Latinos, Asians and Asian Americans, whites, men and women, citizens and undocumented workers all make up the ranks of the unions affiliated with Change to Win and the AFL-CIO. There is no question that the American labor force is characterized by unprecedented diversity – and, not surprisingly, organized labor is as well. In recent years, the labor movement has come to embrace and, to an unprecedented degree, champion racial and gender equality, often putting it at the forefront of movements for equality and civil rights in the United States. And that connection – labor and civil rights – has deep historical roots.\n\nTake one of the key moments in the emergence of the modern civil rights movement: The Montgomery Bus Boycott of 1955-56. The standard story features a tired seamstress, Rosa Parks, whose courageous refusal to give up her seat on a segregated public bus launched a boycott and a movement. That narrative also features a young Martin Luther King, Jr., a then-obscure young minister whose political career on the national and international stage was launched by his leadership of the boycott. But the boycott’s origins lay elsewhere, in part with a trade unionist, E.D. Nixon, a local civil rights activist who was a member of the Brotherhood of Sleeping Car Porters. It was Nixon who approached the newcomer King to lead the Montgomery Improvement Association; trade unionists in the North offered substantial financial and logistical support to the boycott; and, from the perspective of the Pullman Porters, the boycott was theirstory which they covered in detail in the pages of the Black Worker, the porters’ monthly journal.\n\nThink back almost half a century to 1963 when a quarter of a million people gathered on the National Mall before the Lincoln Memorial in the great March on Washington. Present that day were tens of thousands of trade unionists, whose numbers, funding, logistical assistance, and moral support helped make this an historic success. The initial organizers of the march were the civil rights and labor legend, A. Philip Randolph, and his assistant, Bayard Rustin. Randolph was at the time the most important black trade unionist in the nation, a man considered to be the “dean” of the civil rights movement; Rustin would go on to work with the AFL-CIO for years to come. And the purpose of the march? That was captured in its slogan: Jobs and Freedom. This demonstration was not simply about civil rights broadly construed, particularly the abolition of segregation across the land. It also had an economic dimension, and the “jobs” demand rested on an understanding that all American workers, black and white, needed access to employment, something, organizers argued, that the government was responsible for ensuring.\n\nAlso think back to the 1968 sanitation strike in Memphis, Tennessee. In that very southern city, the revolution brought about by the civil rights movement may have won a modicum of desegregation and voting rights, but it left untouched a racial division of labor that rested upon black subordination and exploitation. And, in that fateful year, sanitation workers affiliated with American Federation of State, County, and Municipal Employees (AFSCME), went out on strike against a city that forced them to work without dignity, decent wages, or representation. The strike proved controversial in Memphis but attracted the support of trade unionists around the country, as well as the support of the Reverend Martin Luther King, Jr., who was assassinated while in town on the strikers’ behalf. At that moment, the labor movement was a civil rights movement, the sanitation workers’ union a vehicle not merely for wages and better working conditions but for civil and human rights as well. In subsequent years, the labor movement slowly but decisively committed itself to civil rights. That’s not to say there wasn’t controversy or a difference of opinion about how, precisely, to achieve those rights. But at a time – the 1980s and 1990s – when currents in American politics were running against the civil rights tide, the labor movement was putting itself squarely in the camp of racial equality.\n\nThis wasn’t always the case. As late as the 1940s, the African-American scholar Rayford Logan simply and directly declared: the “‘solidarity of labor’ is [just] another myth as far as the history of American labor is concerned.” Discriminatory white unions, particularly in the American Federation of Labor (AFL), were ubiquitous in pre-World War II America. In Logan’s eyes, they deserved the same epithet that they directed at Big Business: they were merely “soulless corporations.”[1] The overall record of white unions was not impressive: From Reconstruction to, in some instances, the 1950s and 1960s, numerous unions worked to exclude blacks from key sectors of the labor market or otherwise restrict them to the least desirable jobs. And that sorry record accounted for blacks’ traditional antipathy toward organized labor.\n\nThe era in which many trade unions excluded or discriminated against black and other minority workers came to be known as the “nadir” for African Americans, in Rayford Logan’s term for the late 19th century. Many of the gains made during Reconstruction had been rolled back or wiped out: Disfranchisement stripped black men of the vote in many southern states; Jim Crow laws mandated the legal segregation of the races; and white violence – terrorism, actually – against African Americans intensified.\n\nFor the century after the Civil War, sharp and enduring barriers restricted the employment opportunities of racial minorities in the United States. In the aftermath of slavery, discrimination in employment on the basis of race was widespread and a sharp racial division of labor divided the American labor force. “In the half century that the negro [sic] has had the franchise as the crowning of his freedom,” one New Jersey newspaper concluded in 1920, “he has, by and large, been relegated to the role of a hewer of wood and a drawer of water. . . Theoretically free, the negro has not been able to sell his labor” – except for a few exceptions – “where most he wanted to.”[2] The white Progressive-era journalist Ray Stannard Baker turned his attention to the “color line” in the early 20th century. “As I traveled in the North,” he reported, “I heard many stories of the difficulties which the coloured man had to meet in getting employment. Of course, as a Negro said to me, ‘there are always places for the coloured man at the bottom.’ He can always get work at unskilled manual labour, or personal or domestic service – in other words, at menial employment.”[3]\n\nOutside of the agricultural sector, black labor was largely confined to unskilled work and domestic service. Conditions in rural, isolated lumber or turpentine camps were generally harsh; labor on the docks of the Gulf Coast or South Atlantic was arduous; coal mining deep in the earth in Alabama, West Virginia, Tennessee, and Kentucky was difficult and dangerous. “The fetters were no sooner removed from the limbs of the black slave than the fetters of condition took their place,” the New York Freeman observed somewhat hyperbolically in 1886. Today, “it is a painful and notorious fact that the last condition of the common laborers of the South is, in many respects, much more degrading and demoralizing than the first. . . . The colored people of the South are gradually, as a class, sinking deeper and deeper into the cesspool of industrial slavery.”[4]\n\nHow, precisely, were African Americans to respond to this state of affairs? How did they respond? Booker T. Washington, the conservative head of the Tuskegee Institute in Alabama, championed “industrial education,” hard work, and an avoidance of electoral politics; he lectured black workers to avoid unions, ally with white industrialists, and even break strikes to secure jobs otherwise closed to them. W.E.B. Du Bois emerged in the early 20th century as Washington’s chief opponent, a champion of classical education, civil rights, and political engagement on behalf of black Americans. By the World War I era, Marcus Garvey and his Universal Negro Improvement Association dismissed civil rights as hopeless and promoted a black nationalism centered on black business, pride, and an eventual return to Africa; he too opposed unions and promoted black capitalism. And Ida B. Wells along with the black clubwomen’s movement highlighted anti-lynching activism and racial uplift.\n\nThe late 19th and early 20th centuries also witnessed the emergence of a small but significant black labor tradition. Despite white labor’s racial practices and beliefs, a visible minority of black southerners found in unionization a means to pursue the same goals as white workers: raising wages, shortening the working day, and improving on-the-job conditions. Their efforts also reflected a quest for workplace dignity and a modicum of respect – or at least a lessening of brutal treatment – from white managers. Domestic workers in Atlanta, dock workers in Houston, Galveston, New Orleans, and other Gulf and South Atlantic ports, coal miners in Alabama, West Virginia, Kentucky, and Tennessee, timber workers in Louisiana and East Texas and lumber workers in North Carolina – all turned to unions between the 1870s and the 1950s to advance their interests in an economically inhospitable environment. Similarly, smaller groups of black workers – oyster shuckers, washerwomen, phosphate miners, railroad car cleaners and firemen, sugar harvesters, hod carriers, bricklayers, carpenters and joiners, and teamsters, to mention just a sample — organized their own locals. Some affiliated with the Knights of Labor, the AFL, or the Congress of Industrial Organizations (CIO), while others remained independent.[5] As two scholars recently put it, the “quest for economic justice defined some of the most challenging, imaginative—and underappreciated campaigns” engaged in by blacks to improve their “life conditions.” [6]And unions were one major vehicle in that quest for economic justice.\n\nSome unions welcomed them – or at least accepted them into their ranks. The Knights of Labor in the 1880s, the Industrial Workers of the World in the early 20th century, and the Congress of Industrial Organizations in the 1930s and 1940s all advanced a vision of a unified working-class, one whose divisions along lines of color, creed, political belief, and gender paled before the power of workers’ common interests. Even the American Federation of Labor, with its largely skilled, white craft unionist base, enlisted substantial numbers of black workers – at least in some trades.\n\nIf the black labor tradition represented an important current of black protest and workplace activism, its numbers and impact should not be exaggerated, at least in the decades before the late 1930s and 1940s. The vast majority of African American workers, north and south, remained outside of the industrial labor force and outside of the ranks of organized labor at least until the Great Depression and World War II years. Even the Great Migration of the World War I era, which brought as many as half a million African Americans to the North during the war and another 700,000 during the 1920s, did not fundamentally alter the relationship between the larger labor movement and African American workers. Although some black migrants joined unions during the war, most did not. And many white unions didn’t want them.\n\nYet black migration produced a new kind of black politics during and after the era of World War I. The newcomers did not discover a “Promised Land” in the North; rather, they encountered employment and housing discrimination and, at times, significant white violence. They did manage to gain access to some employment in the North’s mills and factories, jobs that had previously been closed to them, thus achieving a foothold in modern industry.\n\nBy the Great Depression of the 1930s, the migration and the increased black urbanization it fostered had significant consequences. Growing numbers of migrants in the North translated into new resources and new attitudes, laying a firm economic basis for an increasingly solid infrastructure of businesses, churches, and political organizations. More people meant more consumers for black owned businesses, black periodicals, and cultural institutions as well as expanding political influence and the emergence of a more aggressive style of black protest politics that placed civil rights squarely on the agenda of labor unions, municipalities, and the federal government. These changes did not happen overnight. By the 1920s and certainly by the Great Depression, new and visibly militant organizations were appearing. The Brotherhood of Sleeping Car Porters, founded in 1925, fostered a new openness to unionization in black communities and spearheaded a far more aggressive approach to protest, an approach that pushed the then somewhat more staid National Association for the Advancement of Colored People (NAACP) into a more confrontational stance. That was just the beginning. The 1930s witnessed the blossoming of Don’t Buy Where You Can’t Work campaigns designed to break down job barriers and the emergence of the National Negro Congress, a heterogeneous organization that supported unionization and community protest. These organizations pioneered militant styles of protest politics that involved considerable grassroots mobilization and confrontation with established authorities. During World War II, activists participated in various “Double V” campaigns – calling for a victory over fascism abroad, and a victory over racism at home.\n\nA vital part of this upsurge in black protest involved union organizing. The Brotherhood of Sleeping Car Porters (BSCP), formed in 1925 by Pullman Porters, was at the forefront of a tremendous shift in black public opinion toward a pro-union stance. For a decade, A. Philip Randolph and his colleagues in the BSCP fought an uphill battle against the powerful Pullman company which unleashed a barrage of hostile attacks against the fledgling union, relying upon spies and informants and harassing and firing known union activists. Yet the Brotherhood survived and eventually triumphed. Over the course of the late 1920s and early 1930s, the BSCP reached out to black community and religious leaders as well as to white liberals, continuously spreading the gospel of black trade unionism. When the BSCP launched its crusade for recognition in 1925, it confronted a black elite that was largely, if not entirely, indifferent or hostile to unions. In the late 1920s and early 1930s, Randolph cultivated NAACP officials, clergymen, and black women’s clubs. The result was an historic shift in opinion of the black middle class from anti- to pro-union.[7] In 1935, the BSCP prevailed, decisively winning a government-supervised union representation election.[8] Two years later, in 1937, it negotiated an unprecedented and path breaking contract with the Pullman company that constituted, in Randolph’s words, “a foundation on which the future of the porters’ well-being and a constructive and powerful Brotherhood” could be built.[9]\n\nThe porters’ victory, Randolph believed, would reverberate far beyond the ranks of Pullman employees. “It should serve as one great stimulant to the organization of Race workers in all industries throughout the country…. [T]he Race has the courage, the spirit and the will to fight for economic freedom and justice like all other workers.”[10]\n\nUnionism spread well beyond railroaders’ ranks. The AFL had large numbers of black workers in some international unions (the longshoremen, mine workers, and Teamsters in particular). And with the emergence in the mid-1930s of the CIO came a union federation committed to industrial unionization and the organization of black workers. In much of basic industry – automobile manufacturing, steel, rubber, meatpacking, and the like – the CIO succeeded, by the early 1940s, in winning union representation elections and attracting substantial black support. That’s not to say that discrimination vanished from organized labor’s ranks; it hadn’t. But it is hard to dispute this simple fact: One sector of the labor movement had dropped some of its exclusionary barriers and welcomed black participation, and African-Americans had responded accordingly, shifting decisively toward a pro-union stance. By 1943, some 400,000 African American workers had joined the labor movement.[11]\n\nPerhaps the most notable, and important, initiative of this new labor-based civil rights movement was the wartime March on Washington Movement, a brainchild of A. Philip Randolph that aimed at overturning segregation and exclusion in the armed forces and discrimination in defense industries. As military production picked up in 1940 and 1941, unemployment rates for white workers dropped noticeably. But African Americans were largely excluded from this economic recovery. Randolph called for 10,000 African Americans to descend upon Washington, D.C. in a “pilgrimage” to “wake up and shock official Washington as it has never been shocked before.”\n\n“If the Negro is shut out of these extensive and intensive changes in industry, labor and business” prompted by the war, he charged, “the race will be set back over fifty years.” “WE LOYAL NEGRO AMERICAN CITIZENS DEMAND THE RIGHT TO WORK AND FIGHT FOR OUR COUNTRY,” his MOWM declaration insisted.[12] The numbers of projected protesters kept increasing. First, 10,000. Then, 50,000. Finally, 100,000. Black journalists talked of a “mammoth mass demonstration” bringing together African Americans from “the voteless South and the jobless North, united in protest over a way of life which offers neither freedom nor opportunity”; they would “invade” the nation’s capital, that “fountain head of racial prejudice,” a city that “seethes with demoniac racialism.”[13] If African Americans could not stop discrimination outright, they could, nonetheless, one black periodical put it, “tear the mask of hypocrisy from America’s democracy.”[14]\n\nThe March on Washington Movement’s goal was to force the hand of the administration of Franklin Roosevelt. “I can’t afford to permit you to bring 100,000 Negroes to Washington,” the president informed Randolph, “because there is no way to manage a tremendous group . . . such as that. You can never tell what might happen, nor can I.” But administration efforts to have Randolph call off the march went nowhere. In the end, the president blinked first. FDR backed down. At the eleventh hour, President Roosevelt signed Executive Order 8802 and Randolph called off the march: There shall be “no discrimination in the employment of workers in defense industries or government because of race, creed, color, or national origins,” the order boldly declared. To ensure that the policy of non-discrimination by employers, labor unions, and the government was carried out, the order created a Fair Employment Practice Committee to collect information, investigate complaints, and take “appropriate steps to redress grievances.”[15] Although the serious matter of segregation in the armed forces remained unaddressed, Randolph declared the order the “greatest thing for Negroes since the [E]mancipation [P]roclamation.” The fight against discrimination, he claimed, “will help to cleanse the soul of America of the poison of hatred, antagonism, and hostilities of race, color and national origin, and strengthen our country’s foundation for national unity and national defense.” [16]\n\nThe Executive Order was no Emancipation Proclamation. The FEPC did not eliminate discrimination in American industry and Randolph knew it. The agency possessed few resources and little power to compel compliance with the Executive Order. Black grassroots activists rallied behind the beleaguered federal agency with conferences, pickets, marches, and mass demonstrations in churches, auditoriums, parks, union halls, and streets around the nation during the war.[17]\n\nOn one level, these activists failed. The FEPC did not survive the war, for its congressional opponents simply cut off its funding. Randolph’s new National Council for a Permanent FEPC held rallies and marches and lobbied Congress, but did not accomplish its goal of extending the FEPC’s life. Although individual states passed weak fair employment acts, the federal government did not.[18]\n\nOn another level, however, these activists succeeded – if we take a longer view. They managed to place the issue of employment discrimination squarely on the political agenda, where it would remain for the next two decades and beyond. Fair employment, for the first time, became a rallying cry, a program around which African Americans and whites – civil rights organizations, trade unions, and federations of Christians and Jews — could and would organize for years to come. Eventually, they prevailed. The passage of the 1964 Civil Rights Act, particularly its Title VII, finally outlawed discrimination in American workplaces and in union ranks.\n\nBefore and after the passage of the 1964 Act, African-American trade unionists challenged the House of Labor to live up to its creed. Both the AFL and CIO tolerated a wide range of racial policies among its constituent unions. While some unions accepted black members and accorded them a degree of respect and equality, others did not. Again and again, Randolph and other black union activists called upon organized labor to ban discrimination outright in its ranks, end all racial restrictions on union membership, and abolish inferior, segregated “auxiliary” unions. The AFL “cannot say it is democratic unless it cleans its house and says that, regardless of race, color and creed, any worker can join any A F of L union,” the president of the BSCP charged in 1942.[19] As black disaffection with the AFL-CIO grew and the struggle for civil rights expanded across the South, the federation finally adopted a civil rights program at its 1961 convention that broke, somewhat, with past practice.[20]\n\nBy the early 1960s, many union internationals offered crucial support – moral, financial, and organizational – to the push for civil rights legislation. Tens of thousands of those present at the 1963 March on Washington were trade unionists. That demonstration for “Jobs and Freedom” raised fundamental economic issues, calling not only for desegregation but for passage of a federal fair employment practices act, a higher minimum wage, and a serious public works program. Randolph and other union activists maintained that equality for African Americans required both civil and economic rights, that progress for black Americans required not only the passage and enforcement of civil rights and anti-discrimination laws but economic policies designed to ensure the economic health of black Americans.\n\nThe history of the civil rights movement – perhaps the word movements is more appropriate – is a rich, long, and complicated one. That history cannot be reduced to simply its modern phase; nor should it be reduced to its most famous figure, Dr. Martin Luther King, Jr. The history of the labor movement is a rich, long, and complicated one as well. The labor movement, once an obstacle to black economic advancement, is now an ally of the civil rights movement. Black workers – and other minority workers – refused to accept the labor movement’s racial bars. In fact, the labor movement was never the sole property of white workers. In countless instances African Americans turned to unionization for their own purposes to pursue both an economic agenda and a civil rights agenda. And, in so doing, they transformed both the labor movement and the civil rights movement. It is not much of an exaggeration to conclude that, in the process, they helped change a nation as well.\n\n[1] Rayford Logan, “The Negro Wants First-Class Citizenship,” in Rayford W. Logan, ed., What the Negro Wants (Chapel Hill: University of North Carolina Press, 1944), 12.\n\n[2] “Labor and the Color Line,” Newark Evening News, May 14, 1920, in Tuskegee Institute News Clipping File, Reel 11, Frame 0728.\n\n[3] Ray Stannard Baker, Following the Color Line: An Account of Negro Citizenship in the American Democracy (New York: Doubleday, Page, 1908), 131.\n\n[4] “Industrial Slavery in the South,” New York Freeman, December 25, 1886; also see “Colored Men, Reflect,” New York Freeman, December 4, 1886, reprinted from John Swinton’s Paper.\n\n[5] On traditions of black unionization, see: Eric Arnesen, “Following the Color Line of Labor: Black Workers and the Labor Movement before 1930,” Radical History Review No. 55 (Winter 1993): 53-87; Tera W. Hunter, To ‘Joy My Freedom: Southern Black Women’s Lives and Labors After the Civil War (Cambridge: Harvard University Press, 1997). For a sample of the literature that addresses black unionization in the South, see: William P. Jones, The Tribe of Black Ulysses: African American Lumber Workers in the Jim Crow South (Urbana: University of Illinois Press, 2005); Peter J. Rachleff, Black Labor in Richmond 1865-1890(1984; Urbana: University of Illinois Press, 1988). Classic works that retain considerable value include: Classic works on the subject include: Charles H. Wesley, Negro Labor in the United States 1850-1925: A Study in American Economic History (New York: Vanguard Press, 1927); Sterling D. Spero and Abram L. Harris, The Black Worker: The Negro and the Labor Movement (1931; rpt. New York: Atheneum, 1969); Horace R. Cayton and George S. Mitchell, Black Workers and the New Unions (Chapel Hill: University of North Carolina Press, 1939).\n\n[6] Charles M Payne and Adam Green, “Introduction,” in Payne and Green, eds., Time Longer Than Rope: A Century of African American Activism, 1850-1950 (New York: New York University Press, 2003), 2-3.\n\n[7] Beth Tompkins Bates, Pullman Porters and the Rise of Protest Politics in Black America, 1925–1945 (Chapel Hill: University of North Carolina Press, 2001), 81-86.\n\n[8] T. Arnold Hill, “Labor: The Pullman Porter—The Big Boss,” Opportunity XIII, No. 6 (June 1935), 186; The Crisis (August 1935), 241; New York Age, July 6, 1935.\n\n[9] A. Philip Randolph, “Brotherhood and Pullman Company Sign Agreement,” The Black Worker III, No. 7 (October 1937): 1.\n\n[10] Minneapolis Spokesman, July 5, 1935.\n\n[11] Oklahoma Black Dispatch, March 25, 1937.\n\n[12] “A. Philip Randolph,” Chicago Defender, February 1, 1941.\n\n[13] “100,000 to March to Capital,” New York Amsterdam Star News, May 31, 1941; “March on Washington,” Michigan Chronicle, June 28, 1941.\n\n[14] Jervis Anderson, A. Philip Randolph: A Biographical Portrait (1972; rpt. Berkeley: University of California Press, 1986), 248-49; Michigan Chronicle, June 28, 1941; Northwest Enterprise, March 21, 1941.\n\n[15] Anderson, A. Philip Randolph, 259.\n\n[16] “March on Washington is Postponed,” Minneapolis Spokesman, July 4, 1941; “Randolph Halts March on Washington,” Northwest Enterprise, July 11, 1941.\n\n[17] Eric Arnesen, Brotherhoods of Color: Black Railroad Workers and the Struggle for Equality (Harvard University Press, 2001), 181-202.\n\n[18] A. Philip Randolph, “We Need a New FEPC,” The New Leader, July 9, 1951, 12-13.\n\n[19] Baltimore Afro-American, October 24, 1942; October 23, 1943; Michigan Chronicle, December 9, 1944.\n\n[20] Black Worker (December 1961): 4-5."}, {"url": "https://www.britannica.com/biography/Ruby-Bridges", "page_content": "Photographs of her going to school inspired Norman Rockwell to paint The Problem We All Live With. Bridges wrote a memoir, Through My Eyes, and a children’s book, Ruby Bridges Goes to School. Her story was told in a TV movie, Ruby Bridges.\n\nFor the first year, she was escorted by marshals and was taught by a single teacher, while white parents pulled their children from the school and shouted threats and insults. She went to school every single day, and by the next year more black students and white students began attending together.\n\nAt the age of six she was the youngest of a group of African American students sent to all-white schools in order to integrate schools in the American South in response to a court order. She was the only black student to attend William Frantz Elementary School in New Orleans in 1960.\n\nRuby Bridges worked as a travel agent before becoming a stay-at-home mother. In 1993 she began working as parent liaison at the grade school she had attended, and in 1999 she formed the Ruby Bridges Foundation to promote tolerance and unity.\n\nRuby Bridges, in full Ruby Nell Bridges, married name Ruby Bridges-Hall, (born September 8, 1954, Tylertown, Mississippi, U.S.), American activist who became a symbol of the civil rights movement and who was, at age six, the youngest of a group of African American students to integrate schools in the American South.\n\nBridges was the eldest of eight children, born into poverty in the state of Mississippi. When she was four years old, her family moved to New Orleans. Two years later a test was given to the city’s African American schoolchildren to determine which students could enter all-white schools. Bridges passed the test and was selected for enrollment at the city’s William Frantz Elementary School. Her father was initially opposed to her attending an all-white school, but Bridges’s mother convinced him to let Bridges enroll.\n\nBritannica Quiz Pop Quiz: 17 Things to Know About the American Civil Rights Movement\n\nOf the six African American students designated to integrate the school, Bridges was the only one to enroll. On November 14, 1960, her first day, she was escorted to school by four federal marshals. Bridges spent the entire day in the principal’s office as irate parents marched into the school to remove their children. On Bridges’s second day, Barbara Henry, a young teacher from Boston, began to teach her. The two worked together in an otherwise vacant classroom for an entire year. Every day as the marshals escorted Bridges to school, they urged her to keep her eyes forward so that—though she could hear the insults and threats of the angry crowd— she would not have to see the racist remarks scrawled across signs or the livid faces of the protesters. Bridges’s main confidants during this period were her teacher and Robert Coles, a renowned child psychologist who studied the reaction of young children toward extreme stress or crisis. Toward the end of the year, the crowds began to thin, and by the following year the school had enrolled several more Black students.\n\nBridges’s bravery inspired the Norman Rockwell painting The Problem We All Live With (1963), which depicts the young Bridges walking to school between two sets of marshals, a racial epithet marking the wall behind them. Her story was also recounted in Coles’s children’s book The Story of Ruby Bridges (1995), which has his conversations with her as its foundation. In 1993 she began working as a parent liaison at Frantz, which had by that time become an all-Black school. Bridges also spoke about her youthful experiences to a variety of groups around the country. Her memoir, Through My Eyes, was released in 1999, the same year that she established the Ruby Bridges Foundation, which used educational initiatives to promote tolerance and unity among schoolchildren. In 2009 she published the children’s book Ruby Bridges Goes to School: My True Story."}, {"url": "https://prologue.blogs.archives.gov/2021/09/23/el-movimiento-the-chicano-movement-and-hispanic-identity-in-the-united-states/", "page_content": "It’s National Hispanic Heritage Month. Visit the National Archives website for resources on related records and how we are commemorating the month. Today’s post comes from Thomas Richardson, an archives technician at the National Personnel Records Center in St. Louis, Missouri.\n\nSocial, economic, cultural, and political change was widespread in the 1960s, fueled by evolving norms, breaking traditions, and protesting inequality at all levels of society. A host of grassroots movements and organizations formed in the U.S. during these years with varying missions: racial equality and desegregation, labor rights, gender equality, anti-war, and political inequality.\n\nThe Hispanic community embarked on a social movement aimed at combating institutional racism, increasing cultural hegemony, and guaranteeing equal labor and political rights. The Chicano Movement sparked national conversations on the political and social autonomy of Hispanic groups everywhere in the United States. Similar to many civil rights and revolutionary movements in the 1960s, they also experienced heavy state surveillance and police brutality. They also produced nationally recognized personalities who came to symbolize the movement such as Cesar Chavez, Dolores Huerta, and Rosalio Munoz.\n\nThe post–World War II years saw a significant rise in political and social activism in the Hispanic community, particularly on the West Coast. Rights for farm workers and education were the primary focus due to severe discrimination that Hispanic laborers faced daily. Hispanic children faced many of the similar prejudices as Black children with segregated schools. A pair of landmark legal cases were major boosts to the Hispanic community.\n\nIn 1947, a pivotal federal court case, Mendez v. Westminster, struck down segregation between White and Mexican schools in California. This decision had widespread repercussions as it was cited in the famous Brown v. Board of Education case. Seven years later in 1954, in Hernandez v. Texas, the U.S. Supreme Court ruled that Mexican American and all other nationality groups were guaranteed equal protection according to the 14th Amendment. The justices ruled unanimously in favor of Hernandez by claiming he had been discriminated against by investigating the racial segregation that existed against Mexicans.\n\nThe Chicano Movement had several components that sought to increase Hispanic equality. Led by Cesar Chavez, one of the most famous goals was the unionization of farmworkers. In 1962, with Dolores Huerta, Chavez co-founded the National Farm Workers Association, which later reorganized to become the United Farm Workers labor union. Chavez, Huerta, and other civic leaders made enormous progress in collectivizing farm laborers and helping them register to vote. In 1965, Chaves and Huerta organized the Delano grape strike; the longest strike in U.S. history, lasting from September 1965 to July 1970.\n\nCivil rights was a hallmark of the Chicano Movement with the goal of empowering the Hispanic community to take part in civil discourse. In the early 1950s and 60s, the Community Service Organization (CSO) was created and helped to register thousands of Mexican-Americans and drive them to polling places on election days. The CSO was absolutely pivotal for the Chicano Movement as it provided civic education and organizing methods for individuals like Huerta and Chavez.\n\nUFW pickets the Jewel Food Store, August 1973. (National Archives Identifier 551939)\n\nPolitical participation made the Hispanic community a powerful voting bloc in national elections in the coming years as a result of the work by the CSO and its leaders. Organization among Hispanic students was also widespread among the Chicano Movement. College student groups like the Mexican American Youth Organization (MAYO) and United Mexican American Students (UMAS) formed to combat institutional racism and discrimination at campuses. Voter registration, educational equality, and labor rights were the focus of student organizations like these.\n\nIn early March 1968, the greatest demonstration against education inequality took place in East Los Angeles as thousands of students walked out to protest discrepancies in the district. Over 10,000 students left to protest and formed the Educational Issues Coordinating Committee (EICC). Demands to the Los Angeles Board of Education included recommendations for bilingual education and hiring of Mexican American administrators. This mass demonstration against Hispanic racism sparked a national conversation on race relations in California, but it also labeled Chicano leaders as radical and militant according to FBI internal memos by J. Edgar Hoover.\n\nFreddie Resendez rallies students at Lincoln High School, 1968 East LA Chicano Walk Outs. (Los Angeles Times)\n\nAs the 1960s progressed and the war in Vietnam intensified, broad anti-war sentiment grew in Hispanic communities. A disproportionate number of Latino draftees were sent overseas, and many were opposed to the conduct of the war. In November 1969, the Chicano Moratorium was formed with the purpose of building a broad anti-war coalition and protesting the draft. Notable activists like Rosalio Munoz publicly avoided the draft, and organizations like the Brown Berets drew inspiration from the Black Panthers in demonstrating against the war.\n\nProtests were held all over the American Southwest, and on August 29, 1970, the largest moratorium occurred in Los Angeles. Over 30,000 protesters led by activist Rosalio Munoz turned out to demonstrate against the Vietnam War, but it quickly became violent. Local police tried to break up the gathering, and when gunshots were fired, fights broke out, leaving four people dead and dozens more injured. Notable LA Times journalist and civil rights activist Ruben Salazar was killed during the Moratorium when a tear gas canister hit him. (See more: Class Litigation Case Files, the 1970 murder of Chicano journalist Ruben Salazar, file 144-12C-245, NAID 603432)\n\nUnbeknownst to many in the Chicano Movement, the federal government surveilled members and leaders of Hispanic groups. They were monitored for potential terrorist activities and, in some cases, acted as agent provocateurs undermining the movement’s cause. The controversial FBI program COINTELPRO heavily infiltrated Chicano groups, along with other political organizations such as Black Power, American Indian Movement, and numerous feminist and animal rights groups. Munoz was one of those who was forcibly removed by undercover agents in 1970 but later returned to run the Moratorium.\n\nDolores Huerta and Jill Biden at an Department of Labor event featuring the renaming of the Department’s auditorium as the Cesar Chavez Memorial Auditorium, 3/26/2012. (National Archives Identifier 55127151)\n\nThe legacy of El Movimiento has empowered many in the Hispanic community to become civically active and take part in national conversations. The Mexican American Legal Defense and Education Fund protects civils through nonprofit legal work and the United Farm Workers Union actively engages in reforming labor rights in agriculture. Civil rights leaders and activists from years before laid the groundwork for the collective Hispanic identity today and empowered millions of Hispanic peoples to exercise their rights.\n\nFor more information on the COINTELPRO activities, visit the Record Group 65 (Records of the Federal Bureau of Investigation) under Classification 157; Extremist Matters, Civil Unrest."}, {"url": "https://www.womenshistory.org/education-resources/biographies/dolores-huerta", "page_content": "Co-founder of the United Farm Workers Association, Dolores Clara Fernandez Huerta is one of the most influential labor activists of the 20th century and a leader of the Chicano civil rights movement.\n\nBorn on April 10, 1930 in Dawson, New Mexico, Huerta was the second of three children of Alicia and Juan Fernandez, a farm worker and miner who became a state legislator in 1938. Her parents divorced when Huerta was three years old, and her mother moved to Stockton, California with her children. Huerta’s grandfather helped raise Huerta and her two brothers while her mother juggled jobs as a waitress and cannery worker until she could buy a small hotel and restaurant. Alicia’s community activism and compassionate treatment of workers greatly influenced her daughter.\n\nDiscrimination also helped shape Huerta. A schoolteacher, prejudiced against Hispanics, accused Huerta of cheating because her papers were too well-written. In 1945 at the end of World War II, white men brutally beat her brother for wearing a Zoot-Suit, a popular Latino fashion.\n\nHuerta received an associate teaching degree from the University of the Pacific’s Delta College. She married Ralph Head while a student and had two daughters, though the couple soon divorced. She subsequently married fellow activist Ventura Huerta with whom she had five children, though that marriage also did not last. Huerta briefly taught school in the 1950s, but seeing so many hungry farm children coming to school, she thought she could do more to help them by organizing farmers and farm workers.\n\nIn 1955 Huerta began her career as an activist when she co-founded the Stockton chapter of the Community Service Organization (CSO), which led voter registration drives and fought for economic improvements for Hispanics. She also founded the Agricultural Workers Association. Through a CSO associate, Huerta met activist César Chávez, with whom she shared an interest in organizing farm workers. In 1962, Huerta and Chávez founded the National Farm Workers Association (NFWA), the predecessor of the United Farm Workers’ Union (UFW), which formed three year later. Huerta served as UFW vice president until 1999.\n\nDespite ethnic and gender bias, Huerta helped organize the 1965 Delano strike of 5,000 grape workers and was the lead negotiator in the workers’ contract that followed. Throughout her work with the UFW, Huerta organized workers, negotiated contracts, advocated for safer working conditions including the elimination of harmful pesticides. She also fought for unemployment and healthcare benefits for agricultural workers. Huerta was the driving force behind the nationwide table grape boycotts in the late 1960s that led to a successful union contract by 1970.\n\nIn 1973, Huerta led another consumer boycott of grapes that resulted in the ground-breaking California Agricultural Labor Relations Act of 1975, which allowed farm workers to form unions and bargain for better wages and conditions. Throughout the 1970s and ‘80s, Huerta worked as a lobbyist to improve workers’ legislative representation. During the 1990s and 2000s, she worked to elect more Latinos and women to political office and has championed women’s issues.\n\nThe recipient of many honors, Huerta received the Eleanor Roosevelt Human Rights Award in 1998 and the Presidential Medal of Freedom in 2012. As of 2015, she was a board member of the Feminist Majority Foundation, the Secretary-Treasurer Emeritus of the United Farm Workers of America, and the President of the Dolores Huerta Foundation."}, {"url": "https://www.biography.com/activists/dolores-huerta", "page_content": "(1930-)\n\nWho Is Dolores Huerta?\n\nActivist and labor leader Dolores Huerta has worked to improve social and economic conditions for farm workers and to fight discrimination. To further her cause, she created the Agricultural Workers Association (AWA) in 1960 and co-founded what would become the United Farm Workers (UFW). Huerta stepped down from the UFW in 1999, but she continues her efforts to improve the lives of workers, immigrants and women.\n\nEarly Life\n\nDolores Huerta was born Dolores Fernández on April 10, 1930, in Dawson, New Mexico, the second child of Juan and Alicia (Chavez) Fernandez. The young family struggled, and by the time Dolores was 3, her parents divorced and her mother moved Dolores and her two brothers to Stockton, California. Dolores maintained a relationship with her father, who later became a union activist and a New Mexico state legislator. Juan’s own political and labor activism later proved inspirational to Dolores.\n\nWhen the family first arrived in Stockton, a farming community in the San Joaquin Valley, Alicia worked two jobs to provide for the family. Dolores’s grandfather, Herculano Chavez, took care of the children, serving as the children’s adult male figure. Dolores admired her mother, who always encouraged her children to get involved in youth activities and become something. Alicia worked hard to provide music lessons and extracurricular activities for her children, with Dolores taking violin, piano and dance lessons. A good student, she was also a Girl Scout up until she turned 18, and she won second place in a national essay contest.\n\nDespite her achievements, Dolores experienced the racism many Mexicans and Mexican Americans suffered from, especially those who were farm workers. At school, she was sometimes treated with suspicion and scorn. She was once accused by a teacher of stealing another student’s work because the teacher was convinced that Dolores was incapable of doing it own her own, due to her ethnic origin.\n\nWith time, her family’s economic conditions improved. During World War II, Alicia ran a restaurant and then purchased a hotel in Stockton with her second husband, James Richards. The businesses served the farm workers and day laborers, offering affordable rates and welcoming the diversity of the area.\n\nAfter graduating from Stockton High School, in 1947, Dolores went through a marriage, the birth to two children and a divorce. After a series of unsatisfying jobs, she returned to school and eventually completed a teaching degree at Stockton College, part of the University of the Pacific. She briefly worked as an elementary school teacher but resigned because she was so distraught over the poor living conditions of her students, many of them children of farm workers.\n\nDetermined to help, in 1955, she and Fred Ross started the Stockton chapter of the Community Services Organization (CSO), a grassroots group that worked to end segregation, discrimination and police brutality and improve social and economic conditions of farm workers. During this time, Dolores married Ventura Huerta, another labor activist. The couple would go on to have five children.\n\nA Life of Activism\n\nIn 1960, Huerta started the Agricultural Workers Association (AWA). She set up voter registration drives and lobbied politicians to allow non–U.S. citizen migrant workers to receive public assistance and pensions and provide Spanish-language voting ballots and driver's tests. During this time, Dolores met Cesar Chavez, a fellow CSO official, who had become its director.\n\nIn 1962, both Huerta and Chavez lobbied to have the CSO expand its efforts to help farm workers, but the organization was focused on urban issues and couldn’t move in that direction. Frustrated, they both left the organization and, with Gilbert Padilla, co-founded the National Farm Workers Association (NFWA). The two made a great team. Chavez was the dynamic leader and speaker; and Huerta the skilled organizer and tough negotiator.\n\nIn 1965, the AWA and the NFWA combined to become the United Farm Workers Organizing Committee (later, simply the United Farm Workers). That year, the union took on the Coachella Valley grape growers, with Chavez organizing a strike of all farm workers and Huerta negotiating contracts.\n\nAfter five hard years, the United Farm Workers (now affiliated with the American Federation of Labor and Congress of Industrial Organizations) signed an historic agreement with 26 grape growers that improved working conditions for farm workers, including reducing the use of harmful pesticides and initiating unemployment and healthcare benefits. Around this time, she was credited with coining the phrase \"sí se puede,\" or \"yes we can,\" as a means of spurring union members onward through tough times.\n\nIn the 1970s, Huerta coordinated a national lettuce boycott and helped create the political climate for the passage of the 1975 Agricultural Labor Relations Act, the first law to recognize the rights of farm workers to bargain collectively.\n\nDuring the 1980s, Huerta served as vice president of the UFW and co-founded the UFW’s radio station. She continued to speak for a variety of causes, advocating for comprehensive immigration policy and better health conditions for farm workers. In 1988, she nearly lost her life when she was beaten by San Francisco police at a rally protesting the policies of then-presidential candidate George H. W. Bush. She suffered six broken ribs and a ruptured spleen.\n\nLater Life\n\nHuerta has been honored for her work as a fierce advocate for farm workers, immigration and women. She received the Ellis Island Medal of Freedom Award and was inducted in the National Women’s Hall of Fame in 1993. That year proved bittersweet for her as she also experienced the passing of her beloved friend Cesar Chavez.\n\nIn 1998, she received the Eleanor Roosevelt Award, a year before she stepped down from her position at the United Farm Workers. In 2002, she received the Puffin/Nation Prize for Creative Citizenship. The $100,000 award provided her the means to create the Dolores Huerta Foundation, whose purpose is to bring organizing and training skills to low-income communities.\n\nAt the 2018 Academy Awards, Huerta walked the red carpet alongside many A-list celebrities, before taking the stage with nine other activists during a performance of Common and Andra Day's Oscar-nominated song \"Stand up for Something.\"\n\nHuerta continues to lecture and speak out on a variety of social issues involving immigration, income inequality and the rights of women and Latinos.\n\nQUICK FACTS\n\nName: Dolores Huerta\n\nBirth Year: 1930\n\nBirth date: April 10, 1930\n\nBirth State: New Mexico\n\nBirth City: Dawson\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: Dolores Huerta is an activist and labor leader who co-founded what would become the United Farm Workers.\n\nIndustries\n\nCivil Rights\n\nAstrological Sign: Aries\n\nSchools\n\nDelta Community College\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Dolores Huerta Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/activists/dolores-huerta\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: May 6, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.history.com/topics/black-history/a-philip-randolph", "page_content": "A. Philip Randolph was a labor leader and civil rights activist who founded the nation’s first major Black labor union, the Brotherhood of Sleeping Car Porters (BSCP) in 1925. In the 1930s, his organizing efforts helped end both racial discrimination in defense industries and segregation in the U.S. armed forces. Randolph was also a principal organizer of the March on Washington in 1963, which paved the way for passage of the Civil Rights Act the following year.\n\nEarly Life and Move to Harlem\n\nAsa Philip Randolph was born on April 15, 1889 in Crescent City, Florida, where his father was a preacher in the African Methodist Episcopal Church. He grew up in an intellectual household, and Randoph and his older brother both studied at the Cookman Institute in Jacksonville, a Methodist school founded during Reconstruction as Florida’s first all-Black institution of higher education.\n\nInspired by the writings of leading Black intellectual W.E.B. Du Bois, Randolph moved to New York City in 1911. He settled in Harlem, where he found a job working on the switchboard in an apartment building and enrolled in courses at the City College of New York. Randolph’s devotion to the socialist cause led to a job working for the Brotherhood of Labor, an employment agency for Black workers. In 1914, he married Lucille Green, a young widow and Howard University graduate who owned a beauty salon in the building where he worked.\n\nThe 'Messenger' and Randolph's Socialist Politics\n\nRandolph and Chandler Owen, a law student and fellow socialist thinker, met in 1915 and became close friends. The two men joined the Socialist Party the following year and soon began publishing a magazine, Hotel Messenger (later renamed the Messenger), to advance their socialist views and rally fellow African Americans to the cause. In 1918, Randolph and Owen were arrested and jailed briefly for sedition for their public criticism of Woodrow Wilson’s presidential administration and its policies during World War I.\n\nRandolph was an early supporter of Marcus Garvey, the Jamaican-born founder of the Universal Negro Improvement Association (UNIA). But by 1920, he and other influential Black leaders in Harlem had begun to publicly criticize Garvey, helping spur a federal investigation that would eventually lead to Garvey’s deportation.\n\nFounding of the Brotherhood of Sleeping Car Porters (BSCP)\n\nIn the summer of 1925, Randolph received an invitation to speak to a group of porters from the Pullman Palace Car Company, a Chicago-based company that hired mainly African American men to serve white passengers aboard its luxury railroad sleeping cars. Pullman porters were generally paid far lower wages than white workers, and subjected to punishing working hours and conditions. After this initial meeting, Randolph agreed to help organize the Brotherhood of Sleeping Car Porters (BCSP), the nation’s first predominantly Black labor union.\n\nUnder Randolph’s leadership, the BSCP became the first Black union to be granted a charter by the American Federation of Labor (AFL). In 1934, Congress amended the earlier Railway Labor Act to specifically cover workers in sleeping cars, making it illegal for Pullman to fire members of the BSCP. The new legislation paved the way for Randolph and the BSCP to win a collective bargaining agreement and sign a contract with Pullman that recognized the union, reduced porters’ monthly work hours and raised wages.\n\nAfter the AFL merged with the Congress of Industrial Organizations in 1955 to form the AFL-CIO, Randolph joined the organization’s executive council; he became one of its first two Black vice presidents in 1957.\n\nCivil Rights Activism and the March on Washington\n\nMeanwhile, in addition to workers’ rights, Randolph had gained national prominence as an outspoken advocate for racial equality. In 1941, he announced a large protest march in Washington, D.C., aimed at convincing President Franklin D. Roosevelt to end discrimination in the nation’s defense industries. After Roosevelt responded by issuing Executive Order 8802, which opened war industries in World War II to Black workers and created the Fair Employment Practice Commission (FEPC), Randolph canceled the planned march. In 1948, Randolph’s activism similarly helped persuade President Harry Truman to desegregate the U.S. armed forces with passage of the Universal Military Service and Training Act.\n\nRandolph organized several other major protest marches in the nation’s capital in the late 1950s, including the Pilgrimage of Prayer (1957) and two youth marches protesting the slow pace of school desegregation in the South. In 1959, he helped found the Negro American Labor Council (NALC), which aimed to fight racial discrimination within labor unions.\n\nIn 1963, Randolph worked with fellow activist Bayard Rustin to spearhead the massive March on Washington held on August 28. At that event, nearly 250,000 people gathered to hear from civil rights leaders including Martin Luther King Jr., who delivered his iconic “I Have a Dream” speech from the steps of the Lincoln Memorial. Randolph, whose beloved wife, Lucille, died only weeks before the event, told the crowd they were witnessing the beginning of a new fight “not only for the Negro but for all Americans who thirst for freedom and a better life.”\n\nLater Years and Founding of A. Philip Randolph Institute\n\nThe March on Washington helped pave the way for passage of the 1964 Civil Rights Act, the first major piece of civil rights legislation since the Reconstruction era. That same year, Lyndon B. Johnson awarded Randolph the Presidential Medal of Freedom for his career of activism. In 1965, Rustin took charge of the newly founded A. Philip Randolph Institute, which replaced the NALC as the primary mode of advancing Randolph’s labor and civil rights goals.\n\nRandolph retired as president of the BCSP in 1968, and his public profile gradually receded as his health worsened. He spent his later years living quietly in New York City, and died in 1979, at the age of 90.\n\nSources\n\nJ.Y. Smith. “A. Philip Randolph Dies at 90.” The Washington Post, May 17, 1979.\n\nA. Philip Randoph: Biography. The Martin Luther King Jr. Research and Education Institute at Stanford University.\n\nAndrew E. Kersten. A. Philip Randolph: A Life in the Vanguard. (Rowman & Littlefield, 2007)"}, {"url": "https://www.britannica.com/biography/Dolores-Huerta", "page_content": "Dolores Huerta, née Dolores Fernández, (born April 10, 1930, Dawson, New Mexico, U.S.), American labour leader and activist whose work on behalf of migrant farmworkers led to the establishment of the United Farm Workers of America.\n\nWhen Huerta was a child she moved to Stockton, California, with her mother and siblings after her parents’ divorce. She remained in touch with her father, Juan Fernández, and took pride in his personal and professional development from coal miner to migrant labourer to union activist to an elected representative in the New Mexico state legislature to college graduate. Unlike many women of her era, she went on to college, after graduating from Stockton High School. Although a brief marriage, motherhood, and divorce interrupted her studies, she eventually received an A.A. degree from Stockton College. A series of unsatisfying jobs led her to seek a teaching credential, but her teaching career lasted only a few months. Huerta decided that she could do more for the hungry and barefoot farmworkers’ children in her class by helping their parents win more equitable working conditions. As an employee of a Mexican-American self-help association called the Community Service Organization (CSO), Huerta lobbied California state legislators to enact such progressive legislation as old-age pensions for noncitizens.\n\nIn the late 1950s Huerta became interested in the conditions of farmworkers and met Cesar Chavez, a CSO official who shared that interest. Their attempts to focus the CSO’s attention on the inequities plaguing rural workers failed, and both eventually left that organization. By 1962 they had cofounded the National Farm Workers Association, forerunner of the United Farm Workers (UFW), an influential union whose grape boycott in the late 1960s forced grape producers to improve working conditions for migrant farmworkers. As coordinator of nationwide lettuce, grape, and Gallo wine boycotts in the 1970s, Huerta helped create the national climate that led to the passage in 1975 of the Agricultural Labor Relations Act, the first law recognizing the rights of California farmworkers to bargain collectively.\n\nIn the 1980s Huerta cofounded the UFW’s radio station and continued to speak and raise funds on behalf of a variety of causes, including immigration policy and farm labourers’ health. From 1988 to 1993, Huerta served on the U.S. Commission on Agricultural Workers, established by Congress to evaluate special worker provisions and labour markets in the agriculture industry. In 2002 she founded the Dolores Huerta Foundation, which was involved in community organizing. Her numerous honours include induction (1993) into the National Women’s Hall of Fame. She also was awarded the Presidential Medal of Freedom in 2012. Huerta was the subject of the documentary Dolores (2017)."}, {"url": "https://mymodernmet.com/civil-rights-leaders/", "page_content": "The fight for Black equality has a long, complicated history in the United States. And across that history, there are many men and women who have put themselves on the line to fight discrimination and racism. While the civil rights movement of the 1960s produced many great leaders—including Dr. Martin Luther King and John Lewis—there are many Black activists who have taken a stand both before and after to push racial equality forward.\n\nWhether it's Ida B. Wells, who used her skills as a journalist to shed light on the true nature of lynchings, or Nekima Levy Armstrong, a lawyer who activated the community in the aftermath of the George Floyd murder, many women and men have all made important contributions.\n\nSome of these leaders were passionate about ending segregation, while others tackled equal opportunity in employment and education. Others, like Claudette Colvin, simply decided to stand their ground no matter what the consequences. This activism certainly did not start or end in the 1960s, and it continues today with leaders like Ibram X. Kendi, who uses his work in academia to teach the public about antiracism.\n\nThis list touches on just some of the incredible Black men and women who have taken a stand for civil rights and social justice throughout history.\n\nHere are 15 incredible Black activists who have fought for civil rights.\n\nIda B. Wells\n\nFull Name Ida Bell Wells-Barnett Born July 16, 1862 (Holly Springs, Mississippi) Died March 25, 1931 (Chicago, Illinois) Notable Contribution Co-founder of the NAACP\n\nBorn into slavery, Ida B. Wells used her skills as an investigative journalist to expose the fact that lynchings were not only reserved for Black criminals—an idea widely circulated at the time. As an early civil rights leader and feminist, Wells was a founder of the National Association for the Advancement of Colored People (NAACP) and worked with Susan B. Anthony during the women's suffrage movement.\n\nW.E.B. Du Bois\n\nFull Name William Edward Burghardt Du Bois Born February 23, 1868 (Great Barrington, Massachusetts) Died August 27, 1963 (Accra, Ghana) Notable Contribution Co-founder of the NAACP\n\nNot only was W. E. B. DuBois the first Black person to receive a doctorate from Harvard University, but he was also a leader in the Niagara Movement. This early civil rights movement called for equal rights for all Black people in the South and more political representation. Employment and education discrimination, Jim Crow laws, and lynchings were just some of the other issues he worked tirelessly to change. In 1909, DuBois became a founder of the NAACP and traveled internationally to advocate for people of color worldwide.\n\nA. Philip Randolph\n\nFull Name Asa Philip Randolph Born April 15, 1889 (Crescent City, Florida) Died May 16, 1979 (New York City, New York) Notable Contribution Founded first successful Black labor union\n\nAs a young man, A. Philip Randolph was inspired by W. E. B. DuBois to fight for racial equality. Kept from working anything but manual labor jobs while living in the South, and recognizing that collective bargaining could be a way to gain equality, Randolph eventually organized the first successful Black labor union. The Brotherhood of Sleeping Car Porters (BSCP) was reluctantly accepted into the American Federation of Labor. President Franklin D. Roosevelt later issued the Fair Employment Act after Randolph promised to march 50,000 protestors through Washington. This act ended discrimination in the nation's defense industry. He was also passionate about ending segregation in the military and founded the League for Nonviolent Civil Disobedience Against Military Segregation. This later inspired President Harry Truman to sign an executive order desegregating the military. Randolph was also an organizer of the 1963 March on Washington and is considered one of the Big Six leaders of the civil rights movement along with Martin Luther King Jr., James Farmer, John Lewis, A. Philip Randolph, Roy Wilkins, and Whitney Young.\n\nElla Baker\n\nView this post on Instagram A post shared by Intl. African American Museum (@iaamuseum)\n\nFull Name Ella Josephine Baker Born December 13, 1903 (Norfolk, Virginia) Died December 13, 1986 (Manhattan, New York) Notable Contribution Founded Student Nonviolent Coordinating Committee (SNCC)\n\nWhile Ella Baker‘s face may not be as recognizable as others on the list, she played a fundamental role in the civil rights movement. She worked behind the scenes with many of the famous names on this list as a grassroots organizer passionate about nonviolent protest. In fact, she founded the Student Nonviolent Coordinating Committee (SNCC) and helped organize Dr. Martin Luther King Jr.'s Southern Christian Leadership Conference (SCLC). She worked as the associate director of the SCLC and spearheaded its initial project to increase African American voter registration. Later, she founded the Southern Conference Education Fund (SCEF), which worked to dismantle Jim Crow laws and educate white southern people about the evils of racism. Baker also had a long relationship with the NAACP, initially working as a field secretary and later becoming a branch director, which made her the organization's highest-ranking woman at the time.\n\nDorothy Height\n\nFull Name Dorothy Irene Height Born March 24, 1912 (Richmond, Virginia) Died April 20, 2010 (Washington, D.C.) Notable Contribution Longtime President of the National Council of Negro Women (NCNW)\n\nSpending 40 years as the president of the National Council of Negro Women (NCNW), Dorothy Height was a leading advocate for Black women. She was the first prominent leader to recognize that women's rights and African American rights should be treated as the same, not separate, issues. Height began her foray into activism while still a teenager by working to desegregate her local YWCA pool. Though unsuccessful, she continued to fight against social injustice and created essential relationships with political leaders like Eleanor Roosevelt, President Lyndon B. Johnson, and President Barack Obama. She was a chief organizer at the 1963 March on Washington, with James Farmer later noting that her role and involvement in the Big Six was often overlooked by journalists due to sexism. In 2010, When she passed at age 98, President Barack Obama released a statement calling her “the godmother of the civil rights movement and a hero to so many Americans.”\n\nJames Farmer\n\nFull Name James Leonard Farmer Jr. Born January 12, 1920 (Marshall, Texas) Died July 9, 1999 (Fredericksburg, Virginia) Notable Contribution Organizer of the first Freedom Ride\n\nIn 1942, James Farmer co-founded the Committee of Racial Equality (CORE) in Chicago. The organization's mission was to dismantle segregation through nonviolent means. CORE organized large-scale sit-ins at segregated restaurants and put legal pressure on Chicago businesses practicing segregation. Farmer would go on to organize the first Freedom Ride in 1961 and was considered one of the Big Six of the civil rights movement in the 1960s.\n\nWhitney Young\n\nFull Name Whitney Moore Young Jr. Born July 31, 1921 (Shelby County, Kentucky) Died March 11, 1971 (Lagos, Nigeria) Notable Contribution Executive director of the National Urban League\n\nA veteran of World War II, Whitney Young used his training as a social worker to help mediate race relations. He spent 10 years as the executive director of the National Urban League. During that time, he took the moderate organization—which also had many white members—and transformed it into a leading voice of the civil rights movement. As executive director, Young used his influence with major corporations and politicians to advocate for the Black community. He was a close advisor of Presidents Kennedy, Johnson, and Nixon. At the same time, he wasn't afraid to take a stand and was an organizer of the 1963 March on Washington despite pushback from white-owned corporations.\n\nMalcolm X\n\nFull Name born Malcolm Little, later Malik el-Shabazz Born May 19, 1925 (Omaha, Nebraska) Died February 21, 1965 (New York City, New York) Notable Contribution Advocate for Black empowerment\n\nAs the spokesperson for the Nation of Islam, Malcolm X called for Black empowerment and independence. He was vocal about disdain for the nonviolent tactics and integration that were the hallmarks of the mainstream civil rights movement. Instead, he called for a complete separation between the Black and white communities—allowing Black people to have their own land and govern themselves—and stated that Black people needed to rise up by any means necessary. His teachings were the origins of the Black Power movement.\n\nDr. Martin Luther King Jr.\n\nFull Name Dr. Martin Luther King Jr. Born January 15, 1929 (Atlanta, Georgia) Died April 4, 1968 (Memphis, Tennessee) Notable Contribution March on Washington - \"I Have a Dream\" speech\n\nDr. Martin Luther King Jr. remains one of the most prominent names in the American civil rights movement. As a Baptist minister and activist, he believed in nonviolent protest. In 1955, he spearheaded the Montgomery bus boycott. His skills as an orator made him a natural figurehead and the boycott pushed him into the national spotlight. Together with other leaders, he founded the Southern Christian Leadership Conference (SCLC) to harness the power of Black churches for civil rights reform. Dr. King was one of the organizers of the 1963 March on Washington, and it was there that he delivered his iconic I Have a Dream speech.\n\nClaudette Colvin\n\nFull Name Claudette Colvin Born September 5, 1939 (Montgomery, Alabama) Notable Contribution Help desegregate Alabama public transit as a teenager\n\nNine months before Rosa Parks refused to give up her seat on a bus, 15-year-old Claudette Colvin was arrested for not giving her bus seat to a white woman in Montgomery, Alabama. This event helped spark the 1955 Montgomery bus boycott. Later, Colvin testified as part of Browder v. Gayle, which aimed to challenge bus segregation in the city. A ruling that bus segregation in the state was unconstitutional was upheld by the Supreme Court, ending Alabama's bus segregation.\n\nJulian Bond\n\nFull Name Horace Julian Bond Born January 14, 1940 (Nashville, Tennessee) Died August 15, 2015 (Fort Walton Beach, Florida) Notable Contribution Helped found the Student Nonviolent Coordinating Committee (SNCC)\n\nWhile studying at Morehouse College, Julian Bond was a founding member of the Student Nonviolent Coordination Committee (SNCC). From 1961 to 1966, as SNCC's communications director, he traveled across the South to organize civil rights protests and organize voter registration. He later founded the Southern Poverty Law Center, which filed legal cases against white supremacy groups. He served a total of 20 years in both the Georgia House of Representatives and Georgia State House and was the chairman of the NAACP from 1998 to 2010.\n\nJohn Lewis\n\nFull Name John Robert Lewis Born February 21, 1940 (Pike County, Alabama) Died July 17, 2020 (Atlanta, Georgia) Notable Contribution Led first Selma to Montgomery march, served 17 terms in the U.S. House of Representatives\n\nAs one of the Big Six who organized the 1963 March on Washington, John Lewis had a long career that saw him go from grassroots activism to a long-serving member of the U.S. House of Representatives. The son of sharecroppers from Alabama, as a young man, Lewis participated in numerous sit-ins and, in 1961, was one of the original Freedom Riders. He also led the first Selma to Montgomery march. During the event called “Bloody Sunday,” his skull was fractured when Alabama state troopers attacked the participants. The events spurred President Lyndon B. Johnson to sign the Voting Rights Act, which prohibits racial discrimination in voting. Lewis remained a staunch defender of this act throughout his career. In 2011, he was awarded the Presidential Medal of Freedom by President Barack Obama.\n\nTarana Burke\n\nFull Name Tarana Burke Born September 12, 1973 (New York City, New York) Notable Contribution Started MeToo movement\n\nIn 2006, Bronx-based activist Tarana Burke started using the term #MeToo as a way to shed light on sexual assault and abuse. Over a decade later, the term would become widespread in light of the Harvey Weinstein scandal. That same year, in 2017, she was also named a TIME magazine's Person of the Year. Burke continues her activism as the longtime Senior Director of Girls for Gender Equity in Brooklyn, which helps young women of color with self-improvement through classes and workshops.\n\nNekima Levy Armstrong\n\nFull Name Nekima Valdez Levy Armstrong Born June 27, 1976 (Jackson, Mississippi) Notable Contribution Founder of the Racial Justice Network\n\nAmerican civil rights lawyer and activist Nekima Levy Armstrong rose to national prominence in the wake of the George Floyd murder. She was the president of the Minneapolis chapter of the NAACP from 2015 to 2016 and participated in many Black Lives Matter protests starting in 2014. She was a named party in the American Civil Liberties Union of Minnesota's complaint over the peaceful right to protest after being at a protest where officers used tear gas on participants. She is also the founder of the Racial Justice Network, a grassroots organization committed to “fighting for racial justice and building bridges across racial, social, and economic lines.”\n\nIbram X. Kendi\n\nFull Name Ibram Xolani Kendi Born August 13, 1982 (Jamaica, New York) Notable Contribution Director of the Boston University Center for Antiracist Research\n\nHistorian, author, and activist Ibram X. Kendi is the author of How to Be an Antiracist and is the director of the Boston University Center for Antiracist Research. In 2021, Kendi co-founded The Emancipator, an online newspaper covering racial justice topics.\n\nRelated Articles :\n\nHow the Stonewall Riots Forever Changed History\n\n10 Fearless Women From History Who Fought for a Better Future\n\n10 Groundbreaking African American Artists That Shaped History\n\n8 Artworks of the Civil Rights Movement That Exemplify the Struggle for Equal Rights"}]}