{"Rudy Fernandez was a leader in the struggle for civil rights.": [{"url": "https://www.history.com/topics/black-history/civil-rights-movement", "page_content": "The civil rights movement was a struggle for social justice that took place mainly during the 1950s and 1960s for Black Americans to gain equal rights under the law in the United States. The Civil War officially abolished slavery , but it didn’t end discrimination against Black people—they continued to endure the devastating effects of racism, especially in the South. By the mid-20th century, Black Americans, along with many other Americans, mobilized and began an unprecedented fight for equality that spanned two decades.\n\nJim Crow Laws\n\nDuring Reconstruction, Black people took on leadership roles like never before. They held public office and sought legislative changes for equality and the right to vote.\n\nIn 1868, the 14th Amendment to the Constitution gave Black people equal protection under the law. In 1870, the 15th Amendment granted Black American men the right to vote. Still, many white Americans, especially those in the South, were unhappy that people they’d once enslaved were now on a more-or-less equal playing field.\n\nTo marginalize Black people, keep them separate from white people and erase the progress they’d made during Reconstruction, “Jim Crow” laws were established in the South beginning in the late 19th century. Black people couldn’t use the same public facilities as white people, live in many of the same towns or go to the same schools. Interracial marriage was illegal, and most Black people couldn’t vote because they were unable to pass voter literacy tests.\n\nJim Crow laws weren’t adopted in northern states; however, Black people still experienced discrimination at their jobs or when they tried to buy a house or get an education. To make matters worse, laws were passed in some states to limit voting rights for Black Americans.\n\nMoreover, southern segregation gained ground in 1896 when the U.S. Supreme Court declared in Plessy v. Ferguson that facilities for Black and white people could be “separate but equal.\"\n\nWorld War II and Civil Rights\n\nPrior to World War II, most Black people worked as low-wage farmers, factory workers, domestics or servants. By the early 1940s, war-related work was booming, but most Black Americans weren’t given better-paying jobs. They were also discouraged from joining the military.\n\nAfter thousands of Black people threatened to march on Washington to demand equal employment rights, President Franklin D. Roosevelt issued Executive Order 8802 on June 25, 1941. It opened national defense jobs and other government jobs to all Americans regardless of race, creed, color or national origin.\n\nBlack men and women served heroically in World War II, despite suffering segregation and discrimination during their deployment. The Tuskegee Airmen broke the racial barrier to become the first Black military aviators in the U.S. Army Air Corps and earned more than 150 Distinguished Flying Crosses. Yet many Black veterans were met with prejudice and scorn upon returning home. This was a stark contrast to why America had entered the war to begin with—to defend freedom and democracy in the world.\n\nAs the Cold War began, President Harry Truman initiated a civil rights agenda, and in 1948 issued Executive Order 9981 to end discrimination in the military. These events helped set the stage for grass-roots initiatives to enact racial equality legislation and incite the civil rights movement.\n\nRosa Parks\n\nOn December 1, 1955, a 42-year-old woman named Rosa Parks found a seat on a Montgomery, Alabama bus after work. Segregation laws at the time stated Black passengers must sit in designated seats at the back of the bus, and Parks complied.\n\nWhen a white man got on the bus and couldn’t find a seat in the white section at the front of the bus, the bus driver instructed Parks and three other Black passengers to give up their seats. Parks refused and was arrested.\n\nAs word of her arrest ignited outrage and support, Parks unwittingly became the “mother of the modern-day civil rights movement.” Black community leaders formed the Montgomery Improvement Association (MIA) led by Baptist minister Martin Luther King Jr., a role which would place him front and center in the fight for civil rights.\n\nParks’ courage incited the MIA to stage a boycott of the Montgomery bus system. The Montgomery Bus Boycott lasted 381 days. On November 14, 1956, the Supreme Court ruled segregated seating was unconstitutional.\n\nLittle Rock Nine\n\nIn 1954, the civil rights movement gained momentum when the United States Supreme Court made segregation illegal in public schools in the case of Brown v. Board of Education. In 1957, Central High School in Little Rock, Arkansas asked for volunteers from all-Black high schools to attend the formerly segregated school.\n\nOn September 4, 1957, nine Black students, known as the Little Rock Nine, arrived at Central High School to begin classes but were instead met by the Arkansas National Guard (on order of Governor Orval Faubus) and a screaming, threatening mob. The Little Rock Nine tried again a couple of weeks later and made it inside, but had to be removed for their safety when violence ensued.\n\nFinally, President Dwight D. Eisenhower intervened and ordered federal troops to escort the Little Rock Nine to and from classes at Central High. Still, the students faced continual harassment and prejudice.\n\nTheir efforts, however, brought much-needed attention to the issue of desegregation and fueled protests on both sides of the issue.\n\nCivil Rights Act of 1957\n\nEven though all Americans had gained the right to vote, many southern states made it difficult for Black citizens. They often required prospective voters of color to take literacy tests that were confusing, misleading and nearly impossible to pass.\n\nWanting to show a commitment to the civil rights movement and minimize racial tensions in the South, the Eisenhower administration pressured Congress to consider new civil rights legislation.\n\nOn September 9, 1957, President Eisenhower signed the Civil Rights Act of 1957 into law, the first major civil rights legislation since Reconstruction. It allowed federal prosecution of anyone who tried to prevent someone from voting. It also created a commission to investigate voter fraud.\n\nWoolworth's Lunch Counter\n\nDespite making some gains, Black Americans still experienced blatant prejudice in their daily lives. On February 1, 1960, four college students took a stand against segregation in Greensboro, North Carolina when they refused to leave a Woolworth’s lunch counter without being served.\n\nOver the next several days, hundreds of people joined their cause in what became known as the Greensboro sit-ins. After some were arrested and charged with trespassing, protesters launched a boycott of all segregated lunch counters until the owners caved and the original four students were finally served at the Woolworth’s lunch counter where they’d first stood their ground.\n\nTheir efforts spearheaded peaceful sit-ins and demonstrations in dozens of cities and helped launch the Student Nonviolent Coordinating Committee to encourage all students to get involved in the civil rights movement. It also caught the eye of young college graduate Stokely Carmichael, who joined the SNCC during the Freedom Summer of 1964 to register Black voters in Mississippi. In 1966, Carmichael became the chair of the SNCC, giving his famous speech in which he originated the phrase \"Black power.”\n\nFreedom Riders\n\nOn May 4, 1961, 13 “Freedom Riders”—seven Black and six white activists–mounted a Greyhound bus in Washington, D.C., embarking on a bus tour of the American south to protest segregated bus terminals. They were testing the 1960 decision by the Supreme Court in Boynton v. Virginia that declared the segregation of interstate transportation facilities unconstitutional.\n\nFacing violence from both police officers and white protesters, the Freedom Rides drew international attention. On Mother’s Day 1961, the bus reached Anniston, Alabama, where a mob mounted the bus and threw a bomb into it. The Freedom Riders escaped the burning bus but were badly beaten. Photos of the bus engulfed in flames were widely circulated, and the group could not find a bus driver to take them further. U.S. Attorney General Robert F. Kennedy (brother to President John F. Kennedy) negotiated with Alabama Governor John Patterson to find a suitable driver, and the Freedom Riders resumed their journey under police escort on May 20. But the officers left the group once they reached Montgomery, where a white mob brutally attacked the bus. Attorney General Kennedy responded to the riders—and a call from Martin Luther King Jr.—by sending federal marshals to Montgomery.\n\nOn May 24, 1961, a group of Freedom Riders reached Jackson, Mississippi. Though met with hundreds of supporters, the group was arrested for trespassing in a “whites-only” facility and sentenced to 30 days in jail. Attorneys for the National Association for the Advancement of Colored People (NAACP) brought the matter to the U.S. Supreme Court, which reversed the convictions. Hundreds of new Freedom Riders were drawn to the cause, and the rides continued.\n\nIn the fall of 1961, under pressure from the Kennedy administration, the Interstate Commerce Commission issued regulations prohibiting segregation in interstate transit terminals\n\nMarch on Washington\n\nArguably one of the most famous events of the civil rights movement took place on August 28, 1963: the March on Washington. It was organized and attended by civil rights leaders such as A. Philip Randolph, Bayard Rustin and Martin Luther King Jr.\n\nMore than 200,000 people of all races congregated in Washington, D. C. for the peaceful march with the main purpose of forcing civil rights legislation and establishing job equality for everyone. The highlight of the march was King’s speech in which he continually stated, “I have a dream…”\n\nKing’s “I Have a Dream” speech galvanized the national civil rights movement and became a slogan for equality and freedom.\n\nCivil Rights Act of 1964\n\nPresident Lyndon B. Johnson signed the Civil Rights Act of 1964—legislation initiated by President John F. Kennedy before his assassination—into law on July 2 of that year.\n\nKing and other civil rights activists witnessed the signing. The law guaranteed equal employment for all, limited the use of voter literacy tests and allowed federal authorities to ensure public facilities were integrated.\n\nBloody Sunday\n\nOn March 7, 1965, the civil rights movement in Alabama took an especially violent turn as 600 peaceful demonstrators participated in the Selma to Montgomery march to protest the killing of Black civil rights activist Jimmie Lee Jackson by a white police officer and to encourage legislation to enforce the 15th amendment.\n\nAs the protesters neared the Edmund Pettus Bridge, they were blocked by Alabama state and local police sent by Alabama Governor George C. Wallace, a vocal opponent of desegregation. Refusing to stand down, protesters moved forward and were viciously beaten and teargassed by police and dozens of protesters were hospitalized.\n\nThe entire incident was televised and became known as “Bloody Sunday.” Some activists wanted to retaliate with violence, but King pushed for nonviolent protests and eventually gained federal protection for another march.\n\nVoting Rights Act of 1965\n\nWhen President Johnson signed the Voting Rights Act into law on August 6, 1965, he took the Civil Rights Act of 1964 several steps further. The new law banned all voter literacy tests and provided federal examiners in certain voting jurisdictions.\n\nIt also allowed the attorney general to contest state and local poll taxes. As a result, poll taxes were later declared unconstitutional in Harper v. Virginia State Board of Elections in 1966.\n\nPart of the Act was walked back decades later, in 2013, when a Supreme Court decision ruled that Section 4(b) of the Voting Rights Act was unconstitutional, holding that the constraints placed on certain states and federal review of states' voting procedures were outdated.\n\nCivil Rights Leaders Assassinated\n\nThe civil rights movement had tragic consequences for two of its leaders in the late 1960s. On February 21, 1965, former Nation of Islam leader and Organization of Afro-American Unity founder Malcolm X was assassinated at a rally.\n\nOn April 4, 1968, civil rights leader and Nobel Peace Prize recipient Martin Luther King Jr. was assassinated on his hotel room's balcony. Emotionally-charged looting and riots followed, putting even more pressure on the Johnson administration to push through additional civil rights laws.\n\nFair Housing Act of 1968\n\nThe Fair Housing Act became law on April 11, 1968, just days after King’s assassination. It prevented housing discrimination based on race, sex, national origin and religion. It was also the last legislation enacted during the civil rights era.\n\nThe civil rights movement was an empowering yet precarious time for Black Americans. The efforts of civil rights activists and countless protesters of all races brought about legislation to end segregation, Black voter suppression and discriminatory employment and housing practices.\n\nPhoto Galleries In 1957 nine Black students integrated the formerly all-white Central High School in Little Rock, Arkansas. The students were dubbed the \"Little Rock Nine.\" Arkansas governor, Orval Faubus, tried to block the integration of the school by calling in the state National Guard, President Eisenhower sent in the 101st Airborne to ensure the students could safely attend the school. Minnijean Brown, 15, one of the Little Rock Nine, arrives outside Central High School, as members of the 101st Division of the Airborne Command stand ready to protect her and the other African American students. Armed members of the 101st Airborne were posted outside the doors to Central High School to ensure the safety of the students. Col. William E. Kuhn, commander of the first battle group of the 101st Airborne Division, speaking to press during enforcement of integration at Central High School. A police officer watches the proceedings at Central High school, as the school is integrated for the first time. A pro-segregation rally at the Arkansas state capitol in Little Rock, protesting the integration of schools like Little Rock's Central High School. 1 / 7 : John Bryson/Time Life Pictures/Getty Images\n\nOne evening in 1958, photographer Flip Schulke was covering a rally at a Black Baptist church in Miami where Dr. Martin Luther King Jr. was speaking. He was later invited to meet with Dr. King, a defining moment in his career and the start to a great friendship.Here, Reverend Martin Luther King Jr. is seen meeting with his parishioners at Ebenezer Baptist Church in Atlanta, Georgia after Sunday services. Southern Christian Leadership Conference leader C.T. Vivian teaching a class in non-violence for marchers in the basement of a black church in Selma.At King’s invitation, Schulke began attending the secret planning meetings of the SCLC. Not everyone there was pleased about Schulke’s presence: many of the group’s organizers believed a white man could not be trusted.“I have known this man for years,\" King assured his followers. \"I don’t care if Flip is purple with yellow polka dots, he is a human being and I know him better than I know a lot of black people. I trust him. He stays and that’s it.” Schulke's archive includes moments from some of Dr. King's biggest moments, such as the 1965 Selma to Montgomery March. Here, civil rights marchers are seen crossing the Edmund Pettus Bridge in the second attempt to march to Montgomery. Alabama state highway patrol officers line up across a road to block a civil rights march from leaving Selma. The march was turned around by the police shortly after crossing the bridge. During the first attempted march police beat the civil rights activists. Martin Luther King Jr. holds a wreath as he attends a memorial service for Reverend Jim Reeb with other clergymen. Reeb, a Unitarian minister, was killed by segregationists while participating in the marches from Selma to Montgomery. Dr. King and his wife Coretta Scott King march together along a rural Mississippi road with the March Against Fear in 1963, after the death of James Meredith. A man lies on the ground after being beaten and teargassed during a civil rights rally in Canton, Mississippi. The nighttime rally was attacked by state and local police as the March Against Fear passed through the town. Martin Luther King Jr. speaking to the marchers after police attack. On the front lines of many tense confrontations, Schulke endured some of the same dangers as the protestors. He was threatened by white mobs protesting against integration, tear gassed, and locked in police cars to keep him from documenting important moments in Black history. Dr. King and his family eating their Sunday dinner after church. In Schulke's 1995 book, He Had a Dream, he noted “Outside of my immediate family, his was the greatest friendship I have ever known or experienced.” During their 10 year friendship, Schulke created about 11,000 photographs of his dear friend and the groundbreaking movement he helped inspire. Read more: How Martin Luther King Jr. Took Inspiration From Gandhi on Nonviolence After King’s shocking assassination, Coretta Scott King personally invited Schulke to bring his camera to the funeral. Here, he captured Robert Kennedy and his wife Ethel paying their respects to the King family. Several young people view the body of Martin Luther King Jr. as it lies in state in Ebenezer Baptist Church. Through the sensitive lens of a man who had just lost a great friend, Schulke captured one of the most well-known images from the memorial. His portrait of Coretta sitting in the pews veiled in black at her husband’s funeral made the cover of Life Magazine on April 19, 1968, becoming one of its most famous covers. Schulke kept in touch with the family years later. Here, the children of Martin Luther King Jr., Martin, Dexter, Yolanda, and Bernice sit for a portrait in their living room. Paintings of their father and Gandhi hang above them.Watch: Dr. Bernice King on Her Father and the Global Family 1 / 15 : Flip Schulke Archives/Getty Images"}, {"url": "https://www.jfklibrary.org/learn/education/students/leaders-in-the-struggle-for-civil-rights", "page_content": "In the 1960 election, John F. Kennedy received strong, perhaps decisive, support from black voters. Nonetheless, at the outset of his administration, Kennedy deferred civil rights legislation to avoid alienating southern Democrats, whose votes were essential to the passage of his overall domestic program. He relied instead on the use of executive authority to implement a number of progressive measures. Most civil rights leaders, however, urged a more aggressive approach.\n\nFinally, in June 1963, Kennedy committed the full powers of his office to the cause of equal rights. He gave a televised address on the problem of racial discrimination, calling it \"a moral crisis\" and submitted comprehensive civil rights legislation to Congress.\n\nWhen civil rights leaders announced plans for a march on Washington that summer, Kennedy initially opposed the idea, fearing a large demonstration in the capital could turn violent and jeopardize the civil rights bill. After a meeting with the leaders, he was persuaded that the March was \"in the great tradition\" of American protest.\n\nThe main leaders of the March were A. Philip Randolph (who had initiated the idea), the heads of the five key civil rights organizations, plus longtime activist Bayard Rustin. Each one played an important part in America's struggle for civil rights. Letters and articles sent to the president and his staff by these seven leaders provide insights into their individual personalities and viewpoints, and into the roles of the different organizations. Telegrams, which were often sent at times of crisis and decision, vividly capture the urgency of the moment."}, {"url": "https://human.libretexts.org/Bookshelves/History/National_History/Book%3A_U.S._History_(OpenStax)/28%3A_Post-War_Prosperity_and_Cold_War_Fears_1945-1960/28.04%3A_The_African_American_Struggle_for_Civil_Rights", "page_content": "In the aftermath of World War II, African Americans began to mount organized resistance to racially discriminatory policies in force throughout much of the United States. In the South, they used a combination of legal challenges and grassroots activism to begin dismantling the racial segregation that had stood for nearly a century following the end of Reconstruction. Community activists and civil rights leaders targeted racially discriminatory housing practices, segregated transportation, and legal requirements that African Americans and whites be educated separately. While many of these challenges were successful, life did not necessarily improve for African Americans. Hostile whites fought these changes in any way they could, including by resorting to violence.\n\nEARLY VICTORIES During World War II, many African Americans had supported the “Double V Campaign,” which called on them to defeat foreign enemies while simultaneously fighting against segregation and discrimination at home. After World War II ended, many returned home to discover that, despite their sacrifices, the United States was not willing to extend them any greater rights than they had enjoyed before the war. Particularly rankling was the fact that although African American veterans were legally entitled to draw benefits under the GI Bill, discriminatory practices prevented them from doing so. For example, many banks would not give them mortgages if they wished to buy homes in predominantly African American neighborhoods, which banks often considered too risky an investment. However, African Americans who attempted to purchase homes in white neighborhoods often found themselves unable to do so because of real estate covenants that prevented owners from selling their property to blacks. Indeed, when a black family purchased a Levittown house in 1957, they were subjected to harassment and threats of violence. Click and Explore: For a look at the experiences of an African American family that tried to move to a white suburban community, view the 1957 documentary Crisis in Levittown. The postwar era, however, saw African Americans make greater use of the courts to defend their rights. In 1944, an African American woman, Irene Morgan, was arrested in Virginia for refusing to give up her seat on an interstate bus and sued to have her conviction overturned. In Morgan v. the Commonwealth of Virginia in 1946, the U.S. Supreme Court ruled that the conviction should be overturned because it violated the interstate commerce clause of the Constitution. This victory emboldened some civil rights activists to launch the Journey of Reconciliation, a bus trip taken by eight African American men and eight white men through the states of the Upper South to test the South’s enforcement of the Morgan decision. Other victories followed. In 1948, in Shelley v. Kraemer, the U.S. Supreme Court held that courts could not enforce real estate covenants that restricted the purchase or sale of property based on race. In 1950, the NAACP brought a case before the U.S. Supreme Court that they hoped would help to undermine the concept of “separate but equal” as espoused in the 1896 decision in Plessy v. Ferguson, which gave legal sanction to segregated school systems. Sweatt v. Painter was a case brought by Herman Marion Sweatt, who sued the University of Texas for denying him admission to its law school because state law prohibited integrated education. Texas attempted to form a separate law school for African Americans only, but in its decision on the case, the U.S. Supreme Court rejected this solution, holding that the separate school provided neither equal facilities nor “intangibles,” such as the ability to form relationships with other future lawyers, that a professional school should provide. Not all efforts to enact desegregation required the use of the courts, however. On April 15, 1947, Jackie Robinson started for the Brooklyn Dodgers, playing first base. He was the first African American to play baseball in the National League, breaking the color barrier. Although African Americans had their own baseball teams in the Negro Leagues, Robinson opened the gates for them to play in direct competition with white players in the major leagues. Other African American athletes also began to challenge the segregation of American sports. At the 1948 Summer Olympics, Alice Coachman, an African American, was the only American woman to take a gold medal in the games ( Figure ). These changes, while symbolically significant, were mere cracks in the wall of segregation. Figure 28.5.1: Baseball legend Jackie Robinson (a) was active in the civil rights movement. He served on the NAACP’s board of directors and helped to found an African American-owned bank. Alice Coachman (b), who competed in track and field at Tuskegee University, was the first black woman to win an Olympic gold medal.\n\nDESEGREGATION AND INTEGRATION Until 1954, racial segregation in education was not only legal but was required in seventeen states and permissible in several others ( Figure ). Utilizing evidence provided in sociological studies conducted by Kenneth Clark and Gunnar Myrdal, however, Thurgood Marshall, then chief counsel for the NAACP, successfully argued the landmark case Brown v. Board of Education of Topeka, Kansasbefore the U.S. Supreme Court led by Chief Justice Earl Warren. Marshall showed that the practice of segregation in public schools made African American students feel inferior. Even if the facilities provided were equal in nature, the Court noted in its decision, the very fact that some students were separated from others on the basis of their race made segregation unconstitutional. Figure 28.5.2: This map shows those states in which racial segregation in public education was required by law before the 1954 Brown v. Board of Education decision. In 1960, four years later, fewer than 10 percent of southern African American students attended the same schools as white students. THURGOOD MARSHALL ON FIGHTING RACISM As a law student in 1933, Thurgood Marshall ( Figure ) was recruited by his mentor Charles Hamilton Houston to assist in gathering information for the defense of a black man in Virginia accused of killing two white women. His continued close association with Houston led Marshall to aggressively defend blacks in the court system and to use the courts as the weapon by which equal rights might be extracted from the U.S. Constitution and a white racist system. Houston also suggested that it would be important to establish legal precedents regarding the Plessy v. Ferguson ruling of separate but equal. Figure 28.5.3: In 1956, NAACP leaders (from left to right) Henry L. Moon, Roy Wilkins, Herbert Hill, and Thurgood Marshall present a new poster in the campaign against southern white racism. Marshall successfully argued the landmark case Brown v. Board of Education (1954) before the U.S. Supreme Court and later became the court’s first African American justice. By 1938, Marshall had become “Mr. Civil Rights” and formally organized the NAACP’s Legal Defense and Education Fund in 1940 to garner the resources to take on cases to break the racist justice system of America. A direct result of Marshall’s energies and commitment was his 1940 victory in a Supreme Court case, Chambers v. Florida, which held that confessions obtained by violence and torture were inadmissible in a court of law. His most well-known case was Brown v. Board of Education in 1954, which held that state laws establishing separate public schools for black and white students were unconstitutional. Later in life, Marshall reflected on his career fighting racism in a speech at Howard Law School in 1978: Be aware of that myth, that everything is going to be all right. Don’t give in. I add that, because it seems to me, that what we need to do today is to refocus. Back in the 30s and 40s, we could go no place but to court. We knew then, the court was not the final solution. Many of us knew the final solution would have to be politics, if for no other reason, politics is cheaper than lawsuits. So now we have both. We have our legal arm, and we have our political arm. Let’s use them both. And don’t listen to this myth that it can be solved by either or that it has already been solved. Take it from me, it has not been solved. When Marshall says that the problems of racism have not been solved, to what was he referring? When Marshall says that the problems of racism have not been solved, to what was he referring? Plessy v. Fergusson had been overturned. The challenge now was to integrate schools. A year later, the U.S. Supreme Court ordered southern school systems to begin desegregation “with all deliberate speed.” Some school districts voluntarily integrated their schools. For many other districts, however, “deliberate speed” was very, very slow. It soon became clear that enforcing Brown v. the Board of Education would require presidential intervention. Eisenhower did not agree with the U.S. Supreme Court’s decision and did not wish to force southern states to integrate their schools. However, as president, he was responsible for doing so. In 1957, Central High School in Little Rock, Arkansas, was forced to accept its first nine African American students, who became known as the Little Rock Nine. In response, Arkansas governor Orval Faubus called out the state National Guard to prevent the students from attending classes, removing the troops only after Eisenhower told him to do so. A subsequent attempt by the nine students to attend school resulted in mob violence. Eisenhower then placed the Arkansas National Guard under federal control and sent the U.S. Army’s 101st airborne unit to escort the students to and from school as well as from class to class ( Figure ). This was the first time since the end of Reconstruction that federal troops once more protected the rights of African Americans in the South. Figure 28.5.4: In 1957, U.S. soldiers from the 101st Airborne were called in to escort the Little Rock Nine into and around formerly all-white Central High School in Little Rock, Arkansas. Throughout the course of the school year, the Little Rock Nine were insulted, harassed, and physically assaulted; nevertheless, they returned to school each day. At the end of the school year, the first African American student graduated from Central High. At the beginning of the 1958–1959 school year, Orval Faubus ordered all Little Rock’s public schools closed. In the opinion of white segregationists, keeping all students out of school was preferable to having them attend integrated schools. In 1959, the U.S. Supreme Court ruled that the school had to be reopened and that the process of desegregation had to proceed.\n\nWHITE RESPONSES Efforts to desegregate public schools led to a backlash among most southern whites. Many greeted the Brown decision with horror; some World War II veterans questioned how the government they had fought for could betray them in such a fashion. Some white parents promptly withdrew their children from public schools and enrolled them in all-white private academies, many newly created for the sole purpose of keeping white children from attending integrated schools. Often, these “academies” held classes in neighbors’ basements or living rooms. Other white southerners turned to state legislatures or courts to solve the problem of school integration. Orders to integrate school districts were routinely challenged in court. When the lawsuits proved unsuccessful, many southern school districts responded by closing all public schools, as Orval Faubus had done after Central High School was integrated. One county in Virginia closed its public schools for five years rather than see them integrated. Besides suing school districts, many southern segregationists filed lawsuits against the NAACP, trying to bankrupt the organization. Many national politicians supported the segregationist efforts. In 1956, ninety-six members of Congress signed “The Southern Manifesto,” in which they accused the U.S. Supreme Court of misusing its power and violating the principle of states’ rights, which maintained that states had rights equal to those of the federal government. Unfortunately, many white southern racists, frightened by challenges to the social order, responded with violence. When Little Rock’s Central High School desegregated, an irate Ku Klux Klansman from a neighboring community sent a letter to the members of the city’s school board in which he denounced them as Communists and threatened to kill them. White rage sometimes erupted into murder. In August 1955, both white and black Americans were shocked by the brutality of the murder of Emmett Till. Till, a fourteen-year-old boy from Chicago, had been vacationing with relatives in Mississippi. While visiting a white-owned store, he had made a remark to the white woman behind the counter. A few days later, the husband and brother-in-law of the woman came to the home of Till’s relatives in the middle of the night and abducted the boy. Till’s beaten and mutilated body was found in a nearby river three days later. Till’s mother insisted on an open-casket funeral; she wished to use her son’s body to reveal the brutality of southern racism. The murder of a child who had been guilty of no more than a casual remark captured the nation’s attention, as did the acquittal of the two men who admitted killing him.\n\nTHE MONTGOMERY BUS BOYCOTT One of those inspired by Till’s death was Rosa Parks, an NAACP member from Montgomery, Alabama, who became the face of the 1955–1956 Montgomery Bus Boycott. City ordinances in Montgomery segregated the city’s buses, forcing African American passengers to ride in the back section. They had to enter through the rear of the bus, could not share seats with white passengers, and, if the front of the bus was full and a white passenger requested an African American’s seat, had to relinquish their place to the white rider. The bus company also refused to hire African American drivers even though most of the people who rode the buses were black. On December 1, 1955, Rosa Parks refused to give her seat to a white man, and the Montgomery police arrested her. After being bailed out of jail, she decided to fight the laws requiring segregation in court. To support her, the Women’s Political Council, a group of African American female activists, organized a boycott of Montgomery’s buses. News of the boycott spread through newspaper notices and by word of mouth; ministers rallied their congregations to support the Women’s Political Council. Their efforts were successful, and forty thousand African American riders did not take the bus on December 5, the first day of the boycott. Other African American leaders within the city embraced the boycott and maintained it beyond December 5, Rosa Parks’ court date. Among them was a young minister named Martin Luther King, Jr. For the next year, black Montgomery residents avoided the city’s buses. Some organized carpools. Others paid for rides in African American-owned taxis, whose drivers reduced their fees. Most walked to and from school, work, and church for 381 days, the duration of the boycott. In June 1956, an Alabama federal court found the segregation ordinance unconstitutional. The city appealed, but the U.S. Supreme Court upheld the decision. The city’s buses were desegregated.\n\nSection Summary After World War II, African American efforts to secure greater civil rights increased across the United States. African American lawyers such as Thurgood Marshall championed cases intended to destroy the Jim Crow system of segregation that had dominated the American South since Reconstruction. The landmark Supreme Court case Brown v. Board of Education prohibited segregation in public schools, but not all school districts integrated willingly, and President Eisenhower had to use the military to desegregate Little Rock’s Central High School. The courts and the federal government did not assist African Americans in asserting their rights in other cases. In Montgomery, Alabama, it was the grassroots efforts of African American citizens who boycotted the city’s bus system that brought about change. Throughout the region, many white southerners made their opposition to these efforts known. Too often, this opposition manifested itself in violence and tragedy, as in the murder of Emmett Till.\n\nReview Questions The NAACP lawyer who became known as “Mr. Civil Rights” was ________. Earl Warren Jackie Robinson Orval Faubus Thurgood Marshall D The Arkansas governor who tried to prevent the integration of Little Rock High School was ________. Charles Hamilton Houston Kenneth Clark OrvalFaubus Clark Clifford C What was the significance of Shelley v. Kraemer? Shelley v. Kraemer held that state courts could not enforce agreements that prevented homeowners from selling to members of particular races. The ruling made it easier for African Americans to purchase houses in neighborhoods of their choosing."}, {"url": "https://openstax.org/books/us-history/pages/28-5-the-african-american-struggle-for-civil-rights", "page_content": "Learning Objectives By the end of this section, you will be able to: Explain how Presidents Truman and Eisenhower addressed civil rights issues\n\nDiscuss efforts by African Americans to end discrimination and segregation\n\nDescribe southern White peoples’ response to the civil rights movement\n\nIn the aftermath of World War II, African Americans began to mount organized resistance to racially discriminatory policies in force throughout much of the United States. In the South, they used a combination of legal challenges and grassroots activism to begin dismantling the racial segregation that had stood for nearly a century following the end of Reconstruction. Community activists and civil rights leaders targeted racially discriminatory housing practices, segregated transportation, and legal requirements that African Americans and White people be educated separately. While many of these challenges were successful, life did not necessarily improve for African Americans. Hostile White people fought these changes in any way they could, including by resorting to violence.\n\nEARLY VICTORIES During World War II, many African Americans had supported the “Double V Campaign,” which called on them to defeat foreign enemies while simultaneously fighting against segregation and discrimination at home. After World War II ended, many returned home to discover that, despite their sacrifices, the United States was not willing to extend them any greater rights than they had enjoyed before the war. Particularly rankling was the fact that although African American veterans were legally entitled to draw benefits under the GI Bill, discriminatory practices prevented them from doing so. For example, many banks would not give them mortgages if they wished to buy homes in predominantly African American neighborhoods, which banks often considered too risky an investment. However, African Americans who attempted to purchase homes in White neighborhoods often found themselves unable to do so because of real estate covenants that prevented owners from selling their property to Black people. Indeed, when a Black family purchased a Levittown house in 1957, they were subjected to harassment and threats of violence. Click and Explore For a look at the experiences of an African American family that tried to move to a White suburban community, view the 1957 documentary Crisis in Levittown. The postwar era, however, saw African Americans make greater use of the courts to defend their rights. In 1944, an African American woman, Irene Morgan, was arrested in Virginia for refusing to give up her seat on an interstate bus and sued to have her conviction overturned. In Morgan v. the Commonwealth of Virginia in 1946, the U.S. Supreme Court ruled that the conviction should be overturned because it violated the interstate commerce clause of the Constitution. This victory emboldened some civil rights activists to launch the Journey of Reconciliation, a bus trip taken by eight African American men and eight White men through the states of the Upper South to test the South’s enforcement of the Morgan decision. Other victories followed. In 1948, in Shelley v. Kraemer, the U.S. Supreme Court held that courts could not enforce real estate covenants that restricted the purchase or sale of property based on race. In 1950, the NAACP brought a case before the U.S. Supreme Court that they hoped would help to undermine the concept of “separate but equal” as espoused in the 1896 decision in Plessy v. Ferguson, which gave legal sanction to segregated school systems. Sweatt v. Painter was a case brought by Heman Marion Sweatt, who sued the University of Texas for denying him admission to its law school because state law prohibited integrated education. Texas attempted to form a separate law school for African Americans only, but in its decision on the case, the U.S. Supreme Court rejected this solution, holding that the separate school provided neither equal facilities nor “intangibles,” such as the ability to form relationships with other future lawyers, that a professional school should provide. Not all efforts to enact desegregation required the use of the courts, however. On April 15, 1947, Jackie Robinson started for the Brooklyn Dodgers, playing first base. He was the first African American to play baseball in the National League, breaking the color barrier. Although African Americans had their own baseball teams in the Negro Leagues, Robinson opened the gates for them to play in direct competition with White players in the major leagues. Other African American athletes also began to challenge the segregation of American sports. At the 1948 Summer Olympics, Alice Coachman, an African American, was the only American woman to take a gold medal in the games (Figure 28.17). These changes, while symbolically significant, were mere cracks in the wall of segregation. Figure 28.17 Baseball legend Jackie Robinson (a) was active in the civil rights movement. He served on the NAACP’s board of directors and helped to found an African American-owned bank. Alice Coachman (b), who competed in track and field at Tuskegee University, was the first Black woman to win an Olympic gold medal.\n\nDESEGREGATION AND INTEGRATION Until 1954, racial segregation in education was not only legal but was required in seventeen states and permissible in several others (Figure 28.18). Utilizing evidence provided in sociological studies conducted by Kenneth Clark and Gunnar Myrdal, however, Thurgood Marshall, then chief counsel for the NAACP, successfully argued the landmark case Brown v. Board of Education of Topeka, Kansas before the U.S. Supreme Court led by Chief Justice Earl Warren. Marshall showed that the practice of segregation in public schools made African American students feel inferior. Even if the facilities provided were equal in nature, the Court noted in its decision, the very fact that some students were separated from others on the basis of their race made segregation unconstitutional. Figure 28.18 This map shows those states in which racial segregation in public education was required by law before the 1954 Brown v. Board of Education decision. In 1960, four years later, fewer than 10 percent of southern African American students attended the same schools as White students. Defining American Thurgood Marshall on Fighting Racism As a law student in 1933, Thurgood Marshall (Figure 28.19) was recruited by his mentor Charles Hamilton Houston to assist in gathering information for the defense of a Black man in Virginia accused of killing two White women. His continued close association with Houston led Marshall to aggressively defend Black people in the court system and to use the courts as the weapon by which equal rights might be extracted from the U.S. Constitution and a White racist system. Houston also suggested that it would be important to establish legal precedents regarding the Plessy v. Ferguson ruling of separate but equal. Figure 28.19 In 1956, NAACP leaders (from left to right) Henry L. Moon, Roy Wilkins, Herbert Hill, and Thurgood Marshall present a new poster in the campaign against southern White racism. Marshall successfully argued the landmark case Brown v. Board of Education (1954) before the U.S. Supreme Court and later became the court’s first African American justice. By 1938, Marshall had become “Mr. Civil Rights” and formally organized the NAACP’s Legal Defense and Education Fund in 1940 to garner the resources to take on cases to break the racist justice system of America. A direct result of Marshall’s energies and commitment was his 1940 victory in a Supreme Court case, Chambers v. Florida, which held that confessions obtained by violence and torture were inadmissible in a court of law. In 1943, he won a case on behalf of Black parents protesting school segregation in suburban Hillburn, New York. His most well-known case was Brown v. Board of Education in 1954, which held that state laws establishing separate public schools for Black and White students were unconstitutional. Later in life, Marshall reflected on his career fighting racism in a speech at Howard Law School in 1978: Be aware of that myth, that everything is going to be all right. Don’t give in. I add that, because it seems to me, that what we need to do today is to refocus. Back in the 30s and 40s, we could go no place but to court. We knew then, the court was not the final solution. Many of us knew the final solution would have to be politics, if for no other reason, politics is cheaper than lawsuits. So now we have both. We have our legal arm, and we have our political arm. Let’s use them both. And don’t listen to this myth that it can be solved by either or that it has already been solved. Take it from me, it has not been solved. When Marshall says that the problems of racism have not been solved, to what was he referring? Plessy v. Fergusson had been overturned. The challenge now was to integrate schools. A year later, the U.S. Supreme Court ordered southern school systems to begin desegregation “with all deliberate speed.” Some school districts voluntarily integrated their schools. For many other districts, however, “deliberate speed” was very, very slow. It soon became clear that enforcing Brown v. the Board of Education would require presidential intervention. Eisenhower did not agree with the U.S. Supreme Court’s decision and did not wish to force southern states to integrate their schools. However, as president, he was responsible for doing so. In 1957, Central High School in Little Rock, Arkansas, was forced to accept its first nine African American students, who became known as the Little Rock Nine. In response, Arkansas governor Orval Faubus called out the state National Guard to prevent the students from attending classes. The soldiers turned away the first student to attempt entry, Elizabeth Eckford, leaving the 15-year-old to be followed and threatened by dozens of White adults. A subsequent attempt by the nine students to attend school resulted in mob violence. Eisenhower then placed the Arkansas National Guard under federal control and sent the U.S. Army’s 101st airborne unit to escort the students to and from school as well as from class to class (Figure 28.20). This was the first time since the end of Reconstruction that federal troops once more protected the rights of African Americans in the South. Figure 28.20 In 1957, U.S. soldiers from the 101st Airborne were called in to escort the Little Rock Nine into and around formerly all-White Central High School in Little Rock, Arkansas. Throughout the course of the school year, the Little Rock Nine were insulted, harassed, and physically assaulted; nevertheless, they returned to school each day. At the end of the school year, the first African American student graduated from Central High. At the beginning of the 1958–1959 school year, Orval Faubus ordered all Little Rock’s public schools closed. In the opinion of White segregationists, keeping all students out of school was preferable to having them attend integrated schools. In 1959, the U.S. Supreme Court ruled that the school had to be reopened and that the process of desegregation had to proceed. School segregation was not only a Southern issue. New York City became a segregation flash point due to significant deficiencies in resources, teacher quality, and services offered to schools serving Black students. In 1957, parent and activist Mae Mallory was the leader of what became known as the Harlem Nine, a group of nine mothers who filed suit and kept their children out of school based on inadequate and unequal education. Mallory and the other mothers asked for an “open transfer” policy that allowed them to send their children to schools outside of their district. City officials and local media fought back by declaring Mallory and her group to be unfit parents, but the Harlem Nine eventually won the right to transfer their children. Most importantly, they forced the local court and the New York City Board of Education to declare that segregation still existed in New York City schools.\n\nWHITE RESPONSES Efforts to desegregate public schools led to a backlash among many White people. Many greeted the Brown decision with horror; some World War II veterans questioned how the government they had fought for could betray them in such a fashion. Some White parents promptly withdrew their children from public schools and enrolled them in all-White private academies, many newly created for the sole purpose of keeping White children from attending integrated schools. Often, these “academies” held classes in neighbors’ basements or living rooms. Other White southerners turned to state legislatures or courts to solve the problem of school integration. Orders to integrate school districts were routinely challenged in court. When the lawsuits proved unsuccessful, many southern school districts responded by closing all public schools, as Orval Faubus had done after Central High School was integrated. One county in Virginia closed its public schools for five years rather than see them integrated. Besides suing school districts, many southern segregationists filed lawsuits against the NAACP, trying to bankrupt the organization. Many national politicians supported the segregationist efforts. In 1956, 101 members of Congress signed “The Southern Manifesto,” in which they accused the U.S. Supreme Court of misusing its power and violating the principle of states’ rights, which maintained that states had rights equal to those of the federal government. Unfortunately, many White southern racists, frightened by challenges to the social order, responded with violence. When Little Rock’s Central High School desegregated, an irate Ku Klux Klansman from a neighboring community sent a letter to the members of the city’s school board in which he denounced them as Communists and threatened to kill them. White rage sometimes erupted into murder. In August 1955, both White and Black Americans were shocked by the brutality of the murder of Emmett Till. Till, a fourteen-year-old boy from Chicago, had been vacationing with relatives in Mississippi. While visiting a White-owned store, he had made a remark to the White woman behind the counter. A few days later, the husband and brother-in-law of the woman came to the home of Till’s relatives in the middle of the night and abducted the boy. Till’s beaten and mutilated body was found in a nearby river three days later. Till’s mother insisted on an open-casket funeral; she wished to use her son’s body to reveal the brutality of southern racism. The murder of a child who had been guilty of no more than a casual remark captured the nation’s attention, as did the acquittal of the two men who admitted killing him."}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/struggle-civil-rights", "page_content": "1 The Struggle for Civil Rights\n\nCivil rights for blacks was not a new idea in the 1960s. African Americans had been struggling for racial justice since slavery was ended following the American Civil War (1861–65). While they had gained their independence and a few social privileges by World War II (1939–45), the war against racist fascists (people who believe in a political philosophy that prefers a dictatorial government with severe economic and social distinctions between citizens, often based on racial differences) in Europe brought the reality of American racism to light. America sent troops to secure freedom in other parts of the world but maintained a segregated (separated by race; in the South, many public buildings and services, such as schools, buses, and lunch counters, had separate facilities for whites and blacks) society that denied basic rights, such as voting, to people based on race.\n\nWorld War II served as the catalyst for the dramatic changes in the 1960s. President Harry S. Truman (1884–1972; served 1945–53)) ended segregation in the armed forces and the federal civil service in 1948. The National Association for the Advancement of Colored People (NAACP) Legal Defense Fund then mounted a series of legal actions that led to the 1954 Brown v. Board of Education Supreme Court ruling, which declared racial segregation in American schools unconstitutional. More protests followed. In 1955, Rosa Parks (1913–) triggered the Montgomery, Alabama, bus boycott, a protest against racial discrimination on the local bus service that lasted more than a year and helped to make Martin Luther King Jr. (1929–1968) a civil rights leader. King and other ministers, thrilled with the results of their efforts, formed the Southern Christian Leadership Conference (SCLC) in 1957 to spread their message of nonviolent protest against segregation.\n\nAs blacks won these and other smaller civil rights victories, some Americans, especially white southerners, threatened to resist the integration of blacks into white society. Southern politicians spoke out against the end of segregation and tried to resist federal court rulings that required mixing races in schools, on public transportation, and elsewhere. Membership in violent organizations such as the Ku Klux Klan, a white supremacist group, boomed. News of these organizations' frightening raids intended to intimidate and harm blacks permeated American society. Tensions grew between supporters and opponents of civil rights for African Americans.\n\nThe 1960s opened with four black college students sitting down at a whites-only lunch counter in North Carolina and refusing to budge until they could buy a cup of coffee. Within months, tens of thousands of student protestors organized \"sit-in\" demonstrations throughout the South to protest racial segregation. Their actions led to the founding of the Student Non-Violent Coordinating Committee (SNCC) in 1960. These nonviolent, mass protests were often met with violent reaction. Protestors were sometimes brutally beaten and terrorized. One of the most violent clashes occurred in Birmingham, Alabama, in 1961. There members of the Ku Klux Klan attacked a bus filled with a racially mixed group of men and women calling themselves \"freedom riders\" who were attempting to travel from Washington, D.C., to Alabama in protest of white southerners' refusal to end segregation of interstate bus and train travel. In the coming years, more and more protestors were harmed as they worked to win civil rights legislation. In 1963 television news programs and newspapers publicized the police attack of nonviolent protestors, including many schoolchildren, in Birmingham, Alabama. The protestors were beaten with clubs, sprayed with fire hoses, and attacked by police dogs.\n\nAs it became clear that enduring civil rights victories required both federally mandated legal protections and government enforcement—not just isolated protests of segregated schools, buses, and lunch counters—civil rights supporters debated how to best meet their goals. Could they affect a dramatic change in the government with peaceful methods or would they need to carry out acts of violence? Several different strategies for victory emerged, splitting civil rights activists into groups of peaceful and militant protestors.\n\nThe documents selected for this chapter offer a peek into the tensions over civil rights during the 1960s. In his inaugural speech on January 13, 1964, Alabama governor George C. Wallace promised segregation \"forever.\" His speech affected whites living in the state much differently than it affected Alabama blacks without the right to vote. The various strategies for winning civil rights are represented here with speeches from Martin Luther King Jr. and Malcolm X (1925–1965). Martin Luther King Jr. maintained throughout his life that nonviolent protest was the only political strategy worth pursuing. In his last speech to the SCLC on August 16, 1967, published as \"Where Do We Go From Here?,\" King assessed a decade of various types of protest and reconfirmed his commitment to nonviolence. Nonviolent strategies frustrated some activists, including Malcolm X, and in the early 1960s Malcolm X outlined a different philosophy for success. In his April 3, 1964 speech, \"The Ballot or the Bullet,\" given in Cleveland, Ohio, Malcolm X described when civil rights activism should shift from nonviolence to determined violent protest.\n\nThe struggle between advocates for and against violence within the civil rights movement is highlighted with the organizing documents of the Student Nonviolent Coordinating Committee (SNCC). In its position paper of 1966, the SNCC offered a description of the roots of the civil rights problem and hopes for the future. This organization, which had opened the decade with a firm commitment to nonviolence, had shifted its view dramatically by 1966. Each in its own way, the diverse civil rights philosophies presented here helped to shape the decade and to change the lives of Americans forever."}, {"url": "https://www.britannica.com/event/Civil-Rights-Act-United-States-1964", "page_content": "Civil Rights Act, (1964), comprehensive U.S. legislation intended to end discrimination based on race, colour, religion, or national origin. It is often called the most important U.S. law on civil rights since Reconstruction (1865–77) and is a hallmark of the American civil rights movement. Title I of the act guarantees equal voting rights by removing registration requirements and procedures biased against minorities and the underprivileged. Title II prohibits segregation or discrimination in places of public accommodation involved in interstate commerce. Title VII bans discrimination by trade unions, schools, or employers involved in interstate commerce or doing business with the federal government. The latter section also applies to discrimination on the basis of sex and established a government agency, the Equal Employment Opportunity Commission (EEOC), to enforce these provisions. In 2020 the U.S. Supreme Court ruled that firing an employee for being gay, lesbian, or transgender is illegal under Title VII’s prohibition of sex discrimination (Bostock v. Clayton County, Georgia). The act also calls for the desegregation of public schools (Title IV), broadens the duties of the Civil Rights Commission (Title V), and assures nondiscrimination in the distribution of funds under federally assisted programs (Title VI).\n\nThe Civil Rights Act was a highly controversial issue in the United States as soon as it was proposed by Pres. John F. Kennedy in 1963. Although Kennedy was unable to secure passage of the bill in Congress, a stronger version was eventually passed with the urging of his successor, Pres. Lyndon B. Johnson, who signed the bill into law on July 2, 1964, following one of the longest debates in Senate history. White groups opposed to integration with African Americans responded to the act with a significant backlash that took the form of protests, increased support for pro-segregation candidates for public office, and some racial violence. The constitutionality of the act was immediately challenged and was upheld by the Supreme Court in the test case Heart of Atlanta Motel v. U.S. (1964). The act gave federal law enforcement agencies the power to prevent racial discrimination in employment, voting, and the use of public facilities.\n\nThe 50th anniversary of the act was celebrated in April 2014 with an event at the Lyndon B. Johnson Presidential Library in Austin, Texas. Speakers included U.S. Pres. Barack Obama and former presidents Jimmy Carter, Bill Clinton, and George W. Bush. The U.S. Congress marked the anniversary by posthumously awarding the Congressional Gold Medal to civil rights leaders Martin Luther King, Jr., and Coretta Scott King."}, {"url": "https://www.britannica.com/event/American-civil-rights-movement", "page_content": "Examples of civil rights include the right to vote, the right to a fair trial, the right to government services, the right to a public education, and the right to use public facilities.\n\nMartin Luther King, Jr. , was an important leader of the civil rights movement. Rosa Parks , who refused to give up her seat on a public bus to a white customer, was also important. John Lewis , a civil rights leader and politician, helped plan the March on Washington .\n\nThe American civil rights movement started in the mid-1950s. A major catalyst in the push for civil rights was in December 1955, when NAACP activist Rosa Parks refused to give up her seat on a public bus to a white man.\n\nAmerican civil rights movement , mass protest movement against racial segregation and discrimination in the southern United States that came to national prominence during the mid-1950s. This movement had its roots in the centuries-long efforts of enslaved Africans and their descendants to resist racial oppression and abolish the institution of slavery . Although enslaved people were emancipated as a result of the American Civil War and were then granted basic civil rights through the passage of the Fourteenth and Fifteenth amendments to the U.S. Constitution , struggles to secure federal protection of these rights continued during the next century. Through nonviolent protest, the civil rights movement of the 1950s and ’60s broke the pattern of public facilities’ being segregated by “race” in the South and achieved the most important breakthrough in equal-rights legislation for African Americans since the Reconstruction period (1865–77). Although the passage in 1964 and 1965 of major civil rights legislation was victorious for the movement, by then militant Black activists had begun to see their struggle as a freedom or liberation movement not just seeking civil rights reforms but instead confronting the enduring economic, political, and cultural consequences of past racial oppression.\n\nAbolitionism to Jim Crow\n\nAmerican history has been marked by persistent and determined efforts to expand the scope and inclusiveness of civil rights. Although equal rights for all were affirmed in the founding documents of the United States, many of the new country’s inhabitants were denied essential rights. Enslaved Africans and indentured servants did not have the inalienable right to “life, liberty, and the pursuit of happiness” that British colonists asserted to justify their Declaration of Independence. Nor were they included among the “People of the United States” who established the Constitution in order to “promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity.” Instead, the Constitution protected slavery by allowing the importation of enslaved persons until 1808 and providing for the return of enslaved people who had escaped to other states.\n\nAs the United States expanded its boundaries, Native American peoples resisted conquest and absorption. Individual states, which determined most of the rights of American citizens, generally limited voting rights to white property-owning males, and other rights—such as the right to own land or serve on juries—were often denied on the basis of racial or gender distinctions. A small proportion of Black Americans lived outside the slave system, but those so-called “free Blacks” endured racial discrimination and enforced segregation. Although some enslaved persons violently rebelled against their enslavement (see slave rebellions), African Americans and other subordinated groups mainly used nonviolent means—protests, legal challenges, pleas and petitions addressed to government officials, as well as sustained and massive civil rights movements—to achieve gradual improvements in their status.\n\nBritannica Quiz Pop Quiz: 15 Things to Know About Martin Luther King, Jr.\n\nDuring the first half of the 19th century, movements to extend voting rights to non-property-owning white male labourers resulted in the elimination of most property qualifications for voting, but this expansion of suffrage was accompanied by brutal suppression of American Indians and increasing restrictions on free Blacks. Owners of enslaved people in the South reacted to the 1831 Nat Turner slave revolt in Virginia by passing laws to discourage antislavery activism and prevent the teaching of enslaved people to read and write. Despite this repression, a growing number of Black Americans freed themselves from slavery by escaping or negotiating agreements to purchase their freedom through wage labour. By the 1830s, free Black communities in the Northern states had become sufficiently large and organized to hold regular national conventions, where Black leaders gathered to discuss alternative strategies of racial advancement. In 1833 a small minority of whites joined with Black antislavery activists to form the American Anti-Slavery Society under the leadership of William Lloyd Garrison.\n\nFrederick Douglass became the most famous of the formerly enslaved persons who joined the abolition movement. His autobiography—one of many slave narratives—and his stirring orations heightened public awareness of the horrors of slavery. Although Black leaders became increasingly militant in their attacks against slavery and other forms of racial oppression, their efforts to secure equal rights received a major setback in 1857, when the U.S. Supreme Court rejected African American citizenship claims. The Dred Scott decision stated that the country’s founders had viewed Blacks as so inferior that they had “no rights which the white man was bound to respect.” This ruling—by declaring unconstitutional the Missouri Compromise (1820), through which Congress had limited the expansion of slavery into western territories—ironically strengthened the antislavery movement, because it angered many whites who did not hold enslaved people. The inability of the country’s political leaders to resolve that dispute fueled the successful presidential campaign of Abraham Lincoln, the candidate of the antislavery Republican Party. Lincoln’s victory in turn prompted the Southern slave states to secede and form the Confederate States of America in 1860–61.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nAlthough Lincoln did not initially seek to abolish slavery, his determination to punish the rebellious states and his increasing reliance on Black soldiers in the Union army prompted him to issue the Emancipation Proclamation (1863) to deprive the Confederacy of its enslaved property. After the American Civil War ended, Republican leaders cemented the Union victory by gaining the ratification of constitutional amendments to abolish slavery (Thirteenth Amendment) and to protect the legal equality of formerly enslaved persons (Fourteenth Amendment) and the voting rights of male ex-slaves (Fifteenth Amendment). Despite those constitutional guarantees of rights, almost a century of civil rights agitation and litigation would be required to bring about consistent federal enforcement of those rights in the former Confederate states. Moreover, after federal military forces were removed from the South at the end of Reconstruction, white leaders in the region enacted new laws to strengthen the “Jim Crow” system of racial segregation and discrimination. In its Plessy v. Ferguson decision (1896), the Supreme Court ruled that “separate but equal” facilities for African Americans did not violate the Fourteenth Amendment, ignoring evidence that the facilities for Blacks were inferior to those intended for whites.\n\nThe Southern system of white supremacy was accompanied by the expansion of European and American imperial control over nonwhite people in Africa and Asia as well as in island countries of the Pacific and Caribbean regions. Like African Americans, most nonwhite people throughout the world were colonized or economically exploited and denied basic rights, such as the right to vote. With few exceptions, women of all races everywhere were also denied suffrage rights (see woman suffrage)."}, {"url": "https://archive.org/details/radiostrugglefor0000ward", "page_content": "xvi, 437 p. : 24 cm\n\n\n\nIncludes bibliographical references (p. [399]-413) and index\n\n\n\nIntroduction : dials set to freedom -- An uphill battle : network radio, local radio, and the roots of racial change -- Goodwill radio : labor, liberals, and the search for interracial understanding -- Respectability, religion, and rhythm and blues on Black-oriented radio -- A Dixie dilemma : racially progressive radio in the age of massive resistance -- Edwin T. Randall and friendly world broadcasting : radio and white racial liberalism in the age of mass protest -- Black-oriented radio and the Southern civil rights movement -- WENN's push came to shove : Black-oriented radio and the freedom struggle in Birmingham -- Ample and frequent moderation : radio and race relations in Charlotte -- A telling silence : freedom radio in Mississippi -- The quest for Black power in Southern radio -- Riots, respect, and responsibility : radio in the new South -- Conclusion : radio and the Southern freedom struggle\n\nAccess-restricted-item true Addeddate 2020-01-21 18:02:13 Boxid IA1765701 Camera Sony Alpha-A6300 (Control) Collection_set printdisabled External-identifier urn:oclc:record:1151066089\n\nurn:lcp:radiostrugglefor0000ward:lcpdf:11c9253a-eef0-4e43-8d3c-82fe27f51cd1\n\nurn:lcp:radiostrugglefor0000ward:epub:127e44c0-bc75-4d06-b608-12e398223e3e Foldoutcount 0 Identifier radiostrugglefor0000ward Identifier-ark ark:/13960/t4gn6mr0c Invoice 1652 Isbn 0813027292 Lccn 2004043736 Ocr_converted abbyy-to-hocr 1.1.20 Ocr_module_version 0.0.17 Old_pallet IA11731 Openlibrary_edition OL3303032M Openlibrary_work OL2725111W Page_number_confidence 92.37 Pages 474 Ppi 300 Republisher_date 20200121210634 Republisher_operator associate-rosie-allanic@archive.org Republisher_time 447 Scandate 20200121024514 Scanner station13.cebu.archive.org Scanningcenter cebu Scribe3_search_catalog isbn Scribe3_search_id 9780813027296 Tts_version 3.2-rc-2-g0d7c1ed Show More Show Less\n\nFull catalog record MARCXML"}, {"url": "https://time.com/5850623/malcolm-x-human-rights/", "page_content": "As people across the globe take to the streets to demand justice in the wake of George Floyd’s killing, the case against the four now-former Minneapolis police officers involved in his death has already begun: Derek Chauvin, the white officer who pressed his knee to Floyd’s neck for nearly nine minutes, has been charged with second-degree murder, and the three other officers present with aiding and abetting. But lawyers representing the Floyd family, S. Lee Merritt and Benjamin Crump, aren’t looking only to the U.S. criminal-justice system. They have announced that they also plan to take the matter to the United Nations Human Rights Council.\n\nMerritt and Crump also represent the families of two other African Americans who deaths have shocked the public in recent weeks—Breonna Taylor and Ahmaud Arbery—and have in the past worked on other high-profile homicide cases involving police brutality, such as Eric Garner and Michael Brown. And this isn’t the first time their clients have gone to the U.N.: in 2014, Michael Brown’s parents gave heart-wrenching testimony before the United Nations Committee Against Torture, in Geneva. That same year, the office of the Commissioner on Human Rights announced that the Garner and Brown cases “have added to our existing concerns over the longstanding prevalence of racial discrimination faced by African-Americans, particularly in relation to access to justice and discriminatory police practices.”\n\nAs Merritt and Crump approach the U.N., the involvement of the international community draws attention to a tension that has existed for more than half a century within the movement for African American rights. For much of the history of the Black Freedom Struggle in the United States, civic leaders and politicians used the term civil rights to characterize the objective of the movement to gain equal rights in this country; the period to which the current moment has been compared is known as the civil rights movement. But not everyone at that time thought that civil rights were the goal.\n\nMalcolm X — who abandoned the philosophy of Black Nationalism in favor of the more inclusive Internationalism, a philosophy that aimed to encourage allyship with oppressed people globally — admonished black Americans in the mid-1960s to abandon the domestic agenda for civil rights in favor of an international agenda for human rights. In fact, this effort has been called the “unfinished work of Malcolm X,” which came to a tragic halt when he was assassinated on Feb. 21, 1965. The problem with civil rights, Malcolm argued, was that such a framing defined the matter as a domestic issue, focused on guaranteeing African Americans equal access to the rights of U.S. citizens. In his view, that limited the potential of the movement and left black people at the mercy of a government that had ignored its pleas for equality since the post-Civil War era.\n\nMalcolm X was no stranger to police brutality. In Malcolm X: A Life of Reinvention, Manning Marable recalls a notorious incident involving Los Angeles police and the Nation of Islam (NOI) in 1962, which reads like a story ripped from today’s headlines. On April 27, 1962, while members of the Nation were delivering clothes from the dry cleaner to their mosque, two white police officers who were on a stake-out approached the men, believing the clothes were stolen. The details are murky on what followed. After some pushing and shoving and a call for back up, which bought at least 70 additional officers to the scene, the mosque was raided. What is clear is that 15 minutes later when the dust was settled, “seven Muslims were shot,” Marable explains. They included Ronald Stokes, a Korean War vet who was fatally shot from behind while trying to surrender. Less than a month later, Malcolm X delivered a blistering speech against L.A. city officials for their willingness to tolerate police brutality.\n\nGet your history fix in one place: sign up for the weekly TIME History newsletter\n\nBy 1964, Malcolm X had split with his spiritual mentor Elijah Muhammad and NOI to launch what he called the Organization of Afro-American Unity, with a rallying cry for black people to set their differences aside for the common goal of Black Liberation. In his classic speech “The Ballot or the Bullet”—delivered twice, on April 3 and 12, 1964, less than a year before he was assassinated at the Audubon Ballroom in Harlem—he channeled the sentiments of Revolutionary War patriot and slave owner Patrick Henry who in 1775, ironically, cried, “give me liberty or give me death.” Malcolm echoed these sentiments nearly 200 years later when he stated in the second iteration of the speech, “It’s the ballot or the bullet. It’s liberty or it’s death. It’s freedom for everybody or freedom for nobody.”\n\nAt the conclusion of this speech, Malcolm admonished black Americans to approach their freedom struggle from an international viewpoint, which would reframe the struggle as one not for civil rights but human rights, for which they would be entitled to seek the aid of the international community. “When you expand the civil-rights struggle to the level of human rights,” he stated on April 3, “you can then take the case of the black man in this country before the nations in the U.N.” He also explained how he saw the difference between civil rights and human rights:\n\nYou can take Uncle Sam before a world court. But the only level you can do it on is the level of human rights. Civil rights keeps you under his restrictions, under his jurisdiction. Civil rights keeps you in his pocket. Civil rights means you’re asking Uncle Sam to treat you right. Human rights are something you were born with. Human rights are your God-given rights. Human rights are the rights that are recognized by all nations of this earth. And any time anyone violates your human rights, you can take them to the world court.\n\nHis focus on human rights, however, didn’t mean he had given up on the possibility of winning civil equality within the United States. In fact, Malcolm believed that, while revolutions have historically been bloody, the U. S. was uniquely positioned for a revolution devoid of bloodshed, “[Today],” he stated, “this country can become involved in a revolution that won’t take bloodshed. All she’s got to do is give the black man in this country everything that’s due him, everything.”\n\nMalcolm X, whose political philosophy of freedom was underscored by the mantra “by any means necessary,” called for a revolution that would overthrow the system of white supremacy rather than integrate blacks into it. Even so, like Martin Luther King Jr., Malcolm believed that such a revolution could be achieved through nonviolent means. While he believed black people had a right to defend themselves if attacked, he counseled white America to listen to King rather than face the alternative.\n\nJust the month before this speech, Malcolm X and Dr, Martin Luther King Jr. had met for the first and only time. The two men were on Capitol Hill to attend a senate hearing on school segregation and employment discrimination. Malcolm, who had attempted on several occasions to reach out to King and had conversed extensively with King’s wife Coretta, approached the Southern minister with his hand outstretched. While cameras flashed as the two men greeted each other, Malcolm expressed his desire to be more involved with King’s movement. “I am throwing myself into the heart of the civil rights struggle,” he told King. He clarified his intent further in his speech the following month: “We have injected ourselves into the civil rights struggle,” he stated, “and we intend to expand it from the level of civil rights to the level of human rights.”\n\nToday, as black America is still pressed under the weight of white supremacy and violence, including extrajudicial killings, that struggle continues. With a new generation embracing Malcolm X’s idea that human rights is the path to black liberation, the work of expanding the struggle continues too.\n\nHistorians’ perspectives on how the past informs the present\n\nArica L. Coleman is a scholar of U.S. history and the author of That the Blood Stay Pure: African Americans, Native Americans and the Predicament of Race and Identity in Virginia and a former chair of the Committee on the Status of African American, Latino/a, Asian American, and Native American (ALANA) Historians and ALANA Histories at the Organization of American Historians.\n\nCorrection, June 18\n\nThe original version of this story misstated the current name of a United Nations human rights body. It is now called the U.N. Human Rights Council, not the U.N. Human Rights Commission.\n\nContact us at letters@time.com."}, {"url": "https://www.cambridge.org/core/journals/journal-of-american-studies/article/raymond-arsenault-freedom-riders-1961-and-the-struggle-for-racial-justice-new-york-oxford-university-press-2006-1999-pp-526-isbn0-19-513674-8/50AF18D95413CD31D9E46BC23FCFD2B4", "page_content": "The Freedom Rides were a grass-roots revolution, a physical and psychological journey during 1961 into the heart of a southern racial darkness; their fundamental sociocultural effect was a lesson in the human condition and the nature of historical agency. Raymond Arsenault deftly illustrates the complex history of segregation and discrimination, and, most importantly, successfully relates the often very personal and exceedingly distressing moments in the lives of individual Riders, as many of the photographs attest.\n\nArsenault begins in the 1940s, with the Journey of Reconciliation, thus introducing the principle concept of nonviolent activism, or Gandhianism. The Irene Morgan case (1944) similarly locates the reader amid the legal and political issues of segregated transport in the South. From this, diverse groups form a rather fragmented mid-century movement that involves Jim Farmer's CORE, Martin Luther King's SCLC and the NAACP. Arsenault makes their various importance and impact comprehensible to readers hitherto unversed in black civil rights.\n\nWe textually and emotionally traverse time with Freedom Riders, we witness the lack of political and federal intervention, Arsenault moving confidently and chronologically, as bombings and beatings prevail in Alabama; the Riders' necessary flight emphasizing the brutality faced by both black and white activists. Externally, the movement struggles to remain intact amid a political atmosphere of Cold War culture, Kennedy focussing more intently outside America rather than concentrating on the conflict within.\n\nWith CORE in disarray and constitutional rights ignored, amid mass demonstrations, arrests and government attempts to halt student activists, the Riders surge into the South. Again, the savagery is deplorable as belated federal intervention allows stubborn state control to reign supreme. However, from this seemingly insurmountable situation, the movement unifies with a mass meeting involving such leaders as Abernathy, Shuttlesworth and King. Arsenault details the unremitting rides, juxtaposing them against the polarization of southern extremists, and portrays the continual hope of a civil rights movement in all its diversity – its political, social and religious equality that sometimes affected internal dynamics. The movement becomes one of shifting perspectives, one that allows mutual respect between individuals who would not have otherwise united.\n\nThis exceptionally well-documented and annotated book ends as it began, with Irene Morgan, leading the reader to feel they have taken a personal journey through the legends and exploits of the Freedom Riders. Through them Arsenault candidly details a mid-century expansion of the realm of the possible in American political and social insurgency, the Freedom Riders redefining the limits of dissent, of escalating demands and rising expectations in the 1960s and beyond."}], "Rudy Fernandez was a key figure in the Chicano Movement of the 1960s and 1970s.": [{"url": "https://www.history.com/news/chicano-movement", "page_content": "In the 1960s, a radicalized Mexican-American movement began pushing for a new identification. The Chicano Movement, aka El Movimiento, advocated social and political empowerment through a chicanismo or cultural nationalism.\n\nAs the activist Rodolfo “Corky” Gonzales declared in a 1967 poem, “La raza! / Méjicano! / Español! / Latino! / Chicano! / Or whatever I call myself, / I look the same.”\n\nDenver Post via Getty Images Rodolfo \"Corky\" Gonzales speaking outside a police building to members of his organization, the Crusade for Justice, 1969.\n\nLeading up to the 1960s, Mexican-Americans had endured decades of discrimination in the U.S. West and Southwest. After the Treaty of Guadalupe Hidalgo put an end to the Mexican-American War in 1848, Mexicans who chose to remain on territory ceded to the United States were promised citizenship and “the right to their property, language and culture.”\n\nBut in most cases, Mexicans in America––those who later immigrated and those who lived in regions where the U.S. border shifted over––found themselves living as second-class citizens. Land grants promised after the Mexican-American War were denied by the U.S. government, impoverishing many land-grant descendants in the area.\n\nREAD MORE: Hispanic Heritage: Full Coverage\n\nNot White, But ‘Chicano’\n\nThroughout the early 20th century, many Mexican-Americans attempted to assimilate and even filed legal cases to push for their community to be recognized as a class of white Americans, so they could gain civil rights. But by the late 1960s, those in the Chicano Movement abandoned efforts to blend in and actively embraced their full heritage.\n\nBy adopting “Chicano” or “Xicano,” activists took on a name that had long been a racial slur—and wore it with pride. And instead of only recognizing their Spanish or European background, Chicanos now also celebrated their Indigenous and African roots.\n\nLeaders in the movement pushed for change in multiple parts of American society, from labor rights to education reform to land reclamation. As University of Minnesota Chicano & Latino Studies professor Jimmy C. Patino Jr. says, the Chicano Movement became known as “a movement of movements.” “There were lots of different issues,” he says, “and the farmworker issue probably was the beginning.”\n\nChávez Leads Fight for Farmworkers’ Rights\n\nArthur Schatz/The LIFE Picture Collection via Getty Images UFW co-founders Dolores Huerta and Cesar Chavez, 1968.\n\nCésar Chávez and Dolores Huerta co-founded the National Farm Workers Association, which later became United Farm Workers (UFW) in California to fight for improved social and economic conditions. Chavez, who was born into a Mexican-American migrant farmworker family, had experienced the grueling conditions of the farmworker first-hand.\n\nIn September 1965, Chávez lent his voice to a strike for grape workers, organized by the Agricultural Workers Organizing Committee (AWOC), a predominantly Filipino labor organization. With the help of Chávez’s advocacy and Huerta’s tough negotiating skills, as well as the persistent hard work of Filipino-American organizer, Larry Itliong, the union won several victories for workers when growers signed contracts with the union.\n\n“We are men and women who have suffered and endured much and not only because of our abject poverty but because we have been kept poor,” Chávez wrote in his 1969 “Letter from Delano.” “The color of our skins, the languages of our cultural and native origins, the lack of formal education, the exclusion from the democratic process, the numbers of our slain in recent wars—all these burdens generation after generation have sought to demoralize us, we are not agricultural implements or rented slaves, we are men.”\n\nREAD MORE: When Millions of Americans Stopped Eating Grapes in Support of Farm Workers\n\nTijerina and the Push for Land Reclamation\n\nDuane Howell/The Denver Post via Getty Images Reies Lopez Tijerina, circa 1968.\n\nNext to labor, the land itself held important economic and spiritual significance among Chicanos, according to Patino. And civil rights activist Reies López Tijerina led the push to reclaim land confiscated by anglo settlers in violation of the 1848 Treaty of Guadalupe Hidalgo.\n\nTijerina, who grew up in Texas working in the fields as young as age 4, founded La Alianza Federal de Mercedes (the Federal Land Grant Alliance) in 1953 and became known as “King Tiger” and “the Malcolm X of the Chicano Movement.” His group held protests and even staged an armed raid on a small town in New Mexico, trying to reconquer properties for the Chicano community.\n\nWhile efforts to repatriate land got caught up in the courts, Patino says, “it had this big effect in terms of mobilizing young people to understand the ways the U.S. took land from Mexico—and from Mexican landowners in particular—and how this kind of empire-building was how Mexicans became part of the U.S.”\n\nStudent Movement Embraces ‘Aztlán’\n\nUniversal History Archive/Getty Images The Aztec 'Codex Azcatitlan,' written between the mid-16th and 17th centuries, detailing the history of the Mexica from their migration from Aztlán to the Spanish conquest of Mexico and Christianization.\n\nMeanwhile, a parallel effort, led by poet and activist Rodolfo “Corky” Gonzales, organized Mexican-American students across the country. In a March 1969 gathering, some 1,500 attended the National Youth and Liberation Conference in Denver, Colorado. At the conference, the students looked to their indigenous ancestors of the Aztec Empire and identified a land called “Aztlán.”\n\nIn Aztec folklore, Aztlán was believed to have extended across northern Mexico and possibly farther north into what is now the U.S. southwest. The students embraced the concept of Aztlán as a spiritual homeland and drafted El Plan Espiritual De Aztlán as their manifesto for mass mobilization and organization.\n\nUltimately, the Chicano Movement won many reforms: The creation of bilingual and bicultural programs in the southwest, improved conditions for migrant workers, the hiring of Chicano teachers, and more Mexican-Americans serving as elected officials.\n\n“A key term in Chicano Movement activism was self-determination,” says Patino, “the idea that Chicanos were a nation within a nation that had the right to self-determine their own future and really their own decisions in their own neighborhood, in their own barrios.”"}, {"url": "https://prologue.blogs.archives.gov/2021/09/23/el-movimiento-the-chicano-movement-and-hispanic-identity-in-the-united-states/", "page_content": "It’s National Hispanic Heritage Month. Visit the National Archives website for resources on related records and how we are commemorating the month. Today’s post comes from Thomas Richardson, an archives technician at the National Personnel Records Center in St. Louis, Missouri.\n\nSocial, economic, cultural, and political change was widespread in the 1960s, fueled by evolving norms, breaking traditions, and protesting inequality at all levels of society. A host of grassroots movements and organizations formed in the U.S. during these years with varying missions: racial equality and desegregation, labor rights, gender equality, anti-war, and political inequality.\n\nThe Hispanic community embarked on a social movement aimed at combating institutional racism, increasing cultural hegemony, and guaranteeing equal labor and political rights. The Chicano Movement sparked national conversations on the political and social autonomy of Hispanic groups everywhere in the United States. Similar to many civil rights and revolutionary movements in the 1960s, they also experienced heavy state surveillance and police brutality. They also produced nationally recognized personalities who came to symbolize the movement such as Cesar Chavez, Dolores Huerta, and Rosalio Munoz.\n\nThe post–World War II years saw a significant rise in political and social activism in the Hispanic community, particularly on the West Coast. Rights for farm workers and education were the primary focus due to severe discrimination that Hispanic laborers faced daily. Hispanic children faced many of the similar prejudices as Black children with segregated schools. A pair of landmark legal cases were major boosts to the Hispanic community.\n\nIn 1947, a pivotal federal court case, Mendez v. Westminster, struck down segregation between White and Mexican schools in California. This decision had widespread repercussions as it was cited in the famous Brown v. Board of Education case. Seven years later in 1954, in Hernandez v. Texas, the U.S. Supreme Court ruled that Mexican American and all other nationality groups were guaranteed equal protection according to the 14th Amendment. The justices ruled unanimously in favor of Hernandez by claiming he had been discriminated against by investigating the racial segregation that existed against Mexicans.\n\nThe Chicano Movement had several components that sought to increase Hispanic equality. Led by Cesar Chavez, one of the most famous goals was the unionization of farmworkers. In 1962, with Dolores Huerta, Chavez co-founded the National Farm Workers Association, which later reorganized to become the United Farm Workers labor union. Chavez, Huerta, and other civic leaders made enormous progress in collectivizing farm laborers and helping them register to vote. In 1965, Chaves and Huerta organized the Delano grape strike; the longest strike in U.S. history, lasting from September 1965 to July 1970.\n\nCivil rights was a hallmark of the Chicano Movement with the goal of empowering the Hispanic community to take part in civil discourse. In the early 1950s and 60s, the Community Service Organization (CSO) was created and helped to register thousands of Mexican-Americans and drive them to polling places on election days. The CSO was absolutely pivotal for the Chicano Movement as it provided civic education and organizing methods for individuals like Huerta and Chavez.\n\nUFW pickets the Jewel Food Store, August 1973. (National Archives Identifier 551939)\n\nPolitical participation made the Hispanic community a powerful voting bloc in national elections in the coming years as a result of the work by the CSO and its leaders. Organization among Hispanic students was also widespread among the Chicano Movement. College student groups like the Mexican American Youth Organization (MAYO) and United Mexican American Students (UMAS) formed to combat institutional racism and discrimination at campuses. Voter registration, educational equality, and labor rights were the focus of student organizations like these.\n\nIn early March 1968, the greatest demonstration against education inequality took place in East Los Angeles as thousands of students walked out to protest discrepancies in the district. Over 10,000 students left to protest and formed the Educational Issues Coordinating Committee (EICC). Demands to the Los Angeles Board of Education included recommendations for bilingual education and hiring of Mexican American administrators. This mass demonstration against Hispanic racism sparked a national conversation on race relations in California, but it also labeled Chicano leaders as radical and militant according to FBI internal memos by J. Edgar Hoover.\n\nFreddie Resendez rallies students at Lincoln High School, 1968 East LA Chicano Walk Outs. (Los Angeles Times)\n\nAs the 1960s progressed and the war in Vietnam intensified, broad anti-war sentiment grew in Hispanic communities. A disproportionate number of Latino draftees were sent overseas, and many were opposed to the conduct of the war. In November 1969, the Chicano Moratorium was formed with the purpose of building a broad anti-war coalition and protesting the draft. Notable activists like Rosalio Munoz publicly avoided the draft, and organizations like the Brown Berets drew inspiration from the Black Panthers in demonstrating against the war.\n\nProtests were held all over the American Southwest, and on August 29, 1970, the largest moratorium occurred in Los Angeles. Over 30,000 protesters led by activist Rosalio Munoz turned out to demonstrate against the Vietnam War, but it quickly became violent. Local police tried to break up the gathering, and when gunshots were fired, fights broke out, leaving four people dead and dozens more injured. Notable LA Times journalist and civil rights activist Ruben Salazar was killed during the Moratorium when a tear gas canister hit him. (See more: Class Litigation Case Files, the 1970 murder of Chicano journalist Ruben Salazar, file 144-12C-245, NAID 603432)\n\nUnbeknownst to many in the Chicano Movement, the federal government surveilled members and leaders of Hispanic groups. They were monitored for potential terrorist activities and, in some cases, acted as agent provocateurs undermining the movement’s cause. The controversial FBI program COINTELPRO heavily infiltrated Chicano groups, along with other political organizations such as Black Power, American Indian Movement, and numerous feminist and animal rights groups. Munoz was one of those who was forcibly removed by undercover agents in 1970 but later returned to run the Moratorium.\n\nDolores Huerta and Jill Biden at an Department of Labor event featuring the renaming of the Department’s auditorium as the Cesar Chavez Memorial Auditorium, 3/26/2012. (National Archives Identifier 55127151)\n\nThe legacy of El Movimiento has empowered many in the Hispanic community to become civically active and take part in national conversations. The Mexican American Legal Defense and Education Fund protects civils through nonprofit legal work and the United Farm Workers Union actively engages in reforming labor rights in agriculture. Civil rights leaders and activists from years before laid the groundwork for the collective Hispanic identity today and empowered millions of Hispanic peoples to exercise their rights.\n\nFor more information on the COINTELPRO activities, visit the Record Group 65 (Records of the Federal Bureau of Investigation) under Classification 157; Extremist Matters, Civil Unrest."}, {"url": "https://www.facinghistory.org/resource-library/background-chicano-movement", "page_content": "The following excerpts from the introduction of The Chicano Movement: Perspectives from the Twenty-First Century, edited by Mario T. Garcia, provide historical context on the Chicano Movement.\n\nThe Chicano Movement was the largest and most widespread civil rights and empowerment movement by Mexican-descent people in the United States. The key years of the movement are between 1965 and 1975 . . . Why begin in 1965? That year marked the beginning of the famous grape strike in California’s Central Valley (San Joaquin Valley) led by César Chávez, Dolores Huerta, and the farm workers to establish a union for farm workers that would not only bring them much-deserved wage and benefit increases, but a sense of dignity for their labor and for themselves.\n\nThe Chicano Movement was characterized at one level by the continuation of a longer civil rights movement, led initially by what I call the Mexcian American Generation of the 1930s through the 1950s that initiated the first major civil rights movement by Mexican Americans in the United States.\n\n[The Chicano Movement] called for the Chicano community to be able to control its own resources and determine its own future. It called for community control of its schools, its economy, its politics, and its culture.\n\nThe Chicano Generation understood that as part of its self-empowerment, it had to have a sense of its history—a history that had been denied it in the schools. Mexicans were not supposed to have a history in the U.S., yet the Chicano Generation instinctively recognised that it had a history or counter-history that it needed to discover. This meant exploring its indigenous and mestizo (Indian and Spanish, and even African and Asian) past: its roots in Mexican history, including Mexico’s war with the U.S.; the Mexican Revolution of 1910; and the history of Mexican immigrants to the U.S. But this was a history it only knew through family and community lore and not systematically studied by historians. This search for a relevant and useable past led to the development of the field of Chicano history as part of the movement’s efforts to establish Chicano Studies programs at universities and colleges.\n\nConnection Questions"}, {"url": "https://www.latimes.com/california/story/2020-08-25/chicano-movement-generation-in-search-of-its-legacy", "page_content": "Reies Lopes Tijerina became a symbol of courage to Chicanos when he led an armed raid on a county courthouse in northern New Mexico.\n\nLike calaveras bailando — the humorous, dancing skeletons of Mexican folklore that teach us to celebrate life by laughing at death — the partygoers laughed and danced, recalling for an evening the lost intensity of their tumultuous youth.\n\nIt was a reunion of sorts for the Chicano Movement.\n\nA decade had passed since the death of the movement. In the interim, most of the young Chicano “revolutionaries” had joined the establishment as lawyers, business executives, college professors or bureaucrats. But they were still bound together by the political rite of passage that had forged their generation’s Chicano identity.\n\nAs young people around the world rebelled in the 1960s against the established order, Chicanos in the Southwest searched their roots and bristled at the inequity characterizing their people’s experience in the United States. In an explosion of youthful idealism, they set out to rebuild Aztlan, the mythical Aztec homeland that became a symbol of self-determination, of a Chicano Southwest.\n\nAdvertisement\n\nNow, at an East Los Angeles restaurant, the 1960s beat of Santana enveloping the room, members of la generación de Aztlan gathered to rally around an old star.\n\nRaul Ruiz, leader in the now-defunct La Raza Unida party and former target of FBI surveillance, was returning to the public fray as a candidate in the April primary election for the Los Angeles school board. Ruiz, now a Chicano studies professor, had been among those in the movement protesting the loudest against the school system’s treatment of Latino students.\n\nThe calaveras looked older now. They had lost their innocence in street confrontations with police and in the realization that the system they challenged was stronger than they were.\n\nA few, like the legendary Oscar Z. Acosta, whom they called the ‘Brown Buffalo” and the “movement’s lawyer,” were reportedly dead. Others were said to have dropped out or sold out. And some of the former girlfriends and wives of the movement’s youthful leaders had come to the Ruiz fundraiser alone. Many had not seen so many familiar old faces since Ruiz’s 1971 unsuccessful run for the state Assembly.\n\nRuiz would lose the school board election. But the night’s reunion would remain significant for those who were there.\n\nIt raised a question each had wrestled with in different ways: Though the dream of Aztlan had faded, would its legacy be strong enough to sustain a generation’s commitment to change?\n\n::\n\nIn the midst of the black civil rights movement and antiwar protest, a new generation of Mexican-Americans took a hard look at their place in American society and grew angry at what they saw: the lowest per-capita income of any group in the country and one of the highest unemployment rates; half of their youngsters dropping out of high school and few making it to college; virtually no political representation, and young Chicanos dying in Vietnam at nearly twice the rate of others.\n\nUnderlying it all, they discerned a lack of respect for their culture and little concern for their condition.\n\nThe so-called “silent majority” had suffered in silence long enough.\n\n“It was like someone threw cold water on our faces. We woke up and ... said, ‘No more,’” recalled Richard Martinez, a college student at the time who later ran Ruiz’s Assembly campaign. “We were on the radical edge of insanity. We had clarity of vision that polarized the world between good and bad.”\n\nRooted in the same deep-seated discontent that moved earlier generations of Mexican-Americans to protest their economic and social condition, this movement’s focus was on civil rights, educational opportunities, opposition to the war and ethnic identity.\n\nIt was a movement of young people who rejected the term Mexican-American as something imposed on them, and called themselves Chicanos. A growing sense of community and common purpose evolved into a nationalistic ideology. If the established institutions refused to open their doors to Chicanos, then Chicanos would build their own schools, publishing houses, political parties and health facilities.\n\n“We were young and naive and we really believed we were going to create a healthy Chicano California, one big happy family. It was Aztlan, and we were really going to run with it,” recalled Richard Cruz, a Loyola University law student at the time.\n\nBreaking with their elders’ accommodative approach, young people in barrios across the Southwest took to the streets. In East Los Angeles, thousands of high school students staged walkouts, and others demonstrated against the war.\n\nBut some frowned on this defiance by the young. It was not unusual for an angry parent to show up at a park rally and pluck a youngster from the crowd.\n\nCruz estimates that during the height of the period, which spanned the late 1960s and early 1970s, as many as 150,000 Mexican-Americans participated in mass demonstrations and rallies in Los Angeles alone.\n\n“We did everything but take up arms against the establishment,” he said. “At the 1970 Moratorium (antiwar demonstration), you saw 20,000 to 30,000 fighting faces. It was a fight. Nobody misunderstood.”\n\nWhen law enforcement officers arrived at the East Los Angeles demonstration, a violent confrontation erupted and mass arrests followed. Hundreds were injured and three men were killed by police, including Los Angeles Times columnist Ruben Salazar. The journalist was shot in the head with a tear gas projectile when a sheriff’s deputy fired into a bar where Salazar had stopped for a beer.\n\nOn the college campuses, student groups adopted the name MECHA, an acronym in Spanish for Chicano Student Movement of Aztlan, and pressed for increased Chicano enrollment and courses about their people’s experience in the United States.\n\n“We were militant and angry,” said Cruz, recalling the demonstrations he helped lead to boost Chicano enrollment in law schools.\n\nCollege students took inspiration from emerging leaders like Cesar Chavez and his unionization effort on behalf of farmworkers. They invited other notables to their conferences and rallies.\n\nReies Lopes Tijerina, a fiery ex-evangelist, became a symbol of courage to Chicanos when he led an armed raid on a county courthouse in northern New Mexico. He jostled their memory with his campaign to restore early Spanish and Mexican land grants to the descendants of the original owners, charging that the lands had been illegally seized.\n\n“Reies showed us what it’s like to fight con muchos huevos (with a lot of guts),” recalled a young New Mexican journalist. “He turned the world upside down on us and forced us to look at the issues confronting us as a people.… He turned my generation from Spanish-Americans to Chicanos, he decolonized us and returned us to ourselves.”\n\nRodolfo (Corky) Gonzales sparked the imagination of young people with his strident talk of “Chicano Power” and his success mobilizing Chicanos in Denver through an organization he called the Crusade for Justice. He also organized “liberation” conferences that brought together young people from across the country.\n\nRodolfo (Corky) Gonzales sparked the imagination of young people with his strident talk of “Chicano Power” and his success mobilizing Chicanos in Denver through an organization he called the Crusade for Justice. (Jose Galvez / Los Angeles Times)\n\nJose Angel Gutierrez, a tough-talking young Texan, also gained national prominence after founding a political party called La Raza Unida (the United People). The party’s mission, he once said, was “to paint the White House brown.”\n\nThe party, noted for its strong nationalistic tenor, challenged Anglo control of local government in predominantly Mexican-American communities in southern Texas. In 1970, Chicanos took over the Crystal City school board and City Council. The concept spread to other areas, including Los Angeles, although with less success.\n\nIn Los Angeles, a group called Catolicos por La Raza (Catholics for the People) pressured the church to use its influence on the community’s behalf.\n\nA confrontation occurred Christmas Eve, 1969, when about 1,000 Chicanos demonstrated in front of St. Basil’s Cathedral, a newly constructed multimillion-dollar church on Wilshire Boulevard. When the protesters tried to enter the church, they were confronted by plain-clothes officers posing as ushers.\n\n“It turned into a tremendous riot, a bloody thing,” said Cruz, who was later arrested along with Ruiz, Martinez and 18 others. Several were jailed.\n\nCruz, who went on to become an attorney in East Los Angeles, believes the group’s activities helped open the way for the subsequent appointment of Latino bishops in the Southwest; the establishment of the church’s Campaign for Human Development, which funds social programs, and the Los Angeles Archdiocese’s support of Chavez’s union.\n\nCruz has also seen the number of Chicanos in law schools multiply.\n\n“But we had a lot of growing up to do,” Cruz said. Still, he added, with a smile, “those were tremendous times. Very romantic times. We were all the young Chicano revolutionaries.”\n\nRudolfo “Corky” Gonzalez (Jose Galvez / Los Angeles Times)\n\n::\n\nThe movement’s strength — its youth and spontaneity — was also its weakness. Its idealism was coupled with inexperience, its vitality with a lack of direction.\n\n“We were driven by a hot, passionate anger. It’s what sparked us. People had sat on that anger for years. Once it exploded, we didn’t have the tools to sustain it,” said Martinez, the college student turned campaign manager, with the hindsight acquired after six years as a professional community organizer.\n\nAlthough Chicanos shared a vision called Aztlan, it was a blurred one. As soon as Chicanos discovered all that they held in common, they also discovered their differences. Competing political ideologies and strategies emerged, and few groups were equipped to resolve them.\n\nWhile some adhered literally to the concept of Aztlan, others thought that the establishment of separate Chicano institutions was unrealistic. They hoped, instead, to pry open the doors to established institutions.\n\nIt was such a debate that spelled the demise of the Raza Unida party. “We never resolved the issue,” said Gutierrez, the founder of the alternative party, who won election to a county judgeship in his Texas hometown.\n\nThe party also lacked organizational control.\n\n“Instead of sticking to our initial strategy of taking over one little community at a time … we began running governors in Texas and New Mexico, senators in California. And we stopped organizing,” he said.\n\nAnd when the Democratic Party perceived the alternative party as a threat, it began recruiting Chicanos to run under the Democratic banner, blunting the effect of Raza Unida candidates, said Gutierrez, now 38 and a teacher at Western Oregon State College. Today, only a few scattered remnants of the party remain.\n\nCompounding these problems was the perception of Chicano activists, along with other protests groups of the period, as threats to the established order. Law enforcement agencies responded accordingly.\n\nAcross the country, activism by young people met with stiff reaction. Riots and police brutality marred the 1968 Democratic National Convention in Chicago. Violent confrontations became commonplace as thousands of demonstrators in cities throughout the United States protested the Vietnam War.\n\n“We found how naive it is to think that because your cause is right and just, that the truth will win out. That’s nonsense. It is a hard-and-fast system that protects its own economic and political interests. And it’s very hard to change it,” said Joe Razo, who was jailed for his involvement in the St. Basil’s riot and indicted with 12 others for his role in the 1968 high school walkouts that became known as “the East L.A. blowouts.” Razo, now 44, is a deputy state labor commissioner in Los Angeles.\n\nIt was a lesson that other longtime Latino activists like Bert Corona had learned long ago. Corona, whose experiences date back to the establishment of CIO unions during the late 1930s and early 1940s in California, had seen police battle workers on the picket line and Mexican-American labor organizers labeled “radicals” and deported during the 1950s.\n\nNow his younger counterparts would learn the lesson on their own.\n\nAs confrontations with police intensified, the movement’s leaders increasingly found themselves indicted or in jail. Movement organizations were infiltrated by undercover offices and, for a period, East Los Angeles seemed to be under a state of siege.\n\nThe Brown Berets, a group of young men in East Los Angeles who donned uniforms and declared themselves “protectors” of their community, attracted the attention of law enforcement agencies.\n\nDavid Sanches, the leader and self-styled “prime minister” of the group, contends that the group’s paramilitary style was a “psychological ploy to bring attention to the Mexican-American community.” But law enforcement officials took the group’s tough posturing seriously. (Sanchez, a straight-A high school student who served on former Mayor Sam Yorty’s youth advisory council before turning to street organizing, returned to politics last spring in an unsuccessful bid to unseat Councilman Art Snyder.)\n\nRalph Ramirez, another former member of the group, said he had expected “to be harassed, pulled over, taken in on suspicion of this or that, even to get our heads knocked once in a while.” But he said undercover officers who infiltrated the group tried to provoke violent confrontations with police, and that surprised him.\n\n“That’s when it hit us that these guys were playing for keeps,” said Ramirez, who now works as a job placement consultant with Orange County.\n\nIn 1972, shortly before Sanchez officially disbanded the organization (it claimed a membership of 5,000 across the Southwest), about two dozen Brown Berets “occupied” Santa Catalina Island, declaring it “Mexican territory” that had never been ceded by Mexico. They left quietly 24 days later after they were told that they were violating a camping ordinance.\n\nRudy de Leon, a police lieutenant at the time and the highest-ranking Latino officer in the department, said the Brown Berets were initially perceived as “a lot more dangerous than they actually turned out to be. No doubt about it.” He said he was often called in for consultation on Chicano Movement activities by then-Police Chief Tom Reddin.\n\n“Undercover work was going on all the time” within movement groups, De Leon said, because of the perceived threat. However, De Leon, who left the department five years ago and now works as a special assistant in the state attorney general’s Los Angeles office, denies that officers provoked confrontations.\n\nDe Leon, like others still with the department, thinks that the turmoil of the period eventually led to greater efforts by police to improve relations with a community they scarcely knew. But some recall the early police reaction with bitterness.\n\n“There was a general and growing acceptance of the movement in the community. When it started getting massive, local politicians, the police and the media started attacking us,” said Rosalio Munoz, a former UCLA student body president and a leader in the anti-war marches in East Los Angeles.\n\n“The movement didn’t fizzle — it was bludgeoned to death,” said Munoz, who ran unsuccessfully for a seat on the Los Angeles County Board of Supervisors twice during the last five years. He now works as a writer for a leftist newspaper in Los Angeles.\n\n“When you see kids shot down on the street, you agonize afterward.… I felt angry, bitter, frustrated for a while. I almost believed it would be best not to demonstrate anymore,” he said, recalling the violence, the court battles and the visits by FBI agents to the homes of movement leaders. “I couldn’t believe how vicious the whole thing got.”\n\nCruz, the radical-turned-attorney, said that “by 1971, we had the last of the moratoriums, the mass demonstrations and the militant confrontations.… The violence we saw during those years was horrible.… Everybody suffered a lot. Many people are still emotionally disturbed, totally freaked out from the ‘60s …\n\n“By 1973, most of the people I knew ended up getting divorced, or in jail or in (self-imposed) exile. Scores of people began splitting all over the U.S., just to get away, to hide and relax and get their heads together.\n\n“The romance was over,” Cruz said.\n\n::\n\nWhen Cruz and others look back on the movement, they generally agree that its greatest legacy was the positive self-image it fostered among Mexican-Americans, as well as the sense of community and the increased national visibility it brought them.\n\n“The period, with all its problems with all its pettiness and failures, succeeded much more than any other period in making a greater number of people in the community aware of themselves as a community of common interests,” said Ruiz, who after his unsuccessful school board campaign continues teaching at California State University, Northridge.\n\nRichard Santillan, then a student activist and now a teacher at California State Polytechnic University, Pomona, attributed some specific gains to the movement: Farmworkers now have the right to collective bargaining; a state Legislature that had no Mexican-American members in 1967 has seven today; Latinos have won election to Congress with more frequency, and there is a Mexican-American member of the state Supreme Court.\n\n“If anything, the Chicano Movement reinforced our right to exercise our own language and traditions.… We’ve gained greater protection over our rights, we’ve become freer to express our ‘Mexicanness’ and be proud of our culture. Now we can be Hispanic and still move up,” said Santillan, who also works as a Latino political researcher at the Rose institute in Claremont.\n\nMany agree that a key lesson from the period is that the Latino community needs to build solid organizations if the country’s fastest growing minority is to become a political force.\n\n“We’ve learned the lesson that we need cool, calculated anger, that change requires constant pressure, and the importance of organizing,” said Martinez, who as a professional community organizer has worked with such grass-roots groups as the United Neighborhoods Organization (UNO) in East Los Angeles. He now works with the Southwest Voter Registration Education Project, a San Antonio-based organization that recently launched a national campaign to register 1 million more Latino voters by the 1984 general election.\n\nMany point to such groups and to civil rights organizations like the Mexican-American Legal and Educational Fund as having resulted from the experiences of the period.\n\nIn fact, most urban 1960s activists credit the movement with a broad array of accomplishment for Latinos, including increased college enrollments, affirmative-action programs, a renaissance in art, establishment of college Chicano studies programs and academic research and more bilingual education programs.\n\nBut none deny that its most direct benefits went to a very small segment of the Latino population, primarily the middle-class, college and professional sectors.\n\nA recent Los Angeles Times Poll showed that only about half the Latinos in California are aware that the Chicano Movement took place, a recognition rate only slightly higher than that of Anglos.\n\nOf those Latinos aware of the movement, three out of four credit it with helping to improve conditions for Latinos. The strongest approval came from those who were 22 to 35 years old at the time and those in the highest education and income levels.\n\nThere is general agreement among 1960s activists that the movement did not bring about the fundamental changes many had hoped for.\n\nThe economic and political system that historically has relegated Mexican-Americans to the bottom or near bottom of the educational and labor pool did not budge appreciably. Conditions for the vast majority of Mexican-Americans have not improved, relative to the dominant population, and some observers claim they have actually worsened in the midst of bad economic times and a politically conservative climate.\n\nAccording to Ray Roco, a political scientist at UCLA, the new Chicano professionals are “on the cutting edge in … gaining some kind of leverage on the system.”\n\n“But we know very little about what’s happening to them,” he added. “Are they simply going to reproduce the values already there, creating distance between them and the masses of Mexican-Americans, or are they going to affect change?”\n\nA few former leaders of the period, like “Corky” Gonzales and Reies Tijerina, have held fast to their ideals — but they have seen their influence wane with changing times.\n\nTheir younger counterparts, though, maintain that their upward mobility has not altered their commitment to the ideals of their youth.\n\n“I know that as a generation we made a difference. And we are not dead.… We’ve come of age. We’ve become specialists in our fields. We’re still motivated, still chipping away at the institutions,” said Alurista, a Chicano poet and former student leader in San Diego. “We have people from the ‘60s generation in different spots and levels of society.... Our power now lies in the specialization of our pressure.”\n\nBut there is concern that as Chicanos “infiltrate” the institutions they once fought, the battle lines have become less clear.\n\nSome detect a lack of commitment among Chicanos within the professional sector. These critics say that as Chicanos have become part of the establishment, many have become less willing to disrupt it. Nor do these critics buy the contention that improvements will trickle down to the masses as Chicano professionals move into positions of power.\n\nAnd while many among the new professionals still view themselves as leading the way, others maintain that the focus of the Chicano struggle has shifted back to the most disadvantaged segment of the community, those with the lowest income, the highest unemployment, the least education.\n\nThose who remember the concessions won when thousands marched in the streets maintain that Latinos’ greatest advantage still lies in their potential to mobilize mass action.\n\nOthers express the hope of linking the professional resources of those within the institutions with the masses at the grass-roots level, combining civil disobedience with political and economic power.\n\nDuring the last year, for instance, a cross section of Latino groups has strongly lobbied against the Simpson-Mazzoli bills, sweeping immigration legislation that many Latinos fear will result in mass deportations and discrimination against Latinos. Some have testified before Congress, while others have demonstrated in the streets.\n\nAnd, on a broader scale, Bert Corona said he sees another national movement taking shape among working-class Latinos, illegal immigrants and a cross section of other groups most adversely affected by Reagan Administration economic and social policies.\n\nLike Martinez, the activist-turned-community organizer, many look upon the 1960s as part of a cycle, “a blip in the continual struggle of Mexican-Americans in this country....”\n\n“Tactics and strategy may have changed,” Martinez said, “but the spirit is still alive, the same spirit that has characterized our history of struggle in the United States for generations.”\n\nActivists like Corona, who preceded him, were “the holders of the flame,” Martinez said.\n\n“They held on, waiting for the next generation to give birth to another era. They were the link. They provided the continuum.”\n\nMartinez said he looks forward to “the day when the next generation comes along to challenge us and the status quo. What we’ve accomplished is not bad, but it’s not good enough.”\n\nThis story appeared in print before the digital era and was later added to our digital archive."}, {"url": "https://folkways.si.edu/lesson/the-big-four/themes-and-leaders-of-the-chicano-movement", "page_content": "During the 1960s & 1970s, several leaders emerged as the most prominent faces of the Chicano movement. These leaders were important because they gave the movement a collective “voice”: They drew attention to social issues (related to discrimination, marginalization, and exploitation), united people within the Mexican American community, and inspired them to fight against injustice and for equal rights. In this lesson, actively engage with music that highlights the contributions of César Chávez, Reies López Tijerina, José Ángel Gutiérrez, and Rodolfo “Corky” Gonzales. In this lesson, you will learn about the causes these leaders were fighting for and consider the ways in which musicians helped to amplify and spread their messages.\n\nBibliography\n\nText\n\nAzcona, E. C. (2008). Movements in Chicano music: Performing culture, performing politics, 1965–1979 (Unpublished doctoral dissertation). The University of Texas at Austin.\n\nAzcona, E. C., & Rodriguez, R. (2005). Rolas de Aztlán: Songs of the Chicano movement [Liner notes]. Smithsonian Folkways Recordings.\n\nGonzales, R. (1972). Yo soy Joaquin/I am Joaquin. Bantam Books.\n\nMartinez, B. (1973). Brotando del silencio: Breaking out of the silence, by Suni Paz [Liner notes]. Paredon Records.\n\nMontoya, M. (2016). The Chicano movement for beginners. For Beginner Books.\n\nRosales, F. A. (1996). Chicano! The history of the Mexican American civil rights movement. Arte Público Press.\n\nSmithsonian Folkways Recordings (n.d.). Suni Paz: Argentinian singer and songwriter. In Explore: Artist Spotlight.\n\nZettler, J. (2009). Corridos of the Chicano movement [Liner notes]. Arhoolie Records.\n\nAudio*\n\nPaz, S. (1973). Las condiciones (Our Demands) [Audio recording]. On Brotando del silencio: Breaking out of the silence [Album]. Paredon Records.\n\nFuentes, R. L. (2009). Corrido de César Chávez [Audio recording]. On Corridos of the Chicano movement [Album]. Arhoolie Records.\n\nFuentes, R. L. (2009). Aztlán [Audio recording]. On Corridos of the Chicano movement [Album]. Arhoolie Records.\n\nFuentes, R. L. (2009). Política en los barrios [Audio recording]. On Corridos of the Chicano movement [Album]. Arhoolie Records.\n\nFuentes, R. L. (2009). Partida la Raza Unida [Audio recording]. On Corridos of the Chicano movement [Album]. Arhoolie Records.\n\nFlor del Pueblo. (2005). Soy del pueblo [Audio recording]. On Rolas de Aztlán: Songs of the Chicano movement [Album]. Smithsonian Folkways Recordings.\n\nVideo*\n\nPerez, H. (2019, July 23). Jose Angel Gutierrez recipient, 2019 United States Hispanic hero award [Video]. Rocket Productions.\n\nImages*\n\nCastillo, O. (1972). José Angel Gutiérrez, Reies López Tijerina, and Rodolfo “Corky” Gonzalez at the national convention of the Raza Unida Party [Photograph]. Smithsonian American Art Museum, Smithsonian Institution, Washington, DC. Museum purchase through the Luisita L. and Franz H. Denghausen Endowment, 2013.51.12.\n\nNational Student Committee for Farm Workers. (n.d.). Join the boycott - don’t buy Gallo Wines [Poster]. National Museum of American History, Smithsonian Institution, Washington, DC. Courtesy of Albert Louis Feldstein, 321648.29.\n\nUnknown artist (ca. 1970). Suni Paz [Photograph]. In Entre hermanas: Between sisters [Liner notes], 1977, p. 6. Folkways Records, New York, NY, FW08768.\n\nUnknown artist (n.d.). Boycott Campbell’s Soup [Poster]. National Museum of American History, Smithsonian Institution, Washington, DC, 1984.0796.105.\n\nN.G. Slater Corporation (ca. 1973). Pinback button for the Chicago alliance against racist and political repression [Badge pin]. National Museum of African American History and Culture, Smithsonian Institution, Washington, DC. Gift of T. Rasul Murray, 2013.68.19.\n\nUnited States Postal Service. (2003). Cesar E. Chavez [Postage stamp]. Illustrated by Robert Rodriguez. Displayed at the National Postal Museum, Smithsonian Institution, Washington, DC, 2003.2016.108. ©2003 United States Postal Service®. All Rights Reserved. Used with Permission.\n\nKernberger, K. (ca. 1967–1968). Reies López Tijerina [Photograph]. Center for Southwest Research, University Libraries, University of New Mexico, Albuquerque, NM. From the Peter Nabokov collection, 000-093-0002.\n\nUnknown artist (n.d.). Jose Angel Gutierrez [Photograph]. Denver Public Library Special Collections, Denver, CO, X-21628\n\nUnknown artist (ca. 1970s). Corky Gonzales [Photograph]. Denver Public Library Special Collections, Denver, CO, Z-8826.\n\nUnknown artist (ca. 1980s). Flag of Aztlán [Flag]. Wikimedia Commons. Uploaded by Wikimedia user Sukanara.\n\nStrachwitz, C. (1972). Rumel Fuentes [Photograph]. In Corridos of the Chicano movement [Cover art excerpt], Cover design by W. Pope, 2009. Arhoolie Records, El Cerrito, CA, ARH00507.\n\nUnknown artist (n.d.). Chunky Sanchez with César Chávez [Photograph]. In Rolas de Aztlán: Songs of the Chicano movement [Liner notes], design by Communication Visual, 2005, p. 3. Smithsonian Folkways Recordings, Washington, DC. Photo courtesy of Chunky Sanchez, SFW40516.\n\nUnknown maker (20th Century). Güiro [Musical instrument]. In Teodoro Vidal collection of Puerto Rican history [Archival collection]. National Museum of American History, Smithsonian Institution, Washington, DC. Gift of Teodoro Vidal, 1997.0097.1077.\n\nLatin Percussion Inc. (1999). LP bongo drums [Musical instrument]. National Museum of American History, Smithsonian Institution, Washington, DC. Transfer from Smithsonian Institution Center for Latino Initiatives (through: Dr. Refugio I. Rochin, Director), 2000.3039.15.\n\nUnknown maker (ca. 1970). Claves, used by Mongo Santamaría [Musical instrument]. National Museum of American History, Smithsonian Institution, Washington, DC. Gift of Nancy Santamaría, 2005.0030.06.\n\nRemo Inc. (1999). Remo conga drums signed by Poncho Sánchez [Musical instrument]. National Museum of American History, Smithsonian Institution, Washington, DC. Transfer from Smithsonian Institution Center for Latino Initiatives (through: Dr. Refugio I. Rochin, Director), 2000.3039.11.02.\n\nCommunication Visual (2005). Rolas de Aztlán: Songs of the Chicano movement [Cover art]. Smithsonian Folkways Recordings, Washington, DC. Photograph of Flor del Pueblo courtesy of Eduardo Robledo,1976, SFW40516.\n\nDane, B. (1967). Carlos Puebla [Photograph]. In Cancion protesta [Liner notes], 1970, p. 5. Paredon Records, Brooklyn, NY, PAR01001.\n\nCommunication Visual (2005). Rolas de Aztlán: Songs of the Chicano movement [Cover art, back]. Smithsonian Folkways Recordings, Washington, DC. Photograph courtesy of Los Alacranes Mojados, ca. 1978, SFW40516.\n\nAllied Printing Trades Council (1981). Solidarity day [Poster]. National Museum of American History, Smithsonian Institution, Washington, DC. Anne B. Zill, 1986.0231.017.\n\n*Audio, video, and images listed in order of slideshow sequence."}, {"url": "https://www.studysmarter.us/explanations/history/us-history/chicano-movement/", "page_content": "During the 1960s, African Americans fought and campaigned for social reform within the United States in the Civil Rights Movement. Their fight for equality was not the only fight, however. Mexican Americans, many of whom willingly adopted the derogatory term Chicano, stood alongside African Americans in Civil Rights activism, organizing protests and movements across the country. Embracing Mexican language, culture, heritage, and history, the Chicano Movement's advocation for peaceful protest found great success in achieving social reform. Chicano Movement Timeline The following timeline provides a brief progression of events important to the Chicano Movement: February 1929: The League of United Latin American Citizens was founded.\n\nApril 1947: The Mendez vs. Westminster case is decided, finding segregation in schools for Mexican American children to be unconstitutional.\n\nMay 1954: The Hernandez vs. Texas is decided, a victory for Mexican Americans and other subjugated groups.\n\n1968: Mexican American Legal Defense and Educational Fund was founded.\n\nMarch 1969: Poet Rodolfo “Corky” Gonzales organized the second Chicano Youth Liberation Conference.\n\nJuly 1970: Cesar Chavez's grape strike ends in victory, as grape growers consent to pro-Chicano reforms.\n\nAugust 1970: The Chicano Moratorium protests against the Vietnam War reached their peak. Chicano Civil Rights Movement The Chicano Movement was a Mexican American social movement that peaked alongside the African American Civil Rights Movement during the 1960s. The term Chicano (Chicana for female Mexican American Activists) was once used as a slur against Mexican Americans, but was embraced by the participants of the Chicano Movement. To the protestors, the term Chicano/ Chicana came to represent pride in Mexican heritage and religion. Not everyone adopted the term, but for those who did, the term Mexican American already assumed a level of assimilation into Anglo-American culture and society. Anglo-American: An English-speaking inhabitant of the USA who is of English ancestry. Anglo-American culture was long seen as the “normal” way of living in the United States. Most United States citizens speak English, and many social conventions draw from Anglo-American heritage. Examples range from the prevalence of English cuisine in the USA to the concept of the nuclear family, while Persian cuisine and polygamy are not so typical in the USA. What other cultural “norms” in the USA draw from Anglo-American heritage? The \"Flag of Aztlan\" commonly used by Chicano activists. Source: Wikimedia Commons. The Chicano Movement was not a singular movement or activist organization. It refers to the many Mexican American activist groups that rallied under the same nationalistic ideas of Chicanismo. Increasing in popularity in the late 1960s, thanks to the poetry of the Chicano poet Alurista (Alberto Baltazar Urista Heredia), many Chicano Movement activists began embracing the idea of Aztlan as a unifying symbol of American heritage. Aztlan was the mythical northern homeland of the Aztec people; Chicanos and Chicanas rallied around the concept of the land of the United States being Aztlan. Chicanismo: The defining nationalistic ideology of identity behind the Chicano Movement, drawing inspiration from pre-European Mesoamerica and the old Nahuatl language.\n\nOrigin of the term Chicano: Chicano is believed to be a truncated word for Mexican (Mexico = Xicano = Chicano). The origins and etymology of the word Chicano are disputed among modern scholars. Some historians erroneously declare that the terms originated in the 20th century. Still, the earliest known use was in a map drafted in 1562, where Chicana referred to a town south of the Colorado River. The Chicana town at the intersection of the peninsula of Baja California and the mainland. Source: Wikimedia Commons. The Chicano Movement and the \"Plan Espiritual de Aztlán\"\n\nDuring the 1969 Chicano Youth Liberation Conference, organized by Rodolfo \"Corky\" Gonzales, the Chicano Movement adopted a political manifesto titled \"Plan Espiritual de Aztlán.\" The title was inspired by Alurista's speech at the conference (an excerpt can be found below). The manifesto called for strength and solidarity, revolution, and reform. Much of the plights of Mexican American communities were blamed on the United States for their forceful takeover of North America and the Mexican-American War. In the spirit of a new people that is conscious not only of its proud historical heritage but also of the brutal \"gringo\" invasion of our territories, we, the Chicano inhabitants and civilizers of the northern land of Aztlan from whence came our forefathers, reclaiming the land of their birth and consecrating the determination of our people of the sun, declare that the call of our blood is our power, our responsibility, and our inevitable destiny. –Alurista The \"Plan Espiritual de Aztlán\" was written at the close of the 1960s, after activist movements had already achieved great success in political and social reform. But the document still stands as a testament to the spirituality of Mesoamerican culture, from which the Chicano movement drew inspiration. Chicano Mural Movement Chicano youth took to the streets, eager to paint the world with their activism. Mural painting became a form of active expression, as painters covered walls with massive paintings that loomed over streets, walkways, and parks. The iconography of Chicano murals often focused on Aztlan roots, depicting Aztec gods such as Quetzalcoatl and Coatlicue. Real figures, like the Mexican revolutionary Emiliano Zapata (pictured below), were also depicted, as well as post-Columbian Chicano figureheads, e.g., La Virgen de Guadalupe. Mural of Emiliano Zapata painted in an underpass in Chicano Park within San Diego, California. Source: Rpotance, CC-BY-SA-4.0, Wikimedia Commons. Other images include themes of displacement and repossession of territory. Renowned Chicano artist Salvador Torres was a major proponent of the Chicano Mural Movement, a mission to repaint the bridge that passed over a park in Logan Heights, San Diego. Activists flocked to the park, peacefully redecorating it with the images and icons of their cause. Renamed Chicano Park, the area became a cultural home for the Chicano Movement. Until now, Chicano Park contains the most outdoor murals in the USA. Chicano Movement Leaders Like other activist groups of the 1960s and 1970s, the Chicano Movement had its own leaders. Each leader organized their subset of the Chicano movement across the nations, directly contributing to the greater social movement or achieving tangible progress within their communities. The chart below details some of these key figures and their efforts in the Chicano Movement. Photograph of Cesar Chavez. Source: Movimiento, CC-BY-SA-3.0, Wikimedia Commons. Chicano Movement Leader Name Contributions Cesar Chavez Cofounder of the National Farm Workers Association alongside Dolores Huerta. Incited a grape strike to gain labor rights for Chicano laborers. Rodolfo \"Corky\" Gonzales Activist and organizer of the Chicano Youth Liberation Conferences, which defined the shape of the Chicano movement into the 1970s. Dr. Hector Perez Garcia Mexican-American World War II veteran, surgeon, and activist who founded the American GI Forum; in 1968, he was appointed to the US Commission on Civil Rights. Reies Lopez Tijerina Founder of the Federal Land Grant Alliance and activist for Chicano community education reform; staged a hostile takeover of the Tierra Amarilla courthouse in New Mexico in 1967."}, {"url": "https://daily.jstor.org/the-foundations-of-chicana-feminism/", "page_content": "There is no one history of feminism in the US. Women of varied races, classes, sexualities, and ideologies have always organized in many ways for many different goals. Sociologist Alma M. Garcia explains how, in the 1970s, Chicana feminism emerged with its own distinctive approach to sexism and racism.\n\nThe Chicano movement began in the 1960s. It included a wide variety of causes related to the equality and rights of people of Mexican heritage, from students fighting for more inclusive history classes to organizing by the United Farm Workers. Garcia writes that women were highly active in these efforts, but many came to believe that sexism within the movement was hindering progress. In 1971, labor rights activist and feminist Francisca Flores wrote that Chicanas “can no longer remain in a subservient role or as auxiliary forces” but “must be included in the front lines of communication, leadership and organizational responsibility.”\n\nThe Chicano movement emphasized cultural pride in the face of an Anglo-dominated society. But, in the view of many Chicanas, this too often involved idealizing oppressive gender relationships. Writer Anna Nieto Gomez noted that many in the movement saw women’s proper job as supporting her husband and nurturing her children.\n\nSome Chicana feminists viewed machismo as an equally damaging stereotype.\n\n“For a Chicana bent upon fulfillment of her personhood, this restricted perspective of her role as a woman is not only inadequate but crippling,” she wrote.\n\nGarcia writes that some Chicana feminists viewed machismo as an equally damaging stereotype. They argued Anglo society used it to lay the blame for Chicanos’ unequal status on their culture rather than discrimination and exploitation. Where some Chicanos took machismo as a point of cultural pride and resistance, many feminists argued that it was simply a manifestation of sexism prevalent among all ethnic groups in the US.\n\nIn the 1970s, women in the Chicano movement split between feminists and “loyalists” who saw the fight against sexism as individualist, and counter to the strength of the Chicano family. Many loyalists associated feminism with white women and saw Chicana feminists as assimilating into white culture.\n\nWeekly Newsletter\n\nGet your fix of JSTOR Daily’s best stories in your inbox each Thursday.\n\nPrivacy Policy Contact Us\n\nYou may unsubscribe at any time by clicking on the provided link on any marketing message. Δ\n\nYet, Garcia writes, a major strain among Chicana feminists was pushing back against racism among white feminists. While some found common ground on issues like access to birth control and abortion, they often noted that white feminists flattened women’s experiences and believed that solidarity among women could overcome racial differences. Many also viewed white feminism as a middle-class movement that had little interest in issues like the rights of farmworkers, welfare recipients, and undocumented workers. Ultimately, many decided that a better strategy for their work was to create coalitions with other women of color whose concerns they saw as more similar to theirs.\n\nAt the same time, their membership in multiple movements for justice gave Chicana feminists a position from which to push other activists to be more thoughtful. For example, feminist and lesbian writer Cherrie Moraga called for the white feminist movement to examine its own racism, the Chicano movement to address its sexism, and both to challenge their homophobic tendencies.\n\nSupport JSTOR Daily! Join our new membership program on Patreon today."}, {"url": "https://digilab.libs.uga.edu/exhibits/exhibits/show/civil-rights-digital-history-p/black-brown-power/chicano-movement", "page_content": "Origins\n\nThe Chicano Movement was based on Mexican-American affirmation of heritage and the realization that their heritage was being lost to the United States’ melting pot. Chicano, at the time of the movement, was an indicator of a proud Mexican-American. Initially the term Chicano served as a derogatory identifier for Mexicans who recently immigrated to the United States. Much like other ethnic groups, Chicanos faced laws and social codes that kept them in an economic and social dependency to the white majority. Jose B. Cuellar explains quite clearly that “‘Chicanismo’ referred to the driving consciousness of the shared struggles for human and civil rights” and all culminating into the now phrased Chicano Movement. The Chicano Movement’s catalyst was the systemic racism that was seen across the United States, and Chicanos began to awaken from this state of idleness. Richard Duardo’s account of this awakening illustrates the importance behind the movement and why it was important to not back down for such violent resistance.\n\nThe Origins of the movement as well as the word Chicano are beautifully illustrated in Rodolfo Gonzales’ poem, I am Joaquin. In one excerpt, Corky Gonzales painted the image that by forgetting one’s past was to lose all sense of identity in the melting pot. “Who rejects my father and my mother and dissolves into the melting pot to disappear in shame.” For Chicanos, the history and the color of their skin defined who they were and who they would be fighting against. Droves of Chicanos were shipped off to fight against the enemies of capitalism, while back home Mexican-Americans were treated as second class citizens. The Chicano Movement was a means to break from the chains of assimulation and to stand idle in the face of oppression. Chicanos fought for many privileges that would help keep Mexican-Americans from losing their identities as Mexicans. They sought to have their voices represented equally in Congress, in local offices, and even in school boards. Chicanos fought for the possibility of have teachers and courses that related to their beliefs and lives. In this short exhibit of the Chicano Movement however, one will only see the ideology behind the movement with an emphasis behind the shift from non-violence to militancy, the cultural nationalism, the Chicana activist, and the importance of art on the Chicano Movement."}, {"url": "https://www.tamucc.edu/library/exhibits/s/sts/page/chicano-movement", "page_content": "The Chicano Movement: A Short Overview\n\nBy: Nicholas Vela\n\nThe Chicano Movement, part of the various social movements that sprung up in the 1960s and 1970s, is perhaps best known due to the work of Cesar Chavez in California with the United Farm Workers of America. A lesser-known aspect of the Chicano movement occurred in Texas that consisted of school walkouts, colleges that catered to Chicano students, and a new understanding and sense of newfound pride, of Chicano Culture. Starting with the Zoot Suit Riots in the 1940s, and culminating with the coalescing of various academic, militaristic, and political groups to form, or less, a united Chicano front, now known as the Chicano Movement.\n\nStarting in the 1960s, the uptick of minority movements, undoubtedly brought about by a general feeling of inequality and injustice in a nation that prides itself on bringing equality and justice to all, is perhaps best remembered in the Civil Rights Movement, which provided a better level of equality to African Americans. For Chicanos, who sought to be treated equally in labor and rights as well since the 1940s, when the Zoot Suit Riots took place, their answer was also a movement to reclaim their national identities.\n\nThe Zoot Suit Riots were a conflict between White and Chicano Servicemen due to the amount of fabric in Zoot Suits that were favored among Chicanos. The riots led to attacks against Chicanos and were made famous due to a murder trial. Chicanos were unlike many groups fighting for rights or for their stories to be heard. Much like Native Americans, the land that Chicanos resided on had, at one point, been theirs. Many writers had started to think about Chicanos how Frantz Fanon and Albert Memmi thought about those of African descent under the French. In this case, Chicanos were not simply victims of colonization itself, but also victims of internalized colonization. Quoted in an article entitled “Aliens in Their Native Land: The Persistence of Internal Colonial Theory”, John Chavez points to Tomas Almaguer, who summarized this concept in his book titled Toward the Study of Chicano Colonialism, by stating that “Mexicanos are not outsiders but are, in fact, an indigenous people of the land in question.”[1]\n\nMexican-Americans, who chose the term Chicano as a self-identifying and political term, were original inhabitants of the land before, as the evidence from the past states, the United States came in, took their land, and began to subjugate the Mexican American community. While it is common knowledge that many Chicanos were considered and classified as Caucasian, it was only on paper. In practice, many Chicanos were subject to discrimination and inequality. The case that immediately comes to mind is the case of Felix Longoria and the refusal of a funeral home to perform a service due to his being Latino. The Chicano Movement, then, did not seek to overturn a government or start a revolution. Instead, the Chicano Movement sought to empower Mexican Americans, and give them a voice. How they did this was varied, and depended on what group one dealt with. For many students, the Mexican American Youth Organization, (MAYO), and student walkouts were a way to showcase and reclaim a semblance of power, despite the potential consequences. Some, however, took political or militant approaches.\n\nIn the realm of politics, no group resembles the Chicano Movement as much as La Raza Unida, which translates to the United Race. In recent years, the party has not garnered the attention that it once did. However, La Raza Unida, which catered to and actively sought to represent poor blue-collar Mexican Americans, was perhaps at its most powerful in the 1972 Texas Gubernatorial Elections. In an article that detailed Mexican-American support for third parties, the evidence showed that compared to previous elections, “Data from 1972 revealed that the counties with the highest rates of Mexican American turnout in 1972 were largely those along the borderland region”, where La Raza Unida was far more active in recruitment and representation.[2]\n\nIn terms of militarization, the group known as the Brown Berets, a paramilitary-style organization that was a small connection to the Black Power movement, found a base in San Antonio. Here, the Brown Berets, so named for their signature brown berets and fatigues, appealed not only to gang members but also to veterans who wanted to do their part. For many, this wasn’t for militarization, but rather, for the “Pride aesthetic of Chicano Nationalism.”[3] For some, however, Chicano nationalism came in the form of journals, such as Aztlan.\n\nAztlan, a journal that focused on Chicano studies, was the first of its kind to focus on the field of Chicano studies that was peer-reviewed. In his article “Aztlan: How a Journal Built a Discipline”, Michael Soldatenko shows how Aztlan was responsible for a new paradigm in Chicano studies. As he states, a rise in Chicanos in academia ended with “their survival depending on publications.”[4] One of the sure ways to ensure that these publications were, indeed, publishes, was through Aztlan. By this particular avenue, the rubric and style guide that had been used by Aztlan became the standard. The Chicano movement was thus responsible for the formation of the first rubric and standard style for writing when discussing or writing about Chicano Studies, and the tradition continues to this day with successive editions of Aztlan.\n\nThe Chicano Movement, though close to sixty years old, still affects the nation today. There are new programs underway to record the stories of those who lived through such tumultuous times. In his article “Connecting to Activists and the Public through the Civil Rights in Black and Brown Oral History Project”, Max Krochmal shows that there are efforts to bring the Chicano Movement into the Public Sphere in ways that are accessible to the wider public. Through the Civil Rights in Black and Brown (CRBB) Oral History Project, Krochmal states that through “examining either “black” versus “white” or “Anglo” versus “Mexican”, CRBB aims to collect, interpret, and disseminate new oral history interviews with members of all three groups.”[5] By bringing these issues, these oral histories to the public, it can open new avenues for research, but also create a wider audience, thus laying the foundation for a wider understanding of the Chicano Movement.\n\nIn conclusion, the Chicano movement was more than simply having farmers strike or student walkouts in places like Crystal City. It was many parts that coalesced into a single movement that pushed Chicano Culture into the forefront of many hearts and minds, one that sought to further give credence to the idea that America was a nation of Equals. From the Brown Berets to La Raza Unida, and to publications such as the CRBB and Aztlan, the Chicano Movement continues to have many results that still affect us today.\n\n[1] John Chavez, “Aliens in Their Native Lands: The Persistence of Internal Colonial Theory,” Journal of World History 22, no. 4 (December 2011): 794.\n\n[2] Benjamin Márquez and Rodolfo Espino, “Mexican American support for third parties: the case of La Raza Unida,” Ethnic and Racial Studies 33, no. 2 (July 2009): 298-299.\n\n[3] Marc S. Rodriguez, Rethinking the Chicano Movement, American Social and Political Movements of the Twentieth Century (New York: Routledge, 2014), 75.\n\n[4] Michael Soldatenko, “Aztlan: How a Journal Built a Discipline,” Dialogo 20, no. 2 (Fall 2017): 11.\n\n[5] Max Krochmal, “Connecting to Activists and the Public through the Civil Rights in Black and Brown Oral History Project,” Labor: Studies in Working-Class History of the Americas 13, no. 3 (December 2016): 15.\n\nBibliography\n\nChávez, John R. “Aliens in Their Native Lands: The Persistence of Internal Colonial Theory.” Journal of World History 22, no. 4 (December 2011): 785-809. Accessed February 28, 2018.\n\nKrochmal, Max. “Connecting to Activists and the Public through the Civil Rights in Black and Brown Oral History Project.” Labor: Studies in Working-Class History of the Americas 13, no. 3 (December 2016): 15-17.\n\nMárquez, Benjamin, and Rodolfo Espino. “Mexican American Support for Third Parties: The Case of La Raza Unida.” Ethnic and Racial Studies 33, no. 2 (February 2009): 290-312. Accessed February 28, 2018.\n\nRodriguez, Marc S. Rethinking the Chicano Movement. American Social and Political Movements of the Twentieth Century. New York: Routledge, 2014.\n\nSoldatenko, Michael. “Aztlán: How a Journal Built a Discipline.” Diálogo 20, no. 2 (Fall 2007): 7-18. Accessed February 28, 2018."}, {"url": "https://www.britannica.com/biography/Rodolfo-Gonzales", "page_content": "Rodolfo Gonzales, byname Corky, (born June 18, 1928, Denver, Colorado, U.S.—died April 12, 2005, Denver), Mexican American boxer, writer, and civil rights activist who was a leading figure in the Chicano Movement of the 1960s and ’70s. Because of his prowess as a boxer, he was known as the “fist” of the movement.\n\nGonzales’s mother died when he was two years old, and his father raised him and his siblings. The family was poor, and Rodolfo often helped his father, a migrant worker, in the sugar beet fields. He earned the nickname “Corky” after his uncle commented on his personality, saying that he was “always popping off like a cork.” In 1944 Gonzales graduated from high school, and he subsequently enrolled at the University of Denver, hoping to pursue a degree in engineering. However, due to financial issues, he left after one semester.\n\nBritannica Quiz Sports Quiz\n\nMeanwhile, Gonzales had begun training as a boxer in 1944. He won several important amateur competitions, and in 1947 he turned professional, fighting in the featherweight division. He had a successful career, retiring in 1955 with a record of 65 wins, 9 losses, and 1 tie.\n\nGonzales entered the business world, first opening a neighbourhood bar and then a bail bonds establishment. He also became politically active, dedicating his time to helping poor Chicanos. In the 1950s and ’60s he ran unsuccessfully for several political offices, including on the Denver City Council and in the Colorado state legislature. He also lost bids to become a state senator and the mayor of Denver. In 1960 he campaigned for John F. Kennedy’s presidential run and worked to attract Chicano voters to the Democratic Party. In 1965 the mayor of Denver appointed Gonzales director of the local chapter of the Neighborhood Youth Corps, which provided job training for poor and underprivileged young people. However, he was fired the following year after he organized a protest against a newspaper for printing racist remarks about Chicanos.\n\nIn 1966 Gonzales founded the organization Crusade for Justice. Until its demise in the mid-1970s, the group offered the Chicano community such benefits as job training, a food bank, and a bilingual school for children that encouraged cultural pride. Crusade for Justice also protested against police brutality, racism in the media, and employment discrimination. In 1969 the group helped Denver high-school students organize a walkout when the school administration failed to fire a teacher who had used racist language.\n\nCrusade for Justice also joined other civil rights organizations in national movements. The group notably participated in the Southern Christian Leadership Conference’s Poor People’s Campaign, which culminated in a demonstration in Washington, D.C., in 1968. Protesters—who included African Americans, whites, Native Americans, and Hispanic Americans—demanded that the government address the employment and housing problems of the poor throughout the United States. In addition, Gonzales joined Cesar Chavez, who had helped organize poor farm labourers into the powerful National Farm Workers Association, in marches and demonstrations.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThroughout his life Gonzales wrote about Chicano experiences. His document “El Plan Espiritual de Aztlán” (“The Spiritual Plan of Aztlán”) encouraged Chicanos to strive for economic, cultural, and political freedom and, ultimately, self-determination. (Aztlán refers to the ancestral land of the Aztecs that the United States annexed from Mexico under the treaty ending the Mexican-American War in 1848.) The First National Chicano Youth Liberation Conference, which Crusade for Justice hosted in 1969, chose the plan as the Chicano Movement’s manifesto. Gonzales is perhaps best known, however, for the epic poem I Am Joaquín (Yo Soy Joaquín), which was published in both English and Spanish in 1967. Its narrator discusses Mexican and Mexican American history and outlines the struggles that Chicanos have endured in their quest for a cultural identity and equal rights."}]}