{"Rudy Fernandez was a tireless advocate for the rights of workers and immigrants.": [{"url": "https://alchetron.com/Rudy-Fernandez-(labor-leader)", "page_content": "Rudolfo Austria “Rudy” Fernandez, Sr. (July 26, 1927 – June 9, 1979) was a prominent Filipino Labor Leader, Trade Unionist and staunch opposer of the late President Ferdinand Marcos in Davao City, Philippines. He was one of the original organizers of the Trade Union Congress of the Philippines (TUCP/KMP) in 1975 and helped draft, develop, and establish its constitution and by-laws. He first came into the Philippine Labor Movement arena when he founded the Davao Port General & Transport Worker’s Union (DPGTWU), now the Association of Trade Unions - TUCP (ATU-TUCP), in Davao City. DPGTWU was one of the most active labor organizations in Davao City and its membership spread throughout Mindanao in the Southern Philippines during the years between 1967-1979. He ran for the Interim Batasang Pambansa (IBP) in the Philippines in 1978 as an Industrial Labor Sectoral Representative for the Mindanao Region but ultimately lost against his closest rival, Princess Porti Pacasum, daughter of one of the richest Lanao Muslim clans and owner of the biggest transport company in Lanao, Philippines.\n\nEarly life and career\n\nRudolfo A. Fernandez, Sr. was born in Sibonga, Cebu on July 26, 1927 to a prominent clan of landowners. His father, Mateo Fernandez, was a local police constable and his mother, Magdalena Austria, was a housewife. During his grade school years, Rudy was bright and became active in debates and oratorical contests. During World War II (1945–1947), the young Fernandez, still in his teens, made use of his expertise in the English language and became the local messenger and interpreter between the American troops and the guerillas who were fighting against the Japanese Occupational forces. Fernandez dreamed of becoming a boxer and left his hometown to join a carnival in the hope of becoming one. He was found and brought home by his father, Mateo, who implored him to finish his studies since it was where he excelled. Also while in his teens, Fernandez joined his older brother Vitaliano Fernandez, a prominent Civil Engineer in Cebu City, to continue his tertiary education at the University of the Visayas. He left the university and migrated to Davao City, Southern Philippines to be with his other brother Ramon Fernandez, Sr. and worked in his stevedoring business to pursue his dream of becoming a lawyer.\n\nHe studied law at the International Harvardian University (IHU) in Davao City where he met his soon-to-be wife, Antonia Valenton Militante, the local campus belle at that same university and was in her senior year in high school. Fernandez soon became the president of their University's debate team and further improved his skill in speech and argumentation. This flair for discourse in the young Fernandez would be very instrumental in his becoming a skilled Labor organizer. The young Fernandez and Antonia were frequently seen in local clubs and parties and were always the center of these gatherings. Fernandez together with his wit and charm, was also known to be an exceptional dancer. He eventually married Antonia on November 10, 1951. The couple had eleven children named: Matthew, Rodolfo, Jr., Ruby Carmen, Ivan, Hope, Faith, Charity, Strauss, Pearl, Ruth and Rodolfo, III. He became a court stenographer of the local circuit court. His apprenticeship in the Labor movement was honed in the defunct Mindanao Congress of Labor as a labor organizer, then he joined the Philippine Labor Express as a columnist, and also became a radio reporter. Because of his growing family, he soon had to quit college. Fernandez and his wife Antonia separated in 1968. Later, he had two more children, Dean and Lynn, with his common-law wife, Vivian Alvar. Fernandez also became the secretary of then-Congressman Ismael Veloso (NP). Despite his serious years as secretary of Congressman Veloso, Fernandez never lost his devil-may-care attitude. He kept on attending club parties and went on to join club dance showdowns and charmed everyone. It was at this time in his life that Fernandez met and frequently partnered with Nida Blanca, one of Manila's most beautiful women and the queen of the city's club dance showdowns. However, Fernandez’ stint in the Mindanao Congress of Labor urged him to leave Manila and continued to pique his interest in the Labor Movement.\n\nThe labor movement\n\nRudolfo A. \"Rudy\" Fernandez, Sr. eventually became an active Labor organizer in Davao becoming fully aware of the unhealthy and unlawful practices of the local companies and industries towards their workers and employees. Workers and or laborers during those times in Davao were predominantly oblivious of their basic legal rights and how to attain them and companies aware of this fact, were mostly abusing this ignorance. He founded his own labor organization called the Davao Port, General & Transport Worker’s Union (DPGTWU) with the mission of stamping out all forms of oppression against local workers and educate them of their basic legal rights and on organized labor. DPGTWU was then organized and Fernandez was elected as its first president in 1965.\n\nIn 1964, Fernandez’ suffered a massive cardiac arrest and became paralyzed. Most of his relatives, friends and detractors thought he would die. He was confined in the hospital for almost 3 months and was under physical therapy for almost 6 and then gained back his strength to walk again and continue his dauntless efforts as a Labor Leader. Some of his loyal supporters said that Rudy defied death even while already in its brink because of his burning refusal to die. Fernandez’ brush with death, they say, was the turning point of his life. DPGTWU flourished and gained a large union membership in the Lumber Industry (i.e. Santa Clara Lumber Co., Kalinan Timber Corp. of the Consunji Family, etc.), the Food Production and Agricultural Industry (i.e., London Biscuit Co. (LONBISCO), and in the local Automotive Industry (i.e., Davao Motor Sales Inc. (DAMOSA), etc. Fernandez gained a reputation of being a tough negotiator in collective bargaining agreements with companies or industries he was dealing with then. He would further become known as a champion of workers in Davao City and was also recognized as a resillient and honest man. He marshaled his union into big companies and industries and was often offered bribes which he refused, by some of their owners so as not to organize a union in their companies. Instead of getting crossed for gaining access in his companies, Don Antonio O. Floirendo, Sr., the owner of the then Davao Motor Sales Corporation (DAMOSA) and Anflocor and one of the richest men in the country, became one of his staunchest ally and friend, and soon further gained his trust and friendship. Don Florendo could not forget Fernandez' quip when he once told him that he is quite good in what he is doing and Fernandez answered him, \"I should be, I worked hard to get to where I am now.\" The former said, Fernandez' remark was uttered without afterthought just as if it was just that, a certainty, so sure of himself. Florendo further related that is how Fernandez instills confidence to people who hears and listen to him: by the firmness of his voice when he talks and that, is a gift of gab. Having gained recognition in the labor movement, he was frequently invited into Davao City’s important occasions and gained the friendship as well as enmity of local politicians, broadcasters and prominent clans because of his often frank and fearless comments against the Marcos dictatorship and the local political scenery. It was during these gatherings that he befriended the country’s future Speaker of the House, Prospero Nograles, Davao City's former Mayor and the Department of the Interior and Local Government (DILG) Secretary of the Philippines' 11th President Corazon Aquino’s cabinet, Mayor Luis T. Santos and Ernesto Macasaet, Davao City’s Chief of Police, who eventually became a good friend of his. Maintaining his empathy towards the workingmen he had sworn to serve, he was known to offer generous help to them keeping his home constantly open whenever they come to him for food and provide whatever assistance he could give. Due to Fernandez’ open criticisms against the Marcos' dictatorship and his close association with Davao City's local Liberal Party Chapter, his house and residence in Talomo, Davao City was raided by the Military and searched the next day after Marcos declared Martial Law in 1972, with an alleged tip that he was hiding an arsenal of guns. A wildfire of rumors spread in Davao City that he was going to be arrested for illegal possession of firearms or for any other drummed up charges. But, Fernandez using his knack in diplomacy defused the tension that arose at that time and the Military left his residence finding nothing and left him alone to carry on with his labor pursuits.\n\nIn 1973, Fernandez wrote an original oratory, “The Role of the Youth in the New Society” which was delivered by his second son Rodolfo, Jr., and won second place in the Philippines’ National Oratorical Contest for all Naval ROTC on October 20, 1973 held at the Philippine Navy Headquarters in Manila. The brilliant piece is still kept in the archives of the Philippine Women's University, Manila to this day.\n\nOver the next few years despite Fernandez being a very vocal opponent and his oppositionist leaning, the government supported collective bargaining, and the regulation of the minimum wages and strikes were still allowed although constrained. (QUOTE) DPGTWU flourished and spread and he soon made frequent trips to Manila in order to exchange ideas and ideologies among his fellow labor leaders in the Philippine’s capital city, among them Senator Blas F. Ople, the Secretary of Labor during that time, Democrito T. Mendoza, National President of TUCP-KMP, Ernesto Herrera, Secretary-General of TUCP-KMP, who would soon become a senator in the country, the activist Luis Taruc and Eulogio R. Lerum, Sr., Chief Legal Counsel of TUCP-KMP. The Trade Union Congress of the Philippines (TUCP) was soon organized. It became the labor center to represent labor in the tripartite system of labor relations in the country under the period of labor repression. Fernandez helped organized and established the Trade Union Congress of the Philippines (TUCP/KMP) and aided, wrote and improved its constitution and by-laws. Fernandez was elected as one of TUCP’s Vice Presidents and was chosen to represent the country as a Labor Observer in Europe in 1976 which was sponsored by the International Labour Organization (ILO). Fernandez, together with his fellow Asian Labor Representatives, visited Yugoslavia and ILO’s main offices in Geneva, Switzerland. Back in the Philippines, despite being swamped with labor work, Fernandez, a Roman Catholic and a known devotee of the Santo Niño de Cebú (Holy Child of Cebu), never fails to visit the Basilica where it is ensconced. This has been one of Fernandez' generally recognized proclivities and a quirk which he had developed during his later years, wherein he never goes to church in any other place nor province except in the Basilica del Sto. Nino located in Cebu City.\n\nIn April 1978, Fernandez ran as a sectoral assemblyman for the Industrial Labor Sector, Mindanao Region in the Interim Batasang Pambansa (IBP)’s Philippine parliamentary elections and was a favorite among all the provincial governors of Mindanao to win. He eventually lost to Princess Porti Pacasum of Lanao, Philippines, the daughter of one of its biggest transport companies despite being the favored candidate to win. Fernandez a defeated man became literally old overnight. He was so sure of winning due to the strong support of 90% of the Mindanao governors spearheaded by Gov. Nonito D. Llanos, Sr., then governor of Davao del Sur and their electoral representatives. He suspected that the win was due to vote-buying, a common political strategy in the Philippines’ political setting. Fernandez then decided to file an electoral protest to the Commission on Elections and was quite confident that it will result in his favor. The evening before he was about to file the protest, the then First Lady Imelda Marcos, visited Fernandez who was accompanied by his daughter Faith in Manila, and swayed him not to go through with the protest because it might get the ire of the Muslim population in Mindanao. Since Mindanao is predominantly Muslim, she said it would be best that a Muslim should win. Fernandez suspected that Imelda Marcos wanted Pacasum to win, because Mrs. Marcos was active in the Mindanao Peace efforts at that time and it would look good in her peace efforts. Knowing that the Marcos government is behind Pacasum and realizing their influence, Fernandez didn’t continue filing the election protest and headed back to Davao City a disillusioned man.\n\nIt was during this period in his life that his heart illness became worst. After the IBP elections, Fernandez continued with his unrelenting labor efforts and DPGTWU remained highly regarded and robust. He nonetheless went to another observation trip to the US representing TUCP/KMP in October 1978 upon the sponsorship of the Asian American Free Labor Institute (AAFLI) and toured 14 cities some of which were, Washington, D.C., New York City, and Chicago. The observation trip was cut short when he suffered a pulmonary heart attack in Chicago and was soon flown back to the Philippines by TUCP/KMP after being hospitalized for a brief period there. Meanwhile, during his term as president of DPGTWU, he was also elected as the President of the local Rotary International's District 3860 Toril, Davao City (then a municipality of Davao) in 1977. He further ran for the local Barangay elections in Talomo District, Davao City as Barangay Captain but then lost the seat to a local moneyed favorite.\n\nDeath and legacy\n\nFernandez, with his health in decline and defiant of his doctors' wishes continued with his labor efforts and was still active in DPGTWU and TUCP/KMP in late 1978 and early 1979. He felt he was invincible and he never believed that death would overcome him. During a stop-over to Cebu City, in one of his frequent trips and visiting one of his daughters studying in Cebu, he suffered a severe stroke upon disembarking from a plane in Mactan-Cebu International Airport’s tarmac. He was rushed to the nearest Perpetual Succour Hospital and was pronounced dead on arrival (DOA) on June 9, 1979 at 10:00 in the morning. A wake was held in Cebu for most of his relatives there and his body was flown to Davao City to be with his family and children. Buried at the Davao Memorial Park, his burial was attended by Davao’s prominent citizens, some of TUCP-KMP’s officers and his fellow workingmen. He used to say in one of his frequent monologues that he had always wanted to die in his hometown and he got his wish when he died in Cebu City. He left behind 13 children and two wives and a legacy of strength, integrity and wisdom within the Philippine’s labor movement, his family & friends, and his compatriots."}, {"url": "https://blog.dol.gov/2021/09/15/5-hispanic-leaders-who-changed-labor-history", "page_content": "En español\n\nFrom left: Emma Tenayuca, Santiago Iglesias Pantin, Dolores Huerta, Cesar Chavez and Luisa Moreno\n\nHispanic workers have played an important role in the history of the nation and the labor movement. Here are five labor leaders who have made important contributions to work in America.\n\nCesar Chavez\n\nOne of the country’s most famous labor advocates, Cesar Chavez led the United Farm Workers of America. Embracing non-violent acts of civil disobedience, Chavez drew attention to discrimination and brought about policies that improved working and living conditions for farmworkers around the country. For Chavez, strikes and other forms of peaceful protest were tools for improving the lives of others. “The fight is never about grapes or lettuce. It is always about people,” he said.\n\nDolores Huerta\n\nDolores Huerta co-founded the National Farm Workers Association (later the United Farm Workers) with Cesar Chavez in 1962. Huerta directed a national grape boycott to protest the dangers of pesticides on grape pickers, which led the entire California table grape industry to adopt safer practices. She also negotiated the first collective bargaining agreement with an agricultural business to secure better wages and working conditions for farmworkers. Throughout her career, Huerta fought for world peace and the rights of immigrants, women, minorities, at-risk youth and LGBTQ+ Americans.\n\nSantiago Iglesias Pantin\n\nAn outspoken advocate for workers’ social and economic wellbeing, Santiago Iglesias Pantin served as the American Federation of Labor’s organizer for Puerto Rico and Cuba at the start of the twentieth century. When the San Juan News accused him of violent agitation, Iglesias defended himself, saying, “My mission is most eminently American. For the organization of the working people, for their education, and for their liberty.” He was the resident commissioner of Puerto Rico from 1933 until his death in 1939, and his successor Bolivar Pagan described him as “the main voice heard in a 40-year fight to raise up conditions of labor, to make the common man be conscious of all the rights and privileges under American democratic institutions.”\n\nLuisa Moreno\n\nA passionate advocate for women and immigrant laborers’ rights, Luisa Moreno helped create a coalition of Latino labor rights activists in the 1930s. Moreno, who was born in Guatemala, organized New York garment district workers, Louisiana cane workers and Florida cigar rollers. She also helped found the National Congress of Spanish-Speaking Peoples, which advocated for integration and fair treatment of Latino laborers.\n\nEmma Tenayuca\n\nMexican American labor organizer Emma Tenayuca participated in the 1933 walkout of women cigar workers, and later helped form two International Ladies' Garment Workers' Union locals. She also protested border patrol abuses, led demonstrations and strikes, and advocated for Mexican immigrant workers’ right to unionize without fear of deportation. In 1938, when Tenayuca was in her early twenties, she led a pecan shellers’ strike after factory owners sliced wages. The strike was one of the largest in U.S. history, and one of the first significant labor equity victories for Mexican Americans.\n\nWhile they came from different background and worked in different industries, Chavez, Huerta, Iglesias, Moreno and Tenayuca all recognized that a fair day’s work deserves a fair day’s wages, and their sacrifices and leadership have contributed to safer, healthier, fairer working conditions for all of America’s workers.\n\nJeff Freund is the director of the U.S. Department of Labor’s Office of Labor-Management Standards.\n\n5 Líderes Hispanos que Cambiaron la Historia del Trabajo\n\nPor Jeffrey Freund\n\nDe izq. a der.: Emma Tenayuca, Santiago Iglesias Pantín, Dolores Huerta, César Chávez, y Luisa Moreno\n\nLos trabajadores hispanos han jugado un papel importante en la historia de la nación y del movimiento sindical. Estos son cinco líderes laborales que han hecho importantes contribuciones al trabajo en Estados Unidos.\n\nCésar Chávez\n\nUno de los más célebres defensores de los trabajadores del país, Cesar Chávez lideró el sindicato Unión de Campesinos. Adoptando actos no violentos de desobediencia civil, Chávez llamó la atención sobre discriminación e impulsó políticas que mejoraron por todo el país el trabajo y las condiciones de vida de los trabajadores agrícolas. Para Chávez, las huelgas y otras formas de protesta pacífica fueron instrumentos para mejorar la vida de la gente. “La lucha nunca es sobre uvas o lechugas. Es siempre sobre personas”, dijo.\n\nDolores Huerta\n\nDolores Huerta cofundó la Asociación Nacional de Trabajadores Agrícolas (más tarde, Unión de Campesinos) con César Chávez en 1962. Huerta organizó una protesta nacional contra la uva para oponerse a los peligros de los pesticidas sobre los recolectores de uva. Esta protesta condujo a toda la industria de la uva de mesa de California a adoptar prácticas más seguras. Huerta también negoció el primer convenio colectivo con una empresa agrícola para lograr mejores salarios y condiciones laborales para trabajadores agrícolas. A lo largo de su carrera, Huerta luchó por la paz y los derechos de inmigrantes, mujeres, minorías, jóvenes en riesgo y estadounidenses LGBTQ+.\n\nSantiago Iglesias Pantín\n\nFirme defensor del bienestar social y económico de los trabajadores, Santiago Iglesias Pantín se desempeñó como organizador de la Federación Regional de Trabajadores de Puerto Rico y Cuba a principios del siglo 20. Cuando el San Juan News lo acusó de agitación violenta, Iglesias se defendió afirmando que “mi misión es eminentemente americana. Por la organización de la gente trabajadora, por su educación, y por su libertad”. Fue comisionado residente de Puerto Rico desde 1933 hasta su muerte en 1939, y su sucesor Bolívar Pagán lo describió como “la principal voz de una lucha de 40 años para alzar las condiciones laborales, para que el hombre común sea consciente de todos los derechos y privilegios otorgados por las instituciones democráticas Americanas”.\n\nLuisa Moreno\n\nApasionada defensora de los derechos de la mujer y los trabajadores inmigrantes, Luisa Moreno ayudó en la década de 1930 a crear una coalición de activistas latinos por los derechos laborales. Moreno, que nació en Guatemala, organizó a trabajadores del distrito de la costura de Nueva York, a trabajadores de caña de Luisiana, y a los enrolladores de puros de Florida. Ella también ayudó a fundar el Congreso Nacional de Pueblos de Habla Española, que abogó por la integración y el trato justo de los trabajadores latinos.\n\nEmma Tenayuca\n\nLa organizadora laboral mexicoamericana Emma Tenayuca participó en la huelga de 1933 de las trabajadoras de puros y más tarde ayudó a formar dos sucursales del Sindicato Internacional de Trabajadoras de la Costura. Tenayuca también protestó abusos de la patrulla fronteriza, encabezó manifestaciones y huelgas, y defendió el derecho de trabajadores inmigrantes mexicanos a sindicalizarse sin temor a ser deportados. En 1938 y con poco más de veinte años, Tenayuca encabezó una huelga de desgranadores de nueces después de que los dueños de fábricas recortaran los salarios. La huelga fue una de las más grandes en la historia de Estados Unidos y una de las primeras victorias significativas de los mexicoamericanos en materia de equidad laboral.\n\nAunque tuvieron diferentes orígenes y trabajaron en diferentes sectores, Chávez, Huerta, Iglesias, Moreno y Tenayuca reconocieron todos que un día de trabajo justo merece un salario justo. Sus sacrificios y liderazgo han contribuido a condiciones de trabajo más seguras, saludables y justas para todos los trabajadores de América.\n\nJeff Freund es el director de la Oficina de Normas Obrero-Patronal del Departamento de Trabajo de EE.UU."}, {"url": "https://catholicmoraltheology.com/the-catholic-church-and-the-struggle-for-the-rights-of-workers-and-immigrants/", "page_content": "Today is May Day, and across the country people will be taking to the streets to protest against the Trump administration’s immigration policies. Although May Day has traditionally been considered a day of struggle for the rights of workers, in recent years in the United States it has come to be associated with the rights of immigrants, as well. In 2006, for example, over a million people nationwide joined protests against harsh immigration measures then being considered by the U.S. House of Representatives. Although today’s protests are not expected to come close to those numbers, there will be events in around 200 cities across the country, with the largest being marches in New York, Chicago, Los Angeles, and Washington, DC.\n\nMay Day, or International Workers’ Day, was first celebrated by socialists, communists, and others involved in the workers’ movement in the late nineteenth century to commemorate the Haymarket affair, a labor protest that fell into violence in Chicago in 1886. In 1955 Pope Pius XII designated May 1 a feast day of St. Joseph, the Patron of Workers, to counteract the communist connotations of the day and to strengthen Catholic efforts to advocate for the rights of workers. Of course, the rights of workers had been central to official Catholic social teaching since Pope Leo XIII’s Rerum Novarum, in 1891 and even earlier to the work of Catholic labor leaders and other advocates.\n\nCatholic history and teaching provide many reasons why it makes sense to link the rights of workers and the rights of immigrants. In the United States, many of the workers who participated in those earliest May Day protests were themselves immigrants from countries like Ireland, Poland, Italy, and Czechoslovakia, and a good deal of them were Catholics. In later decades Catholics held a significant number of leadership roles in labor unions in the U.S., and the U.S. Catholic bishops and organizations like the Association of Catholic Trade Unionists (ACTU) helped organize and train workers.\n\nIn later decades when union opinion was divided on the issue of immigration, Catholics played a significant role in uniting the two causes. For example, Msgr. George Higgins, who long worked on labor issues for the U.S. bishops, argued that labor unions should make efforts to organize immigrant workers, both legal and undocumented, to ensure fairer working conditions for those workers, both as a matter of justice and to prevent unfair competition with American workers.\n\nIn today’s political rhetoric, immigrants are often portrayed as a threat to native-born American workers. Immigrant laborers are willing to work for relatively low wages, and therefore drive down the wages of native-born workers through competition. Even in highly skilled sectors like the tech industry, employers are willing to hire immigrant workers over their American counterparts. Catholic social teaching, however, suggests that we should resist the temptation to pit vulnerable groups against one another, particularly when doing so lets off the hook those who are exploiting them.\n\nCatholic teaching makes clear that workers must not only be paid a fair wage and provided with safe working conditions, but that they should have at least some role in the management (if not the ownership) of the business. The availability of immigrant labor can certainly undermine labor unions’ efforts to achieve these goals, which is why in recent decades labor unions have focused on organizing immigrant workers and applying fair labor standards to worker visa programs. In this way native-born and immigrant laborers can work together as a united front.\n\nSince at least the 1970s, the number of workers in the United States who belong to unions has been on the decline, and unions’ political clout has waned. This is certainly one reason for the unions’ alliance with immigrants’ rights groups, although this alliance is not a panacea. Rather, in addition to aggressive efforts to organize workers in untraditional sectors of the economy, such as those in the fast food industry in recent years, unions must find creative ways to communicate with people about the rights of labor and what can be accomplished through activism and organizing. Catholics must be part of these efforts, and happily labor leaders, in particular AFL-CIO President Richard Trumka, have been open to dialogue and cooperation between the labor movement and the Catholic Church. Let us take this May Day as an opportunity to further this cooperation, whether by participating in a protest or in some other way, and help build a society that better promotes the rights of workers and immigrants."}, {"url": "https://globalnaps.org/issue/workers-rights/", "page_content": "I. Guidelines and General Principles\n\n“According to these premises, as well as in the framework of Italy’s constant commitment as a member of the Human Rights Council, the second Italian NAP-BHR intends to strengthen the application of the UNGPs through a series of complementary measures, referring in particular to the following guidelines:\n\n– addressing issues and practices related to the protection of the environment, health, decent work and ‘Human Rights Defenders’, also in the face of the new challenges posed by the gig economy and in the context of the National Recovery and Resilience Plan (NRRP), in correlation with the challenges of multidimensional post-Covid-19 reconstruction” (p. 7)\n\nII. Premises\n\na) Introduction\n\n“A particular attention to BHR issues has been introduced in the Action Plan on Human Rights and Democracy 2020-2024, in the perspective of a wider process for the elaboration of a comprehensive EU framework dedicated to the implementation of the UNGPs. In the aforementioned document, the institutions commit themselves to conducting a dialogue with businesses in order to increase the level of protection and promotion of human rights, with the aim of combating corruption and introducing good practices in the area of corporate social responsibility, Due Diligence, accountability and access to remedy, and to fostering contacts and exchanges between businesses and civil society also in the area of women’s empowerment, sustainable development and decent work.” (p. 9)\n\n“For a commitment to ‘Build Back Better’, it is necessary to strengthen measures to safeguard the rights and social protection of workers, especially female workers, together with greater use of financial assistance and tax relief measures.” (p. 10)\n\nb) Italy and the United Nations Guiding Principles on Business and Human Rights (UNGPs)\n\n“”The NAP addresses the issue of the negative impact of business activities on human rights and identifies specific commitments with the aim of effectively integrating the UNGPs into the national system and business activities” and introduces limited objectives and actions, with reference to the national context translated into the following priorities:\n\n2. The fight against caporalato (especially in the agricultural and construction sectors) and forms of exploitation, forced labour, child labour, slavery and irregular work, with particular attention to migrants and victims of trafficking.” (p. 10)\n\nc) National Priorities\n\n“7. The protraction of planning and implementation of supervisory actions and information initiatives for the prevention of offences and the promotion of legality in the field of outsourcing of entrepreneurial activities and subcontracting chains, aimed at guaranteeing adequate protection for workers and effective awareness of their rights.” (p. 11)\n\nIV. Italian ongoing activities and future commitments\n\nIrregular work and the agricultural sector\n\n“Law No. 199/2016 on combating caporalato in agriculture has already achieved significant results: the Italian Government aims to fully implement the law, not only to repress the phenomenon but also to prevent it, as well as to strengthen the Network of quality agricultural work. To this end, on 16 October 2019, the Inter-institutional Steering Committee on Caporalato was set up, whose work led to the approval of the Three-Year Plan (2020 – 2022) in February 2020. This plan develops the national strategy to combat caporalato and labour exploitation in agriculture and obtained the agreement of the Unified Conference in May 2020.\n\n(…)\n\nIt provides for an implementation strategy articulated in three different phases: an initial phase of analysis of the phenomenon, followed by emergency interventions in the most critical areas and then a systemic action that embraces the entire national territory. The latter is structured on four priority axes that concern: (i) prevention, (ii) vigilance and contrast to the phenomenon, (iii) protection and assistance for victims, (iv) their socio-occupational re-integration. For each of these axes, the Plan identifies priority actions (in a total of 10 actions of which 7 are dedicated to prevention) that involve, in a multi-level governance setting, the different administrations at central, regional and local level. The thematic priorities of the Plan were entrusted to six dedicated Groups, which were joined over time by two additional technical groups committed, respectively, to the development of the information system on the agricultural labour market and to the protection, assistance and socio-occupational reintegration of victims, both coordinated by the Ministry of Labour and Social Policies.\n\nIn 2020 a new working group was created within the Committee coordinated by the Directorate General of Immigration and Integration Policies of the Ministry of Labour and Social Policies. It was dedicated to protection and first aid to victims of labour exploitation. The working group counts upon the collaboration of experts from the Department for Equal Opportunities of the Presidency of the Council of Ministers, ANCI Reception and Integration System (former SPRAR), the Directorate General for the fight against poverty 20 and social planning of the Ministry of Labour and Social Policies, Regions, ANPAL, INAPP, INL, IOM and Consorzio Nova. The work of the group, which started in December 2020, continued in the first half of 2021 and, in particular, 7 meetings were held which led, in line with the objectives of the Three-Year Plan, to the development of a draft of guidelines on the identification, protection and assistance of victims of labour exploitation and a proposal to amend the concerned legislation (Arts. 18 and 22 of Legislative Decree No. 286/1998). The Guidelines were officially presented to Committee in its meeting of 27 July 2021, obtaining broad consensus. The working group also started an in-depth analysis over forms of support and compensation provided in the current legislation and of additional measures that could be issued to promote better protection of victims of labour exploitation.\n\n(…)\n\nThe National Institute of Labour (INL) has launched extraordinary surveillance campaigns based on a multi-agency approach in some areas of Southern Italy (only in the agricultural sector) and of Central and Northern Italy (mainly, but not only, in agriculture) where the phenomena of forced labour and labour exploitation of migrants are particularly present. In order to implement these projects, special task forces were set up consisting of local inspectors, Carabinieri from the Labour Inspectorate Units, inspectors from other territories, as well as the aforementioned cultural mediators. The inspections were 22 planned in coordination with local authorities (Public Prosecutor’s Office and Prefectures) and with other supervisory bodies involved from time to time (INPS, INAIL, State Police, GdF, ASL…). The presence of the IOM cultural mediators, moreover, favoured the establishment of a relationship of trust between the inspection bodies and exploited workers, promoting their cooperation and also ensuring the activity of taking charge and protection of potential victims for the purpose of their subsequent socio-occupational reintegration (also through the paths provided by Arts. 18 and 22 of Legislative Decree No. 286/1998 – Consolidated Immigration Act).\n\n(…)\n\nIn 2020 the INL has significantly implemented its counteracting action on caporalato and labour exploitation. It has also implemented action 8 “Strengthening of surveillance activities and counteracting labour exploitation” of the Three-year Plan to combat labour exploitation in agriculture and caporalato (2020-2022) and of aforementioned project initiatives based on experimentational approach. In particular, the INL has carried out and coordinated extraordinary surveillance campaigns in some areas of Southern Italy (in the agricultural sector only, with the project Su.Pr.Eme (funded by the EU Commission and supported by the project PIU’ SU.PRE.ME, for an amount of about € 50 million for the implementation of interventions in Puglia, Campania, Basilicata, Calabria and Sicily) and Central Italy (mainly, but not only in agriculture, with the project A.L.T. Caporalato! project, financed by the Ministry of Labour and Social Policies for an amount of € 3 million for actions in the territories of central and northern Italy), where the phenomena of forced labour and labour exploitation of migrants are particularly diffused. In order to ensure the best possible organization of task forces in the geographical areas concerned, particular emphasis was placed on the activation of all useful coordination with the local Public Prosecutor’s Office and all appropriate institutional cooperation at territorial level with the Prefecture, the police and other supervisory bodies (INPS, INAIL and ASL). In order to ensure compliance with health and safety regulations and thus contribute to reducing the risk of accidents and preventing occupational deaths, all useful synergies have been activated within the Regional Committees pursuant to Art. 7 of the Consolidated Act No. 81/2008 and the Provincial Committees for the participation of ASL prevention technicians in the activities of the task forces. Finally, contacts were made with the IOM referents of each regional context and with the bodies and associations of the anti-trafficking network in territories involved to ensure timeliness and effectiveness of any interventions to take charge of and provide protection to victims of severe exploitation identified during the operations. According to collected data and constantly evolving, during 2020 in 44 weeks task forces took action in Basilicata, Campania, Calabria and Apulia Regions and in L’Aquila, Latina and Florence provinces: 758 inspections were carried out and 4,767 work positions were checked. As a result of the inspections (some of which are still in progress), to date, 1,069 workers have been identified as being involved in labour violations, 421 of whom were employed illegally, 205 potential victims of labour exploitation were identified and 22 perpetrators were reported to judicial authorities. INL inspection staff activities in the fight against caporalato and labour exploitation, despite difficulties due to the epidemiological emergency, have achieved the following results: – 478 offenders were referred to the judicial authorities, 61 of whom were arrested; – protection of 1,850 possible victims of the crime of caporalato and labour exploitation, 119 of whom are more exposed due to their non-EU citizenship status without a regular residence permit. In relation to the agricultural sector only: – 323 offenders were referred to judicial authorities, 43 of whom were arrested; – identification of 1,104 victims of exploitation, including 55 without a regular residence permit. The percentage of workers who are victims of labour exploitation in relation to the total number of irregular workers in the primary sector was by far the highest at 18.6%. On the other hand, taking as a reference the parameter of the number of irregular inspections defined in the year by the INL staff , in agriculture, an average of 37 exploited workers were found for every 100 inspected companies against which irregularities were contested. In 2021, in light of the significant results achieved the previous year also thanks to the extraordinary task forces of the two projects mentioned above, INL has further strengthened such inspection action on the territory through the scheduling of about 150 weeks of task force, with a commitment more than tripled compared to the 44 weeks of activities carried out in 2020. In addition, given the success of these experiences, on 11 March 2021 the INL and IOM signed a memorandum of understanding. Lasting two years, the memorandum is aimed at structuring the collaboration between the INL and IOM and extending multi-agency interventions to the whole national territory. It also takes into account the indications and objectives of the Three-Year Plan. On the basis of the lessons learnt, specific guidelines for the personnel employed in the surveillance operations on the territory are being developed within the Working Group coordinated by INL. (p.23)\n\nGender dimension\n\n“Regarding gender leadership issues, the Task Force “Women for a New Renaissance”, established by the Ministry of Equal Opportunities and Family in 2020 to address the impact of Covid-19 on gender issues has produced a Final Report, based on quantitative data and qualitative scientific information on the impact of the pandemic in different sectors. Among the Task Force’s multiple proposals there are those ones targeted to:\n\n– increase the proportion of women in all areas of employment;\n\n– overcoming barriers to advancement in career paths, particularly in the fastest growing fields (STEM, computer science, cloud computing, data and artificial intelligence); – countering gender stereotypes that prevent women from achieving leadership responsibilities, in order to activate new energies and opportunities for all.\n\n(…)\n\nThe National Recovery and Resilience Plan (PNRR) also addresses gender inequalities in a cross-cutting manner. In particular, the PNRR places three cross-cutting priorities alongside the three strategic axes shared at European level (digitalization and innovation, ecological transition and social inclusion). This includes the promotion of gender equality, with the aim of investing at least € 7 billion by 2026, to be used to ensure a level playing field in the labour market, close the gender pay gap and increase the number of women in positions of responsibility, ultimately including the presence of women in the political sphere.\n\n(…)\n\nLaw No. 4 of 15 January 2021, ratifying and implementing the International Labour Organization Convention n. 190 on the elimination of violence and harassment in the workplace, represents an important evolution in the field of gender protection in the business context. Legislative Decree No. 81/08 and related Decree No. 106/09 had adequately covered safety issues in the workplace, but had not included the issue of harassment, which in fact is limited to occupational safety measures or to internal policies and voluntary practices of companies. In addition, to clarifying the scope of their application, measure 4/2021 provides for the adoption of an inclusive, integrated and gender-centred approach: the private sector, like the public sector, is therefore adopting concrete procedures and tools with the goal of combating violence and protecting employees through guidance and training on prevention.\n\nWith regard to gender discrimination in the workplace, territorial offices of the National Labour Inspectorate (INL), performing their supervisory activity, also carry out investigations in relation to equal opportunity regulations and the prohibition of gender discrimination in the workplace, including in terms of remuneration.” (p. 29)\n\nChildren’s and adolescents’ rights\n\n“Italy also promotes “family friendly policies”, as national and corporate policies aimed at supporting workers in their role as parents/caregivers. On this issue, UNICEF has formulated some important indications on the best ways Governments and the private sector can build “family friendly” policies:\n\n– encouraging employers to introduce gender-sensitive and inclusive paid leave entitlements, flexible working arrangements and childcare support systems;\n\n– the introduction of paid parental, maternity and paternity paid leave in the early-birth period and for the first year of a child’s life; fair and gender-sensitive parental leave to ensure that no parent is overburdened by family care; leave available to all, both for full-time employees and those working part-time or under non-standard contractual arrangements; and financial coverage linked to birth care;\n\n– childcare services made accessible by the end of parental leave, so that there is no gap in available support;\n\n– quality childcare services, made accessible, flexible and affordable, available to all children, regardless of family circumstances;\n\n– alignment of childcare services with other family support policies, such as universal family allowances, to reduce the risk of existing inequalities in access to public childcare facilities.” (p. 40)\n\nThe principle of Diversity management in the business context\n\n“In general, the issue of inclusion of vulnerable people in the workplace and the promotion of diversity management is a strategic line of action under the mandate of the National Anti-Racial Discrimination Office (UNAR).\n\nWith reference to the adoption of National Plans and Strategies, in coherence with the European indications, UNAR started consultation processes involving administrations at central, regional and local level and third sector representatives for the elaboration of the following documents:\n\n– the National LGBTI Strategy; – the National Plan against Racism, Xenophobia and Intolerance;\n\n– the National Strategy for the Inclusion of Roma, Sinti and Caminanti.\n\nThese Plans and Strategies will foresee, with reference to their respective priority axis “Work”, concretely achievable objectives and actions specifically aimed at the protection of human rights through the promotion of diversity management in the workplace and the sharing and dissemination of good corporate practices.\n\n(…)\n\nOn this matter during 2020 the INL inspection staff implemented, as usual, initiatives for the prevention and promotion of legality, through the organization of specific information meetings, pursuant to Art. 8, paragraph 1, Legislative Decree No. 124/2004. It also deals with equal opportunities and combating discrimination in the workplace. Such regulation is among the competences of Labour Inspectorates at the local level. Through their own inspection staff, they can organize specific events with the purpose of guaranteeing and assuring proper compliance with labour regulations and social security and assistance measures, focusing on the social relevance as well as on legislative and interpretative innovations from Administrations.\n\n(…)\n\nWith reference to the need to draw attention to impacts of business activity on family life and children’s rights, the Department for Family Policies published the new public call “#Conciliamo”, amounting to € 74 million, on 8 November 2019 for family-work reconciliation projects by companies, networks and groups of associated or controlled companies. Available funds will be used for interventions that promote a welfare tailored to families and to improve the quality of life of working mothers and fathers. The call has several specific objectives: the demographic revival, increase in female employment, rebalancing of workloads between men and women, support for families with relatives with disabilities, health protection, combating the abandonment of the elderly. Participation has been opened to companies referred to in Arts. 2082 and 2083 of the Civil Code, as well as networks and groups of related or controlled companies.” (p. 41)\n\nPublic Procurement\n\n“Legislative Decree No. 50/2016 (Public Contracts Code) has transposed 2014 EU Directives in force in this field: basic principles are aimed at guaranteeing access to and the conduct of decent work, respect for social and labour rights, as far as SMEs’ participation in public contracts.” (p. 48)\n\nFight against corruption\n\n“In Italy Whistleblowing was introduced by the anti-corruption law (Law No. 190 of 6 November 2012, “Provisions for the prevention and repression of corruption and illegality in public administration”), adopted in compliance with recommendations and conventional obligations emanating from the UN, OECD, Council of Europe and European Union. This law provides for a system of enhanced protection for public employees who report unlawful conducts. Law No. 179 of 30 November 2017 strengthened the preexisting whistleblower protection for public employees and partially extended the same protection to the private sector.” (p. 50)\n\nInternationalization of companies\n\n“In compliance with Law No. 125/2014, which therefore considers companies as subjects of cooperation, the adherence of the company to the Global Compact has been made a mandatory prerequisite for participation to Profit Call published by the Italian Agency for Development Cooperation and dedicated to Italian and European companies for the implementation of innovative and sustainable business initiatives to be carried out in Developing Countries.\n\nIn order to participate in the above-mentioned Call, companies must have formally adhered to the 10 UN principles of the Global Compact and the UNGPs. Formal adherence to the principles of the UN Global Compact such as those relating to respect for human rights, workers, environmental protection and the fight against corruption, is a necessary requirement not only for sustainable economic growth, but also for the affirmation of democratic and participatory principles and the elimination of discrimination and inequality.\n\nAttention to human resources and compliance with local regulations on worker safety are relevant and qualifying elements in the evaluation of Profit Initiatives in order to ensure respect for workers’ rights, environmental and health standards and human rights. In the Call for Proposals, it is explicitly provided that the implementation of the interventions must take place in compliance with the principles and aims of Law No. 125/2014, international standards on human rights, decent work, social responsibility and environmental protection, as well as the rules on public contracts and, in particular, the Public Contracts Code.” (p. 54)\n\nANNEX 1 – Accountability Grid and Assessment Tools for the Implementation of the NAP\n\n“2. Update the implementation assessment information of Legislative Decree No. 231/2001 in order to evaluate its extension in terms of objectives and application of the administrative liability of legal persons, and to pursue the following objectives in this area:\n\n– the fight against the crisis and the rate of unemployment suffered by economic sectors most affected by measures to counter the epidemic emergency (catering and the gastronomic sector; tourism/hotel sector; small businesses/individuals in the craft and retail sectors of Made in Italy);\n\n– the implementation of inclusion policies that enhance the value of the human being coming from the most socially fragile contexts, with particular reference to the contribution offered by female population, through its full involvement in management and in social recovery of the assets in question” (p. 61)\n\n“3. Strengthen the role of competent bodies and inspection activities in combating and controlling the emergence of irregular work and caporalato, pursuant to Art. 103 of the “Relaunch” Decree-Law No. 34 of 19 May 2020 (“Emergence of labour relations”)” (p. 61)\n\n“4. Ensure the full implementation of the Three-Year Plan to Combat Labor Exploitation in Agriculture and Caporalato 2020-2022.” (p. 61)\n\n“5. Develop new coordination measures in the activities of prevention and control of the phenomenon of irregular work and to encourage the operation of the “Network of quality agricultural work”.” (p. 61)\n\n“6. Ensure full implementation of the National Action Plan against Trafficking and Serious Exploitation of Human Beings.” (p. 62)\n\n“8. Continue to implement the provisions contained in the Second Disability Action Programme, with particular reference to line 5 “Labour and Employment” and to provisions concerning the definition of support measures and a system of incentives for first and second level bargaining over flexibility, part-time work and work-life balance for persons with disabilities or serious and chronic progressive illnesses or caregivers of persons with serious disabilities.” (p. 62)\n\n“9. Promote the employment inclusion of persons with disabilities with attention to persons with disabilities with more severe disabling conditions.” (p. 62)\n\n“11. Promote in a strengthened way women’s leadership and women’s empowerment in the business sector, through an effective implementation of Law No. 120/2011, and to strengthen measures to prevent gender discrimination in the workplace – depending on the better implementation of Law No. 4 of 15 January 2021 of ratification of the International Labour Organization Convention No. 190 on the Elimination of Violence and Harassment in the Workplace. To this complex end, further actions will be promoted to:\n\n(i) certify equality for companies through the definition of a simple, fast, streamlined and objective tool that measures the situation of staff according to different factors (recruitment, remuneration, career development), capable of stimulating change and having an impact on the entire productive and social system;\n\n(ii) assess the gender impact (ex-ante and ex-post) in all business processes, in particular with regard to corporate restructuring processes (relevant for safeguarding gender balance in the post-Covid phase);\n\n(iii) to promote transparency measures provided for in current legislation on compliance with gender equality rules by companies and public bodies.” (p. 62)\n\n“13. Consolidate the commitment made at the national level with respect to international standards, in particular the Protocol relating to ILO Convention on Forced Labour of 2014 and Recommendation CM/Rec(2016)3 (monitoring) adopted by the Committee of Ministers of the Council of Europe with reference to business and human rights.” (p. 63)\n\n“14. Update the information on the current legislative framework to combat illegal work and labour exploitation in the agricultural, construction, manufacturing and service sectors.” (p. 64)\n\n“21. Reaffirm as a priority the elimination of all forms of exploitation of child labour in Italy and with reference to the economic activities of Italian companies abroad, as provided for by the relevant ILO Conventions; to this end, encourage the dissemination among companies of initiatives aimed at increasing attention on impacts of business activities on children’s rights and on the need for the inclusion of adequate remedies and mitigation measures as per the risk of violation of such rights. The inclusion of children’s rights in business practices includes: the provision of “family friendly policies” designed to support workers in their role as parents/caregivers (smart working, paid parental leave, social protection and adequate wages for all); the introduction of measures to monitor the presence of minors in the workplace; the adoption of Child Safeguarding Policies/Codes of Conduct to foresee, report and take charge of potential risk situations for minors who come into contact with the company; the provision of security guarantees for digital environment (data protection, access to age-appropriate content, privacy protection).” (p. 64)\n\n“22. Encourage businesses in the dissemination of a culture of non-discrimination by:\n\n(i) the promotion of agreements/protocols of understanding with trade unions and employers’ organizations for common and synergic actions to prevent and combat forms of discrimination in the workplace and for the full inclusion of workers;\n\n(ii) the collection of statistical data on discrimination in employment and diversity management practices in Italian companies;\n\n(iii) the promotion of good inclusive practices in the workplace;\n\n(iv) the promotion of socio-occupational inclusion of transgender people, also through information, training, accompaniment and support to self-entrepreneurship;\n\n(v) the promotion of an action to involve Italian companies, in line with UN Standards Standards of Conduct for Business on Tackling Discrimination against LGBTI people, in order to prevent and countering discriminatory behaviors and conducts against LGBTIQ+ persons and ensuring the full enjoyment of their rights;\n\n(vi) the promotion of socio-occupational inclusion of Roma, Sinti and Caminanti people in precarious socio-economic conditions also through actions aimed at starting employment diagnoses, planning of personalized support towards training and employment, promotion of active social policies to encourage participation in the labour market as well as opportunities and strategies for the development of entrepreneurial initiatives (such as, for example, accompaniment and support for business start-up and/or repositioning of economic companies operating in critical sectors)\n\n(vii) the promotion of entrepreneurial policies and good practices on inclusion and diversity management, entailing the implementation and reporting of the Charter for Equal Opportunities and Equality at Work.” (p. 65)\n\n“23. Monitor the application of artificial intelligence in the workplace (e.g. recruitment mechanisms) for the purpose of assessing impact on human rights in terms of inclusion and non-discrimination.” (p. 65)\n\n“50. Contribute, through exchange with governments and social partners, to good practices and common strategies to support the application of Due Diligence mechanisms in the debate on “Decent Work in the Global Supply Chain” promoted by ILO.” (p. 68)\n\nRead more about Italy"}, {"url": "https://www.philstar.com/entertainment/2008/06/16/67837/being-rudy-fernandez", "page_content": "Being Rudy Fernandez\n\nFor years, a few decades in fact, we shared the fame of movie superstar Rudy Fernandez simply because he was a namesake.\n\nWe often realized his popularity not only among the masa moviegoers but also among those in the upper bracket of society when the audience in a forum came to a hush following our introduction as participant or resource person and all heads turned to the direction where we were.\n\nAlways, we humored the crowd with the hope that they were not dismayed when they saw us in person for the first time. In recent years, we always asked our audience to pray for the recovery of the movie star in his bout with cancer.\n\nWe had not had the opportunity to personally meet Rudy Fernandez the Movie Star, who finally lost his “last battle” with the Big C. But a movie editor-friend of ours had told us years back that we were about as tall and had “soft palms.”\n\nOne time, we missed him by a few minutes when he went to the National Press Club to settle a spat with another movie star through the intercession of our friend, then NPC president Marcelo Lagmay and former FAMAS president Rudy Salandanan.\n\nThe misunderstanding between the movie actors was resolved, all right. Which reflected to peace-loving nature of Daboy — he went out of his way to settle a row.\n\nHe had a soft heart for the small people, too.\n\nConsider: In one of those times when I dropped by the Press Club, I was thanked by some of the NPC employees for supposed Christmas gifts to them.\n\nWhen I asked them about it, they pointed to the sacks of rice which they said came from Rudy Fernandez, thinking that it was us.\n\nActually, I used to contribute cash gifts for the NPC employees during Christmas but not in kind. I told them that the sacks of rice did not come from us.\n\nWhen the NPC staff rechecked the gift’s accompanying letter, they noted that it was the movie actor and his lovely wife Lorna who sent the rice.\n\nAs a science/research and development (R&D)/environment journalist, we were usually invited to speak in seminar-workshop for campus writers and budding media practitioners.\n\nOne such occasion was an Environment Reporting Workshop organized by our good friend, journalist-lawyer Manny “Jun” Satorre of Cebu City. Since Jun did not have the time to fetch us at the airport, he sent his son, who brought a placard bearing the name Rudy Fernandez.\n\nThe placard, the young Satorre told us later, attracted many people in the airport, who waited with him for the arrival of Rudy Fernandez, thinking that he was the silver screen idol.\n\nWe did not arrive on time because we took the “PAL-aging late” plane (in recent years, though, the air carrier had always been on time). And by the time we stepped out of the plane, the well-wishers had left — mostly to eating places because their hunger took the most of them.\n\nOnce, too, we were guests of a Filipino family in Bangkok, Thailand.\n\nThe lady of the house cheerfully introduced us to their small girl as the actor from Manila. The little angel stared at us from head to foot as she walked aroud us. Her verdict: “He is not the movie actor!” Laughter.\n\nOne semester when we were yet teaching Science Reporting in a state university, many students enrolled in our subject, perhaps (we surmised) attracted by the teacher‘s name: Rudy Fernandez. It was a tough course (writing features or news articles out of scientific studies so that the research results could be understood and made use of by ordinary people). But by the middle of the semester, some of the students had backed out.\n\nOver the past few years, we had conducted workshops on Science/Development Reporting for student journalists and government R&D agencies.\n\nThe task had taken us to, among other institutions, the Benguet State University (for the writers in the Cordilleras), the Department of Agriculture-Philippine Rice Research Institute (for those in Central Luzon), Aklan State University (for those of state colleges and universities in Western Visayas, and University of Southeastern Philippines in Davao City (for those in Southern Mindanao).\n\nAlmost always, the streamer announcing the name of the seminar-workshop lecturer (Rudy Fernandez) attracted curious people.\n\nBut, of course, there are a thousand and one Rudy Fernandez across the length and breadth of the archipelago.\n\nOnce, former Laguna Gov. Joey Lina and this writer were seated side by side in a gathering in Calamba City, the two of us being among the invited speakers. He had told us that I was the third person named Rudy Fernandez that he had met.\n\nIn a research forum we attended in Baguio City one time, we unwound in one of the hotel rooms after a hard day’s work. When we ran out of finger foods, we called up the hotel management to send more canapés.\n\nAfter a while came the waiter with our order. His name, as written in his nameplate Rudy Fernandez.\n\nAt The STAR, some of the staff members fondly address us Daboy.\n\nBy the way, for almost two decades, we were division head of a Philippine government-hosted Southeast Asian Center. And did you know that my long-time secretary’s name is Lorna?\n\nRudy Fernandez was a good actor, who epitomized the just and defender of the oppressed. And Rudy Fernandez the Writer admits he relished his movies.\n\nOne time, we flew to Tuguegarao City (Cagayan) to speak in a seminar on Development Communication. The following day, we were bleary-eyed because the night before, though tired, we finished a Rudy Fernandez starrer depicting the life of feisty police officer Bobby Ortega or Bungo shown in our room’s television set.\n\nTinseltown has just lost one icon it can really be proud of. But his legacy lives on."}, {"url": "https://www.nzherald.co.nz/northern-advocate/news/ngapuhi-leader-rudy-taylor-dies-after-lifetime-of-tireless-advocacy-for-northland-maori/U5VC4HZJH5A3KDLHYOFIHT6OPM/", "page_content": "Ngāpuhi leader Rudy Taylor at Te Tii Marae during the release of the Waitangi Tribunal report into the first stage of the iwi's treaty settlement claims. Photo / Michael Cunningham\n\nNgāpuhi leader Rudy Taylor at Te Tii Marae during the release of the Waitangi Tribunal report into the first stage of the iwi's treaty settlement claims. Photo / Michael Cunningham\n\nA Ngāpuhi leader described as a tireless advocate for his people, a lifelong Labour loyalist and \"a big man with a big heart\" has died.\n\nKaumātua Rudy Taylor died on Sunday evening after being ill for some time.\n\nTaylor, who picked up the mantle of leadership from his father, the esteemed elder and Waitangi Tribunal member Mac Taylor, held many senior roles in iwi, political and sport organisations at local and national level.\n\nHe served as the chairman of Te Rūnanga-a-iwi o Ngāpuhi but later became an outspoken critic of the organisation, co-leading a group called Te Kotahitanga o ngā Hapu Ngāpuhi which opposed the mandate sought by Tuhoronuku to negotiate a Treaty settlement on behalf of all Ngāpuhi.\n\nHe was also a lifelong Labour loyalist who held key positions in the Tai Tokerau electorate committee and the party's national council.\n\nOn October 10, during her last pre-election visit to Northland, Prime Minister Jacinda Ardern visited his home in Whangārei to award Taylor and his wife Kaye life membership of the Labour Party in recognition of their long service.\n\nLabour deputy leader Kelvin Davis said he wouldn't have become the MP for Tai Tokerau without the Taylors' support.\n\n''Rudy was a big man with a big heart. He was my friend and one of my staunchest supporters,'' Davis wrote in a social media post yesterday.\n\n''Rudy threw himself into everything he did with full commitment, be that rugby league, or working towards resolving the Ngāpuhi issue, or supporting the Labour Party ... He will be sorely missed by whānau right throughout the Hokianga, throughout the Labour Party, and throughout the league fraternity.''\n\nThe Taylors had been his backbone through a number of campaigns, Davis said.\n\n''I rely on them for advice and guidance, we laugh together, we argue, we have major political discussions, and underlying everything we strive to work out what we could do better for our Māori people.''\n\nDavis was expected to fly to Northland yesterday to support the whānau as soon as Parliament concluded its business for the day.\n\nRudy Taylor addresses Labour supporters during the 2014 election campaign. Photo / Greg Bowker\n\nHaami Piripi, chairman of Hokianga iwi Te Rarawa, said as a son of revered kaumātua Mac Taylor and with heritage on both sides of the harbour, Taylor was steeped in the ethic of ''Hokianga hard''.\n\nHe was politically active from a young age and devoted his life to serving the people of the Hokianga and Tai Tokerau.\n\nTaylor was also a top league player in his youth and later contributed to the game's administration.\n\n''He's been a tireless community worker and an advocate for his people against injustice. He had a big influence in his life and he put it to use for his people,'' Piripi said.\n\nLabour's Tai Tokerau chairman Haydn Edmonds said Taylor had served his people and mentored the electorate's MPs for decades.\n\n''After Sir Graham Latimer died he took on the responsibility of advocating for Māori in Northland. He's worked tirelessly for many, many years. It's a huge loss for iwi and hapū in Northland.''\n\nOutgoing Ngāpuhi chairwoman Mere Mangu described Taylor as a \"larger than life icon from the Hokianga\" who would be sorely missed.\n\nThe details of Taylor's hui mate had yet to be confirmed last night."}, {"url": "https://academeblog.org/2021/09/20/remembering-mel-goldfinger-a-tireless-faculty-advocate/", "page_content": "BY RUDY FICHTENBAUM\n\nMelvyn Goldfinger, who was associate professor of neuroscience, cell biology, and physiology at Wright State University, died on September 17 at the age of seventy-four.\n\nMel Goldfinger was a champion for academic freedom, shared governance, and the economic security of the faculty–the three bedrock principles of the AAUP. It was Mel, along with Adrian Corbett, who talked me into joining the AAUP to organize a union at Wright State, and it was he and Adrian who convinced me to be the chief negotiator. Without Mel, there would not have been a union at Wright State. Mel was the first grievance and contract administrator for AAUP-WSU. He was a tireless advocate for faculty rights and never shied away from a fight when there was a principle at stake. He could be charming one minute and be a harsh critic the next. But even as a critic, he was always guided by his principles.\n\nWhen we were organizing, email was just starting to become popular, but it was not yet a reliable way to communicate with all faculty. So we did things the old fashioned way. We created paper flyers that needed to be delivered to faculty mailboxes. The administration prohibited us from using campus mail, claiming that it was illegal. Of course, that was a lie. But we needed to put out a flyer every week during the organizing campaign, and Mel took it upon himself to deliver each and every flyer. Mel had a newspaper delivery bag, from the days when kids road their bicycles and delivered papers by throwing them onto people’s porches. Every week, he could be seen walking from department to department, carrying the flyers in his newspaper bag, making sure they made it into faculty’s mailboxes. Mel started his academic career at the medical school at the University of Missouri-Kansas City (UMKC). If you were ever in Mel’s office/lab, you would know he was a packrat. He never threw anything out. When he moved to Wright State, he even brought scrap paper including old exams and papers from Kansas City. One day, when I was in his office he asked me if I knew a Carl Fichtenbaum. I said, “Yes, he is my brother,” and Mel pulled out an old exam or paper with my brother’s name on it that he had brought from UMKC. After all, my brother had written on only one side of the page; so in Mel’s mind, only half of it had been used. The next time I saw my brother, I asked him if remembered having a class with Mel, and he said, “Oh yeah, Goldfinger, the guy who always wore his belt buckle on the side.” The world was a better place, and Wright State was a better university because of Mel Goldfinger. I will miss Mel.\n\nRudy Fichtenbaum is professor emeritus of economics at Wright State University and past president of the AAUP."}, {"url": "https://www.npr.org/2021/09/19/1038681737/workers-rights-have-long-been-a-tenant-of-u-s-democracy-thank-mexico-for-that", "page_content": "Workers' Rights Have Long Been A Tenet Of U.S. Democracy. Thank Mexico For That\n\nLULU GARCIA-NAVARRO, HOST:\n\nPandemic assistance programs and eviction moratoriums have started to end. And for those who are working, there is the ongoing fight for wages that keep up with rising inflation or paid sick leave or protections for gig workers and benefits for millions of undocumented laborers. Those battles aren't new. The United States is ranked worst among major economies in workers' rights. As part of our series of conversations about our democracy called We Hold These Truths, we're going to be taking a look at history that often gets ignored in the United States when discussing the current state of our union. And that is the history of our regional neighbors. Today, the story of how the Mexican Revolution made workers' rights a central tenet. We're joined now by Alexander Avina. He's an associate professor of Latin American studies, and he specializes in Mexican history at Arizona State University. Welcome.\n\nALEXANDER AVINA: Thank you so much, Lulu.\n\nGARCIA-NAVARRO: OK, we're going to do a bit of a history lesson here. The Mexican Revolution began in 1910 within communities of peasants across Mexico. They were living in poverty. There were land ownership laws, harsh labor conditions. Can you give us an overview of their fight for change, which is the story of the revolution?\n\nAVINA: Yes, of course. When we're talking about the Mexican Revolution, we should start off by saying that it was a peasant-led social revolution that primarily fought for two main things - land and liberty. They were fighting against a Cinco de Mayo war hero, Porfirio Diaz, who had turned into a dictator and ruled Mexico for decades in an era that witnessed the implementation of an economic system that only benefited a few at the top, those close to Porfirio Diaz, who quote, unquote \"modernized\" Mexico but at the expense of peasant communities who - you know, most were landless. They had lost their lands amongst expanding haciendas, or large landed estates, the building of railways and mines, et cetera.\n\nSo you have this rapidly expanding socioeconomic inequality between the people at the top and the vast majority of people in Mexico who lived in the countryside as campesinos, or as peasants. So when the revolution breaks out in late 1910, early 1911, the people who took up arms throughout the country - they did so thinking that they would receive the return of plundered lands or receive new lands from a potentially post-revolutionary government.\n\nGARCIA-NAVARRO: So the revolution stretched on for decades, and there was tremendous loss, with at least 1.7 million Mexicans dying. But a pivotal moment came seven years into the revolution, 1917, when Mexico ratified a new constitution right that envisioned sort of a democracy for the working class. What new protections did it offer workers?\n\nAVINA: Yeah, so the peasants and the workers were not going to put down their arms unless their demands were met, and these demands were enshrined in the 1917 Constitution in the form of agrarian reform, or the redistribution of lands, and an assortment of workers' rights that included the right to organize unions, protection for laboring women and children, the eight-hour workday, a living wage, the sharing of profits for workers, equal wages for equal rights.\n\nGARCIA-NAVARRO: And the new constitution also granted sort of broader social and political rights - right? - which sort of laid the basis for national anti-poverty campaigns. So there were sweeping changes. Can you tell us a little bit about those campaigns and the impact they had in Mexican society?\n\nAVINA: This constitution started with the premise that political democracy was a rather performative gesture unless people's basic needs were met. People's ability to live a life of dignity was a precursor to any sort of political democracy. So, you know, it took some years for some of these radical constitutional precepts to be implemented, and most of them came into being in the 1930s under the populist leadership of Lazaro Cardenas. And that's where you had the massive redistribution of land to peasant communities throughout the country - millions and millions of hectares. And you had a government that was actively siding with labor unions, leading to this famous incident in 1938, in which Mexico nationalized its oil holdings and expropriated them from British and American oil companies. There's also an expanded push to give education and educational opportunities for the sons and daughters of impoverished campesinos living in the countryside.\n\nGARCIA-NAVARRO: Many of these anti-poverty projects endured for decades, and there were fundamental changes to laws to make the economy less oppressive to workers. But we can fast-forward today, and, of course, we know that there are gaping, widespread disparities in Mexico between the haves and the have-nots. Why is that the case? What went wrong?\n\nAVINA: Quickly, what I will say is that the post-revolutionary government, after about 1940, does start to take a more conservative, right-wing turn. Some of these rights that were hard-fought by peasants and workers during the revolution itself were not permanent. They were contingent. And what you see after 1940 is a single authoritarian political party stay in power, shaving off some of these rights. Now, workers and peasants resisted throughout. But, you know, it's a tense relationship between those at the bottom and those at the top. You know, once we get into the 1980s and you have this massive Mexican default on their foreign debt in the early '80s, that really marks a new period of Mexican history, which has only widened this - the level of socioeconomic inequality that we see today.\n\nGARCIA-NAVARRO: What remains, though, of that period?\n\nAVINA: Memories, traditions of rebellion. We still see the indigenous Zapatistas in the state of Chiapas today, generationally reproducing themselves as embodiments of the Mexican Revolution. They took up arms in 1994, and they're still there today, upholding the legacy of the great revolutionary leader Emiliano Zapata. So there's - the ideas, the heritage, the traditions are still there, and the Mexican Constitution is still there. There's been obvious reforms, particularly to privatize Mexican oil, but the document itself is still there. And there's still a potential for radicalism in that document, potentially when people from below are pushing for it.\n\nGARCIA-NAVARRO: I mean, what lessons do you think the U.S. should take from Mexico's historical example? Because right now, the U.S. is at an inflection point, right? It's a year and a half into the pandemic. Congress is starting to weigh a $3.5 trillion spending package that is unprecedented. It would sort of expand access to universal pre-K, higher education, health insurance, paid family leave, on and on. You know, Democrats say this will help workers and ease some of the inequality that is affecting this country. So what can we learn from Mexico's example?\n\nAVINA: I think one lesson we can learn from this example is that without social rights, without economic rights, without the protections and the rights given to workers, political democracy suffers. We have the ability to vote every two and every four years, but someone who is unable to live a life of dignity and have their basic needs met, even though they're working 40-hour workweeks - I mean, there's something wrong there. So I think another one is that these hard-fought rights are not permanent. They require constant vigilance. They require constant struggle. In the words of Frederick Douglass, without struggle, there is no progress. And this is what we've seen recently, right? Biden's program is directly connected to the popular mobilizations that we witnessed last summer. It's pressure from below that forces elites to make concessions or, even something more radical, to address some of the structural factors that are causing inequalities in our country today.\n\nGARCIA-NAVARRO: That's Alexander Avina. He is an associate professor of Latin American studies at Arizona State University. Thank you very much.\n\nAVINA: Thank you so much.\n\n(SOUNDBITE OF LOS COJOLITES SONG, \"SEMBRANDO FLORES\")\n\nCopyright © 2021 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}, {"url": "https://www.aclu.org/news/immigrants-rights/former-first-lady-and-womens-rights-advocate-betty-ford", "page_content": "On Friday, Betty Ford died at the age of 93. As first lady, she was best known for her outspoken nature and willingness to voice an often controversial opinion on any number of hot-button issues. A Midwesterner who never cared much for political life, it hardly occurred to her that she should only publicly state her opinion when it aligned with her husband’s views or the GOP platform.\n\nBetty Ford was a tireless advocate for women’s rights. Civil liberties supporters often cite her work on the Equal Rights Amendment, which was designed to grant women full legal rights under the Constitution. While it ultimately failed, Ford’s dedication was unquestionable. She continued to fight for it past her short term as first lady. When debate opened on removing the ERA from the GOP platform at the 1980 Republican National Convention, Ford walked out of the convention to join the National Organization for Women’s protest.\n\nFord understood the particular importance of equal employment rights to American women. She often lobbied her husband to hire more women in influential government positions. More publicly, Betty Ford supported equal pay for equal work referring to it as “the most basic issue” at the 1975 International Women’s Year Conference.\n\nBorn before women’s suffrage, Ford understood what too many of us fail to: without equal employment rights enshrined through the law, true equality will continue to elude us. Too many women face systematic pay discrimination to allow outdated stereotypes about women’s economic dependence on men to affect women’s salaries. Thirty-six years after Betty Ford made her simple case for equality heard at the International Women’s Year Conference, too many women are still paid less than men.\n\nThroughout her life, Betty Ford showed a remarkable understanding of the challenges of gender discrimination. In 1975, she said, “this year is not the time to cheer the visible few, but to work for the invisible many, whose lives are still restricted by custom and code.”\n\nUnfortunately, her words are still relevant today.\n\nPhoto: Courtesy Gerald R. Ford Library\n\nLearn more about equal pay and gender discrimination: Sign up for breaking news alerts, follow us on Twitter, and like us on Facebook."}, {"url": "https://www.tellerreport.com/sports/2021-07-26-rudy-fern%C3%A1ndez--%22it-was-fundamental-for-my-career-to-ask-for-help%22.ry74xvFoCd.html", "page_content": "In 17 years, Rudy Fernández gave him to lose his matted hair and that first-time face of a mischievous comic boy, to go through the NBA, to have three operations on his back, ...\n\nAlba Torrens \"Locked up in the room for 14 days I have lived very beautiful moments\"\n\nUsman Garuba \"I want to give back to my parents all their sacrifice by leaving Africa\"\n\nIn 17 years,\n\nRudy Fernández\n\ngave him to lose his matted hair and that first-time face of a mischievous comic boy, to go through the NBA, have three back surgery, win two Euroleague with Real Madrid, 10 medals with the national team - and, among the five golds, two worldwide, from 2006 to 2019-, marry\n\nHelen Lindes\n\nand have two children,\n\nAlan\n\nand\n\nAura\n\n. In 17 years he was also several players, that jumpy and daring Joventut, the Blazers tripler and, now, with 36 compliments, the wise man, the one who supplies physical fullness with knowing how to be and read basketball like perhaps no one else in all the planet.\n\nIn 17 years, those Rudy Fernández always had a common denominator in red, Spain as a priority, despite the pain, the physical and the mental. In 17 years, just one absence (Eurobasket of 2017), 15 tournaments with which it begins, captain of the ship that now sails in Tokyo in search of more glory, because they have already shown that nothing satisfies them. But, what is addictive about this human group to offer you an existence?\n\nIn his response, Rudy doesn't dig too far into memory to find the example that illustrates a commitment.\n\n\"Look, two years ago, I had one of the worst summers of my life on a personal level. And what made me be in the national team was the camaraderie. In the end, it seems a cliché to talk about us being a big family, but in those moments is where friends really see each other, \"he responded to EL MUNDO in the days leading up to the Games, where today (2:00 pm) he awaits his debut against Japan in Saitama.\n\nThe walk along Venice Beach\n\nThe friends. Like that\n\nRicky Rubio\n\n, a mischief partner already in La\n\nPenya\n\nand a room in the national team, who caught him in Los Angeles like he grabs friends who go through a bad drink and took him on a bicycle through Venice Beach. A banal bike ride can be the best therapy in the world. Because Rudy had just fired his grandfather just a couple of weeks after his sister\n\nMarta\n\nlost the child she was expecting. And to Rudy, of course, the World Cup that was about to start was made a ball. But that's precisely what\n\nLa Familia is for\n\n. From those sleepless nights, those tears after raising the World Cup to the sky of Beijing, a tattoo remains on his left ankle. And a lot of thanks.\n\nBefore they sacrificed their summers of youth, now they stop seeing their children for weeks. I insist, what does this team have? The oldest of us are already parents and they are almost all small children, less than five or six years old. It is true, it is difficult to leave the family parked to face these concentrations or the tournaments. They are our priority. But we know they support us from a distance. Only the Eurobasket in 2017 was taken as a break. Since 2004 I have been lucky enough to be able to spend every summer in the national team. Before that Eurobasket, my body asked me, physically and mentally, for a break to face the years to come. It was fundamental for my career to ask for help, to put myself in the hands of people who understand this world, the ups and downs of this profession. It is important to be positive in the most difficult moments. And the demo was 2019,to be world champion, with everything that happened to me. The player must be mentally prepared for all kinds of situations. Good memories of Saitama. The pavilion remains the same, little has changed. Great memories. In 2006, El Chacho and I were kids (world champions in Japan) and now we are veterans. But the illusion remains intact. Do the young men who now enter the national team remind you of the 2004 Rudy, aged 19? That is far away, but of course. They were very happy Games, because also, I lived them with my sister. And Felipe, Pau and I debuted in our first Games. The youngsters have to be sponges, because there are players of the highest level in front of them. NBA players. Soak up the work they do so that it can later be used for their career. As a veteran,I try to help them to enter into the dynamics of this great family. It's easy to compete with this team. Garuba, his Real Madrid teammate, is also now 19 years old. That said, Usman has to be a sponge right now to learn. He is a player who has a lot of margin. I have lived his emergence closely, I know that he is working, listening and looking at players who can help him.\n\nRudy, during a Spanish training session in Las Vegas.FEB\n\nFelipe, Spanoulis, maybe Pau ... Do you feel that a time when you were the main protagonist is ending? Yes, of course. This does not stop and many players of my generation retire. You see it. On a personal level, I am 36 years old, many injuries, many games. Because the European competition has too many games. And physically and mentally some could have lasted longer, but they retire earlier because the level of physical demand is maximum. Only four basketball players had played five Games: Juan Carlos Navarro, Teófilo Cruz, Oscar Schmidt and Andrew Gaze. Now you, Pau and Luis Scola will do it. How do you face Tokyo? It is something incredible that I could not imagine when I started. And they may be our last Games. And we are aware of how tough they are going to be. In addition, the format changes with respect to what we know.The desire must always be there and even more knowing that it may be the last chance to be all together. Were you surprised by Pau's ability to return? He is a benchmark, he has shown many things preparing day and night to get here. He is eager to contribute.\n\nThe pandemic has taught me the lesson of living from day to day\n\nRudy, how can you always be in the right place on the track without having to run faster than everyone else? It's that touch. The years go by and you have a little more wisdom, intuition. It's about anticipating. In that sense, I have always been a player who has tried to intuit the play in defense. And in attack, choose the best option to get something positive. Outside of basketball, what have you learned from these uncertain times? The lesson of living from day to day. Be surrounded by people who love you, who you love. The situation we are experiencing is incredible, none of us thought that in two years we could go through all these kinds of situations. I think we are all dealing with it as best we can, trying to get the positive side out. For example, confinement served to be more with my family,Something that I had not been able to do so much before. In the future, do you see yourself on a bench, in an office or outside the world of basketball? At no point am I thinking about what to do when I retire. Yes I want to continue linked to sports, but as I told you, I go day by day. And now more.\n\nAccording to the criteria of The Trust Project\n\nKnow more\n\nsports\n\nSpain Olympics\n\nBasketball Olympics\n\nSpanish Basketball Team\n\nHBPR\n\nRicky Rubio\n\nPau Gasol\n\nTokyo Olympics Why is Spain a world power in team sports?\n\nTokyo 2020 How many medals does Spain aspire to at these Games?\n\nBasketball Ricky Rubio and El Chacho put the music, Juancho gives the scare\n\nSee links of interest\n\nLast News\n\nTokyo 2021\n\n2021 business calendar\n\nHome THE WORLD TODAY\n\nMaster investigative journalism"}]}