{"Mackenzie Caquatto competed on the uneven bars and balance beam at the 2012 Summer Olympics.": [{"url": "https://floridagators.com/sports/womens-gymnastics/roster/mackenzie-caquatto/2528", "page_content": "Nine-time All-American (5 NCAA / 4 NACGC Regular Season)\n\n2014 & 2012 All-SEC\n\nCollegiate Bests: Vault: 9.925 2-22-13/1-17/14 Bars: 10.0* 1-18-13 Beam: 9.975 2-20-11 Floor: 9.95 1-24-14 AA: 39.625 3-7-14 *-UF record\n\nAS A SENIOR (2014) – First-team All-American for both uneven bars and balance beam in both NCAA Championships competition and in the National Association of Collegiate Gymnastics Coaches (NACGC) All-America regular-season awards… advanced to the NCAA event finals for both events, taking fourth on bars (9.8875) and tying for 12th on beam (9.8375)… reset collegiate-best all-around twice as a senior – 39.60 took third versus Georgia and current best of 39.625 stood second in West Virginia duel… earned All-Southeastern Conference honors after runner-up finishes in league championships’ uneven bars (9.95) and balance beam (9.90) competition… Gator season-best beam mark of 9.95 won title at Auburn and versus Georgia and was second versus West Virginia… set collegiate-best floor exercise mark of 9.95 versus Georgia… shared Alabama duel beam win (9.925) for third win on event in 2014… equaled collegiate vault best of 9.925 at Auburn and at NCAA University Park Regional… won seven event titles in 2014 (four bars, three beam)… SEC Community Service team member… recipient of $5,000 scholarship as nominee for SEC Brad Davis Community Service award… named co-Gator Heart & Soul Award recipient and “Communigator” at team’s awards banquet… member of the SEC Academic Honor Roll.\n\nAS A JUNIOR (2013) – Earned All-America first-team honors at the NCAA Championships for the uneven bars and balance beam after leading all NCAA semifinal competitors with marks of 9.95 for both events… advanced to NCAA finals for both events, taking fourth in each (bars/9.8875 and beam/9.85)… first-team All-American for both uneven bars and balance beam in the first National Association of Collegiate Gymnastics Coaches (NACGC) All-America regular-season awards… earned 10.0 uneven bars mark to win Missouri dual… fifth Gator to earn the perfect score on bars and first since 2009… named Southeastern Conference Specialist of the Week following 10.0 mark… picked up bars win at Arkansas (9.95) and versus Minnesota (9.975)… claimed both bars (9.95) and beam (9.925) wins versus Alabama… shared third in SEC Championships bars competition at 9.925… also shared third in NCAA Regional bars (9.925) and beam (9.90) competition… runner-up in Minnesota dual beam competition after matching season-best of 9.95… won opening two balance beam competitions… posted a season-high 9.95 to win LSU beam dual… turned in first vault performance since 2011 NCAA Championships versus Missouri, matching then collegiate-best of 9.85… upped collegiate vault best to 9.925 versus Kentucky to take third… shared team’s Heart & Soul award at team’s post-season banquet… member of the SEC Academic Honor Roll and named to NACGC Scholastic All-America team.\n\nAS A SOPHOMORE (2012) – Earned All-America first-team honors at the NCAA Championships for the uneven bars… advanced to NCAA uneven bars final, tying for sixth at 9.825… All-SEC second-team member after sharing second at league championships with an uneven bars mark of 9.90… matched season-best of 9.95 to win Jan. 27 quad meet uneven bars competition… added another bar win at Alabama (9.90) and versus LSU (9.90)… shared title at Auburn (9.925) for fourth consecutive bars win… tied for fourth in NCAA Raleigh Regional uneven bars competition at 9.85… sat out Utah meet after injections in both ankles… sprained both ankles at final selection camp for 2011 U.S. World Championships team and those injuries kept her out of UF lineup for first two meets… member of the SEC Academic Honor Roll.\n\nAS A FRESHMAN (2011) – Fourth in Visa Championships’ all-around in August of 2011, to earn fourth consecutive spot on U.S. Senior National Team… uneven bars runner-up at the 2011 Visa Championships… during collegiate season, won Alabama dual all-around (39.575) with the highest total ever by a Gator making their all-around debut… total also equals the fifth-highest posted in the nation in 2011… also won first collegiate event titles for uneven bars (9.90) and balance beam (9.925) versus Alabama… named SEC Freshman of the Week following performance in Alabama dual… used season-best of 9.95 to win NCAA North Central Region bars title… claimed a total of 10 event titles (six bars, three beam and one all-around)… tied for third in Georgia all-around (39.475) and balance beam (9.875) competition… took both bars and beam titles in Florida’s double meet weekend – winning beam mark of 9.975 at West Virginia quad matches nation’s 2011 high mark for event… won four consecutive bars titles, with the last three coming with marks of 9.925… added balance beam to competitive repertoire versus Kentucky, tying for third (9.725)… sprained right ankle limited contributions to only bars at SEC Championships… made competitive vault debut at LSU, posting a 9.85.\n\nPRIOR TO FLORIDA - 2008-09, 2009-10, 2010-11 and 2011-12 U.S. National Team member… Senior International Elite competitor… member of the U.S.’s silver medal World Championships team at the 2010 event in Rotterdam, Netherlands… competed as an all-arounder in 2010 World Championships’ team qualifying round… led U.S. off on vault and uneven bars in 2010 World Championships’ team final… also has represented U.S. in international competitions in Germany, France, Japan and Italy… 2009 U.S. World Championship team alternate… 2008 US Olympic Trial qualifier… fourth on bars, tied for fifth in all-around, tied for seventh on beam and eighth on floor at 2010 Visa Championships… third in uneven bars and fifth in all-around at 2009 Visa Championships… 10th in 2008 Visa Championships’ all-around… 2007 Junior Olympic Junior C all-around champion… 2008 U.S. Classic vault champion – also took third on bars and fourth in all-around… trained at the Naperville Gymnastics Club, where she was coached by Jiani Wu and Yuejui Li… chose Florida over UCLA, Michigan, Alabama, Arkansas, LSU and Utah.\n\nMAJOR – Received bachelor’s degree in Elementary & Special Education in December of 2014 and master's degree in Special Education in December of 2015."}, {"url": "https://region5gyminsider.com/region-5-rewind-region-5-elites-who-chased-olympic-glory-mackenzie-caquatto/", "page_content": "Mackenzie Caquatto started gymnastics in 1994 at the age of 3, her mom Lin took her to a Mommy & Me class and like many she was hooked instantly. Mackenzie who was born in Naperville, Illinois started her gymnastics career at Aerial Gymnastics Club. When Mackenzie, who also has a younger sister who was an Elite Gymnast, once told her mom during the 1996 Olympic Games that she one day would be an Elite with dreams of the Olympics, Mackenzie worked towards those goals everyday after that moment.\n\nWhile at Aerial Mackenzie was the 2007 JO National AA Champion, in 2007 Mackenzie would also compete in her first Elite competition the U.S. Classic held in Battle Creek, Michigan. Mackenzie then competed in the junior division at the 2007 Visa Championships finishing 16th in the AA. In 2008 the Olympic Year Mackenzie would become a Senior International Elite, which would now give her the opportunity to chase her Olympic Dream.\n\nIn the Olympic Year, Mackenzie competed at the U.S Classic finishing 1st on the Vault, 3rd on the Bars and 4th AA. This solid meet qualified her to the Visa Championships placing 10th in the AA securing her a spot on her first US National Team and a place at the U.S Olympic Team Trials. However, Mackenzie only competed in day 1 of the trials placing 12th in the AA on that specific day.\n\nIn 2009, Mackenzie began training along with her sister Bridgette at Naperville Gymnastics under two Chinese Olympians (Jiani Wu & Yuejiu Li). Mackenzie had a breakout year in 2009 having successful competitions at the U.S Classic and the U.S Nationals placing 3rd on the Uneven Bars and 5th in the AA then 2nd\n\non the Vault, Uneven Bars, 8th on the Floor and 3rd in the AA respectively despite suffering a pretty serious knee injury in June of 2009. After a successful showing at the US Championships Mackenzie was named to the World Championship Selection camp. She would be named as an alternate to the 2009 World Team. Mackenzie was them selected to represent Team USA at a few international competitions. The Toyota International Competition in Japan (2nd on bars), the USA-Germany Friendly Exchange (1st team, 2nd uneven bars, 3rd AA & vault ), the USA-France Exchange (1st team, 2nd AA & Vault) and then the USA-Japan Friendship Meet (1st team, vault & 2nd AA).\n\nIn 2010 Mackenzie found herself at a new gym, her coaches Jiani Wu & Yuejiu Li opened their own training facility in Naperville called Legacy Elite. Mackenzie started off her season representing Team USA at the City of Jesolo Trophy meet in Italy, where she placed 1st with the Team & 7th AA. Macko also competed at the CoverGirl Classic placing 2nd on Vault, Bars and 3rd in the AA, thus qualifying herself to the 2010 Visa Championships. At Championships she was 4th on Bars, 7th on Beam and 5th AA. Her placing at Championships would qualify her again to the USA National Team and onto the World Championship Selection Camp. Having been an alternate last year to the World Championships, in 2010 Mackenzie would selected at a Worlds Team member, at the final selection camp she won the AA. Mackenzie traveled to Rotterdam, Netherlands as part of Team USA. In Rotterdam, Mackenzie competed in the AA placing 9th in the qualifications, unfortunately she did not advance to the finals because of the two per country ruling. However, she did compete in the team finals on Bars and Vault contributing scores for both to the team. The USA Team ended up finishing 2nd behind the Russians.\n\nAfter the World Championships Mackenzie, who had previously committed to the University of Florida on a full ride scholarship started her season with the Gators. In her freshman season Mackenzie faced some injuries, but still competed in the AA for her team at the NCAA Championships, however once the NCAA season was over Mackenzie decided to wanted to make an elite comeback, so she returned to Legacy Elite at competed two events at the 2011 CoverGirl Classic finishing 4th on the Uneven Bars. At the 2011 Visa Championships she’s competed in the AA finishing 4th, she also placed 2nd on the Uneven Bars. Mackenzie earned herself a spot on her 4th US National Team and a spot at the Worlds Selection Camp. Unfortunately, while doing a dismount off the beam she injured both her ankles and had to withdraw from the selection process.\n\n\n\n\n\n\n\n\n\nMackenzie returned to the University of Florida for her sophomore season, however she would only compete the Uneven Bars and eventually the balance beam. In 2012 the Gators placed 2nd as a Team at the NCAA Championships and Caquatto placed 6th on the Uneven Bars. In 2013, Mackenzie helped the Gators win their first NCAA National Championship in the schools history, she also placed 4th on the Uneven Bars and Balance Beam. In her final year as a Florida Gator Mackenzie once again helped lead her to their second NCAA Championship Team Title and placed 4th on the Uneven Bars.\n\nMackenzie had fought through injuries and adversity to find great success in her gymnastics career as an Elite & a Collegiate Student-Athlete. As a Florida Gator Mackenzie received many honors, as a Freshman she received SEC Freshman of the week honors, multiple event titles. As a sophomore she earned All-America first-team honors at the NCAA Championships for the Uneven Bars, All SEC Second Team member and she was a member of the SEC Academic Honor Roll. In 2011 as a Junior Caquatto, earned All-America first-team honors at the NCAA Championships for the Uneven Bars and Balance Beam, first-team All-American for the Uneven Bars and Balance Beam in the first National Association of Collegiate Gymnastics Coaches (NACGC) All-America regular-season awards, she was also the fifth Gator Gymnast to score a perfect 10 on the Uneven Bars and first since 2009, she was named the SEC Specialist of the Week, she also shared team’s Heart & Soul award and was again a member of the SEC Academic Honor Roll and named to NACGC Scholastic All-America team.\n\nIn her final season she earned again first-team All-American honors for the Uneven Bars and Balance Beam at the NCAA Championships and the NACGC All-America regular-season awards. She also earned All-Southeastern Conference honors, she won 7 event titles throughout the season, she also was selected as a SEC Community Service team member, a recipient of $5,000 scholarship as a nominee for SEC Brad Davis Community Service award, was named co-Gator Heart & Soul Award recipient and received the “Communigator” award at her team banquet. She was also a member of the SEC Academic Honor Roll for the 4th year in a row.\n\nMackenzie graduated in 2014 with a bachelors degree in elementary education, she has wanted to become a teacher since she was very young. After graduation she would go onto her graduate degree from the University of Florida, in 2015 she graduated with her Masters in Elementary and Special education. Currently she is in the second year of of Florida’s three-year ProTeach program. Mackenzie can be seen in the stands at Gator Gymnastics Meets cheering on her former team, but most importantly her younger sister who is also a Florida Gymnast.\n\nLike many Region 5 Athletes before her Mackenzie chased her Olympic Dream, she however was plagued by injuries, but she did work hard, persevere and did something super hard and special, competing in both NCAA & Elite at the same time, not many have achieved this feat. Mackenzie found success at the University of Florida, and on the world stage. Thank you Mackenzie for inspiring not only the Elite & Olympic Hopefuls of Region 5, but all gymnasts in general. I hope through your teaching that you continue to inspire and education young people for generations to come.\n\nHere are Mackenzie’s routines from the 2008 Olympic Trials and 2010 World Championships:\n\n2010 Worlds Beam, 2010 Worlds Floor, 2010 Worlds Bars,\n\n2008 Olympic Trials Vault\n\n***Pictures provided by Google Search, Info & Bio provided by USA Gymnastics, Wikipedia, Gator Gymnastics and Videos from Youtube Gymcat67 & Gymnweb Account***"}, {"url": "https://education.ufl.edu/news/2015/02/04/lifes-a-balancing-act-for-coe-student-and-all-america-gymnast/", "page_content": "Just as she maintained perfect equipoise on the balance beam during a stellar career as a Florida Gator gymnast, UF elementary education master’s student Mackenzie Caquatto has remained centered as an athlete, big sister, teaching intern and role model.\n\n“Growing up, my parents always made sure that school came first,“ said Caquatto, a five-time collegiate All-American. “But being a college athlete has also taught me good time-management skills. I’ve done a lot of homework on airplanes, and I’ve had a lot of late-night study sessions — but I always get my work done.”\n\nLast semester was particularly challenging for the aspiring special education teacher who helped lead the 2014 Gator gymnasts to their second straight national championship. While “Macko,” as her teammates called her, spent most of the fall semester teaching a fifth-grade class at Alachua Elementary School near Gainesville, she also attended four ProTeach classes and served as a student coach on the gymnastics team.\n\nShe also was a volunteer tutor for children with reading disabilities at a four-week summer camp last year, further demonstrating her resolve.\n\n“I’ve wanted to be a teacher since I was 5 years old, so I’ve been willing to do whatever it takes to get there,” Caquatto said. “But it doesn’t really feel like I’m sacrificing anything because I love what I do.”\n\nThe 5-foot-1 superstar from Naperville, Ill., expects to graduate with her M.Ed. degree in December and is thinking about ways to balance her considerable athletic talent with a teaching career.\n\n“Being a student coach has led me to think about coaching at the college level,” she said. “But I also think about coaching younger athletes. I love working with kids of all ages, whether it’s 6-year-olds or 20-year-olds.”\n\nCaquatto said she recently experienced the vicarious thrills that come with coaching when she witnessed her younger sister, Bridgette, a junior All-American gymnast for the Gators, score a 9.95 to share the uneven bars title during a season opening win against Ball State. Bridgette also won the floor exercise title for the first time in her career with a 9.925.\n\n“We’ve been supportive of each other all our lives, and sometimes it’s tough to watch each other compete,” Mackenzie said. “Sometimes we just have to look the other way or hide behind someone, but I managed to watch ‘Bridgey’ nail two of her routines against Ball State. I couldn’t have been any happier for her.”\n\nCall it balanced reciprocity, but the bar on the uneven bars already had been set for Bridgette, who witnessed Mackenzie score a perfect 10 in that event last season – something only six others Gators have done.\n\nMackenzie said her sister was in tears after seeing the scoreboard.\n\n“I’m sure I’ll do the same thing when she gets a 10,” big sister said.\n\nThe mutual support spills over into academics.\n\n“I was always better at English and social studies, and Bridgey excelled in math and science,” Mackenzie said. “She’s always been very disciplined when it comes to studying and academics, so she makes a great study buddy during midterms and finals.”\n\nMackenzie also says that being in the ProTeach program has prepared her for the “real life” experiences she expects to encounter in her teaching career.\n\n“I remember the first time I presented lessons in front of 20 children,” she said. “It was nerve-wracking, but not because it was difficult or I was scared of the kids. I just wondered if they’d understand.\n\n“The whole point of a lesson is for all the students to understand the concept you’re presenting, and you have to keep in mind the way each student learns and have a back-up plan if they don’t understand. It feels like winning a competition when it works, but if it doesn’t, well then it’s kind of like going back to practice and fixing whatever went wrong and making it better.\n\n“But now that I’ve got more experience creating lesson plans and using different teaching methods, I feel ready to handle my own classroom,” Caquatto said with typical confidence. “I feel like I’m better prepared for becoming a winner in the classroom.”\n\nChances are she’ll score a perfect 10 there, too.\n\nContacts\n\nWriter: Stephen Kindland, College of Education Office of News and Communications; skindland@coe.ufl.edu; phone 352-273-3449."}, {"url": "https://www.npr.org/sections/tokyo-olympics-live-updates/2021/07/27/1021090180/u-s-womens-gymnastics-team-gold-final-simone-biles-sunisa-lee", "page_content": "Simone Biles Says She Pulled Out Of Gymnastics Finals Due To Mental Health Concerns\n\nEnlarge this image toggle caption Gregory Bull/AP Gregory Bull/AP\n\nTOKYO — The U.S. women's gymnastics team has taken silver in the women's team final, behind the team from Russia, after U.S. star Simone Biles suddenly pulled out of competition after the first rotation to focus on her mental health.\n\nThis marks the first time in a decade that the U.S. women's team has not come out on top in major international competition. The U.S. has won every Olympics and World Championships event since 2011.\n\nAfter a difficult first vault, Biles said she pulled her coaches aside and said she wanted to withdraw.\n\n\"I can't risk a medal for the team, so I need to call it. And you usually don't hear me say things like that because I usually persevere and push through things,\" she said, and added that her coaches and team doctor took her words seriously.\n\n\"Today has been really stressful,\" she said. The team worked out in the morning, and in the 5 1/2 hours before competition, she said she started shaking. \"I've just never felt like this going into a competition before. I tried to go out here and have fun ... but once I came out here, I was like, 'no, mental is not there, so I just need to let the girls do it and focus on myself.'\"\n\nShe made clear that she was not physically injured.\n\nBiles' departure from competition was a blow for her three teammates, who are all first-time Olympians. She was expected to compete on all four apparatuses, and teammates stepped in for her on the uneven bars, balance beam and floor exercise.\n\n\"There was definitely a lot of emotions going through all of our heads, but I'm really proud that we were able to step up to the plate and do what we needed to do,\" said Sunisa Lee, who stepped in for Biles on the floor exercise. \"It's very hard to lose a teammate, especially at the Olympic Games, so I was really proud of all of us.\"\n\nThe final score for the Russia Olympic Committee was 169.528, winning gold, and the U.S. scored 166.096 for silver. The U.S. narrowed the Russians' lead during the balance beam but was unable to catch up after a difficult rotation on the floor exercise. Great Britain won the bronze.\n\nAfter pulling out, Biles remained in the arena wearing white warmup gear, rather than the team leotard, and hugged her teammates. She could be seen jumping to celebrate their strong performances.\n\nOn her only vault, she scored 13.766. In Rio, she scored 15.933 on the same apparatus.\n\nBiles was attempting to pull off a vault with 2 1/2 rotations. But she was not able to fully rotate through the turns of that move, ending with 1 1/2 turns and and taking a large step on the landing.\n\nIn the three other events she was expected to compete in, Jordan Chiles stepped in on the uneven bars and balance beam and Sunisa Lee competed on the floor exercise.\n\nOn the uneven bars, Chiles pulled out a strong performance, sticking the landing and scoring 14.166. Lee, a specialist on the uneven bars, secured an exceptional score — 15.400 — providing the team with much-needed good news.\n\nIn the third rotation, on the balance beam, Chiles also put a strong score on the board when she stepped in for Biles again. Solid scores from Grace McCallum and Lee helped to narrow Russia's lead.\n\nBut on the floor exercise, a heartbreaking fall from Chiles after a tumbling sequence resulted in a penalty and a score of 11.700. The combined scores from Lee (13.666) and McCallum (13.500) weren't enough to catch the team from Russia.\n\nThe other members of the team heaped praise on Biles in their comments after the event. \"If it wasn't for her, we wouldn't be here right now. We wouldn't be silver Olympic medalists. Because of who she is as a person,\" Chiles said.\n\nTeam USA said it supported Biles' decision.\n\n\"Simone, you've made us so proud. Proud of who you are as a person, teammate and athlete,\" Sarah Hirshland, the CEO of the U.S. Olympic and Paralympic Committee, said in a statement. \"We applaud your decision to prioritize your mental wellness over all else, and offer you the full support and resources of our Team USA community as you navigate the journey ahead.\"\n\nIn the qualifier two days ago, the team from Russia was also in the lead — which was viewed as surprising given the longtime dominance of the U.S. women.\n\nThe team had several stumbles in the qualifier, including multiple penalties from Biles. She still posted the top score of that day.\n\nBiles said they are still determining whether she will compete in the individual events or the all-around individual final, which she won at the Olympics five years ago.\n\nBiles qualified for all five individual finals in Tokyo. The women's all-around competition is slated for Thursday, and the vault and uneven bars kick off the individual competitions on Sunday.\n\nBiles was facing huge expectations for her performance in Tokyo. \"I know I brush it off and make it seem like pressure doesn't affect me but damn sometimes it's hard hahaha! The olympics is no joke!\" she said on Instagram ahead of the team final."}, {"url": "https://olympics.com/en/athletes/mackenzie-caquatto", "page_content": "Year of Birth\n\nYear of Birth 1992\n\nUnited States of America\n\nTeam United States of America"}, {"url": "https://peoplepill.com/people/mackenzie-caquatto/", "page_content": "Mackenzie Caquatto (born March 26, 1992) is an American artistic gymnast. She was formerly on the US National Team. Her younger sister, Bridgette Caquatto, was also an elite gymnast on the senior US National Team. She first qualified as an elite gymnast in 2007 and competed at the 2007 US National Championships, where she finished 17th.\n\nMackenzie competed as a senior for the first time at the 2008 US National Championships and placed 10th overall. She was selected to be a member of her first national team and qualified to the 2008 US Olympic Team Trials, but competed only on the first day of competition, placing 12th in the all-around on that day.\n\nIn 2009, Caquatto competed at her first international meets as a member of the national team. Caquatto suffered a knee injury shortly after but managed to place 5th at the 2009 US National Championships. She was then invited to the world championships selection camp. She was named as the first alternate for the team. In addition to her status as an alternate, she was sent to the Toyota International in Toyota City, Japan. At this competition, she competed on the uneven bars, balance beam, and floor exercise; winning the silver medal on the uneven bars with a score of 14.675, only behind world silver medalist on the event, Koko Tsurumi of Japan.\n\nCaquatto started her 2010 season by competing at the City of Jesolo Trophy, where she had the highest beam score but made mistakes on the floor which kept her from medaling in the all-around. Caquatto competed at the 2010 CoverGirl Classic and placed 3rd in the all-around, scoring the second highest on vault and the uneven bars but falling from the balance beam. She had qualified to compete at the 2010 US National Championships. At the 2010 US National Championships, Mackenzie placed 5th in the all-around. She fell on a simple change grip skill on the uneven bars, her best event, placing 4th.\n\nAfter the US Nationals, Mackenzie was selected to attend a selection camp for the 2010 World Championships. From there, she advanced to the second camp where she won the all-around competition. She was eventually selected to compete.\n\nAt the World Championships, Mackenzie competed in the all-around in the qualifying round. After hitting all her routines without major error, she placed 9th individually and 3rd with the team. Although the top 24 qualifiers advance to the individual all-around final, she was left out because fellow American athletes Aly Raisman and Rebecca Bross had qualified ahead of her and only two athletes from each country can qualify to a final.\n\nAfter the qualifying round, Mackenzie was selected to compete on the uneven bars and the vault during the team finals. She contributed a 14.666 on the bars and a 15.000 on the vault to help the team win the silver medal behind Russia and ahead of China.\n\nShe competed as a Florida gator at the NCAA level for the 2010–2011 season where she became injured but still competed the all-around for her team at the NCAA Championships. After finishing the NCAA season, Mackenzie decided to train for a comeback to elite gymnastics for the 2011 season.\n\nMackenzie began her 2011 elite season by competing at the CoverGirl Classic. At the classic, she competed a slightly watered down balance beam routine and a solid uneven bars routine; scoring 14.100 and 14.750, respectively.\n\nAt the 2011 US Visa National Championships, Mackenzie surprised many by competing in the all-around. On day 1 of the competition, Mackenzie was in second place after the two rotations; after scoring a 14.700 and 15.000 on vault and uneven bars, respectively. Unfortunately, she counted her first fall on the balance beam. After having a solid floor exercise, she finished her night in sixth place with an all-around score of 56.000. On the final day of competition, Mackenzie competed solidly on all her events. Taking advantage of injuries to defending national champion Rebecca Bross and Chellsie Memmel, Mackenzie went on to finish the championships in fourth place behind Aly Raisman, McKayla Maroney, and champion Jordyn Wieber. She also took second place on the uneven bars just behind Wieber by 0.050.\n\nMackenzie was given a spot on her fourth national team and has been invited to compete at the first world team selection camp. She was considered to be a likely pick for the world team, but injured her ankles when dismounting the beam at the selection camp and therefore lost her chance of going to Tokyo. After sitting out the beginning of the NCAA season, she competed on the uneven bars in early 2012 and is expected to reintroduce her beam routine soon.\n\nCompetition skills\n\nMackenzie performed the following skills on bars, beam, floor, and vault as of 2010.\n\nApparatus Skills D Score Top Score in World Championship/World Cup/Olympic Competition Vault Double-Twisting Yurchenko 5.8 15.000 Uneven Bars Jump to high bar mount, Kip cast to reverse grip handstand, Jaeger (D), Kip cast to handstand, toe on piked Tkatchev (E) to Pak Salto (D), Kip cast to handstand, Maloney (D) to Bail (D) to toe-on full pirouette (D) to toe-on shoot to high bar, Kip cast to handstand, Tkatchev (D), Kip cast to handstand, giant, full twisting double tuck dismount (D) 6.2 14.666 Balance Beam Leap on to beam mount, side sommie (D), front aerial (D) to flip flop (B) to layout step-out (C), full turn with leg at horizontal (C), split jump to sissone, switch split leap 1/2 (D) to back tuck (C)*, front pike take off from one foot (C), switch split leap (C) to back tuck (or pike) (C), roundoff to double pike dismount (E) 5.7 (5.8*) 14.266 Floor Exercise Roundoff back handspring to full-in double pike (E) (triple twisting back layout (E)*), roundoff back handspring to a triple twisting back layout (E) (roundoff to 1 1⁄ 2 back layout (C) to full twisting front layout (C)*), double turn with leg at horizontal (D), tour jete 1/2 (C), switch split ring leap (C) to switch split leap 1/2 (C), roundoff to 1 1⁄ 2 twisting back layout (C) to full twisting front layout (C) (front handspring to double twisting front layout (D)*), roundoff back handspring double pike dismount (D) 5.6 (5.5*) 13.533 (With slightly watered down exercise)\n\n*Variation competed for 2011.\n\nCompetitive history\n\nSenior career history\n\nYear Competition Description Location Apparatus Rank-Final Score-Final Rank-Qualifying Score-Qualifying 2011 CoverGirl Classic Chicago, IL Uneven Bars 4 14.750 Balance Beam 12 14.100 U.S. Championships Saint Paul, MN All-Around 4 112.500 6 56.000 Uneven bars 2 29.750 2 15.000 Balance Beam 12T 26.700 18 12.650 Floor Exercise 10 27.200 6T 13.650\n\nYear Competition Description Location Apparatus Rank-Final Score-Final Rank-Qualifying Score-Qualifying 2010 CoverGirl Classic Chicago, IL All Around 3 56.450 Vault 2 14.850 Uneven Bars 2 15.050 Balance Beam 20 12.950 Floor Exercise 8 13.600 U.S. Championships Hartford, CT All-Around 5T 113.350 5T 56.800 Uneven bars 2 28.900 4 15.000 Balance Beam 7T 27.550 9 13.500 Floor Exercise 8 27.700 10T 13.700 World Gymnastics Championships Rotterdam, The Netherlands Team All-Around 2 175.196 3 233.643 All-Around 9 57.198 Vault 15.000 (team finals) 6 14.933 (no average) Uneven Bars 14.666 (team finals) 12 14.466 Balance Beam 21 14.266 Floor Exercise 39 13.533\n\nYear Competition Description Location Apparatus Rank-Final Score-Final Rank-Qualifying Score-Qualifying 2009 CoverGirl Classic Des Moines, IA Uneven Bars 9 13.350 U.S. Championships Dallas, TX All-Around 5 111.950 5 56.000 Uneven bars 3 29.000 4 14.450 Balance Beam 17 26.000 15 13.000 Floor Exercise 10 27.350 9 13.850 Toyota International Toyota City, Japan Uneven bars 2 14.675 Balance Beam 12 12.275 Floor Exercise 11 12.100"}, {"url": "https://www.dailyherald.com/article/20111110/news/711109967/", "page_content": "Naperville sisters among gymnastics elite\n\nSisters Bridgette and Mackenzie Caquatto, of Naperville, at ages 14 and 16, respectively. Now 17 and 19, the sisters are on the U.S. women's senior gymnastics team. Photo courtesy the Caquatto family\n\nMackenzie Caquatto, 19, of Naperville, is a member of the U.S. women's senior gymnastics team. She is a sophomore at the University of Florida. Photo courtesy Ron Irby\n\nMackenzie Caquatto, 19, of Naperville, is a member of the U.S. women's senior gymnastics team. She attends the University of Florida and competes there on Jan. 14. courtesy of Mike Erdelyi\n\nMackenzie Caquatto, 19, of Naperville, is a member of the U.S. women's senior gymnastics team. She is a sophomore at the University of Florida. Photo courtesy Ron Irby\n\nBridgette Caquatto competes on the uneven bars in the women's artistic gymnastics individual all-around finals during the Pan American Games last month in Mexico. She won the gold in the women's individual all-around. Associated Press\n\nBridgette Caquatto competes on the balance beam in the women's artistic gymnastics individual all-around finals during the Pan American Games last month in Mexico. She won the gold in the women's individual all-around. Associated Press\n\nEighteen hardworking and talented athletes from all over the country comprise the U.S. women's senior gymnastics team this year.\n\nTwo of them come from the same Naperville family -- Bridgette Caquatto, 17, a senior at Naperville Central High School, and her sister Mackenzie, 19, a sophomore at the University of Florida.\n\nBoth sisters boast a long list of wins and accomplishments in gymnastics, claiming the uneven bars as their best routine.\n\nBridgette won three gold medals (individual all-around, uneven bars and team all-around) -- more than anyone else on her team or any other in the women's gymnastics portion of the Pan-American Games last month in Mexico. The Pan Am Games take place every four years and feature athletes from countries throughout the Americas.\n\nMackenzie won a silver medal with the U.S. team in 2010 at the World Artistic Gymnastics Championships, which feature athletes from all over the world and are held annually, except in Olympic years.\n\nSo how did they both manage to get so far in the sport? \"We must have good genes,\" Bridgette concluded during a recent interview at her home.\n\nA couple of days later, in a phone interview from Florida, Mackenzie's answer was ... exactly the same.\n\nBut the truth is a bit more complex, according to Kathy Kelly, vice president of programs for USA gymnastics.\n\n\"To reach the top at anything, I don't care if you're a concert pianist or a gymnast, first you need a little bit of God-given talent and a lot of personal drive that comes from the athlete, plus a little bit of luck that you can be with good coaches, and a lot of love from your parents, who are driving you around and taking you to meets,\" Kelly said. \"It's a big equation. It's not any one thing.\"\n\nAnd a measure of sisterly support goes a long way.\n\nKelly said she has always been impressed by how the Caquatto sisters treat each other. \"Their gymnastics speak for themselves. They are very, very loving and supportive to each other. They are truly happy for the other's success,\" she said.\n\nThe first time the sisters competed against one another was at the Visa Gymnastic Championships in August. Both made the U.S. national team, with Mackenzie taking 4th place all-around, and Bridgette close on her heels in 6th.\n\nThe sisters are quite different, both as athletes and as young women, said longtime coach Jiani Wu, who runs Legacy Elite Gymnastics with her husband, Yuejiu Li. Both are former Chinese Olympic gymnasts. Bridgette, who goes by \"Bridgey,\" is the more reserved of the two, a disciplined athlete who values steady, consistent practice, Jiani explained. Mackenzie, whom everyone calls \"Macko,\" is more outgoing, not always as intensely focused in training but able to step up her game in competition.\n\n\"Bridgey has a little bit more power; Macko is really coordinated. They are both really good on bars,\" said Jiani, whose daughter Anna Li, of Aurora, also is on the U.S. women's senior gymnastics team. \"They have a healthy way of pushing each other. I am very proud of them; they are great kids.\"\n\nThe Caquatto sisters agree that no one -- not their parents, not their coaches -- pushed them to put in thousands of hours of practice at the gym over the years. \"We do it because we love it,\" Bridgette said.\n\nBoth readily admit to making great sacrifices to get to the top. Training five to six hours a day and traveling to meets both nationally and internationally left little time to just hang out and be a teen, they said.\n\n\"I have given up a lot for gymnastics. You are always catching up with school and you have no time on your own, no time to relax. You are always constantly going,\" Bridgette said.\n\n\"You're basically just focusing your whole life around the sport because you can't really have distractions,\" Mackenzie said. \"The only dances I went to was homecoming and prom of senior year.\"\n\nFrustration has often been part of the equation, the sisters said.\n\nSome days, they just want to throw in the towel, but they always are there to support each other, they said. \"If you're having a bad day, we always have each other's back,\" Mackenzie said.\n\nDespite their packed schedules, both sisters managed to keep good grades. Bridgette has a 3.98 GPA on a 4.0 scale; Mackenzie, a 2010 graduate of Naperville Central, maintains a 3.5 or so GPA while studying elementary education. Next year, Bridgette will join her sister at the University of Florida.\n\nThe sisters took their first gymnastic tumbles when they were just 2 years old, as each took a \"mommy and me\" gymnastics class with their mother, Lin, at Elite Sports Complex in Downers Grove.\n\n\"They both loved it from the start. They did really good, and they just kept going,\" said Lin Caquatto, who works as an administrative assistant for an executive search firm. Their father, Dave, is a regional sales manager for a printing company. Both parents always have been athletic.\n\nAn integral part of being a top athlete is mental strength, the sisters said.\n\n\"It just comes with age and how confident you are in yourself and your skills,\" Bridgette said.\n\n\"'I've done it time and time again in practice' -- that's what I tell myself during competition. I keep bad thoughts out of my mind,\" Mackenzie said.\n\nBoth have suffered numerous injuries over the years -- stress fractures, muscle tears, the occasional sprained ankle -- but this has been a particularly tough one for Mackenzie.\n\nShe injured her ankle just before the SEC Gymnastics Championships, where she was primed for the challenge to win the national all-around title, said Rhonda Faehn, her coach at the University of Florida. \"She still competed, even though she could hardly walk,\" Faehn said. \"Mackenzie is a fighter.\"\n\nMackenzie then trained hard all summer to get back up to par, only to sprain both ankles in September during the selection camp for the world championship and the Pan-Am games.\n\nBoth Mackenzie and Bridgette would love to make the Olympic team that will compete in London next year. But they also are levelheaded about their prospects.\n\n\"I want to make it to the Olympic trials and do four of the best routines I have ever done, so I can leave and say I have no regrets,\" Bridgette said.\n\nMackenzie's immediate goal is to get healthy so she can rejoin her teammates by midseason. \"I want to win the NCAA championship with my team,\" she said. \"Making it to the Olympics in 2012 has always been a goal of mine. With my ankles I don't know how much of a possibility it is, but I am definitely still trying to make it.\"\n\nThe sisters say that getting to represent their country in international competitions is by far the biggest thrill of their lives.\n\n\"To compete for your country, after all that hard work, there is nothing like it,\" Bridgette said. \"And when you hear the U.S. national anthem play, that is the best part.\"\n\n\"That moment at worlds, it was all of it for me,\" Mackenzie said. \"All my hard work has paid off, all the hard days have paid off. And being with the team and the coaches, it all made sense why things had happened and how I got there.\"\n\n• Elena Ferrarin wrote today's column. She and Kimberly Pohl always are looking for Suburban Standouts to profile. If you know of someone whose story just wows you, please send a note including name, town, email and phone contacts for you and the nominee to standouts@dailyherald.com or call our Standouts hotline at (847) 608-2733."}, {"url": "https://www.nytimes.com/2021/07/24/sports/olympics/gymnastics-uneven-bars.html", "page_content": "Any circle can be done backward (in regular grip) or forward (in reverse or eagle grip). Counterintuitively, “backward” refers to a standard circle. When in doubt, think: If the bar weren’t there, would the gymnast be doing a back or front flip?\n\nA giant (B) is done with a straight body. The forward version is a front giant.\n\nA toe-on (C) is done with toes on the bar. Front toe-ons are fairly uncommon.\n\nA clear hip (C) is done with hips to the bar. The forward version is a Weiler kip (D).\n\nA Stalder (C, named for Josef Stalder) is done with legs straddled to either side. The forward version is an Endo (named for Yukio Endo).\n\nAn inbar (D), or piked Stalder, is done with legs between the arms. The forward version is vanishingly rare.\n\nGymnasts can do turns — pirouettes on their hands — out of any circle. Difficulty values vary depending on entry and degrees of rotation. For instance, a toe-on circle into a 360-degree pirouette, colloquially called a toe full, is a D. (You could refer in similar shorthand to a Stalder full or an inbar half.)\n\nThere are also one-arm pirouettes: the Ono, the Healy and the Ling. The differences are technical and don’t matter much because they’re all rated E.\n\nTransitions (low to high)\n\nMost of these fall into two groups: shoots and “Shaposh” skills.\n\nIn a shoot, the gymnast does a toe-on or a Stalder on the low bar, lets go, flings her body forward in what’s called counter movement — because she starts out rotating backward and reverses in midair — and catches the high bar. Depending on the entry, it’s a Stalder shoot, or Ray (B, named for Elise Ray), or a toe shoot (also B).\n\nShaposh transitions — short for Shaposhnikova, as in the Soviet Olympian Natalia Shaposhnikova — start facing away from the high bar, and the gymnast does a circle and flies backward. They differ by entry and rotation.\n\nFrom a toe-on entry, gymnasts can do a Maloney (D, no twist, named for Kristen Maloney), a Van Leeuwen (E, half twist, for Laura van Leeuwen) or a Seitz (E, full twist, for Elisabeth Seitz).\n\nFrom a clear hip, they can do an original-flavor Shaposhnikova (D, no twist) or a Khorkina (E, half twist, for Svetlana Khorkina).\n\nFrom a Stalder, they can do a Chow (D, no twist, named unofficially for Amy Chow) or a Chow half (E, half twist).\n\nFrom an inbar, they can do a Komova II (E, no twist, for Viktoria Komova) or a Komova (E, half twist, also named for Komova). Confusingly, because Komova did the more complicated version first, the simpler one gets the Roman numerals.\n\nOn transitions, as well as release moves, you may see gymnasts’ coaches standing by the bars. They’re there so that if the gymnast makes a mistake, they can catch her as she falls and prevent injury, but they’re not allowed to assist with the routine itself.\n\nTransitions (high to low)\n\nYou’re likely to see only four of these:\n\nBail (D): The gymnast starts facing the low bar, swings with body straight, does a half twist and lands in a handstand on the low bar. Also called an overshoot.\n\nPak (D, for Pak Gyong-sil): This starts like a bail, but the gymnast doesn’t twist; she just swings from the high bar, flips and grabs the low bar. Also called a Pak salto.\n\nBhardwaj (E, for Mohini Bhardwaj): A Pak with a full twist.\n\nEzhova (D, for Ludmila Ezhova): The gymnast swings in the opposite direction from a Pak or a bail — as in a front giant — and does a half twist before catching the low bar.\n\nReleases\n\nIn a release, the gymnast lets go of the high bar, does a flip or other movement in the air and catches the high bar again.\n\nGiengers , named for Eberhard Gienger, consist of a giant into a back flip with a half twist. They can be done piked (D, hips bent) or laid out (E, body straight). A variant with one and a half twists is called a Def or a Hristakieva (G, named for Jacques Def and Snezhana Hristakieva).\n\nJaegers, named for Bernd Jäger, consist of a front giant into a front flip. They can be straddled (D), piked (E) or laid out (F).\n\nThen there are Tkatchevs, named for Aleksandr Tkatchev. They all involve circling and flying backward over the bar but differ by entry and body position in the air. Some gymnasts add a half twist.\n\nFrom a giant entry, gymnasts can do a plain Tkatchev (D, straddled), a piked Tkatchev (E) or a Kononenko (E, straddled with a half twist, named for Nataliya Kononenko).\n\nFrom a toe-on, they can do a Ray (D, straddled, for Elise Ray), a Church (E, piked, Shavahn Church), a Nabieva (G, layout, for Tatiana Nabieva) or a Tweddle (F, straddled with a half twist, for Beth Tweddle).\n\nFrom a clear hip, they can do a Hindorff (E, straddled, for Silvia Hindorff), a Shang (F, piked, for Shang Chunsong) or a Martins (F, straddled with a half twist, for Filipa Martins).\n\nFrom a Stalder, they can do a Ricna (E, straddled, for Hana Ricna), a Downie (F, piked, for Becky Downie) or a Derwael-Fenton (F, straddled with a half twist, named for Nina Derwael and Georgia-Mae Fenton).\n\nFrom an inbar, they can do a Galante (E, straddled, for Paola Galante) or a piked inbar Tkatchev (F, unnamed because Sophie Scheder and Kelly Simm debuted it at the same competition and hyphenated skill names weren’t yet allowed).\n\nDismounts\n\nDouble layouts (D, backward even though the name doesn’t specify), double fronts (D, tucked) and full-twisting double backs (D, tucked) are most common."}, {"url": "https://www.famousbirthdays.com/people/mackenzie-caquatto.html", "page_content": "About\n\nElite artistic gymnast who has taken home the silver medal at the World Artistic Gymnastics Championships as well as the Visa Championships. She competed at the NCAA level for the Florida Gators.\n\nBefore Fame\n\nShe was born in Naperville, Illinois and first competed at the elite level at the U.S. National Championships in 2007.\n\nTrivia\n\nShe specializes in the uneven bars, the event in which she has had the greatest success.\n\nFamily Life\n\nHer sister, Bridgette, also competed on the U.S. National Team.\n\nAssociated With\n\nShe came in fourth at the 2011 U.S. Visa National Championships behind McKayla Moroney, who went viral for her unimpressed expression upon winning silver at the 2012 Olympic Games."}, {"url": "https://alchetron.com/Mackenzie-Caquatto", "page_content": "Mackenzie Caquatto (born March 26, 1992) is a former artistic gymnast who represented the United States at the 2010 World Championships and competed for the University of Florida. Her younger sister, Bridgette Caquatto, is also a former elite gymnast.\n\n2007–9\n\nCaquatto first qualified as an elite gymnast in 2007 and competed at the National Championships that year, finishing 17th.\n\nHer first senior competition was the 2008 National Championships, where she placed 10th in the all-around. She was named to the national team and qualified to the Olympic Trials, but competed only on the first day, finishing 12th.\n\nIn 2009, she competed at her first international meets as a member of the national team and placed 5th at the National Championships, despite a knee injury. At the Toyota International in Japan, she competed on the uneven bars, balance beam, and floor exercise and won the silver medal on bars with a score of 14.675, behind world silver medalist Koko Tsurumi of Japan. She was also the first alternate to the U.S. team for the 2009 World Artistic Gymnastics Championships.\n\n2010\n\nCaquatto started her 2010 season at the City of Jesolo Trophy in Italy, where she had the highest beam score but missed a medal in the all-around because of mistakes on floor exercise. At the 2010 U.S. Classic, she placed 3rd in the all-around, with the second-highest scores on vault and uneven bars but a fall on balance beam. She qualified to the National Championships, where she placed 5th in the all-around after falling on a simple grip change on the uneven bars, her best event.\n\nBased on her performance at Nationals, Caquatto advanced to the team selection camp for the 2010 World Championships. She went on to win the all-around at a second selection camp and was named to the team.\n\nAt the World Championships, she placed 9th in the all-around in qualifications but did not advance to the individual all-around final because only two athletes per country can qualify, and her teammates Aly Raisman and Rebecca Bross scored higher. In the team final, she scored 14.666 on bars and 15.000 on vault to help the U.S. win the silver medal, behind Russia but ahead of China.\n\n2011\n\nAfter competing for the University of Florida for the 2010–11 season, Caquatto decided to train for a comeback to elite gymnastics. At the 2011 U.S. Classic, she competed on bars, scoring 14.750, and performed a somewhat watered-down routine on balance beam, scoring 14.100.\n\nAt the National Championships, she competed in the all-around and finished the first day of competition in sixth place with a score of 56.000, counting a fall on beam. However, with solid performances on the second day of competition and injuries to Chellsie Memmel and defending national champion Bross, she placed fourth behind Jordyn Wieber, Raisman, and McKayla Maroney. She also took second place on the uneven bars, just 0.050 behind Wieber.\n\nCaquatto earned a spot on her fourth national team and was invited to the first world team selection camp, but she injured her ankles on a beam dismount at the camp. After sitting out the beginning of the NCAA season, she began competing on the uneven bars again in early 2012.\n\nSkills\n\nCaquatto performed the following skills in 2010:\n\n*Variation competed for 2011."}]}