{"Twila Shively was born in San Francisco, California.": [{"url": "https://www.biographies.net/biography/twila-shively/m/0hhtbrr", "page_content": "Who was Twila Shively?\n\nTwila Shively [″Twi″] was an American competitive baseball player. An outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in, 128 lb., she batted and threw right-handed.\n\nTwila Shively spent five of her six years in the AAGPBL playing in the left field. A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer.\n\nBorn in Decatur, Illinois, Twila Shively was the daughter of Glenn and Eva Shively. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”."}, {"url": "https://aagpbl.org/profiles/twila-shively-twi/542", "page_content": "“Twi” played softball in the Chicago softball leagues as early as 1942 when a headline in the Chicago Daily News said that she “Looks Like a Model, Runs Bases Like Ty Cobb, and Has Baseball ‘Savvy’ Plus a Pretty Face.” Twi was a member of Chicago’s National Girls Baseball League’s (NGBL) Rockola Music Maids team in 1944. The NGBL was organized as a professional softball league in 1944 to keep the best players from migrating to the All-American League which was established in 1943. Nonetheless, Twi was one of those who transferred to the AAGPBL despite the NGBL’s best efforts. She signed up to play for the Grand Rapids Chicks in 1945 and continued to be a member of the AAGPBL through the 1950 season.\n\nA solid defensive player, who routinely ranked among league leaders in fielding percentage, Twi was a starter in left field or first base in every game from 1945 to 1950 with few injury-related exceptions. In 1946 she led the league in runs with 78. In 1947, she was a member of the champion Grand Rapids Chicks. Her career totals included 274 runs, 429 hits, and 255 stolen bases. After leaving the AAGPBL, she remained active in sports, played a couple of more years in the NGBL, and enjoyed golf, hiking, and aerobics.\n\nTwi studied at Illinois State Normal and Indiana University and immediately landed a job as a physical education teacher at South Bend’s Washington High School where she inspired kids for nearly 30 years. She also coached the school’s softball and volleyball teams to several city championships.\n\nThose who knew Twi said she had a good sense of humor, civic pride, and was a joy to be around. South Bend Bat Girl, Ruth Davis, a longtime friend of Twi’s who also taught high school in South Bend for 25 years, noted that Twi had a “real dry wit . . . but she was warm and giving. If she heard of someone in need, she was quick to act, but she didn’t seek out recognition after helping people. She was quiet about her charity work, and many weren’t aware of the extent of her involvement.”\n\nDavis recalled that when Twi just turned 70, in 1990, she still referred to her work for Meals-on-Wheels for 15 years as “Taking food to the old people.” Davis also noted that Twi always had “a young and inquisitive mind,” and that “She took classes at the community college in South Bend while in her 60s just so she could learn.”\n\nBetsy Jochum was an outfielder for the South Bend Blue Sox during Twi’s tenure in the AAGPBL and later became a teacher in South Bend and a friend of Twi’s. She remembered Shively as a fierce competitor. “She was a good ball player back in a time when women didn’t play sports.”\n\nTwi succumbed to four years of Alzheimer’s disease and a year-long fight with lung cancer in a Douglas, Michigan nursing home on Thanksgiving Day, November 25, 1999 at the age of 79. According to Gary Umphrey, another longtime friend who looked after Twi during her convalescence, she remained upbeat and lucid even as Alzheimer’s and lung cancer beat her body down. “She was a sweet woman and I hated to see her uncomfortable,” he said. About five days before she died, Umphrey was commiserating with her and said she defied the way Alzheimer’s usually slurred her speech. “She opened her eyes, looked at me and said, ‘I’m not all that uncomfortable.’ And that truly was her spirit—tough to the end.”\n\nSOURCE\n\nCompiled from Twi’s obituary and other articles about her in the South Bend, (IN) Tribune at the end of November and beginning of December 1999."}, {"url": "https://prabook.com/web/twila.shively/1797300", "page_content": "Twila Shively\n\nbaseball player\n\nMarch 20, 1920 (age 79)\n\nAn outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in (168 m), 128 pounds, she batted and threw right-handed. Twila Shively spent five of her six years in the AAGPBL playing in the left field A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”. The NGBL was organized in Chicago to keep the best local players from migrating to the AAGPBL, which had been stabilized in 1943. After that, both circuits competed against each other to see who could associate itself with the biggest stars. Shively entered the AAGPBL in 1945 with the Grand Rapids Chicks, playing for them three years before joining the Chicago Colleens (1948) and Peoria Redwings (1948–1950). In her rookie year she formed part of a Chicks outfield that included Thelma Eisen in the center field and Elizabeth Wicken at right field Shively collected a.196 batting average and a.276 on-base percentage in 106 games, driving in 23 runs and scoring 42 times, while her 46 stolen bases ranked her fifth in the league. She also led all outfielders with a.968 fielding percentage and finished second for the most putouts (234) behind Fort Wayne Daisies\" Penny O\"Brian (236). Her most productive season came in 1946, when she posted career numbers in average (247), runs scored (78) hits (101), runs batted in (45), steals (45) and games played (111). Considering the year was great for many pitchers her numbers were quite respectable. Four no-hitters were recorded by Anna Mae Hutchison (Belles), Betty Luna (Blue Sox), Carolyn Morris (Peaches) and Amy Irene Applegren (Lassies), while Connie Wisniewski (Chicks) and Dorothy Wiltse (Daisies) topped the league in earned run average with 0.81 and 0.83, respectively. As a result, more than half of the circuit\"s players averaged under.200. Dorothy Kamenshek (Peaches) was the only hitter to reach the.300 mark (316). She also coached the school\"s softball and volleyball teams to city championships, inspiring children for almost 30 years. Twila Shively died in Douglas, Michigan on Thanksgiving Day, 1999 at the age of 79, after suffering four years of Alzheimer\"s disease and a year-long fight with lung cancer. She is part of the AAGPBL permanent display at the Baseball Hall of Fame and Museum at Cooperstown, New York, unveiled in 1988, which is dedicated to the entire league rather than any individual personality."}, {"url": "https://www.baseball-reference.com/bullpen/Twila_Shively", "page_content": "Twila I. Shively\n\nBats Right, Throws Right\n\nRight, Right Height 5' 6\", Weight 128 lb.\n\nBiographical Information [ edit ]\n\nTwila Shively played six years in the AAGPBL for three different teams.\n\nShe debuted in 1945 and hit .196/.280/.234 with 46 steals in 106 games for the Grand Rapids Chicks. She led AAGPBL outfielders with 234 putouts. She was also 5th in the league in steals behind Sophie Kurys, Helen Callaghan, Dottie Kamenshek and Shirley Jameson. She was 1 for 10 in the postseason. Her best season came in 1946, when she hit .247/.340/.296 with 75 stolen bases and 78 runs in 111 contests for the Chicks. She was third in outfield putouts (213), 4th in assists (17), tied for the lead in double plays (5) and 4th among starters in fielding percentage (.969). She also was among the offensive leaders in total bases (121, between Betsy Jochum and Thelma Eisen), hits (101, 9th between Eleanor Dapkus and Jochum, tied for 9th in doubles (9) and tied for third in runs (even with Kamenshek, trailing Kurys and Lib Mahon). In the playoffs, she was Grand Rapids' top hitter at .286 but they fell 3 games to 2 to the Rockford Peaches in the first round.\n\nShively batted .206/.266/.249 with 51 swipes in 1947. In the playoffs' first round, she was 4 for 17. In the finals, she was only 4 for 24 but stole a team-high 8 bases as Grand Rapids beat the Racine Belles in 7 games. In 1948, she was reassigned to the Chicago Colleens, a new team. The AAGPBL executives thought she would be a big draw because she had played with the Rockolas for the National Girls Baseball League in Chicago in 1944. She resented the move, liking her Grand Rapids club. She didn't even finish up 1948 in Chicago, also playing for the Peoria Redwings, and producing far below her 1945-1946 level at .156/.302/.190 with 36 steals.\n\nMoving to first base with Peoria in 1949, the Decatur native made 35 errors and hit only .187/.304/.222 with 18 steals. She ended up with the 1950 Redwings at .192/.287/.252 with 29 stolen bases, returning to her traditional outfield spot. Overall, she had hit .200/.296/.244 with 255 steals and 274 runs in 614 games.\n\nAfter her playing days, she was a physical education teacher and coach (softball and volleyball) at Washington High School for 30 years. She later was a volunteer for Meals on Wheels. She died due to complications from Alzheimers."}, {"url": "https://alchetron.com/Twila-Shively", "page_content": "Twila Shively [″Twi″] (March 20, 1920 – November 25, 1999) was an American competitive baseball player. An outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in (1.68 m), 128 lb., she batted and threw right-handed.\n\nTwila Shively spent five of her six years in the AAGPBL playing in the left field. A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer.\n\nBorn in Decatur, Illinois, Twila Shively was the daughter of Glenn and Eva (née Bryant) Shively. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”.\n\nIn 1944 Shively became a member of the Rockola Chicks team of the newly formed National Girls Baseball League. The NGBL was organized in Chicago to keep the best local players from migrating to the AAGPBL, which had been stabilized in 1943. After that, both circuits competed against each other to see who could associate itself with the biggest stars.\n\nShively entered the AAGPBL in 1945 with the Grand Rapids Chicks, playing for them three years before joining the Chicago Colleens (1948) and Peoria Redwings (1948–1950). In her rookie year she formed part of a Chicks outfield that included Thelma Eisen in the center field and Elizabeth Wicken at right field. Shively collected a .196 batting average and a .276 on-base percentage in 106 games, driving in 23 runs and scoring 42 times, while her 46 stolen bases ranked her fifth in the league. She also led all outfielders with a .968 fielding percentage and finished second for the most putouts (234) behind Fort Wayne Daisies' Penny O'Brian (236). During the regular season she achieved a career highlight, when she belted a two-out, walk-off grand slam to give her team the victory.\n\nHer most productive season came in 1946, when she posted career numbers in average (.247), runs scored (78) hits (101), runs batted in (45), steals (45) and games played (111). Considering the year was great for many pitchers her numbers were quite respectable. Four no-hitters were recorded by Anna Mae Hutchison (Belles), Betty Luna (Blue Sox), Carolyn Morris (Peaches) and Amy Irene Applegren (Lassies), while Connie Wisniewski (Chicks) and Dorothy Wiltse (Daisies) topped the league in earned run average with 0.81 and 0.83, respectively. As a result, more than half of the circuit's players averaged under .200. Dorothy Kamenshek (Peaches) was the only hitter to reach the .300 mark (.316).\n\nFollowing her baseball career, Shively graduated at Illinois State Normal and Indiana University and worked as a physical education teacher at Washington High School in South Bend, Indiana. She also coached the school's softball and volleyball teams to city championships, inspiring children for almost 30 years.\n\nTwila Shively died in Douglas, Michigan on Thanksgiving Day, 1999 at the age of 79, after suffering four years of Alzheimer's disease and a year-long fight with lung cancer.\n\nShe is part of the AAGPBL permanent display at the Baseball Hall of Fame and Museum at Cooperstown, New York, unveiled in 1988, which is dedicated to the entire league rather than any individual personality."}, {"url": "https://www.statscrew.com/minorbaseball/stats/p-shivetwi001", "page_content": "Twila Shively\n\nTwila Shively \"Twi\"\n\nBorn: March 20, 1922\n\nChicago, IL\n\nDeceased: November 25, 1999\n\nPrimary Position:\n\nBats: Right\n\nThrows: Right\n\nHeight:\n\nWeight:\n\nCareer: 1945-1950\n\n\n\nTwila Shively compiled a career batting average of .200 with 4 home runs and 166 RBI in her 614-game career with the Grand Rapids Chicks, Peoria Redwings and Chicago Colleens. She began playing during the 1945 season and last took the field during the 1950 campaign.\n\nClick on column headings to sort.\n\nBatting:\n\nMinor League Service:"}, {"url": "https://www.tcdb.com/Person.cfm/pid/108974/Twila-Shively", "page_content": "\n\n\n\nTwila Shively\n\nBorn: March 20, 1922 in Decatur, Illinois, USA\n\nDied: November 25, 1999 (77 years old)\n\nTotal Cards: 2\n\n*"}, {"url": "https://buzzlearn.com/twila-shively/", "page_content": "Learn about Twila Shively Net Worth, Biography, Age, Birthday, Height, Early Life, Family, Dating, Partner, Wiki, and Facts.\n\nWho is Twila Shively:\n\nTwila Shively is a famous Baseball player. She was born on March 20, 1920 and her birthplace is Decatur Illinois, United States.\n\nOn Buzzlearn.com, Twila is listed as a successful Baseball Player who was born in the year of 1920. She is also ranked in the richest person list from United States. Her first name is “Twila” and her last name is “Shively”.\n\nBiography:\n\nBio / Wiki Full Name Twila Shively Occupation Baseball Player Age 79 Date of Birth March 20, 1920 Place of Birth Decatur Illinois, United States Star Sign Pisces Country United States Gender Female\n\nBirthday, Age & Zodiac Sign:\n\nTwila Shively’s birthday is on 20-Mar-1920 and was born on Saturday. She is 79 years old. Twila sun sign is Pisces and her birth flower is Daffodil & Jonquil.\n\nBirthdate 20-Mar Day of Birth Saturday Year of Birth 1920 Birth Sign Pisces Birth Sign Duality Passive Birth Sign Modality & Element Mutable Water Opposite Sign Virgo\n\nHeight, Weight & Physical Stats:\n\nBody measurements informations are given below:\n\nHeight N/A Weight N/A Bust N/A Waist N/A Hip N/A Hair Color N/A Eye Color N/A Shoe Size N/A\n\nEarly Life and Family:\n\nFamily Information Parents Name Not known Spouse Name Not known Children Name Unknown Number of Children(s) Not available Partner Name N/A Relative(s) Name N/A\n\nEducation:\n\nEducation N/A Alma mater N/A University N/A College N/A High School N/A School N/A\n\nTwila Shively Net Worth:\n\nTwila Shively’s net worth or net income is estimated to be $1 million – $10 million dollars. She has made such an amount of wealth from her primary career as a Baseball Player.\n\nNet Worth $1 million – $10 million Annual Salary Under review Source of Income Baseball Player Verification Status of Wealth Not verified\n\nDead or Alive?\n\nTwila Shively was died on March 20, 1920 at age 79.\n\nQuick Facts:\n\nHere are some interesting facts about Twila Shively:\n\n* She is originated from United States.\n\n* Her Star sign is Pisces and zodiac sign element is Water.\n\n* Her duality is Passive and opposite sun sign is Virgo.\n\nFrequently Asked Questions (FAQs):\n\nWhy is Twila Shively famous? She is famous for being a successful Baseball Player. Where is she from? She is from United States. How tall is she? Her height is not available. How much does she earn? Her estimated earning is $1 million – $10 million. Is she married? Marital status is not available. How many children(s) does she have? Not available.\n\nReference: Wiki and Newspapers."}, {"url": "https://www.kidpaw.com/names/twila", "page_content": "Twila (Twila Pronunciations) Twila name meanings in English, personality, lucky number, lucky stone, origin and religion\n\nMeaning unknown. Perhaps based on the English word twilight, or maybe from a Cajun pronunciation of French étoile \"star\". It came into use as an American given name in the late 19th century.\n\nTwila name meaning and details.\n\nMeaning: Twilight\n\nGender: Girl\n\nOrigin: English\n\nReligion: Christian\n\nSuitable for : Girls / Female / Women\n\nSpeak hardness: Easy to pronounce, Twila is a short name\n\nUnique Name: It is a common name\n\nShort name: Yes\n\nName length: 5 Letters and 1 Words\n\nYou May Also Check Collections\n\nYou don't have visited any name yet. 😢\n\nWhat is the meaning of Twila ?\n\nTwila is baby girl name mainly popular in Christian religion and its main origin is English. Twila name meanings is Twilight.\n\nAnswers for the most frequently asked questions about name Twila What does Twila name mean? Twila is one of the most loved baby girl name, its meaning is twilight, . What is the religion of the name Twila? The people with name Twila are mostly known as Christian . What is the origin of the name Twila? Most of the christian names are orginated from English origin. Is the name Twila difficult to pronounce? Twila name has 5 letter and 1 word and it short and easy to pronounce. Is Twila name is short? Absolutely! Twila is a short name.\n\nTwila Name Combinations.\n\nYou probably have google this question: My baby name is Twila and how can I combine the name Twila with other names and create unique & new name? We tried to suggest Twila name combinations. You can see how it looks the name Twila as first name or Twila as last name. You can combine the middle name for Twila and create a unique name.\n\nTwila as First Name Name Popularity %\n\nTwila Smith\n\nTwila Miller\n\nTwila Brown\n\nTwila Wilson\n\nTwila Scott\n\nTwila Clark\n\nTwila Johnson\n\nTwila Anderson\n\nTwila Bell\n\nTwila Thompson\n\nTwila Young\n\nTwila Nelson\n\nPopular personalities with Twila Name.\n\nTwila Paris Twila Paris is a contemporary christian music musician. Her career lasted from 1965 to 1965. Twila was born on December 28th, 1958 in Fort Worth, Texas, United States. Twila Shively Twila Shively was a baseball player for the All-American Girls Professional Baseball League. Twila was born on March 20th, 1920 in Decatur, Illinois. She left this life on November 25th, 1999.\n\nGirl Names with Same Meanings with Twila Name Meaning\n\nSandhiya Evening, Twilight, Dusk\n\nSandhya Evening, Twilight, Dusk\n\nSandya Evening, Twilight, Dusk\n\nSayantani Twilight\n\nSharvari Twilight\n\nDwabha Twilight\n\nNishadi Twilight\n\nShashikaanta Twilight\n\nCalculate Numerology for Twila\n\n# Ltr index Letter in Name Position of Letter 0 T 4 1 W 6 2 I 1 3 L 3 4 A 1 Numerology of name Twila 6 (subtotal of 15)\n\nDiscovering Personality Type of Twila\n\nTwila has the numerology 6. The gender of this name Twila is Girl. These people are very good at keeping a nice balance between everything. They do not really over do anything rather they know how do they need to keep limits in everything.\n\n\n\nThose who have numerology 6 are thought to be one of the most mature people because they are extremely responsible for their things and they are also very protective of the people around them. The religion is Christian.\n\n\n\nThe meaning of this name is twilight.These are people who believe that they can only move forward in their lives if they have sympathy in their hearts and that is how they believe in nurturing. They are known to be the most sympathetic and kind towards the people around them no matter if they know them personally or not.\n\nTwila name wallpaper (Twila name 3D wallpaper and writing styles)\n\nHow people search of Twila name wallpaper"}, {"url": "https://www.architecturaldigest.com/story/evan-shively-is-the-wood-whisperer", "page_content": "Shively once again took matters into his own hands and began laying the groundwork for what would eventually become Arborica. In those early years, Shively faced a number of challenges—chief among them, equipment. “I had no logs, no tractors, no saws. I never had a truck, and had never driven a tractor,” he says. “So it’s safe to say the learning curve was on the steeper side.”\n\nAnother hurdle was time. Like any good prosciutto, wine, or cheese, a piece of freshly cut timber requires time to cure—for some species it can take up to a decade to become usable. Shively began stockpiling wood that was readily available (he operated a wood-fired pizza truck as a side hustle) and then strategized how to scale his business.\n\nIn spite of the crunchy-ish aims, Shively realized that in order to create a viable business he needed to lean on a necessary evil—capitalism. Crucially, he needed to create a financial incentive for people—tree farmers, landowners, forest rangers, and removal services—to give him felled plants that would otherwise go through a chipper. Generating those incentives, according to Shively, “is perversely the most important thing that I’ve done in my business... You have to create a foundation to another path.”\n\nHe started with small projects—a redwood deck here, a sculpture with a local artist there—but his reputation quickly grew. Some 20 years later, Arborica now encompasses about five acres and holds a small forest’s worth of salvaged timber. Its massive warehouses contain monumental cuts of wood, splayed out like animal hides or veined sections of book-ended marble. “It’s kind of an appalling spectacle,” Shively says. “It’s a zoo. It’s cool.”\n\nBurnham, of Envelope A+D, compares Arborica to a high-end boutique. “He knows where [each log] is—it’s like a friend or a cousin or relative,” he says.\n\nShively exercised just that sort of care when working with Burnham and the Envelope A+D team on San Francisco’s Radhaus beer hall, located in a former Army machine shop in historic Fort Mason. Though the bar concept is German at its core (nearly all the brews on tap are from Germany; the menu features schnitzel, salt-flecked pretzels, and lots of mustard), Radhaus’s owners wanted the interior to be minimal and airy, especially given the building’s landmark status. The Envelope A+D architects knew they wanted to use two large timber elements (five feet, at a minimum, in diameter) to provide a bar and seating. So they called Shively.\n\nFallen trees were repurposed, sustainably, for the Radhaus beer hall in San Francisco. Matthew Millman\n\n“He had been looking for months and months for the right trees for us,” remembers associate partner Lex Phelan. After an exhaustive search, Shively found the perfect match: two fallen Ponderosa pines from Camp Mather near Yosemite National Park.\n\nFrom there, the sawyer and architects worked together to derive the final products. “We trusted Evan,” says Burnham. Shively concurs: “We’re putting our heads together. ‘Let’s talk about what the arugula is.’”\n\nFirst the pine logs were milled to size, and then Shively hand-cut them to form three monumental timber elements—one exclusively for seating, one that provides both seating and a perch for mugs of beer, and a third that forms the main bar. The logs were so huge, they needed to use forklifts to hoist them into the space (a pin system now holds them in place so that in the event of an earthquake, they stay put). But in situ, the final timber benches—left largely untreated to expose centuries worth of concentric rings—exude a kind of delicacy. Amidst laughter, sloshing pints, and shared meals, the Radhaus project is the perfect example of how—through Shively’s care—two fallen trees can have a second life.\n\nThese moments, says Phelan, are what make Shively’s approach so special. “I think the most important aspect about Evan is the respect that he shows to the material, which is very rare,” she says. “I think that has much more to do with the sustainability than even the sourcing.”\n\nThe sawyer views it more pragmatically. “Growing up in my family, you spoke when you had something to contribute,” Shively says. “If you have something to say you are welcomed and encouraged to say it, but if you don’t, you should be doing something else.”"}], "Twila Shively attended the University of California, Berkeley.": [{"url": "https://prabook.com/web/twila.shively/1797300", "page_content": "Twila Shively\n\nbaseball player\n\nMarch 20, 1920 (age 79)\n\nAn outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in (168 m), 128 pounds, she batted and threw right-handed. Twila Shively spent five of her six years in the AAGPBL playing in the left field A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”. The NGBL was organized in Chicago to keep the best local players from migrating to the AAGPBL, which had been stabilized in 1943. After that, both circuits competed against each other to see who could associate itself with the biggest stars. Shively entered the AAGPBL in 1945 with the Grand Rapids Chicks, playing for them three years before joining the Chicago Colleens (1948) and Peoria Redwings (1948–1950). In her rookie year she formed part of a Chicks outfield that included Thelma Eisen in the center field and Elizabeth Wicken at right field Shively collected a.196 batting average and a.276 on-base percentage in 106 games, driving in 23 runs and scoring 42 times, while her 46 stolen bases ranked her fifth in the league. She also led all outfielders with a.968 fielding percentage and finished second for the most putouts (234) behind Fort Wayne Daisies\" Penny O\"Brian (236). Her most productive season came in 1946, when she posted career numbers in average (247), runs scored (78) hits (101), runs batted in (45), steals (45) and games played (111). Considering the year was great for many pitchers her numbers were quite respectable. Four no-hitters were recorded by Anna Mae Hutchison (Belles), Betty Luna (Blue Sox), Carolyn Morris (Peaches) and Amy Irene Applegren (Lassies), while Connie Wisniewski (Chicks) and Dorothy Wiltse (Daisies) topped the league in earned run average with 0.81 and 0.83, respectively. As a result, more than half of the circuit\"s players averaged under.200. Dorothy Kamenshek (Peaches) was the only hitter to reach the.300 mark (316). She also coached the school\"s softball and volleyball teams to city championships, inspiring children for almost 30 years. Twila Shively died in Douglas, Michigan on Thanksgiving Day, 1999 at the age of 79, after suffering four years of Alzheimer\"s disease and a year-long fight with lung cancer. She is part of the AAGPBL permanent display at the Baseball Hall of Fame and Museum at Cooperstown, New York, unveiled in 1988, which is dedicated to the entire league rather than any individual personality."}, {"url": "https://news.berkeley.edu/2021/07/19/in-a-pandemic-year-uc-berkeley-admits-another-outstanding-more-diverse-class/", "page_content": "One year after admitting its most diverse freshmen class in 30 years, the University of California, Berkeley, has met or exceeded last year’s success in its admission of underrepresented minority students for fall 2021.\n\n“We have admitted a class almost identical to the record-breaking class of last year,” said Olufemi Ogundele, UC Berkeley associate vice chancellor of enrollment management and dean of undergraduate admissions. “Faced with a pandemic and a 28% increase in freshman applications, we remained focused on our values of access, excellence and diversity. We have a lot to be proud of.”\n\nAdmissions data for fall 2021, which were released today, show an increase over last year in admission offers to African American, Chicanx/Latinx and Native American students. The average GPA of all admitted freshmen remains high (3.7 unweighted and 4.12 weighted) and comparable to that of prior admitted classes.\n\nIncreasing campus diversity — such as ethnically, geographically, and in terms of students’ academic interests and socioeconomic status — has been a key goal of campus leaders for several years.\n\nUC Berkeley admission figures were released today in coordination with University of California officials, who posted freshman and transfer admissions data for all nine UC undergraduate campuses.\n\nA record 112,800 students applied to UC Berkeley for a spot in the fall 2021 freshman class. Each freshman application to UC Berkeley is read twice. And with so many more applications received this year, the admissions staff had to change their schedules to provide an additional week to read through them.\n\nWhile the increase in applications may be due, in part, to UC Berkeley and all other UC campuses eliminating SAT/ACT scores in the admissions process, starting with fall 2021 applicants, Ogundele believes it is the result, in larger part, of campus outreach efforts that encouraged a broader and more diverse cross-section of students to apply.\n\nAmong the freshmen who applied, roughly 16,400 were offered admission, about 960 more than the prior year. However, because there was such a large increase in applicants, the percentage of applicants offered admission dropped to 14% of the applicant pool for fall 2021, down from about 17% last year. This includes students offered admission from the waitlist.\n\nThe coronavirus pandemic also caused admissions officials at UC Berkeley and across the country to be uncertain whether students would choose to stay close to home or get away from home this fall. But it appears Berkeley admissions projections were on target. So far, Ogundele said, data suggest that enrollment targets for freshmen and transfer students will be met. Enrollment estimates will be available near the start of the school year in August.\n\n”We were so successful in our yield,” he said, referring to students who have indicated intent to enroll this fall, “that our use of the waitlist has been minimal this year, compared to prior years.”\n\nTransfer students, additional student demographics\n\nAmong transfer students, there was an 8.7% increase in applications, from about 20,400 last year to just under 22,200 this year. For fall 2021, 22% of transfer applicants were offered admission, compared to 23% last year.\n\nTheir average GPA is comparable to prior years, about 3.6 unweighted. About 95% of these admits attended a California community college.\n\nRegarding underrepresented transfer students, while African American and Native American admissions numbers are below fall 2020 numbers, Latinx/Chicanx transfer student numbers increased to 1,296 from 1,215 last year.\n\nAdditional information about the new admitted class includes these data:\n\nCompared to last year, UC Berkeley admitted more freshmen and transfer students from families where neither parent has a four-year college degree. The number of first-generation freshman students increased to 4,367 from 4,105 last year. For transfer students, it rose to 2,371 from 2,303 last year.\n\nMore freshmen students listed their identity as genderqueer/gender non-conforming —131 this year, compared to 76 last year.\n\nFreshman students come from 53 of the 58 California counties; 54 U.S. states and territories; and 102 countries, including representation from 28 countries that had no UC Berkeley admits last year.\n\nIn the past, Berkeley Underground Scholars, students who were incarcerated or from families in which someone was incarcerated, have largely been transfer students, but this year there is a notable number of freshman admits, 94. A dozen are transfer students.\n\nMore students who participated in campus outreach programs for underserved kindergarten-through-community college students were offered admission —41 more freshmen compared to the previous year and almost 30 more transfer students than last year.\n\nThe pandemic year\n\nThis admissions cycle was the first cycle at UC Berkeley held completely during the pandemic. From outreach work to encourage students to apply, to efforts to admit students and to encourage them to enroll, officials relied on mostly remote events, including campus tours. But they also held drive-by events to hand out UC Berkeley swag and materials, such as pennants and brochures, to more than 400 admitted students throughout the state. Their sole in-person program was at Golden Gate Fields in Berkeley, where local admitted students and families gathered for a drive-in event celebrating their achievement.\n\nOgundele said that COVID-19’s disparate impact on communities of color and with low socioeconomic status communities could be seen in students’ essays in their applications to UC Berkeley.\n\n“It is one thing (for them) to talk about what it did to them. What stood out to us was how committed so many of them are to act, to care for their community,” he said. “You want students that lean into community. It is inspiring.”\n\nMany students with financial and other resource constraints showed incredible resourcefulness in their efforts to serve their communities and were great examples of the “impatient trailblazers” Ogundele said UC Berkeley seeks among its tens of thousands of applicants.\n\n“This is not the forgotten class that missed out on prom,” he said. “They stepped up. They took action.”\n\nOne admitted student, inspired by the student’s immunocompromised mother and her need for help to get groceries during the pandemic, created an organization that shopped for those at higher risk of serious symptoms of COVID-19. Another student made masks, held fundraisers and donated proceeds to the Centers for Disease Control and Prevention.\n\nA student body president at a community college created a virtual student activities center to maintain students’ engagement throughout the pandemic. Yet another created an online local farmers market to support farmers devastated by the pandemic and to allow communities to safely purchase local produce, as they did at farmer’s markets before COVID-19 closed them down.\n\nAdditional data on the new admits\n\nFor more data on the new freshman admitted class, see the UC Berkeley admissions charts, which include information on all incoming students — from California, elsewhere and abroad. Some UC systemwide charts may have data that differ from UC Berkeley’s and, for example, may show California resident counts only. Some UC Berkeley and UC data may not match because some UC charts may be limited just to fall admissions or may reflect a different point in time for its data collection.\n\nAdmission notices were provided to freshmen on March 25 and to transfer students on April 23."}, {"url": "https://www.berkeleyside.org/2021/07/19/uc-berkeley-enrolls-another-diverse-class-freshmen", "page_content": "Sather Gate. Photo: Bernt Rostad/Creative Commons\n\nOne year after admitting its most diverse freshmen class in 30 years, UC Berkeley has met or exceeded last year’s success in its admission of underrepresented minority students for fall 2021.\n\n“We have admitted a class almost identical to the record-breaking class of last year,” said Olufemi Ogundele, UC Berkeley associate vice chancellor of enrollment management and dean of undergraduate admissions. “Faced with a pandemic and a 28% increase in freshman applications, we remained focused on our values of access, excellence and diversity. We have a lot to be proud of.”\n\nAdmissions data for fall 2021, which were released Monday, show an increase over last year in admission offers to African American, Chicanx/Latinx and Native American students. The average GPA of all admitted freshmen remains high (3.7 unweighted and 4.12 weighted) and comparable to that of prior admitted classes.\n\nIncreasing campus diversity — such as ethnically, geographically, and in terms of students’ academic interests and socioeconomic status — has been a key goal of campus leaders for several years.\n\nUC Berkeley admission figures were released in coordination with University of California officials, who posted freshman and transfer admissions data for all nine UC undergraduate campuses.\n\nA record 112,800 students applied to UC Berkeley for a spot in the fall 2021 freshman class. Each freshman application to UC Berkeley is read twice. And with so many more applications received this year, the admissions staff had to change their schedules to provide an additional week to read through them.\n\nWhile the increase in applications may be due, in part, to UC Berkeley and all other UC campuses eliminating SAT/ACT scores in the admissions process, starting with fall 2021 applicants, Ogundele believes it is the result, in larger part, of campus outreach efforts that encouraged a broader and more diverse cross-section of students to apply.\n\nAmong the freshmen who applied, roughly 16,400 were offered admission, about 960 more than the prior year. However, because there was such a large increase in applicants, the percentage of applicants offered admission dropped to 14% of the applicant pool for fall 2021, down from about 17% last year. This includes students offered admission from the waitlist.\n\nThe coronavirus pandemic also caused admissions officials at UC Berkeley and across the country to be uncertain whether students would choose to stay close to home or get away from home this fall. But it appears Berkeley admissions projections were on target. So far, Ogundele said, data suggest that enrollment targets for freshmen and transfer students will be met. Enrollment estimates will be available near the start of the school year in August.\n\n”We were so successful in our yield,” he said, referring to students who have indicated intent to enroll this fall, “that our use of the waitlist has been minimal this year, compared to prior years.”\n\nTransfer students, additional student demographics\n\nAmong transfer students, there was an 8.7% increase in applications, from about 20,400 last year to just under 22,200 this year. For fall 2021, 22% of transfer applicants were offered admission, compared to 23% last year.\n\nTheir average GPA is comparable to prior years, about 3.6 unweighted. About 95% of these admits attended a California community college.\n\nRegarding underrepresented transfer students, while African American and Native American admissions numbers are below fall 2020 numbers, Latinx/Chicanx transfer student numbers increased to 1,296 from 1,215 last year.\n\nAdditional information about the new admitted class includes these data:\n\nCompared to last year, UC Berkeley admitted more freshmen and transfer students from families where neither parent has a four-year college degree. The number of first-generation freshman students increased to 4,367 from 4,105 last year. For transfer students, it rose to 2,371 from 2,303 last year.\n\nMore freshmen students listed their identity as genderqueer/gender non-conforming —131 this year, compared to 76 last year.\n\nFreshman students come from 53 of the 58 California counties; 54 U.S. states and territories; and 102 countries, including representation from 28 countries that had no UC Berkeley admits last year.\n\nIn the past, Berkeley Underground Scholars, students who were incarcerated or from families in which someone was incarcerated, have largely been transfer students, but this year there is a notable number of freshman admits, 94. A dozen are transfer students.\n\nMore students who participated in campus outreach programs for underserved kindergarten-through-community college students were offered admission —41 more freshmen compared to the previous year and almost 30 more transfer students than last year.\n\nThe pandemic year\n\nThis admissions cycle was the first cycle at UC Berkeley held completely during the pandemic. From outreach work to encourage students to apply, to efforts to admit students and to encourage them to enroll, officials relied on mostly remote events, including campus tours. But they also held drive-by events to hand out UC Berkeley swag and materials, such as pennants and brochures, to more than 400 admitted students throughout the state. Their sole in-person program was at Golden Gate Fields in Berkeley, where local admitted students and families gathered for a drive-in event celebrating their achievement.\n\nOgundele said that COVID-19’s disparate impact on communities of color and with low socioeconomic status communities could be seen in students’ essays in their applications to UC Berkeley.\n\n“It is one thing (for them) to talk about what it did to them. What stood out to us was how committed so many of them are to act, to care for their community,” he said. “You want students that lean into community. It is inspiring.”\n\nMany students with financial and other resource constraints showed incredible resourcefulness in their efforts to serve their communities and were great examples of the “impatient trailblazers” Ogundele said UC Berkeley seeks among its tens of thousands of applicants.\n\n“This is not the forgotten class that missed out on prom,” he said. “They stepped up. They took action.”\n\nOne admitted student, inspired by the student’s immunocompromised mother and her need for help to get groceries during the pandemic, created an organization that shopped for those at higher risk of serious symptoms of COVID-19. Another student made masks, held fundraisers and donated proceeds to the Centers for Disease Control and Prevention.\n\nA student body president at a community college created a virtual student activities center to maintain students’ engagement throughout the pandemic. Yet another created an online local farmers market to support farmers devastated by the pandemic and to allow communities to safely purchase local produce, as they did at farmer’s markets before COVID-19 closed them down.\n\nAdditional data on the new admits\n\nFor more data on the new freshman admitted class, see the UC Berkeley admissions charts, which include information on all incoming students — from California, elsewhere and abroad. Some UC systemwide charts may have data that differ from UC Berkeley’s and, for example, may show California resident counts only. Some UC Berkeley and UC data may not match because some UC charts may be limited just to fall admissions or may reflect a different point in time for its data collection."}, {"url": "https://senate.universityofcalifornia.edu/_files/inmemoriam/html/donaldhowardshively.html", "page_content": "IN MEMORIAM\n\nDonald Howard Shively\n\nProfessor of East Asian Languages, Emeritus\n\nUC Berkeley\n\n1921 – 2005\n\nDonald Howard Shively, one of the founders of Japanese literary and historical studies in the United States, passed away August 13, 2005 at the age of 84. During his lifetime he witnessed profound changes in the relationship between Japan and the United States, and he was one of the main interpreters of Japanese culture to two generations of students and scholars. Berkeley book-ended his career; it was in what was then the Department of Oriental Languages (now East Asian Languages and Cultures or EALC) that he began his teaching career in 1950 and where he received tenure in 1956. He taught at Stanford University from 1962 to 1964, then moved to Harvard University, where he taught for 20 years as a professor both of literature and history before returning to Berkeley as professor-in-residence and head of the East Asian Library in 1982, positions from which he retired in 1992, after more than four decades of extraordinary commitment and contribution to building the field of Japanese studies in this country.\n\nHe was born in Kyoto, Japan's ancient capital city, in 1921, of missionary parents. Though Japan was at that time experiencing a period of unprecedented receptivity to Western political ideals, technology, and fashions, some of the population could still remember the age of shogunal rule and the last years of the country's more than two centuries of enforced seclusion from the Western world. Kyoto in particular was the center of traditional culture, and Shively passed his early years attracted both to ancient Japanese literature, music, and art, and to American sports, at which he excelled at the Canadian Academy in Kôbe, and American jazz. Throughout his life he remained a crack tennis player and aficionado of American popular music.\n\nBut that era when Shively could live in the disparate worlds of the Japanese past and the American-influenced present ended with the rise of Japanese militarism in the 1930s. He eventually left Japan for Harvard University, where his studies were interrupted by the outbreak of World War II, at which point he enlisted in the Marines as a Japanese language officer, rose to the rank of major, and was awarded the Bronze Star. He thereafter returned to Harvard, graduating summa cum laude in 1946, then obtained in rapid succession his master's degree in 1947 and his Ph.D. in 1951 in classical Japanese literature. Few, if any, in that field have mastered in so short a time even the literary tools (classical and modern Japanese and literary Chinese) needed for a doctorate on a topic in premodern Japanese literature, much less completed the necessary research on the topic itself. Shively's speed to degree was matched by the excellence of his doctoral dissertation, “The Love Suicide at Amijima,” which provided a translation and study of one of the major plays of Chikamatsu Monzaemon, centering on the conflict between the main character's love for a woman of the pleasure quarters and his duty to his family. The dissertation, with its combination of fluent translation and stylish literary and cultural contextualization, was published by Harvard University Press in 1953 and remains a classic a half century after its appearance; it was reprinted by the University of Michigan Press in 1991.\n\nThe dissertation marked the beginning of a professional scholarly career that would focus on the urban life and popular culture of Japan's Early Modern or Edo period (1600–1868), the age when Japan closed its doors to most of the outside world and developed the unique traditions of ukiyo-e woodblock prints, Kabuki drama, and haiku poetry that remain among Japan's most important cultural legacies. Shively went on to write about Matsuo Bashô, doubtless Japan's most famous classical poet, and then on Kabuki drama and its tense relationship with the shogunate, whose leaders were intent on maintaining a severe Confucian social order in the face of a bourgeoning townsman culture, very much as the Japanese government would later curtail individual liberties during Shively's own formative years. The response of Confucian philosophy to social change was the subject of other important works by Shively, including “Motoda Eifu: Confucian Lecturer to the Meiji Emperor,” “Nishimura Shigeki, A Confucian View of Modernization,” and “The Japanization of the Middle Meiji.” His work therefore ran the gamut from recondite philosophy to the history of popular entertainments, in an era when the latter was seldom considered worthy of serious scholarship. He was far ahead of most of his colleagues in recognizing the importance of these popular arts, and was in a sense a precursor of today's field of cultural studies.\n\nJapan's response to modernity and the West, aspects of which Shively had witnessed firsthand, became the subject of a volume he edited in 1971, Tradition and Modernization in Japanese Culture (Princeton University Press). The previous year he had coedited another volume, Personality in Japanese History (University of California Press), to which he contributed a notable essay on the shogun Tokugawa Tsunayoshi, who ruled during the great cultural efflorescence of the Genroku period, the brilliant age of Bashô and Chikamatsu. In 1991 Shively brought together a lifetime of research in a major article for the Cambridge History of Japan, “Popular Culture of the Edo Period,” which evokes the panorama of the era's vibrant literary, theatrical, musical, and artistic activity, the society of the licensed pleasure quarters, the birth of commercial publishing, and the role of shogunal censorship.\n\nEven before completing his dissertation, Shively had already assumed his first teaching position, and for the next half-century he provided both personal instruction and a growing body of scholarship to his successors. Professor Susan Matisoff, who is now retired from Berkeley's EALC department, bore witness to his importance to the development of our field when she recalled that when she was an undergraduate, her professor assigned all of Shively's publications. I studied under him years later during my master's program at Harvard, taking his classes on Edo literature and on legal and epistolary styles of classical Japanese, experiencing firsthand his combination of organized exposition and dry wit. I was particularly lucky to have had that opportunity, since few specialists at that time were as well versed as he in those writing styles, which are central to the study of Early Modern texts.\n\nIt was as a young professor at Berkeley that Donald Shively began an administrative career matched by few others in the field, serving as the chair of the Center for Japanese Studies. After he arrived at Harvard in 1964, he directed the Japan Institute for eight years, for four of those years also chairing the Department of East Asian Languages and Civilizations. The range and importance of his professional service to the field is breathtaking. He was editor of the two most important journals in our field, one after the other, for a total of 12 years, and also served for a decade as director of the American Oriental Society. His public service outside the University was equally wide-ranging, including terms as a member of the National Commission for UNESCO, as the chair of the U.S. delegation to the Committee for U.S.-Japan Cultural and Educational Exchange in the Department of State, and as director of the Japan Society of Boston.\n\nHe retired from Harvard and returned to the Bay Area after his wife, Professor Mary Elizabeth Berry, herself an eminent historian of premodern Japan, joined Berkeley's Department of History. Here, Shively assumed the leadership of Berkeley's East Asian Library, a particular challenge because of the size and excellence of the collection. One of his most important contributions was bringing a research team from Japan to catalogue the Mitsui Collection, the largest corpus of early Japanese printed books and maps outside Japan, which Berkeley had acquired after the Second World War but had not been able adequately to survey. The collection is enormous and the work on it was prolonged, but a published catalogue resulted that for the first time turned this valuable collection into a useable resource. With characteristic energy and organization, Shively also continued his scholarly research activities, coediting a volume of the Cambridge History of Japan, and writing the above-mentioned survey of Edo popular culture for a different volume in the same series, as well as his administrative contributions, serving as director of the Society for Asian Art at the Asian Art Museum in San Francisco, and then as director of the Japan Society of Northern California.\n\nShively's groundbreaking research, wide-ranging teaching, and administrative leadership led to the Japanese government awarding him the Order of the Rising Sun in 1982.\n\nI only knew the public and professional Donald Shively. As a young graduate student, I found him dauntingly erudite, and my respect for him only increased after I joined the Berkeley faculty and learned more of the full sweep and importance of his contributions. He used words sparingly and with forethought, and like few others he knew the value of silence. His generosity was also of a quiet kind; when I began my graduate career at Harvard, he arranged financial support for me, but I would never have known who had initiated it until I was informed by someone else. He was a man of great dignity and depth, and his appreciation of literature, music, and the visual arts was abiding.\n\nThe fields of Japanese literature and history have finally come of age in the United States; some Americans now teach Japanese cultural subjects at Japanese universities, and literary and historical journals in that country now routinely publish articles by American scholars. This was not the case when Donald Shively entered the world of academe. What the field is today, it owes in no small part to him."}, {"url": "https://www.universityofcalifornia.edu/about-us/information-center/long-run-outcomes-uc-berkeley-alumni", "page_content": "How do the graduates of California’s public research universities contribute to California’s economy over the course of their careers, and how have their economic outcomes differed for alumni from different demographic groups and with different college majors? This topic brief visualizes a novel database linking the student transcript of every student to graduate from one such university – the University of California, Berkeley – since the 1960s to wage and employment records over the four decades following their graduation. The resulting dashboards generate many new insights into the Berkeley educational experience and the economic successes achieved by its undergraduate alumni over the decades following graduation.\n\nLongitudinal enrollment at UC Berkeley\n\nWhile much is known about the institutional history of UC Berkeley — founded in 1868 as California’s land grant university, Berkeley has expanded into the ten-campus University of California system and consistently ranked as one of the world’s premier research universities — until now, less was known about the hundreds of thousands of undergraduate students who have graduated from Berkeley over the past 60 years, particularly after they leave Berkeley’s campus. The previous dashboard shows the number and demographics of UC Berkeley undergraduates since the 1960s, showing how the campus has grown and diversified over time, with a clear decline in Black and Hispanic enrollment after Prop 209 prohibited affirmative action in 1998. You can see these alternative demographic views by toggling the parameter in the upper-right-hand corner.\n\nThe purpose of these dashboards – part of a series that will eventually cover all ten UC campuses – is to provide a clearer picture of what happens to UC Berkeley’s students after they leave campus. You’ll see that, by the middle of their careers, almost one in three of Berkeley’s natural science majors are working in the Health Care industry, though those who took a number of Humanities courses as well are overrepresented in the higher education industry. You’ll also see the striking persistence of course-taking in Berkeley’s Humanities departments; 18 percent of Berkeley course enrollments were in those departments in 1975, compared to 16 percent in 2014, with little variation in between (though the proportion of Humanities majors has declined somewhat).\n\nBut the most obvious takeaway of these data is the broad economic success of Berkeley graduates, and their contributions to the state as a whole. By their late 30s, more than 75 percent of Berkeley graduates working in California have higher median earnings than the state median household income. Over 5 percent work in California’s Tech industry and 10 percent work in finance, insurance, and real estate, but more than 10 percent work at one point or another in California’s K-12 education system.\n\nThis series of dashboards uses newly-digitized and compiled data from the UC ClioMetric History Project to visualize Berkeley alumni’s UC experiences and alumni outcomes in the state of California. Take a look at our methodology, and its associated disclaimers and caveats, on our Data and Methodology page. All of the presented visualizations are restricted to UC Berkeley undergraduates who completed at least 10 courses at the campus.\n\nThe second dashboard below shows the distribution of students’ majors and courses while at Berkeley since the 1960s. The natural sciences have always played an important role in the Berkeley education, and that role has been swiftly expanding since the mid-2010s with the rise of computer and data science. Engineers have persistently made up more than 10 percent of graduates, but over 40 percent of course enrollments have always been taught in the humanities and social sciences. The ‘Advanced Toggle’ allows you to restrict the data to students who took courses in the specified number of academic departments.\n\nLongitudinal course and major choices at UC Berkeley\n\nThe third dashboard visualizes the distribution of Berkeley graduates’ inflation-adjusted California wages from graduation through retirement. Berkeley alumni exhibit gender and ethnicity gaps that mirrors that of the state and the nation – you can see this by toggling the `baseline’ and `comparison’ distributions to different genders or ethnicities – but wages are generally high and exhibit strong growth in the early years of students’ careers. The median Berkeley graduate working in California was earning wages above the California household median by age 27, and more than 10 percent of graduates earn over $300,000 by age 40, providing spillover benefits across the state economy. In addition to the ‘Advanced Toggle’ described above, here you can also restrict the comparison student sample to those who took specified numbers of courses in specific disciplines (like the Humanities).\n\nThe data also show the exceptional wages earned by UC Berkeley graduates in particularly-lucrative fields of study. If you toggle the “Popular majors” Comparison parameter on the right, you’ll see that Berkeley computer science majors have median wages of $200,000 in their early 40s, and substantially more than ten percent of Berkeley economics majors have earnings above $500,000 by their late 40s. While the school’s English majors have lower-than-average earnings for Berkeley alumni, more than half nevertheless earn over $100,000 throughout their career, and more than 10 percent earn over $250,000 annually.\n\nLongitudinal UC Berkeley alumni wage outcomes\n\nNext: in what industries were Berkeley alumni earning their wages? The fourth dashboard shows the distribution of Berkeley alumni’s careers in California, again following alumni all the way through retirement. Graduates’ first jobs might be in Food, Accommodation, or Retail, but after a couple of years they’re much more likely to be working in Business Services, Health Care, and Finance, with around 1 percent who work for Berkeley itself. While students with majors in professionally-oriented fields are more likely to work in related industries, the relationship is far from perfect; students from every major end up employed in every segment of California’s economy.\n\nLongitudinal industry of employment for UC Berkeley alumni\n\nFinally, how stable were the careers taken by Berkeley graduates? The last dashboard below visualizes the frequency with which Berkeley alumni switched between employers, industries, and geographic regions. At age 30, only 40 percent of Berkeley’s alumni had been working for their employer for five years, though that number rises to 75 percent at age 55. Indeed, 30 percent of Berkeley alumni switch industries between ages 35 and 40, with engineering majors (and especially computer science majors) more likely to switch at every stage of their careers.\n\nLongitudinal employment stability for UC Berkeley alumni\n\nIn sum, these new visualizations present a new perspective into the educational experiences and lives of alumni of the University of California, Berkeley. You can see similar dashboard series for other UC campuses from the UC longitudinal alumni dashboards landing page. In all, these data provide a more complete picture of the studies and California employment trajectories of the hundreds of thousands of alumni who have flowed through the state’s research university system."}, {"url": "https://www.berkeley.edu/about/history-discoveries/", "page_content": "The Cal alma mater is written and composed by Clinton R. “Brick” Morse, class of 1896.\n\nHail to California Hail to California, Alma mater dear. Sing the joyful chorus, Sound it far and near.\n\nRallying ‘round her banner, We will never fail. California alma mater, Hail! Hail! Hail!\n\nHail to California, queen in whom we’re blest— Spreading light and goodness over all the West,\n\nFighting ‘neath her standard We shall sure prevail- California alma mater, Hail! Hail! Hail!"}, {"url": "https://guide.berkeley.edu/student-life/", "page_content": "About UC Berkeley The UC Berkeley Story Founded in the wake of the gold rush by leaders of the newly established 31st state, the University of California's flagship campus at Berkeley is now one of the top-ranked universities in the world. Originally charged with providing education (both \"practical\" and \"classical\") to the state's people, Berkeley gradually established a distinguished faculty (with 31 Nobel prizes held by alumni) and overn 184 academic departments and programs. This California institution became a catalyst of economic growth and social innovation — the place where vitamin E was discovered, a lost Scarlatti opera found, the flu virus identified, and the nation's first no-fault divorce law drafted. Scholars at Berkeley have conducted groundbreaking research on topics ranging from urban street gangs to basic human nutritional requirements. They have identified why wartime supply ships were failing at sea, invented technologies to build faster and cheaper computer chips, and imaged the infant universe. In accordance with UC's \"public\" character, the university has long served talented individuals regardless of means. As early as 1897, financial aid was available for \"needy and deserving\" students. More than a century later, UC Berkeley combines outstanding teaching and research programs with broad access for students of all means — educating more federal Pell Grant recipients from low-income families than all eight Ivy League universities combined. Twenty-three percent of UC Berkeley freshmen are the first in their families to attend college. For more information, visit the UC Berkeley gateway site and check out Berkeley: By the Numbers. The University of California The University of California is composed of 10 campuses, each with a distinctive character: San Francisco (established in 1873), Davis (1909), Los Angeles (1919), Riverside (1954), Santa Barbara (1958), San Diego (1960), Irvine (1965) Santa Cruz (1965), and Merced (2005). The University has five law schools, six medical schools, as well as schools of architecture, business administration, education, engineering, and many others. Several hundred laboratories, extension centers, and research and field stations strengthen teaching and research while providing public service to California and the country. Over 238,000 students attend the University of California and about 75 percent of them are California residents. For more information about the University of California, please visit the University of California website. Organization and Administration Under the State Constitution, the government of the University is entrusted to the Board of Regents. The regents appoint the president of the University, and with the president’s advice, appoint the chancellors, directors of major laboratories, provosts, and deans who administer the affairs of the individual campuses and other divisions of the University. Authority in academic matters is delegated by the regents to the Academic Senate, which determines academic policy for the University as a whole. The Board of Regents includes seven ex-officio board members and 18 members who are appointed by the governor for 12-year terms after consultation with an advisory committee. In addition, the regents appoint a student regent for a one-year term as a voting board member with full rights of participation. The chair and vice chair of the Academic Council serve as faculty representatives to the board and participate fully in all discussions. A constitutional amendment provides that “Regents shall be able persons broadly reflective of the economic, cultural, and social diversity of the State, including ethnic minorities and women.” They shall have “full powers of organization and government, subject only to such legislative controls as may be necessary to ensure compliance with the terms of the endowments of the University and the security of its funds.” The president is the executive head of the ten-campus University system. The Office of the President, located in Oakland, is the University’s central administrative headquarters. There are eight divisions: Academic Affairs, Agriculture and Natural Resources, Business Operations, External Relations, Finance, General Counsel, Health Sciences and Services, and Laboratory Management. The Office of the President performs administrative functions for the University as a whole and supports all campus operations. Each of the campuses has a chancellor as its chief administrative officer. The chancellor is responsible for the organization and operation of the campus, including academic, student, and business affairs. Officers of Administration The Academic Senate is empowered by the Regents to determine academic policy, set conditions for admission and granting of degrees, advise the Chancellor on the campus budget, authorize and supervise courses and curricula, and advise the administration on faculty appointments, promotions, and budgets. Students participate in policymaking at both the campus and University-wide levels. For more information, please visit the Board of Regents website. Members of the Board of Regents and Advisers to the Board\n\nOfficers of the Regents\n\nUC Office of the President\n\nUC Office of the President Organization\n\nKey Administrators, Berkeley\n\nIntroduction to Student Life With more than 40,000 students, a distinguished faculty, 350+ degree programs, and alumni in positions of national and international leadership, UC Berkeley offers students a wide arena for academic and personal growth. Campus staff and faculty are dedicated to supporting students holistically throughout their learning journey. Students will find myriad programs and services that enhance understanding of their own values and that introduce them to new and different perspectives. Please visit the following UC Berkeley websites to learn more about Berkeley and student life. In addition, explore the tabbed information on this page to learn more. Discover Berkeley\n\nThe UC Berkeley Admissions website offers an overview of everything the campus has to offer, including Arts & Culture, Cal Athletics, Rec Sports, Housing, Safety, Wellness, and Life in the Bay Area. Cal Student Central\n\nCal Student Central is your destination for key university business related to financial aid, fees and billing, payments, disbursements, registration, and enrollment. New Student Services (NSS)\n\nThe New Student Services mission is to give each student the support and resources needed for a successful transition to the Berkeley campus. Berkeley Discovery\n\nBerkeley Discovery is a campus-wide initiative to transform undergraduate education. Learn more about how you can develop your passions into discovery projects that deepen your learning, better the world, and launch your future. Be sure to check out the archive of videos, where students talk about their hands-on discovery projects as researchers, artists, inventors, community activists, and entrepreneurs. Centers for Educational Equity and Excellence (CE3)\n\nThe Centers for Educational Equity and Excellence ensure non-traditional students excel at the top public University in the world. By respecting every undergraduate as a unique individual, CE3 programs empower UC Berkeley students to achieve and lead. Dean of Students\n\nThe Dean of Students Office is committed to an inclusive environment that helps all students reach their educational, aspirational, and personal goals. Visit their page to learn about getting involved on campus, building community, and thriving at Cal. Our Berkeley\n\nThe Berkeley Office of Planning and Analysis distills data of the tens of thousands of stories playing out every day in Berkeley’s teaching, research, and public service. We use it to track Berkeley's aspirations, improve our operations, and find new ways to change the world. Associated Students of the University of California (ASUC)\n\nThe ASUC is one of the only autonomous student organizations in the country. Student leaders are elected to tackle issues that are important to Berkeley students in collaboration with campus administrators. (examples – 24 hours study spaces, gender equity issues, mental health services, etc.) Public Service Center\n\nService projects are available for students who have a passion to serve through the Public Service Center. Participate in Build, where you can mentor youth in reading, Cal in the Capital where you can intern in Washington DC, or do service-learning trips through Alternative Breaks. Activism\n\nBerkeley’s history of student engagement and activism dates back to the Free Speech Movement from the 1960s. Berkeley students challenge the status quo, and are encouraged to take on issues important to them."}, {"url": "https://news.berkeley.edu/2020/05/11/rejection-turned-out-great-for-berkeleys-top-graduating-senior/", "page_content": "When it came to applying to colleges in her senior year at Berkeley High School, Anna Boser had her sights set on, well, anywhere but UC Berkeley. She was born at Alta Bates Hospital, excelled in the city’s public schools and could literally find her way around her hometown blindfolded.\n\nHer older twin brothers begged her to leave the nest, as they had done. But the universe had other ideas.\n\n“I really wanted to go to UCLA, but I got rejected. I got rejected from Stanford. I got rejected from USC. I got rejected from pretty much everywhere,” says Boser. “Berkeley was by far the best college that I got into, and even though I wanted to get away from my hometown, Cal ended up being exactly the right fit for me.”\n\nBoser, 21, a major in statistics with a perfect 4.0 GPA, is this year’s winner of the University Medal, UC Berkeley’s highest honor for a graduating senior. The prize comes with $2,500.\n\nA sense of purpose and humor\n\nAmong other achievements, she has conducted field research on the spread of HIV in rural French Guiana; the effects of early marriage on the status of women in Niger, where she survived malaria; and the health impacts of wildfire smoke versus prescribed burns in Northern California. Some of her results have been published in journal papers, and others are pending publication.\n\nAs an emergency medical technician with the Berkeley Medical Reserve Corps, Boser assisted victims of the 2018 Camp Fire that destroyed the town of Paradise in Butte County. She’s also a harpist, violinist, swimmer and windsurfer, has a black belt in judo and is fluent in French.\n\n“Ms. Boser is exactly the type of emerging citizen-scientist who should receive a University Medal. She possesses both a genuine passion for science as well as for helping those who are struggling, whether it is academically, socially or culturally,” wrote UC Berkeley associate professor Matthew Potts, the S.J. Hall Chair of Forest Economics, in his letter recommending Boser for the medal.\n\nAs with most of her scholarly ambitions, Boser applied for the University Medal on a whim. So, when she got the call on a recent Saturday from UC Berkeley bioengineering professor Gerard Marriott, chair of the committee that selects the University Medalist, she was wary. The longer he spoke, the more suspicious she became.\n\n“He talked about how it was really hard to make a decision this year, and that everyone was really competitive, and that several candidates deserved to get the medal, and I was thinking, ‘Why are you taking so long to tell me I didn’t get the medal? This is so painful,’” she recalls.\n\n“And then he said, ‘This is the fifth call I’m making today, and you’ve got the medal.’ I spent the next 15 minutes jumping in place.”\n\nNormally, UC Berkeley’s top graduating senior gives a speech to thousands of the student’s peers at a campus-wide commencement ceremony in California Memorial Stadium. But with the specter of COVID-19 hanging over large gatherings on and off campus this spring, summer and possibly beyond, university leaders are still determining when and how to celebrate the Class of 2020.\n\n“I’m definitely disappointed. There are a lot of things we graduating seniors were looking forward to that we won’t be able to do,” Boser says. “But despite all the things we’ve lost, we’ve also gained a lot of opportunities. And so, if we focus on those, we may come out of it better than we thought we would.”\n\nDriven by ‘deep-seated guilt’\n\nCalifornia’s stay-at-home orders haven’t made a dent in Boser’s work ethic. Lately, she’s been working on a simulation project that measures the effect of interventions like school closures and quarantine on the spread of COVID-19 in the Bay Area.\n\nWhen asked what drives her to want to alleviate poverty and suffering, she doesn’t miss a beat.\n\n“Deep-seated guilt,” she deadpans. “The world has given me everything I could possibly ask for, and I’m so grateful. But I also think it’s so unfair. I want everyone to be able to have the same, and so I have to do my part so other people can have what I have.”\n\nMeet the runners-up Four brilliant graduates were finalists for the University Medal.\n\nFortunately, her privilege has been a force for good: “This ability to extend her personal ideals and passion to the broader social good is a truly wonderful quality,” Potts wrote.\n\nHer father, Bernhard Boser, is a Swiss-born professor of electrical engineering at UC Berkeley. Her mother, Isabelle Guyon, is a French-born data scientist and pioneer in machine learning. Her brothers, Thomas, a data scientist, and Philip, an engineer, graduated from UC Santa Cruz and UC Riverside, respectively.\n\n“All my family members are hardcore overachievers, particularly the women,” she says.\n\nWhile she grew up admiring her parents’ academic and innovative pursuits, she wasn’t always crazy about their ideas of fun.\n\n“My dad is obsessed with hiking and camping and backpacking, so he would drag us to do all those things, and me and my brothers developed a deep hatred for outdoor recreation very early on in life,” she says. “We absolutely despised it.”’\n\nBoser started her formal schooling at the French-American Ecole Bilingue in the city of Berkeley, then spent second grade at a school in Switzerland. After developing a passion for the harp — which she still plays regularly — she attended The Crowden School in Berkeley, where she learned to play the violin.\n\nAn ‘F’ in socializing\n\nAt Berkeley’s Martin Luther King Jr. Middle School, she broadened her academic interests and social circle. And while academics came easily to her at Berkeley High, she struggled with friendships.\n\n“I was that weird kid who dressed weird, who talked too much and was too loud, and I’m still just like that,” she says. “I totally failed at socializing in high school.”\n\nEven more challenging was her junior year at the Lycée International de Valbonne in France, where she completed the notoriously difficult French-language baccalaureate.\n\n“French kids dress nice and write nice. I wear sweatpants to school,” she says. Some classmates even dressed up as her for the annual French carnival: “I was their idea of a typical American,” she laughs.\n\nBack at Berkeley High for her senior year, she found that her old friends had found new friends, setting her back socially. Eventually, though, she got back into a groove and graduated in 2016.\n\nBut her bids to elite public and private universities were rejected, leaving her hometown university as her best option.\n\n“I was definitely bummed. I’ve been here my whole life,” she says. “But my parents let me stay in the dorms, and I was pleasantly surprised. Turns out growing up in Berkeley and going to college at UC Berkeley are two totally different worlds.\n\n“Plus, it was kind of cool when my friends would ask about what to do in Berkeley, and I’d say, ‘Have you been to the Tilden Little Farm?’”\n\nOn campus, Boser discovered she was more of a doer and problem solver than a political activist. For example, during the 2017 campus protests against right-wing provocateur Milo Yiannopoulos, Boser and her friends were putting together an app for the campus’s Big Ideas innovation contest.\n\nWhen they received a news alert on their smartphones about vandalism on Sproul Plaza, they seriously doubted that Berkeley students were involved.\n\n“First of all, we love the Amazon store. You have to understand that about Cal students,” Boser says. “The Amazon store is, like, sacred.”\n\nContrary to her childhood contempt for the outdoors, she was now becoming fairly fanatical about hiking, camping and backpacking and looked for ways to integrate her interests in the environment and public health.\n\n“Mostly, I just wanted to work with trees,” she says. At the same time, she was interested in how to empower the world’s most vulnerable communities.\n\nGlobal public health warrior\n\nAnd so, the summer after her freshman year, she headed to French Guiana to study how HIV was being spread among poor rural communities along the French-Brazilian border. The trip was successful and emboldened her to apply for an Undergraduate Research Apprentice Program fellowship to study women’s empowerment in the impoverished African nation of Niger.\n\nThe following summer in Niger, Boser was hit with culture shock — and malaria, from which she quickly recovered. Embedded with locals living in abject poverty, she soon found herself challenging Western assumptions about what’s best for women in developing countries. Her analysis is presented in a soon-to-be-published journal paper.\n\n“The women in Niger had really strong social and economic reasons for opting to marry early, so giving them a viable alternative to early marriage, such as a quality education, should be a priority,” she says.\n\nShe returned to UC Berkeley feeling somewhat deflated from her time in West Africa, though it didn’t keep her from earning all A’s for courses in calculus, linear algebra, chemistry, physics, epidemiology, music, psychology and sociology.\n\nThings started looking up when she completed her EMT training and joined the Berkeley Medical Reserve Corps. She worked with victims of the 2018 Camp Fire, then went on to train and deploy volunteers to major catastrophes.\n\n“Being an EMT really energized me and gave me this wonderful new family,” she says.\n\nMeanwhile, she completed “two of the most challenging introductory statistics courses in the country,” wrote Adam Lucas, a UC Berkeley statistics lecturer, in his glowing letter recommending Boser for the University Medal.\n\nUnlike academics who are deeply focused on their fields of study for years at a time, Boser is more project-oriented.\n\n“What I like about public health is that the goal is to make the public healthy, and you can do that in so many different ways, from community outreach to creating an app or a vaccine,” she says.\n\nBut ultimately, she says she chose to major in statistics, albeit at the last minute, because it yields fast and effective results and provides “the big picture” that she finds so satisfying in her research.\n\nFlying the nest\n\nThis fall, Boser is headed to UC Santa Barbara to pursue a Ph.D. in environmental science and management. Her doctoral studies will be funded by a National Science Foundation graduate research fellowship and a Eugene Cota-Robles fellowship.\n\nShe had planned to hike the Pacific Crest Trail this summer, but the coronavirus pandemic has put that on the back burner.\n\nIronically, after all her friendship struggles at Berkeley High and during her first two years at UC Berkeley, she’s living in a house with six of her best friends. They eat meals together, goof around together and binge-watch the Netflix series “Tiger King” and Marvel superheroes movies.\n\n“I finally succeeded in getting the best friend group in the world,” she says proudly, then adds, “And I can do it again.”\n\nFor her graduation, she and her housemates are planning a porch ceremony. One will stand in for Chancellor Carol Christ and give opening remarks. Another will dress as Captain America and give a keynote speech.\n\nAs for bidding farewell to UC Berkeley, she says, “I’m really excited, but I’m also sad because it’s been so perfect for me.”\n\n“Still, at some point,” she says wistfully, “I have to leave the nest.”\n\nAnd you can practically hear her big brothers breathe a twin sigh of relief."}, {"url": "https://www.usnews.com/best-colleges/university-of-california-berkeley-1312", "page_content": "University of California, Berkeley is a public institution that was founded in 1868. It has a total undergraduate enrollment of 32,143 (fall 2021), its setting is city, and the campus size is 1,232 acres. It utilizes a semester-based academic calendar. University of California, Berkeley's ranking in the 2022-2023 edition of Best Colleges is National Universities, #20. Its in-state tuition and fees are $14,226; out-of-state tuition and fees are $43,980.\n\nThe University of California, Berkeley, often referred to as Cal, is situated overlooking the San Francisco Bay. Typically, 95% or more of incoming freshmen at Berkeley choose to live on campus. There are more than 1,000 student organizations, ranging from political groups to a hang gliding club and everything in between. Berkeley also has a thriving Greek life with dozens of fraternity and sorority chapters. The California Golden Bears, Berkeley’s athletic teams, compete in the Pac-12 Conference and are known for their traditional arch rivalry with Stanford University.\n\nBerkeley has 14 schools and colleges, including a number of graduate and professional schools, such as the School of Optometry and the Graduate School of Journalism. Other graduate programs offered include those in the highly ranked Haas School of Business, Graduate School of Education, College of Engineering and School of Law.\n\nBerkeley is well known as a hub of liberal student activism: The Free Speech Movement – a 1964 student protest at Berkeley in response to the administration’s ban on political activity – gained widespread attention. Notable alumni include former U.S. Supreme Court Chief Justice Earl Warren, Olympic gold medalist Jonny Moseley, and actor John Cho, known for his role in the \"Harold and Kumar\" films. Dr. J. Robert Oppenheimer, who worked on the development of the atomic bomb as scientific director of the Manhattan Project during World War II, was a professor at Berkeley."}, {"url": "https://theconversation.com/institutions/university-of-california-berkeley-754", "page_content": "Macall Polay/HBO May 31, 2023 How the sounds of ‘Succession’ shred the grandeur and respect the characters so desperately try to project Composer Nicholas Britell festoons earnest Romantic music with sounds that gleefully desecrate it, underscoring the show’s emotional core: a lust for power joined by immense self-loathing.\n\ngawriloff/istock via Getty Images May 2, 2023 Body lotions, mothballs, cleaning fluids and other widely used products contain known toxic chemicals, study finds Manufacturers don’t usually have to disclose what’s in products like shampoo and household cleaners, but a new study finds that these products can contain hazardous ingredients.\n\nKrerksak Woraphoomi/iStock via Getty Images April 19, 2023 Generative AI: 5 essential reads about the new era of creativity, job anxiety, misinformation, bias and plagiarism Generative AI can seem like magic, which makes it both enticing and frightening. Scholars are helping society come to grips with the potential benefits and harms.\n\ngarytog/iStock via Getty Images Plus April 5, 2023 Easter bunnies, cacao beans and pollinating bugs: A basket of 6 essential reads about chocolate Two food scientists, an entomologist, an anthropologist, a veterinarian and a historian walk into a bar (of chocolate) and tell bitter and sweet stories of this favorite treat.\n\nJulio Aguilar/Getty Images March 29, 2023 Against baseball’s new pitch clock In between pitches, it might seem as if nothing is going on. But the game’s drama is still unfurling – you just need to know what to look for.\n\nAP Photo/J. David Ake March 27, 2023 Watermarking ChatGPT, DALL-E and other generative AIs could help protect against fraud and misinformation In a world of increasingly convincing AI-generated text, photos and videos, it’s more important than ever to be able to distinguish authentic media from fakes and imitations. The challenge is how.\n\nTrent Erwin/Unsplash March 9, 2023 1 triliun dolar yang tersembunyi: semakin melambungnya aliran keuntungan perusahaan multinasional ke surga pajak Penelitian baru menunjukkan bahwa perusahaan mengalihkan catatan keuntungan mereka ke surga pajak, meskipun telah ada upaya global untuk menindak praktik tersebut.\n\nNatalie Kolb/MediaNews Group/Reading Eagle via Getty Images March 6, 2023 Will we eventually have to send our trash into space if we run out of room on Earth? Humans generate a lot of trash, but there are cheaper and safer ways to handle it than loading it on rockets.\n\nLeoPatrizi/E+ via Getty Images February 23, 2023 $1 trillion in the shade – the annual profits multinational corporations shift to tax havens continues to climb and climb New research shows that companies are shifting record amounts of their profits to tax havens, despite a global effort to crack down on the practice.\n\nToey Yutther J/Shutterstock January 31, 2023 Comment créer des bulles de savon parfaites ? Sous leur apparente simplicité enfantine, les bulles de savon cachent des propriétés physiques complexes. Découvrez la recette parfaite.\n\n(pxhere.com) January 2, 2023 Scientists dig deep and find a way to accurately predict snowmelt after droughts Unprecedented droughts leave the subsurface drier than usual, affecting water supply in subsequent years.\n\nHany Farid using StyleGAN2 (left) and DALL-E (right) December 5, 2022 Text-to -image AI: powerful, easy-to -use technology for making art – and fakes Text-to-image generators like DALL-E and Stable Diffusion portend a future where anyone with a computer can fake a photograph of just about anything.\n\nRobyn Beck/AFP via Getty Images October 17, 2022 So you want to vote by mail – 5 essential reads Voting by mail is safe from fraud and manipulation, is backed by people across the political spectrum and can be more convenient for many voters.\n\nCraig F. Walker/The Boston Globe via Getty Images September 13, 2022 Should you vote early in the 2022 midterm elections? 3 essential reads The balance of US political power is at stake in the 2022 midterm elections. Voters have several ways to cast their ballots – and the majority of Americans are choosing one of them.\n\nJavier Ghersi/Moment via Getty Images August 4, 2022 Inflation rates are rising in the US – an economist explains why Rising inflation rates due to supply-side factors – COVID-19, Ukraine and supply chain shortages – make countering inflation difficult for the central bank.\n\n(Minnie Zhou | Unsplash) July 29, 2022 Prénoms : pourquoi choisissons-nous tous les mêmes ? Les prénoms choisis pour nos enfants suivent les tendances, comme toute autre expression culturelle. C’est une question de goût, mais aussi de changements sociaux.\n\nJeffrey Greenberg/Universal Images Group via Getty Images July 28, 2022 Debunking stereotypes about mobile homes could make them a new face of affordable housing Manufactured housing – the preferred name for what were once called mobile homes – has changed dramatically in recent decades. Three planning experts call for giving it a new look."}]}