{"Twila Shively won the US Girls' 18s National Championship in 1962.": [{"url": "https://aagpbl.org/profiles/twila-shively-twi/542", "page_content": "“Twi” played softball in the Chicago softball leagues as early as 1942 when a headline in the Chicago Daily News said that she “Looks Like a Model, Runs Bases Like Ty Cobb, and Has Baseball ‘Savvy’ Plus a Pretty Face.” Twi was a member of Chicago’s National Girls Baseball League’s (NGBL) Rockola Music Maids team in 1944. The NGBL was organized as a professional softball league in 1944 to keep the best players from migrating to the All-American League which was established in 1943. Nonetheless, Twi was one of those who transferred to the AAGPBL despite the NGBL’s best efforts. She signed up to play for the Grand Rapids Chicks in 1945 and continued to be a member of the AAGPBL through the 1950 season.\n\nA solid defensive player, who routinely ranked among league leaders in fielding percentage, Twi was a starter in left field or first base in every game from 1945 to 1950 with few injury-related exceptions. In 1946 she led the league in runs with 78. In 1947, she was a member of the champion Grand Rapids Chicks. Her career totals included 274 runs, 429 hits, and 255 stolen bases. After leaving the AAGPBL, she remained active in sports, played a couple of more years in the NGBL, and enjoyed golf, hiking, and aerobics.\n\nTwi studied at Illinois State Normal and Indiana University and immediately landed a job as a physical education teacher at South Bend’s Washington High School where she inspired kids for nearly 30 years. She also coached the school’s softball and volleyball teams to several city championships.\n\nThose who knew Twi said she had a good sense of humor, civic pride, and was a joy to be around. South Bend Bat Girl, Ruth Davis, a longtime friend of Twi’s who also taught high school in South Bend for 25 years, noted that Twi had a “real dry wit . . . but she was warm and giving. If she heard of someone in need, she was quick to act, but she didn’t seek out recognition after helping people. She was quiet about her charity work, and many weren’t aware of the extent of her involvement.”\n\nDavis recalled that when Twi just turned 70, in 1990, she still referred to her work for Meals-on-Wheels for 15 years as “Taking food to the old people.” Davis also noted that Twi always had “a young and inquisitive mind,” and that “She took classes at the community college in South Bend while in her 60s just so she could learn.”\n\nBetsy Jochum was an outfielder for the South Bend Blue Sox during Twi’s tenure in the AAGPBL and later became a teacher in South Bend and a friend of Twi’s. She remembered Shively as a fierce competitor. “She was a good ball player back in a time when women didn’t play sports.”\n\nTwi succumbed to four years of Alzheimer’s disease and a year-long fight with lung cancer in a Douglas, Michigan nursing home on Thanksgiving Day, November 25, 1999 at the age of 79. According to Gary Umphrey, another longtime friend who looked after Twi during her convalescence, she remained upbeat and lucid even as Alzheimer’s and lung cancer beat her body down. “She was a sweet woman and I hated to see her uncomfortable,” he said. About five days before she died, Umphrey was commiserating with her and said she defied the way Alzheimer’s usually slurred her speech. “She opened her eyes, looked at me and said, ‘I’m not all that uncomfortable.’ And that truly was her spirit—tough to the end.”\n\nSOURCE\n\nCompiled from Twi’s obituary and other articles about her in the South Bend, (IN) Tribune at the end of November and beginning of December 1999."}, {"url": "https://prabook.com/web/twila.shively/1797300", "page_content": "Twila Shively\n\nbaseball player\n\nMarch 20, 1920 (age 79)\n\nAn outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in (168 m), 128 pounds, she batted and threw right-handed. Twila Shively spent five of her six years in the AAGPBL playing in the left field A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”. The NGBL was organized in Chicago to keep the best local players from migrating to the AAGPBL, which had been stabilized in 1943. After that, both circuits competed against each other to see who could associate itself with the biggest stars. Shively entered the AAGPBL in 1945 with the Grand Rapids Chicks, playing for them three years before joining the Chicago Colleens (1948) and Peoria Redwings (1948–1950). In her rookie year she formed part of a Chicks outfield that included Thelma Eisen in the center field and Elizabeth Wicken at right field Shively collected a.196 batting average and a.276 on-base percentage in 106 games, driving in 23 runs and scoring 42 times, while her 46 stolen bases ranked her fifth in the league. She also led all outfielders with a.968 fielding percentage and finished second for the most putouts (234) behind Fort Wayne Daisies\" Penny O\"Brian (236). Her most productive season came in 1946, when she posted career numbers in average (247), runs scored (78) hits (101), runs batted in (45), steals (45) and games played (111). Considering the year was great for many pitchers her numbers were quite respectable. Four no-hitters were recorded by Anna Mae Hutchison (Belles), Betty Luna (Blue Sox), Carolyn Morris (Peaches) and Amy Irene Applegren (Lassies), while Connie Wisniewski (Chicks) and Dorothy Wiltse (Daisies) topped the league in earned run average with 0.81 and 0.83, respectively. As a result, more than half of the circuit\"s players averaged under.200. Dorothy Kamenshek (Peaches) was the only hitter to reach the.300 mark (316). She also coached the school\"s softball and volleyball teams to city championships, inspiring children for almost 30 years. Twila Shively died in Douglas, Michigan on Thanksgiving Day, 1999 at the age of 79, after suffering four years of Alzheimer\"s disease and a year-long fight with lung cancer. She is part of the AAGPBL permanent display at the Baseball Hall of Fame and Museum at Cooperstown, New York, unveiled in 1988, which is dedicated to the entire league rather than any individual personality."}, {"url": "https://peoplepill.com/people/twila-shively/", "page_content": "Twila Shively [″Twi″] (March 20, 1920 – November 25, 1999) was an American competitive baseball player. An outfielder, she played from 1945 through 1950 in the All-American Girls Professional Baseball League. Listed at 5 ft 6 in (1.68 m), 128 lb., she batted and threw right-handed.\n\nTwila Shively spent five of her six years in the AAGPBL playing in the left field. A solid defensive player, she showed speed, good hands, an accurate throwing arm, and lived in a constant state of readiness. Routinely, she ranked among the top defensive outfielders in several categories, until a severe ankle injury limited her ability to perform, and had to switch to first base. Offensively, she made consistent contact, knew when to take the extra base, and excelled as a basestealer.\n\nBorn in Decatur, Illinois, Twila Shively was the daughter of Glenn and Eva (née Bryant) Shively. She began playing softball at age eight and moved up in the softball ranks in Chicago as early as 1942. By then, she was featured in an article signed by Carl Guldager and published in the Chicago Daily News with this headline: “She’s Hedy Lamarr of Softball, Twila Shively Looks Like Model, Runs Bases Like Ty Cobb. Has Baseball Savvy Plus Pretty Face”.\n\nIn 1944 Shively became a member of the Rockola Chicks team of the newly formed National Girls Baseball League. The NGBL was organized in Chicago to keep the best local players from migrating to the AAGPBL, which had been stabilized in 1943. After that, both circuits competed against each other to see who could associate itself with the biggest stars.\n\nShively entered the AAGPBL in 1945 with the Grand Rapids Chicks, playing for them three years before joining the Chicago Colleens (1948) and Peoria Redwings (1948–1950). In her rookie year she formed part of a Chicks outfield that included Thelma Eisen in the center field and Elizabeth Wicken at right field. Shively collected a .196 batting average and a .276 on-base percentage in 106 games, driving in 23 runs and scoring 42 times, while her 46 stolen bases ranked her fifth in the league. She also led all outfielders with a .968 fielding percentage and finished second for the most putouts (234) behind Fort Wayne Daisies' Penny O'Brian (236). During the regular season she achieved a career highlight, when she belted a two-out, walk-off grand slam to give her team the victory.\n\nHer most productive season came in 1946, when she posted career numbers in average (.247), runs scored (78) hits (101), runs batted in (45), steals (45) and games played (111). Considering the year was great for many pitchers her numbers were quite respectable. Four no-hitters were recorded by Anna Mae Hutchison (Belles), Betty Luna (Blue Sox), Carolyn Morris (Peaches) and Amy Irene Applegren (Lassies), while Connie Wisniewski (Chicks) and Dorothy Wiltse (Daisies) topped the league in earned run average with 0.81 and 0.83, respectively. As a result, more than half of the circuit's players averaged under .200. Dorothy Kamenshek (Peaches) was the only hitter to reach the .300 mark (.316).\n\nFollowing her baseball career, Shively graduated at Illinois State Normal and Indiana University and worked as a physical education teacher at Washington High School in South Bend, Indiana. She also coached the school's softball and volleyball teams to city championships, inspiring children for almost 30 years.\n\nTwila Shively died in Douglas, Michigan on Thanksgiving Day, 1999 at the age of 79, after suffering four years of Alzheimer's disease and a year-long fight with lung cancer.\n\nShe is part of the AAGPBL permanent display at the Baseball Hall of Fame and Museum at Cooperstown, New York, unveiled in 1988, which is dedicated to the entire league rather than any individual personality.\n\nCareer statistics\n\nBatting\n\nGP AB R H 2B 3B HR RBI SB BB TB SO BA OBP SLG 614 2141 274 429 42 20 4 166 255 523 291 322 .200 .296 .244\n\nFielding"}, {"url": "https://volleyballmag.com/gjnc-18s-day-2-042521/", "page_content": "The USA Volleyball Girls 18s Junior National Championships in Columbus, Ohio, went from 48 teams to eight on Saturday.\n\nThere were some massive surprises, none more so than AZ Storm Elite 18 Thunder bouncing national No. 1 and previously undefeated TAV 18 Black in the Challenge phase.\n\nStorm, the third seed in Pool 2, won twice in its opening pool to finish 4-1, matching that of Coast 18-1 and A5 18-Scott. Coast won the pool, which pushed Storm into TAV’s bracket and required the Arizona squad to win twice to reach the quarterfinals.\n\nJami Rolfes’ team swept two close games from Circle City 18 Purple, which was one of only two teams to advance out of its pool with a 2-3 record; then shocked the tournament by sweeping TAV.\n\nAZ Storm will take on Elevation 18-Goller in a Sunday quarterfinal. Adam Goller’s team is one of just two unbeaten teams remaining in contention for the title.\n\n“Elevation has been great at making good decisions and being very low error all weekend,” Goller said.\n\nIn our story here after Day 1, two coaches yesterday stressed the importance of coming out first in pool play, because that would require just one match win rather than two to make the Gold bracket. Indeed, six of the eight pool winners took advantage of the extra rest to sweep to the quarterfinals. All six of those teams faced opponents that had to play three tough sets just to get to that match!\n\nThe aforementioned TAV and Tri-State Elite 18 Blue were the two pool winners that didn’t make the final eight. Tri-State fell in two to FC Elite 18 Elite, a young team with a junior, two sophomores and a freshman on the roster.\n\n“Greatness does not know age!” coach Brett Damrow exclaimed.\n\nSaturday was a massive day for the Midwest. Six of the eight quarterfinalists hail from the country’s midsection. Texas, however, is not represented. The Lone Star State, which has produced bullies over the years, got four teams into the Challenge phase, but none advanced to the Gold bracket.\n\nSouthern California will be represented by Coast in the quarterfinals, but the region’s very strong Friday showing was not duplicated on Saturday. After going 16-5 during the tournament’s opening day, the seven SCVA teams struggled to a 2-12 mark today. Five of the seven still managed to advance out of pool play, but only Coast survived. The San Diego squad reached the quarters by downing its biggest rival, WAVE 18 Kevin.\n\nThe conclusion of pool play Saturday morning produced several plot twists from where this drama appeared to be going on Friday. Adversity G18 Adidas Purple, the club’s second team; won twice, including a sweep of national No. 4 Colorado Juniors 18Kevin, to sneak into the Challenge phase at 3-2. Dallas Skyline 18 Royal won a must-win match versus Metro 18 Travel to advance from its pool. Mizuno Northern Lights 181, Circle City and SA Juniors 18 Adidas also got into the Challenge bracket by virtue of final-match do-or-die wins.\n\n\n\nUnion 18-UA, from Louisville, is the lone At-Large big recipient still in contention. Craig Bossmeyer’s team is 6-0 and has been extended to three sets just twice.\n\n“We’re really just clicking and coming together when it matters,” he said. “We as coaches put a game plan together and the girls are executing well, whether that’s on blocking, defense, or something just as simple as serving. That’s huge when you’re matching up with this level of competition. This is high-level volleyball out here and what these girls are all about, so we’re having fun but know there’s an objective at the end and that’s what we’re aiming for.”\n\nPremier Nebraska 18 Gold is still standing. Shannon Smolinski’s, which is not at full strength due to injury, team swept MAVSKC 18-1 to win Pool 4, then eliminated A5, the No. 2 overall seed, in a Challenge match.\n\n“Super proud of this group and what they have overcome this season!” Smolinski exclaimed. “It was another solid day for our serve and pass. Norah Sis was incredible offensively for us and Phyona Schrader and Lindsay Krause did a phenomenal job being our battery. The team as a whole is just playing at a really high level and all of our girls are stepping up in big moments.”\n\nSaturday was a tough day for the national rankings, as No. 1 TAV and seven other teams in the top 11, were eliminated from medal contention.\n\nMintonette m. 81 is one team still alive and kicking. The hometown team took advantage of Tstreet 18-Kasia’s “struggles” – two 15-13 losses, to HJV 18 Elite and FC Elite, to win its pool. Audrey Flaugh’s team then instigated a massive rally in Game 1 of the Challenge match with Dallas Skyline to sweep to the quarters.\n\n“With our RS, Liv Kennedy, out with injury, Syd Taylor (our bro) has moved to the left side and Addie Evans moved to libero,” Flaugh said. “Evans was consistent and played really well all day. Logan Flaugh (setter) was steady and calm and pin hitters Riley Kindall and London Davis stayed aggressive and were clutch in tight situations.”\n\nThe Gold bracket matches get started at 8 a.m. Columbus time in Sunday. In addition to AZ Storm/Elevation, Premier Nebraska faces FC Elite, Adversity, which is probably the favorite now, squares off against m.81 and Coast battles Union.\n\nTAV is out. Of the eight remaining, any team can win. It’s going to be a great Sunday for volleyball!\n\n*** Editor’s note: We want all our readers to become VolleyballMag.com Sustaining Members — https://volleyballmag.com/sustaining-membership/ — but we understand if that’s not right for you. And if you’re here just to read John Tawa’s incredible and unparalleled coverage of national club and high school volleyball, you can contribute directly to him by using our Venmo account.\n\nWe suggest $12 for Tawa — Give Twelve for Tawa! — but you can give any amount you choose. No amount is too small, and we know that John thinks no amount is too large! When you contribute, just put in the Venmo description “Tawa.” Thanks on behalf of all us at VolleyballMag.com. Our Venmo account is VolleyballMag.\n\nRelated Posts"}, {"url": "https://www.sportskeeda.com/tennis/eleana-yu-wins-usta-billie-jean-king-girls-18s-national-championship", "page_content": "Eleana Yu, 17, won the USTA Billie Jean King Girls' 18s National Championships on Sunday, beating Valerie Glozman in straight sets, 6-3, 7-5, in the final. The victory also earned Yu a berth in the US Open main draw later this month.\n\nTwelve-time Grand Slam champion Billie Jean King was watching from the stands as both Yu and Glozman put up a fine display. King later took to Twitter to congratulate Yu on her win and also praised Golzman for her tremendous effort in the final.\n\n\"Congratulations to Eleana Yu (standing beside Rosie), the @USTAGirlsNatls 18s singles champion. She receives a wildcard into the #UsOpen. Congratulations also to finalist Valerie Glozman (beside me),\" King wrote.\n\nBillie Jean King @BillieJeanKing\n\n\n\nCongratulations also to finalist Valerie Glozman (beside me). Congratulations to Eleana Yu (standing beside Rosie), the @USTAGirlsNatls 18s singles champion. She receives a wildcard into the #UsOpen Congratulations also to finalist Valerie Glozman (beside me). Congratulations to Eleana Yu (standing beside Rosie), the @USTAGirlsNatls 18s singles champion. She receives a wildcard into the #UsOpen. Congratulations also to finalist Valerie Glozman (beside me). https://t.co/U9tvTlSpPq\n\nAlyssa Ahn, 15, took home the USTA Billie Jean King Girls’ 16s National Championship by defeating Christasha McNeil in the final.\n\n\"It would be a dream come true to play Serena Williams\" - Eleana Yu\n\nEleana Yu expressed her desire to play the soon-to-be retiring Serena Williams. The former World No. 1 revealed her plans to retire after the US Open via and article in Vogue Magazine last week.\n\n\"I think it would be a dream come true to play one of the greatest of all time, especially when she is gonna retire so soon,\" Yu said in an interview after the final.\n\nUSTA BJK Girls Nationals @USTAGirlsNatls Congrats Elena Yu! Girls 18s singles National Champion. Congrats Elena Yu! Girls 18s singles National Champion. https://t.co/6gT6tNLZZ9\n\nShifting her focus to the match, Yu said it was a \"mental battle,\" especially after her opponent saved four match points in the second set.\n\n\"It was a really close match and I feel like she [Valorie] worked pretty hard and it was just a mental battle today especially after the four match-points she saved it today, at the end of the day it was just a matter of who wanted it more,\" she said.\n\nThe teenager also said she wasn't affected by the surrounding noises and the crowd as she faced a similar situation during her semi-final match.\n\n\"Actually surprisingly not. I think that yesterday having the same conditions, the camera, the crowd, the commentator, I think it helped me to prep for today,\" Yu concluded.\n\nIs Serena Williams a Jehovah's Witness? Why American legend doesn't celebrate birthdays or Christmas\n\nPoll : 0 votes"}, {"url": "https://usavolleyball.org/event/2022-girls-18s-junior-national-championship/", "page_content": "Penalty Fees up to $200 will be enforced for last match forfeitures, etc.\n\nQ: Are there practice opportunities?\n\nA: There will be practice times available at the convention center from 5pm to 8pm Thursday April 21st. Slots are first come, first serve\n\nQ: Balls and Carts\n\nA: USA Volleyball will be providing warm-up balls or carts for rent. Balls can be checked out at the Championship Desk\n\nQ: Where can I find the schedule?\n\nA: AES has the schedule and results.\n\nQ: What are the entry times and location?\n\nA: Entry will be located on both the West Building off of Third Street\n\nDoors will open at 6:45 a.m. Once you have completed your work assignments and matches for the day please leave the facility\n\nQ: What is the tiebreaker procedure?\n\nA: Please see the tiebreaking procedure flow chart (PDF).\n\nQ: What is the last-day forfeit policy?\n\nA: A penalty of $100 will be issued for any last-day forfeits.\n\nQ: What is the Admissions policy?\n\nA: Purchase passes now.\n\nQ: Are the matches livestreamed?\n\nA: Leave the cameras and tripods at home and enjoy the action – live! We have partnered with BallerTV to provide professional live streaming for this event. They have the necessary liability insurance and expertise to set up video equipment to protect athletes and fans. Any other live streaming, including the use of Facebook Live, is strictly prohibited.\n\nEnjoy one free game download at BallerTV with promo code YourFreeGame. Thank you for your cooperation!\n\nQ: What is the concession and seating policy?\n\nA: No outside food, coolers or chairs are allowed in the convention center. The Phoenix Convention Center will be selling food in the venue and have made an effort to provide a good variety of options. Also a food hall in the North building\n\nQ: Is there luggage storage?\n\nA: Yes , The UPS Store right next to the Phoenix Convention Center at 125 N 2nd St, Ste 110, Phoenix, AZ 85004 will be doing a luggage store for a cost of $5.90 per bag on Sunday April 24th from 10AM-3PM . In order to utilize this service reservations must be made ahead of time by going on the the website below .\n\nBounce: Luggage Storage Near Me – Left Luggage & Lockers (usebounce.com)"}, {"url": "https://www.espn.com/tennis/usopen14/story/_/id/11331681/cici-bellis-wins-usta-girls-18s-national-championship", "page_content": "SAN DIEGO -- Fifteen-year-old CiCi Bellis won the USTA Girls' 18s National Championship on Saturday to earn a main-draw wild card into the U.S. Open, beating 16-year-old Tornado Alicia Black 6-3, 6-1.\n\nBellis, the Atherton player who is the second-ranked junior in the world, is the youngest USTA Girls' 18s national champion since Lindsay Davenport also won at 15 in 1991.\n\nBlack is from Boca Raton, Florida.\n\nBellis needed 1 hour, 45 minutes to beat Black, who took a 3-0 lead in the first set. Bellis won six straight games to close out the set at Barnes Tennis Center.\n\nIn the second, Bellis led 3-0 before Black held serve to win her only game of the set. Bellis closed out the victory with a forehand winner on her second match point.\n\nBlack earned a wild card into the U.S. Open qualifying. She reached last year's girls' singles final at the Open and made the Wimbledon girls' quarterfinals this summer.\n\nIn the doubles final, top-seeded Louisa Chirico of Harrison, New York, and Katerina Stewart of Coral Gables, Florida, beat Josie Kuhlman of Ponte Vedra Beach, Florida, and Kaitlyn McCarthy of Cary, North Carolina, 4-6, 6-4, 6-3. Chirico and Stewart earned a wild card into the doubles draw at the U.S. Open."}, {"url": "https://www.statscrew.com/minorbaseball/stats/p-shivetwi001", "page_content": "Twila Shively\n\nTwila Shively \"Twi\"\n\nBorn: March 20, 1922\n\nChicago, IL\n\nDeceased: November 25, 1999\n\nPrimary Position:\n\nBats: Right\n\nThrows: Right\n\nHeight:\n\nWeight:\n\nCareer: 1945-1950\n\n\n\nTwila Shively compiled a career batting average of .200 with 4 home runs and 166 RBI in her 614-game career with the Grand Rapids Chicks, Peoria Redwings and Chicago Colleens. She began playing during the 1945 season and last took the field during the 1950 campaign.\n\nClick on column headings to sort.\n\nBatting:\n\nMinor League Service:"}, {"url": "https://www.ustanationalcampus.com/en/home/news/connie-ma-completes-sweep-of-girls--18s-titles-at-2018-usta-nati.html", "page_content": "On the final day of play at the 2018 USTA National Winter Championships, part of the USTA adidas Junior National Championship Series, four players plus one doubles team captured prestigious USTA Gold Balls to close out the event.\n\nAmongst the singles champions were Connie Ma (Dublin, Calif.), who became just the third player in the 18 year history of the event to capture both the girls’ 18s singles and doubles Gold Balls in the same year. Other titlists included No. 8 Nadejda Maslova (Brooklyn, N.Y.) in the girls’ 16s, No. 5 Luke Casper (Santa Cruz, Calif.) in the boys’ 16s, and No. 17 Ishaan Ravichander (Belle Mead, N.J.) in the boys’ 18s. The 10th-seeded tandem of Jeremie Casabon (Flourtown, Pa.) and Henry Ruger (Philadelphia) came through for the boys’ 18s doubles crown as well.\n\nA replay of the boys’ and girls’ 18s singles finals broadcast can be watched here.\n\nIt was not a smooth start from Ma, who dropped 12 of the first 16 points of the match against No. 3 seed Alana Wolfberg (Orlando) to fall behind 3-0. Ma was able to draw even at 3-3, but Wolfberg stayed in front by holding for 4-3 after fighting off a break point. Even after Ma claimed the next two games to put herself in a position to serve for the set, she quickly fell behind 0-40. However, she steadied herself, eventually winning the frame on the second set point. To begin the second, it appeared Wolfberg was ready to dig in, grabbing a 40-15 lead including serving just her second ace of the match. But once again, she failed to maintain the advantage, as Ma broke and easily held for 2-0. Dropping serve in the following game would be the end of Wolfberg’s chances at a comeback, as Ma barely lost a point in sprinting to the finish line.\n\nNo. 4 Connie Ma’s Road to the Championship\n\nRound of 128: def. Meghan Coleman 6-1, 6-3\n\nRound of 64: def. Rachele Rimondini 6-2, 6-4\n\nRound of 32: def. Sophia Edwards 6-3, 6-2\n\nRound of 16: def. No. 13 Rosie Garcia Gross 3-0, ret.\n\nQuarterfinals: def. No. 12 Gianna Pielet 6-1, 6-4\n\nSemifinals: def. No. 8 Carly Briggs 6-2, 6-1\n\nFinal: def. No. 3 Alana Wolfberg 6-4, 6-0\n\nIn the lone championship tilt to be decided in three sets, Maslova battled her way to victory over top seed Leyden Games (Irvine, California) 4-6, 6-3, 6-3. The opening frame lasted 92 minutes despite being just 10 games, as half of those were sent to deuce. Both players struggled on serve from the start, exchanging breaks before Maslova held to move ahead 2-1. Games overcame two double faults and a break point for 2-2, and play remained on serve until three consecutive breaks left Games with a 6-5 advantage; Games successfully closed out the set after saving another break point.\n\nSet two featured more break than holds, but Maslova managed to keep her lead throughout thanks to taking five of the first six games. She was broken when serving for the set at 5-1, and Games applied some additional pressure by trimming the margin to 5-3, but Maslova held comfortably to push the contest to a third set. In the frame, each player served two doubles faults and faced one break point; however, in what proved to be a crucial difference in the match, Maslova pulled out a hold while Games was unable to do so. That would be the only look at a break point Games got the entire set, as the two competitors still battled through lengthy rallies but took care of serve at a more efficient rate until the last game, when Maslova broke by winning the final two points.\n\nNo. 8 Nadejda Maslova’s Road to the Championship\n\nRound of 128: def. Arushi Malik 6-3, 6-3\n\nRound of 64: def. Drew Morris 6-1, 6-0\n\nRound of 32: def. No. 17 Qavia Lopez 6-3, 6-0\n\nRound of 16: def. No. 15 Avery Durham 6-4, 6-2\n\nQuarterfinals: def. Emma Charney 6-1, 6-0\n\nSemifinals: def. DJ Bennett 6-4, 6-1\n\nFinal: def. No. 1 Leyden Games 4-6, 6-3, 6-3\n\nA highly-competitive boy’s 18s final went the way of Ravichander by a slim 7-6(2), 6-3 margin over No. 9 Zachery Lim (Fairfield, Calif.). Even with the two players hovering around a first serve percentage of 60% for the match, there were just five breaks in total, two of which took place in the first four games. For the remained of the set, a mere four break points materialized, but Ravichander and Lim continued to hold to force a tiebreak; Ravichander won the first three and final three points to take the tiebreak in commanding fashion. The second frame was more straightforward thanks to Ravichander breaking Lim twice en route to a 5-1 cushion. Lim did fight back to 5-3, but Ravichander slammed the door shut from there.\n\nNo. 17 Ishaan Ravichander’s Road to the Championship\n\nRound of 128: def. Connor Aylett 6-0, 6-1\n\nRound 0f 64: def. Luke Baylis 6-0, 6-2\n\nRound of 32: def. No. 11 Anders Gibbons 7-6(5), 6-2\n\nRound of 16: def. No. 17 Finn Garner 3-6, 7-6(2), 6-1\n\nQuarterfinals: def. No. 17 Hunter Heck 6-1, 6-2\n\nSemifinals: def. No. 4 Logan Zapp 4-6, 6-3, 6-3\n\nFinal: def. No. 9 Zachery Lim 7-6(2), 6-3\n\nIn what turned out to be the last match to finish on the day, Casper held off No. 13 Quinn Snyder (Delran, N.J.) 7-6(5), 6-4 for the Gold Ball in the boys’ 16s division. Neither player was able to gain much traction throughout the first set, as Casper broke serve a total of three times but Snyder immediately responded on each occasion. Fittingly, a back-and-forth tiebreak would decide it, where Casper battled through for the triumph, seven points to five. Casper and Snyder also traded breaks of serve in the early goings of set two, but it would be Casper producing the crucial break at 4-4. In the next game, he squandered two match points before successfully cashing in on his third.\n\nNo. 5 Luke Casper’s Road to the Championship\n\nRound of 128: def. Noah Zamora 6-2, 6-2\n\nRound of 64: def. Kailas Kahler 6-1, 6-1\n\nRound of 32: def. No. 17 Luke Garner 6-1, 7-6(3)\n\nRound of 16: def. Braden Shick 7-6(5), 6-4\n\nQuarterfinals: def. No. 1 Jack Anthrop 6-3, 6-3\n\nSemifinals: def. No. 11 Samir Banerjee 6-1, 7-5\n\nFinal: def. No. 13 Quinn Snyder 7-6(5), 6-4\n\nWinners of the third-place playoff matches, therefore earning a Bronze Ball, included Samir Banerjee in the boys’ 16s, Logan Zapp in the boys’ 18s, Bridget Stammel in the girls’ 16s, and Carly Briggs in the girls’ 18s.\n\nOther action on Friday saw Jeremie Casabon and Henry Ruger, seeded 10th, best the unseeded duo of Hunter Heck (Saint Paul, Minn.) and JJ Tracy (Hilton Head Island, S.C.) 6-4, 6-1 to capture the boys’ 18s doubles crown. Casabon and Ruger broke serve a total of five times while only dropping serve once.\n\nFor complete results from the 2018 USTA National Winter Championships, click here."}, {"url": "https://www.usta.com/en/home/stay-current/national/hank-trondson-and-maddy-zampardo-win-2022-usta-boys--and-girls--.html", "page_content": "Glozman notably finished runner-up at the USTA Girls’ 18s National Championships this summer, won a round in the US Open Qualifying Tournament, and was a member of the title-winning junior U.S. Billie Jean King Cup team last month.\n\nZampardo is a high school senior at the University Liggett School in suburban Detroit and is committed to play college tennis at North Carolina State University next year. Zampardo later teamed up with Susanna Maltby (Glen Ellyn, Ill.) to sweep the girls’ 18s titles, as they defeated Erin Ha (Tenafly, N.J.) and Stephanie Yakoff (Fort Lee, N.J.), 8-5, in the doubles final.\n\nFull results and locations for the four age divisions can be found below.\n\nThere were recurring themes in the 16s and 14s divisions, as two New Yorkers triumphed in the 16s division and the top seeds swept the 14s. No. 4 seed Dominick Mosejczuk from Queens defeated No. 7 seed Ian Mayew, 7-6(3), 6-3, to capture the boys’ 16s title, and No. 9 seed Julia Werdiger knocked off No. 10 seed Elena Daskalova in the girls' 16s final, 6-3, 6-2.\n\nNo. 1 seeds Jack Secord (Lake Forest, Ill.) and Christina Lyutova (Newport Beach, Calif.) won the boys’ and girls’ 14s singles titles, respectively. Antanas Daugis (Staten Island, N.Y.) and Priscilla Sirichantho (Woodbridge, Conn.) rounded out the singles champions as the boys’ and girls’ 12s winners, respectively.\n\nUSTA National Indoor Championships – Boys’ 18s\n\nOverland Park Racquet Club, Overland Park, Kan., November 25-28, 2022\n\nSingles: (14) Hank Trondson (Nashville, Tenn.) d. Emon van Loben Sels (Sacramento, Calif.), 6-4, 6-3\n\nDoubles: Alex Fuchs (Los Altos, Calif.) / van Loben Sels d. (2) Caden Hasler (Pleasant Grove, Utah) / Dylan Tsoi (El Dorado Hills, Calif.), 8-3\n\nUSTA National Indoor Championships – Girls’ 18s\n\nIndianapolis Racquet Club, Indianapolis, November 25-28, 2022\n\nSingles: (6) Maddy Zampardo (Grosse Pointe Farms, Mich.) d. (1) Valerie Glozman (Bellevue, Wash.), 6-1, 3-6, 7-5\n\nDoubles: (1) Susanna Maltby (Glen Ellyn, Ill.) / Zampardo d. (3) Erin Ha (Tenafly, N.J.) / Stephanie Yakoff (Fort Lee, N.J.), 8-5\n\nUSTA National Indoor Championships – Boys’ 16s\n\nXS Tennis Village, Chicago, November 25-28, 2022\n\nSingles: (4) Dominick Mosejczuk (Queens, N.Y.) d. (7) Ian Mayew (Cary, N.C.), 7-6(3), 6-3\n\nDoubles: (2) Evan Burnett (Woodside, Calif.) / Krish Gupta (Fremont, Calif.) d. (3) Cyrus Zia (Washington, D.C.) / Braeden Gelletich (Goshen, N.Y.), 8-3\n\nUSTA National Indoor Championships – Girls’ 16s\n\nBaseline Tennis Center, Minneapolis, November 25-28, 2022\n\nSingles: (9) Julia Werdiger (New York) d. (10) Elena Daskalova (Olathe, Kan.), 6-3, 6-2\n\nDoubles: (2) Leena Friedman (Brooklyn, N.Y.) / Summer Chandler (Jamaica, N.Y.) d. (1) Linda Ziets-Segura (New York) / Kady Tannenbaum (Commack, N.Y.), 8-4\n\nUSTA National Indoor Championships – Boys’ 14s\n\nMidtown Athletic Club, Chicago, November 25-28, 2022\n\nSingles: (1) Jack Secord (Lake Forest, Ill.) d. (2) Liam Alvarez (Long Beach, Calif.), 6-2, 6-2\n\nDoubles: (6) Zen Uehling (Alpine, N.J.) / Omar Rhazali (Stamford, Conn.) d. Yashwin Krishnakumar (Dublin, Calif.) / Joseph Nau (Brentwood, Calif.), 8-6\n\nUSTA National Indoor Championships – Girls’ 14s\n\nTwos Athletic Club, Toledo, Ohio, November 25-28, 2022\n\nSingles: (1) Christina Lyutova (Newport Beach, Calif.) d. Isabelle DeLuccia (Livingston, N.J.), 6-1, 6-2\n\nDoubles: (6) Addison Cassidy (Mason, Ohio) / Gabriella Sadowski (Macomb, Mich.) d. (1) Alyson Shannon (Plano, Texas) / Kori Montoya (Austin, Texas), 8-3\n\nUSTA National Indoor Championships – Boys’ 12s\n\nCommunity Sports and Wellness Center, Pendleton, Ind., November 25-28, 2022\n\nSingles: (1) Antanas Daugis (Staten Island, N.Y.) d. (4) Dylan Meineke (Frisco, Texas), 4-6, 7-6(2), [10-8]\n\nDoubles: (1) Diego Custodio (Tampa, Fla.) / Kahven Singh (Raleigh, N.C.) d. (3) Aayush Vartak (Edison, N.J.) / Daugis, 8-6\n\nUSTA National Indoor Championships – Girls’ 12s\n\nManchester Athletic Club, Manchester, Mass., November 25-28, 2022\n\nSingles: (4) Priscilla Sirichantho (Woodbridge, Conn.) d. Grace Hong (Skillman, N.J.), 6-2, 6-3\n\nDoubles: (3) Camilla Olga Castracani (West Hartford, Conn.) / Sirichantho d. (4) Teaghan Jou An Keys (Boca Raton, Fla.) / Scarlett Fagan (Scottsdale, Ariz.), 8-4\n\nEach year, more than 120,000 players compete in USTA junior tournaments around the country. Players compete in levels of competition through earned advancement in the 10s, 12s, 14s, 16s and 18s age divisions. The USTA National Indoor Championships was one of five junior USTA National Championship events in 2022."}]}