{"Lionel Aldridge was a starter for the Packers for nine seasons.": [{"url": "https://www.packers.com/history/hof/lionel-aldridge", "page_content": "Lionel Aldridge\n\nInducted: 1988\n\nDefensive End: 1963-71\n\nHeight: 6'3\"; Weight: 254\n\nCollege: Utah State, 1960-62\n\nHONORS:\n\nPackers All-Modern Era Team: 1976\n\nWhile Vince Lombardi believed in aggressively overturning his roster each year to instill a mix of youth and keep his veterans on edge, he was wary of playing rookies. During Lombardi's nine years as coach of the Packers, Lionel Aldridge was the only rookie to start a season opener.\n\nAlthough Aldridge might have been more steady than spectacular over the course of his career, Lombardi's early faith in him was a tribute in itself. In fact, Aldridge started the first 45 games of his career under Lombardi before missing the fourth game of the 1966 season with an ankle injury.\n\nAfter the Packers won a second consecutive NFL championship in 1962, Lombardi traded veteran Bill Quinlan and created an opening at right defensive end with no obvious heir apparent. Veteran free agent Urban Henry, who wasn't re-signed by the Los Angeles Rams after missing the 1962 season with a neck injury, and No. 1 draft pick Dave Robinson were considered the frontrunners heading into camp. However, the Packers decided to play Robinson at linebacker when he reported late following the College All-Star Game and Aldridge beat out Henry.\n\nAldridge came into his own when the Packers won an unprecedented three straight NFL championships under the league's playoff format from 1965 to 1967. He started all eight postseason games during that stretch and then continued to hold forth at right end until midway through the 1971 season.\n\nOver his eight-and-a-half years as an established starter, Aldridge missed only three games, a notable achievement when you consider he broke his leg once and had some ankle issues. The worst of his injuries occurred in a mid-August preseason game in 1967 when Aldridge broke a bone in his lower left leg. He missed only the first two regular-season games, didn't start but appeared in the third, and then played roughly three-quarters of the game in a hard-fought victory over Detroit in Week 4. Lombardi, who had little compassion for injured players and rarely saluted them when they played hurt, heaped praise on Aldridge after the game. \"Aldridge deserves a lot of credit for the way he came back so fast from his injury,\" Lombardi said."}, {"url": "https://www.nytimes.com/1998/02/14/sports/lionel-aldridge-56-stalwart-on-defense-for-packer-teams.html", "page_content": "Lionel Aldridge, a defensive star on the great Green Bay Packers teams of the 1960's whose post-playing years were marked by mental illness, was found dead by a daughter in his suburban Milwaukee apartment Thursday night. He was 56.\n\nThe Milwaukee County Medical Examiner's office, which conducted an autopsy, said he weighed 408 1/2 pounds and had an enlarged heart, ''consistent with congestive heart failure and obesity.''\n\nAn investigator for the coroner's office, however, added that until toxicology tests were completed, probably on Monday, there would be no official cause of death listed.\n\nMr. Aldridge seemed on a path to become a figure in the television booth following his retirement from the National Football League in 1973 after 11 seasons. He became an analyst for the Packers and then for NBC."}, {"url": "https://www.findagrave.com/memorial/38961586/lionel-aldridge", "page_content": "\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n\n\n\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n"}, {"url": "https://scottschalin.com/sports-social-articles/the-mad-ride-of-packers-hall-of-famer-lionel-aldridge/", "page_content": "Sometimes you have to go through Hell to get to Heaven. In the case of Lionel Aldridge, he took the reverse path.\n\nAldridge was born on February 14, 1941, in Evergreen, Louisiana, and was drafted by the Green Bay Packers in the Fourth Round of the 1963 draft after a standout college career at Utah State.\n\nWhile Packers’ coach, Vince Lombardi, was always wary of starting rookies, Aldridge cracked the vaunted Green Bay lineup in his first professional year. He quickly became a cornerstone of the staunch and stingy defenses of the glorious 1960s playing right defensive end opposite fellow Louisiana native and future Pro Football Hall of Famer, Willie Davis.\n\nAlthough the NFL didn’t log official stats for tackles during Aldridge’s era, he was renowned throughout the league as a solid tackler that helped anchor that stout Packers’ defensive line.\n\nAs a Packer, he played prominent roles in three straight NFL Championships with wins over Cleveland in 1965, and Dallas both in 1966 and ’67. Perhaps it was that 23-12 victory in the 1965 title game that epitomized the smothering Green Bay defense of that era, as the Packers held Browns’ legendary running back, Jim Brown, to just 50 yards rushing in what would be the future NFL Hall of Famer’s final game.\n\nAldridge continued contributing to the team’s historical run of championships, helping Green Bay to victories in Super Bowl I (a 35-10 dismantling of the Kansas City Chiefs) and Super Bowl II (a 33-14 shellacking of the Oakland Raiders).\n\nAldridge enjoyed an 11-year pro career with his first nine seasons played in Green Bay and his final two as a Charger in San Diego. The six-foot-three, 255-pound beast was named an All-Pro in 1964 and was inducted into the Packers Hall of Fame in 1988.\n\nStill, even with a physical shell as imposing as Aldridge’s could not protect life’s most fragile wonder: the brain.\n\nAfter retiring in 1973, he turned to broadcasting. He became an analyst for the Packers and then for NBC. He even worked Super Bowl VII for the network following the 1973 season.\n\nThings were seemingly going as well off the field as they had on.\n\nBut then, something changed. Something suddenly didn’t seem right.\n\nHis longtime friend Jim Irwin, who had broadcast Packers games for 29 years before retiring after the 1998 season, told the New York Times, “Lionel was a terrific success story that had some holes in it. He was a big, friendly teddy bear,” who experienced mood swings as a player. “He’d be ‘up’ one day and then the next day he’d snap at everybody.”\n\nIrwin recounted an instance after Aldridge retired and was doing the color commentary on a Packers’ broadcast. “I asked him the first question of the day, and he stared straight ahead,” Irwin recalled. “He never took his eyes off the 50-yard line for the next three and a half hours and never said another word.”\n\nUnbeknownst to Aldridge, his family or his friends, the former defensive superstar for the Packers was experiencing the beginning phases of paranoid schizophrenia.\n\nThe Mayo Clinic describes paranoid schizophrenia (PS) as a chronic mental illness in which a person loses touch with reality.\n\nThe most prominent PS symptom is auditory hallucinations or “hearing voices” along with severe delusional behavior, the fear of persecution and sensing usually irrational things that others don’t. There is no specific cause as to what triggers PS in adults, but both genetics and environment likely play roles. (Football and its head-on collisions have never been blamed on Aldridge’s PS.)\n\nPS symptoms are more common and severe primarily because they attack a person in the later years of life, usually after the age of 30.\n\nAldridge was barely into his mid-30s when the episodes began. By the early 1970s, he began to hallucinate. Then, the voices started echoing through his brain.\n\nOn the website Guideposts (www.guideposts.org) Aldridge wrote frankly and frighteningly of his illness.\n\n***\n\nOne of the most frightening signs that there was something seriously wrong with me was the voices I began hearing in 1974.\n\nAt first, they were just stray, nagging worries that dogged me through the day; self-doubts that we all have from time to time. They seemed to rise up out of nowhere—vague thoughts with an accusing edge, ‘You really don’t work very hard, do you?’\n\nThe voices were very scary and confusing. I didn’t know what to do. I didn’t want anyone to find out the terrible things happening inside my head. As an athlete, I’d been trained to be tough; it was not my nature to seek help. I wanted to be strong.\n\nAt first I tried to ignore them. But the voices grew more belittling and threatening; more real. I’d be standing in front of the mirror shaving when I’d hear from the next room, ‘You don’t take very good care of your family.’ “That’s bull!” I’d shout. I’d search the house for my tormentor. I’d mutter, as my wife, Viki, shook her head in dismay. There never was any intruder.\n\nHis marriage, which had produced two daughters, Michelle and Angela, collapsed. So did his job. Quickly the situation grew worse.\n\nAldridge chronicled the events on Guideposts.\n\nRumors flew around town that I was on drugs. That was completely false, but I was in no shape to prove otherwise. I was getting worse.\n\nSoon that feeling of being watched wouldn’t let up, even on the air. Looking into the camera, I could barely hold my composure as I reported the nightly sports scores. The wide camera lens zooming in on me was a glistening, all-seeing eye that could plumb the farthest, most hidden reaches of my soul. Everyone who was watching on their TV sets, I was convinced, could see right inside my brain, where laid bare for all to look on in disgust were the grimmest secrets of my life.\n\nI was sure there was a far-flung conspiracy to destroy me. I fought with total strangers on the street. I lost my job, (my family) and my friends. There was nothing left but the voices shouting in my head, as real to me as an opposing 260-pound pulling guard on a goal line stand back in my playing days.\n\nMy life spun out of control.\n\nAldridge was convinced by voices that he needed to leave his Milwaukee home.\n\nHe crisscrossed the country in an unruly wilderness of twisted interstates, sleeping in hotels and ultimately seedy flophouses. Once his savings were mostly exhausted, he started living in his car. In Florida, he ditched the car for a $100 and hit the streets with nothing more than a battered satchel on his shoulder.\n\nOccasionally I hung around a town for a while doing odd jobs, living on the streets and eating at soup kitchens,” he wrote. “Quite naturally, people would stare at me, and that would only make my delusions of persecution worse. I never held a job for long…I’d become one of those lost, devastated souls. There were a lot of them out there with me, crippled by mental illness, but as I wandered the country I was only aware of my own haunted, unhappy world a million miles from the life I once had.\n\nOne night I slept in a field off an interstate near the Great Salt Lake. I didn’t notice when I woke u, but, while I was sleeping, my jewel-encrusted Super Bowl ring must have slipped off. Those rings are not easy to come by, and I’d hung on to mine as a kind of symbol of who I’d once been.\n\nWhen I discovered the ring missing, it was as if I’d been stripped of one final link with my past. I sat in the middle of a sidewalk and wept into my hands.\n\n‘Help me!’ I cried out. The sweat and tears streaked my dust-caked face. ‘Help! I’ll accept help from anyone.’\n\nTurning to a well-worn Bible for guidance, he found the strength and courage to return to Milwaukee where, while still living on the streets, he was brought back into contact with old friends. He was, not without difficulty, committed to a hospital where he was diagnosed with PS.\n\n“Slowly the doctors hit upon some drugs that helped,” he rejoiced. “Little by little my condition improved, and the voices gradually subsided. At first it was horrifying. It was an awful thing to face, like seeing a crazy man on the street and suddenly realizing that you are looking into a mirror.”\n\nAlthough there is no cure for PS, Aldridge was able to recover and learn to live with the debilitating disease.\n\n“I did recover,” he admitted. “Not without setbacks and relapses, not without moments when I thought I could never again face life, but I did get well with the help of friends, doctors who found the right medication to help me and the voice of a loving God.”\n\nHe discovered new strategies to cope with the world, including turning the voices around and convincing himself that, instead of negative things, the voices were actually preaching positive attributes about him. “I figured, maybe they’re saying good things like, ‘Hey, there’s Lionel Aldridge. He used to play for the Packers and then he got sick. Look how good he’s doing now.’ ”\n\nIn time, the voices went away thanks to medication and his faith in God’s master plan. He began travelling the country speaking to groups about mental illness and recovery. “It’s vital,” he said, “for patients, families and even doctors to see someone who has actually made it back.”\n\nIn January 1985 – the 18th anniversary of the Packers’ first Super Bowl win – Lionel received yet another gift. A group of his old teammates had commissioned an exact replica of the Super Bowl victory ring that Aldridge had lost.\n\n“I knew that day that I had returned,” he surmised. “Even when you think you’ve lost everything in your life, there is always hope of finding a way back, sometimes to an even better place.”\n\nAldridge passed away on February 12, 1998, in Shorewood, Wisconsin, of congestive heart failure at the age of 56.\n\nAfter a meteoric rise to fame and glory, and then a whiplashing plummet into darkness and despair, this gentleman of the game and Packers’ legend can now, finally, rest in peace."}, {"url": "https://www.latimes.com/archives/la-xpm-1987-10-27-sp-16847-story.html", "page_content": "Times Staff Writer\n\nAs professional athletes 20 years ago, Lionel Aldridge and Willie Davis were the defensive ends on one of the great football teams of all time, Vince Lombardi’s Green Bay Packers, winners of Super Bowls I and II.\n\nYears later, out of football, they wound up traveling widely divergent paths.\n\nBy 1977, Davis was a millionaire. Aldridge was well on his way to becoming a bum.\n\nAdvertisement\n\nWith a business school background at the University of Chicago--pursued during his Packer off-seasons--Davis had become, as he continues to be, one of the most successful beer distributors and radio entrepreneurs in the West.\n\nA former sociology major at Utah State, Aldridge launched an equally impressive career in radio broadcasting and network TV--in the midst of which he was abruptly knocked down, and almost out, by mental illness.\n\nAldridge is a paranoid schizophrenic. But at first, his doctors diagnosed the wrong illness and treated him with the wrong medicine. Within months, he was into the wretched life of a vagrant.\n\nIn the flop houses and rescue missions of America, Aldridge’s nightmare lasted for a ghastly decade, costing him his wife and family, his jobs in radio and television, other jobs, most of his friends, his money, and eventually his self-respect.\n\nIf the people who once knew him best thought of him at all in those days, they thought, very wrongly, that Aldridge was a classic manic depressive--on the loose.\n\nWillie Davis, who runs his many businesses from an office in South-Central Los Angeles, only heard about the nightmare when Aldridge called one day after hitch-hiking into Skid Row downtown, where he touched up his old buddy for $3. Davis gave him $300 and got him a hotel room, from which Aldridge promptly dropped from sight.\n\nThen two years ago, Aldridge telephoned again, this time from Milwaukee. The nightmare was over. He was taking the right medication, Aldridge said. And he was working again, as an account representative at the Milwaukee post office and part-time in radio.\n\nHe was also in a cheerful, new eighth-floor apartment overlooking Lake Michigan on the city’s fashionable East Side.\n\n“Lionel had come back from the gates of hell,” Davis said the other day, recalling that phone call in 1985. “I’ve never had a conversation with anyone that affected me that much.\n\n“For weeks afterward, I would catch myself whistling or humming to myself, and I’d ask, ‘Why the hell am I feeling so good?’ Then I’d remember: Lionel is back.”\n\nOne day last month at a community college in Milwaukee, Aldridge spent his noon hour away from the post office--as he so often does--on a speaking engagement.\n\nTalking to a roomful of students at Milwaukee Area Technical College, he said:\n\n“I could be mad at somebody because I got sick. It was society that allowed me to become a bum and pull cigarette butts off the streets and out of ash trays.\n\n“And I could be angry at God for giving me this disease.\n\n“But I’ve made a decision not to be bitter. I have done it for one reason. I didn’t get well until I quit blaming God and society--and took the responsibility for myself myself.\n\n“Here I am, a black man, (lecturing) white college students, but I feel very deeply about this. You--all of you--are responsible for you. Nobody is going to ride up and rescue you. . . . I know. . . . I’ve made it back because I learned to lean on myself--and because I learned to like myself.”\n\nHis text, Aldridge said, was from St. Paul’s letters to the Philippians. Reciting a lengthy verse from memory, he said: “Whatsoever things are true, . . . honest . . . just . . . pure . . . lovely . . . think on these things.”\n\nThink on the beautiful, he said, not the untrue.\n\n“One way to be a winner is to be honest,” Aldridge continued, speaking softly. “Honesty never loses.\n\n“I had a setback, but I never had a drug problem. I gave up for a while, but there was a doctor who believed in me. Now I’m putting it together again--at a pace I’m comfortable with.”\n\nThough Aldridge changes the lyrics each time, the music is always the same. And after this particular 23-minute speech, 18 or 20 listeners came up, as they always do, and crowded around, drawing Aldridge out on his themes of self-esteem and self-responsibility.\n\nAt 6 feet 4 inches and 300 pounds, he was the biggest man in the room, and one of the neatest in slacks and a long-sleeved white shirt. The tie was blue, the jacket light blue, the expression pleasant and dignified. At 46, Aldridge has the bearing and baritone voice of a cultured talk-show host.\n\nHe’s also a working man, though. Looking at his watch, he smiled and said goodby.\n\nDriving back to the post office in his red Pontiac Firebird--”It fit me till last January, when I quit smoking and gained 50 pounds”--Aldridge said:\n\n“There is no known cure for paranoid schizophrenia, but I am one of the lucky ones. The disease is in remission. I have largely recovered.\n\n“I have been given some time--and I’m going to use it to help others. And to help reduce the stigma of mental illness. And to encourage the commitment of more money and resources to (mental illness) research.”\n\nWhat about his personal commitments?\n\n“I don’t want a girlfriend right now,” he said. “I go out once in a while--but to manage a steady would take more time than I have to give.\n\n“My ex-wife . . . none of this is her fault. She’s about to be remarried . . .\n\n“I see my children now and then. The younger one is a soccer player in (a Milwaukee) high school. The older one is a freshman at (the University of Wisconsin Milwaukee). I love them dearly . . . “\n\nThe subject was painful, and he changed it.\n\n“I feel that I must give as much of me as I can to the post office, to WTMJ, and to the speeches (before youth groups and at mental-illness meetings).”\n\nWTMJ is Milwaukee’s big radio-TV complex. Aldridge worked there before the nightmare and the station has welcomed him home as its Saturday morning sports announcer.\n\nIn addition, after Packer games, he doubles as analyst and talk-show host on still another WTMJ program.\n\nDuring the week, he’s on full time at the post office, where, as an executive in technical sales, he helps the government fight its many private-sector competitors for the nation’s mail and parcel business.\n\n“It’s fun, but it’s a full schedule,” he said.\n\nAt times it even gets hectic.\n\n“This year we’ve called on Lionel to make all of our television commercials,” said Mike Mahnke, the post office’s division communications manager. “He does a first-rate job, too.”\n\nAt his desk in a large sales room, Aldridge seems as fond of his co-workers as they are of him.\n\nOnce a week, he said, he is “visited by the support people from the hospital. . . . And the doctor sees me twice a month.”\n\nPsychiatrists disagree on what causes Aldridge’s kind of mental illness. They say it may stem either from heredity or environment, according to Dr. Charles William Wahl, clinical professor of psychiatry at the UCLA School of Medicine.\n\n“Some think a predisposition . . . is in the (genes),” Wahl said. “Others, like myself, feel it’s a reaction to the traumas of early life. It may be partly both.\n\n“Stress is usually a factor. Stress . . . can make or break you. As Nietzsche said, ‘Those things that do not kill me make me stronger.’\n\n“There’s a great deal of variation in the prognosis, and there are no guarantees, but a cooperative and motivated patient has a better (chance).”\n\nCooperative, motivated. And helpful, sincere, caring. Unselfish. Glad to be alive. As he looks into the blank face of the future, Aldridge, now, is all of those.\n\nA LIFE OF TENSION AND TURMOIL\n\nAn orphan figuratively if not literally, an only child, he grew up in other people’s homes, the homes of relatives who had big families of their own. Then for nine years in pro football, he came under the influence of a dominating, uncompromising individual, the Lombardi of the legends. Indeed, Lionel Aldridge has known stress.\n\nThe Louisiana Years: The world began for Aldridge in the disheartening, steaming fields of the rural South. Born in Evergreen, La., he was the baby in the home of his grandfather, Aaron Compton, a sharecropper.\n\nOne of the Compton daughters, Bessie Blackman, Aldridge’s aunt, said: “Lionel was born in our house one night. There were 10 (children) in our family, 8 girls and 2 boys--and Lionel made 11.”\n\nEveryone shared equally, as Aldridge tells it. “But I was on edge all the time,” he said. “They were good to me. There was a lot of love there. But I walked a tightrope every day.”\n\nEarly on, his mother left town, following his father to the Midwest.\n\n“Lionel was lucky in his grandmother,” Blackman said. “She even made his pants, and that isn’t easy. She would sew all night so we’d have a dress to wear in the morning. Then she’d go out and work all day in the fields.\n\n“We’d wake up to the smell of beans cooking at 4 o’clock in the morning. She was always up and making sure we’d have something to eat for breakfast.”\n\nLionel hated field work. His one big interest was school. He made good grades and, as a sixth-grader, he decided that he would go to college some day. He can’t remember who influenced him. In Louisiana, though, he never missed an hour of school until the afternoon that disaster struck.\n\n“Lionel had been out playing in the rain,” said Norma Lawson, another aunt. “He came in and said in a shaky voice, ‘Papa, a snake bit me.’\n\n“We didn’t have a phone or a car in those days, so his grandfather ran all the way to town to get the doctor. The leg was so swollen by the time they got back that Lionel barely survived. He couldn’t walk for weeks.”\n\nHe cried much of the time.\n\n“There were rumors that I’d died,” Aldridge remembers.\n\nLawson said: “It wasn’t dying that worried him. The thing that made him cry was missing school.”\n\nThen real trouble hit. When he was 15, his grandfather died, and Lionel was bundled off again, this time to far away Pittsburg, Calif., near San Francisco, to live with his Aunt Bessie, who had moved from the South.\n\nThe Pittsburg Years: On his second morning in California, despondency drove Aldridge back to bed.\n\n“I finally got it out of him,” Blackman said. “He felt bad because he didn’t know how to comb the children’s hair. He wanted to help me, but couldn’t. . . . We loved him, but he thought he was imposing on us.”\n\nAnd in a sense, of course, he was. The Blackmans, Bessie and Benjamin, had six children of their own. “I saw them all off to college,” she said. “Every one.”\n\nShe and her husband also raised 8 other children, or 14 in all, most at the same time.\n\n“Two of my sisters came to live with us, then two nephews, three nieces, and Lionel,” she said. “They slept all over the house. We started with three bedrooms and had to add two more, and close in the patio.”\n\nBenjamin Blackman, a retired millwright at U.S. Steel, remembers that Lionel had been in the Pittsburg household only a few days when he came around and asked to be sent back to Louisiana.\n\n“He thought I had too many children already,” his Uncle Benjamin said. “I knew he didn’t want to go. There was no place for him to go. So I told him I wouldn’t send him.\n\n“I said, ‘I can’t give you much, but I’ll give you what my family have.’\n\n“I told him, ‘I only have three rules here. First, go to school. Second, pick out nice friends--nobody carries a big knife around me. And third, don’t ask for my car.’ ”\n\nAldridge never felt really comfortable in Pittsburg. For one thing, everybody expected him to go out for the high school football team because he was the biggest kid in town.\n\nTrouble was, he’d never played football. In his first 16 years, he’d hardly even seen a football, let alone a game.\n\n“So I taught him,” his Uncle Benjamin said. “I’d never played football myself, either, but I’d watched it on the TV. I took him out back and taught him.”\n\nAlmost every night after that, after school, Lionel came home from football practice with his stomach hurting. Once or twice, the pain was so intense that he couldn’t sleep.\n\n“I decided to drive by and see what the hell kind of a football team that was,” Blackman said. “And there was Lionel, the biggest guy on the team, running around blocking everybody with his stomach.\n\n“So I had to give him one more lesson,” Blackman said.\n\nWithin a week, Aldridge was the team’s best player.\n\nThe College Years: If he could go back and do it again, Aldridge would doubtless choose a different school. In the early ‘60s, he wasn’t ready for mostly white Utah State, which was in mostly Mormon, mostly white, Logan, Utah.\n\nHis high school coach, however, had taken a job there and immediately arranged a scholarship for Aldridge. And there he was, a curiosity symbol in a radically different culture.\n\n“Kids saw me coming, they’d say, ‘Here comes the chocolate man,’ ” Aldridge remembers.\n\nMore tension. And still more to come.\n\nHank Stoddard, sports director at WTMJ, one of Wisconsin’s most prominent radio personalities and one of Aldridge’s steadfast friends in Milwaukee, has tried to put himself in Aldridge’s shoes.\n\n“It’s 1960,” Stoddard said. “Who do you date at Utah State? How many colors are there?”\n\nAldridge first saw her in a sociology class, the sunny, young, white Mormon woman who was to become his wife.\n\n“Our relationship put us under a lot of pressure,” Vicky Aldridge told Milwaukee magazine later, describing the turmoil at Utah State, and the reaction of her parents, who at first refused to speak with her.\n\n“My father was very religious, and the dean of the school was a personal friend of my father’s,” she said. “He used to call us into his office and threaten to kick us out of school if we didn’t break (up).”\n\nStoddard gives Lombardi the credit for making life bearable for Lionel and Vicky in Green Bay, where blacks are few, even today, and inter-racial couples were practically unheard of in the ‘60s.\n\n“Lombardi told them, ‘I’m with you guys,’ ” Stoddard recalled. “He said, ‘If anybody gives you a hard time, I’ll take care of it.’ ”\n\nNonetheless, according to Vicky Aldridge, the NFL tried to block their wedding. That was after Lionel was drafted by the Packers but before they’d taken their case to Lombardi.\n\n“The NFL commissioner, Pete Rozelle, didn’t want us to get married because he feared an adverse reaction in the press,” she told Milwaukee magazine. “He even flew to Green Bay to try to talk us out of it.”\n\nNobody could talk them out of it. “Nothing could break them up,” Stoddard said.\n\nThe Lombardi Years: In 1963, for a fourth-round draft choice with a white wife, life wasn’t a bowl of cherries in Green Bay. It would have been tough enough for a fourth-round bachelor. The Packers were by then a veteran championship team. Lombardi had already coached them to two of the five NFL titles they won in that decade.\n\nWhat saved Aldridge was his talent. As a defensive player, he proved to be one of the best of his era, one of the most valuable of the champion Packers.\n\n“Willie Davis was flashier,” said Dan Devine, who coached the Packers later. “Nobody was steadier than Lionel Aldridge.”\n\nEvery down was like the Super Bowl to Aldridge, teammates said. There was a day in Los Angeles, for instance, when he kept coming in the final minutes of a game that the Packers were losing by a runaway score.\n\nIt was third and two, and as Ram running back Willie Ellison started around end--on the hottest afternoon of the year in the Coliseum--Aldridge went after him. Most of the other Packers had plainly quit for the day, and even Aldridge was running out of gas, but he kept chasing Ellison until he caught him at the sideline after a gain of less than a yard.\n\n“Considering the circumstances, that was one of the 10 greatest plays I’ve ever seen,” Devine said afterward.\n\nStill, it’s in the record that as a rookie, Aldridge had come to Green Bay as the youngest of the Packers. And he had brought his gentle nature with him. Some say that he might have been too young and too gentle for that tough, veteran team.\n\nOn rookie night at his first training camp, he was obviously uncomfortable as most of the new players clowned around and sang comical, off-key versions of their school songs.\n\nWhen the veterans called on Aldridge, he stood stiffly, hands at his sides, eyes straight ahead, and gave a serious rendition of a Utah State song in an all but inaudible voice.\n\nWillie Davis, recalling that night, said: “I asked myself, what’s a serious one like this guy doing here?”\n\nThe team found out a week later, when Lombardi made it clear that there was a place for either Aldridge or a Packer veteran, Urban Henry. Not both. That upset Henry’s buddies.\n\n“Almost everybody resented me except Lombardi,” Aldridge said. “And Lombardi overpowered me. Just walking into a room, he scared me.”\n\nAldridge learned that he, and not Henry, had made the team when he read it in the paper.\n\nDoubting whether to believe it, he was walking into the Packer dormitory that night, eyes lowered, when he felt a tap on the shoulder.\n\nTurning, he looked squarely into the face of Lombardi, who told him: “Nobody ever came up here and made the club the way you did.”\n\nSpeechless at the time, Aldridge said later: “At that moment, I needed that. And (Lombardi) knew it. He knew exactly how to manipulate his players--his success wasn’t an accident. But he was scary to play for.”\n\nIN THE GRIP OF A CRUEL DISEASE\n\nSchizophrenia: “A major mental disorder of unknown cause typically characterized by . . . a distortion of reality accompanied by delusions, hallucinations (and) bizarre behavior, etc., often with no loss of basic intellectual functions.” --Webster’s New World dictionary\n\nIn the days when Aldridge was still on the farm and going to grade school in Louisiana, a teacher asked him a question one day in class.\n\nReplying politely, he said: “I ain’t sittin’ on nan part of the chair.”\n\nThe other kids all laughed, and Aldridge squirmed. “It was one of the most embarrassing moments of my life,” he said later.\n\n“I hadn’t realized that my grandfather had his own language. I thought everybody talked that way.”\n\nAldridge vowed then to learn proper English. “I made it my first priority,” he said. “Although, of course, I didn’t know what a priority was in those days.”\n\nHe does now. And he has become the good speaker he wanted to be.\n\n“Lionel is known for that God-given voice,” said Shirley Leonard, a Packer spokeswoman.\n\nDan Devine said: “One thing everybody notices about Lionel is that he’s as well-spoken as he is soft-spoken.”\n\nWhat’s more, he is obviously a professional, a natural, on either radio or TV. As a commentator, Aldridge comes right to the point, and when he does, he has something to say.\n\n“Lionel is one of the top football analysts,” Stoddard said. “He has a knack for it. Getting a chance (as a commentator) is his problem.”\n\nIt is now. It wasn’t before mental illness struck him down. One day he was a rising professional, appearing on network television. The next he was out on the streets, hallucinating, behaving strangely. Considering the kind of ability he had shown in the communications field, he could hardly have been attacked by a more disastrous disease.\n\nThat is the nature of paranoid schizophrenia. Most serious illnesses are dreadful. This one torments in a particularly cruel way.\n\n“When you feel perfect, when you feel as good as you can feel, that’s when you’re getting into trouble,” Aldridge said. “For a (schizophrenic), happiness is the dawn of real trouble.”\n\nFeeling well often leads the patient to abandon therapy. “You feel so good that you know you don’t need any more medication,” Aldridge recalls sadly.\n\nAt UCLA, Dr. Wahl said that treatment consists of talk therapy as well as medication.\n\n“You have to understand your past if you are to change it,” he said. “Otherwise, you’re just covering up the problem (with medicine). Of course, medication is (essential).”\n\nAldridge is one of the many who can attest to that. For he was on and off medication several times--and had been burned every time he got off it--before he bowed to his illness.\n\n“Today, any time I start to feel I’ve got it together, I throttle it down,” he said.\n\n“I’ve had to learn a whole new ballgame. When I was on the bum, I felt great.”"}, {"url": "https://thesporting.blog/blog/the-end-of-the-line-the-rise-and-fall-and-rise-again-of-lionel-aldridge", "page_content": "And then Lionel Aldridge did something that made him realize he had more of a problem than just giving up the game of football.\n\nOn August 31, 1977, the Milwaukee Journal published the following report: “Lionel Aldridge, 36, was taken to County General Hospitals’ psychiatric emergency ward Tuesday night after he injured the couple’s poodle outside the home of his estranged wife, Vicki, 33.\n\nAbout 11:15 p.m., a neighbor reported to police that Aldridge was mistreating the dog. At least once, he picked it up and slammed it against the sidewalk. The dog was injured but not killed. Aldridge had missed his 5:15 and 6:15 radio shows.”\n\n“When I did that,” Aldridge recalled, “it was something I thought I needed to do, because I was listening to voices.”\n\nAldridge knew he was in trouble, but he left the hospital after a week and returned to work. Things went badly. He took many leaves from WTMJ and had many relapses.\n\nAs a player, he never drank or used drugs of any kind, but now he was hearing voices unheard by others, and the best way to drown them out was to drug them into silence.\n\nOn a fall weekend in 1978 the Packers were in San Diego for a game against the Chargers.\n\nThe night before the game, well past midnight, Milwaukee Journal writer Dave Begel was startled by a thunderous banging on his door. “I opened it,” said Begel, “and there was Lionel, holding a bottle of Scotch and a handful of pills.\n\nHe walked through the room, out to the balcony, and sat there drinking and taking pills.\n\n“When he said anything, it was just gibberish, like some foreign language. He wasn’t talking to me. Then he came in and sat on the bed and watched TV. I sat there and waited and waited.\n\n“The sun was coming up when he got up and said, ‘I’m going now,’ and left. I saw him an hour before game time and he was okay and did his job. But he was obviously very disturbed.”\n\nAldridge hung on to his job for a while, but by 1981 he was down and out, having plummeted from the heights of the Super Bowl to the depths of the gutter.\n\nOne night on a nondescript city street, he carefully removed his three-diamond Super Bowl ring, put it in his pocket and went to sleep. The ring was the most valuable possession he owned. In the morning it was gone.\n\nHe checked himself in and out of hospitals. A suicide attempt failed. He hitch-hiked across the country, looking for work and sometimes finding it.\n\nThere was a counseling job at a Utah prison; he couldn’t handle it. Arriving after the football season started at his Alma Mater Utah State, he was given a job as an assistant coach.\n\nIt lasted only until the season ended. He continued to drift, doing odd jobs when they came his way.\n\nHis wife had divorced him and taken the children to California. That was all right with him. He wanted some distance between them and him as long as he was in this condition. He did not know how long that would be."}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1998-02-13-9802130417-story.html", "page_content": "Former Packers defensive end Lionel Aldridge, who played on championship teams in the 1960s before a 20-year bout with homelessness and mental illness, was found dead Thursday in his apartment in Shorewood, Wis.\n\nAldridge's daughter had gone to check on her father and found him unresponsive. Police were called, and Aldridge was pronounced dead at the scene.\n\nAdvertisement\n\nPolice said the death appeared to be from natural causes but were investigating.\n\nAldridge, 57, was with the Packers from 1963-71, a period that included the first two Super Bowls.\n\nAdvertisement\n\nAfter a stint in broadcasting, he suffered from mental illness and lived on the streets, eventually settling in Milwaukee, getting treatment and becoming an advocate for helping those with psychiatric problems.\n\n- A woman has filed a civil lawsuit against Miami Dolphins running back Lawrence Phillips, claiming she was sexually assaulted during a party last February at an Omaha hotel. Rebecca Harvey of Omaha alleges that Phillips pinned her against a bathroom wall, then fondled her. Neither Phillips nor his agent could be reached for comment."}, {"url": "https://prabook.com/web/lionel.aldridge/2162636", "page_content": "Lionel Aldridge\n\ngridiron football player\n\nFebruary 14, 1941 (age 56)\n\nHe earned an athletic scholarship and played college football at Utah State University in Logan, and was a co-captain of the team and an All-Skyline Conference tackle. One of the few rookies to start for head coach Vince Lombardi, he enjoyed an eleven-year As a Packer, he played a role in their unprecedented three straight NFL Championships (1965-1966-67) and victories in Super Bowls I and World War II Traded to the San Diego Chargers, Aldridge played two seasons in San Diego before retiring from professional football in 1973. After retiring, Aldridge worked as sports analyst at WTMJ-television in Milwaukee and for Packers radio and National Broadcasting Company until manifesting paranoid schizophrenia in the late 1970s. Homeless for a time in part due to misdiagnosis, he eventually reached a form of equilibrium. He became an advocate for the homeless and the mentally ill until his death in 1998. His advocacy work included serving as a board member for the Mental Health Association of Milwaukee and working as a speaker for the National Alliance on Mental Illness."}, {"url": "https://www.pro-football-reference.com/players/A/AldrLi20.htm", "page_content": "Frequently Asked Questions\n\nWhen was Lionel Aldridge born?\n\nLionel Aldridge was born on February 14, 1941.\n\nWhere was Lionel Aldridge born?\n\nLionel Aldridge was born in Evergreen, LA.\n\nHow tall was Lionel Aldridge?\n\nLionel Aldridge was 6-3 (190 cm) tall.\n\nHow much did Lionel Aldridge weigh when playing?\n\nLionel Aldridge weighed 254 lbs (115 kg) when playing.\n\nIs Lionel Aldridge in the Hall of Fame?\n\nLionel Aldridge has not been elected into the Hall of Fame.\n\nHow many games did Lionel Aldridge play?\n\nLionel Aldridge played 147 games over his career.\n\nHow many sacks did Lionel Aldridge have?\n\nLionel Aldridge had 69.5 sacks over his career.\n\nHow many Super Bowls has Lionel Aldridge won?\n\nLionel Aldridge won 2 Super Bowls.\n\nWhen did Lionel Aldridge retire?\n\nLionel Aldridge last played in 1973."}, {"url": "https://www.packersnews.com/story/sports/nfl/packers/2017/09/15/lionel-aldridge/541006001/", "page_content": "Chad Burkholder\n\nFAST FACTS\n\n» Fourth-round draft choice out of Utah State in 1963\n\n» Was the only Packers player under coach Vince Lombardi to become a starter in his rookie season\n\n» Played in 123 regular-season games and was a standout defensive end for teams that won three straight NFL titles and two Super Bowls\n\n» Entered sports broadcasting after his playing career ended in 1973 and called some Packers game in 1975\n\nInterested in building the ultimate team of Packers Hall of Famers? We've built a tool to assemble your own legends roster. Please email cburkholder@gannett.com with comments, questions or updates."}], "Lionel Aldridge was part of the defensive line that included Willie Davis, Henry Jordan, and Dave Robinson.": [{"url": "https://www.acmepackingcompany.com/2021/7/12/22574302/packers-career-sacks-leaderboard-changes-after-pro-football-references-research", "page_content": "1982 is the magic year for pass-rushing records in the NFL. That season, the league began counting sacks as an official statistic, helping give pass-rushers an easy metric with which people could judge how effective a player is and was at bringing down the quarterback.\n\nThe modern value of sacks may be debated, and Green Bay Packers outside linebackers coach Mike Smith would surely be happy to have a spirited discussion about the value of pressures vs. sacks at any time. But sacks remain the single easiest number by which to judge a pass-rusher’s production. As long as they played after 1982, at least.\n\nBut on Monday, Pro Football Reference published the results of painstaking research by a pair of football researchers into game film in an attempt to quantify sacks farther back into NFL history. These two individuals reviewed a multitude of official records to try to recreate and account for sacks dating back to the 1960 season. Click here for a thorough discussion on this research, which has shaken up many of the career and single-season sack leaderboards, both across the NFL as a whole and for teams with a storied history like the Packers.\n\nIn fact, the biggest result of this research as far as Green Bay is concerned is a change atop the unofficial career leaderboard. No longer can Clay Matthews reliably claim to be the Packers’ top sacker in franchise history, as that title now belongs to a Pro Football Hall of Famer who played several decades earlier.\n\nHere is a look at a few of the names who now show up — or who significantly moved up — on the Packers’ leaderboard now that this data has been incorporated.\n\nNew #1: Willie Davis\n\nDavis, a deserving Hall of Famer and member of the Hall’s All-1960s Team, takes over the Packers’ top spot in career sacks based on this research. Davis is credited with a total of 93.5 sacks from 1960 through 1969, reaching that number thanks to an impressive string of All-Pro seasons in the middle part of the decade.\n\nDavis ripped off four straight double-digit sack seasons from 1964 to 1967, topping out at 14.5 in 1964. That also comes after a 13-sack season in 1962; he also earned first-team All-Pro honors for each of those five campaigns, four of which ended with the Packers winning the NFL Championship.\n\nEzra Johnson\n\nMuch of 1977 first-round draft pick Ezra Johnson’s career did have sacks counted after they became an official statistic in 1982, but his first five seasons in a Green Bay Packer did not get the credit that they deserved. In particular, Johnson’s 1978 season — which saw him earn his only trip to the Pro Bowl — goes down as the second-highest single-season sack total in franchise history with 17.5. That falls behind only Tim Harris’ 19.5 number from 1989.\n\nPreviously, Johnson was credited with only 41.5 sacks as a Packer and 55.5 overall for his career. Those numbers balloon up to 82 and 96 with his first five seasons counted, and his Packers totals put him in third place behind Davis and Clay Matthews (83.5).\n\nLionel Aldridge\n\nThe “other” defensive end on Vince Lombardi’s dominant mid-1960s teams was Aldridge, who played for the Packers from 1963 to 1971. Although Aldridge never made a Pro Bowl, he paired up with Davis to make for a fearsome tandem, as the two each posted double-digit sacks in 1965 and 1966 (10 and 12.5 for Aldridge in those two respective years).\n\nHis newly-recognized total of 62 sacks puts him in sixth place in Packers lore, following Kabeer Gbaja Biamila (74.5) and Reggie White (68.5) in 4th and 5th places.\n\nHenry Jordan\n\nYes, the Lombardi Packers have a third defensive lineman on the franchise’s top ten list, with defensive tackle Henry Jordan getting in on the act. Like Davis, Jordan is a Hall of Famer, and PFREF credits him with 52 sacks during his Packers career from 1960 to 1969. He may even climb the rankings a bit more if there were any missed sacks from the 1960 season, as he was an All-Pro that year but currently shows no sacks.\n\nJordan’s five straight All-Pro nods speaks to the consistency of his play, as he earned those honors every year from 1960 to 1964. It’s nice to see at least one statistical measure that demonstrates how great he was on the interior of the line for over a decade."}, {"url": "https://packerswire.usatoday.com/2021/07/12/willie-davis-is-actually-the-green-bay-packers-all-time-leader-in-sacks/", "page_content": "There’s a new all-time leader in sacks for the Green Bay Packers.\n\nHall of Famer Willie Davis produced more sacks than any player in franchise history.\n\nDecades of research from John Turney and Nick Webster of the Pro Football Researchers Association gave Pro Football Reference the confidence to add sack statistics from 1960 to 1982, when sacks became an official statistic, to their already impressive database of football statistics.\n\nClay Matthews is currently the Packers’ all-time leader in sacks at 83.5. According to the new stats, Davis actually holds the mark at 93.5, but the data from 1960 isn’t yet registered, meaning he probably has closer to 100 total sacks based on Turney and Webster’s research.\n\nOver 10 years in Green Bay between 1960 and 1969, Davis produced five seasons with 10 or more sacks, including four years straight between 1964 and 1967. He was a first-team All-Pro each season.\n\nThe numbers paint a clear picture: Davis was one of the best pass-rushers in the NFL during the 1960s.\n\nA five-time champion and six-time All-Pro, Davis was inducted into the Pro Football Hall of Fame in 1981. He died in April of 2020 at the age of 85.\n\nThe added stats also helped former Packers pass-rusher Ezra Johnson, who had 17.5 sacks in 1978 and is now third in franchise history in sacks at 82.0. Lionel Aldridge (62.0, 1963-1971), Henry Jordan (52.0, 1959-1969) and Clarence Williams (49.0, 1970-1977) were also added to the team’s top 10."}, {"url": "https://www.postcrescent.com/story/news/local/2016/02/06/appleton-area-players-super-memories-big-game/79861286/", "page_content": "Tim Froberg\n\nUSA TODAY NETWORK-Wisconsin\n\nA Super Bowl ring is not what you will find on the fingers of most human beings.\n\nIt’s an extravagant, grandiose piece of jewelry as big as the game it represents.\n\nMulti-million-dollar contracts are restructured and career sacrifices are made just to get a shot at slipping on the National Football League’s ultimate and most elusive prize.\n\nA.J. Klein will go after the NFL’s holy grail Sunday in Santa Clara, California. If Klein and the Carolina Panthers prevail in Super Bowl 50, the Kimberly native will join a short list of Appleton area athletes who have won Super Bowls.\n\nRELATED: Super Bowl 'surreal' for A.J. Klein's family\n\nHe's looking to keep a perfect streak alive. The Appleton area has a spotless Super Bowl record — 8-0.\n\nPanthers� A.J. Klein prepares for Super Bowl\n\nAppleton native and Xavier graduate Rocky Bleier was a part of the Pittsburgh Steelers’ dynasty in the 1970s, and won world titles in all four of his Super Bowl appearances for the Steelers (1975, 1976, 1979 and 1980).\n\nIn his lone Super Bowl appearance, Chilton’s Dave Casper – a Pro Football Hall of Fame tight end – helped John Madden and the Oakland Raiders win the 1977 Super Bowl with a 32-14 thumping of the Minnesota Vikings.\n\nShiocton native Clint Kriewaldt was a linebacker and special teams ninja for the 2005-06 Super Bowl champion Pittsburgh Steelers. He was joined on the Steelers’ sidelines for Super Bowl XL by Erik Jensen, a former Appleton East star who was a member of the Steelers’ practice squad.\n\nAnother former NFL player with an Appleton-Super Bowl connection was Ron Kostelnik, a defensive tackle who was a prominent member of Vince Lombardi-led Green Bay Packers teams that won the first two Super Bowls in 1967 and 1968. Kostelnik didn’t grow up here, but he made Appleton his home following his retirement and raised his family here, so we count him as our own. He died in 1993 at the age of 53.\n\nHere's our Fox Valley Super Bowl roster, beginning with the most recent.\n\nClint Kriewaldt: Running down a dream\n\nKriewaldt had 141 career tackles in a nine-year NFL career that spanned 123 games, but his most unforgettable stop came at Ford Field on the opening kickoff of Super Bowl XL.\n\n“That’s something I remember like it was two minutes ago,” said Kriewaldt, now a patrol deputy for the Outagamie County Sheriff’s Dept., a liaison officer at Shiocton High School and Freedom’s head football coach. “I remember running downfield and it was almost like I was running on a cloud. I didn’t hear anything. It was like going through a tunnel. When I hit him, my eyes and ears just opened up. Man, it was awesome.\n\n“Then I remember going to the sideline and seeing how excited guys like Joey Porter and James (Harrison) were. My son likes to go on YouTube and see that tackle. He gets a big kick out of it.”\n\nWhat made Kriewaldt’s lone Super Bowl experience extra special was that his parents, Randy and Jane Kriewaldt, and his two brothers, Corey and Chad, were able to attend.\n\n“After we won, confetti was coming down and I was helping my family to get out of the stands and onto the field,” Kriewaldt said. “I’m glad they got to be a part of that. Everyone had so much excitement on their faces.”\n\nKriewaldt’s extraordinary day ended at a postgame celebration party, where he got a chance to mix with celebrities like Kid Rock, Snoop Dogg and Hank Williams Jr..\n\n“It was really cool meeting those guys and taking pictures with them,” said Kriewaldt. “Hank Williams Jr. was sitting right at our table. It was just a blast.”\n\nKriewaldt’s Steelers entered the 2005-06 playoffs as a No. 6 seed and beat the odds by winning it all, culminated by a 21-10 Super Bowl win over Mike Holmgren’s Seahawks.\n\n“That whole ride was pretty special,” said Kriewaldt. “We had to win our last three games just to get in the playoffs. I was pretty fortunate to even have the opportunity to play in the NFL, and then to win a Super Bowl, that’s what everyone dreams about.”\n\nErik Jensen: Practice makes perfect\n\nJensen’s NFL’s career was confined to preseason games, but the former Appleton East star departed with something that eluded the grasp of NFL Hall of Fame players like Dan Marino — a Super Bowl ring.\n\nThe University of Iowa tight end — a seventh-round pick by the St. Louis Rams in the 2004 NFL draft — was signed to the Steelers’ practice squad on Dec. 20, 2005, and spent the rest of the season with the team. He watched Super Bowl XL in street clothes on the sideline of Ford Field, and was awarded a ring.\n\n“It’s something you dream about as a kid, it’s the pinnacle of football,” said Jensen, a village of Harrison resident and a sales representative for Stryker Medical Devices. “To be a part of it, even though I never dressed, was an unbelievable experience. The whole week was just surreal.”\n\nJensen, 35, remembers slapping on a Steelers Super Bowl champion baseball cap and T-shirt moments after the game’s conclusion and experiencing a once-in-a-lifetime celebration.\n\n“With the confetti coming down and all – it was one of those moments that you’ve watched on TV a million times,” Jensen said. “And then going to the locker room and holding the Lombardi Trophy was just unbelievable.”\n\nJensen also spent time on the rosters of St. Louis, San Francisco, Dallas and Cincinnati. But he will never forget his days in Pittsburgh.\n\n“It would have been better to be out there playing, but I took a lot of pride in giving the guys the best looks I could in practice to get them ready for games,” Jensen said. “I was living the dream. I knew every moment could be my last because I wasn’t a superstar. I knew I could be done tomorrow, so I just tried to live every moment and enjoy it while it lasted.”\n\nJensen doesn’t wear his Super Bowl ring much. Instead he keeps it in a display case along with some of the other awards he won in college.\n\n“I might pull it out for a job interview or something like that, but it mainly sits in a display case,” said Jensen. “I try not to make a big deal out of it. My friends are the ones that want to see it and they’re the ones who make a big deal out of it. But looking back, that was just a fantastic time in life for me.”\n\nRocky Bleier: A fistful of rings\n\nBleier, a running back who rushed for 3,865 yards and scored 25 touchdowns in 12 seasons with the Steelers, is the most celebrated of the local Super Bowl winners, and for a good reason. Defensive lineman Charles Haley is the only player in NFL history to win more Super Bowls (five) than Bleier, who is among 33 players, including 22 Steelers, with four Super Bowl rings.\n\n“You can never say never, but the game is so different today with free agency that it is going to be very difficult to do what our Steelers teams did,” said Bleier, who resides in Mt. Lebanon, a Pittsburgh suburb. “The success we had was very similar to the Packers of the ’60s and I got a chance to see that, too, growing up in Appleton.”\n\nBleier, 69, says his favorite Super Bowl moment was catching a touchdown pass from Terry Bradshaw in the Steelers’ 35-31 win over Dallas at the Orange Bowl in 1979.\n\n“I got on the cover of Sports Illustrated for that play, so you never forget that,” said Bleier.\n\nBleier’s least favorite Super Bowl memory also came at the Orange Bowl and against the Cowboys, but in Super Bowl X (1976) when the Steelers survived a late scare for a 21-17 victory.\n\n“It was the worst play ever called in Super Bowl history,” said Bleier with a laugh. “There were about two minutes left and we had the ball on our 40, and it was fourth-and-eight in a close game. Chuck Noll (the Steelers’ head coach) decided to go for it, and wanted to give me the ball on a running play.\n\n“Bradshaw had got knocked out of the game and Terry Hanratty was in there (at quarterback). He said, ‘Just eat up as much time as you can.’ I said, ‘I’m not an eat-up-time kind of guy. Franco (Harris) is.’ Everyone in the huddle knew the play wasn’t going to work.”\n\n“So the ball is snapped and I get two yards on the play and it lasts like two seconds. I’m on the sidelines thinking, ‘You don’t give (Roger) Staubach the ball on your 40 in a close game with two minutes left.’ Fortunately, we got an interception in the end zone to save the ballgame.”’\n\nBleier says the hype and build-up of the Super Bowl seemed big back in his playing days, but admits that it was nothing compared to the excessive show-within-a-football-game atmosphere that exists today.\n\n“Did we think it was a circus back then? Of course we did,” Bleier said. “But it wasn’t even close to what it’s like today. Tickets today are what? Eight hundred to three thousand dollars? For my first Super Bowl, it was 20 bucks.”\n\nDave Casper: From Chilton to the Super Bowl\n\nCasper’s family relocated from Elgin, Ill. to Chilton for his senior year in high school and Casper played a prominent role on the 1969 Tigers’ buzz saw that went undefeated in eight games and outscored opponents 363-0.\n\nA second-round pick out of Notre Dame by the Raiders in 1974, Casper — nicknamed “The Ghost” — caught 378 passes for 5,216 yards and 52 touchdowns in a distinguished 11-year career.\n\nCasper, who declined to be interviewed for this story, scored the first touchdown of the 1977 Super Bowl in Pasadena. He finished with four receptions for 70 yards. He is a financial director with Northwestern Mutual Financial Network in the Minneapolis-St. Paul area.\n\n“I will tell you this honestly, I didn’t work any harder than anyone else,” Casper told The Post-Crescent in a 2002 interview prior to being enshrined in the Pro Football Hall of Fame. “I was just fortunate. I worked hard, showed up every day and didn’t ever give in. If you do that and things turn out unbelievable, like making the Hall of Fame, then that’s how things work out.”\n\nRon Kostelnik: Birth of the Super Bowl\n\nWhen the first Super Bowl was played on Jan. 15, 1967, there was little hype about the game and it wasn’t the world-wide spectacle it is today. In fact, the first two contests didn’t even bear the Super Bowl name. They were called the AFL-NFL World Championship Game.\n\nBut Kostelnik knew that he and the Packers were playing in an extraordinary event that had plenty of room for growth. Kostelnik played most of his pro career in Green Bay (1961-68), where he was part of five NFL championship teams before spending his final season (1969) with the Baltimore Colts. He raised his family in Appleton, and his wife, Peggy, and daughter, Laura Biskupic, still reside in the Fox Cities.\n\n“I think both he and my mom understood when it was happening what a cool opportunity it was,” said Biskupic, a 1982 Xavier graduate and a marketing director at Winch Financial in Appleton. “I don’t think they probably had any idea of how big it was going to get, but they absolutely understood that it was special. I know they felt some pressure to win, mostly from coach Lombardi.”\n\nBiskupic, along with her sisters, Jennifer and Kathy, and brother, Mike were able to view countless pictures that Ron and Peggy took from the first two Super Bowls.\n\n“My dad was very much into preserving as much as he could from the Super Bowls,” Biskupic said. “He took some great pictures. He had pictures from the plane, and from when the Packers players went to Disneyland. He had little videos of all those guys on the rides, and a picture of Vince and Marie Lombardi coming out of church.”\n\nKostelnik, an inside anchor on a defensive line that included Willie Davis, Henry Jordan and Lionel Aldridge, was named to the Green Bay Packers’ Hall of Fame in 1989.\n\n“One thing that I think was so cool about that team is they were a really, really tight-knit group — not just then, but throughout their whole lives,” said Biskupic. “For all of the special moments in my dad’s life, his teammates were there, including my wedding. Lionel Aldridge was doing a radio show that morning and called my dad, and my dad said, ‘I’ve got a big day ahead of me.’ And Lionel ended up coming to the wedding.”’\n\nTim Froberg: 920-993-1000, ext. 423, tfroberg@postcrescent.com, on Twitter @twfroberg"}, {"url": "https://www.profootballhof.com/players/henry-jordan/", "page_content": "Henry Jordan Enshrinement Speech 1995\n\nPresenter: Don Kovach\n\nThank you, Jim. I'd like to briefly thank the Hall of Fame and citizens of Canton for their very gracious hospitality. On behalf of Betty and I, I want to say that it's something that will live in our memories forever. This has been a great time. Thank you very much.\n\nThis morning I am going to talk about Henry as a person. Obviously, his abilities on the football field speak for themselves or he wouldn't be here today. But perhaps hearing from his best friend you may get some feel as why his induction today is so special. Henry and I first met in 1953 when we were members of the University of Virginia freshman football team. We had much in common like a healthy interest in the fairer sex whom we found were willfully lacking on the university grounds, it not being coed at the time. So as soon as possible, being healthy young men, we set upon for the city of Charlottesville with another team member Bob Gunderman to the local girls. But we weren't successful, at least not immediately. Henry looked much older than his eighteen years at the time, already going bald. He was a daunting figure. Bob an opposing 6'4\", had a pension for cigars and I tried to mimic with success I believe, a tough guy accentuating my Jersey accent. With good reason the local populace referred to us as the gruesome threesome. One young lady, however, was not daunted by our collective size or differences. One evening at a community dance canteen, Olive Sargent a transplanted New Yorker .ram the heart of Manhattan, readily accepted our dance invitations. She danced very well, even with me. But apparently, she danced better with Henry because they were eventually married. And were a perfect match. Olive is responsible for selecting me today to present Henry for enshrinement. Consider the number of Henry's teammates that occupy a place on honor inside the building behind me. Not the least of whom is Bart Starr, Henry's roommate when Green Bay was on the road. Olive has paid me the honor of honors in acknowledging our friendship in this manner and I'd like to thank you very much Olive.\n\nOf all of Henry's accomplishments, perhaps he was most proud of his Virginia heritage. Particularly his family's history of working the land in and about the farm country of Emporia. He enjoyed his daddy's stories of his days as a mule skinner, and his work with the C & 0 Railroad, and that his brothers-built ships in the Newport News yards where he once worked himself. He was fond of sharing with his friends his mother's biscuits, buttered beans, and southern fried chicken and the hospitality of the Jordan home. Something I accepted, I feared, much more than it was offered. What Henry cherished most about life was people and their differences. An example of that was something specially shared with me while we were in college. For reasons unknown to his classmates and fraternity brothers, he would often vanish from the university scene on a Saturday evening. This would occur even on those nights when something important was happening on campus. On one occasion he asked me if I wanted to join him, as he put it, in the country. So, we journeyed together to some remote grange hall in the fertile Shenandoah Valley where I learned to square dance, long before it was the thing to do. It was here that Henry was at home with country folk, who's work ethic and moral values were his very essence. He loved to dance as much as Olive. His natural athletic abilities were evident in his legendary moves on the dance floor. It seemed like every inch of his body was in rhythm with the music. It was his way of communicating with the folks around him. A way of sharing his joy. His upbeat attitude was infectious to all who came in contact with him, including his football teammates. You knew he was enjoying life, even in difficult circumstances.\n\nI knew early on that Henry would carry that philosophy to his professional football career. We were together when he witnessed his first professional game in old Griffith stadium in Washington D.C. During the Redskins' game he commented on the beauty of the sport. Knowing it was a game of physical strength to be sure, requiring the utmost of conditioning, comparing it to a dance performance choreographed by plays previously designed and directed by coaching. At that time as a young college player, Henry was determined to try professional football. He felt that he could do it well. This occasion proves that he was so right.\n\nThe manner in which he achieved the immortality that he obtains today was singularly distinctive. He was small for a defensive tackle and although well-conditioned and naturally strong it was largely his mental agility that brought him fame. He would delight in describing, what he called, his little bag of tricks. Those were his exclusive moves designed to befuddle and bewilder the much larger offensive linemen that he faced weekly. He related how he would concentrate on his opponents’ tendencies and depending on the town and the conditions at the time, would determine which trick to use. A head fake, an eye movement, a lean, a comment. Whatever it would take to get his opponent out of sync for that fraction of a second and then he was gone. He giggled when related how he was able to virtually dive between the legs of the great Jim Parker, the Baltimore offensive lineman who is a member of this Hall of Fame. He got to the quarterback, not by challenging Parker's mighty strength and power, but by thinking and moving. All of those who faced Henry knew that he was relentless and would try every possible move and invariably win. The fierce interior line battles that he undertook throughout his career. It was Henry Jordan as a member of the Packer defense, that virtually perfected the modern pro inside pass rush.\n\nOne of Jordan's many renowned public quips was he played professional football for three reasons. The love of the game, the love of money, and the fear of Vince Lombardi. His love of football of self-evident. His reference to the love of money was in typical Jordan fashion. A not so subtle reference to the fact that all those who have been honored here before and those that will follow, understand the concept of professionalism. Henry understood that winning wasn't everything, but the only thing as meaning, winning determined the size of your paycheck. He made it known to his teammates and his coaches that in the field of professional football not taking care of business affected each team member's pocketbook. Henry would have nothing less than absolute commitment from himself and the other Packer team members. He was the quintessential professional. His reference to the fear of Vince Lombardi would have been more appropriately phrased as a deep respect for his responsibility as a head coach of a championship team and the manner in which he fulfilled those responsibilities. To be effective he knew that Lombardi needed unflagging respect from his players. Henry gained Lombardi's respect as well. Few people know that Henry walked out of pre-season camp one year not because of salary, but because he was dissatisfied with the way that Lombardi was treating him. He believed that the coach should have known that Henry was the one man on the Packer squad that knew what was going on in the lives of the various team members and how it affected the team's performance. Things that the coach didn't know, but which Henry would address on and off the field in his own way. History tells us that Jordan returned to the camp having won the respect few people have attained. Lombardi treated Jordan differently.\n\nSome of our current American sports heroes can take a lesson from Henry. He never abused his body with drugs and alcohol. He was an avid reader. An outstanding student graduating with honors from the University of Virginia. He was captain of his college football team. An Atlantic Coast conference heavyweight wrestling champ. Runner-up for the NCAA heavyweight wrestling championship. A distinguished military student and a commissioned Army officer. He was happily married, the father of three beautiful and loving children, and a successful businessman. His death is one of life's mysteries in that in spite of the care of his body, even while attempting to do so at the Milwaukee Athletic Club at 42 years of age on February 21, 1977 he died unexpectedly. Although Henry's death left many people in shock. What it did was bring home what he was to so many then and now. Bud Lee, the Milwaukee Centinal Sports Editor at the time, put it well on the day following Henry's death when he wrote an article which was entitled, \"Henry Jordan looked at the light side.'' The last two paragraphs say it all. Here is what Bud Lee said, \"I was on my way to the Miller bowling tournament and listening to the car radio when I heard of Jordan's death Monday. I told the Miller people of the news and quickly headed back to the office. As the public address system made the announcement of his death an eerie silence fell over the red-carpet celebrity lanes.'' Lee ended his story by writing, ''Henry Jordan was loved by a lot of people.'' And I will add my personal footnote to that. He also had a lot of friends. And I am privileged to be one of them.\n\nMy congratulations to Henry's family, his former teachers, coaches, the Green Bay Packer organization, and all of his friends and former high school and college teammates who are here today and feel a part of the pride and pleasure that Henry achieves by this award.\n\nHe was drafted out of the University of Virginia as a fifth-round pick by the Cleveland Browns in 1957. As you've heard two years later, he was traded to Green Bay. There he was anchored at the right defensive tackle spot and the Packers became a dynasty. Winning six divisional titles, five NFL championships, and the first two Super Bowls. Jordan was an all pro pick six times and played in five Pro Bowls, one in which he was chosen the outstanding defensive lineman. He missed just two games in his first twelve of thirteen pro seasons. It was a long time coming. And I must say that his family, friends are grateful that this has occurred today. I would like to thank God for Henry Jordan and all that he has meant to so many. At this time, it's my esteemed honor to present Henry Wendell Jordan to Henry Jordan Jr. for induction into the Professional Football Hall of Fame. Thank you very much.\n\nHenry Jordan Jr. on behalf of Henry Jordan\n\nThank you, Don. That was an outstanding speech. I'm sure dad would have loved it. First off, I would like to thank the Pro Football Hall of Fame committee for making this long-time dream of Henry Jordan's a reality. In addition, the whole Hall of Fame organization has been a pleasure to work with. My family and I were treated very kindly, professionally, and warmly. I would like to thank you all very much. We will not forget it. Also, to the people of Canton, your warmth and hospitality is unmatched. Thank you very much.\n\nYou know as a fan it is really an honor for me to be on the steps of the Hall of Fame, standing in front of such greats that are sitting behind me and those in the hall itself. Congratulations to all of you on your accomplishment. Those of you in the audience and many of you on TV right now what a big day this is for my dad and his family. And I want to thank you for tuning in and watching today because this is a big day. for him and he would be glad to have you here to celebrate it with him.\n\nThose of you that knew my father knew he was never at a loss of words of whit and humorous antidotes. And knowing him as you do, you know he would have loved this moment. To be the center of attention in front of the entire country for ten minutes. And being able to tell you exactly how he felt at this moment with no interruptions. His comment probably would have been, ''see I knew that being pretty wasn’t the only thing that I had to offer the game of football.”\n\nThere are people I believe he would have recognized and thanked for their contributions to what became Henry Jordan the man we loved as a player, a father, and a friend. But first and foremost, I believed dad would have thanked his creator. He wasn't an openly religious man, however the bible teachings and lessons were imbedded in him and practiced throughout his life. The Golden Rule is the one I know foremost was in his demonstrations to his family and friends and others he came in contact with. Next at the top of his list was his loving wife, Olive. She saw something more in him than those good looks and charming personality I just mentioned. In the roller coaster ride that is life in pro football, she was his rock throughout it all. Whenever the world or Vince Lombardi beat him down, she was there to build him up again and send him back out. She truly was the wind beneath his wings. His three kids Theresa, Suzanne, and myself I feel would have gotten some recognition as well. In addition to our unquestioning love and support of him as our father, his children were very, very important to him. And wanting to allow his children to have the best life he could give them was a driving force for him. Let’s face it, raising a family with three kids is not easy. I know I have three myself and one on the way. His mother and father, the late Henry and Katherine Jordan and his immediately family including his younger brother Gene sitting here today, for teaching him love, compassion, a belief in God, having one's pride in family. I would call that a code of honor that he practiced throughout his life. His high school wrestling coach and football coach, Coach Hamilton needs to be recognized as well, for teaching young men that using his natural physical abilities could open many doors or him in the future. His University of Virginia wrestling coach, Coach Finger and teammates and friends like Don Kovatch and Bob Gundernan for their belief in him and showing him that it just extended beyond his 170 IQ. His natural animal strength, quickness, and mental toughness set him apart from his peers. But you know what, he wasn't condemned for this, he wasn't ostracized for this. He was encouraged. And with that encouragement came graduation on the dean's list and selection by the Cleveland Browns in 1957.\n\nNow many of you may be unaware, but at that time dad was offered the opportunity to wrestle on the Olympics at that time. Fortunately for all of us now, one could not make a living for one's self and family as an amateur athlete at that time. The Cleveland Browns experience showed dad the importance of technique, game fundamentals and strategies. In addition, when you have limited playing time, it gives you a driving hunger to claim a place of your own when you are given a chance.\n\nEnter the Green Bay Packers. Here is where he was able to bring it all together. The love of team, his physical abilities, his mental acumen, and his drive to succeed. All this came together for one purpose, to be the absolute best that he could be. There is a long list of people associated with the Green Bay organization that I know dad would have liked to thank. But on a personal note, you people got to know dad on a level that I was never mature enough to achieve before he died. He and I loved each other as a father and son, for which I will always be grateful in fact, its prevalent in how I love my children today. However, he died before I could love him as a friend or brother as all of you did. And this was a relationship he cherished as much as you do. While he would have thanked the whole team as a group for their support of him and his family as they became acclimated to the Green Bay organization. There are a number of people that he would have recognized individually. Please forgive me if I forget a couple of names. At 36 years old, I continue to be told that I can't hear all the stories of life with the Green Bay Packers without anything over the parental discretion rating of G.\n\nThe Defense, Willie Davis, Ron Kastelnick, I know you are sitting with Ron right now dad, Dave Robinson, Lionel Aldridge, Leroy Cassey I know you are up there too Leroy, Ray Nitschke, Willie Wood, Herb Adderley, Dave Hanner, Bill Forrester, Hank Greminger, John Symak, Bob Geeter, and Tom Brown. You know there was a bond between these men that was indescribable, and they didn’t need a fancy name or monarch to describe their group. They didn’t need one. They didn't need one to get themselves up for games. And during their time together it was simply the best. The offense, without them the Packers never would have been in a position to win any of their games. Their hard work, support, and ability to deliver points when needed made the rest work harder to give them every chance.\n\nBart Starr, you were his former roommate during training camp and road trips. When the press called your room on road trips, thank you for letting dad answer the phone first so he could get his name in the paper. You know he really loved that. I also want to thank you for being such a good friend. Keeping him fed and being a good sport with all the shenanigans he pulled on you. Buddy Thurston and Jerry Kramer for the years he played at Green Bay, these two men worked with my dad during and after practice to perfect his game, giving him the different looks, moves, and tendencies he could expect during the coming week. In addition, knowing them they never hesitated to throw in a few combinations of their own. And I believe he was learning to use and work with these combinations that gave dad his extra edge in his game.\n\nFinally, Vince Lombardi. What can I say that hasn't already been said about the man? Coach Lombardi I'm sure you and dad are sitting up there having a nice chat over all of this. Coach Lombardi really showed dad the clan, the team, or family that he had been looking for. He gave him a chance. Many of you have heard my dad's famous quote about Coach Lombardi,\" he treats us all the same, like dogs.'' I believe there is more to the Lombardi methodology than that and I feel that dad was trying to say that Lombardi treats us all the same like family. And in any family, there is always a patriarch, and, in this case, it was Coach Lombardi. And while there may be many disagreements among his family members. No one outside the family was able to mess with the family, no one. I think this tight comradery that he made out of the Packer organization was very important to my dad and everyone else. And I believe it laid a solid foundation from which to build and it helped drive my dad and the rest of the team to greatness in this business of football. I still think that Packer family is still together today. For example, my sisters and I have grown up feeling that the men that have played football with my dad are extended uncles to our family. And that if at any time we need anything, anything they would be there.\n\nAnd I know I share these feelings with many Packer children today. This was a top down philosophy driven by Coach Lombardi himself. Coach Lombardi used to say as a player you have only three things to worry about your religion, family, and the Green Bay Packers. Not necessarily in that order. I think he came to instill in them that your family and the Packers were one in the same. And that quality of discipline and unity is what made the difference when the chips were down. Coach Lombardi, thank you for promoting an environment that allowed my dad to maximize and hone his God given skills and then on. Sundays letting him have the stage to show those gifts to the world.\n\nAs I get older, I realize more and more how great, how absolutely great it was to grow up in the shadow as such a man as my father, Henry Jordan. His pride in himself, his family, his quick wit, his love, and his sense of fair play have had a tremendous impact on me. My mother has said, if you want to know the man you look to the son. I think this is the greatest compliment she could ever give me. And I'm very proud to be named after him. Well· dad, we miss you very much. I miss you very much and I wish you were here to share this day together. But I know you can hear me. You are the best. Be content to know that your style and techniques of play have laid the foundation for and inspired many of the great athletes that have followed you. You are the top in your field, revel in it. The Hall of Fame is where you belong. I love you dad. You are my hero. Congratulations, you earned it."}, {"url": "https://www.nytimes.com/2020/04/15/sports/football/willie-davis-dead.html", "page_content": "Willie Davis, the Hall of Fame defensive end who played on five Green Bay Packer championship teams and anchored one of pro football’s greatest defensive alignments, died on Wednesday in Santa Monica, Calif. He was 85.\n\nHis death was announced by the Packers, who said he had been hospitalized with kidney failure.\n\nPlaying in the National Football League for 12 seasons, 10 with the Packers as part off the dynasty built by Coach Vince Lombardi, Davis never missed a game. He was quick, he was smart, and at 6 feet 3 inches and 245 pounds he was a formidable pass rusher and tackler.\n\n“He hated to sit out even a play,” the Packer guard Jerry Kramer recalled.\n\n“Once I was standing on the sidelines when Willie came out of the game with a dislocated finger,” Kramer wrote in “Distant Replay” (1985, with Dick Schaap), a remembrance of Green Bay’s N.F.L. championship teams. “I saw the bone sticking through the skin. The trainer grabbed the finger, yanked the bone back in place, then taped the finger to the adjoining fingers. Willie ran back to the game.”\n\nDavis was only a 15th-round pick in the 1956 N.F.L. draft, chosen by the Cleveland Browns out of Grambling College (now Grambling State University), the historically black college in Louisiana. After Army service and two seasons with the Browns, which shifted him between the defensive and offensive lines, Davis was traded to the Packers in 1960."}, {"url": "https://www.findagrave.com/memorial/38961586/lionel-aldridge", "page_content": "\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n\n\n\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n"}, {"url": "https://www.pro-football-reference.com/players/A/AldrLi20.htm", "page_content": "Frequently Asked Questions\n\nWhen was Lionel Aldridge born?\n\nLionel Aldridge was born on February 14, 1941.\n\nWhere was Lionel Aldridge born?\n\nLionel Aldridge was born in Evergreen, LA.\n\nHow tall was Lionel Aldridge?\n\nLionel Aldridge was 6-3 (190 cm) tall.\n\nHow much did Lionel Aldridge weigh when playing?\n\nLionel Aldridge weighed 254 lbs (115 kg) when playing.\n\nIs Lionel Aldridge in the Hall of Fame?\n\nLionel Aldridge has not been elected into the Hall of Fame.\n\nHow many games did Lionel Aldridge play?\n\nLionel Aldridge played 147 games over his career.\n\nHow many sacks did Lionel Aldridge have?\n\nLionel Aldridge had 69.5 sacks over his career.\n\nHow many Super Bowls has Lionel Aldridge won?\n\nLionel Aldridge won 2 Super Bowls.\n\nWhen did Lionel Aldridge retire?\n\nLionel Aldridge last played in 1973."}, {"url": "https://infogalactic.com/info/Willie_Davis_(defensive_end)", "page_content": "From Infogalactic: the planetary knowledge core\n\nWillie D. Davis (born July 24, 1934) is a former American football defensive end for the Cleveland Browns and the Green Bay Packers of the National Football League. Davis grew up in rural Louisiana and graduated from Grambling State University.\n\nDavis wore number 87 during his career with the Packers. For 10 seasons, Davis anchored the Packers' defensive line, playing 138 consecutive regular-season games, part of 162 consecutive regular-season games for his NFL career. Davis was a member of all five of Lombardi's NFL title-winning teams and played in Super Bowls I and II.\n\nDavis played in an era when neither tackles nor sacks were official statistics. However, John Turney, a member of the Professional Football Researchers Association, and a painstaking, highly respected researcher/statistician, reports that his extensive research indicates Davis had in excess of 100 sacks during his 10-year Green Bay career (1960–69), \"possibly more than 120,\" including a minimum of 40 over the 1963-65 seasons alone.[1] Davis himself is quoted as saying, \"I would think I would have to be the team's all-time leader in sacks. I played 10 years and I averaged in the 'teens' in sacks for those 10 years. I had 25 one season. (Paul) Hornung just reminded me of that the other day.\"[2] Davis earned All-Pro honors 5 times (1962, 64-67). Meanwhile he was voted to the Pro Bowl five times (1963–67).\n\nDavis recovered 21 fumbles over his Packers career, which, more than three decades removed from his retirement, remains a team record. The Packers honored his retirement with a Willie Davis Day on December 21, 1969. Davis remains on the team's Board of Directors.\n\nIn the early 1970s, Davis worked as a color commentator on NFL telecasts for NBC. He was inducted into the Pro Football Hall of Fame in 1981. In 1986, Davis was named the Walter Camp Man of the Year. In 1987, he was given the Career Achievement Award from the NFL Alumni, and in 1988 he was elected to the Wisconsin Athletic Hall of Fame in 1988. In 1999, he was ranked number 69 on The Sporting News' list of the 100 Greatest Football Players.\n\nDavis is a member of Kappa Alpha Psi fraternity. He received his MBA from the University of Chicago Graduate School of Business in 1968. He is a member or former member of the boards of Alliance Bank, Dow Chemical (1988–2006), Johnson Controls (1991–2006), K-Mart, L.A. Gear, Manpower (2001-), Metro-Goldwyn-Mayer (1999-), MGM Mirage, Rally's Inc., Sara Lee (1983-), Schlitz Brewing, and WICOR Inc. He has been president of All-Pro Broadcasting, operators of radio stations KHTI, KATY-FM, WLDB-FM, WLUM-FM, and WZTI since 1976.\n\nDavis' son is actor Duane Davis, his daughter is successful lawyer Lori Davis and his granddaughters are Harley and Hayden Zepeda daughters of Lori and his grandsons are William David and Wyatt sons of Duane\n\nReferences\n\nLua error in package.lua at line 80: module 'strict' not found."}]}