{"Lionel Aldridge was known for his quickness and agility.": [{"url": "https://www.packers.com/history/hof/lionel-aldridge", "page_content": "Lionel Aldridge\n\nInducted: 1988\n\nDefensive End: 1963-71\n\nHeight: 6'3\"; Weight: 254\n\nCollege: Utah State, 1960-62\n\nHONORS:\n\nPackers All-Modern Era Team: 1976\n\nWhile Vince Lombardi believed in aggressively overturning his roster each year to instill a mix of youth and keep his veterans on edge, he was wary of playing rookies. During Lombardi's nine years as coach of the Packers, Lionel Aldridge was the only rookie to start a season opener.\n\nAlthough Aldridge might have been more steady than spectacular over the course of his career, Lombardi's early faith in him was a tribute in itself. In fact, Aldridge started the first 45 games of his career under Lombardi before missing the fourth game of the 1966 season with an ankle injury.\n\nAfter the Packers won a second consecutive NFL championship in 1962, Lombardi traded veteran Bill Quinlan and created an opening at right defensive end with no obvious heir apparent. Veteran free agent Urban Henry, who wasn't re-signed by the Los Angeles Rams after missing the 1962 season with a neck injury, and No. 1 draft pick Dave Robinson were considered the frontrunners heading into camp. However, the Packers decided to play Robinson at linebacker when he reported late following the College All-Star Game and Aldridge beat out Henry.\n\nAldridge came into his own when the Packers won an unprecedented three straight NFL championships under the league's playoff format from 1965 to 1967. He started all eight postseason games during that stretch and then continued to hold forth at right end until midway through the 1971 season.\n\nOver his eight-and-a-half years as an established starter, Aldridge missed only three games, a notable achievement when you consider he broke his leg once and had some ankle issues. The worst of his injuries occurred in a mid-August preseason game in 1967 when Aldridge broke a bone in his lower left leg. He missed only the first two regular-season games, didn't start but appeared in the third, and then played roughly three-quarters of the game in a hard-fought victory over Detroit in Week 4. Lombardi, who had little compassion for injured players and rarely saluted them when they played hurt, heaped praise on Aldridge after the game. \"Aldridge deserves a lot of credit for the way he came back so fast from his injury,\" Lombardi said."}, {"url": "https://www.packers.com/news/aldridge-quickly-earned-lombardi-s-trust", "page_content": "Lionel Aldridge\n\nDefensive End: 1963-71\n\nHeight: 6-3; Weight: 254\n\nCollege: Utah State, 1960-62\n\nHonors:\n\nPackers All-Modern Era Team: 1976\n\nWhile Vince Lombardi believed in aggressively overturning his roster each year to instill a mix of youth and keep his veterans on edge, he was wary of playing rookies. During Lombardi's nine years as coach of the Packers, Lionel Aldridge was the only rookie to start a season opener.\n\nAlthough Aldridge might have been more steady than spectacular over the course of his career, Lombardi's early faith in him was a tribute in itself. In fact, Aldridge started the first 45 games of his career under Lombardi before missing the fourth game of the 1966 season with an ankle injury.\n\nAfter the Packers won a second consecutive NFL championship in 1962, Lombardi traded veteran Bill Quinlan and created an opening at right defensive end with no obvious heir apparent. Veteran free agent Urban Henry, who wasn't re-signed by the Los Angeles Rams after missing the 1962 season with a neck injury, and No. 1 draft pick Dave Robinson were considered the frontrunners heading into camp. However, the Packers decided to play Robinson at linebacker when he reported late following the College All-Star Game and Aldridge beat out Henry.\n\nAldridge came into his own when the Packers won an unprecedented three straight NFL championships under the league's playoff format from 1965 to 1967. He started all eight postseason games during that stretch and then continued to hold forth at right end until midway through the 1971 season.\n\nOver his eight-and-a-half years as an established starter, Aldridge missed only three games, a notable achievement when you consider he broke his leg once and had some ankle issues. The worst of his injuries occurred in a mid-August preseason game in 1967 when Aldridge broke a bone in his lower left leg. He missed only the first two regular-season games, didn't start but appeared in the third, and then played roughly three-quarters of the game in a hard-fought victory over Detroit in Week 4. Lombardi, who had little compassion for injured players and rarely saluted them when they played hurt, heaped praise on Aldridge after the game. \"Aldridge deserves a lot of credit for the way he came back so fast from his injury,\" Lombardi said.\n\nWhile Aldridge played before sacks were officially recorded, his best assets were his quickness and lateral movement, strengths commonly found in good pass rushers more so than defensive ends known for their play against the run. However, Aldridge didn't necessarily fit the stereotype. He was considered to be comparably efficient against the run and pass, whereas his predecessor, Quinlan, was more of a one-dimensional run-stuffer.\n\nOne reality that Aldridge faced throughout his career was lack of attention. Whether it was a blessing, a burden or both, he was overshadowed by fellow defensive end and future Pro Football Hall of Famer Willie Davis and had little chance of earning any postseason honors. The one exception was in 1964 when the Sporting News named him to the NFL's all-Western Conference team.\n\n\"Lionel was a little bit quicker than Willie (Davis), but Lionel was almost all quickness,\" said Pro Football Hall of Fame linebacker Dave Robinson. \"He didn't bull rush as much as Willie. Very smart. Real quick. His weakness was he could have used more weight. He was (really) 238, 239, 240. The linebacker, Lee Roy Caffey, was 250.\"\n\nThe Packers selected Aldridge in the fourth round of the 1962 NFL Draft. Overlooked in the American Football League draft, he signed with the Packers on Dec. 22, 1962, less than three weeks after they had picked him.\n\nAldridge played college football during the one-platoon era and doubled as a tight end and defensive lineman. However, his play appeared to suffer his senior year when he was moved from defensive end to defensive tackle. While that might have hurt his draft standing, scouts were still intrigued by his athletic ability and versatility. In fact, John Ralston, his college coach and later coach of the Denver Broncos, thought Aldridge's best position in the pros would be offensive guard.\n\nWith the Packers, Aldridge played in 123 games and started 115 before being traded on April 18, 1972, along with a third-round draft choice, to San Diego for safety Jim Hill. At the time, Phil Bengtson, Aldridge's former defensive coach and head coach with the Packers, was in charge of San Diego's personnel department. Aldridge spent two seasons with the Chargers and retired. In Green Bay, Aldridge had lost his starting job to Alden Roche in the seventh game of the 1971 season, Dan Devine's first as head coach.\n\nAldridge played two years in San Diego before announcing his retirement on April 3, 1974. By then, he was well into a second career, having joined WTMJ of Milwaukee as an offseason broadcaster in 1966. Once his NFL career ended, Aldridge became a full-time announcer. His assignments included serving as an analyst for Packers radio broadcasts from 1975 to 1978 and as a television commentator for NBC from 1975 to 1977. Although the positions overlapped, Aldridge was able to do both because he worked games for NBC only part-time. Thus, when there was a conflict, a sub filled in for him on radio."}, {"url": "https://www.latimes.com/archives/la-xpm-1987-10-27-sp-16847-story.html", "page_content": "Times Staff Writer\n\nAs professional athletes 20 years ago, Lionel Aldridge and Willie Davis were the defensive ends on one of the great football teams of all time, Vince Lombardi’s Green Bay Packers, winners of Super Bowls I and II.\n\nYears later, out of football, they wound up traveling widely divergent paths.\n\nBy 1977, Davis was a millionaire. Aldridge was well on his way to becoming a bum.\n\nAdvertisement\n\nWith a business school background at the University of Chicago--pursued during his Packer off-seasons--Davis had become, as he continues to be, one of the most successful beer distributors and radio entrepreneurs in the West.\n\nA former sociology major at Utah State, Aldridge launched an equally impressive career in radio broadcasting and network TV--in the midst of which he was abruptly knocked down, and almost out, by mental illness.\n\nAldridge is a paranoid schizophrenic. But at first, his doctors diagnosed the wrong illness and treated him with the wrong medicine. Within months, he was into the wretched life of a vagrant.\n\nIn the flop houses and rescue missions of America, Aldridge’s nightmare lasted for a ghastly decade, costing him his wife and family, his jobs in radio and television, other jobs, most of his friends, his money, and eventually his self-respect.\n\nIf the people who once knew him best thought of him at all in those days, they thought, very wrongly, that Aldridge was a classic manic depressive--on the loose.\n\nWillie Davis, who runs his many businesses from an office in South-Central Los Angeles, only heard about the nightmare when Aldridge called one day after hitch-hiking into Skid Row downtown, where he touched up his old buddy for $3. Davis gave him $300 and got him a hotel room, from which Aldridge promptly dropped from sight.\n\nThen two years ago, Aldridge telephoned again, this time from Milwaukee. The nightmare was over. He was taking the right medication, Aldridge said. And he was working again, as an account representative at the Milwaukee post office and part-time in radio.\n\nHe was also in a cheerful, new eighth-floor apartment overlooking Lake Michigan on the city’s fashionable East Side.\n\n“Lionel had come back from the gates of hell,” Davis said the other day, recalling that phone call in 1985. “I’ve never had a conversation with anyone that affected me that much.\n\n“For weeks afterward, I would catch myself whistling or humming to myself, and I’d ask, ‘Why the hell am I feeling so good?’ Then I’d remember: Lionel is back.”\n\nOne day last month at a community college in Milwaukee, Aldridge spent his noon hour away from the post office--as he so often does--on a speaking engagement.\n\nTalking to a roomful of students at Milwaukee Area Technical College, he said:\n\n“I could be mad at somebody because I got sick. It was society that allowed me to become a bum and pull cigarette butts off the streets and out of ash trays.\n\n“And I could be angry at God for giving me this disease.\n\n“But I’ve made a decision not to be bitter. I have done it for one reason. I didn’t get well until I quit blaming God and society--and took the responsibility for myself myself.\n\n“Here I am, a black man, (lecturing) white college students, but I feel very deeply about this. You--all of you--are responsible for you. Nobody is going to ride up and rescue you. . . . I know. . . . I’ve made it back because I learned to lean on myself--and because I learned to like myself.”\n\nHis text, Aldridge said, was from St. Paul’s letters to the Philippians. Reciting a lengthy verse from memory, he said: “Whatsoever things are true, . . . honest . . . just . . . pure . . . lovely . . . think on these things.”\n\nThink on the beautiful, he said, not the untrue.\n\n“One way to be a winner is to be honest,” Aldridge continued, speaking softly. “Honesty never loses.\n\n“I had a setback, but I never had a drug problem. I gave up for a while, but there was a doctor who believed in me. Now I’m putting it together again--at a pace I’m comfortable with.”\n\nThough Aldridge changes the lyrics each time, the music is always the same. And after this particular 23-minute speech, 18 or 20 listeners came up, as they always do, and crowded around, drawing Aldridge out on his themes of self-esteem and self-responsibility.\n\nAt 6 feet 4 inches and 300 pounds, he was the biggest man in the room, and one of the neatest in slacks and a long-sleeved white shirt. The tie was blue, the jacket light blue, the expression pleasant and dignified. At 46, Aldridge has the bearing and baritone voice of a cultured talk-show host.\n\nHe’s also a working man, though. Looking at his watch, he smiled and said goodby.\n\nDriving back to the post office in his red Pontiac Firebird--”It fit me till last January, when I quit smoking and gained 50 pounds”--Aldridge said:\n\n“There is no known cure for paranoid schizophrenia, but I am one of the lucky ones. The disease is in remission. I have largely recovered.\n\n“I have been given some time--and I’m going to use it to help others. And to help reduce the stigma of mental illness. And to encourage the commitment of more money and resources to (mental illness) research.”\n\nWhat about his personal commitments?\n\n“I don’t want a girlfriend right now,” he said. “I go out once in a while--but to manage a steady would take more time than I have to give.\n\n“My ex-wife . . . none of this is her fault. She’s about to be remarried . . .\n\n“I see my children now and then. The younger one is a soccer player in (a Milwaukee) high school. The older one is a freshman at (the University of Wisconsin Milwaukee). I love them dearly . . . “\n\nThe subject was painful, and he changed it.\n\n“I feel that I must give as much of me as I can to the post office, to WTMJ, and to the speeches (before youth groups and at mental-illness meetings).”\n\nWTMJ is Milwaukee’s big radio-TV complex. Aldridge worked there before the nightmare and the station has welcomed him home as its Saturday morning sports announcer.\n\nIn addition, after Packer games, he doubles as analyst and talk-show host on still another WTMJ program.\n\nDuring the week, he’s on full time at the post office, where, as an executive in technical sales, he helps the government fight its many private-sector competitors for the nation’s mail and parcel business.\n\n“It’s fun, but it’s a full schedule,” he said.\n\nAt times it even gets hectic.\n\n“This year we’ve called on Lionel to make all of our television commercials,” said Mike Mahnke, the post office’s division communications manager. “He does a first-rate job, too.”\n\nAt his desk in a large sales room, Aldridge seems as fond of his co-workers as they are of him.\n\nOnce a week, he said, he is “visited by the support people from the hospital. . . . And the doctor sees me twice a month.”\n\nPsychiatrists disagree on what causes Aldridge’s kind of mental illness. They say it may stem either from heredity or environment, according to Dr. Charles William Wahl, clinical professor of psychiatry at the UCLA School of Medicine.\n\n“Some think a predisposition . . . is in the (genes),” Wahl said. “Others, like myself, feel it’s a reaction to the traumas of early life. It may be partly both.\n\n“Stress is usually a factor. Stress . . . can make or break you. As Nietzsche said, ‘Those things that do not kill me make me stronger.’\n\n“There’s a great deal of variation in the prognosis, and there are no guarantees, but a cooperative and motivated patient has a better (chance).”\n\nCooperative, motivated. And helpful, sincere, caring. Unselfish. Glad to be alive. As he looks into the blank face of the future, Aldridge, now, is all of those.\n\nA LIFE OF TENSION AND TURMOIL\n\nAn orphan figuratively if not literally, an only child, he grew up in other people’s homes, the homes of relatives who had big families of their own. Then for nine years in pro football, he came under the influence of a dominating, uncompromising individual, the Lombardi of the legends. Indeed, Lionel Aldridge has known stress.\n\nThe Louisiana Years: The world began for Aldridge in the disheartening, steaming fields of the rural South. Born in Evergreen, La., he was the baby in the home of his grandfather, Aaron Compton, a sharecropper.\n\nOne of the Compton daughters, Bessie Blackman, Aldridge’s aunt, said: “Lionel was born in our house one night. There were 10 (children) in our family, 8 girls and 2 boys--and Lionel made 11.”\n\nEveryone shared equally, as Aldridge tells it. “But I was on edge all the time,” he said. “They were good to me. There was a lot of love there. But I walked a tightrope every day.”\n\nEarly on, his mother left town, following his father to the Midwest.\n\n“Lionel was lucky in his grandmother,” Blackman said. “She even made his pants, and that isn’t easy. She would sew all night so we’d have a dress to wear in the morning. Then she’d go out and work all day in the fields.\n\n“We’d wake up to the smell of beans cooking at 4 o’clock in the morning. She was always up and making sure we’d have something to eat for breakfast.”\n\nLionel hated field work. His one big interest was school. He made good grades and, as a sixth-grader, he decided that he would go to college some day. He can’t remember who influenced him. In Louisiana, though, he never missed an hour of school until the afternoon that disaster struck.\n\n“Lionel had been out playing in the rain,” said Norma Lawson, another aunt. “He came in and said in a shaky voice, ‘Papa, a snake bit me.’\n\n“We didn’t have a phone or a car in those days, so his grandfather ran all the way to town to get the doctor. The leg was so swollen by the time they got back that Lionel barely survived. He couldn’t walk for weeks.”\n\nHe cried much of the time.\n\n“There were rumors that I’d died,” Aldridge remembers.\n\nLawson said: “It wasn’t dying that worried him. The thing that made him cry was missing school.”\n\nThen real trouble hit. When he was 15, his grandfather died, and Lionel was bundled off again, this time to far away Pittsburg, Calif., near San Francisco, to live with his Aunt Bessie, who had moved from the South.\n\nThe Pittsburg Years: On his second morning in California, despondency drove Aldridge back to bed.\n\n“I finally got it out of him,” Blackman said. “He felt bad because he didn’t know how to comb the children’s hair. He wanted to help me, but couldn’t. . . . We loved him, but he thought he was imposing on us.”\n\nAnd in a sense, of course, he was. The Blackmans, Bessie and Benjamin, had six children of their own. “I saw them all off to college,” she said. “Every one.”\n\nShe and her husband also raised 8 other children, or 14 in all, most at the same time.\n\n“Two of my sisters came to live with us, then two nephews, three nieces, and Lionel,” she said. “They slept all over the house. We started with three bedrooms and had to add two more, and close in the patio.”\n\nBenjamin Blackman, a retired millwright at U.S. Steel, remembers that Lionel had been in the Pittsburg household only a few days when he came around and asked to be sent back to Louisiana.\n\n“He thought I had too many children already,” his Uncle Benjamin said. “I knew he didn’t want to go. There was no place for him to go. So I told him I wouldn’t send him.\n\n“I said, ‘I can’t give you much, but I’ll give you what my family have.’\n\n“I told him, ‘I only have three rules here. First, go to school. Second, pick out nice friends--nobody carries a big knife around me. And third, don’t ask for my car.’ ”\n\nAldridge never felt really comfortable in Pittsburg. For one thing, everybody expected him to go out for the high school football team because he was the biggest kid in town.\n\nTrouble was, he’d never played football. In his first 16 years, he’d hardly even seen a football, let alone a game.\n\n“So I taught him,” his Uncle Benjamin said. “I’d never played football myself, either, but I’d watched it on the TV. I took him out back and taught him.”\n\nAlmost every night after that, after school, Lionel came home from football practice with his stomach hurting. Once or twice, the pain was so intense that he couldn’t sleep.\n\n“I decided to drive by and see what the hell kind of a football team that was,” Blackman said. “And there was Lionel, the biggest guy on the team, running around blocking everybody with his stomach.\n\n“So I had to give him one more lesson,” Blackman said.\n\nWithin a week, Aldridge was the team’s best player.\n\nThe College Years: If he could go back and do it again, Aldridge would doubtless choose a different school. In the early ‘60s, he wasn’t ready for mostly white Utah State, which was in mostly Mormon, mostly white, Logan, Utah.\n\nHis high school coach, however, had taken a job there and immediately arranged a scholarship for Aldridge. And there he was, a curiosity symbol in a radically different culture.\n\n“Kids saw me coming, they’d say, ‘Here comes the chocolate man,’ ” Aldridge remembers.\n\nMore tension. And still more to come.\n\nHank Stoddard, sports director at WTMJ, one of Wisconsin’s most prominent radio personalities and one of Aldridge’s steadfast friends in Milwaukee, has tried to put himself in Aldridge’s shoes.\n\n“It’s 1960,” Stoddard said. “Who do you date at Utah State? How many colors are there?”\n\nAldridge first saw her in a sociology class, the sunny, young, white Mormon woman who was to become his wife.\n\n“Our relationship put us under a lot of pressure,” Vicky Aldridge told Milwaukee magazine later, describing the turmoil at Utah State, and the reaction of her parents, who at first refused to speak with her.\n\n“My father was very religious, and the dean of the school was a personal friend of my father’s,” she said. “He used to call us into his office and threaten to kick us out of school if we didn’t break (up).”\n\nStoddard gives Lombardi the credit for making life bearable for Lionel and Vicky in Green Bay, where blacks are few, even today, and inter-racial couples were practically unheard of in the ‘60s.\n\n“Lombardi told them, ‘I’m with you guys,’ ” Stoddard recalled. “He said, ‘If anybody gives you a hard time, I’ll take care of it.’ ”\n\nNonetheless, according to Vicky Aldridge, the NFL tried to block their wedding. That was after Lionel was drafted by the Packers but before they’d taken their case to Lombardi.\n\n“The NFL commissioner, Pete Rozelle, didn’t want us to get married because he feared an adverse reaction in the press,” she told Milwaukee magazine. “He even flew to Green Bay to try to talk us out of it.”\n\nNobody could talk them out of it. “Nothing could break them up,” Stoddard said.\n\nThe Lombardi Years: In 1963, for a fourth-round draft choice with a white wife, life wasn’t a bowl of cherries in Green Bay. It would have been tough enough for a fourth-round bachelor. The Packers were by then a veteran championship team. Lombardi had already coached them to two of the five NFL titles they won in that decade.\n\nWhat saved Aldridge was his talent. As a defensive player, he proved to be one of the best of his era, one of the most valuable of the champion Packers.\n\n“Willie Davis was flashier,” said Dan Devine, who coached the Packers later. “Nobody was steadier than Lionel Aldridge.”\n\nEvery down was like the Super Bowl to Aldridge, teammates said. There was a day in Los Angeles, for instance, when he kept coming in the final minutes of a game that the Packers were losing by a runaway score.\n\nIt was third and two, and as Ram running back Willie Ellison started around end--on the hottest afternoon of the year in the Coliseum--Aldridge went after him. Most of the other Packers had plainly quit for the day, and even Aldridge was running out of gas, but he kept chasing Ellison until he caught him at the sideline after a gain of less than a yard.\n\n“Considering the circumstances, that was one of the 10 greatest plays I’ve ever seen,” Devine said afterward.\n\nStill, it’s in the record that as a rookie, Aldridge had come to Green Bay as the youngest of the Packers. And he had brought his gentle nature with him. Some say that he might have been too young and too gentle for that tough, veteran team.\n\nOn rookie night at his first training camp, he was obviously uncomfortable as most of the new players clowned around and sang comical, off-key versions of their school songs.\n\nWhen the veterans called on Aldridge, he stood stiffly, hands at his sides, eyes straight ahead, and gave a serious rendition of a Utah State song in an all but inaudible voice.\n\nWillie Davis, recalling that night, said: “I asked myself, what’s a serious one like this guy doing here?”\n\nThe team found out a week later, when Lombardi made it clear that there was a place for either Aldridge or a Packer veteran, Urban Henry. Not both. That upset Henry’s buddies.\n\n“Almost everybody resented me except Lombardi,” Aldridge said. “And Lombardi overpowered me. Just walking into a room, he scared me.”\n\nAldridge learned that he, and not Henry, had made the team when he read it in the paper.\n\nDoubting whether to believe it, he was walking into the Packer dormitory that night, eyes lowered, when he felt a tap on the shoulder.\n\nTurning, he looked squarely into the face of Lombardi, who told him: “Nobody ever came up here and made the club the way you did.”\n\nSpeechless at the time, Aldridge said later: “At that moment, I needed that. And (Lombardi) knew it. He knew exactly how to manipulate his players--his success wasn’t an accident. But he was scary to play for.”\n\nIN THE GRIP OF A CRUEL DISEASE\n\nSchizophrenia: “A major mental disorder of unknown cause typically characterized by . . . a distortion of reality accompanied by delusions, hallucinations (and) bizarre behavior, etc., often with no loss of basic intellectual functions.” --Webster’s New World dictionary\n\nIn the days when Aldridge was still on the farm and going to grade school in Louisiana, a teacher asked him a question one day in class.\n\nReplying politely, he said: “I ain’t sittin’ on nan part of the chair.”\n\nThe other kids all laughed, and Aldridge squirmed. “It was one of the most embarrassing moments of my life,” he said later.\n\n“I hadn’t realized that my grandfather had his own language. I thought everybody talked that way.”\n\nAldridge vowed then to learn proper English. “I made it my first priority,” he said. “Although, of course, I didn’t know what a priority was in those days.”\n\nHe does now. And he has become the good speaker he wanted to be.\n\n“Lionel is known for that God-given voice,” said Shirley Leonard, a Packer spokeswoman.\n\nDan Devine said: “One thing everybody notices about Lionel is that he’s as well-spoken as he is soft-spoken.”\n\nWhat’s more, he is obviously a professional, a natural, on either radio or TV. As a commentator, Aldridge comes right to the point, and when he does, he has something to say.\n\n“Lionel is one of the top football analysts,” Stoddard said. “He has a knack for it. Getting a chance (as a commentator) is his problem.”\n\nIt is now. It wasn’t before mental illness struck him down. One day he was a rising professional, appearing on network television. The next he was out on the streets, hallucinating, behaving strangely. Considering the kind of ability he had shown in the communications field, he could hardly have been attacked by a more disastrous disease.\n\nThat is the nature of paranoid schizophrenia. Most serious illnesses are dreadful. This one torments in a particularly cruel way.\n\n“When you feel perfect, when you feel as good as you can feel, that’s when you’re getting into trouble,” Aldridge said. “For a (schizophrenic), happiness is the dawn of real trouble.”\n\nFeeling well often leads the patient to abandon therapy. “You feel so good that you know you don’t need any more medication,” Aldridge recalls sadly.\n\nAt UCLA, Dr. Wahl said that treatment consists of talk therapy as well as medication.\n\n“You have to understand your past if you are to change it,” he said. “Otherwise, you’re just covering up the problem (with medicine). Of course, medication is (essential).”\n\nAldridge is one of the many who can attest to that. For he was on and off medication several times--and had been burned every time he got off it--before he bowed to his illness.\n\n“Today, any time I start to feel I’ve got it together, I throttle it down,” he said.\n\n“I’ve had to learn a whole new ballgame. When I was on the bum, I felt great.”"}, {"url": "https://thesporting.blog/blog/the-end-of-the-line-the-rise-and-fall-and-rise-again-of-lionel-aldridge", "page_content": "And then Lionel Aldridge did something that made him realize he had more of a problem than just giving up the game of football.\n\nOn August 31, 1977, the Milwaukee Journal published the following report: “Lionel Aldridge, 36, was taken to County General Hospitals’ psychiatric emergency ward Tuesday night after he injured the couple’s poodle outside the home of his estranged wife, Vicki, 33.\n\nAbout 11:15 p.m., a neighbor reported to police that Aldridge was mistreating the dog. At least once, he picked it up and slammed it against the sidewalk. The dog was injured but not killed. Aldridge had missed his 5:15 and 6:15 radio shows.”\n\n“When I did that,” Aldridge recalled, “it was something I thought I needed to do, because I was listening to voices.”\n\nAldridge knew he was in trouble, but he left the hospital after a week and returned to work. Things went badly. He took many leaves from WTMJ and had many relapses.\n\nAs a player, he never drank or used drugs of any kind, but now he was hearing voices unheard by others, and the best way to drown them out was to drug them into silence.\n\nOn a fall weekend in 1978 the Packers were in San Diego for a game against the Chargers.\n\nThe night before the game, well past midnight, Milwaukee Journal writer Dave Begel was startled by a thunderous banging on his door. “I opened it,” said Begel, “and there was Lionel, holding a bottle of Scotch and a handful of pills.\n\nHe walked through the room, out to the balcony, and sat there drinking and taking pills.\n\n“When he said anything, it was just gibberish, like some foreign language. He wasn’t talking to me. Then he came in and sat on the bed and watched TV. I sat there and waited and waited.\n\n“The sun was coming up when he got up and said, ‘I’m going now,’ and left. I saw him an hour before game time and he was okay and did his job. But he was obviously very disturbed.”\n\nAldridge hung on to his job for a while, but by 1981 he was down and out, having plummeted from the heights of the Super Bowl to the depths of the gutter.\n\nOne night on a nondescript city street, he carefully removed his three-diamond Super Bowl ring, put it in his pocket and went to sleep. The ring was the most valuable possession he owned. In the morning it was gone.\n\nHe checked himself in and out of hospitals. A suicide attempt failed. He hitch-hiked across the country, looking for work and sometimes finding it.\n\nThere was a counseling job at a Utah prison; he couldn’t handle it. Arriving after the football season started at his Alma Mater Utah State, he was given a job as an assistant coach.\n\nIt lasted only until the season ended. He continued to drift, doing odd jobs when they came his way.\n\nHis wife had divorced him and taken the children to California. That was all right with him. He wanted some distance between them and him as long as he was in this condition. He did not know how long that would be."}, {"url": "https://www.milwaukeemag.com/the-long-walk-home-lionel-vicky-aldridge/", "page_content": "The interracial marriage of Lionel and Vicky Aldridge made Green Bay Packers and NFL history. Then mental illness and violence tore them apart. But their criss-crossing paths were far from over.\n\nUpstairs in her two-story house in Milwaukee’s pleasant Story Hill neighborhood, Vicky Aldridge is sitting on her bed, and she is looking at an 1876 centennial collector’s rifle.\n\nIt’s pointed at her forehead, and she knows it’s loaded, because she just watched the man holding it shove in the bullets.\n\nHe cocks it.\n\nAnd now, he has something to tell her.\n\nShe knows the baritone voice well. It belongs to Lionel Aldridge, her husband, and yet at this moment, not her husband at all. The Lionel she married was a funny charmer and brave protector, a man she so loved that she risked losing her family for him. He had played football for the Green Bay Packers, adjusting so well to Vince Lombardi’s discipline that he started as a rookie. Lombardi had never started rookies.\n\nAldridge helped Green Bay win the first Super Bowl, then three days later, on Jan. 18, 1967, he married Vicky. And by saying yes, she undid the tightest of ties to her small-town Utah family, who couldn’t comprehend their white daughter and sister being with a black man.\n\nBut Aldridge’s talents went beyond football. During Packers downtime, he was a sports anchor on WTMJ, a man with such presence and promise that NBC put him on national broadcasts soon after his playing career ended. The charm that attracted Vicky also won viewers over. But TV screens revealed only so much, offering no clue Aldridge was tiptoeing on the edge of sanity, or that he was beating his wife.\n\nMinutes before Lionel levels that rifle at her head, Vicky is in the final stages of putting an end to those beatings. The plan is simple, if sketchy. She’ll pack up some bags, then go pick up her two young daughters from school, and they’ll head for the bus station. She’ll select a route, and they’ll go wherever her small amount of cash can get them. Not back home to her family in Utah. With the biracial children, she still can’t go there. But somewhere.\n\nThe bags are on her bed and packed. All she needs to do is leave. But before she can, he arrives home. He sees what she’s doing. He retrieves the rifle and loads it. He smashes its butt into the luggage and throws the crushed bags downstairs. He puts the rifle between her eyes and tells her, point-blank, “If you ever try to leave me, I’ll kill you.”\n\n“So that stopped me,” Vicky says, now some 40 years removed from the peril. She gives a nervous chuckle. “Yeah, he could get very scary. And I’m sure that was his mental illness coming more and more.”\n\nShe didn’t know he’d someday be diagnosed with paranoid schizophrenia. Or that he’d inadvertently solve her domestic violence problems by embarking on his own brain-addled cross-country sojourn, or that he was destined to join the ranks of the homeless. She didn’t know of the comeback that awaited him, that his destructive illness would someday serve constructive purposes, that she and so many others would never stop loving a man born on Valentine’s Day. She, who knew him so well, still didn’t know so much about Lionel.\n\nNobody did.\n\nThe handsome black Utah State University football player, with the short hair and sparkling eyes, broad smile and broader shoulders, has been asking Vicky Wankier for a date. He often sees her while working his side job of cleaning a gym, because that’s where Vicky practices with her Aggiettes dance squad. After a few rounds of hard-to-get, the lithe and lively girl with the long chestnut hair finally says yes.\n\nShe tells him to just come to her dormitory lobby, where they’ll sit and have a good talk. He laughs into the phone. “I can’t do that.” She protests, wondering why not. “Just trust me,” he says.Yes, Lionel Aldridge, a wisened junior in the spring of 1962, knows straightaway what they are getting into. You could count the number of black men at Utah State on two hands, and they don’t get to stay by making eyes at white women in their dorm lobbies. Vicky, just a freshman and still naive to racial realities, would get wise soon enough.\n\nBarely integrated though it was, Utah State was still the most multiracial experience Vicky had ever known. She was born in August 1943, and she grew up in Levan, the tiniest of central Utah towns. And of course, she was raised Mormon, just like everyone else in her hometown.\n\nHer family bonds – with father Farrell Wankier and mother Thela, older brother Farrell Jr. and older sister Norine – were country strong. And nine years the youngest child, she was every bit daddy’s little girl, even into her teens. He had one glass eye and terrible peripheral vision, so when she drove him around town, Vicky had a job. She’d name the person they were driving past and tell him which direction to wave. So in this way, the successful sheep farmer, shopkeeper and future Levan mayor could call out a personalized hello.\n\nWhen Vicky went to Utah State for a teaching degree, the Wankiers knew she’d be in good hands. Farrell Sr. was old friends with Daryl Chase, the school’s president. She’d practically have family there.\n\nFor Aldridge, the closest thing to family in Utah was the Aggies’ football team, because his actual family was scattered far and wide. Born in 1941 in Evergreen, La., he grew up fully immersed in the era’s southern brand of racism. He was a grandson of sharecroppers and son of a father he never really knew. His mother also left when he was young, called to Detroit to care for family, leaving Lionel with his grandparents. She could never afford to return, and poor though they were, the grandparents gave him as good a life as they could. He helped in the fields, but wanted no part of such grueling work for a lifetime, so he poured himself into school, hell-bent on getting to college.\n\nWhich didn’t mean there wasn’t some rebel in him. His path to the school for black children took him past an all-white school, and black kids had to walk on the other side of the road. One afternoon on his way home, young Lionel sprinted across the street and slapped one of the white school’s buses. He kept on sprinting, spurred on by an incensed mob of white children. But none were in sight when he arrived home, a hint of his budding athleticism.\n\nAnd yet, he never played organized sports in Louisiana. That didn’t come until he was 15, when his grandfather’s death prompted Lionel’s move to live with an uncle and aunt in Pittsburg, Calif. It was a different world in the San Francisco suburb, and at Pittsburg High School, Lionel excelled at track, basketball and football. Then Pittsburg’s football coach took a job at Utah State and convinced Lionel to follow.\n\nAldridge turned into a standout for the Aggies, but it still wasn’t easy for a black man in Logan. The racial slurs he’d grown up with in Louisiana and been distanced from in California became common again. And as his relationship with Vicky grew into an open secret, he got even more unwelcome attention.\n\nOne day, Chase called Vicky into his office, then called her father’s phone number by memory. “I think your daughter has something to tell you,” the school president told Farrell, and handed the receiver to Vicky. “Hi Dad,” she said. “I’m dating Lionel Aldridge. He’s black.”\n\nFarrell’s reply was succinct. “We’ll be right there.” Lionel was soon summoned, and the kids were told just how bad this relationship was for both of them. They agreed to end it, never truly intending to do so.\n\nChase tasked a dean with watching her closely, but she was too far down the path with Lionel to be swayed by protests from her family or anyone else. She didn’t see what the big deal was with race, and couldn’t understand why others didn’t understand.\n\nVicky and Lionel were careful to do things under the radar and off campus. Lionel would borrow a friend’s car, and they’d drive to nearby Logan Canyon. In time, their love grew serious. For her devotion, she was called nigger-lover, and no sorority would have her. For his temerity, once his four years of football eligibility were up, so was his welcome at Utah State. School officials said it was grades. Vicky remains convinced it was their relationship, an example of how Lionel risked his career while she risked her family.\n\nSo he didn’t graduate, and Vicky recalls that when Aldridge was invited to prestigious college all-star games like the East-West Shrine Game, Utah State wouldn’t give him a helmet. He had to borrow one from his high school.\n\nNone of that dissuaded a certain bespectacled NFL coach from spending a fourth-round draft pick on him in 1963.\n\nLionel Aldridge is in Vince Lombardi’s office, a place you generally don’t want to be, an invitation impossible to decline. And although the 1966 season has been another good one for the 6-foot-4, 245-pound defensive end, he’s not in here for a pat on the back.\n\nThe Green Bay Packers coach has heard through the grapevine that Aldridge is, with regularity, bringing a white woman into town. He wants an explanation. So Lionel begins to tell him about Vicky.\n\nThey’d secretly gotten engaged back in 1963. At the end of Aldridge’s rookie season, he flew Vicky to San Francisco for Green Bay’s finale against the 49ers. He and teammate Dave Robinson had some people in their hotel room before the game, and Lionel pulled her into the bathroom. He produced a one-carat diamond ring. She’d kept it hidden away for her last two years at Utah State. Not long after her graduation in 1965, they decided she should move to Milwaukee.\n\nVicky knew that, as far as her family was concerned, crossing the Mississippi River meant crossing the Rubicon. While she’d held out hope her family would come around on Lionel, they were equally hopeful she’d come to her senses and ditch him. But moving to Milwaukee ended her family’s hopes and, for the most part, her close relationship with them. Years later, she’d find out just how deep an impact this had back in Levan.\n\nSo, Aldridge explains to Lombardi, he’s not just bringing some floozy up to Green Bay. This is the woman he’s wanted to marry for years, only now, he’s afraid to do so. Not because of what her family will think. Not even because of what his teammates will think. After all, Aldridge was the rookie who’d heard a fellow Packer utter the word nigger, then threw him up against a wall and declared an end to that word in the locker room.\n\nNo, Aldridge is reluctant to marry Vicky because he knows what happened to Cookie Gilchrist. A black running back who drew comparisons to Jim Brown, Gilchrist was blackballed from the NFL because he married a white woman and relegated to the Canadian Football League. Aldridge doesn’t want the same thing happening to him.\n\nLombardi’s response, as related by Robinson, showcases the coach’s famed combination of gruff compassion and equanimity. “Vince told him, ‘Listen, I want you to marry her and make an honest woman out of her,’” Robinson recalls. “‘You do what’s right and let me worry about the rest of it.’ Lionel said he couldn’t wait to go home and tell Vicky.”\n\nThat wasn’t quite the end of it. At some point, NFL Commissioner Pete Rozelle came to town and told Lombardi the marriage would be bad for the league. Lombardi pretty much told Rozelle where to go. “He said, ‘This is my team,’” Vicky recalls. “‘You can’t tell me how to run it.’” Were Aldridge on any other team, she believes, he couldn’t have married her and stayed in the league. Only Lombardi could stand up to Rozelle.\n\nThey had the wedding at a little chapel in Las Vegas, not wanting to run afoul of any interracial marriage laws elsewhere. They stayed at the Tropicana and caught Bill Cosby’s stand-up act. Three days earlier, Green Bay had won the inaugural Super Bowl, and Lionel’s champion status earned him a measure of fame – and some primo seats.\n\nAt the table next to them were teammates from a different Pack – Rat Pack stars Peter Lawford and Sammy Davis Jr. Lionel whispered to Vicky, wondering if he should ask for autographs. Seconds later, Lawford leaned over. “Could I get your autograph?” he asked Lionel.\n\nAldridge didn’t hesitate to oblige, then whispered something else to Vicky. “Well, there’s no way I’m gonna ask for one now.”\n\nDave Robinson and Lionel are about to fight. The Packers roomies are best of friends, with linebacker Robinson the perfect easy-going complement to Aldridge’s moodiness. But the battle is imminent.\n\nLionel has arrived upset because Vicky’s been slighted by another player’s spouse. Although Vicky has a foot in with the black wives because of Lionel and another foot in with the white wives, she hasn’t been fully accepted by either camp. Her latest issue has so angered Lionel that he’s poised to confront the offending wife’s husband. Robinson tries curtailing Aldridge’s vendetta. Lionel tells him to mind his own business. Robinson presses further into it.\n\n“You are my business,” Robinson says. He tells Aldridge the team can’t risk losing him over some brouhaha that stems from their wives’ spats. So, he’s going to stop Lionel. “If we have to fight, we’ll fight.” Lionel takes a long look at Robinson. “You’re crazy,” Aldridge says. They have a good laugh, and Aldridge admits Robinson’s right.\n\nIf Lombardi’s blessing unlocked the NFL’s interracial marriage barrier, it wasn’t a panacea for the Aldridges. The ramifications were felt not so much in the locker room, but up in the stands or during social gatherings, where Vicky often felt excluded from the cliques.\n\nThe wives had a tradition of rotating watch parties at their homes when the Packers were on the road. The first time Vicky’s turn came, she laid out a fanciful spread, but when game time arrived, none of her guests did. She called around and heard various excuses – illness, busy, what have you – but the message was clear.\n\nAnother time, at a home game, Vicky went to her seat among some black wives, including Willie Davis’ wife, Ann, and Elijah Pitts’ wife, Ruth. Vicky found they’d given it away. “Go find a seat someplace else,” Ann said. Some white wives, including Jim Grabowski’s spouse, Kathy, overheard, and Kathy invited Vicky to sit with them. At this, Ann told Vicky they’d make room for her. Vicky told her to F-off and sat next to Kathy, who would become a cherished friend and remembers Vicky being “friends with everybody she could be.”\n\nIn time, Pitts would also grow close to Vicky. During the season, they lived in the same Green Bay apartment complex, one of the few local places that rented to blacks. She saw all that Vicky endured, and during a team party, the two were in the ladies’ restroom.\n\n“Vicky,” Pitts recalls saying, “I am really sorry if us black girls have done anything to make you uncomfortable. I apologize for everybody.” Tensions eased, and Vicky embraced her dearest friends because she had no family support. She kept calling Utah every Sunday, especially to speak with her father, but conversations were perfunctory.\n\nStill, Vicky could enjoy some perks that life as a Packers wife provided. There were the parties, meeting celebrities and sharing the love showered upon the players. This was, after all, a golden era in Green Bay. From 1965-67, the Packers were nothing but kings, winning the last NFL championship and the first two Super Bowls.\n\nMeanwhile, the Aldridge family was growing into their Story Hill home. On Dec. 28, 1967, daughter Angela was born in Milwaukee. Lionel drove down from Green Bay to see mother and baby, but he couldn’t stay long. On Dec. 31, he had to play in the Ice Bowl.\n\nTwo weeks later, with Vicky and Angela still in Milwaukee, the Packers won Super Bowl II in Miami. Lionel called home saying some guys wanted to celebrate in the Bahamas, and he wondered if she’d mind. She was breastfeeding when the call came, and stopped long enough for Lionel to hear Angela crying. “Does it sound like you can go to the Bahamas for a week?” she asked.\n\nHe came home.\n\nAs the 1960s come to an end and the birth of their second daughter approaches, Vicky notices subtle changes in Lionel. The longer he’s played football, the angrier he’s become.\n\nLooking back on it today, she wonders whether all those football hits took too big a toll. She’s heard from Lionel’s teammates how he’d get “dinged” in the head and return to the huddle, not knowing where he was. And she knows modern scientists are edging toward a direct relationship between concussions, mood changes, domestic violence and mental health issues.\n\nBut on a day in the fall of 1969, all Vicky knows is that Lionel is somehow different, and she’s about to learn the extent. She returns to their Green Bay apartment one afternoon, running behind schedule, and Lionel accuses her of being late because she’s having an affair. Lionel’s teammates had always treaded lightly around Vicky at parties, knowing that if they looked at her too long, his jealousy and temper might flare. But before Vicky can get over her surprise at this accusation, Lionel slaps her.\n\nThere is no affair, she says, but the violence puts her beyond discussing it. She collects Angela and drives to their Milwaukee home, wondering what just happened. They’d been through so much together, made so many sacrifices for each other, all for the sake of love. Now this? “It was something I never expected from him,” she says.\n\nHe calls Vicky and apologizes, promising to never do it again. She acquiesces, neither expecting nor believing the violence will continue. Instead, it worsens.\n\nMichelle is born in February of 1970, but the presence of a second beloved child cannot stem the mounting malaise inside the Aldridge home. Visits from friends become scarce. Lionel keeps hitting Vicky, and sometimes, the only way she can get him to stop is calling Angela into the room. When the little girl enters, he relents. “I probably shouldn’t have involved her,” Vicky says today, “but I just didn’t know what to do. I had tried everything.” She’d call the police, but to no avail. “Because of who he was,” Vicky says, “they would just pat his head and tell him to not do that anymore.”\n\nWhen Vicky’s mother dies in September 1971, it’s the impetus for a true reconciliation with her father. Despite the thaw, however, she knows biracial children won’t be welcome back in Utah, so returning there isn’t an option.\n\nAfter the ’71 season, slumping Green Bay trades an aging Aldridge to San Diego, where he’ll play two more years. His paranoia progresses, and he often accuses Vicky of trying to poison him. A Chargers teammate suggests he try transcendental meditation, and he does, sometimes for 20 minutes, sometimes for hours on end. The 1973 season concludes, and so does Aldridge’s NFL career. But he’s had a plan for life after football, and now, it’s ready to blossom.\n\nBack in Milwaukee, a full-time broadcasting job with WTMJ awaits. Since the mid-1960s, he’s done offseason work for the TV and radio stations, steadily honing his natural talent. Robinson remembers a diligent Lionel working to drop his southern accent, reading books in their room and repeating phrases like “how now brown cow.” The newly retired Aldridge continues doing sports anchor work on local newscasts. But now that he can work during football season, TMJ puts him on Packers radio broadcasts, pairing him with the singular play-by-play talents of Jim Irwin. It’s not long before NBC tabs him as an analyst for national TV games.\n\n“He had a future at the network level,” says Hank Stoddard, then TMJ’s sports director. Stoddard compares Aldridge’s analytical acumen, and his ability to communicate it, to the modern-day skills of Cris Collinsworth and Troy Aikman. “He was destined to become that type.”\n\n\n\nAldridge’s slide from sanity comes at an ever-quickening pace.\n\nStoddard is 80 years old now and living near the Pacific Ocean in San Juan Capistrano, Calif. Over a morning cup of coffee, he reminisces on Lionel while gazing out a window. He notes how the fog hides his view of the water, and he laments the fog that so enveloped Lionel.\n\nHe’d started seeing troubling signs at work. The friendly cameraman who complained about Lionel’s attitude. Aldridge asking why he had to go to Green Bay when the baseball reporter needed only drive to County Stadium. But one day, the problems crystallize.\n\nAldridge is supposed to do the 5 p.m. broadcast, but as the time approaches, he’s at his desk just staring at the wall. Stoddard looks at the script in his typewriter: “My name is Lionel Aldridge, and I can do anything.” That’s it. Stoddard tells the news director Aldridge can’t go on and ad-libs the 5 p.m. broadcast himself. Aldridge is driven home.\n\nThe slide from sanity comes at an ever-quickening pace. It includes blanking out while broadcasting a game, leaving Irwin hanging without an analyst. It includes a rifle pointed at his wife’s head. It leads to a nervous breakdown in February 1975, a misdiagnosis of bipolar disorder, and a monthlong stay at Milwaukee Psychiatric Hospital. It leads him to the care of Dr. Alan Reed, then something of a celebrity psychologist in Milwaukee, but who Vicky and friends say only made things worse. Indeed, years later, Reed would lose his state license amid allegations that he had sex with a patient.\n\nReed isolates Lionel for weeks, refusing to let Vicky or anyone else see him, even Aldridge’s mother, who’s traveled from Detroit. Reed later tells Lionel he should divorce Vicky, and for years, she’d have done anything to get away from him. But when finally given this exit route, she doesn’t want it, feeling she shouldn’t abandon Lionel in his current state. Aldridge moves out anyway, still far from stable. The clearest indication comes in August 1977.\n\nDespite the separation, Lionel visits his old house often, so when he shows up one evening, it’s not surprising. But what he does next is surreal.\n\nAs he’s leaving, Lionel picks up Charlie, the family’s little white mutt, and walks outside. Vicky follows, asking where he’s taking the dog. Lionel doesn’t answer. Instead, he walks into the driveway, raises Charlie over his head, and hurls the dog to the ground. Horrified, Vicky screams at Lionel and tries pushing him away, but to no avail. He kicks the dog, then walks to the corner and sits on the curb, waiting for the police to arrive. The dog will soon die.\n\n“I think it was his way of just crying out, saying somebody has got to find out what’s wrong with me,” Vicky says now. “The kids, luckily, were in bed, and luckily, it wasn’t me he picked up and smashed.” He spends another month hospitalized, this time at the Milwaukee County Mental Health Complex. Vicky warns Reed to stay away. She knows he’s been unfaithful to his wife and threatens to tell her. It works. Lionel is diagnosed as a paranoid schizophrenic. For the first time, he’s medicated with Haldol.\n\nIt stops the voices but leaves him feeling like a zombie, so he doesn’t always take it.\n\nAldridge struggles to continue his broadcasting career, and his TMJ co-workers support him, allowing time off when necessary. But it’s too great a battle. One night, unable to go on the air, he sobs in his boss’ office. Despite the protests of his colleagues, in 1979, he resigns. He still won’t take his medication regularly.\n\nHe is at a loss, and now, he’ll become lost. The voices tell him to start driving, so he starts wandering aimlessly about the country, the gasoline bills always sent home to Vicky. At first, she pays them, but soon cancels the credit card. She has to make ends meet for the kids, and her job as a radio station ad sales rep only pays so much. As it turns out, former Packer Willie Davis owns the station, WLUM, but she won’t learn this until running into him at the office Christmas party.\n\nShe files for divorce in 1980, but it’s delayed and delayed because Lionel can’t be found. Finally, in 1982, the divorce goes through without his presence. Vicky and the kids leave for California to start a new life.\n\nFarrell Wankier Sr., who has remarried after Thela’s death, is heading to Las Vegas with his second wife, and their path takes them through a southwestern Utah town called Beaver. They stop at a diner for a bite to eat, and in the midst of their repast, a man takes a seat next to them.\n\n“Hello, Farrell,” the newcomer says. It is, through an astronomical coincidence, Lionel, who is hitchhiking through the area. Farrell barely recognizes him, but offers to buy his meal, and he accepts. Farrell also offers him a ride, and Lionel declines. They go their separate ways, and Farrell relays the amazing encounter to Vicky.\n\nThroughout the early 1980s, Lionel’s cross-country wanderlust has taken him everywhere and nowhere, from Florida to Oregon, and seemingly all points in between. He’s gone to the places he once lived – Louisiana, Utah, California – and to places he’d never known. Many of those places, he’s reached on foot, after selling his car for $100 in Florida. He’s gotten work, and then left it behind. He’s slept in a field near Salt Lake City, and left a Super Bowl ring behind.\n\nWith its loss, the lone tangible connection to his Packers past is a battered old Bible he’d kept from his playing days.\n\nHis path eventually winds toward Milwaukee, but he gets stranded in Sidney, Neb. A charitable agency buys his bus ticket for the rest of the trip, and he settles in at the Milwaukee Rescue Mission. Back in the city that had been home for so long, he makes the medical breakthrough that’s eluded him for so long. Dr. Melvin Soo Hoo finds a minimal medication level that works for Lionel, and he starts taking it with far more regularity. In January 1985, the 18th anniversary of that first Super Bowl, Aldridge learns his former teammates are chipping in to replace his lost championship ring. Lionel also lands work with the post office, then returns to broadcasting part time, and he gets an East Side apartment.\n\nBy 1986, Vicky and the kids are back in Milwaukee, too. The California plans haven’t worked out, and Davis offers Vicky her old job back. She accepts, and comes home not just with daughters Angela and Michelle, but a granddaughter, too. Angela had gotten pregnant at age 17 and gave birth to Monica in 1985.\n\nVicky remarries in 1987 to a gentleman named Joe Nelson, who also happens to be black, and their wedding is at Milwaukee’s All Saints Cathedral. She loves his quiet confidence and steady nature, and he bonds well with her daughters. He also supports Vicky’s encouragement that Angela and Michelle forge a relationship with Lionel. She warns that if they don’t, they’ll someday regret it, knowing how much it meant to rebuild things with Farrell before his death in 1994.\n\n“She never spoke a bad word about [Lionel], and she could’ve,” Michelle says. “She never made us feel like he didn’t love us. She just said that he was sick and not able to have a relationship.”\n\nMichelle, now 44 and living with her husband in Kentucky, tears up remembering the first time she saw the new Lionel. “He just looked completely different. He looked good, but didn’t look the same as I remembered him. A little awkward. But it was good.”\n\nBy then, Lionel had stabilized enough to become a spokesman for mental health issues. He gives a speech at Michelle’s high school, telling his own story so that others might learn from it. And in addition to his local mental health advocacy, he gives speeches nationwide on behalf of the National Alliance for the Mentally Ill. To this day, NAMI bestows the annual Lionel Aldridge Award at its national convention to a person living with mental illness, recognizing their “courage, leadership and service.”\n\nTime, and time spent together, slowly bridges the gap between father and daughters. He brings them Christmas gifts. They share meals, either at his favorite George Webb or at his apartment, where he serves up broiled chicken and white rice. They check on him often to make sure he’s OK, and to make sure he’s on his medication. “You could always tell when he’d not taken it because he would begin to swear more,” Michelle says.\n\nWhen he’s too far off his meds, the girls must persuade him to go to the hospital, molding their tactics to whatever personality he exhibits. Sometimes, he’s like a little boy, and they tempt him with promises of ice cream. Sometimes, he’s a mean man, and they must meet him with firm and forceful language. But he never gets violent with them.\n\nVicky also reconnects with Lionel, and she says Joe never questions nor feels threatened by it. And Lionel is re-embraced by his football roots. He’s inducted into the Packers Hall of Fame in 1988. He’s named to Utah State’s All-Century Team in 1993.\n\nA few years later, Aldridge has a car accident that requires a tracheotomy, and Vicky makes regular hospital visits, reading to him and making sure he’s well-cared for. He weighs some 400 pounds, and the doctor tells him if he doesn’t lose 50 pounds, he’ll be dead in a year.\n\nVicky takes the opportunity to tell Lionel something, too. He can’t speak, so it’s her chance to share just how much trouble and angst he’d caused, and she doesn’t have to worry about him talking back. He gives a muffled laugh, and she follows through on the promise, unloading all those years of pent-up pain and frustration. He absorbs it all without flinching.\n\n“When I left him,” Vicky remembers, “he mouthed, ‘I love you.’”\n\nDuring the late afternoon of Feb. 12, 1998, Michelle arrives at Lionel’s apartment near Estabrook Park, where they’d so often shared broiled chicken with rice. But this is not a dinner date, just another check-in.\n\nWhen she knocks on the door, Lionel doesn’t answer. It’s locked, but through a window, she can see him sitting at a desk. She knocks on the glass to get his attention, and though she thinks she can see him breathing, he doesn’t respond. She pounds harder. Still nothing.\n\nNow she is getting frantic. She runs to another apartment and knocks on the door for help. A woman answers and is on the phone, and even though Michelle is panicked and screaming, the woman will not get off the phone. She goes to another door and a man answers. She tells him her father is dying or dead.\n\nThe man lets her in, and by now, Michelle’s mind is racing so much she can’t remember the number for 911. The man calls it for her, and rescuers are dispatched. Vicky is also notified, and she arrives, as does the boyfriend who’d later become Michelle’s husband. Police get through the window and into Lionel’s apartment. They won’t let Michelle in. They tell her he’s dead.\n\nIt is two days before Lionel’s 57th birthday. The medical examiner’s report, according to a New York Times story, lists him at 408 1/2 pounds. His heart, so strong for so long, finally failed, the doctor’s ominous prophecy come true.\n\nJoe Nelson plans the Feb. 16 funeral at All Saints Cathedral, and it is massive. Hundreds fill the church to capacity. “It seemed,” Michelle says, “like thousands.”\n\nThe audience reflects the full spectrum of Lionel’s journey. Vicky and Joe, other family and friends from Milwaukee and afar, city officials and mental health professionals, people in the media and people who were homeless. And, of course, a slew of Green Bay Packers, Willie Davis, Jerry Kramer, Bob Long and Dave Robinson among them. Michelle and Angela give eulogies, as does Monica, Lionel’s 12-year-old granddaughter.\n\n“Lionel affected a lot of people in his life, whether he knew it or not,” Vicky says. “It was quite a tribute.” And because he had no insurance to handle the bill, those who shared in so much of his life give his family one more gift. His Packers’ teammates pick up the tab.\n\nLooking back, it was never a question. “He was one of ours. He was a Green Bay Packer,” Robinson declares. “His troubles were our troubles.”\n\nNot long after Lionel’s death, Vicky and Monica are in Utah visiting Norine, Vicky’s sister. It’s a sign of how far their once-cold relationship has come. Norine produces some letters that she and their mother, Thela, exchanged shortly after Vicky left Utah. Vicky and Monica sit on their bed, reading through them in chronological order. Tears stream down Vicky’s face.\n\nYour dad is lying here on the couch in the dark. He hasn’t eaten in a couple of days. We’re not talking to anybody. How could she do this to us?\n\nThe content of the letters haunts Vicky, and the next morning, Norine admits to wondering whether she should’ve let Vicky see them. Vicky gives Norine a long hug and apologizes for leaving with Lionel. “It wasn’t to cause any pain or hurt,” she says. “I just fell in love.”\n\nThe ladies go out to get their nails done, and Vicky tries to pay, but Norine won’t have it. She won’t let her pay for anything else, either. When it’s time to go, she thanks Norine for all the hospitality. “I was so mean to you for so many years,” Norine says. “I’ve got a lot of making up to do.” It cements their renewal.\n\nVicky remembers back to the night she was reading those letters with Monica, and what Monica had told her while taking her hand: “Oh Grandma, your mom and dad loved you,” Monica said. “You were just ahead of your time.”\n\nRuth Pitts doesn’t know why she selects this particular prayer shawl. She goes through 10 or 20 of them, finally settling on a crocheted piece with warm brown tones and the merest hint of gold and green. Yes, she decides, this is it. The ladies at her United Methodist Church in Palm Springs, Calif., make the shawls, which are blessed and mailed out monthly to people needing prayer and comfort. In November of 2011, Pitts knows Vicky Aldridge Nelson needs both.\n\nDaughter Angela has died at age 43, unable to overcome years of her own drug and alcohol addiction. Like Lionel’s memorial service, her funeral is at All Saints Cathedral. In the weeks and months afterward, Vicky comes to cherish the shawl, wearing it every day.\n\nIn the autumn of 2014, Vicky clutches the shawl even tighter. After living a life full of years both good and bad, she’s in the midst of a particularly rough stretch. Stoddard, still friends with Vicky, had long ago nicknamed her the Unsinkable Molly Brown. Lately, she’s had to be.\n\nIn September, her 81-year-old brother, Farrell Jr., dies in Salt Lake City. When Vicky was a child and he’d come home on leave from the Army, she’d leap into his arms, and he’d produce a teddy bear. Then came the estrangement, which later gave way to their gradual knitting of the breach. Once, during Lionel’s lost years of wanderlust, Farrell Jr. gave him money when he showed up unannounced. And when Vicky married Joe, it was Farrell Jr. who walked her down the aisle.\n\nThen in October, Vicky’s mourning load doubles. Granddaughter Monica dies at age 28, and like her mother, addiction plays a role. Vicky deplores the continued stigma of addiction, how most don’t think of it as a disease, mirroring the public’s still-stigmatized perception of mental illness. All Saints hosts yet another Aldridge funeral.\n\nOn top of it all, Joe is starting to have health issues. His arteries need stents. He’s in the early stages of Alzheimer’s disease. Vicky’s shawl is ever-present. And now, her Utah family wants to be, too.\n\nNorine and Farrell Jr.’s widow, Deanna, beg Vicky to move to Utah with Joe, beg her to let them help lighten the load. When Vicky and Joe were at Farrell’s funeral, they visited Salt Lake City’s picturesque Liberty Park. Joe struck up a conversation with a passing black man, asking where he gets his hair cut. The man told him about a nearby barbershop, and how much he enjoyed living in the city.\n\nAnd so, in November, a once-cozy Milwaukee home is full of boxes. Vicky Aldridge Nelson is shipping them to Utah, where she was once ostracized for marrying a black man. Now, she will return there with husband Joe, and accept the warm and abiding embrace of family.\n\nHowie Magner is a senior editor at Milwaukee Magazine. Write to him at howie.magner@milwaukeemag.com.\n\n‘The Long Walk Home’ appears in the January, 2015, issue of Milwaukee Magazine. Click here to subscribe.\n\nFacebook Twitter Pinterest LinkedIn Reddit Email\n\nComments\n\ncomments"}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1998-02-13-9802130417-story.html", "page_content": "Former Packers defensive end Lionel Aldridge, who played on championship teams in the 1960s before a 20-year bout with homelessness and mental illness, was found dead Thursday in his apartment in Shorewood, Wis.\n\nAldridge's daughter had gone to check on her father and found him unresponsive. Police were called, and Aldridge was pronounced dead at the scene.\n\nAdvertisement\n\nPolice said the death appeared to be from natural causes but were investigating.\n\nAldridge, 57, was with the Packers from 1963-71, a period that included the first two Super Bowls.\n\nAdvertisement\n\nAfter a stint in broadcasting, he suffered from mental illness and lived on the streets, eventually settling in Milwaukee, getting treatment and becoming an advocate for helping those with psychiatric problems.\n\n- A woman has filed a civil lawsuit against Miami Dolphins running back Lawrence Phillips, claiming she was sexually assaulted during a party last February at an Omaha hotel. Rebecca Harvey of Omaha alleges that Phillips pinned her against a bathroom wall, then fondled her. Neither Phillips nor his agent could be reached for comment."}, {"url": "https://www.profootballforums.com/threads/aldridge-quickly-earned-lombardis-trust.13992/", "page_content": "Defensive End: 1963-71\n\nHeight: 6-3; Weight: 254\n\nCollege: Utah State, 1960-62\n\nPackers All-Modern Era Team: 1976\n\nWhile Vince Lombardi believed in aggressively overturning his roster each year to instill a mix of youth and keep his veterans on edge, he was wary of playing rookies. During Lombardi’s nine years as coach of the Packers, Lionel Aldridge was the only rookie to start a season opener.Although Aldridge might have been more steady than spectacular over the course of his career, Lombardi’s early faith in him was a tribute in itself. In fact, Aldridge started the first 45 games of his career under Lombardi before missing the fourth game of the 1966 season with an ankle injury.After the Packers won a second consecutive NFL championship in 1962, Lombardi traded veteran Bill Quinlan and created an opening at right defensive end with no obvious heir apparent. Veteran free agent Urban Henry, who wasn’t re-signed by the Los Angeles Rams after missing the 1962 season with a neck injury, and No. 1 draft pick Dave Robinson were considered the frontrunners heading into camp. However, the Packers decided to play Robinson at linebacker when he reported late following the College All-Star Game and Aldridge beat out Henry.Aldridge came into his own when the Packers won an unprecedented three straight NFL championships under the league’s playoff format from 1965 to 1967. He started all eight postseason games during that stretch and then continued to hold forth at right end until midway through the 1971 season.Over his eight-and-a-half years as an established starter, Aldridge missed only three games, a notable achievement when you consider he broke his leg once and had some ankle issues. The worst of his injuries occurred in a mid-August preseason game in 1967 when Aldridge broke a bone in his lower left leg. He missed only the first two regular-season games, didn’t start but appeared in the third, and then played roughly three-quarters of the game in a hard-fought victory over Detroit in Week 4. Lombardi, who had little compassion for injured players and rarely saluted them when they played hurt, heaped praise on Aldridge after the game. “Aldridge deserves a lot of credit for the way he came back so fast from his injury,” Lombardi said.While Aldridge played before sacks were officially recorded, his best assets were his quickness and lateral movement, strengths commonly found in good pass rushers more so than defensive ends known for their play against the run. However, Aldridge didn’t necessarily fit the stereotype. He was considered to be comparably efficient against the run and pass, whereas his predecessor, Quinlan, was more of a one-dimensional run-stuffer.One reality that Aldridge faced throughout his career was lack of attention. Whether it was a blessing, a burden or both, he was overshadowed by fellow defensive end and future Pro Football Hall of Famer Willie Davis and had little chance of earning any postseason honors. The one exception was in 1964 when the Sporting News named him to the NFL’s all-Western Conference team.“Lionel was a little bit quicker than Willie (Davis), but Lionel was almost all quickness,” said Pro Football Hall of Fame linebacker Dave Robinson. “He didn’t bull rush as much as Willie. Very smart. Real quick. His weakness was he could have used more weight. He was (really) 238, 239, 240. The linebacker, Lee Roy Caffey, was 250.”The Packers selected Aldridge in the fourth round of the 1962 NFL Draft. Overlooked in the American Football League draft, he signed with the Packers on Dec. 22, 1962, less than three weeks after they had picked him.Aldridge played college football during the one-platoon era and doubled as a tight end and defensive lineman. However, his play appeared to suffer his senior year when he was moved from defensive end to defensive tackle. While that might have hurt his draft standing, scouts were still intrigued by his athletic ability and versatility. In fact, John Ralston, his college coach and later coach of the Denver Broncos, thought Aldridge’s best position in the pros would be offensive guard.With the Packers, Aldridge played in 123 games and started 115 before being traded on April 18, 1972, along with a third-round draft choice, to San Diego for safety Jim Hill. At the time, Phil Bengtson, Aldridge’s former defensive coach and head coach with the Packers, was in charge of San Diego’s personnel department. Aldridge spent two seasons with the Chargers and retired. In Green Bay, Aldridge had lost his starting job to Alden Roche in the seventh game of the 1971 season, Dan Devine’s first as head coach.Aldridge played two years in San Diego before announcing his retirement on April 3, 1974. By then, he was well into a second career, having joined WTMJ of Milwaukee as an offseason broadcaster in 1966. Once his NFL career ended, Aldridge became a full-time announcer. His assignments included serving as an analyst for Packers radio broadcasts from 1975 to 1978 and as a television commentator for NBC from 1975 to 1977. Although the positions overlapped, Aldridge was able to do both because he worked games for NBC only part-time. Thus, when there was a conflict, a sub filled in for him on radio.Born Feb. 14, 1941, in Evergreen, La. Given name Lionel Aldridge. Died Feb. 12, 1998, at age 56."}, {"url": "https://archive.jsonline.com/sports/packers/48921882.html/", "page_content": "SHARE\n\nBy ,\n\nIn the best of times, Lionel Aldridge was a defensive standout for the Green Bay Packers. An articulate and well-spoken man. A loving husband, father and family man.\n\nAn athletic 6-foot-4, 250-pound end, Aldridge used his size and strength to do something no other player had in the Vince Lombardi dynasty of the 1960s: earn a permanent starting position as a rookie.\n\nAldridge, a fourth-round draft choice from Utah State in 1963, remained a Green Bay starter through the 1971 season, playing in 123 regular-season games. He was part of three NFL championship and two Super Bowl-winning teams.\n\nIn the worst of times, Aldridge, suffering from severe depression and mental illness, lost his family and his job as a television color analyst. In 1977, his wife sued him for divorce and a month later he beat the family's dog after a domestic incident at his suburban Milwaukee home.\n\nAldridge was admitted to the psychiatric emergency ward at Milwaukee County General Hospital and tried medication and therapy to regain his mental health. By 1980, divorced and broke, he drifted for several years throughout the United States, working odd jobs to survive. He worked construction, maintenance, and even a brief stint as an assistant coach at Utah State.\n\nAt times he slept in the streets, and one morning woke up to find his Super Bowl II ring had been stolen off his finger. He showed up at Willie Davis' office in Los Angeles one day and asked for financial and medical help. Davis and other teammates were quick to offer assistance, but Aldridge never stayed long.\n\nHis daughter, Michelle Golding of Shorewood, Wis., has her father's Super Bowl I ring in a safety deposit box.\n\nFather's Day, as it always is, was a difficult day for Golding, who visited Aldridge's grave site at Wisconsin Memorial Park Cemetery in Brookfield, Wis.\n\n\"It's still tough,\" said Golding, 39, in an interview Monday afternoon. \"I found him (dead) in his apartment.\"\n\nGrowing up, Golding said she really never realized her father was famous.\n\n\"I was born in 1970, so I really didn't know how big the Packer football part of his life really was,\" she said. \"It wasn't until he was in broadcasting and people would stop us in the street and ask for his autograph that I understood it.\"\n\nGolding has her father's helmet, a 1966 oil painting of Aldridge in uniform and a photo of him reading a book to her as a child displayed in her living room.\n\n\"The funny thing is, I never thought to have my dad autograph the helmet,\" she said with a laugh. Her husband, Al, is a Chicago Bears' fan, a fact that never sat well with Lionel Aldridge. \"It makes the Packers-Bears games even more exciting around here. But my dad was never particularly fond of him - like anyone who would date his daughter. No one was ever good enough, especially a Bears fan.\"\n\nGolding said dealing with her dad's mental illness three decades ago was challenging enough, but magnified for someone in the public eye.\n\n\"Back at that time, mental illness was an embarrassing subject to talk about, to admit that someone in your family had it,\" Golding said. \"It was very tough for my mom and us because, like many people, at times my dad didn't think he needed to take his medication for his disease.\n\n\"We'd worry about him, and sometimes have to go find him and pick him up and bring him back home. And being an ex-Packer and broadcaster, everything he did was printed in the newspaper, so it was very difficult.\"\n\nGolding is most proud of the fact that her father helped bring awareness to mental illness and depression.\n\n\"I feel like he became a great spokesman and brought attention to it that helped other people and families dealing with mental illness,\" she said. \"At his funeral, people of all walks of life showed up. I heard so many stories about how he helped them.\"\n\nAldridge was over 400 pounds when he died of heart failure on Feb. 12, 1998, at age 56. More than 300 attended his funeral, including many of his former Packer teammates.\n\nJerry Kramer was one of them.\n\n\"Lionel was from Utah and I was from Idaho, so we're neighbors,\" Kramer said in an interview Sunday. \"I made it a point his rookie season to pump him up, to tell him he could do it. He became a starter, and I wanted him to succeed. We had won championships in 1961 and '62. So I tried to help him, encourage him and pump him up before games.\n\n\"His second season, I stopped being his cheerleader. I didn't think he needed me. . . . I thought with his size, strength and ability he was well on his way.\"\n\nKramer was unknowingly wrong. After both their playing careers were over, when Aldridge was in the broadcast booth, he asked Kramer a startling question.\n\n\"He said, 'How come you dumped me after my rookie year?' \" Kramer related.\n\n\"I said, 'What?' \"\n\n\"He said, 'You got me going, but then you stopped after that first season.' \"\n\n\"I said, 'I didn't think that you needed me anymore. You had it.' I didn't know if I had an impact and didn't want to be a pain in the (expletive) because he was doing fine.\"\n\nKramer visited Aldridge in 1985 when he found out from former defensive tackle Ron Kostelnik that Aldridge was back in Milwaukee after a long absence. Aldridge was working at the post office, sorting mail on the second shift.\n\n\"There was a lot of pain there for me, seeing him sorting mail,\" Kramer said. \"I know he was on the clock, but we sat down and talked. He told me stories about when he was in the streets, and one about paranoid schizophrenia.\n\n\"He had two friends that wanted him to go to the hospital. As a means of getting rid of them, he thought they were the ones who were sick. He went to the hospital but slipped out. He got a couple of blocks away before the cops got him. Then he began to realize, 'Maybe it is me.' \"\n\nKramer said Aldridge looked good and spoke lucidly, and said the two former teammates had a great conversation. \"It was like we were back in the locker room, giggling and laughing,\" Kramer said. \"I was just glad to see him, and that he was doing well.\n\n\"When I went to leave, he walked me to the elevator. As the doors were closing, he said, 'Love you.' \"\n\nAldridge had physical attributes - size, speed and strength - to be successful in the NFL. He had intelligence, a sense of humor and skill with the spoken word. He can thank his grandmother for the latter. As a boy, schoolmates teased him about his speech.\n\n\"Lionel came home crying one day and his grandmother began working with him on his vocabulary and grammar,\" Kramer said. \"He focused on that at a young age. He was a very polished man with a beautiful voice and a great command of words. Perfect for broadcasting.\"\n\nAldridge became interested in sports broadcasting in 1966, after he was approached by WTMJ-AM radio officials to audition for a job.\n\nHe also was coming into his prime as a key player for the talent-rich Packer defense. Aldridge played before the NFL kept official statistics on sacks and tackles, but he always had a nose for the ball and led the Packers in fumble recoveries with a career high of five in 1964 and two in 1966 (tied with five other players).\n\nThe postseason accolades and honors for the Green Bay defensive line were rightfully bestowed upon the left-side tandem of Davis and Henry Jordan, but Aldridge, a right end, warranted consideration for All-Pro and Pro Bowl recognition.\n\nHe would never receive any postseason honors. Aldridge was simply a very good player on some superb teams.\n\nAldridge remained a starter after the retirement of Lombardi, through Phil Bengtson from 1968-'70 and Dan Devine in 1971. He was traded to San Diego and played two seasons with the Chargers before retiring from the game in 1973.\n\nHe rose quickly in sports broadcasting from radio to television, and announced several Packer games in 1975 before signing with NBC as an commentator in 1976. Then his mental illness began to erode his family and career in the ensuing years. After working at the post office for several years, Aldridge supported himself with speaking engagements and as a spokesman for mental health.\n\nHis former wife, Vicky Nelson, said one of Aldridge's proudest moments was his induction into the Packers Hall of Fame in 1988. She said her former husband of 18 years and college sweetheart also has an award named in his honor by the National Organization for Mental Health in Milwaukee.\n\n\"Unfortunately, Lionel didn't get the help for his disease that is available now. No one knew much about mental illness in the 1960s and '70s,\" Nelson said. \"With many diseases, the person stays the same. Not with mental illness. It was very hard for Lionel. It was a process to figure out what was wrong with him and get him help. I'm proud that he helped so many other people. They saw that even a pro athlete can be mentally ill and that it's a disease.\"\n\nThe Lionel Aldridge file\n\nCollege: Utah State.\n\nPacker years: 1963-'71.\n\nPacker highlights: The only player to become a starter his rookie season under Vince Lombardi. A solid performer on defensive units that won three straight NFL championships and two Super Bowls. Inducted into Packers Hall of Fame in 1988. Played in 123 games in Green Bay.\n\nOther teams: San Diego Chargers, 1972-'73.\n\nJersey number: 82.\n\nBorn: Feb. 14, 1941.\n\nDied: Feb. 12, 1998, in Shorewood, Wis., at age 56.\n\nSend e-mail to martinwhendricks@yahoo.com"}, {"url": "https://www.findagrave.com/memorial/38961586/lionel-aldridge", "page_content": "\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n\n\n\n\nLionel Aldridge gained fame as a professional American football player for the Green Bay Packers in the 1960s. He holds the distinction of becoming a starter in his rookie year. The gruff Lombardi would not normally install a rookie as a starter. But the 250-pound Aldridge, who was 6 feet 5 inches, found his niche at right defensive end and anchored the position for nine seasons -- including championship campaigns in 1965, 1966 and 1967, when the Packers won three world titles, including the first two Super Bowls. In 1972 he was traded to the San Diego Chargers, where he played an additional two years.\n\n\n\nFrom outward appearances life after football began well, following his retirement from the National Football League in 1973, he became an analyst for the Packers and then for NBC.\n\n\n\nHe worked Super Bowl VII for the network following the 1973 season. But on the cusp of broadcasting stardom, he suffered the first of many bouts of depression that were to lead him to homelessness and then partial recovery as a speaker on mental health issues. He never completely overcame his difficulties.\n\n\n\nIn the late 1970's, he began to hallucinate. He had himself hospitalized and variously described his problems as schizophrenia or depression.\n\n\n\nAfter he was divorced from his wife, Mr. Aldridge disappeared from Milwaukee and became a drifter. There were days and months of lucidity when he was helped immensely by his medications.\n\n\n\nHe became a spokesman for a mental health organization in Milwaukee and traveled widely, discussing problems of the homeless with mental health professionals.\n\n\n\n"}, {"url": "https://www.pro-football-reference.com/players/A/AldrLi20.htm", "page_content": "Frequently Asked Questions\n\nWhen was Lionel Aldridge born?\n\nLionel Aldridge was born on February 14, 1941.\n\nWhere was Lionel Aldridge born?\n\nLionel Aldridge was born in Evergreen, LA.\n\nHow tall was Lionel Aldridge?\n\nLionel Aldridge was 6-3 (190 cm) tall.\n\nHow much did Lionel Aldridge weigh when playing?\n\nLionel Aldridge weighed 254 lbs (115 kg) when playing.\n\nIs Lionel Aldridge in the Hall of Fame?\n\nLionel Aldridge has not been elected into the Hall of Fame.\n\nHow many games did Lionel Aldridge play?\n\nLionel Aldridge played 147 games over his career.\n\nHow many sacks did Lionel Aldridge have?\n\nLionel Aldridge had 69.5 sacks over his career.\n\nHow many Super Bowls has Lionel Aldridge won?\n\nLionel Aldridge won 2 Super Bowls.\n\nWhen did Lionel Aldridge retire?\n\nLionel Aldridge last played in 1973."}], "The Packers were successful in the 1960s.": [{"url": "https://www.nytimes.com/2021/01/22/sports/football/green-bay-packers-1965.html", "page_content": "Reflecting on all the losses, Curry was surprised to realize that he had ascribed a superhuman quality to so many of these men, but the mind remembers what it wants to remember: Hornung, the playboy running back, so young and virile, zigzagging for touchdowns instead of suffering from dementia; Wood, the rangy free safety, picking off Len Dawson to fuel Green Bay’s rout of Kansas City in Super Bowl I instead of deteriorating as his cognitive functions declined; Davis, a fearsome pass rusher who never missed a game during his 10 seasons in Green Bay, dragging down quarterbacks instead of fading from kidney failure.\n\n“I guess if I had thought about it, or if somebody had warned me, I would have maybe protected myself,” Curry said. “But you begin to think of certain people, like Forrest Gregg or Bart Starr or Willie Davis, as indestructible. So when they die, it’s not like a regular death. It’s like a punch to the sternum. I mean, it drops you to your knees. No, no, he can’t be dead. Well, he is.”\n\nThe Packers’ president, Mark Murphy, added: “It’s like your parents. You never expect them to die.”\n\nThe immortals live on in video clips and in photographs, but what endures for their teammates is what makes their absences so much harder to bear: the intimate moments they shared, the ones that unfolded away from public view. From Wood, Robinson gleaned the importance of learning everyone’s assignment on defense, not just his own. Long still can’t fathom that Hornung once told him he’d be a superstar. Curry credits Davis with transforming his life.\n\nCurry, who called himself a “snot-nosed white kid” from outside Atlanta, had never played on an integrated team before joining the Packers, he said. Insecure, he worried how the team’s Black players would react to his Georgia accent. Instead, he was humbled by Wood’s kindness and how Davis, the defensive captain, promised to help Curry — the next to last pick in the 20-round draft — make the team.\n\nWhenever he felt like capitulating, his confidence frayed by Lombardi’s withering words, Curry ran to the defensive side to find Davis, whom he called Dr. Feelgood. With a smile, Davis told Curry to feel good, that he could do it."}, {"url": "https://www.britannica.com/topic/Green-Bay-Packers", "page_content": "Green Bay Packers, American professional football team based in Green Bay, Wisconsin. One of the most-storied franchises in the history of the sport, the Packers have won the most championships, 13 in total, of any National Football League (NFL) team.\n\n(Read Walter Camp’s 1903 Britannica essay on inventing American football.)\n\nBritannica Quiz Super Bowl Quiz\n\nIn 1919 Curly Lambeau and George Calhoun organized a group of men into a football team that soon managed a winning record against other amateur teams from Wisconsin, Michigan, and Minnesota. Lambeau, a shipping clerk for the Indian Packing Company, convinced his employer to donate money for the uniforms and, in the process, lent the nickname “Packers” to the team. With Lambeau serving as head coach and playing halfback, in 1921 the Packers entered the recently formed American Professional Football Association, which a year later would become the NFL. However, the team struggled with financial problems to the point of having to forfeit an entire season. In 1923 the team became a publicly owned nonprofit corporation supported by the people of Wisconsin and has remained so ever since.\n\nDespite their rough financial start, the Packers won three consecutive championships from 1929 to 1931, with lineups that were laden with future Hall of Famers, including tackle Cal Hubbard, guard Mike Michalske, and halfback John (“Blood”) McNally. In 1935 the team added Don Hutson, who proceeded to redefine the wide receiver position and helped the Packers win championships in 1936, 1939, and 1944. Lambeau—who stopped playing for the team in 1929—stepped away from head coaching duties in 1949, and the team struggled for wins throughout the next decade: the Packers posted a losing record seven times between 1950 and 1958.\n\nThe team’s most successful period was in the 1960s, under the legendary coach Vince Lombardi, who had been hired in 1959. Lombardi’s Packer teams in the ’60s were stocked with talent, boasting future Hall of Fame players on offense and defense: quarterback Bart Starr, fullback Jim Taylor, halfback Paul Hornung, tackle Forrest Gregg, linebacker Ray Nitschke, end Willie Davis, tackle Henry Jordan, cornerback Herb Adderley, and safety Willie Wood. They won championships in 1961 and 1962 and followed with three straight championships starting in the 1965–66 season. On January 15, 1967, in the inaugural Super Bowl, the Packers defeated the Kansas City Chiefs 35–10. They successfully defended their Super Bowl title the following year against the Oakland Raiders, 33–14.\n\nLombardi left the Packers after their second Super Bowl championship, and Green Bay entered into a long period of relative futility, with just two playoff appearances in the 25 seasons between 1968 and 1992. Some of the team’s scarce highlights during that period included the play of Hall of Fame wide receiver James Lofton, who starred for Green Bay from 1978 to 1986, and (ultimately unsuccessful) coaching stints by past Packers greats Starr and Gregg.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 1992 the Packers brought in head coach Mike Holmgren and quarterback Brett Favre, who were the key pieces in the team’s renaissance in the 1990s. Beginning in 1993, Green Bay qualified for the postseason in six straight years, including two NFC championships and subsequent trips to the Super Bowl. The team’s third Super Bowl appearance, in 1997, was a success: they defeated the New England Patriots 35–21. However, they did not repeat their win the following year against the Denver Broncos. After that loss Holmgren left the Packers for a job with the Seattle Seahawks, but the team remained a playoff contender into the 21st century. Favre acrimoniously left the Packers in 2008, and the Packers’ offense was given over to young star quarterback Aaron Rodgers.\n\nIn 2011 Rodgers guided the sixth-seeded Packers to three postseason road victories—including a win over their longtime rival the Chicago Bears in the NFC championship game—to earn a berth in Super Bowl XLV against the Pittsburgh Steelers, whom the Packers defeated to capture their fourth Super Bowl championship. The Packers won their first 13 games of the 2011 season en route to finishing the year with a 15–1 record. The team was a heavy favourite to win its second consecutive Super Bowl but was upset at home by the New York Giants in Green Bay’s first playoff game. The team returned to the NFC championship game following the 2014 season but lost in heartbreaking fashion to the Seattle Seahawks after the Packers held a 12-point lead with just over two minutes to play in regulation. The team was once again painfully eliminated from the postseason the following year when Rodgers led a thrilling 96-yard drive with under a minute left to tie a divisional playoff game against the Arizona Cardinals only to see Arizona win the contest just three plays into overtime. In 2016 Rodgers led the Packers to six straight wins to close out the regular season and win a division title. His strong play continued in the playoffs, where he guided the team to a surprising appearance in the NFC championship game (a loss to the Atlanta Falcons). Rodgers missed nine games of the 2017 season with a broken collarbone, and, without the team’s star quarterback for much of the season, Green Bay’s streak of eight consecutive postseason appearances ended. The Packers returned to the playoffs following a 2019 season in which they tied for the best record in the NFC at 13–3. The team won its home divisional game before losing to the San Francisco 49ers in the NFC championship game.\n\nFrom 1933 to 1994 the Packers elected to play some of their home games each year in Milwaukee to benefit from the larger market. Beginning in 1995, all home games were played at Lambeau Field in Green Bay, notwithstanding that city’s small size (it did not exceed 100,000 residents until 2000) compared with virtually all other cities that have NFL franchises."}, {"url": "https://www.profootballhof.com/teams/green-bay-packers/team-history/", "page_content": "Team History\n\nThe incredible saga of the Green Bay Packers began in August 1919, when the Indian Packing Company agreed to sponsor a local pro football team under the direction of Earl (Curly) Lambeau. In 1921, the Packers were granted a membership in the new National Football League.\n\nToday, they rank as the third oldest team in pro football. The long and storied history of the Green Bay team is one of struggle, until comparatively recent, for financial survival off the field and playing stability on the field. The Packers' record has been punctuated with periods of both the highest success and the deepest depths of defeat.\n\nMany great football players have performed for the Green Bay team but two coaches, Lambeau and Vince Lombardi, rank as the most dominant figures in the Packers' epic. Between the two, Lambeau and Lombardi brought the Packers 11 NFL championships, including two record strings of three straight titles, the first in 1929, 1930 and 1931 and the second in 1965, 1966 and 1967. Those last three championships completed the Packers' dynasty years in the 1960s, which began with Green Bay also winning NFL championships in 1961 and 1962. During the late 1930s and early 1940s, the Lambeau-led Packers were annual championship contenders. They won four divisional crowns and NFL titles in 1936, 1939 and 1944.\n\nIndividually, Lambeau, Lombardi and 20 long-time Packers players are enshrined in the Pro Football Hall of Fame. Hall of Fame players from the early years include Don Hutson, history's first great pass receiver, Arnie Herber, Clarke Hinkle, Cal Hubbard, John (Blood) McNally, Mike Michalske and Tony Canadeo. The great Packers elevens of the 1960s produced Jim Taylor, Forrest Gregg, Bart Starr, Ray Nitschke, Herb Adderley, Willie Davis, Jim Ringo, Paul Hornung, Willie Wood and Henry Jordan for the Hall. More recent Packers who've earned election to the Hall of Fame include wide receiver James Lofton, defensive lineman Reggie White and linebacker Dave Robinson.\n\nGreen Bay, home of the Packers, is still a city of less than 100,000 and is viewed as sort of a sports \"dinosaur\" as the only remaining small city in the big-city world of major league professional sports franchises. Green Bay is unique in another way -- the team is the only community-owned non-profit organization in the NFL. From 1937-1994 the Packers played their home games in two cities. Five of their eight home games were played in Green Bay's Lambeau Field and the remaining three at Milwaukee County Stadium in Milwaukee. Today the Packers play exclusively in Lambeau Field.\n\nThe Packers first played on a couple of small fields in Green Bay and then in 6,000-seat City Stadium beginning in 1925. Eventually, the City Stadium capacity reached 25,000. On September 29, 1957, the Packers dedicated a modern $1,000,000 stadium with a 32,150-seat capacity. Subsequent expansions and renovations have brought the Green Bay facility, officially named Lambeau Field in 1965, to its current capacity.\n\nOff the field, the Packers remain a financially sound, competitive and historically rich franchise. On the field the glory years are back. In 1996, the Packers returned to the top of the pro football world when they won Super Bowl XXXI. Green Bay won the Super Bowl for a fourth time in 2010 when the Packers defeated the Pittsburgh Steelers in Super Bowl XLV."}, {"url": "https://www.packers.com/news/the-1960s-packers-a-product-of-vince-lombardi-s-prejudice-free-culture", "page_content": "Less than a month later, in his first speech to his new team, Lombardi declared he would not tolerate players who harbored racial prejudices. He also had announced on the eve of camp that his first priority was to \"defeat the attitude of defeatism\" that was obviously prevalent following the Packers' 1-10-1 finish the previous year.\n\nTunnell had played on one NFL championship team, another that had lost in overtime in a title game and on only two losing teams, and Lombardi believed his leadership in the locker room would help him accomplish that goal.\n\nLombardi still considered Tunnell one of the best tacklers in the game even if he had lost some range and also ticketed him for starting duty. At a time when there were no Black assistant coaches in the league, it also was apparent to some players that Tunnell was basically a de facto assistant coach. In fact, when the season ended, Lombardi added Tunnell to his scouting staff – while still a player – and assigned him to cover the Black colleges in the South during spring practice.\n\n\"I'll never forget when Lombardi first got there, and we started training camp,\" Forrest Gregg said in a 2012 interview. \"Em called him, 'Vinnie.' I thought, 'Man, there has to be a connection here.' Nobody would dare call him by his first name. (Tunnell) had tremendous respect for (Lombardi) and it spilled over to us. Emlen was a wise old owl.\"\n\nIf there was any question about this close connection, it was erased when Lombardi also paid for Tunnell's room at the Northland Hotel, so he could reside in Green Bay's lone luxury hotel during the season.\n\nGradually, Lombardi acquired more Black players. When he won his second NFL title in 1962, he had five, including three starters on defense.\n\nThen came back-to-back second-place finishes climaxed by Lombardi's rant following a loss in the 1964 Runner-up Bowl – \"S--t Bowl\" was what he called it in team meetings – and informed his players he better not have to ever play again in this \"losers' bowl for losers.\"\n\nBetween April 1963 and May 1964, Lombardi also dumped his last three players who hadn't bought into his preaching about diversity.\n\nMyth has it that Lombardi traded future Hall of Fame center Jim Ringo because he brought an agent with him to Green Bay to negotiate his contract. But just as Lombardi had traded defensive end Bill Quinlan and safety John Symank a year earlier for their racial biases, he got rid of Ringo for the same reason.\n\nThe true story was that Pat Peppler, Lombardi's personnel director, handled the Ringo negotiations by phone. It was during the offseason and Ringo was living in Easton, Pa. What's more, in their last conversation, Peppler said Ringo repeatedly referred to Lombardi by an Italian epithet.\n\n\"I said (to Ringo), yeah, I'm going to run right in there and tell him you called him a (Italian epithet) son of a b----,\" Peppler said in a 2005 interview. \"Anyway, I went to Vince and told him I talked to Ringo, and he said give me $25,000 or trade me.\"\n\nBy the end of the day, Ringo was a member of the Philadelphia Eagles.\n\nA year earlier, Quinlan was traded only months after a drunken and racist rant at the team's hotel in Long Beach, Calif., where the Packers were preparing for their final regular-season game against the Rams in nearby Los Angeles. The disturbance occurred on the night that Quinlan learned fellow defensive end Willie Davis had been named to the Associated Press All-Pro team ahead of him.\n\n\"Quin went out and had quite a bit to drink, which he could do: 'Cutty Sarky' on the rocky,\" Jerry Kramer said in a 2012 interview. \"Broke curfew and came in like 2 in the morning.\"\n\nLombardi was ready to cut Quinlan the next day, but was talked out of it by defensive coach Phil Bengtson and some players who asked him to wait until after the NFL Championship Game.\n\nOne other point about Lombardi and his views on race. He also was unbending and outspoken about them with people besides his players.\n\nThose who have contended over the last year or so that nobody made a public issue of race back in the days of Lombardi are badly mistaken.\n\nIt was in the early 1960s when Lombardi informed restaurant and bar owners in Green Bay that if they didn't serve his Black players, he would put their establishments off limits to all of his players. In other words, he threatened them with a boycott, when having Packers as customers could be a magnet for even bigger crowds.\n\nAround the same time, Lombardi was also looking to pull the Packers out of exhibition games in the Deep South. In 1961, before their game against Washington in Columbus, Ga., Lombardi took his strongest stand yet to keep his team together.\n\nThe game's sponsors wanted both teams to arrive early and help promote the city's first professional football game. Washington agreed and flew into Muscogee County Airport six days before the game. It practiced in Columbus all week, providing the local newspapers with plenty of copy for daily stories leading up to the game.\n\nLombardi refused to comply because of the South's Jim Crow laws. The Packers flew into Lawson Army Airfield the day before the game, stayed together – whites and blacks – at the bachelor officers' quarters at Fort Benning, a U.S. Army post located almost 10 miles outside Columbus, and held a practice and clinic there for the doughboys. As a result, the game drew a disappointing crowd of 18,000, about 6,500 below capacity.\n\nAfter playing in Columbus and staying at Fort Benning again in 1962, Lombardi refused to approve a segregated seating plan at Memorial Stadium and canceled a third game in late July 1963. With Washington's approval, the game was moved on short notice to Cedar Rapids, Iowa.\n\nLombardi also stepped into Wisconsin's heated and prolonged political battle over a fair housing act. In 1960, when his Black players were having trouble finding places to live, Lombardi approached local real estate developer and human rights advocate Norman Miller in search of a solution to the problem. Both then worked together to get a fair housing bill passed in Wisconsin, despite fierce opposition from the real estate industry, Milwaukee-area Democrats and most Republicans.\n\nIn April 1965, prior to a Senate Judiciary Committee hearing, Lombardi submitted a written endorsement of the bill.\n\n\"On the football field or the baseball diamond, players are judged not on their race or religion but by their performance and this is as it should be,\" Lombardi wrote. \"Since I so firmly believe in equality of opportunity in athletics, I think the same degree of opportunity should prevail in other areas as well.\"\n\nThe committee voted 5-0 to reject what many considered a watered-down version of the bill that would have banned discrimination in the sale and rental of housing properties in Wisconsin. However, later that year, a bill finally passed with bipartisan support in the state Legislature and was signed by Republican Gov. Warren Knowles.\n\nIn the early stages of that political tug-of-war, Lombardi also told his players that he considered Packers fans to be hypocrites, only caring about them as football players.\n\n\"Lombardi was very bothered,\" Davis said in the book, \"Lombardi's Left Side.\" \"He said, 'It's just a shame that the people want and expect you to come and play, and the next minute they almost don't care enough to find a place for you (to live).'\"\n\nTwo years of playing in what Lombardi famously called \"a hinky-dink football game, held in a hinky-dink town, played by hinky-dink players\" didn't exactly endear him to the people of Miami, either. One local columnist there wrote that it would be a good thing if he never returned.\n\nHe didn't, not until his last game as Packers coach.\n\nHis retooled team with 13 Black players, including six starters on defense, made history by winning the second Super Bowl in Miami's Orange Bowl after winning the NFL Championship Game two weeks earlier at Lambeau Field. Not only was it Lombardi's third straight title, it also was his fifth in a decade, another feat no other franchise or coach has ever matched.\n\nAnd it was all because of Lombardi's unbiased judgment in picking his players.\n\nThere's no debating that his three-peat teams won largely because of their defense, a declaration repeated over and over by opposing coaches and players at the time.\n\nSome examples:\n\nCleveland quarterback Frank Ryan after the 1965 title game: \"That's the best defensive club we've faced in the last couple years.\" All-time great Jim Brown after that same game: \"Defense is their strong point.\"\n\nBaltimore Colts flanker Jimmy Orr after the Packers beat them to clinch the 1966 NFL Western Conference crown: \"They do it with that defense. They've got those linebackers and no one should have that much talent. They never do anything fancy, but they don't make mistakes. … Hell, their offense is worse than ours.\"\n\nOakland coach John Rauch after the second Super Bowl: \"Their strength is defense … They've lived off it all year. It's the backbone of the team.\"\n\nFrom 1965-67, the Packers ranked eighth, fourth and ninth in scoring compared to first, first and third in fewest points allowed. Offensively, they finished 12th, eighth and ninth in total yards; whereas, defensively, they ranked third, third and first in fewest yards allowed. Against the pass, they ranked No. 1 all three seasons. That was out of 14 teams in 1965, 15 in '66 and 16 in '67.\n\nIn 1967, in the eight-team Western Conference, five of the 11 starters on defense in the Pro Bowl were Packers and all five were Black: Davis, linebacker Dave Robinson, cornerbacks Herb Adderley and Bob Jeter, and safety Willie Wood. In fact, Davis, Adderley and Wood started for the West for the fourth straight year, while Adderley made his fourth start in five years and Robinson his second straight.\n\nThe only other Packers' defender to start in the Pro Bowl during their three-year reign as champions was linebacker Lee Roy Caffey after the 1965 season. At the time, the West team was selected by the conference coaches and the players who were selected almost always played in the game. The starters were selected by the West's head coach, who was usually the coach of the conference champion, after a week of practice.\n\nThe other Black starter on the Packers' defense during those years was Lionel Aldridge, Quinlan's replacement. While Aldridge never made the Pro Bowl, he proved to be a more complete end than Quinlan following a shaky rookie season.\n\nAs for the Packers' offense during that stretch, their only Pro Bowl starters were tackle Gregg after the 1966 and '67 seasons, and end Boyd Dowler and guard Kramer also after the '67 season.\n\nIn 1961, when Lombardi won his first title, there were roughly 30 Black players in the league and the Packers had two Black starters. By 1967, one-quarter of the players in the NFL were Black, according to the SI series, or more than 150. With 13 Black players on their 40-man roster, the total in Green Bay was just shy of 33 percent. Included were one other season-long Black starter on offense, tight end Marv Fleming, and also three backs who started or played important roles at different points of the season: Elijah Pitts, Travis Williams and Ben Wilson.\n\nThe Packers were clearly at the vanguard of this sea change.\n\n\"If you're black or white, you're a part of the family,\" Lombardi told Olsen. \"We make no issue over a man's color. I just won't tolerate anybody in this organization, coach or player, making it an issue. We respect every man's dignity, black or white.\""}, {"url": "https://www.liquisearch.com/history_of_the_green_bay_packers/lombardi_era_1959-1967", "page_content": "Lombardi Era (1959-1967)\n\nSeveral other factors helped the Packers return to success in the following decade. After Pete Rozelle became NFL Commissioner in 1960, he made sure that every franchise got all its games broadcast on television, as up to that point only big-market teams like the Bears and Giants enjoyed this privilege. TV helped raise revenue for small-market teams like Green Bay, and also because of the introduction of revenue sharing, which ensured that no NFL franchise would have to worry about bankruptcy.\n\nThe Lombardi era got off to a promising start when the Packers shut out Chicago on the 1959 opener, ultimately finishing 7-5 for their first winning record in 12 years. A 21-0 shutout of Washington on November 22 was the last Packers game to date that did not sell out.\n\nIn 1960, the Packers finished 8-4 and won their first division title since 1944. They also contested the championship game for the first time since that year against Philadelphia. The Eagles were playing on their home turf at Franklin Field however, and they won the championship game 17-14. It would be Vince Lombardi's only postseason loss.\n\nAfter an 11-3 record in the newly-expanded 14-game season, the Packers again won their division and went to the 1961 championship game, this time at New City Stadium. They shut out the Giants 27-0 for the team's first title since 1944 and their 7th total.\n\nThe Packers would do even better in 1962, winning 13 of 14 games, including 11 in a row. This included a rematch with the Eagles in Franklin Field. Green Bay avenged the 1960 championship game by snuffing their opponent 41-0 in a game widely referred to as \"Lombardi's Revenge\". It would be the last Packers victory in Philadelphia until 2010. They reached the championship game again, this time in Yankee Stadium. On a frigid December day, Green Bay ground down the Giants 16-7 to win a second straight title.\n\nA three-peat eluded Green Bay in 1963 as RB Paul Hornung was suspended by the league for betting on games. Without him, the team still finished 11-2-1, but was swept by the Bears, who won the division and ultimately the championship. The Packers were then forced into the embarrassing situation of having to go to Miami for the so-called \"Playoff Bowl\", an exhibition game the NFL held every January during 1960-69 between the second-place finishers of each conference. They beat Cleveland 40-23, but Vince Lombardi was not happy about it, calling the Playoff Bowl \"The Shit Bowl. A loser's game for losers. Because that's all second place is.\"\n\nThe Packers appeared to have run out of gas in 1964, winning only eight games, losing five, and having one tie. Once again they had to contest the meaningless Playoff Bowl in Miami, this time with the Cardinals, who won 24-17. Lombardi was again infuriated, calling it \"a rinky-dink game in a rinky-dink town between two rinky-dink teams.\"\n\nDuring the 1965 off-season, Curly Lambeau died and the Packers renamed New City Stadium Lambeau Field in his honor. The Packers rebounded by winning ten games and losing three, but the season ender with San Francisco was a tie, forcing them to play the Colts in Baltimore to determine the conference champion. In a close defensive struggle, the two teams tied at 10-10 and went into overtime, where Green Bay won it on a 25-yard FG. Afterwards, they returned home to host Cleveland for the championship games, winning it 23-12.\n\nThe Packers of the 1960s were one of the most dominant NFL teams of all time. Coach Vince Lombardi took over a last-place team in 1959 and built it into a juggernaut, winning five league championships over a seven-year span culminating with victories in the first two Super Bowls. During the Lombardi era, The Packers had a group of legendary stars: the offense was led by quarterback Bart Starr, Jim Taylor, Carroll Dale, Paul Hornung and Jerry Kramer; the defense was led by the likes of Willie Wood, Ray Nitschke, Dave Robinson, and Herb Adderley.\n\nThe greatness of the Packers of the '60s really began one year earlier with the hiring of head coach Vince Lombardi. In their first game under Lombardi on September 27, 1959, the Packers beat the heavily favored Chicago Bears at Lambeau Field. The Packers got off to a 3–0 start but lost the next five and then won their last four games to achieve their first winning season since 1947.\n\nThe next year, the Packers, led by Paul Hornung's 176 points, won the NFL West Title and played in the NFL Championship against the Philadelphia Eagles at Philadelphia. In a see-saw game the Packers trailed the Eagles by four points late in the game. The Packers began their final drive, aiming for glory, but it was not to be as Chuck Bednarik tackled Jim Taylor just nine yards short of the goal line as time ran out. In the locker room after the game, Lombardi told his men that this would be the last time the Packers would lose the championship game with him at the helm. That prediction became fact, as the Packers would never again lose the NFL Championship game under Lombardi.\n\nThe Packers returned to the NFL Championship game the following season, as they faced the New York Giants. This time the game was no contest as the Packers exploded for 24 2nd quarter points as Paul Hornung, having recently returned from the Army, scored an NFL Championship record 19 points as the Packers beat the Giants to win their first NFL Championship since 1944.\n\nNot resting on their 1961 Championship, the Packers stormed back the following season, jumping out to a 10–0 start en route to an amazing 13–1 season. The Packers faced the Giants in a much more brutal championship game than the previous year, but the Packers prevailed on the surprising foot of Jerry Kramer and the determined running of Jim Taylor. The Packers beat the Giants 16–7 and Titletown U.S.A. reigned supreme."}, {"url": "https://www.usatoday.com/story/sports/nfl/2019/10/18/a-look-at-the-nfl-in-the-1960s/40341727/", "page_content": "AP\n\nA look at the NFL's fifth decade, the 1960s:\n\nFRANCHISES\n\nThe 1960 NFL season was played with 13 clubs, with the expansion Dallas Cowboys joining the league that season and the Chicago Cardinals moving to St. Louis. The other teams were Cleveland, the New York Giants, Philadelphia, Pittsburgh, Washington, the Baltimore Colts, Chicago, Detroit, Green Bay, the Los Angeles Rams and San Francisco.\n\nThe Minnesota Vikings were an expansion team the following season, with the Atlanta Falcons joining in 1966 and New Orleans in 1967.\n\nThe AFL launched in 1960 with the Boston Patriots, Buffalo Bills, Houston Oilers, New York Titans, Denver Broncos, Dallas Texans, Oakland Raiders and Los Angeles Chargers. The Chargers moved to San Diego the following year, the Texans became the Kansas City Chiefs and Titans changed their name to the Jets in 1963, Miami was added in 1966 and Cincinnati in 1968.\n\nTOP TEAMS\n\nThe Packers were the dominant team of the 1960s, winning NFL championships in 1961, '62 and '65 and then winning the NFL titles and the first two Super Bowls against the AFL champion Kansas City in the 1966 season and Oakland in the 1967 season with a roster that included 12 Hall of Famer players and coach Vince Lombardi.\n\nThe tough luck team of the decade might have been the Baltimore Colts. They lost 13-10 in overtime to Green Bay in the 1965 playoffs when they had to play with halfback Tom Matte as the QB with Johnny Unitas and backup Gary Cuozzo injured. They tied for the best record in the league in 1967 when they went 11-1-2 but missed the playoffs when they lost a tiebreaker with the Rams. They were even better the following year despite losing Unitas to an injury in the preseason. Baltimore went 13-1 in the regular season, won the NFL title with a 34-0 victory over Cleveland but then lost the Super Bowl to the New York Jets in one of the biggest upsets ever.\n\nThe best AFL team might have been the Kansas City Chiefs in 1969. Overshadowed by the Jets, who won the Super Bowl the previous year, Hall of Fame coach Hank Stram's squad might have been even more dominant. The Chiefs featured eight Hall of Fame players on that team led by defensive standouts Buck Buchanan, Willie Lanier, Bobby Bell, Emmitt Thomas, Johnny Robinson and Curley Culp. Kansas City had the No. 1 defense in the AFL in terms of scoring, running and passing and allowed just 20 points in three playoff games. Hall of Fame quarterback Len Dawson led the offense and kicker Jan Stenerud also made it to Canton.\n\nThe other champions that decade in the NFL were Philadelphia (1960), Chicago (1963), Cleveland (1964) and Minnesota (1969).\n\nThe other AFL champions were Houston (1960-61), the Dallas Texans (1962), San Diego (1963), Buffalo (1964-65) and Kansas City (1969).\n\nTOP PLAYERS\n\nChargers receiver Lance Alworth was perhaps the AFL's greatest player after opting for the new league over the more established NFL in 1962. He topped 1,000 yards receiving in his final seven seasons in the AFL and led the league in receptions, yards and TD catches three times each during that span. His best season was in 1965 when he had 1,602 yards receiving and 14 TDs in a 14-game season, averaging 23.3 yards per catch. He was a first-team All-Pro selection in six straight seasons. He finished his career with 542 catches for 10,266 yards and 85 TDs in 137 games.\n\nUnitas emerged as a star in the late 1950s when he led Baltimore to the title in 1958 against the Giants. That success carried over into the next decade when he was the signature quarterback in the league. His 26,548 yards were the most by anyone in the NFL in the 1960s, he was the MVP in 1964 and '67 and was selected as a first-team All-Pro three times that in the decade.\n\nCleveland running back Jim Brown only played until 1965 but his impact in the first six years of the '60s was enough to make him perhaps the most dominant player in the NFL during that period. Brown led the NFL in rushing in all but one his nine seasons in the NFL and is the only player in league history to average more than 100 yards a game on the ground. He was MVP in 1963 and a first-team All-Pro in five of his six seasons in the decade. Brown's 12,312 yards rushing stood as the NFL record for nearly two decades after he retired and he would have had even more prolific numbers if he hadn't quit in 1966 because Browns owner Art Modell threatened to fine him for missing the start of training camp to finish filming \"The Dirty Dozen.\"\n\nRams defensive end Deacon Jones might have been the most feared player in the league after being drafted in the 14th round in 1961 out of South Carolina State. Jones harassed quarterbacks throughout his career and is widely credited with coining the term \"sack.\" While sacks wouldn't officially be counted for players until 1982, Pro Football Weekly estimated he had 173½ in 191 games. Jones was a first-team All-Pro for the final five seasons of the decade.\n\nTOP COACHES\n\nLombardi was so iconic that the league named the Super Bowl trophy after him. He won five titles in the 1960s with the Packers, including the first two Super Bowls. He never had a losing record in the NFL, winning 73% of his regular-season games and going 9-1 in the playoffs. Green Bay was known for its dominant running game that featured Paul Hornung running the \"Lombardi sweep.\"\n\nSid Gillman. The impact Gillman had on the game was immense as he is known as the father of the modern NFL passing game. He was one of the game's great offensive innovators with the Chargers in the AFL, known for his deep passing attack. He had only a .550 winning percentage and went 1-5 in the postseason, but his coaching tree is extensive, with greats such as Al Davis, Chuck Noll, Chuck Knox, Dick Vermeil, George Allen and Don Coryell all working underneath him over the years.\n\nTom Landry. Landry worked on the same staff on the New York Giants with Lombardi in the 1950s and was the original coach of the expansion Cowboys in 1960. Landry built that franchise from the ground up to challenge the Packers for NFL dominance at the end of the 1960s and the Cowboys later become known as \"America's Team.\" He was known for popularizing the 4-3 defensive formation and \"Doomsday Defense.\"\n\nMEMORABLE GAMES\n\nIce Bowl. The 1967 NFL championship game was one of the most famous in NFL history. It was a rematch of the title game the previous season when Green Bay won 34-27 in Dallas on the way to the first Super Bowl title. The game-time temperature was 15 degrees below zero with a wind chill of minus-48. Making matters even worse, the turf-heating system at Lambeau Field malfunctioned, turning the surface to ice. The Cowboys led late 17-14 late in regulation when Starr led from the Packers 32 to the 1. On third down with 16 seconds left and no timeouts remaining, Lombardi went for the win and Starr sneaked it in behind Jerry Kramer for the 21-17 victory.\n\nSuper Bowl III. The AFL and NFL announced a merger in 1966 to form a unified league starting in 1970. In the interim, the two champions would play in what would become known as the Super Bowl. The more established NFL won the first two title games relatively easily behind the Packers and the third one figured to be a mismatch as well between the upstart New York Jets of the AFL and the vaunted Baltimore Colts of the NFL. The Colts went into the game as 18-point favorites but Joe Namath famously \"guaranteed\" a New York win. The Jets dominated the game, rushing for 142 yards and forcing five turnovers to win 16-7 and establish the AFL teams as legitimate rivals to the NFL squads.\n\nGAME CHANGERS\n\nThe biggest change in the '60s was the launch of the AFL, which brought more high-powered offensive attacks to professional football in a style of play that still resonates today. The AFL aggressively challenged the NFL by signing several of the top college players and targeting NFL stars behind the leadership of Al Davis, who was the Raiders coach and then commissioner before the merger was announced. The AFL also cleared the way for more black players to enter the league by mining historically black colleges for talent that the NFL had long overlooked.\n\nPete Rozelle was elected commissioner of the NFL in 1960 and his leadership helped set the stage for the NFL becoming America's dominant sport. One of Rozelle's most lasting accomplishments came early in his tenure when he convinced big market teams such as the New York Giants and Chicago Bears to pool the league's national television rights, assuring that smaller markets such as Green Bay would get an equal share of the revenue. With the value of television rights skyrocketing in the ensuing years, that decision provided more equal footing between franchises and helped establish the parity that Rozelle believed was so crucial to the league's success.\n\nFUN FACT\n\nThe shotgun formation got its name in 1960 when coach Red Hickey brought it to the San Francisco 49ers with quarterback John Brodie. The Jets used it briefly with Joe Namath to ease the pressure on his injured knees. The formation didn't really reach popularity until a decade later when Landry used it in Dallas.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL"}, {"url": "https://packershistory.com/2021/03/the-green-bay-packers-infamous-lean-years-and-the-eras-40-best-players/", "page_content": "The “Lean Years” were a long and interesting time to be a fan of the, then, 11-time World Champion Green Bay Packers.\n\nTo this day, the players from those years simply don’t get the respect they deserve.\n\nSure, success eluded the Packers for quite some time following the Lombardi Era, but those years were anything but boring. This era as a whole is often overlooked, but it shouldn’t be. A franchise’s history is both the good and the bad — glossing over the pain ultimately diminishes the joys of the eventual highs.\n\nThere are many Packers fans of a certain age that lived through some or all of these infamous years. There isn’t exactly a consensus as to which years constitute the Lean Years, but if you ask us, we see Bart Starr’s retiring as the beginning of these trying times.\n\nDefine them as 1972-1991 or refer to them as 1968-1995, it doesn’t really change the fact that few victories were spread over many years. Ultimately, the Lean Years era can easily be referred to as the ‘after Bart Starr and before Brett Favre’ era.\n\nJust as the team’s “Wilderness” era of the 1950s can be described as ‘after Curly Lambeau and before Vince Lombardi.’\n\nOne by one the legends of the 1960s Packers retired and the team looked less and less like its formidable self.\n\nIt’s only when looking back that we know that 1972 was actually part of the Lean Years. In the early to mid-1970s the glow of the Lombardi years still kept the Titletown USA lit as a beacon of professional football dominance.\n\nHowever by the end of the 1970s that glow dimmed and had reality set in. Winning wasn’t inevitable anymore. The 1960s were just that, the 1960s. Glorious and eternal, but not to be replicated. The Pittsburgh Steelers were the new epicenter of the football universe.\n\nThings got so bad during the Lean Years that the Packers even drafted a future serial killer in wide receiver Randall Woodfield in 1974. He was cut before playing with the team, but it’s still shocking. And it just goes to show that when things are going bad, it can always get worse.\n\nAlso in 1974, the Packers traded five draft picks for six-time Pro Bowl quarterback John Hadl. It was a disaster as he was atrocious with the Packers. Perhaps it was the team around him, but that trade set the Packers back for years. And it should be mentioned that Hadl wasn’t the last quarterback to struggle mightily in Green Bay in this era.\n\nIt truly was an interesting time for the Green Bay Packers and their fans.\n\nBut the NFL in those years was quickly evolving. The Super Bowl was still a relatively new phenomenon and running backs were the undisputed kings of the league.\n\nHowever in 1978 the league expanded to a 16 game season, which it would keep through the 2020 season (for better or worse, 17 game seasons are starting this fall). With this came new rule changes that made the passing game easier and this eventually led to the pass-happy league we enjoy today. The characters in the 1970s and 80s grew larger and the game was marketed more with each season.\n\nThat was the national backdrop of the Packers’ sustained struggles.\n\nAlthough in some ways, the big changes to the league in late ’70s didn’t really affect Packers fans. By this point most fans were so down and were probably like, “we love you, we support you, but please just be competitive!”\n\nIt’s hard to fully care about every detail in the league when you absolutely know that a Super Bowl appearance isn’t an option. Plus, to many fans at the time, the new rule changes seemed to be called quite subjectively and the best players on the best teams seemed to get those calls. Is this actually how it was or a perceived slight? Does it really matter?\n\nAs you can see, the pain of the era wasn’t only felt out on the field, it was felt at home, too.\n\nOne of the hidden punishments of the Lean Years for all Packers fans was Monday Night Football halftime highlights. This might seem strange, but it’s true.\n\nMonday Night Football started in 1970 just as the Lean years were approaching. There was no ESPN and no sports talk shows to speak of besides the sportscast during the evening news.\n\nThe MNF halftime highlights were the place to see the great plays from the NFL’s games that week. Most of the highlights showed game-winning plays and winning teams, well, winning. Howard Cosell would call the highlights and Packers fans would be left hoping to see the Packers and their players featured but it rarely happened… for much of the ’70s and ’80s.\n\nIt’s hard to imagine that in today’s world of curated media and hyper-fan-focused content, but it was a different world. The modern NFL fan, at no fault of their own, probably doesn’t grasp the true cultural weight of Monday Night Football in its first three decades of existence.\n\nWhen The Pack returned to the playoffs in 1972 it was obviously a welcome sight for the fans — until the game started, that is. The Packers never had a chance and Washington ruled the day. No one, and we mean no one, would have believed it would be a decade before Green Bay visited the playoffs again.\n\nThe team recorded just one winning season in the rest of the decade. An 8-7-1 record in 1978 was as good as it got for the fans in those days.\n\nA far cry from the consistency the team has enjoyed these last three decades and the immeasurable success this franchise sustained in the 1960s.\n\nAs the 1980s unfolded it became clear to Packers fans that success, although never seeming far away, wasn’t going to come easily. The team didn’t see the postseason from 1973-1981 and just once from 1968-1981.\n\nIn 1982, the Packers finally won their first playoff games since the Lombardi Era. Of course it came during the ’82 strike-shortened season in which the Packers posted a 5-3-1 record. They defeated the St. Louis Cardinals 41-16 before losing to the Dallas Cowboys in the second round. Losing to Dallas in the postseason would become a bit of a habit in the following decade, but lets not get ahead of ourselves.\n\nThe following year was one of the most exciting seasons in Packers history — no really, it was. The 1983 season was turbulent and the team was skilled, but incredibly inconsistent. Five of the Packers’ games went into overtime, still an NFL record.\n\nIn that season Green Bay, famously, defeated Washington 48-47 on Monday Night Football. That was the highest-scoring MNF game in NFL history for 35 years until the 2018 season.\n\nThat team was close, but couldn’t quite get over the hump. Not even head coach, and living Packers legend, Bart Starr could bring the team back to prominence. Still, he was the best coach of the era for the Packers.\n\nHowever it was probably in the mid-1980s that the Lean Years got the hardest to swallow for Packers fans. Not only could the Packers not compete how the fans would have preferred, their ancient rival Chicago Bears began to dominate the league.\n\nThe ’85 Bears defense and running back Walter Payton were a lethal combination, especially for the Packers. Fans from Chicago still look back to those years as the best they’ve ever seen; they were the most fun team in the league in the mid-80s.\n\nAnd this was following the 1970s when the Minnesota Vikings dominated the Packers and most of the NFL, too. The Purple People Eaters were a historic force, making it to four Super Bowls (but winning none of them).\n\nThe Packers’ two main rivals found great success during the Packers’ Lean Years, and directly helped the Packers’ years stay so lean. The NFC Central or as it was commonly known as the Black and Blue Division was brutal in those days and the Packers took their lumps from all three of their historic rivals (Chicago, Minnesota and even Detroit).\n\nAll three teams had fantastic running backs and the Packers, despite repeatedly drafting running backs for 15 years in hopes of finding a star, couldn’t keep pace. Sure, Green Bay had one dominant running back in the early 1970s (he’s mentioned below), but after him the cupboard was bare when compared to their division opponents.\n\nThe Black and Blue division featured Vikings running back Chuck Foreman in the ’70s. He was a versatile pass-catching running back who twice led the NFL in touchdowns. Then the Bears got Walter Payton, who may be the best running back in NFL history. He’s at least at the center of the conversation.\n\nIf that wasn’t enough, the Lions drafted Billy Sims in 1980 and all he did was lead the NFL in rushing touchdowns (13) as a rookie with 16 total touchdowns on the year. He had a short, but dynamic career.\n\nThat year, 1980, the Packers’ top two backs (both are listed on the countdown; No. 25 and No. 23) combined for just eight rushing touchdowns. The Black and Blue division was all about the running back in those days and the Packers just couldn’t keep pace. The Tampa Bay Buccaneers, despite winning a couple division titles, couldn’t keep up either. The Bucs joined the NFC Central in 1977 and would remain in that division through the 2001 season.\n\nThe 1980s was, arguably, the roughest decade in Packers history for the fans.\n\nHowever as that decade came to an end it seemed like the Packers were on the right track. They had a young Pro Bowl quarterback (he’s listed below), but still, success kept its distance from the franchise.\n\nI’m sure as the calendar flipped to the new decade, the 1990s, many fans were questioning whether the small town Packers would ever be competitive again.\n\nIn 1992, the general manager Ron Wolf and the Packers made a trade that would set the tone for the next 30 years in Green Bay. A raw but incredibly talented quarterback, Brett Favre, took over the starting job after that other quarterback was injured. Favre, the franchise and the fans never looked back.\n\nFollowing that lone postseason win in 1982, the team didn’t make it back to the postseason until 1993 with Brett Favre. From 1968-1992 the Packers won just one playoff game.\n\nThat still boggles the mind.\n\nIt’s 2021 and it’s been an amazing 29 years since Favre won his first game as a Packer. The Packers have won 23 postseason games and two Super Bowls in that time span, obviously Favre’s successor Aaron Rodgers has had a large hand in that success.\n\nHowever the 29 years between Starr’s last Super Bowl appearance and Favre’s first super Bowl championship were, obviously, haunted by this franchise’s Lean Years. Those two decades from 1971-1991 were an appropriate payment for the incredible success the Packers enjoyed in the 1960s (when the NFL became the nation’s favorite sport) and again in the 1990s to the present day.\n\nYou have to accept the yin if you want to enjoy the yang, right?\n\nWe’ve written in the past about how it’s sometimes the pain that binds a fan base together more so than the success — perhaps it’s vital to have a healthy dose of both. The Lean Years gave that necessary balance to Packers fans, even to newer fans that look back upon the franchise’s history.\n\nTo a kid born in the 1990s, the Packers struggling is a foreign concept. But we hope that diving into the Lean Years not only helps them to understand it has happened, but that it will happen again.\n\nThe most amazing part of the Lean Years is the fact that the Packers sold out every home game despite not coming close to winning a title for a quarter century.\n\nThat can never be taken from Packers fans.\n\nThat’s a fan base that loves their team no matter what. That’s what being a Packers fan is. And these tough years were a chance for everyone to prove their loyalty to this team, so in a way we should be thankful for those days. The Packers can never be accused of having fair-weather fans.\n\nThe last great controversy of the Lean Years was the Packers drafting offensive tackle Tony Mandarich second overall in the 1989 NFL Draft. Troy Aikman was drafted first and Barry Sanders, Derrick Thomas and Deion Sanders were drafted third, fourth and fifth. All four of those guys are in the Hall of Fame. Tony, well… you know.\n\nBut that truly was the last notable failure of the era that Packers fans had to deal with.\n\nPerhaps the Lean Years actually ended the moment when the Packers signed free agent Reggie White in the first ever year of modern free agency in 1993. He and the NFLPA sued for the right to change teams and the judge ruled in favor of White and the other named plaintiffs.\n\nIt’s crazy to think of all of the things that had to happen for White to get to Green Bay and even kind of scary to think of what would have happened had he not ended up in Titletown.\n\nIn a way, having him opposite Brett Favre legitimized the Packers and set everything else in motion. They were the light at the end of the long, dark decades-long tunnel.\n\nAlright, that’s probably enough of the back story…\n\nLet’s dive into the best players from the Packers’ longest-sustained dark period in franchise history. Even though these teams didn’t win many games, it doesn’t mean that the team didn’t have some impressive talent suiting up.\n\nA quick honorable mention would be kicker Chris Jacke. He came to Green Bay as the Lean Years were coming to a close and his best seasons came while Favre was on the team. For this reason we wanted to mention him, but ultimately didn’t include him on this countdown.\n\nThe Packers’ Top 40 “Lean Years” Players:\n\nThe players most worthy of remembrance from an oft-ignored era of Packers football\n\n40. Phil Epps, WR, 1982-88:\n\nHis legacy is being a good, consistent receiver on a very bad team. In ’85 and ’86 he put up 600+ receiving yards and four touchdowns.\n\n39. Tom Flynn, S, 1984-86:\n\nA hard-nosed safety who had an explosive start to his career. In 1984 he intercepted a remarkable nine passes and recovered three fumbles. However he spent just two and a half years in Green Bay and just five years in the NFL.\n\n38. John Jefferson, WR, 1981-84:\n\nJefferson was simply a huge signing for the Packers in those days, but he just couldn’t match James Lofton or the sky-high expectations for him. He came to Green Bay following a First Team All-Pro season with the Chargers where he started his career with 36 touchdowns in his first 45 games. In Green Bay he, unfortunately, had just 11 touchdowns in 50 games.\n\n37. Brent Fullwood, FB, 1987-90:\n\nHe was the Packers’ savior ball carrier… until he wasn’t. Three straight 5+ touchdown seasons brought hope to the team before his career fizzled out.\n\n36. Terrell Middleton, RB, 1977-81:\n\nHe flashed his immense talent, but it just didn’t last. His Pro Bowl appearance in 1978 was well-deserved considering he put up 1400 total yards and 12 total touchdowns.\n\n35. Alphonso Carreker, DE, 1984-88:\n\nIn Carreker’s first 58 games with the Packers he put up 18.5 sacks. The man they called “Chubbs” couldn’t sustain his success, but for a few seasons he was playmaker.\n\n34. Jan Stenerud, K, 1980-83:\n\nAn aging Hall of Famer that played so well. In 1981 he led the NFL with a 91.7 field goal percentage. Stenerud brought a confidence and calmness to the special teams unit.\n\n33. Ron Hallstrom, G, 1982-92:\n\nHallstrom showed up every week seemed to always play his position well over his 11 years in Green Bay. In our eyes, he very much lived up to his first round pick pedigree.\n\n32. Steve Odom, WR-KR, 1974-79:\n\nOdom was a wide receiver, but is remembered for his punt and kick returning proficiency. He scored 15 total touchdowns in Green Bay, but again, is remembered for the kicks he ran back. The Pro Bowler in 1975 put up 1034 kick return yards that year. He was a weapon.\n\n31. Chuck Cecil, S, 1988-92:\n\nThe NFL’s changing rules took away Cecil’s game. He was one of the last of a dying breed of aggressive, intimidating safeties. Three times the tackling machine made 3+ interceptions in a single-season, including his final season in Green Bay in which he was awarded a spot on the NFC’s Pro Bowl squad.\n\n30. Don Majkowski, QB, 1987-92:\n\nHe was named Second Team All-Pro the year he led the NFL in passing yards (1989). But more importantly, “The Majik Man” is the NFL’s Wally Pipp.\n\n29. Ed West, TE, 1984-94:\n\nWest was a great blocker that also caught passes. His role was similar to Marcedes “Big Dog” Lewis on the current Packers. He spent 11 years with the Packers and caught 26 touchdowns. He’ll never get the credit he’s due.\n\n28. Robert Brown, DE, 1982-92:\n\nIt took Brown a few years to grow into a starting role with the packers, but he put together an incredibly consistent career. He was a bit of a fan-favorite despite never putting together an overly impressive season. Once he became a starter he didn’t miss a single start.\n\n27. Tim Lewis, CB, 1983-86:\n\nUnfortunately, Lewis kicked off the Packers’ career-ending neck injury curse. This curse would go on to end the careers of numerous Packers stars. And make no mistake, Lewis was a star in the making. He had 16 interceptions in his first three seasons and was becoming a leader on defense when his injury occurred. Oh what could have been.\n\n26. Brian Noble, LB, 1985-93:\n\nAt the time Noble wasn’t the most appreciated player on the Packers, but when it comes down to it, he was one of the best inside linebackers of the last 40 years in Green Bay.\n\n25. Eddie Lee Ivery, RB, 1979-86:\n\nHe was the star that Packers fans were waiting for, but it just never materialized. His second season in Green Bay was fantastic (1312 total yards), however he never returned to that level of production. Ivery formed a productive duo with the ball carrier ranked at No. 23 on this countdown.\n\n24. Bryce Paup, LB, 1990-94:\n\nA big-time rushing linebacker that went on to do even more great things once he left Green Bay. He’d probably be higher on this list if three years of his five year tenure in Green Bay didn’t overlap with Brett Favre on the team.\n\n23. Gerry Ellis, FB, 1980-86:\n\nSneaky tough, sneaky fast and he paired his 35 career touchdowns with three 1000 total yard seasons. He is, perhaps, best remembered for his 146 yard performance in the Green Bay’s epic 48-47 win over Washington on Monday Night Football in 1983.\n\n22. Mike McCoy, DT, 1970-76:\n\nAn incredible 13 times he got his hands on the ball, causing a turnover, in his seven years in Green Bay. For a defensive tackle, he played with definable skill. Unfortunately his teams didn’t do much.\n\n21. Mark Murphy, S, 1980-91:\n\nMurphy was paired with Chuck Cecil at safety and they formed, perhaps, the hardest hitting duo in the league. What Murphy lacked in speed he made up for in toughness. Five times he intercepted at least three interceptions in a single-season.\n\n20. Ken Ruettgers, T, 1985-96:\n\nRuettgers was the team’s starting left tackle for a decade as the team grew out of the Lean Years and became a champion again in 1996. He had impressive hands, too, and recovered 11 fumbles in his career. The Packers thought enough of him to give him No. 75. Another Packer tackle wore that number… his name was Forrest Gregg.\n\n19. Mark Lee, CB, 1980-90:\n\nJust a solid football player; little more needs to be said. If someone asked the average Packers fan to name all of the defensive backs to record 30+ interceptions in franchise history our guess would be that Lee would be left off most lists. The man had nine in 1986 alone!\n\n18. Mike Douglass, LB, 1978-85:\n\n“Mad Dog” was an outside linebacker that did a little bit of everything for the Packers during his tenure with the team. He could play in coverage, he could rush the passer and he was incredibly reliable. He was almost always on the field and should get some applause for staying healthy all of those years.\n\n17. Greg Koch, T, 1977-85:\n\nIf there is one word to define Greg Koch, it’s reliable. Once he became the starter in Green Bay he never missed more than one game in a single-season. He was instrumental in keeping his (virtually immobile) quarterback Lynn Dickey off of the ground.\n\n16. Tim Harris, LB, 1986-90:\n\nHarris had a short tenure in Green Bay, but wow was he effective. The description of “big time pass rusher” sells his talent short. At his short-lived peak, Harris might have been the best pass rushing linebacker in team history. With 19.5 sacks in a single-season he’s still the team’s all-time single-season leader in that category. He was, appropriately, named First Team All-Pro for his efforts.\n\nGo to Page 2 to see the Top 15 Packers of of the era!"}, {"url": "https://packershistory.com/2019/09/the-forgotten-decade-of-packers-history-the-1950s/", "page_content": "Many of the professional footballers of the decade were first tested a decade earlier in the Second World War. It was the days of America the rising superpower and the good old American boys juxtaposed with the slapstick ruthlessness of 1950s NFL football.\n\nThe 1950s was a decade of monumental football milestones in Green Bay. However if there’s one decade of Packers history that is particularly known for futility, it is those same 1950s. Some football historians have recalled when the team was more punchline than preeminent. Nothing was certain, on the field and off, and most fans today don’t think twice about any Packers players from those years.\n\nSome may believe, and even argue, the Packers couldn’t have had any real stars in the ‘50s because the team was so bad. How could they have?\n\nHowever there’s an argument that there actually is much to be celebrated within this forgotten decade of Packers football. No really, you just have to be willing to look for it. But no one said it would be easy.\n\nFor whatever reason every other decade of Packers football is attached to some type of firm narrative, whether exaggerated for not.\n\nThe 1920s were the decade when the Packers joined the NFL, jumping in way over their heads only to find unexpected greatness. The story has been told many times. The 1930s, and the four World Championships won, were when Green Bay started to become Titletown USA. The pride of a region swelled as a small town took on the world. The 1940s was the decade of offensive explosion and star power; Don Hutson, Tony Canadeo and so on. This franchise, it seemed, was destined to change football time and time again. The war was won and Green Bay had remained prosperous!\n\nThe 1960s are fabled and chronicled with precision, nothing more could be written or said about that decade for the Green Bay Packers and Vince Lombardi’s teams, and the many stories that accompany them, will still never be forgotten. Starr, Nitschke, Taylor… the list of transcendent players is too long to get into here.\n\nEven the 1970s and 1980s get lumped together collectively as the “Lean Years”, two decades blessed with a certain type of silly nostalgia, memorable moments, and relatively hilarious underachieving. Looking back, many consider those two decades as the necessary payment for the aforementioned 1960s and the upcoming prolonged success led by two future Hall of Fame quarterbacks.\n\nIn hindsight, the franchise so eloquently absorbed the pain of those years because it was sandwiched by such greatness.\n\nThe 1990s will always be about Brett Favre and the return to glory for this franchise. Reggie White chose Green Bay in newly-minted Free Agency and the rest is history. The Lombardi Trophy finally came home. The 2000s were a transition period from Favre to another all-time great quarterback in Aaron Rodgers. Few teams had ever been so blessed. The 2010s were a continuation of that success, although speckled with spectacular heartbreak and drama.\n\nNonetheless the team remained unquestionably viable on and off the field.\n\nThe 1950s though? Nothing really specific remains other than historians recalling that the team was the laughing stock of the league in those years. At least the “Lean Years” have ample video evidence to look back at and featured an exciting Hall of Fame wide receiver in James Lofton. No Packers players that played the majority of their NFL career in the 1950s are enshrined in the Pro Football Hall of Fame.\n\nInterestingly, the 1950s is the only era of Packers football that can be classified as “After Lambeau and before Lombardi”\n\nIt truly was the “Wilderness” that it’s been called by some. Perhaps that is the entirety of its legacy after all.\n\nStill the decade remains the most obscure deep cut of Packers history. It resides still as the one decade in Green Bay football history when the team failed to secure more than one winning season. In total, it featured seven losing seasons, including the franchise’s worst, 1958, when the team finished 1-10.\n\nIt shares the distinction with the 1980s as the only decades the Packers failed to win a division title. Although the ‘80s saw “just” four losing seasons in Green Bay. Plus fans were actually able to watch those games on television, somehow that just makes a difference. The decade isn’t as lost as the ‘50s.\n\nFour separate men stood on the sidelines as Head Coach for the Packers in the 1950s — the most in franchise history for a single decade. The instability was tangible. Just as precarious was the team’s financial future.\n\nCurly Lambeau, team co-founder, coach and larger than life figure, was gone as of 1949. Would the team survive? Would they get a new stadium to sustain the team? As the decade rolled on some wondered if they would ever have a winning season again. Something not enjoyed in Green Bay since 1947. Many figured the team would finally fold up; midnight was approaching for sport’s most famous Cinderella.\n\nThese were all legitimate questions for the 1950s Packers. The roster was not particularly skilled, but there were a few players with legacies, unfairly, overshadowed by the team’s collective failures.\n\nSome forget that Tony Canadeo, the Gray Ghost, played three years into the 1950s. The future Hall of Fame inductee scored nearly one-third of his career touchdowns in the decade despite his advancing age. It was in this decade that he truly turned into a receiving threat out of the backfield, as he adjusted his playing style for the modern era of football that was forthcoming. In fact, he made nearly 60% of his total receptions in these final three seasons. Not to mention his most productive season as a kick returner came in 1950.\n\nHe was one of the most complete football players in team history and the 1950s were an important part of that legacy, despite the team’s record in those years. Canadeo deserves recognition for his play in this frustrating decade of Packers history.\n\nHowever the “big five” from the 1950s, as far as sincerely dynamic Packers players, were Billy Howton, Bobby Dillon, Tobin Rote, Jim Ringo and Bill Forester. With a special nod to Dave Hanner, Max McGee, Roger Zatkoff and a few other players to be mentioned.\n\nBilly Howton and Bobby Dillon both joined the Packers in 1952 as 22 year old rookies and their careers were incredibly linked to one another, in terms of individual success, just on opposite sides of the ball. For years in practice they went up against each other with the ball in their air, honing their mirrored skills. Although because of their being on the hapless Packers of the 1950s, both were shamefully left of the the NFL’s 1950 All-Decade teams. Both were equally snubbed by the NFL back then and their legacies suffer to this day because of it.\n\nOne of the Best Pass Catchers in Team History:\n\nBilly Howton was one of the Packers’ most impactful wide receivers in team history, despite playing just seven seasons with the team. Of course, in his day his position was called “end.” In 1952, as a rookie, he led the entire league in receiving yards (1231) and yards per game (102.6). His yards per game mark is still elite in this franchise’s history books today. That translates to 1641 receiving yards in a 16 game season, which would be a Packers record.\n\nHis career yards per game (69.8) is third in Packers history behind just James Lofton and Sterling Sharpe.\n\nFour times he was named a Pro Bowler, twice he was named First Team All-Pro. In 1956 he’d again lead the NFL in receiving yards, but also led the league in receiving touchdowns (12). His 43 career receiving touchdowns in just 80 games as a Packer makes him more productive than Jordy Nelson on a per-game basis, who had Aaron Rodgers throwing him the ball.\n\nDon Hutson and Dillon are the only two receivers to ever lead the NFL in receiving yards more than once.\n\nHowever Howton truly was the Packers’ first true deep threat wide receiver. Hutson was better, mind you. He was an all-around elite receiver, a possession receiver that could catch deep balls whenever he wanted. But Howton genuinely was a threat to go deep on every play — yes, even more so than Hutson.\n\nFour times Howton averaged over 18 yards per reception for an entire season, in seven years in Green Bay. Something Pro Football Hall of Famer Hutson accomplished twice in his 11 seasons.\n\nThe three ends (or wide receivers) that made the NFL’s 1950’s All-Decade team were Raymond Berry, Tom Fears and Bobby Walston. Berry tallied 31 receiving touchdowns in the ‘50s. Fears posted 25 and Walston caught 40.\n\nHowton, left off the team, topped all of them with 44 receiving touchdowns in the 1950s — 43 with the Packers. The three ends that made the team combined for three seasons leading the NFL in receiving in the ‘50s. Howton accomplished that feat twice himself. The three ends that made the team posted two combined 10+ receiving touchdown seasons. Howtown had two 10+ receiving touchdown seasons on his own.\n\nNo doubt he was snubbed because of the team around him.\n\nThe Best Packers Defender You Know Nothing About:\n\nBobby Dillon, a safety that had to learn the position as the NFL became more of an aerial game, was one of the most awarded defensive backs in team history — despite having just one working eye.\n\nHe played just eight seasons with the Packers, just one more than Hotwon, and was named First Team All-Pro four times, to go along with four Pro Bowls.\n\nThree times Dillon intercepted at least nine passes in a season. No other Packer has ever accomplished that feat twice. Charles Woodson, Willie Wood and Herb Adderley combined for two such seasons in their Hall of Fame careers. Those nine interceptions translate to 12 over a 16 game season, which would be the most in team history.\n\nDillon, known cheekly as “The Hawk” still holds the Packers’ all-time interception record (52). Again, he only played eight seasons. He was just the second player in NFL history to ever hit the 50 interception plateau and should be remembered as one of the first ballhawks to play professional football.\n\nThree safeties were named to the NFL’s 1950 All-Decade team. Dillon was not one of those men. Emlen Tunnel deserved to be on that team without question, but Dillon had more career interceptions, and more interceptions in the 1950s, than both Jack Christiansen and Yale Lary, the other two safeties named to the team.\n\nLary himself had just 25 interceptions in the 1950s.\n\nDillon also had five interceptions returned for touchdowns in his career, which equalled Christiansen’s and Lary’s combined career totals. Not to mention his 976 interception return yards were significantly more than Christiansen and Lary amassed in their careers.\n\nDillon had five seasons with at least seven interceptions in the 1950s. Christiansen and Lary combined for five such seasons in the 1950s (six combined including the 1960s). In six consecutive seasons Dillon registered at least 110 interception return yards. By far the longest streak in Packers history.\n\nNo doubt he was snubbed because of the team around him.\n\nIn terms of Pro Football Hall of Fame, Dillon has a legitimate case to be in the hall. However he wouldn’t be the last safety in team history that, inexplicably, remains uninvited to Canton. See LeRoy Butler and the symmetry of their careers. Dillon and Butler were both named First Team All-Pro and Pro Bowlers four times. Both were instrumental in the development of the safety position.\n\nDillon was one of the first true ball-hawking safeties as modern football came to be. Butler was one of the first safeties to dominate at the line of scrimmage. Neither have gotten the recognition they deserve for their contributions to the position — with NFL debuts separated by 38 years. True to these proclamations, Dillon is still the only Packer with 50 interceptions and Butler is the only with 30 interceptions and 20 sacks to this day.\n\nHowever Christiansen and Lary, have both been inducted into the Hall of Fame.\n\nA Quarterback Season for the Ages:\n\nTobin Rote, the Packers’ quarterback from 1950-1956, led the NFL in passing yards once, passing touchdowns twice, completions twice and rating once during that span.\n\nBut he was most dangerous when he ran, culminating in 29 rushing touchdowns, 2205 rushing yards and a 5.3 yards per rush average — while leading the NFL in yards per rush in 1951.\n\nRote was either a nod to football’s running past or a nod to football’s future dual-threat quarterbacks. That determination is up for debate. Perhaps he was both.\n\nAll of his success in Green Bay led up to his final season as a Packer, 1956, when he was named to the Pro Bowl. His 1956 season may not seem monumental to most, but it was utterly historic. Only a few times in NFL history has a quarterback been so lethal through the air and on the ground in the same season.\n\nTobin Rote, 1956*: Led the NFL in passing touchdowns (18), passing yards (2203) and completions (146). Ran for 398 yards and 11 touchdowns. Named to Pro Bowl. *Season was only 12 games.\n\nLook how his best season stacks up all-time with the best ever dual-threat quarterback seasons:\n\nJohnny Lujack, 1950*: Did not lead NFL in any of the big three passing statistics, but threw for four touchdowns. Ran for 397 yards and 11 touchdowns. Named to Pro Bowl and First Team All-Pro. *Season was only 12 games.\n\nSteve Grogan, 1976*: Did not lead NFL in any of the big three passing statistics, but threw for 18 touchdowns. Ran for 397 yards and 12 touchdowns. Not named to Pro Bowl. *Season was only 14 games.\n\nRandall Cunningham, 1990: Did not lead NFL in any of the big three passing statistics, but threw for 30 touchdowns. Ran for 942 yards and five touchdowns. Named to Pro Bowl.\n\nSteve Young, 1994: Led NFL in passing touchdowns (35). Ran for 293 yards and seven touchdowns. Named to Pro Bowl, First Team All-Pro, AP MVP.\n\nKordell Stewart, 1997: Did not lead NFL in any of the big three passing statistics, but threw for 21 touchdowns. Ran for 476 and 11 touchdowns. Not named to Pro Bowl.\n\nDaunte Culpepper, 2000: Led NFL in passing touchdowns (33). Ran for 470 yards and seven touchdowns. Named to Pro Bowl.\n\nMichael Vick, 2010: Did not lead NFL in any of the big three passing statistics, but threw for 21 touchdowns. Ran for 676 yards and nine touchdowns. Named to Pro Bowl.\n\nRobert Griffin III, 2012: Did not lead NFL in any of the big three passing statistics, but threw for 20 touchdowns. Ran for 815 yards and seven touchdowns. Named to Pro Bowl.\n\nCam Newton, 2015: Did not lead NFL in any of the big three passing statistics, but threw for 35 touchdowns. Ran for 636 yards and 10 touchdowns. Named to Pro Bowl, First Team All-Pro, AP MVP.\n\nAaron Rodgers, 2016: Led NFL in passing touchdowns (40). Ran for 369 yards and four touchdowns. Named to Pro Bowl.\n\nRussell Wilson, 2017: Led NFL in passing touchdowns (34). Ran for 586 yards and three touchdowns. Named to Pro Bowl.\n\nAs of 2019, only seven quarterbacks had ever rushed for double-digit touchdowns in a single season (Newton twice).\n\nHonorable mention quarterbacks that could run: Steve McNair, Fran Tarkenton, Donovan McNabb, John Elway, Bobby Douglass, Jack Kemp, Colin Kaepernick and Billy Kilmer. None of these players were dominant at both throwing and running in a single season in a way that demanded inclusion on the above list.\n\nWatch for Lamar Jackson to be added to this list in the coming years…\n\nThis Fact:\n\nRote’s 1956 season is the only time in NFL history a quarterback has led the NFL in any of the three big passing statistics (touchdowns, yards or completions) and rush for 10+ touchdowns in the same season.\n\nAnd he not only led in one of those statistics, but all three in the same year that he ran for 11 touchdowns (1956). It was the first time it had ever happened and the feat hasn’t been replicated since.\n\nIt was, perhaps, the greatest dual threat season for any quarterback in NFL history. It’s right up there with Newton’s 2015 MVP season. Unlike Newton in 2015, Rote was the best statistical passer in 1956 and he still ran for one more touchdown than Newton did.\n\nIn 1956, just one player finished with more rushing touchdowns than Rote’s 11. In 2015, four players rushed for more touchdowns than Netwon’s 10. Remember, Rote played just 12 games in 1956 because NFL seasons were shorter back then. Over a 16 game season his 1956 stats translate to 531 rushing yards and 15 touchdowns, while still leading the NFL in passing yards, touchdowns and completions. His passing touchdowns rise to 24 if averaged out over a 16 game season.\n\nBut again, Newton had a very good team around him in 2015 and his team made it to the Super Bowl. Rote’s team was particularly bad and finished the season with a losing record, so he won’t get the respect he’s due. Just like Billy Howtown and Bobby Dillon.\n\nRote didn’t win MVP in 1956; he didn’t even get named First Team All-Pro despite leading the league in all of those stats.\n\nNoticing a trend here?\n\nIt’s likely no quarterback will ever again lead the league in passing touchdowns, yards, and completions while rushing for at least 10 touchdowns. That feat cannot be minimized.\n\nAnd he accomplished these feats while still wearing an old leather helmet. He’d later comment on how “cheap” the Packers of the 1950s were. He was tough, unafraid.\n\nBy the time Tobin Rote retired he was professional football’s all-time leading rushing quarterback. But statistically, his greatest accomplishments were, arguably, leading the NFL in passing touchdowns on two separate occasions. His legacy is interesting, but marred by the underwhelming records his teams sustained. Twice he guided the Packers to .500 seasons, the best it ever got for him in Green Bay.\n\nThings went a little better for the man that was snapping him the ball.\n\nThe Best Center in the Game:\n\nJim Ringo, known best for being Bart Starr’s center for the Packers’ first two World Championships of the Vince Lombardi Era, was Rote’s center first. For four years he snapped Rote the ball, including for the entirety of Rote’s historic 1956 season.\n\nInterestingly enough, the year Rote left Green Bay, 1957, would begin a stretch seven straight Pro Bowls for Ringo while he was with the Packers (seven of his 10 career Pro Bowl trips). Ringo was the best center in football, plainly put.\n\nThe first two of his six First Team All-Pro nominations came in the 1950s, but he’d ultimately be rewarded by finding a home on the NFL’s 1960s All-Decade Team. What should be remembered about Ringo, beyond his rings from the 1960s and his Hall of Fame status, is his excellence in the ‘50s.\n\nUltimately, an astonishing 19 men that played on those dynastical Packers teams of the 1960s went on to be named First Team All-Pro at some point. Ringo was the first of the group to gain that distinction, with his first nomination coming in 1957.\n\nHe set the tone for the Packers that would become a dynasty; in some ways that made him a leader on a team full of future Hall of Fame inductees.\n\nHe would go on to be named First Team All-Pro six times for Green Bay. Only two men have ever been awarded that honor more as Packers: Don Hutson and Forrest Gregg. Many have made “greatest of all-time” arguments for these two at their respective positions. Amazing to even think that Ringo could possibly be in that company, but all of that success was unquestionably born in the 1950s.\n\nLinebacker to be Remembered:\n\nBill Forester, like Ringo, saw his personal success of the 1950s morph into individual and team success in the 1960s. He isn’t the most often remembered of Lombardi’s linebackers, but he should be.\n\nIn 1959 he made his first of four consecutive Pro Bowls, in 1960 he was named First Team All-Pro and would be again in ‘61 and ‘62. That individual achievement, and league-wide respect as a player, came when the Packers started to be more competitive. He won World Championships in ‘61 and ‘62 and then, as a player, was finally considered one of the best at his position.\n\nCurious of how much more he’d have been respected, and how much more awarded he’d have been, in the 1950s had the Packers been better.\n\nConsider this, he registered four interceptions in three consecutive seasons from 1955-57, a Packers record for any non-defensive back that remains intact to this day. And that was when they played just 12 games a season.\n\nHis best statistical seasons came in those three years, 1955-57, when he amassed 17 total takeaways, but he went awardless. In his three First Team All-Pro years, when the Packers were winning championships, he registered “just” six takeaways, but still took home the awards.\n\nTeam success directly impacts individual awards and legacy. This is what hurts the few bright spots of the 1950s Packers.\n\nAmazingly, Forester is the only linebacker in Packers history to be named First Team All-Pro at least three times, another record he holds.\n\nForester’s short-lived partner at linebacker, Roger Zatkoff, also joined the Packers in 1953.\n\nActually, a Linebacker Duo to be Remembered:\n\nFor just four seasons Zatkoff, with Forester, patrolled the the Packers’ defense. He too was named First Team All-Pro, with his nomination coming in 1955. Three times named a Pro Bowler, in just four seasons. In those same four seasons he created 10 turnovers.\n\nThose two were, for that short time period, one of the best linebacker duos in team history. But no one seems to give them credit. In 1955 alone the two accounted for seven interceptions. That equals Hall of Fame duo Ray Nitschke and Dave Robinson’s best combined total (from 1965 and ‘66).\n\nA few of other men deserve attention, notably Dave Hanner, Max McGee and John Martinkovic.\n\nHanner was, arguably, the team’s most consistent player of the 1950s. He started every game from 1953 through 1959. His back-to-back Pro Bowl appearances in 1953-54 are a rarity for an interior defensive lineman in Packers history. And his 13 career turnovers created are second-most all-time in franchise history for a defensive tackle (second to his Lombardi Era, future Hall of Fame Inductee, teammate Jordan Henry).\n\nFor what it’s worth Sporting News named him First Team All-Conference in 1957 and ‘59.\n\nMax McGee is a folk-hero that lives inside the mind of everyone that’s read the books or watched the old highlights of Lombardi’s two Super Bowl teams.\n\nHe famously caught the first touchdown in Super Bowl history, after coming off the bench, supposedly hungover, due to starter Boyd Dowler’s injured shoulder. He added another touchdown later in the game. But, to the surprise of some, he was no a stranger to the end zone throughout his career.\n\nMcGee finished his career with a whopping 50 touchdown receptions — 22 of them coming in the 1950s. Including his career high of nine coming as a rookie in 1954. Although his 1959 season, in which he led the NFL in yards per reception (23.2), may have been his best year of football.\n\nHe would had scored more in the ‘50s, but his Air Force service required him to miss the 1956-57 seasons. Maybe the Packers would have won a few more games, too. It should be noted that he served as the team’s primary punter in three separate seasons in the ‘50s, twice leading the league in total punt yardage.\n\nOf all the fabled skill players of the Lombardi Era, McGee was the first to arrive in Green Bay. He was the grizzled veteran, but–true to his laid-back nature–set aside his ego for team success.\n\nJohn Martinkovic, a defensive end for the Packers in the mid-1950s, is one of the most overlooked pass rushers in team history. Unfortunately, he played just six seasons in Green Bay, but it’s easy to say he made the most of it.\n\nFrom 1953-55 he was elected to the Pro Bowl in each season. That gives him the distinction of joining Willie Davis and Reggie White as the only defensive ends in team history to be invited to the Pro Bowl in three consecutive seasons. But because of the poor record of the team he played on, his name isn’t usually recalled when chronicling the Packers’ best ever defensive linemen — if recalled at all.\n\nHe recovered at least one fumble during each season he played in the NFL, including when he scooped one up for a touchdown in 1952. So he did have a nose for the ball.\n\nIt should be noted, when combing through the best Packers players of the 1950s, that legendary safety Emlen Tunnell spent three years with the Packers beginning in 1959. That ‘59 season is noteworthy because it was the final Pro Bowl appearance of his unbelievable Hall of Fame career.\n\nOther 1950s Players Worthy of Mention:\n\nTwo-way player Deral Teteak should be mentioned, as he played for the Packers from 1952-1956 and was an above average player at both guard and linebacker. He was a local kid, but didn’t get to enjoy the success with the Green Bay Packers that he grew up witnessing. He was one of the last true two-way players to wear the green and gold.\n\nFullback Howie Ferguson had a 1955 season worthy of remembrance, in which he amassed 859 yards on the ground with an impressive 4.5 yards per rush. His final season in Green Bay, 1958, was fullback Jim Taylor’s rookie season and, looking back, it makes sense that Ferguson moved on at the year’s end.\n\nEnd Gary Knafelc and halfback Breezy Reid had some success for the Packers, but lineman Dick “The Bruiser” Afflis was perhaps the most interesting character. His career was short lived due to injury, but he was regarded as the strongest player of the team when healthy. He would go on to become a highly-successful professional wrestler and was once quoted as saying those Packers squads of the early 1950s would drink and dance all night.\n\nTheir win-loss records do not dispute that claim.\n\nA few other players from the 1950s had good seasons, but none that demand specific attention. Indeed, it truly was just a small handful of players, spaced out throughout a decade, that tried but couldn’t carry the team to the next level.\n\nThe story, or legacy, of the 1950s Packers is that of a few individual stars that didn’t quite have enough around them to get the team back to a competitive level. But those stars were dominant and if the Packers had a more complete team and they had battled for championships, some of them would have been more seriously considered for the Pro Football Hall of Fame.\n\nNo, do not say this decade did not have star players. Say instead that this decade let those stars down.\n\nPerhaps because it was the era in between Lambeau and Lombardi, that alone, is the reason the teams couldn’t rally behind their star players. Clearly the Packers’ different coaches of the decade couldn’t get the most out of the rest of the roster.\n\nMaybe if a Lambeau or Lombardi been there then Howtown, Dillion, Rote, Ringo, Forester and the others would have been able to propel this team to national relevance, in the 1950s, once again.\n\nBut one thing is certain, the “Wilderness” wasn’t an era of completely lost Packers teams. There were star players that should still be celebrated today. There are names that should be remembered and accomplishments worthy of enshrinement. Some literally, others figuratively.\n\nIn all, it was a decade of necessary struggle, a decade of pain… but ultimately growth.\n\nGrowth in more ways than one, as Bob Mann broke the Packers’ color barrier in 1950. He was the first black man (not the first minority) to ever play for Green Bay. In 1951 he led the team in receiving, including an impressive eight touchdowns good enough for third in the NFL. But his importance to the team, the city, the league and the country were much larger than his statistics.\n\nGrowth indeed.\n\nNew City Stadium, later to be named Lambeau Field, debuted in 1957. Vice President Richard Nixon, James Arness of Gunsmoke, and current Miss America Marilyn Van Derbur all were there to celebrate the moment. The stadium is more revered today and will likely forever be the home of the Packers. The stadium grew Green Bay’s football culture immeasurably; another feather in this decade’s cap.\n\nThe franchise was saved.\n\nHowever the Packers’ overall record in the 1950s was 39-79-2. You could have added two wins to every Packers season in the 1950s and they still wouldn’t have ended the decade with a winning record. Yet they were still interesting — somehow.\n\nThe Foundation of Historic Success:\n\nThe 1950s were the calm before the proverbial storm of the Packers returning to glory. The team did get its new stadium, and financial security, and in 1959 the Packers brought in soon-to-be legendary Head Coach Vince Lombardi. The Packers went 7-5 in his first year, saving the franchise from posting zero winning seasons in the 1950s.\n\nBut more important than that season is the list of players brought to Green Bay in the 1950s.\n\nA decade that has been largely forgotten, stealthy became the foundation of the NFL’s most dominant dynasty in the 1960s. All of the following men first donned green and gold, at some point, in the 1950s — mostly late in the decade.\n\nBart Starr, Forrest Gregg, Ray Nitschke, Jim Taylor, Paul Hornung, Jerry Kramer, Jim Ringo and Henry Jordan. All are in the Pro Football Hall of Fame.\n\nFuzzy Thurston, Boyd Dowler, Jesse Whittenton, Bob Skoronski, Ron Kramer and as detailed, Bill Forester, Dave Hanner and Max McGee were all major contributors to this team’s dynasty as well.\n\nWhen looking at the Packers’ list of World Championships today, with the five that came under Lombardi’s control, it’s easy to say “thank God for these 16 players.”\n\nBut what could just as easily be said instead is, “thank God for the 1950s.”\n\nWho would have thought?"}, {"url": "https://www.profootballhof.com/news/2010/01/news-nfl-s-all-decade-team-of-the-1960s-defense/", "page_content": "The National Football League's All-Decade Teams have been determined by the Pro Football Hall of Fame’s Selection Committee.\n\n\n\n1920s | 1930s | 1940s | 1950s | 1960s | 1970s | 1980s | 1990s | 2000s\n\n\n\n\n\nThe popularity of professional football exploded across the country during the 1960s with great expansion occurring throughout the decade. By 1965, a Harris Poll determined that pro football was this nation’s favorite sport. It has remained that way ever since.\n\nThe decade began with the birth of a rival league, the American Football League and ended with the two leagues coming together following a merger agreement that was signed in the summer of 1966. That deal brought about the Super Bowl, a joint draft, and ultimately a merged league starting in 1970. It also brought about the naming of not only annual All-AFL and All-NFL teams but an overall “All-Pro” team for the last three seasons of the 1960s.\n\nWhen it came time for the All-Decade Team, the AFL named its All-Time team (see 50 Years After below) using members of the Hall of Fame’s Selection Committee who represented each of the AFL's clubs cities.\n\n\n\nThe entire Hall of Fame Selection Committee picked the All-Decade Team of the 1960s that included five players who had been named by the same committee a year earlier to the NFL’s 50th Anniversary All-Time Team.\n\n50 Years After\n\nThroughout the 2009 NFL Season, Profootballhof.com profiled the American Football League in an online exhibit called 50 Years After. The features were part of the AFL’s 50th Anniversary Season celebration. Included in the special section was a rundown on the AFL's All-Time Team - OFFENSE | DEFENSE\n\n\n\nNFL's ALL-DECADE TEAM OF THE 1960s\n\n\n\n\n\nOFFENSE | DEFENSE\n\n\n\n\n\nENDS\n\n\n\nDOUG ATKINS\n\nCollege: Tennessee\n\nPro Career: 1953-54 Cleveland Browns, 1955-1966 Chicago Bears, 1967-69 New Orleans Saints. HOF: 1982\n\nAt 6’8”, 257 pounds, Atkins was one of the largest players of his era and as such, wreaked havoc against opposing NFL quarterbacks. His speed and agility often allowed him to leap over blockers while on constant pursuit of the ball carrier. He was an eight-time Pro Bowl pick.\n\n\n\nWILLIE DAVIS\n\nCollege: Grambling\n\nPro Career: 1958-59 Cleveland Browns, 1960-69 Green Bay Packers. HOF: 1981\n\nDavis was a defensive lineman who was blessed with three rare attributes – speed, agility and size. On top of that he had the intangible skills of leadership, intelligence and dedication. In his ten seasons with the Packers he was an all-league selection five times. He recovered an incredible 21 opponents fumbles during his career.\n\nDAVID (DEACON) JONES\n\nCollege: Mississippi Vocational; South Carolina State.\n\nPro Career: 1961-1971 Los Angeles Rams, 1972-73 San Diego Chargers, 1974 Washington Redskins. HOF: 1980\n\nAlthough he was a defensive lineman, some would argue that he was the fastest player in the National Football League. This speed allowed him to become perhaps the most feared pass rusher of all-time. Credited with coining the term \"sack,” he was a two-time choice for Defensive Player of the Year.\n\nTACKLES\n\n\n\n{GALLERY}ALEX KARRAS\n\nCollege: Iowa\n\nPro Career: 1958-1962, 1964-1970 Detroit Lions\n\nAlthough he is perhaps better known as a television and movie actor, Karras first gained fame as a dominating defensive tackle in the NFL. The 1957 Outland Trophy winner as the country’s best collegiate lineman, he easily made the transition to the pro game and was All-NFL selection by his third season. Karras, who was selected to four Bowls, was a first- or second-team All-NFL choice nine times in his 12-year career.\n\nBOB LILLY\n\nCollege: Texas Christian\n\nPro Career: 1961-1974 Dallas Cowboys. HOF: 1980\n\nLilly, a consensus All-America in college, was the first-ever draft pick of the Dallas Cowboys. Over the next 14 years, he became known as “Mr. Cowboy.” He took the league by storm when he won Rookie of the Year honors in 1961. His success continued when he earned All-NFL honors for six consecutive years (1964-69). An 11-time Pro Bowl selection, he became the Cowboys first-ever Hall of Famer in 1980.\n\nMERLIN OLSEN\n\nCollege: Utah State\n\nPro Career: 1962-1976 Los Angeles Rams. HOF: 1982\n\nOlsen, an All-America selection and Outland Trophy winner, was the Rams first round draft pick in 1962. He found success quickly as he won Rookie of the Year honors. Two seasons later he was named to his first All-NFL team, an honor he would earn five more times during his career. Extremely durable, he played in a total of 208 games.\n\nLINEBACKERS\n\n\n\nDICK BUTKUS\n\nCollege: Illinois\n\nPro Career: 1965-1973 Chicago Bears. HOF: 1979\n\nMention Dick Butkus’ name to an offensive player who played in the 1960s and most instinctively cower in fear. This was deservedly so, Butkus had an insatiable drive of meanness, pursuit, and tackling ability. He had the rare ability to cover sideline to sideline and played every game as if it where his last. Although he had a comparatively short career, the seven time all-league selection and eight-time Pro Bowl pick is considered one of the best ever.\n\nLARRY MORRIS\n\nCollege: Georgia Tech\n\nPro Career: 1955-57 Los Angeles Rams, 1959-1965 Chicago Bears, 1966 Atlanta Falcons\n\nMorris, an All-America selection out of Georgia Tech, was one of the most consistent linebackers in the National Football League as well as one of the most aggressive. He played a vital role in the Bears 1963 NFL Championship victory over the New York Giants. In the game he intercepted a Y.A. Tittle pass which he returned for 61 yards.\n\nRAY NITSCHKE\n\nCollege: Illinois\n\nPro Career: 1958-1972 Green Bay Packers. HOF: 1978\n\nWhen the Green Bay Packers were racking up multiple championships in the 1960s, Nitchske was a large reason why the team dominated. One of the most respected defenders in the NFL, he was one of the hardest hitters in the league. As rugged as he was, he possessed great speed, fast enough to intercept 25 passes during his career. He was a three-time all-league selection.\n\nTOMMY NOBIS\n\nCollege: Texas\n\nPro Career: 1966-1976 Atlanta Falcons\n\nNobis, an All-America at Texas, was the Atlanta Falcons first-ever draft pick. He became an immediate star but suffered from the lack of talent around him. Despite this lack of support, Nobis earned All-NFL honors in only his second season. A relentless player who gave 110 percent on every play, he earned Pro Bowl honors five times during his 11-year career.\n\nDAVE ROBINSON\n\nCollege: Penn State\n\nPro Career: 1963-1972 Green Bay Packers, 1973-74 Washington Redskins\n\nRobinson was an All-America end when the Packers drafted him in the first round of the 1963 NFL Draft. He was quickly converted to linebacker when Vince Lombardi noticed he was fast enough to cover receivers in pass coverage, with tremendous size and toughness. Robinson always seemed to have a knack for making big plays in the biggest games. He was a three-time Pro Bowl pick during his career.\n\nCORNERBACKS\n\n\n\nHERB ADDERLEY\n\nCollege: Michigan State\n\nPro Career: 1961-69 Green Bay Packers, 1970-72 Dallas Cowboys. HOF: 1980\n\nAdderley was the Packers first round selection in 1961 and immediately took charge in the team’s defensive backfield. A four-time all-league selection, he intercepted a total of 48 passes during his career, returning them for 1,046 yards and seven TDs. Selected to play in five Pro Bowls, he also served as the Packers kickoff return man and averaged 25.7 yards on 120 returns.\n\nLEM BARNEY\n\nCollege: Jackson State\n\nPro Career: 1967-1977 Detroit Lions. HOF: 1992\n\nAlthough relatively unknown when he joined Lions as a second round pick in 1967, Barney made a name for himself when he earned Rookie of the Year honors after recording a league-leading 10 interceptions, three of which were returned for TDs. Over the next 11 years, he would log 56 interceptions for 1,312 yards and seven TDs. The seven-time Pro Bowler also served as the team’s punt and kickoff return man and briefly as the Lions’ punter for two seasons.\n\nBOBBY BOYD\n\nCollege: Oklahoma\n\nPro Career: 1960-68 Baltimore Colts\n\nBoyd was the definition of a ball hawk during his nine-year career with the Colts. Only twice did he fail to intercept at least six passes in a season. He led the NFL in interceptions in 1965 with nine and totaled 57 steals for 994 yards and 4 TDs at the end his career.\n\nSAFETIES\n\n\n\nEDDIE MEADOR\n\nCollege: Arkansas Tech\n\nPro Career: 1959-1970 Los Angeles Rams\n\nAs a seventh round pick from a small school in the 1959 draft, not many people knew of Eddie Meador. By the end of his 12-year career, most quarterbacks and receivers were glad to see him go. With 46 career interceptions he had a strong nose for the ball, but Meador was also a vicious open-field tackler. He was a six-time Pro Bowl selection during his career.\n\nLARRY WILSON\n\nCollege: Utah\n\nPro Career: 1960-1972 St. Louis Cardinals. HOF: 1978\n\nWilson deservedly earned the reputation of being the toughest player in the NFL during his 13-year career. Many times he ignored nagging injuries and broken bones to remain on the playing field. A seven-time all-league choice and eight-time Pro Bowl pick, Wilson intercepted 52 passes during his career. He is credited with popularizing the safety-blitz.\n\nWILLIE WOOD\n\nCollege: Southern California\n\nPro Career: 1960-1971 Green Bay Packers. HOF: 1989\n\nWood was a quarterback in college who made a successful transition to the defensive side of the ball with the Packers. By his second season he was a full-time starter. A six-time All-NFL selection and eight-time Pro Bowler, he had 48 career interceptions and led the league with nine picks in 1962.\n\nPUNTER\n\n\n\nDON CHANDLER\n\nCollege: Florida\n\nPro Career: 1956-1964 New York Giants, 1965-67 Green Bay Packers\n\nChandler was one of the elite punters in pro football during his playing days. During his 12-season career, only once did he average less than 40 yards per punt in a single year. The one year he did not attain the 40-yard mark was his final season in which he only had one punt. By then he was used more as just the team’s kicker. In 1957 he led the NFL in punting average and in 1963 he led the league in scoring."}, {"url": "https://clutchpoints.com/the-best-green-bay-packers-team-in-franchise-history", "page_content": "The Green Bay Packers have had a lot of elite teams since they were founded back in 1919 by Curly Lambeau. In the last couple of decades, the Packers have found a lot of success, but there were also some teams during the 1960s that were elite.\n\nIn thinking of the best Packers team in history, we will go back all the way back to 1962. Not only was the 1962 team the best team in Packers history, but they were also one of the best teams in NFL history. Vince Lombardi was in charge of the Packers and the team played their home games at City Stadium and Milwaukee County Stadium.\n\nThe Packers finished the regular season with a 7-0 record at home and 6-1 on the road. The Packers opened up their season with a 34-7 victory against the Minnesota Vikings. In that game, the Packers intercepted future Hall of Fame quarterback Fran Tarkenton five times.\n\nThe Packers followed that win up with back-to-back shutouts against the St. Louis Cardinals and Chicago Bears. In Week 4, the Packers had a real test against the Detroit Lions. The Packers only offense came on three made field goals, but the defense stepped up in a big way again by giving up only seven points in the victory.\n\nIn Week 5, it was another blowout win against the Vikings, followed up by a 31-13 win over the San Francisco 49ers. Against the Baltimore Colts in Week 7, the defense stepped up in a big way again and only gave up six points.\n\nIn Week 8, the offense put up 38 points against the Bears, and in Week 9, it was 49 points put up against the Philadelphia Eagles that came in yet another easy win.\n\nLive and breathe the NFL? 🚨 Get viral NFL graphics, memes, rumors and trending news delivered right to your inbox with the Clutch Newsletter. SUBSCRIBE NOW 🔥\n\nThe Baltimore Colts gave them quite the test in Week 10, but the Packers were able to come away with a 17-13 victory. Week 11 was the only blemish on the schedule that season. The defense gave up 26 points against the Lions – the most they gave up all season – and that led to a loss.\n\nThey took out some of their anger the next week against the Los Angeles Rams, putting up 41 points in a victory. They closed out the regular season with a win over the 49ers and Rams.\n\nThe Packers finished two games above the Lions, which clinched a spot in the NFL Championship Game against the New York Giants. In that game, quarterback Bart Starr only threw for 85 yards, but the Packers defense gave up only gave up seven points, which led them to the title.\n\nThe 1962 Packers team had a lot of impressive individual and team accomplishments. As a team, the Packers led the NFL in scoring, putting up 415 points on the year. Starr was the league's passing leader, Jim Taylor was the rushing leader, and Willie Wood was the interception leader.\n\nRay Nitschke was the star of the defense, but he wasn't the only playmaker on that side of the ball. Overall, the Packers had 11 players on the team that would eventually make it into the Hall of Fame.\n\nThe success and the talent of that team are enough to name the 1962 Packers team the best in team history."}]}