{"Irena Sendler was a nurse.": [{"url": "https://www.biography.com/activist/irena-sendler", "page_content": "(1910-2008)\n\nWho Was Irena Sendler?\n\nWhen the Nazis invaded in 1939, Irena Sendler was a social worker and so had access to the Warsaw Ghetto, where hundreds of thousands of Jews were imprisoned. As a member of Żegota (aka Konrad Żegota Committee, the Council to Aid Jews), she helped rescue 2,500 Jewish children from the ghetto. For her courageous actions during the Holocaust, in 1965, Israel’s Yad Vashem honored her as “Righteous Among the Nations.” Sendler died in Warsaw in 2008.\n\nEarly Life\n\nSendler was born Irena Krzyżanowska on February 15, 1910, in Otwock, Poland. Her parents were members of the Polish Socialist Party, and her father, Stanisław Krzyżanowski was a medical doctor who died of typhus when Sendler was a child. In 1931 Sendler married Mieczysław Sendler, and the couple moved to Warsaw before the outbreak of World War II.\n\nWarsaw Ghetto\n\nIn Warsaw, Sendler became a social worker, overseeing the city’s “canteens,” which provided assistance to people in need. When the Nazis invaded Poland in 1939, Sendler and her colleagues also used the canteens to provide medicine, clothing and other necessities to the city’s persecuted Jewish population.\n\nIn 1940, the Nazis forced Warsaw’s more than 400,000 Jewish residents into a small locked ghetto area, where thousands died every month from disease and starvation. As a social worker, Sendler was able to enter the ghetto regularly to help the residents and soon joined Żegota, the Council to Aid Jews. Putting themselves at great risk, she and about two dozen of her colleagues set out to save as many Jewish children as possible from death in the ghetto or deportation to concentration camps.\n\nŻegota began by saving Jewish orphans. They had several ways of smuggling them out of the ghetto: Some were carried out in caskets or potato sacks; others left in ambulances or snuck out through underground tunnels. Still others entered the Jewish side of a Catholic church that straddled the ghetto boundary and left on the other side with new identities. Sendler then helped place the children at convents or with non-Jewish families.\n\nAs the situation became more dire for the ghetto’s inhabitants, Sendler went beyond rescuing orphans and began asking parents to let her try to get their children to safety. Although she couldn’t guarantee the children’s survival, she could tell parents that their children would at least have a chance. Sendler kept detailed records and lists of the children she helped buried in a jar. Her plan was to reunite the rescued children and their parents after the war. However, most of the parents did not survive.\n\nOn October 20, 1943, the Nazis arrested Sendler and sent her to Pawiak Prison. There they tortured her, trying to get her to reveal the names of her associates. She refused and was sentenced to death. However, Żegota members bribed the prison guards, and Sendler was released in February 1944.\n\nSendler continued her work until the war ended, by which time she and her colleagues had rescued some 2,500 children. It has been estimated that Sendler personally saved about 400.\n\nPersonal Life\n\nAfter the war, Sendler’s first marriage ended in divorce. In 1947 she married Stefan Zgrzembski, with whom she had three children, daughter Janka, and sons Andrzej (who died in infancy) and Adam. After the death of Zgrzembski, Sendler remarried her first husband, Mieczysław Sendler, but their reunion didn't last and they again divorced.\n\nHonors and Awards\n\nIn 1965, Yad Vashem, Israel’s Holocaust memorial organization, named Sendler as Righteous Among the Nations for her work saving Jewish children. In 2003, Poland honored her with its Order of the White Eagle. In 2008, Sendler was nominated for (but did not win) a Nobel Peace Prize. The story of her life was also captured in a 2009 TV movie The Courageous Heart of Irena Sendler, which starred Anna Paquin in the title role.\n\nDeath\n\nSendler died on May 12, 2008, in Warsaw, Poland, at the age of 98.\n\nQUICK FACTS\n\nBirth Year: 1910\n\nBirth date: February 15, 1910\n\nBirth City: Otwock\n\nBirth Country: Poland\n\nGender: Female\n\nBest Known For: Irena Sendler was a Polish social worker who, during World War II, helped to rescue 2,500 Jewish children from the Warsaw Ghetto, and placed them in convents or with non-Jewish families.\n\nAstrological Sign: Aquarius\n\nDeath Year: 2008\n\nDeath date: May 12, 2008\n\nDeath City: Warsaw\n\nDeath Country: Poland\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.holocaustmatters.org/irena-sendler/", "page_content": "Irena Sendler was a Polish social worker, nurse, and director of the children’s department for the Council for Aid to Jews, Zegota (an underground resistance group during WWII). She has been recognized by Yad Vashem as a Righteous Among the Nations, and awarded the Jan Karski for Valor and Courage.\n\nTo say the least, Irena Sendler is an inspiring humanitarian with a fascinating life story; her incredible courage and bravery saving the lives of many Jewish people throughout WWII. In this piece, we will be exploring the life of this influential figure, and her part to play during the Holocaust.\n\nFor more information on the Holocaust, and other influential figures throughout it, please click here.\n\nEarly Life\n\nBorn in Warsaw on the 15th of February 1910, Irena Sendler (or Irena Kryzyzanowski at the time) was the daughter of Janina and Dr Stanislaw Kryzyzanowski. Although born in Warsaw, Irena grew up in a town near the city called Otwock, and was an only child.\n\nHer father (Dr Stanislaw Kryzyzanowski) died from typhus, which he contracted whilst treating patients, when Irena was only seven years old. Stanislaw, although dying when Irena was very young, had a profound impact on the life values she carried throughout her life, claiming that through her father “I was taught that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.”\n\nAfter Stanislaw’s death, many leaders in the Jewish community helped to fund Irena’s education, which lead her to study at Warsaw University in Polish Literature.\n\nDuring her time at university, Irena disagreed with the ghetto bench system that had already been established in some of the universities prior to the war. In reaction to this, she vandalised her grade card and was consequently put on a three year-long suspension from the university.\n\nThis was not the last of Irena’s protests against Jewish discrimination, but rather the beginning to her humanitarian career, fighting for the lives of Jewish people throughout the Holocaust.\n\nHow Did Irena Sendler Help During the War?\n\nEven in the very beginnings of WWII, as the Germans invaded Irena’s birthplace of Warsaw, she started to help the city’s Jews, providing them with food and water. However, once the ghetto was built within the city this cut off Irena’s access to those who needed her aid. She then started to plan out another way in which to help.\n\nOnce the Warsaw Ghetto was established in the year 1940, Irena then started to smuggle out orphaned children. She used her status as a social worker, in addition to documentation from an employee at the Contagious Disease (who also became a part of the underground group Zegota) to gain access into the Warsaw Ghetto, and access to the orphaned children who lived in it.\n\nAfter the underground Polish resistance group for the Provisional Committee for Aid to Jews (Zegota) was established in 1942. Irena was soon appointed as head of its children’s division. During her position with Zegota, Irena and her team helped to rescue around 2,500 Jewish children from the Warsaw Ghetto. There were four main ways in which Irena’s team would smuggle out children from the ghetto, these being as follows:\n\nSmuggled through an old courthouse next to the ghetto.\n\nEscape through underground passages such as the sewer.\n\nHide in a luggage bag and then carried out by a trolley.\n\nVia ambulance; hidden under stretchers, faking illness or genuinely being ill.\n\nThose rescued were sent to numerous different orphanages and religious institutions that took in vulnerable children. Irena used her contacts with these places to smuggle the children in under false names. Some of the main places these children were smuggled into included the Rodzina Marii Orphanage, and religious institutions in and around Chotomow, Turkowice and Lublin.\n\nWhy Was Irena Sendler Imprisoned?\n\nOn the 20th of October 1943, Irena was arrested, and sent to Piawiak prison. During her time in imprisonment she was tortured for information on the other members of Zegota, and Irena fed the interrogators false information. Irena was then sentenced to death, however did not fulfil this sentence as her fellow Zegota members bribed workers in the prison to let her escape.\n\nThe day after Irena’s escape, Nazi officials interestingly announced that she had been shot, with posters with this false news dotted all around Warsaw. Irena was in hiding throughout the rest of the war, and once over, started to try and connect the children she had saved with their parents. Unfortunately, nearly all of these parents had been killed during the holocaust.\n\nLater Life\n\nWhen the war was over, Irena carried on her career as a social worker. She received numerous awards for her outstanding bravery and courage; these included the previously mentioned Yad Vashem’s Righteous Among the Nations, and Jan Karski’s Valor and Courage. In addition to these, Irena was also awarded Poland’s Order of the White Eagle, and has been a nominee for the Nobel Peace Prize.\n\nIrena then spent the latter part of her life cared for in Warsaw by a woman called Elzbieta Ficowska. Eizbieta was one of the children (six months old at the time) Irena had smuggled out of city’s ghetto.\n\nIrena has remarked on her actions during the war, stating that “We who were rescuing children re not some kind of heroes. That term irritates me greatly. The opposite is true – I continue to have qualms of conscience that I did so little. I could have done more. This regret will follow me to my death.”"}, {"url": "https://www.neh.gov/article/irena-sendler-and-girls-kansas", "page_content": "Between 1942 and 1943, Sendler and her network of 10 compatriots rescued 2,500 Jewish children from the Warsaw ghetto. Disguised as an infection-control nurse, Sendler knocked on doors in the ghetto, asking parents and grandparents to give up their children and grandchildren so that she could smuggle them out. Each child was given a new Polish name and forged identity papers and hidden in foster homes, orphanages, or convents. Sendler insisted that lists of the children be kept, documenting their Jewish and Polish names, so that after the war they would know their original identities. She hid the lists in milk jars that were buried in the backyard of one of her co-conspirators.\n\nPhoto caption A young Irena Sendler, in Warsaw, circa 1930. — AF Fotografie / Alamy Stock Photo\n\nAfter the war, Poland’s Communist government persecuted members of Poland’s wartime resistance, Zegota, of which Sendler was a part. They were harassed, interrogated, imprisoned, and even executed. Sendler and others who rescued Jews during the war kept silent. Almost no one knew of Sendler and her heroism.\n\nShe would have remained an unsung hero were it not for three teenage American girls who discovered her forgotten story 60 years later. Liz, Megan, and Sabrina, who began as students of history for a National History Day competition, became recorders of history, championing Sendler’s legacy in Poland, the U.S., and around the world. Three teenagers from rural Kansas helped crack open the silence about the Holocaust in Poland.\n\nMy first brush with this story came in the winter of 2001, in my Middlebury, Vermont, pediatric office, while going through my mail. This was before the electronic health record, and I daily triaged a prodigious stack of paper. Everything had about three seconds to be kept, filed, recycled, or thrown away.\n\nI am a member of the U.S. Holocaust Memorial Museum (USHMM). Each year I send a contribution, and they send me a calendar highlighting 12 monthly Holocaust heroes. As I quickly flipped through, I was brought up short by the November entry. It was the photo that stopped me—a young Irena Sendler, twenty-nine years old, who looked a lot like my niece. I read the short paragraph below the photo:\n\nIrena Sendlerowa, (1916–UNKNOWN) As head of the children’s division of Zegota, the Polish underground Council for Aid to Jews, social worker Irena Sendlerowa (code name “Jolanta”) helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their Jewish names and placements so that surviving relatives could find them after the war. Arrested by the Gestapo in the fall of 1943, Sendlerowa was sentenced to death. Zegota rescued her before her execution. She assumed a new identity and continued her work for Zegota.\n\nI was stunned. I’m a child of Holocaust survivors. How could I not know Irena Sendler’s story? Everybody knows Oskar Schindler, who rescued 1,100 Jews from a German concentration camp in Poland and whose story was told in the Steven Spielberg film Schindler’s List. Even at the USHMM, the preeminent scholars of the Holocaust didn’t know much about Sendler. They had her birth year wrong (it was 1910, I later found out), and they didn’t know if she was still alive.\n\nI kept this calendar in a file labeled “Interesting Stuff.” And there it sat for almost three years.\n\nPhoto caption These children rescued by Sendler were sent to live with new identities at a Polish convent, circa 1943. — World History Archive / Alamy Stock Photo\n\nThen, in February 2004, I came into my office one night to see a sick child. On my desk someone had left a copy of the Ladies Home Journal, opened to an article, “The Woman Who Loved Children.” It was about Irena Sendler and three Kansas teens who uncovered her story. The article explained that, in 1999, while planning a National History Day project, they found a brief reference to Sendler in a U.S. News and World Report article entitled “The Other Schindlers.” Sendler’s story inspired their NHD project: a play they wrote and performed called Life in a Jar. It retold, in dramatic form, the emotional story of Sendler knocking on ghetto doors and asking Jewish parents to give up their children to save them. The title, Life in a Jar, refers to the lists Sendler buried.\n\nThe teens read that Irena had been arrested in 1943 by the Gestapo and tortured in Pawiak Prison, the most notorious prison in the ghetto, from which almost no one escaped. Logically, they began searching cemetery records and reached out to the Jewish Foundation for the Righteous, seeking information about where she might be buried. Soon after, they received a letter from the foundation, saying that Sendler was alive! She was in her nineties and living in poverty with her daughter-in-law in Warsaw. The foundation then put them in touch with Sendler.\n\nThe three students made plans to travel to Poland and meet Sendler, first trying to raise money through candy sales, until philanthropists and Holocaust survivors from the Kansas City Jewish community stepped in to help cover the trip. Traveling out of the country for the first time (the first time on a plane for one of them), the girls finally met Sendler at her Warsaw home in 2001. They maintained a tender friendship with her for the next seven years until she passed, making several trips to Poland to visit her, each time performing Life in a Jar at various venues. And they began working with Polish high school students who were telling the forgotten stories of rescuers from their own communities.\n\nPhoto caption The original three students—Liz,Megan, and Sabrina—are joined by Jessica Shelton-Ripper (third from left), who performed many times with Life in a Jar. Here they visit the Irena Sendler exhibit at the Lowell Milken Center for Unsung Heroes in Fort Scott, Kansas, in 2018. — Kenny Felt\n\nAs I read the Ladies Home Journal article, I remembered the USHMM calendar. This story now took on a new dimension. I have been a closet writer most of my life, and I was thinking about writing a novella about the Warsaw ghetto. Irena Sendler seemed like a compelling character, and I wanted to know more about her. I was also intrigued by the two stories—Irena’s wartime history and the contemporary story of three Kansas teens. I called their teacher in Kansas, Norm Conard.\n\n“It’s serendipitous that you should call,” he said. “We’re looking for someone to write these two stories.”\n\nI hesitated. I had not written nonfiction before, only fiction and poetry. But I felt the powerful synergy of these two stories. I was not eager to write a wartime history of a Holocaust hero because most Holocaust literature leaves me angry, sad, depressed, and frustrated. But this story was different—an inspiring story of three typical American teenagers who helped restore the history of a great hero.\n\nI agreed to write the story and, in 2004, visited Uniontown, Kansas, where the girls went to school. A small town with a population of 264, it was down on its luck. Many stores were shuttered. It had the look of a Dorothea Lange or Walker Evans black-and-white photo from the Depression. I met Norm and the girls at the high school, and I was hooked.\n\nUniontown High School, with only about 120 students, is one of the lowest-income school districts in Kansas. There was no diversity in the school—never a Jew, an African American, or even a Catholic—yet these teens had discovered Sendler’s story and told the world. I spent a week interviewing the students, their families, their teacher, community members, and Holocaust survivors from Kansas City who had taken a great interest in the play and the Irena Sendler project.\n\nMy wife and I accompanied the students and Conard to Poland on their third visit, in 2005. I was able to do more extensive research and interview Sendler, Holocaust scholars, and some of the children Sendler had rescued, now in their sixties and seventies. We met Elzbieta Ficowska, rescued as a six-month-old infant. Sendler had sedated her and put her in a carpenter’s box. Her parents kissed their baby good-bye and left a small spoon in the box with her name inscribed on one side and her birthdate on the other. It is the only memento of her parents, who were murdered at Treblinka. She and I have become good friends, and I have held her spoon many times, always with tears. Ficowska became one of Sendler’s caregivers and the chairperson of the Association of Children of the Holocaust in Poland.\n\nIt was Sendler’s ninety-fifth birthday when I interviewed her. She was energetic, and her memory was clear and specific. She wanted to be sure that I credited all of her network of rescuers and liaisons. She ensured that I had everyone’s name spelled correctly.\n\nPhoto caption Megan took this picture of Sendler on May 3, 2008, during a visit to Poland. Sendler passed away nine days later on May 12. — Megan Felt\n\nPoland was arguably the most victimized country in occupied Europe. The consequence for hiding or even feeding a Jew was execution, often in public as a warning to other Poles. When I asked Sendler why she put herself and her family at such risk, she said, “It was a need of my heart.” She rejected the appellation of hero. “I only did what any decent person would do. . . . The heroes were the babies—they were the heroes of their mothers’ hearts. . . . It was the parents and grandparents who gave up their children, they were the true heroes.”\n\nShe said it was her father’s teaching that inspired her. “If you see someone drowning you must rescue them, even if you cannot swim.” And “there are only two kinds of people in the world, good and bad, regardless of race, religion, or creed. And most people are good.”\n\nShe lamented that she had not done enough—for every child they saved almost one hundred went to their deaths at Treblinka.\n\nSendler has become a Polish national hero. Poles have been eager to tell their stories, in part because the Life in a Jar project stimulated Polish/Jewish dialog as well as scholarship about Poland during the German occupation. Although there has been a disturbing return of anti-Semitism and Holocaust denial in Poland, Sendler’s story continues to be told.\n\nYad Vashem, the World Holocaust Remembrance Center in Jerusalem, recognizes more Righteous Gentiles—those who rescued out of principle, not for personal gain—from Poland than from any other country in occupied Europe. In 2019, it listed 27,362 Righteous Gentiles, with 6,992 from Poland, or around 26 percent. But because of postwar Poland’s Communist anti-Semitism, Polish rescuers who had received Yad Vashem medals hid them and told no one of their wartime activities.\n\nAt one performance of Life in a Jar in Warsaw, I sat beside an old man, old enough to have been an adult during the war. Throughout the performance he sat with his hands together, clutching something inside. After the performance I asked him about it, and he opened his hands to reveal his Yad Vashem medal. There were tears in his eyes as he explained, “I have kept this buried in my basement for 60 years. I told no one except my wife. I didn’t tell my children, family, friends, or coworkers. Now, because of these American students, I can show this proudly. It was the finest thing I have ever done.”\n\nMy first time in Warsaw, in 2005, I could find few markers of the Warsaw ghetto and no commemoration of the wall. In my research for the book, I found no reference to Irena Sendler before 2000 other than by Yad Vashem (1965 Righteous Gentile medal, and in 1983 a tree planted in her honor next to that of Raoul Wallenberg) and the U.S. News and World Report article that launched the Kansas teens on their National History Day project.\n\nWhen I returned in 2013 for the release of the Polish translation of my 2011 book Life in a Jar: The Irena Sendler Project (also translated into Russian, Chinese, and Mongolian), I saw how much had changed in Poland. Where there had been no markers of the wall, now there is a footprint, 10 inches wide that says, “MUR GETTA/GHETTO WALL 1940–1943,” placed in sidewalks and lawns showing the exact location of the ghetto wall. At each of the 22 gates there is a memorial plaque with a map and description of what happened in the ghetto.\n\nThere are now 35 Irena Sendler schools in Poland, three in Germany, one in France, and one in England. I have met to discuss Sendler with Poland’s Deputy Foreign Secretary Jerzy Pomianowski, given radio, TV, and print interviews, and met with a journalist from the Catholic News Agency. The Museum of the History of Polish Jews in Warsaw opened in 2014, and the Lowell Milken Center Europe, a Polish office of the Irena Sendler/Life in a Jar Foundation, works with Polish teens on similar projects.\n\nThe project changed Poland as well as the American students who started it all. From my time with the Kansas teens, I learned that each girl knew something about losing or almost losing their own parent. Liz was abandoned by her parents as a young child and raised by her grandparents, Megan’s mother developed cancer, and Sabrina’s mother suddenly died during the project. The girls courageously allowed me to tell their own painful stories in my book. And it became clear to me that the last three children Irena Sendler rescued were the girls from Kansas.\n\nToday, Elizabeth Cambers Hutton has two master’s degrees and teaches Holocaust history in Missouri. Sabrina Coons-Murphy is an elementary schoolteacher in Kansas. Megan Stewart Felt, the program coordinator for the Irena Sendler/Life in a Jar Foundation, still works with Norm Conard to further Sendler’s legacy and continues to play Sendler in performances of Life in a Jar.\n\nThe story has also changed me. I am a German-American Jew, born after the war to parents who narrowly escaped the Holocaust. Others in my family did not. For the first five years of my life I lived in upper Manhattan, in Washington Heights—an urban shtetl of German Jews who had survived the Holocaust. I didn’t speak English until I was five years old. The Holocaust was the baffling but iconic story of my childhood, a subject of nervous, hushed, adult conversation. It was frightening, mysterious, impossible to grasp, yet everywhere—it was the atmosphere. There was an awkward gracelessness on the part of those who lived through it, a furtiveness I now understand to be a kind of PTSD. It was the unacknowledged elephant in the living room—huge but shrouded.\n\nIt wasn’t until I was in my twenties that I learned that my grandfather had been arrested on Kristallnacht, November 9, 1938, and imprisoned in Dachau. My grandmother went to high school with one of the administrative guards at Dachau. He accepted a bribe from her, and my grandfather was released after six months. In 1999, my parents were interviewed as part of Steven Spielberg’s Shoah project. In the course of the interview my mother brought out her identity papers, marked “Jew,” and her nursing certificate, stamped with a swastika. My brother and I had never seen these artifacts.\n\nGrowing up as a child of survivors, I had a sense of mission about the Holocaust, but didn’t know how that would manifest. Now in my seventies, I find that in writing Life in a Jar, and speaking about it to new audiences, I am fulfilling that mission.\n\nIn my talks, sponsored by the Vermont Humanities Council, I emphasize how Sendler and the girls from Kansas were repairing the world—tikkun olam in Hebrew. Few of us would have the courage to do what Sendler did, but all of us can do what Liz, Megan, and Sabrina did—performing small acts of decency and respect for all people. Acts that change the world."}, {"url": "https://allthatsinteresting.com/irena-sendler", "page_content": "Irena Sendler even managed to survive torture by the Gestapo and a death sentence.\n\nAt the onset of World War II, the Germans outlawed helping Jews, making it punishable by death in Poland. And not only the death of the one offering assistance, but the death of their entire family.\n\nIrena Sendler was well aware of the danger, but that didn’t stop her from risking everything to save the lives of over 2,000 Jewish children.\n\nA Fitting Heir To A Legacy Of Courage And Sacrifice\n\nRemembered today as “the female Oskar Schindler,” Irena Sendler was an activist and outspoken critic of antisemitic policies long before the outbreak of World War II.\n\nLater, she would attribute the values that guided her work to her upbringing: “I was taught by my father that when someone is drowning you don’t ask if they can swim, you just jump in and help.”\n\nHer father lived and died by his philosophy. He was a doctor to the poor, whom he often treated at no cost. It was on an errand of mercy that he contracted typhus from a patient. When he died, his daughter was just seven years old.\n\nThe Jewish community that he had so often practiced in offered financial support to his widow, but she turned them down, saying that she and her daughter would manage.\n\nAs she grew older, Irena Sendler proved herself a fitting heir to her parents’ legacy. At school, she was a vocal critic of the system that segregated Jewish pupils from their non-Jewish counterparts during classes and lectures.\n\nShe frequently joined Jewish friends on the other side of the aisle, and when a Jewish friend was beaten, she crossed out the stamp on her grade card that marked her as a gentile and made the move permanent. The administration wasn’t a fan; they suspended her for three years.\n\nForged Papers, Secret Supplies, And Smuggled Children\n\nAt the time of the German invasion of Poland, Irena Sendler was working for the Polish Social Welfare Department. When the Nazis came to power, she watched her Jewish coworkers turned away, dismissed from their jobs after years of service.\n\nThe entire Polish Social Welfare Department was then barred from helping any Polish Jews — they would be served by the institutions in their own communities, the Germans said.\n\nIrena Sendler wasn’t going to let that stop her. She enlisted a group of supportive co-workers and began to created falsified papers that enabled her and her team to help Jewish families. Over four years, she fabricated 3,000 documents.\n\nShe continued to do so even when the stakes rose sharply in 1941: it was announced that the penalty for being found to have helped Polish Jews was death.\n\nIn 1943, Sendler joined the Zegota, an underground organization devoted to helping Jewish people escape the Holocaust. Under the fake name Jolanta, she was elected to head the Jewish children’s section.\n\nBecause of her job with the Social Welfare Department, Sendler had authorization to enter the Warsaw Ghetto, the portion of the city where 300,000 Jews were being held captive.\n\nThough the Germans cared not at all for the lives of Polish Jews behind the ghetto’s walls, they did fear typhus. Specifically, they worried that the deadly infectious fever could spread from inside the ghetto to the soldiers standing guard. So they allowed doctors in to check for symptoms and treat it.\n\nUnder the guise of performing these sanitation inspections, Irena Sendler would enter the ghettos, sneaking in food, medicine, and clothing. But she didn’t leave empty-handed: in the ambulances and trams that drove away from the ghetto were babies and small children. When no other means were available, children were even loaded into packages and suitcases.\n\nOver 2,500 children were smuggled out of the ghettos, at least 400 of them by Sendler herself. She recalls heart-wrenching conversations as families decided whether to send their children out into the city, where discovery meant death.\n\nWhen parents asked Sendler whether she could promise that their children would be safe, she replied that she could not; she didn’t even know whether she herself would make it out of the ghetto alive that day. All she could offer was the promise that she would never stop working on their behalf to protect and one day reunite them.\n\nPrayer Drills And Christian Training For Jewish Children\n\nOnce outside of the ghetto’s confines, the smuggled children were dispersed among friends of the Zegota. Some were placed in the care of Christian Polish families and given Christian names. They were also taught Christian prayers and values in case they were tested.\n\nOne member of the Zegota remembers waking children at night and asking them to recite their prayers, drilling them endlessly so that they would remember them someday under pressure. These small proofs could be the difference between life and death.\n\nSome of the children were sent to the Warsaw orphanage of the Sisters of the Family of Mary or similar Roman Catholic convents and schools. They were also renamed and taught Christian traditons to mask their heritage.\n\nSendler’s ultimate goal was to keep the children safe until the end of the war and then return them to their families, so she kept careful records of the children’s whereabouts, new names, and given names. She kept the lists in jars buried underground.\n\nBut any hope for those someday reunions was growing dim. In July of 1942, the Nazis began what they called the Grossaktion, or Great Action. They had started to systematically round up the Jews of the Warsaw Ghetto and “resettle them” in the east. But the trains the Warsaw Jews boarded were bound for death camps.\n\nIrena Sendler, well known within the ghetto’s walls, was forced to watch her friends disappear.\n\nThe Arrest And Torture Of Irena Sendler\n\nSendler was arrested in late 1943 and tortured by the Gestapo — and through it all, she managed to keep the children’s identities safe. In the moments preceding her arrest, she was able to toss the documents she had with her to a friend, who concealed them in her clothes.\n\nIn the face of brutal beatings and captivity, Sendler never named any of her comrades or the children they saved.\n\nShe even managed to survive being sentenced to death. As the officers of the Gestapo were bringing her to her execution, fellow members of the Zegota saved her life with a last minute bribe.\n\nEven though her work had almost cost her her life, Sendler returned to her position with the Zegota after her escape, this time under a different name.\n\nAfter the war, Irena Sendler continued helping people by taking a job as a nurse. Despite the demands of her job, she still attempted to make good on her promise to return the children to their families. Sadly, she learned that almost all of the families had been killed at the Treblinka concentration camp or were missing.\n\nFor her efforts, Sendler was recognized by the state of Israel as one of the Righteous Among the Nations, an award created in 1963 for outstanding citizens. She was initially unable to go to Israel to receive it because of travel restrictions imposed by Poland’s communist government — but finally, in 1983, the award made it to her.\n\nIn 2003, Pope John Paul II personally wrote to her to thank her for her efforts, and later that year, she received Poland’s highest civilian honor, The Order of the White Eagle. She was also given the Jan Karski award for “Courage and Heart” by the American Center for Polish Culture.\n\nThough she’s received countless other awards, Irena Sendler has remained humble about her contribution to the Jewish community.\n\n“I was brought up to believe that a person must be rescued when drowning, regardless of religion and nationality,” she said in a 2007 interview, one year before her death at age 98.\n\n“The term ‘hero’ irritates me greatly. The opposite is true. I continue to have pangs of conscience that I did so little.”\n\nAfter this look at Irena Sendler and her amazing heroism during the Holocaust, read about Ilse Koch, the concentration camp guard who was called “the bitch of Buchenwald.” Then, check out Inga Arvad, the girlfriend that Adolf Hitler and John F. Kennedy had in common."}, {"url": "https://www.thefamouspeople.com/profiles/irena-sendler-6152.php", "page_content": "Irena studied Polish literature at Warsaw University, and joined the Polish Socialist Party. She was a courageous girl and openly protested against the ghetto-bench system that existed at some prewar Polish universities. Due to this she was suspended from the University of Warsaw for three years.\n\nHer father was a physician and also one of the first Polish Socialists. She was greatly influenced by his selfless service to the patients, most of whom were Jewish and poor. Her father contracted typhus while treating Jewish patients the other doctors had refused to treat and died in February 1917.\n\nShe was born as Irena Krzyżanowska on 15 February 1910 in Otwock, near Warsaw, to Stanisław Krzyżanowski and his wife Janina. She was the only child of her parents.\n\nCareer\n\nDuring the late 1930s Irena Sendler moved to Warsaw and started working for the municipal Social Welfare departments. The Germans invaded Poland in 1939 and the Nazis started brutalizing the citizens, especially the Jewish population.\n\nShe was working as a Senior Administrator in the Warsaw Social Welfare Department at that time. The department operated canteens all over the city and provided meals and other necessities to the orphans, elderly, and the poor.\n\nIrena Sendler realized the pathetic situation of the Jews under the Nazis and helped the Jews by registering them under fictitious Christian names and reported the Jewish families as being afflicted with highly infectious diseases in order to prevent inspections.\n\nShe was taking a huge risk by helping the Jews as giving any kind of assistance to Jews in German-occupied Poland was punishable by death. Yet she courageously continued her services to the Jews.\n\nThe Zegota, an underground organization also known as the Council to Aid Jews, selected her to head its Jewish children’s section in 1943. During this time, she was assigned the name of ‘Jolanta’ in order to protect her real identity.\n\nAs an employee of the Social Welfare Department, she had a special permit to enter the Warsaw Ghetto, an area into which hundreds of thousands of Jews were herded and imprisoned. Inside the ghetto, the Jews lived in highly deplorable conditions and were most likely to be killed by the Nazis in the near future.\n\nSendler, along with some other like-minded and courageous women started smuggling out Jewish children from the ghetto. The babies and children were hidden in gunny bags, buried inside loads of goods, or sometimes even placed in coffins to hide them from the Nazis and transported to safer places.\n\nShe ensured that the children were provided with false identities and placed them in non-Jewish homes, orphanages, and convents. She also documented the children’s original names and new identities in coded form and hid the records by placing them inside jars and burying them under trees.\n\nShe and her helpers had succeeded in saving around 2,500 children in this manner. However, her clandestine activities were discovered by the Gestapo and she was severely tortured. She refused to divulge any vital information inspite of being brutally tortured and was finally sentenced to death.\n\nContinue Reading Below\n\nSendler managed to escape death at the last minute due to the intervention of Zegota members. She then acquired a false identity and continued her work with the Zegota, working as a nurse until the Germans left Warsaw."}, {"url": "https://www.salientwomen.com/2020/06/09/biography-of-irena-sendlerowa-polish-nurse/", "page_content": "Click here if you want to see this biography in Spanish translation.\n\nBiography of Irena Sendlerowa, Polish Catholic nurse and social worker, who during World War II, risking her own life, helped and saved more than 2,500 Jewish children condemned to be victims of the Holocaust.\n\nIrena Sendlerowa’s early life\n\nIrena Sendlerowa was born in Warsaw on February 15, 1910.\n\nHer father, Stanisław Krzyanowski, was a doctor and died in 1917 of a typhus that she had contracted by treating several Jewish patients rejected by his colleagues for fear of contagion.\n\nThe leaders of the Jewish community offered to pay for the studies of little Irena, who was only 7 years old.\n\nIrena Sendlerowa was studying Nursing when discriminatory measures were taken against Jewish students in Poland.\n\nShe actively participated in the demonstrations against these injustices.\n\nIn punishment, she was denied entry to the University of Warsaw for three years.\n\nIrena Sendlerowa in World War II\n\nWhen Germany invaded the country in 1939, Irena was already a 22-year-old young nurse.\n\nShe worked at the Warsaw Department of Social Welfare, which was in charge of the city’s community canteens.\n\nThere she contributed tirelessly to alleviate the suffering of thousands of people, both Jewish and Catholic.\n\nThese canteens not only provided food for orphans, the elderly and the poor, but also provided clothing, medicine and some money.\n\nWhen Nazi troops created a ghetto in Warsaw in 1942, Irena joined the “Council for the Aid of Jews“.\n\nShe recounted it like this, later: “I got, for me and for my colleague Irena Schultz, identifications from the health office, one of whose tasks was the fight against contagious diseases”.\n\n“Later, I was successful in getting passes for other co-workers. Since the invading Germans were afraid of a typhus epidemic being unleashed, they tolerated Polish nurses controlling the compound”.\n\nIrena Sendlerowa decided to save the Jewish children\n\nIn addition to helping other non-Jewish nurses to enter the ghetto, Irena soon realized that this controlled and guarded space could only offer a future of death for its inhabitants.\n\nSo she decided to find a way to save the little ones.\n\nIrena contacted locked up Jewish families and offered to take their children out of the ghetto.\n\nShe could not give them guarantees of success in this endeavor. However, the only certainty was that the children would die if they remained there.\n\nIt was a terrible decision for mothers who had to part with their children, but in those circumstances it was the only way to save the lives of children.\n\nSometimes when Irena and her friends returned to visit the families who had refused to part with their children, to try to change their minds, they found that they had all been taken to the train that took them to the death camps.\n\nIrena Sendlerowa realized that the easiest way to get children out of the ghetto was to hide them in ambulances that transport the most severely infected with typhus to hospitals outside the controlled space.\n\nShe used all kinds of subterfuges to hide them and find an escape route for them: sacks, garbage baskets, tool boxes, cargo shipments, potato bags, even coffins.\n\nThe girl with the silver spoon\n\nElzbieta Ficowska’s case passed to posterity, almost like a legend. Elzbieta was one of thousands of rescued children and babies.\n\nShe was a baby of just five months; a Sendlerowa collaborator administered a narcotic to her and locked her in a wooden box with holes for air to enter.\n\nThe box, with the baby inside, came out of the ghetto along with a shipment of bricks, in a horse-drawn carriage.\n\nIt was the month of July 1942. Elzbieta’s mother hid a silver spoon between her baby’s clothes. The spoon was engraved with her nickname, Elzunia, and the date of birth: “January 5, 1942“.\n\nElzbieta was received by Stanislawa Bussoldowa, a Catholic widow who was helping Irena Sendlerowa’s group.\n\nElzbieta Ficowska later said that Stanislawa Bussoldowa was her “Polish mother“, her other mother, she was her “Jewish mother“.\n\nFor months, Elzbieta’s mother telephoned the Stanislawa home to listen to her daughter’s babble.\n\nUnfortunately, the girl’s two parents died in the ghetto. Elzbieta Ficowska was later known by the nickname “the girl with the silver spoon“.\n\nIrena Sendlerowa risked her life for the children\n\nIrena Sendlerowa explained her risky mission, with these words: “The reason why I rescued the children has its origin in my home, in my childhood. I was raised in the belief that a person in need should be helped from the heart, without regard to their religion or nationality“.\n\nThe Nazis posted notices all over Warsaw, in German and Polish, threatening to kill any Pole who helped the Jews.\n\nDespite these warnings, Irena Sendlerowa continued to save children from the Warsaw Ghetto, several of whom found a hiding place in nunneries.\n\nIrena wanted these creatures to someday be able to recover their real names, their identity, their personal stories and their families.\n\nTo do this, she began to keep a file in which she recorded the names of the children and their new identities.\n\nThe Nazis were suspicious of Irena and her activities. On October 20, 1943, she was detained by the Gestapo.\n\nThey took her to the infamous Pawiak prison, where they brutally tortured her to extract any clue of what she was doing.\n\nShe was the only one who knew the names and addresses of the families that housed the Jewish children.\n\nShe endured torture and refused to betray her collaborators or any of the hidden children.\n\nOn a straw mattress in her narrow cell, she found a stamp with the image of Jesus, with the caption: “Jesus, I trust in you“.\n\nShe managed to keep it until 1979, when she gave it to John Paul II.\n\nOn those same dates, but in Nazi-occupied Paris, Dr. Suzanne Nöel, in her plastic surgery clinic, changed the faces of hundreds of persecuted Jews, who thus managed to escape.\n\nIrena Sendlerowa was saved from certain death\n\nThe Nazis failed to extract from Irena Sendlerowa the whereabouts of the children she had been helping to escape from the ghetto.\n\nShe was sentenced to death. While awaiting execution, a German soldier took her away for “further questioning”.\n\nAs they left, the two of them alone for a moment, the German shouted in Polish “Run!”. And young Irena came out at full speed; faster than ever in her entire life.\n\nThe next day, Irena Sendlerowa could see that her name was written on the list of executed Poles.\n\nWhat happened was that the members of the “Jewish Council” (Zegota) had bribed the Germans.\n\nThis is how Irena escaped death and continued working as a nurse, but with a false identity.\n\nIrena Sendlerowa protected the children’s lists\n\nIn 1943, during the Warsaw Uprising, she placed the lists of the rescued children in two glass jars.\n\nTo make sure they would come into good hands should she die, she buried the two jars in her neighbor’s garden.\n\nAt the end of the war, she unearthed them and gave the lists to Dr. Adolfo Berman, the first president of the “Committee to rescue the surviving Jews“.\n\nUnfortunately most of the families of these children had died in the Nazi concentration camps.\n\nInitially, children who were not taken in by an adoptive family were installed in different orphanages.\n\nLittle by little they were sent to Palestine, to the new State of Israel.\n\nIrena Sendlerowa under the communist regime\n\nImmediately after the cruel Nazi barbarism, the noble Polish people had to endure the tyrannical communist oppression protected by the Soviet Union.\n\nThe communist regime that was established in Poland vetoed even the mention of crimes committed against Jews during the Nazi occupation.\n\nNor was there any recognition of the heroics of the people during the Nazi invasion.\n\nIrena Sendlerowa married and had three children.\n\nIrena had joined the Socialist Party; This caused her problems with the communist officials, who did not stop harassing her.\n\nInterrogations by the Communist secret police led to the premature birth of her son Andrzej, who died two weeks after birth.\n\nLater, her other two children, Janina and Adam faced obstacles in receiving an education in Warsaw.\n\nAcknowledgments to Irena Sendlerowa\n\nThe children had only known Irena by her code name “Jolanta”.\n\nBut years later, when her photo appeared in a newspaper after being awarded for her humanitarian actions during the war, she began to receive many calls and recognitions.\n\nA man called her on the phone and said, “I remember your face, you are the one who pulled me out of the Ghetto“.\n\nIn 1965, the Yad Vashem institution in Jerusalem awarded her the title of “Righteous Among the Nations” and named her “Honorary Citizen of Israel”.\n\nIn November 2003, the President of the Republic, Aleksander Kwasniewski, granted her the highest civilian distinction in Poland, when she named her “Lady of the Order of the White Eagle“.\n\nDuring the emotional ceremony, Irena was accompanied by her family and Elzbieta Ficowska, “the girl with the silver spoon“.\n\nBut Irena Sendlerowa never thought she would be honored for surreptitiously removing the 2,500 Jewish children from the Warsaw ghetto, or for hiding their names, despite the torture.\n\nAs she put it, “Those acts were the justification for my existence on earth, and not a title to receive glory“.\n\nIn reference to the incessant visits she received, she said: “I am very tired; this is too much for me“\n\nIn 2007, on the initiative of President Lech Kaczynski, and with the official support of the State of Israel, the Polish government presented Irena Sendlerowa as a candidate for the Nobel Peace Prize.\n\nSupporting her candidacy was the “Organization of Holocaust Survivors Resident in Israel”.\n\nThe Auschwitz authorities also expressed their support for this candidacy, “considering that Irena Sendlerowa was one of the last living heroes of her generation, and that she demonstrated extraordinary strength, conviction and courage in the face of evil of an extraordinary nature“.\n\nThe Norwegian Nobel Committee decided to award the award to the American politician and philanthropist Albert Gore. No comment!!!\n\nIn compensation, the Polish government recognized Irena Sendlerowa as “Righteous Among the Nations”.\n\nIrena Sendlerowa passed away in Warsaw (Poland), on May 12, 2008, at the age of 98.\n\nClick here if you want to see this biography in Spanish translation."}, {"url": "https://www.grunge.com/1192496/the-world-war-ii-nurse-who-liberated-jewish-children-with-coffins/", "page_content": "During the war, Sendler and the members of Zegota rescued an estimated 2,500 Jewish children from the Warsaw Ghetto (per Holocaust Matters). After the war finally ended, she worked to reconnect the children she smuggled out with surviving members of their families. With the sheer number of children she was tasked with keeping track of, Sendler made sure to keep meticulous records of the children's locations, new names, and their actual names. To ensure that this information was kept secret and secure, she kept these records buried underground in jars (per All That's Interesting).\n\nDespite Irena Sendler's noble efforts to reunite the children with their families, she soon discovered that most of the children's parents did not survive the war. As early as 1942, the Nazis began removing people from the ghetto to a concentration camp called Treblinka, where many of them suffered horrible fates.\n\nThough she was not able to return all of the children to their families, Sendler's actions did not go unrecognized. She received numerous other awards. In 1999, a group of students from Kansas did a National History Day project in her honor. Sendler was honored by Yad Vashem in 1963 as the recipient of the Righteous Among the Nations medal and received Poland's highest civilian honor in 2003. Life in a Jar: The Irene Sendler Project helped to bring Irena Sendler's incredible story to the public and preserve her legacy for future generations. Irena Sendler died in Warsaw on May 12, 2008 (per the USHMM)."}, {"url": "https://www.wikiwand.com/simple/Irena_Sendler", "page_content": "Irena Stanisława Sendler (15 February 1910 – 12 May 2008) was a nurse and social worker in Warsaw, Poland. During World War II, when Poland was occupied by Nazis, she took about 2,500 Jewish children out of Poland with help from other members of the Żegota (pl) (The Polish Council to Aid Jews).[1] She was caught, and the Nazis tortured her.\n\nQuick facts: Irena Stanisława Sendler, Born, Died, Occupat... ▼\n\nThe Nazis were planning on killing her, but she avoided death."}, {"url": "https://www.cswe.org/centers-initiatives/kendall-institute/international-social-work-leader-review/previously-featured-social-work-leaders/irena-sendler/", "page_content": "Irena Sendler (1910–2008)\n\n\n\nIrena Sen dlerowa (Krzyżanowska) was born in 1910 in Warsaw, Poland, to Stanislaw Krzyżanowska and Janina Karolina Grzybowska. Her grandfather led a rebellion against the czars. Her father—noted as one of the primary Polish socialists—died after contracting typhus when Irena was a young child. He worked as a doctor and primarily served impoverished individuals and families. Many sources say Irena drew a great deal of inspiration from her father’s selfless aspirations to help others in need. In fact, Sendler once wrote, “I was raised to believe that the question of religion, nation, belonging to any race is of no importance—it’s a human being that matters!” (Pikuci, 2020).\n\n\n\nAs a teenager, Irena attended the University of Warsaw, during which time she further developed her passion for the helping profession. Having been raised alongside many Jewish families, she expressed strong opinions about the economic and social inequality this population faced and was appalled at the poor conditions of ghettos. She joined variety of socialist and communist organizations, which ultimately shaped her views in a more radical way.\n\n\n\nIrena married three times. Her first marriage to Mieczyslaw Sendler lasted for 13 years before they divorced in 1947. She then married a long-time friend, Stefan Zgrzembski, and had three children—daughter Janka and sons Adam and Andrzej (who unfortunately died during infancy). After Zgrzembski abandoned the family, Irena remarried her first husband. However, their second marriage did not last, and they divorced once again.\n\n\n\nIrena became a social worker and a nurse. She was not known as one of the international leaders of social work. However, in recent years she has been widely acknowledged for her work assisting others by saving the lives of hundreds of children. Some reports suggesting almost 2,500 children.\n\n...\n\n\n\nIn recent years, Sendler received the following awards and recognition: Order of the White Eagle (2003); Jan Karski Price (2003); Blessing by Pope John Paul II; Polonis Restitutna (Order of Poland Restored); Krzyz Komaniaiazda z Gwiazda Orderu Odrodzenia Polski (Commander with a star); Order of Smile (2007, given by Children), and Honorary citizenship of Israel (Wieler, 2008). She was nominated for the Nobel Peace Prize in 2007.\n\n\n\nAmong the most notable of her recognitions, in 2006 the International Federation of Social Workers awarded Irena Sendler the Most Distinguished Social Worker award. The award was accepted on her behalf by the president of the Association of Children of the Holocaust, Elzbieta Ficowska, one of the youngest children saved by Sendler and her colleagues. She read the following from a letter of acceptance (Wieler, 2008):\n\n\"I have dedicated my entire life to social work and to the survival of the most needed. With the acceptance of this award I need to let you know that without the help of many co-workers and other helpful people I would have not been able to accomplish as much as I did. The concrete action of a social worker requires professionalism, devotion, tenacity and much heart. Through helpful actions one feels much empathy and on the other hand much joy and satisfaction. (p. 838)\"\n\n\n\nSendler had deep connections to social education and practice. She worked with Helena Radlinska—the founder and director of the first school of social work—by providing placements for her students. She knew Alice Salomon and other pioneers of social work in Europe and worldwide. Irena’s selfless work, without thinking about the consequences, correlates nicely with the ethical principles of the NASW Code of Ethics. Her dedication to the dignity and worth of a person truly exemplifies the transformative nature of social work.\n\n\n\nResources\n\nBülow, L. (n.d.) The Holocaust. http://www.auschwitz.dk/sendler.htm\n\n\n\nLife in a Jar: The Irena Sendler Project. (n.d.). https://irenasendler.org/facts-about-irena\n\n\n\nPicuki. (n.d.). The courageous heart of Irena Sendler. https://www.picuki.com/media/2244585986742660086\n\n\n\nVashem, Y. (2020). Irena Sendler. https://www.yadvashem.org/yv/en/exhibitions/righteous-women/sendler.asp\n\n\n\nWieler, J. (2008). Brief note: Remembering Irena Sendler. International Social Work; 51, 835–840. https://doi.org/10.1177/002087280895254\n\n\n\nAdditional Videos\n\nThe Irena Sendler Project: Life in a Jar: https://www.youtube.com/watch?v=zHod5WVDWEA\n\n\n\nIrena Sendler: The Polish woman who saved 2,500 Jewish children: https://www.youtube.com/watch?v=vg4deegQxH4\n\n\n\nThe Irena Sendler Project, Megan Felt, TEDxOverlandPark: https://www.youtube.com/watch?v=TRFcrvVRb3o\n\n\n\n\n\nFor the full review, afterward by the co-authors, references, and additional publications, click here."}, {"url": "https://nurseslabs.com/irena-sendler-nurse-declared-war-hitler/", "page_content": "When taught about the heroines of the nursing community in nursing school, we all probably heard the names of Florence Nightingale, Clara Barton or Dorthea Dix. While these extraordinary women had a substantial influence on people, some unsung heroes and heroines are not as well known. One of these heroines is Irena Sendler. Like the women listed above, Irena Sendler impacted the lives of many and influenced nursing and social working practices. Due to her unpopular social and political views, Irena is an unsung heroine of her time.\n\nIrena Sendler was born in 1910 in Warsaw and was raised in the town of Otwock, a town about 15 miles from Warsaw. She was greatly influenced by her father, who was a doctor to mostly poor Jews. She became a Polish nurse and social worker and used her skills to serve in the German-occupied Warsaw during World War II.\n\nHead of the Children’s Division of Zegota, she smuggled approximately 2,500 Jewish children out of the Warsaw Ghetto, providing them with false identities and placing them with non-Jewish families, saving them from the Holocaust. Irena kept the original identities of the children, burying the information under an apple tree in jars, with the intent of reuniting the children with their original families. Sadly, the majority of the parents were killed during the Holocaust death camps.\n\nIrena used several methods to smuggle children out of the Ghetto. There were five primary methods: Use of ambulance by hiding under a stretcher, escape through a courthouse, underground sewer pipes, trolleys with children hidden in sacks, very ill children through the use of an ambulance. Other times, infants and children could be hidden in briefcases, mechanics’ toolboxes, coffins or potato sacks. Jewish children were taken from original families and accepted into homes, orphanages or convents. The Germans eventually learned of Irena’s activities in October of 1943, and she was arrested, tortured and sentenced to death. However, she managed to escape when a Gestapo agent was bribed. She survived the war, and the children’s and families’ identities were protected.\n\nLate in life, Sendler was awarded the Order of the White Eagle, Poland’s highest Honor, for her humanitarian efforts. In 2007 she was nominated for the Nobel Peace Prize. For many years, Irena Sendler continued to live in Warsaw in an apartment. She had one son and a daughter. Her son passed in 1999. Irena died in May of 2008. Her daughter continues to live in Warsaw. Irena Sendler has been designated a national hero in Poland and schools have been named in her honor."}], "Irena Sendler was a social worker.": [{"url": "https://www.biography.com/activist/irena-sendler", "page_content": "(1910-2008)\n\nWho Was Irena Sendler?\n\nWhen the Nazis invaded in 1939, Irena Sendler was a social worker and so had access to the Warsaw Ghetto, where hundreds of thousands of Jews were imprisoned. As a member of Żegota (aka Konrad Żegota Committee, the Council to Aid Jews), she helped rescue 2,500 Jewish children from the ghetto. For her courageous actions during the Holocaust, in 1965, Israel’s Yad Vashem honored her as “Righteous Among the Nations.” Sendler died in Warsaw in 2008.\n\nEarly Life\n\nSendler was born Irena Krzyżanowska on February 15, 1910, in Otwock, Poland. Her parents were members of the Polish Socialist Party, and her father, Stanisław Krzyżanowski was a medical doctor who died of typhus when Sendler was a child. In 1931 Sendler married Mieczysław Sendler, and the couple moved to Warsaw before the outbreak of World War II.\n\nWarsaw Ghetto\n\nIn Warsaw, Sendler became a social worker, overseeing the city’s “canteens,” which provided assistance to people in need. When the Nazis invaded Poland in 1939, Sendler and her colleagues also used the canteens to provide medicine, clothing and other necessities to the city’s persecuted Jewish population.\n\nIn 1940, the Nazis forced Warsaw’s more than 400,000 Jewish residents into a small locked ghetto area, where thousands died every month from disease and starvation. As a social worker, Sendler was able to enter the ghetto regularly to help the residents and soon joined Żegota, the Council to Aid Jews. Putting themselves at great risk, she and about two dozen of her colleagues set out to save as many Jewish children as possible from death in the ghetto or deportation to concentration camps.\n\nŻegota began by saving Jewish orphans. They had several ways of smuggling them out of the ghetto: Some were carried out in caskets or potato sacks; others left in ambulances or snuck out through underground tunnels. Still others entered the Jewish side of a Catholic church that straddled the ghetto boundary and left on the other side with new identities. Sendler then helped place the children at convents or with non-Jewish families.\n\nAs the situation became more dire for the ghetto’s inhabitants, Sendler went beyond rescuing orphans and began asking parents to let her try to get their children to safety. Although she couldn’t guarantee the children’s survival, she could tell parents that their children would at least have a chance. Sendler kept detailed records and lists of the children she helped buried in a jar. Her plan was to reunite the rescued children and their parents after the war. However, most of the parents did not survive.\n\nOn October 20, 1943, the Nazis arrested Sendler and sent her to Pawiak Prison. There they tortured her, trying to get her to reveal the names of her associates. She refused and was sentenced to death. However, Żegota members bribed the prison guards, and Sendler was released in February 1944.\n\nSendler continued her work until the war ended, by which time she and her colleagues had rescued some 2,500 children. It has been estimated that Sendler personally saved about 400.\n\nPersonal Life\n\nAfter the war, Sendler’s first marriage ended in divorce. In 1947 she married Stefan Zgrzembski, with whom she had three children, daughter Janka, and sons Andrzej (who died in infancy) and Adam. After the death of Zgrzembski, Sendler remarried her first husband, Mieczysław Sendler, but their reunion didn't last and they again divorced.\n\nHonors and Awards\n\nIn 1965, Yad Vashem, Israel’s Holocaust memorial organization, named Sendler as Righteous Among the Nations for her work saving Jewish children. In 2003, Poland honored her with its Order of the White Eagle. In 2008, Sendler was nominated for (but did not win) a Nobel Peace Prize. The story of her life was also captured in a 2009 TV movie The Courageous Heart of Irena Sendler, which starred Anna Paquin in the title role.\n\nDeath\n\nSendler died on May 12, 2008, in Warsaw, Poland, at the age of 98.\n\nQUICK FACTS\n\nBirth Year: 1910\n\nBirth date: February 15, 1910\n\nBirth City: Otwock\n\nBirth Country: Poland\n\nGender: Female\n\nBest Known For: Irena Sendler was a Polish social worker who, during World War II, helped to rescue 2,500 Jewish children from the Warsaw Ghetto, and placed them in convents or with non-Jewish families.\n\nAstrological Sign: Aquarius\n\nDeath Year: 2008\n\nDeath date: May 12, 2008\n\nDeath City: Warsaw\n\nDeath Country: Poland\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.holocaustmatters.org/irena-sendler/", "page_content": "Irena Sendler was a Polish social worker, nurse, and director of the children’s department for the Council for Aid to Jews, Zegota (an underground resistance group during WWII). She has been recognized by Yad Vashem as a Righteous Among the Nations, and awarded the Jan Karski for Valor and Courage.\n\nTo say the least, Irena Sendler is an inspiring humanitarian with a fascinating life story; her incredible courage and bravery saving the lives of many Jewish people throughout WWII. In this piece, we will be exploring the life of this influential figure, and her part to play during the Holocaust.\n\nFor more information on the Holocaust, and other influential figures throughout it, please click here.\n\nEarly Life\n\nBorn in Warsaw on the 15th of February 1910, Irena Sendler (or Irena Kryzyzanowski at the time) was the daughter of Janina and Dr Stanislaw Kryzyzanowski. Although born in Warsaw, Irena grew up in a town near the city called Otwock, and was an only child.\n\nHer father (Dr Stanislaw Kryzyzanowski) died from typhus, which he contracted whilst treating patients, when Irena was only seven years old. Stanislaw, although dying when Irena was very young, had a profound impact on the life values she carried throughout her life, claiming that through her father “I was taught that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.”\n\nAfter Stanislaw’s death, many leaders in the Jewish community helped to fund Irena’s education, which lead her to study at Warsaw University in Polish Literature.\n\nDuring her time at university, Irena disagreed with the ghetto bench system that had already been established in some of the universities prior to the war. In reaction to this, she vandalised her grade card and was consequently put on a three year-long suspension from the university.\n\nThis was not the last of Irena’s protests against Jewish discrimination, but rather the beginning to her humanitarian career, fighting for the lives of Jewish people throughout the Holocaust.\n\nHow Did Irena Sendler Help During the War?\n\nEven in the very beginnings of WWII, as the Germans invaded Irena’s birthplace of Warsaw, she started to help the city’s Jews, providing them with food and water. However, once the ghetto was built within the city this cut off Irena’s access to those who needed her aid. She then started to plan out another way in which to help.\n\nOnce the Warsaw Ghetto was established in the year 1940, Irena then started to smuggle out orphaned children. She used her status as a social worker, in addition to documentation from an employee at the Contagious Disease (who also became a part of the underground group Zegota) to gain access into the Warsaw Ghetto, and access to the orphaned children who lived in it.\n\nAfter the underground Polish resistance group for the Provisional Committee for Aid to Jews (Zegota) was established in 1942. Irena was soon appointed as head of its children’s division. During her position with Zegota, Irena and her team helped to rescue around 2,500 Jewish children from the Warsaw Ghetto. There were four main ways in which Irena’s team would smuggle out children from the ghetto, these being as follows:\n\nSmuggled through an old courthouse next to the ghetto.\n\nEscape through underground passages such as the sewer.\n\nHide in a luggage bag and then carried out by a trolley.\n\nVia ambulance; hidden under stretchers, faking illness or genuinely being ill.\n\nThose rescued were sent to numerous different orphanages and religious institutions that took in vulnerable children. Irena used her contacts with these places to smuggle the children in under false names. Some of the main places these children were smuggled into included the Rodzina Marii Orphanage, and religious institutions in and around Chotomow, Turkowice and Lublin.\n\nWhy Was Irena Sendler Imprisoned?\n\nOn the 20th of October 1943, Irena was arrested, and sent to Piawiak prison. During her time in imprisonment she was tortured for information on the other members of Zegota, and Irena fed the interrogators false information. Irena was then sentenced to death, however did not fulfil this sentence as her fellow Zegota members bribed workers in the prison to let her escape.\n\nThe day after Irena’s escape, Nazi officials interestingly announced that she had been shot, with posters with this false news dotted all around Warsaw. Irena was in hiding throughout the rest of the war, and once over, started to try and connect the children she had saved with their parents. Unfortunately, nearly all of these parents had been killed during the holocaust.\n\nLater Life\n\nWhen the war was over, Irena carried on her career as a social worker. She received numerous awards for her outstanding bravery and courage; these included the previously mentioned Yad Vashem’s Righteous Among the Nations, and Jan Karski’s Valor and Courage. In addition to these, Irena was also awarded Poland’s Order of the White Eagle, and has been a nominee for the Nobel Peace Prize.\n\nIrena then spent the latter part of her life cared for in Warsaw by a woman called Elzbieta Ficowska. Eizbieta was one of the children (six months old at the time) Irena had smuggled out of city’s ghetto.\n\nIrena has remarked on her actions during the war, stating that “We who were rescuing children re not some kind of heroes. That term irritates me greatly. The opposite is true – I continue to have qualms of conscience that I did so little. I could have done more. This regret will follow me to my death.”"}, {"url": "https://aboutholocaust.org/en/facts/who-was-irena-sendler-and-why-did-she-smuggle-jewish-children-out-of-the-warsaw-ghetto", "page_content": "Irena Sendler (1910-2008) was a Polish social worker who helped Jews in Warsaw throughout the German occupation. She became a leading activist in Zegota after it was established in autumn 1942. From 1943, as head of the Children’s Section, she used her contacts with orphanages and other institutions to find hiding places for children. The exact number of children she saved through this work is unknown, but estimates have ranged as high as 2,500.\n\nSendler was just 29 when the Germans occupied Warsaw at the beginning of WW2. She risked her life to gain access to the Warsaw Ghetto after it was sealed in November 1940, obtaining a permit to inspect sanitary conditions. She used her access to help smuggle people out of the ghetto. When Zegota was established after the “Great Deportation” of summer 1942, Sendler became a leading activist, working to smuggle survivors out and establish hiding places for them.\n\nIn September 1943, Sendler was appointed head of the Children’s Section, and helped place children abandoned after the final destruction of the ghetto in orphanages and religious institutions in and around the cities of Warsaw and Lublin. She was arrested, tortured and sentenced to death in the Pawiak prison in October 1943. She was released in February 1944 after the Polish underground secured her release by bribing officials. After her release, Sendler continued to work for the resistance, after a brief period in hiding. When asked to explain her actions, she replied: “I was taught by my father that when someone is drowning you don’t ask if they can swim, you just jump in and help.” She was awarded the title of Righteous Among the Nations in 1965. She died in Warsaw in 2008, aged 98."}, {"url": "https://www.neh.gov/article/irena-sendler-and-girls-kansas", "page_content": "Between 1942 and 1943, Sendler and her network of 10 compatriots rescued 2,500 Jewish children from the Warsaw ghetto. Disguised as an infection-control nurse, Sendler knocked on doors in the ghetto, asking parents and grandparents to give up their children and grandchildren so that she could smuggle them out. Each child was given a new Polish name and forged identity papers and hidden in foster homes, orphanages, or convents. Sendler insisted that lists of the children be kept, documenting their Jewish and Polish names, so that after the war they would know their original identities. She hid the lists in milk jars that were buried in the backyard of one of her co-conspirators.\n\nPhoto caption A young Irena Sendler, in Warsaw, circa 1930. — AF Fotografie / Alamy Stock Photo\n\nAfter the war, Poland’s Communist government persecuted members of Poland’s wartime resistance, Zegota, of which Sendler was a part. They were harassed, interrogated, imprisoned, and even executed. Sendler and others who rescued Jews during the war kept silent. Almost no one knew of Sendler and her heroism.\n\nShe would have remained an unsung hero were it not for three teenage American girls who discovered her forgotten story 60 years later. Liz, Megan, and Sabrina, who began as students of history for a National History Day competition, became recorders of history, championing Sendler’s legacy in Poland, the U.S., and around the world. Three teenagers from rural Kansas helped crack open the silence about the Holocaust in Poland.\n\nMy first brush with this story came in the winter of 2001, in my Middlebury, Vermont, pediatric office, while going through my mail. This was before the electronic health record, and I daily triaged a prodigious stack of paper. Everything had about three seconds to be kept, filed, recycled, or thrown away.\n\nI am a member of the U.S. Holocaust Memorial Museum (USHMM). Each year I send a contribution, and they send me a calendar highlighting 12 monthly Holocaust heroes. As I quickly flipped through, I was brought up short by the November entry. It was the photo that stopped me—a young Irena Sendler, twenty-nine years old, who looked a lot like my niece. I read the short paragraph below the photo:\n\nIrena Sendlerowa, (1916–UNKNOWN) As head of the children’s division of Zegota, the Polish underground Council for Aid to Jews, social worker Irena Sendlerowa (code name “Jolanta”) helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their Jewish names and placements so that surviving relatives could find them after the war. Arrested by the Gestapo in the fall of 1943, Sendlerowa was sentenced to death. Zegota rescued her before her execution. She assumed a new identity and continued her work for Zegota.\n\nI was stunned. I’m a child of Holocaust survivors. How could I not know Irena Sendler’s story? Everybody knows Oskar Schindler, who rescued 1,100 Jews from a German concentration camp in Poland and whose story was told in the Steven Spielberg film Schindler’s List. Even at the USHMM, the preeminent scholars of the Holocaust didn’t know much about Sendler. They had her birth year wrong (it was 1910, I later found out), and they didn’t know if she was still alive.\n\nI kept this calendar in a file labeled “Interesting Stuff.” And there it sat for almost three years.\n\nPhoto caption These children rescued by Sendler were sent to live with new identities at a Polish convent, circa 1943. — World History Archive / Alamy Stock Photo\n\nThen, in February 2004, I came into my office one night to see a sick child. On my desk someone had left a copy of the Ladies Home Journal, opened to an article, “The Woman Who Loved Children.” It was about Irena Sendler and three Kansas teens who uncovered her story. The article explained that, in 1999, while planning a National History Day project, they found a brief reference to Sendler in a U.S. News and World Report article entitled “The Other Schindlers.” Sendler’s story inspired their NHD project: a play they wrote and performed called Life in a Jar. It retold, in dramatic form, the emotional story of Sendler knocking on ghetto doors and asking Jewish parents to give up their children to save them. The title, Life in a Jar, refers to the lists Sendler buried.\n\nThe teens read that Irena had been arrested in 1943 by the Gestapo and tortured in Pawiak Prison, the most notorious prison in the ghetto, from which almost no one escaped. Logically, they began searching cemetery records and reached out to the Jewish Foundation for the Righteous, seeking information about where she might be buried. Soon after, they received a letter from the foundation, saying that Sendler was alive! She was in her nineties and living in poverty with her daughter-in-law in Warsaw. The foundation then put them in touch with Sendler.\n\nThe three students made plans to travel to Poland and meet Sendler, first trying to raise money through candy sales, until philanthropists and Holocaust survivors from the Kansas City Jewish community stepped in to help cover the trip. Traveling out of the country for the first time (the first time on a plane for one of them), the girls finally met Sendler at her Warsaw home in 2001. They maintained a tender friendship with her for the next seven years until she passed, making several trips to Poland to visit her, each time performing Life in a Jar at various venues. And they began working with Polish high school students who were telling the forgotten stories of rescuers from their own communities.\n\nPhoto caption The original three students—Liz,Megan, and Sabrina—are joined by Jessica Shelton-Ripper (third from left), who performed many times with Life in a Jar. Here they visit the Irena Sendler exhibit at the Lowell Milken Center for Unsung Heroes in Fort Scott, Kansas, in 2018. — Kenny Felt\n\nAs I read the Ladies Home Journal article, I remembered the USHMM calendar. This story now took on a new dimension. I have been a closet writer most of my life, and I was thinking about writing a novella about the Warsaw ghetto. Irena Sendler seemed like a compelling character, and I wanted to know more about her. I was also intrigued by the two stories—Irena’s wartime history and the contemporary story of three Kansas teens. I called their teacher in Kansas, Norm Conard.\n\n“It’s serendipitous that you should call,” he said. “We’re looking for someone to write these two stories.”\n\nI hesitated. I had not written nonfiction before, only fiction and poetry. But I felt the powerful synergy of these two stories. I was not eager to write a wartime history of a Holocaust hero because most Holocaust literature leaves me angry, sad, depressed, and frustrated. But this story was different—an inspiring story of three typical American teenagers who helped restore the history of a great hero.\n\nI agreed to write the story and, in 2004, visited Uniontown, Kansas, where the girls went to school. A small town with a population of 264, it was down on its luck. Many stores were shuttered. It had the look of a Dorothea Lange or Walker Evans black-and-white photo from the Depression. I met Norm and the girls at the high school, and I was hooked.\n\nUniontown High School, with only about 120 students, is one of the lowest-income school districts in Kansas. There was no diversity in the school—never a Jew, an African American, or even a Catholic—yet these teens had discovered Sendler’s story and told the world. I spent a week interviewing the students, their families, their teacher, community members, and Holocaust survivors from Kansas City who had taken a great interest in the play and the Irena Sendler project.\n\nMy wife and I accompanied the students and Conard to Poland on their third visit, in 2005. I was able to do more extensive research and interview Sendler, Holocaust scholars, and some of the children Sendler had rescued, now in their sixties and seventies. We met Elzbieta Ficowska, rescued as a six-month-old infant. Sendler had sedated her and put her in a carpenter’s box. Her parents kissed their baby good-bye and left a small spoon in the box with her name inscribed on one side and her birthdate on the other. It is the only memento of her parents, who were murdered at Treblinka. She and I have become good friends, and I have held her spoon many times, always with tears. Ficowska became one of Sendler’s caregivers and the chairperson of the Association of Children of the Holocaust in Poland.\n\nIt was Sendler’s ninety-fifth birthday when I interviewed her. She was energetic, and her memory was clear and specific. She wanted to be sure that I credited all of her network of rescuers and liaisons. She ensured that I had everyone’s name spelled correctly.\n\nPhoto caption Megan took this picture of Sendler on May 3, 2008, during a visit to Poland. Sendler passed away nine days later on May 12. — Megan Felt\n\nPoland was arguably the most victimized country in occupied Europe. The consequence for hiding or even feeding a Jew was execution, often in public as a warning to other Poles. When I asked Sendler why she put herself and her family at such risk, she said, “It was a need of my heart.” She rejected the appellation of hero. “I only did what any decent person would do. . . . The heroes were the babies—they were the heroes of their mothers’ hearts. . . . It was the parents and grandparents who gave up their children, they were the true heroes.”\n\nShe said it was her father’s teaching that inspired her. “If you see someone drowning you must rescue them, even if you cannot swim.” And “there are only two kinds of people in the world, good and bad, regardless of race, religion, or creed. And most people are good.”\n\nShe lamented that she had not done enough—for every child they saved almost one hundred went to their deaths at Treblinka.\n\nSendler has become a Polish national hero. Poles have been eager to tell their stories, in part because the Life in a Jar project stimulated Polish/Jewish dialog as well as scholarship about Poland during the German occupation. Although there has been a disturbing return of anti-Semitism and Holocaust denial in Poland, Sendler’s story continues to be told.\n\nYad Vashem, the World Holocaust Remembrance Center in Jerusalem, recognizes more Righteous Gentiles—those who rescued out of principle, not for personal gain—from Poland than from any other country in occupied Europe. In 2019, it listed 27,362 Righteous Gentiles, with 6,992 from Poland, or around 26 percent. But because of postwar Poland’s Communist anti-Semitism, Polish rescuers who had received Yad Vashem medals hid them and told no one of their wartime activities.\n\nAt one performance of Life in a Jar in Warsaw, I sat beside an old man, old enough to have been an adult during the war. Throughout the performance he sat with his hands together, clutching something inside. After the performance I asked him about it, and he opened his hands to reveal his Yad Vashem medal. There were tears in his eyes as he explained, “I have kept this buried in my basement for 60 years. I told no one except my wife. I didn’t tell my children, family, friends, or coworkers. Now, because of these American students, I can show this proudly. It was the finest thing I have ever done.”\n\nMy first time in Warsaw, in 2005, I could find few markers of the Warsaw ghetto and no commemoration of the wall. In my research for the book, I found no reference to Irena Sendler before 2000 other than by Yad Vashem (1965 Righteous Gentile medal, and in 1983 a tree planted in her honor next to that of Raoul Wallenberg) and the U.S. News and World Report article that launched the Kansas teens on their National History Day project.\n\nWhen I returned in 2013 for the release of the Polish translation of my 2011 book Life in a Jar: The Irena Sendler Project (also translated into Russian, Chinese, and Mongolian), I saw how much had changed in Poland. Where there had been no markers of the wall, now there is a footprint, 10 inches wide that says, “MUR GETTA/GHETTO WALL 1940–1943,” placed in sidewalks and lawns showing the exact location of the ghetto wall. At each of the 22 gates there is a memorial plaque with a map and description of what happened in the ghetto.\n\nThere are now 35 Irena Sendler schools in Poland, three in Germany, one in France, and one in England. I have met to discuss Sendler with Poland’s Deputy Foreign Secretary Jerzy Pomianowski, given radio, TV, and print interviews, and met with a journalist from the Catholic News Agency. The Museum of the History of Polish Jews in Warsaw opened in 2014, and the Lowell Milken Center Europe, a Polish office of the Irena Sendler/Life in a Jar Foundation, works with Polish teens on similar projects.\n\nThe project changed Poland as well as the American students who started it all. From my time with the Kansas teens, I learned that each girl knew something about losing or almost losing their own parent. Liz was abandoned by her parents as a young child and raised by her grandparents, Megan’s mother developed cancer, and Sabrina’s mother suddenly died during the project. The girls courageously allowed me to tell their own painful stories in my book. And it became clear to me that the last three children Irena Sendler rescued were the girls from Kansas.\n\nToday, Elizabeth Cambers Hutton has two master’s degrees and teaches Holocaust history in Missouri. Sabrina Coons-Murphy is an elementary schoolteacher in Kansas. Megan Stewart Felt, the program coordinator for the Irena Sendler/Life in a Jar Foundation, still works with Norm Conard to further Sendler’s legacy and continues to play Sendler in performances of Life in a Jar.\n\nThe story has also changed me. I am a German-American Jew, born after the war to parents who narrowly escaped the Holocaust. Others in my family did not. For the first five years of my life I lived in upper Manhattan, in Washington Heights—an urban shtetl of German Jews who had survived the Holocaust. I didn’t speak English until I was five years old. The Holocaust was the baffling but iconic story of my childhood, a subject of nervous, hushed, adult conversation. It was frightening, mysterious, impossible to grasp, yet everywhere—it was the atmosphere. There was an awkward gracelessness on the part of those who lived through it, a furtiveness I now understand to be a kind of PTSD. It was the unacknowledged elephant in the living room—huge but shrouded.\n\nIt wasn’t until I was in my twenties that I learned that my grandfather had been arrested on Kristallnacht, November 9, 1938, and imprisoned in Dachau. My grandmother went to high school with one of the administrative guards at Dachau. He accepted a bribe from her, and my grandfather was released after six months. In 1999, my parents were interviewed as part of Steven Spielberg’s Shoah project. In the course of the interview my mother brought out her identity papers, marked “Jew,” and her nursing certificate, stamped with a swastika. My brother and I had never seen these artifacts.\n\nGrowing up as a child of survivors, I had a sense of mission about the Holocaust, but didn’t know how that would manifest. Now in my seventies, I find that in writing Life in a Jar, and speaking about it to new audiences, I am fulfilling that mission.\n\nIn my talks, sponsored by the Vermont Humanities Council, I emphasize how Sendler and the girls from Kansas were repairing the world—tikkun olam in Hebrew. Few of us would have the courage to do what Sendler did, but all of us can do what Liz, Megan, and Sabrina did—performing small acts of decency and respect for all people. Acts that change the world."}, {"url": "https://www.npr.org/templates/story/story.php?storyId=90576235", "page_content": "Remembering Irena Sendler: A Humble Heroine\n\nThe Polish Catholic social worker, who helped save thousands of Jewish children during World War II, died last week. Guy Raz recalls his interview with Sendler in Warsaw, nearly ten years ago. She did not see herself as \"newsworthy,\" he says.\n\nANDREA SEABROOK, host:\n\nIf not for the courage of Irena Sendler, 2,500 Jewish children might never have survived World War II. Irena Sendler, who died last week in Poland, was a Polish Catholic social worker who smuggled those kids out of the Warsaw ghetto. NPR's Guy Raz met her back in 2000 at a retirement home outside Warsaw, and he filed this appreciation.\n\nGUY RAZ: Irena Sendler would have fiercely rejected the idea that her death might be newsworthy. In fact, she'd be embarrassed by the attention. She said as much eight years ago when I went to meet Irena with my Polish translator, a women named Pia Ruzinech(ph).\n\nMs. IRENA SENDLER (Late Social Worker): (Through translator) She kept saying that she's extremely moved by your visit and that she really has done nothing to earn it.\n\nRAZ: The sanatorium where she lived on the outskirts of Warsaw was built in the 1920s. It smelled of disinfectant. At that time, Irena Sendler was already in bad health but still fiercely lucid. She was a tiny little thing, barely five feet and yet a towering person. A Polish Catholic who could have kept to herself quietly out of the way, away from the German soldiers who occupied the city after 1939.\n\nBut she was drawn to the Jewish ghetto. Nearly half a million Jews were forced to live there, at the time the most densely populated place on Earth.\n\nMs. SENDLER: (Through translator) I started going to the ghetto to check up on some friends. I had a pastor come and go because I was a social worker. I'd bring them food and jam, sometimes meat or sugar. The more I went, the more I'd see people I knew and they were suffering terribly.\n\nRAZ: By 1942 the Nazis began to systematically deport Poland's Jews to death camps. Irena Sendler joined a Polish resistance movement called Zegota. She decided she'd try to smuggle as many children out from the ghetto as possible.\n\nMs. SENDLER: (Through translator) I used my connections to find out which houses the Nazis would target the next morning. The night before, I'd visit with the parents and try and convince them that I could save their children. Some of the parents trusted me and others didn't.\n\nRAZ: The children of the parents who did trust her were hidden with sympathetic Polish families and in convents. Sendler gave them all non-Jewish names to conceal their identities from the Germans. But she wanted to make sure the kids would know who they really were after the war, so she wrote as many details as she knew about each child on a piece of paper. She put the paper inside a glass jar and bury in a garden near her home.\n\nOver two years, she buried more than 2,000 bottles. The story was largely forgotten until a group of high school students from Kansas rediscovered it about a decade ago. They wrote a play about Sendler's life and performed it here at NPR in 2000.\n\nUnidentified Woman: Irena, what are you doing? Are you mad? You can't leave any evidence for the Nazis to find. You will get caught. You will get caught.\n\nRAZ: The students, Megan Stewart, Elizabeth Cambers, Sabrina Coons and Janine Underwood, performed the play across the country. They raised thousands of dollars to help pay Irena Sendler's medical bills. By then Irena had already been honored by the Polish government and by the state of Israel. She'd managed to help transport many of the children she saved to Israel.\n\nMs. SENDLER: (Through translator) After the war, I dug out the jars from the garden and I took them to the head of the Jewish organization in Warsaw. He then got in touch with people in Israel who helped bring the children there.\n\nRAZ: The Polish Senate nominated Irena Sendler for the Nobel Peace Prize last year. They held a celebration in her honor but she was too frail to attend, so she sent letter, once again, asking why so much fuss over a simple old lady.\n\nGuy Raz, NPR News.\n\n(Soundbite of music)\n\nSEABROOK: You'll hear a lot from Guy over the next two weekends. He'll be hosting the show while I take some time off.\n\nCopyright © 2008 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}, {"url": "https://www.ourbiography.com/irena-sendler/", "page_content": "Irena Sendler\n\nIrena Sendler was a Polish social worker who, during World War II, helped to rescue 2,500 Jewish children from the Warsaw Ghetto, and placed them in convents or with non-Jewish families.\n\nSynopsis\n\n\n\nIrena Sendler was born in Otwock, Poland, in 1910. When the Nazis invaded in 1939, Irena was a social worker and so had access to the Warsaw Ghetto, where hundreds of thousands of Jews were imprisoned. As a member of Żegota (aka Konrad Żegota Committee, the Council to Aid Jews), she helped rescue 2,500 Jewish children from the ghetto. For her courageuos actions during the Holocaust, in 1965, Israel’s Yad Vashem honored her as “Righteous Among the Nations.” Sendler died in Warsaw in 2008.\n\nEarly Life\n\nIrena Sendler was born Irena Krzyżanowska on February 10, 1910, in Otwock, Poland. Her parents were members of the Polish Socialist Party, and her father, Stanisław Krzyżanowski was a medical doctor who died of typhus when Irena was a child. In 1931 Irena married Mieczysław Sendler, and the couple moved to Warsaw before the outbreak of World War II.\n\nWarsaw Ghetto\n\nIn Warsaw, Sendler became a social worker, overseeing the city’s “canteens,” which provided assistance to people in need. When the Nazis invaded Poland in 1939, Sendler and her colleagues also used the canteens to provide medicine, clothing and other necessities to the city’s persecuted Jewish population.\n\nIn 1940, the Nazis forced Warsaw’s more than 400,000 Jewish residents into a small locked ghetto area, where thousands died every month from disease and starvation. As a social worker, Sendler was able to enter the ghetto regularly to help the residents and soon joined Żegota, the Council to Aid Jews. Putting themselves at great risk, she and about two dozen of her colleagues set out to save as many Jewish children as possible from death in the ghetto or deportation to concentration camps.\n\nŻegota began by saving Jewish orphans. They had several ways of smuggling them out of the ghetto: Some were carried out in caskets or potato sacks; others left in ambulances or snuck out through underground tunnels. Still others entered the Jewish side of a Catholic church that straddled the ghetto boundary and left on the other side with new identities. Sendler then helped place the children at convents or with non-Jewish families.\n\nAs the situation became more dire for the ghetto’s inhabitants, Sendler went beyond rescuing orphans and began asking parents to let her try to get their children to safety. Although she couldn’t guarantee the children’s survival, she could tell parents that their children would at least have a chance. Sendler kept detailed records and lists of the children she helped buried in a jar. Her plan was to reunite the rescued children and their parents after the war. However, most of the parents did not survive.\n\nOn October 20, 1943 , the Nazis arrested Sendler and sent her to Pawiak Prison. There they tortured her, trying to get her to reveal the names of her associates. She refused and was sentenced to death. However, Żegota members bribed the prison guards, and Sendler was released in February 1944.\n\nSendler continued her work until the war ended, by which time she and her colleagues had rescued some 2,500 children. It has been estimated that Sendler personally saved about 400.\n\nPersonal Life\n\nAfter the war, Irena Sendler’s first marriage ended in divorce. In 1947 she married Stefan Zgrzembski, with whom she had three children, daughter Janka, and sons Andrzej (who died in infancy) and Adam. After the death of Zgrzembski, Sendler remarried her first husband, Mieczysław Sendler, but their reunion didn't last and they again divorced.\n\nHonors and Awards\n\nIn 1965, Yad Vashem, Israel’s Holocaust memorial organization, named Irena Sendler as Righteous Among the Nations for her work saving Jewish children. In 2003, Poland honored her with its Order of the White Eagle. In 2008, Sendler was nominated for (but did not win) a Nobel Peace Prize. The story of her life was also captured in a 2009 TV movie The Courageous Heart of Irena Sendler, which starred Anna Paquin in the title role.\n\nSendler died on May 12, 2008, in Warsaw, Poland, at the age of 98."}, {"url": "https://www.accidentaltalmudist.org/heroes/2023/03/14/polish-social-worker-irena-sendler/", "page_content": "Irena Sendler was a Polish humanitarian who led a mission to smuggle Jewish children out of the Warsaw Ghetto and provide them with safe shelter and fake identity documents. Born Irena Kryzanowski in Warsaw in 1910, Irena was raised in a Catholic family. Her father Stanislaw was a physician, but made very little money because he provided his services for free to the poor, including many Jews. In 1917, Irena’s father contracted typhus from his patients and died. The local Jewish community raised a sizable donation to support the good doctor’s widow Janina and daughter, but Irena’s mother declined, not wanting to accept charity. Janina moved to the less expensive town of Tarczyn and worked hard to raise her daughter, an exceptionally kind and intelligent child.\n\nAfter graduating from high school, Irena began a course of study in law and Polish literature at the University of Warsaw. Because she also had to work, it took her ten years to receive her degree. During her years at university, Irena was spurred to activism by the discrimination she witnessed against her Jewish classmates. She vocally opposed “ghetto benches” – separate seating areas for Jewish students on campus instituted in the 1930’s. Irena also crossed out the “non-Jewish” identification mark on her student ID. Because of these small acts of resistance, Irena was labeled as a philo-Semite and a radical. For her remaining time in school, she was harassed and blacklisted from employment at any school in Warsaw.\n\nIn the early 1930’s, Irena joined a group of social workers led by Professor Helena Radlinska who were doing humanitarian work to help the very poor. She worked at a clinic servicing destitute single mothers and provided legal as well as social work and nursing aid. The clinic was later incorporated into the Warsaw government. Irena became a public health official in the Department of Social Welfare. She married Mieczyslaw Sendler in 1931. As looming clouds of war darkened Eastern Europe, Mieczyslaw was drafted into the Polish army. After the German occupation of Poland in 1939, Mieczyslaw was captured by the Germans and was imprisoned in a POW camp until World War II ended in 1945.\n\nMeanwhile, the German occupation government ordered all Jews working for the Department of Social Welfare to be fired. All other employees of the department were forbidden from helping Jews in any way. Irena and her social worker friends were helping sick and wounded Polish soldiers. To help them get aid, she began creating false medical documents. Soon, and without anybody else knowing, Irena was creating another kind of false document: identity papers “proving” the Aryan identity of Polish Jews.\n\nIn 1940, the Nazis forced 400,000 Jews into the squalid, overcrowded Warsaw Ghetto, where life quickly became a hell on earth as ghetto residents found it increasingly difficult to procure food, water, and medical supplies. In her capacity as a public health official, Irena obtained a special permit to enter the ghetto, ostensibly to check for typhus. Irena and her co-worker Irena Schultz began secretly transporting medical and hygiene supplies into the ghetto, and soon was bringing food as well. Her feisty personality helped her overcome many obstacles. She had many Jewish friends who were trapped inside the ghetto, and on her daily humanitarian visits Irena was horrified at the suffering she witnessed. Every day residents died of starvation, or were shot in the street by Nazi soldiers and left to rot. Irena continued her visits, even after October 1941, when a new law made helping Jews a crime punishable by death, not just for the person providing the aid but for that person’s entire family or household. This draconian law stopped most Poles from helping Jews, but Irena only intensified her humanitarian efforts. She wore a Star of David necklace while in the ghetto as a sign of solidarity.\n\nIrena was determined to do more to help Jews in the ghetto, especially children. As Nazi persecution intensified in 1942, thousands of Jews were deported to concentration camps. Displaying great bravery and ingenuity, Irena smuggled babies and toddlers out of the ghettos using disguise and misdirection to throw off the German authorities. She continued her work creating fake documents and finding safe places for Jews to hide. In September 1942, Irena was involved in the creation of Zegota, the Council to Aid Jews. At this point, tragically, most Polish Jews had already been murdered. The money and resources raised by Zegota from Poles sympathetic to the resistance went to maintain Jews already in hiding. Irena stayed in close contact with the Jews she was helping. During the 1943 Warsaw Ghetto Uprising, Irena set up emergency shelters while other members of Zegota produced identity papers and found more permanent hiding places.\n\nKnown by the “nom de guerre” Jolanta, Irena ran the children’s division of Zegota. She created partnerships with Polish convents, where she knew Jewish children would be safe. The children were given Christian names and taught Christian prayers to avoid detection, but it was important to Irena that the youngsters not lose their Jewish identities. She meticulously documented each child’s true name, family, and location so that she could reunite them with surviving family members after the war. She buried the lists of children in mason jars under the floorboards of her home.\n\nIrena was arrested by the Gestapo in October 1943. She was taken to headquarters, where she was beaten by Nazi stormtroopers trying to get the names of other people helping Jews. The Nazis also wanted the names and addresses of hidden Jewish children. Even during torture, Irena did not betray any of the children or resistance workers. On November 13, Irena was transported to another location where she was to be executed by firing squad. Miraculously, activist Maria Palester, working with Zegota, raised money to bribe Irena’s guards. Irena was able to escape at the very last minute. She returned to Warsaw and went into hiding for a brief period, emerging in December to continue her activities as head of the children’s division of Zegota.\n\nDuring this time, Irena served as a nurse in a field hospital in Warsaw, where she tended to wounded Polish soldiers. She also hid several Jews in that hospital. When the Germans finally fled Warsaw as the Russian army closed in, Irena worked with Maria Palester to transform the field hospital into an orphanage. Irena retrieved the jars with lists of Jewish children, but tragically almost none of their parents were still living, having been transported to Treblinka, a notorious death camp where over 870,000 Jews were murdered in the gas chambers. Irena worked to reunite the Jewish orphans with “their nation” and many wound up in Israel.\n\nAfter the war, continued her work in the Social Welfare Department, where she focused on helping orphans, teenage prostitutes, and destitute families. She received many accolades and honors for her heroic actions during the war and was honored as Righteous Among the Nations by Israeli Holocaust Memorial Yad Vashem in 1965.\n\nFor saving Polish Jews during the Holocaust, including many children, we honor Irena Sendler as this week’s Thursday Hero."}, {"url": "https://encyclopedia.ushmm.org/content/en/oral-history/irena-sendler-describes-how-she-was-arrested-and-tortured-by-the-gestapo", "page_content": "Irena Sendler (1910–2008) was a member of the Council for Aid to Jews, codenamed “Żegota.” Żegota was a clandestine rescue organization of Poles and Jews in German-occupied Poland. Supported by the Polish government-in-exile, Żegota coordinated efforts to save Jews from Nazi persecution and murder. It operated from 1942 to 1945.\n\nIrena Sendler (Sendlerowa) was working as a social worker in Warsaw when World War II broke out in 1939. After the Nazis forced Warsaw’s Jews to move into the ghetto in the fall of 1940, Irena used her position and prewar network to supply food and offer financial assistance to Jews. By early 1943, Irena had joined Żegota. Żegota members secured hiding places for Polish Jews. They also delivered money, food, false identity documents, and medical assistance to those in their care.\n\nUnder the alias “Jolanta,” Irena helped smuggle several hundred Jewish children out of the Warsaw ghetto. She found hiding places for them in orphanages, convents, schools, hospitals, and private homes. Irena provided each child with a new identity. She carefully recorded their original names and placements in code so that relatives could find them after the war. In the fall of 1943, Irena was appointed head of Żegota’s children's section. Only a few days later, she was arrested by the Gestapo (German secret state police). The Gestapo brutally beat and tortured her. Nonetheless, Irena never revealed the names of the children or her colleagues. She was later released from the Gestapo prison thanks to a bribe organized by her fellow rescuers. Despite the dangers, Irena continued working with Żegota under a new alias.\n\nIrena Sendler survived the war. In 1965, Yad Vashem recognized her as “Righteous Among the Nations.”\n\nIn this interview, Irena Sendler describes how she was arrested and tortured by the Gestapo."}, {"url": "https://www.ushmm.org/information/press/in-memoriam/irena-sendler-1910-2008", "page_content": "The United States Holocaust Memorial Museum mourns the passing of Irena Sendler, a Polish social worker who helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto during the Holocaust.\n\nAs head of the children’s section of Żegota, the Polish underground Council for Aid to Jews, Irena (“Jolonta”) Sendler regularly used her position as a social worker to enter the Warsaw ghetto and help smuggle children out. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their original names and placements so that surviving relatives could find them after the war.\n\nArrested and tortured by the Gestapo (the German secret state police) in the fall of 1943, she was sentenced to death, but Żegota managed to rescue her before she could be executed. She assumed a new identity and continued her work for Żegota.\n\nYad Vashem recognized Ms. Sendler with the Righteous Among the Nations medal in 1965. She died in Warsaw, Poland, on May 12, 2008, following a long illness."}, {"url": "https://www.cswe.org/centers-initiatives/kendall-institute/international-social-work-leader-review/previously-featured-social-work-leaders/irena-sendler/", "page_content": "Irena Sendler (1910–2008)\n\n\n\nIrena Sen dlerowa (Krzyżanowska) was born in 1910 in Warsaw, Poland, to Stanislaw Krzyżanowska and Janina Karolina Grzybowska. Her grandfather led a rebellion against the czars. Her father—noted as one of the primary Polish socialists—died after contracting typhus when Irena was a young child. He worked as a doctor and primarily served impoverished individuals and families. Many sources say Irena drew a great deal of inspiration from her father’s selfless aspirations to help others in need. In fact, Sendler once wrote, “I was raised to believe that the question of religion, nation, belonging to any race is of no importance—it’s a human being that matters!” (Pikuci, 2020).\n\n\n\nAs a teenager, Irena attended the University of Warsaw, during which time she further developed her passion for the helping profession. Having been raised alongside many Jewish families, she expressed strong opinions about the economic and social inequality this population faced and was appalled at the poor conditions of ghettos. She joined variety of socialist and communist organizations, which ultimately shaped her views in a more radical way.\n\n\n\nIrena married three times. Her first marriage to Mieczyslaw Sendler lasted for 13 years before they divorced in 1947. She then married a long-time friend, Stefan Zgrzembski, and had three children—daughter Janka and sons Adam and Andrzej (who unfortunately died during infancy). After Zgrzembski abandoned the family, Irena remarried her first husband. However, their second marriage did not last, and they divorced once again.\n\n\n\nIrena became a social worker and a nurse. She was not known as one of the international leaders of social work. However, in recent years she has been widely acknowledged for her work assisting others by saving the lives of hundreds of children. Some reports suggesting almost 2,500 children.\n\n...\n\n\n\nIn recent years, Sendler received the following awards and recognition: Order of the White Eagle (2003); Jan Karski Price (2003); Blessing by Pope John Paul II; Polonis Restitutna (Order of Poland Restored); Krzyz Komaniaiazda z Gwiazda Orderu Odrodzenia Polski (Commander with a star); Order of Smile (2007, given by Children), and Honorary citizenship of Israel (Wieler, 2008). She was nominated for the Nobel Peace Prize in 2007.\n\n\n\nAmong the most notable of her recognitions, in 2006 the International Federation of Social Workers awarded Irena Sendler the Most Distinguished Social Worker award. The award was accepted on her behalf by the president of the Association of Children of the Holocaust, Elzbieta Ficowska, one of the youngest children saved by Sendler and her colleagues. She read the following from a letter of acceptance (Wieler, 2008):\n\n\"I have dedicated my entire life to social work and to the survival of the most needed. With the acceptance of this award I need to let you know that without the help of many co-workers and other helpful people I would have not been able to accomplish as much as I did. The concrete action of a social worker requires professionalism, devotion, tenacity and much heart. Through helpful actions one feels much empathy and on the other hand much joy and satisfaction. (p. 838)\"\n\n\n\nSendler had deep connections to social education and practice. She worked with Helena Radlinska—the founder and director of the first school of social work—by providing placements for her students. She knew Alice Salomon and other pioneers of social work in Europe and worldwide. Irena’s selfless work, without thinking about the consequences, correlates nicely with the ethical principles of the NASW Code of Ethics. Her dedication to the dignity and worth of a person truly exemplifies the transformative nature of social work.\n\n\n\nResources\n\nBülow, L. (n.d.) The Holocaust. http://www.auschwitz.dk/sendler.htm\n\n\n\nLife in a Jar: The Irena Sendler Project. (n.d.). https://irenasendler.org/facts-about-irena\n\n\n\nPicuki. (n.d.). The courageous heart of Irena Sendler. https://www.picuki.com/media/2244585986742660086\n\n\n\nVashem, Y. (2020). Irena Sendler. https://www.yadvashem.org/yv/en/exhibitions/righteous-women/sendler.asp\n\n\n\nWieler, J. (2008). Brief note: Remembering Irena Sendler. International Social Work; 51, 835–840. https://doi.org/10.1177/002087280895254\n\n\n\nAdditional Videos\n\nThe Irena Sendler Project: Life in a Jar: https://www.youtube.com/watch?v=zHod5WVDWEA\n\n\n\nIrena Sendler: The Polish woman who saved 2,500 Jewish children: https://www.youtube.com/watch?v=vg4deegQxH4\n\n\n\nThe Irena Sendler Project, Megan Felt, TEDxOverlandPark: https://www.youtube.com/watch?v=TRFcrvVRb3o\n\n\n\n\n\nFor the full review, afterward by the co-authors, references, and additional publications, click here."}], "Irena Sendler was a humanitarian.": [{"url": "https://www.biography.com/activist/irena-sendler", "page_content": "(1910-2008)\n\nWho Was Irena Sendler?\n\nWhen the Nazis invaded in 1939, Irena Sendler was a social worker and so had access to the Warsaw Ghetto, where hundreds of thousands of Jews were imprisoned. As a member of Żegota (aka Konrad Żegota Committee, the Council to Aid Jews), she helped rescue 2,500 Jewish children from the ghetto. For her courageous actions during the Holocaust, in 1965, Israel’s Yad Vashem honored her as “Righteous Among the Nations.” Sendler died in Warsaw in 2008.\n\nEarly Life\n\nSendler was born Irena Krzyżanowska on February 15, 1910, in Otwock, Poland. Her parents were members of the Polish Socialist Party, and her father, Stanisław Krzyżanowski was a medical doctor who died of typhus when Sendler was a child. In 1931 Sendler married Mieczysław Sendler, and the couple moved to Warsaw before the outbreak of World War II.\n\nWarsaw Ghetto\n\nIn Warsaw, Sendler became a social worker, overseeing the city’s “canteens,” which provided assistance to people in need. When the Nazis invaded Poland in 1939, Sendler and her colleagues also used the canteens to provide medicine, clothing and other necessities to the city’s persecuted Jewish population.\n\nIn 1940, the Nazis forced Warsaw’s more than 400,000 Jewish residents into a small locked ghetto area, where thousands died every month from disease and starvation. As a social worker, Sendler was able to enter the ghetto regularly to help the residents and soon joined Żegota, the Council to Aid Jews. Putting themselves at great risk, she and about two dozen of her colleagues set out to save as many Jewish children as possible from death in the ghetto or deportation to concentration camps.\n\nŻegota began by saving Jewish orphans. They had several ways of smuggling them out of the ghetto: Some were carried out in caskets or potato sacks; others left in ambulances or snuck out through underground tunnels. Still others entered the Jewish side of a Catholic church that straddled the ghetto boundary and left on the other side with new identities. Sendler then helped place the children at convents or with non-Jewish families.\n\nAs the situation became more dire for the ghetto’s inhabitants, Sendler went beyond rescuing orphans and began asking parents to let her try to get their children to safety. Although she couldn’t guarantee the children’s survival, she could tell parents that their children would at least have a chance. Sendler kept detailed records and lists of the children she helped buried in a jar. Her plan was to reunite the rescued children and their parents after the war. However, most of the parents did not survive.\n\nOn October 20, 1943, the Nazis arrested Sendler and sent her to Pawiak Prison. There they tortured her, trying to get her to reveal the names of her associates. She refused and was sentenced to death. However, Żegota members bribed the prison guards, and Sendler was released in February 1944.\n\nSendler continued her work until the war ended, by which time she and her colleagues had rescued some 2,500 children. It has been estimated that Sendler personally saved about 400.\n\nPersonal Life\n\nAfter the war, Sendler’s first marriage ended in divorce. In 1947 she married Stefan Zgrzembski, with whom she had three children, daughter Janka, and sons Andrzej (who died in infancy) and Adam. After the death of Zgrzembski, Sendler remarried her first husband, Mieczysław Sendler, but their reunion didn't last and they again divorced.\n\nHonors and Awards\n\nIn 1965, Yad Vashem, Israel’s Holocaust memorial organization, named Sendler as Righteous Among the Nations for her work saving Jewish children. In 2003, Poland honored her with its Order of the White Eagle. In 2008, Sendler was nominated for (but did not win) a Nobel Peace Prize. The story of her life was also captured in a 2009 TV movie The Courageous Heart of Irena Sendler, which starred Anna Paquin in the title role.\n\nDeath\n\nSendler died on May 12, 2008, in Warsaw, Poland, at the age of 98.\n\nQUICK FACTS\n\nBirth Year: 1910\n\nBirth date: February 15, 1910\n\nBirth City: Otwock\n\nBirth Country: Poland\n\nGender: Female\n\nBest Known For: Irena Sendler was a Polish social worker who, during World War II, helped to rescue 2,500 Jewish children from the Warsaw Ghetto, and placed them in convents or with non-Jewish families.\n\nAstrological Sign: Aquarius\n\nDeath Year: 2008\n\nDeath date: May 12, 2008\n\nDeath City: Warsaw\n\nDeath Country: Poland\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.holocaustmatters.org/irena-sendler/", "page_content": "Irena Sendler was a Polish social worker, nurse, and director of the children’s department for the Council for Aid to Jews, Zegota (an underground resistance group during WWII). She has been recognized by Yad Vashem as a Righteous Among the Nations, and awarded the Jan Karski for Valor and Courage.\n\nTo say the least, Irena Sendler is an inspiring humanitarian with a fascinating life story; her incredible courage and bravery saving the lives of many Jewish people throughout WWII. In this piece, we will be exploring the life of this influential figure, and her part to play during the Holocaust.\n\nFor more information on the Holocaust, and other influential figures throughout it, please click here.\n\nEarly Life\n\nBorn in Warsaw on the 15th of February 1910, Irena Sendler (or Irena Kryzyzanowski at the time) was the daughter of Janina and Dr Stanislaw Kryzyzanowski. Although born in Warsaw, Irena grew up in a town near the city called Otwock, and was an only child.\n\nHer father (Dr Stanislaw Kryzyzanowski) died from typhus, which he contracted whilst treating patients, when Irena was only seven years old. Stanislaw, although dying when Irena was very young, had a profound impact on the life values she carried throughout her life, claiming that through her father “I was taught that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.”\n\nAfter Stanislaw’s death, many leaders in the Jewish community helped to fund Irena’s education, which lead her to study at Warsaw University in Polish Literature.\n\nDuring her time at university, Irena disagreed with the ghetto bench system that had already been established in some of the universities prior to the war. In reaction to this, she vandalised her grade card and was consequently put on a three year-long suspension from the university.\n\nThis was not the last of Irena’s protests against Jewish discrimination, but rather the beginning to her humanitarian career, fighting for the lives of Jewish people throughout the Holocaust.\n\nHow Did Irena Sendler Help During the War?\n\nEven in the very beginnings of WWII, as the Germans invaded Irena’s birthplace of Warsaw, she started to help the city’s Jews, providing them with food and water. However, once the ghetto was built within the city this cut off Irena’s access to those who needed her aid. She then started to plan out another way in which to help.\n\nOnce the Warsaw Ghetto was established in the year 1940, Irena then started to smuggle out orphaned children. She used her status as a social worker, in addition to documentation from an employee at the Contagious Disease (who also became a part of the underground group Zegota) to gain access into the Warsaw Ghetto, and access to the orphaned children who lived in it.\n\nAfter the underground Polish resistance group for the Provisional Committee for Aid to Jews (Zegota) was established in 1942. Irena was soon appointed as head of its children’s division. During her position with Zegota, Irena and her team helped to rescue around 2,500 Jewish children from the Warsaw Ghetto. There were four main ways in which Irena’s team would smuggle out children from the ghetto, these being as follows:\n\nSmuggled through an old courthouse next to the ghetto.\n\nEscape through underground passages such as the sewer.\n\nHide in a luggage bag and then carried out by a trolley.\n\nVia ambulance; hidden under stretchers, faking illness or genuinely being ill.\n\nThose rescued were sent to numerous different orphanages and religious institutions that took in vulnerable children. Irena used her contacts with these places to smuggle the children in under false names. Some of the main places these children were smuggled into included the Rodzina Marii Orphanage, and religious institutions in and around Chotomow, Turkowice and Lublin.\n\nWhy Was Irena Sendler Imprisoned?\n\nOn the 20th of October 1943, Irena was arrested, and sent to Piawiak prison. During her time in imprisonment she was tortured for information on the other members of Zegota, and Irena fed the interrogators false information. Irena was then sentenced to death, however did not fulfil this sentence as her fellow Zegota members bribed workers in the prison to let her escape.\n\nThe day after Irena’s escape, Nazi officials interestingly announced that she had been shot, with posters with this false news dotted all around Warsaw. Irena was in hiding throughout the rest of the war, and once over, started to try and connect the children she had saved with their parents. Unfortunately, nearly all of these parents had been killed during the holocaust.\n\nLater Life\n\nWhen the war was over, Irena carried on her career as a social worker. She received numerous awards for her outstanding bravery and courage; these included the previously mentioned Yad Vashem’s Righteous Among the Nations, and Jan Karski’s Valor and Courage. In addition to these, Irena was also awarded Poland’s Order of the White Eagle, and has been a nominee for the Nobel Peace Prize.\n\nIrena then spent the latter part of her life cared for in Warsaw by a woman called Elzbieta Ficowska. Eizbieta was one of the children (six months old at the time) Irena had smuggled out of city’s ghetto.\n\nIrena has remarked on her actions during the war, stating that “We who were rescuing children re not some kind of heroes. That term irritates me greatly. The opposite is true – I continue to have qualms of conscience that I did so little. I could have done more. This regret will follow me to my death.”"}, {"url": "https://www.ushmm.org/information/press/in-memoriam/irena-sendler-1910-2008", "page_content": "The United States Holocaust Memorial Museum mourns the passing of Irena Sendler, a Polish social worker who helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto during the Holocaust.\n\nAs head of the children’s section of Żegota, the Polish underground Council for Aid to Jews, Irena (“Jolonta”) Sendler regularly used her position as a social worker to enter the Warsaw ghetto and help smuggle children out. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their original names and placements so that surviving relatives could find them after the war.\n\nArrested and tortured by the Gestapo (the German secret state police) in the fall of 1943, she was sentenced to death, but Żegota managed to rescue her before she could be executed. She assumed a new identity and continued her work for Żegota.\n\nYad Vashem recognized Ms. Sendler with the Righteous Among the Nations medal in 1965. She died in Warsaw, Poland, on May 12, 2008, following a long illness."}, {"url": "https://www.neh.gov/article/irena-sendler-and-girls-kansas", "page_content": "Between 1942 and 1943, Sendler and her network of 10 compatriots rescued 2,500 Jewish children from the Warsaw ghetto. Disguised as an infection-control nurse, Sendler knocked on doors in the ghetto, asking parents and grandparents to give up their children and grandchildren so that she could smuggle them out. Each child was given a new Polish name and forged identity papers and hidden in foster homes, orphanages, or convents. Sendler insisted that lists of the children be kept, documenting their Jewish and Polish names, so that after the war they would know their original identities. She hid the lists in milk jars that were buried in the backyard of one of her co-conspirators.\n\nPhoto caption A young Irena Sendler, in Warsaw, circa 1930. — AF Fotografie / Alamy Stock Photo\n\nAfter the war, Poland’s Communist government persecuted members of Poland’s wartime resistance, Zegota, of which Sendler was a part. They were harassed, interrogated, imprisoned, and even executed. Sendler and others who rescued Jews during the war kept silent. Almost no one knew of Sendler and her heroism.\n\nShe would have remained an unsung hero were it not for three teenage American girls who discovered her forgotten story 60 years later. Liz, Megan, and Sabrina, who began as students of history for a National History Day competition, became recorders of history, championing Sendler’s legacy in Poland, the U.S., and around the world. Three teenagers from rural Kansas helped crack open the silence about the Holocaust in Poland.\n\nMy first brush with this story came in the winter of 2001, in my Middlebury, Vermont, pediatric office, while going through my mail. This was before the electronic health record, and I daily triaged a prodigious stack of paper. Everything had about three seconds to be kept, filed, recycled, or thrown away.\n\nI am a member of the U.S. Holocaust Memorial Museum (USHMM). Each year I send a contribution, and they send me a calendar highlighting 12 monthly Holocaust heroes. As I quickly flipped through, I was brought up short by the November entry. It was the photo that stopped me—a young Irena Sendler, twenty-nine years old, who looked a lot like my niece. I read the short paragraph below the photo:\n\nIrena Sendlerowa, (1916–UNKNOWN) As head of the children’s division of Zegota, the Polish underground Council for Aid to Jews, social worker Irena Sendlerowa (code name “Jolanta”) helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their Jewish names and placements so that surviving relatives could find them after the war. Arrested by the Gestapo in the fall of 1943, Sendlerowa was sentenced to death. Zegota rescued her before her execution. She assumed a new identity and continued her work for Zegota.\n\nI was stunned. I’m a child of Holocaust survivors. How could I not know Irena Sendler’s story? Everybody knows Oskar Schindler, who rescued 1,100 Jews from a German concentration camp in Poland and whose story was told in the Steven Spielberg film Schindler’s List. Even at the USHMM, the preeminent scholars of the Holocaust didn’t know much about Sendler. They had her birth year wrong (it was 1910, I later found out), and they didn’t know if she was still alive.\n\nI kept this calendar in a file labeled “Interesting Stuff.” And there it sat for almost three years.\n\nPhoto caption These children rescued by Sendler were sent to live with new identities at a Polish convent, circa 1943. — World History Archive / Alamy Stock Photo\n\nThen, in February 2004, I came into my office one night to see a sick child. On my desk someone had left a copy of the Ladies Home Journal, opened to an article, “The Woman Who Loved Children.” It was about Irena Sendler and three Kansas teens who uncovered her story. The article explained that, in 1999, while planning a National History Day project, they found a brief reference to Sendler in a U.S. News and World Report article entitled “The Other Schindlers.” Sendler’s story inspired their NHD project: a play they wrote and performed called Life in a Jar. It retold, in dramatic form, the emotional story of Sendler knocking on ghetto doors and asking Jewish parents to give up their children to save them. The title, Life in a Jar, refers to the lists Sendler buried.\n\nThe teens read that Irena had been arrested in 1943 by the Gestapo and tortured in Pawiak Prison, the most notorious prison in the ghetto, from which almost no one escaped. Logically, they began searching cemetery records and reached out to the Jewish Foundation for the Righteous, seeking information about where she might be buried. Soon after, they received a letter from the foundation, saying that Sendler was alive! She was in her nineties and living in poverty with her daughter-in-law in Warsaw. The foundation then put them in touch with Sendler.\n\nThe three students made plans to travel to Poland and meet Sendler, first trying to raise money through candy sales, until philanthropists and Holocaust survivors from the Kansas City Jewish community stepped in to help cover the trip. Traveling out of the country for the first time (the first time on a plane for one of them), the girls finally met Sendler at her Warsaw home in 2001. They maintained a tender friendship with her for the next seven years until she passed, making several trips to Poland to visit her, each time performing Life in a Jar at various venues. And they began working with Polish high school students who were telling the forgotten stories of rescuers from their own communities.\n\nPhoto caption The original three students—Liz,Megan, and Sabrina—are joined by Jessica Shelton-Ripper (third from left), who performed many times with Life in a Jar. Here they visit the Irena Sendler exhibit at the Lowell Milken Center for Unsung Heroes in Fort Scott, Kansas, in 2018. — Kenny Felt\n\nAs I read the Ladies Home Journal article, I remembered the USHMM calendar. This story now took on a new dimension. I have been a closet writer most of my life, and I was thinking about writing a novella about the Warsaw ghetto. Irena Sendler seemed like a compelling character, and I wanted to know more about her. I was also intrigued by the two stories—Irena’s wartime history and the contemporary story of three Kansas teens. I called their teacher in Kansas, Norm Conard.\n\n“It’s serendipitous that you should call,” he said. “We’re looking for someone to write these two stories.”\n\nI hesitated. I had not written nonfiction before, only fiction and poetry. But I felt the powerful synergy of these two stories. I was not eager to write a wartime history of a Holocaust hero because most Holocaust literature leaves me angry, sad, depressed, and frustrated. But this story was different—an inspiring story of three typical American teenagers who helped restore the history of a great hero.\n\nI agreed to write the story and, in 2004, visited Uniontown, Kansas, where the girls went to school. A small town with a population of 264, it was down on its luck. Many stores were shuttered. It had the look of a Dorothea Lange or Walker Evans black-and-white photo from the Depression. I met Norm and the girls at the high school, and I was hooked.\n\nUniontown High School, with only about 120 students, is one of the lowest-income school districts in Kansas. There was no diversity in the school—never a Jew, an African American, or even a Catholic—yet these teens had discovered Sendler’s story and told the world. I spent a week interviewing the students, their families, their teacher, community members, and Holocaust survivors from Kansas City who had taken a great interest in the play and the Irena Sendler project.\n\nMy wife and I accompanied the students and Conard to Poland on their third visit, in 2005. I was able to do more extensive research and interview Sendler, Holocaust scholars, and some of the children Sendler had rescued, now in their sixties and seventies. We met Elzbieta Ficowska, rescued as a six-month-old infant. Sendler had sedated her and put her in a carpenter’s box. Her parents kissed their baby good-bye and left a small spoon in the box with her name inscribed on one side and her birthdate on the other. It is the only memento of her parents, who were murdered at Treblinka. She and I have become good friends, and I have held her spoon many times, always with tears. Ficowska became one of Sendler’s caregivers and the chairperson of the Association of Children of the Holocaust in Poland.\n\nIt was Sendler’s ninety-fifth birthday when I interviewed her. She was energetic, and her memory was clear and specific. She wanted to be sure that I credited all of her network of rescuers and liaisons. She ensured that I had everyone’s name spelled correctly.\n\nPhoto caption Megan took this picture of Sendler on May 3, 2008, during a visit to Poland. Sendler passed away nine days later on May 12. — Megan Felt\n\nPoland was arguably the most victimized country in occupied Europe. The consequence for hiding or even feeding a Jew was execution, often in public as a warning to other Poles. When I asked Sendler why she put herself and her family at such risk, she said, “It was a need of my heart.” She rejected the appellation of hero. “I only did what any decent person would do. . . . The heroes were the babies—they were the heroes of their mothers’ hearts. . . . It was the parents and grandparents who gave up their children, they were the true heroes.”\n\nShe said it was her father’s teaching that inspired her. “If you see someone drowning you must rescue them, even if you cannot swim.” And “there are only two kinds of people in the world, good and bad, regardless of race, religion, or creed. And most people are good.”\n\nShe lamented that she had not done enough—for every child they saved almost one hundred went to their deaths at Treblinka.\n\nSendler has become a Polish national hero. Poles have been eager to tell their stories, in part because the Life in a Jar project stimulated Polish/Jewish dialog as well as scholarship about Poland during the German occupation. Although there has been a disturbing return of anti-Semitism and Holocaust denial in Poland, Sendler’s story continues to be told.\n\nYad Vashem, the World Holocaust Remembrance Center in Jerusalem, recognizes more Righteous Gentiles—those who rescued out of principle, not for personal gain—from Poland than from any other country in occupied Europe. In 2019, it listed 27,362 Righteous Gentiles, with 6,992 from Poland, or around 26 percent. But because of postwar Poland’s Communist anti-Semitism, Polish rescuers who had received Yad Vashem medals hid them and told no one of their wartime activities.\n\nAt one performance of Life in a Jar in Warsaw, I sat beside an old man, old enough to have been an adult during the war. Throughout the performance he sat with his hands together, clutching something inside. After the performance I asked him about it, and he opened his hands to reveal his Yad Vashem medal. There were tears in his eyes as he explained, “I have kept this buried in my basement for 60 years. I told no one except my wife. I didn’t tell my children, family, friends, or coworkers. Now, because of these American students, I can show this proudly. It was the finest thing I have ever done.”\n\nMy first time in Warsaw, in 2005, I could find few markers of the Warsaw ghetto and no commemoration of the wall. In my research for the book, I found no reference to Irena Sendler before 2000 other than by Yad Vashem (1965 Righteous Gentile medal, and in 1983 a tree planted in her honor next to that of Raoul Wallenberg) and the U.S. News and World Report article that launched the Kansas teens on their National History Day project.\n\nWhen I returned in 2013 for the release of the Polish translation of my 2011 book Life in a Jar: The Irena Sendler Project (also translated into Russian, Chinese, and Mongolian), I saw how much had changed in Poland. Where there had been no markers of the wall, now there is a footprint, 10 inches wide that says, “MUR GETTA/GHETTO WALL 1940–1943,” placed in sidewalks and lawns showing the exact location of the ghetto wall. At each of the 22 gates there is a memorial plaque with a map and description of what happened in the ghetto.\n\nThere are now 35 Irena Sendler schools in Poland, three in Germany, one in France, and one in England. I have met to discuss Sendler with Poland’s Deputy Foreign Secretary Jerzy Pomianowski, given radio, TV, and print interviews, and met with a journalist from the Catholic News Agency. The Museum of the History of Polish Jews in Warsaw opened in 2014, and the Lowell Milken Center Europe, a Polish office of the Irena Sendler/Life in a Jar Foundation, works with Polish teens on similar projects.\n\nThe project changed Poland as well as the American students who started it all. From my time with the Kansas teens, I learned that each girl knew something about losing or almost losing their own parent. Liz was abandoned by her parents as a young child and raised by her grandparents, Megan’s mother developed cancer, and Sabrina’s mother suddenly died during the project. The girls courageously allowed me to tell their own painful stories in my book. And it became clear to me that the last three children Irena Sendler rescued were the girls from Kansas.\n\nToday, Elizabeth Cambers Hutton has two master’s degrees and teaches Holocaust history in Missouri. Sabrina Coons-Murphy is an elementary schoolteacher in Kansas. Megan Stewart Felt, the program coordinator for the Irena Sendler/Life in a Jar Foundation, still works with Norm Conard to further Sendler’s legacy and continues to play Sendler in performances of Life in a Jar.\n\nThe story has also changed me. I am a German-American Jew, born after the war to parents who narrowly escaped the Holocaust. Others in my family did not. For the first five years of my life I lived in upper Manhattan, in Washington Heights—an urban shtetl of German Jews who had survived the Holocaust. I didn’t speak English until I was five years old. The Holocaust was the baffling but iconic story of my childhood, a subject of nervous, hushed, adult conversation. It was frightening, mysterious, impossible to grasp, yet everywhere—it was the atmosphere. There was an awkward gracelessness on the part of those who lived through it, a furtiveness I now understand to be a kind of PTSD. It was the unacknowledged elephant in the living room—huge but shrouded.\n\nIt wasn’t until I was in my twenties that I learned that my grandfather had been arrested on Kristallnacht, November 9, 1938, and imprisoned in Dachau. My grandmother went to high school with one of the administrative guards at Dachau. He accepted a bribe from her, and my grandfather was released after six months. In 1999, my parents were interviewed as part of Steven Spielberg’s Shoah project. In the course of the interview my mother brought out her identity papers, marked “Jew,” and her nursing certificate, stamped with a swastika. My brother and I had never seen these artifacts.\n\nGrowing up as a child of survivors, I had a sense of mission about the Holocaust, but didn’t know how that would manifest. Now in my seventies, I find that in writing Life in a Jar, and speaking about it to new audiences, I am fulfilling that mission.\n\nIn my talks, sponsored by the Vermont Humanities Council, I emphasize how Sendler and the girls from Kansas were repairing the world—tikkun olam in Hebrew. Few of us would have the courage to do what Sendler did, but all of us can do what Liz, Megan, and Sabrina did—performing small acts of decency and respect for all people. Acts that change the world."}, {"url": "https://www.thefamouspeople.com/profiles/irena-sendler-6152.php", "page_content": "Irena studied Polish literature at Warsaw University, and joined the Polish Socialist Party. She was a courageous girl and openly protested against the ghetto-bench system that existed at some prewar Polish universities. Due to this she was suspended from the University of Warsaw for three years.\n\nHer father was a physician and also one of the first Polish Socialists. She was greatly influenced by his selfless service to the patients, most of whom were Jewish and poor. Her father contracted typhus while treating Jewish patients the other doctors had refused to treat and died in February 1917.\n\nShe was born as Irena Krzyżanowska on 15 February 1910 in Otwock, near Warsaw, to Stanisław Krzyżanowski and his wife Janina. She was the only child of her parents.\n\nCareer\n\nDuring the late 1930s Irena Sendler moved to Warsaw and started working for the municipal Social Welfare departments. The Germans invaded Poland in 1939 and the Nazis started brutalizing the citizens, especially the Jewish population.\n\nShe was working as a Senior Administrator in the Warsaw Social Welfare Department at that time. The department operated canteens all over the city and provided meals and other necessities to the orphans, elderly, and the poor.\n\nIrena Sendler realized the pathetic situation of the Jews under the Nazis and helped the Jews by registering them under fictitious Christian names and reported the Jewish families as being afflicted with highly infectious diseases in order to prevent inspections.\n\nShe was taking a huge risk by helping the Jews as giving any kind of assistance to Jews in German-occupied Poland was punishable by death. Yet she courageously continued her services to the Jews.\n\nThe Zegota, an underground organization also known as the Council to Aid Jews, selected her to head its Jewish children’s section in 1943. During this time, she was assigned the name of ‘Jolanta’ in order to protect her real identity.\n\nAs an employee of the Social Welfare Department, she had a special permit to enter the Warsaw Ghetto, an area into which hundreds of thousands of Jews were herded and imprisoned. Inside the ghetto, the Jews lived in highly deplorable conditions and were most likely to be killed by the Nazis in the near future.\n\nSendler, along with some other like-minded and courageous women started smuggling out Jewish children from the ghetto. The babies and children were hidden in gunny bags, buried inside loads of goods, or sometimes even placed in coffins to hide them from the Nazis and transported to safer places.\n\nShe ensured that the children were provided with false identities and placed them in non-Jewish homes, orphanages, and convents. She also documented the children’s original names and new identities in coded form and hid the records by placing them inside jars and burying them under trees.\n\nShe and her helpers had succeeded in saving around 2,500 children in this manner. However, her clandestine activities were discovered by the Gestapo and she was severely tortured. She refused to divulge any vital information inspite of being brutally tortured and was finally sentenced to death.\n\nContinue Reading Below\n\nSendler managed to escape death at the last minute due to the intervention of Zegota members. She then acquired a false identity and continued her work with the Zegota, working as a nurse until the Germans left Warsaw."}, {"url": "https://www.historicmysteries.com/irena-sendler/", "page_content": "Irena Stanislawa Sendler was a Polish social worker and humanitarian who served in World War II as a nurse in the Polish Underground Resistance. The Polish Underground Resistance operated in German-occupied Warsaw.\n\nFrom October 1943 she was head of the children’s section of “Zegota”, the Polish Council to aid Jews. In the 30s, Sendler had worked as an activist connected to the Free Polish University.\n\nFrom 1935 through to October 1943, Sendler worked for the department of Social Welfare and Public Health in Warsaw. Throughout her time here she rescued Jews, particularly women and children, out of the Ghetto in Warsaw. However, few today know who she is or what she went through.\n\nEarly Life\n\nIrena Sendler was born in February 1910 in Warsaw. Her father was Stanislaw Henryk Krzyzanowski, a physician, and her mother Janina Karolina. However, she would grow up in Otwock, which was actually around 15 miles (24 km) southeast of Warsaw.\n\nShe was brought up in a strong Jewish community. Her father treated the poor, many of whom were Jews, despite them being unable to pay for his treatment. However, his charity may have killed him: he died in 1917 due to typhus likely contracted by one of his patients. After the death of her father, Sendler and her mother moved around Poland, first to Tarczyn and then Piotrkow Trybunalski.\n\nIn 1927, at the age of 17, Sendler studied both law and Polish literature at the University of Warsaw. here she was exposed to the ghetto bench system that was being practiced at higher education institutions throughout Poland, something she came to strongly oppose.\n\nMany Polish students supported the ghetto bench system, shown here protesting in support of its implementation in the 1930s (Unknown Author / Public Domain)\n\nThis was a form of segregation in which Jewish students were required to sit on the left-hand side section of the lecture hall. One way Irena displayed her dissatisfaction was to deface the non-Jewish identification on her grade card. Later in life, Sendler claimed that she faced disciplinary measures due to her activities as a supporter of the Jewish community and for being a communist.\n\nIrena joined the Union of Polish Democratic Youth in 1928. Later on, she joined the Polish Socialist Party and was refused repeatedly employment within the Warsaw school system due to the recommendations from the University of Warsaw which described her as radically leftist.\n\nFortunately, she was employed in a legal counseling and social help clinic, the pithily-titled “Section for Mother and Child Assistance at the Citizen Committee for Helping the Unemployed”. She tended to work in the field going in and out of Warsaw’s poorest neighborhoods until the government abolished her employment area.\n\nThe War\n\nWith the German invasion in full swing, on 1st November 1939 the German occupation authorities ordered that Jews were removed from the staff of the Social Welfare Department. This was the area where Sendler worked.\n\nThe German authorities also barred any assistance to Warsaw’s Jewish community. Sendler and her sympathetic colleagues began to help wounded and sick Polish soldiers.\n\nIt was during this time that Sendler initiated the idea to begin generating false medical documents for soldiers and poor families so that they could get aid from the government. She extended this cover to Jewish communities and institutions. Sendler led a small group to help Jewish families and children excluded from their department’s social welfare protection.\n\nBy November 1940, around 400,000 Jews were crowded into the small area named the Warsaw Ghetto which was sealed by the Nazis. Sendler was able to gain access to the ghetto through special permits granted by the Social Welfare Department which allowed her to check for signs of typhus.\n\nIrena Sendler would not stand idly by while Jewish families were herded into the Warsaw Ghetto (German Federal Archives / Public Domain)\n\nUsing this as a pretext to enter the ghetto, Sendler and colleagues brought in medications to the Jews. This soon progressed into smuggling Jews out of the ghetto and helping them survive elsewhere in the city. This was done at a huge risk to her own safety as from October 1941 it was punishable by death to give assistance to Jews in German-occupied Poland.\n\nAfter World War II\n\nDuring the Warsaw Uprising, Sendler worked in a hospital and helped Jews and Polish soldiers. However, after the war, the hospital ran out of resources. Sendler, hitchhiked to Lublin to gain funding from the communist government that was based there.\n\nShe also helped to set up Warsaw’s Children’s Home and resumed her other social work activities. Through this work, she was appointed the head of the Department of Social Welfare in Warsaw’s municipal government.\n\nIn January 1947, Sendler joined the communist Polish Workers’ Party and remained a member of its successor, the Polish United Workers’ Party until it dissolved in 1990. Recent research suggests that in 1947, Sendler was the party executive.\n\nFrom here, she held lots of high-level party and administrative posts throughout the Stalinist period. This included the Ministry of Education and the Ministry of Health.\n\nIn the Polish People’s Republic (1947-1989), Sendler received at least six decorations, including the Cross of Merit for her wartime saving of Jews, receiving another award in 1956 and eventually the knights cross in 1963.\n\nHowever, she was quite forgotten about in the modern day until a group of American high school students in 2000 rediscovered her. Yad Vashem, Israel’s official memorial to the victim of the Holocaust, had recognized her efforts in 1965 and became an honorary citizen in 1996.\n\nIrena Sendler in 2005 (Mariusz Kubik / CC BY 3.0)\n\nIrena Sendler’s achievements became well known in America when students from Kansas produced a play based on her life called “Life in a Jar”. This production was a success and was staged over 200 times in the US and contributed to getting Sendler’s story out there.\n\nHer story is an incredible one of striving against adversity. It would have been easy for her to ignore the troubles that surrounded her. However, Sendler, perhaps inspired by her father, strove every day to recognize the evils of the world and combat them.\n\nShe became one of the most celebrated people in Poland and even received a letter from Pope John Paul II praising her efforts. She has received many of the awards that both Polish and Jewish organizations could grant her, and rightfully so.\n\nTop Image: Irena Sendler in 1944. By this point she had saved thousands of Jewish lives. Source: Unknown Author / Public Domain.\n\nBy Kurt Readman\n\nReferences Edwards, B. 2008. Irena Krzyżanowska Sendler. Available at: https://www.findagrave.com/memorial/26800705/irena-sendler Hevesi, D. 2008. Irena Sendler, Lifeline to Young Jews, Is Dead at 98. Available at: https://www.nytimes.com/2008/05/13/world/europe/13sendler.html Life in a Jar. 2022. Life in a Jar: The Irena Sendler Project. Available at: https://irenasendler.org/ Mikkelson, D. 2008. Irena Sendler. Available at: https://www.snopes.com/fact-check/irena-sendler/ Reuters Staff. 2008. Sendler, saviour of Warsaw Ghetto children, dies. Available at: https://www.reuters.com/article/idUSL12654106 Yeshiva University. 2015. Rethinking the Polish Underground. Available at: http://blogs.yu.edu/news/rethinking-the-polish-underground/ Zawadzka, M. 2010. TREES OF IRENA SENDLER AND JAN KARSKI IN THE GARDEN OF THE RIGHTEOUS. Available at: https://sprawiedliwi.org.pl/en/news/trees-irena-sendler-and-jan-karski-garden-righteous"}, {"url": "https://www.documentarytube.com/articles/the-courageous-story-of-irena-sendler/", "page_content": "“I could have done more. The regret will follow me to my death”. Words spoken by Irena Sendler in 1995 during a documentary about her work during World War II. Those words perfectly sum up the courage, boldness, and sacrifice Irena did during one of the worst wars in Human history. When the War first broke out in 1941, Irena was just a 29 year old social worker. In Poland, Irena was known as Sendlerova and Jolanta, the latter being the pseudo name she used when smuggling Jewish children out of Poland and saving their lives.\n\nWhen Germany occupied Poland, Irena took advantage of her work as a social worker to help the Jews, as she had access to the Ghetto where Nazi kept Jews. The ghetto, with lack of medical supplies and food, was a breeding ground for epidemics and deaths. In those dark times, Irena, with a friend of hers and an organization behind her, smuggled around 2,500 children out of the ghetto, provided them with false identity documents, shelter and families outside.\n\nIrena died in May 2008, but her work will never be forgotten, not by Israel, not by many humanitarian people around the world.\n\nWorld War II Work\n\nDuring World War II, Irena joined the Council for Aid of Jews, called also Zegota. The council was created in the fall of 1942, and Irena became one of its main activists and leaders. The organization was created too late, as more than 250,000 Jews were already deported from Warsaw, the capitol of Poland to Treblinka, the infamous Nazi camp.\n\nHowever, Zegota and Irena managed to help play crucial role in saving the remaining Jews, especially children who had survived the deportations.\n\nSaving Children\n\nIrena one famously said “I was taught that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.” And jumping she did. Irena was personally responsible for saving more than 2,500 children from the Ghetto. She used her work as an advantage.\n\nTo enter the Jewish Ghetto, Irena obtained official passes from doctors for herself and her friend and co-conspirator, Irena Schultz. The two of them visited the Ghetto on a daily basis, providing families with food, money, clothing and medicines. The conditions in the Ghetto were awful, and as a result, more than 5,000 people were dying each month from diseases and starvation.\n\nSendler was a young mother herself, and she took it upon herself to help children from the Ghetto get outside, and provide them with second chance for life.\n\nIrena used the codename Jolanta when entering the ghetto. She had to find something to identify herself with Jews, so she wore a Star of David armband. She used coffins, sacks, and suitcases to transport them out of the Ghetto. She used her friends in the medicine network to help her. For example, she transported children using an ambulance car. The children were hidden beneath the stretches in the back, and the driver used his dog, placing the dog in the front seat and training the dog to bark when children cried.\n\nIrena helped provide new identities for the children and place them with sympathetic families, hospitals and orphanages where they were given a second chance for life. She also taught old enough children Christian prayers, so they can hide themselves and their Jewish heritage should not be suspected.\n\nBut it wasn’t as easy as it sounds. Irena recalled that there were terrible scenes. “We witnessed terrible scenes. Father agreed, but mother didn’t. We sometimes had to leave those unfortunate families without taking their children from them. I’d go back there the next day and often found that everyone had been taken to the Umschlagsplatz railway siding for transport to the death camps.”\n\nIrena goes underground\n\nBy the end of 1943, the German police and Gestapo found out about Irena and were able to arrest her. She was arrested on October 20 and sentenced to death to Pawiak prison. However, Irena won’t stay there for long.\n\nThe police had evidence of large sums of money paid to people helping Jews, and the activities of Sendler and the organization Zegota.\n\nShe was released her shortly after going to prison, as some underground activists managed to find money, and bribe officials. Released in February 1944, Irena continued her work helping Jews, but did so from the underground. Irena was not even able to attend her mother’s funeral as she had to keep low identity and hide in cover.\n\nLegacy\n\nFor her work during the World War, Irena Sendler has received many awards and recognitions. The highest award came in 1965, when was recognized by an organization in Israel, Yad Vashem as the Polish Righteous among the Nations. The organization planted a tree at the entrance of the Avenue of the Righteous. Sadly, Irena was not allowed by the Polish government to travel to Israel and receive her recognition in person.\n\nIsrael continued to cherish Irena, as she was named honorary citizen in 1991 and in 2001 she received the Commander’s Cross with Star.\n\nFor many people around the world, her achievements were unknown. All changed in 1999, when students at high school in Kansas produced a play based on the story of Irena. The play contributed people around the world to find out about one of the biggest heroes during the World War II. The play of the high school children received a TV adaption when the movie “The Courageous Heart of Irena Sendler” was published in 2009.\n\nIrena received recognition from other notable people around the world, including Pope John Paull II, who sent her a personal letter in 2003, praising her humanitarian efforts. She has been nominated for Nobel Prize three times, in 2006, 2007 and 2008, but never won the prestigious award.\n\nPoland finally recognized her contribution in 2003, when Irena was awarded Order of the White Eagle, which is highest civilian decoration in Poland."}, {"url": "https://artsandculture.google.com/entity/irena-sendler/m02xbt_?hl=en", "page_content": "Irena Stanisława Sendler, also referred to as Irena Sendlerowa in Poland, nom de guerre Jolanta, was a Polish humanitarian, social worker, and nurse who served in the Polish Underground Resistance during World War II in German-occupied Warsaw. From October 1943 she was head of the children's section of Żegota, the Polish Council to Aid Jews.\n\nIn the 1930s, Sendler conducted her social work as one of the activists connected to the Free Polish University. From 1935 to October 1943, she worked for the Department of Social Welfare and Public Health of the City of Warsaw. During the war she pursued conspiratorial activities, such as rescuing Jews, primarily as part of the network of workers and volunteers from that department, mostly women. Sendler participated, with dozens of others, in smuggling Jewish children out of the Warsaw Ghetto and then providing them with false identity documents and shelter with willing Polish families or in orphanages and other care facilities, including Catholic nun convents, saving those children from the Holocaust.\n\nShow less Read more Wikipedia"}, {"url": "https://www.encyclopedia.com/religion/encyclopedias-almanacs-transcripts-and-maps/sendler-irenadeg", "page_content": "SENDLER, IRENA°\n\nSENDLER, IRENA ° (1910– ), head of the children's section of the Council for Aid to Jews (codenamed Zegota), a Polish underground organization created in the latter part of 1942 and which operated primarily in the Warsaw area; and Righteous Among the Nations. In the early days of the German occupation, Sendler worked to alleviate the suffering of many of her prewar Jewish friends and acquaintances. As a social worker for the Social Welfare Department of the Warsaw municipality, she carried a special permit allowing her to visit the ghetto area, ostensibly for the purpose of combating contagious diseases. This afforded her ample opportunity to learn of the terrible conditions inside the ghetto and try to alleviate the suffering of the people there with additional clothing, medicine, and money. In the summer of 1942, Irena Sendler was invited to join Zegota, which was then in the stages of formation. Readily consenting to this, she had already assembled a group of people dedicated to her charitable work, including her companion Irena Schulz, and she developed a widespread network of contacts inside and outside the ghetto. Under the codename Jolanta, with the help of her coworkers, she arranged for Jewish children to be smuggled out of the ghetto and for sheltering them in secure places either with non-Jewish families or in religious institutions. \"I myself had eight or ten flats where Jews were hiding under my care,\" Irena proudly recalled. The sheltering families received financial support from Zegota for their additional expenses. In October 1943, she was betrayed and arrested by the Gestapo, taken to the infamous Pawiak prison, and brutally tortured. Failing to elicit information from her, her inquisitors condemned her to be shot. However, unbeknownst to her, the Jewish underground operating in the Warsaw region had managed to contact and bribe one of the Gestapo agents, and on the day of her execution she was freed, although she was officially listed among those executed. Forced to stay out of sight for the remainder of the German occupation, Irena carried out her humanitarian activities from her hiding place. Irena Sendler explained that the motivation for her humanitarian work came from lessons learned at home. Her father was a physician, and most of his patients were poor Jews. \"I grew up among these people. All my life, I had Jewish friends.\" She then added, \"My family taught me that what matters is whether people are honest or dishonest, not what religion they belong to.\" In 1965, Irena Sendler was awarded the title of Righteous Among the Nations by Yad Vashem.\n\nbibliography:\n\nYad Vashem Archives m31–153; J. Kermish, \"The Activities of the Council of Aid to Jews,\" in: I. Gutman and E. Zuroff (eds.), Rescue Attempts During the Holocaust (1978), 367–98; I. Gutman, Encyclopedia of the Righteous Among the Nations: Poland, vol. 2 (2004), 702.\n\n[Mordecai Paldiel (2nd ed.)]"}, {"url": "https://weeklyrecess.com/article/irena-sendler-woman-who-rescued-jews-during-holocaust", "page_content": "Polish social worker, nurse, and head of the children's division for the Council for Aid to Jews, Zegota, Irena Sendler (an underground resistance group during WWII). She has received the Jan Karski for Valor and Courage and been named a Righteous Among the Nations by Yad Vashem.\n\nIrena Sendler, a humanitarian with a remarkable life story, saved the lives of several Jews during World War II. She is, to put it mildly, an inspirational figure. This essay will examine the life of this important person and her contribution to the Holocaust.\n\nEarly life\n\nPhoto Credit: holocaustmatters\n\nIrena Sendler, also known as Irena Kryzyzanowski at the time of her birth in Warsaw on February 15, 1910, was the child of Janina and Dr. Stanislaw Kryzyzanowski. Irena was raised in Otwock, a nearby town, even though she was born and raised in Warsaw.\n\nWhen Irena was just seven years old, her father, Dr. Stanislaw Kryzyzanowski, passed away from typhus that he caught while caring for patients. Stanislaw had a significant influence on Irena's life values despite passing away when she was very young. She said that her father \"taught me that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.\"\n\nIrena was able to study Polish literature at Warsaw University thanks to the financial support of numerous Jewish community leaders who assisted with Stanislaw's studies after his passing.\n\nIrena disapproved of the ghetto bench arrangement that had been put in place in various institutions before the war while she was a student. She responded by damaging her grade card, for which reason the university suspended her for three years.\n\nThis was the first of Irena's demonstrations against Jewish discrimination, but it was also the start of her work as a humanitarian, defending the lives of Jews throughout the Holocaust.\n\nHow Did Irena Sendler Help During the War?\n\n\n\nPhoto Credit: holocaustmatters\n\nIrena began assisting the city's Jews by giving them food and drink as soon as World War II began, when the Germans conquered Warsaw, the city where she was born. Irena was unable to reach individuals in need of her help after the city's ghetto was constructed. She then began to think of further ways to assist.\n\nWhen the Warsaw Ghetto was created in the year 1940, Irena began to smuggle orphaned kids out of the area. She gained entry to the Warsaw Ghetto and access to the orphaned children who lived there by using her position as a social worker and paperwork from a Contagious Disease staffer (who later joined the underground group Zegota).\n\nfollowing the creation of the Provisional Committee for Aid to Jews (Zegota), an underground Polish resistance organization, in 1942. Irena was shortly named the division's head for children. Irena and her group at Zegota assisted in the evacuation of some 2,500 Jewish kids from the Warsaw Ghetto. Irena's team would remove kids from the ghetto using four basic methods, which are as follows:\n\nthrough an outdated courthouse close to the ghetto.\n\nEscape via underground tunnels, like the sewer.\n\nconceal in a bag of luggage before being rolled out by a trolley.\n\nvia ambulance, concealed under stretchers, pretending to be ill or actually being sick.\n\nThose who were saved were distributed to a variety of orphanages and religious organizations that took in disadvantaged kids. Irena utilized her connections to various locations to bring the kids in under false pretenses. Religious institutions in and near Chotomow, Turkowice, and Lublin, as well as the Rodzina Marii Orphanage, were some of the main locations these kids were transported into.\n\nWhy Was Irena Sendler Imprisoned?\n\nIrena was detained on October 20th, 1943, and then taken to Piawiak jail. Irena gave the interrogators false information while she was being tortured to learn more about the other Zegota members. Irena was eventually given a death sentence, but she was spared from execution because other Zegota members paid off jail guards to help her escape.\n\nNazi officials amusingly reported the day after Irena's escape that she had been shot, placing posters with this fake information all throughout Warsaw. Irena spent the remainder of the war in hiding before beginning to try to find the parents of the kids she had saved. Sadly, almost all of these parents had perished in the Holocaust.\n\nLater Life\n\nPhoto Credit: holocaustmatters\n\nIrena continued working as a social worker after the war was over. She received various honors for her exceptional bravery and courage, including the Jan Karski Award for Valor and Courage and the Righteous Among the Nations from Yad Vashem, which were also mentioned above. Irena has also been nominated for the Nobel Peace Prize and received Poland's Order of the White Eagle in addition to these accolades.\n\nThe remainder of Irena's life was spent receiving care from Elzbieta Ficowska in Warsaw. Irena sneaked Eizbieta, who was six months old at the time, out of the city's ghetto."}], "Irena Sendler served in the Polish Underground Resistance during World War II in German-occupied Warsaw.": [{"url": "https://www.biography.com/activist/irena-sendler", "page_content": "(1910-2008)\n\nWho Was Irena Sendler?\n\nWhen the Nazis invaded in 1939, Irena Sendler was a social worker and so had access to the Warsaw Ghetto, where hundreds of thousands of Jews were imprisoned. As a member of Żegota (aka Konrad Żegota Committee, the Council to Aid Jews), she helped rescue 2,500 Jewish children from the ghetto. For her courageous actions during the Holocaust, in 1965, Israel’s Yad Vashem honored her as “Righteous Among the Nations.” Sendler died in Warsaw in 2008.\n\nEarly Life\n\nSendler was born Irena Krzyżanowska on February 15, 1910, in Otwock, Poland. Her parents were members of the Polish Socialist Party, and her father, Stanisław Krzyżanowski was a medical doctor who died of typhus when Sendler was a child. In 1931 Sendler married Mieczysław Sendler, and the couple moved to Warsaw before the outbreak of World War II.\n\nWarsaw Ghetto\n\nIn Warsaw, Sendler became a social worker, overseeing the city’s “canteens,” which provided assistance to people in need. When the Nazis invaded Poland in 1939, Sendler and her colleagues also used the canteens to provide medicine, clothing and other necessities to the city’s persecuted Jewish population.\n\nIn 1940, the Nazis forced Warsaw’s more than 400,000 Jewish residents into a small locked ghetto area, where thousands died every month from disease and starvation. As a social worker, Sendler was able to enter the ghetto regularly to help the residents and soon joined Żegota, the Council to Aid Jews. Putting themselves at great risk, she and about two dozen of her colleagues set out to save as many Jewish children as possible from death in the ghetto or deportation to concentration camps.\n\nŻegota began by saving Jewish orphans. They had several ways of smuggling them out of the ghetto: Some were carried out in caskets or potato sacks; others left in ambulances or snuck out through underground tunnels. Still others entered the Jewish side of a Catholic church that straddled the ghetto boundary and left on the other side with new identities. Sendler then helped place the children at convents or with non-Jewish families.\n\nAs the situation became more dire for the ghetto’s inhabitants, Sendler went beyond rescuing orphans and began asking parents to let her try to get their children to safety. Although she couldn’t guarantee the children’s survival, she could tell parents that their children would at least have a chance. Sendler kept detailed records and lists of the children she helped buried in a jar. Her plan was to reunite the rescued children and their parents after the war. However, most of the parents did not survive.\n\nOn October 20, 1943, the Nazis arrested Sendler and sent her to Pawiak Prison. There they tortured her, trying to get her to reveal the names of her associates. She refused and was sentenced to death. However, Żegota members bribed the prison guards, and Sendler was released in February 1944.\n\nSendler continued her work until the war ended, by which time she and her colleagues had rescued some 2,500 children. It has been estimated that Sendler personally saved about 400.\n\nPersonal Life\n\nAfter the war, Sendler’s first marriage ended in divorce. In 1947 she married Stefan Zgrzembski, with whom she had three children, daughter Janka, and sons Andrzej (who died in infancy) and Adam. After the death of Zgrzembski, Sendler remarried her first husband, Mieczysław Sendler, but their reunion didn't last and they again divorced.\n\nHonors and Awards\n\nIn 1965, Yad Vashem, Israel’s Holocaust memorial organization, named Sendler as Righteous Among the Nations for her work saving Jewish children. In 2003, Poland honored her with its Order of the White Eagle. In 2008, Sendler was nominated for (but did not win) a Nobel Peace Prize. The story of her life was also captured in a 2009 TV movie The Courageous Heart of Irena Sendler, which starred Anna Paquin in the title role.\n\nDeath\n\nSendler died on May 12, 2008, in Warsaw, Poland, at the age of 98.\n\nQUICK FACTS\n\nBirth Year: 1910\n\nBirth date: February 15, 1910\n\nBirth City: Otwock\n\nBirth Country: Poland\n\nGender: Female\n\nBest Known For: Irena Sendler was a Polish social worker who, during World War II, helped to rescue 2,500 Jewish children from the Warsaw Ghetto, and placed them in convents or with non-Jewish families.\n\nAstrological Sign: Aquarius\n\nDeath Year: 2008\n\nDeath date: May 12, 2008\n\nDeath City: Warsaw\n\nDeath Country: Poland\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.holocaustmatters.org/irena-sendler/", "page_content": "Irena Sendler was a Polish social worker, nurse, and director of the children’s department for the Council for Aid to Jews, Zegota (an underground resistance group during WWII). She has been recognized by Yad Vashem as a Righteous Among the Nations, and awarded the Jan Karski for Valor and Courage.\n\nTo say the least, Irena Sendler is an inspiring humanitarian with a fascinating life story; her incredible courage and bravery saving the lives of many Jewish people throughout WWII. In this piece, we will be exploring the life of this influential figure, and her part to play during the Holocaust.\n\nFor more information on the Holocaust, and other influential figures throughout it, please click here.\n\nEarly Life\n\nBorn in Warsaw on the 15th of February 1910, Irena Sendler (or Irena Kryzyzanowski at the time) was the daughter of Janina and Dr Stanislaw Kryzyzanowski. Although born in Warsaw, Irena grew up in a town near the city called Otwock, and was an only child.\n\nHer father (Dr Stanislaw Kryzyzanowski) died from typhus, which he contracted whilst treating patients, when Irena was only seven years old. Stanislaw, although dying when Irena was very young, had a profound impact on the life values she carried throughout her life, claiming that through her father “I was taught that if you see a person drowning, you must jump into the water to save them, whether you can swim or not.”\n\nAfter Stanislaw’s death, many leaders in the Jewish community helped to fund Irena’s education, which lead her to study at Warsaw University in Polish Literature.\n\nDuring her time at university, Irena disagreed with the ghetto bench system that had already been established in some of the universities prior to the war. In reaction to this, she vandalised her grade card and was consequently put on a three year-long suspension from the university.\n\nThis was not the last of Irena’s protests against Jewish discrimination, but rather the beginning to her humanitarian career, fighting for the lives of Jewish people throughout the Holocaust.\n\nHow Did Irena Sendler Help During the War?\n\nEven in the very beginnings of WWII, as the Germans invaded Irena’s birthplace of Warsaw, she started to help the city’s Jews, providing them with food and water. However, once the ghetto was built within the city this cut off Irena’s access to those who needed her aid. She then started to plan out another way in which to help.\n\nOnce the Warsaw Ghetto was established in the year 1940, Irena then started to smuggle out orphaned children. She used her status as a social worker, in addition to documentation from an employee at the Contagious Disease (who also became a part of the underground group Zegota) to gain access into the Warsaw Ghetto, and access to the orphaned children who lived in it.\n\nAfter the underground Polish resistance group for the Provisional Committee for Aid to Jews (Zegota) was established in 1942. Irena was soon appointed as head of its children’s division. During her position with Zegota, Irena and her team helped to rescue around 2,500 Jewish children from the Warsaw Ghetto. There were four main ways in which Irena’s team would smuggle out children from the ghetto, these being as follows:\n\nSmuggled through an old courthouse next to the ghetto.\n\nEscape through underground passages such as the sewer.\n\nHide in a luggage bag and then carried out by a trolley.\n\nVia ambulance; hidden under stretchers, faking illness or genuinely being ill.\n\nThose rescued were sent to numerous different orphanages and religious institutions that took in vulnerable children. Irena used her contacts with these places to smuggle the children in under false names. Some of the main places these children were smuggled into included the Rodzina Marii Orphanage, and religious institutions in and around Chotomow, Turkowice and Lublin.\n\nWhy Was Irena Sendler Imprisoned?\n\nOn the 20th of October 1943, Irena was arrested, and sent to Piawiak prison. During her time in imprisonment she was tortured for information on the other members of Zegota, and Irena fed the interrogators false information. Irena was then sentenced to death, however did not fulfil this sentence as her fellow Zegota members bribed workers in the prison to let her escape.\n\nThe day after Irena’s escape, Nazi officials interestingly announced that she had been shot, with posters with this false news dotted all around Warsaw. Irena was in hiding throughout the rest of the war, and once over, started to try and connect the children she had saved with their parents. Unfortunately, nearly all of these parents had been killed during the holocaust.\n\nLater Life\n\nWhen the war was over, Irena carried on her career as a social worker. She received numerous awards for her outstanding bravery and courage; these included the previously mentioned Yad Vashem’s Righteous Among the Nations, and Jan Karski’s Valor and Courage. In addition to these, Irena was also awarded Poland’s Order of the White Eagle, and has been a nominee for the Nobel Peace Prize.\n\nIrena then spent the latter part of her life cared for in Warsaw by a woman called Elzbieta Ficowska. Eizbieta was one of the children (six months old at the time) Irena had smuggled out of city’s ghetto.\n\nIrena has remarked on her actions during the war, stating that “We who were rescuing children re not some kind of heroes. That term irritates me greatly. The opposite is true – I continue to have qualms of conscience that I did so little. I could have done more. This regret will follow me to my death.”"}, {"url": "https://www.neh.gov/article/irena-sendler-and-girls-kansas", "page_content": "Between 1942 and 1943, Sendler and her network of 10 compatriots rescued 2,500 Jewish children from the Warsaw ghetto. Disguised as an infection-control nurse, Sendler knocked on doors in the ghetto, asking parents and grandparents to give up their children and grandchildren so that she could smuggle them out. Each child was given a new Polish name and forged identity papers and hidden in foster homes, orphanages, or convents. Sendler insisted that lists of the children be kept, documenting their Jewish and Polish names, so that after the war they would know their original identities. She hid the lists in milk jars that were buried in the backyard of one of her co-conspirators.\n\nPhoto caption A young Irena Sendler, in Warsaw, circa 1930. — AF Fotografie / Alamy Stock Photo\n\nAfter the war, Poland’s Communist government persecuted members of Poland’s wartime resistance, Zegota, of which Sendler was a part. They were harassed, interrogated, imprisoned, and even executed. Sendler and others who rescued Jews during the war kept silent. Almost no one knew of Sendler and her heroism.\n\nShe would have remained an unsung hero were it not for three teenage American girls who discovered her forgotten story 60 years later. Liz, Megan, and Sabrina, who began as students of history for a National History Day competition, became recorders of history, championing Sendler’s legacy in Poland, the U.S., and around the world. Three teenagers from rural Kansas helped crack open the silence about the Holocaust in Poland.\n\nMy first brush with this story came in the winter of 2001, in my Middlebury, Vermont, pediatric office, while going through my mail. This was before the electronic health record, and I daily triaged a prodigious stack of paper. Everything had about three seconds to be kept, filed, recycled, or thrown away.\n\nI am a member of the U.S. Holocaust Memorial Museum (USHMM). Each year I send a contribution, and they send me a calendar highlighting 12 monthly Holocaust heroes. As I quickly flipped through, I was brought up short by the November entry. It was the photo that stopped me—a young Irena Sendler, twenty-nine years old, who looked a lot like my niece. I read the short paragraph below the photo:\n\nIrena Sendlerowa, (1916–UNKNOWN) As head of the children’s division of Zegota, the Polish underground Council for Aid to Jews, social worker Irena Sendlerowa (code name “Jolanta”) helped smuggle more than 2,500 Jewish children out of the Warsaw ghetto. Hiding them in orphanages, convents, schools, hospitals, and private homes, she provided each child with a new identity, carefully recording in code their Jewish names and placements so that surviving relatives could find them after the war. Arrested by the Gestapo in the fall of 1943, Sendlerowa was sentenced to death. Zegota rescued her before her execution. She assumed a new identity and continued her work for Zegota.\n\nI was stunned. I’m a child of Holocaust survivors. How could I not know Irena Sendler’s story? Everybody knows Oskar Schindler, who rescued 1,100 Jews from a German concentration camp in Poland and whose story was told in the Steven Spielberg film Schindler’s List. Even at the USHMM, the preeminent scholars of the Holocaust didn’t know much about Sendler. They had her birth year wrong (it was 1910, I later found out), and they didn’t know if she was still alive.\n\nI kept this calendar in a file labeled “Interesting Stuff.” And there it sat for almost three years.\n\nPhoto caption These children rescued by Sendler were sent to live with new identities at a Polish convent, circa 1943. — World History Archive / Alamy Stock Photo\n\nThen, in February 2004, I came into my office one night to see a sick child. On my desk someone had left a copy of the Ladies Home Journal, opened to an article, “The Woman Who Loved Children.” It was about Irena Sendler and three Kansas teens who uncovered her story. The article explained that, in 1999, while planning a National History Day project, they found a brief reference to Sendler in a U.S. News and World Report article entitled “The Other Schindlers.” Sendler’s story inspired their NHD project: a play they wrote and performed called Life in a Jar. It retold, in dramatic form, the emotional story of Sendler knocking on ghetto doors and asking Jewish parents to give up their children to save them. The title, Life in a Jar, refers to the lists Sendler buried.\n\nThe teens read that Irena had been arrested in 1943 by the Gestapo and tortured in Pawiak Prison, the most notorious prison in the ghetto, from which almost no one escaped. Logically, they began searching cemetery records and reached out to the Jewish Foundation for the Righteous, seeking information about where she might be buried. Soon after, they received a letter from the foundation, saying that Sendler was alive! She was in her nineties and living in poverty with her daughter-in-law in Warsaw. The foundation then put them in touch with Sendler.\n\nThe three students made plans to travel to Poland and meet Sendler, first trying to raise money through candy sales, until philanthropists and Holocaust survivors from the Kansas City Jewish community stepped in to help cover the trip. Traveling out of the country for the first time (the first time on a plane for one of them), the girls finally met Sendler at her Warsaw home in 2001. They maintained a tender friendship with her for the next seven years until she passed, making several trips to Poland to visit her, each time performing Life in a Jar at various venues. And they began working with Polish high school students who were telling the forgotten stories of rescuers from their own communities.\n\nPhoto caption The original three students—Liz,Megan, and Sabrina—are joined by Jessica Shelton-Ripper (third from left), who performed many times with Life in a Jar. Here they visit the Irena Sendler exhibit at the Lowell Milken Center for Unsung Heroes in Fort Scott, Kansas, in 2018. — Kenny Felt\n\nAs I read the Ladies Home Journal article, I remembered the USHMM calendar. This story now took on a new dimension. I have been a closet writer most of my life, and I was thinking about writing a novella about the Warsaw ghetto. Irena Sendler seemed like a compelling character, and I wanted to know more about her. I was also intrigued by the two stories—Irena’s wartime history and the contemporary story of three Kansas teens. I called their teacher in Kansas, Norm Conard.\n\n“It’s serendipitous that you should call,” he said. “We’re looking for someone to write these two stories.”\n\nI hesitated. I had not written nonfiction before, only fiction and poetry. But I felt the powerful synergy of these two stories. I was not eager to write a wartime history of a Holocaust hero because most Holocaust literature leaves me angry, sad, depressed, and frustrated. But this story was different—an inspiring story of three typical American teenagers who helped restore the history of a great hero.\n\nI agreed to write the story and, in 2004, visited Uniontown, Kansas, where the girls went to school. A small town with a population of 264, it was down on its luck. Many stores were shuttered. It had the look of a Dorothea Lange or Walker Evans black-and-white photo from the Depression. I met Norm and the girls at the high school, and I was hooked.\n\nUniontown High School, with only about 120 students, is one of the lowest-income school districts in Kansas. There was no diversity in the school—never a Jew, an African American, or even a Catholic—yet these teens had discovered Sendler’s story and told the world. I spent a week interviewing the students, their families, their teacher, community members, and Holocaust survivors from Kansas City who had taken a great interest in the play and the Irena Sendler project.\n\nMy wife and I accompanied the students and Conard to Poland on their third visit, in 2005. I was able to do more extensive research and interview Sendler, Holocaust scholars, and some of the children Sendler had rescued, now in their sixties and seventies. We met Elzbieta Ficowska, rescued as a six-month-old infant. Sendler had sedated her and put her in a carpenter’s box. Her parents kissed their baby good-bye and left a small spoon in the box with her name inscribed on one side and her birthdate on the other. It is the only memento of her parents, who were murdered at Treblinka. She and I have become good friends, and I have held her spoon many times, always with tears. Ficowska became one of Sendler’s caregivers and the chairperson of the Association of Children of the Holocaust in Poland.\n\nIt was Sendler’s ninety-fifth birthday when I interviewed her. She was energetic, and her memory was clear and specific. She wanted to be sure that I credited all of her network of rescuers and liaisons. She ensured that I had everyone’s name spelled correctly.\n\nPhoto caption Megan took this picture of Sendler on May 3, 2008, during a visit to Poland. Sendler passed away nine days later on May 12. — Megan Felt\n\nPoland was arguably the most victimized country in occupied Europe. The consequence for hiding or even feeding a Jew was execution, often in public as a warning to other Poles. When I asked Sendler why she put herself and her family at such risk, she said, “It was a need of my heart.” She rejected the appellation of hero. “I only did what any decent person would do. . . . The heroes were the babies—they were the heroes of their mothers’ hearts. . . . It was the parents and grandparents who gave up their children, they were the true heroes.”\n\nShe said it was her father’s teaching that inspired her. “If you see someone drowning you must rescue them, even if you cannot swim.” And “there are only two kinds of people in the world, good and bad, regardless of race, religion, or creed. And most people are good.”\n\nShe lamented that she had not done enough—for every child they saved almost one hundred went to their deaths at Treblinka.\n\nSendler has become a Polish national hero. Poles have been eager to tell their stories, in part because the Life in a Jar project stimulated Polish/Jewish dialog as well as scholarship about Poland during the German occupation. Although there has been a disturbing return of anti-Semitism and Holocaust denial in Poland, Sendler’s story continues to be told.\n\nYad Vashem, the World Holocaust Remembrance Center in Jerusalem, recognizes more Righteous Gentiles—those who rescued out of principle, not for personal gain—from Poland than from any other country in occupied Europe. In 2019, it listed 27,362 Righteous Gentiles, with 6,992 from Poland, or around 26 percent. But because of postwar Poland’s Communist anti-Semitism, Polish rescuers who had received Yad Vashem medals hid them and told no one of their wartime activities.\n\nAt one performance of Life in a Jar in Warsaw, I sat beside an old man, old enough to have been an adult during the war. Throughout the performance he sat with his hands together, clutching something inside. After the performance I asked him about it, and he opened his hands to reveal his Yad Vashem medal. There were tears in his eyes as he explained, “I have kept this buried in my basement for 60 years. I told no one except my wife. I didn’t tell my children, family, friends, or coworkers. Now, because of these American students, I can show this proudly. It was the finest thing I have ever done.”\n\nMy first time in Warsaw, in 2005, I could find few markers of the Warsaw ghetto and no commemoration of the wall. In my research for the book, I found no reference to Irena Sendler before 2000 other than by Yad Vashem (1965 Righteous Gentile medal, and in 1983 a tree planted in her honor next to that of Raoul Wallenberg) and the U.S. News and World Report article that launched the Kansas teens on their National History Day project.\n\nWhen I returned in 2013 for the release of the Polish translation of my 2011 book Life in a Jar: The Irena Sendler Project (also translated into Russian, Chinese, and Mongolian), I saw how much had changed in Poland. Where there had been no markers of the wall, now there is a footprint, 10 inches wide that says, “MUR GETTA/GHETTO WALL 1940–1943,” placed in sidewalks and lawns showing the exact location of the ghetto wall. At each of the 22 gates there is a memorial plaque with a map and description of what happened in the ghetto.\n\nThere are now 35 Irena Sendler schools in Poland, three in Germany, one in France, and one in England. I have met to discuss Sendler with Poland’s Deputy Foreign Secretary Jerzy Pomianowski, given radio, TV, and print interviews, and met with a journalist from the Catholic News Agency. The Museum of the History of Polish Jews in Warsaw opened in 2014, and the Lowell Milken Center Europe, a Polish office of the Irena Sendler/Life in a Jar Foundation, works with Polish teens on similar projects.\n\nThe project changed Poland as well as the American students who started it all. From my time with the Kansas teens, I learned that each girl knew something about losing or almost losing their own parent. Liz was abandoned by her parents as a young child and raised by her grandparents, Megan’s mother developed cancer, and Sabrina’s mother suddenly died during the project. The girls courageously allowed me to tell their own painful stories in my book. And it became clear to me that the last three children Irena Sendler rescued were the girls from Kansas.\n\nToday, Elizabeth Cambers Hutton has two master’s degrees and teaches Holocaust history in Missouri. Sabrina Coons-Murphy is an elementary schoolteacher in Kansas. Megan Stewart Felt, the program coordinator for the Irena Sendler/Life in a Jar Foundation, still works with Norm Conard to further Sendler’s legacy and continues to play Sendler in performances of Life in a Jar.\n\nThe story has also changed me. I am a German-American Jew, born after the war to parents who narrowly escaped the Holocaust. Others in my family did not. For the first five years of my life I lived in upper Manhattan, in Washington Heights—an urban shtetl of German Jews who had survived the Holocaust. I didn’t speak English until I was five years old. The Holocaust was the baffling but iconic story of my childhood, a subject of nervous, hushed, adult conversation. It was frightening, mysterious, impossible to grasp, yet everywhere—it was the atmosphere. There was an awkward gracelessness on the part of those who lived through it, a furtiveness I now understand to be a kind of PTSD. It was the unacknowledged elephant in the living room—huge but shrouded.\n\nIt wasn’t until I was in my twenties that I learned that my grandfather had been arrested on Kristallnacht, November 9, 1938, and imprisoned in Dachau. My grandmother went to high school with one of the administrative guards at Dachau. He accepted a bribe from her, and my grandfather was released after six months. In 1999, my parents were interviewed as part of Steven Spielberg’s Shoah project. In the course of the interview my mother brought out her identity papers, marked “Jew,” and her nursing certificate, stamped with a swastika. My brother and I had never seen these artifacts.\n\nGrowing up as a child of survivors, I had a sense of mission about the Holocaust, but didn’t know how that would manifest. Now in my seventies, I find that in writing Life in a Jar, and speaking about it to new audiences, I am fulfilling that mission.\n\nIn my talks, sponsored by the Vermont Humanities Council, I emphasize how Sendler and the girls from Kansas were repairing the world—tikkun olam in Hebrew. Few of us would have the courage to do what Sendler did, but all of us can do what Liz, Megan, and Sabrina did—performing small acts of decency and respect for all people. Acts that change the world."}, {"url": "https://www.discoverwalks.com/blog/warsaw/top-10-outstanding-facts-about-irena-sendler/", "page_content": "Top 10 Outstanding Facts about Irena Sendler\n\nShare 1\n\nPin\n\n\n\nIrena Stanisława Sendler, also referred to as Irena Sendlerowa in Poland was born on 15 February 1910. Irena Passed on on 12 May 2008. She was was a Polish humanitarian, social worker, and nurse.\n\nIrena served in the Polish Underground Resistance during World War II in German-occupied Warsaw. From October 1943 she was head of the children’s section of Żegota, the Polish Council to Aid Jews. In the article are the top ten outstanding facts about Irena Sendler.\n\n1. She engaged in conspirational activities during World War II\n\nDuring the war, Irena pursued conspiratorial activities, such as rescuing Jews, primarily as part of the network of workers and volunteers from that department, mostly women.\n\nSendler participated, with dozens of others, in smuggling Jewish children out of the Warsaw Ghetto and then providing them with false identity documents and shelter with willing Polish families or in orphanages and other care facilities, including Catholic nun convents, saving those children from the Holocaust.\n\n2. Bribery bought back her life after she was sentenced to death\n\nTOP TEN FASCINATING FACTS ABOUT ZBIGNIEW BRZEZINSKI\n\nThe German occupiers suspected Sendler’s involvement in the Polish Underground and in October 1943 she was arrested by the Gestapo. However, she managed to hide the list of the names and locations of the rescued Jewish children.\n\nShe prevented this information from falling into the hands of the Gestapo. Withstanding torture and imprisonment, Sendler never revealed anything about her work or the location of the saved children.\n\nShe was sentenced to death but narrowly escaped on the day of her scheduled execution, after Żegota bribed German officials to obtain her release. Żegota was the successor institution to the Provisional Committee to Aid Jews and was established specifically to save Jews.\n\nPoland was the only country in German-occupied Europe where such a government-established and -supported underground organization existed. So it’s to Zegota that Sendler was saved from the Gestapo.\n\n3. Sendler was recognized as Righteous Among the Nations\n\nRighteous Among the Nations is an honorific used by the State of Israel to describe non-Jews who risked their lives during the Holocaust to save Jews from extermination by the Nazis for altruistic reasons.\n\nThe term originates with the concept of “righteous gentiles”, a term used in rabbinic Judaism to refer to non-Jews, called ger toshav, who abide by the Seven Laws of Noah. Why was Sendler recognized as Righteous Among Nations by Israel?\n\nInitially in the 1930s, Sendler conducted her social work as one of the activists connected to the Free Polish University. Also, in post-war communist Poland, Sendler continued her social activism but also pursued a government career. This is the main reason why she was recognized as Righteous Among Nations.\n\n4. Sendler received many decorations throughout her life\n\nAmong the many decorations, Sendler received was the Gold Cross of Merit granted her in 1946 for the saving of Jews. The Cross of Merit is a Polish civil state decoration established on 23 June 1923, to recognize services to the state.\n\nAt the time of its establishment in 1923, the Cross of Merit was the highest civilian award in Poland. It was awarded to citizens who went beyond the call of duty in their work for the country and society as a whole. May be awarded twice in each grade to the same person.\n\nThe other decoration she received was the Order of the White Eagle. The Order of the White Eagle is Poland’s highest order awarded to both civilians and the military for their merits. It was officially instituted on 1 November 1705 by king Augustus II the Strong of Poland and the elector of Saxony.\n\nIt was bestowed on eight of his closest diplomatic and political supporters. It is one of the oldest distinctions in the world still in use. The decoration was awarded late in Sendler’s life for her wartime humanitarian efforts.\n\n5. She grew up in a Jewish community\n\nSendler was born in Warsaw, to Stanisław Henryk Krzyżanowski, a physician, and his wife, Janina Karolina. She was baptized Irena Stanisława on 2 February 1917 in Otwock. She initially grew up in Otwock, a town about 15 miles southeast of Warsaw, where there was a Jewish community.\n\n6. Why was Sendler devoted to helping the Jews soo much?\n\nHer father, Stanisław Henryk Krzyżanowski, was a humanitarian who treated the very poor, including Jews, free of charge. Unfortunately, Stanislaw died in February 1917 from typhus contracted by his patients.\n\nAfter his death, the Jewish community offered financial help for the widow and her daughter, though Janina Krzyżanowska declined their assistance. This is the main reason why she wanted to pay back for the kindness the Jews gave their helpless single-parent family when the father died.\n\n7. Sendler started her activism while at the University\n\nFrom 1927, Sendler studied law for two years and then Polish literature at the University of Warsaw, interrupting her studies for several years from 1932 to 1937. She opposed the ghetto benches system practiced in the 1930s at many Polish institutions of higher learning.\n\nDue to her opposition to ghetto benches, she defaced the “non-Jewish” identification on her grade card. She reported having suffered from academic disciplinary measures because of her activities and reputation as a communist and Philo-Semite.\n\n8. Sendler once worked in a legal counseling and social help clinic\n\nIn the legal counseling and social help clinic, the Section for Mother and Child Assistance at the Citizen Committee Sendle helped the Unemployed. She published two pieces in 1934, both concerned with the situation of children born out of wedlock and their mothers.\n\nShe worked mostly in the field, crisscrossing Warsaw’s impoverished neighborhoods, and her clients were helpless, socially disadvantaged women. In 1935, the government abolished the section. Many of its members became employees of the City of Warsaw, including Sendler in the Department of Social Welfare and Public Health.\n\n9. Sendler divorced Mieczysław Sendler twice\n\nIn 1931 Sendler married Mieczysław Sendler. He was mobilized for war, captured as a soldier in September 1939, and remained in a German prisoner of war camp until 1945. They divorced in 1947.\n\nIrena then married Stefan Zgrzembski, a Jewish friend and wartime companion. They were blessed with three children, Janina, Andrzej (who died in infancy), and Adam (who died of heart failure in 1999).\n\nIn 1957 Zgrzembski left the family; he died in 1961 and Irena remarried her first husband, Mieczysław Sendler. Ten years later they divorced again.\n\n10. American filmmaker Mary Skinner filmed a documentary about Irena Sendler\n\nThe film documentary is called Irena Sendler. The documentary was filmed In the Name of Their Mothers. It features the last interviews Sendler gave before her death.\n\nThe film made its national U.S. broadcast premiere through KQED Presents on PBS in May 2011 in honor of Holocaust Remembrance Day and went on to receive several awards, including the 2012 Gracie Award for outstanding public television documentaries."}, {"url": "https://www.historicmysteries.com/irena-sendler/", "page_content": "Irena Stanislawa Sendler was a Polish social worker and humanitarian who served in World War II as a nurse in the Polish Underground Resistance. The Polish Underground Resistance operated in German-occupied Warsaw.\n\nFrom October 1943 she was head of the children’s section of “Zegota”, the Polish Council to aid Jews. In the 30s, Sendler had worked as an activist connected to the Free Polish University.\n\nFrom 1935 through to October 1943, Sendler worked for the department of Social Welfare and Public Health in Warsaw. Throughout her time here she rescued Jews, particularly women and children, out of the Ghetto in Warsaw. However, few today know who she is or what she went through.\n\nEarly Life\n\nIrena Sendler was born in February 1910 in Warsaw. Her father was Stanislaw Henryk Krzyzanowski, a physician, and her mother Janina Karolina. However, she would grow up in Otwock, which was actually around 15 miles (24 km) southeast of Warsaw.\n\nShe was brought up in a strong Jewish community. Her father treated the poor, many of whom were Jews, despite them being unable to pay for his treatment. However, his charity may have killed him: he died in 1917 due to typhus likely contracted by one of his patients. After the death of her father, Sendler and her mother moved around Poland, first to Tarczyn and then Piotrkow Trybunalski.\n\nIn 1927, at the age of 17, Sendler studied both law and Polish literature at the University of Warsaw. here she was exposed to the ghetto bench system that was being practiced at higher education institutions throughout Poland, something she came to strongly oppose.\n\nMany Polish students supported the ghetto bench system, shown here protesting in support of its implementation in the 1930s (Unknown Author / Public Domain)\n\nThis was a form of segregation in which Jewish students were required to sit on the left-hand side section of the lecture hall. One way Irena displayed her dissatisfaction was to deface the non-Jewish identification on her grade card. Later in life, Sendler claimed that she faced disciplinary measures due to her activities as a supporter of the Jewish community and for being a communist.\n\nIrena joined the Union of Polish Democratic Youth in 1928. Later on, she joined the Polish Socialist Party and was refused repeatedly employment within the Warsaw school system due to the recommendations from the University of Warsaw which described her as radically leftist.\n\nFortunately, she was employed in a legal counseling and social help clinic, the pithily-titled “Section for Mother and Child Assistance at the Citizen Committee for Helping the Unemployed”. She tended to work in the field going in and out of Warsaw’s poorest neighborhoods until the government abolished her employment area.\n\nThe War\n\nWith the German invasion in full swing, on 1st November 1939 the German occupation authorities ordered that Jews were removed from the staff of the Social Welfare Department. This was the area where Sendler worked.\n\nThe German authorities also barred any assistance to Warsaw’s Jewish community. Sendler and her sympathetic colleagues began to help wounded and sick Polish soldiers.\n\nIt was during this time that Sendler initiated the idea to begin generating false medical documents for soldiers and poor families so that they could get aid from the government. She extended this cover to Jewish communities and institutions. Sendler led a small group to help Jewish families and children excluded from their department’s social welfare protection.\n\nBy November 1940, around 400,000 Jews were crowded into the small area named the Warsaw Ghetto which was sealed by the Nazis. Sendler was able to gain access to the ghetto through special permits granted by the Social Welfare Department which allowed her to check for signs of typhus.\n\nIrena Sendler would not stand idly by while Jewish families were herded into the Warsaw Ghetto (German Federal Archives / Public Domain)\n\nUsing this as a pretext to enter the ghetto, Sendler and colleagues brought in medications to the Jews. This soon progressed into smuggling Jews out of the ghetto and helping them survive elsewhere in the city. This was done at a huge risk to her own safety as from October 1941 it was punishable by death to give assistance to Jews in German-occupied Poland.\n\nAfter World War II\n\nDuring the Warsaw Uprising, Sendler worked in a hospital and helped Jews and Polish soldiers. However, after the war, the hospital ran out of resources. Sendler, hitchhiked to Lublin to gain funding from the communist government that was based there.\n\nShe also helped to set up Warsaw’s Children’s Home and resumed her other social work activities. Through this work, she was appointed the head of the Department of Social Welfare in Warsaw’s municipal government.\n\nIn January 1947, Sendler joined the communist Polish Workers’ Party and remained a member of its successor, the Polish United Workers’ Party until it dissolved in 1990. Recent research suggests that in 1947, Sendler was the party executive.\n\nFrom here, she held lots of high-level party and administrative posts throughout the Stalinist period. This included the Ministry of Education and the Ministry of Health.\n\nIn the Polish People’s Republic (1947-1989), Sendler received at least six decorations, including the Cross of Merit for her wartime saving of Jews, receiving another award in 1956 and eventually the knights cross in 1963.\n\nHowever, she was quite forgotten about in the modern day until a group of American high school students in 2000 rediscovered her. Yad Vashem, Israel’s official memorial to the victim of the Holocaust, had recognized her efforts in 1965 and became an honorary citizen in 1996.\n\nIrena Sendler in 2005 (Mariusz Kubik / CC BY 3.0)\n\nIrena Sendler’s achievements became well known in America when students from Kansas produced a play based on her life called “Life in a Jar”. This production was a success and was staged over 200 times in the US and contributed to getting Sendler’s story out there.\n\nHer story is an incredible one of striving against adversity. It would have been easy for her to ignore the troubles that surrounded her. However, Sendler, perhaps inspired by her father, strove every day to recognize the evils of the world and combat them.\n\nShe became one of the most celebrated people in Poland and even received a letter from Pope John Paul II praising her efforts. She has received many of the awards that both Polish and Jewish organizations could grant her, and rightfully so.\n\nTop Image: Irena Sendler in 1944. By this point she had saved thousands of Jewish lives. Source: Unknown Author / Public Domain.\n\nBy Kurt Readman\n\nReferences Edwards, B. 2008. Irena Krzyżanowska Sendler. Available at: https://www.findagrave.com/memorial/26800705/irena-sendler Hevesi, D. 2008. Irena Sendler, Lifeline to Young Jews, Is Dead at 98. Available at: https://www.nytimes.com/2008/05/13/world/europe/13sendler.html Life in a Jar. 2022. Life in a Jar: The Irena Sendler Project. Available at: https://irenasendler.org/ Mikkelson, D. 2008. Irena Sendler. Available at: https://www.snopes.com/fact-check/irena-sendler/ Reuters Staff. 2008. Sendler, saviour of Warsaw Ghetto children, dies. Available at: https://www.reuters.com/article/idUSL12654106 Yeshiva University. 2015. Rethinking the Polish Underground. Available at: http://blogs.yu.edu/news/rethinking-the-polish-underground/ Zawadzka, M. 2010. TREES OF IRENA SENDLER AND JAN KARSKI IN THE GARDEN OF THE RIGHTEOUS. Available at: https://sprawiedliwi.org.pl/en/news/trees-irena-sendler-and-jan-karski-garden-righteous"}, {"url": "https://pantheon.world/profile/person/Irena_Sendler/", "page_content": "Irena Sendler\n\nIrena Stanisława Sendler (née Krzyżanowska), also referred to as Irena Sendlerowa in Poland, nom de guerre Jolanta (15 February 1910 – 12 May 2008), was a Polish humanitarian, social worker, and nurse who served in the Polish Underground Resistance during World War II in German-occupied Warsaw. From October 1943 she was head of the children's section of Żegota, the Polish Council to Aid Jews (Polish: Rada Pomocy Żydom).In the 1930s, Sendler conducted her social work as one of the activists connected to the Free Polish University. From 1935 to October 1943, she worked for the Department of Social Welfare and Public Health of the City of Warsaw . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Irena Sendler has received more than 2,719,934 page views. Her biography is available in 60 different languages on Wikipedia (up from 57 in 2019) . Irena Sendler is the 24th most popular social activist (down from 17th in 2019), the 33rd most popular biography from Poland (down from 14th in 2019) and the 2nd most popular Polish Social Activist.\n\nIrena Sendler was a Polish woman who saved 2,500 Jewish children from the Nazis by smuggling them out of the Warsaw Ghetto."}, {"url": "https://timenote.info/en/Irena-Sendlerova", "page_content": "Irena was a Polish Catholic social worker who served in the Polish Underground and the Żegota resistance organization in German-occupied Warsaw during World War II. Assisted by some two dozen other Żegota members, Sendler saved 2,500 Jewish children by smuggling them out of the Warsaw Ghetto, providing them with false documents, and sheltering them in individual and group children's homes outside the Ghetto. Film, based on her story is made (filmed in Riga)\n\nSendler was born as Irena Krzyzanowska on 15 February 1910 in Warsaw. Her father, Stanislaw Krzyzanowski, was a physician. Sendler sympathised with Jews from childhood. Her father died in February 1917 of typhus contracted while treating patients his colleagues refused to treat. Many of those patients were Jews. After his death, Jewish community leaders offered to pay for Sendler's education. She opposed the ghetto-bench system that existed at some prewar Polish universities and as a result was suspended from Warsaw University for three years.\n\nDuring the German occupation of Poland, Sendler lived in Warsaw (prior to that, she had lived in Otwock and Tarczyn while working for urban Social Welfare departments). As early as 1939, when the Germans invaded Poland, she began aiding Jews. She and her helpers created over 3,000 false documents to help Jewish families, prior to joining the organized Żegota resistance and the children's division. Helping Jews was very risky—in German-occupied Poland, all household members risked death if they were found to be hiding Jews, a more severe punishment than in other occupied European countries.\n\nShe cooperated with others in Warsaw's Municipal Social Services department, and the RGO (Central Welfare Council), a Polish relief organization that was tolerated under German supervision. She and her co-workers organized the smuggling of Jewish children out of the Ghetto. Under the pretext of conducting inspections of sanitary conditions during a typhus outbreak, Sendler and her co-workers visited the Ghetto and smuggled out babies and small children in ambulances and trams, sometimes disguising them as packages. She also used the old courthouse at the edge of the Warsaw Ghetto (still standing) as one of the main routes for smuggling out children.In August 1943, Żegota (the Council to Aid Jews) nominated her (by her cover name Jolanta) to head its children's section. As an employee of the Social Welfare Department, she had a special permit to enter the Warsaw Ghetto to check for signs of typhus, something the Nazis feared would spread beyond the Ghetto.During these visits, she wore a Star of David as a sign of solidarity with the Jewish people and so as not to call attention to herself.\n\nThe children were placed with Polish families, the Warsaw orphanage of the Sisters of the Family of Mary, or Roman Catholic convents such as the Little Sister Servants of the Blessed Virgin Mary Conceived Immaculate at Turkowice and Chotomów. Sendler cooperated very closely with social worker and catholic nun, mother provincial of Franciscan Sisters of the Family of Mary - Matylda Getter. She rescued between 250-550 Jewish children in different education and care facilities for children in Anin, Białołęka, Chotomów, Międzylesie, Płudy, Sejny, Vilnius and others. Some children were smuggled to priests in parish rectories. She and her co-workers buried lists of the hidden children in jars in order to keep track of their original and new identities. Żegota assured the children that, when the war was over, they would be returned to Jewish relatives.\n\nIn 1943, Sendler was arrested by the Gestapo, severely tortured, and sentenced to death. Żegota saved her by bribing German guards on the way to her execution. She was listed on public bulletin boards as among those executed. For the remainder of the war, she lived in hiding, but continued her work for the Jewish children. After the war, she and her co-workers gathered together all of their records with the names and locations of the hidden Jewish children and gave them to their Zegota colleague Adolf Berman and his employees at the Central Committee of Polish Jews. However, almost all of their parents had been killed at the Treblinka extermination camp or had otherwise gone missing.\n\nAfter the war and the Soviet takeover of Poland, Irena Sendler was persecuted by the communist Polish state authorities for her relations with the Polish government in exile and with the Home Army. During this period she miscarried her second child.\n\nIn 1965, Sendler was recognized by Yad Vashem as one of the Righteous among the Nations. She also was awarded the Commander's Cross by the Israeli Institute. Only in that year did the Polish communist government allow her to travel abroad, to receive the award in Israel.\n\nIn 2003, Pope John Paul II sent Sendler a personal letter praising her wartime efforts. On 10 October 2003 she received the Order of the White Eagle, Poland's highest civilian decoration, and the Jan Karski Award \"For Courage and Heart,\" given by the American Center of Polish Culture in Washington, D.C.. She was also awarded the Commander's Cross with Star of the Order of Polonia Restituta (November 7, 2001).\n\nOn 14 March 2007, Sendler was honored by Poland's Senate. At age 97, she was unable to leave her nursing home to receive the honor, but she sent a statement through Elżbieta Ficowska, whom Sendler had helped to save as an infant. Polish President Lech Kaczyński stated she \"can justly be nominated for the Nobel Peace Prize\" (though nominations are supposed to be kept secret). On 11 April 2007, she received the Order of the Smile as the oldest recipient of the award.\n\nIn May 2009, Irena Sendler was posthumously granted the Audrey Hepburn Humanitarian Award. The award, named in honor of the late actress and UNICEF ambassador, is presented to persons and organizations recognised for helping children. In its citation, the Audrey Hepburn Foundation recalled Irena Sendler's heroic efforts that saved two thousand five hundred Jewish children during the German occupation of Poland in World War II.\n\nSendler was the last survivor of the Children's Section of the Żegota Council to Assist Jews, which she had headed from August 1943 until the end of the war.\n\nAmerican filmmaker Mary Skinner began working on a historical documentary film based on Irena Sendler's memoir as told to Anna Mieszkowska in 2003. Irena Sendler, In the Name of Their Mothersfeatures the last long interviews Irena Sendler gave before she died. Also featured are three of Sendler's co-workers and several of the Jewish children they saved. Filmed in Poland and the United States with Polish cinematographers Andrzej Wolf and Slawomir Grunberg, the film uses evocative location footage of Irena Sendler's wartime apartment, Żegota headquarters, Gestapo headquarters and the Pawiak Prison along with rare footage of the city during the German occupation to vividly re-create the events of Sendler's life. This is the first historical documentary made outside Poland to record the true story of Irena Sendler and the daring conspiracy of women who worked with her to save the children of the Warsaw ghetto. Skinner recorded over 70 hours of interview material for the film and spent seven years consulting archives, historical experts, and eyewitnesses in the United States and Poland to uncover many unknown details about their operation. The film made its broadcast premiere on PBS in May 2011 in honor of Holocaust Remembrance Day, through KQED Presents. The DVD is distributed through PBS.\n\nIn 1999, Kansas students produced a play based on research into Irena Sendler's life story titled Life in a Jar. It has since been adapted to television as The Courageous Heart of Irena Sendler.\n\nSendler's story was largely unknown to the world until the students developed The Irena Sendler Project, producing their performance Life in a Jar. This student-produced drama has now been performed over 285 times all across the United States, in Canada and in Poland. Sendler's message of love and respect has grown through the performances, over 1,500 media stories, a student-developed website with 30,000,000 hits, a national teaching award in Poland and the United States, and an educational foundation, the Lowell Milken Education Center, to make Sendler’s story known to the world.\n\nLife in a Jar continues to travel around the country sharing Irena's story.\n\nIrena Sendler died in Warsaw on May 12, 2008.\n\nWikipedia\n\nwww.irenasendler.com"}, {"url": "https://uticaphoenix.net/irena-sendler-who-served-in-the-polish-underground-during-ww-ii/", "page_content": "by Ted Rajchel\n\nIrena Stanislawa Sendler was a Polish humanitarian, social worker, and nurse who served in the Polish underground resistance during World War II in German occupied Warsaw. From October, 1943 she was head of the children’s section of Zegota, the Polish council to aid Jewish people. Her nick name was ‘Jolanta.’\n\nWho Was this Great Lady?\n\nIrena Sendler was a Polish woman, who along with her trusted network, is credited to have saved the lives of 2,500 Jewish children during the Holocaust. She was working as a nurse and a social worker; she was very active in the Polish underground—The Polish resistance movement during World War II—in German occupied Warsaw.\n\nAs a young woman she was deeply influenced by her father who was a doctor and also one of the first Polish socialists. She grew up watching her father tend to poor patients and this instilled in her a desire to help the needy and the under privileged in whatever ways she could.\n\nWhen the Germans invaded Warsaw in 1939 and started inflicting unspeakable tortures on the Jewish population, she made it her priority to help out Jewish people by offering them food and shelter. She collaborated with some of her trusted allies and used her position to obtain thousands of false documents to help the Jewish families.\n\nAs a nurse and a social worker, Irena was in charge of the children’s division of Zegota, a Polish underground group to assist Jewish people. In this position, she worked tirelessly with her helpers to smuggle around 2,500 children out of the Warsaw Ghetto and provided them safe shelter outside the ghetto.\n\nEarly Life\n\nIrena was born as Irena Krzyzanowska on the 15th of February, 1910 in Otwock, near Warsaw, to Stanislaw Krzyzanowski and his wife Janina. She was her parents’ the only child. Her father was a physician and also one of the first Polish socialists. She was greatly influenced by his selfless service to his patients, mostly poor and Jewish. He did not charge them for his services. Her father contracted typhus while treating Jewish patients the other doctors refused to treat and died in February, 1917.\n\nFrom 1927 Sendler studied law for two years and then Polish literature at the University of Warsaw, interrupting her studied for several years from 1932 to 1937. She became associated with social and educational units of the Free Polish University, where she met and was influenced by activists.\n\nOne was Wszechnica Sendler, who belonged to a group of social workers led by Professor Helena Radlinska; a dozen or more women from that circle would later engage in rescuing Jewish people from her social work on site interviews.\n\nSendler recalled many cases of extreme poverty that she encountered among the Jewish population of Warsaw. She married Mieczyslaw Sendler in 1931. He was mobilized for war, captured as a soldier in September, 1939 and remained in a German prisoner of war camp until 1945; they divorced in 1947. She then married Stefan Zgrzembski, a Jewish friend and wartime companion, with whom he had three children. In 1957 he left the family; he died in 1961 and Irena remarried her first husband, Mieczyslaw Sendler. Ten years later they divorced again.\n\nHer Career\n\nDuring the late 1930s Irena Sendler moved to Warsaw and started working for municipal social welfare departments. The Germans invaded Poland in 1939 and the Nazis started brutalizing the citizens, especially the Jewish population.\n\nShe was working as a Senior Administrator in the Warsaw social welfare department at that time. The department operated canteens all over the city and provided meals and other necessities to the orphans, elderly and the poor.\n\nIrena Sendler realized the situation of the Jewsish people under the Nazis and helped them by registering them under fictitious Christian names and reported the Jewish families as being afflicted with highly infectious diseases in order to prevent inspections. She was taking a huge a huge risk by helping the Jewish people, as giving any kind of assistance to them in German—occupied Poland was punishable by death. Yet she courageously continued her services.\n\nTo the Jewish population, the Zegota, an underground organization also known as the Council to Aid Jewish People, selected her. To head its Jewish children’s section in 1943 during this time, she was assigned the name of Jolanta, her nickname, in order to protect her real identity.\n\nAs an employee of the social welfare department, she had a special permit to enter the Warsaw ghetto, an area into which hundreds of thousands of Jewish people were herded and imprisoned.\n\nInside the ghetto, the Jewish people lived in highly deplorable conditions and were most likely to be killed b the Nazis in the near future. Sendler, along with some other like-minded and courageous women, started smuggling out Jewish children from the ghetto. The babies and children were hidden in gunny bags, buried inside loads of goods, or sometimes even placed in coffins to hide them from the Nazis and transported to safer places.\n\nSendler participated, with dozens of others, in smuggling Jewish children out of the Warsaw ghetto and then providing them with false identity documents and sheltering them with willing Polish families or in orphanages and other care facilities, including Catholic nun convents, saving those children from the Holocaust.\n\nSendler ensured that the children were provided with false identities and placed them in non-Jewish homes. She also documented the children’s original names and new identities in coded form and hid the records by placing them inside jars and burying them under trees. She was a very courageous young girl. She and her helpers had succeeded in saving around 2.500 children in this manner. However, her activities were discovered by the Gestapo, and she was severely tortured. She refused to divulge any vital information in spite of being brutally tortured and finally sentenced to death.\n\nThe German occupiers suspected Sendler’s involvement in the Polish underground and in October, 1943 she was arrested by the Gestapo, but she managed to hide the list of the names and locations of the rescued Jewish children, preventing this information from falling into the hands of the Gestapo. Withstanding torture and imprisonment, she never revealed anything about her work or the locations of the saved children.\n\nShe was sentenced to death, but narrowly escaped on the day of her scheduled execution after Zegota bribed German officials to obtain her release. She then acquired a false identity and continued her work with the Zegota, working as a nurse until the Germans left Warsaw.\n\nDuring her later years, she worked for the ministries of education and health, and helped to organize a number of orphanages and children, family, and elderly care centers. She is best remembered for the pivotal role she played in saving the lives of approximately 2,500 Jewish children during the Holocaust in which most of the parents ultimately perished. She smuggled them out of the Warsaw Ghetto and helped in finding them homes with non-Jewish families, an act for which she later received wide spread recognition.\n\nIrena Sendler lived a long life, and spent her last years in Warsaw. She died on the 12th of May 2008 at the age of 98 and is buried in Warsaw’s Powazki Cemetery.\n\nRecognition and Awards\n\nIn 1965 Sendler was recognized by Yad Vashem as one of the Polish Righteous Among the Nations. In 1983 she was present when a tree was planted in her honor at the Garden of the Righteous Among the Nations.\n\nIn 1991 Sendler was made an Honorary Citizen of Israel. In June, 1996 she was awarded the Commander’s Cross of the Order of Polonia Restituta. She received a higher version of this award, the Commander’s Cross with Star on the 7th of November, 2001. She was honored with the Order of the White Eagle, Poland’s highest civilian decoration, in 2003. Sendler was posthumously granted two awards in 2009: The Humanitarian of the Year Award from the Sister Rose Thering Endowment, and the Audrey Hepburn Humanitarian Award.\n\nIn 2003 Pope John Paul II sent Sendler a personal letter praising her wartime efforts. She was awarded The Polish-American Award, the Jan Karski Award “For courage and heart,” given by The American Center of Polish Culture in Washington, DC.\n\nIn 2006 the Ministry of Foreign Affairs of Poland, and the Life in a Jar Foundation established the Irena Sendler Award “for repairing the world.” The Life in a Jar Foundation dedicated to promoting the attitude and message of Irena Sendler. On the 14th of March in 2007, Sendler was honored by the Senate of Poland and a year later, on the 30th of July, by the United States Congress. On the 11th of April in 2007 she received the Order of the Smile. At that she was the oldest recipient of the award.\n\nIn 2007 she became an Honorary Citizen of the Cities of Warsaw and Tarczyn. In 2013 the walkway in front of the Polin Museum of the history of Polish Jews in Warsaw was named after Sendler. “This noble woman …worked for Zegota and saved hundreds of Jewish children.”\n\nReferences: (1) Irena Sendler—Wikipedia; (2) Irena Sendler Biography-Facts, Childhood, Family Life, and Achievements; (3) Irena Sendler—Stories of Women, Who Received Jews during the Holocaust ."}, {"url": "https://www.theguardian.com/world/2008/may/14/secondworldwar.poland", "page_content": "Irena Sendler, who has died in a Warsaw hospital at the age of 98, was one of the heroes of the Nazi occupation of Poland. As a member of Zegota, the Council for Providing Aid to the Jews, an organisation set up by the Polish underground state and financed by the Polish government-in-exile in London, she succeeded in saving around 2,500 Jewish children in the Warsaw ghetto from certain death in the Nazi extermination camps.\n\nBorn in Otwock, a resort town near Warsaw much frequented by Jews before the war, Sendler was the only daughter of a doctor, Stanislaw Krzyzanowski, known for his sympathetic approach towards his Jewish neighbours. Unusually for a Catholic child, Sendler was allowed to play with Jewish children as she grew up. She studied Polish literature and became active in the Polish Socialist party. At the time of the Nazi invasion of Poland in 1939, she was also working as a social care nurse for the Warsaw city welfare department.\n\nDuring the Nazi occupation, conditions for the Jews in Warsaw deteriorated dramatically as more than 400,000 people were confined in the city's ghetto, an area of perhaps four square kilometres, which was then, in 1940, sealed off. Sendler was involved in providing assistance to those in need, and in December 1942 - soon after the deportation of Jews had begun to the Treblinka death camp - she became head of the children's department of Zegota. She was motivated, above all, by her sense of social justice and her feelings of obligation to her Jewish friends.\n\nWhen the German authorities decided finally to liquidate the Warsaw ghetto in 1943, Sendler was one of a group of around 20 Zegota members who organised the evacuation of children, placing them in Polish families, orphanages and convents. She was able to move around the ghetto legally, disguised as a public-health nurse responsible for investigating a suspected typhus epidemic. Sometimes, the children were hidden in a lorry driven by a fellow conspirator, Antoni Dzbrowski. A mechanic reportedly hid babies in his toolbox. At other times, they were given sleeping draughts and transported to what was known as the \"Aryan\" side - outside the ghetto - in baskets, or chests in ambulances or streetcars. German officials were told they had died of typhus.\n\nThe escaping children were provided with false identities, and many of those who remained in Poland were taught Christian prayers so they would blend into the community more easily. But their real names and details of their families were written down in code and buried in jam jars, which were dug up after the war. This meant that once the conflict was over the children were able to discover who they really were.\n\nIn October 1943, at the height of this rescue operation, Sendler was arrested by the Gestapo. She was brutally tortured in the notorious Pawiak prison and sentenced to death. But she never revealed details of her contacts and, by bribing her guards, other members of Zegota were able to obtain her release.\n\nAfter Poland's liberation in 1945, Sendler returned to the Warsaw social welfare department, co-founding an orphanage and an old people's home and organising a service to deal with women and children in need. She stayed in contact with some of the children she had rescued, many of whom eventually found their way to Palestine.\n\nThere was little recognition for Sendler's work in Poland in the immediate aftermath of the war, but in 1965 she was awarded the title of \"Righteous Among the Nations\" by the Yad Vashem Holocaust memorial centre in Jerusalem, and in 1991 was granted honorary citizenship by the state of Israel. In 2006 she was nominated for the Nobel peace prize by an American teacher, Norman Conrad, whose students had written a play and made a documentary film about her, entitled Life in a Jar. By now her candidacy was supported by the Polish president, Lech Kaczynski, and the prime minister of Israel, Ehud Olmert. Her Polish awards included the Jan Karski award for moral courage (named after a Polish resistance fighter), the Order of the White Eagle and honorary citizenship of Warsaw. In 2006, a biography of her appeared in Germany and Poland.\n\nLast year, her work was recognised by the Polish senate, which unanimously passed a resolution praising her work in rescuing \"the most defenceless victims of the Nazi ideology - the Jewish children\". Ill-health prevented her from attending the ceremony, but in a letter to the senate she wrote: \"Every child saved with my help and the help of all the wonderful messengers who are today no longer alive is the justification for my existence on this earth, rather than a claim for honour.\"\n\nThe greatness of Sendler's achievements was widely accepted. According to Elzbieta Ficowska, one of those saved as a five-month-old baby in July 1942 and now the wife of a leading Polish poet: \"It took a miracle to save a Jewish child. Sendler saved not only us, but also our children and grandchildren and the generations to come'.\n\nAccording to Shevach Weiss, the former Israeli ambassador to Poland, who himself survived with a Polish family during the Nazi occupation: \"Irena Sendler should be seen as the Righteous among the Righteous. Poles and Jews have a trio of heroes in common; Pope John Paul II, Janusz Korzak and Irena Sendler.\"\n\nIll-health prevented Sendler from receiving the presidents of Poland and Israel on the occasion of the 65th anniversary of the Warsaw ghetto rising last month. Sadly, too, she died on the same day as a ceremony naming a Warsaw school, Gymnasium No 23, in her honour.\n\nHer first marriage was to Mieczyslaw Sendler; they divorced shortly after the war. She then married a fellow member of the underground, Stefan Zgrzembski, with whom she had two sons and a daughter. One son died a few days after his birth and the second, Adam, died of heart failure in 1999. She is survived by her daughter and a granddaughter.\n\n· Irena Sendler, social worker and rescuer of Warsaw Jews, born February 15 1910; died May 12 2008\n\n· This article was amended on Tuesday May 20 2008. The Warsaw ghetto was something over four square kilometres in size, rather than one square kilometre as we said in the obituary of Irena Sendler. This has been corrected."}, {"url": "https://encyclopedia.ushmm.org/content/en/oral-history/irena-sendler-describes-how-she-was-arrested-and-tortured-by-the-gestapo", "page_content": "Irena Sendler (1910–2008) was a member of the Council for Aid to Jews, codenamed “Żegota.” Żegota was a clandestine rescue organization of Poles and Jews in German-occupied Poland. Supported by the Polish government-in-exile, Żegota coordinated efforts to save Jews from Nazi persecution and murder. It operated from 1942 to 1945.\n\nIrena Sendler (Sendlerowa) was working as a social worker in Warsaw when World War II broke out in 1939. After the Nazis forced Warsaw’s Jews to move into the ghetto in the fall of 1940, Irena used her position and prewar network to supply food and offer financial assistance to Jews. By early 1943, Irena had joined Żegota. Żegota members secured hiding places for Polish Jews. They also delivered money, food, false identity documents, and medical assistance to those in their care.\n\nUnder the alias “Jolanta,” Irena helped smuggle several hundred Jewish children out of the Warsaw ghetto. She found hiding places for them in orphanages, convents, schools, hospitals, and private homes. Irena provided each child with a new identity. She carefully recorded their original names and placements in code so that relatives could find them after the war. In the fall of 1943, Irena was appointed head of Żegota’s children's section. Only a few days later, she was arrested by the Gestapo (German secret state police). The Gestapo brutally beat and tortured her. Nonetheless, Irena never revealed the names of the children or her colleagues. She was later released from the Gestapo prison thanks to a bribe organized by her fellow rescuers. Despite the dangers, Irena continued working with Żegota under a new alias.\n\nIrena Sendler survived the war. In 1965, Yad Vashem recognized her as “Righteous Among the Nations.”\n\nIn this interview, Irena Sendler describes how she was arrested and tortured by the Gestapo."}]}