{"The first opera house in the principality was commissioned by Honoré III.": [{"url": "https://study.com/academy/lesson/the-paris-opera-house-history-architecture.html", "page_content": "Additional Info\n\nBeginnings of Grandeur\n\nFrance has had a long, tumultuous history. Revolutions, beheadings, wars - France has had many trials throughout the years. Everyone in charge has wanted to leave their mark on the country. In 1858, outside the entrance to the opera, Napoleon III survived an assassination attempt by Italian nationalists. This inspired him to build an opera house with a more secure entrance, to be called the Académie Impériale de Musique et de Danse, or the Imperial Academy of Music and Dance.\n\nCompetition\n\nBefore the new opera house could be built, the land the Emperor chose had to be cleared. In December of 1860, the Emperor announced that there would be a design competition for the new opera house. Of the 171 architects that applied worldwide, one man was chosen. His name was Charles Garnier, a yet unknown 32 year old architect. His design solved the problem of accommodating large audiences.\n\nConstruction and Destruction\n\nIt took several years for the new opera house to be built. Construction began in 1862. The 12,000 square meters that Napoleon III ordered to be cleared turned out to be swampy and on top of a subterranean lake. It took eight months for the foundation to finally be poured, as it kept flooding and filling with water.\n\nFlooding wasn't the only problem plaguing the construction of the new opera house. The 1869 election showed Napoleon III that the middle and working classes weren't happy with the way things were being run in their country. The economy was terrible, and soon France was once again at war, this time with the Prussians. Napoleon III was captured and deposed and later died in 1873. Construction stalled, but Garnier still tried to work on it despite the financial problems and resistance from the public who wanted it torn down. The Palais Garnier, the Paris Opera House, finally opened on January 5, 1875. Paris finally had a new home for its opera and ballet performances.\n\nThe Foundation Being Built\n\nInauguration of the Paris Opera, painting by Edouard Detailles\n\nInterior\n\nThe foundation of the Paris Opera House is made of concrete. Once construction was able to resume, Garnier set to work on finishing it. The foundation problems were solved by Garnier creating a system that drained the groundwater into a cistern; he was able to build on top of that, creating a double-walled foundation.\n\nHe tried to use modern materials, like metal. Instead of the expensive and time consuming process of gold leaf decorating (thin sheets of gold applied with a brush), he used gilded metals. He painted the metal yellow and then gold leaf was applied only where the light would hit in order to make it look like the whole section was gold. He also used marble for the interiors, with grand sculptures, and curves and columns. Many murals were featured throughout the building, even on the ceiling. Mirrors in the entrance make visitors feel like they are part of the scenery. The grand staircase is an impressive feature in the interior; they lead into the theater, which seats 1,979 people.\n\nThe foyer of the opera is where people can mingle before the shows start. The ceilings are painted and are lit by chandeliers. There is also a large chandelier in the theater. Weighing seven tons, Garnier's bronze and crystal creation rises above the audience.\n\nExterior\n\nThe exterior is equally decorative, with many sculptures and curved designs. The building was designed in the Beaux-Arts style, which emphasizes symmetry and ornamentation. The exterior showcases many sculptures, including marble busts of composers and depictions of Harmony and Poetry. The building includes two side pavilions, one created as an entrance for the emperor, the other for the audience. Since Napoleon III passed away before it was finished, they now house the Paris Opera library and museum.\n\nFront of the Paris Opera House\n\nLyric Drama\n\nApollo, Poetry, and Music\n\nModern Renovations\n\nAs in any old building, things fall apart. The building received an electrical update first in 1969. Restoration work began in 1994, and finished in 2007. The exterior, dirtied by years of pollution, was cleaned. The electricity was updated once again, and the foundation was strengthened."}, {"url": "https://www.francethisway.com/paris/paris-opera.php", "page_content": "Paris Opera visitor guide Search Paris hotels Visit Paris Opera, France Photo Gallery Book a visit\n\nThe Palais Garnier in Paris is most commonly known as the Paris Opera, and is one of the most important buildings in Paris. It is centrally placed just a short distance from the Louvre.\n\nThis 2,200 seat opera house was the successor to the Théâtre de l'Académie Royale de Musique, which had burned down in 1873. This landmark is a prime example of the Beaux-Arts architecture movement, in part drawing on the 17th century Classical Roman and Baroque style of emphasizing drama and grandeur as well as symmetry.\n\nBuilding and History of the Paris Opera / Palais Garnier\n\nThe Palais Garnier was commissioned during the reconstruction of central Paris by Napoleon III, and the civic planner Baron Haussmann was given the task to clear enough land to build the opera house in 1858. The design, by architect Charles Garnier, was chosen from a competition held in 1861.\n\nThe building was always designed to be an extravagant experience, with a lush, richly decorated space incorporating excessive elements such as a six-ton central chandelier, bronze busts of composers, and multiple columns, friezes and statues.\n\nThe enormous stage could accommodate up to 450 people at one time, and even the building’s corridors and stairwells are cavernous.\n\nConstruction began in 1862, and was quickly plagued with setbacks and delays. It turned out that the building's foundation had unwittingly been laid upon a swamp, which took roughly eight months to drain. Then the Franco-Prussian War and the subsequent fall of Napoleon III also caused long interruptions between construction periods.\n\nIt wasn’t until the Théâtre de l'Académie Royale de Musique (1821 – 1873) burned down that there was a renewed impetus that finally gave Garnier a chance to finish the work, and he did so by the end of 1874. The Palais Garnier was inaugurated on January 15, 1875.\n\nThe name Palais Garnier is only a recent title – by the time it was renamed as such in 1989 it had gone through two other names. Its first was Académie Nationale de Musique - Théâtre de l'Opéra until 1978 when it was renamed as the Théâtre National de l'Opéra de Paris.\n\nPalais Garnier became the official name when the Opéra Bastille was built in 1989 to replace the older opera house, although the Palais Garnier still remains and continues to house performances, and many Parisians still refer to the building as the Paris Opera.\n\nAdvertisement\n\nVisiting the Paris Opera Garnier\n\nThe most impressive way to approach the Opera is along the Avenue de l'Opéra from the Louvre. You can see the facade of the Opera building from all along this avenue, and it just gets more impressive the closer you get.\n\nFirst you will want to walk all around the building admiring its detail from the outside: there is a whole mix of architectural styles from Ancient Greek to Baroque and Renaissance as well as a great deal of statuary and ornamentation to be seen.\n\nThe entrance to see the interior is to the left of the main entrance, and tickets cost about 11 euros. The inside of the Paris Opera was always designed to be a vast and glittering space, and it doesn't disappoint.\n\nAlmost every interior surface is of marble and other impressive stonework, gilded and frescoed and magnificent staircases lead between the principal rooms, and numerous statues and candelabras add further to the opulence.\n\nOne unexpected surprise is the main hall, with a ceiling painted by the modern artist Marc Chagall in 1964 and an interesting contrast to the 19th century excesses.\n\nAlthough the Bastille is now the official home to opera in Paris, performances are often still held here with starting prices for tickets of around 150 euros.\n\nSee Paris Short Breaks to plan your Paris visit"}, {"url": "https://blogs.ubc.ca/buildingempire/2021/02/18/palais-garnier-paris-opera-house-the-symbol-of-imperial-power-cultural-prestige/", "page_content": "The Paris Opera House was designed and completed by Charles Garnier between 1861 and 1875.[1] Dripping in opulence and grandeur, ‘Palais Garnier’ is the quintessential depiction of France’s Imperial Power acquired during the Second Empire rule; representing the growing bourgeoisie population, Napoleon III’s political ambitions both domestically and internationally, and a legacy of symbology which transgressed into colonized regions. This entry will be looking at the Opera House through its socio-political context, its economic funding in relation to colonialism, and its legacy as a symbol of French Imperial Power.\n\nFigure 1: Paris, Opera, 1861-75, by Charles Garnier: longitudinal section\n\nThis section highlights the procession of spaces as a bourgeois ritual of Opera. The interior spaces are as opulent as the exterior.\n\n[1] Mead, Christopher. “Urban Contingency and the Problem of Representation in Second Empire Paris.” Journal of the Society of Architectural Historians 54, no. 2 (1995): 138\n\nSecond Empire & The Paris Renovation\n\nFrance went through significant shift throughout the 19th century witnessing the triumphs and failures of multiple republics, empires, and monarchies. The Second Empire, ruled by Napoleon III, the first President and last Monarch of France, would see to the most significant changes to France including the renovation of Paris. Drafting a new plan for Paris, President Louis-Napoléon signed a law in 1852 allowing the government to expropriate properties in way of rebuilding the city and its streets. This gave the government authority to expedite urban renewal while still “remaining a collaborative venture between public and private interests.”[1]\n\nThe following year Baron Georges-Eugene Haussmann was commissioned to begin the first phase of Paris’ rebuild lasting 1853-1870.[2] The rebuilding of Paris sought myriad outcomes beyond the sanitization and beautification of a polluted medieval city. It included protecting the government during civil unrest by widening the streets so barricades would be impossible and creating shorter routes between the barracks and lower class working districts.[3] This was an effort on Napoleon III to maintain control over the Population of Paris, specifically the lower class in workers’ districts.\n\nUnder the reign of Napoleon III, the population of Paris doubled.[4] Many of the bourgeoisie who moved from the city to the suburbs to escape its pollution came flocking back. With this new population the older affordable housing was demolished and the lower class was displaced “into the city’s remaining and increasingly expensive slums.”[5] “The breaking up of whole social neighborhoods by Hausmann’s works, forcing the poor into even more crowded quarters while applying the elegant veneer of civilization to the boulevard facades [for the bourgeoisie.]”[6] This dispossession of land from the lower class was the beginning of Napoleon III’s vision of Imperial Power and grandeur for Paris.\n\nThese new Boulevards were designed to be deep elongated corridors with uninterrupted arteries.[7] Each would be lined with rhythmic structures in the quintessential Second Empire style, with its tripartite design of a commercial base, pilastered upper levels, and mansard roof (or attic space). Majority of these new Boulevards terminate at a civic space, monument or building. Circulation of Paris now revolved around the Second Empire’s symbols of authority and power. Although these buildings were intended for the intellectual bourgeoisie interested in politics, some argue that “the interest of the French government in the 1850s and 1860s became one of distracting precisely that public from participating in politics. In lieu of political power, Napoleon offered them a magnificent playground.”[8] This outlines that Napoleon III’s intentions to renovate Paris were insidious and a way to distract the public from government affairs.\n\nFigure 2: Hausmann’s schematic plan for Paris’ Renovation.\n\nThe site of Garnier’s Opera is highlighted with a red circle. Proposed new streets are marked in a thick black line and cross hatched areas represent new districts. The intervention is striking when you zoom out at birds eye view.\n\n[1] Mead, Second Empire Paris., 149\n\n[2] Mead, Second Empire Paris., 138\n\n[3] Benjamin, Walter. “Paris, Capital of the Nineteenth Century” (Exposé of 1935). The Arcades Project. Cambridge, Mass: Belknap Press, 1999., 12\n\n[4] James-Chakraborty, Kathleen. Architecture since 1400. Minneapolis: University of Minnesota Press, 2014., 273\n\n[5] James-Chakraborty, Architecture since 1400., 281\n\n[6] Vidler, Anthony. “The New Industrial World: The Reconstruction of Urban Utopia in Late Nineteenth Century France.” Perspecta 13/14 (1971): 253\n\n[7] Walter, Paris, Capital of the Nineteenth Century., 11\n\n[8] James-Chakraborty, Architecture since 1400., 278\n\nFigure 3: Haussmann’s schematic plan for the Avenue de l’Opera c.1850\n\nThe site of Garnier’s Opera is highlighted with a red circle. Thicker black lines indicate new road boundaries. The more zoomed in look starts to give a scale of the mass destruction that occurred.\n\nThe Paris Opera House\n\nIn 1860, Napoleon III declared Paris needed a new Opera so the state held a design competition. Charles Garnier won the competition and was commissioned to design the Opera in June of 1861.[1] Some suggest that the Opera was a natural progression for the city, such as journalist Ernest Chesneau in 1875: “for the enlarged, aerated, sanitized Paris, transformed with the clearest foresight of social needs and at the same time with magnificence by the imperial government.. one needed an Opera house that was worthy of the grandeur, the luxury, and the arts of the new Paris.”[2] The siting of the Opera was contested for almost a century until Hausmann and Napoleon III decided on its final location in c.1860.[3] Confined at the end of Avenue de l’Opera, the Opera house would be constructed in proximity to glamourous department stores, and have a direct connection to the Louvre.[4] The view of the terminated axis is a striking Neo-Baroque styled Opera that is both dripping in opulence and the indoctrination of France’s Imperial Power.\n\nThe Opera’s style built upon the new the French national style, one that coopted the classical styles of antiquity from Greece and Rome[5] and culminated in Claude Perrault’s east façade of the Louvre. The design of its exterior borrows from Classical Palladian models, Italian Renaissance, and Beaux-Arts to create a uniquely eclectic style. Garnier suggests that the style is “du Napoleon III.”[6] The construction occurred when the archetypal Parisian style was being used for both public and private structures, leading to the design of complimentary surrounding residential buildings.[7] The image of imperial civic structures bleeds into the typical style of Paris, emulating the Second Empire’s Imperial Power throughout the city.\n\nFigure 4: Garnier’s ground floor plan for the Opera\n\nGarnier pays homage to his Beaux-Arts education with this horizontal plan with particular attention to the procession of Opera goers through circulation. He designs each space as separate volumes and provides almost enough backstage space as he does to the front of house.\n\nNo expense was spared on the building’s ornamental stone work, opulent sculptural busts and statues, and copper and gold finishes. Its placement on a polygonal site at the end of multiple intersections would promote views to the building, be more secure for Napoleon III, and hamper the spread of fires.[8] Its plan, although predominantly rectilinear on a polygonal site, was remedied by flanked “curved buildings whose courtyards could serve as imperial public carriage entrances” as well as curving the surrounding buildings, and widening Avenue de l’Opera beyond its initial 22 metre width.[9] This created a nexus around the Opera house symbolizing Second Empire Paris, and further iterating France’s Imperial Power.\n\nThe Opera’s interior is as opulent as the exterior. The plan reflects Garnier’s Beaux-Arts training at the Ecole in the practical matters of “circulation and clear expression of functions through separate volumes.”[10] The procession of spaces was not focused on the Opera itself, but also the entrances which shepherded patrons through opulent waiting areas for pre-and-post-show socialization.[11] “Seeing and being seen were essential components of the performance; the ceremonial space in front and support space behind exceed the volume of stage and auditorium. The monumental staircase, up which all theatregoers ascended to their seats, replaced the imperial court as the center of socially ambitious Paris.”[12] The Opera acts to mix the rituals of bourgeoisie society within the civic structures of Imperial France. With so much opulence, grandeur, and money on display, it poses the question: who is financing this project?\n\nFigure 5: The Paris Opera’s Grand Staircase, 1880 engraving\n\nGarnier’s grand staircase be a vital component of the opera ritual. All theatre goers would have to take these stairs to their seats. It was meant to yourself off to the rest of the bourgeois society. The interior is more opulent than the exterior with almost every finish being dressed with an ornamental carving.\n\n[1] Mead, Second Empire Paris., 138\n\n[2] Ibid.\n\n[3] Ibid., 142\n\n[4] James-Chakraborty, Architecture since 1400., 285\n\n[5] Sara Stevens, “Constructing The Past,” ARCH 504: Empire Building (class lecture, University of British Columbia, Vancouver, BC, January 14, 2021).\n\n[6] Mead, Second Empire Paris., 138\n\n[7] Mead, Second Empire Paris, 139\n\n[8] James-Chakraborty, Architecture since 1400., 285\n\n[9] Mead, Second Empire Paris, 155\n\n[10] Kostof, Spiro and Greg Castillo. A History of Architecture: Settings and Rituals. 2nd ed. New York: Oxford University Press, 1995., 644\n\n[11] Kostof. Settings and Rituals., 643\n\n[12] James-Chakraborty, Architecture since 1400., 286\n\nFinances, Colonization, and the Opera’s Legacy\n\nIn Christopher Mead’s book Charles Garnier’s Paris Opera: Architectural Empathy and the Renaissance of French Classicism, he argues that the client of the Opera was both Napoleon III with his private allowance, and the voting public with their tax dollars.[1] The government’s money isn’t solely from the state’s tax payers; it would also encompass the country’s wealth from trade and resource extraction.\n\nNineteenth century France rebuilt its colonial empire from no colonies in 1810 to the second most prominent Imperial Power on the colonial stage by the 20th century.[2] The second colonial empire was marked by the invasion of Algiers in 1830,[3] followed by expansive takeover in the coming decades resulting in a genocide of countless Algerians. The 1840s saw further expansion of French influence with occupation of Mayotte and Nosy Be (islands off the coast of Madagascar), the Marquise Islands and Tahiti in the Indian Ocean, and New Caledonia off the coast of Australia.[4] This highlights France’s expansion into new territory during the Second Empire. This laid the groundwork for future colonization and resource extraction. In fact, between 1787 and 1879, France’s African colonies steadily increased their exports. French exports from Sub-Saharan Africa (south of the Sahara desert) totalled 0.1% of France’s exports in 1787 to 0.5% in 1879. More so, North Africa’s exports increased from 0.5% to 4.5% and accounted for 2.5% of French Imports.[5] Though these numbers are not staggeringly high, capital was gained by these colonies. This money, in turn was given back to the French government and would have in part paid for the construction of the Paris Opera House.\n\nColonialism by the French used assimilation tactics to integrate their culture into colonies through infrastructure, architecture, and cultural practice. This was pronounced in France’s Indochinese colonies (Cambodia, Laos, and Vietnam), taking form in the destruction of historical buildings and replacing them with French styled civic structures such as museums and operas.[6] These actions taken by French colonists sought to erode the existing culture of its colony and assimilate the them with French traditions. It highlights their assumption of their cultural practices being more superior.\n\nOne individual colony directly relates back to Paris and the monumental power envisaged through the Second Empire. At the end of the 19th century in Hanoi, it was decided that a French style Opera was needed and construction began in 1901. These constructions were considered a more intrusive stage of colonization.[7] For the French, the Opera was an “expression of [their] communal values and prestige” and was “to proclaim the superiority of their culture as well as to demonstrate their allegiance to a distant home.”[8] This was thought to be completed through technological advancement and craftsmanship of their architecture.\n\nThe design of the Opera changed over its decade of construction but the completed building was akin to the Paris Opera house in architectural form, siting, and development of neighbouring roads and buildings. “The physical presence of theater buildings in combination with the less tangible performances of Opera within embodied the glorious past of the metropole and the triumphant future of the empire.”[9] Colonists developed Hanoi in the style of a contemporary western city which ended up drawing parallels between Paris and Hanoi. These comparisons portrayed Hanoi as the colonial equivalent of Paris.[10] The action of constructing a civic building comparable to that of Paris’ Opera codifies the Imperial Power of France in its colonized regions and postulates the legacy of the Paris Opera in a very tangible way.\n\nFigure 6: Hanoi’s Opera House viewed from the northest corner\n\nOpened in 1911, the Hanoi Opera House shares many of the architectural components from the Paris Opera House. The most prominent resemblance is the main entrance where both share a similar arcaded base, recessed covered upper floors and two symmetrical cupolas. The Hanoi Opera also maintains a similar central dome structure and protruding entries from the sides.\n\n[1] Taylor, Katherine Fischer. Journal of the Society of Architectural Historians 53, no. 2 (1994): 242\n\n[2] Clément, Alain. “French Economic Liberalism and the Colonial Issue at the Beginning of the Second Empire (1830-1870).” History of Economic Ideas 21, no. 1 (2013): 48; Thomas, Martin, and Andrew Thompson. “Empire and Globalisation: from ‘High Imperialism’ to Decolonisation.” The International History Review 36, no. 1 (2014): 144\n\n[3] Clément, French Economic Liberalism., 49, 52\n\n[4] Ibid., 52-3\n\n[5] Ibid., 54\n\n[6] Aldrich, Robert. “Imperial Mise En Valeur and Mise En Scène: Recent Works on French Colonialism.” The Historical Journal 45, no. 4 (2002): 923, 927; McClellan, Michael. “Performing Empire: Opera in Colonial Hanoi,” Journal of Musicological Research, 22:1-2, (2003): 135\n\n[7] McClellan, Opera in Colonial Hanoi., 147-148\n\n[8] Ibid., 137\n\n[9] Ibid., 142\n\n[10] Ibid., 154-155\n\nConclusion\n\nThe socio-political context of France under the Second Empire rule is essential in understanding the reasons and events leading up to the construction of Garnier’s Opera. Napoleon III’s political ambitions for the city, country and their international affairs would intend to protect his fascist rule through the Paris Renovation, new civic structures, and colonial domination. Garnier’s Opera, exuding luxury and superior culture, would become the major beacon in Napoleon III and Haussmann’s newly renovated Paris; acting as a prototypical symbol for the Second Empire’s Imperial Power.\n\nBibliography\n\nUrban Contingency and the Problem of Representation in Second Empire Paris\n\nAldrich, Robert. “Imperial Mise En Valeur and Mise En Scène: Recent Works on French Colonialism.” The Historical Journal 45, no. 4 (2002): 917-36.\n\nBenjamin, Walter. “Paris, Capital of the Nineteenth Century” (Exposé of 1935). The Arcades Project. Cambridge, Mass: Belknap Press, 1999.\n\nClément, Alain. “French Economic Liberalism and the Colonial Issue at the Beginning of the Second Empire (1830-1870).” History of Economic Ideas 21, no. 1 (2013): 47-75.\n\nJames-Chakraborty, Kathleen. Architecture since 1400. Minneapolis: University of Minnesota Press, 2014.\n\nKostof, Spiro and Greg Castillo. A History of Architecture: Settings and Rituals. 2nd ed. New York: Oxford University Press, 1995.\n\nMcClellan, Michael. “Performing Empire: Opera in Colonial Hanoi,” Journal of Musicological Research, 22:1-2, (2003): 135-166.\n\nMead, Christopher. “Urban Contingency and the Problem of Representation in Second Empire Paris.” Journal of the Society of Architectural Historians 54, no. 2 (1995): 138-74.\n\nLeon, Pevsner Nikolaus Bernhard. “A History of Building Types,” Princeton University Press, 1979.\n\nStevens, Sara. “Constructing The Past.” ARCH 504: Empire Building. Class lecture at the University of British Columbia, Vancouver, BC, January 14, 2021.\n\nSummerson, John. “Classical Language of Architecture: with 139 Illustrations,” Thames & Hudson Ltd, 1980.\n\nTaylor, Katherine Fischer. “Designing Paris: The Architecture of Duban, Labrouste, Duc, and Vaudoyer by David van Zanten: Charles Garnier’s Paris Opéra: Architectural Empathy and the Renaissance of French Classicism by Christopher Curtis Mead.” Journal of the Society of Architectural Historians 53, no. 2 (1994): 239-42.\n\nThomas, Martin, and Andrew Thompson. “Empire and Globalisation: from ‘High Imperialism’ to Decolonisation.” The International History Review 36, no. 1 (2014): 142-170.\n\nVidler, Anthony. “The New Industrial World: The Reconstruction of Urban Utopia in Late Nineteenth Century France.” Perspecta 13/14 (1971): 243-56.\n\nIllustration Credits\n\nCover Photo: James-Chakraborty, Kathleen. Architecture since 1400. Minneapolis: University of Minnesota Press, 2014., 286, fig. 18.9\n\nFigure 1: Leon, Pevsner Nikolaus Bernhard. “A History of Building Types,” Princeton University Press, 1979., 85, fig. 6.69\n\nFigure 2: Kostof, Spiro and Greg Castillo. A History of Architecture: Settings and Rituals. 2nd ed. New York: Oxford University Press, 1995., 644, fig.25.10a\n\nFigure 3: Kostof, Spiro and Greg Castillo. A History of Architecture: Settings and Rituals. 2nd ed. New York: Oxford University Press, 1995., 644, fig.25.10b\n\nFigure 4: James-Chakraborty, Kathleen. Architecture since 1400. Minneapolis: University of Minnesota Press, 2014., 287, fig. 18.10\n\nFigure 5: James-Chakraborty, Kathleen. Architecture since 1400. Minneapolis: University of Minnesota Press, 2014., 288, fig. 18.11\n\nFigure 6: John W Banagan, Getty Images: https://lp-cms-production.imgix.net/2019-06/5fd1918ae3e4f1bac57a3ed3b3306102-hanoi-opera-house.jpg"}, {"url": "https://www.esprit-de-france.com/en/news/discovering-paris-opera-scene", "page_content": "Of differing eras and styles, they all play an important role in the Parisian cultural scene. Let’s get to know them better…\n\nOpéra Comique\n\nFounded in 1714 under the reign of Louis XIV, Opéra Comique is the oldest of the three opera houses in Paris. In contrast with the other form of opera, which is sung throughout, the role of this opera house was to stage pantomimes and parodies of opera through song interspersed with spoken drama, giving rise to its own genre of performance and eponymous name, Opéra Comique. Listed on the register of national theaters in 2005, the venue now stages both operatic performances and plays and its repertoire encompasses all genres, extending from Baroque to contemporary music. Similar in architectural style to the Opéra Garnier, it has the advantage of being smaller in size and, thus, more artist-friendly. It is currently undergoing a facelift in its tricentennial year and will reopen to the public at the end of next year.\n\n\n\nGood to know: note that the seating in the auditorium is arranged in a horseshoe layout, so your view may not be entirely facing the stage but slightly turned towards the rest of the auditorium – for a simple, historic reason; in the past, opera-going was not solely to watch a performance; people went there to observe others and to be seen.\n\n1 Place Boieldieu, Paris 2\n\nMetro: Richelieu-Drouot\n\nFor virtual visit click here\n\nOpéra Garnier\n\nOpéra Garnier was commissioned by Napoléon III, who wanted an opera house to dazzle the rest of Europe and whose performances would be on the agenda of the Parisian aristocracy, at a time when the capital was considered the epicenter of sophistication and style. To everyone’s astonishment, in 1860 the honor of constructing the opera house was awarded to the winning bid by the young, 35-year-old, up and coming architect, Charles Garnier. Visitors to the opera house are immediately awed by the impressive Versailles Hall of Mirrors and grandiose staircase that welcomes them to the foyer. Nothing has been spared to bring you the sense of euphoria and luxury: marble, gold, red velvet…Since 2011, visitors have also been able to dine at its in-house restaurant designed by the architect, Odile Decq.\n\nAnecdotally , the restoration of its ceiling, initiated by Malraux and entrusted to the painter, Marc Chagall, was extremely controversial. Three times as many people attended its inauguration in 1964, everyone wanting to form their own opinion on the restoration work.\n\nPalais Garnier\n\nPlace Jacques Rouché, Paris 9\n\nMetro: Opéra\n\n7 to 11 euros. Open everyday from 10 a.m to 4.30 p.m. Informations: 0 892 89 90 90\n\nRestaurant L’Opéra\n\nLunch and dinner, brunch on Sundays\n\nReservations : +33.(0)1.42.68.86.80\n\nOpéra Bastille\n\nDesigned by the architect, Carlos Ott, this modern opera house was inaugurated for the bicentenary of the French Revolution of 1789. Erected on the site of a disused train station, it is the largest opera house in the world today, with 2745 seats, which makes it even bigger than the Sidney Opera House. The building has a characteristic glass façade and uses identical materials for both the interiors and the exteriors. Visitors can take a guided tour behind the scenes of the opera house and discover its amazing stage facilities (from 1 September to 16 July).\n\nWhat is 400 square meters at Opéra Bastille? That is the size of the stage elevator that can bring an entire scenery up from below stage level, thus allowing for a complete change of scenery in one fell swoop.\n\nPlace de la Bastille, Paris 11\n\nMetro: Bastille\n\nTo have the dates and times of the next visits:\n\nLook at the online calendar or by phone +33.(0)1.40.01.19.70"}, {"url": "https://egyptianstreets.com/2022/04/16/the-splendor-of-egypts-operas/", "page_content": "The Splendor of Egypt’s Operas\n\nVisions of beauty and splendor inhabit opera houses. Mesmerizing music and top-tier vocal artistry that transcend the ordinary, vibrant costumes tell stories and plays, and art in every form guarantees a magical experience.\n\nThe first opera house in Egypt dates back to the second half of the 19th century, when Khedive Ismail initiated its construction on the occasion of the inauguration of the Suez Canalin 1869 .\n\nSwayed by the splendor of European richness, the Khedivial Opera House was constructed in six months by Italian architect, Pietro Avoscani in the Azbakeya district in Old Cairo.\n\nIsmail commissioned Ascovani to design a small-scale replica of Milan’s magnificent opera, Teatro alla Scala.\n\nIn honor of the Khedivial Opera Houses’s opening in November 1869, Ismail welcomed world royalty and elites to attend Giuseppe Verdi’s Rigoletto performance.\n\nVerdi was a famous Italian composer, best known for his operas. When Verdi was commissioned to perform, he initially was going to perform one of the most popular operas, Opera Aida. It was unfortunately not ready by the time of the Opera House’s inauguration; however, Opera Aida was performed two years later in 1871.\n\nThe limestone building, which seated 850 people, was later renamed the Royal Opera House in the 1930s. In the wake of the 1952 Revolution, it was renamed once again to remove any reference to the monarchy. It simply became the Opera House.\n\nThe Opera House was the first in Africa, where famous world opera and symphonic masterpieces were performed.\n\nFrom the day it opened, the Opera House did not lose its charm or splendor until it burned down in 1971. The majority of the structure was made of wood, which made it vulnerable and not durable enough to withstand extreme conditions.\n\nThe finery, elegance, and superior musical art epicenter was re-inaugurated on 10 October in 1988, with the construction of the crème building housed in Zamalek, known as the Cairo Opera House.\n\nThe Cairo Opera House became a cultural center that hosts and attracts a myriad of performances until this day: it is divided into a main hall, a small hall, and an open air theater. The main hall is designed to seat 1300 people, and mainly lends its stage to symphonic concerts and performances. The small hall and the open theater see light music concerts, art salons, dance recitals, and special performances.\n\nThe grandeur of its past was never lost, only renewed. Some argue that it was impossible to beat the 19th-century splendor of the Khedivial Opera House; however, the latter’s character is loved – a true bastion of musical and fine arts.\n\nSubscribe to our newsletter"}, {"url": "https://www.musicapalazzo.com/en/history-of-opera-in-venice/", "page_content": "In 1636 an extraordinary fact bound to change the history of opera occurred in Venice: the Tron family obtained the permission from the Council of Ten to rebuild the San Cassian Theatre (burnt in a fire). It was no longer a theatre for comedies and the family was allowed to turn it into an opera house.\n\nThe theatre was rebuilt in less than a year and inaugurated in 1637: for the first time in the history of the music drama a public opera house with fee was created.\n\nIt was so successful that soon other 16 Theatres were built and during the following century Venice boasted its enviable primacy for being the City of Opera par excellence in all Europe.\n\nBetween the opening of San Cassiano Theatre and the opening of the last theatre of the century, the San Giovanni Grisostomo in 1678, more than 150 operas were performed.\n\nFrancesco Cavalli and Crespi, as well as Monteverdi, are some of the most important composers in Venice. They had the privilege to launch a new formula of opera, then improved in the future by other composers, whose structural units harmonized the librettist’s and the composer’s contribution. Moreover, in the Seventeenth century in Venice, the da capo aria consolidated the dynamic relationship between the audience and the singers and the figure of the leading lady emerged."}, {"url": "https://www.classical-music.com/features/articles/what-was-the-first-opera-ever-written/", "page_content": "Jacopo Peri’s Dafne was the first opera ever written. But it’s widely accepted that Monteverdi’s L’Orfeo, first staged in Mantua in 1607, was the first great example of an opera. Though music and dance had played a significant part in plays from Ancient Greece onwards, the concept of presenting wholly sung drama did not develop until much later.\n\nAdvertisement\n\nThe story is older than Monteverdi. Opera’s immediate predecessor can be found in the plays that entertained the House of Medici in 16th-century Florence, where acts were divided by increasingly elaborate musical ‘intermedi’, and it was for a Florentine audience that Jacopo Peri’s Dafne, widely regarded as the first ever opera, was performed in 1598.\n\nWhat distinguished Dafne, plus his Euridice that followed a couple of years later, was the use of recitative, by which the action is narrated in a sung form – to quote Peri himself, recitative was ‘a harmony surpassing that of ordinary speech but falling so far below the melody of song as to take an intermediate form’.\n\nPeri had collaborated on Euridice with his court rival Giulio Caccini, who in 1602 produced his own opera of the same title. Setting texts by Rinuccini, Peri and Caccini drew on Greek myth for their subjects as, of course, did Monteverdi for L’Orfeo. Peri, however, used a modest ensemble of instruments, whereas Monteverdi had much grander ideas.\n\nAdvertisement\n\nTop image of Jacopo Peri is by Getty Images"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré III, Prince of Monaco is the longest-reigning sovereign of Monaco but the French Revolution had dire consequences for his family and caused the Principality of Monaco to be annexed to France from 1793 until the defeat of Napoleon I, Emperor of the French in 1814. Honoré Camille Léonor Grimaldi was born on November 10, 1720, in Paris, France. He was the third of the nine children and the second but the eldest surviving of the six sons of Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. Honoré’s maternal grandparents were Antonio I, Prince of Monaco and Marie of Lorraine. His paternal grandparents were the French nobles Jacques III Goyon de Matignon, Count of Thorigny, a Lieutenant General in the French army, (1644 – 1725) and Charlotte de Goyon de Matignon, Countess of Thorigny (1657 – 1721).\n\nHonoré III had eight siblings but only three survived to adulthood:\n\nAntoine-Charles, Marquis des Baux and Count de Matignon, (1717 – 1718), died in infancy\n\nCharlotte Thérèse Nathalie (1719 – 1790), a nun at the Convent of the Visitation in Paris, France\n\nCharles, Count de Carladés and Count de Matignon (1722 – 1749), unmarried, died from smallpox at the age of 27\n\nJacques (born and died 1723), died in infancy\n\nLouise Françoise, Mademoiselle des Baux (1724 – 1729), died in childhood\n\nFrançois-Charles, Count of Thorigny (1726 – 1743), died in his teens\n\nCharles-Maurice, Count de Valentinois (1727 – 1798), married Marie Christine Chrétienne de Rouvrois, no children\n\nMarie Françoise Thérése, Mademoiselle d’Estouteville (1728 – 1743), died in her teens\n\nIn 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III’s parents Louise-Hippolyte and Jacques; Credit – Wikipedia\n\nBecause of the poor relationship of his maternal grandparents, Honoré III’s parents Louise-Hippolyte and Jacques decided to live in France. They spent their time between Jacques’ mansion in Paris, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and Torigni-sur-Vire in Normandy, France where the de Goyon de Matignon family chateau, Château des Matignon, was located. Honoré was mostly raised at the French court under the supervision of Anne Louise Bénédicte de Bourbon, Duchess of Maine, the wife of Louis-Auguste de Bourbon, Duke of Maine, King Louis XIV’s legitimized son by his official mistress Françoise-Athénaïs de Rochechouart de Mortemart, Marquise of Montespan.\n\nOn February 20, 1731, Honoré III’s maternal grandfather Antonio I, Prince of Monaco died and his mother Louise-Hippolyte was now the Sovereign Princess of Monaco. Louise-Hippolyte had a very short reign of ten months. Several weeks before Christmas of 1731, a smallpox epidemic spread through the Mediterranean coastal areas. Louise-Hippolyte died from smallpox at the age of 34, on December 29, 1731.\n\nUpon Louise-Hippolyte’s death, her husband Jacques was now the legal guardian of their ten-year-old eldest son Honoré and had a plan. Jacques should rule as Prince of Monaco until Honoré reached his twenty-fifth birthday. At that time, Honoré would abdicate in favor of his father following the example of sons who gave up to their fathers land they had inherited through their mothers. Although the plan was initially accepted, it met with increasing opposition.\n\nFinally, in May 1732, Jacques handed over the rule of Monaco to his brother-in-law Antonio Grimaldi, Chevalier de Grimaldi, an illegitimate son of Antonio I, Prince of Monaco. Jacques’ official abdication date was November 7, 1733, but he had long since returned to Paris with his eldest son who was now technically Honoré III, Prince of Monaco. Antonio Grimaldi, Chevalier de Grimaldi became Governor-General of Monaco, was the de facto ruler of Monaco from 1732 until he died in 1784, and ably served as regent for more than fifty years for his nephew Honoré III. Honoré resided at his father’s Paris home the Hôtel de Matignon and spent much time at the French court at the Palace of Versailles. His father Jacques lived the remainder of his life in France, dying aged 61, on April 23, 1751, at his Paris home, the Hôtel de Matignon.\n\nAs Colonel of the Regiment of Monaco, part of the French army, Honoré III took part in the War of the Austrian Succession (1740 – 1748) and was wounded at the 1746 Battle of Rocoux and then at the 1747 Battle of Lawfeld. Honoré had close ties to the French kings Louis XV and Louis XVI. In 1756, Honoré decreed that Monaco would be ceded to the King of France if the Grimaldi dynasty was to die out.\n\nOver the years, Honoré III had declined many marriage proposals. In 1755, a marriage was proposed between 35-year-old Honoré and 18-year-old Maria Caterina Brignole, daughter of Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi. Maria Caterina’s parents came from two of the most powerful families in the Republic of Genoa. Her paternal grandfather Anton Giulio Brignole Sale, 5th Marquis of Groppoli had been Ambassador of the Republic of Genoa to France. Two of her paternal uncles were Doges of the Republic of Genoa. Maria Caterina’s maternal grandfather Francesco Maria Balbi also had been a Doge of the Republic of Genoa.\n\nHonoré III had previously been the lover of Maria Caterina’s mother but wished to marry to provide an heir to the throne of Monaco. However, Maria Caterina’s father opposed the marriage because of Honoré’s bad reputation and because of his fear that Honoré might inherit his fortune. In 1756, only after the intervention of King Louis XV of France and his mistress Madame de Pompadour did Maria Caternina’s father consent to the marriage.\n\nThe wedding of Honoré III and Maria Caterina was to occur on July 5, 1757, in Monaco, and it got off on a bad foot. Maria Caterina traveled to Monaco by boat accompanied by a contingent of Genovese nobility. When they arrived, Honoré did not come aboard the ship to welcome his bride. He said his status as a monarch demanded that Maria Caterina come to him. The Genovese contingent refused, saying that Maria Caterina was a member of a ruling family of the Republic of Genoa. The ship was stranded offshore for several days while a bridge was built between the port and Maria Caterina’s ship. Honoré and Maria Caterina walked towards each other at the same distance and met each other over the sea.\n\nHonoré III and Maria Caterina had two sons:\n\nHonoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré and the right to manage her own finances. Honoré finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré’s death, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nThe French Revolution had dire consequences for Honoré III and his family. The Grimaldi family lost all aristocratic privileges in France and was dispossessed of their French property. In January 1793, Honoré III was officially declared deposed and the Principality of Monaco was annexed by France. During the Reign of Terror, in September 1793, Honoré III was arrested and imprisoned in Paris. Honoré III’s son Honoré (IV) was also arrested as were Honoré (IV)’s wife Louise d’Aumont and his son Florestan. Honoré (IV) was released after fifteen months in prison and his wife and son were saved by their family doctor.\n\nThe last victims of the Reign of Terror on their way to the guillotine – Among them was Honoré III’s daughter-in-law Marie Thérèse de Choiseul\n\nThe wife of Honoré III’s other son Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. Joseph did become involved in a counter-revolution in Vendée. His wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nHonoré III was eventually released from prison. He died soon afterward in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. At 59 years, the reign of Honoré III remains the longest in the history of Monaco. Following the defeat of Napoleon I, Emperor of the French in 1814, Honoré III’s son Honoré IV, aged 56 and in ill health since his imprisonment during the Reign of Terror, returned to Monaco where he reigned as Sovereign Prince until his death in 1819.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nDe.wikipedia.org. 2022. Honoré III. (Monaco) – Wikipedia . [online] Available at: <https://de.wikipedia.org/wiki/Honor%C3%A9_III._(Monaco)> [Accessed 8 March 2022].\n\n. [online] Available at: <https://de.wikipedia.org/wiki/Honor%C3%A9_III._(Monaco)> [Accessed 8 March 2022]. Edwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré III, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco> [Accessed 8 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco> [Accessed 8 March 2022]. En.wikipedia.org. 2022. Maria Caterina Brignole – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Maria_Caterina_Brignole> [Accessed 8 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Maria_Caterina_Brignole> [Accessed 8 March 2022]. Flantzer, Susan, 2022. Jacques I, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/jacques-i-prince-of-monaco/> [Accessed 8 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/jacques-i-prince-of-monaco/> [Accessed 8 March 2022]. Fr.wikipedia.org. 2022. Honoré III (prince de Monaco) — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_III_(prince_de_Monaco)> [Accessed 8 March 2022]."}, {"url": "https://medium.com/@paolopetrocelli/the-origins-of-opera-houses-in-egypt-36a49eb01db5", "page_content": "The origins of opera houses in Egypt Paolo Petrocelli · Follow · Jun 6, 2020 6 min read -- Listen Share\n\nThéâtre Zizinia, La Scala of Alexandria\n\nThéâtre Zizinia\n\nThe majority of academics and music history books identify the origins of the opera theatre in Egypt with the construction of the Khedivial Opera House in Cairo in 1869, but they actually go back at least a century before that to the late 1700s, during the period of the French occupation of Egypt. It was Napoleon, in fact, who initially introduced modern European theatre to the country.\n\nBefore this, the only forms of entertainment that were similar to theatrical performances were puppet shows, pantomimes and jesters, which took place in public places.¹\n\nThese performances, which were improvised acts that used masks in the style of the Italian commedia dell’arte, dealt with satirical themes that were mainly related to the social conditions of the less well-off classes. It was with the construction of the first theatre halls by the French that the public began to sit, for the first time, alongside the Egyptian, Greek and Italian Francophone aristocracy.\n\nBefore the construction of the Cairo Opera House, the only descriptions of European theatre performances in Egypt are those that were described by the writer Rifa’a Rafi’ al-Tahtawi who, like many other Egyptians at the time, had studied in Paris in order to broaden his knowledge in a modern country such as France and had had the opportunity to frequent some of the most important French opera houses of the time.²\n\nTahtawi describes the theatre and the opera as the greatest entertainment he had ever witnessed, saying that “if there were not so many Satanic leanings in the French theatre, it would have to be considered an institution with highly beneficial virtues”.³\n\nIn 1834, the governor, Muhammad Ali Pasha, considered to be the founding father of modern Egypt, was so struck by Tahtawi’s account that he ordered him to start teaching the fundamentals of European theatre in schools.\n\nThe occupation of Egypt by Napoleon and, subsequently, the Western-inspired modernising policies pursued by Muhammad Ali Pasha both fostered a rapid spread of a “European culture of modern theatre” in Egypt: “it was the European theatre, performed in French or Italian, that was paramount and was given precedence by the authorities, not the nascent Arabic theatre”.⁴\n\nFrom the 1840s, the amount of performances of European theatre increased significantly, “audiences [being] particularly fond of lighter works: operettas, comedies, farces and vaudevilles”.⁵\n\nThe first documented performance of an Italian lyric opera in Egypt was Donizetti’s L’elisir d’amore, which was staged in Alexandria in 1841. Ricci’s Chiara di Rosenberg, Lucia di Lammermoor by Donizetti and I Puritani di Scozia by Bellini followed in 1842.\n\nItalian theatre had such a presence in the city that a set of regulations, written in Italian, was released by the Minister of Foreign Affairs and circulated by the local authorities.⁶\n\nPietro Avoscani, an architect from Livorno who took refuge in Alexandria after participating in Giuseppe Mazzini’s Giovine Italia (Young Italy) movement, made significant contributions to the promotion of Italian opera in Egypt. In fact, he oversaw, at his own expense, the production of three operas in 1841: Gemma di Vergy by Donizetti, Ernani by Verdi and Rossini’s Barbiere di Siviglia, which were put on at the palace at Gabari and were received enthusiastically by Muhammad Ali Pasha.⁷\n\nIn July 1856, Avoscani organised a big public celebration at the Palace at Gabari, where operas, dramas, ballets and gymnastics were staged over the course of three days.⁸\n\nA year later, together with other Italians, he asked for permission to build a theatre in the Italian style and organised a contest for its design, which was won by the Florentine architect Mariano Falcini.\n\nThis project was never realised, but in 1862 Etienne Zizinia, the powerful Greek consul general for Belgium, commissioned Avoscani to design a theatre to be built near the Rosetta Gate in Alexandria. Avoscani’s building was very similar to the Teatro alla Scala in Milan.\n\nIn contrast with the Scala’s Neoclassical style he used terracotta decorations, typical of Milanese buildings of the Risorgimento period, perhaps to celebrate the accomplishment of his patriotic ideals after Italian Unity was proclaimed in 1861. Although the city contained other theaters, it was his Zizinia Theater that marked the line of the road to the Rosetta Gate as a main urban axis of the European quarter, along which consulates and villas came to be built a few years later.⁹\n\nFor a long period the Zizinia Theatre, inaugurated in 1863, was one of the most prestigious places in Alexandria, which at the time was not only one of the country’s most well-connected cities with the international (particularly Italian) social and economic scenes, but also itself a growing and thriving cultural centre.¹⁰\n\nThéâtre Zizinia\n\nIt is worth noting that the impresario of the Zizinia Theatre until the end of the 1870s was Giuseppe V.W. Malfigianni, a composer of Maltese origins who was also the first impresario of the Royal Opera House in Valletta (Malta), which was inaugurated on October 9, 1866.¹¹\n\nWith a capacity of 2,000, the theatre was operative until 1908, when it was demolished to make room for the construction of a new theatre, the Mohamed Aly Theatre, which was inaugurated in 1921. After the Egyptian Revolution of 1952, the theatre was renamed as the Sayed Darwish Theatre, and is today more commonly known as the Alexandria Opera House.\n\nIn the meantime, Pietro Avoscani continued to have a significant impact on the development of the opera house in Egypt.\n\nAlexandria Opera House\n\nUnder the Khedivate of Egypt of Isma’il Pasha, who ruled between 1863 and 1879, the work begun by Muhammad Ali Pasha to modernise the country continued, with a reform programme inspired by those of major European nations.\n\nIt was during his rule that the French completed the ambitious project of creating the Suez Canal, the artificial channel that allows direct navigation from the Mediterranean to the Indian Ocean, via Egypt itself.\n\nThe Canal was inaugurated with a ceremony in Port Said on November 17, 1869, and was attended by Empress Eugenie of France. A celebratory march, the Egyptischer Marsch by Johann Strauss II, was commissioned specially for the occasion.\n\nKhedivial Opera House\n\nIt was in fact during the celebrations of the opening of the Suez Canal that the Khedive of Egypt, who was impassioned by melodrama (he had studied at the École d’état-major in Paris), decided to build an 850-seat theatre in Cairo within a few months: the Khedivial Opera House (the future Cairo Opera House)."}]}