{"Tim Finchem was inducted into the World Golf Hall of Fame in 2017.": [{"url": "https://www.espn.com/golf/story/_/id/29070837/tim-finchem-former-pga-tour-commissioner-elected-world-golf-hall-fame", "page_content": "Tim Finchem, who expanded the PGA Tour's footprint around the world and negotiated TV contracts that more than tripled prize money during his two decades as commissioner, has been elected to the World Golf Hall of Fame.\n\nFinchem was elected through the contributor category and will become the 10th administrator to be inducted, joining predecessor Deane Beman. Marion Hollins, one of the leading women in golf a century ago, also was elected as a contributor.\n\nFinchem was PGA Tour commissioner when the World Golf Hall of Fame opened in 1998 in St. Augustine, Florida.\n\n\"One of the great things about that is to get know the inductees who I didn't know in other aspects of my job,'' Finchem said Monday. \"It's a tremendous list of people. To be included in that group is very powerful. I want to thank those who thought I was deserving of it. In many ways, I didn't feel I am deserving because I just had so much fun being in the job for so long.''\n\nFinchem found it fitting that he joins the induction class of 2021 with Tiger Woods, whom he first saw at a college tournament his first year as commissioner in 1994. Later that year, Finchem noticed players finishing up their rounds at the World Series of Golf at Firestone and watching an 18-year-old Woods win the first of three straight U.S. Amateurs.\n\nWoods was elected through the male player category a month ago. Marion Hollins, one of the leading women in golf a century ago, was elected as a contributor.\n\n\"It is the greatest honor to be elected to join golf's most legendary players and contributors in the World Golf Hall of Fame,\" Finchem said. \"I am especially proud to stand alongside one of the world's all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.\"\n\nWoods joined the PGA Tour in 1996 after two years at Stanford and brought enormous attention to himself and to the tour. Along with winning twice in seven starts, Woods won the Masters in his first attempt as a pro by setting 20 records, including a 12-shot victory that set off the first wave of \"Tigermania.''\n\nFinchem seized on it.\n\nHe was in the middle of negotiating a new network television contract, and prize money spiked. More deals followed in 2001, 2006 and 2012. PGA Tour prize money went from under $100 million on three tours in 1994 when Finchem was appointed commissioner to more than $400 million over six tours when he retired at the end of 2016.\n\nFormer PGA Tour commissioner Tim Finchem, left, has been elected to the World Golf Hall of Fame. He'll be part of a 2021 class that will also include Tiger Woods. AP Photo/Phil Long\n\nFinchem laughed Monday when asked what his job would have been like had Woods played tennis.\n\n\"It would have been a much more difficult job,'' he said. \"Tiger coming on the scene ... took our sport to another level. It continues on today. As a sport, we were blessed he didn't like tennis.''\n\nIt wasn't just money, however.\n\nFinchem created The First Tee program shortly after Woods won the Masters. Turning back Greg Norman's proposal for a world tour, Finchem came up with the World Golf Championships series in 1999 that led to three events for players from the leading six tours around the world. He also took advantage of a growing class of international players from outside Europe -- Norman, Nick Price, Ernie Els, Vijay Singh among those -- by starting the Presidents Cup in 1994.\n\nAt the heart of Finchem's work was making the PGA Tour logo recognizable around the world, a symbol of strength.\n\nThe PGA Tour had a development circuit (now called the Korn Ferry Tour) and a senior tour (now the PGA Tour Champions) for players 50 and older. Now it has circuits in Canada (Mackenzie Tour), Latin America and China.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" said Jay Monahan, whom Finchem groomed as his successor.\n\nMonahan delivered the news to Finchem during The Players Championship, two days before golf joined so many other sports in shutting down because of the coronavirus pandemic.\n\nSome of Finchem's best work came during tough times. He kept the PGA Tour fully sponsored during the recession in 2008 and, as a show of strength, kept prize money from shrinking.\n\nThe Hall of Fame is expected to announce a fourth inductee later this week."}, {"url": "https://www.sportsbroadcastinghalloffame.org/inductees/tim-finchem/", "page_content": "When Tim Finchem retired in 2017 after 22 years as PGA TOUR commissioner, he had transformed the game and its relationship with fans on the course, watching on TV, watching on portable devices, and, yes, the computer at the office for the diehards who want to watch golf play from sunrise to sunset.\n\nHe introduced the FedEx Cup Playoffs, offering the sport a greater sense of an actual season. The Presidents Cup gave the sport another great international competition. And the World Golf Championships created greater opportunities for international golfers to compete together beyond the majors. And the 1997 rights deal he negotiated changed the relationship between TV and golf forever as it required every round of every tournament be carried on TV.\n\n“The most impressive thing about Tim is he was a remarkable consensus builder,” says Sean McManus, CBS Sports, chairman. “His relationships with the players, with the tournaments, with the sponsors, and TV networks were all first rate where everyone felt like they were getting full value.”\n\nHe also spearheaded efforts to coordinate the bid for golf’s return to the Olympics, which became a reality in the 2016 Games after a 112-year absence and gave NBC a chance to bring one of its most important rest-of-the-year properties to its Olympic programming schedule.\n\n“Tim Finchem super-charged the PGA TOUR during his tenure as commissioner by adding World Golf Championships, the Presidents Cup, and the FedEx Playoffs,” says Molly Solomon, executive producer/president, NBC Olympics Production, and executive producer, Golf Channel. “What the PGA TOUR looks like today is due in large part to his big ideas and creative leadership.”\n\nAdds Tommy Roy, NBC Sports, lead golf producer, credits Finchem with allowing NBC to have more than a dozen cameras on the island green for THE PLAYERS Championship, allowing the network to capture shots from almost any angle.\n\n“He gave us the ability to put a camera six feet away from Tiger Woods when he was about to execute a magical, game winning shot,” he adds. “And he also gave us the ability to put microphones three feet away from Phil Mickelson and [caddie] Bones when they were discussing the execution of a great shot.”\n\nSports Broadcasting Hall of Famer Dick Ebersol says he was lucky enough to have a front row seat to Finchem’s efforts.\n\n“Tim built the PGA Tour into one of the most important franchises in all of American TV sports,” he adds.\n\nAs if that weren’t enough, he helped oversee First Tee’s growth into a great youth-development organization, reaching more than 15 million youngsters (during his tenure as commissioner, the PGA TOUR and its tournaments raised more than $2 billion in charitable contributions).\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” said Jay Monahan, PGA TOUR commissioner and World Golf Foundation board chairman, when Finchem was inducted into the World Golf Hall of Fame last year. “His enshrinement in the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but, more important, so will the countless lives — whether those are the players on the PGA TOUR and beyond, millions of First Tee participants, or charitable organizations around the world — impacted by his life’s work.”\n\nFinchem became commissioner in 1994 when then-Commissioner Deane Beman, just 55 years old, retired to resume his playing career, this time as a member of the then-Senior PGA TOUR.\n\n“My history is one of just being in the right place at the right time,” says Finchem. “So much of where you’re headed is based on the individuals that you’re interfacing with.”\n\nFor example, prior to joining the PGA TOUR, Finchem was in the Jimmy Carter Administration, working with the president and his staff.\n\n“I’ve had a great run with regard to being around people who are extremely successful and thoughtful and committed to making this place a better place to live,” he says. “I look back at all those people I met and the players that I interfaced with, and I was very, very fortunate to be in the right place at the right time.” One example: he became commissioner only a few weeks before a player named Tiger Woods turned professional.\n\nAnd the beginning of the Woods era and the beginning of Finchem’s tenure as commissioner coincided with a time when some of the greats of the game had retired but were still an active part of the PGA efforts.\n\n“I was lucky,” Finchem says, “because I came into the PGA TOUR at a time when I had the opportunity to meet Sam Snead and Byron Nelson and all these great players and spend a fair amount of time with them. In some ways, many of those players were similar to working with the president because of their knowledge of the sport, their intensity about transferring that information to fans and to people like myself.”\n\nFinchem always had a passion for golf and freely admits to using his paper-route money to support his golf habit.\n\n“My dad was in the Marine Corps for 30 years, and I started playing golf when I was 8 or 10,” he says. “He took me to the Azalea Open in North Carolina; Arnold Palmer won, and I was mesmerized by him. Years later, I’d call him up from time to time and say, Take me through one of your wins. He’d say, Which one? and I’d tell him that one.”\n\nAlthough nearly half his adult life has been spent at the PGA TOUR, Finchem didn’t set out to work in sports administration. He attended the University of Richmond on a debate scholarship and graduated in 1969, then received his law degree from Virginia four years later. After practicing law in Virginia Beach for three years, Finchem served in the Carter White House as deputy advisor to the president in the Office of Economic Affairs in 1978 and 1979.\n\n“Tim’s leadership was invaluable for the growth of the game,” says Sports Broadcasting Hall of Famer and CBS Sports Lead Play-by-Play Announcer Jim Nantz. “His thoughtful decision-making helped the PGA TOUR soar to incredible heights. He led his global partners in promoting and implementing a World Golf Championship series, and, here at home, he brought life to the PGA TOUR’s end of the season. Lastly, Tim saw the value of nurturing and respecting his television relationships. He has been viewed by all as a great partner.”"}, {"url": "https://www.globalgolfpost.com/featured/tim-finchem-entering-the-world-golf-hall-of-fame/", "page_content": "Without striking a shot in competition, Tim Finchem changed professional golf. In the simplest terms, he took a good thing – the PGA Tour – and made it better. Much better.\n\nBigger. Richer. More generous.\n\nIt’s why Finchem will be inducted into the World Golf Hall of Fame when its next class goes in (the date is still to be determined), joining Tiger Woods and Marion Hollins as the newest inductees with more honorees to be announced soon.\n\nREAD MORE ON MARION HOLLINS AT GGP+\n\nFinchem goes in not for how he played the game – he’s still a good amateur player at age 73 – but for how he led the tour through boom times and challenging times. He minimized the lows and maximized the highs.\n\nWhile halls of fame are built on competitive achievement, there is room for the influencers as well. The National Baseball Hall of Fame is filled with former commissioners, managers and even a few umpires. The Pro Football Hall of Fame includes former commissioners and team owners.\n\nFinchem’s list of achievements is impossible..."}, {"url": "https://www.golfchannel.com/news/former-commissioner-tim-finchem-added-hall-fame-class-2021", "page_content": "Former PGA Tour commissioner Tim Finchem has been added to the World Golf Hall of Fame Class of 2021, joining Tiger Woods and Marion Hollins next year for enshrinement.\n\nFinchem served as commissioner from 1994-2016, leading the circuit through an unprecedented period of growth. When Finchem took the helm from Deane Beman, the prize money for the PGA Tour, the then Senior PGA Tour and the then Hogan Tour added up to less than $100 million. By the time he handed off the role to current commissioner Jay Monahan, the prize fund for those three circuits and the three added under his watch (PGA Tour Latinoamerica, Mackenzie Tour and PGA Tour Series China) was over $400 million.\n\nFinchem and Hollins will both be inducted under the contributor category.\n\nNews & Opinion 'Team' player Finchem deserves this individual honor Former PGA Tour commissioner Tim Finchem always deflected the spotlight, but it deserves to shine on him as a Hall of Fame member.\n\n\"It is the greatest honor to be elected to join golf's most legendary players and contributors in the World Golf Hall of Fame,\" Finchem said in a release. \"This is a truly humbling moment, for which I am most grateful, and I look forward to celebrating with my family and friends throughout the game of golf and the many people who made this possible for me.\"\n\nFinchem's stint as commissioner featured plenty of highlights, including the creation of the World Golf Championships, Presidents Cup and the FedExCup. Finchem helped devise the Tour's current wraparound schedule, which began in 2013, and spearheaded efforts to get golf back into the Olympics in 2016 before retiring.\n\nHe also helped to found the First Tee in 1997, which has benefited more than 15 million junior golfers in the years since.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" Monahan said. \"His enshrinement into the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but more importantly, so will the countless lives ... impacted by his life's work.\"\n\nFinchem, Woods and Hollins will be joined by a fourth and final member in the Class of 2021, whose name will be announced \"in the coming days.\" The 20-person selection committee includes Hall of Fame players, media representatives and leaders of major golf organizations.\n\nOther finalists for the Class of 2021 include Johnny Farrell, Padraig Harrington, Tom Weiskopf, Susan Maxwell Berning, Beverly Hanson, Sandra Palmer and Dottie Pepper."}, {"url": "https://www.jacksonville.com/story/sports/golf/2022/03/07/world-golf-hall-fame-induction-tim-finchem-expanded-tours-global-reach/6896119001/", "page_content": "There are always going to be critics when something new is tried.\n\nFormer PGA Tour commissioner Tim Finchem heard it almost every time he and his staff came up with an enhancement to the Tour's competitive structure.\n\nWorld Golf Championships? Who needs them, the detractors said, when you've got four majors and The Players?\n\nGolf in the Olympics? Ditto.\n\nThe FedEx Cup? What was wrong with the money list to determine the best players?\n\nThe First Tee? Don't we have PGA professionals to teach and grow the game?\n\nFinchem said there's only one thing to do in those situations.\n\n\"If you're in a leadership position, you do the research, involve the best and brightest from your staff and you set the goals,\" said the 74-year-old Finchem, who retired from the PGA Tour at the end of the 2016 season, following 22 years as the commissioner. \"If you've done your homework, proceeded correctly and made the right calls, they will have an impact.\"\n\nHOF MC:David Feherty will preside over World Golf Hall of Fame ceremony as Tiger Woods to be inducted\n\nGallery:World Golf Hall of Fame opens exhibit honoring Tiger Woods, Tim Finchem, Susie Maxwell Berning, Marion Hollins\n\n'He's the reason we're out here:' Tiger Woods' career takes center stage for World Golf Hall of Fame ceremony\n\nAnd Finchem, the son of a career Marine officer who built a legal and political career before getting involved in golf, will be inducted into the World Golf Hall of Fame on Wednesday at the PGA Tour's Global Home because of the impact he made on multiple fronts.\n\nFinchem will join Tiger Woods, Susie Maxwell Berning and the late Marion Hollins in the induction ceremony, which will be held at 7 p.m. and aired by Golf Channel. He also joins his predecessor, Deane Beman, in going from Tour commissioner to the Hall of Fame.\n\nA player on the Tour's policy board famously told Finchem that Beman had left him with a high-powered luxury car when he retired in 1994.\n\n\"All you need to do is keep it filled with high-test,\" the player said.\n\nFinchem did more than that. Under his direction, the Tour's total purses jumped from less than $60 million per year in 1994 to more than $250 million by 2006. The World Golf Championships and the FedEx Cup playoffs ensured the best players in the world would be on the same golf course the same week more often. And he took further steps to enhance The Players Championship, renovating the course in 2006, building the new clubhouse and bumping the purse to keep it the most lucrative in golf.\n\nThere are even critics of the success the Tour had under Finchem. Tiger Woods, they say, should get the bulk of the credit after he burst on the scene and went on to win 15 majors, two Players and 82 Tour titles, transforming the game of golf into a more athletic pursuit open to anyone of any race or background who could shoot the scores.\n\nFinchem will never deny that Woods being the game's top player for 20 of his 22 years as the commissioner was a huge factor, especially on the three new TV deals that were negotiated on Finchem's watch.\n\nBut Finchem had the foresight and business acumen to take advantage of Woods' dominance, such as involving Woods and his father Earl heavily in the launching of The First Tee, the World Golf Foundation's initiative to make golf more accessible and affordable to youth in at-risk areas and situations.\n\nThe First Tee is celebrating its 25th year with 150 worldwide chapters, 10,000 schools in its program to make golf part of a P.E. curriculum and more than 3 million kids reached per year through golf and its Life Skills and educational programs.\n\n\"There's no question about his impact,\" Finchem said of Woods. \"And there's no question that going forward, Tiger will have even more of an impact if he wants to be involved and show leadership more than he already has. His presence in anything related to golf is incredibly strong.\"\n\nFinchem was asked jokingly two years ago what the sport would have looked like had Woods played tennis.\n\n“It would have been a much more difficult job,” he admitted.\n\nFinchem expanded the international reach of the Tour through the WGC events, the Presidents Cup, developmental tours in China, South American and Canada, taking Tour events to Mexico, Japan, Korea and China, and finally throwing the weight of the Tour and the World Golf Foundation behind the drive to return golf to the Olympics.\n\nFinchem said the secret to success is never admitting that you’ve been as successful as you’re going to get.\n\n\"You always ask yourself, 'is there a better way for this to work?'\" Finchem said. \"Asking that question has resulted in hard work at organizing and working together with various organizations in golf and our international activity in golf. The more we focused on that, the more we learned, and the more we learned the more effective we were.\"\n\nFinchem, who graduated from the University of Richmond in 1969 (he had a debate scholarship) and got his law degree from Virginia, had a practice in Virginia Beach and got involved in local politics, moving quickly to the national scene when he worked President Jimmy Carter's campaign in 1976, then served on President Carter's Office of Economic Affairs.\n\nFinchem was later the national campaign chairman for Walter Mondale when he ran against Ronald Reagan in 1980.\n\nHe started at the PGA Tour as the vice-president of business affairs and quickly climbed the ladder to be Beman's successor, serving as chief operating officer of the Tour and then deputy commissioner.\n\n\"He was the right guy at the right time,\" Beman said. \"He was always there to back up and do the things that needed to be done. He was a good administrator and understood the legal issues ... very adept at analyzing everything from every side.\"\n\nMonahan said Tiger Woods provided the punch. Finchem maximized it.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" Monahan said when it was announced in March of 2020 that Finchem would enter the Hall of Fame."}, {"url": "https://www.pgatour.com/news/2022/03/06/tiger-woods-tim-finchem-enter-world-golf-hall-of-fame-together-after-parallel-careers.html", "page_content": "Toss it all around, digest all of it, and Brad Faxon concedes it is fascinating how each man contributed so much during such a joint time frame. Faxon, who was in his 12th year on TOUR when Finchem succeeded Beman, served several stints on the PAC under Finchem’s watch and heard a lot of people say that “it was good luck” that Woods came along when he did.\n\n\n\n“Luck equals opportunity plus preparedness and Tim was always prepared,” said Faxon. “Bottom line is, it’s fitting they enter the Hall of Fame in the same class.”\n\n\n\nWhat strikes Browne are the contributions each inductee made to the incredible growth of the pro game.\n\n\n\n“Tiger attracted the eyes and ears of the sports world to what was always a pooh-poohed sport,” he said. “He legitimized golf as an athletic endeavor. And Tim, to his credit, understood the value that golf brought and that there was a confluence to Tiger – a social aspect, he was telegenic to the ‘Nth’ power, he was made for the moment.”\n\n\n\nFinchem is on record as calling Woods “the most recognizable athlete on the planet” and that “he changed the landscape and effected TV (viewership and contracts), sponsorships and took golf to a whole new level.”\n\n\n\nBrowne wouldn’t dispute any of that. He also agrees that it shouldn’t go unnoticed that for all the might each of them wielded, rarely were they not on the same page.\n\n\n\n“I just don’t think that either one of them tried to pull anything over on the other,” said Browne. “I think Tiger knew that his relevance in history was through the PGA TOUR, that he understands that the value of his legacy is built around the records he attains.\n\n\n\n“Tim’s relevance was to try and grow the game and he knew how to do it. If something needed to be done, he picked up the phone and would get a response.”\n\n\n\nTaken as individuals, the game was lucky to have them. Taken in tandem, the game saw growth no one could have envisioned. Browne suggests avoiding the chicken-or-egg discussion when it comes to these two men.\n\n\n\n“When it comes to assignation, who gets the credit, or who did what, I don’t think either one cares,” he said. “Tiger Woods wanted to be the greatest player. Tim wanted to grow the game. Both did that … and they left the game better than it was when they came into it. That’s the definition of greatness. That’s why they deserve everything they get. It’s why they’re going into the Hall of Fame.”\n\n\n\nTogether. As it should be."}, {"url": "https://golfweek.usatoday.com/2020/04/20/questioning-tim-finchem-place-in-golf-hall-of-fame/", "page_content": "For everything that has been denied golf fans in this period of quarantine —access to courses for many, the Masters for all, freedom from Peloton updates for an unlucky few — one thing remains soothingly constant among the social media commentariat: begrudgery.\n\nThat much was evident with the news that former PGA Tour commissioner Tim Finchem will join Tiger Woods and Marion Hollins in the next class to be inducted into the World Golf Hall of Fame. The announcement was greeted with griping that was as predictable as it is tedious, an exercise in collective eye-rolling intended to suggest not only that Finchem is undeserving but that his inclusion dilutes the Hall’s credibility.\n\nThat argument is familiar and has been leveled against more deserving targets who got a call to the Hall, like George H.W. Bush, Bing Crosby or Bob Hope. But there’s no sound basis for raising it against Finchem.\n\nThere is a sentiment that says lockers in St. Augustine ought to be earned for exploits on the field of play, and the only field of play that matters is a golf course. Not a boardroom or a factory or a production trailer or a media center. It’s an absolutist position that would disqualify plenty of current Hall of Famers.\n\nLike C.B. Macdonald or Pete Dye, who only designed those fields of play,\n\nLike Karsten Solheim, who innovated the instruments used on those fields.\n\nLike Dan Jenkins or Herb Graffis, whose only mastery was of a typewriter on the sidelines.\n\nThe reality is that most sports halls of fame are intended to acknowledge not just quantifiable achievement but immeasurable impact. Charlie Sifford wasn’t inducted for his two PGA Tour victories but for what his presence, courage and determination symbolized in golf’s ugliest era. Frank Chirkinian wasn’t given a locker to store his Emmy awards, but because the legendary CBS producer’s influence far exceeded that of most players he put on living room TVs.\n\nIt’s why the football and tennis Halls have “contributor” categories to enshrine non-players, and it’s why the golf Hall is welcoming Finchem, just as it did his predecessor Deane Beman, Augusta National’s Billy Payne and the European Tour’s Ken Schofield before him.\n\nThis is hardly to say Finchem is beyond criticism. He forged a colorless culture at Tour HQ and enforced a level of secrecy around disciplinary proceedings and drug testing that would have been envied in Pyongyang. But it can’t be argued that he didn’t leave the Tour in a considerably better place than he found it.\n\nWhen he took over as commissioner in 1994, total prize money on Tour was $56.4 million. Toss in the Champions and then-Web.com Tours and the fund was just over $90 million. This season the Tour’s prize money is nearing $400 million before bonuses, at least until COVID-19 upended things. He created the oft-maligned World Golf Championship events, which if nothing else helped temper Greg Norman’s plans for world domination, and the FedEx Cup playoff system 13 years ago.\n\nIt’s a popular though specious suggestion that Finchem owes his success to coat-tailing on Tiger Woods. Sure, he was dealt a strong hand, but he played it well for what was demanded of him. If subsisting on crumbs from Tiger’s table was sufficient to earn a spot in the Hall, then Mark Steinberg would have his own wing.\n\nArguing over Hall of Fame inductees is a staple of most every sport, moreso during a quarantine when we’re happy for any meat to chew on, no matter how lacking in nutrition it is. And golf’s Hall has richly deserved much of the criticism it has received over the years. The last class inducted Peggy Kirk Bell. The famed teacher was eminently worthy, but she was deserving of the honor when she was alive. She lived for 95 years, but the Hall only saw fit to induct her three years after her death. That kind of standard can’t be encouraging to others who deserve a spot and have been thus far denied, like Tom Weiskopf or Butch Harmon.\n\nThere are obvious shortcomings surrounding golf’s Hall of Fame. There are those who deserve the honor who have been overlooked and those who’ve been given a spot they didn’t merit. But whatever his failings, Tim Finchem doesn’t belong on either list."}, {"url": "https://golfbusinessnews.com/news/people/tim-finchem-to-be-inducted-in-world-golf-hall-of-fame/", "page_content": "The World Golf Hall of Fame will enshrine former PGA TOUR Commissioner Tim Finchem as part of its Class of 2021, joining Tiger Woods and Marion Hollins. He received news of his Induction through the Contributor category from Commissioner Jay Monahan.\n\n“It is the greatest honor to be elected to join golf’s most legendary players and contributors in the World Golf Hall of Fame,” said Finchem. “This is a truly humbling moment, for which I am most grateful, and I look forward to celebrating with my family and friends throughout the game of golf and the many people who made this possible for me. I am especially proud to stand alongside one of the world’s all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.”\n\nUnder Finchem’s 22-year tenure as the PGA TOUR Commissioner from 1994 through 2016, prize money skyrocketed, moving from under $100 million on three tours in 1994 to more than $400 million on six tours when he retired in 2017. He created signature events in today’s game, including the FedExCup and the FedExCup Playoffs, the Presidents Cup and the World Golf Championships.\n\nFinchem’s impact expanded far beyond the PGA TOUR as he left his mark on the global game. He spearheaded efforts to coordinate the bid for golf’s return to the Olympics, which became a reality in the 2016 Games after a 112-year absence.\n\nFinchem worked to ensure giving back was part of the fabric of the PGA TOUR’s business model and was instrumental in founding the First Tee in 1997. Since inception, Finchem has helped First Tee grow and develop into the positive youth development organization it is today, having reached more than 15 million young people on golf courses, in schools and after-school locations. During his tenure as Commissioner, the PGA TOUR and its tournaments raised more than $2 billion in charitable contributions.\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” said Jay Monahan, PGA TOUR Commissioner and World Golf Foundation Board Chairman. “His enshrinement into the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but more importantly, so will the countless lives – whether those are the players on the PGA TOUR and beyond, millions of First Tee participants, or charitable organizations around the world – impacted by his life’s work.”"}, {"url": "https://golfweek.usatoday.com/2020/04/20/tim-finchem-pga-tour-commissioner-inducted-world-golf-hall-of-fame/", "page_content": "Tim Finchem is going into the Hall.\n\nThe World Golf Hall of Fame announced Monday that the former PGA Tour commissioner will join Tiger Woods and Marion Hollins for enshrinement as part of the Class of 2021. Finchem, who served two years in the White House during the Jimmy Carter Administration as the deputy advisor to the president in the office of business affairs, became the PGA Tour’s third commissioner on June 1, 1994. He succeeded Deane Beman.\n\n“It is the greatest honor to be elected to join golf’s most legendary players and contributors in the World Golf Hall of Fame,” Finchem said in a release. “This is a truly humbling moment, for which I am most grateful, and I look forward to celebrating with my family and friends throughout the game of golf and the many people who made this possible for me. I am especially proud to stand alongside one of the world’s all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.”\n\nRELATED: Marion Hollins earns Hall of Fame nod\n\nMORE: Tiger Woods to join Class of 2021 in World Golf Hall of Fame\n\nDuring Finchem’s 22-year reign, prize money went from $100 million on three tours in 1994 to more than $400 million on six tours when he retired in 2017. Under his governance, the FedExCup and the playoffs, the Presidents Cup and World Golf Championships were created. The PGA Tour and its tournaments raised more than $2 billion in charity contributions. Finchem also was instrumental in the formation of the First Tee and led efforts for golf’s return to the Olympics in 2016 in the Rio Summer Games after an absence of 112 years.\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” PGA Tour commissioner Jay Monahan said in a statement. Monahan succeeded Finchem on Jan. 1, 2017. “His enshrinement into the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but more importantly, so will the countless lives – whether those are the players on the PGA Tour and beyond, millions of First Tee participants, or charitable organizations around the world – impacted by his life’s work.”\n\nThe Class of 2021 was elected by the Hall of Fame’s Selection Committee, a 20-member panel co-chaired by Hall of Fame members Beth Daniel, Nick Price, Annika Sorenstam and Curtis Strange. The committee also includes media representatives and leaders of the major golf organizations."}, {"url": "https://secure.golfchannel.com/news/tim-finchem-time-take-fresh-look-hall-fame", "page_content": "PONTE VEDRA BEACH, Fla. – Is the World Golf Hall of Fame induction ceremony up for a significant overhaul?\n\nPGA Tour commissioner Tim Finchem said the World Golf Foundation is open to reviewing everything from the date of the event to the age eligibility for induction to the voting process.\n\n“I think it's timely to take a look at everything we're doing and take a fresh look,” Finchem said in his annual news conference at The Players Championship. “We haven't done that in several years. So we're going to look at everything and have more to say about it probably later this year.”\n\nMonday’s induction ceremony lacked a strong presence of past inductees. Only eight Hall of Fame members were introduced on the stage at the start of the induction, and they were all LPGA members. Also, few current PGA Tour players attended Monday’s ceremony even though it was a short drive from the TPC Sawgrass facility to the World Golf Village.\n\nThe Players: Articles, videos, photos | GC coverage | Social Lounge\n\n“It does raise a question in my mind about whether this is the best time of year to do it,” Finchem said. “It was a phenomenal ceremony. It's a very compelling night. But if you do it this week or the week of any big tournament, the golf interest is kind of split, so there are three or four things about that, that we're looking at, and that's one of them.”\n\nTo be eligible for induction, players must only be 40 years old. It has created awkward inductions with Phil Mickelson and Ernie Els going into the Hall of Fame when they’re still very competitive. Els won the British Open after being inducted. Also, there are growing questions about the voting process. Fred Couples and Colin Montgomerie were elected this year despite garnering only 51 percent of the vote when 65 percent is required. The Hall of Fame, however, has a special provision that if nobody gains the minimum vote for election, the highest vote-getter can be inducted, provided he pulls at least 50 percent of vote.\n\nIn another voting issue, Finchem was asked why there is separate PGA Tour voting and International voting when it’s a “World Golf Hall of Fame.”\n\n“Those are things seriously under discussion,” Finchem said."}]}