{"Tim Finchem was promoted to Deputy Commissioner in 1988.": [{"url": "https://www.espn.com/golf/story/_/id/29070837/tim-finchem-former-pga-tour-commissioner-elected-world-golf-hall-fame", "page_content": "Tim Finchem, who expanded the PGA Tour's footprint around the world and negotiated TV contracts that more than tripled prize money during his two decades as commissioner, has been elected to the World Golf Hall of Fame.\n\nFinchem was elected through the contributor category and will become the 10th administrator to be inducted, joining predecessor Deane Beman. Marion Hollins, one of the leading women in golf a century ago, also was elected as a contributor.\n\nFinchem was PGA Tour commissioner when the World Golf Hall of Fame opened in 1998 in St. Augustine, Florida.\n\n\"One of the great things about that is to get know the inductees who I didn't know in other aspects of my job,'' Finchem said Monday. \"It's a tremendous list of people. To be included in that group is very powerful. I want to thank those who thought I was deserving of it. In many ways, I didn't feel I am deserving because I just had so much fun being in the job for so long.''\n\nFinchem found it fitting that he joins the induction class of 2021 with Tiger Woods, whom he first saw at a college tournament his first year as commissioner in 1994. Later that year, Finchem noticed players finishing up their rounds at the World Series of Golf at Firestone and watching an 18-year-old Woods win the first of three straight U.S. Amateurs.\n\nWoods was elected through the male player category a month ago. Marion Hollins, one of the leading women in golf a century ago, was elected as a contributor.\n\n\"It is the greatest honor to be elected to join golf's most legendary players and contributors in the World Golf Hall of Fame,\" Finchem said. \"I am especially proud to stand alongside one of the world's all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.\"\n\nWoods joined the PGA Tour in 1996 after two years at Stanford and brought enormous attention to himself and to the tour. Along with winning twice in seven starts, Woods won the Masters in his first attempt as a pro by setting 20 records, including a 12-shot victory that set off the first wave of \"Tigermania.''\n\nFinchem seized on it.\n\nHe was in the middle of negotiating a new network television contract, and prize money spiked. More deals followed in 2001, 2006 and 2012. PGA Tour prize money went from under $100 million on three tours in 1994 when Finchem was appointed commissioner to more than $400 million over six tours when he retired at the end of 2016.\n\nFormer PGA Tour commissioner Tim Finchem, left, has been elected to the World Golf Hall of Fame. He'll be part of a 2021 class that will also include Tiger Woods. AP Photo/Phil Long\n\nFinchem laughed Monday when asked what his job would have been like had Woods played tennis.\n\n\"It would have been a much more difficult job,'' he said. \"Tiger coming on the scene ... took our sport to another level. It continues on today. As a sport, we were blessed he didn't like tennis.''\n\nIt wasn't just money, however.\n\nFinchem created The First Tee program shortly after Woods won the Masters. Turning back Greg Norman's proposal for a world tour, Finchem came up with the World Golf Championships series in 1999 that led to three events for players from the leading six tours around the world. He also took advantage of a growing class of international players from outside Europe -- Norman, Nick Price, Ernie Els, Vijay Singh among those -- by starting the Presidents Cup in 1994.\n\nAt the heart of Finchem's work was making the PGA Tour logo recognizable around the world, a symbol of strength.\n\nThe PGA Tour had a development circuit (now called the Korn Ferry Tour) and a senior tour (now the PGA Tour Champions) for players 50 and older. Now it has circuits in Canada (Mackenzie Tour), Latin America and China.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" said Jay Monahan, whom Finchem groomed as his successor.\n\nMonahan delivered the news to Finchem during The Players Championship, two days before golf joined so many other sports in shutting down because of the coronavirus pandemic.\n\nSome of Finchem's best work came during tough times. He kept the PGA Tour fully sponsored during the recession in 2008 and, as a show of strength, kept prize money from shrinking.\n\nThe Hall of Fame is expected to announce a fourth inductee later this week."}, {"url": "https://www.howold.co/person/tim-finchem/biography", "page_content": "Tim Finchem Biography\n\nAmerican lawyer\n\nTimothy W. Finchem (born April 19, 1947) is an American lawyer and retired golf administrator, who served as commissioner of golf's PGA Tour from 1994 to 2016. He served in the White House for two years during the administration of President Jimmy Carter, from 1978 to 1979. He was inducted into the World Golf Hall of Fame in 2021.\n\nEarly life and education\n\nFinchem was born in Ottawa, Illinois. He graduated from Princess Anne High School in Virginia Beach, Virginia. He attended the University of Richmond on a debate scholarship, receiving his Bachelor of Arts degree in 1969. While at Richmond, Finchem was a member of the Phi Gamma Delta Rho Chi chapter. Finchem later graduated from the University of Virginia School of Law in 1973.\n\nEarly career\n\nAfter practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, D.C.\n\nPGA Tour Commissioner\n\nFinchem took the position of Commissioner on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour.\n\nAs Commissioner, Finchem expanded the earnings opportunities for PGA Tour players both domestically and internationally. He presided over three television broadcasting deals (1997, 2001 and 2005).\n\nIn 2006, the total PGA Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem's supporters also give him some of the credit.\n\nFinchem received the 2001 Old Tom Morris Award from the Golf Course Superintendents *ociation of America, GCSAA's highest honor. He is a single-figure handicap golfer.\n\nFinchem was succeeded by Jay Monahan on January 1, 2017.\n\nReferences\n\nExternal links"}, {"url": "https://wiki2.org/en/Tim_Finchem", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican lawyer\n\nTimothy W. Finchem (born April 19, 1947) is an American lawyer and retired golf administrator, who served as commissioner of golf's PGA Tour from 1994 to 2016. He served in the White House for two years during the administration of President Jimmy Carter, from 1978 to 1979. He was inducted into the World Golf Hall of Fame in 2021.[1][2]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 9 089 4 855 357\n\nIce Bucket Challenge: Tim Finchem, PGA TOUR commissioner\n\nTim Finchem: World Golf Hall of Fame Acceptance Speech (2022 Induction)\n\nTim Finchem’s Drug Problem | GOLF.com Transcription\n\nEarly life and education\n\nFinchem was born in Ottawa, Illinois. He graduated from Princess Anne High School in Virginia Beach, Virginia. He attended the University of Richmond on a debate scholarship, receiving his Bachelor of Arts degree in 1969. While at Richmond, Finchem was a member of the Phi Gamma Delta Rho Chi chapter. Finchem later graduated from the University of Virginia School of Law in 1973.[citation needed]\n\nEarly career\n\nAfter practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, D.C.[3]\n\nPGA Tour Commissioner\n\nFinchem took the position of Commissioner on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour.\n\nAs Commissioner, Finchem expanded the earnings opportunities for PGA Tour players both domestically and internationally. He presided over three television broadcasting deals (1997, 2001 and 2005).[citation needed]\n\nIn 2006, the total PGA Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem's supporters also give him some of the credit.[4]\n\nFinchem received the 2001 Old Tom Morris Award from the Golf Course Superintendents Association of America, GCSAA's highest honor. He is a single-figure handicap golfer.[citation needed]\n\nFinchem was succeeded by Jay Monahan on January 1, 2017.\n\nReferences\n\nPreceded by Deane Beman Commissioner of the PGA Tour\n\n1994–2016 Succeeded by Jay Monahan"}, {"url": "https://apnews.com/article/127102e2d1eb43b9ab2e972c581051cf", "page_content": "ORLANDO, Fla. (AP) — Jay Monahan was promoted to deputy commissioner of the PGA Tour on Tuesday, the first indication of a possible successor to Tim Finchem.\n\nFinchem was the last person to hold that position until he was appointed PGA Tour commissioner in 1994.\n\n“This step is being taken to further strengthen our organizational structure, enhance our management coordination and ultimately to continue to deliver on three key pieces of our core business — driving benefits to our players, growing the charity support in the communities where we play and doing our part in golf to help grow and protect this great game,” Finchem said in a statement. “Jay’s new role in this key leadership position will help continue our momentum.”\n\nFinchem, who completes 20 years as commissioner on June 1, signed a four-year extension through 2016. That would make him the longest-serving commissioner since the tour broke away from the PGA of America in 1969. He will be 69.\n\nMonahan played college golf at Trinity, and he earned a master’s degree in sports management from the University of Massachusetts at Amherst. He previously worked for EMC in sponsorship and branding, at IMG as head of the Deutsche Bank Championship and as an executive vice president at Fenway Sports Groups.\n\nHe joined the tour in 2008 as director of The Players Championship and most recently was promoted to chief marketing officer, placing him in charge of corporate marketing and sponsor relations, one of the most critical positions on tour.\n\nHis appointment as deputy commissioner takes effect April 1.\n\nFinchem agreed to his most recent four-year extension in 2012 after one of the more challenging economic periods of the tour. He made it through a recession by keeping tournaments fully sponsored, and even while Tiger Woods was struggling through a collapse in his personal life and with leg injuries, Finchem negotiated a nine-year television deal with NBC Sports and CBS Sports.\n\nBut he suggested two years ago he probably wouldn’t stay after 2016.\n\n“I never rule out possibilities,” Finchem said in January 2012. “But the likelihood is this will probably be it for me. There’s other things I want to do.”"}, {"url": "https://wealthyspy.com/tim-finchem/", "page_content": "Tim Finchem is an American personality who is a lawyer by profession and has been serving as a retired golf administrator. While being in the PGA Tour, he served his positions including commissioner from 1994 to 2016, and also served in the White House for at least two years during the administration of president JImmy Carter from 1978 to 1979. He was inducted into the World Golf Hall of Fame Class 2021. The ceremony took place on 9th March 2022 because of the restricted protocols of the pandemic COVID-19.\n\nFinchem also showed his presence on the World Golf Hall of Fame 2022 appearing along with Tiger Woods, and Susie Maxwell Berning in the induction ceremony. Tim Finchem helped the PGA tour to pursue a jump from less than $60 million per year back in 1994 to more than $250 million per year by 2006. At the induction ceremony of the World Golf Hall of Fame 2022, Finchem took the further step to enhance the Players Championship events, building a new clubhouse, and renovating the course in 2006.\n\nEarly Life\n\nTim was born on 19th April 1947 in Ottawa, Illinois, and is currently living in his late 50s. He went to the Princess Anne High School, Virginia, where he received his primary education. Later, he went to receive his secondary education from the University of Richmond, receiving a bachelor of arts in 1969. Finchem received his degree of law from the University of Virginia School of Law in 1973. He had a paper route and used to perform other off jobs.\n\nRather than spending his money on purchasing candy and other small toys, Finchem was interested since childhood to play golf. So he used to spend his money only on playing golf. Finchem was brought by Harold (father) who was a career marine and used to permit his 8 years old young child to play golf with his buddies. Finchem is one of the oldest sons born in a family of six children, including three boys and three girls.\n\nTim Finchem Career\n\nBefore coming into the field of gold administration, Tim Finchem had pursued a great career in the line of law and practice. He practiced law in Virginia Beach at the University of Virginia School of Law for at least three years. Afterward, he served his position in the White House while being under the administrative powers of Jimmy Carter. He served as the deputy advisor to the President in the office of Economic Affairs. Later in the 1980s, he co-founded a group of National Marketing and Strategies in Washington, D.C. Later in June 1994, Finchem was appointed as the commissioner. He succeeded the position of Deane Beman, who retired from the position after serving for at least 20 years.\n\nPrevious to this, Finchem went to experience the responsibilities of the Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour. While being a commissioner, Finchem worked on the earning opportunities and let the PGA Tour players serve the increase in both domestic as well as international tours. Finchem remained the president of the television broadcasting deals for at least three years in 1997, 2001, and 2005. Back in 2006, Finchem helped the PGA tour to meet the hike from $56.4 million in 1994 to $256.8 million in 2006. It was one of the most remarkable growth of the organization which had a lot of things to do with the golf player Tiger Woods, as he also received the credit for the same.\n\nTim Finchem Biography Real Name Timothy W. Finchem Birth Date 19 April 1947 Age (as of 2022) 74 Years Birth Place Ottawa, Illinois, United States Nationality American Profession Lawyer Religion Christianity Sun sign Aries Physical Statistics Height in feet inches – 5’ 9” – in Centimeters – 175 cm Weight in Kilograms – 78 kg – in Pounds – 171 lbs Shoe Size 10 (U.S.) Hair Color Brown Eye Color Blue Body Type Slim Family Father Martin Landau Mother Barbara Bain Sister – Brother – Qualification/Education School Princess Anne High School College University of Richmond, University of Virginia Relationship Status Marital Status Married Wife Holly Finchem Children Not Known\n\nPersonal Life\n\nTim Finchem is a happily married man, who has a wife named Holly Finchem and the pair has together produced four children. Holly Finchem is herself one of the energetic and active personalities who is the member and dresser at Operation Shower, an organization that focuses on elevating funds and consciousness for pregnant women. She is often seen in the public talking about inspirational things and lecturing about the upbringing of the brand new youngsters or the effect on mothers. She is one of the great charity donors, who has developed good public relations. Holly Finchem has been co-partnered with her husband Tim Finchem within the new enterprise as she owns the revered Nona Blue Ponte Beach. After the retirement from the PGA Tour, Tim seems to spend a pleasurable time with the family, including his wife and four children.\n\nTim Finchem Net Worth\n\nTim Finchem holds a net worth of about $7 million. He has given many years serving in the PGA Tour and has remained an active practitioner of law. On the other hand, Tim’s wife Holly also holds a net worth of around $500K to $1 million. Together, the couple makes a luxurious lifestyle."}, {"url": "https://prabook.com/web/tim.finchem/1787639", "page_content": "Tim Finchem\n\nlawyer\n\nApril 19, 1947 Ottawa, LaSalle County, United States of America\n\nHe took the position on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour. Finchem later graduated from the University of Virginia School of Law in 1973. After practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, District of Columbia As Commissioner, Finchem has greatly expanded the earnings opportunities for Professional Golf Association Tour players both domestically and internationally. He has presided over the last three television broadcasting deals (1997, 2001 and 2005) and has maximized the earnings potential of the tour, and perhaps none was as bold as the most recent deal that excludes American Broadcasting Company and Entertainment and Sports Programming Network and challenges The Golf Channel to get better. In 2006, the total Professional Golf Association Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem\"s supporters also give him some of the cartulary-register He is a single-figure handicap golfer."}, {"url": "https://www.sportsbroadcastinghalloffame.org/inductees/tim-finchem/", "page_content": "When Tim Finchem retired in 2017 after 22 years as PGA TOUR commissioner, he had transformed the game and its relationship with fans on the course, watching on TV, watching on portable devices, and, yes, the computer at the office for the diehards who want to watch golf play from sunrise to sunset.\n\nHe introduced the FedEx Cup Playoffs, offering the sport a greater sense of an actual season. The Presidents Cup gave the sport another great international competition. And the World Golf Championships created greater opportunities for international golfers to compete together beyond the majors. And the 1997 rights deal he negotiated changed the relationship between TV and golf forever as it required every round of every tournament be carried on TV.\n\n“The most impressive thing about Tim is he was a remarkable consensus builder,” says Sean McManus, CBS Sports, chairman. “His relationships with the players, with the tournaments, with the sponsors, and TV networks were all first rate where everyone felt like they were getting full value.”\n\nHe also spearheaded efforts to coordinate the bid for golf’s return to the Olympics, which became a reality in the 2016 Games after a 112-year absence and gave NBC a chance to bring one of its most important rest-of-the-year properties to its Olympic programming schedule.\n\n“Tim Finchem super-charged the PGA TOUR during his tenure as commissioner by adding World Golf Championships, the Presidents Cup, and the FedEx Playoffs,” says Molly Solomon, executive producer/president, NBC Olympics Production, and executive producer, Golf Channel. “What the PGA TOUR looks like today is due in large part to his big ideas and creative leadership.”\n\nAdds Tommy Roy, NBC Sports, lead golf producer, credits Finchem with allowing NBC to have more than a dozen cameras on the island green for THE PLAYERS Championship, allowing the network to capture shots from almost any angle.\n\n“He gave us the ability to put a camera six feet away from Tiger Woods when he was about to execute a magical, game winning shot,” he adds. “And he also gave us the ability to put microphones three feet away from Phil Mickelson and [caddie] Bones when they were discussing the execution of a great shot.”\n\nSports Broadcasting Hall of Famer Dick Ebersol says he was lucky enough to have a front row seat to Finchem’s efforts.\n\n“Tim built the PGA Tour into one of the most important franchises in all of American TV sports,” he adds.\n\nAs if that weren’t enough, he helped oversee First Tee’s growth into a great youth-development organization, reaching more than 15 million youngsters (during his tenure as commissioner, the PGA TOUR and its tournaments raised more than $2 billion in charitable contributions).\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” said Jay Monahan, PGA TOUR commissioner and World Golf Foundation board chairman, when Finchem was inducted into the World Golf Hall of Fame last year. “His enshrinement in the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but, more important, so will the countless lives — whether those are the players on the PGA TOUR and beyond, millions of First Tee participants, or charitable organizations around the world — impacted by his life’s work.”\n\nFinchem became commissioner in 1994 when then-Commissioner Deane Beman, just 55 years old, retired to resume his playing career, this time as a member of the then-Senior PGA TOUR.\n\n“My history is one of just being in the right place at the right time,” says Finchem. “So much of where you’re headed is based on the individuals that you’re interfacing with.”\n\nFor example, prior to joining the PGA TOUR, Finchem was in the Jimmy Carter Administration, working with the president and his staff.\n\n“I’ve had a great run with regard to being around people who are extremely successful and thoughtful and committed to making this place a better place to live,” he says. “I look back at all those people I met and the players that I interfaced with, and I was very, very fortunate to be in the right place at the right time.” One example: he became commissioner only a few weeks before a player named Tiger Woods turned professional.\n\nAnd the beginning of the Woods era and the beginning of Finchem’s tenure as commissioner coincided with a time when some of the greats of the game had retired but were still an active part of the PGA efforts.\n\n“I was lucky,” Finchem says, “because I came into the PGA TOUR at a time when I had the opportunity to meet Sam Snead and Byron Nelson and all these great players and spend a fair amount of time with them. In some ways, many of those players were similar to working with the president because of their knowledge of the sport, their intensity about transferring that information to fans and to people like myself.”\n\nFinchem always had a passion for golf and freely admits to using his paper-route money to support his golf habit.\n\n“My dad was in the Marine Corps for 30 years, and I started playing golf when I was 8 or 10,” he says. “He took me to the Azalea Open in North Carolina; Arnold Palmer won, and I was mesmerized by him. Years later, I’d call him up from time to time and say, Take me through one of your wins. He’d say, Which one? and I’d tell him that one.”\n\nAlthough nearly half his adult life has been spent at the PGA TOUR, Finchem didn’t set out to work in sports administration. He attended the University of Richmond on a debate scholarship and graduated in 1969, then received his law degree from Virginia four years later. After practicing law in Virginia Beach for three years, Finchem served in the Carter White House as deputy advisor to the president in the Office of Economic Affairs in 1978 and 1979.\n\n“Tim’s leadership was invaluable for the growth of the game,” says Sports Broadcasting Hall of Famer and CBS Sports Lead Play-by-Play Announcer Jim Nantz. “His thoughtful decision-making helped the PGA TOUR soar to incredible heights. He led his global partners in promoting and implementing a World Golf Championship series, and, here at home, he brought life to the PGA TOUR’s end of the season. Lastly, Tim saw the value of nurturing and respecting his television relationships. He has been viewed by all as a great partner.”"}, {"url": "https://www.golfchannel.com/article/golf-central-blog/finchem-earned-over-9-million-final-year-commissioner", "page_content": "Tim Finchem, who was stepped down as commissioner of the PGA Tour in 2016, had a combined income of over $9 million in his final year as commissioner.\n\nAccording to the circuit’s tax forms filed for 2016, Finchem made $4.33 million in “reportable compensation” from the Tour and another $4.74 million from “related organizations.” He also earned $181,784 in “other compensation.”\n\nIn 2015, Finchem earned $5.9 million in combined income from the Tour.\n\nJay Monahan, who succeeded Finchem as commissioner, earned about $4 million in combined income in 2016 as deputy commissioner."}, {"url": "https://africa.espn.com/golf/story/_/id/10626818/jay-monahan-named-pga-tour-deputy-commissioner", "page_content": "ORLANDO, Fla. -- Jay Monahan was promoted to deputy commissioner of the PGA Tour on Tuesday, the first indication of a possible successor to Tim Finchem.\n\nFinchem was the last person to hold that position until he was appointed PGA Tour commissioner in 1994.\n\n\"This step is being taken to further strengthen our organizational structure, enhance our management coordination and ultimately to continue to deliver on three key pieces of our core business -- driving benefits to our players, growing the charity support in the communities where we play and doing our part in golf to help grow and protect this great game,\" Finchem said in a statement. \"Jay's new role in this key leadership position will help continue our momentum.\"\n\nFinchem, who completes 20 years as commissioner on June 1, signed a four-year extension through 2016. That would make him the longest-serving commissioner since the tour broke away from the PGA of America in 1969. He will be 69.\n\nMonahan played college golf at Trinity, and he earned a master's degree in sports management from the University of Massachusetts at Amherst. He previously worked for EMC in sponsorship and branding, at IMG as head of the Deutsche Bank Championship and as an executive vice president at Fenway Sports Groups.\n\nHe joined the tour in 2008 as director of The Players Championship and most recently was promoted to chief marketing officer, placing him in charge of corporate marketing and sponsor relations, one of the most critical positions on tour.\n\nHis appointment as deputy commissioner takes effect April 1.\n\nFinchem agreed to his most recent four-year extension in 2012 after one of the more challenging economic periods of the tour. He made it through a recession by keeping tournaments fully sponsored, and even while Tiger Woods was struggling through a collapse in his personal life and with leg injuries, Finchem negotiated a nine-year television deal with NBC Sports and CBS Sports.\n\nBut he suggested two years ago he probably wouldn't stay after 2016.\n\n\"I never rule out possibilities,\" Finchem said in January 2012. \"But the likelihood is this will probably be it for me. There's other things I want to do.\""}, {"url": "https://golf.com/news/see-how-the-salary-of-the-pga-tour-commissioner-stacks-up-to-other-sports-leagues/", "page_content": "Tax return documents show that outgoing PGA Tour commissioner Tim Finchem made more than $9 million in 2016, his final year before stepping down.\n\nThe Golf Channel reports that Finchem’s income — a combination of $4.33 million in “reportable compensation” from the Tour, $4.74 million from “related organizations,” and $181,784 in “other compensation” — was a step up from the $5.9 million he made as commissioner in 2015.\n\nSo how does the haul of the Tour commissioner compare with the heads of other sports leagues?\n\nIt’s no surprise that the behemoth NFL leads the way in executive pay: The NY Times reports that Roger Goodell’s newest contract is in the range of $40 million per year for the next five years.\n\nOther commissioners do pretty well for themselves, too. Although the official numbers are not released to the public, before MLB commissioner Bud Selig retired in 2015 — a year before Finchem — he was reportedly making $22 million annually. NBA commissioner David Stern was reportedly taking home $20 million per year before stepping away after the 2014 season, and NHL commissioner Gary Bettman reportedly took home $9.5 million for the 2013-14 season.\n\nCurrent PGA Tour commissioner Jay Monahan earned $4 million as deputy commissioner in 2016. The PGA Tour is making plenty of money these days, which means that number is likely to keep climbing."}], "Tim Finchem was promoted to Commissioner in 1994.": [{"url": "https://www.nytimes.com/1994/05/10/sports/golf-finchem-selected-as-pga-commissioner.html", "page_content": "\"I think the word would be relieved more than surprised,\" Finchem said of his reaction.\n\nIn the end, they were leaning close to home. Known to golf insiders as a tough, straightforward negotiator and an indefatigable worker, Finchem was always Beman's No. 1 choice for the job. A University of Richmond graduate who received his law degree from the University of Virginia, Finchem is similar to Beman in substance and probably will differ only slightly in style.\n\n\"He would have been my choice if I'd had one,\" said Beman, 56, who will officially end 20 years on the job when he steps down June 1. \"I didn't have a vote and didn't attend any of the board meetings.\"\n\nFinchem, who joined the PGA Tour in 1987 as the vice president for business affairs, came to golf from National Strategies and Marketing Group, a Washington consulting and marketing firm that he co-founded in 1984. A former deputy adviser for economic affairs to President Jimmy Carter and the national staff director for the Carter-Mondale presidential campaign in 1980, Finchem is regarded as a Washington insider.\n\nFinchem takes over an organization that has very few pressing problems. He will have to overcome some opposition from a group of players who wanted Beman's successor to come from the ranks of touring pros. Finchem, a four-handicap at the TPC at Sawgrass, is the equivalent of a scratch player when it comes to negotiating.\n\n\"I think we'll just handle that head-on,\" he said. \"What I really want to do is sit down and talk to every single player, particularly players who might have some misgivings, look them in the eye and tell them about what my approach will be to the job.\""}, {"url": "https://www.espn.com/golf/story/_/id/29070837/tim-finchem-former-pga-tour-commissioner-elected-world-golf-hall-fame", "page_content": "Tim Finchem, who expanded the PGA Tour's footprint around the world and negotiated TV contracts that more than tripled prize money during his two decades as commissioner, has been elected to the World Golf Hall of Fame.\n\nFinchem was elected through the contributor category and will become the 10th administrator to be inducted, joining predecessor Deane Beman. Marion Hollins, one of the leading women in golf a century ago, also was elected as a contributor.\n\nFinchem was PGA Tour commissioner when the World Golf Hall of Fame opened in 1998 in St. Augustine, Florida.\n\n\"One of the great things about that is to get know the inductees who I didn't know in other aspects of my job,'' Finchem said Monday. \"It's a tremendous list of people. To be included in that group is very powerful. I want to thank those who thought I was deserving of it. In many ways, I didn't feel I am deserving because I just had so much fun being in the job for so long.''\n\nFinchem found it fitting that he joins the induction class of 2021 with Tiger Woods, whom he first saw at a college tournament his first year as commissioner in 1994. Later that year, Finchem noticed players finishing up their rounds at the World Series of Golf at Firestone and watching an 18-year-old Woods win the first of three straight U.S. Amateurs.\n\nWoods was elected through the male player category a month ago. Marion Hollins, one of the leading women in golf a century ago, was elected as a contributor.\n\n\"It is the greatest honor to be elected to join golf's most legendary players and contributors in the World Golf Hall of Fame,\" Finchem said. \"I am especially proud to stand alongside one of the world's all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.\"\n\nWoods joined the PGA Tour in 1996 after two years at Stanford and brought enormous attention to himself and to the tour. Along with winning twice in seven starts, Woods won the Masters in his first attempt as a pro by setting 20 records, including a 12-shot victory that set off the first wave of \"Tigermania.''\n\nFinchem seized on it.\n\nHe was in the middle of negotiating a new network television contract, and prize money spiked. More deals followed in 2001, 2006 and 2012. PGA Tour prize money went from under $100 million on three tours in 1994 when Finchem was appointed commissioner to more than $400 million over six tours when he retired at the end of 2016.\n\nFormer PGA Tour commissioner Tim Finchem, left, has been elected to the World Golf Hall of Fame. He'll be part of a 2021 class that will also include Tiger Woods. AP Photo/Phil Long\n\nFinchem laughed Monday when asked what his job would have been like had Woods played tennis.\n\n\"It would have been a much more difficult job,'' he said. \"Tiger coming on the scene ... took our sport to another level. It continues on today. As a sport, we were blessed he didn't like tennis.''\n\nIt wasn't just money, however.\n\nFinchem created The First Tee program shortly after Woods won the Masters. Turning back Greg Norman's proposal for a world tour, Finchem came up with the World Golf Championships series in 1999 that led to three events for players from the leading six tours around the world. He also took advantage of a growing class of international players from outside Europe -- Norman, Nick Price, Ernie Els, Vijay Singh among those -- by starting the Presidents Cup in 1994.\n\nAt the heart of Finchem's work was making the PGA Tour logo recognizable around the world, a symbol of strength.\n\nThe PGA Tour had a development circuit (now called the Korn Ferry Tour) and a senior tour (now the PGA Tour Champions) for players 50 and older. Now it has circuits in Canada (Mackenzie Tour), Latin America and China.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" said Jay Monahan, whom Finchem groomed as his successor.\n\nMonahan delivered the news to Finchem during The Players Championship, two days before golf joined so many other sports in shutting down because of the coronavirus pandemic.\n\nSome of Finchem's best work came during tough times. He kept the PGA Tour fully sponsored during the recession in 2008 and, as a show of strength, kept prize money from shrinking.\n\nThe Hall of Fame is expected to announce a fourth inductee later this week."}, {"url": "https://www.espn.in/golf/story/_/id/29070837/tim-finchem-former-pga-tour-commissioner-elected-world-golf-hall-fame", "page_content": "Tim Finchem, who expanded the PGA Tour's footprint around the world and negotiated TV contracts that more than tripled prize money during his two decades as commissioner, has been elected to the World Golf Hall of Fame.\n\nFinchem was elected through the contributor category and will become the 10th administrator to be inducted, joining predecessor Deane Beman. Marion Hollins, one of the leading women in golf a century ago, also was elected as a contributor.\n\nFinchem was PGA Tour commissioner when the World Golf Hall of Fame opened in 1998 in St. Augustine, Florida.\n\n\"One of the great things about that is to get know the inductees who I didn't know in other aspects of my job,'' Finchem said Monday. \"It's a tremendous list of people. To be included in that group is very powerful. I want to thank those who thought I was deserving of it. In many ways, I didn't feel I am deserving because I just had so much fun being in the job for so long.''\n\nFinchem found it fitting that he joins the induction class of 2021 with Tiger Woods, whom he first saw at a college tournament his first year as commissioner in 1994. Later that year, Finchem noticed players finishing up their rounds at the World Series of Golf at Firestone and watching an 18-year-old Woods win the first of three straight U.S. Amateurs.\n\nWoods was elected through the male player category a month ago. Marion Hollins, one of the leading women in golf a century ago, was elected as a contributor.\n\n\"It is the greatest honor to be elected to join golf's most legendary players and contributors in the World Golf Hall of Fame,\" Finchem said. \"I am especially proud to stand alongside one of the world's all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.\"\n\nWoods joined the PGA Tour in 1996 after two years at Stanford and brought enormous attention to himself and to the tour. Along with winning twice in seven starts, Woods won the Masters in his first attempt as a pro by setting 20 records, including a 12-shot victory that set off the first wave of \"Tigermania.''\n\nFinchem seized on it.\n\nHe was in the middle of negotiating a new network television contract, and prize money spiked. More deals followed in 2001, 2006 and 2012. PGA Tour prize money went from under $100 million on three tours in 1994 when Finchem was appointed commissioner to more than $400 million over six tours when he retired at the end of 2016.\n\nFormer PGA Tour commissioner Tim Finchem, left, has been elected to the World Golf Hall of Fame. He'll be part of a 2021 class that will also include Tiger Woods. AP Photo/Phil Long\n\nFinchem laughed Monday when asked what his job would have been like had Woods played tennis.\n\n\"It would have been a much more difficult job,'' he said. \"Tiger coming on the scene ... took our sport to another level. It continues on today. As a sport, we were blessed he didn't like tennis.''\n\nIt wasn't just money, however.\n\nFinchem created The First Tee program shortly after Woods won the Masters. Turning back Greg Norman's proposal for a world tour, Finchem came up with the World Golf Championships series in 1999 that led to three events for players from the leading six tours around the world. He also took advantage of a growing class of international players from outside Europe -- Norman, Nick Price, Ernie Els, Vijay Singh among those -- by starting the Presidents Cup in 1994.\n\nAt the heart of Finchem's work was making the PGA Tour logo recognizable around the world, a symbol of strength.\n\nThe PGA Tour had a development circuit (now called the Korn Ferry Tour) and a senior tour (now the PGA Tour Champions) for players 50 and older. Now it has circuits in Canada (Mackenzie Tour), Latin America and China.\n\n\"Tim Finchem's vision and leadership have made an indelible impact on the game of golf over the past 25 years,\" said Jay Monahan, whom Finchem groomed as his successor.\n\nMonahan delivered the news to Finchem during The Players Championship, two days before golf joined so many other sports in shutting down because of the coronavirus pandemic.\n\nSome of Finchem's best work came during tough times. He kept the PGA Tour fully sponsored during the recession in 2008 and, as a show of strength, kept prize money from shrinking.\n\nThe Hall of Fame is expected to announce a fourth inductee later this week."}, {"url": "https://www.latimes.com/archives/la-xpm-1997-nov-09-sp-51961-story.html", "page_content": "ASSOCIATED PRESS\n\nTo put it in golf terms, Tim Finchem closed out Greg Norman early on the back nine. The confrontation to see who would handle the purse strings of a lucrative world golf tour was never a contest.\n\nNorman got the early advantage when he blind-sided the PGA Tour commissioner with his plan for the World Tour in 1994, but Finchem crushed what threatened to be a lengthy legal challenge with shocking suddenness.\n\nThe final blow came last week at the Tour Championship when Finchem--speaking for the five major PGA tours of the world--announced the creation of three $4 million World Golf Championship events in 1999 and a fourth the following year.\n\nAdvertisement\n\nJust like that, wealth undreamed of even by Norman three years ago when he led a breakaway challenge to the PGA Tour was handed to the best players in the world by Finchem, with the commissioner unquestionably in charge.\n\nThe World Tour came to golf last week and the center of the world was clearly in Finchem’s office in Ponte Vedra Beach, Fla., and not in Norman’s Great White Shark Enterprises headquarters down the coast in Tequestra.\n\n“You know, I understand why it happened a couple of years ago, why people, separate groups, weren’t all for it,” Norman said Wednesday, struggling to contain his anger as he acknowledged that Finchem had taken his idea and run with it.\n\n“I think there is only one word for it,” Norman said, “and that word is control. Now control is there, in their mind, and let them have it, let them go with it, let them see what they can do.”\n\nControl was clearly the issue in 1994 when Norman, John D. Montgomery Jr. of Executive Sports, a Florida-based firm that runs some tournaments, and Fox Sports announced a World Tour that guaranteed the top-30 players in the world a minimum of $290,000 a year.\n\n“This is about 30 years overdue,” Norman said at the time.\n\nThe plan then called for eight events held in the United States, Canada, Scotland, Spain and Japan with 30 players selected based on world rankings and 10 additional players given exemptions.\n\nEach event would have had a $3 million purse with $600,000 going to the winner and $30,000 guaranteed to the last-place finisher. There would have been a $1 million bonus to the player of the year, and each competing player would get a $50,000-a-year travel allowance.\n\nAt the time, the $600,000 first-place money was more than twice that offered in the average tour event. The three new events announced last week by Finchem will have a first prize of at least $720,000.\n\n“Everybody I’ve spoken to--Nick Price, Fred Couples, Jose Maria Olazabal--all the responses have been extremely positive,” Norman had said.\n\nWithin days, however, it was clear than no one was rushing to jump on the Norman bandwagon. Finchem had made it clear that anyone playing on the World Tour would be walking away from the PGA Tour.\n\n“If a new tour becomes a reality in 1995 or thereafter, our members will have to decide whether they want to continue to play on the PGA Tour or play on a new tour,” Finchem said at the time.\n\nThe commissioner said he would enforce the “conflicting events” rules requiring players to get his permission to play in outside events, and Finchem said the PGA would go to court to defend those rules.\n\n“This is not dissimilar from the decision professional athletes in other sports were forced to make when competing leagues were formed,” Finchem said.\n\nJust like that, the World Tour had a plan, money and a TV deal with Fox--but it had no players.\n\nEveryone backed off, even Norman. But it was clear Norman resented Finchem for the power play, and he used whatever opportunity he could to show his displeasure.\n\nLast year, Norman showed up a day late at the Tour Championship, missing the pro-am used to entertain high-roller backers of the PGA Tour. He was the only player who didn’t stay around for the rain-delayed final round on Monday.\n\nNorman also started this year with a snub of the tour, skipping the Mercedes Championships. He was the only one of the 1996 tournament winners to skip the event.\n\nFinchem and Norman both always denied there was any bad blood between them. But Finchem made it clear who was in charge and Norman was still feeling the sting when he saw Finchem modify the World Tour idea and present it as his own.\n\n“I took a lot of heat and a lot of criticism early on,” Norman said Wednesday. “The arrows can hopefully now come out of my back and we can all go forward.”\n\nFinchem tried to smooth things as best he could by recognizing Norman’s contribution to the new events.\n\n“I want to thank Greg for his continued involvement and commitment,” Finchem said. “I think he’s had a positive influence.”\n\nNorman, however, clearly wants everyone to remember that if it were not for his rebellion three years ago, the World Golf Championships likely would not have come to be--at least not this quickly.\n\n“I think it goes to show that I had the foresight, I had the knowledge of what makes the players tick, what makes the game of golf tick and what people are looking for,” said Norman, who called Finchem’s plan a “mirror image of what I proposed three years ago.”\n\nSurely, there were tweaks in the World Tour plan from 1994 and what Finchem and the four other tours came up with. But the ultimate change was exactly what Norman pointed out--control.\n\nAnd the answer to that was clear last week at the Tour championship. Tim Finchem and the PGA Tour are in control of world golf."}, {"url": "https://wiki2.org/en/Tim_Finchem", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican lawyer\n\nTimothy W. Finchem (born April 19, 1947) is an American lawyer and retired golf administrator, who served as commissioner of golf's PGA Tour from 1994 to 2016. He served in the White House for two years during the administration of President Jimmy Carter, from 1978 to 1979. He was inducted into the World Golf Hall of Fame in 2021.[1][2]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 9 089 4 855 357\n\nIce Bucket Challenge: Tim Finchem, PGA TOUR commissioner\n\nTim Finchem: World Golf Hall of Fame Acceptance Speech (2022 Induction)\n\nTim Finchem’s Drug Problem | GOLF.com Transcription\n\nEarly life and education\n\nFinchem was born in Ottawa, Illinois. He graduated from Princess Anne High School in Virginia Beach, Virginia. He attended the University of Richmond on a debate scholarship, receiving his Bachelor of Arts degree in 1969. While at Richmond, Finchem was a member of the Phi Gamma Delta Rho Chi chapter. Finchem later graduated from the University of Virginia School of Law in 1973.[citation needed]\n\nEarly career\n\nAfter practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, D.C.[3]\n\nPGA Tour Commissioner\n\nFinchem took the position of Commissioner on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour.\n\nAs Commissioner, Finchem expanded the earnings opportunities for PGA Tour players both domestically and internationally. He presided over three television broadcasting deals (1997, 2001 and 2005).[citation needed]\n\nIn 2006, the total PGA Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem's supporters also give him some of the credit.[4]\n\nFinchem received the 2001 Old Tom Morris Award from the Golf Course Superintendents Association of America, GCSAA's highest honor. He is a single-figure handicap golfer.[citation needed]\n\nFinchem was succeeded by Jay Monahan on January 1, 2017.\n\nReferences\n\nPreceded by Deane Beman Commissioner of the PGA Tour\n\n1994–2016 Succeeded by Jay Monahan"}, {"url": "https://www.tampabay.com/sports/2020/04/20/former-pga-tour-commissioner-tim-finchem-elected-to-golf-hall-of-fame/", "page_content": "Tim Finchem, who expanded the PGA Tour’s footprint around the world and negotiated TV contracts that more than tripled prize money during his two decades as commissioner, has been elected to the World Golf Hall of Fame.\n\nFinchem was elected through the contributor category and will become the 10th administrator to be inducted, joining predecessor Deane Beman.\n\nHe was PGA Tour commissioner when the World Golf Hall of Fame opened in 1998 in St. Augustine.\n\n“One of the great things about that is to get know the inductees who I didn’t know in other aspects of my job,” Finchem said Monday. “It’s a tremendous list of people. To be included in that group is very powerful. I want to thank those who thought I was deserving of it. In many ways, I didn’t feel I am deserving because I just had so much fun being in the job for so long.”\n\nFinchem found it fitting that he joins the induction class of 2021 with Tiger Woods, whom he first saw at a college tournament his first year as commissioner in 1994. Later that year, Finchem noticed players finishing up their rounds at the World Series of Golf at Firestone and watching an 18-year-old Woods win the first of three straight U.S. Amateurs.\n\nWoods was elected through the male player category a month ago. Marion Hollins, one of the leading women in golf a century ago, was elected as a contributor.\n\n“I am especially proud to stand alongside one of the world’s all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead,” Finchem said.\n\nWoods joined the PGA Tour in 1996 after two years at Stanford and brought enormous attention to himself and to the tour. Along with winning twice in seven starts, Woods won the Masters in his first attempt as a pro by setting 20 records, including a 12-shot victory that set off the first wave of “Tigermania.”\n\nFinchem seized on it.\n\nHe was in the middle of negotiating a new network television contract, and prize money spiked. More deals followed in 2001, 2006 and 2012. PGA Tour prize money went from under $100 million on three tours in 1994 when Finchem was appointed commissioner to more than $400 million over six tours when he retired at the end of 2016.\n\nFinchem laughed Monday when asked what his job would have been like had Woods played tennis.\n\n“It would have been a much more difficult job,” he said. “Tiger coming on the scene ... took our sport to another level. It continues on today. As a sport, we were blessed he didn’t like tennis.”\n\nIt wasn’t just money, however.\n\nFinchem created The First Tee program shortly after Woods won the Masters. Turning back Greg Norman’s proposal for a world tour, Finchem came up with the World Golf Championships series in 1999 that led to three events for players from the leading six tours around the world. He also took advantage of a growing class of international players from outside Europe — Norman, Nick Price, Ernie Els, Vijay Singh among those — by starting the Presidents Cup in 1994.\n\nStay updated on Tampa Bay’s sports scene Subscribe to our free Sports Today newsletter We’ll send you news and analysis on the Bucs, Lightning, Rays and Florida’s college football teams every day. Loading... You’re all signed up! Want more of our free, weekly newsletters in your inbox? Let’s get started. Explore all your options\n\nAlong with trying to get golfers paid like other athletes, Finchem tried to reshape the season to give it a more defined finish. He created the FedEx Cup in 2007, a separate competition at the end of the year that paid $10 million — an amount now at $15 million — to the winner.\n\nAt the heart of his work was making the PGA Tour logo recognizable around the world, a symbol of strength.\n\nThe PGA Tour had a developmental circuit now called the Korn Ferry Tour and the PGA Tour Champions for players 50 and older. Now it has circuits in Canada (Mackenzie Tour), Latin America and China.\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” said Jay Monahan, whom Finchem groomed as his successor.\n\nMonahan delivered the news to Finchem during The Players Championship, two days before golf joined so many other sports in shutting down because of the COVID-19 pandemic.\n\nSome of Finchem’s best work came during tough times. He kept the PGA Tour fully sponsored during the recession in 2008 and kept prize money from shrinking as a show of strength.\n\nThe Hall of Fame is expected to announce a fourth inductee later this week."}, {"url": "https://www.pgatour.com/news/2020/04/20/former-pga-tour-commissioner-tim-finchem-to-be-inducted-world-golf-hall-of-game-2021-class.html", "page_content": "ST. AUGUSTINE, Fla.– The World Golf Hall of Fame will enshrine former PGA TOUR Commissioner Tim Finchem as part of its Class of 2021, joining Tiger Woods and Marion Hollins. He received news of his Induction through the Contributor category from Commissioner Jay Monahan.\n\n\n\n“It is the greatest honor to be elected to join golf’s most legendary players and contributors in the World Golf Hall of Fame,” said Finchem. “This is a truly humbling moment, for which I am most grateful, and I look forward to celebrating with my family and friends throughout the game of golf and the many people who made this possible for me. I am especially proud to stand alongside one of the world’s all-time greats, Tiger Woods, in the Class of 2021 and look forward to what will be an exciting year ahead.”\n\n\n\nUnder Finchem’s 22-year tenure as the PGA TOUR Commissioner from 1994 through 2016, prize money skyrocketed, moving from under $100 million on three tours in 1994 to more than $400 million on six tours when he retired in 2017. He created signature events in today’s game, including the FedExCup and the FedExCup Playoffs, the Presidents Cup and the World Golf Championships.\n\n\n\nFinchem’s impact expanded far beyond the PGA TOUR as he left his mark on the global game. He spearheaded efforts to coordinate the bid for golf’s return to the Olympics, which became a reality in the 2016 Games after a 112-year absence.\n\n\n\nFinchem worked to ensure giving back was part of the fabric of the PGA TOUR’s business model and was instrumental in founding the First Tee in 1997. Since inception, Finchem has helped First Tee grow and develop into the positive youth development organization it is today, having reached more than 15 million young people on golf courses, in schools and after-school locations. During his tenure as Commissioner, the PGA TOUR and its tournaments raised more than $2 billion in charitable contributions.\n\n\n\n“Tim Finchem’s vision and leadership have made an indelible impact on the game of golf over the past 25 years,” said Jay Monahan, PGA TOUR Commissioner and World Golf Foundation Board Chairman. “His enshrinement into the World Golf Hall of Fame will forever stand as a testament to his tireless dedication and contributions, but more importantly, so will the countless lives – whether those are the players on the PGA TOUR and beyond, millions of First Tee participants, or charitable organizations around the world – impacted by his life’s work.”\n\n\n\nFinchem joins Tiger Woods and Marion Hollins as part of the 2021 Induction Class. The Hall of Fame will round out the Class of 2021 by announcing the fourth and final Inductee in the coming days.\n\n\n\nThe Class of 2021 is elected by the Hall of Fame’s Selection Committee, which discusses the merits of 10 finalists. The Selection Committee is a 20-member panel co-chaired by Hall of Fame Members Beth Daniel, Nick Price, Annika Sorenstam and Curtis Strange, and includes media representatives and leaders of the major golf organizations.\n\n\n\nThe finalists were vetted by the Hall of Fame’s Nominating Committee , which reviewed every candidate that met the qualifications of the Hall of Fame’s three Induction categories (Male Competitor, Female Competitor, Contributor)."}, {"url": "https://prabook.com/web/tim.finchem/1787639", "page_content": "Tim Finchem\n\nlawyer\n\nApril 19, 1947 Ottawa, LaSalle County, United States of America\n\nHe took the position on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour. Finchem later graduated from the University of Virginia School of Law in 1973. After practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, District of Columbia As Commissioner, Finchem has greatly expanded the earnings opportunities for Professional Golf Association Tour players both domestically and internationally. He has presided over the last three television broadcasting deals (1997, 2001 and 2005) and has maximized the earnings potential of the tour, and perhaps none was as bold as the most recent deal that excludes American Broadcasting Company and Entertainment and Sports Programming Network and challenges The Golf Channel to get better. In 2006, the total Professional Golf Association Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem\"s supporters also give him some of the cartulary-register He is a single-figure handicap golfer."}, {"url": "https://africa.espn.com/golf/story/_/id/10626818/jay-monahan-named-pga-tour-deputy-commissioner", "page_content": "ORLANDO, Fla. -- Jay Monahan was promoted to deputy commissioner of the PGA Tour on Tuesday, the first indication of a possible successor to Tim Finchem.\n\nFinchem was the last person to hold that position until he was appointed PGA Tour commissioner in 1994.\n\n\"This step is being taken to further strengthen our organizational structure, enhance our management coordination and ultimately to continue to deliver on three key pieces of our core business -- driving benefits to our players, growing the charity support in the communities where we play and doing our part in golf to help grow and protect this great game,\" Finchem said in a statement. \"Jay's new role in this key leadership position will help continue our momentum.\"\n\nFinchem, who completes 20 years as commissioner on June 1, signed a four-year extension through 2016. That would make him the longest-serving commissioner since the tour broke away from the PGA of America in 1969. He will be 69.\n\nMonahan played college golf at Trinity, and he earned a master's degree in sports management from the University of Massachusetts at Amherst. He previously worked for EMC in sponsorship and branding, at IMG as head of the Deutsche Bank Championship and as an executive vice president at Fenway Sports Groups.\n\nHe joined the tour in 2008 as director of The Players Championship and most recently was promoted to chief marketing officer, placing him in charge of corporate marketing and sponsor relations, one of the most critical positions on tour.\n\nHis appointment as deputy commissioner takes effect April 1.\n\nFinchem agreed to his most recent four-year extension in 2012 after one of the more challenging economic periods of the tour. He made it through a recession by keeping tournaments fully sponsored, and even while Tiger Woods was struggling through a collapse in his personal life and with leg injuries, Finchem negotiated a nine-year television deal with NBC Sports and CBS Sports.\n\nBut he suggested two years ago he probably wouldn't stay after 2016.\n\n\"I never rule out possibilities,\" Finchem said in January 2012. \"But the likelihood is this will probably be it for me. There's other things I want to do.\""}, {"url": "https://www.howold.co/person/tim-finchem/biography", "page_content": "Tim Finchem Biography\n\nAmerican lawyer\n\nTimothy W. Finchem (born April 19, 1947) is an American lawyer and retired golf administrator, who served as commissioner of golf's PGA Tour from 1994 to 2016. He served in the White House for two years during the administration of President Jimmy Carter, from 1978 to 1979. He was inducted into the World Golf Hall of Fame in 2021.\n\nEarly life and education\n\nFinchem was born in Ottawa, Illinois. He graduated from Princess Anne High School in Virginia Beach, Virginia. He attended the University of Richmond on a debate scholarship, receiving his Bachelor of Arts degree in 1969. While at Richmond, Finchem was a member of the Phi Gamma Delta Rho Chi chapter. Finchem later graduated from the University of Virginia School of Law in 1973.\n\nEarly career\n\nAfter practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, D.C.\n\nPGA Tour Commissioner\n\nFinchem took the position of Commissioner on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour.\n\nAs Commissioner, Finchem expanded the earnings opportunities for PGA Tour players both domestically and internationally. He presided over three television broadcasting deals (1997, 2001 and 2005).\n\nIn 2006, the total PGA Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem's supporters also give him some of the credit.\n\nFinchem received the 2001 Old Tom Morris Award from the Golf Course Superintendents *ociation of America, GCSAA's highest honor. He is a single-figure handicap golfer.\n\nFinchem was succeeded by Jay Monahan on January 1, 2017.\n\nReferences\n\nExternal links"}]}