{"Tim Finchem oversaw the introduction of the FedEx Cup, a season-long points competition that culminates in a four-tournament playoff.": [{"url": "https://www.espn.com.au/golf/story/_/id/7450463/work-remains-pga-tour-commissioner-tim-finchem", "page_content": "The contract extension he signed several years ago seemed to be perfectly timed for PGA Tour commissioner Tim Finchem: It would end the year he turned 65, and after the sometimes-volatile network television negotiations were concluded.\n\nSo as 2012 drew closer, it was natural to ask Finchem whether he planned to continue or walk off into the sunset, his goals accomplished, a robust golf tour left for somebody else to run.\n\nSometimes he joked about wanting to die in office. Other times he said he purposely was not thinking about it yet. Ultimately, Finchem said, it would come down to his desire to continue -- and the desire of the players and the PGA Tour's policy board to keep him.\n\n\"As long as our team here is comfortable with my leadership, then I will most likely be open to staying,\" he said. \"But those are big ifs.\"\n\nApparently not that big.\n\nThe PGA Tour announced Wednesday that Finchem's contract, which was set to expire at the end of the year, has been renewed for another four years, taking him through the 2016 season. Finchem turns 65 in April, and if he completes the new term, he will have been in the position for 22 years.\n\nFinchem is only the third commissioner in the tour's history, following Joe Dey and former player Deane Beman, who gave way to Finchem in 1994 after his own 20-year run. Dey became the first commissioner when the PGA Tour broke away from the PGA of America in 1968.\n\nThe tour has prospered under Finchem's leadership.\n\nFrom total purses of $56 million his first year to some $290 million today; the formation of World Golf Championship events; the moving of the Players Championship to May; the growth of the Presidents Cup; the implementation of the FedEx Cup.\n\nSure, Finchem has had the great benefit of seeing Tiger Woods come along just a few years after he took the job. Woods turned pro in the summer of 1996, and Finchem was able to get record numbers in his TV deals due to the presence and history-making success of one of sports' most recognizable figures.\n\nAnd that money trickles down to all the players, who saw huge increases in purses.\n\nBut Finchem has been at his best in recent years, when the economy suffered, when Woods' game slumped in the aftermath of personal issues, when sponsors were bailing on tour events and the networks pushed back on rights fees."}, {"url": "https://golfweek.usatoday.com/2022/06/22/pga-tour-changes-fedex-cup-jay-monahan/", "page_content": "CROMWELL, Conn. — The PGA Tour is planning some radical changes in the face of an effort by the Saudi-funded LIV Golf series to poach its top players. The moves include a significant reduction in the number of members who are fully exempt each season and the addition of a lucrative three-stop series of international events for top performers. And all of that means more changes to the oft-tweaked FedEx Cup.\n\nUnder the current system governing the FedEx Cup, the top 125 finishers in the season-long points race qualified for the first playoff event, with the top 70 in the standings progressing to the second event and, finally, the top 30 making the elite Tour Championship, where the winner receives $18 million from a $75 million bonus pool.\n\nFour sources have confirmed to Golfweek the details of some imminent major changes. Starting at the end of the 2022-2023 season, only the top 70 players in FedEx Cup points will qualify for the first playoff tournament, the FedEx St. Jude Championship. The top 50 in the standings will move onward to the BMW Championship one week later, with the traditional top 30 players progressing on to the Tour Championship at East Lake.\n\nIn addition, the 50 players who qualify for the BMW Championship will also earn berths in a lucrative three-event series to be held overseas in the fall of 2023. Those events are expected to be staged in Asia, Europe and the Middle East in consecutive weeks with purses of at least $20 million each.\n\nIn addition to the three new fall events, five existing PGA Tour events will be recategorized with boosted purses. Those are the three invitationals — the Genesis Invitational, the Arnold Palmer Invitational, and the Memorial Tournament — along with the WGC-Dell Technologies Match Play and the Sentry Tournament of Champions, which will again become the season-opening event.\n\nOnly the 70 players who earn a berth in the playoffs will secure their playing privileges for the following season, which will begin in January 2024, when the PGA Tour moves away from the current wrap-around season and returns to one based on the calendar year. “The rest jockey in the fall series events,” said one industry source familiar with the details.\n\nUnder the new system, players who finish outside the top 70 and fail to qualify for the playoffs will compete in a series of domestic Tour events during the Fall that will determine their status and priority for the following season. The intent of the changes is to bestow greater reward on top performers on the PGA Tour, many of whom have been approached by LIV Golf with guaranteed offers, and reduce the number of members who can retain playing status despite unimpressive results.\n\nDetails of the plan were presented to the Tour’s board Tuesday night in Connecticut. A PGA Tour spokesperson declined to confirm the details of the planned changes to Golfweek."}, {"url": "http://golftipcomp.com.au/instruction", "page_content": "Our Rules\n\nOVERVIEW\n\nThe PGA TOUR entered a new era in 2007 with the introduction of the FedEx Cup, a season-long points competition, offering a bucket load of money to the eventual winner of the PGA TOUR's first-ever Playoff system.\n\nThe FedEx Cup Golf Tips (FGT) competition will also give the opportunity for someone to win a bucket load of cash, with the Tipper who can finish the season with the most FedEx Cup points winning the 8th FGT Prize.\n\nThis year’s competition will begin when the Official 2021/22 PGA Tour kicks off its wraparound format, which includes 9 tournaments in the latter months of 2020, and finishing with the 2 Fedex Playoff events in August 2021.\n\nTHE RULES FOR THE SEASON\n\nEach Tipper is to enter on the website (or email/text in emergency) a Player’s name by the specified time (usually 9pm Thursday) before each weekly event .\n\n(We will send a reminder email out every week as well as a results and selections summary)\n\nYou will be awarded the Fedex points that your selection earns in the tournament\n\nHere is the catch… You can only select the same player once throughout the entire regular season, and again for one of the 2 FedEx Cup playoff events.\n\nExample: I choose Tiger for the “Sony Open” during the regular season and he doesn’t win, I can then only choose Tiger again for one of the 2 FedEx Cup Playoff events.\n\nWIN BONUS – If you are lucky enough to select the winner of the tournament – you will be eligible to pick that player again in another tournament of that type.\n\nIf you fail to provide a player’s name, then you will earn zero points for that week\n\nIf your player withdraws from the tournament after his first tee shot, you will score zero.\n\nIf your player withdraws from the tournament before his first tee shot – you will be eligible to select that player in another tournament. You will also be given the first player named by tee times in the event (If you have already selected that player previously, you will get the second etc etc).\n\nWhere the tour schedules 2 tournaments on the same weekend, only the main tournament will require a selection.\n\nOnly players who are eligible for Fedex points can be selected.\n\nTHE RULES FOR MAJOR AND WGC MINICOMPS\n\nThe Minicomps run concurrently with the regular season, no extra selection is needed\n\nThe winner will be the tipper who has the best combined points score for the relevant events.\n\nMajor Minicomp is contested over the Masters, US Open, US PGA and The Open Championship\n\nWGC Minicomp is contested over all WGC events\n\nIn a result of a tie, all tied tippers will share the prizemoney equally\n\nTHE RULES FOR LAST TIPPER STANDING EVENTS\n\nThe Last Tipper Standing comps run concurrently with the regular season, no extra selection is needed. The organiser will advise which event is a designated Last Tipper Event.\n\nIf you score zero in any designated event, you are eliminated from Last Tipper. In simple terms, you need to make the halfway cut and complete the event.\n\nIf your player withdraws from the tournament before his first tee shot, you will not be eliminated, but you cannot win overall that week either.\n\nIf your player withdraws from the tournament after his first tee shot, you will score zero and be eliminated.\n\nThe organisers may choose to alter the scoring to speed up the event – for instance, you may be required to pick someone to finish Top 20. Any change will be clearly advertised to the remaining competitors.\n\nIn the unlikely event of all remaining tippers being eliminated in the same week – prizemoney will be divided equally between those tippers.\n\nCOST & PRIZE MONEY\n\nThe cost to take part will be $50 of your hard earned. This gives you entry into every competition we run.\n\nPrizes will be awarded depending on amount of Tippers.\n\nPrizes will be awarded for Regular Season and overall including Playoffs.\n\nIn a result of a tie, tied tippers will share the prizemoney equally.\n\nIf you think you have what it takes to compete in this great event, email golftipcomp@gmail.com Or call Adam on 0417 55 65 60 or Shaun on 0488 092 413"}, {"url": "https://pgatourmediaguide.com/intro/fedex-cup-overview", "page_content": "Established in 2007, the FedExCup is a season-long points competition offering $75 million in bonus money and culminating with the FedExCup Playoffs in August. Players vie to become the FedExCup Champion, which distinguishes the one player who not only performs well during the FedExCup Regular Season, but also excels through the pressure of the FedExCup Playoffs. Players to hoist the FedExCup trophy include Tiger Woods (2007 and 2009), Vijay Singh (2008), Jim Furyk (2010), Bill Haas (2011), Brandt Snedeker (2012), Henrik Stenson (2013), Billy Horschel (2014), Jordan Spieth (2015), Rory McIlroy (2016, 2019 and 2022), Justin Thomas (2017), Justin Rose (2018), Dustin Johnson (2020) and Patrick Cantlay (2021).\n\nFedExCup Regular Season\n\nThe 2022-23 FedExCup Regular Season features 47 official FedExCup events beginning with the 2022 Fortinet Championship and running through the 2023 Wyndham Championship. TOUR members earn FedExCup points based on their finish at each tournament, with an emphasis placed on wins and high finishes.\n\nFedExCup Points Distribution\n\nOfficial PGA TOUR events award 500 FedExCup points to first place\n\nTHE PLAYERS Championship, Masters Tournament, PGA Championship, U.S. Open and The Open Championship award 600 FedExCup points to first place\n\nWorld Golf Championships events and the Sentry Tournament of Champions, The Genesis Invitational, Arnold Palmer Invitational presented by Mastercard, and the Memorial Tournament presented by Workday award 550 FedExCup points to first place\n\nThe Zurich Classic of New Orleans, a two-man team event, awards 400 points to each player on the first-place team\n\nAdditional events award 300 FedExCup points to first place\n\nThree tournaments count on both the PGA TOUR’s FedExCup and the DP World Tour Rankings: the Barbasol Championship (300 FedExCup points to first place), Barracuda Championship (300) and Genesis Scottish Open (500)\n\n\n\n\n\nFedExCup Points are awarded by finish position as defined in the point distribution tables. Limited field events during the FedExCup competition will not redistribute the points for places that do not play. For example, if the Sentry Tournament of Champions has a field of 30 players, the points awarded will be based on the points that would be awarded to each individual position in a full-field event from positions 1 to 30. This will result in the points that would have otherwise been awarded from positions 31–65 in a regular event not being awarded in the tournament.\n\nAnother example is the World Golf Championships-Dell Technologies Match Play, a 64-player field. In this limited-field event, points for positions 65 and beyond would not be awarded.\n\nTies – Points will be distributed to those in tying positions using the same method currently used to distribute prize money when there is a tie. That is, the total points for each tying position will be averaged and that average will be distributed to each player in the tying position.\n\nFedExCup Playoffs\n\nAt the conclusion of the Regular Season (following the 2023 Wyndham Championship), the top 70 players in the FedExCup standings will be eligible to play in the FedExCup Playoffs, a series of three events over the month of August (prior to 2019, the FedExCup Playoffs included four events). Points earned during the FedExCup Regular Season carry over to the first two Playoffs events. Players will compete in the FedExCup Playoffs for their share of the $75 million total in bonus money, with the FedExCup Champion taking home $18 million.\n\nThe FedExCup Playoffs feature a progressive cut, with fields of 70 for the FedEx St. Jude Championship (TPC Southwind, Memphis, Tennessee), 50 for the BMW Championship (Olympia Fields Country Club, North Course, Olympia Fields, Illinois) and 30 for the TOUR Championship (East Lake Golf Club, Atlanta, Georgia), where the FedExCup Champion will be determined. In the event an eligible player is unable or chooses not to play, the field will be shortened and no alternates will be added.\n\nThe FedEx St. Jude Championship will cut the field to low 65 and ties after 36 holes, while the BMW Championship and TOUR Championship are no-cut events.\n\nThere are no cuts in FedExCup Playoffs events.\n\nTOUR Championship and FedExCup Starting Strokes\n\nAt the TOUR Championship, the player with the lowest stroke total over 72 holes when combined with his FedExCup Starting Strokes will be crowned the FedExCup Champion, be credited with an official victory at the TOUR Championship, earn a bonus of $18 million and a five-year PGA TOUR exemption.\n\nThe FedExCup points leader after the first two Playoffs events will begin the TOUR Championship at 10-under par. The No. 2 player will start at 8-under. The No. 3 player starts at 7-under; the No. 4 player starts at 6-under; the No. 5 player starts at 5-under. Players 6-10 start at 4-under; players 11-15 start at 3-under; players 16-20 start at 2-under; players 21-25 start at 1-under; and players 26-30 start at even par.\n\nIn the event there are tied players at any position going into the TOUR Championship, tied players will be awarded the same number of Starting Strokes for round one. For example, if two players are tied for second position, both players would start at 8-under and the No. 4 player would start at 6-under."}, {"url": "https://www.espn.com/golf/story/_/id/19326370/golf-fedex-cup-olympic-golf-monahan-shares-vision-golf", "page_content": "PONTE VEDRA BEACH, Fla. -- Jay Monahan is not wasting any time as the new commissioner of the PGA Tour, notching his signature moment less than five months into his tenure as just the fourth commissioner in the league's history.\n\nAlthough it had been in the works before he took over for Tim Finchem in January, Monahan on Tuesday announced a 10-year extension of a deal with FedEx to sponsor its year-long points race and season-ending playoff format.\n\n\"In a relatively short period of time, it has become something that really shapes our players' schedule. It shapes their thinking, and it's become part of the fabric of our sport,'' Monahan said. \"We're proud of that. And we're obviously thankful for the long-term commitment we have with FedEx.\"\n\nIn the second part of an exclusive interview at TPC Sawgrass, home of this week's Players Championship, Monahan discussed several topics -- and with the FedEx Cup renewal, that is a good place to start.\n\nEditor's Note: Read part I of Bob Harig's interview with Jay Monahan.\n\nThe FedEx Cup\n\nThe FedEx Cup season-long points race and season-ending playoff series is now in its 11th year and will go through at least 2027, providing immense riches for those at the top of the game and even modest ones for those who are not.\n\nSince its inception, FedEx has paid out a $10 million bonus to the winner of the Cup, which is determined at the 30-player, season-ending Tour Championship. Second place receives a $3 million bonus and the payouts go all the way down to $150,000 in tax-deferred retirement payments to the 150th-place finisher in the standings. Only the top 125 qualify for the now four-tournament playoff run -- with each of the tournaments offering purses in excess of $8 million.\n\nIn one of multiple jobs he's held at the PGA Tour, now commissioner Jay Monahan, right, used to be the tournament director of the Players Championship. In 2015 as deputy commissioner of the PGA Tour, Monahan awarded the winner's trophy to Rickie Fowler. Stan Badz/PGA TOUR\n\nMonahan said he could foresee an increase in the $10 million payout.\n\n\"I think there is an opportunity for us to grow every element of the cup,'' he said. \"I wouldn't get into specifics. But we come to work every day with a goal of trying to maximize their playing and financial benefits. And the cup is an important element to that. So I do see it growing.''\n\nTo be determined is if the four-tournament playoff series will be reduced to three events. The Dell Technologies Championship -- formerly the Deutsche Bank Championship, which Monahan used to run -- is working under just a one-year deal. There have been rumblings about reducing the number of events to three to assure everyone plays and offer a possibly more exciting race to the finish.\n\nAs for format, all manner of ideas and suggestions have been tossed about, many believing the points system is convoluted. Finchem always said he was not opposed to such controversy, as it got people talking about it, much like there is always discussion about a better way to crown a college football national champion.\n\nGolf and the Olympics\n\nGolf's return to the Olympic Games in 2016 was fraught with negativity: player defections, the Zika virus and concerns about the golf course in Brazil. The competition itself for both men and women was a pleasant surprise, with Justin Rose winning the men's gold and Inbee Park doing so for the women.\n\nThe outlook for the future turned positive, with only the 2020 Games in Tokyo being assured for golf.\n\nJay Monahan, left, said he will lean on Tim Finchem, right, who replaced Deane Beman, center. \"I can and have and I always would (reach out to Finchem),'' Monahan said. \"... I think you'd be crazy to not call on him for counsel in certain situations.\" Chris Condon/PGA TOUR\n\n\"I think it was a great success because when we left Rio and you look at the impact in Sweden, the number of people who followed Henrik (Stenson) on his quest to trying to win the gold medal was far more significant than that time frame where he won the Open Championship,\" Monahan said. \"Justin Rose, the ratings in the U.K. were extraordinary, the highest that golf had ever seen. Similarly, if you look at Korea, China and other countries where you had top performers, the Olympics raised the profile for the game, which was the intention of those leaders when they came together and said we need to get golf in the Olympic Games.\n\n\"There were a lot of bumps along the road, and we all know what they were. But I'm proud of the way everybody banded together and golf presented itself, I think, really well. We're excited about '20 in Tokyo.\n\n\"I think that tour involvement in the Olympics is not something you can look at in the short term. You have to look at where are you 15, 20 years down the road. With more countries investing in the game and investing in developing talent in the game, I think that's really positive. I think it will create all kinds of opportunities as we go forward. As a player to be in the context of all the best athletes in the world, for those who had that opportunity, it had a significant impact on them.''\n\nIf you are looking to a change in format, Monahan said not to expect one for Tokyo. Individual stroke play appears to be what will be used again, despite calls for more innovation and perhaps even a team component. \"I fully expect as we go forward, we'll be having substantial discussions about format and potentially additional formats,'' Monahan said.\n\nDespite immense scheduling difficulties last year, Monahan does not foresee much change in that regard in 2020. The Games fall in early August, and unless the PGA Championship has plans to move to another time of year, the same scheduling crunch is likely to exist.\n\nThe PGA Tour and its own network\n\nThe NFL has one. So does major league baseball, the NBA and the NHL. Various conferences in college sports have them as well. Tennis, too. So why not golf?\n\nThere has been plenty of conjecture about the PGA Tour starting its own television network -- something that Monahan said is not imminent. That is not to say he is opposed to the idea.\n\nPlaying in the Genesis Open pro-am earlier this year, PGA Tour commissioner Jay Monahan got to spend some quality time with one of the league's top stars -- two-time major winner Jordan Spieth. Stan Badz/PGA TOUR\n\n\"When you've got your brand on a network, it's kind of like having your brand on a tournament,'' he said. \"It becomes part of the lexicon of the sport and part of the lexicon of the sport at large. I think that's really positive for those leagues. Plus, I think the way they are structured, it gives them more flexibility and more influence over how you build the brands of your players, how you build the brands of your tournaments, or in this case your teams, and how you just build your brand in general. I think that's really positive.''\n\nThe PGA Tour has television rights deals with Golf Channel for cable and with networks NBC and CBS through 2021, although there is a provision to opt out of the network deals in 2018 with any of those changes taking place in 2019.\n\n\"I think you'll see us, like other leagues, really evolve how we present our sports just based on the fact that that is what the fan, the consumer, expects of us,'' Monahan said. \"Owning networks and getting into that part of the discussion ... that's obviously very complicated. There are elements there that those leagues have been able to figure out that we're just not far enough along for it to be a consideration [right now].''\n\nMonahan noted that the tour's digital presence will increase as the appetite for golf via internet options increases.\n\n\"We have a great success with PGATourLive (a first- and second-round streaming service), we've announced a Twitter streaming deal,'' he said. \"We're introducing virtual reality and you'll see some of that at [No.] 17 here [at the Players Championship]. ... It's an opportunity to perhaps showcase your sport in a different light. I think it's fairly early on in the number of ways we will continue to evolve in that way.''\n\nTiger's influence\n\nUnlike his predecessor Finchem, Monahan will not have the biggest needle-mover the game has ever seen to help him sell the product. When Woods turned pro in 1996, Finchem was more than two years into his tenure. When Woods won the 1997 Masters, Finchem soon was able to parlay it into record television rights deals and escalating purses.\n\nAll of Woods' 14 major championships and 79 PGA Tour victories occurred on Finchem's watch, and with Woods out for at least six months after a fourth back surgery, his future as a player is in doubt.\n\nBut Woods certainly has a future in the game, if he chooses. As a golf course designer. As a tournament host. As the founder of his foundation. Perhaps one day as an elder statesman.\n\nMonahan played a few holes of golf with Woods during his tenure as the executive director of the Deutsche Bank Championship. He hopes to play with a healthy Woods as commissioner.\n\n\"I think he will play again,'' Monahan said. \"And I think he'll win on the PGA Tour again and that would be a great thing.\n\n\"But when I think about Tiger and impact, I think about him along the same lines as Arnold (Palmer), Jack (Nicklaus), Gary (Player). I think his impact will be felt in perpetuity. I think it will be felt in the competitive realm for as long as he's playing. And then when he stops playing competitively, with what he's done with his foundation, the amount of young people's lives he's changed -- which doesn't get talked about enough -- I think that will continue to grow.\n\n\"He obviously is involved with (three) tournaments on the PGA Tour. I think his ability to make an impact through those tournaments will be an opportunity. And I think he'll always have a very important voice within the game. He'll always be seen as a leader within the game."}, {"url": "https://www.sportspromedia.com/news/pga_tour_and_fedex_agree_new_multi-million_dollar_deal/", "page_content": "FedEx and the PGA Tour have announced the continuation of the logistic firm's major sponsorship deal until 2017. The new deal, announced by PGA Tour commissioner Tim Finchem on Wednesday, does not begin until 2013 but it secures the long-term future of the tour's end-of-year play-off format.\n\nFedEx will continue to offer the US$35 million in total bonus money, including US$10 million for the winner, for the FedEx Cup, which began in 2007 as the tour's way of generating increased interest at the end of each season.\n\n“Since its inception in 2007, the FedEx Cup has transformed the competitive landscape on the PGA Tour and significantly benefitted all of our stakeholders,” said Finchem.\n\n“It makes every FedEx Cup event more meaningful, adding substantial value to our tournaments, title sponsors and television partners. Most importantly, the FedEx Cup offers our fans more ways to engage in our sport and get excited about our players week in and week out.\"\n\nSince joining forces with the PGA Tour for the FedEx Cup, FedEx has activated its deal in a variety of ways. There is a media buy aspect to the deal and the company 'will become further integrated into the PGA Tour's digital and global endeavours'.\n\n“The FedEx Cup has been a very effective way for FedEx to engage in the community and reach our customers over the last five years,” said T. Michael Glenn, executive vice president of market development at FedEx.\n\n“One of the most significant dividends of our FedEx Cup commitment has been that it allows us to support national and local charities, such as the St. Jude’s Children’s Hospital through the FedEx St. Jude Classic, in a very hands-on manner.”\n\nFedEx has been the title sponsor of the St. Jude Classic tournament since 1986 and it renewed its deal until 2014 last year. It began sponsoring the PGA Tour in 2002 as official marketing partner before the creation of the FedEx Cup five years ago.\n\nThe renewal is an important one for the PGA Tour as it looks to maintain its position as the world's leading tour. Last year it tied up long-term US network television deals with CBS and NBA, believed to be worth US$3 billion for the nine years until 2021, while Finchem was handed a new four-year contract to run the tour in January.\n\n\n\n5 years 35000000 175000000 PGA – FedEx"}, {"url": "https://www.washingtonpost.com/sports/2022/08/15/pga-tour-playoffs-fedex-cup/", "page_content": "Listen 7 min Comment on this story Comment Gift Article Share\n\nIf you are a golf fan, you have been bombarded for weeks with television ads for the PGA Tour playoffs — or, as the tour would prefer you call them, the \"FedEx Cup playoffs.” There’s one ad that refers to the playoffs as the PGA Tour’s “ultimate” moment. There’s another that says, “History will be made.”\n\nOh, please.\n\nSince “ultimate” technically means final, it is not inaccurate to use that word to describe the three tournaments that conclude Aug. 28 in Atlanta. The clear implication, though, is that ultimate in this context means greatest.\n\nAs for history? Like I said: Oh, please.\n\nHistory is made in golf at the four major championships, not in the incredibly lucrative but ultimately (pun intended) nonhistoric playoffs — or, for that matter, at the extremely lucrative and overhyped Players Championship.\n\nAdvertisement\n\nFor the record, I like the playoffs — at least as individual tournaments. In 2006, after Tiger Woods and Phil Mickelson had made it clear they had no interest in playing in the Tour Championship in November, Commissioner Tim Finchem came up with a brilliant idea: He convinced FedEx to pay for a four-tournament playoff and moved the Tour Championship to September.\n\nMoney talks — even for very rich athletes. Instead of going home after the four majors and waiting for preholiday exhibitions with guaranteed upfront money, players showed up for the playoffs. The first winner in 2007 was Woods. He refused to kiss the “FedEx Cup” trophy, but he had shown up to play, and that was really all that mattered.\n\nThere was, however, a problem with the system then, and even though the tour has tweaked and tweaked, it has never gotten it right. In fact, for all the money and all the hype, the playoffs are basically a scam. Not on the players, who cash huge checks the first two weeks and monstrous checks the third week, but on the public.\n\nAdvertisement\n\nIt starts with the points system, which is designed to make both the playoffs and the regular season week-to-week tournaments appear more important than they are and the majors less important.\n\nThe tour is not in charge of the majors. Augusta National Golf Club, the U.S. Golf Association, the Royal and Ancient and the PGA of America control them and have separate TV deals. That’s why a win at a weekly PGA Tour event is worth 500 FedEx Cup points and a win at a major is worth just 600.\n\nAsk a player the value of winning a major compared with a weekly event. They will tell you it is at least five times as important. Golf Channel’s Brandel Chamblee told me several years ago that winning a regular tour event was probably worth about $3 million over the course of a career and a major was probably worth closer to $30 million.\n\nAdvertisement\n\nLet’s be conservative and say a major is five times as important. That means winning a major should be worth 2,500 points — not 600. The tour also gives 550 to the winner of a number of events, including the Players and the three tournaments hosted by superstars: Tiger Woods’s event at Riviera; Jack Nicklaus’s event, the Memorial; and the late Arnold Palmer’s tournament at Bay Hill.\n\nThis weekend’s tournament at Memphis gives the winner 2,000 points, as does this coming week’s event in Delaware. In other words, according to the tour, a win in the first two playoff events is worth more than three times as much as a win in a major.\n\nThere is lots of money in play here: $15 million in each of the first two weeks and $44.75 million spread among the top 10 finishers at the Tour Championship, with the winner taking home $18 million.\n\nAdvertisement\n\nYou might point out that doesn’t sound so insane compared with the guarantees that the LIV Golf Series, the Saudi Arabia-funded start-up, is paying, but it is still a lot of money.\n\nThe tour has responded to LIV in two ways: suspending players who have taken the Saudi petrodollars and run, and upping its payouts to stunning levels. This year there will be a Player Impact Program fund of $50 million that will be split among 10 players for — wait for it — being popular on social media.\n\nAdditionally, prize money is going up across the board. The Players Championship’s purse will be $25 million next year thanks to new tour television contracts.\n\nBut as with LIV, all that money can’t make tournaments bigger than they are or as big as promoters want them to be. LIV is a bunch of 54-hole exhibitions played for Monopoly money. The PGA Tour’s playoff events are more legitimate — ­72-hole events that golfers have to earn their way into.\n\nAdvertisement\n\nWhat’s more, the individual tournaments can be as riveting as any non-major. Last year’s playoff at Caves Valley between Patrick Cantlay and Bryson DeChambeau — won on the sixth hole by Cantlay — was wonderful theater. Ditto for Sunday’s tournament, won on the third playoff hole by Will Zalatoris.\n\nIn many ways, the playoffs have done what Finchem hoped they would: kept the top guys playing and fans interested in watching after the majors are over. That didn’t used to be the case. Players were interested in the silly season only when they got money up front.\n\nThe playoffs changed that. And yet that wasn’t enough for the tour, which insists that its TV partners act as if a major championship always is being decided, especially in the Players, when in truth only lots and lots of money is at stake.\n\nAdvertisement\n\nFedEx has spent a lot of money since 2007 on the playoffs and on the tour. Corporate sponsorship is at the heart of everything the tour does. Washington — the nation’s capital — doesn’t have a yearly tour event. Why? Because there’s no corporate sponsor willing to fund a tournament here.\n\nThe tour has changed playoff systems more often than most people change their socks. When Vijay Singh clinched victory in the FedEx Cup the week before the Tour Championship in Year 2, the tour changed the system. When Bill Haas walked onto the victory platform after he won the Tour Championship in 2011 and asked Finchem, “Who won the FedEx Cup?” and Finchem sheepishly answered, “You did,” it was time for another change.\n\nThree years ago, the Tour adopted what is essentially a member-guest format. The points leader starts the Tour Championship at 10 under par, and everyone else starts behind him, down to 30th place.\n\nAdvertisement\n\nLast year, Cantlay started at ­10 under and shot a 269 for the week in Atlanta. Three players played better than he did, but Cantlay’s head start made him the winner. This is a little like a team winning the Super Bowl despite being outscored because it started with a 14-0 lead.\n\nHow do you fix all this? First, give the majors the emphasis they deserve. An easy fix, but the tour is loath to do it.\n\nAnother easy fix: If you want to call them playoffs, make them real playoffs. After the regular season ends, start everyone at zero. Next year, only 70 players will make the playoffs with 50 advancing to the second tournament and 30 to the Tour Championship. The tour — and the TV networks — live in fear that a star won’t make it to Atlanta. Rory McIlroy missed the cut this past week in Memphis. NBC doesn’t want him absent the next two weeks.\n\nThe only player who really drives ratings is Tiger Woods, and his days of making the playoffs are over. So make it a real competition with everyone subject to elimination.\n\nHistory still won’t be made, but at least we will get a real champion when all is said and done. It has been 16 years. Time to fix this once and for all.\n\nGiftOutline Gift Article"}, {"url": "https://sqairz.com/blogs/news/what-is-the-fedex-cup", "page_content": "How It All Started\n\nOfficially established in 2007, the FedEx Cup is a season-long points competition (called FedEx Cup points) offering bonus money for the top PGA TOUR Players. Players aim to become the FedEx Cup Champion, which distinguishes the one player who not only performs well during the FedEx Cup Regular Season, but also excels through the pressure of the FedEx Cup Playoffs. Previous FedEx Cup champions include Tiger Woods, Vijay Singh, Jim Furyk, Bill Haas, Brandt Snedeker, Henrik Stenson, Billy Horschel, Jordan Spieth, Rory McIlroy, Justin Thomas, Justin Rose, and Dustin Johnson.\n\nThe 2020-21 FedEx Cup Regular Season featured 47 official FedEx Cup events that began with the 2020 Safeway Open and ran through the 2021 Wyndham Championship. PGA TOUR members earn FedEx Cup points based on their finish at each tournament, with an emphasis placed on wins and high finishes.\n\nHow FedEx Cup Points Are Distributed\n\nOfficial PGA TOUR events each award 500 FedEx Cup points to first place winners\n\nTHE PLAYERS Championship, Masters Tournament, PGA Championship, US Open Championship, and The Open Championship award 600 FedEx Cup points to first place winners\n\nEach of the four World Golf Championships events and The Genesis Invitational, Arnold Palmer Invitational presented by Mastercard, and the Memorial Tournament presented by Nationwide award 550 FedEx Cup points to first place winners\n\nAdditional events award 300 FedEx Cup points to first place winners\n\nFedEx Cup Points are awarded by finish position. Limited field events during the FedEx Cup competition will not redistribute the points for places that do not play. For example, if the Sentry Tournament of Champions has a field of 30 players, the points awarded will be based on the points that would be awarded to each individual position in a full-field event from positions 1 to 30. This will result in the points that would have otherwise been awarded from positions 31–65 in a regular event not being awarded in the tournament.\n\nAnother example is the World Golf Championships–Dell Technologies Match Play, a 64-player field. In this limited-field event, points for positions 65 and beyond would not be awarded.\n\nHow The FedEx Cup Playoffs Work\n\nAt the conclusion of the PGA TOUR season, the top 125 players in the FedEx Cup standings will be eligible to play in the FedEx Cup Playoffs, a series of three events from August through September. Points earned during the FedEx Cup Regular Season carry over to the first two Playoffs events. Players will compete in the FedEx Cup Playoffs for their share of the $60 million total in bonus money, with the FedEx Cup Champion taking home $15 million.\n\nThe FedEx Cup Playoffs feature a progressive cut, with fields of 125 for the first event (The Northern Trust), 70 for the second event (The BMW Championship), and 30 for the final event (The TOUR Championship), where the FedEx Cup Champion will be determined. In the event an eligible player is unable or chooses not to play, the field will be shortened and no alternates will be added. Points from the missing positions will not be awarded.\n\nEvent one, The Northern Trust, will cut the field to low 65 and ties after 36 holes, while the BMW Championship and TOUR Championship are no-cut events. The first two Playoffs events award 2,000 points to the winner, while the Playoffs Finale, the TOUR Championship, features a strokes-based system instituted for the first time in 2019. The player with the lowest total score will win the FedEx Cup and be credited with an official victory in the TOUR Championship competition. The FedEx Cup points leader after the first two Playoffs events will begin the TOUR Championship at 10 under par. The number 2 player will start at 8 under. The number 3 player starts at 7 under, the number 4 player starts at 6 under, and the number 5 player starts at 5 under. Players 6-10 start at 4 under, players 11-15 start at 3 under, players 16-20 start at 2 under, players 21-25 start at 1 under, and players 26-30 start at even par. At the TOUR Championship, the player with the lowest aggregate score over 72 holes when combined with his FedEx Cup Starting Strokes will win the TOUR Championship and also be crowned FedEx Cup Champion. The TOUR Championship win will be considered an official victory and the FedEx Cup Champion will also earn a bonus of $15 million and a five-year PGA TOUR exemption.\n\nFedEx Cup points are distributed to players earning official money. Only players who are PGA TOUR Members or become members during the season will be listed on the FedEx Cup Points List. Special Temporary Members and Non-Members who earn FedEx Cup points will not appear on the FedEx Cup Points List, but will be tracked on a Non-Member FedEx Cup Points List. Amateurs will not be eligible to earn FedEx Cup points.\n\nPoints won by Non-Members and Special Temporary Members who subsequently become PGA TOUR Members during the season will be counted on the FedEx Cup Points List, along with any FedEx Cup Points earned as a Non-Member (excluding those won at World Golf Championships events as a Non-Member)."}, {"url": "https://www.espn.com/golf/story/_/id/27309674/everything-need-know-revamped-fedex-cup-playoffs", "page_content": "Max Kellerman says Tiger Woods won't ever be who he once was, but his greatness will show through several times to win multiple major titles. (1:32)\n\nThe FedEx Cup Playoffs are upon us, earlier than ever, with one fewer event and far more money at stake -- and an intriguing and controversial way to end the competition.\n\nNow in its 13th year, the FedEx Cup -- which is a season-long points race that concludes with a series of playoff tournaments -- has undergone its share of changes since its inception in 2007, most notably tweaks to the points structure.\n\nBut this year brings the biggest changes yet: an early conclusion, by nearly a month, a reduction in tournaments from four to three, an increase in the bonus payout to the winner from $10 million to $15 million (and from $35 million to $60 million overall) and a big difference at the Tour Championship, which will see just one winner crowned, the overall FedEx Cup champion.\n\nThe tournaments\n\nThe playoffs begin this week at the Northern Trust at Liberty National in Jersey City, New Jersey, for the third time. The first event has typically moved around the New York area, but starting this year it will alternate between New York and the TPC of Boston -- hence the reduction from four tournaments to three. Next year the event will move to the home of the former Deutsche Bank Championship.\n\nThe BMW Championship is Aug. 15-18 at Medinah Country Club outside of Chicago. This will be the first visit to Medinah, which has a long history in the game, including the 2012 Ryder Cup won by Europe, the 2006 and 1999 PGA Championships won by Tiger Woods, and three U.S. Opens. Before becoming the BMW Championship in 2007, the event was known as the Western Open -- which was played three times at Medinah. BMW is ending its sponsorship after this year, so the PGA Tour looks to have a new one in place when the event is scheduled to be played at Olympia Fields Country Club in 2020.\n\nThe Tour Championship returns to its home at East Lake Golf Club in Atlanta, Aug. 22-25. This has been the anchor to the FedEx Cup playoffs since its inception. But unlike past years, there is no longer a possibility for two winners. The winner of the tournament (with its new strokes-based format) is the FedEx Cup champion.\n\nThe points\n\nPlayers have been earning points all season, with 500 going to the winners of regular events, 550 to the winners of World Golf Championship events and 600 to the winners of the major championships and Players Championship, with subsequent decreases through those making the cut. Players in opposite-field events earned 300 points for a victory.\n\nBrooks Koepka leads the way with 2,887 points, but a significant increase in points at the first two playoff events make his spot at the top far from secure. Instead of 500 points for a victory, the winner of a playoff event gets 2,000 points, meaning those who prevail the next two weeks will find themselves right in the mix for the overall title. (Think of a wild-card team in baseball barely making the postseason, winning its one-game playoff and now being among the final eight teams.)\n\nUnlike past years, there will be no points reset at the Tour Championship, where the new format erases the need to track points.\n\nThe qualifiers\n\nThe top 125 in FedEx points through the Wyndham Championship qualify for the Northern Trust, which will have a 36-hole cut. Only 122 are teeing it up, as Paul Casey, Henrik Stenson and Sam Burns elected not to enter. Unlike years past, where the top 100 advanced to the second playoff event, now just the top 70 advance -- as there are just three events instead of four. The top 70 after the Northern Trust qualify for the BMW Championship -- where there will be no cut -- with the top 30 then going to the Tour Championship.\n\nThe bubble boys\n\nAt 85th in the standings, Stenson had some work to do in order to qualify for the BMW, but by skipping the Northern Trust, his PGA Tour season is now complete. Jordan Spieth (at 69th) finds himself barely qualifying for the BMW and in need of a couple of good weeks to avoid missing the Tour Championship for the second consecutive year. Bubba Watson (71st) needs to at least make the cut to assure a spot at the BMW.\n\nThen there is Tiger Woods, who finds himself needing to play well in at least one of the next two events to assure himself a spot in the Tour Championship -- which he won last year. Woods, who was 13th in the points following his Masters victory, has dropped to 28th, precariously close to falling out of the top 30. That's because he's played just four times since the Masters and earned points only twice, at the Memorial (T-9) and U.S. Open (T-21). Last year, Woods mostly treaded water through the playoffs and entered the Tour Championship 20th in points.\n\nOthers of note with some work to do to get to Atlanta: Sergio Garcia (65), Ian Poulter (60), Graeme McDowell (55), Patrick Reed (50), Billy Horschel (44), Jason Day (40), Jim Furyk (39) and Phil Mickelson (34).\n\nThe Survivors\n\nZach Johnson failed to qualify for the playoffs for the first time since the series began in 2007. That means only nine are left who have made it to the playoffs each year: Mickelson, Matt Kuchar, Charley Hoffman, Charles Howell III, Ryan Moore, Brandt Snedeker, Watson, Justin Rose and Adam Scott.\n\nThe bonus pool\n\nIn addition to prize money at each of the first two events, which will have purses of $9.25 million, with $1.65 million going to the winner, there is a $60 million bonus pool at stake, up from $35 million since 2007. There will be no separate purse at the Tour Championship as it now determines the winner of the FedEx Cup and the subsequent payouts through 30 places. The winner receives $15 million, up from $10 million.\n\nSecond place earns $5 million, 10th place $830,000 and 30th place gets $395,000. The bonus payouts continue all the way through the 150th spot in the standings -- the last 25 don't even qualify for the playoffs but receive $70,000.\n\nThe Tour Championship\n\nThe biggest change to the FedEx Cup Playoffs comes at the final tournament, and it might take some getting used to. Instead of a tournament that pays a separate purse, awards prize money and points, and then subsequently determines the FedEx Cup champion, it will crown a single champion -- but based on a staggered start the tour is calling \"starting strokes.''\n\nBased on the FedEx Cup standings through the BMW Championship, the No. 1 player in points will start the Tour Championship at minus-10, with No. 2 starting at minus-8, No. 3 at minus-7, No. 4 at minus-6 and No. 5 at minus-5. Players 6-10 will be at minus-4, 11-15 at minus-3, 16-20 at minus-2, 21-25 at minus-1 and 26-30 will start at even par.\n\nSo think of the first-round leaderboard being set based on previous rounds -- or the entire season leading to that point.\n\nUnder the current points standings, Koepka would start the Tour Championship with a two-shot lead over Rory McIlroy and a three-shot advantage over Matt Kuchar. Woods, who is 27th, would begin at even par, 10 shots back.\n\nIt's like a tournament with a handicap system, although those in the best position have the advantage. The winner will be credited with an official PGA Tour victory -- even if he didn't shoot the lowest 72-hole score -- although Official World Ranking points will be determined based on the 72-hole scores.\n\nThe tour said it ran thousands of computer simulations to best approximate the difference between points and strokes heading into the Tour Championship. The thought is that following a scoreboard based on strokes under par is far easier for fans and competitors than the various points permutations that occurred previously.\n\nThe problem is obvious: A player who shoots the lowest 72-hole score could very well win nothing but a higher spot in the standings. Were this system in place last year, Tiger Woods -- who finished second overall in the FedEx Cup to Justin Rose -- would not have earned his 80th PGA Tour title."}, {"url": "https://apnews.com/article/bc4ddd5f32304c1bbdd9a54f5a3c77a5", "page_content": "ATLANTA (AP) — The losing captain — usually an American — is an easy scapegoat at the Ryder Cup. Now he at least has an accomplice.\n\nJust blame it on the FedEx Cup.\n\nFour years ago, it rained so hard at Celtic Manor in the opening session that no match got past the 10th hole and the Ryder Cup ultimately finished on Monday for the first time. During the seven-hour delay, a British golf writer demanded to speak to PGA Tour Commissioner Tim Finchem.\n\nWhy did he need Finchem?\n\n“Because of the FedEx Cup,” the writer huffed.\n\nOf course. Because of the FedEx Cup ending the last week of September, the Ryder Cup was played Oct. 1-3, which apparently is not ideal weather for Wales. Overlooked by the writer was that Ryder Cup officials held a “one year to go” celebration on the same day a year earlier and boasted of the magnificent sunshine.\n\nThe course was a mess. The competition was not. For the first time in 19 years, the Ryder Cup was decided by the final match. It was a thriller.\n\nTwo years ago at Medinah, the top brass at the PGA of America stood grimly behind the registration desk in the media center at the start of the week when they summoned a familiar face to join the conversation about what was hardly the most pressing of world issues.\n\n“What are we going to do about the FedEx Cup?” one of them said.\n\nSurely, the American players were exhausted. The entire team had played four of the previous five weeks in the FedEx Cup, and that included Brandt Snedeker, a captain’s pick who arrived at Medinah with an extra $10 million in the bank. Five players from Europe also made it all the way to the Tour Championship.\n\nSome disaster that turned out to be. The Americans raced to a 10-6 lead, only for Europe to stage a most improbable rally that featured Rory McIlroy needing a police escort to get to the tee on time, Justin Rose making a 45-foot birdie putt and Ian Poulter making everything he looked at during what now is called the “Miracle at Medinah.” For pure theater, that Ryder Cup ranks among the best ever.\n\nMaybe it’s a coincidence. Maybe it’s cyclical.\n\nBut maybe the FedEx Cup should get credit — not blame — for the Ryder Cup living up to its reputation as the most exciting three days in golf.\n\nBefore the FedEx Cup began, the matches were all but over by Sunday as Europe twice handed the Americans their worst beating ever. Since the FedEx Cup, with players competing in meaningful events leading up to the matches, the last three Ryder Cups have been decided in the final hour, if not the final few matches.\n\nU.S. captain Tom Watson was emphatic that the Americans at least had one week off before the Ryder Cup, especially for an away game that included travel and a five-hour time change. That led to four straight FedEx Cup playoff events, and visible fatigue.\n\nHaving a week off before the Ryder Cup didn’t appear to be an issue in 2010. Even in their leaking rain suits, the Americans managed to win all but one session — a huge success except that Europe went 5-0-1 in that session, which turned out to be the difference.\n\nThe same schedule was in place for 2012 — three straight FedEx Cup playoff events, a one-week break, and then the Tour Championship and Ryder Cup.\n\nWhy is that a problem? Only 30 players are at The Tour Championship — 16 of them in the Ryder Cup — and everyone sleeps in with a short field. Besides, Ryder Cup matches don’t start until Friday. Of course, it can be an exhausting week with photo sessions, a gala dinner and listening to Justin Timberlake read a poem at opening ceremonies.\n\nWatson wanted a change. The PGA Tour players on the policy board went along, and Finchem acquiesced. Without conceding it was a mistake, Finchem said it wouldn’t happen again under the same circumstances.\n\n“Our plan would be to avoid it,” he said. “We don’t like it.”\n\nFour straight weeks of high-caliber golf has put an even greater focus on fatigue.\n\nFedEx Cup champion Henrik Stenson failed to make it back to East Lake to defend his title, and he sounded relieved. “I’m in desperate need of some rest,” he said.\n\nPhil Mickelson protested four weeks in a row (even though he narrowly made it to the third event). He said on Wednesday he was rejuvenated to be back at Cherry Hills. He left Denver two days later, saying he needed to rest for the Ryder Cup. Sergio Garcia chose not to go for the 17th green with a chance to win. He blamed the decision on not being mentally sharp.\n\nIf the Ryder Cup is that big a deal, it should set its own date and have the PGA Tour build a schedule around it, just as the tour does for the Masters. Let the players decide what’s more important, or how they should prepare for each.\n\nWhen the Ryder Cup began, it was scheduled around the U.S. Open or PGA Championship in America, and The Open Championship when it was in Britain. That was when the Ryder Cup was an exhibition of golf, not an exercise in revenue."}]}