{"Emily Gielnik represented Australia at the 2015 FIFA Women's World Cup.": [{"url": "https://www.matildas.com.au/news/player-profile-emily-gielniks-lifelong-olympic-dream", "page_content": "Emily Gielnik has been to a FIFA Women’s World Cup and an AFC Women’s Asian Cup and can now finally add the Olympics to her resume.\n\nHer career is defined by perseverance and grit. Born in Melbourne, Gielnik grew up in Queensland playing a different kind of round ball sport: basketball. Injuries saw her eventually pick up football at age 12.\n\nShe played her junior football at Redlands United. Current Junior Matildas coach and Football Australia Women’s Technical Advisor Rae Dower was the Technical Director at the club when Gielnik was there.\n\nDespite making the Queensland squad for the National Championships, Gielnik didn’t make it into the Queensland Academy of Sport (QAS) team.\n\nShe would end up in the QAS team eventually, thanks to a school trip to Canberra where she took part in a Matildas training session at the AIS under then-coach Tom Sermanni.\n\n\n\nSermanni suggested Gielnik to the QAS coach at the time, Jeff Hopkins, who would go on to work with Gielnik in the W-League at Brisbane Roar and Melbourne Victory.\n\nGielnik’s domestic career mirrored that of her national team one. A strong season in orange saw her earn the ‘super sub’ tag where she helped the Roar make a grand final. Later in 2012, she made her senior national team debut against Japan at the age of 20.\n\nBut after breaking into the national team, she spent some time away from the W-League and the Matildas.\n\nShe explored passions outside football and opened a gym, working on her own fitness and helping others. Fitness is still something that interests her as she is currently undertaking a Bachelor of Exercise Science alongside club and country teammate Clare Polkinghorne.\n\nGielnik worked hard to get back onto the national team radar. While she didn’t make the squad for the FIFA Women’s World Cup in Canada, she was a part of the team which qualified for the Rio Olympics the following year.\n\n\n\nThe forward scored her first national team goal in that tournament in a 9-0 win over Vietnam.\n\nHowever, with plenty of talent and a small squad, Gielnik didn’t make the final cut. Instead, she travelled as an alternate player.\n\nAt the time, Gielnik said her omission left her genuinely heartbroken and described it as the biggest emotional toll football had ever taken on her.\n\nFollowing on from being so close to selection, Gielnik moved to Norway before linking back up with Jeff Hopkins, this time at Melbourne Victory in the W-League.\n\nA ‘feel good, play well’ kind of player, Gielnik returned to the national team fold and began to cement herself in the team, adding more goals to her tally.\n\nShe was selected to go to Jordan in 2018 for the AFC Women’s Asian Cup and to France in 2019 where she played in three of Australia’s four matches.\n\nA move to German giants Bayern Munich saw her learn plenty about herself but she returned to Scandinavia and the W-League once again.\n\n\n\nA scintillating 2020-21 season with Brisbane Roar saw Gielnik take home the golden boot before she signed for Vittsjö in Sweden. With 10 goals in 42 games for her country, the determined and dedicated Gielnik is inching ever close to half a century of caps.\n\nA strong presence with the ability to play on the wing and more centrally, Gielnik is an invaluable asset to the Matildas in Tokyo."}, {"url": "https://beyond90.com.au/part-i-the-making-of-emily-gielnik/", "page_content": "If there was ever a moment that encapsulates the evolution of Emily Gielnik, it was a superb strike against Korea Republic in the 2019 Cup of Nations.\n\nDeep in the match, the 26 year old drifted in from the left wing, sized up the full back, cut inside and rifled a strike at the near post.\n\nIt was a strike of a player full of confidence and at the height of her powers.\n\nGielnik has become a hot topic of conversation for women’s football fans of late, with her newly-commanding presence on the pitch leaving those new to the game wondering where this prolific forward came from.\n\nHer story is one of resilience, grit and determination. One of being knocked down and finding your steel.\n\nMaking choices\n\nIt was not a forgone conclusion that Gielnik would end up in football. Like many Matildas, Gielnik was a naturally gifted athlete from a young age with a penchant towards competing with the best.\n\nA basketballer to begin with, it was a serendipitous intervention from her mother that led to her finding a ball at her feet.\n\n“I was one of those kids who could play any sport, I was very competitive and would play basketball and rugby against the boys,” Gielnik said.\n\n“Mum would stress about me getting injured, so as a compromise, I convinced her to let me play football instead and that’s where my journey started.”\n\nGielnik realised early on that she had a knack for scoring goals – it would be a theme of her career.\n\n“In the early days, I was never about the discipline or the skill of football, I just played for fun and would score from anywhere and everywhere.”\n\n“I actually scored 62 goals the first school season I played and most of them were toe punts because I’d never had a coach to teach me that technique back then.”\n\nOnce she received the proper coaching her transition to the beautiful game was seamless. Soon the Queenslander would be impressing those around her, resulting in her selection for U12s State Team.\n\n“When I first started playing in a proper team, I had a world of confidence,” she remembered.\n\n“I was in my prime. I wasn’t the most skilled player, but I had the speed, agility and competitiveness that helped me pick things up really quickly.”\n\nThis natural athletic ability would continue to guide her to success.\n\nTaking the long road\n\nCheryl Salisbury, Diane Alagich, Joey Peters, Heather Garriock – they are some of the luminaries of Australian women’s football.\n\nAnd in 2007 in Coffs Harbour, they were preparing for what would be a history making FIFA Women’s World Cup campaign in China.\n\nWatching on was a young Emily Gielnik and what she saw on that day changed the trajectory of her life.\n\n“As soon as I saw the Matildas play in Coffs Harbour when I was 14, I knew I wanted to make the team one day,” Gielnik said.\n\nAlthough the decision was made in her young mind, Gielnik’s pathway to elite football was not going to be easy, nor conventional.\n\nShe learnt early on, that she was going to have to make the journey her own.\n\n“That year [2007] was really tough for me as I’d had some bad injuries and missed out on selection. So I took a year off, which was really make or break for me.”\n\n“A lot of my friends received invitations from the Queensland Academy of Sport (QAS) but having that year off combined with some injuries meant I didn’t make it.\n\n“All I wanted was to play in the Young Matildas and the W-League. I saw everyone get ahead of me, which was tough, but it didn’t deter me, it motivated me to find another way.”\n\nWhile it felt like doors were closing around the young footballer, in another fortuitous moment, a door opened up for Gielnik. And again, it involved the Matildas.\n\n“After I missed out on QAS, I went on a school tour to the Australian Institute of Sport and the Matildas just happened to be training there with Tom Sermanni. My school coach asked if I could join in and I had an absolute blinder,” Gielnik recalled.\n\n“I was 15, totally intimidated and playing against the best female footballers in the country, but Tom called my coach afterwards wanting to get me into the QAS program and that was where I found my way in.”\n\nMastering the art of resilience\n\nBeing a part of the QAS program opened new avenues for Gielnik.\n\nThat same year she also achieved another one of her goals by making the Brisbane Roar squad for the inaugural W-League season in 2008.\n\nCoached by Jeff Hopkins, it was a Brisbane Roar team littered with some of the greats of Australian women’s football in Kate McShea and future stars including Clare Polkinghorne, Tameka Butt and Elise Kellond-Knight-Knight.\n\nAgain, the progress was tempered by a setback, The 16 year old was sidelined for the entire season after sustaining a stress fracture to her ankle.\n\nNot for the first time in her young career, Gielnik would have to call on her resilience. Gielnik didn’t have time to grieve, as her eyes were firmly set on recovering and proving herself to her teammates and to herself.\n\n“When I first made the Brisbane Roar squad, I was so nervous and more than anything I just wanted to gain the respect of the older players,” she shared.\n\n“It took me a long time to believe I deserved to be there. I was disciplined and just spent the first few seasons earning my spot and spending a lot of time in the grandstands and on the bench.”\n\nGielnik believes it was a change in mindset that led to her performance improving and earning her moniker, the ‘super sub.’\n\n“After years of injury, missing out on squads and spending finals in the grandstands, I finally got my chance in the 2011/12 season.”\n\n“I was subbed on in extra time and in that season scored 12 goals, all while only being on for five or 10 minutes.\n\n“It wasn’t until I started to believe in myself and prove my worth, that everything came together.”\n\nHer form continued and Gielnik ticked another goal off her list, making the Young Matildas squad.\n\nDuring her junior national team debut at the AFC U19 Women’s Championships, the then 19-year-old took the Young Matildas from a 3-1 deficit to a 4-3 win, when she scored an incredible hattrick in the second half.\n\n“During that game, I really felt like I hadn’t played a good first half of football,” she said of her first match as a Young Matilda.\n\n“We were down 1-0 and I was panicking. I thought to myself, ‘I’m going to be subbed off on my debut,’ but then I scored that first goal which gave me so much confidence and I just kept scoring.”\n\n“That game was a real turning point in my career and one of my key memories in the green and gold.”\n\n“For the first time I felt like I belonged and deserved to be in that team. It showed me that even though you may have some bad minutes or a bad half there is always a way to turn it around.”\n\nAnd turn it around she did, making her debut for the senior Matildas the following year in Japan.\n\n“It was so overwhelming because there were so many girls in that team I had idolised and never truly believed I would be up there with,” Gielnik recounted of her Matildas debut.\n\n“Instead of looking up to them as a fan, I was now competing for their position which was pretty surreal.\n\n“It came to a point where I had to see myself as an equal and understand that I had a job to do in representing my country.\n\n“Instead of thinking about how lucky I was, I had to embrace that this was now my reality.”\n\nThe 14 year old who had watched her heroes years before was now playing alongside them in the jersey she dreamed to pull on.\n\nPART II: The making of Emily Gielnik will be published on 17 March\n\nRelated Images:"}, {"url": "https://thewomensgame.com/news/third-times-the-charm-for-gielnik-525158", "page_content": "Gielnik made her Matildas debut in 2012 when she was 20 but with Australia's strong attacking prowess which featured the likes of Sam Kerr, Kyah Simon, Caitlin Foord and Lisa De Vanna, it was hard to get a foothold in the squad.\n\nShe missed out on the 2015 World Cup squad after changes to the coaching staff but a determine Gielnik wasn't going to give up.\n\nIn 2016 she found herself back in the green and gold after a superb season for her then club Brisbane Roar put her on Alen Stajcic's map for the Matildas Olympic qualifying squad.\n\nThe Matildas would go on to be undefeated in the qualification tournament while Gielnik also scored a goal.\n\nHowever, it was a heartbreaking moment when Gielnik just missed out on the Rio Olympics squad.\n\n\"I think the biggest challenge by far that stood out to me the most was shyly missing out of on the Olympics, just missed out by one there,\" she said.\n\n\"I think that was the most devastation I've felt in my career.\n\n\"I knew that feeling and I never wanted to have it again so I think that left a big desire in my heart.\"\n\n\"I am crying, but it's a good cry!\"\n\n\n\nWatch the moment @EGielnik found out she made the squad for France 🇫🇷 pic.twitter.com/jgKHYx3cIl — Westfield Matildas (@TheMatildas) May 14, 2019\n\nThe 27-year-old has been flourishing in the Matildas and has been a regular member of the team since missing out on that Olympic team.\n\nHowever, since her return to Melbourne, there has been more confidence in her playing ability.\n\nGielnik played a major role in Victory lifting the Premiership in the past W-League season with her pace and eye for goal."}, {"url": "https://www.foxsports.com.au/football/w-league/emily-gielniks-move-to-melbourne-victory-is-paying-off-as-the-matilda-looks-to-lock-in-a-world-cup-spot/news-story/4ed1095158941733f24e097ec4ca275b", "page_content": "Emily Gielnik had a decision to make.\n\nLess than a year out from the Women’s World Cup, the dynamic winger had two options: stay at W-League powerhouse Brisbane Roar, the club she’d joined as a teenager — or take on a new challenge.\n\nThe latter option was joining her former Roar manager Jeff Hopkins at Melbourne Victory — a club trying to return from three years in the finals wilderness.\n\nWith the pain of missing out on the Matildas’ 2015 World Cup and 2016 Olympics squads still burning fiercely, Gielnik turned her back on the comfort of home and threw herself headlong into a move interstate.\n\n“Well to be honest, Jeff has asked me (to come to Victory) the last couple of years and it wasn’t until this year I made the move,” Gielnik told foxsports.com.au.\n\n“I think I personally needed a bit of a challenge, a change of environment, just being around a different diverse of players and I just really needed to challenge myself in football.\n\n“So I really feel like I just needed something new to be honest, I just didn’t want to become stagnant and be at the same place for such a long time.\n\n“But my loyalty was really, really important to me. If I could’ve, I would’ve stayed at Brisbane for the rest of my life, the rest of my football career.\n\n“But I really think that looking at the bigger picture in terms of the World Cup, this was a really critical move for me and … when I made the decision, it wasn’t overnight it was weeks and weeks and it was an emotional one.\n\n“So it was a really calculated decision and I think so far for me, it’s proven to be a good one.”\n\nEmily Gielnik and Laura Alleway celebrate (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\nSix weeks into the W-League season, Gielnik is reaping the rewards of her bold move.\n\nVictory is sitting pretty, undefeated and outright top of the table, with the winger nominated for the PFA’s recent W-League player of the month award.\n\nIn her five appearances for Victory, Gielnik has scored one goal, assisted one, made 10 key passes, created 11 chances and provided 23 crosses.\n\nShe’s also combined beautifully with captain Natasha Dowie and star playmaker Christine Nairn, with the trio comprising one of the W-League’s most intimidating attacks.\n\n“I think if you look at it in the perspective of a couple of weeks, it feels really good, obviously because of where we are as a team and everything,” Gielnik said.\n\n“And me personally, I’ve already felt a lot of improvement. Most importantly, it’s just in my happiness and my mentality more than anything and I’ve got a really good support network in terms of leaving home as well.\n\n“And obviously the staff here is great and obviously Jeff has the best intentions for me, so they’re really going above and beyond to try and cater for everything that I need football-wise. So that was really important to me in the lead up to making that decision to play for Victory.\n\n“But obviously I already feel a really good shift and a good change for me so far but I think there’s still over half a season to go and much more improvement that I’m longing for, definitely, with the World Cup being obviously in my sights but the team being the priority of course at the moment.”\n\nEmily Gielnik. (AAP Image/Julian Smith) Source: AAP\n\nIf moving states was one sacrifice that’s paid off, then Gielnik’s other big call was at least as significant.\n\nThe Matilda recently made the decision to end the lease on the gym she’s owned and run for several years — and admits pulling the pin on that ambition to focus solely on her football has lifted a weight off her shoulders.\n\n“To cut a long story short — I honestly just feel like things in my life are going good and I have such a great support network and I have really, really good friends and I started to really put football first,” Gielnik said.\n\n“My gym actually, ShredEm Fitness, that had been a lifelong dream for me that I opened before I was in the Matildas, I’ve actually just ended the lease there and decided to put all my focus into football. So that was a big thing for me.\n\n“Purely because football is not forever and that dream job is something I can always come back to, no matter the age. So I really just want to — after years and years of sacrifice to football, I thought this was really the ultimate thing to do just to give it everything that I’ve got and enjoy every single challenge and experience because I’m obviously lucky enough to have the opportunity to be a contracted Matilda at the moment.\n\n“So I weighed up some options and it’s not that I didn’t take it (football) seriously before, it’s just more that I’ve really made it a massive part of my life, which it has been for a long time.\n\n“And so I think I’ve been a lot happier and a lot more focused and I’ve really dedicated a lot of my time to it off the field as well now, more from a mental aspect and keeping myself in good condition and in other parts of fitness to make sure that I’m physically good on the park.”\n\nEmily Gielnik. (AAP Image/David Crosling) Source: AAP\n\nThis week Gielnik is set to face Brisbane for the first time since her move.\n\nWhile the winger admits she’s trying not to think about the experience of facing her old club, in front of her family and friends, there are understandably some nerves.\n\nThat said, she’s had plenty of people to lean on, with fellow ex-Roar players Angie Beard, Laura Alleway and Casey Dumont among the teammates she has at Victory.\n\nGielnik has also thrived under Hopkins, with the Victory manager a tough, but supportive leader, and it’s clear the winger is enjoying her time in Melbourne.\n\nWhile Gielnik came into a team that had struggled in recent years, it was also a club that had locked in a solid base of quality experienced and young players.\n\nThe Victory recruit highlights the culture and attitude of the group, along with the quality of the likes of Nairn and Dowie, as key reasons behind her renewed happiness and love of the game.\n\nEmily Gielnik celebrates with Christine Nairn. (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\n“I think we’re strong all over the park and I’m not just talking performance-wise and physically and in terms of football — I’m talking in terms of team culture and the positivity and we’ve got massive, massive depth within our team,” Gielnik said.\n\n“And I think that’s been almost the glue and something that’s been really critical this season that was really important to me ... so it’s really enjoyable and to be honest I’m really enjoying football.\n\n“And I think players say this a lot of times, like they say they enjoy football and sometimes you can have ups and downs and football’s not (fun) all the time but I think I’ve actually started to — apart from when I was a kid — have fun with it again.”\n\nGielnik is certainly playing like someone enjoying her football.\n\nThe Matilda has been in fine form for both club and country, recently showcasing her ability to have an impact off the bench with a tremendous goal against Chile in Newcastle.\n\nAustralia celebrate a goal from Emily Gielnik. (Photo by Ashley Feder/Getty Images) Source: Getty Images\n\nGielnik’s steely resolve before and during games is hard to miss, and while she’s enjoying her football, there is a clear drive behind her relentless approach.\n\nAs a 23-year-old, Gielnik missed out on the 2015 Women’s World Cup squad — having been cut by former coach Hesterine de Reus, before Alen Stajcic took over.\n\nThen, a year later, she missed out on the Olympics by one spot.\n\nNow 26, and a bona fide star of the W-League, Gielnik is clearly determined not to experience that disappointment again.\n\n“It’s a tough one because now things have been going well for the Matildas and stuff but at the end of the day I’ve never been to a World Cup or an Olympics,” Gielnik said.\n\n“I’ve missed out shyly of the Olympics by one spot and I was training with that team during the Olympic qualifiers and everything and to pull up short and to be cut from the World Cup (hurt) and this is the opportunity of a lifetime now and I most definitely don’t want anything distracting me (and) I don’t want to waste it.\n\n“So I’m really making sure I don’t lose focus on it and I give myself the best opportunity but I don’t lose myself as well while I’m doing that.\n\n“So yeah, it’s a big dream of mine and it would be a goal — a life goal to be achieved to be honest — and I think W-League’s the platform for that, without putting too much pressure on myself.\n\n“But it really is a platform for it and obviously a good opportunity for other players on a larger scale as well.”"}, {"url": "https://beyond90.com.au/part-ii-the-making-of-emily-gielnik/", "page_content": "Emily Gielnik’s road to the national team from a 14 year old in the stands to a 20 year old Matildas debutante was the prologue.\n\nThe main feature would begin once she reached her dream. It also meant that reality would hit quickly and often as she moved in and out of the national team program.\n\n“My first couple of years in the Matildas, I had some big ups and some really big downs,” she shared.\n\n“I was just very inconsistent. I lost that sense of self-belief and I questioned whether or not I belonged in the team anymore.”\n\nLike many women’s footballers in the Australian system, Gielnik was juggling working and football. Unlike many others, Gielnik had decided go out on her own by creating a small fitness business, Shred Em fitness.\n\nStarted in her garage, it quickly grew to become a thriving business that kept the young entrepreneur occupied.\n\nHowever, the success off the field began to impact Gielnik’s success on it.\n\n“At one stage, Staj (Alen Stajcic) left me out of a tournament against China, which was actually the best thing for me. He had every right to do that because I didn’t believe I was worthy of being there,” she remembered.\n\n“I wasn’t training or performing the way I should’ve been and representing your country is a performance-based privilege.”\n\n“It served as a good chance for me to consider if and how I could come back from that. I was in and out of the squad for a couple of years and was juggling my personal training business, Shred Em, and was just not choosing football, so I had to make a tough decision.”\n\nGielnik made the call and put her business aspirations on hold to fully commit to football.\n\n“If you want to be at the top level you need to make those changes and really live at the top level, there is no 50/50 you are either all in or all out,” she said.\n\n“So in the end I gave up Shred Em, which I loved, but once I fully committed and just indulged myself into living and breathing the game, that’s when everything changed.\n\nhttps://www.instagram.com/p/BreDwIXB7bS/\n\nRe-finding focus\n\nDespite her re-commitment to the football, Gielnik found her form just a little too late ahead of the 2015 World Cup.\n\nWhile there were big changes occurring for the 24 year old off the pitch, there were more subtle but no less career altering changes occurring on the pitch.\n\nAt six feet, Emily Gielnik cuts a commanding figure on the football pitch. As a striker, there is the inclination to play her in the traditional centre forward role to utilise her height and strength.\n\nThat number 9 role was basis of her early success and selection in the Matildas. The problem with pigeon holing the forward into that traditional mindset is that it didn’t utilise all of Gielnik’s attributes.\n\nAs well as her height, Gielnik has always possessed deceptive pace. Running Shred Em Fitness and practicing what she was preaching saw her increase her aerobic capacity and become a more honed athlete. Along with her fitness work, she was also refining her football skills and touch and developing her final ball.\n\nSpeed, stamina, dribbling, crossing and goal scoring; Emily Gielnik was no longer a centre forward, she was a now built to be a winger. And out wide she went.\n\nA familiar theme\n\nBy the time 2016 Rio Olympic Games qualification came around in February 2016, the 24-year-old was back to feeling like she belonged.\n\n“I really got back into it after the World Cup, I was playing good football. I was happy and Alen brought me back into the squad.”\n\nThe Matildas had a barnstorming run to qualify for Rio. They finished the qualifiers undefeated, on top of the standings and, for the first time, the number one ranked team in Asia.\n\nRight in the thick of the action was Emily Gielnik, in her new role out wide.\n\n“We went to the Olympic qualifiers and did really well, it was the first time I’d felt good in a long time. My coach was positive and I was in the best physical condition I’d ever been in.”\n\nWhat followed next was six months of intense preparation for the chance at realising another lifetime dream – becoming an Olympian.\n\nScoring goals, playing her best football, with her confidence at an all-time high and her body in peak condition, Gielnik wasn’t prepared for what was to come.\n\n“I had that dreaded meeting where I was told I was the first player on standby for the Rio Olympics and had missed out by one spot,” she remembered.\n\n“That wasn’t just a tournament I was missing out on, the Olympics are so special and so prestigious, every kid dreams of being an Olympian one day, so to miss out was completely devastating.\n\n“That was the biggest emotional toll football has ever taken on me. I was genuinely heartbroken.”\n\nMoving forward, again\n\nAfter all the sporting adversity, the blow of missing out on the Olympic Games could have been the final straw for Gielnik.\n\nWhen asked if she considered throwing in the towel she said, “Not for a second.” In fact, it spurred the Queenslander on once again.\n\n“From that point on, I chose to never feel that again. I wanted to be in a position where, ‘No, you’re not coming,’ wasn’t an option anymore.”\n\nThe tenacious forward carried on with this mindset and into the 2017 Algarve Cup.\n\nThe tournament proved to be another breakthrough moment where she reminded naysayers why she deserved to be in the squad.\n\nScoring three goals during the Matildas campaign, the 2017 Algarve Cup was a tournament where Gielnik used everything in her arsenal to demonstrate why she is an imposing figure for full backs to contend with.\n\nWhile an ankle injury ruled Gielnik out of the 2018 Algarve Cup, by the time the AFC Women’s Asian Cup around, the winger was ready for her first major senior international tournament.\n\nGielnik played in three of Australia’s matches helping the Matildas qualify for the 2019 FIFA Women’s World Cup.\n\nVictorious mentality\n\nThe months following the 2018 AFC Women’s Asian Cup have been Emily Gielnik’s best yet.\n\nFootball was again the focus when the 26 year old moved her life from Brisbane to Melbourne to play for the Melbourne Victory.\n\nIt also saw a reunion with Jeff Hopkins, her first senior coach at Brisbane Roar. The result was a stellar season with her four goals and two assists helping her new side transform from two-time wooden spoon winners, to 2018/19 W-League Premiers.\n\nIt’s clear that although her athletic abilities are considerable, Emily Gielnik’s path to a Matildas regular is really a story about mindset.\n\nAs every inspirational sports instagram quote will tell you, sport is about mentality.\n\nWhen asked where her upbeat outlook and mental toughness comes from, Gielnik says it was something she needed to learn.\n\n“I was always my harshest critic and put so much pressure and expectation on myself,” she said.\n\n“I had to learn to take a step back and just enjoy the game without worrying what others think about me or how I should play.”\n\n“The shift came when I just got back to doing what’s natural and playing my own game.\n\n“When I got back to the old me, I realised how happy that made me both within and outside of football,” she said.\n\nEmily Gielnik's brilliant Matildas form 13 November ⚽️. 28 February ⚽️. 3 March ⚽️. Emily Gielnik has three goals in her last three appearances for the Westfield Matildas! Posted by Westfield Matildas on Sunday, 3 March 2019\n\nAnd her mindset extends to beyond just herself, also wanting the best for her team as a whole.\n\n“I think I am just a positive person, towards myself and towards other players. Even if someone plays over me, I genuinely want them to do well, I want that player to feel so good and I want us to win together.\n\n“As much as I love scoring goals, I love setting others up, so they get the glory.”\n\nThe next time Emily Gielnik pulls on the green and gold jersey, there will be an inscription on the inside that reads ‘Never Say Die.’ It is fitting for the poster girl for perseverance.\n\nIf Gielnik’s evolution is any indication, her greatest feats are yet to come."}, {"url": "https://www.matildas.com.au/news/emily-gielnik-redefining-success", "page_content": "Emily Gielnik is redefining success and herself\n\nThe highs and lows of football not only define someone as football, but also as person. Westfield Matildas’ forward Emily Gielnik embodies that notion.\n\nWith the world firmly placed on pause during the period of COVID-19, restrictions have shut down the normality of life around the globe.\n\nBeing in lockdown with your thoughts to keep you company can be in equal parts challenging and invigorating. For Emily Gielnik, isolation has been a time for reflection and consideration.\n\n“I saw the light; you communicate more and you get to look at life from a different perspective,” she said from her apartment in Munich, Germany.\n\n“I was actually feeling quite fortunate. Even though football is my job, my career, my life and it’s hard to go from doing what you love to not be doing it at all, but watching the news really put things into perspective for me.”\n\nA TIME OF REFLECTION\n\nAfter returning from the AFC Women’s Olympic Qualifiers, Emily Gielnik and her Bayern Munich teammates soon found themselves returning to their homes as COVID-19 restrictions came into effect in Germany.\n\nFor the 28-year-old, the restrictions occurred at a fortuitous time with both her mum and partner on hand to ride out the opening weeks.\n\n“It was nice to have her [Mum] here,” Gielnik said.\n\n“[We were] just sharing some good quality time. There was definitely a lot of laughs and a lot of cooking happening!”\n\n\n\nAfter years of intermittent separation, the time mother and daughter spent together away from reality was a blessing.\n\n“When you go over to their [her parents] house and you see them on the weekend, it’s so rushed and you're not really there. You're replying to people and on social media. I feel like she was here, and I was actually engaging.”\n\n“If we hadn’t been in quarantine, it would have been a lot different if she was here. I was at full time training and I would have only seen her a little bit in the morning and a little bit in the afternoon.”\n\nFATHER & FRIEND\n\nEmily Gielnik admits that her life story is much like her football story; a tale of a late bloomer.\n\nUnlike many of her peers, with basketball and rugby being her first loves, Gielnik didn’t playing football until the age of twelve. Even then, it was after much encouragement on the part of the teenager to coax her parents to let her take to the pitch.\n\n“It took a lot of persuading in terms of my Mum and her letting me play soccer because she thought it's such high injury sport - although I played rugby against boys so I can't comprehend it,” she laughed.\n\nGielnik made the switch from rugby to football and never looked back (Supplied: Emily Gielnik)\n\nWhile her Mum may have been apprehensive about those first steps, Gielnik’s Dad was right beside her every step of the way.\n\n“I had that Dad that was always taking me to every sporting event possible,” she remembered fondly.\n\n“He would watch all my basketball games; all my football games and he was without a doubt that man that is running up and down the sidelines of the game and yelling at you to stop watching the play.”\n\nGielnik credits her father’s patience and support for pushing her to the next level. Criticism, no matter how constructive, can be a difficult to take on as a teenager. Looking back with the time and distance, Gielnik has no doubt his influence shaped her into the player she needed to be in order become a professional player.\n\n“I always wanted to be pro one day,” she said “I didn't grow up with this those skills or that coaching, I just had my Dad,”\n\n“I think he could sense that I wanted to get there so then he was criticising me, maybe at times he was criticising me too tough.”\n\nHe just wanted to make me better because maybe he could see that I could make it to the top and he knew I could be good.”\n\nAt the age of 15, Gielnik made the Queensland squad for the National Championships at Coffs Harbour but as her friends and teammates made their way into the Queensland Academy of Sport, Gielnik never received a letter.\n\nOpportunities can pop up in the strangest of places and while on a school trip where she visited the Australian Institute of Sport, Gielnik got her chance to train with the Westfield Matildas. Her letter from QAS came shortly after.\n\nThat finally put Gielnik on the path she had wanted for so long. A season with the QAS resulted in the striker earning a contract the following year with a star studded Brisbane Roar outfit.\n\nGielnik settling into the Matildas (Photo Credit: Rachel Bach / By the White Line)\n\nAfter a successful 2011/12 season with Roar, where she earned the moniker of ‘super sub’, Gielnik finally earned a call up to the Westfield Matildas.\n\nHer first appearance for the Westfield Matildas came in Japan in 2012. While it might have been an ocean away, her father wasn’t far away from her thoughts. These days he is a fixture Westfield Matildas home matches and proudly boasts the number 15.\n\n“He wears that jersey with pride…you can’t miss him!” Gielnik laughed.\n\n“When I’m in the starting line-up whomever is next to me is like ‘oh my god Em, that’s your Dad’.”\n\n“I'm actually playing for two people. Sometimes he lines up a shot and fully kicks like an air swing on the sideline. He's got like that as if he's kicked it. He's a part of the game, like he's a part of us.”\n\nREDEFINING SUCCESS\n\nIn a scripted Disney production, realising a dream and playing for the Westfield Matildas should have been the beginning of a long and steady stint in the senior national team.\n\nHowever, in real life, Gielnik’s ride was set to be a rollercoaster instead. That first run with the national team was followed by long periods away, and more frustrating periods of being close but not quite close enough.\n\n2015 saw her omission from the FIFA Women’s World Cup and 2016 resulted in heartbreak after being a part of the 2016 Rio Olympic Games qualification campaign.\n\nEach time, the Queenslander has dusted herself off – although it has not been without some soul searching and exploring different outlets for self fulfillment.\n\n\n\n\"After I got cut from the Olympics, I started to realise that I’ve got to do something that makes me happy now and I opened the gym [ShredEm Fitness],” she said.\n\n“Everything just went so well, and I had never been so happy so of course my football just skyrocketed.”\n\n“I was like obsessed with helping people. I was obsessed with helping someone from being so miserable and not comfortable at any other gyms and then they came and gave me a shot,” she said.\n\n“I wasn't then putting so much pressure about making the Matildas squad or proving myself that stage I was like I got this gym now I'm just going to play W- League enjoy it and love it.”\n\nOf course I was missing and craving the Matildas, but I stopped putting so much heavy pressure on myself thinking that that's all I wanted. I had the gym and so that created some happiness and some drive for me.”\n\nEventually the off the field success began to impact Gielnik’s success on it. A breakthrough 2017 Algarve Cup, a brilliant Westfield W-League season with Melbourne Victory in 2018/19 culminated in being named to her first major tournament squads for the 2018 AFC Women’s Asian Cup and FIFA Women’s World Cup 2019.\n\nFinding her confidence and goal scoring touch for the Westfield Matildas saw big clubs around the world begin to take notice of the powerful forward.\n\nAfter stints in the United States, Japan and Norway, Gielnik joined Frauen Bundesliga giants Bayern Munich.\n\n“I heard from KK and Emily (Van Egmond), and people that have played in Germany, that their regiment was just craziness,” she said.\n\n“For some reason I was longing for that environment.”\n\n\n\nMoving halfway across the world with a language barrier was a welcome challenge for Gielnik but the move has also tested her in ways that were unforeseen. It has also precipitated further introspection from a larger than life figure.\n\nWhatever the level of football, success is a personal and intimate topic. It is one that, in her quiet times, she has had to grapple with and redefine to her own satisfaction.\n\n“To put it this way, I don't personally feel like I've accomplished everything I wanted to at this club,” Gielnik said quietly.\n\n“I got to play for this club but in all fairness, I don't feel like I've been successful at this club. I haven't come here and scored a ton of goals.”\n\n“It’s really hard to overcome the feeling of failure and that's how I've actually felt here at Bayern and although I had a massive part of the team and I work hard … I don't feel as part of the success.”\n\n“The physical challenges are what I thought I was getting here, but I'm getting the mental challenge here as a footballer.”\n\nOn her own personal football journey, Bayern has proved to be one of the biggest challenges and the most instructive.\n\nGielnik’s time in Germany over the last year has become her greatest learning experience, demonstrating that perseverance and determination aren’t easily earned traits.\n\n“I could have left on several occasions and I had offers in the transfer window to great clubs, but I thought about it and you know that’s just not me.”\n\nLeaving and giving up and quitting it wasn’t me. I still wanted the opportunity to turn it around and see the light and to make the best of it and that's just like a part of my personality.”\n\n“The success, I will say, is that I came here as a player that the coach wanted. He wanted me because I was that different player but then wanted me to adjust adapt to the German style football and that's not in me.”\n\n“I had to stay true to myself.”\n\nEmily Gielnik is not sure what her next move will be. What is certain that wherever she goes she will once again be better equipped to face it.\n\nAfter all, they do say good things come to those who are wait – or a late bloomers."}, {"url": "https://www.olympics.com.au/olympians/emily-gielnik/", "page_content": "Fast Facts\n\nSport: Football\n\nEvent: Women's\n\nOlympic History: Tokyo 2020\n\nCoach: Tony Gustavsson\n\nYear Born: 1992\n\nState Born: Victoria\n\nAbout Emily\n\nEmily Gielnik had an Australian U19s debut for the ages, scoring a hat-trick on debut in October 2011.\n\nLess than 12 months later she received her first selection to the Matildas, appearing in a 3-0 defeat against Japan in July 2012 friendly.\n\nEmily was named in the Matildas Olympic qualifying squad for Rio 2016 and scored a goal against Vietnam, however wasn’t named in the final team for the Olympics.\n\nShe appeared in all three matches for Australia at the 2018 Asian Cup. The Matildas finished the tournament runners up to Japan after a tight 1-0 contest in the final.\n\nThe following year saw Emily’s international form rewarded with selection to the 2019 World Cup squad. In France, she appeared in three matches for Australia, with two of them as a starter.\n\nAt Tokyo 2020 Emily and the Matildas made all of Australia proud in putting together a historic achievement.\n\nTheir fourth place finish, which was nearly a podium finish after a 4-3 loss to the USA in the bronze medal game, is the highest ever finish by the Matildas at an Olympic Games.\n\nWith a W-League Premiership and Championship to her name, she has also amassed more than 50 caps for the Matildas and plays for Aston Villa."}, {"url": "https://footballqueensland.com.au/2019/05/28/emily-gielniks-journey-from-queensland-to-her-first-world-cup/", "page_content": "In football there are stories of disappointment but there are also the ones of triumph and dedication, where players fight tooth and nail to get their chance. Westfield Matildas forward Emily Gielnik is one of those stories.\n\n\n\nIt wasn’t until the age of 12 that Gielnik started playing football, after injuries in basketball convinced her parents to encourage her to give a different round ball game a go.\n\nPlaying most of her junior football with Redlands United FC, Gielnik worked under the guidance of current Junior Matildas coach Rae Dower, who was Technical Director at the Cleveland-based club at the time.\n\n“Rae coming up was good for my development; she more or less gave me the confidence to be free as a player, take players on and score goals,” Gielnik said.\n\n“It’s what made me become more of a goal scorer so most definitely she had impact when I was younger and obviously as I got older and matured as a player there are a lot of other coaches and people.”\n\nIn her first season of playing, the Melbourne-born attacker made the Queensland squad for the National Championships at Coffs Harbour however, at the age of 15 with teammates and friends making the Queensland Academy of Sport (QAS) team, Gielnik didn’t receive a letter.\n\nIt was a disappointing moment for the teenager.\n\nHowever, opportunities pop up in the strangest of ways and it was while on a school trip to Canberra when she visited the Australian Institute of Sport (AIS), that an unbelievable chance came about.\n\nThe Matildas were training at the AIS with then Head Coach Tom Sermanni when Gielnik’s sports teacher asked him if she could join the training session.\n\n“I must have trained out of my skin even though I was so intimidated because it was all the best players in Australia, and all the really old-school Matildas were there,” she said.\n\n“Tom Sermanni asked me to come back the next day and I played a training match with the Matildas.”\n\nImpressed with Gielnik, Sermanni called Jeff Hopkins who was heading up the women’s football program at QAS and recommended he get her into the program.\n\n“That’s kind of how my journey kicked off,” Gielnik said.\n\nShe played a whole season with the QAS before earning a contract the following year with Brisbane Roar, however an injury would keep her sidelined for the whole 2009 Westfield W-League season.\n\nIt wasn’t until the following season at 18 that she made her debut.\n\nGielnik had to work incredibly hard to get her Westfield W-League opportunity and even in her first two seasons with the club she wouldn’t see much game time with 15 of her 19 appearances coming from the bench.\n\nHowever, after a successful 2011-12 season with Roar, where she was dubbed the ‘super sub’ for her ability to score goals as a substitute, Gielnik earnt a call up to the Westfield Matildas.\n\nIt was a tough squad to break into at the time, particularly being a striker, with the likes of Sam Kerr, Lisa De Vanna and Kyah Simon just some of the players who had cemented spots in the national team.\n\nAfter making several appearances, Gielnik spent a couple of years away from the national team but fought her way back into Westfield Matildas fold for the 2016 Olympic qualification campaign.\n\nHowever, there was heartbreak when she just missed out on going to the Rio Olympics.\n\n“It’s disheartening to be out of the squad but once you are it makes you realise how hungry you are to get back in,” Gielnik said.\n\nAlways one to work hard, she continued to keep pushing and made the decision to leave Roar for Melbourne Victory ahead of the 2018-19 Westfield W-League season to reach new heights as a player.\n\nAll her hard work paid off when Gielnik got the phone call that she was selected in the Westfield Matildas FIFA Women’s World Cup squad for the France tournament this year.\n\nIt was an emotional moment for the 27-year-old, who cried after hearing the news.\n\n“I can’t really put a word on it to be honest,” Gielnik said.\n\n“It’s more a sense of relief and satisfaction in a way with the build-up and how everything has come together.\n\n“I know I spoke about it in W-League and how desperate I was to make this one so it was more the relief of what I had done had been recognised and I’ve been rewarded for it.”\n\nGielnik puts her recent selection for the national team down to perseverance and dedication.\n\n“It’s just persistence and I think that’s the key for me, the earlier I learnt that it takes more than training with the teams and that it takes dedication then that’s where you’ll be rewarded,” she said.\n\nThe Westfield Matildas are currently in Antalya, Turkey for a 10-day camp as they prepare for their opening game of the World Cup on June 9 against Italy.\n\nImage: Matt King/Getty Images"}, {"url": "https://www.matildas.com.au/news/22-emily-gielnik-i-wasnt-going-stop-until-i-got-there", "page_content": "My Westfield Matildas Story: Emily Gielnik - 'I wasn’t going to stop until I got to the World Cup'\n\nEmily Gielnik has always dreamed of running out as a Westfield Matilda at a FIFA World Cup. After having her heart broken four years ago, she is determined to make the most of her chance at France 2019.\n\nIn a series of exclusive interviews for www.matildas.com.au, we will be catching up with Ante Milicic's 23-player squad in the build-up to the World Cup. Today we hear from Emily Gielnik as she reflects on the near-misses that have stoked her desire.\n\nThe 26-year-old had just seven caps for Australia to her name when she was omitted from the FIFA Women's World Cup Canada 2015™ squad. The decision left her devastated.\n\nBy the time the Rio 2016 Olympic Games rolled around she felt she was an established member of the international set-up, and was crushed to again miss the cut.\n\nBut where others may have lost heart, that rock-bottom moment left the Melbourne Victory forward with more hunger than ever as she set her sights on France 2019.\n\nWATCH: My Westfield Matildas Story, with Sam Kerr\n\nWORLD CUP COUNTDOWN: 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15 days to go\n\nWATCH: The time is now, says record goalscorer Lisa De Vanna\n\n\n\n“I just narrowly missed out on the World Cup [in 2015]. I think that left a big desire in my heart,” said Gielnik, who reminded Westfield Matildas fans of her quality when she rifled home an unstoppable shot against Korea Republic in the Cup of Nations in March.\n\nWATCH: Emily Gielnik smashes home a stunner against Korea Republic\n\n“I was involved in the Olympic qualifiers [for 2016] and I just missed out by one there. That was the most devastation I’ve felt within my career. I know that feeling was one I didn’t ever want to have again.\n\n“I remember when I wanted to start back in my school days, wanting to make the W-League – and that happened. And then wanting to make the young Australian team – and then that happened.\n\nWATCH: Gielnik reacts to getting her World Cup call\n\n“Being part of that professional environment, I wanted to go one step further and be at the top. I knew [going to a World Cup] was my dream for a very long time and I wasn’t going to stop until I got there.”\n\nWatch the full video at the top of this page\n\nClick below to #GetOnside for the FIFA Women's World Cup 2023™ in Australia"}, {"url": "https://int.soccerway.com/players/emily-gielnik/164110/", "page_content": "Matches of E. Gielnik\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}], "Emily Gielnik represented Australia at the 2016 Summer Olympics.": [{"url": "https://olympics.com/en/news/the-tale-of-two-matildas", "page_content": "It’s the heart-breaking phone call that no athlete wants to receive. With only 18-players able to be selected on an Olympic Football squad, Emily Gielnik missed out on making the Australian women’s football team for the Rio 2016 Games by one spot. “[It] was heart wrenching and disappointing, to say the least, I felt entirely defeated at that point, I felt like I had done what I could do, and I wasn't going,” the Matildas forward, who had also missed out on the 2015 FIFA Women’s World Cup squad a year prior, told Tokyo 2020 in April. “A very difficult time in my career to understand but moving past that was just as important for me so that's what I focussed on.” The Brisbane-born footballer knew she wanted to be an Olympian as soon as she pulled on the green and gold jersey – making her senior national debut against Japan, Tokyo in 2012. “I remember that feeling of actually watching the girls at the Olympics from my couch with my family and just how passionate and excited I was to be supporting them,” Gielnik said. “I knew that's what I wanted. I wanted to be on the on the other end of that, being a part of that. So that was more so when it really sunk in that I wanted that more than anything.” Now the 28-year-old is squarely within the mix for Tokyo 2020 selection after scoring a double against Rio 2016 gold medallist Germany in Australia’s 5-2 friendly loss last month.\n\nHowever, Gielnik wasn’t the only Matilda to miss out five years ago with Aivi Luik also named as an alternate for Rio 2016. The 36-year-old told Tokyo 2020 it would be a dream come true to represent Australia at Tokyo 2020. “To be able to go there and compete with the best in a tournament that has such history, I think it would be amazing, it would be a once in a lifetime kind of experience. And it was something that I always wanted as a kid.”\n\nThe ability to preserve Getting knocked down, facing challenges, and overcoming barriers is something both Gielnik and Luik know all too well. For Gielnik, after missing out on Rio 2016, she didn’t let her determination die, she continued to work hard and made the decision to leave her long-time club Brisbane Roar for Melbourne Victory ahead of the 2018-19 W-League season. It was a move that would pay dividends as she made Australia’s squad for the 2019 FIFA Women’s World Cup in France. “What I would put it down to, honestly, is just how I've approached every football season from then onwards leaving no stone unturned, just knowing my own body, knowing what it takes to stay at that top level and what's required of me in working alongside the clubs but also working on my own in terms of individual performance away from the football clubs,” she said of her desire to continue being her best.\" “That's really what's got to me, is just honing in on that that focus and those extra things that have that kept me in the top level and keep giving me the opportunity to come back into the Matildas squad.” Luik, who also got her start in the W-League with Brisbane Roar, had to wait a tad longer before making her World Cup debut despite making her international debut in 2010 and was part of Australia’s victorious AFC Asian Cup team that year. But throughout her career she was plagued with injuries including bilateral hamstring tendinopathy. Despite missing out on selection for both the 2011 and 2015 World Cups then Rio 2016 Olympics, the midfielder continued playing because it had been her dream to go to a World Cup. “After that second let down, I didn't really think it was going to be in the cards for me, but I continued to play,” she said.\n\nAivi Luik (2018 Getty Images)\n\nIt was in 2018, seven years after her last appearance in the green and gold, that Luik took to the pitch as a Matilda once again during their 5-0 friendly win against Thailand and after a successful season with Spanish club Levante in 2019, she was on the radar of then Matildas coach Ante Milicic for the upcoming World Cup in France. Named in the 23-player World Cup squad, it wouldn’t be until Australia’s final group game that the Perth-born player would take to the field. “I thought maybe I was going on and it didn't happen so I [was] starting to wonder if maybe it wouldn't happen but I did get that debut and it felt amazing,” she said. Australia beat Jamaica 4-1 in that match. “It was really emotional afterwards, especially to see my brother and sister in the crowd. Having them witness my dream since I was a kid was amazing. It's very hard to put into words, but it's definitely one of the highlights of my life.”\n\nTogether again after 400 days Assembling at Soest, the headquarters of the Dutch Football Federation, it was the first time since Australia had secured qualification for Tokyo 2020 in March last year during their 5-0 and 2-1 wins over Vietnam, that they were together again. And for many, it was the first time they had seen their national teammates – many have spent the last decade playing together in the green and gold – in over a year so there was excitement. “It was so good to see everyone again in camp, obviously, their familiar faces, but it's like you never left. It feels like we had we just saw them not long ago. So really exciting, really good vibes. We are one big family, and it was just so good to see everyone again,” Gielnik said ahead of the team’s first match in 400 days. With Australian-based players unable to be selected, it was up to the Matildas playing abroad to put their best foot forward in front of Tony Gustavsson, who was appointed head coach in September last year. The former United States assistant coach took the reins of Australia’s most loved national team in the New Year but due to the global pandemic hadn’t been able to meet players in person. With the playing group meeting Gustavsson for the first time, there were positive vibes around camp. “Tony has showed us the way that he believes we can play in order to get us to the next level,” Luik said of the Swedish-born coach. “That's what we all want at the end of the day and through his words, through his intensity and the belief in us, I think that's really flowed through his meetings and how he runs training sessions.” “Very good energy, good vibe and most importantly, extremely encouraging just coming in. So that really works well for me,” Gielnik said. “I think me as a player, I really respond better with someone who really believes in me and has that positive energy to want you to get on the ball. So I'm really looking forward to what he's got in store for all of us.”\n\nWelcoming the pressure From fighting for equality, recognition, and the right to play the game they love, the Matildas of today have become one of the most recognisable sport teams in Australia – and in women’s football. Following their Rio 2016 quarter-finals loss in a penalty shootout, it was at the 2017 Tournament of Nations that Australia reached new heights as they beat Japan (4-2), the United States (1-0) and Brazil (6-1) to win their first piece of silverware since the 2010 AFC Asian Cup success. Going on to win their next four matches on home soil, the following year still saw solid performances including a fourth-placed finish at the 2018 Algarve Cup and runners-up performance at the 2018 AFC Asian Cup. The 2019 FIFA Women’s World Cup left more to be desired, as they bowed out in the quarter-finals to Norway, but their qualification for Tokyo 2020 once again brought excitement. While recent 5-2 and 5-0 losses to Germany and the Netherlands brought harsh critics from Australian media – just three months out from Tokyo 2020. But the pressure to produce results is something the side welcome. “I think it's something that we enjoy and welcome with open arms, because if you're a team that is not doing well, there's no pressure on you so because we've risen through the rankings and we've got a name for ourselves, now there is that pressure but it's great,” Luik said. “It means people are following us. People want us to do well, and people expect us to do well. And I think that can actually help with results in the times when the pressure can get a little much, we've got a really good playing group and we can look for support, and also from our family and friends and our fans or some of the best in the world. And I don't say that lightly. “I think they care genuinely about our journeys and they care about our ups and downs and they really want to see us succeed.\""}, {"url": "https://www.olympics.com.au/olympians/emily-gielnik/", "page_content": "Fast Facts\n\nSport: Football\n\nEvent: Women's\n\nOlympic History: Tokyo 2020\n\nCoach: Tony Gustavsson\n\nYear Born: 1992\n\nState Born: Victoria\n\nAbout Emily\n\nEmily Gielnik had an Australian U19s debut for the ages, scoring a hat-trick on debut in October 2011.\n\nLess than 12 months later she received her first selection to the Matildas, appearing in a 3-0 defeat against Japan in July 2012 friendly.\n\nEmily was named in the Matildas Olympic qualifying squad for Rio 2016 and scored a goal against Vietnam, however wasn’t named in the final team for the Olympics.\n\nShe appeared in all three matches for Australia at the 2018 Asian Cup. The Matildas finished the tournament runners up to Japan after a tight 1-0 contest in the final.\n\nThe following year saw Emily’s international form rewarded with selection to the 2019 World Cup squad. In France, she appeared in three matches for Australia, with two of them as a starter.\n\nAt Tokyo 2020 Emily and the Matildas made all of Australia proud in putting together a historic achievement.\n\nTheir fourth place finish, which was nearly a podium finish after a 4-3 loss to the USA in the bronze medal game, is the highest ever finish by the Matildas at an Olympic Games.\n\nWith a W-League Premiership and Championship to her name, she has also amassed more than 50 caps for the Matildas and plays for Aston Villa."}, {"url": "https://olympics.com/en/athletes/emily-gielnik", "page_content": "Year of Birth\n\nYear of Birth 1992\n\nFirst Olympic Games\n\nFirst Olympic Games Tokyo 2020"}, {"url": "https://www.matildas.com.au/news/player-profile-emily-gielniks-lifelong-olympic-dream", "page_content": "Emily Gielnik has been to a FIFA Women’s World Cup and an AFC Women’s Asian Cup and can now finally add the Olympics to her resume.\n\nHer career is defined by perseverance and grit. Born in Melbourne, Gielnik grew up in Queensland playing a different kind of round ball sport: basketball. Injuries saw her eventually pick up football at age 12.\n\nShe played her junior football at Redlands United. Current Junior Matildas coach and Football Australia Women’s Technical Advisor Rae Dower was the Technical Director at the club when Gielnik was there.\n\nDespite making the Queensland squad for the National Championships, Gielnik didn’t make it into the Queensland Academy of Sport (QAS) team.\n\nShe would end up in the QAS team eventually, thanks to a school trip to Canberra where she took part in a Matildas training session at the AIS under then-coach Tom Sermanni.\n\n\n\nSermanni suggested Gielnik to the QAS coach at the time, Jeff Hopkins, who would go on to work with Gielnik in the W-League at Brisbane Roar and Melbourne Victory.\n\nGielnik’s domestic career mirrored that of her national team one. A strong season in orange saw her earn the ‘super sub’ tag where she helped the Roar make a grand final. Later in 2012, she made her senior national team debut against Japan at the age of 20.\n\nBut after breaking into the national team, she spent some time away from the W-League and the Matildas.\n\nShe explored passions outside football and opened a gym, working on her own fitness and helping others. Fitness is still something that interests her as she is currently undertaking a Bachelor of Exercise Science alongside club and country teammate Clare Polkinghorne.\n\nGielnik worked hard to get back onto the national team radar. While she didn’t make the squad for the FIFA Women’s World Cup in Canada, she was a part of the team which qualified for the Rio Olympics the following year.\n\n\n\nThe forward scored her first national team goal in that tournament in a 9-0 win over Vietnam.\n\nHowever, with plenty of talent and a small squad, Gielnik didn’t make the final cut. Instead, she travelled as an alternate player.\n\nAt the time, Gielnik said her omission left her genuinely heartbroken and described it as the biggest emotional toll football had ever taken on her.\n\nFollowing on from being so close to selection, Gielnik moved to Norway before linking back up with Jeff Hopkins, this time at Melbourne Victory in the W-League.\n\nA ‘feel good, play well’ kind of player, Gielnik returned to the national team fold and began to cement herself in the team, adding more goals to her tally.\n\nShe was selected to go to Jordan in 2018 for the AFC Women’s Asian Cup and to France in 2019 where she played in three of Australia’s four matches.\n\nA move to German giants Bayern Munich saw her learn plenty about herself but she returned to Scandinavia and the W-League once again.\n\n\n\nA scintillating 2020-21 season with Brisbane Roar saw Gielnik take home the golden boot before she signed for Vittsjö in Sweden. With 10 goals in 42 games for her country, the determined and dedicated Gielnik is inching ever close to half a century of caps.\n\nA strong presence with the ability to play on the wing and more centrally, Gielnik is an invaluable asset to the Matildas in Tokyo."}, {"url": "https://beyond90.com.au/part-ii-the-making-of-emily-gielnik/", "page_content": "Emily Gielnik’s road to the national team from a 14 year old in the stands to a 20 year old Matildas debutante was the prologue.\n\nThe main feature would begin once she reached her dream. It also meant that reality would hit quickly and often as she moved in and out of the national team program.\n\n“My first couple of years in the Matildas, I had some big ups and some really big downs,” she shared.\n\n“I was just very inconsistent. I lost that sense of self-belief and I questioned whether or not I belonged in the team anymore.”\n\nLike many women’s footballers in the Australian system, Gielnik was juggling working and football. Unlike many others, Gielnik had decided go out on her own by creating a small fitness business, Shred Em fitness.\n\nStarted in her garage, it quickly grew to become a thriving business that kept the young entrepreneur occupied.\n\nHowever, the success off the field began to impact Gielnik’s success on it.\n\n“At one stage, Staj (Alen Stajcic) left me out of a tournament against China, which was actually the best thing for me. He had every right to do that because I didn’t believe I was worthy of being there,” she remembered.\n\n“I wasn’t training or performing the way I should’ve been and representing your country is a performance-based privilege.”\n\n“It served as a good chance for me to consider if and how I could come back from that. I was in and out of the squad for a couple of years and was juggling my personal training business, Shred Em, and was just not choosing football, so I had to make a tough decision.”\n\nGielnik made the call and put her business aspirations on hold to fully commit to football.\n\n“If you want to be at the top level you need to make those changes and really live at the top level, there is no 50/50 you are either all in or all out,” she said.\n\n“So in the end I gave up Shred Em, which I loved, but once I fully committed and just indulged myself into living and breathing the game, that’s when everything changed.\n\nhttps://www.instagram.com/p/BreDwIXB7bS/\n\nRe-finding focus\n\nDespite her re-commitment to the football, Gielnik found her form just a little too late ahead of the 2015 World Cup.\n\nWhile there were big changes occurring for the 24 year old off the pitch, there were more subtle but no less career altering changes occurring on the pitch.\n\nAt six feet, Emily Gielnik cuts a commanding figure on the football pitch. As a striker, there is the inclination to play her in the traditional centre forward role to utilise her height and strength.\n\nThat number 9 role was basis of her early success and selection in the Matildas. The problem with pigeon holing the forward into that traditional mindset is that it didn’t utilise all of Gielnik’s attributes.\n\nAs well as her height, Gielnik has always possessed deceptive pace. Running Shred Em Fitness and practicing what she was preaching saw her increase her aerobic capacity and become a more honed athlete. Along with her fitness work, she was also refining her football skills and touch and developing her final ball.\n\nSpeed, stamina, dribbling, crossing and goal scoring; Emily Gielnik was no longer a centre forward, she was a now built to be a winger. And out wide she went.\n\nA familiar theme\n\nBy the time 2016 Rio Olympic Games qualification came around in February 2016, the 24-year-old was back to feeling like she belonged.\n\n“I really got back into it after the World Cup, I was playing good football. I was happy and Alen brought me back into the squad.”\n\nThe Matildas had a barnstorming run to qualify for Rio. They finished the qualifiers undefeated, on top of the standings and, for the first time, the number one ranked team in Asia.\n\nRight in the thick of the action was Emily Gielnik, in her new role out wide.\n\n“We went to the Olympic qualifiers and did really well, it was the first time I’d felt good in a long time. My coach was positive and I was in the best physical condition I’d ever been in.”\n\nWhat followed next was six months of intense preparation for the chance at realising another lifetime dream – becoming an Olympian.\n\nScoring goals, playing her best football, with her confidence at an all-time high and her body in peak condition, Gielnik wasn’t prepared for what was to come.\n\n“I had that dreaded meeting where I was told I was the first player on standby for the Rio Olympics and had missed out by one spot,” she remembered.\n\n“That wasn’t just a tournament I was missing out on, the Olympics are so special and so prestigious, every kid dreams of being an Olympian one day, so to miss out was completely devastating.\n\n“That was the biggest emotional toll football has ever taken on me. I was genuinely heartbroken.”\n\nMoving forward, again\n\nAfter all the sporting adversity, the blow of missing out on the Olympic Games could have been the final straw for Gielnik.\n\nWhen asked if she considered throwing in the towel she said, “Not for a second.” In fact, it spurred the Queenslander on once again.\n\n“From that point on, I chose to never feel that again. I wanted to be in a position where, ‘No, you’re not coming,’ wasn’t an option anymore.”\n\nThe tenacious forward carried on with this mindset and into the 2017 Algarve Cup.\n\nThe tournament proved to be another breakthrough moment where she reminded naysayers why she deserved to be in the squad.\n\nScoring three goals during the Matildas campaign, the 2017 Algarve Cup was a tournament where Gielnik used everything in her arsenal to demonstrate why she is an imposing figure for full backs to contend with.\n\nWhile an ankle injury ruled Gielnik out of the 2018 Algarve Cup, by the time the AFC Women’s Asian Cup around, the winger was ready for her first major senior international tournament.\n\nGielnik played in three of Australia’s matches helping the Matildas qualify for the 2019 FIFA Women’s World Cup.\n\nVictorious mentality\n\nThe months following the 2018 AFC Women’s Asian Cup have been Emily Gielnik’s best yet.\n\nFootball was again the focus when the 26 year old moved her life from Brisbane to Melbourne to play for the Melbourne Victory.\n\nIt also saw a reunion with Jeff Hopkins, her first senior coach at Brisbane Roar. The result was a stellar season with her four goals and two assists helping her new side transform from two-time wooden spoon winners, to 2018/19 W-League Premiers.\n\nIt’s clear that although her athletic abilities are considerable, Emily Gielnik’s path to a Matildas regular is really a story about mindset.\n\nAs every inspirational sports instagram quote will tell you, sport is about mentality.\n\nWhen asked where her upbeat outlook and mental toughness comes from, Gielnik says it was something she needed to learn.\n\n“I was always my harshest critic and put so much pressure and expectation on myself,” she said.\n\n“I had to learn to take a step back and just enjoy the game without worrying what others think about me or how I should play.”\n\n“The shift came when I just got back to doing what’s natural and playing my own game.\n\n“When I got back to the old me, I realised how happy that made me both within and outside of football,” she said.\n\nEmily Gielnik's brilliant Matildas form 13 November ⚽️. 28 February ⚽️. 3 March ⚽️. Emily Gielnik has three goals in her last three appearances for the Westfield Matildas! Posted by Westfield Matildas on Sunday, 3 March 2019\n\nAnd her mindset extends to beyond just herself, also wanting the best for her team as a whole.\n\n“I think I am just a positive person, towards myself and towards other players. Even if someone plays over me, I genuinely want them to do well, I want that player to feel so good and I want us to win together.\n\n“As much as I love scoring goals, I love setting others up, so they get the glory.”\n\nThe next time Emily Gielnik pulls on the green and gold jersey, there will be an inscription on the inside that reads ‘Never Say Die.’ It is fitting for the poster girl for perseverance.\n\nIf Gielnik’s evolution is any indication, her greatest feats are yet to come."}, {"url": "https://footballqueensland.com.au/2019/05/28/emily-gielniks-journey-from-queensland-to-her-first-world-cup/", "page_content": "In football there are stories of disappointment but there are also the ones of triumph and dedication, where players fight tooth and nail to get their chance. Westfield Matildas forward Emily Gielnik is one of those stories.\n\n\n\nIt wasn’t until the age of 12 that Gielnik started playing football, after injuries in basketball convinced her parents to encourage her to give a different round ball game a go.\n\nPlaying most of her junior football with Redlands United FC, Gielnik worked under the guidance of current Junior Matildas coach Rae Dower, who was Technical Director at the Cleveland-based club at the time.\n\n“Rae coming up was good for my development; she more or less gave me the confidence to be free as a player, take players on and score goals,” Gielnik said.\n\n“It’s what made me become more of a goal scorer so most definitely she had impact when I was younger and obviously as I got older and matured as a player there are a lot of other coaches and people.”\n\nIn her first season of playing, the Melbourne-born attacker made the Queensland squad for the National Championships at Coffs Harbour however, at the age of 15 with teammates and friends making the Queensland Academy of Sport (QAS) team, Gielnik didn’t receive a letter.\n\nIt was a disappointing moment for the teenager.\n\nHowever, opportunities pop up in the strangest of ways and it was while on a school trip to Canberra when she visited the Australian Institute of Sport (AIS), that an unbelievable chance came about.\n\nThe Matildas were training at the AIS with then Head Coach Tom Sermanni when Gielnik’s sports teacher asked him if she could join the training session.\n\n“I must have trained out of my skin even though I was so intimidated because it was all the best players in Australia, and all the really old-school Matildas were there,” she said.\n\n“Tom Sermanni asked me to come back the next day and I played a training match with the Matildas.”\n\nImpressed with Gielnik, Sermanni called Jeff Hopkins who was heading up the women’s football program at QAS and recommended he get her into the program.\n\n“That’s kind of how my journey kicked off,” Gielnik said.\n\nShe played a whole season with the QAS before earning a contract the following year with Brisbane Roar, however an injury would keep her sidelined for the whole 2009 Westfield W-League season.\n\nIt wasn’t until the following season at 18 that she made her debut.\n\nGielnik had to work incredibly hard to get her Westfield W-League opportunity and even in her first two seasons with the club she wouldn’t see much game time with 15 of her 19 appearances coming from the bench.\n\nHowever, after a successful 2011-12 season with Roar, where she was dubbed the ‘super sub’ for her ability to score goals as a substitute, Gielnik earnt a call up to the Westfield Matildas.\n\nIt was a tough squad to break into at the time, particularly being a striker, with the likes of Sam Kerr, Lisa De Vanna and Kyah Simon just some of the players who had cemented spots in the national team.\n\nAfter making several appearances, Gielnik spent a couple of years away from the national team but fought her way back into Westfield Matildas fold for the 2016 Olympic qualification campaign.\n\nHowever, there was heartbreak when she just missed out on going to the Rio Olympics.\n\n“It’s disheartening to be out of the squad but once you are it makes you realise how hungry you are to get back in,” Gielnik said.\n\nAlways one to work hard, she continued to keep pushing and made the decision to leave Roar for Melbourne Victory ahead of the 2018-19 Westfield W-League season to reach new heights as a player.\n\nAll her hard work paid off when Gielnik got the phone call that she was selected in the Westfield Matildas FIFA Women’s World Cup squad for the France tournament this year.\n\nIt was an emotional moment for the 27-year-old, who cried after hearing the news.\n\n“I can’t really put a word on it to be honest,” Gielnik said.\n\n“It’s more a sense of relief and satisfaction in a way with the build-up and how everything has come together.\n\n“I know I spoke about it in W-League and how desperate I was to make this one so it was more the relief of what I had done had been recognised and I’ve been rewarded for it.”\n\nGielnik puts her recent selection for the national team down to perseverance and dedication.\n\n“It’s just persistence and I think that’s the key for me, the earlier I learnt that it takes more than training with the teams and that it takes dedication then that’s where you’ll be rewarded,” she said.\n\nThe Westfield Matildas are currently in Antalya, Turkey for a 10-day camp as they prepare for their opening game of the World Cup on June 9 against Italy.\n\nImage: Matt King/Getty Images"}, {"url": "https://www.foxsports.com.au/football/w-league/emily-gielniks-move-to-melbourne-victory-is-paying-off-as-the-matilda-looks-to-lock-in-a-world-cup-spot/news-story/4ed1095158941733f24e097ec4ca275b", "page_content": "Emily Gielnik had a decision to make.\n\nLess than a year out from the Women’s World Cup, the dynamic winger had two options: stay at W-League powerhouse Brisbane Roar, the club she’d joined as a teenager — or take on a new challenge.\n\nThe latter option was joining her former Roar manager Jeff Hopkins at Melbourne Victory — a club trying to return from three years in the finals wilderness.\n\nWith the pain of missing out on the Matildas’ 2015 World Cup and 2016 Olympics squads still burning fiercely, Gielnik turned her back on the comfort of home and threw herself headlong into a move interstate.\n\n“Well to be honest, Jeff has asked me (to come to Victory) the last couple of years and it wasn’t until this year I made the move,” Gielnik told foxsports.com.au.\n\n“I think I personally needed a bit of a challenge, a change of environment, just being around a different diverse of players and I just really needed to challenge myself in football.\n\n“So I really feel like I just needed something new to be honest, I just didn’t want to become stagnant and be at the same place for such a long time.\n\n“But my loyalty was really, really important to me. If I could’ve, I would’ve stayed at Brisbane for the rest of my life, the rest of my football career.\n\n“But I really think that looking at the bigger picture in terms of the World Cup, this was a really critical move for me and … when I made the decision, it wasn’t overnight it was weeks and weeks and it was an emotional one.\n\n“So it was a really calculated decision and I think so far for me, it’s proven to be a good one.”\n\nEmily Gielnik and Laura Alleway celebrate (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\nSix weeks into the W-League season, Gielnik is reaping the rewards of her bold move.\n\nVictory is sitting pretty, undefeated and outright top of the table, with the winger nominated for the PFA’s recent W-League player of the month award.\n\nIn her five appearances for Victory, Gielnik has scored one goal, assisted one, made 10 key passes, created 11 chances and provided 23 crosses.\n\nShe’s also combined beautifully with captain Natasha Dowie and star playmaker Christine Nairn, with the trio comprising one of the W-League’s most intimidating attacks.\n\n“I think if you look at it in the perspective of a couple of weeks, it feels really good, obviously because of where we are as a team and everything,” Gielnik said.\n\n“And me personally, I’ve already felt a lot of improvement. Most importantly, it’s just in my happiness and my mentality more than anything and I’ve got a really good support network in terms of leaving home as well.\n\n“And obviously the staff here is great and obviously Jeff has the best intentions for me, so they’re really going above and beyond to try and cater for everything that I need football-wise. So that was really important to me in the lead up to making that decision to play for Victory.\n\n“But obviously I already feel a really good shift and a good change for me so far but I think there’s still over half a season to go and much more improvement that I’m longing for, definitely, with the World Cup being obviously in my sights but the team being the priority of course at the moment.”\n\nEmily Gielnik. (AAP Image/Julian Smith) Source: AAP\n\nIf moving states was one sacrifice that’s paid off, then Gielnik’s other big call was at least as significant.\n\nThe Matilda recently made the decision to end the lease on the gym she’s owned and run for several years — and admits pulling the pin on that ambition to focus solely on her football has lifted a weight off her shoulders.\n\n“To cut a long story short — I honestly just feel like things in my life are going good and I have such a great support network and I have really, really good friends and I started to really put football first,” Gielnik said.\n\n“My gym actually, ShredEm Fitness, that had been a lifelong dream for me that I opened before I was in the Matildas, I’ve actually just ended the lease there and decided to put all my focus into football. So that was a big thing for me.\n\n“Purely because football is not forever and that dream job is something I can always come back to, no matter the age. So I really just want to — after years and years of sacrifice to football, I thought this was really the ultimate thing to do just to give it everything that I’ve got and enjoy every single challenge and experience because I’m obviously lucky enough to have the opportunity to be a contracted Matilda at the moment.\n\n“So I weighed up some options and it’s not that I didn’t take it (football) seriously before, it’s just more that I’ve really made it a massive part of my life, which it has been for a long time.\n\n“And so I think I’ve been a lot happier and a lot more focused and I’ve really dedicated a lot of my time to it off the field as well now, more from a mental aspect and keeping myself in good condition and in other parts of fitness to make sure that I’m physically good on the park.”\n\nEmily Gielnik. (AAP Image/David Crosling) Source: AAP\n\nThis week Gielnik is set to face Brisbane for the first time since her move.\n\nWhile the winger admits she’s trying not to think about the experience of facing her old club, in front of her family and friends, there are understandably some nerves.\n\nThat said, she’s had plenty of people to lean on, with fellow ex-Roar players Angie Beard, Laura Alleway and Casey Dumont among the teammates she has at Victory.\n\nGielnik has also thrived under Hopkins, with the Victory manager a tough, but supportive leader, and it’s clear the winger is enjoying her time in Melbourne.\n\nWhile Gielnik came into a team that had struggled in recent years, it was also a club that had locked in a solid base of quality experienced and young players.\n\nThe Victory recruit highlights the culture and attitude of the group, along with the quality of the likes of Nairn and Dowie, as key reasons behind her renewed happiness and love of the game.\n\nEmily Gielnik celebrates with Christine Nairn. (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\n“I think we’re strong all over the park and I’m not just talking performance-wise and physically and in terms of football — I’m talking in terms of team culture and the positivity and we’ve got massive, massive depth within our team,” Gielnik said.\n\n“And I think that’s been almost the glue and something that’s been really critical this season that was really important to me ... so it’s really enjoyable and to be honest I’m really enjoying football.\n\n“And I think players say this a lot of times, like they say they enjoy football and sometimes you can have ups and downs and football’s not (fun) all the time but I think I’ve actually started to — apart from when I was a kid — have fun with it again.”\n\nGielnik is certainly playing like someone enjoying her football.\n\nThe Matilda has been in fine form for both club and country, recently showcasing her ability to have an impact off the bench with a tremendous goal against Chile in Newcastle.\n\nAustralia celebrate a goal from Emily Gielnik. (Photo by Ashley Feder/Getty Images) Source: Getty Images\n\nGielnik’s steely resolve before and during games is hard to miss, and while she’s enjoying her football, there is a clear drive behind her relentless approach.\n\nAs a 23-year-old, Gielnik missed out on the 2015 Women’s World Cup squad — having been cut by former coach Hesterine de Reus, before Alen Stajcic took over.\n\nThen, a year later, she missed out on the Olympics by one spot.\n\nNow 26, and a bona fide star of the W-League, Gielnik is clearly determined not to experience that disappointment again.\n\n“It’s a tough one because now things have been going well for the Matildas and stuff but at the end of the day I’ve never been to a World Cup or an Olympics,” Gielnik said.\n\n“I’ve missed out shyly of the Olympics by one spot and I was training with that team during the Olympic qualifiers and everything and to pull up short and to be cut from the World Cup (hurt) and this is the opportunity of a lifetime now and I most definitely don’t want anything distracting me (and) I don’t want to waste it.\n\n“So I’m really making sure I don’t lose focus on it and I give myself the best opportunity but I don’t lose myself as well while I’m doing that.\n\n“So yeah, it’s a big dream of mine and it would be a goal — a life goal to be achieved to be honest — and I think W-League’s the platform for that, without putting too much pressure on myself.\n\n“But it really is a platform for it and obviously a good opportunity for other players on a larger scale as well.”"}, {"url": "https://wiki2.org/en/Emily_Gielnik", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAustralian soccer player\n\nEmily Gielnik (born 13 May 1992) is an Australian professional soccer player who plays as a forward for Aston Villa of the FA WSL. and the Australia women's national team. She previously played for Brisbane Roar and Melbourne Victory in her native Australia, Liverpool in England, Urawa Red Diamonds in Japan, Avaldsnes IL in Norway, Bayern Munich in Germany, and Vittsjö GIK in Sweden. On 2 September 2021 she signed for Aston Villa in WSL league\n\nYouTube Encyclopedic\n\n1 / 5 Views: 970 1 046 321 1 104 573\n\nEmily Gielnik - W-League Golden Boot 2020/21\n\nEmily Gielnik Wonder Goals Westfield Matildas\n\nEmily Gielnik Westfield W-League highlights\n\nEmily Gielnik's golden rule broken: Australia's 'UN' Matilda in Birmingham | Optus Sport Originals\n\nEmily Gielnik - My Westfield Matildas Story Transcription\n\nClub career\n\nBrisbane Roar, 2009–2018\n\nBorn in Melbourne, Gielnik moved to Queensland at the age of seven. After stopping basketball due to injuries she took up soccer and was eventually signed by Brisbane Roar for the second season of the W–League.[1] At Brisbane she became recognised as a \"super sub\" for her knack of coming off the substitutes' bench to score late goals.[2] Gielnik played eight seasons at Brisbane, appearing in 83 games and scoring 30 goals. She won the W-League Championship in 2010–11 and the Premiership in 2012–13 and 2017–18.[3]\n\nLiverpool LFC and Ottawa Fury, 2012–2013\n\nIn May 2012, Gielnik signed for English club Liverpool L.F.C., during the 2012 FA WSL season.[4] In October 2012, she was one of ten players to be released by Liverpool's new manager Mark Beard.[5] In 2013, Gielnik joined Ottawa Fury for their W-League season.[6]\n\nUrawa Red Diamonds, 2016\n\nAfter the 2016 Olympics, Gielnik joined Japanese club Urawa Red Diamonds.[7]\n\nAvaldsnes IL, 2017\n\nGielnik joined Norwegen team Avaldsnes IL for the 2017 season. She had a breakout season with the team, scoring eight goals in league play. Avaldsnes finished second in the Toppserien and won the Norwegian Cup.[8]\n\nMelbourne Victory, 2018–2019\n\nGielnik signed with Melbourne Victory for the 2018–19 W-League season.\n\nBayern Munich, 2019–2020\n\nOn 23 August 2019, Gielnik joined German Frauen-Bundesliga club Bayern Munich.[9] In July 2020, she left the club after making only 6 appearances, partially due to injury.[10]\n\nVittsjö, 2020\n\nA week after leaving Bayern Munich, Gielnik signed with another European club, joining Swedish club Vittsjö.[11]\n\nBrisbane Roar, 2020–\n\nIn November 2020, Gielnik returned Australia, signing with her hometown club, Brisbane Roar.[12]\n\nInternational career\n\nGielnik scored a hat-trick on her international debut for Australia U-19s in October 2011.[1] She made her first appearance for the senior Matildas team in a 3–0 friendly defeat to World champions Japan in Tokyo on 11 July 2012.[13]\n\nGielnik was named to the Australian squad for 2016 Olympic Qualifying, she scored a goal against Vietnam.[14] Australia won the tournament and qualified for the 2016 Summer Olympics.\n\nGielnik was part of the Matildas squad that won the 2017 Tournament of Nations and defeated the United States for the first time ever.[15]\n\nAt the 2018 AFC Women's Asian Cup Gielnik appeared in three matches for Australia. The Matildas advanced to the final, but lost to Japan 1–0. Australia qualified for the 2019 FIFA Women's World Cup.[16]\n\nIn May 2019, Gielnik was named to her first World Cup team.[17] At the World Cup Gielnik appeared in three matches for Australia, starting two of them. In the Round of 16 against Norway, she entered the match as a second-half substitute replacing Hayley Raso. With the match tied 1–1 after extra-time, the game went to penalties. Gielnik was the second penalty taker for Australia, she had her penalty saved. Australia lost to Norway 4–1 on penalties and were eliminated from the World Cup.[18]\n\nGielnik was selected for the Australian women's football Matildas soccer team which qualified for the Tokyo 2020 Olympics. The Matildas advanced to the quarter-finals with one victory and a draw in the group play. In the quarter-finals they beat Great Britain 4-3 after extra time. However, they lost 1–0 to Sweden in the semi-final and were then beaten 4–3 in the bronze medal playoff by USA.[19] Full details.\n\nCareer statistics\n\nInternational goals\n\nHonors\n\nClub\n\nBrisbane Roar\n\nAvaldsnes IL\n\nNorwegian Cup: 2017\n\nMelbourne Victory\n\nInternational\n\nAustralia\n\nIndividual\n\nReferences"}, {"url": "https://www.celebsagewiki.com/emily-gielnik", "page_content": "Age, Biography and Wiki\n\nEmily Gielnik was born on 13 May, 1992 in Melbourne, Australia. Discover Emily Gielnik's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 31 years old?\n\nPopular As N/A Occupation N/A Age 31 years old Zodiac Sign Taurus Born 13 May 1992 Birthday 13 May Birthplace Melbourne, Australia Nationality Australia\n\nWe recommend you to check the complete list of Famous People born on 13 May. She is a member of famous with the age 31 years old group.\n\nEmily Gielnik Height, Weight & Measurements\n\nAt 31 years old, Emily Gielnik height is 1.83 m and Weight 68 kg.\n\nPhysical Status Height 1.83 m Weight 68 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nEmily Gielnik Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Emily Gielnik worth at the age of 31 years old? Emily Gielnik’s income source is mostly from being a successful . She is from Australia. We have estimated Emily Gielnik's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nEmily Gielnik Social Network\n\nTimeline"}, {"url": "https://uk.soccerway.com/players/emily-gielnik/164110/", "page_content": "Matches of E. Gielnik\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}], "Emily Gielnik represented Australia at the 2019 FIFA Women's World Cup.": [{"url": "https://www.theguardian.com/football/2019/may/31/womens-world-cup-2019-team-guide-no-9-australia", "page_content": "This article is part of the Guardian’s 2019 Women’s World Cup Experts’ Network, a cooperation between some of the best media organisations from the 24 countries who have qualified for France. theguardian.com is running previews from two countries each day in the run-up to the tournament kicking off on 7 June.\n\nOverview\n\nIt is fair to say the No 6-ranked Matildas have Australia’s best-ever chance of winning a football World Cup. But the weight of expectation has been lightened since January’s shock sacking of coach Alen Stajcic amid allegations of a toxic and stagnating environment, and significant question marks linger as to whether Ante Milicic can impress his bold footballing philosophy upon the squad with just a handful of games to prepare for France.\n\nConversely, this makes the Matildas a genuine dark horse for the tournament. Galvanised by a frustrating past year or two, and ambitious to explore the uncharted – with a determined, likeable, close-knit squad of players – they could pull it off in style. Tactically, the system employed in April’s entertaining friendly defeat against the US was already a bold evolution from that seen during the recent Cup of Nations tournament. Australia surprised the world’s best team on home soil with an aggressive 4-2-4 (or lopsided 3-3-4) system that pressed the full-backs high, and played swiftly and vertically in transition, forcing the US into uncharacteristic mistakes. Though, as a 5-3 scoreline indicates, at times this left the Matildas vulnerable at the back, with a high line exposing their key defensive stalwarts for pace.\n\nMilicic is very clear in his philosophy – he wants the Matildas to dominate possession, to play with attacking intent and courage and let the opposition adapt to their game. This is tempered with pragmatism – against the US the collective system was adapted to best support the attributes of key individuals, surrounding spearhead Sam Kerr with the energetic Caitlin Foord, with width provided by attacking wingers Lisa De Vanna, Emily Gielnik or Hayley Raso. In midfield, the accomplished ball players Elise Kellond-Knight and Emily van Egmond are tasked with building the play from deep, while rising star Ellie Carpenter is given licence to attack from right-back.\n\nWith 12 players boasting 50 or more caps the squad is an excellent blend of youth and experience. Australians make up the largest foreign cohort of NWSL starters, with the complementary calendars of the domestic W-League and the elite US competition meaning year-round football for the nation’s best players. Whether the Matildas are the finished article in time for this World Cup remains to be seen, but Milicic is emphatic his side will play “the Australian way” – with energy, with courage and with self-belief.\n\nCoach\n\nMilicic is a highly regarded coach domestically, who served as the men’s national team assistant under Ange Postecoglou, a side that won international acclaim for its attacking showing at the 2014 men’s World Cup and silverware in the form of Australia’s first men’s Asian Cup trophy in 2015. Hard-working, meticulous and forensic in his preparation, Milicic is a taskmaster, but personable enough to extract the very best from this talented playing group.\n\nStar player\n\nWhat more is there to write about Sam Kerr? One of the undisputed stars of the women’s game, Kerr is the all-time leading goalscorer in both the NWSL and the W-League, and arrives in France coming off four consecutive domestic Golden Boot awards – and all this at just 25 years old. Overlooked for Fifa’s major individual honours – due perhaps to previous criticism of the governing body – but a star-turn in France and a move to one of Europe’s top clubs post-World Cup could change that.\n\nSam Kerr is the all-time leading goalscorer in both the NWSL in the US and Australia’s W-League. Photograph: Justin Edmonds/Getty Images\n\nDid you know?\n\nThe veteran Lisa De Vanna could join an elite club by scoring at a fourth World Cup – something that seemed unlikely when the mercurial but tempestuous star was described by a former coach ahead of her first World Cup as “high maintenance”, “a brat” and possessing mood swings “like the stock market crash of 1987”.\n\nDescribed by historians Roy Hay and Bill Murray as being held back by “antagonistic relations at the institutional level” women’s football in Australia endured almost a century of chauvinistic dismissal from the 1880s onwards, with a 1921 committee examining outdoor games for girls finding football “unsuitable”, given that “much physical exercise might increase the difficulties of parturition”, aka childbirth. Buoyed by second-wave feminism and championed by pioneering figures such as Elaine Watson and Heather Reid the women’s game planted its first roots in semi-professionalism in the 1970s. A first national championship took place in 1974, with the foundation of the Australian Women’s Soccer Association – a body that the then governing body refused to ratify – leading to a first national team tour in 1978.\n\nNevertheless due to financial limitations, it wasn’t until 1984 that the Matildas first played a game outside Oceania and 1994 outside Asia, with Australia failing to qualify for the inaugural Women’s World Cup on goal-difference to New Zealand. Since then, the Matildas have been ever-present at World Cups, but didn’t record a win (4-1 v Ghana) until 2007 where they emerged from the group stage for the first time.\n\nWhich player is going to surprise everyone at the World Cup?\n\nEllie Carpenter. Already a veteran of six domestic seasons in Australia and the United States and with an Olympics campaign under her belt, the still teenage Carpenter has already blossomed into a key component of this Matildas squad. Tenacious, hard-working, with pace and an engine that goes all day, Carpenter will be crucial both in attack and defence, from a position that has been an achilles heel for Australia in recent campaigns.\n\nEllie Carpenter is only 19 but is already a key member of the Matildas squad. Photograph: Michael Ciaglo/Getty Images\n\nWhat is the realistic aim for France and why?\n\nSemi-finals. The upheaval following the dismissal of Stajcic has cooled dreams of the trophy, as has a mixed year of performances following Australia’s defeat of the US in Seattle in 2017. This is unquestionably the Matildas’ strongest ever squad, and if Kerr fires, a fairytale charge to the final could be on the cards. Australia have fallen at the quarter-finals at the past three World Cups – they would desperately love to go at least one better in France.\n\nAnnual budget\n\nBelieved to be $2m-4m. Football Federation Australia spent $11.3m on national teams in 2018, but with that being a men’s World Cup year, it’s likely the lion’s share went to the men’s game.\n\nRegistered players\n\nFFA reports there are 140,000 female players “participating in regular structured football”, but a recent AusPlay survey cites 250,000 female participants in what is, despite the investment from Aussie rules football, netball and cricket, still the nation’s largest grassroots participation sport.\n\nRichard Parkin writes for the Guardian Australia. Follow him here on Twitter."}, {"url": "https://www.matildas.com.au/news/player-profile-emily-gielniks-lifelong-olympic-dream", "page_content": "Emily Gielnik has been to a FIFA Women’s World Cup and an AFC Women’s Asian Cup and can now finally add the Olympics to her resume.\n\nHer career is defined by perseverance and grit. Born in Melbourne, Gielnik grew up in Queensland playing a different kind of round ball sport: basketball. Injuries saw her eventually pick up football at age 12.\n\nShe played her junior football at Redlands United. Current Junior Matildas coach and Football Australia Women’s Technical Advisor Rae Dower was the Technical Director at the club when Gielnik was there.\n\nDespite making the Queensland squad for the National Championships, Gielnik didn’t make it into the Queensland Academy of Sport (QAS) team.\n\nShe would end up in the QAS team eventually, thanks to a school trip to Canberra where she took part in a Matildas training session at the AIS under then-coach Tom Sermanni.\n\n\n\nSermanni suggested Gielnik to the QAS coach at the time, Jeff Hopkins, who would go on to work with Gielnik in the W-League at Brisbane Roar and Melbourne Victory.\n\nGielnik’s domestic career mirrored that of her national team one. A strong season in orange saw her earn the ‘super sub’ tag where she helped the Roar make a grand final. Later in 2012, she made her senior national team debut against Japan at the age of 20.\n\nBut after breaking into the national team, she spent some time away from the W-League and the Matildas.\n\nShe explored passions outside football and opened a gym, working on her own fitness and helping others. Fitness is still something that interests her as she is currently undertaking a Bachelor of Exercise Science alongside club and country teammate Clare Polkinghorne.\n\nGielnik worked hard to get back onto the national team radar. While she didn’t make the squad for the FIFA Women’s World Cup in Canada, she was a part of the team which qualified for the Rio Olympics the following year.\n\n\n\nThe forward scored her first national team goal in that tournament in a 9-0 win over Vietnam.\n\nHowever, with plenty of talent and a small squad, Gielnik didn’t make the final cut. Instead, she travelled as an alternate player.\n\nAt the time, Gielnik said her omission left her genuinely heartbroken and described it as the biggest emotional toll football had ever taken on her.\n\nFollowing on from being so close to selection, Gielnik moved to Norway before linking back up with Jeff Hopkins, this time at Melbourne Victory in the W-League.\n\nA ‘feel good, play well’ kind of player, Gielnik returned to the national team fold and began to cement herself in the team, adding more goals to her tally.\n\nShe was selected to go to Jordan in 2018 for the AFC Women’s Asian Cup and to France in 2019 where she played in three of Australia’s four matches.\n\nA move to German giants Bayern Munich saw her learn plenty about herself but she returned to Scandinavia and the W-League once again.\n\n\n\nA scintillating 2020-21 season with Brisbane Roar saw Gielnik take home the golden boot before she signed for Vittsjö in Sweden. With 10 goals in 42 games for her country, the determined and dedicated Gielnik is inching ever close to half a century of caps.\n\nA strong presence with the ability to play on the wing and more centrally, Gielnik is an invaluable asset to the Matildas in Tokyo."}, {"url": "https://www.foxsports.com.au/football/matildas/australias-emily-gielnik-reflects-on-her-surreal-world-cup-debut/news-story/ee648b160f0e082ad6b73fac59d3be93", "page_content": "Making your World Cup debut is special enough.\n\nFew get to achieve that milestone in a game as memorable as this.\n\nAustralia’s 2019 World Cup win over Brazil was genuinely one for the ages, with the Matildas completing a remarkable comeback from 2-0 down to win 3-2.\n\nBut for Emily Gielnik, it was special for another reason: it was the winger’s debut in a major tournament.\n\n“Honestly I can’t even put it into words how we’re all feeling,” Gielnik said post-match.\n\n“I just feel so bloody good and just like, it was such a do-or-die game and we won our way and I just — I’m just speechless, feeling on top of the world right now.”\n\nGielnik missed out on Australia’s 2015 World Cup squad, then was again overlooked for the 2016 Olympics.\n\nHaving sat on the bench for the opening loss to Italy, the Melbourne Victory winger was called upon by Ante Milicic to start against Brazil.\n\n“It is surreal. I feel great honour that he gave me that opportunity,” Gielnik said.\n\n“I took it with both arms and I hope I did my bit for the team and (it was) amazing — Hayley Raso came on and finished the job for us.\n\n“And it was just the tireless work, hard work, hardworking game and I just put my best foot forward and just tried to dig deep for the team and it wasn’t — I wouldn’t say — the prettiest of football games but grind it out to the end and the result is all that matters, so we’re happy.”\n\nBrazil's Marta, right, tussles for the ball with Australia's Emily Gielnik. (AP Photo/Claude Paris) Source: AP\n\nGielnik was a slow starter against Brazil and copped an ego check late in the opening half, when she was nutmegged by Tamires in the build-up to the game’s second goal.\n\n“That’s not one that I’m gonna enjoy watching back and I’m pretty sure she did it to another player not long after me,” she said.\n\n“So look, they’re a bunch of street-smart, skilful football players and I didn’t really grow up that style of player. So it was a hard one to watch as that one went in since it all started with my nutmeg.\n\n“So look, it’s a tough one, I’ll learn from it and I just hope to not make those little mistakes again.”\n\nAs the game went on, Gielnik got more involved, creating a good chance for Sam Kerr shortly before Caitlin Foord’s opening goal, then playing a role in the build-up to Chloe Logarzo’s equaliser.\n\n“Yeah definitely (I got more involved). Look, I don’t want to say I have any regrets, I do think I could have done things a little bit better with a little bit better intention,” she said.\n\n“And I think I could have been a little bit more aggressive going forward and I guess I was a little bit hesitant in a sense of not getting done in behind.\n\n“So it’s kind of one of those 50-50s, risk and reward so I’ll learn from it and at the end of the day, I’m just glad that we won, so that’s all that matters.”\n\nChloe Logarzo, Caitlin Foord and Emily Gielnik (Photo by Pascal GUYOT / AFP) Source: AFP\n\nWhen Gielnik made way for Raso in the 71st minute, with Australia’s 3-2 comeback complete, she and Milicic shared a big embrace, with the winger relishing in her coach’s show of faith.\n\n“He was terrific,” Gielnik said.\n\n“It’s not often that people get an opportunity to play in the World Cup and just said he hoped I enjoyed my debut and my minutes at my very first World Cup.\n\n“And you know, it was a nice moment and I really appreciate that and I’m grateful for it because at the end of the day, he decides who gets the minutes and I definitely didn’t have to start, nor do I have to come on.\n\n“So hopefully I’m proving myself to him and hopefully I did my bit for the team and I’m grateful for the opportunity that he gave me.”\n\nAnd if the moment was special on an individual level for Gielnik, she was also more than aware of the significance of the win for the team as a whole.\n\n“It lifts our confidence obviously. No-one loves to lose their first game and I think it put a lot of pressure (on us) but another cliche saying of the Matildas: ‘never say die’ — we knew this game was do or die for us,” Gielnik said.\n\n“So we really took on that pressure and we executed well and I think we were gonna fight to the end for this win, no matter what it took.\n\n“I know that we had the players and the depth to do that and we finished it — whether it was ugly or pretty, the three points was crucial for us. But not winning that first game was hard, but losing this game would have been harder, so that was just a no for us basically.”"}, {"url": "https://footballqueensland.com.au/2019/05/28/emily-gielniks-journey-from-queensland-to-her-first-world-cup/", "page_content": "In football there are stories of disappointment but there are also the ones of triumph and dedication, where players fight tooth and nail to get their chance. Westfield Matildas forward Emily Gielnik is one of those stories.\n\n\n\nIt wasn’t until the age of 12 that Gielnik started playing football, after injuries in basketball convinced her parents to encourage her to give a different round ball game a go.\n\nPlaying most of her junior football with Redlands United FC, Gielnik worked under the guidance of current Junior Matildas coach Rae Dower, who was Technical Director at the Cleveland-based club at the time.\n\n“Rae coming up was good for my development; she more or less gave me the confidence to be free as a player, take players on and score goals,” Gielnik said.\n\n“It’s what made me become more of a goal scorer so most definitely she had impact when I was younger and obviously as I got older and matured as a player there are a lot of other coaches and people.”\n\nIn her first season of playing, the Melbourne-born attacker made the Queensland squad for the National Championships at Coffs Harbour however, at the age of 15 with teammates and friends making the Queensland Academy of Sport (QAS) team, Gielnik didn’t receive a letter.\n\nIt was a disappointing moment for the teenager.\n\nHowever, opportunities pop up in the strangest of ways and it was while on a school trip to Canberra when she visited the Australian Institute of Sport (AIS), that an unbelievable chance came about.\n\nThe Matildas were training at the AIS with then Head Coach Tom Sermanni when Gielnik’s sports teacher asked him if she could join the training session.\n\n“I must have trained out of my skin even though I was so intimidated because it was all the best players in Australia, and all the really old-school Matildas were there,” she said.\n\n“Tom Sermanni asked me to come back the next day and I played a training match with the Matildas.”\n\nImpressed with Gielnik, Sermanni called Jeff Hopkins who was heading up the women’s football program at QAS and recommended he get her into the program.\n\n“That’s kind of how my journey kicked off,” Gielnik said.\n\nShe played a whole season with the QAS before earning a contract the following year with Brisbane Roar, however an injury would keep her sidelined for the whole 2009 Westfield W-League season.\n\nIt wasn’t until the following season at 18 that she made her debut.\n\nGielnik had to work incredibly hard to get her Westfield W-League opportunity and even in her first two seasons with the club she wouldn’t see much game time with 15 of her 19 appearances coming from the bench.\n\nHowever, after a successful 2011-12 season with Roar, where she was dubbed the ‘super sub’ for her ability to score goals as a substitute, Gielnik earnt a call up to the Westfield Matildas.\n\nIt was a tough squad to break into at the time, particularly being a striker, with the likes of Sam Kerr, Lisa De Vanna and Kyah Simon just some of the players who had cemented spots in the national team.\n\nAfter making several appearances, Gielnik spent a couple of years away from the national team but fought her way back into Westfield Matildas fold for the 2016 Olympic qualification campaign.\n\nHowever, there was heartbreak when she just missed out on going to the Rio Olympics.\n\n“It’s disheartening to be out of the squad but once you are it makes you realise how hungry you are to get back in,” Gielnik said.\n\nAlways one to work hard, she continued to keep pushing and made the decision to leave Roar for Melbourne Victory ahead of the 2018-19 Westfield W-League season to reach new heights as a player.\n\nAll her hard work paid off when Gielnik got the phone call that she was selected in the Westfield Matildas FIFA Women’s World Cup squad for the France tournament this year.\n\nIt was an emotional moment for the 27-year-old, who cried after hearing the news.\n\n“I can’t really put a word on it to be honest,” Gielnik said.\n\n“It’s more a sense of relief and satisfaction in a way with the build-up and how everything has come together.\n\n“I know I spoke about it in W-League and how desperate I was to make this one so it was more the relief of what I had done had been recognised and I’ve been rewarded for it.”\n\nGielnik puts her recent selection for the national team down to perseverance and dedication.\n\n“It’s just persistence and I think that’s the key for me, the earlier I learnt that it takes more than training with the teams and that it takes dedication then that’s where you’ll be rewarded,” she said.\n\nThe Westfield Matildas are currently in Antalya, Turkey for a 10-day camp as they prepare for their opening game of the World Cup on June 9 against Italy.\n\nImage: Matt King/Getty Images"}, {"url": "https://olympics.com/en/news/the-tale-of-two-matildas", "page_content": "It’s the heart-breaking phone call that no athlete wants to receive. With only 18-players able to be selected on an Olympic Football squad, Emily Gielnik missed out on making the Australian women’s football team for the Rio 2016 Games by one spot. “[It] was heart wrenching and disappointing, to say the least, I felt entirely defeated at that point, I felt like I had done what I could do, and I wasn't going,” the Matildas forward, who had also missed out on the 2015 FIFA Women’s World Cup squad a year prior, told Tokyo 2020 in April. “A very difficult time in my career to understand but moving past that was just as important for me so that's what I focussed on.” The Brisbane-born footballer knew she wanted to be an Olympian as soon as she pulled on the green and gold jersey – making her senior national debut against Japan, Tokyo in 2012. “I remember that feeling of actually watching the girls at the Olympics from my couch with my family and just how passionate and excited I was to be supporting them,” Gielnik said. “I knew that's what I wanted. I wanted to be on the on the other end of that, being a part of that. So that was more so when it really sunk in that I wanted that more than anything.” Now the 28-year-old is squarely within the mix for Tokyo 2020 selection after scoring a double against Rio 2016 gold medallist Germany in Australia’s 5-2 friendly loss last month.\n\nHowever, Gielnik wasn’t the only Matilda to miss out five years ago with Aivi Luik also named as an alternate for Rio 2016. The 36-year-old told Tokyo 2020 it would be a dream come true to represent Australia at Tokyo 2020. “To be able to go there and compete with the best in a tournament that has such history, I think it would be amazing, it would be a once in a lifetime kind of experience. And it was something that I always wanted as a kid.”\n\nThe ability to preserve Getting knocked down, facing challenges, and overcoming barriers is something both Gielnik and Luik know all too well. For Gielnik, after missing out on Rio 2016, she didn’t let her determination die, she continued to work hard and made the decision to leave her long-time club Brisbane Roar for Melbourne Victory ahead of the 2018-19 W-League season. It was a move that would pay dividends as she made Australia’s squad for the 2019 FIFA Women’s World Cup in France. “What I would put it down to, honestly, is just how I've approached every football season from then onwards leaving no stone unturned, just knowing my own body, knowing what it takes to stay at that top level and what's required of me in working alongside the clubs but also working on my own in terms of individual performance away from the football clubs,” she said of her desire to continue being her best.\" “That's really what's got to me, is just honing in on that that focus and those extra things that have that kept me in the top level and keep giving me the opportunity to come back into the Matildas squad.” Luik, who also got her start in the W-League with Brisbane Roar, had to wait a tad longer before making her World Cup debut despite making her international debut in 2010 and was part of Australia’s victorious AFC Asian Cup team that year. But throughout her career she was plagued with injuries including bilateral hamstring tendinopathy. Despite missing out on selection for both the 2011 and 2015 World Cups then Rio 2016 Olympics, the midfielder continued playing because it had been her dream to go to a World Cup. “After that second let down, I didn't really think it was going to be in the cards for me, but I continued to play,” she said.\n\nAivi Luik (2018 Getty Images)\n\nIt was in 2018, seven years after her last appearance in the green and gold, that Luik took to the pitch as a Matilda once again during their 5-0 friendly win against Thailand and after a successful season with Spanish club Levante in 2019, she was on the radar of then Matildas coach Ante Milicic for the upcoming World Cup in France. Named in the 23-player World Cup squad, it wouldn’t be until Australia’s final group game that the Perth-born player would take to the field. “I thought maybe I was going on and it didn't happen so I [was] starting to wonder if maybe it wouldn't happen but I did get that debut and it felt amazing,” she said. Australia beat Jamaica 4-1 in that match. “It was really emotional afterwards, especially to see my brother and sister in the crowd. Having them witness my dream since I was a kid was amazing. It's very hard to put into words, but it's definitely one of the highlights of my life.”\n\nTogether again after 400 days Assembling at Soest, the headquarters of the Dutch Football Federation, it was the first time since Australia had secured qualification for Tokyo 2020 in March last year during their 5-0 and 2-1 wins over Vietnam, that they were together again. And for many, it was the first time they had seen their national teammates – many have spent the last decade playing together in the green and gold – in over a year so there was excitement. “It was so good to see everyone again in camp, obviously, their familiar faces, but it's like you never left. It feels like we had we just saw them not long ago. So really exciting, really good vibes. We are one big family, and it was just so good to see everyone again,” Gielnik said ahead of the team’s first match in 400 days. With Australian-based players unable to be selected, it was up to the Matildas playing abroad to put their best foot forward in front of Tony Gustavsson, who was appointed head coach in September last year. The former United States assistant coach took the reins of Australia’s most loved national team in the New Year but due to the global pandemic hadn’t been able to meet players in person. With the playing group meeting Gustavsson for the first time, there were positive vibes around camp. “Tony has showed us the way that he believes we can play in order to get us to the next level,” Luik said of the Swedish-born coach. “That's what we all want at the end of the day and through his words, through his intensity and the belief in us, I think that's really flowed through his meetings and how he runs training sessions.” “Very good energy, good vibe and most importantly, extremely encouraging just coming in. So that really works well for me,” Gielnik said. “I think me as a player, I really respond better with someone who really believes in me and has that positive energy to want you to get on the ball. So I'm really looking forward to what he's got in store for all of us.”\n\nWelcoming the pressure From fighting for equality, recognition, and the right to play the game they love, the Matildas of today have become one of the most recognisable sport teams in Australia – and in women’s football. Following their Rio 2016 quarter-finals loss in a penalty shootout, it was at the 2017 Tournament of Nations that Australia reached new heights as they beat Japan (4-2), the United States (1-0) and Brazil (6-1) to win their first piece of silverware since the 2010 AFC Asian Cup success. Going on to win their next four matches on home soil, the following year still saw solid performances including a fourth-placed finish at the 2018 Algarve Cup and runners-up performance at the 2018 AFC Asian Cup. The 2019 FIFA Women’s World Cup left more to be desired, as they bowed out in the quarter-finals to Norway, but their qualification for Tokyo 2020 once again brought excitement. While recent 5-2 and 5-0 losses to Germany and the Netherlands brought harsh critics from Australian media – just three months out from Tokyo 2020. But the pressure to produce results is something the side welcome. “I think it's something that we enjoy and welcome with open arms, because if you're a team that is not doing well, there's no pressure on you so because we've risen through the rankings and we've got a name for ourselves, now there is that pressure but it's great,” Luik said. “It means people are following us. People want us to do well, and people expect us to do well. And I think that can actually help with results in the times when the pressure can get a little much, we've got a really good playing group and we can look for support, and also from our family and friends and our fans or some of the best in the world. And I don't say that lightly. “I think they care genuinely about our journeys and they care about our ups and downs and they really want to see us succeed.\""}, {"url": "https://www.olympics.com.au/olympians/emily-gielnik/", "page_content": "Fast Facts\n\nSport: Football\n\nEvent: Women's\n\nOlympic History: Tokyo 2020\n\nCoach: Tony Gustavsson\n\nYear Born: 1992\n\nState Born: Victoria\n\nAbout Emily\n\nEmily Gielnik had an Australian U19s debut for the ages, scoring a hat-trick on debut in October 2011.\n\nLess than 12 months later she received her first selection to the Matildas, appearing in a 3-0 defeat against Japan in July 2012 friendly.\n\nEmily was named in the Matildas Olympic qualifying squad for Rio 2016 and scored a goal against Vietnam, however wasn’t named in the final team for the Olympics.\n\nShe appeared in all three matches for Australia at the 2018 Asian Cup. The Matildas finished the tournament runners up to Japan after a tight 1-0 contest in the final.\n\nThe following year saw Emily’s international form rewarded with selection to the 2019 World Cup squad. In France, she appeared in three matches for Australia, with two of them as a starter.\n\nAt Tokyo 2020 Emily and the Matildas made all of Australia proud in putting together a historic achievement.\n\nTheir fourth place finish, which was nearly a podium finish after a 4-3 loss to the USA in the bronze medal game, is the highest ever finish by the Matildas at an Olympic Games.\n\nWith a W-League Premiership and Championship to her name, she has also amassed more than 50 caps for the Matildas and plays for Aston Villa."}, {"url": "https://pickstar.pro/au/our-stars/3979/emily-gielnik", "page_content": "Emily is a Football player who plays for Bayern Munich in the Frauen-Bundesliga\n\nand the Australian national team. She began her career at the Brisbane Roar with\n\na reputation of a ‘super-sub’ due to scoring late goals off the bench. She played\n\neight seasons with the Roar winning a W-League Championship and two\n\nPermierships. She has also won the Norwegian cup with Norwegian team\n\nAvaldsnes IL in 2017 and a third W-League Premiership with the Melbourne\n\nVictory in the 2018/19 season.\n\nShe is a regular for the national team, having recently appeared in three\n\nmatches for Australia in the 2019 FIFA Women’s World Cup. Emily scored a hat-\n\ntrick on her international debut for the Australian U-19s in 2011 and has since\n\nscored seven international goals. She has won the Tournament of Nations and\n\nCup of Nations with the national team.\n\nEmily has received many setbacks in her career, finding it initially tough to break\n\ninto a squad that included the likes of Sam Kerr, Lisa De Vanna and Kyah Simon\n\nwho had cemented their spots in the line-up but she kept pushing and credits her\n\nrecent international success to persistence and dedication."}, {"url": "https://int.soccerway.com/players/emily-gielnik/164110/", "page_content": "Matches of E. Gielnik\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://www.fifaworldcupnews.com/australia-squad-2023-fifa-womens-world-cup/", "page_content": "The 2023 FIFA Women’s World Cup will occur in Australia and New Zealand from July 20 to August 20, 2023. This is the first-ever World cup to feature 32 teams competing in eight groups.\n\nIn the upcoming 2023 Women’s FIFA World Cup, Australia is ready with its squad for soccer and showing top-notch performance in qualification matches. The 9th edition of the FIFA Women’s World Cup.\n\nIn order to commemorate the women’s game in 2023, Australia–New Zealand vows to unleash the untapped football potential of the Asia-Pacific region, draw record-breaking audiences, and sustain long-term growth in participation.\n\nFIFA World is one of the biggest tournaments in the world Australia is all set to smash the trophy we can see the team is performing excellently in all the matches.\n\nAustralia Squad: 2023 FIFA Women’s World Cup\n\nRole Players Goalkeeper Lydia Williams, Mackenzie Arnold, Teagan Micah. Defenders Courtney Nevin, Aivi Luik, Clare Polkinghorne, Steph Catley, Alanna Kennedy, Charlotte Grant, Clare Hunt. Midfielders Elise Kellond-Knight, Emily van Egmond, Tameka Yallop, Katrina Gorry, Kyra Cooney-Cross, Clare Wheeler, Alex Chidiac, Amy Sayer. Forwards Cortnee Vine, Caitlin Foord, Mary Fowler, Emily Gielnik, Hayley Raso, Sam Kerr, Larissa Crummer. Coach Tony Gustavsson Captain Sam Kerr\n\nAustralia Squad: 2023 FIFA Women’s World Cup Matches\n\nS.R Team Score Team Date 1. Australia 0-0 Republic of Ireland 20 July 2023 2, Australia 0-0 Nigeria 27 July 2023 3. Canada 0-0 Australia 31 July 2023\n\nAustralia 2023 FIFA Women’s World Cup Jerseys\n\nThe wait is over Australia Soccer and Nike unveiled the new 2023 FIFA Women’s World Cup Uniform that will be used in the upcoming FIFA World Cup officially in Australia and New Zealand.\n\nAustralia Squad: 2019 FIFA Women’s World Cup\n\n2019 FIFA Women’s World Cup Squad"}]}