{"Emily Gielnik represented Australia at the 2018 AFC Women's Asian Cup.": [{"url": "https://www.matildas.com.au/news/player-profile-emily-gielniks-lifelong-olympic-dream", "page_content": "Emily Gielnik has been to a FIFA Women’s World Cup and an AFC Women’s Asian Cup and can now finally add the Olympics to her resume.\n\nHer career is defined by perseverance and grit. Born in Melbourne, Gielnik grew up in Queensland playing a different kind of round ball sport: basketball. Injuries saw her eventually pick up football at age 12.\n\nShe played her junior football at Redlands United. Current Junior Matildas coach and Football Australia Women’s Technical Advisor Rae Dower was the Technical Director at the club when Gielnik was there.\n\nDespite making the Queensland squad for the National Championships, Gielnik didn’t make it into the Queensland Academy of Sport (QAS) team.\n\nShe would end up in the QAS team eventually, thanks to a school trip to Canberra where she took part in a Matildas training session at the AIS under then-coach Tom Sermanni.\n\n\n\nSermanni suggested Gielnik to the QAS coach at the time, Jeff Hopkins, who would go on to work with Gielnik in the W-League at Brisbane Roar and Melbourne Victory.\n\nGielnik’s domestic career mirrored that of her national team one. A strong season in orange saw her earn the ‘super sub’ tag where she helped the Roar make a grand final. Later in 2012, she made her senior national team debut against Japan at the age of 20.\n\nBut after breaking into the national team, she spent some time away from the W-League and the Matildas.\n\nShe explored passions outside football and opened a gym, working on her own fitness and helping others. Fitness is still something that interests her as she is currently undertaking a Bachelor of Exercise Science alongside club and country teammate Clare Polkinghorne.\n\nGielnik worked hard to get back onto the national team radar. While she didn’t make the squad for the FIFA Women’s World Cup in Canada, she was a part of the team which qualified for the Rio Olympics the following year.\n\n\n\nThe forward scored her first national team goal in that tournament in a 9-0 win over Vietnam.\n\nHowever, with plenty of talent and a small squad, Gielnik didn’t make the final cut. Instead, she travelled as an alternate player.\n\nAt the time, Gielnik said her omission left her genuinely heartbroken and described it as the biggest emotional toll football had ever taken on her.\n\nFollowing on from being so close to selection, Gielnik moved to Norway before linking back up with Jeff Hopkins, this time at Melbourne Victory in the W-League.\n\nA ‘feel good, play well’ kind of player, Gielnik returned to the national team fold and began to cement herself in the team, adding more goals to her tally.\n\nShe was selected to go to Jordan in 2018 for the AFC Women’s Asian Cup and to France in 2019 where she played in three of Australia’s four matches.\n\nA move to German giants Bayern Munich saw her learn plenty about herself but she returned to Scandinavia and the W-League once again.\n\n\n\nA scintillating 2020-21 season with Brisbane Roar saw Gielnik take home the golden boot before she signed for Vittsjö in Sweden. With 10 goals in 42 games for her country, the determined and dedicated Gielnik is inching ever close to half a century of caps.\n\nA strong presence with the ability to play on the wing and more centrally, Gielnik is an invaluable asset to the Matildas in Tokyo."}, {"url": "https://www.myfootball.com.au/news/emily-gielnik-redefining-success-and-failure", "page_content": "Emily Gielnik is redefining success and herself\n\nThe highs and lows of football not only define someone as football, but also as person. Westfield Matildas’ forward Emily Gielnik embodies that notion.\n\nWith the world firmly placed on pause during the period of COVID-19, restrictions have shut down the normality of life around the globe.\n\nBeing in lockdown with your thoughts to keep you company can be in equal parts challenging and invigorating. For Emily Gielnik, isolation has been a time for reflection and consideration.\n\n“I saw the light; you communicate more and you get to look at life from a different perspective,” she said from her apartment in Munich, Germany.\n\n“I was actually feeling quite fortunate. Even though football is my job, my career, my life and it’s hard to go from doing what you love to not be doing it at all, but watching the news really put things into perspective for me.”\n\nA TIME OF REFLECTION\n\nAfter returning from the AFC Women’s Olympic Qualifiers, Emily Gielnik and her Bayern Munich teammates soon found themselves returning to their homes as COVID-19 restrictions came into effect in Germany.\n\nFor the 28-year-old, the restrictions occurred at a fortuitous time with both her mum and partner on hand to ride out the opening weeks.\n\n“It was nice to have her [Mum] here,” Gielnik said.\n\n“[We were] just sharing some good quality time. There was definitely a lot of laughs and a lot of cooking happening!”\n\n\n\nAfter years of intermittent separation, the time mother and daughter spent together away from reality was a blessing.\n\n“When you go over to their [her parents] house and you see them on the weekend, it’s so rushed and you're not really there. You're replying to people and on social media. I feel like she was here, and I was actually engaging.”\n\n“If we hadn’t been in quarantine, it would have been a lot different if she was here. I was at full time training and I would have only seen her a little bit in the morning and a little bit in the afternoon.”\n\nFATHER & FRIEND\n\nEmily Gielnik admits that her life story is much like her football story; a tale of a late bloomer.\n\nUnlike many of her peers, with basketball and rugby being her first loves, Gielnik didn’t playing football until the age of twelve. Even then, it was after much encouragement on the part of the teenager to coax her parents to let her take to the pitch.\n\n“It took a lot of persuading in terms of my Mum and her letting me play soccer because she thought it's such high injury sport - although I played rugby against boys so I can't comprehend it,” she laughed.\n\nGielnik made the switch from rugby to football and never looked back (Supplied: Emily Gielnik)\n\nWhile her Mum may have been apprehensive about those first steps, Gielnik’s Dad was right beside her every step of the way.\n\n“I had that Dad that was always taking me to every sporting event possible,” she remembered fondly.\n\n“He would watch all my basketball games; all my football games and he was without a doubt that man that is running up and down the sidelines of the game and yelling at you to stop watching the play.”\n\nGielnik credits her father’s patience and support for pushing her to the next level. Criticism, no matter how constructive, can be a difficult to take on as a teenager. Looking back with the time and distance, Gielnik has no doubt his influence shaped her into the player she needed to be in order become a professional player.\n\n“I always wanted to be pro one day,” she said “I didn't grow up with this those skills or that coaching, I just had my Dad,”\n\n“I think he could sense that I wanted to get there so then he was criticising me, maybe at times he was criticising me too tough.”\n\nHe just wanted to make me better because maybe he could see that I could make it to the top and he knew I could be good.”\n\nAt the age of 15, Gielnik made the Queensland squad for the National Championships at Coffs Harbour but as her friends and teammates made their way into the Queensland Academy of Sport, Gielnik never received a letter.\n\nOpportunities can pop up in the strangest of places and while on a school trip where she visited the Australian Institute of Sport, Gielnik got her chance to train with the Westfield Matildas. Her letter from QAS came shortly after.\n\nThat finally put Gielnik on the path she had wanted for so long. A season with the QAS resulted in the striker earning a contract the following year with a star studded Brisbane Roar outfit.\n\nGielnik settling into the Matildas (Photo Credit: Rachel Bach / By the White Line)\n\nAfter a successful 2011/12 season with Roar, where she earned the moniker of ‘super sub’, Gielnik finally earned a call up to the Westfield Matildas.\n\nHer first appearance for the Westfield Matildas came in Japan in 2012. While it might have been an ocean away, her father wasn’t far away from her thoughts. These days he is a fixture Westfield Matildas home matches and proudly boasts the number 15.\n\n“He wears that jersey with pride…you can’t miss him!” Gielnik laughed.\n\n“When I’m in the starting line-up whomever is next to me is like ‘oh my god Em, that’s your Dad’.”\n\n“I'm actually playing for two people. Sometimes he lines up a shot and fully kicks like an air swing on the sideline. He's got like that as if he's kicked it. He's a part of the game, like he's a part of us.”\n\nREDEFINING SUCCESS\n\nIn a scripted Disney production, realising a dream and playing for the Westfield Matildas should have been the beginning of a long and steady stint in the senior national team.\n\nHowever, in real life, Gielnik’s ride was set to be a rollercoaster instead. That first run with the national team was followed by long periods away, and more frustrating periods of being close but not quite close enough.\n\n2015 saw her omission from the FIFA Women’s World Cup and 2016 resulted in heartbreak after being a part of the 2016 Rio Olympic Games qualification campaign.\n\nEach time, the Queenslander has dusted herself off – although it has not been without some soul searching and exploring different outlets for self fulfillment.\n\n\n\n\"After I got cut from the Olympics, I started to realise that I’ve got to do something that makes me happy now and I opened the gym [ShredEm Fitness],” she said.\n\n“Everything just went so well, and I had never been so happy so of course my football just skyrocketed.”\n\n“I was like obsessed with helping people. I was obsessed with helping someone from being so miserable and not comfortable at any other gyms and then they came and gave me a shot,” she said.\n\n“I wasn't then putting so much pressure about making the Matildas squad or proving myself that stage I was like I got this gym now I'm just going to play W- League enjoy it and love it.”\n\nOf course I was missing and craving the Matildas, but I stopped putting so much heavy pressure on myself thinking that that's all I wanted. I had the gym and so that created some happiness and some drive for me.”\n\nEventually the off the field success began to impact Gielnik’s success on it. A breakthrough 2017 Algarve Cup, a brilliant Westfield W-League season with Melbourne Victory in 2018/19 culminated in being named to her first major tournament squads for the 2018 AFC Women’s Asian Cup and FIFA Women’s World Cup 2019.\n\nFinding her confidence and goal scoring touch for the Westfield Matildas saw big clubs around the world begin to take notice of the powerful forward.\n\nAfter stints in the United States, Japan and Norway, Gielnik joined Frauen Bundesliga giants Bayern Munich.\n\n“I heard from KK and Emily (Van Egmond), and people that have played in Germany, that their regiment was just craziness,” she said.\n\n“For some reason I was longing for that environment.”\n\n\n\nMoving halfway across the world with a language barrier was a welcome challenge for Gielnik but the move has also tested her in ways that were unforeseen. It has also precipitated further introspection from a larger than life figure.\n\nWhatever the level of football, success is a personal and intimate topic. It is one that, in her quiet times, she has had to grapple with and redefine to her own satisfaction.\n\n“To put it this way, I don't personally feel like I've accomplished everything I wanted to at this club,” Gielnik said quietly.\n\n“I got to play for this club but in all fairness, I don't feel like I've been successful at this club. I haven't come here and scored a ton of goals.”\n\n“It’s really hard to overcome the feeling of failure and that's how I've actually felt here at Bayern and although I had a massive part of the team and I work hard … I don't feel as part of the success.”\n\n“The physical challenges are what I thought I was getting here, but I'm getting the mental challenge here as a footballer.”\n\nOn her own personal football journey, Bayern has proved to be one of the biggest challenges and the most instructive.\n\nGielnik’s time in Germany over the last year has become her greatest learning experience, demonstrating that perseverance and determination aren’t easily earned traits.\n\n“I could have left on several occasions and I had offers in the transfer window to great clubs, but I thought about it and you know that’s just not me.”\n\nLeaving and giving up and quitting it wasn’t me. I still wanted the opportunity to turn it around and see the light and to make the best of it and that's just like a part of my personality.”\n\n“The success, I will say, is that I came here as a player that the coach wanted. He wanted me because I was that different player but then wanted me to adjust adapt to the German style football and that's not in me.”\n\n“I had to stay true to myself.”\n\nEmily Gielnik is not sure what her next move will be. What is certain that wherever she goes she will once again be better equipped to face it.\n\nAfter all, they do say good things come to those who are wait – or a late bloomers."}, {"url": "https://beyond90.com.au/part-ii-the-making-of-emily-gielnik/", "page_content": "Emily Gielnik’s road to the national team from a 14 year old in the stands to a 20 year old Matildas debutante was the prologue.\n\nThe main feature would begin once she reached her dream. It also meant that reality would hit quickly and often as she moved in and out of the national team program.\n\n“My first couple of years in the Matildas, I had some big ups and some really big downs,” she shared.\n\n“I was just very inconsistent. I lost that sense of self-belief and I questioned whether or not I belonged in the team anymore.”\n\nLike many women’s footballers in the Australian system, Gielnik was juggling working and football. Unlike many others, Gielnik had decided go out on her own by creating a small fitness business, Shred Em fitness.\n\nStarted in her garage, it quickly grew to become a thriving business that kept the young entrepreneur occupied.\n\nHowever, the success off the field began to impact Gielnik’s success on it.\n\n“At one stage, Staj (Alen Stajcic) left me out of a tournament against China, which was actually the best thing for me. He had every right to do that because I didn’t believe I was worthy of being there,” she remembered.\n\n“I wasn’t training or performing the way I should’ve been and representing your country is a performance-based privilege.”\n\n“It served as a good chance for me to consider if and how I could come back from that. I was in and out of the squad for a couple of years and was juggling my personal training business, Shred Em, and was just not choosing football, so I had to make a tough decision.”\n\nGielnik made the call and put her business aspirations on hold to fully commit to football.\n\n“If you want to be at the top level you need to make those changes and really live at the top level, there is no 50/50 you are either all in or all out,” she said.\n\n“So in the end I gave up Shred Em, which I loved, but once I fully committed and just indulged myself into living and breathing the game, that’s when everything changed.\n\nhttps://www.instagram.com/p/BreDwIXB7bS/\n\nRe-finding focus\n\nDespite her re-commitment to the football, Gielnik found her form just a little too late ahead of the 2015 World Cup.\n\nWhile there were big changes occurring for the 24 year old off the pitch, there were more subtle but no less career altering changes occurring on the pitch.\n\nAt six feet, Emily Gielnik cuts a commanding figure on the football pitch. As a striker, there is the inclination to play her in the traditional centre forward role to utilise her height and strength.\n\nThat number 9 role was basis of her early success and selection in the Matildas. The problem with pigeon holing the forward into that traditional mindset is that it didn’t utilise all of Gielnik’s attributes.\n\nAs well as her height, Gielnik has always possessed deceptive pace. Running Shred Em Fitness and practicing what she was preaching saw her increase her aerobic capacity and become a more honed athlete. Along with her fitness work, she was also refining her football skills and touch and developing her final ball.\n\nSpeed, stamina, dribbling, crossing and goal scoring; Emily Gielnik was no longer a centre forward, she was a now built to be a winger. And out wide she went.\n\nA familiar theme\n\nBy the time 2016 Rio Olympic Games qualification came around in February 2016, the 24-year-old was back to feeling like she belonged.\n\n“I really got back into it after the World Cup, I was playing good football. I was happy and Alen brought me back into the squad.”\n\nThe Matildas had a barnstorming run to qualify for Rio. They finished the qualifiers undefeated, on top of the standings and, for the first time, the number one ranked team in Asia.\n\nRight in the thick of the action was Emily Gielnik, in her new role out wide.\n\n“We went to the Olympic qualifiers and did really well, it was the first time I’d felt good in a long time. My coach was positive and I was in the best physical condition I’d ever been in.”\n\nWhat followed next was six months of intense preparation for the chance at realising another lifetime dream – becoming an Olympian.\n\nScoring goals, playing her best football, with her confidence at an all-time high and her body in peak condition, Gielnik wasn’t prepared for what was to come.\n\n“I had that dreaded meeting where I was told I was the first player on standby for the Rio Olympics and had missed out by one spot,” she remembered.\n\n“That wasn’t just a tournament I was missing out on, the Olympics are so special and so prestigious, every kid dreams of being an Olympian one day, so to miss out was completely devastating.\n\n“That was the biggest emotional toll football has ever taken on me. I was genuinely heartbroken.”\n\nMoving forward, again\n\nAfter all the sporting adversity, the blow of missing out on the Olympic Games could have been the final straw for Gielnik.\n\nWhen asked if she considered throwing in the towel she said, “Not for a second.” In fact, it spurred the Queenslander on once again.\n\n“From that point on, I chose to never feel that again. I wanted to be in a position where, ‘No, you’re not coming,’ wasn’t an option anymore.”\n\nThe tenacious forward carried on with this mindset and into the 2017 Algarve Cup.\n\nThe tournament proved to be another breakthrough moment where she reminded naysayers why she deserved to be in the squad.\n\nScoring three goals during the Matildas campaign, the 2017 Algarve Cup was a tournament where Gielnik used everything in her arsenal to demonstrate why she is an imposing figure for full backs to contend with.\n\nWhile an ankle injury ruled Gielnik out of the 2018 Algarve Cup, by the time the AFC Women’s Asian Cup around, the winger was ready for her first major senior international tournament.\n\nGielnik played in three of Australia’s matches helping the Matildas qualify for the 2019 FIFA Women’s World Cup.\n\nVictorious mentality\n\nThe months following the 2018 AFC Women’s Asian Cup have been Emily Gielnik’s best yet.\n\nFootball was again the focus when the 26 year old moved her life from Brisbane to Melbourne to play for the Melbourne Victory.\n\nIt also saw a reunion with Jeff Hopkins, her first senior coach at Brisbane Roar. The result was a stellar season with her four goals and two assists helping her new side transform from two-time wooden spoon winners, to 2018/19 W-League Premiers.\n\nIt’s clear that although her athletic abilities are considerable, Emily Gielnik’s path to a Matildas regular is really a story about mindset.\n\nAs every inspirational sports instagram quote will tell you, sport is about mentality.\n\nWhen asked where her upbeat outlook and mental toughness comes from, Gielnik says it was something she needed to learn.\n\n“I was always my harshest critic and put so much pressure and expectation on myself,” she said.\n\n“I had to learn to take a step back and just enjoy the game without worrying what others think about me or how I should play.”\n\n“The shift came when I just got back to doing what’s natural and playing my own game.\n\n“When I got back to the old me, I realised how happy that made me both within and outside of football,” she said.\n\nEmily Gielnik's brilliant Matildas form 13 November ⚽️. 28 February ⚽️. 3 March ⚽️. Emily Gielnik has three goals in her last three appearances for the Westfield Matildas! Posted by Westfield Matildas on Sunday, 3 March 2019\n\nAnd her mindset extends to beyond just herself, also wanting the best for her team as a whole.\n\n“I think I am just a positive person, towards myself and towards other players. Even if someone plays over me, I genuinely want them to do well, I want that player to feel so good and I want us to win together.\n\n“As much as I love scoring goals, I love setting others up, so they get the glory.”\n\nThe next time Emily Gielnik pulls on the green and gold jersey, there will be an inscription on the inside that reads ‘Never Say Die.’ It is fitting for the poster girl for perseverance.\n\nIf Gielnik’s evolution is any indication, her greatest feats are yet to come."}, {"url": "https://fbref.com/en/players/140cee9f/Emily-Gielnik", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://www.olympics.com.au/olympians/emily-gielnik/", "page_content": "Fast Facts\n\nSport: Football\n\nEvent: Women's\n\nOlympic History: Tokyo 2020\n\nCoach: Tony Gustavsson\n\nYear Born: 1992\n\nState Born: Victoria\n\nAbout Emily\n\nEmily Gielnik had an Australian U19s debut for the ages, scoring a hat-trick on debut in October 2011.\n\nLess than 12 months later she received her first selection to the Matildas, appearing in a 3-0 defeat against Japan in July 2012 friendly.\n\nEmily was named in the Matildas Olympic qualifying squad for Rio 2016 and scored a goal against Vietnam, however wasn’t named in the final team for the Olympics.\n\nShe appeared in all three matches for Australia at the 2018 Asian Cup. The Matildas finished the tournament runners up to Japan after a tight 1-0 contest in the final.\n\nThe following year saw Emily’s international form rewarded with selection to the 2019 World Cup squad. In France, she appeared in three matches for Australia, with two of them as a starter.\n\nAt Tokyo 2020 Emily and the Matildas made all of Australia proud in putting together a historic achievement.\n\nTheir fourth place finish, which was nearly a podium finish after a 4-3 loss to the USA in the bronze medal game, is the highest ever finish by the Matildas at an Olympic Games.\n\nWith a W-League Premiership and Championship to her name, she has also amassed more than 50 caps for the Matildas and plays for Aston Villa."}, {"url": "https://footballqueensland.com.au/2018/04/05/gielnik-quest-golden-boot/", "page_content": "The Matildas touched down in Jordan last week, with the squad hitting their straps with the aim of adding a second AFC Women’s Asian Cup to their trophy cabinet.\n\nFootball Queensland journalist Chloe Walker spoke with Matildas and Brisbane Roar striker Emily Gielnik about her road to Jordan.\n\nThe shoe fits! Like Cinderella it was a race against the clock for Australian football player Emily Gielnik, but she has managed to escape the confines of her moonboot, trading Velcro straps for leather lace-ups just in time to make the Matildas squad for the 2018 AFC Women’s Asian Cup in Jordan. Moments before boarding her plane to Portugal for the 2018 Algarve Cup in early March, Gielnik received news that the excruciating pain in her ankle was a result of bone stress. She says it was a blessing in disguise as any further strain would have caused a fracture, sidelining the Matildas forward for 3-6 months. With a grueling strength and conditioning program combined with some TLC, Gielnik has beaten the odds and found her happily ever after in the Australian squad.\n\nGielnik says her most recent injury is the result of a prior ankle fracture following one of the biggest performances that sparked her professional career in 2012. Gielnik made her debut for the Young Matildas in the FIFA U20 Women’s World Cup qualifier against Vietnam scoring a hat-trick and changing the game for the green and gold, from three goals down to a 4-3 win. She says however, an evolution in her career has occurred more recently, coincidently in last year’s Algarve Cup, scoring three goals during the tournament against big name teams including China and The Netherlands.\n\n“It was a turning point for me not just scoring the goals but having a good tournament and the realisation that I wanted to do it (football) full-time and take it more seriously,” Gielnik says.\n\nGielnik, 25, was a late bloomer to the sport at age 12 when she began playing for Redlands United, already setting her sights high towards Brisbane Roar and Young Matildas. She says her pathway into the sport was quite different to others as it happened during a school trip to the Australian Institute of Sport where the Matildas were holding a training session.\n\n“It was actually my sports teacher who asked the coach at the time, Tom Sermanni, if I could have a session with them,” She says.\n\n“He (Sermanni) asked me to come back the next day and I played a game with them. Straight away he made the call to get me into the QAS (Queensland Academy of Sport) with Jeff Hopkins who was the head coach at the time.”\n\nGielnik’s professional football career began with the Brisbane Roar in 2009 where she later was dubbed the super-sub coming off the bench time and time again to score 12 goals in 2011-12 season.\n\n“I got second highest goal scorer for that year and I only played 5-10 minutes every game,” She says.\n\n“There was a lot of pressure to keep going on and scoring but it actually just kept happening.”\n\nHaving recently finished her eighth season loyal to her club, Gielnik is eager to go all the way with Brisbane Roar after they were knocked out in a devastating loss in Westfield W-League semi-final despite finishing minor premiers.\n\n“So we didn’t win and that’s just football; in the most important games any team can win on any given day and unfortunately it wasn’t us.”\n\nHowever, Gielnik’s season never ends with W-League. Throughout her career she has ventured to international clubs including Liverpool, Ottawa Fury in Canada, Urawa Red Diamonds in Japan and Avaldsnes IL in Norway. She says although the style of play differs from place to place, the W-league provides a high standard of football.\n\n“I don’t think we are far behind and sometimes I think we are a little bit ahead. Now we are starting to attract international big names as well as those in the American league coming over to play W-League.”\n\nDespite the W-League producing strong competition Gielnik says women’s football has a lot of catching up to do in the male oriented sport but it is growing every year. She says Brisbane Roar is already contributing to that growth by including the young Roar girls under-17s team to compete in the NPL Queensland Women’s competition.\n\n“I think it is a foot in the door for the girls to be exposed.”\n\nShe says the biggest issue is the lack of opportunities for exposure and is why Brisbane Roar are trying to provide a platform for youth girls teams as young as 13-14.\n\n“I think it needs a bit of work (the football pathway) but its heading in the right direction, so it’s a positive.”\n\nShe says her biggest advice to young up and comers is to be doing extra work outside of training.\n\n“Those willing to work a bit hard will be rewarded in the end.”\n\nOn top of her already busy schedule Gielnik also holds private coaching for girls that she believes are quite talented, this is on top of owning her own strength and condition gym ShedEm, teaching 16 classes a week.\n\nBeing selected to play for the green and gold in the 2018 AFC Women’s Asian Cup has crossed one goal off Gielnik’s list and if all goes well she is eager to compete in 2018 Tournament of Nations in the US after Matildas won the major competition last year putting them on the map.\n\nThe Matildas kick-off their Asian Cup campaign in Jordan on Sunday, April 8.\n\n\n\nAustralia’s AFC Women’s Asian Cup group stage fixtures\n\nAustralia | v | Korea Republic\n\nApril 8 | King Abdullah Stadium II, Amman, Jordan.\n\nKick-off: 3.00am (EST) Fox Sports\n\nVietnam | v | Australia\n\nApril 11 | Amman International Stadium, Amman, Jordan\n\nKick-off: 3.00am (EST) Fox Sport\n\nJapan | v | Australia\n\nApril 13 | Amman International Stadium, Amman, Jordan.\n\nKick-off: 11:45pm (EST) on Fox Sports\n\n2018 AFC Women’s Asian Cup groups\n\nGroup A: Jordan (Current FIFA world ranking: 50), China PR (13), Thailand (29), Philippines (70)\n\nGroup B: Japan (8), Australia (6), Korea Republic (15), Vietnam (31)\n\nMatildas squad:\n\nLydia Williams (GK), Caitlin Cooper, Aivi Luik, Clare Polkinghorne, Laura Alleway, Chloe Logarzo, Steph Catley, Elise Kellond-Knight, Alex Chidiac, Emily van Egmond, Lisa de Vanna, Casey Dumont (GK, Tameka Butt, Alanna Kennedy, Emily Gielnik, Hayley Raso, Kyah Simon, Mackenzie Arnold (GK), Katrina Gorry, Sam Kerr, Ellie Carpenter, Larissa Crummer, Michelle Heyman."}, {"url": "https://www.foxsports.com.au/football/w-league/emily-gielniks-move-to-melbourne-victory-is-paying-off-as-the-matilda-looks-to-lock-in-a-world-cup-spot/news-story/4ed1095158941733f24e097ec4ca275b", "page_content": "Emily Gielnik had a decision to make.\n\nLess than a year out from the Women’s World Cup, the dynamic winger had two options: stay at W-League powerhouse Brisbane Roar, the club she’d joined as a teenager — or take on a new challenge.\n\nThe latter option was joining her former Roar manager Jeff Hopkins at Melbourne Victory — a club trying to return from three years in the finals wilderness.\n\nWith the pain of missing out on the Matildas’ 2015 World Cup and 2016 Olympics squads still burning fiercely, Gielnik turned her back on the comfort of home and threw herself headlong into a move interstate.\n\n“Well to be honest, Jeff has asked me (to come to Victory) the last couple of years and it wasn’t until this year I made the move,” Gielnik told foxsports.com.au.\n\n“I think I personally needed a bit of a challenge, a change of environment, just being around a different diverse of players and I just really needed to challenge myself in football.\n\n“So I really feel like I just needed something new to be honest, I just didn’t want to become stagnant and be at the same place for such a long time.\n\n“But my loyalty was really, really important to me. If I could’ve, I would’ve stayed at Brisbane for the rest of my life, the rest of my football career.\n\n“But I really think that looking at the bigger picture in terms of the World Cup, this was a really critical move for me and … when I made the decision, it wasn’t overnight it was weeks and weeks and it was an emotional one.\n\n“So it was a really calculated decision and I think so far for me, it’s proven to be a good one.”\n\nEmily Gielnik and Laura Alleway celebrate (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\nSix weeks into the W-League season, Gielnik is reaping the rewards of her bold move.\n\nVictory is sitting pretty, undefeated and outright top of the table, with the winger nominated for the PFA’s recent W-League player of the month award.\n\nIn her five appearances for Victory, Gielnik has scored one goal, assisted one, made 10 key passes, created 11 chances and provided 23 crosses.\n\nShe’s also combined beautifully with captain Natasha Dowie and star playmaker Christine Nairn, with the trio comprising one of the W-League’s most intimidating attacks.\n\n“I think if you look at it in the perspective of a couple of weeks, it feels really good, obviously because of where we are as a team and everything,” Gielnik said.\n\n“And me personally, I’ve already felt a lot of improvement. Most importantly, it’s just in my happiness and my mentality more than anything and I’ve got a really good support network in terms of leaving home as well.\n\n“And obviously the staff here is great and obviously Jeff has the best intentions for me, so they’re really going above and beyond to try and cater for everything that I need football-wise. So that was really important to me in the lead up to making that decision to play for Victory.\n\n“But obviously I already feel a really good shift and a good change for me so far but I think there’s still over half a season to go and much more improvement that I’m longing for, definitely, with the World Cup being obviously in my sights but the team being the priority of course at the moment.”\n\nEmily Gielnik. (AAP Image/Julian Smith) Source: AAP\n\nIf moving states was one sacrifice that’s paid off, then Gielnik’s other big call was at least as significant.\n\nThe Matilda recently made the decision to end the lease on the gym she’s owned and run for several years — and admits pulling the pin on that ambition to focus solely on her football has lifted a weight off her shoulders.\n\n“To cut a long story short — I honestly just feel like things in my life are going good and I have such a great support network and I have really, really good friends and I started to really put football first,” Gielnik said.\n\n“My gym actually, ShredEm Fitness, that had been a lifelong dream for me that I opened before I was in the Matildas, I’ve actually just ended the lease there and decided to put all my focus into football. So that was a big thing for me.\n\n“Purely because football is not forever and that dream job is something I can always come back to, no matter the age. So I really just want to — after years and years of sacrifice to football, I thought this was really the ultimate thing to do just to give it everything that I’ve got and enjoy every single challenge and experience because I’m obviously lucky enough to have the opportunity to be a contracted Matilda at the moment.\n\n“So I weighed up some options and it’s not that I didn’t take it (football) seriously before, it’s just more that I’ve really made it a massive part of my life, which it has been for a long time.\n\n“And so I think I’ve been a lot happier and a lot more focused and I’ve really dedicated a lot of my time to it off the field as well now, more from a mental aspect and keeping myself in good condition and in other parts of fitness to make sure that I’m physically good on the park.”\n\nEmily Gielnik. (AAP Image/David Crosling) Source: AAP\n\nThis week Gielnik is set to face Brisbane for the first time since her move.\n\nWhile the winger admits she’s trying not to think about the experience of facing her old club, in front of her family and friends, there are understandably some nerves.\n\nThat said, she’s had plenty of people to lean on, with fellow ex-Roar players Angie Beard, Laura Alleway and Casey Dumont among the teammates she has at Victory.\n\nGielnik has also thrived under Hopkins, with the Victory manager a tough, but supportive leader, and it’s clear the winger is enjoying her time in Melbourne.\n\nWhile Gielnik came into a team that had struggled in recent years, it was also a club that had locked in a solid base of quality experienced and young players.\n\nThe Victory recruit highlights the culture and attitude of the group, along with the quality of the likes of Nairn and Dowie, as key reasons behind her renewed happiness and love of the game.\n\nEmily Gielnik celebrates with Christine Nairn. (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\n“I think we’re strong all over the park and I’m not just talking performance-wise and physically and in terms of football — I’m talking in terms of team culture and the positivity and we’ve got massive, massive depth within our team,” Gielnik said.\n\n“And I think that’s been almost the glue and something that’s been really critical this season that was really important to me ... so it’s really enjoyable and to be honest I’m really enjoying football.\n\n“And I think players say this a lot of times, like they say they enjoy football and sometimes you can have ups and downs and football’s not (fun) all the time but I think I’ve actually started to — apart from when I was a kid — have fun with it again.”\n\nGielnik is certainly playing like someone enjoying her football.\n\nThe Matilda has been in fine form for both club and country, recently showcasing her ability to have an impact off the bench with a tremendous goal against Chile in Newcastle.\n\nAustralia celebrate a goal from Emily Gielnik. (Photo by Ashley Feder/Getty Images) Source: Getty Images\n\nGielnik’s steely resolve before and during games is hard to miss, and while she’s enjoying her football, there is a clear drive behind her relentless approach.\n\nAs a 23-year-old, Gielnik missed out on the 2015 Women’s World Cup squad — having been cut by former coach Hesterine de Reus, before Alen Stajcic took over.\n\nThen, a year later, she missed out on the Olympics by one spot.\n\nNow 26, and a bona fide star of the W-League, Gielnik is clearly determined not to experience that disappointment again.\n\n“It’s a tough one because now things have been going well for the Matildas and stuff but at the end of the day I’ve never been to a World Cup or an Olympics,” Gielnik said.\n\n“I’ve missed out shyly of the Olympics by one spot and I was training with that team during the Olympic qualifiers and everything and to pull up short and to be cut from the World Cup (hurt) and this is the opportunity of a lifetime now and I most definitely don’t want anything distracting me (and) I don’t want to waste it.\n\n“So I’m really making sure I don’t lose focus on it and I give myself the best opportunity but I don’t lose myself as well while I’m doing that.\n\n“So yeah, it’s a big dream of mine and it would be a goal — a life goal to be achieved to be honest — and I think W-League’s the platform for that, without putting too much pressure on myself.\n\n“But it really is a platform for it and obviously a good opportunity for other players on a larger scale as well.”"}, {"url": "https://uk.soccerway.com/players/emily-gielnik/164110/", "page_content": "Matches of E. Gielnik\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://int.women.soccerway.com/players/emily-gielnik/164110/", "page_content": "Matches of E. Gielnik\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://www.celebsagewiki.com/emily-gielnik", "page_content": "Age, Biography and Wiki\n\nEmily Gielnik was born on 13 May, 1992 in Melbourne, Australia. Discover Emily Gielnik's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 31 years old?\n\nPopular As N/A Occupation N/A Age 31 years old Zodiac Sign Taurus Born 13 May 1992 Birthday 13 May Birthplace Melbourne, Australia Nationality Australia\n\nWe recommend you to check the complete list of Famous People born on 13 May. She is a member of famous with the age 31 years old group.\n\nEmily Gielnik Height, Weight & Measurements\n\nAt 31 years old, Emily Gielnik height is 1.83 m and Weight 68 kg.\n\nPhysical Status Height 1.83 m Weight 68 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nEmily Gielnik Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Emily Gielnik worth at the age of 31 years old? Emily Gielnik’s income source is mostly from being a successful . She is from Australia. We have estimated Emily Gielnik's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nEmily Gielnik Social Network\n\nTimeline"}], "Emily Gielnik scored the winning goal in the final against Japan.": [{"url": "https://7news.com.au/sport/olympics/matildas-fall-short-in-bronze-medal-match-against-usa-in-womens-soccer-at-tokyo-olympics-c-3605164", "page_content": "Emily Gielnik’s “goal of the tournament” gave the USA an almighty scare but the Matildas have fallen short of a history-making Olympic medal.\n\nGielnik’s searing strike in the 90th-minute brought the Matildas to a goal down in the bronze medal playoff against the Americans at Ibaraki Kashima Stadium in Tokyo on Thursday evening.\n\nWatch Gielnik’s searing strike in the video player above\n\nWatch the latest sport on Channel 7 or stream for free on 7plus >>\n\nBut an injury-time equaliser proved out of reach for Australia, who will rue conceding soft goals against in the 3-4 result as American stars Megan Rapinoe and Carli Lloyd scored two goals each.\n\nRapinoe opened the scoring when she squeezed a direct corner past Matildas goalkeeper Teagan Micah in the eighth minute.\n\nCaptain Sam Kerr put Australia on level terms in the 17th minute when she latched on to a Caitlin Foord through-ball to find the net at the near post.\n\nSam Kerr (left) in action against the USA at the Tokyo Olympics. Credit: Elsa / Getty Images\n\nHowever Rapinoe had her second four minutes later when she volleyed home a mistimed Alanna Kennedy clearance.\n\nLloyd tripled the advantage with goals either side of the half-time break, both thanks to some sloppy defending.\n\nThe first goal came a minute into injury time, as Lindsey Horan dispossessed Kyah Simon and cleverly slipped it to Lloyd, who took a touch on her right then rifled a brilliant left-footed strike past Micah.\n\nEmily Gielnik’s stunning strike wasn’t enough to get the Matildas the Olympic bronze medal. Credit: Elsa / Getty Images\n\nIn the 51st minute, Press chipped a high ball over the top and Kennedy, going toe-to-toe with Lloyd, didn’t get enough on her header back to Micah.\n\nFoord headed home in the 54th minute, when three minutes later Kerr headed Hayley Raso’s cross into the post and saw it cruelly deflect across goal to safety.\n\nGielnik’s stunning shot from the edge of the box in the 90th minute was labelled the “goal of the tournament” by Seven commentator Brenton Speed.\n\nAustralia pressed during injury time, but could not come up with a fourth goal as the USA clinched the bronze medal.\n\nThe fourth-place finish is Australia’s best in Olympic soccer.\n\n- With AAP"}, {"url": "https://wwos.nine.com.au/olympics/tokyo-olympics-2021-matildas-beaten-by-usa-in-bronze-medal-playoff/7731de6a-a357-4971-91c2-6321f667194d", "page_content": "Aug 5th, 2021\n\nAug 5th, 2021\n\nMegan Rapinoe and Carli Lloyd each scored a pair of goals and the United States won the bronze medal in women's soccer at the Tokyo Olympics with a 4-3 victory over Australia on Thursday.\n\nIt was arguably the best the Americans had looked during the course of a rocky tournament that opened with an uncharacteristic 3-0 loss to Sweden. Rapinoe set the tone early with a goal scored directly from a corner kick.\n\nOLYMPICS BLOG: UPDATES, LATEST NEWS | TOKYO GAMES EVENT CENTRE: SCHEDULE, RESULTS, MEDAL TALLY\n\nThe loss spoiled the Australians' first-ever trip to the medal round at the Olympics. No Australian soccer team, men or women, has ever won a medal.\n\nThe Matildas were the underdogs against the United States, the top-ranked team in the world and the defending World Cup champions who came to Japan hoping for a fifth gold medal. But the Americans struggled at times during the tournament, including a 1-0 loss to Canada in the semi-finals. The Canadians hadn't defeated their North American counterparts since 2001.\n\nKASHIMA, JAPAN - AUGUST 05: Steph Catley #7 of Team Australia is consoled by Laura Brock #21 following defeat in the Women's Bronze Medal match between United States and Australia on day thirteen of the Tokyo 2020 Olympic Games at Kashima Stadium on August 05, 2021 in Kashima, Japan. (Photo by Elsa/Getty Images) (Getty)\n\nThe U.S. team that came out against Australia looked completely different.\n\nRapinoe scored from a corner kick in the eighth minute to give the Americans an early lead. It was the second time Rapinoe has scored an Olimpico, as goals from corners are known: She also had one in the semi-finals of the 2012 Olympics against Canada.\n\nSam Kerr pulled the Australians even with a goal in the 17th minute that got past U.S. goalkeeper Adrianna Franch.\n\nFranch got her first start in a major tournament in place of Alyssa Naeher, who injured her right knee in the U.S. team's semifinal loss to Canada.\n\nKASHIMA, JAPAN - AUGUST 05: Emily Gielnik #15 of Team Australia celebrates with Laura Brock #21 after scoring their side's third goal during the Women's Bronze Medal match between United States and Australia on day thirteen of the Tokyo 2020 Olympic Games at Kashima Stadium on August 05, 2021 in Kashima, Japan. (Photo by Elsa/Getty Images) (Getty)\n\nJust 27, Kerr became the all-time leading scorer for the Australians with 48 goals. She led all scorers remaining in the tournament with six goals.\n\nRapinoe's second goal came on a stunning volley in the 21st, and it became obvious that the Australians were missing defender Ellie Carpenter, who was handed a red card late in the Matildas' 1-0 semi-final loss to Sweden.\n\nLloyd made it 3-1 in first-half stoppage time when her left-footed shot got past Australia goalkeeper Teagan Micah. She added another on a break in the 51st minute, giving her a U.S. record 10 career Olympic goals.\n\nThe Matildas fall to Team USA in their bronze match playoff. (Getty)\n\nLloyd made her 312th appearance for the national team in the match, passing Christie Rampone for second on the all-time list. Kristine Lilly leads the career appearances list with 354.\n\nLloyd is 39 and likely playing in her last major tournament. When she was replaced in the 81st minute, teammates ran over to offer handshakes and high-fives, and the bench gave her a standing ovation.\n\nCaitlin Foord kept the Australians in the game with a goal in the 54th minute before Emily Gielnik scored to narrow it further in the 90th, but ultimately the Matildas couldn't make up the difference.\n\nAlex Morgan got hurt in stoppage time and had to be helped off the field. It appeared that she injured her left leg but there was no immediate word on her condition.\n\nThe Australians had already met the United States at the Tokyo Olympics, holding the Americans to a scoreless draw in the final game of the group stage. Australia was also the only team in the group to score on the Swedes, who are headed for the gold medal match Friday against Canada.\n\nThe Matildas fall to Team USA in their bronze match playoff. (Getty)\n\nThe U.S. team's tournament-opening loss to to Sweden snapped a 44-match unbeaten streak. After a rebound victory over New Zealand came the scoreless draw with Australia. In the quarterfinals, the U.S. got past the Netherlands on a penalty shootout.\n\nBut they were thwarted in a quest to become the first team to win an Olympics after a World Cup title by their Canadian rivals. Jessie Fleming scored on a penalty kick in the 74th minute for the game's lone goal.\n\nThe United States has reached the gold medal match at the Olympics five times. The Americans have four gold medals, more than any other team since women's soccer became an Olympic sport in 1996.\n\nBut it is the second Olympics they have failed to reach the gold medal match. They were beaten by Sweden in the quarterfinals five years ago in Brazil.\n\nFor a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here"}, {"url": "https://www.foxsports.com.au/football/w-league/emily-gielniks-move-to-melbourne-victory-is-paying-off-as-the-matilda-looks-to-lock-in-a-world-cup-spot/news-story/4ed1095158941733f24e097ec4ca275b", "page_content": "Emily Gielnik had a decision to make.\n\nLess than a year out from the Women’s World Cup, the dynamic winger had two options: stay at W-League powerhouse Brisbane Roar, the club she’d joined as a teenager — or take on a new challenge.\n\nThe latter option was joining her former Roar manager Jeff Hopkins at Melbourne Victory — a club trying to return from three years in the finals wilderness.\n\nWith the pain of missing out on the Matildas’ 2015 World Cup and 2016 Olympics squads still burning fiercely, Gielnik turned her back on the comfort of home and threw herself headlong into a move interstate.\n\n“Well to be honest, Jeff has asked me (to come to Victory) the last couple of years and it wasn’t until this year I made the move,” Gielnik told foxsports.com.au.\n\n“I think I personally needed a bit of a challenge, a change of environment, just being around a different diverse of players and I just really needed to challenge myself in football.\n\n“So I really feel like I just needed something new to be honest, I just didn’t want to become stagnant and be at the same place for such a long time.\n\n“But my loyalty was really, really important to me. If I could’ve, I would’ve stayed at Brisbane for the rest of my life, the rest of my football career.\n\n“But I really think that looking at the bigger picture in terms of the World Cup, this was a really critical move for me and … when I made the decision, it wasn’t overnight it was weeks and weeks and it was an emotional one.\n\n“So it was a really calculated decision and I think so far for me, it’s proven to be a good one.”\n\nEmily Gielnik and Laura Alleway celebrate (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\nSix weeks into the W-League season, Gielnik is reaping the rewards of her bold move.\n\nVictory is sitting pretty, undefeated and outright top of the table, with the winger nominated for the PFA’s recent W-League player of the month award.\n\nIn her five appearances for Victory, Gielnik has scored one goal, assisted one, made 10 key passes, created 11 chances and provided 23 crosses.\n\nShe’s also combined beautifully with captain Natasha Dowie and star playmaker Christine Nairn, with the trio comprising one of the W-League’s most intimidating attacks.\n\n“I think if you look at it in the perspective of a couple of weeks, it feels really good, obviously because of where we are as a team and everything,” Gielnik said.\n\n“And me personally, I’ve already felt a lot of improvement. Most importantly, it’s just in my happiness and my mentality more than anything and I’ve got a really good support network in terms of leaving home as well.\n\n“And obviously the staff here is great and obviously Jeff has the best intentions for me, so they’re really going above and beyond to try and cater for everything that I need football-wise. So that was really important to me in the lead up to making that decision to play for Victory.\n\n“But obviously I already feel a really good shift and a good change for me so far but I think there’s still over half a season to go and much more improvement that I’m longing for, definitely, with the World Cup being obviously in my sights but the team being the priority of course at the moment.”\n\nEmily Gielnik. (AAP Image/Julian Smith) Source: AAP\n\nIf moving states was one sacrifice that’s paid off, then Gielnik’s other big call was at least as significant.\n\nThe Matilda recently made the decision to end the lease on the gym she’s owned and run for several years — and admits pulling the pin on that ambition to focus solely on her football has lifted a weight off her shoulders.\n\n“To cut a long story short — I honestly just feel like things in my life are going good and I have such a great support network and I have really, really good friends and I started to really put football first,” Gielnik said.\n\n“My gym actually, ShredEm Fitness, that had been a lifelong dream for me that I opened before I was in the Matildas, I’ve actually just ended the lease there and decided to put all my focus into football. So that was a big thing for me.\n\n“Purely because football is not forever and that dream job is something I can always come back to, no matter the age. So I really just want to — after years and years of sacrifice to football, I thought this was really the ultimate thing to do just to give it everything that I’ve got and enjoy every single challenge and experience because I’m obviously lucky enough to have the opportunity to be a contracted Matilda at the moment.\n\n“So I weighed up some options and it’s not that I didn’t take it (football) seriously before, it’s just more that I’ve really made it a massive part of my life, which it has been for a long time.\n\n“And so I think I’ve been a lot happier and a lot more focused and I’ve really dedicated a lot of my time to it off the field as well now, more from a mental aspect and keeping myself in good condition and in other parts of fitness to make sure that I’m physically good on the park.”\n\nEmily Gielnik. (AAP Image/David Crosling) Source: AAP\n\nThis week Gielnik is set to face Brisbane for the first time since her move.\n\nWhile the winger admits she’s trying not to think about the experience of facing her old club, in front of her family and friends, there are understandably some nerves.\n\nThat said, she’s had plenty of people to lean on, with fellow ex-Roar players Angie Beard, Laura Alleway and Casey Dumont among the teammates she has at Victory.\n\nGielnik has also thrived under Hopkins, with the Victory manager a tough, but supportive leader, and it’s clear the winger is enjoying her time in Melbourne.\n\nWhile Gielnik came into a team that had struggled in recent years, it was also a club that had locked in a solid base of quality experienced and young players.\n\nThe Victory recruit highlights the culture and attitude of the group, along with the quality of the likes of Nairn and Dowie, as key reasons behind her renewed happiness and love of the game.\n\nEmily Gielnik celebrates with Christine Nairn. (Photo by Scott Barbour/Getty Images) Source: Getty Images\n\n“I think we’re strong all over the park and I’m not just talking performance-wise and physically and in terms of football — I’m talking in terms of team culture and the positivity and we’ve got massive, massive depth within our team,” Gielnik said.\n\n“And I think that’s been almost the glue and something that’s been really critical this season that was really important to me ... so it’s really enjoyable and to be honest I’m really enjoying football.\n\n“And I think players say this a lot of times, like they say they enjoy football and sometimes you can have ups and downs and football’s not (fun) all the time but I think I’ve actually started to — apart from when I was a kid — have fun with it again.”\n\nGielnik is certainly playing like someone enjoying her football.\n\nThe Matilda has been in fine form for both club and country, recently showcasing her ability to have an impact off the bench with a tremendous goal against Chile in Newcastle.\n\nAustralia celebrate a goal from Emily Gielnik. (Photo by Ashley Feder/Getty Images) Source: Getty Images\n\nGielnik’s steely resolve before and during games is hard to miss, and while she’s enjoying her football, there is a clear drive behind her relentless approach.\n\nAs a 23-year-old, Gielnik missed out on the 2015 Women’s World Cup squad — having been cut by former coach Hesterine de Reus, before Alen Stajcic took over.\n\nThen, a year later, she missed out on the Olympics by one spot.\n\nNow 26, and a bona fide star of the W-League, Gielnik is clearly determined not to experience that disappointment again.\n\n“It’s a tough one because now things have been going well for the Matildas and stuff but at the end of the day I’ve never been to a World Cup or an Olympics,” Gielnik said.\n\n“I’ve missed out shyly of the Olympics by one spot and I was training with that team during the Olympic qualifiers and everything and to pull up short and to be cut from the World Cup (hurt) and this is the opportunity of a lifetime now and I most definitely don’t want anything distracting me (and) I don’t want to waste it.\n\n“So I’m really making sure I don’t lose focus on it and I give myself the best opportunity but I don’t lose myself as well while I’m doing that.\n\n“So yeah, it’s a big dream of mine and it would be a goal — a life goal to be achieved to be honest — and I think W-League’s the platform for that, without putting too much pressure on myself.\n\n“But it really is a platform for it and obviously a good opportunity for other players on a larger scale as well.”"}, {"url": "https://wiki2.org/en/Emily_Gielnik", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAustralian soccer player\n\nEmily Gielnik (born 13 May 1992) is an Australian professional soccer player who plays as a forward for Aston Villa of the FA WSL. and the Australia women's national team. She previously played for Brisbane Roar and Melbourne Victory in her native Australia, Liverpool in England, Urawa Red Diamonds in Japan, Avaldsnes IL in Norway, Bayern Munich in Germany, and Vittsjö GIK in Sweden. On 2 September 2021 she signed for Aston Villa in WSL league\n\nYouTube Encyclopedic\n\n1 / 5 Views: 970 1 046 321 1 104 573\n\nEmily Gielnik - W-League Golden Boot 2020/21\n\nEmily Gielnik Wonder Goals Westfield Matildas\n\nEmily Gielnik Westfield W-League highlights\n\nEmily Gielnik's golden rule broken: Australia's 'UN' Matilda in Birmingham | Optus Sport Originals\n\nEmily Gielnik - My Westfield Matildas Story Transcription\n\nClub career\n\nBrisbane Roar, 2009–2018\n\nBorn in Melbourne, Gielnik moved to Queensland at the age of seven. After stopping basketball due to injuries she took up soccer and was eventually signed by Brisbane Roar for the second season of the W–League.[1] At Brisbane she became recognised as a \"super sub\" for her knack of coming off the substitutes' bench to score late goals.[2] Gielnik played eight seasons at Brisbane, appearing in 83 games and scoring 30 goals. She won the W-League Championship in 2010–11 and the Premiership in 2012–13 and 2017–18.[3]\n\nLiverpool LFC and Ottawa Fury, 2012–2013\n\nIn May 2012, Gielnik signed for English club Liverpool L.F.C., during the 2012 FA WSL season.[4] In October 2012, she was one of ten players to be released by Liverpool's new manager Mark Beard.[5] In 2013, Gielnik joined Ottawa Fury for their W-League season.[6]\n\nUrawa Red Diamonds, 2016\n\nAfter the 2016 Olympics, Gielnik joined Japanese club Urawa Red Diamonds.[7]\n\nAvaldsnes IL, 2017\n\nGielnik joined Norwegen team Avaldsnes IL for the 2017 season. She had a breakout season with the team, scoring eight goals in league play. Avaldsnes finished second in the Toppserien and won the Norwegian Cup.[8]\n\nMelbourne Victory, 2018–2019\n\nGielnik signed with Melbourne Victory for the 2018–19 W-League season.\n\nBayern Munich, 2019–2020\n\nOn 23 August 2019, Gielnik joined German Frauen-Bundesliga club Bayern Munich.[9] In July 2020, she left the club after making only 6 appearances, partially due to injury.[10]\n\nVittsjö, 2020\n\nA week after leaving Bayern Munich, Gielnik signed with another European club, joining Swedish club Vittsjö.[11]\n\nBrisbane Roar, 2020–\n\nIn November 2020, Gielnik returned Australia, signing with her hometown club, Brisbane Roar.[12]\n\nInternational career\n\nGielnik scored a hat-trick on her international debut for Australia U-19s in October 2011.[1] She made her first appearance for the senior Matildas team in a 3–0 friendly defeat to World champions Japan in Tokyo on 11 July 2012.[13]\n\nGielnik was named to the Australian squad for 2016 Olympic Qualifying, she scored a goal against Vietnam.[14] Australia won the tournament and qualified for the 2016 Summer Olympics.\n\nGielnik was part of the Matildas squad that won the 2017 Tournament of Nations and defeated the United States for the first time ever.[15]\n\nAt the 2018 AFC Women's Asian Cup Gielnik appeared in three matches for Australia. The Matildas advanced to the final, but lost to Japan 1–0. Australia qualified for the 2019 FIFA Women's World Cup.[16]\n\nIn May 2019, Gielnik was named to her first World Cup team.[17] At the World Cup Gielnik appeared in three matches for Australia, starting two of them. In the Round of 16 against Norway, she entered the match as a second-half substitute replacing Hayley Raso. With the match tied 1–1 after extra-time, the game went to penalties. Gielnik was the second penalty taker for Australia, she had her penalty saved. Australia lost to Norway 4–1 on penalties and were eliminated from the World Cup.[18]\n\nGielnik was selected for the Australian women's football Matildas soccer team which qualified for the Tokyo 2020 Olympics. The Matildas advanced to the quarter-finals with one victory and a draw in the group play. In the quarter-finals they beat Great Britain 4-3 after extra time. However, they lost 1–0 to Sweden in the semi-final and were then beaten 4–3 in the bronze medal playoff by USA.[19] Full details.\n\nCareer statistics\n\nInternational goals\n\nHonors\n\nClub\n\nBrisbane Roar\n\nAvaldsnes IL\n\nNorwegian Cup: 2017\n\nMelbourne Victory\n\nInternational\n\nAustralia\n\nIndividual\n\nReferences"}, {"url": "https://beyond90.com.au/part-i-the-making-of-emily-gielnik/", "page_content": "If there was ever a moment that encapsulates the evolution of Emily Gielnik, it was a superb strike against Korea Republic in the 2019 Cup of Nations.\n\nDeep in the match, the 26 year old drifted in from the left wing, sized up the full back, cut inside and rifled a strike at the near post.\n\nIt was a strike of a player full of confidence and at the height of her powers.\n\nGielnik has become a hot topic of conversation for women’s football fans of late, with her newly-commanding presence on the pitch leaving those new to the game wondering where this prolific forward came from.\n\nHer story is one of resilience, grit and determination. One of being knocked down and finding your steel.\n\nMaking choices\n\nIt was not a forgone conclusion that Gielnik would end up in football. Like many Matildas, Gielnik was a naturally gifted athlete from a young age with a penchant towards competing with the best.\n\nA basketballer to begin with, it was a serendipitous intervention from her mother that led to her finding a ball at her feet.\n\n“I was one of those kids who could play any sport, I was very competitive and would play basketball and rugby against the boys,” Gielnik said.\n\n“Mum would stress about me getting injured, so as a compromise, I convinced her to let me play football instead and that’s where my journey started.”\n\nGielnik realised early on that she had a knack for scoring goals – it would be a theme of her career.\n\n“In the early days, I was never about the discipline or the skill of football, I just played for fun and would score from anywhere and everywhere.”\n\n“I actually scored 62 goals the first school season I played and most of them were toe punts because I’d never had a coach to teach me that technique back then.”\n\nOnce she received the proper coaching her transition to the beautiful game was seamless. Soon the Queenslander would be impressing those around her, resulting in her selection for U12s State Team.\n\n“When I first started playing in a proper team, I had a world of confidence,” she remembered.\n\n“I was in my prime. I wasn’t the most skilled player, but I had the speed, agility and competitiveness that helped me pick things up really quickly.”\n\nThis natural athletic ability would continue to guide her to success.\n\nTaking the long road\n\nCheryl Salisbury, Diane Alagich, Joey Peters, Heather Garriock – they are some of the luminaries of Australian women’s football.\n\nAnd in 2007 in Coffs Harbour, they were preparing for what would be a history making FIFA Women’s World Cup campaign in China.\n\nWatching on was a young Emily Gielnik and what she saw on that day changed the trajectory of her life.\n\n“As soon as I saw the Matildas play in Coffs Harbour when I was 14, I knew I wanted to make the team one day,” Gielnik said.\n\nAlthough the decision was made in her young mind, Gielnik’s pathway to elite football was not going to be easy, nor conventional.\n\nShe learnt early on, that she was going to have to make the journey her own.\n\n“That year [2007] was really tough for me as I’d had some bad injuries and missed out on selection. So I took a year off, which was really make or break for me.”\n\n“A lot of my friends received invitations from the Queensland Academy of Sport (QAS) but having that year off combined with some injuries meant I didn’t make it.\n\n“All I wanted was to play in the Young Matildas and the W-League. I saw everyone get ahead of me, which was tough, but it didn’t deter me, it motivated me to find another way.”\n\nWhile it felt like doors were closing around the young footballer, in another fortuitous moment, a door opened up for Gielnik. And again, it involved the Matildas.\n\n“After I missed out on QAS, I went on a school tour to the Australian Institute of Sport and the Matildas just happened to be training there with Tom Sermanni. My school coach asked if I could join in and I had an absolute blinder,” Gielnik recalled.\n\n“I was 15, totally intimidated and playing against the best female footballers in the country, but Tom called my coach afterwards wanting to get me into the QAS program and that was where I found my way in.”\n\nMastering the art of resilience\n\nBeing a part of the QAS program opened new avenues for Gielnik.\n\nThat same year she also achieved another one of her goals by making the Brisbane Roar squad for the inaugural W-League season in 2008.\n\nCoached by Jeff Hopkins, it was a Brisbane Roar team littered with some of the greats of Australian women’s football in Kate McShea and future stars including Clare Polkinghorne, Tameka Butt and Elise Kellond-Knight-Knight.\n\nAgain, the progress was tempered by a setback, The 16 year old was sidelined for the entire season after sustaining a stress fracture to her ankle.\n\nNot for the first time in her young career, Gielnik would have to call on her resilience. Gielnik didn’t have time to grieve, as her eyes were firmly set on recovering and proving herself to her teammates and to herself.\n\n“When I first made the Brisbane Roar squad, I was so nervous and more than anything I just wanted to gain the respect of the older players,” she shared.\n\n“It took me a long time to believe I deserved to be there. I was disciplined and just spent the first few seasons earning my spot and spending a lot of time in the grandstands and on the bench.”\n\nGielnik believes it was a change in mindset that led to her performance improving and earning her moniker, the ‘super sub.’\n\n“After years of injury, missing out on squads and spending finals in the grandstands, I finally got my chance in the 2011/12 season.”\n\n“I was subbed on in extra time and in that season scored 12 goals, all while only being on for five or 10 minutes.\n\n“It wasn’t until I started to believe in myself and prove my worth, that everything came together.”\n\nHer form continued and Gielnik ticked another goal off her list, making the Young Matildas squad.\n\nDuring her junior national team debut at the AFC U19 Women’s Championships, the then 19-year-old took the Young Matildas from a 3-1 deficit to a 4-3 win, when she scored an incredible hattrick in the second half.\n\n“During that game, I really felt like I hadn’t played a good first half of football,” she said of her first match as a Young Matilda.\n\n“We were down 1-0 and I was panicking. I thought to myself, ‘I’m going to be subbed off on my debut,’ but then I scored that first goal which gave me so much confidence and I just kept scoring.”\n\n“That game was a real turning point in my career and one of my key memories in the green and gold.”\n\n“For the first time I felt like I belonged and deserved to be in that team. It showed me that even though you may have some bad minutes or a bad half there is always a way to turn it around.”\n\nAnd turn it around she did, making her debut for the senior Matildas the following year in Japan.\n\n“It was so overwhelming because there were so many girls in that team I had idolised and never truly believed I would be up there with,” Gielnik recounted of her Matildas debut.\n\n“Instead of looking up to them as a fan, I was now competing for their position which was pretty surreal.\n\n“It came to a point where I had to see myself as an equal and understand that I had a job to do in representing my country.\n\n“Instead of thinking about how lucky I was, I had to embrace that this was now my reality.”\n\nThe 14 year old who had watched her heroes years before was now playing alongside them in the jersey she dreamed to pull on.\n\nPART II: The making of Emily Gielnik will be published on 17 March\n\nRelated Images:"}, {"url": "https://www.myfootball.com.au/news/watch-gielniks-stunning-goal-bayerns-huge-champions-league-win", "page_content": "Westfield Matildas attacker Emily Gielnik has scored her first goal for Bayern Munich as the German club put one foot in the Semi Finals of the UEFA Women's Champions League.\n\nGielnik scored Bayern’s fourth goal in an emphatic 5-0 win away at Kazakhstan side BIIK Kazygurt in the first leg of their Quarter Final tie.\n\nAnd it was an impressive strike from the 27-year-old forward.\n\nRacing on to an impressive through ball, Gielnik hit her shot first time from just outside the box, curling the ball past the keeper into the far corner of the net.\n\nSEE GIELNIK'S GOAL IN THE TWEET BELOW\n\n\n\nIt was her first full 90 minutes since joining the German giants in August.\n\nGielnik, who has played 31 times for the Westfield Matildas, will hope she can carry her goalscoring form into the weekend’s Frauen Bundesliga match against Potsdam.\n\nThe Quarter Final second leg tie will be played in Munich on Thursday, August 31.\n\n\n\nElsewhere, Alex Chidiac’s Atletico Madrid picked up a solid result in their first leg away from home against English heavyweights Manchester City.\n\nAn 81st-minute goal from Veronica Charlyn Corra allowed Atletico to snatch a 1-1 draw to take back to Madrid for the second leg in a fortnight.\n\nJoe Montemurro’s Arsenal are also in the box seat for a spot in the Women’s UCL Semi Finals after crushing Czech side Slavia Prague 5-2 away from home.\n\nGALLERY: Westfield Matildas' 40th anniversary celebrations\n\nNEWS: Ex-Westfield Matildas star Munoz calls time on playing career\n\n'IT MEANT SO MUCH TO US': Dolan remembers history-making international"}, {"url": "https://www.matildas.com.au/news/watch-gielniks-stunning-goal-bayerns-huge-champions-league-win", "page_content": "Westfield Matildas attacker Emily Gielnik has scored her first goal for Bayern Munich as the German club put one foot in the Semi Finals of the UEFA Women's Champions League.\n\nGielnik scored Bayern’s fourth goal in an emphatic 5-0 win away at Kazakhstan side BIIK Kazygurt in the first leg of their Quarter Final tie.\n\nAnd it was an impressive strike from the 27-year-old forward.\n\nRacing on to an impressive through ball, Gielnik hit her shot first time from just outside the box, curling the ball past the keeper into the far corner of the net.\n\nSEE GIELNIK'S GOAL IN THE TWEET BELOW\n\n\n\nIt was her first full 90 minutes since joining the German giants in August.\n\nGielnik, who has played 31 times for the Westfield Matildas, will hope she can carry her goalscoring form into the weekend’s Frauen Bundesliga match against Potsdam.\n\nThe Quarter Final second leg tie will be played in Munich on Thursday, August 31.\n\n\n\nElsewhere, Alex Chidiac’s Atletico Madrid picked up a solid result in their first leg away from home against English heavyweights Manchester City.\n\nAn 81st-minute goal from Veronica Charlyn Corra allowed Atletico to snatch a 1-1 draw to take back to Madrid for the second leg in a fortnight.\n\nJoe Montemurro’s Arsenal are also in the box seat for a spot in the Women’s UCL Semi Finals after crushing Czech side Slavia Prague 5-2 away from home.\n\nGALLERY: Westfield Matildas' 40th anniversary celebrations\n\nNEWS: Ex-Westfield Matildas star Munoz calls time on playing career\n\n'IT MEANT SO MUCH TO US': Dolan remembers history-making international"}, {"url": "https://fbref.com/en/players/140cee9f/Emily-Gielnik", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://www.telegraph.co.uk/football/2021/10/01/emily-gielnik-interview-gave-basketball-played-bayern-munich/", "page_content": "“Basketball was my first love in sport - my height [she is six foot] was useful but I was just a go-getter, I had so much energy back then, I was just running everyone down,” she said. “I was playing at a high level when I was younger and I’d also played rugby league with the boys through school and made it to the next level with the district team - I scored a few tries, but the boys in there were absolutely huge, so district level was the last stop for me. But football was definitely the right choice.\n\n“My Mum didn’t want me playing football initially, she thought basketball was a safer option, I loved it, but then it became too much once I played football as well at the age of 12, I had to decide, and football took over.”\n\nA good choice. Gielnik's gilded, and nomadic, career has taken her to the top flights in Canada, Japan, Norway, Sweden and Germany - where she played for Bayern Munich - as well as Australia. Now she intends to make Villa a more permanent home.\n\n“That’s been a personal preference of mine, I’ve always only signed a one-year contract,” Gielnik added. “This is the first year where I’ve signed a 1+1. That’s a big shift for me, which means I’ve had a good feeling about this club.\n\n“I’ve wanted to really experience all the different styles of football and the different cultures, and where I can develop in different countries, so I’m pretty fortunate that I’ve been around the world. That was my decision, and I’m glad I’ve done it that way, I’ve definitely grown from having been in all those situations, and now I’ve landed here.”\n\nYet, Gielnik is not a Women’s Super League debutant. Her goal for Villa at Brighton was her first in the WSL for more than nine years, since she netted for Liverpool in a 3-3 draw away at Notts County in 2012. She spent one season on Merseyside, but knows she returns now transformed as a player, and to a completely changed league.\n\n“It was always on my radar, to end up back in the WSL, but I don’t really want to count it as being in the WSL 10 years ago, because that was not the league it is now. The WSL has come on leaps and bounds. Back then with Liverpool, I was only training twice a week, so I’m kind of treating this as my first time here.\"\n\nLife at Villa - who host league leaders Arsenal on Saturday - is going well so far, as they have seven points from their opening three goals, boosted by her strike at Brighton, a calm finish into the corner after being played through one-on-one.\n\n“Getting the winner and getting my first goal, I felt I kind of needed to get that one out of the way,\" she said. \"Those first few games, you want to start strong and get some points on the board early.”\n\nThe English league looks set to suit Gielnik's strong, quick and clinical style. “I wouldn’t say I’m the most technical striker but I’m a very counter-attacking, ball-in-behind, fast-paced, off-the-shoulder kind of player,\" she added. \"I’m not much of a dribbler, but I love on the end of crosses and I also love delivering crosses, breaking the lines and getting in behind.”\n\nHer move to Villa was one that almost didn’t happen, after multiple approaches from the West Midlands club, before she was ultimately persuaded to move on September’s deadline day after a short spell with Swedish top-tier side Vittsjo GIK.\n\nGielnik explained: “I’d had several conversations with my agent, just telling him to politely decline any others that had come through during the Olympics, so there were a few knock-backs already to Carla [Ward], but she was pretty persistent and that actually worked on me in the end because I actually needed a change. Carla had belief in me and wants me to progress. I told her how adamant I am to improve and get better and she is willing to provide that.\n\n“The question I asked Carla was just about the team: Is it good people and is it a good environment? Those were the two big things for me. After a few phone calls, it turned out to be the right thing for me to do. Now I’ve landed here so hopefully I can gain some consistency here at this club and lead myself into the 2023 World Cup.”"}, {"url": "https://www.bbc.co.uk/sport/football/58421345", "page_content": "Last updated on .From the section Women's Football\n\nEmily Gielnik has scored 10 times in 43 international appearances for Australia\n\nAston Villa have signed Australia international striker Emily Gielnik for the 2021-22 Women's Super League season from Swedish club Vittsjö GIK.\n\nGielnik, 29, will be making her second appearance in English club football after spending a season with Liverpool in 2012-13.\n\nThe move, subject to international travel clearance, is Villa boss Carla Ward's ninth summer signing.\n\n\"Emily is someone we've monitored for a few months,\" said Ward.\n\n\"She's a player with a wealth of domestic and international experience. With her link-up play and aerial threat, she is a player that can score goals at the highest level.\"\n\nVilla, who came 10th last term, winning just three of their 22 matches, start the new WSL season this Saturday with a home game against Leicester City (12:30 BST)."}]}