{"Tom Izzo was elected to the Naismith Basketball Hall of Fame in 2016.": [{"url": "https://www.hoophall.com/hall-of-famers/tom-izzo", "page_content": "About The Hall\n\nLocated in Springfield, Massachusetts, the Naismith Memorial Basketball Hall of Fame is an independent non-profit 501(c)(3) organization dedicated to promoting, preserving and celebrating the game of basketball at every level. The Hall of Fame has more than 400 inductees and 40,000 sq. ft. of basketball history. Nearly 200,000 people visit the Hall of Fame Museum each year to learn about the game, experience the interactive exhibits and test their skills on the Jerry Colangelo \"Court of Dreams.\" Best known for its annual marquee Enshrinement Ceremony honoring the game’s elite, the Hall of Fame also operates over 70 high school and collegiate competitions annually throughout the country and abroad.\n\nNaismith Memorial Basketball Hall of Fame\n\n1000 Hall of Fame Avenue\n\nSpringfield, Massachusetts 01105\n\n1-877-4HOOPLA\n\nThe Basketball Hall of Fame makes no representation concerning, and is not responsible for the quality, content, accessibility, nature or reliability of any hyperlinked site. While all attempts are made to ensure the correctness and suitability of information under our control and to correct any errors brought to our attention, no representation or guarantee can be made as to the accessibility, correctness or suitability of information provided by any hyperlinked site or any other linked information accessed through the Basketball Hall of Fame website but not under its control.\n\nCopyright Notice and Use Agreement\n\nSite strategy and design by GO"}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/17485035/the-10-steps-led-michigan-state-coach-tom-izzo-hall-fame", "page_content": "On Friday, Tom Izzo will be inducted into the Naismith Memorial Basketball Hall of Fame, the defining moment of the Michigan State coach's career.\n\nNo one necessarily sets out to get to the Hall of Fame. Instead one stepping stone leads to the next and the next, slowly building a career that winds its way to Springfield, Massachusetts. Izzo is no different. He was an ex-player who simply wanted to be a coach, and a coach who desperately wanted to win. All of that just so happened to add up to a Hall of Fame worthy career.\n\nBut some steps were bigger and more important than others, starting points or turning points that, when strung together, led the Michigan State Spartans' coach to the 2016 class.\n\nHere then are the moments that made Izzo's defining moment possible:\n\n1. A news brief\n\nThe news brief from The Mining Journal, the paper of record in the Upper Peninsula of Michigan is just that -- brief. Posted on Nov. 6, 1977, it reads simply: Iron Mountain native Tom Izzo, captain of coach Glenn Brown's last two Northern Michigan University basketball squads and the team's most valuable player for the 1976-77 season, will replace Mike Mileski as the Ishpeming Hematites' varsity boys' basketball coach.\n\nIt's also the official notice of Izzo's first coaching step. He'd spend one year with the Hematites before returning to his alma mater as an assistant for his old coach, Glenn Brown.\n\nTom Izzo kept hounding Jud Heathcote for a job. Eventually, Heathcote said yes. Malcolm Emmons/USA TODAY Sports\n\n2. A place in the dungeon\n\nIn town to watch the high school state championships and recruit for Northern Michigan, Izzo instead tried to market himself. By then four years into his gig at Northern Michigan, he was looking to begin working his way up the recruiting ladder.\n\nThe young assistant worked up his nerve to ask Jud Heathcote, then just two years removed from taking Michigan State to the Final Four, if he had an opening on his staff. Heathcote politely told him he did not. A year later, same drill. \"That time he had a broken jaw,'' Heathcote said. \"I could hardly understand him.'' Heathcote told Izzo he still had no openings.\n\nFinally on Izzo's third visit to East Lansing, Heathcote offered him a spot in the dungeon room -- a $7,000 a year graduate assistant job.\n\n\"I figured with his perseverance, he deserved something,'' Heathcote said.\n\nIzzo accepted on the spot and moved into a two-bedroom garden floor apartment with one of the team managers. Back then, Mark Hollis, now the Michigan State athletic director, was the Oscar to Izzo's Felix. Not that either spent a whole lot of time in their apartment. Izzo practically lived in the coaches' offices. Hollis remembers the old office configuration, with the assistants all crowded into one room and their desks arranged so they could shout at one another. More often than not as Hollis was leaving, he'd peer in to see Izzo still watching film, long after everyone else left.\n\n\"He was probably more intense as an assistant than as a head coach,'' Hollis said. \"It was from the capacity of trying to learn things, pushing, asking questions, trying to do more than what it takes to just satisfactorily do the job.\"\n\n3. Finding that skinny skid\n\nHe was supposed to watch another kid at the Franklin Settlement Recreation Center in Detroit that day, but on his first recruiting assignment as an assistant, Izzo went off script. He kept eyeing a gangly player who made every big shot and eventually brought Heathcote for a second opinion.\n\n\"Tom, who the hell is that skinny kid who is always on the ball?\" Heathcote memorably said.\n\nHis name was Steve Smith. He would go on to score 2,263 points and bring Michigan State back to the top of the Big Ten standings. Then he was a kid fresh off a late growth spurt. He also happened to be devoted to his mother. Izzo, starting a trend that would long serve him well, recruited Clara Smith as hard as he did her son.\n\nEventually Clara decided to send her son to East Lansing where Smith not only left a mark on the basketball court, he has left an indelible one on the university. Smith's $2.5 million donation, at the time the largest by any professional athlete to a college or university (since eclipsed by Draymond Green's $3.1 million gift), made possible the Clara Bell Smith Student Athlete Academic Center.\n\n4. Jud's promise\n\nBy the early 1990s, Izzo was an up-and-comer, the hot young assistant catching plenty of people's eyes. Central Michigan went after him hard after Charlie Coles left in 1991, even thought it had a chance to snare him.\n\nAfter that courtship fizzled, Heathcote realized he needed to entice his top assistant to stay. In 1993, two years before he'd retire, Heathcote tabbed Izzo as his successor. It wasn't easy.\n\n\"Some people thought we should hire a black coach,'' Heathcote said. \"Some others wanted us to open it up and see who would apply. I had to work hard to get him the job.''\n\nHeathcote thought the continuity would be best for the school. He remembered when his own mentor, Marv Harshman, was forced out at Washington and the school went outside for his replacement. The move began a downward spiral for the Huskies. More, though, he thought Izzo was ready.\n\n\"He got better every single year at the things a head coach has to do,'' he said. \"Work on the floor, recruiting, working with the media, he was the logical and best choice for Michigan State.''\n\n5. Have basketballs, will travel\n\nHe has played on an aircraft carrier and at military bases, on the East Coast and the West. That mentality started quite literally in Izzo's first season as a head coach. In 1995-96, the Spartans played at Maui, at Arkansas, at Louisville, at Kansas State and at Oklahoma State. Izzo, though, couldn't get anyone to return the games, struggling to get any home-and-home series.\n\nFinally in 1997, Izzo turned to the man who built a Hall of Fame career off of playing anyone anywhere, signing a home-and-home with John Chaney and Temple.\n\n\"I remember he said to me, 'Just keep doing what you're doing. You'll get there,' '' Izzo recalled.\n\nIzzo got there that same season, with Michigan State earning its first NCAA tournament bid. The Spartans haven't missed since, a run of 19 consecutive years.\n\nTom Izzo and Mateen Cleaves made magic and built a relationship between Izzo, Michigan State and Flint. Doug Pensinger/Getty Images\n\n6. Finding the Flintstones\n\nAntonio Smith was the first recruit to sign with the new Michigan State head coach. He also started the Flintstone pipeline. Next came Morris Peterson and then Mateen Cleaves and finally, Charlie Bell, the four kids who grew up together in Flint, Michigan, pledging their basketball futures to Izzo and Michigan State.\n\nIf together they marked the turning point for Izzo, individually Cleaves served as the catalyst.\n\nThe point guard who would go on to forge such a tight bond with his coach that each would include the other in their son's names -- Steven Mateen Izzo and Mateen Izzy Cleaves. Cleaves was heavily recruited, wooed by Florida State just after the Charlie Ward hype, and Michigan, which still enjoyed the glow from its 1989 national championship. But Cleaves was memorably involved in a car accident on his official visit with the Wolverines. Later, it would be revealed, he and Michigan players were returning from the home of Ed Martin, the booster who would lead to the Wolverines' issues with the NCAA. Izzo, through dogged determination and careful wooing of Cleaves' mother, won the recruiting battle. Cleaves, in return, changed Izzo's career. The three-time team captain and three-time All-American led the Spartans to their first NCAA tournament under Izzo, the coach's first Final Four, and of course, the 2000 national championship.\n\n7. Standing up the big boys\n\nToday he is known as Mr. March, Izzo's ability to win games when it matters most as good as any in the history of the game. Only five other coaches can match or better his seven Final Four trips. But in 1999 he was just beginning to build his reputation, his Spartans that year earning their first Final Four berth under Izzo. Michigan State rebounded from a 13-point deficit to beat defending national champion Kentucky in the Elite Eight to get there. Their reward in St. Petersburg, Florida, was a date with a loaded Duke team. Mike Krzyzewski who already was in the seventh Final Four of his career. \"Been there, done that program vs. giddy newcomer,'' one Florida newspaper reporter termed the semifinal. The Spartans would lose the game, 68-62, but serve notice that the newcomers were also a new force. \"I think we showed the world that we can compete with them and that we're a good team,\" Charlie Bell said afterward.\n\n8. A call that changed it all\n\nWith 3:43 left in the Midwest Regional final and Michigan State up by one, officials simultaneously whistled Charlie Bell for a block and Iowa State's Paul Shirley for a charge on Shirley's made bucket.The basket was waved off and Shirley hit with his fifth foul. The Spartans would go on to win the game (an irate Larry Eustachy, the then Iowa State coach, would watch the end from the locker room, ejected after arguing the call). A euphoric crowd at the regional site in Auburn Hills celebrated Michigan State's return to the Final Four.\n\nThis time, Michigan State no longer was the new kid on the block. With Cleaves -- coming back from a sprained ankle -- leading the way, the Spartans beat Florida and its upstart coach, a guy by the name of Billy Donovan, to win their first national championship.\n\n\"It was painful, but I wasn't thinking about that,\" Cleaves told the Lansing State Journal, reminiscing about the championship game years later, \"All that I was thinking about was winning a national championship -- a goal we set when I was 18 years old, and coach Izzo was in Flint, Michigan, sitting in my living room. That's all I was thinking about, accomplishing that goal.\"\n\n9. Home-court advantage\n\nA record crowd of 72,456 packed into Ford Field for the 2009 Final Four. Esimates that 72,000 were wearing Michigan State gear were greatly exaggerated. It was more like 72,400.\n\nIf there was a moment that crystallized the love between school and coach, this was it.\n\n\"I told the players before the game that I'd coached in four Final Fours, but I didn't think anything that happened in them could prepare me for what it was going to feel like walking out of that tunnel tonight,'' Izzo said after the Spartans beat UConn in the semifinals to move on to the title game against North Carolina. \"I was right; I've never felt anything quite like that.\"\n\nThe emotional ride for Izzo, one in which he willingly shouldered the responsibility of giving downtrodden Detroit a reason to celebrate, was the end of a difficult road for the Spartans. Expected to win early, they survived myriad injuries to reach their dream destination -- a hometown national championship game.\n\nNorth Carolina, heavily favored all season, throttled the Spartans and silenced the crowd, but nothing would dull the shine on that unforgettable moment for Izzo, or for Michigan State.\n\nTom Izzo, right and shown with football coach Mark Dantonio, told his boss -- and old roommate -- Mark Hollis in 2010 he was staying, and staying for good. Matthew Mitchell, MSU Athletic Communications\n\n10. Saying no to the NBA\n\nIt lasted only nine days. It seemed a lot longer. Izzo's midsummer romance with the Cleveland Cavaliers dominated the news cycle in July, 2010, with the Cavs dangling upwards of $6 million a year to lure Izzo away from Michigan State. Izzo thought long and hard about leaving the Spartans.\n\nHe kept his old roommate -- and current boss -- apprised throughout the tap dance, sometimes talking to Hollis, his friend, and others speaking with Hollis, his athletic director. Hollis never tried to talk Izzo into anything, instead offering him the space to breathe, think and explore a possible new job. One time he even told his coach to leave, that the financial package was too hard to turn down for his family.\n\nUltimately Izzo opted to return. There was no grand pronouncement. Izzo and Hollis simply sat in the coach's conference room and had one last conversation that ended with, \"I'm going to stay.''\n\n\"He has that one line, where he always talks about if he's home he feels guilty he's not with the team and when he's with the team he feels guilty because he's not at home. The same feeling came out of this process,'' Hollis said. \"I think he felt like had he accepted, maybe he could have recruited LeBron to stay (LeBron instead decided to go to Miami).\n\n\"What's that saying, 80-20? I think he was 80 percent excited and 20 percent of him always wondered what would have happened if I had gone?''\n\nBut when he recommitted to Michigan State, Izzo made no such wiggle room, declaring, \"I knew at the beginning that whatever decision I made would be a decision for life. I am going to be a lifer. This is what I'm going to be, and I'm damn proud of it.\""}, {"url": "https://www.cbsnews.com/detroit/news/izzo-elected-to-naismith-basketball-hall-of-fame/", "page_content": "HOUSTON – Michigan State men's basketball coach Tom Izzo is set to join the basketball elite after being elected to the Naismith Memorial Basketball Hall of Fame. The announcement was made Monday, April 4 in Houston as part of Final Four Weekend.\n\n\"I've always told my players that they need to dream something before they can achieve it,\" said Izzo. \"Growing up in Iron Mountain, I had plenty of dreams, many of them seemed like long shots. But I'd be lying if I said being in the Hall of Fame was one of those dreams – it seemed too big. Even today, it's surreal.\n\n\"As a coach, you can't accomplish anything without the help of others. While I'm the one being recognized by the Hall of Fame, it's only because of the work, support and advice from so many people that have touched both my life and my career. From the guidance and love of my family and friends, to the instruction and advice from my teachers and mentors, to the hard work and accomplishments of my coaches and players, and the great support from my administration, they've all made the 'undreamable' a reality.\"\n\n\"On both a personal level, and on behalf of Michigan State University, I congratulate Tom Izzo on his induction into the Naismith Memorial Basketball Hall of Fame,\" said MSU President Lou Anna K. Simon. \"As Spartans, we've known for a long time that Tom is a Hall of Fame coach and a Hall of Fame person, but today we are all proud as he receives the ultimate recognition for a remarkable, but far from finished, career.\n\n\"Everyone sees his passion for winning games, cutting down nets and hanging championship banners. They see his commitment to never cutting corners, relying instead on hard work and determination to accomplish great things. I'm fortunate in that I get to see Tom work equally as hard to develop young men, preparing them for success after basketball. His determination to see others succeed and reach their goals, be it within athletics or across campus, make him the ultimate ambassador for Michigan State University – a world class University built on land-grant values such as hard work, integrity and ingenuity. And that's why today all of Team MSU salutes Coach Izzo on his landmark honor.\"\n\n\"As a roommate and friend of Tom Izzo since the early 1980s, I have always admired and respected Coach's ability to care and fight for people and issues beyond his area of responsibility,\" said MSU Athletics Director Mark Hollis. \"He is passionate about the game of basketball, higher education and the people that commit their lives to the ideals of these pursuits. His attention to detail, concern about right and wrong, and the importance of personal accountability of everyone contribute to his success. With humility as his athletic director, emotion as his friend, and pride as a Spartan, I appreciate the Naismith Memorial Basketball Hall of Fame in recognizing Tom's contributions to the game.\"\n\nIn 21 seasons as a head coach, all at Michigan State, Izzo has put together a resume worthy of induction. He has guided Michigan State to seven Final Fours (1999, 2000, 2001, 2005, 2009, 2010, 2015), ranking fifth all-time and tied for third among active coaches. Since Izzo's first season as head coach in 1995-96, no other coach has appeared in more than six. In guiding the Spartans to a seventh Final Four in 2015, Izzo became just the second coach to appear in seven Final Fours in a 17-year period since the tournament expanded to 64 teams in 1985.\n\nUnder Izzo's watch, Michigan State has appeared in 19 consecutive NCAA Tournaments, establishing the longest streak in Big Ten history, and ranking as the third-longest active streak and the fourth longest of all time. Izzo's 19 straight NCAA Tournaments are the fourth-longest streak for any coach in tournament history. His 46 NCAA Tournament victories rank tied for eighth all time. To put his success into perspective, of Izzo's 19 trips to the NCAA Tournament, MSU has advanced at least to the second weekend 13 times, including nine Elite Eights, while losing its opening game just four times. Two other stats stand out in Izzo's NCAA Tournament success: 1) MSU is 21-4 in the second game of an NCAA Tournament weekend; 2) MSU is 13-10 as the lower-seeded team, as the 13 wins are the most in NCAA Tournament history for any coach.\n\nIn 33 total seasons at Michigan State, Izzo has cemented his name among the very best coaches in Big Ten history. Earlier this year, he passed former Purdue coach Gene Keady to become the second-winningest coach at a Big Ten school, trailing only Indiana's Bob Knight. His 246 Big Ten wins rank third all-time behind just Knight and Keady. He is one of just five coaches to win seven regular-season Big Ten Championships (1998, 1999, 2000, 2001, 2009, 2010, 2012), while his five Big Ten Tournament Championships (1999, 2000, 2012, 2014, 2016) are the most ever.\n\nIzzo is an eight-time national coach of the year, capturing the award in 1998 (Basketball News, Associated Press, USBWA), 1999 (Basketball Times), 2001 (NABC), 2005 (Clair Bee), and 2012 (NABC, CBSSports.com). He is a three-time Big Ten Coach of the Year, capturing the award in 1998, 2009 and 2012.\n\nIn 21 seasons, Izzo has posted a record of 524-205. The 524 wins are the fifth-highest total for a coach through 21 seasons in NCAA history. This past November, Izzo won his 500th career game, becoming the eighth coach to accomplish the feat in his first 21 seasons. One of the things in which Izzo takes the most pride is the difficult schedule Michigan State has faced over the years. Since 1997-98, the year of Izzo's first appearance in the NCAA Tournament, Michigan State has faced a nation's-best 205 ranked opponents.\n\nIzzo has repeatedly said that one of his top priorities is seeing his players reach their goals. Individually, players have excelled under Izzo. Ten Spartans (Charlie Bell, Mateen Cleaves, Paul Davis, Draymond Green, Gary Harris, Drew Neitzel, Adreian Payne, Morris Peterson, Jason Richardson and Denzel Valentine) have earned some form of All-America honors. Thirty different players have earned all-conference recognition, including 12 different first-team honorees, five Big Ten Players of the Year (Cleaves, Green, Kalin Lucas, Peterson, Valentine), and one Big Ten Freshman of the Year (Harris). Both Green and Valentine have earned National Player of the Year honors under Izzo.\n\nSpartan student-athletes are prepared for life after Michigan State, both on and off the court. Under Izzo, 16 Spartans have been selected in the NBA Draft, including 15 since 2000, eight of whom were first rounders (Cleaves-2000 first round, Peterson-2000 first round, Richardson-2001 first round, Zach Randolph-2001 first round, Andre Hutson-2001 second round, Marcus Taylor-2002 second round, Erazem Lorbek-2005 second round, Shannon Brown-2006 first round, Maurice Ager-2006 first round, Davis-2006 second round, Goran Suton-2009 second round, Green-2012 second round, Adreian Payne-2014 first round, Harris-2014 first round, Branden Dawson-2015 second round). In addition, four undrafted Spartans (Bell, Alan Anderson, Lucas and Keith Appling) have also appeared in the NBA. Numerous other former Spartans have enjoyed lucrative professional careers playing overseas.\n\nThe Spartans have also experienced success in the classroom under Izzo. Chris Hill and Neitzel earned Academic All-America honors. Among players who have completed their eligibility under Izzo, 84 percent have left MSU with a degree.\n\nIzzo arrived at Michigan State prior to the 1983-84 season. He was promoted to associate head coach in 1990, and on March 30, 1993, then-MSU Athletics Director Merrily Dean Baker recommended that Izzo be appointed head coach following Jud Heathcote's retirement following the 1994-95 season. He came to MSU from Northern Michigan, where he served as an assistant at his alma mater from 1979-83. His coaching career began as head coach at Ishpeming High School in 1977-78."}, {"url": "https://www.nbcsports.com/chicago/big-ten/spartans-tom-izzo-elected-naismith-memorial-basketball-hall-fame", "page_content": "Tom Izzo might just be the best coach in Big Ten basketball history. And now his place in basketball history has been firmly cemented.\n\nThe Michigan State head coach was named Monday as one of the members of the Class of 2016 for induction into the Naismith Memorial Basketball Hall of Fame.\n\n“I’ve always told my players that they need to dream something before they can achieve it,” Izzo said in the school's announcement. “Growing up in Iron Mountain, I had plenty of dreams, many of them seemed like long shots. But I’d be lying if I said being in the Hall of Fame was one of those dreams — it seemed too big. Even today, it’s surreal.\n\n“As a coach, you can’t accomplish anything without the help of others. While I’m the one being recognized by the Hall of Fame, it’s only because of the work, support and advice from so many people that have touched both my life and my career. From the guidance and love of my family and friends, to the instruction and advice from my teachers and mentors, to the hard work and accomplishments of my coaches and players, and the great support from my administration, they’ve all made the ‘undreamable’ a reality.”\n\n[SHOP BIG TEN: Get your Spartans gear right here]\n\nIzzo has spent the past 21 seasons as the head coach at Michigan State, leading the Spartans to a national championship in 2000 and a total of seven Final Four appearances, the fifth most all-time. He's taken the Spartans to 19 consecutive NCAA tournament, the fourth-longest streak ever, and he ranks eighth all-time with 46 NCAA tournament wins.\n\nIzzo is the second-winningest coach in Big Ten history, his 246 conference wins trailing just Indiana legend Bob Knight. Under Izzo, Michigan State has won seven regular-season conference championships and five Big Ten Tournament titles. Earlier this season, Izzo became the eighth coach to win 500 games in his first 21 seasons and now has 524 career victories.\n\n“As a roommate and friend of Tom Izzo since the early 1980s, I have always admired and respected Coach’s ability to care and fight for people and issues beyond his area of responsibility,” Michigan State athletics director Mark Hollis said in the announcement. “He is passionate about the game of basketball, higher education and the people that commit their lives to the ideals of these pursuits. His attention to detail, concern about right and wrong, and the importance of personal accountability of everyone contribute to his success. With humility as his athletic director, emotion as his friend, and pride as a Spartan, I appreciate the Naismith Memorial Basketball Hall of Fame in recognizing Tom’s contributions to the game.”"}, {"url": "https://msutoday.msu.edu/news/2016/izzo-elected-to-naismith-basketball-hall-of-fame", "page_content": "Michigan State men’s basketball coach Tom Izzo is set to join the basketball elite after being elected to the Naismith Memorial Basketball Hall of Fame. The announcement was made April 4 in Houston as part of Final Four weekend.\n\n“I’ve always told my players that they need to dream something before they can achieve it,” said Izzo. “Growing up in Iron Mountain, I had plenty of dreams, many of them seemed like long shots. But I’d be lying if I said being in the Hall of Fame was one of those dreams – it seemed too big. Even today, it’s surreal.\n\n“As a coach, you can’t accomplish anything without the help of others. While I’m the one being recognized by the Hall of Fame, it’s only because of the work, support and advice from so many people that have touched both my life and my career. From the guidance and love of my family and friends, to the instruction and advice from my teachers and mentors, to the hard work and accomplishments of my coaches and players, and the great support from my administration, they’ve all made the ‘undreamable’ a reality.”\n\n“On both a personal level, and on behalf of Michigan State University, I congratulate Tom Izzo on his induction into the Naismith Memorial Basketball Hall of Fame,” said MSU President Lou Anna K. Simon. “As Spartans, we’ve known for a long time that Tom is a Hall of Fame coach and a Hall of Fame person, but today we are all proud as he receives the ultimate recognition for a remarkable, but far from finished, career.\n\n“Everyone sees his passion for winning games, cutting down nets and hanging championship banners. They see his commitment to never cutting corners, relying instead on hard work and determination to accomplish great things. I’m fortunate in that I get to see Tom work equally as hard to develop young men, preparing them for success after basketball. His determination to see others succeed and reach their goals, be it within athletics or across campus, make him the ultimate ambassador for Michigan State University – a world class University built on land-grant values such as hard work, integrity and ingenuity. And that’s why today all of Team MSU salutes Coach Izzo on his landmark honor.”\n\n“As a roommate and friend of Tom Izzo since the early 1980s, I have always admired and respected Coach’s ability to care and fight for people and issues beyond his area of responsibility,” said MSU Athletics Director Mark Hollis. “He is passionate about the game of basketball, higher education and the people that commit their lives to the ideals of these pursuits. His attention to detail, concern about right and wrong, and the importance of personal accountability of everyone contribute to his success. With humility as his athletic director, emotion as his friend, and pride as a Spartan, I appreciate the Naismith Memorial Basketball Hall of Fame in recognizing Tom’s contributions to the game.”\n\nIn 21 seasons as a head coach, all at MSU, Izzo has put together a resume worthy of induction. He has guided Michigan State to seven Final Fours (1999, 2000, 2001, 2005, 2009, 2010, 2015), ranking fifth all-time and tied for third among active coaches. Since Izzo’s first season as head coach in 1995-96, no other coach has appeared in more than six. In guiding the Spartans to a seventh Final Four in 2015, Izzo became just the second coach to appear in seven Final Fours in a 17-year period since the tournament expanded to 64 teams in 1985.\n\nUnder Izzo’s watch, MSU has appeared in 19 consecutive NCAA Tournaments, establishing the longest streak in Big Ten history, and ranking as the third-longest active streak and the fourth longest of all time. Izzo’s 19 straight NCAA Tournaments are the fourth-longest streak for any coach in tournament history. His 46 NCAA Tournament victories rank tied for eighth all time. To put his success into perspective, of Izzo’s 19 trips to the NCAA Tournament, MSU has advanced at least to the second weekend 13 times, including nine Elite Eights, while losing its opening game just four times. Two other stats stand out in Izzo’s NCAA Tournament success: 1) MSU is 21-4 in the second game of an NCAA Tournament weekend; 2) MSU is 13-10 as the lower-seeded team, as the 13 wins are the most in NCAA Tournament history for any coach.\n\nIn 33 total seasons at MSU, Izzo has cemented his name among the very best coaches in Big Ten history. Earlier this year, he passed former Purdue coach Gene Keady to become the second-winningest coach at a Big Ten school, trailing only Indiana’s Bob Knight. His 246 Big Ten wins rank third all-time behind just Knight and Keady. He is one of just five coaches to win seven regular-season Big Ten Championships (1998, 1999, 2000, 2001, 2009, 2010, 2012), while his five Big Ten Tournament Championships (1999, 2000, 2012, 2014, 2016) are the most ever.\n\nIzzo is an eight-time national coach of the year, capturing the award in 1998 (Basketball News, Associated Press, USBWA), 1999 (Basketball Times), 2001 (NABC), 2005 (Clair Bee), and 2012 (NABC, CBSSports.com). He is a three-time Big Ten Coach of the Year, capturing the award in 1998, 2009 and 2012.\n\nIn 21 seasons, Izzo has posted a record of 524-205. The 524 wins are the fifth-highest total for a coach through 21 seasons in NCAA history. This past November, Izzo won his 500th career game, becoming the eighth coach to accomplish the feat in his first 21 seasons. One of the things in which Izzo takes the most pride is the difficult schedule Michigan State has faced over the years. Since 1997-98, the year of Izzo’s first appearance in the NCAA Tournament, Michigan State has faced a nation’s-best 205 ranked opponents.\n\nIzzo has repeatedly said that one of his top priorities is seeing his players reach their goals. Individually, players have excelled under Izzo. Ten Spartans (Charlie Bell, Mateen Cleaves, Paul Davis, Draymond Green, Gary Harris, Drew Neitzel, Adreian Payne, Morris Peterson, Jason Richardson and Denzel Valentine) have earned some form of All-America honors. Thirty different players have earned all-conference recognition, including 12 different first-team honorees, five Big Ten Players of the Year (Cleaves, Green, Kalin Lucas, Peterson, Valentine), and one Big Ten Freshman of the Year (Harris). Both Green and Valentine have earned National Player of the Year honors under Izzo.\n\nSpartan student-athletes are prepared for life after MSU, both on and off the court. Under Izzo, 16 Spartans have been selected in the NBA Draft, including 15 since 2000, eight of whom were first rounders (Cleaves-2000 first round, Peterson-2000 first round, Richardson-2001 first round, Zach Randolph-2001 first round, Andre Hutson-2001 second round, Marcus Taylor-2002 second round, Erazem Lorbek-2005 second round, Shannon Brown-2006 first round, Maurice Ager-2006 first round, Davis-2006 second round, Goran Suton-2009 second round, Green-2012 second round, Adreian Payne-2014 first round, Harris-2014 first round, Branden Dawson-2015 second round). In addition, four undrafted Spartans (Bell, Alan Anderson, Lucas and Keith Appling) have also appeared in the NBA. Numerous other former Spartans have enjoyed lucrative professional careers playing overseas.\n\nThe Spartans have also experienced success in the classroom under Izzo. Chris Hill and Neitzel earned Academic All-America honors. Among players who have completed their eligibility under Izzo, 84 percent have left MSU with a degree.\n\nIzzo arrived at MSU prior to the 1983-84 season. He was promoted to associate head coach in 1990, and on March 30, 1993, then-MSU Athletics Director Merrily Dean Baker recommended that Izzo be appointed head coach following Jud Heathcote’s retirement following the 1994-95 season. He came to MSU from Northern Michigan, where he served as an assistant at his alma mater from 1979-83. His coaching career began as head coach at Ishpeming High School in 1977-78."}, {"url": "https://www.sportingnews.com/us/ncaa-basketball/news/tom-izzo-is-a-hall-of-famer-now-so-he-needs-new-challenges-to-drive-him-naismith-memorial-induction-michigan-state/ak5osjo8f10e1o143wka6408u", "page_content": "In the midst of a volatile month of March that included a Senior Day victory for a beloved class, a Big Ten Tournament championship, one of the most astounding upset defeats in NCAA Tournament history and a call from the Naismith Memorial Basketball Hall of Fame telling him to plan for a weekend in New England, Tom Izzo got a letter.\n\nIf one wanted to be hyperbolic, it could be classified as hate mail.\n\nAfter seven Final Fours, one national championship, seven conference regular season titles, five in the Big Ten Championship and election to the Hall of Fame, Izzo still gets periodic notes from Michigan State fans expressing dissatisfaction with his work.\n\nThe loss by the No. 2 seed/shoulda-been-a-1 Spartans to No. 15 seed Middle Tennessee became one such occasion. An alum wrote to Izzo and told him he didn’t have his team prepared, that seniors Denzel Valentine, Matt Costello, Bryn Forbes and Colby Wollenman got “fat and sassy.”\n\n(Those were Izzo’s words, paraphrasing the letter. Only Izzo still says “fat and sassy.”)\n\nMORE: 16 most-hated college basketball players ever\n\nThis is astounding.\n\n“Oh, yeah. A lot of people thought we took them for granted,” Izzo told Sporting News. “It’s great. It’s awesome. As much as I sometimes get mad … it does fuel me. It makes me want to stick up for the players more. I’m the first to rip a player, as you know, if he wasn’t doing his job. But when someone else rips a guy that was doing his job? You can bet your ass I sent that guy a letter back.\n\n“I told him: Don’t read Twitter. Don’t believe whatever you thought you saw. Give those four guys credit. They had our guys ready to play like nobody’s tomorrow. And that is the truth.”\n\nAs Izzo prepares for the induction ceremony Friday night in Springfield, when he will become one of five active coaches in the Hall of Fame, he still can’t quite shake off his most recent defeat. To be honest, he doesn’t really want to. Because what makes Izzo a Hall of Famer is that constant drive, finding another obstacle to overcome, refusing to be satisfied. That’s why that fan’s letter was so beautifully timed.\n\nDECOURCY: Iverson's first college game was a sign of greatness\n\nSoon he’ll be able to look at the ceiling at the Naismith Hall of Fame and see a picture of his own face somewhere in a constellation of stars that includes John Wooden, Pete Maravich, Walt Frazier, Wilt Chamberlain, Nolan Richardson, Lynette Woodard and Drazen Petrovic. How can Izzo see himself in that sort of company and not relax?\n\nBecause he is Tom Izzo. He already has figured this out. “I guess I appreciate it more still coaching, still being in it,” he said. “It’s an incredible opportunity for me to kind of live up to the hype, if that makes any sense.\n\n“I don’t need any motivation, but it does motivate me. I think I have a chance in some ways to prove people right, and in other ways prove that complacency, fat-and-sassiness isn’t part of the equation.”\n\n--\n\nOnly a short while after Izzo’s Spartans had defeated Temple on March 25, 2001, a victory that advanced them to the Final Four for a third consecutive season, something only eight other college teams had ever done, Izzo told reporters gathered in a hallway underneath the Georgia Dome that his dream was to make Michigan State into an elite college basketball program.\n\nHere is what has happened since: four more Final Fours, giving MSU more than any other program since the turn of the century; seven first-round NBA draft picks; another 15 NCAA Tournament appearances to extend the active streak to 19, fourth-longest in history; NABC national player of the year awards for Draymond Green and Denzel Valentine; inclusion with Duke, Kansas and Kentucky in the annual Champions Classic doubleheader showcased by ESPN and now the Hall of Fame.\n\nMORE: Which school the best hoops-football combination?\n\nSo, 15 years later, does he think Michigan State is elite now?\n\nThe question made Izzo nervous enough that he laughed.\n\n“I don’t,” he said after buying himself that brief pause. “I just don’t think we’re there yet. I think another national championship would help. Something to separate … I don’t know. Has anybody that’s been successful ever been satisfied?\n\n“To me, the elite football programs, there are maybe six or eight or 10 of them. Elite basketball programs, there’s probably five or six. But we’re getting closer.”\n\nMORE: UConn's Purvis pays tribute to fallen friend\n\nIzzo turned 61 last January, in the midst of his 21st season as Spartans head coach, so he is not terrifically young for a coach being inducted to the Naismith Hall. John Thompson was 58 when he was elected, Dean Smith was 52 and John Calipari was 56 when he went in only last year.\n\nWhat makes Izzo a little different is that he’s not been a head coach all that long. He waited longer than a lot of the top coaches to take charge of his own program. Bob Knight, Mike Krzyzewski and Rick Pitino all were head coaches in their 20s. Jud Heathcote didn’t retire from Michigan State until Izzo was 40.\n\nIzzo made up for lost time by becoming instantly successful. His third team went to the Sweet 16, his fourth to the Final Four and his fifth claimed the 2000 NCAA Championship. His batting average of .333 – seven Final Fours in 21 years – is better than any coach with at least five trips to the national semifinals save John Wooden, who got there in better than 40 percent of his years as a Division I head coach.\n\nHis head coaching career has been brief enough that not everyone understood he was eligible for Hall of Fame election. A coach has to be in the business for 25 years to be considered, but he doesn’t need to be a head coach all that time. So Izzo technically could have been nominated in 2004. When it was announced in December he was on the initial list of more than 100 nominees, there wasn’t any question he would be among those chosen for 2016 induction.\n\nThere are many coaches who are respected, and rightfully so, but perhaps none who is as popular as Izzo among basketball executives, fellow coaches and rival fans. CBS polled college basketball coaches and asked them, “Which college coach would you most like your son to play for?” The winner: Tom Izzo .\n\nHe has had at least two significant opportunities to coach in the NBA, with the Atlanta Hawks and Cleveland Cavaliers. It was widely speculated he could have gotten the Detroit Pistons job in 2014, but he made it clear he was not interested.\n\nIzzo had come very close to taking the Hawks job in 2000 because the money was so much greater than college was paying, and extremely close to leaving for the Cavs in 2010 because he knew that he was making a final decision about the direction his later years in the game would follow.\n\nMORE: No. 1 prospect DeAndre Ayton chooses Arizona\n\nHe might still have become a Hall of Famer if he gone in either of those directions, but he maybe wouldn’t have been the Tom Izzo so many admire. He has embraced his role at Michigan State not just as a basketball coach, but as an important figure in the athletic department. No one has been more thrilled to see Nick Saban and then Mark Dantonio lift the football program to the point where it played in the College Football Playoff semifinals last season.\n\nIzzo has taken his basketball teams to Indianapolis for the Big Ten Championship football game and Dallas for the Spartans’ game against Saban and Alabama last New Year’s Eve.\n\n“I’ve always loved football, and we’ve got both of them going now,” Izzo said. “I think it’s fun. I know Kentucky and Kansas have got more to sell that, ‘Hey we’re the only sport here.’ Or Indiana. But that wouldn’t fit me. Hey, I love when baseball and soccer are doing well here. I’ve just been part of this family.”\n\nMichigan State went through a period of five athletic directors in 13 years, but since 2008 Mark Hollis has held the job and earned Izzo’s loyalty with his vision and energy. Izzo mentioned that Hollis has distributed a fair segment of the program’s ticket allotment at Final Fours to past Spartans players – enough that 100 were present and many addressed the team on the eve of the team’s 2015 Final Four matchup against Duke.\n\n“Now, it didn’t work, because of the talent level I think was a lot different that game. But it was pretty cool,” Izzo said.\n\n“I give credit to some of the guys I didn’t coach: Magic, Greg Kelser, Steve Smith, Scott Skiles. Those guys have come back a lot, and I think have really helped my cause. When it gets to be March here, all the former players start calling, or call the players and say, ‘Make sure you know what time of year it is.’ It got to be kind of a thing. We’ve done better in some Final Fours than we even did during the year, you know?”\n\n--\n\nEvery one of the great college coaches has something he does a little better than everyone else. No one excels at teaching communication like Krzyzewski. No one is better at getting great talent to commit to a common purpose than Calipari. No one had a better eye for underappreciated talent than Jim Calhoun.\n\nNo one does a better job than Izzo of eliciting unrelenting effort. Rebounding, intensity, battling to the end.\n\n“You know what I would tell you? I spend time. It may sound stupid. I spend time,” Izzo said. “I think this day and age, especially the last 10-12 years, nobody trusts anybody. If you just spend time, guys trust you. If guys trust you, they’ll believe in you. If they believe in you … very few times do I get beat because our team doesn’t play hard.”\n\nThey were beaten in the 2014 Elite Eight because they struggled to handle the basketball against UConn’s Shabazz Napier and Ryan Boatright. Point guard Keith Appling was playing with an injured wrist, and Travis Trice was always more a shooter than ballhandler. They were beaten this past March in their first NCAA Tournament game because Middle Tennessee enjoyed an extraordinary shooting night and Michigan State seemed not to handle the game pressure that created.\n\n“I’m not sure we handled the adversity,” Izzo said. “I don’t think it was a lack of effort. Another team played out of their mind, and I think we panicked a little bit. I don’t think there’s been many times when we didn’t put out.\n\nMORE: Champions Classic field set\n\n“I can tell you in our night-before meetings when we got there -- they were so focused on what they wanted to accomplish. We played good enough offensively, but we didn’t guard. And they made shots. Let’s give a little more credit to them. I said after, it was the saddest one of all them. It was way sadder than losing in the semifinals. It was sadder because I loved those guys. I don’t think I’ll ever have a senior class like that.”\n\nThere’ll be another chance in 2016-17, with his most esteemed recruiting class arriving and such veterans as Eron Harris and Lourawls Nairn still around. Izzo likes his team already, which can’t be good news for any of the opponents on Michigan State’s overly ambitious schedule.\n\nAnd they’ll be coached by a Hall of Famer when practice begins.\n\n“It all came kind of fast, but as I look at the list of people, and the college coaches – the few college coaches that are on it – in the big picture it makes you realize: It’s huge to me,” Izzo said. “I almost looked at who didn’t make it more than I looked at who did. I just think of some of the great coaches: Gene Keady comes to mind right off the bat. I just think he’s a hell of a coach and did a hell of a job. It doesn’t seem like his name gets mentioned, and that makes me appreciate the honor more.”"}, {"url": "https://bigten.org/news/2016/4/4/Izzo_Elected_to_Naismith_Basketball_Hall_of_Fame.aspx", "page_content": "HOUSTON -- Michigan State men's basketball coach Tom Izzo is set to join the basketball elite after being elected to the Naismith Memorial Basketball Hall of Fame. The announcement was made Monday, April 4 in Houston as part of Final Four Weekend.\n\n\"I've always told my players that they need to dream something before they can achieve it,\" said Izzo. \"Growing up in Iron Mountain, I had plenty of dreams, many of them seemed like long shots. But I'd be lying if I said being in the Hall of Fame was one of those dreams -- it seemed too big. Even today, it's surreal.\n\n\"As a coach, you can't accomplish anything without the help of others. While I'm the one being recognized by the Hall of Fame, it's only because of the work, support and advice from so many people that have touched both my life and my career. From the guidance and love of my family and friends, to the instruction and advice from my teachers and mentors, to the hard work and accomplishments of my coaches and players, and the great support from my administration, they've all made the `undreamable' a reality.\"\n\n\"On both a personal level, and on behalf of Michigan State University, I congratulate Tom Izzo on his induction into the Naismith Memorial Basketball Hall of Fame,\" said MSU President Lou Anna K. Simon. \"As Spartans, we've known for a long time that Tom is a Hall of Fame coach and a Hall of Fame person, but today we are all proud as he receives the ultimate recognition for a remarkable, but far from finished, career.\n\n\"Everyone sees his passion for winning games, cutting down nets and hanging championship banners. They see his commitment to never cutting corners, relying instead on hard work and determination to accomplish great things. I'm fortunate in that I get to see Tom work equally as hard to develop young men, preparing them for success after basketball. His determination to see others succeed and reach their goals, be it within athletics or across campus, make him the ultimate ambassador for Michigan State University -- a world class University built on land-grant values such as hard work, integrity and ingenuity. And that's why today all of Team MSU salutes Coach Izzo on his landmark honor.\"\n\n\"As a roommate and friend of Tom Izzo since the early 1980s, I have always admired and respected Coach's ability to care and fight for people and issues beyond his area of responsibility,\" said MSU Athletics Director Mark Hollis. \"He is passionate about the game of basketball, higher education and the people that commit their lives to the ideals of these pursuits. His attention to detail, concern about right and wrong, and the importance of personal accountability of everyone contribute to his success. With humility as his athletic director, emotion as his friend, and pride as a Spartan, I appreciate the Naismith Memorial Basketball Hall of Fame in recognizing Tom's contributions to the game.\"\n\nIn 21 seasons as a head coach, all at Michigan State, Izzo has put together a resume worthy of induction. He has guided Michigan State to seven Final Fours (1999, 2000, 2001, 2005, 2009, 2010, 2015), ranking fifth all-time and tied for third among active coaches. Since Izzo's first season as head coach in 1995-96, no other coach has appeared in more than six. In guiding the Spartans to a seventh Final Four in 2015, Izzo became just the second coach to appear in seven Final Fours in a 17-year period since the tournament expanded to 64 teams in 1985.\n\nUnder Izzo's watch, Michigan State has appeared in 19 consecutive NCAA Tournaments, establishing the longest streak in Big Ten history, and ranking as the third-longest active streak and the fourth longest of all time. Izzo's 19 straight NCAA Tournaments are the fourth-longest streak for any coach in tournament history. His 46 NCAA Tournament victories rank tied for eighth all time. To put his success into perspective, of Izzo's 19 trips to the NCAA Tournament, MSU has advanced at least to the second weekend 13 times, including nine Elite Eights, while losing its opening game just four times. Two other stats stand out in Izzo's NCAA Tournament success: 1) MSU is 21-4 in the second game of an NCAA Tournament weekend; 2) MSU is 13-10 as the lower-seeded team, as the 13 wins are the most in NCAA Tournament history for any coach.\n\nIn 33 total seasons at Michigan State, Izzo has cemented his name among the very best coaches in Big Ten history. Earlier this year, he passed former Purdue coach Gene Keady to become the second-winningest coach at a Big Ten school, trailing only Indiana's Bob Knight. His 246 Big Ten wins rank third all-time behind just Knight and Keady. He is one of just five coaches to win seven regular-season Big Ten Championships (1998, 1999, 2000, 2001, 2009, 2010, 2012), while his five Big Ten Tournament Championships (1999, 2000, 2012, 2014, 2016) are the most ever.\n\nIzzo is an eight-time national coach of the year, capturing the award in 1998 (Basketball News, Associated Press, USBWA), 1999 (Basketball Times), 2001 (NABC), 2005 (Clair Bee), and 2012 (NABC, CBSSports.com). He is a three-time Big Ten Coach of the Year, capturing the award in 1998, 2009 and 2012.\n\nIn 21 seasons, Izzo has posted a record of 524-205. The 524 wins are the fifth-highest total for a coach through 21 seasons in NCAA history. This past November, Izzo won his 500th career game, becoming the eighth coach to accomplish the feat in his first 21 seasons. One of the things in which Izzo takes the most pride is the difficult schedule Michigan State has faced over the years. Since 1997-98, the year of Izzo's first appearance in the NCAA Tournament, Michigan State has faced a nation's-best 205 ranked opponents.\n\nIzzo has repeatedly said that one of his top priorities is seeing his players reach their goals. Individually, players have excelled under Izzo. Ten Spartans (Charlie Bell, Mateen Cleaves, Paul Davis, Draymond Green, Gary Harris, Drew Neitzel, Adreian Payne, Morris Peterson, Jason Richardson and Denzel Valentine) have earned some form of All-America honors. Thirty different players have earned all-conference recognition, including 12 different first-team honorees, five Big Ten Players of the Year (Cleaves, Green, Kalin Lucas, Peterson, Valentine), and one Big Ten Freshman of the Year (Harris). Both Green and Valentine have earned National Player of the Year honors under Izzo.\n\nSpartan student-athletes are prepared for life after Michigan State, both on and off the court. Under Izzo, 16 Spartans have been selected in the NBA Draft, including 15 since 2000, eight of whom were first rounders (Cleaves-2000 first round, Peterson-2000 first round, Richardson-2001 first round, Zach Randolph-2001 first round, Andre Hutson-2001 second round, Marcus Taylor-2002 second round, Erazem Lorbek-2005 second round, Shannon Brown-2006 first round, Maurice Ager-2006 first round, Davis-2006 second round, Goran Suton-2009 second round, Green-2012 second round, Adreian Payne-2014 first round, Harris-2014 first round, Branden Dawson-2015 second round). In addition, four undrafted Spartans (Bell, Alan Anderson, Lucas and Keith Appling) have also appeared in the NBA. Numerous other former Spartans have enjoyed lucrative professional careers playing overseas.\n\nThe Spartans have also experienced success in the classroom under Izzo. Chris Hill and Neitzel earned Academic All-America honors. Among players who have completed their eligibility under Izzo, 84 percent have left MSU with a degree.\n\nIzzo arrived at Michigan State prior to the 1983-84 season. He was promoted to associate head coach in 1990, and on March 30, 1993, then-MSU Athletics Director Merrily Dean Baker recommended that Izzo be appointed head coach following Jud Heathcote's retirement following the 1994-95 season. He came to MSU from Northern Michigan, where he served as an assistant at his alma mater from 1979-83. His coaching career began as head coach at Ishpeming High School in 1977-78.\n\nCOURTESY: MICHIGAN STATE ATHLETICS"}, {"url": "https://btn.com/2016/04/04/tom-izzo-elected-to-naismith-basketball-hall-of-fame/", "page_content": "Tom Izzo is a lot of things in the game of basketball, and now he's a hall of famer.\n\n[ MORE: MSUSpartans.com: Izzo elected to Naismith Hall of Fame ]\n\nThe legendary Michigan State coach was announced as a member of the 2016 Naismith Basketball Hall of Fame Class on Monday morning.\n\nIzzo, along with former college and NBA superstars Shaquille O'Neal and Allen Iverson, headlines the latest class.\n\nIn 21 seasons at the helm of the Spartans, Izzo has amassed a 524-205 record (.719) and advanced to seven Final Fours (1999, 2000, 2001, 2005, 2009, 2010, 2015), winning the 2000 national title, the second in Michigan State history and the last won by a Big Ten team.\n\n\"I've always told my players that they need to dream something before they can achieve it,\" Izzo said in a school release. \"Growing up in Iron Mountain, I had plenty of dreams, many of them seemed like long shots. But I'd be lying if I said being in the Hall of Fame was one of those dreams — it seemed too big. Even today, it's surreal.\"\n\n***"}, {"url": "https://msuspartans.com/sports/mens-basketball/roster/coaches/tom-izzo/616", "page_content": "Tom Izzo was enshrined in the Naismith Memorial Basketball Hall of Fame on September 9, 2016, cementing his status as one of the game’s all-time greats.\n\n\\\n\nNow in his 28th year, Izzo has compiled an impressive list of accomplishments, including the 2000 NCAA National Championship, 10 regular-season Big Ten Championships, six Big Ten Tournament titles, eight Final Four appearances, eight National Coach of the Year awards and a Big Ten-record 24 straight NCAA Tournament appearances.\n\n\n\nThese accomplishments, however, are not what make Izzo one of the best in the game, but rather it is his insatiable desire to accomplish more.\n\n\n\nWith a career record of 666-267, it’s easy to see that Izzo knows how to win, but he also knows how to win the right way. In his 27 years directing the Spartan program, 85 percent of his players who completed their eligibility also left with a degree. In the last 22 years, 65 Spartans have received their undergraduate degrees.\n\n\n\nIn 27 seasons, Izzo has returned Michigan State to national prominence, placed his name in the NCAA record books and become a leader among college basketball coaches.\n\nIzzo’s 666 wins are fifth most by any coach in his first 27 seasons in the history of college basketball. In late November 2009, he passed his mentor Jud Heathcote (340 wins) to become MSU’s all-time winningest coach. When the Spartans beat Ohio State in the quarterfinals of the 2019 Big Ten Tournament, Izzo won his 600th career game. He became one of just two Big Ten coaches with at least 300 conference wins when MSU beat Iowa, 78-70, on Feb. 25, 2020. And when the Spartans beat Maryland on March 6, 2022, the victory gave Izzo 663 overall wins for his career, passing Bob Knight of Indiana for the most overall wins by a Big Ten Head Coach.\n\n\n\nIn the NCAA Tournament, Izzo is at his best, winning at a clip of .697 to rank third among all active coaches with at least 10 tournament games coached. His 53 NCAA Tournament wins are the most ever for a Big Ten coach, and rank sixth all-time. He has led MSU to 24-straight NCAA Tournament appearances, the longest active streak among Division I coaches and tied for the longest streak all-time.\n\n\n\nA 2015 inductee into the Michigan Sports Hall of Fame, Izzo led MSU to eight Final Four appearances between 1999 and 2019, becoming just the fourth school in college basketball history to do it in any 21-year span, including just the third since the tournament field expanded to 64 teams in 1985. Izzo is one of just two coaches in NCAA history to reach four Final Fours in his first 10 years of coaching, joining Ohio State’s Fred Taylor, and is just the second coach in NCAA history to appear in eight Final Fours in a 21-year span since the tournament expanded to 64 teams. His eight Final Four appearances rank fifth all-time, first among active coaches and first all-time among Big Ten coaches. Two stats stand out in Izzo’s NCAA Tournament success: 1) MSU is 23-7 in the second game of an NCAA Tournament weekend 2) MSU is 15-12 as the lower-seeded team, while the 15 wins are the most in NCAA Tournament history for any coach.\n\n\n\nThrough 27 seasons, Izzo is one of the most successful coaches in Big Ten history. His .679 winning percentage in Big Ten games ranks fourth all-time among league coaches with at least 10 years of service. In all games, Izzo ranks fourth (.714). With 322 conference victories, Izzo ranks second all-time, trailing just Indiana’s Bob Knight (353 wins). In the 2021-22 regular season finale, the Spartans beat Maryland to give Izzo his 663rd win, passing Knight (662) for the most overall wins by a Big Ten Head Coach.\n\n\n\nFurthermore, Izzo brings stability to Michigan State basketball. Including 12 years as an assistant, the 2022-23 season is Izzo’s 40th with the Spartans, as he is the longest serving active Big Ten men’s basketball head coach. He is also a leader among his peers, serving as the NABC President from April 2010-April 2011, while currently serving as an emeritus member of the NABC Board of Directors. He’s also held spots on the John R. Wooden Award Board of Governors and the USA Basketball Collegiate Committee.\n\n\n\nOver the past 25 seasons, Izzo has compiled an impressive 633-239 (.726) record. A quick look at other stats further demonstrates the Spartans’ success over that stretch: 304-134 (.694) in the Big Ten; 349-45 (.886) at the Breslin Center, including a Big Ten record 53-game winning streak; 142-126 (.530) against Top 25 teams (including four wins over No. 1-ranked teams); 87-41 (.680) in postseason play and 53-23 (.697) in the NCAA Tournament.\n\n\n\nIndividually, players have excelled under Izzo. Twelve Spartans (Charlie Bell, Mateen Cleaves, Paul Davis, Draymond Green, Gary Harris, Drew Neitzel, Adreian Payne, Morris Peterson, Jason Richardson, Denzel Valentine, Miles Bridges and Cassius Winston) have earned some form of All-America honors. Valentine earned six different National Player of the Year awards in 2016 (Associated Press, Basketball Times, NABC, NBC, Sports Illustrated and USA TODAY Sports), and Green was named National Player of the Year by the NABC in 2012. Chris Hill was a three-time Academic All-American, including being named the Academic All-American of the Year in 2005, while Neitzel also earned Academic All-America accolades. In 2019-20, Winston became the third player in MSU history to earn multiple consensus All-American honors, while Xavier Tillman Sr. was named a Second Team Academic All-American.\n\nForty-two different players have earned all-conference recognition, including 14 different first-team honorees, six Big Ten Players of the Year (Cleaves, Green, Lucas, Peterson, Valentine, Winston), three Big Ten Freshmen of the Year (Gary Harris, Miles Bridges and Jaren Jackson Jr.) and three Big Ten Defensive Players of the Year (Travis Walton, Jackson Jr. and Tillman Sr.).\n\n\n\nOne of the reasons for Izzo’s success is his ability to recruit some of the nation’s most talented high school players. During his time as head coach, Izzo has recruited 16 McDonald’s All-Americans (Mateen Cleaves - 1996, Jason Richardson - 1999, Marcus Taylor and Zach Randolph - 2000, Kelvin Torbert - 2001, Paul Davis - 2002, Shannon Brown and Brandon Cotton - 2003, Keith Appling - 2010, Branden Dawson - 2011, Gary Harris - 2012, Deyonta Davis - 2015, Miles Bridges and Joshua Langford - 2016, Jaren Jackson Jr. - 2017, Max Christie - 2021). In addition, 12 of the last 23 Michigan Mr. Basketball award winners suited up for the Green and White (1999 - Richardson, 2000 - Taylor, 2001 - Torbert, 2002 - Davis, 2004 - Drew Neitzel, 2009 - Derrick Nix, 2010 - Appling, 2012 - Matt Costello, 2015 - Davis, 2016 - Cassius Winston, 2018 - Foster Loyer, 2021 – Pierre Brooks), while Shannon Brown won the 2003 Illinois Mr. Basketball Award and Gary Harris won the 2012 Indiana Mr. Basketball Award.\n\n\n\nBut perhaps even more important to Izzo’s success is his ability to take young talent and develop a player’s skills, allowing him to grow as a player and go on to play professionally. Under Izzo, Michigan State has had 23 players selected in the NBA Draft, including 22 since 2000, 11 of whom were first rounders (Mateen Cleaves - 2000 first round, Morris Peterson - 2000 first round, Jason Richardson - 2001 first round, Zach Randolph - 2001 first round, Andre Hutson - 2001 second round, Marcus Taylor - 2002 second round, Erazem Lorbek - 2005 second round, Shannon Brown - 2006 first round, Maurice Ager - 2006 first round, Paul Davis - 2006 second round, Goran Suton - 2009 second round, Draymond Green - 2012 second round, Adreian Payne - 2014 first round, Gary Harris - 2014 first round, Branden Dawson - 2015 second round, Denzel Valentine - 2016 first round, Deyonta Davis - 2016 second round, Jaren Jackson Jr. - 2018 first round, Miles Bridges - 2018 first round, Xavier Tillman Sr. - 2020 second round, Cassius Winston - 2020 second round, Max Christie – 2022 second round).\n\nWhile many players were high school All-Americans, Izzo took others who were not ranked in the top-75 coming out of high school and turned them into NBA talent. In addition, Izzo-recruit Charlie Bell played in the NBA during the 2001-02 season after signing a free agent contract. After a successful stint overseas, Bell played seven more seasons in the NBA. Alan Anderson, a member of the 2005 Final Four team, signed a free agent contract and played two years with the Charlotte Bobcats and, after a stint in Europe, returned for five seasons back in the NBA. In more recent years, Kalin Lucas and Bryn Forbes have also played in the NBA after signing free agent contracts, while Aaron Henry signed a two-way contract with the Philadelphia 76ers in 2021. Numerous other former Spartans have enjoyed lucrative professional careers playing overseas.\n\n\n\nIzzo has also emerged as a teacher, not only to his players, but also his assistant coaches. Three current Division I head coaches served as assistants to Izzo, including Brian Gregory (South Florida), Stan Heath (Eastern Michigan) and Dwayne Stephens (Western Michigan). In total, eight former assistants have earned head coaching jobs. Former long-time assistant Mike Garland spent three seasons as head coach at Cleveland State following an initial seven-year stint at MSU, while Stan Joplin was also head coach at Toledo for 12 seasons, Jim Boylen served as head coach at Utah for four seasons, Heath served as head coach at Kent State, Arkansas and South Florida over 13 seasons and Tom Crean was the head coach at Marquette, Indiana and Georgia. The current coaching staff features two former assistants who were head coaches before returning to East Lansing – Doug Wojcik spent nine seasons between Tulsa and College of Charleston and Mark Montgomery was the head coach at Northern Illinois for 10 seasons.\n\n\n\nThe Spartans finished the 2021-22 season with a 23-13 overall record and were selected to the NCAA Tournament for the 24th-straight season, extending the longest streak in Big Ten history. The 24-year run also ranked tied for the third-longest in NCAA history and was the second-longest active streak in the nation. Izzo tied former Duke head coach Mike Krzyzewski for the most consecutive NCAA Tournament appearances and entered the 2022-23 season as the active leader for consecutive appearances.\n\n\n\nMichigan State finished the 2020-21 season with a 15-13 overall record and advanced to the NCAA Tournament for the 23rd-straight season, the longest streak in Big Ten history and the third-longest active streak among Division I schools. In a season shortened to just 28 games due to the COVID-19 pandemic, the Spartans opened the season with six-straight non-league wins, including a 75-69 win at Duke in the Champions Classic. After starting the Big Ten Conference season with three-straight losses and a 2-7 record through nine games, MSU finished the season with a 7-4 mark against Big Ten opponents and closed out the regular season with five wins in its last seven games, including wins against No. 5 Illinois, No. 4 Ohio State and No. 2 Michigan.\n\n\n\nThe 2019-20 season finished with Michigan State clinching a share of the Big Ten regular season title for the third-straight year. The Spartans won their last five regular season games and six of the last seven overall, to finish 14-6 and claim a share of the title. While the postseason was canceled due to the COVID-19 pandemic, MSU finished the season with a 22-9 overall record and a 14-6 record in league play. The Spartans opened the season ranked No. 1 in the country in the Associated Press pre-season poll, the first time in program history the team was the top-ranked team in the preseason. MSU finished the season ranked second in the country in assists per game (17.7), while also ranked fourth in field goal percentage defense (37.9 percent) and ninth in total rebounds per game (40.6). Of the 28 20-win seasons in Michigan State history, Izzo has been involved in 25 of them, 20 as a head coach and five as an assistant.\n\n\n\nThe 2018-19 season was among the most memorable in Michigan State history under Izzo. The Spartans finished with a 32-7 overall record, the fifth 30-win season under Izzo, won a share of the Big Ten regular season championship, won the Big Ten Tournament Championship for a conference-record sixth time and reached the Final Four for the eighth time in 21 years and the 10th time in program history. Along the way, MSU won the Las Vegas Invitational, beat Michigan three times, including a 65-60 decision in the Big Ten Tournament Championship, and toppled No. 1 Duke, 68-67, in the Elite Eight of the NCAA Tournament. MSU finished the year leading the nation in total rebounds (1,580) and total assists (715), while ranking among the top-10 in the country in six other categories: assists per game (3rd, 18.3 apg), total blocks (3rd, 205), field goal percentage defense (3rd, 38.1%), rebound margin (5th, 8.8 rpg), defensive rebounds per game (6th, 29.72 rpg) and blocked shots per game (7th, 5.3 bpg).\n\n\n\nMichigan State finished the 2017-18 season with a 30-5 overall record, the fourth 30-win season under Izzo, advanced to the NCAA Tournament for a Big Ten-record 21st straight season and won the program’s eighth Big Ten regular season championship. The Spartans set a school record for most wins in a regular season (28), won their first outright Big Ten Regular Season title since 2009, won 16 Big Ten Conference games for the first time and had the fewest losses in a regular season since the 2000-01 team went 24-3. The New Year started with MSU moving into the No. 1 spot in the national rankings for the fifth time in program history, and the fourth time under Izzo. The Spartans had win streaks of 14 games and 13 games during the season, earning a No. 3 seed in the Midwest Region of the NCAA Tournament. MSU finished the year leading the nation in assists per game (19.1), blocked shots per game (7.2), field goal percentage defense (36.7%) and rebound margin (+10.7).\n\n\n\nThe 2016-17 season saw Michigan State advance to the NCAA Tournament for a Big Ten-record 20th straight season. It was not an easy road, however, to reach the postseason. Before the season started, the Spartans lost senior forwards Ben Carter and Gavin Schilling to season-ending knee injuries. MSU’s November was arguably the toughest opening month in college basketball history. In addition to games against four ranked opponents, all away from home, the Spartans traveled more than 13,600 miles in 22 days with trips to Hawaii, New York, North Carolina and the Bahamas. In December, the Spartans played seven contests without leading scorer Miles Bridges. Despite all the adversity, including losing a third player, Eron Harris, to a season-ending knee injury in February, the Spartans pulled together and used a 5-2 mark in February to earn their way into the NCAA Tournament. When MSU defeated Miami in the first round of the NCAA Tournament, the Spartans secured their 20th win of the season. It was quite an accomplishment for a team that was one of the least experienced (321st) and shortest (291st) in the nation according to KenPom.com.\n\n\n\nThe 2015-16 season was a milestone year both for Coach Izzo and the Spartans. Michigan State opened the year by winning its first 13 games, establishing a new school mark for best start to a season. When the Spartans defeated Boston College on November 26, Izzo became the 91st coach in NCAA history to record 500 career wins, with at least 10 seasons in Division I, and just the eighth coach to accomplish the feat in his first 21 seasons. He also became just the 18th coach to win 500 career games in his first collegiate head-coaching stop, and was the eighth-fastest coach to reach 500 wins among those who did it all at one school, accomplishing the feat in 699 games.\n\n\n\nOn December 7, MSU rose to No. 1 in the regular-season polls for just the fourth time in school history, and the third time under Izzo. The Spartans would hold the top spot for a school-record four weeks. Following a perfect 13-0 non-conference slate, Michigan State would finish second in the Big Ten with a 13-5 mark. A victory over Northwestern gave Izzo 513 for his career, moving past Purdue’s Gene Keady for second-most wins at a Big Ten School, trailing only Bob Knight (662). In the Big Ten Tournament, the Spartans defeated Ohio State, Maryland and Purdue to become the first school in Big Ten history to hold five conference tournament titles. The Spartans earned a No. 2 seed in the NCAA Tournament, where they were upset by No. 15 Middle Tennessee. MSU finished the season with a 29-6 record, matching the fourth-best win total in school history, as the Spartans’ 26 regular-season victories equaled a school record. Izzo’s Spartans were the only team in the nation to win 27 or more games every year from 2011-12 to 2015-16.\n\n\n\nStatistically, the 2015-16 season was one of the most impressive in school history. Michigan State led the nation in 3-point field-goal percentage (.434), rebound margin (+11.4), assists per game (20.5) and total assists (719). The Spartans ranked in the top three in eight different categories, and in the Top 10 in 11 different categories. It marked the fifth time in Izzo’s career that the Spartans led the nation in rebounding margin. MSU also set school single-season records for assists (719), 3-point field goals made (321) and blocked shots (177). The 719 assists were the 22nd-best total in NCAA history, while MSU recorded an assist on a nation’s-best 71.3 percent of its field goals. At 79.8 points per game, the 2015-16 squad was the highest-scoring team of the Izzo era, and the highest-scoring team since 1985-86. In Big Ten Conference games, MSU led the conference in 12 stat categories and was ranked in the top three in 17 of the 21 stats.\n\n\n\nThe 2014-15 Spartans provided a lesson in resiliency and the power of togetherness. MSU opened the season ranked in the polls, but by Christmas, the Spartans had fallen out of the rankings. Following a home loss to Illinois on Feb. 7, the Spartans stood at 15-8, including just 6-4 in conference. MSU closed the regular season by winning six of its last eight games, including a final week that featured a come-from-behind home finale win over Purdue on Senior Day despite a first-half injury to Branden Dawson, and a regular-season finale victory at Indiana without Dawson. In the Big Ten Tournament, MSU defeated Ohio State and No. 8 Maryland before falling to No. 6 Wisconsin in overtime. The Spartans were disappointed to have let a championship opportunity slip away, but entered the NCAA Tournament on a mission.\n\n\n\nHaving entered March just hoping to secure a spot in the NCAA Tournament, the postseason run turned a good season into a great one. As the No. 7 seed, MSU opened with a victory over No. 10 Georgia. In the third round, MSU faced No. 2 Virginia for the second-straight season, defeating the Cavaliers to advance to a nation’s-best seventh Sweet 16 in the last eight seasons. At the East Regional in Syracuse, the Spartans trailed at the half against both No. 3 Oklahoma in the Sweet 16 and No. 4 Louisville in the Elite Eight, before rallying for a pair of victories to reach the Final Four. Making its nation’s-best seventh Final Four appearance in the last 17 seasons, MSU got off to a quick start against No. 1 Duke before falling to the eventual National Champion Blue Devils. MSU would finish 27-12, 12-6 in the Big Ten.\n\n\n\nThe senior class of 2015 finished tied for the second-winningest class in school history with 112 wins. The 2014-15 Spartans established school single-season records for assists (646) and blocks (176), while the 294 made 3-pointers were second-most in school history. Averaging 16.6 assists per game, the Spartans ranked fifth in the nation, while ranking seventh in assist-to-turnover ratio (1.5). Defensively, MSU posted a .396 field-goal percentage defense, marking the fourth-straight season that Spartan opponents shot less than 40 percent from the field.\n\n\n\nThe 2013-14 season was not short of highlights. It started early, with No. 2 MSU knocking off No. 1 Kentucky, 78-74, on Nov. 12 in Chicago, in what was the earliest game ever between No. 1 and No. 2. One week later, MSU ascended to No. 1 in the polls, a position it would hold for three weeks – establishing a school record at the time for the longest stay at No. 1. In late November, the Spartans captured the Coaches Vs. Cancer Tournament title in Brooklyn, marking MSU’s first regular-season, neutral-site tournament championship since December 1998.\n\n\n\nInjuries proved to be a common storyline during the 2013-14 campaign, as six different players, including each one of MSU’s top four scorers, missed multiple games due to injury or illness for a total of 29 games missed. In 19 of 38 games, including 13 of 18 Big Ten contests, the Spartans were without their full allotment of players due to injury. In nine games, Michigan State was without two of its regular rotation players. In total, 11 different Spartans started at least one game, as Izzo employed 15 different starting lineups. The fluctuation led to inconsistent results through much of the Big Ten slate, but by the end of the regular season, MSU was getting healthy.\n\n\n\nPlaying at full strength, the Spartans played at a different level in the postseason, steamrolling through the Big Ten Tournament. The championship game featured the third meeting of the season between in-state rivals Michigan State and Michigan, marking the first time the Spartans and Wolverines would meet in the conference tournament. Although UM won the two regular-season meetings, this was the first time MSU would feature a complete roster, pulling away early in the second half to capture the fourth tournament championship in school history with a 69-55 victory.\n\n\n\nMSU entered the NCAA Tournament as the No. 4 seed in the East Region, but was also a popular pick to advance to the Final Four and even cut down the championship nets. In the second round, Adreian Payne scored an MSU NCAA Tournament record 41 points to defeat Delaware, 93-78. Two days later, the Spartans advanced to the Sweet 16 with an 80-73 win over Harvard. Playing in the East Regional in New York City’s Madison Square Garden, Michigan State defeated No. 1 seed Virginia, 61-59. In the Elite Eight, the Spartans held a nine-point lead in the second half against Connecticut, but the eventual National Champion Huskies would rally for a 60-54 victory.\n\n\n\nThe 2013-14 Spartans finished with a 29-9 record, including 12-6 in the Big Ten, finishing tied for second. The 29 wins tied for the fourth-best total in school history, while MSU established single-season school records for assists (637), made 3-point field goals (307), and blocks (174). Michigan State led the conference in field-goal percentage defense (.397), while ranking second in field-goal percentage (.474) and 3-point field-goal percentage (.392). The Spartans also finished with an all-time low 11.6 turnovers per contest.\n\n\n\nIn 2012-13, the Spartans collected a 27-9 record, including 13-5 in the Big Ten, against perhaps the nation’s most difficult schedule, playing 13 games against ranked opponents. The slate was especially difficult down the stretch as 14 of MSU’s last 18 games (postseason included) were against opponents that participated in the NCAA Tournament. Michigan State advanced to its 16th consecutive NCAA Tournament as the No. 3 seed in the Midwest Region, and advanced to the Sweet 16 for the fifth time in the last six seasons, tied for the most in the nation.\n\n\n\nOn Jan. 16, 2013, Izzo recorded his 200th conference victory against Penn State, joining Mike Krzyzewski (Duke) and Jim Boeheim (Syracuse) as the only active coaches in a power conference with 200 conference wins at their current school. In April, Izzo received the Wayman Tisdale Humanitarian Award, honoring an individual in college basketball who has made a significant impact on society.\n\n\n\nThe Spartans proved to be dominant defensively once again in 2012-13, pacing the Big Ten in field-goal percentage defense (.390) and steals (8.0 spg), while ranking second in scoring defense (59.1 ppg) and third in 3-point field-goal percentage defense (.300). MSU also continued to be strong on the glass, ranking second in the Big Ten and 10th in the nation with a +7.6 rebound margin, marking the 11th time that an Izzo-coached team ranked in the Top 10 in the nation.\n\n\n\nThe 2011-12 season was one of Izzo’s most rewarding as head coach. The Spartans entered the season unranked, returning only two players who averaged more than 20 minutes a game the previous season. MSU opened the year with neutral-site losses to No. 1 North Carolina and No. 6 Duke, but responded with 15 straight victories, including road wins at No. 23 Gonzaga and No. 18 Wisconsin, marking the Spartans’ first win in Madison since 2001. Keyed by a mid-February win at No. 3 Ohio State, MSU would go on to capture a share of the Big Ten regular-season championship, the seventh of the Izzo era, and head to the Big Ten Tournament where it defeated Ohio State to capture the third Big Ten Tournament title in school history, and the first since 2000. Michigan State was rewarded with a No. 1 seed in the West Region of the NCAA Tournament, where it would advance to the Sweet 16 for the 10th time in the last 15 years, good for second most in the nation. MSU would finish with a 29-8 record.\n\n\n\nStatistically, the Spartans finished the 2011-12 season ranked second in the nation in field-goal percentage defense (.379), the best effort by a Spartan squad since 1959. Once again, the Spartans were a dominant presence on the glass, ranking fifth in the nation in rebounding margin (+8.0), and pacing the Big Ten for the 12th time in the last 15 seasons, and the 13th time in his career.\n\n\n\nFor his efforts, Izzo was named the 2012 Big Ten Coach of the Year by both the league’s media and coaches. He also was named Division I National Coach of the Year by the NABC, and was CBSSports.com’s pick for national coach of the year as well.\n\n\n\nThe 2010-11 Spartans finished with a 19-15 mark and advanced to a 14th-straight NCAA Tournament. MSU faced a difficult regular-season schedule that included 18 of 33 games against the RPI Top 50 and 23 of 33 against the RPI Top 100.\n\n\n\nMichigan State turned in another great season in 2009-10, capturing a share of a second-straight Big Ten Championship and advancing to a sixth Final Four in 12 seasons. With MSU’s 106-68 victory over UMass in the sixth game of the season, Izzo recorded his 341st victory, becoming Michigan State’s all-time winningest coach. The Spartans opened Big Ten play with a school-best 9-0 start and captured a share of the regular-season crown with a 14-4 mark. Overall, MSU would finish with a 28-9 record.\n\n\n\nThe Spartans opened the 2010 NCAA Tournament as a No. 5 seed and advanced through the first weekend with narrow victories over New Mexico State (70-67) and Maryland (85-83). In the Midwest Regional, the Spartans won two more close games, defeating Northern Iowa (59-52) and Tennessee (70-69) to advance to the program’s eighth Final Four and the sixth in the last 12 seasons under Izzo. Michigan State led the nation in rebounding margin for the fourth time in Izzo’s career, out-rebounding opponents by a +8.6 margin.\n\n\n\nThe 2008-09 season was one of the best in the history of Spartan basketball. Michigan State advanced to its fifth Final Four in 11 seasons, becoming just the fifth school in the history of college basketball to accomplish that feat. During the regular season, the Spartans won the Big Ten Championship with a 15-3 league record, including a school-best 8-1 mark on the road. MSU won the league title by four games, equaling the second-greatest margin in conference history. Overall, Michigan State finished the season with a 31-7 record, the third-highest win total in school history. For his efforts, Izzo was named Big Ten Coach of the Year for the second time in his career.\n\n\n\nIn the NCAA Tournament, Michigan State advanced through the first weekend with wins over Robert Morris and USC. In the Sweet 16, the Spartans took out defending National Champion Kansas. In the Elite Eight, MSU beat No. 1 seed and No. 1 ranked Louisville, marking just the third victory over the top-ranked team in The Associated Press Top 25 in school history. At the Final Four in Detroit’s Ford Field, the Spartans beat No. 1 seed Connecticut before eventually falling to North Carolina in the title game.\n\n\n\nMichigan State led the nation in rebounding margin for the third time in Izzo’s career, out-rebounding opponents by a +9.3 margin. It marked the eighth time that an Izzo-coached team ranked in the top 10 in the nation. The Spartans also proved to possess a high-powered attack, leading the Big Ten in scoring offense (72.0 ppg).\n\n\n\nIzzo directed Michigan State to a 27-9 record in 2007-08. The season finished with a trip to the Sweet 16 of the NCAA Tournament, marking MSU’s seventh trip to the regionals in the last 11 years. The 27 wins marked the fifth-largest total in school history at the time, while the 24 regular-season victories were the then third-largest regular-season total for MSU. The Spartans were a perfect 17-0 at home, good for the first perfect home season since 2001 and the fourth in Breslin Center history.\n\n\n\nThe 2007-08 Spartans led the Big Ten in rebounding margin (+6.8). In league games, MSU paced the conference in field-goal percentage (.474) for the fifth-straight season, becoming the first school in league history to accomplish that feat.\n\n\n\nMichigan State finished with a 23-12 mark in 2006-07. The Spartans had to overcome a large amount of adversity and a very difficult Big Ten schedule to advance to a 10th-straight NCAA Tournament. The Spartans also did something for the first time in school history – recording Michigan State’s first home win over a No. 1-ranked team, with a 64-55 decision over Wisconsin.\n\n\n\nThe 2006-07 Spartans excelled by getting back to basics – rebounding and defense. On the glass, the Spartans led the Big Ten in rebounding margin (+7.0). Defensively, MSU allowed opponents just 57.2 points per game, the lowest total since the 1951-52 squad allowed 56.0 points. Opponents also shot just 38.4 percent from the field, the lowest percentage since 1958-59 (.379). Nationally, the Spartans ranked sixth in scoring defense and field-goal percentage defense and eighth in rebounding margin.\n\n\n\nIn 2005-06, Michigan State finished with a 22-12 mark. The Spartans played one of the nation’s toughest schedules, playing more games against teams ranked in the RPI top-25 (13) and top-50 (18) than any other school. In Big Ten games, MSU led the conference in five stat categories including free-throw percentage (.781), field-goal percentage (.469), rebounding defense (30.1), rebounding margin (+4.2) and assists (15.81 apg).\n\n\n\nMichigan State returned to the Final Four in 2005, becoming the only team to appear in four Final Fours between 1999 and 2005. The Spartans finished the season with a 26-7 mark, including 22-5 in the regular season. Since joining the Big Ten, only three Spartan teams finished the regular season with fewer losses.\n\n\n\nIn the NCAA Tournament, MSU defeated No. 1 Duke and No. 2 Kentucky in the Austin Regional, becoming the first team in tournament history to defeat the Blue Devils and the Wildcats in the same year. Despite losing to North Carolina in the Final Four, Izzo was named the 2005 Clair Bee Award winner, recognizing the Division I men’s basketball coach who has made the most significant positive contribution to his sport.\n\n\n\nNot only did the 2004-05 Spartans win, they were also statistically impressive, ranking in the top 15 nationally in six statistical categories, including free-throw percentage (3rd, .777), scoring margin (7th, +13.1), assists per game (10th, 17.1 apg), field-goal percentage (11th, .487), rebound margin (11th, +6.8) and scoring offense (13th, 78.5 ppg). MSU led the Big Ten in scoring for the second-straight year with 78.5 points per game – its highest scoring average since 1985-86 (83.1 ppg).\n\n\n\nDuring the season, Izzo recorded his 232nd win at MSU, moving past Benjamin Van Alstyne for the second most number of career wins in Spartan coaching history. In the summer of 2005, Izzo traveled to Kuwait to take part in “Operation Hardwood - Hoops With The Troops.” Izzo was one of eight coaches and sports personalities coaching 13-member military basketball teams on Camp Arifjan, Kuwait, from Aug. 27-31. Camp Arifjan defeated the other bases to win the championship under the direction of Coach Izzo. Izzo made a return trip to Kuwait in May 2006.\n\n\n\nIn 2003-04, MSU opened the season with a 5-7 mark after taking on one of the most difficult non-conference schedules in NCAA history. Rather than give up, Izzo and the Spartans rallied to win 12 of the next 15 games, finishing just one game out of first place in the Big Ten at 12-4. For the year, MSU posted an 18-12 mark. Michigan State became the first team in Big Ten history to lead the conference in scoring offense (71.3 ppg), field-goal percentage (.522), 3-point field-goal percentage (.434) and free-throw percentage (.777) in the same season.\n\n\n\nOn Feb. 4, 2004, MSU defeated Iowa, 89-72, as Izzo recorded the 200th victory of his Spartan career, becoming just the third coach in MSU history to accomplish that feat. He also became the eighth head coach in NCAA history to record 200 wins in his first nine seasons. Ten days later, Izzo became just the third coach in Big Ten history to record 100 league wins in his first nine seasons, joining Bob Knight and Gene Keady as MSU defeated Minnesota, 69-58, on Feb. 14.\n\n\n\nThe 2002-03 season was a study in perseverance. Izzo rallied his team to win the final four regular-season games and eight of the last 10 conference games to finish 10-6 in the Big Ten, good for third place in the league. Michigan State made even bigger noise during the NCAA Tournament. The No. 7 seed Spartans easily dismissed Colorado in the first round, setting up a matchup with the No. 2 seed Florida Gators. The Spartans shocked many experts with a 68-46 victory in the Gators’ home state. In the Sweet 16, MSU defeated defending national champion Maryland in a thrilling two-point game, before eventually falling to the No. 1 seed Texas Longhorns in the Lone Star State.\n\n\n\nThe Elite Eight appearance was the fourth for MSU between 1999 and 2003. During that time period, no other school made more than two trips. In fact, since the NCAA Tournament expanded to 64 teams in 1985, just six programs (Duke, Florida, Kentucky, Michigan State, North Carolina and UNLV) have advanced to four Elite Eights in any five-year period.\n\nThe 2001-02 season may prove to be one of Izzo’s finest. Despite losing 81 percent of the scoring load from 2000-01, and having three key players miss several games with injuries, Izzo led the Spartans to a 10-6 Big Ten mark (19-12 overall), finishing just one game out of first place. MSU won 10 of the last 13 regular-season games and earned a spot in the NCAA Tournament.\n\n\n\nIn 2000-01, Izzo earned NABC National Coach of the Year and District 11 Coach of the Year honors for leading MSU to its third straight Final Four and fourth straight regular-season Big Ten Championship. MSU became just the fourth school in Big Ten history to win four-straight league titles.\n\n\n\nMSU opened the season by winning its first 12 games to establish the best start in school history. On Dec. 25, 2000, the Spartans earned the top spot in The Associated Press Top 25, marking the first time they held the No. 1 position in the AP Poll since 1979. In Big Ten action, Michigan State posted a 13-3 record to win a share of the league crown. The Big Ten finale vs. Michigan marked Izzo’s 100th Big Ten game. Through his first 100 games, Izzo posted a 72-28 mark, the fifth-best record in Big Ten history.\n\n\n\nIn the 2001 NCAA Tournament, Izzo guided the Spartans to a third-straight Final Four. For a third consecutive season, Michigan State earned a No. 1 seed. MSU won the first three games by double figures, establishing a record with nine straight NCAA Tournament victories by double digits. When MSU defeated Temple, 69-62, in the South Regional Final, the Spartans became just the ninth school to reach three-straight Final Fours and just the third since the NCAA Tournament field expanded to 64 teams in 1985. On the season, MSU finished with a 28-5 record.\n\n\n\nMichigan State led the nation in rebound margin for the second straight season at +15.4 boards per game, tying the fifth-largest margin in Division I history (greatest since 1980). The Spartans also ranked 13th in the nation in scoring defense (61.8 ppg).\n\n\n\nIn 1999-2000, Michigan State captured the second NCAA Championship in school history and its third straight regular season Big Ten Championship. MSU also won at least 30 games for the second straight season, posting a 32-7 mark, becoming just the second Big Ten school to accomplish that feat. The 65 wins over the 1998-99 and 1999-2000 seasons were the greatest two-year total in the history of the Big Ten. MSU also repeated as Big Ten Tournament champions.\n\n\n\nIzzo led MSU to consecutive Final Fours for the first time in school history. For his efforts, Izzo was named USBWA District V Coach of the Year and NABC District 11 Coach of the Year. Izzo also recorded his 100th career victory in a Jan. 11, 2000, 77-71 overtime win over Indiana in the Breslin Center.\n\n\n\nFor the second consecutive season, Michigan State earned a No. 1 seed in the Midwest Region of the NCAA Tournament. After disposing of Valparaiso and Utah in Cleveland, the Spartans moved on to the Sweet 16 at the Palace of Auburn Hills, where they recorded come-from-behind victories versus Syracuse and Iowa State. In the Final Four, MSU defeated Wisconsin for the fourth time that season. The Spartans then captured their second NCAA title in school history, defeating Florida, 89-76.\n\n\n\nIn 1998-99, Izzo directed the Spartans on a magical run to the program’s first appearance in the NCAA Final Four since 1979. Michigan State posted a record of 33-5, establishing a school record for most wins in a season. For his efforts, Izzo was named the Basketball Times National Coach of the Year and the National Association of Basketball Coaches (NABC) District 11 Coach of the Year. Throughout the Big Ten season, Michigan State established itself as the class program of the conference. Izzo directed the school to its second-straight Big Ten title. The Spartans followed up a 15-1 Big Ten regular season by capturing their first Big Ten Tournament championship. The 15 league wins tied a school record for most victories in conference play, while the Spartans’ 93.8 winning percentage established a school record.\n\n\n\nWhereas MSU’s success in 1998-99 was expected, the Spartans took the college basketball world by storm in 1997-98. Izzo became the first MSU coach to earn Associated Press National Coach of the Year honors, leading MSU to a 22-8 record and a share of the Big Ten title. The Spartans posted a 13-3 mark in conference, earning Izzo Big Ten Coach of the Year honors.\n\n\n\nOver the course of the 1997-98 season, Izzo and his team finished the year ranked No. 10 nationally by USA Today/ESPN, marking the first time the Spartans had finished in the Top 10 since 1995. In addition to his AP award, Izzo was named National Coach of the Year by Basketball News and the United States Basketball Writers Association (USBWA). Basketball Times selected Izzo as its Mideast Coach of the Year.\n\n\n\nDuring Izzo’s first season as head coach in 1995-96, he directed the Green and White to an overall slate of 16-16, including 9-9 in the Big Ten. Izzo recorded four wins over Top 25 teams. In 1996-97, Izzo guided the Green and White cagers to an overall mark of 17-12, including a Big Ten ledger of 9-9. Izzo led the Spartans to the second round of the NIT in each of his first two seasons.\n\n\n\nIn his 40th season as a member of the MSU coaching staff, Izzo has been with the Spartan program since taking a part-time assistant coaching position in 1983. An assistant coach with the Spartans from 1983-86, Izzo left MSU in May of 1986 to become the top assistant and recruiting coordinator at Tulsa. But, on June 10 of the same year, Izzo returned to East Lansing when Spartan assistant Mike Deane left to become head coach at Siena College.\n\n\n\nKnown as a tireless worker both on the recruiting trail and in the office, his hard work and loyalty were rewarded in July 1990, when Jud Heathcote appointed him associate head coach. His dutiful efforts were further recognized when, on March 30, 1993, then-MSU Athletics Director Merrily Dean Baker recommended both a one-year contract extension for Heathcote through the 1994-95 season and that Izzo be appointed head coach upon Jud’s retirement. The MSU Board of Trustees accepted both recommendations on April 9, 1994.\n\nIzzo originally came to MSU from Northern Michigan, where he had been an assistant from 1979-83. He was named a part-time assistant at MSU in September 1983. When former assistant Edgar Wilson left in November 1983, Izzo became a full-time assistant.\n\n\n\nIzzo played guard for NMU’s basketball team from 1973-77, and was voted the team’s MVP as a senior. He was also a third-team Division II All-America pick that year and established the Wildcat record for most minutes played in a season. Following his graduation from NMU in 1977, Izzo took over as head coach at Ishpeming High School and served in that position for the 1977-78 campaign.\n\n\n\nA native of Iron Mountain, Michigan, Izzo and former NFL head coach Steve Mariucci were Iron Mountain High School teammates in football, basketball, baseball and track. As college roommates at Northern Michigan, Izzo walked on to the basketball team, while Mariucci did the same with football. Both would go on to earn Division II All-America honors. Despite their busy schedules, they remain the closest of friends. For 10 years, they co-hosted a golf tournament in Iron Mountain to raise money for the community, including a fitness center for the high school.\n\n\n\nIn 1990, Izzo was inducted into the Northern Michigan University Hall of Fame and was selected as an inductee into the Upper Peninsula Hall of Fame during the summer of 1998. He was inducted into the National Italian-American Sports Hall of Fame in 2011, and the Michigan Sports Hall of Fame in 2015. He received the sport’s ultimate honor when his election into the Naismith Memorial Basketball Hall of Fame was announced on April 4, 2016. He was officially enshrined in Springfield, Massachusetts, on Sept. 9, 2016.\n\n\n\nIn 2001, Izzo received honorary degrees from both Northern Michigan and Michigan State, delivering the commencement address at both graduation ceremonies.\n\n\n\nIzzo is also an active volunteer in the community. Among his many efforts, he is very active with Coaches Vs. Cancer, Volunteers of America and Sparrow Hospital. In 2009, Izzo was presented the Coaches Vs. Cancer Champion Award, recognizing his work and leadership in the fight to save lives from cancer.\n\n\n\nIzzo and his wife, Lupe, created the Izzo Legacy Fund in 2019 to formalize their commitment to the Mid-Michigan community. The Izzo Legacy Fund helps to raise money and contributions to charitable causes in the area.\n\n\n\nIzzo was born Jan. 30, 1955. His family includes his wife, Lupe, daughter, Raquel, and son, Steven.\n\n\n\n"}, {"url": "https://www.espn.com/nba/story/_/page/HOFindex16/nba-2016-basketball-hall-fame-coverage", "page_content": "The star-studded 10-member class of 2016 -- including Shaquille O'Neal, Yao Ming and Allen Iverson -- was inducted into the Naismith Memorial Basketball Hall of Fame on Sept. 9 in Springfield, Mass.\n\nHALL OF FAME WEEKEND\n\nCLASS OF 2016\n\nShaquille O'Neal\n\nElected as player\n\nFour-time NBA champion (2000, 2001, 2002, 2006)\n\nNBA MVP (2000), three-time Finals MVP\n\n15-time NBA All-Star\n\nAllen Iverson\n\nElected as player\n\n11-time NBA All-Star; NBA MVP (2001)\n\nFour-time NBA scoring champion\n\nYao Ming\n\nElected as player\n\nEight-time NBA All-Star; five-time All-NBA selection\n\nThree-time FIBA Asian Championship MVP\n\nTom Izzo\n\nElected as coach\n\nNCAA national champion (2000)\n\nAP National Coach of the Year (1998)\n\nHas led Michigan State to seven Final Fours\n\nSheryl Swoopes\n\nElected as player\n\nFour-time WNBA champion\n\nThree-time WNBA MVP (2000, 2002, 2005)\n\nSix-time WNBA All-Star; five-time All-WNBA first-team selection\n\nJerry Reinsdorf\n\nElected as contributor\n\nPurchased Chicago Bulls in 1985\n\nSix-time NBA champion owner\n\nDarell Garretson\n\nElected as referee\n\n27-year career: 1,798 regular-season games, 269 playoff games, 41 Finals games\n\nServed as NBA chief of officiating staff and director of officials from 1981 to '98\n\nZelmo Beaty\n\nElected as player\n\nTwo-time NBA All-Star; three-time ABA All-Star\n\n1971 ABA champion with Utah Stars\n\nAveraged 25 points and 20 rebounds per game for Prairie View A&M (1958 to '62)\n\nCumberland Posey\n\nElected as player\n\nLed the Loendi Big Five to four straight Colored Basketball World Championships from 1919 to 1922\n\nMultisport athlete; inducted into Baseball Hall of Fame in 2006\n\nJohn McLendon\n\nElected as coach\n\nGuided Tennessee State to three consecutive NAIA titles from 1957 to 1959\n\nFirst African-American coach to win a national championship\n\nEnshrined in Basketball Hall of Fame as contributor in 1979\n\nHALL OF FAME CONTENT"}]}