{"Tommy Nutter was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities.": [{"url": "https://www.theguardian.com/lifeandstyle/2011/may/18/tommy-nutter-rebel-tailor-savile", "page_content": "Mick and Bianca chose to wear his designs on their wedding day; he was on Elton John's speed-dial, and was the go-to man for women who wanted to wear men's tailoring.\n\nNow the work of Tommy Nutter, the first tailor to successfully combine Savile Row traditions with the cutting edge fashion of Swinging London, is being celebrated with a display at the Fashion and Textile Museum.\n\n\"His approach to tailoring was subversive,\" said Timothy Everest, the renowned tailor who trained under Nutter in the late 80s and is joint curator for the show in Bermondsey Street, south-east London. \"He was articulating bespoke tailoring to a new, younger, audience.\"\n\nNutter was the first tailor to open up his Savile Row premises to passers-by; his shop had windows at a time when bespoke tailoring was usually behind closed doors. He opened his first shop in 1969, joining forces with the master cutter Edward Sexton, and backed by Cilla Black and the Beatles executive Peter Brown.\n\nThe shop attracted rock stars and aristocrats who wanted the mix of innovative styling and traditional made-to-measure tailoring. Huge lapels, velvet jackets with nipped-in waists, Oxford bags and mixed-up tweeds fast became his design signatures.\n\nHighlights from the exhibition, Tommy Nutter: Rebel on the Row, include four of Mick Jagger's suits – boyish-sized save for the shoulders – in shades of green and lemon. Elton John's stadium-ready two-tone dinner jackets are striking and tasteless in equal measure.\n\n\"Tommy completely glamorised Savile Row and made it accessible,\" said Elton John, who often visited the shop to be measured up while drinking a glass of sherry.\n\nIn the early 70s Nutter created suits for Bianca Jagger. \"Bianca really wanted a man's suit and not a suit cut for a woman,\" Everest said. \"She asked for the darts to be taken out of her first pistachio green suit to make it sexier.\"\n\nThe exhibition has recreated Nutter's shop, along with its innovative window displays featuring patchouli-soaked stuffed rats wearing diamond chokers, to demonstrate how pioneering his approach to brand image was at the time.\n\nThe tailor stopped working with Sexton at 35a Savile Row in 1976 but returned to the street some years later to set up business again, at No 19. He died aged 49 in 1992."}, {"url": "https://savilerow-style.com/news/tommy-nutter-rebel-cause/", "page_content": "Tommy Nutter, the tailor who ripped up the rules of Savile Row, is remembered in a new biography. Tom Corby reports\n\nJust over a quarter of a century after his untimely death from Aids, the avant-garde Tommy Nutter, like so many creatives of his generation, is still regarded as a legend, remembered as the tailor who single-handedly reconciled the traditions of Savile Row with the male peacock revolution of 1960s swinging London. His contribution to some of the most iconic styles and pop imagery of the 20th century has become part of the history of his trade as he wore down the division between tailoring and fashion. Friends say that a statue ought to be put up of him, like that of Beau Brummel, the archetypal dandy who, in the 18th century, set the bespoke style for generations.\n\nTommy spent his formative years in Edgware, north London, where his father owned a café, catering, in the main, to customers like truck drivers, gas fitters and builders. He was destined to be a plumber but, over the years, emerged as a blue collar boy made good in the class crucible of the 60s; a time when the alchemy of taste, cool, and sheer force of personality could transform lives in ways that would have seemed impossible in years gone by. Tommy, a 6ft 2 inches tall young man with matinee idol looks, arrived right on cue. It all started when, aged 19, he broke free from plumbing to study tailoring at the Tailor and Cutter Academy. He then landed an apprenticeship with Donaldson, Williamson and Ward, traditional Savile Row tailors, with premises in Burlington Arcade. There, he absorbed the lore and the rules of the English gentlemen’s classic wardrobe. His seven years with the firm gave him a thorough knowledge of his craft, and a lifelong respect for its hierarchy.\n\nIn 1969, Tommy founded his own business, joining up with Edward Sexton, a young cutter with brilliant technical skills. They were financially backed by Tommy’s close friend, the singer Cilla Black, her husband Bobby Willis and others prepared to take a risk. The venture was an immediate success although a writer in the Daily Mirror snarked: “Thomas Nutter is opening what he calls a ‘thoroughly square’ tailoring shop … in Savile Row next week. Well that will make a change. I mean there can’t be more than a dozen there now. Mr Nutter, who is 26, is weary of ‘all those Carnaby Street gimmicks’, and thinks that clothes, like hair, are settling down to something more sober … What, then, of rumours that Ringo Starr has ordered a pair of scarlet PVC trousers from Nutters?” Tommy replied curtly: “They’ll be very square scarlet PVC trousers.”\n\nSavile Row, with its collection of Royal Warrants, had never seen anything like it when Nutters opened at No. 35a, the story of which has been brought back to life by Lance Richardson in his biography House of Nutter – The Rebel Tailor of Savile Row. A year on, the Daily Mail was declaring it “a whizz bang success – the place for men’s clothes”, putting the charismatic Tommy in the class of actor Terence Stamp, photographer Brian Duffy, and hair dresser Vidal Sassoon, all the stylish young Londoners who had shot themselves into the new aristocracy. Clients came in from the hipper haunts of those named in Debrett’s, from the media, pop stars and even aspiring teenage dandies from the East End, whose ambition was to own a Nutter suit, drawn to Tommy not only because of his matchless sense of style, but also because of his personality. He welcomed them all.\n\nLike Hardy Amies, a Savile Row dandy who dressed The Queen, Tommy produced lively, contemporary tailoring, but with roots deeply embedded in the craftsmanship of Savile Row. Amies named Tommy as “the most exciting tailor on Savile Row in decades.” For three decades, Tommy kitted out the biggest stars on both sides of the Atlantic. He was proud of the fact that, for the cover of the Beatles’ Abbey Road album, three of them wore Tommy Nutter bespoke. George Harrison chose\n\ndenim. Other leading dandies of the period were also his clients, including Sir Roy Strong, then director of the National Portrait Gallery, Mick Jagger and Elton John. Andrew Lloyd Webber was also a client as well as a friend. He has recalled: “There was a wonderful maroon coat I wore for Ascot – he was always such fun, very much part of my early life when Jesus Christ Superstar was going on – Tommy made clothes for Tim Rice too – we were all great mates.”\n\nMick Jagger sported an eau-de-nil three-piece for his wedding to Bianca Perez-Mora Macias in 1971. He was in another Nutter creation days later on his honeymoon in Venice, fitted so snugly that it left no doubt as to which side he dressed. Celebrity nuptials became something of a thing for Tommy. John Lennon wore cream corduroy for his wedding to Yoko Ono on Gibraltar. For Elton John’s marriage in 1984 Tommy made 20 suits, “two of each, in case of mishap”, as he later recalled, “in a wide range of primary colours, including orange and very bright yellow. With each outfit went the appropriate straw boater.”\n\nJohn Reid, Elton John’s manager, has said: “It was quite an event going to Nutters. You’d write the whole day off. Maybe you’d have lunch and a couple of bottles of champagne.” Tommy has said that when things became “edgy” with Elton he would send out for a bottle of sherry “to smooth things along”. For Elton’s 36th birthday, Tommy made a suit overlaid with 1,009,444 bugle beads, each one painstakingly attached by hand. Tommy also applied his craft to dressing female icons of swinging London, like the red velvet suit for Twiggy which became a celebrated and much copied look when she was photographed wearing it in the early 70s.\n\nPeople were attracted to Tommy not only because of his ineffable sense of style, but because of his ironic personality. He was a humorist with a wide and interesting circle of friends who were attracted by his enthusiasm, his gentle self-mocking personality and his acerbic comments on the vagaries of others, always ending with the expression, “But who am I to talk?” He was a witty correspondent and his letters to his friends are treasured. In addition, he delighted in writing to the serious newspapers on topics as far ranging as the correct buttoning of the suit on a statue of John F Kennedy, to the scarcity of deckchairs in London’s Green Park.\n\nTommy died of Aids in August 1992, aged 49. “The saddest thing of all,” he once wrote, “is an in-between look.” No-one could ever have accused him of that. At his memorial service in St George’s, Hanover Square, just up the road from Savile Row, Cilla Black read an abridged excerpt from Chaucer’s Canterbury Tales, relating the story of “A true, a perfect gentle Knight … In dying in his excellence and flower, when he is certain of his high good name; for then he gives to friend, and self, no shame.”\n\nThe final words should go to Nutters loyalist Elton John who said: “Tommy completely glamorised Savile Row and made it accessible.” There’s no arguing with that…\n\nHouse of Nutter: The Rebel Tailor of Savile Row by Lance Richardson, published by Chatto & Windus. £25"}, {"url": "https://collections.vam.ac.uk/item/O137269/suit-tommy-nutter/", "page_content": "Tommy Nutter (1943-1992) opened his Savile Row premises in 1969. The enterprise was funded by the singer Cilla Black and Peter Brown of Apple, the Beatles's record company. Describing his first look Nutter said: 'Everybody was wearing a narrow suit at the end of the 1960s ... so I just went wild with the lapels and cut them as wide as you possibly could - enormous - and it was terribly flared at the jacket. So that was my first look and it was different from anybody else.' Tommy Nutter’s celebrity clientele included Mick Jagger. Eric Clapton and the Beatles, who are pictured wearing his suits on the front cover of 'Abbey Road'. Such connections enabled Nutter to introduce high fashion to Savile Row and thus effect enormous influence on British menswear.\n\n\n\nThis suit was given by Sir Roy Strong, author, broadcaster, former Director of the National Portrait Gallery and from 1974 to1987, Director and Secretary of the Victoria and Albert Museum. Dating to around 1980, this suit was worn by Sir Roy for public and formal occasions in his capacity as Museum Director. Sir Roy became known for his vigorous support of modern design and was also recognised for his own sartorial flair."}, {"url": "https://edinburghtailoringcompany.com/2023/05/29/who-are-tommy-nutter-and-edward-sexton-and-why-are-they-important/", "page_content": "Edward Sexton and Tommy Nutter are two of the most iconic names in Savile Row tailoring. Renowned for their creativity and skill, these two men were instrumental in revolutionizing the way men dress. Their partnership was known as the “Dynamic Duo of Savile Row”, and they left an indelible mark on the fashion world. Through their dedication to fine craftsmanship and eye for detail, Edward Sexton and Tommy Nutter made Savile Row an international hub of bespoke tailoring.\n\nEdward Sexton – The Rebel Tailor\n\nEdward Sexton is a world-renowned tailor who has made a name for himself by breaking all the rules. His style is modern and sleek, while still maintaining the traditional look of a Savile Row suit. Sexton is the go-to tailor for many celebrities and has even made suits for the likes of Prince Charles and David Beckham.\n\nDespite his rebel status, Sexton is a true craftsman who takes great pride in his work. He is always pushing himself to create the perfect suit and strives to make each one better than the last. Sexton’s style is all about bespoke, handmade garments that are designed to fit the individual wearer perfectly. He is also known for his use of bold and unconventional fabrics, which has helped him to create some truly unique looks.\n\nHe’s worked with some of the biggest names in the music and fashion industry, and his suits are loved for their sharp lines and slim fits. He is known for his impeccable craftsmanship and attention to detail. His work has been featured in many major publications, including Vogue, Harper’s Bazaar, and Esquire. He has also been featured on television shows such as BBC’s The Clothes Show and Channel 4’s How to Look Good Naked.\n\nSexton’s work is truly remarkable, and he is considered to be one of the best tailors in the world. If you are looking for a tailor who can help you to create a truly individual look, then Edward Sexton is the man for you.\n\nTommy Nutter – The Rockstar Tailor\n\nTommy Nutter was nothing short of a rockstar tailor. He was the son of a Chinese laundryman who arrived in London in the 1950s and found work as a tailor’s apprentice. Nutter quickly rose through the ranks and became one of the most sought-after bespoke tailors in London. His clients included everyone from the Rolling Stones and the Beatles to the royal family.\n\nNutter was known for his flamboyant style and his willingness to take risks. He was the first tailor to put his name on the label of his suits, and he was also the first to use unusual materials like leather and denim. His bold style helped to redefine menswear in the 1960s and 1970s, and his influence can still be seen today.\n\nHe was the youngest of three brothers and began his career working in his father’s tailor shop. In 1966, Nutter moved to New York City and began working as a personal assistant to the Hollywood film producer David O. Selznick. After a few years in New York, Nutter returned to London and opened his own tailor shop on Savile Row. He quickly gained a reputation for his unique style and became known as the “Rockstar tailor.” Nutter’s clients included some of the biggest names in the music and fashion industries, such as The Beatles, Mick Jagger, and Twiggy.\n\nNutter’s career came to an abrupt end in 1992 when he died of a heart attack at the age of 49. However, his legacy lives on through his masterpieces.\n\nHow these two came together\n\nWhen two of the most renowned tailors in the world come together, the result is bound to be special. In 1969, two young tailors from Savile Row, Tommy Nutter, and Edward Sexton, joined forces to open a bespoke tailoring business on London’s iconic Bruton Street. Their goal was to create the best tailor-made suits in the world, and they quickly became known for their exceptional craftsmanship and attention to detail.\n\nNutter, who was previously employed by the world-famous Savile Row tailor house Hardy Amies, brought his expert eye for detail and an appreciation for traditional craftsmanship to the partnership. Sexton, on the other hand, was known for his more modern approach to tailoring, which included shorter jacket lengths and bolder colour choices. The combination of Nutter and Sexton’s talents resulted in some of the most iconic looks of the late 20th century. They were responsible for dressing some of the most famous names in the world, including the Beatles.\n\nNutter and Sexton’s designs were sharp and modern, yet still classic and timeless. They were the perfect combination of form and function, and they quickly became the go-to tailors for some of the most famous names in the world. From the Rolling Stones to the Beatles, everyone who was anyone wanted a Nutter or Sexton suit.\n\nNutter and Sexton worked together for over a decade, creating some of the most iconic suits of the 1970s. Sadly, their partnership came to an end in 1980, when Nutter passed away. However, their legacy lives on, and their work continues to inspire fellow tailors and fashion lovers alike, including yours truly here at Edinburgh Tailoring Company.\n\nTheir Legacy and Influence on Fashion\n\nTommy Nutter and Edward Sexton were two of the most influential figures in the world of fashion in the 20th century. As Savile Row tailors, they revolutionized the way men dressed, and their influence can still be seen today. Tommy Nutter was known for his sharp, clean-cut suits, while Edward Sexton was known for his more reckless and experimental style. They were responsible for modernizing the look of Savile Row and helping to make it the world-renowned destination for bespoke menswear that it is today. While their style was very different from one another, both Nutter and Sexton had a profound impact on fashion. Their work helped to make Savile Row the go-to place for stylish and well-made clothing.\n\nBoth men left a lasting legacy in the world of fashion, and their influence can still be seen today. If you’re a fan of Savile Row tailoring, then you owe a debt of gratitude to Tommy Nutter and Edward Sexton.\n\nHow do I get the look?\n\nSavile Row tailors Tommy Nutter and Edward Sexton revolutionized menswear in the 1960s and 1970s. By breaking away from the stuffy constrictions of traditional British tailoring, they created a new look that was fresh, modern, and stylish. Today, their legacy continues to inspire new generations of designers. Here at Edinburgh Tailoring Company, we often receive commissions from clients for tailoring with a difference. Whether it’s the fit, style or unique attributes and details of a suit or jacket, we’ll work with you to help create your perfect suit.\n\nBook an appointment with Edinburgh Tailoring Company for more help on this matter. We have over 10,000 cloth options in stock, and Chris McGowan, our head consultant will be happy to help match colours, patterns and textures to help build your personal wardrobe.\n\nBe sure to like and follow us on Facebook, Instagram and LinkedIn for more fashion tips and advice.\n\nShare this: Twitter\n\nFacebook\n\n\n\nLike this: Like Loading..."}, {"url": "https://collections.vam.ac.uk/item/O110457/suit-nutter-tommy/", "page_content": "You can use the image for:\n\nNon-commercial research and private study\n\nTeaching and instruction\n\nNon-commercial publishing (up to A5-size, and in print runs of up to 4000 copies)\n\nNon-commercial online use, up to 768 pixels, and for up to 5 years\n\nPlease indicate that you accept all terms to proceed"}, {"url": "https://www.latimes.com/archives/la-xpm-1992-08-19-mn-5593-story.html", "page_content": "<i> From Times Staff and Wire Reports</i>\n\nTommy Nutter, the flamboyant tailor of London’s Savile Row, who gave the Beatles their “Mod Look” in the 1960s and costumed Jack Nicholson as the Joker in the 1980s, is dead of AIDS.\n\nA spokesman for his company said Tuesday that Nutter was 49 when he died Monday in London’s Cromwell Hospital.\n\nHe had been in the hospital since at least July, when his company first publicly confirmed that he had AIDS.\n\nAdvertisement\n\nNutter, whose customers also included the Rolling Stones, Twiggy, Elton John, Michael Jackson and more, rose to fame in the 1960s when he pioneered flared trousers and wide lapels, helping turn them into trademark fashions of the 1960s on both sides of the Atlantic.\n\nThree of the Beatles were wearing Nutter creations when they posed on a London street crossing for the cover of their “Abbey Road” record. George Harrison wore denims.\n\nMore recently his clients have included Diana Ross and Andrew Lloyd Webber.\n\nNutter often would use several contrasting fabrics in one jacket: Checks were swiveled for pocket contrast and shoulders became ever more padded.\n\nIn the early 1960s, Nutter became an apprentice with a company on Savile Row, the source of expensive, staid suits and other clothes for upper-crust customers.\n\nNutter absorbed the lore and rules of the English gentleman’s wardrobe, and in 1968, at the urging of Beatles manager Brian Epstein, started his own tailoring company.\n\nHis tailoring was lively and contemporary but with roots in the traditional craftsmanship and quality of Savile Row. His business was an immediate success.\n\nThe company said in a statement: “Over the past years that he knew of his illness, he actively participated in supporting others living with HIV and AIDS as well as helping AIDS charities and research organizations.”"}, {"url": "https://selvedgeyard.com/2012/04/04/tailor-tommy-nutter-the-savile-row-strutter/", "page_content": "–\n\nThe flamboyantly natty Savile Row tailor Tommy Nutter with his dogs. “Although tailoring was quite distinct from fashion then, Tommy Nutter changed the way men dressed,” says Dennis Nothdruft, who co-curated the 2011 retrospective (Tommy Nutter: Rebel on the Row) at the Fashion and Textile Museum in London along with tailor Timothy Everest. “And he changed the way Savile Row was seen. Before Nutters it was an exclusive, closed-off world. They didn’t even have window displays. Though, of course, the rest of the row looked upon him as an upstart whose shop was on the wrong side of the street.” (The huge purple candles in the shape of phalluses can’t exactly have endeared him to his neighbors… Another legend, Simon Doonan, was Nutter’s window dresser back in those days.) via\n\n___________________________________________________________________________\n\n–\n\nTommy Nutter will always be known as the flamboyant bee in Savile Row’s stuffy bonnet. Trained as a traditional tailor, the sexy and innovative Nutter was not happy following the status quo of stuffy Savile Row and literally took matters into his own hands. He created a sensation with his bold, signature look– wide shoulders, unapologetic lapels, bold fabrics & patterns. Nutter soon became the darling of the celebrity and rock ‘n’ roll scene– clothing the likes of The Rolling Stones, Bianca Jagger, Elton John, Eric Clapton, The Beatles, Vidal Sassoon, Twiggy, David Hockney, and many others. His influence can still be seen today, through the apprentices who worked under him (John Galliano for one), and in the young new designers of today (E. Tautz) who are rediscovering his work. Tommy Nutter has forever left a mark on Savile Row, and defined a moment in time when bigger truly was better.\n\n–\n\n–\n\nDesigners like Tom Ford (who favors strong lapels and chunky neckwear) have famously cited Tommy Nutter as an influence. Bianca on Mick Jagger’s arm as he struts in his Tommy Nutter duds– from the book Day of the Peacock by Geoffrey Aquilina Ross that is an incredible visual chronicle of the flashy and flamboyant menswear style from 1963-1973.\n\n–\n\n–\n\nTommy Nutter famously dressed some of the biggest rock stars of his day. 1971– Mick & Bianca Jagger were married in original Tommy Nutter creations, and were nutty over Tommy’s sharply tailored suits. At the time, the Stones were in exile in the south of France and were newly camped at Cote d’Azur for the recording of their Exile on Main Street album when Mick announced that he was getting married next week. It didn’t go over well with the band– particularly Keith Richards.\n\n–\n\n–\n\nMick & Bianca Jagger in 1970’s high style– sporting Tommy Nutter’s sartorial splendor. “Bianca really wanted a man’s suit and not a suit cut for a woman. She asked for the darts to be taken out of her first pistachio green suit to make it sexier.” –Timothy Everest, renowned tailor who trained under Nutter\n\n–\n\n–\n\nTommy Nutter dressed three out of the four Beatles for the Abbey Road album cover. True to his non-conformist roots, George Harrison opted to dress in denim. Tommy Nutter opened shop in 1969 with the master cutter Edward Sexton, and was financially backed by British pop singer Cilla Black and Beatles’ executive Peter Brown.\n\n–\n\n–\n\nRingo Starr, a good friend of Tommy Nutter, openly advertised for his favorite tailor– despite the fact that The Beatles band policy firmly frowned on product endorsements, advertisements, etc.\n\n–\n\n–\n\n1969 — Tailor Tommy Nutter in his Savile Row shop. –Photo by Jones/Evening Standard/Getty Images\n\n–\n\n–\n\n1971 — Tommy Nutter (1943 – 1992). –Photo by Evening Standard/Hulton Archive/Getty Images\n\n–\n\nRELATED TSY POSTS:\n\nBUNNY ROGER | BRITISH STYLE ICON YOU’VE PROBABLY NEVER HEARD OF\n\nTHE TSY FASHION FLASHBACK | AMERICAN MENSWEAR DESIGNER ICONS\n\n1950′s BRIONI ROMAN STYLE TAKES TINSELTOWN | SACKING IVY STYLE\n\nTHE ITALIAN PRINCE OF PRINTS | RENAISSANCE MAN EMILIO PUCCI\n\nDESIGNER ANDREA CAMPAGNA | KEEPER OF THE ITALIAN TAILORING FLAME\n\nDAVID HOCKNEY | STYLE– TAKE WHAT YOU WANT, AND DON’T LET IT TRAP YOU\n\n–"}, {"url": "https://www.fashionmodeldirectory.com/designers/tommy-nutter/", "page_content": "Tommy Nutter was a British tailor.\n\nTommy Nutter was born in 1943.\n\nIn his youth Nutter studied at the Tailor and Cutter Academy and worked for traditional tailors Donaldson, Williamson & Ward. He soon became inspired by changes in popular culture of the 1960s. In 1969 he opened his own shop, House of Nutter, in Savile Row, London. He worked with Edward Sexton, and was backed financially by Cilla Black and Peter Brown of the Beatles' company Apple He even created clothes for another fashion designer, Hardy Amies.\n\nIn the 1970s his bespoke business became less successful, but he branched out into ready to wear clothing, marketed through Austin Reed. He also successfully expanded into East Asia, establishing the Savile Row brand in Japan.\n\nNutter's suits are worn by three of the members of the Beatles on the famous cover of the Abbey Road album. He also created the clothing of The Joker worn by Jack Nicholson in the 1989 film Batman.\n\nNutter died in 1992 of complications from AIDS."}, {"url": "https://www.out.com/out-exclusives/2018/6/13/requiem-fashion-rebel-tommy-nutter-embodied-agony-and-ecstasy-20th-century-gay-life", "page_content": "Tommy Nutter lived a life that was, to put it mildly, filled with operatic plot twists. Though most people knew him as the \"Tailor to the Stars\" -- the bon vivant Savile Row designer who dressed everyone from the Beatles and Elton John to Diana Ross and Twiggy -- his private life was where the most interesting things happened. From underground London clubs in the 1960s, before it was even legal to be gay, to the infamous bathhouses -- and trucks -- of hedonistic Manhattan at the height of the sexual '70s, Nutter was there, both witness and participant. His own biography is also, in miniature, the biography of gay life over the second half of the 20th century -- flagrantly joyful, traumatically brutal. In House of Nutter: The Rebel Tailor of Savile Row, Lance Richardson charts the story of one of fashion's most intriguing figures, including the AIDS diagnosis that would bring his life to an untimely end.\n\nThe crowd convened in Fulham's Eel Brook Common, opposite John Galliano's design studio. It was a brisk, blustery Sunday morning in April 1989. Clouds threatened rain with enough conviction that some people had brought their raincoats, though others were committed to their tutus and fairy wings, to showing off rainbow patch pants, Comme des Garcons jackets, antique neck scarves, and brown suede brogues. Roger Dack, the director of Fashion Acts, which had organized the event in London, strolled across the grass with a megaphone rallying his troops. Later, he would describe it as \"the most chic walk ever.\"\n\nMore than 900 marchers had turned up, pledging some PS90,000. The official route threaded up the King's Road, through Knightsbridge and Westminster, all the way over to Covent Garden, where the finish line was a Champagne reception at Tuttons restaurant. Bruce Oldfield stood at the front of the procession, itching to go; Galliano, lingering behind a battalion of strollers, brought up the rear.\n\nBut first, before anyone could take a single step forward, 1,116 red balloons were released into the sky: one for every person in the country who had died from AIDS-related causes.\n\nEarly in the epidemic, AIDS had been dismissed by some members of the British public as \"an American problem\" that would never creep its way across the Atlantic. Of course, it had already arrived; in 1982, a man named Terrence Higgins had collapsed on the dance floor at Heaven and died a few months later from Pneumocystis pneumonia. \"I hope you get very scared today because there is a locomotive coming down the track and it is leaving the United States,\" Mel Rosen, an American AIDS activist, had warned at a conference in London the following year. By late 1985, there were 241 cases of AIDS in Britain, and newspapers were reporting instances of \"scared\" firemen and paramedics who were refusing to perform the \"kiss of life,\" lest they get infected. In 1987, as conservatives talked seriously about compulsory testing of all gay men and possibly even mass quarantine, the science correspondent of the London Times wrote that \"leading specialists believe... between 40,000 and\n\n100,000 people in Britain are now carriers.\"\n\nAs the red balloons drifted into the sky above Fulham, Tommy Nutter took swigs from a hip flask to fortify himself for the long march to Covent Garden.\n\nThe first black spot had appeared on his own leg toward the end of the 1980s: small, dark, refusing to heal.\n\nStewart Grimshaw, one of Tommy's close friends, first noticed it when they were summering together in Saint-Tropez. Others noticed because Tommy drew their attention to it, making light of what the mark could possibly signify. When Carol Drinkwater read an article describing Kaposi's sarcoma lesions, the reddish-purple patches often associated with AIDS, she asked Tommy if he had anything like that. He replied, \"Yeah, yeah,\" indicated his leg, and shrugged away the question. But then the spot got worse, his health took a turn, and ignoring it became impossible.\n\nMany of the gay men Tommy knew went to St. Mary's Hospital, in Paddington, to be screened for sexually transmitted diseases. But Tommy refused; he hated being seen in that environment. Instead, he went to see Stewart, who, Tommy knew, had been actively involved in AIDS awareness since the days it was known as the dreaded \"gay cancer.\" As Stewart recalls, \"He came to me because he had loads of questions, and he thought I'd have all the answers.\"\n\nFor example: How many people get over it?\n\nStewart told him that nobody \"got over it.\"\n\nAnd how long before...?\n\nThat depends on your T-cell count, Stewart said.\n\nAfter Tommy exhausted his inquiry, Stewart convinced him to follow up with a brilliant clinician named Brian Gazzard. Having encountered his first case of what became identified as AIDS back in 1979, Gazzard was one of the leading medical authorities in Britain. He'd already seen hundreds of HIV-positive patients by the mid-1980s, and more recently, he'd been instrumental in setting up the Kobler Centre, a dedicated HIV/AIDS research and outpatient facility funded by a combination of private donations and money from the National Health Service. (Princess Diana opened the day-care wing during a well-publicized visit in 1988; it had been packed with patients ever since.) The Kobler saw \"a never-ending procession,\" Gazzard recalls, and the atmosphere was both depressing -- with up to 10 deaths a week -- and inspiring, because \"people were full of courage and determination.\"\n\nTommy made an appointment to see Dr. Gazzard, but he didn't want to go alone. He asked Stewart to keep him company.\n\nThe doctor sat them down in a quiet office. He told them that some people wanted to hear all the details, while others didn't want to hear any of the details.\n\nTommy said, \"Tell me everything.\"\n\n\"But that's not really what he wanted,\" Stewart recalls.\n\nWhat Tommy would have been told is something like this: That there is no easy way to break bad news. That, according to his test results, he was HIV-positive, with a very low CD4 cell count. That he already had opportunistic infections, and there was a good chance he would contract even more. That the treatments available to him were limited -- AZT, perhaps, though its effectiveness at prolonging life was finite and accompanied by side effects. That most types of treatment would focus on infections rather than the virus itself, which could not be cured. That there would be ways forward, however, to remain in control of the situation. Because that was the most frightening thing for patients newly cognizant of their status: the prospect of losing control.\n\nStewart listened carefully and understood exactly what was going to happen to his friend.\n\nTommy also listened, silent until the doctor finished and asked him if there was anything further he wanted to know.\n\nTommy thought for a moment. Then, Stewart remembers, he said, \"Yes, there is one thing I'd like to know. I'd like to know when Mack and Mabel is opening in the West End.\"\n\nMack and Mabel was an American musical by Michael Stewart and Jerry Herman that had premiered on Broadway in 1974, but thus far failed to transfer to London, except for a one-off charity performance at Drury Lane, in 1988. It told the tragic \"true\" (heavily fictionalized) story of Mabel Normand, a working-class girl who became a glamorous star of silent cinema before sliding into scandal and ultimately dying from pulmonary tuberculosis at the premature age of 37. Tommy had acquired a cast recording, and declared to several friends that it was his new favorite show.\n\nThe doctor stared at Tommy.\n\n\"I truly think he thought that Tommy already had dementia,\" Stewart recalls.\n\nWhen Tommy arrived home that evening, he telephoned Carol Drinkwater, whom he'd known since they met at a nightclub called La Douce in the early 1960s.\n\n\"What is it?\" Carol asked. She was standing in her upstairs bedroom.\n\n\"I've got AIDS,\" Tommy said.\n\nCarol took a deep breath. \"Tommy, you've got to be positive.\"\n\n\"I just said that,\" he snapped. \"I am 'positive.' \"\n\nOnce Tommy knew for sure that he had HIV, his first response was to make jokes, and his second was to adopt a kind of optimistic denial. \"In the first six months, he was very sure that something would be done and that he would be OK,\" recalls Tim Gallagher, one of the salesmen in Tommy's Savile Row emporium who had also become a close friend. \"I think he took it very well indeed.\" Occasionally, Tommy called up Stewart to ask some more questions: What about that new drug mentioned in the newspaper? What about this experimental form of treatment? But mostly he preferred not to discuss the situation at all, carrying on as though absolutely nothing had changed. Which is not to say, however, that he wasn't affected. His assistant, Wendy Samimi, spent enough time with Tommy to notice cracks in the carapace. Despite his demeanor of cool unconcern, she could tell that he was rattled. \"Would it affect his brain? Would he get all the sarcomas? It could manifest in so many different ways -- that's where his demons were about it.\"\n\nThese demons manifested most clearly whenever it came time for another doctor's appointment, now regular and essential. Visiting the Kobler meant Tommy could not pretend that everything was just the same; it forced him, for a few hours each month, to confront the full spectrum of AIDS, from patients like him with mild ailments right through to those in terminal stages -- his probable future, given it was still more than five years before the life-saving cocktail would be released.\n\nThe days leading up to his treatments were \"awful,\" Wendy recalls, \"because he'd be hell at work. You could see it: ginning himself up to go. Really didn't want to go. Probably a bit angry. A bit hard on people, which was not like him.\"\n\nAdapted from Lance Richardson's 'House of Nutter: The Rebel Tailor of Savile Row,'available now through Crown Archetype."}, {"url": "https://www.independent.co.uk/news/people/obituary-tommy-nutter-1541027.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThomas Albert Nutter, tailor, born Barmouth Merioneth 17 April 1943, died London 17 August 1992.\n\nTOMMY NUTTER, the avant-garde Savile Row tailor, came to prominence in the late Sixties as a man who singlehandedly reconciled the traditions of Savile Row, laid down in the late 19th century, with the male peacock revolution of the Sixties and the often extravagant demands of his clients, the leading dandies of swinging London.\n\nBorn in Wales in 1943, Nutter spent his formative years in Edgware, north London, where his father was proprietor of a cafe catering to a clientele composed of truckdrivers, gas-fitters and builders. The family moved to Kilburn and Tommy and his brother David had a normal suburban childhood, punctuated by highly enjoyable holidays at Butlin's holiday camps. He attended the Willesden Technical College where, according to his brother, he studied plumbing.\n\nIn the early Sixties, Nutter obtained a position with Donaldson, Williams & Ward, traditional Savile Row tailors with premises in the Burlington Arcade. Here, starting as an apprentice, he absorbed the lore and the rules of the English gentleman's classical wardrobe. His seven years with the firm gave him a thoroughgoing knowledge of his craft, and a lifelong respect for its rules.\n\nIn 1968, Nutter left Donaldson Williams & Ward to found his own business, first at 35a Savile Row, later in its present handsome double-fronted premises at No 19. He was backed by clients including Cilla Black and her husband Bobby Willis, Peter Brown, then Managing Director of the Beatles' Apple Corps, also situated in Savile Row, and by the lawyer James Vallance-White.\n\nThe business was an immediate success for, like Sir Hardy Amies, a Savile Row dandy of a previous generation, Tommy Nutter produced lively, contemporary tailoring whose roots were deeply embedded in the craftsmanship and knowledge of Savile Row. Indeed, he made suits for Amies as well as for newer residents of Savile Row, and in particular the Beatles. He was proudest of the fact that, for the cover of the Beatles' album Abbey Road (1969), he dressed three out of the four (George Harrison elected to be photographed on the road-crossing in denims). Other leading dandies of the period were also his clients, including Sir Roy Strong (then Director of the National Portrait Gallery), Mick Jagger and Elton John.\n\nNutter also applied his craft to dressing female icons of swinging London society at the time, including Cilla Black, a close friend, and Bianca Jagger, who was much photographed at the time in a white dinner jacket with white satin facings. Nutter also made a red velvet suit for Twiggy which became a celebrated and much-copied look when she was photographed wearing it in the early Seventies.\n\nIn 1971 he was elected to the Best-Dressed List in the United States, along with the Earl of Snowdon and Hardy Amies. At the time, American Menswear magazine said of Nutter that he was 'tradition spiced with daring'.\n\n'He never got things wrong about clothes,' said the restaurateur and bookshop-owner Stuart Grimshaw, who was a client of Tommy Nutter's from the late Sixties. 'He really knew what he was talking about. One would go in and say, 'What do I wear to go on safari in Kenya?' and Tommy would make one an absolutely correct safari suit, a proper one with all the pockets in exactly the right place.\n\n'This knowledge extended to such minutiae as the correct wearing of half or full brogues or co-respondent shoes. He was an encyclopaedia of correct, classical male style.'\n\nClients from the hipper purlieus of the aristocracy, from the media, pop stars, and even aspiring teenage dandies from the East End whose ambition, in the early Seventies, was to own a Nutter suit, were drawn to Tommy Nutter not only because of his ineffable sense of style, but also because of his peculiarly ironic personality.\n\nAndrew Lloyd Webber was a client and friend. 'He made me a lot of things when one was younger and trendier,' Lloyd Webber said. 'There was a wonderful maroon coat I remember I wore for Ascot - he was always such fun, very much part of my early life when Jesus Christ Superstar was going on - he made clothes for Tim Rice too - we were all great mates'.\n\nNutter was a gentle humorist who had a wide and interesting circle of friends attracted by his enthusiasm, by his gentle, self-mocking personality and his acerbic comments on the vagaries of others, always ending with the expression 'But who am I to talk?' He was a prodigious and witty correspondent and his letters to his many friends are treasured. In addition, he delighted in writing to the serious newspapers on topics as far-ranging as the correct buttoning of the suit on a statue of John F. Kennedy, to the scarcity of deckchairs in Green Park. He was always very ready to spring to the defence if his beloved Savile Row came under attack, as it so frequently did in the anarchic Sixties.\n\nNutter was also a firm believer in the supremacy of the English suit and of English cloth; during the Seventies and early Eighties he took part in huge international fashion shows put on by Reid & Taylor, the Scottish firm of woollen and worsted manufacturers.\n\nWith his untimely death, from complications arising from Aids, London society loses a witty and elegant dandy, whose hand-rolled lapels and insouciant manner masked a serious and continuing purpose; to make sure that the craft and traditions of Savile Row tailoring were preserved for, and valued by, his generation.\n\n(Photograph omitted)"}]}