{"Steve Ridzik was a software engineer at Microsoft in the early 1990s.": [{"url": "https://news.microsoft.com/features/the-engineers-engineer-computer-industry-luminaries-salute-dave-cutlers-five-decade-long-quest-for-quality/", "page_content": "The technology industry is still young, but its history is already rich with myths and legends.\n\nThe biggest myth is about how invention actually occurs – the notion of that “aha”’ singular, magical moment leading to inevitable success. The reality, as Malcolm Gladwell made clear in his New Yorker Creation Myth article several years ago, is that invention is more ponderous, with one idea building on another.\n\nWithin the technology industry, this cycle of invention is captured in eras, from mainframe and mini, to PC, Internet, mobile and the cloud. Most within the industry move from wave to wave, hoping to catch each successive one at just the right time.\n\nThen there are the wave makers. The giants on whose shoulders the industry stands. Dave Cutler is a wave maker, with a broad set of shoulders.\n\nCutler, a Microsoft Senior Technical Fellow whose impressive body of work spans five decades and two coasts, will be honored Saturday evening as a Computer History Museum Fellow, along with Lee Felsenstein, the designer of the Osborne 1, the first mass-produced portable computer; and Philip Moorby, one of the inventors of the Verilog hardware description language. They join other wave makers such as Alan Kay, Vinton Cerf and Tim Berners-Lee in the museum’s Hall of Fellows.\n\n“The Fellow awards recognize people who’ve had a tremendous impact on our lives, on our culture, on the way we work, exchange information and live. And yet, having had such a profound impact, they’re mostly unknown,” said John Hollar, the museum’s president and CEO. “People like Dave Cutler, who probably influences the computing experiences of more than 2 billion people, yet isn’t known in a way he deserves to be, in proportion to the impact he’s had on the world.”\n\nCutler, 74, who still comes to his office each day on Microsoft’s sprawling Redmond, Washington, campus, has shaped entire eras: from his work developing the VMS operating system for Digital Equipment Corporation in the late ‘70s, his central role in the development of Windows NT – the basis for all major versions of Windows since 1993 – to his more recent experiences in developing the Microsoft Azure cloud operating system and the hypervisor for Xbox One that allows the console to be more than just for gaming.\n\nSteve Ballmer, Microsoft’s former CEO, is a fellow Michigan native, friend and golfing buddy. In his view, there isn’t another engineer who’s had a greater impact on the history of computing than Cutler. “There have been incredible visionaries who also made an impact, but not from the engineer’s seat,” Ballmer said. “I’ve never met another engineering leader with the same versatility, leadership and technical talents.”\n\nRay Ozzie, Microsoft’s former chief software architect, first met Cutler in the late ‘70s when he was a software engineer at Data General, a Digital Equipment Corporation (DEC) competitor. He considers Cutler one of the industry’s most preeminent and prolific engineers.\n\n“The degree to which Dave has advanced the computing industry and advanced business can’t be overstated,” Ozzie said. “Dave’s groundbreaking work on VMS enabled DEC’s VAX to become the category killer in the era of the 32-bit supermini. When the PC itself then transitioned to 32 bits from 16, Dave’s work on NT was directly responsible for enabling Windows to yet again be the category killer. And as the computing world shifted from servers to services, Dave’s work on Azure was key to enabling Microsoft’s transformation to one of the world’s top providers of cloud computing infrastructure.”\n\nNathan Myhrvold, former chief strategist and chief technology officer at Microsoft, considers Cutler one of the greatest systems programmers of all time. “Writing hard-core systems software down in the bowels is a very specialized thing. For every systems programmer there are a thousand applications programmers who program on top of it. Dave’s just one of the greats.”\n\n“If there’s one technical person who’s indispensable in the history of modern Windows, it’s Dave,” said Terry Myerson, executive vice president, Windows and Devices Group.\n\nCutler is a doer, not a talker. One of his favorite idioms is: “When all is said and done, much more is said than done.” So perhaps it’s best to have others put into perspective the impact he’s had on the computing experiences of billions of individuals and hundreds of thousands of businesses worldwide.\n\nThe Massachusetts miracle\n\nIn 1976, DEC was the darling of the technology industry. It and other competitors, like Data General and Prime Computer along the Massachusetts Route 128 corridor, ruled the computing landscape.\n\nBut Gordon Bell, the company’s top engineering executive, was concerned. Sales of the company’s flagship product, its 16-bit PDP-11, were stagnating and rival IBM was on the verge of releasing its first minicomputer.\n\nBell’s response: Change the playing field by introducing a new, 32-bit super-minicomputer line of systems called the VAX with a new operating system that would be backward compatible with the company’s PDP-11 programs.\n\nBell asked a 33-year-old engineer, who had joined the company four years earlier and made a name for himself by developing real-time operating systems for the PDP-11, to lead development of the VMS operating system. Forty-one years ago this month, Cutler and four other senior engineers launched the VMS project; Cutler was the senior programmer.\n\nBell, a founding trustee of the Computer History Museum who himself was named a Computer History Museum Fellow in 2003, said he chose Cutler to lead the development of VMS because “we both had the same goals and competitive urges … Dave is the ultimate competitor. He really wants to win.”\n\nTwo years later, the first VAX superminis emerged from DEC’s manufacturing plants and the VAX quickly gained a leadership position in the market. Bell would come to call Cutler “the best writer of operating systems in the world.”\n\nBurton Smith is perhaps the best-known parallel computing designer and a Microsoft Technical Fellow. In the late ‘70s, he was working for a high-performance computing company and had the opportunity to meet Richard MacNeal, a founder of MacNeal-Schwendler Corporation, now MCS Software, the company that developed NASTRAN, a finite element analysis program.\n\n“Dick took me over to this computer and said, ‘Look at this.’ It was a VAX 11/780 running NASTRAN,” Smith said. “Normally running NASTRAN on a new computer exposes bazillions of bugs and takes years to perfect. I said ‘How hard was this thing to bring up?’ He said, ‘Oh, it was a piece of cake. We just put it on there, compiled it and it started running.’ The impact of the VAX on the world had a lot to do with the fact that it was bulletproof. It was robust. It really worked as advertised. That was Dave’s work.”\n\nWhile Cutler’s operating systems work on the PDP 11 and VAX are legendary, Bell is quick to add that the dynamic range of Cutler’s work at DEC is often overlooked. He cites three examples:\n\nThe PL/1 compiler that included a backend runtime that ultimately hosted several other DEC languages (Cutler and others wrote a book on the work, “Engineering a Compiler”)\n\nThe MicroVAX I architecture that Cutler helped design\n\nThe DecCommand Language “that was really loved by all VAX users”\n\nIn 1982, Cutler met with Bell and announced he intended to leave DEC to form a company with a scientist from Lawrence Livermore National Laboratory. After meeting with Cutler and his cofounder, Bell made a counter offer, knowing how frustrated Cutler had become with the growing bureaucracy at the company’s headquarters at a former wool mill in Maynard, Massachusetts.\n\nBell told him, “Go anywhere you want to go, take anyone with you that you want, and do anything you want to do.” DECWest was born.\n\nCutler decided to locate his new operations more than 3,000 miles from DEC’s headquarters: in Bellevue, Washington, near Seattle and not far from Microsoft. Len Kawell was one of the young engineers who followed Cutler to set up operations there. “One day, Dave called me into his office and said, ‘Hey, I’m opening a new office in Seattle. You want to come with us?’ So I came out to Seattle in early ’80. We were originally just going to do a new real-time operating system for the VAX, but we ended up creating the MicroVAX and an operating system called VAXeln, which was a real-time operating system. Dave got into hardware at that point, actually designing the silicon, so Roger [Heinen] and I took over the software.”\n\nOne of the things that separates Cutler from other engineers, Kawell said, is his understanding of hardware. “Dave understands hardware like no one else I’ve ever worked with. A lot of people think in high-level language. Dave thinks in actually the registers and instructions of the machine. When we did the MicroVAX I, Dave wrote the microcode [a layer of hardware-level instructions] for the machine.”\n\nIn 1988, Cutler left DEC when his team’s Prism project, with its new Mica operating system, was killed.\n\nBell had first introduced Cutler to Bill Gates in 1983. Now, five years later, Cutler would join Microsoft to develop a new portable operating system, and create a new wave.\n\nRaising Windows\n\nRob Short had worked for DECWest since 1982. After DEC cancelled the Prism project, Cutler, two more business-oriented colleagues and he thought they might start a new company.\n\n“But then Dave got a call from Bill Gates,” Short said. “That kind of freaked us out because we didn’t really have a high opinion of Microsoft at that point.” That meeting led to a follow-up meeting with Gates, Ballmer and Myhrvold.\n\n“We had a fascinating conversation about where the industry was going,” Short added. “At one stage, I remember saying, ‘I don’t know what’s actually going to happen in the hardware world.’ And Bill said, ‘It’s not what we think is going to happen, it’s how we’re going to shape the industry.’ I had never met anyone who thought that way before.”\n\nThe courtship continued when Ballmer visited Cutler’s home one evening. “Steve came over to Dave’s house and when he left we looked at each other and said, ‘This is a different animal entirely. This is an interesting crowd of people.’”\n\nLater that month, on Oct. 31, 1988, Cutler started at Microsoft. Short and other members of the DEC West team (five with software expertise, six with hardware) would soon follow. They provided their notices to DEC on a Friday and started the following Monday, recalled Darryl Havens, who would write the input-output system for NT.\n\nThe small, high-powered team of former DEC engineers and one existing Microsoft employee (Steve Wood) began by spending six months creating a specification for the operating system ­­– the specification that now resides in the Smithsonian Institute.\n\n“If you spend that amount of time designing something and you have a spec that gives you every single API [application programming interface], what its inputs are, what its outputs are, you pretty much know how the thing is going to work,” Havens said. “So I actually typed in the code for the entire I/O system in three weeks. That’s how well-designed it was. By the time I sat down to write the code, I already pretty much knew how it was going to work.”\n\nThe team started coding in earnest in April 1989, working double-digit hours six or seven days a week. The main goal: produce a portable operating system that could run on architectures other than Intel’s x86 chips and take advantage of the increased address space offered by nascent 32-bit microprocessors. RISC architectures were popular at the time and promised better performance than the x86. IBM and Microsoft had been cooperating on an operating system called OS/2, but it was a 16-bit operating system that ran only on Intel hardware and wasn’t portable.\n\nThe goals for the NT operating system were challenging and ambitious. The team had to make it:\n\nPortable and available on multiple targets (MIPS, Alpha, PowerPc, x64)\n\nPossible to run on multiple operating systems (POSIX (Unix), OS/2 and Windows 32\n\nSecure and C2 certified (a trusted computer certification)\n\nRun on systems with multiple processors (unique to the PC industry at the time) and capable of running multiple programs at one time, again unique to the PC segment\n\nOne of the toughest challenges was testing the system. Early on, the team decided it didn’t have the resources necessary to write a comprehensive test suite. Instead, they opted for a dynamic stress system, which put a severe load on the overall system. Every night the team ran stress tests on hundreds of machines. The next morning the team would arrive at the office, triage the failures and identify the bugs for the daily 9 a.m. bug-review meeting.\n\n“It was a combination of very clever science and brute force and not being afraid of large numbers,” Short said. “There might be a thousand failures. So what are we going to do? Well, we started with one of them, looked at it and … Dave isn’t afraid of slogging through.”\n\nThe playing field kept shifting as well.\n\nAt first, the team was going to target the expanded OS/2 32-bit API as the main “personality” of the system, but later they changed to Windows 32 when Windows 3.1 proved to be so popular (16 million copies sold in six months). As a result, the team had to expand the Windows 16 API to a Windows 32 API and redesign the entire graphics subsystem. The team also had to hit the reset button on hardware when it changed its initial hardware target from the Intel i860 XR RISC processor to the MIPS R3000.\n\nAnother particularly vexing problem was getting DOS and Windows 16 applications to run in the new 32-bit environment.\n\n“We wanted to write a modern operating system from scratch,” Myhrvold said. “We also wanted to have some level of backward compatibility with previous systems and that’s where everything was difficult. But we came up with a variety of methods to do it, some in my group, some in Dave’s … It’s always hard to have backward compatibility when you’re doing something brand new and you’d love to throw the whole past out. But for customers it’s really important to have that bridge to the past. Figuring out how we could do that so that existing Windows applications could get moved over and run on NT was pretty important.”\n\nMyhrvold recalls that the teams had a strategy for handling DOS apps, but Windows apps presented a greater challenge. “But we made it work,” Myhrvold said. “Without that, I don’t think there would have been much of a future for Microsoft.”\n\n“What Dave and team accomplished was an almost impossible design challenge,” said Ed Lazowska, the Bill & Melinda Gates Chair in Computer Science & Engineering at the University of Washington.\n\nBell believes Cutler is the only engineer with the confidence to pull off NT as he did. “Almost anyone who would have been good enough to do NT would have insisted on a blank sheet for the spec,” Bell said. “Dave appreciates legacy and compatibility. The world is better off because Dave Cutler went to Microsoft and built NT for a much larger market.”\n\nIn 1988, when the project first began, the team comprised about 20 engineers. By the time the first version of Windows NT shipped five years later, the team had expanded to about 150 engineers as it battled constraints and tradeoffs.\n\nWindows NT 3.1 shipped on July 27, 1993. The team was exhausted, but exhilarated.\n\n“People work for Dave because they know the project is going to succeed,” Short said. “Dave is intense. He can be crude and demanding at times, but that’s actually a small piece of him. He’s actually very good at motivating people . . . . If you’re an engineer, you want to work on a project that you think is useful. You want to think that the project will succeed and that your individual effort will make a difference. When you worked for Dave, you were in a project like that.”\n\nPart of Cutler’s secret sauce is that he inspires a loyal crew around him, Myhrvold said. “He’s quite a character…Did you see the movie “Inglourious Basterds”? There is a whole genre of old World War II military movies about this great commander who has this loyal set of guys and Quentin Tarantino updated it. When I saw the movie I said, ‘Hey, this is Dave,’ Myhrvold said, laughing. “There are probably worse things than comparing a man to Brad Pitt.”\n\nCutler stopped managing the entire NT project in 1996, but continued to lead the kernel development until 2006. In March 2005, he completed one of his “most gratifying pieces of work” at Microsoft when, partnering with AMD, he helped develop the AMD64 architecture (64-bit extensions to the 32-bit x86 architecture) and led the effort to ship the first two x64 64-bit Windows systems (workstation and server). At the time, some questioned why Microsoft developed a 64-bit system; today most computers are 64-bit systems and even our phones will soon have a 64-bit operating system.\n\nIn 2008, Cutler was honored at a White House ceremony as one of the nation’s National Medal of Technology and Innovation Laureates. In support of Cutler’s nomination for the award, Bill Gates provided evidence of just how hard the task had been:\n\n“… NT is unique because it lives within the constraints of ill-defined hardware, while providing a runtime environment for the myriad of legacy applications that ran on the loosely defined PC Windows operating systems of the early 1990s. Unlike other systems, he built a compatible, yet many-way scalable system that hosted multiple environments. Dave was the principal designer of the layering structure that ensured only a few components needed to be changed to run on either a different instruction-set architecture or on machines with radically different hardware and input/output subsystems. In 1989, NT was originally designed to be OS/2 and POSIX compatible. The Windows subsystem was added without core design changes. NT runs on a range of systems from gas pumps to 64-CPU 64-bit systems with more than a terabyte of memory, including clusters. With the introduction of Windows XP in 2001, it became the basis for all Microsoft PC-based operating systems.”\n\nBallmer’s viewpoint is more succinct: “There wouldn’t be a Microsoft today without Dave.”\n\nMoving to the cloud\n\nIn 2006, Amitabh Srivastava was a corporate vice president in Microsoft’s Windows division, working on redefining the organization’s engineering processes. Ozzie had recently been named the company’s chief software architect and the two had their first meeting one late afternoon in Building 34 on Microsoft’s campus.\n\nSrivastava has always had a rule: If he’s in town, he never misses dinner at home with his family – or if he needs to, he tells his family he’ll be late. That evening, Srivastava lost track of time. He missed dinner and never called home to say he’d be late. The one-hour meeting began at 4 p.m. and went until 8 p.m.\n\n“By the end of that meeting, I was convinced software wouldn’t be shipped as it had been. My personal realization was, ‘I’m working on the wrong thing,’” Srivastava recalled.\n\nAt the time, Srivastava’s office was across from Cutler’s, and the two often got to the office early. Soon after the meeting with Ozzie, Srivastava recalls telling Cutler, “I don’t know what needs to be done, but I know there’s something changing dramatically and we’ve got to rethink our approach.”\n\nAfter a few more weeks of discussions, Srivastava knew Microsoft needed to build an operating system for the cloud, and he identified his first task: Recruit Cutler.\n\n“So I go to Dave and he says ‘I think I’m ready to retire,’” Srivastava said. “I said, ‘Dave, not quite. This is different. This could change the world.’”\n\nCutler didn’t say yes to Srivastava, but he also didn’t say no. “I had worked with Dave long enough to know that when he didn’t say no right away, that was a good sign.”\n\nSrivastava developed a plan for Cutler and him to visit every team at Microsoft running a cloud service, from MSN and Hotmail to Xbox Live and the company’s cloud data centers. “This is the same guy who won’t go to meetings. Dave went to every meeting.”\n\nThe due diligence process took a few months as Cutler and Srivastava listened to the pain points and band-aid approaches teams had taken to keep their cloud services running. After the tour, Cutler and Srivastava never had a formal discussion about him joining the team. Cutler was on board.\n\n“We never had a problem recruiting,” Srivastava said. “Once Dave was there, the Red Dog (the project’s code name) team was the one everyone wanted to work on.”\n\nCutler’s role was to develop the hypervisor for the cloud operating system. “Dave wrote the hypervisor; it’s probably the most efficient you could think of. It was completely optimized. We knew that any part Dave wrote would be the best,” Srivastava said. “Dave’s just a phenomenal guy. He’s brilliant. His work ethic is amazing. And he has a very high bar for quality; Dave doesn’t cut corners.”\n\nTwo years later, on Oct. 27, 2008, Ozzie stood on stage at the company’s Professional Developer’s Conference in Los Angeles and announced a technology preview of Windows Azure (now Microsoft Azure).\n\n“… Amitabh, Dave and their team have been working for a few years now on our own platform for computing in the cloud,” Ozzie said. “It’s designed to be the foundation, the bedrock underneath all of Microsoft’s service offerings for consumers and business alike, and it’s designed to be ultimately the foundation for yours as well. And so I’d like to announce a new service in the cloud, Windows Azure.”\n\nSrivastava followed Ozzie on stage, wearing his Red Dog sneakers, and said: “It’s my pleasure to finally discuss Windows Azure, our Project Red Dog that Dave Cutler and I have been leading quietly for some time. Dave is a kernel guy and what you have there is the kernel of the Microsoft Cloud Platform. Kernels don’t demo well. They don’t have the glitz, or the glitter, but a good one allows others to create killer apps, and that’s exactly what we have done. We have built a platform to allow you to build your killer apps.”\n\nEight years later, Microsoft Azure plays a significant role in Microsoft’s cloud business. At the company’s most recent developer conference in San Francisco, Scott Guthrie, the company’s executive vice president of its Microsoft Cloud and Enterprise Group, told developers Microsoft’s cloud now manages more than 1 million servers within 30 unique Azure regions around the world. “To put that in perspective,” Guthrie said, “that’s more locations than Google and AWS combined.”\n\nAfter the conference, financial analysts for Sanford Bernstein wrote an investor report with the headline: “Quick Take – The Microsoft Build Developer Conference – All Roads Lead to Azure?” Within the report the analysts said, “Azure is increasingly the center of all of Microsoft’s development and product strategies. After numerous conversations at the Build 2016 Conference, we’re feeling even more confident in the Azure opportunity and the potential that Azure could grow very fast for an extended period of time.”\n\nSeparating the best from the rest\n\nIn 2011, Boyd Multerer, the then-director of development for Xbox One, had a problem. Multerer, who helped create Xbox Live, the gaming and entertainment service, and the father of the popular XNA video game programming language, had decided with his team that Xbox One needed a virtual machine if both games and apps were going to run on the console.\n\nThe initial thinking was that it might be too hard to work.\n\n“We weren’t sure we could do it,” Multerer recalls. “We knew we would need someone really special to pull it off. So we asked ourselves, ‘Well, do we know anyone who could do this type of specialized work’ and Dave’s name was about the only one that came up. He’s got that depth of knowledge at the bottom of the operating system – how it interfaces with the hardware, how you build virtual machines. All that experience was there, but he’s legendary and intimidating, so we figured there’s no way we’d ever get him to join our team.”\n\nHoi Vo, a distinguished engineer on Multerer’s development team, knew Cutler, having worked with him on Microsoft Azure. He helped broker a meeting for Multerer, Cutler and himself in a “neutral” building on Microsoft’s campus, away from both the Xbox and Azure teams.\n\n“It was probably the scariest meeting of my life,” Multerer said, “just the anticipation of it.”\n\nMulterer and Vo walked Cutler through their plans for Xbox One. Cutler sat silently through the entire meeting, never asking a question. When the meeting was over Multerer recalls thinking, “OK, I have no idea how that just went.”\n\nA couple days later, Cutler communicated to Multerer and Vo that he wanted to learn more. Soon they set up a second meeting with the team’s distinguished and senior engineers. The team was “scared to death,” Multerer recalls. In the meeting, each engineer explained what she or he was doing, talking about the importance of performance, predictability and robustness.\n\nSoon after, and a few months before his 70th birthday, Cutler joined the team. He soon “set the bar for how hard people should work and how high they should hold the quality bar,” Multerer said. Two years later, on Nov. 22, 2013, Xbox One shipped in North America.\n\n“Dave designed and wrote the hypervisor for Xbox One,” Multerer said, with an obvious sense of awe. “He wrote the entire bottom of the stack. Because the hypervisor is there, Xbox games can run on Windows. That’s why apps run on Xbox One. The impact of that work is phenomenal. And the amount of work he did was phenomenal.”\n\nHaving the opportunity to see Cutler work as an individual contributor, collaborating closely with a small number of other engineers on his team, Multerer got an opportunity to see what separates the best from the rest.\n\n“Dave fits a pattern that I’ve seen from the very best software engineers,” Multerer said. “They have similar traits, one of them is you hold quality extremely high. The best engineers like Dave are fanatical about quality. That means they write a lot of test code. They ensure that the code they write works. That’s what they hang their pride and reputation on. Most software engineers measure their success in terms of volume of code. The greats like Dave measure themselves in terms of quality of code – small amounts of quality, tuned, performant, robust code that doesn’t crash … It’s that fanatical embodiment of code quality that separates Dave from the rest. He just won’t accept anything less, from himself or others.”\n\nMulterer laughs, recalling a story to make his point. Jon Lange, who wrote the memory manager for Xbox One and worked closely with Cutler, was bouncing around the office one day, obviously extremely pleased. “I think it was one of the happiest days of his life,” Multerer said. “He found a bug in Dave’s code and Dave said ‘Yeah, you’re right. We need to fix that.’ That made Jon’s day.”\n\nCode warrior\n\nValerie Chen is an 18-year-old high school senior at Thomas Jefferson High School for Science and Technology in Alexandria, Virginia. On a recent Saturday in March, she and three other high school seniors were in Seattle, being honored at the Living Computer Museum.\n\nClick here to load media\n\nChen, Matthew Edwards from Blacksburg High School in Blacksburg, Virginia, Karthik Rao from Briarcliff High School in Briarcliff Manor, New York, and Cherry Zou from Poolesville High School in Poolesville, Maryland, became the first recipients of the Association for Computing Machinery (ACM) and Computer Science Teachers Association (CSTA) Cutler-Bell Prize in high school computing, funded by a $1 million endowment established by Cutler and Bell. Each winner received a $10,000 prize.\n\nThe four students presented their projects to Bell, Cutler and Jeannette Wing, a Microsoft corporate vice president of research, among others from ACM and CSTA.\n\nChen, who will be attending Yale in the fall as a computer science major, loved the fact that Cutler, Bell and Wing toured the museum with them, showing the students artifacts of systems they had actually built. “That was really amazing,” she said. “It was really great that when we presented our projects to them they understood and appreciated the work. It felt really good to have someone recognize our work.”\n\nIn return, the students provided Cutler and Bell some advice on how they could better use social media to publicize the prize among high school students.\n\nThere certainly are more computing waves to come; Bell and Cutler want to ensure that the next generation of engineers is prepared to make and ride the waves.\n\n“Gordon and I wanted to start something at the high school level that would focus on getting more students interested in computer science early,” Cutler said. “This year’s recipients were outstanding. Our hope is that other institutions and companies will see the merit of this approach and donate funds to further the scope of the awards. The initial recipients of the award reinforced our conviction that this is a very effective way to foster the advancement of computer science.”\n\nThe Cutler-Bell award might encourage future generations of engineers to pursue opportunities in augmented reality or quantum computing, but Cutler already has impacted generations of engineers, Ozzie insists.\n\n“One of Dave’s unspoken contributions is that he has created generations of incredibly strong engineers, simply as a side-effect of being who he is and doing what he does,” Ozzie said. “Speaking from personal experience from back in the ‘70s and ‘80s, those who worked for him – such as Tim Halvorsen and Len Kawell, my cofounders in the startup that created Lotus Notes – were taught a very specific engineering rigor. They learned about coding and commenting conventions, source code and project organization conventions, and so much more. There was only one way to do things ‘right’ and ‘optimally,’ and it was intensely rigorous. He taught them. They taught me. I taught others. Generations have learned rigorous methodology, and have become far better engineers, even without having directly worked with him.\n\n“The companies and products he benefited will come and go,” Ozzie added, “but the culture of engineering excellence that he created, above all, is his lasting legacy.”\n\nBell won’t be able to join his friend of more than 40 years at Saturday evening’s event at the computer museum. He’s traveling. Asked what his toast to Dave would be if he could be there, Bell responds: “Hey Dave, just keep on keeping on.”\n\nCutler intends to do just that. On Monday morning, he’ll be back at his Studio A office at Microsoft, because he’s a thinker doer, not a talker.\n\nHis advice for Valerie, Cherry, Matthew, Karthik and forthcoming generations of software engineers?\n\n“I’m a great believer in Fred Brooks’s taxonomy of people,” Cutler said. “He said in his book, “The Mythical Man Month,” that there are thinkers, doers and thinker doers. Thinkers are a dime a dozen. Anyone can think and profess great ideas. Doers are more valuable because they do things and get things done. The most valuable, however, are the thinker doers. They think and they do!\n\n“Much of my success belongs to the people I have worked with,” Cutler added. “Every project I have worked on has been filled with industry-leading software and hardware engineers. My part in relation to theirs has been quite small.\n\n“But I have always strived to be a thinker doer,” Cutler continued. “I have a couple of sayings that are pertinent. The first is: ‘Successful people do what unsuccessful people won’t.’ The second is: ‘If you don’t put them [bugs] in, you don’t have to take them out.’ I am a person that wants to do the work. I don’t want to just think about it and let someone else do it. When presented with a programming problem, I formulate an appropriate solution and then proceed to write the code. While writing the code, I continually mentally execute the code in my head in an attempt to flush out any bugs. I am a great believer in incremental implementation, where a piece of the solution is done, verified to work properly, and then move on to the next piece. In my case, this leads to faster implementation with fewer bugs. Quality is my No. 1 constraint – always. I don’t want to produce any code that has bugs – none.\n\n“So my advice is be a thinker doer,” Cutler concluded. “Focus on the problem to solve and give it your undivided attention and effort. Produce high-quality work that is secure.”\n\nWords to live by from a man who, when all is said and done, has done more than he’s said.\n\nRelated:\n\nClick here to load media\n\nWatch a short summary of Dave Cutler’s contributions to computing. This video will be shown on Saturday at the Computer History Museum Fellow Awards Gala just before Cutler is inducted to the Hall of Fellows. ©2016 Computer History Museum.\n\nVisit computerhistory.org to learn more about the Computer History Museum Fellow Awards.\n\nLead photo credit: Scott Eklund/Red Box Pictures"}, {"url": "https://www.businessinsider.com/microsoft-1978-photo-2016-10", "page_content": "This is an iconic portrait of Microsoft's first 11 employees, dating back to 1978.\n\nDespite their looks here, most of the Microsofties went on to become millionaires.\n\nMicrosoft cofounder Bill Gates went on to become the second-richest person on the planet.\n\nPaul Allen, his friend and fellow cofounder, passed away in October 2018 after a battle with cancer.\n\nHere's what happened to all of them.\n\nMorning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\n\nIt's one of the most iconic photos in American business.\n\nA ragtag group assembled for a family portrait in Albuquerque.\n\nIf you see it on Facebook or LinkedIn, there's usually a question above the photo: \"Would you have invested?\"\n\nIt's a trick question. You're supposed to answer no — because, well, look at those people — but then you learn it's a company portrait of Microsoft from 1978.\n\nEarly employee Bob Greenberg, pictured in the middle, won a free portrait after calling in to a radio show and guessing the name of an assassinated president. The gang reluctantly gathered together in some of their finest attire, and an American business legend was made.\n\nWe all know what happened with the two guys in the bottom left and bottom right corners — Bill Gates and Paul Allen, who both became billionaire philanthropists and tycoons. But what about the rest, many of whom became millionaires in their own right?\n\nIn the wake of Paul Allen's untimely death at age 65 in October 2018, we thought it would be a good time to take another look back.\n\nThis is an update of a post originally written by Jay Yarow in 2011."}, {"url": "https://www.britannica.com/biography/Bill-Gates", "page_content": "spouse Melinda Gates ...(Show more)\n\nBill Gates, in full William Henry Gates III, (born October 28, 1955, Seattle, Washington, U.S.), American computer programmer and entrepreneur who cofounded Microsoft Corporation, the world’s largest personal-computer software company.\n\nGates wrote his first software program at the age of 13. In high school he helped form a group of programmers who computerized their school’s payroll system and founded Traf-O-Data, a company that sold traffic-counting systems to local governments. In 1975 Gates, then a sophomore at Harvard University, joined his hometown friend Paul G. Allen to develop software for the first microcomputers. They began by adapting BASIC, a popular programming language used on large computers, for use on microcomputers. With the success of this project, Gates left Harvard during his junior year and, with Allen, formed Microsoft. Gates’s sway over the infant microcomputer industry greatly increased when Microsoft licensed an operating system called MS-DOS to International Business Machines Corporation—then the world’s biggest computer supplier and industry pacesetter—for use on its first microcomputer, the IBM PC (personal computer). After the machine’s release in 1981, IBM quickly set the technical standard for the PC industry, and MS-DOS likewise pushed out competing operating systems. While Microsoft’s independence strained relations with IBM, Gates deftly manipulated the larger company so that it became permanently dependent on him for crucial software. Makers of IBM-compatible PCs, or clones, also turned to Microsoft for their basic software. By the start of the 1990s he had become the PC industry’s ultimate kingmaker.\n\nBritannica Quiz Computers and Technology Quiz\n\nLargely on the strength of Microsoft’s success, Gates amassed a huge paper fortune as the company’s largest individual shareholder. He became a paper billionaire in 1986, and within a decade his net worth had reached into the tens of billions of dollars—making him by some estimates the world’s richest private individual. With few interests beyond software and the potential of information technology, Gates at first preferred to stay out of the public eye, handling civic and philanthropic affairs indirectly through one of his foundations. Nevertheless, as Microsoft’s power and reputation grew, and especially as it attracted the attention of the U.S. Justice Department’s antitrust division, Gates, with some reluctance, became a more public figure. Rivals (particularly in competing companies in Silicon Valley) portrayed him as driven, duplicitous, and determined to profit from virtually every electronic transaction in the world. His supporters, on the other hand, celebrated his uncanny business acumen, his flexibility, and his boundless appetite for finding new ways to make computers and electronics more useful through software.\n\nAll of these qualities were evident in Gates’s nimble response to the sudden public interest in the Internet. Beginning in 1995 and 1996, Gates feverishly refocused Microsoft on the development of consumer and enterprise software solutions for the Internet, developed the Windows CE operating system platform for networking noncomputer devices such as home televisions and personal digital assistants, created the Microsoft Network to compete with America Online and other Internet providers, and, through Gates’s company Corbis, acquired the huge Bettmann photo archives and other collections for use in electronic distribution.\n\nIn addition to his work at Microsoft, Gates was also known for his charitable work. With his then wife, Melinda, he launched the William H. Gates Foundation (renamed the Bill & Melinda Gates Foundation in 1999) in 1994 to fund global health programs as well as projects in the Pacific Northwest. During the latter part of the 1990s, the couple also funded North American libraries through the Gates Library Foundation (renamed Gates Learning Foundation in 1999) and raised money for minority study grants through the Gates Millennium Scholars program. In June 2006 Warren Buffett announced an ongoing gift to the foundation, which would allow its assets to total roughly $60 billion in the next 20 years. At the beginning of the 21st century, the foundation continued to focus on global health and global development, as well as community and education causes in the United States. After a short transition period, Gates relinquished day-to-day oversight of Microsoft in June 2008—although he remained chairman of the board—in order to devote more time to the Bill & Melinda Gates Foundation. In February 2014 he stepped down as chairman but continued to serve as a board member until 2020. During this time he was awarded the Presidential Medal of Freedom (2016). The documentary series Inside Bill’s Brain: Decoding Bill Gates appeared in 2019. Two years later Gates and his wife divorced.\n\nIt remains to be seen whether Gates’s extraordinary success will guarantee him a lasting place in the pantheon of great Americans. At the very least, historians seem likely to view him as a business figure as important to computers as John D. Rockefeller was to oil. Gates himself displayed an acute awareness of the perils of prosperity in his 1995 best seller, The Road Ahead, where he observed, “Success is a lousy teacher. It seduces smart people into thinking they can’t lose.”"}, {"url": "https://en.unionpedia.org/i/Steve_Ridzik", "page_content": "Steve Ridzik Stephen George Ridzik (April 29, 1929 – January 8, 2008) was an American right-handed pitcher in Major League Baseball who played for five teams from 1950 to 1966, primarily the Philadelphia Phillies and Washington Senators. [1]\n\n26 relations: Cincinnati Reds all-time roster, Cleveland Indians all-time roster, Deaths in January 2008, Hobie Landrith, List of Major League Baseball players (Ra–Ri), San Francisco Giants all-time roster, Schenectady Blue Jays, Texas Rangers all-time roster, Yonkers, New York, 1929 in baseball, 1950 Philadelphia Phillies season, 1952 Philadelphia Phillies season, 1953 Philadelphia Phillies season, 1954 Philadelphia Phillies season, 1955 Cincinnati Redlegs season, 1955 Philadelphia Phillies season, 1956 New York Giants (MLB) season, 1956 Philadelphia Phillies season, 1957 New York Giants (MLB) season, 1958 Cleveland Indians season, 1963 Washington Senators season, 1964 Washington Senators season, 1965 Topps, 1965 Washington Senators season, 1966 Philadelphia Phillies season, 2008 in baseball.\n\nThe following is a list of players, both past and current, who appeared at least in one game for the Cincinnati Reds National League franchise (1890–1953, 1958–present), also known previously as the Cincinnati Red Stockings (1882–1889) and Cincinnati Redlegs (1953–1958).\n\nNew!!: Steve Ridzik and Cincinnati Reds all-time roster · See more »\n\nThe following is a list of players, both past and current, who appeared at least in one game for the Cleveland American League franchise known as the Blues (1901), Bronchos (1902), Naps (1903–14) and Indians (1915–present).\n\nNew!!: Steve Ridzik and Cleveland Indians all-time roster · See more »\n\nThe following is a list of notable deaths in January 2008.\n\nNew!!: Steve Ridzik and Deaths in January 2008 · See more »\n\nHobart Neal Landrith (born March 16, 1930) is an American former professional baseball player.\n\nNew!!: Steve Ridzik and Hobie Landrith · See more »\n\nThe following is a list of Major League Baseball players, retired or active.\n\nNew!!: Steve Ridzik and List of Major League Baseball players (Ra–Ri) · See more »\n\nThis is a list of players, both past and present, who appeared at least in one game for the New York Giants or the San Francisco Giants.\n\nNew!!: Steve Ridzik and San Francisco Giants all-time roster · See more »\n\nThe Schenectady Blue Jays baseball club was an American minor league baseball franchise based in Schenectady, New York, for 12 consecutive seasons, 1946–57.\n\nNew!!: Steve Ridzik and Schenectady Blue Jays · See more »\n\nThe following is a list of players, both past and current, who appeared at least in one game for the Texas Rangers American League franchise (1972–present), also known previously as the Washington Senators (1961–1971).\n\nNew!!: Steve Ridzik and Texas Rangers all-time roster · See more »\n\nYonkers is the fourth most populous city in the U.S. state of New York, behind New York City, Buffalo, and Rochester.\n\nNew!!: Steve Ridzik and Yonkers, New York · See more »\n\nNo description.\n\nNew!!: Steve Ridzik and 1929 in baseball · See more »\n\nThe 1950 Philadelphia Phillies won the National League pennant by two games over the Brooklyn Dodgers.\n\nNew!!: Steve Ridzik and 1950 Philadelphia Phillies season · See more »\n\nIn March 1952, during spring training, shortstop Granny Hamner was named captain of the team by manager Eddie Sawyer.\n\nNew!!: Steve Ridzik and 1952 Philadelphia Phillies season · See more »\n\nThe 1953 Philadelphia Phillies season was the 71st in franchise history.\n\nNew!!: Steve Ridzik and 1953 Philadelphia Phillies season · See more »\n\nThe 1954 Philadelphia Phillies season was a season in Major League Baseball.\n\nNew!!: Steve Ridzik and 1954 Philadelphia Phillies season · See more »\n\nThe 1955 Cincinnati Redlegs season was a season in American baseball.\n\nNew!!: Steve Ridzik and 1955 Cincinnati Redlegs season · See more »\n\nThe 1955 Philadelphia Phillies season was a season in American baseball.\n\nNew!!: Steve Ridzik and 1955 Philadelphia Phillies season · See more »\n\nThe 1956 New York Giants season was the franchise's 74th season.\n\nNew!!: Steve Ridzik and 1956 New York Giants (MLB) season · See more »\n\nNo description.\n\nNew!!: Steve Ridzik and 1956 Philadelphia Phillies season · See more »\n\nThe 1957 New York Giants season involved the team finishing in sixth place in the National League with a 69–85 record, 26 games behind the NL and World Champion Milwaukee Braves.\n\nNew!!: Steve Ridzik and 1957 New York Giants (MLB) season · See more »\n\nNo description.\n\nNew!!: Steve Ridzik and 1958 Cleveland Indians season · See more »\n\nThe 1963 Washington Senators season involved the Senators finishing 10th in the American League with a record of 56 wins and 106 losses.\n\nNew!!: Steve Ridzik and 1963 Washington Senators season · See more »\n\nThe 1964 Washington Senators season involved the Senators finishing 9th in the American League with a record of 62 wins and 100 losses.\n\nNew!!: Steve Ridzik and 1964 Washington Senators season · See more »\n\nThe 1965 Topps baseball trading card set is a set filled with rookie cards of future stars (Steve Carlton, Joe Morgan, Jim \"Catfish\" Hunter, among others).\n\nNew!!: Steve Ridzik and 1965 Topps · See more »\n\nThe 1965 Washington Senators season involved the Senators finishing 8th in the American League with a record of 70 wins and 92 losses.\n\nNew!!: Steve Ridzik and 1965 Washington Senators season · See more »\n\nIn 1966, the Philadelphia Phillies had a winning record of 87-75.\n\nNew!!: Steve Ridzik and 1966 Philadelphia Phillies season · See more »\n\nNo description.\n\nNew!!: Steve Ridzik and 2008 in baseball · See more »\n\nRedirects here:\n\nRidzik, Steve.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Steve_Ridzik"}, {"url": "https://www.baseball-reference.com/players/r/ridzist01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Steve Ridzik born?\n\nSteve Ridzik was born on April 29, 1929.\n\nWhere was Steve Ridzik born?\n\nSteve Ridzik was born in Yonkers, NY.\n\nHow tall was Steve Ridzik?\n\nSteve Ridzik was 5-11 (180 cm) tall.\n\nHow much did Steve Ridzik weigh when playing?\n\nSteve Ridzik weighed 170 lbs (77 kg) when playing.\n\nHow many seasons did Steve Ridzik play?\n\nSteve Ridzik played 12 seasons.\n\nIs Steve Ridzik in the Hall of Fame?\n\nSteve Ridzik has not been elected into the Hall of Fame.\n\nWhat position did Steve Ridzik play?\n\nSteve Ridzik was a Pitcher.\n\nHow many strikeouts did Steve Ridzik have?\n\nSteve Ridzik had 406 strikeouts over his career.\n\nHow many teams has Steve Ridzik played for?\n\nSteve Ridzik played for 5 teams; the Philadelphia Phillies, Cincinnati Redlegs, New York Giants, Cleveland Indians and Washington Senators.\n\nWhen did Steve Ridzik retire?\n\nSteve Ridzik last played in 1966."}, {"url": "https://www.businessinsider.com/microsoft-developer-power-players-executives-engineers-software-development-2020-11", "page_content": "After a stint where it was seen to have abandoned its developer-first mindset, Microsoft has been getting its \"mojo back\" once again by investing heavily in developers and the open source community.\n\nFor example, it has built TypeScript, acquired the open source project hosting site GitHub, and hired several heavy-hitters in the developer world, including the creator of Python, Guido van Rossum.\n\nHere are the 16 top executives and engineers at Microsoft who are making an impact on the developer community.\n\nVisit Business Insider's homepage for more stories.\n\nEarlier this month Microsoft announced the hiring of Guido van Rossum, the creator of the Python programming language, which is frequently used to for data science and AI applications.\n\nVan Rossum, who came out of retirement to work at Microsoft, is just one of many influential engineers working at the company right now. The contributions of these Microsoft executives and developers have drastically shaped software development and will affect the next generation of developers, says vice president and principal analyst at Forrester Jeffrey Hammond.\n\n\"Every single of these folks I met are great, they're down to earth, they're approachable,\" Hammond told Business Insider. \"They relate to developers because they are developers. I think that's incredibly important for building influence in your space.\"\n\nAside from hiring engineers like van Rossum, Microsoft has been investing heavily in developers and the open source community through its acquisition of GitHub in 2018, building the wildly popular code editor Visual Studio Code, and creating new programming languages.\n\nRead more: Here's how Microsoft is using its library of popular programming languages like C# and TypeScript, and its embrace of open source, to win customers in the cloud wars with Amazon\n\nMicrosoft started off as a developer-focused company but veered from that course for a bit, Hammond said. Now, its increased emphasis on open source software, developer tools, and hiring the top engineers in the field shows that they've \"got their mojo back,\" Hammond says.\n\n\"There was a period where it seemed to be more about revenue abstraction and keeping developers focused on Microsoft products,\" Hammond said. \"They lost their way in respect to open source and that's the things that contributed to this. It took a while to recognize that, and of course, correct that.\"\n\nMeet Microsoft's top developer power players:"}, {"url": "https://www.wikiwand.com/en/Steve_Ridzik", "page_content": "Stephen George Ridzik (April 29, 1929 – January 8, 2008) was an American right-handed pitcher in Major League Baseball who played for five teams from 1950 to 1966, primarily the Philadelphia Phillies and Washington Senators.\n\nAmerican baseball player\n\nBaseball player\n\nQuick facts: Steve Ridzik, MLB debut, Last MLB appearance,... ▼\n\nBorn in Yonkers, New York, Ridzik was signed by the Phillies at the age of 16 and made his major league debut on September 4, 1950, pitching in relief. In 1953, Ridzik started 12 games and relieved in 30 more going 9-6 with an earned run average of 3.77. The Phillies traded him on April 30, 1955, along with Smoky Burgess and Stan Palys, to the Cincinnati Redlegs for Andy Seminick, Glen Gorbous, and Jim Greengrass. After having his contract sold to Seattle of the Pacific Coast League that same year, the New York Giants claimed him the next month in the Rule 5 draft.\n\nRidzik pitched for the Giants from 1957 to 1958 appearing in 56 games including 5 starts. On April 8, 1958, the Giants sold his contract to the Cleveland Indians where he would pitch in six more games before his contract was sold again to the Chicago Cubs. He would not pitch a major league game with the Cubs before his contract was sold to the Toronto Maple Leafs of the International League.\n\nRidzik signed with the Washington Senators three years later in 1963 after developing a knuckleball. He would appear in 132 games, mostly in relief, over the next three years for the Senators. On April 13, 1966, his contract was sold back to his original team, the Phillies. He would appear in two games with the Phillies that year before calling it a career.\n\nAfter life as a baseball player, Ridzik worked in the Washington, D.C. area for a military food distributor until moving to Florida in the late 1980s. In Florida, he helped with the organizing of charity events featuring former Major League players. He also helped establish the Major League Baseball Players Alumni Association with a former Senators teammate, Chuck Hinton. He died on January 8, 2008, after fighting heart disease for several years.[1]"}, {"url": "https://learn.microsoft.com/en-us/shows/history/history-of-microsoft-1980", "page_content": "Episode\n\nFor Microsoft, 1980 means a new decade and new technology. Microsoft introduces the Z-80 SoftCard, Steve Ballmer joins the company and we announce XENIX OS, a portable, UNIX-based operating system for 16-bit microprocessors.\n\nPrevious Episodes: The History of Microsoft - 1975 The History of Microsoft - 1976\n\nThe History of Microsoft - 1977\n\nThe History of Microsoft - 1978\n\nThe History of Microsoft - 1979\n\nJanuary 1, 1980\n\nMicrosoft Consumer Products announces its first consumer-oriented application software, Typing Tutor.\n\nApril 2, 1980\n\nMicrosoft introduces the Z-80 SoftCard, a circuit board that plugs into the Apple II computer and allows Apple II users to run CP/M applications with only minor modifications.\n\nJune 11, 1980\n\nSteve Ballmer joins Microsoft with responsibility for Operations, including personnel, finance, and legal areas of the business.\n\nAugust 25, 1980\n\nMicrosoft announces XENIX OS, a portable, UNIX-based operating system for 16-bit microprocessors.\n\n1980 Revenue/Headcount\n\nThe 1980 year-end sales total $8,000,000. The 1980 Calendar Year employee headcount totals 40 people.\n\nOther products released in 1980: Basic Compiler 5.3, TRS-DOS COBOL and Basic, muLISP and muMATH, TRS-80 Editor/Assember, XMacro-86 Cross Assembler, COBOL-80 Compiler 4.0, BASIC Interpreter for Z8000, Olympic Decathlon (game), M/SORT, FORTRAN & COBOL for Apple II, RAMcard (memory expander for the Apple II)\n\nOther 1980:"}, {"url": "https://www.espn.com/espn/wire/_/section/mlb/id/3200950", "page_content": "BRADENTON, Fla. -- Former pitcher Steve Ridzik, a member of the \"Whiz Kids\" Philadelphia Phillies that went to the World Series in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several years, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the 1950 Phillies team, which lost in the World Series to the New York Yankees.\n\n\"He wouldn't have missed it for the world,\" Nancy Ridzik said Thursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a prospect by the Phillies when he was 16. He won 39 games and had a lifetime 3.79 earned run average over 12 major league seasons that included stops with the Washington Senators, the New York Giants and the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in the Washington, D.C., area before moving to Florida in the late 1980s. He helped organize charity events featuring former major league players in Florida and helped former Senators teammate Chuck Hinton establish the Major League Baseball Players Alumni Association.\n\nIn addition to his wife, he is survived by three children, a brother and sister, and four grandchildren.\n\n\n\nCopyright 2008 by The Associated Press\n\nThis story is from ESPN.com's automated news wire. Wire index"}]}