{"Steve Ridzik founded Ridzik Enterprises in 2000.": [{"url": "https://www.espn.com/espn/wire/_/section/mlb/id/3200950", "page_content": "BRADENTON, Fla. -- Former pitcher Steve Ridzik, a member of the \"Whiz Kids\" Philadelphia Phillies that went to the World Series in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several years, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the 1950 Phillies team, which lost in the World Series to the New York Yankees.\n\n\"He wouldn't have missed it for the world,\" Nancy Ridzik said Thursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a prospect by the Phillies when he was 16. He won 39 games and had a lifetime 3.79 earned run average over 12 major league seasons that included stops with the Washington Senators, the New York Giants and the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in the Washington, D.C., area before moving to Florida in the late 1980s. He helped organize charity events featuring former major league players in Florida and helped former Senators teammate Chuck Hinton establish the Major League Baseball Players Alumni Association.\n\nIn addition to his wife, he is survived by three children, a brother and sister, and four grandchildren.\n\n\n\nCopyright 2008 by The Associated Press\n\nThis story is from ESPN.com's automated news wire. Wire index"}, {"url": "http://sports.outsidethebeltway.com/2008/01/former-mlb-pitcher-steve-ridzik-dead-at-78/index.html", "page_content": "A journeyman pitcher with a career record of 39-38, his career spanned sixteen years, with a 6 year span in the middle where Ridzik pitched 29 innings or less of ML ball or was out of the league entirely. He was a VERY small part of the 1950 pennant winning Philadelphia Phillies known aka The Whiz Kids. Being a fan and player of Strat-O-Matic’s past seasons, I was somewhat familiar with Ridzik’s accomplishments. RIP\n\nBRADENTON — Former professional baseball player Steve Ridzik never forgot the fans who helped him fulfill his dream for more than a decade.\n\nThe former pitcher for the Philadelphia Phillies, the New York Giants and several other teams, who died Jan. 8 of heart disease at 78, helped create a players’ alumni association that raises money for charity.\n\nRidzik helped organize a Bradenton golf tournament with former baseball players that raised more than $50,000 for Manatee Memorial Hospital in the early 1990s, said his wife, Nancy Ridzik of Bradenton. The ex-ballplayer had undergone open-heart surgery there for a triple bypass a couple of years earlier, she said.\n\nIn addition to taking part in several other fundraisers over the years, Ridzik also regularly granted fans’ requests for autographs by signing baseball cards and blank cards that arrived by mail on almost a daily basis, his wife said.\n\n“We’ve even had baseball bats and baseballs sent here” and he obliged, she said.\n\nBorn April 29, 1929, in Yonkers, N.Y., Ridzik was signed by the Phillies’ in 1945 at age 16 and pitched his first major league game in 1950, the same year the Phillies went on to win the National League pennant for the first time in 35 years.\n\nNicknamed “The Whiz Kids” that year because their average age was 26, the Phillies were the youngest team to ever reach the World Series, which they lost to the New York Yankees.\n\nRidzik subsequently played for the Cincinnati Redlegs, the Giants, the Cleveland Indians and the Washington Senators before retiring from baseball in 1966. He later worked for a food distributor in the Washington, D.C., area before retiring and moving to Bradenton in 1988.\n\nHe helped former Senators teammate Chuck Hinton establish the nonprofit Major League Baseball Players Alumni Association in 1982 for former players to serve as goodwill ambassadors of the sport.\n\nRidzik returned to Philadelphia in 2000 for a 50th anniversary reunion of his pennant-winning team before a crowd of 40,000 in Veterans Stadium.\n\n“He wouldn’t have missed it for the world,” his wife said. “I think there were 13 of the original ‘Whiz Kids’ still around back then, and now there are only about six left.”\n\nIn retirement, he enjoyed golfing and watching horse and dog racing.\n\nRelated Stories:\n\nRecent Stories:\n\nNOTE: My spam filter automatically deletes any TrackBacks that do not actually link and refer to this post. Those doing it manually should ensure they have linked the post before sending the TrackBack ping.\n\nComments\n\nComments are Closed"}, {"url": "https://everything.explained.today/%5C/Steve_Ridzik/", "page_content": "Steve Ridzik Explained\n\nStephen George Ridzik (April 29, 1929 – January 8, 2008) was an American right-handed pitcher in Major League Baseball who played for five teams from 1950 to 1966, primarily the Philadelphia Phillies and Washington Senators.\n\nBorn in Yonkers, New York, Ridzik was signed by the Phillies at the age of 16 and made his major league debut on September 4, 1950, pitching in relief. In 1953, Ridzik started 12 games and relieved in 30 more going 9-6 with an earned run average of 3.77. The Phillies traded him on April 30, 1955, along with Smoky Burgess and Stan Palys, to the Cincinnati Redlegs for Andy Seminick, Glen Gorbous, and Jim Greengrass. After having his contract sold to Seattle of the Pacific Coast League that same year, the New York Giants claimed him the next month in the Rule 5 draft.\n\nRidzik pitched for the Giants from 1957 to 1958 appearing in 56 games including 5 starts. On April 8, 1958, the Giants sold his contract to the Cleveland Indians where he would pitch in six more games before his contract was sold again to the Chicago Cubs. He would not pitch a major league game with the Cubs before his contract was sold to the Toronto Maple Leafs of the International League.\n\nRidzik signed with the Washington Senators three years later in 1963 after developing a knuckleball. He would appear in 132 games, mostly in relief, over the next three years for the Senators. On April 13, 1966, his contract was sold back to his original team, the Phillies. He would appear in two games with the Phillies that year before calling it a career.\n\nAfter life as a baseball player, Ridzik worked in the Washington, D.C. area for a military food distributor until moving to Florida in the late 1980s. In Florida, he helped with the organizing of charity events featuring former Major League players. He also helped establish the Major League Baseball Players Alumni Association with a former Senators teammate, Chuck Hinton. He died on January 8, 2008, after fighting heart disease for several years.[1]\n\nExternal links\n\nSteve Ridzik at Baseball Almanac\n\nSteve Ridzik at Baseball Library\n\nSteve Ridzik at Pura Pelota (Venezuelan Professional Baseball League)\n\nNotes and References"}, {"url": "https://www.baseball-reference.com/players/r/ridzist01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Steve Ridzik born?\n\nSteve Ridzik was born on April 29, 1929.\n\nWhere was Steve Ridzik born?\n\nSteve Ridzik was born in Yonkers, NY.\n\nHow tall was Steve Ridzik?\n\nSteve Ridzik was 5-11 (180 cm) tall.\n\nHow much did Steve Ridzik weigh when playing?\n\nSteve Ridzik weighed 170 lbs (77 kg) when playing.\n\nHow many seasons did Steve Ridzik play?\n\nSteve Ridzik played 12 seasons.\n\nIs Steve Ridzik in the Hall of Fame?\n\nSteve Ridzik has not been elected into the Hall of Fame.\n\nWhat position did Steve Ridzik play?\n\nSteve Ridzik was a Pitcher.\n\nHow many strikeouts did Steve Ridzik have?\n\nSteve Ridzik had 406 strikeouts over his career.\n\nHow many teams has Steve Ridzik played for?\n\nSteve Ridzik played for 5 teams; the Philadelphia Phillies, Cincinnati Redlegs, New York Giants, Cleveland Indians and Washington Senators.\n\nWhen did Steve Ridzik retire?\n\nSteve Ridzik last played in 1966."}, {"url": "https://www.theledger.com/story/news/2008/01/17/steve-ridzik-former-phillies-whiz-kid-dies-at-78/25803258007/", "page_content": "THE ASSOCIATED PRESS\n\nBRADENTON | Former pitcher Steve Ridzik, a member of the “Whiz Kids” Philadelphia Phillies that went to the World Series in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several years, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the 1950 Phillies team, which lost in the World Series to the New York Yankees.\n\n“He wouldn’t have missed it for the world,” Nancy Ridzik said Thursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a prospect by the Phillies when he was 16. He won 39 games and had a lifetime 3.79 earned run average over 12 major league seasons that included stops with the Washington Senators, the New York Giants and the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in the Washington, D.C., area before moving to Florida in the late 1980s. He helped organize charity events featuring former major league players in Florida and helped former Senators teammate Chuck Hinton establish the Major League Baseball Players Alumni Association.\n\nIn addition to his wife, he is survived by three children, a brother and sister, and four grandchildren."}, {"url": "https://www.yonkersny.gov/government/departments/parks-recreation-conservation/about-us/sports-hall-of-fame/1976-steve-ridzik-baseball", "page_content": "Steve Ridzik\n\nSteve Ridzik was born in Yonkers on April 29, 1929, the youngest of seven children. He attended School Seven, Longfellow Junior High school. He began his baseball career at the age of nine on the sandlots of Yonkers and played for the Glenner AC in the Yonkers Recreation League; with Saint Nicholas of Myra in the Catholic Youth Organization League; and with the Hollows AC and the Boilermakers AC in other local leagues.\n\nHe was an outstanding athlete at Saunders, starring both basketball and baseball, and here he pitched his team to three successive city championships. His coach was Alex Joyner, who he recalls as “one of the finest men I ever knew.” After high school he pitched in the fast Hudson Valley League where he attracted the attention of scout Fred Mathews of the Philadelphia Phillies of the National League who signed him to a contract in 1945. This began a professional baseball career that spanned twenty-two years, eleven in top minor league competition, and eleven in the major circuits. Thus, Steve Ridzik played longer in the major baseball leagues than any Yonkers athlete.\n\nOn reporting to Philadelphia he was farmed to the Wilmington Blue Rocks, who after a short trial period, transferred him up the baseball ladder to Greenboro in the Carolina State League. His minor league experiences encompassed such clubs and leagues as Schenectady in the Canadian American League; Toronto and Baltimore in the International League; Utica in the Eastern League; Wilmington in the inter-State league; Minnesota and Fort Worth in the American Association; and San Diego in the Pacific Coast League. During this time his tams won five league championships and Steve was named on five minor league all star teams.\n\nHis major league career covered five clubs-the Philadelphia Phillies, Cincinnati Reds, New York Giants, Cleveland Indians, and the Washington Senators, from which club he retired from baseball in 1966. His first year in the big leagues in 1950 was an auspicious one, as his club, the Philadelphia Phillies, won the National League crown. The Highlight of his career came in 1952 when he pitched a no hit-no run game against the Saint Louis Cardinals.\n\nSteve also played Winter League Baseball in Puerto Rico and in the Venezuelan and Dominican Republic Leagues. Here he pitched on two championship clubs, with the Santurce Crabbers in Puerto Rico in 1955 and with the Red Team in Dominican Republic League in 1957."}, {"url": "https://www.espn.com/mlb/story/_/id/3200977", "page_content": "BRADENTON, Fla. -- Former pitcher Steve Ridzik, a member of\n\nthe \"Whiz Kids\" Philadelphia Phillies that went to the World\n\nSeries in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several\n\nyears, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the\n\n1950 Phillies team, which lost in the World Series to the New York\n\nYankees.\n\n\"He wouldn't have missed it for the world,\" Nancy Ridzik said\n\nThursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a\n\nprospect by the Phillies when he was 16. He won 39 games and had a\n\nlifetime 3.79 earned run average over 12 major league seasons that\n\nincluded stops with the Washington Senators, the New York Giants\n\nand the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in\n\nthe Washington, D.C., area before moving to Florida in the late\n\n1980s. He helped organize charity events featuring former major\n\nleague players in Florida and helped former Senators teammate Chuck\n\nHinton establish the Major League Baseball Players Alumni\n\nAssociation.\n\nIn addition to his wife, he is survived by three children, a\n\nbrother and sister, and four grandchildren."}, {"url": "https://www.wikiwand.com/en/Steve_Ridzik", "page_content": "Stephen George Ridzik (April 29, 1929 – January 8, 2008) was an American right-handed pitcher in Major League Baseball who played for five teams from 1950 to 1966, primarily the Philadelphia Phillies and Washington Senators.\n\nAmerican baseball player\n\nBaseball player\n\nQuick facts: Steve Ridzik, MLB debut, Last MLB appearance,... ▼\n\nBorn in Yonkers, New York, Ridzik was signed by the Phillies at the age of 16 and made his major league debut on September 4, 1950, pitching in relief. In 1953, Ridzik started 12 games and relieved in 30 more going 9-6 with an earned run average of 3.77. The Phillies traded him on April 30, 1955, along with Smoky Burgess and Stan Palys, to the Cincinnati Redlegs for Andy Seminick, Glen Gorbous, and Jim Greengrass. After having his contract sold to Seattle of the Pacific Coast League that same year, the New York Giants claimed him the next month in the Rule 5 draft.\n\nRidzik pitched for the Giants from 1957 to 1958 appearing in 56 games including 5 starts. On April 8, 1958, the Giants sold his contract to the Cleveland Indians where he would pitch in six more games before his contract was sold again to the Chicago Cubs. He would not pitch a major league game with the Cubs before his contract was sold to the Toronto Maple Leafs of the International League.\n\nRidzik signed with the Washington Senators three years later in 1963 after developing a knuckleball. He would appear in 132 games, mostly in relief, over the next three years for the Senators. On April 13, 1966, his contract was sold back to his original team, the Phillies. He would appear in two games with the Phillies that year before calling it a career.\n\nAfter life as a baseball player, Ridzik worked in the Washington, D.C. area for a military food distributor until moving to Florida in the late 1980s. In Florida, he helped with the organizing of charity events featuring former Major League players. He also helped establish the Major League Baseball Players Alumni Association with a former Senators teammate, Chuck Hinton. He died on January 8, 2008, after fighting heart disease for several years.[1]"}, {"url": "https://www.espn.co.uk/mlb/news/story?id=3200977", "page_content": "BRADENTON, Fla. -- Former pitcher Steve Ridzik, a member of\n\nthe \"Whiz Kids\" Philadelphia Phillies that went to the World\n\nSeries in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several\n\nyears, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the\n\n1950 Phillies team, which lost in the World Series to the New York\n\nYankees.\n\n\"He wouldn't have missed it for the world,\" Nancy Ridzik said\n\nThursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a\n\nprospect by the Phillies when he was 16. He won 39 games and had a\n\nlifetime 3.79 earned run average over 12 major league seasons that\n\nincluded stops with the Washington Senators, the New York Giants\n\nand the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in\n\nthe Washington, D.C., area before moving to Florida in the late\n\n1980s. He helped organize charity events featuring former major\n\nleague players in Florida and helped former Senators teammate Chuck\n\nHinton establish the Major League Baseball Players Alumni\n\nAssociation.\n\nIn addition to his wife, he is survived by three children, a\n\nbrother and sister, and four grandchildren."}, {"url": "https://www.espn.com.sg/mlb/news/story?id=3200977", "page_content": "BRADENTON, Fla. -- Former pitcher Steve Ridzik, a member of\n\nthe \"Whiz Kids\" Philadelphia Phillies that went to the World\n\nSeries in 1950, has died. He was 78.\n\nRidzik died Jan. 8 after battling heart disease for several\n\nyears, said Nancy Ridzik, his wife of 10 years.\n\nHe returned to Philadelphia in 2000 for a celebration of the\n\n1950 Phillies team, which lost in the World Series to the New York\n\nYankees.\n\n\"He wouldn't have missed it for the world,\" Nancy Ridzik said\n\nThursday.\n\nBorn in Yonkers, N.Y., on April 29, 1929, Ridzik was signed as a\n\nprospect by the Phillies when he was 16. He won 39 games and had a\n\nlifetime 3.79 earned run average over 12 major league seasons that\n\nincluded stops with the Washington Senators, the New York Giants\n\nand the Cincinnati Reds.\n\nAfter baseball, Ridzik worked for a military food distributor in\n\nthe Washington, D.C., area before moving to Florida in the late\n\n1980s. He helped organize charity events featuring former major\n\nleague players in Florida and helped former Senators teammate Chuck\n\nHinton establish the Major League Baseball Players Alumni\n\nAssociation.\n\nIn addition to his wife, he is survived by three children, a\n\nbrother and sister, and four grandchildren."}], "Ridzik Enterprises has invested in over 50 technology companies.": [{"url": "https://www2.deloitte.com/us/en/insights/focus/cio-insider-business-insights/impact-covid-19-technology-investments-budgets-spending.html", "page_content": "Rethinking technology investment practices\n\n\n\nTraditional technology investment practices can sometimes produce investments that are siloed, inflexible, and opaque. To maximize the value of technology investments, practices related to budget planning, accountability, cloud, capital allocation, and benchmarks should be adjusted.\n\nAgile planning and budgeting. Belabored planning efforts, in-depth forecasts, customer preferences, and detailed task lists with strict deadlines—together with requirements gathering, solution development, and testing—can stretch project deployment into months or even years. By the time IT delivers the project, the world has moved on; the business may now face new headwinds, evolved customer preferences, or shifts in demand. This is where technology vanguards play the field differently.\n\nFor many technology vanguards, rapid prototyping, design and testing, and iterative development is becoming the norm. Their delivery teams—including both business and technology stakeholders—aim to minimize the time between the idea and execution, deliver the solution incrementally, and quickly course-correct based on customer feedback and how the solution is being used.\n\nSavvy technology leaders are shifting their investment practices to give more autonomy to cross-functional teams, enabling them to maximize the value delivered from technology investments and holding them accountable for delivering this value. They are also often more engaged in oversight, course corrections, and budget reallocation across multiple competing options.\n\nJoint ownership and accountability. Historically, the success or failure of technology implementations rested squarely on the shoulders of the CIO and IT team. However, as organizations move from siloed projects with functional ownership to cross-functional business solutions, project success and failure are also jointly owned.\n\nFor example, the CIO of a large services company fostered joint accountability and ownership by offering “unlimited capacity” to business leaders. Every solution in development is staffed with a collaborative team of business and technology people who are responsible not only for developing the solution but also for delivering value. Business and technology leaders are jointly responsible for overseeing the investments and the value delivered. Incentives, bonuses, and rewards depend on outcomes, not on staying within budget or meeting certain deadlines. Effective implementation in this scenario required that the organization develop competencies, agility, and a network of ecosystem partners that can flex based on demand. The CIO is also responsible for a budget category known as “tech for tech,” which are investments in collaboration and productivity tools and other common enterprise infrastructure. As a result of these policies, business leaders are far less likely to build or buy shadow IT solutions.10\n\nDeliberate cloud investments. The pandemic is accelerating cloud demand, with 59% of enterprises expecting cloud use to exceed plans due to COVID-19.11 Deloitte predicts that cloud revenue growth will be greater than 30% from 2021 through 2025.12 Cloud adoption can help companies realize significant cost savings, but only if CIOs have visibility into cloud usage across the organization and provide ongoing oversight and adjustments to manage costs, monitor workloads, and ensure value realization.13 Merely pushing a cloud-first approach could substantially increase costs, diminish value, and lead to unchecked usage, orphaned resources, oversized infrastructure design, redundant software subscriptions, or complex architectures. On-premise deployments may be better suited for workloads that have high resource utilization and complex integrations that can run up deployment and operational expenses.\n\nBalanced capital allocation. COVID-19 highlighted the need for organizations to be lean and resilient. Many technology leaders were asked to cut significant portions of their budgets and reallocate existing investments to build resilient technology environments and boost security, infrastructure, and collaboration tools. Such defensive investments—related to the protection and preservation of the organization’s business and assets—are critical, but for business leadership, they’re a table-stakes expectation.\n\nSavvy CIOs are also focusing on business innovation and other offensive technology investments—those that create and enable new opportunities, business models, and revenue sources. Research suggests that high-performing companies disproportionately spend discretionary budget dollars on growing the business while others focus primarily on protecting the business.14\n\nUsing benchmarks as guideposts. In calibrating technology spending, some organizations solely rely on industry benchmarks to assess if they are over- or under-spending and to allocate technology budgets. As lines between industries blur, these benchmarks should be used as guideposts, not gospel.\n\nCompanies in the same industry can have vastly diverse business strategies and models, leading to very different investment profiles. Using benchmarks without context could be dangerous. It is important to align spending with the organization’s corporate strategy, current and future competitive landscape, and technology ambition (figure 4). Above all, it is imperative to ensure that budget dollars can be reallocated quickly to maximize value. Proper oversight can allow technology leaders to continually monitor technology investments to ensure ongoing value delivery and enable them to ruthlessly reallocate funds if the investment is underperforming."}, {"url": "https://www.visualcapitalist.com/ranked-the-most-innovative-companies-in-2021/", "page_content": "Ranked: the Top 50 Most Innovative Companies in 2021\n\nThis year has been rife with pandemic-induced changes that have shifted corporate priorities—and yet, innovation has remained a top concern among corporations worldwide.\n\nUsing data from the annual ranking done by Boston Consulting Group (BCG) using a poll of 1,600 global innovation professionals, this graphic ranks the top 50 most innovative companies in 2021.\n\nWe’ll dig into a few of the leading companies, along with their innovative practices, below.\n\nMost Innovative Companies: A Breakdown of the Leaderboard\n\nTo create the top 50 innovative company ranking, BCG uses four variables:\n\nGlobal “Mindshare” : The number of votes from all innovation executives.\n\n: The number of votes from all innovation executives. Industry Peer Review : The number of votes from executives in a company’s industry.\n\n: The number of votes from executives in a company’s industry. Industry Disruption : A diversity index to measure votes across industries.\n\n: A diversity index to measure votes across industries. Value Creation: Total share return.\n\nFor the second year in a row, Apple claims the top spot on this list. Here’s a look at the full ranking for 2021:\n\nCompany Industry HQ Change from 2020 1 Apple Technology 🇺🇸 U.S. -- 2 Alphabet Technology 🇺🇸 U.S. -- 3 Amazon Consumer Goods 🇺🇸 U.S. -- 4 Microsoft Technology 🇺🇸 U.S. -- 5 Tesla Transport & Energy 🇺🇸 U.S. +6 6 Samsung Technology 🇰🇷 South Korea -1 7 IBM Technology 🇺🇸 U.S. +1 8 Huawei Technology 🇨🇳 China -2 9 Sony Consumer Goods 🇯🇵 Japan -- 10 Pfizer Healthcare 🇺🇸 U.S. Return 11 Siemens Technology 🇩🇪 Germany +10 12 LG Electronics Consumer Goods 🇰🇷 South Korea +6 13 Facebook Technology 🇺🇸 U.S. -3 14 Alibaba Consumer Goods 🇨🇳 China -7 15 Oracle Technology 🇺🇸 U.S. +10 16 Dell Technology 🇺🇸 U.S. +4 17 Cisco Systems Technology 🇺🇸 U.S. -5 18 Target Consumer Goods 🇺🇸 U.S. +4 19 HP Inc. Technology 🇺🇸 U.S. -4 20 Johnson & Johnson Healthcare 🇺🇸 U.S. +6 21 Toyota Transport & Energy 🇯🇵 Japan +20 22 Salesforce Technology 🇺🇸 U.S. +13 23 Walmart Consumer Goods 🇺🇸 U.S. -10 24 Nike Consumer Goods 🇺🇸 U.S. -8 25 Lenovo Technology 🇭🇰 Hong Kong SAR Return 26 Tencent Consumer Goods 🇨🇳 China -12 27 Procter & Gamble Consumer Goods 🇺🇸 U.S. +12 28 Coca-Cola Consumer Goods 🇺🇸 U.S. +20 29 Abbott Labs Healthcare 🇺🇸 U.S. New 30 Bosch Transport & Energy 🇩🇪 Germany +3 31 Xiaomi Technology 🇨🇳 China -7 32 Ikea Consumer Goods 🇳🇱 Netherlands Return 33 Fast Retailing Consumer Goods 🇯🇵 Japan Return 34 Adidas Consumer Goods 🇩🇪 Germany Return 35 Merck & Co. Healthcare 🇺🇸 U.S. Return 36 Novartis Healthcare 🇨🇭 Switzerland +11 37 Ebay Consumer Goods 🇺🇸 U.S. Return 38 PepsiCo Consumer Goods 🇺🇸 U.S. Return 39 Hyundai Transport & Energy 🇰🇷 South Korea Return 40 SAP Technology 🇩🇪 Germany -13 41 Inditex Consumer Goods 🇪🇸 Spain Return 42 Moderna Healthcare 🇺🇸 U.S. New 43 Philips Healthcare 🇳🇱 Netherlands -20 44 Disney Media & Telecomms 🇺🇸 U.S. Return 45 Mitsubishi Transport & Energy 🇯🇵 Japan New 46 Comcast Media & Telecomms 🇺🇸 U.S. New 47 GE Transport & Energy 🇺🇸 U.S. Return 48 Roche Healthcare 🇨🇭 Switzerland Return 49 AstraZeneca Healthcare 🇬🇧 UK New 50 Bayer Healthcare 🇩🇪 Germany -12\n\nOne company worth touching on is Pfizer, a returnee from previous years that ranked 10th in this year’s ranking. It’s no surprise that Pfizer made the list, considering its instrumental role in the fight against COVID-19. In partnership with BioNTech, Pfizer produced a COVID-19 vaccine in less than a year. This is impressive considering that, historically, vaccine development could take up to a decade to complete.\n\nPfizer is just one of four COVID-19 vaccine producers to appear on the list this year—Moderna, Johnson & Johnson, and AstraZeneca also made the cut.\n\nMeanwhile, in a completely different industry, Toyota snagged the 21st spot on this year’s list, up 20 places compared to the rankings in the previous year. This massive jump can be signified by the company’s recent $400 million investment into a company set to build flying electric cars.\n\nWhile we often think of R&D and innovation as being synonymous, the former is just one innovation technique that’s helped companies earn a spot on the list. Other companies have innovated in different ways, like streamlining processes to increase efficiency.\n\nFor instance, in 2021, Coca-Cola performed an analysis of their beverage portfolio and ended up cutting their brand list in half, from 400 to 200 global brands. This ability to pare down and pivot could be a reason behind its 20 rank increase from 2020.\n\nInnovation Creates Value\n\nAs this year’s ranking indicates, innovation comes in many forms. But, while there’s no one-size-fits-all approach, there is one fairly consistent innovation trend—the link between innovation and value.\n\nIn fact, according to historical data from BCG, the correlation between value and innovation has grown even stronger over the last two decades.\n\nFor example, in 2020, a portfolio that was theoretically invested in BCG’s most innovative companies would have performed 17% better than the MSCI World Index—which wasn’t the case back in 2005.\n\nAnd yet, despite innovation’s value, many companies can’t reap the benefits that innovation offers because they aren’t ready to scale their innovative practices.\n\nThe Innovation Readiness Gap\n\nBCG uses several metrics to gauge a company’s “innovation readiness,” such as the strength of its talent and culture, its organization ecosystems, and its ability to track performance.\n\nAccording to BCG’s analysis, only 20% of companies surveyed were ready to scale on innovation.\n\nWhat’s holding companies back from reaching their innovation potential? The most significant gap seems to be in what BCG calls innovation practices—things like project management or the ability to execute an idea that’s both efficient and consistent with an overarching strategy.\n\nTo overcome this obstacle, BCG says companies need to foster a “one-team mentality” to increase interdepartmental collaboration and align team incentives, so everyone is working towards the same goal."}, {"url": "https://www2.deloitte.com/ce/en/pages/about-deloitte/topics/technology-fast-50.html", "page_content": "The winners list will be published on the evening of November 23rd, 2023.\n\nApplications must be completed online and are due August 31st, 2023. Don't miss out!\n\nThe Deloitte Technology Fast 50 Central Europe is a Programme that ranks 50 fast-growing technology companies, public or private, based on percentage revenue growth and includes all related industry sectors – communications, environmental technology, fintech, hardware, healthcare and life sciences, media and entertainment, software.\n\nI am confident you will be just as impressed as you read about their achievements.\n\nI am enormously proud that our region is home to so many companies of such great talent, whose rapid growth clearly demonstrates a strength in sales, marketing and other business disciplines that fully complements their technical excellence.\n\nDeloitte Technology Fast 50 CE programme provides a platform and an endorsement for companies – often comparatively young and small – from across our region to showcase exactly how they are working to create a better future.\n\nThe Deloitte Technology Fast 50 Central Europe is a Programme that ranks 50 fast-growing technology companies, public or private, based on percentage revenue growth. Winners are then selected by ranking their revenue growth over the four years from 2018 to 2021.\n\nIn addition to the Technology Fast 50 ranking, Deloitte Central Europe ranks companies that show great potential but are too young to meet criterion for the main Fast 50 category.\n\nThe Impact Stars is a special classification of entities which successfully link great products/services with a positive impact on at least one of the following: society, business, innovativeness, environment and diversity.\n\nThis special recognition by Deloitte and Google Cloud awards companies that have developed high-quality, scalable solutions with the potential to serve the most demanding customers in the market. Joint teams assessed the companies technologies and awarded those with the greatest business potential.\n\nFTMO – winner of the main – Fast 50 category FTMO has developed and runs a unique educational platform for traders in the financial markets, educating them about proper risk-management techniques and motivating them to be disciplined in their operations. Having effectively invented the sector in 2015, today FTMO has around 60 competitors and remains the undisputed market leader. It aims to broaden its offer by creating a sizeable technological holding and enabling clients to invest in multiple assets. Country: Czech Republic CEO Name: Otakar Šuffner & Marek Vašíček Industry sector: Fintech Revenue growth: 25 255% Website: https://ftmo.com/en/\n\nPayPo – 2nd place of the Fast 50 category PayPo is a ‘buy now, pay later’ service provider, founded in 2017 in Warsaw (Poland) with a simple goal in mind - to deliver a smarter shopping experience by providing fast and convenient finance solutions to online consumers. PayPo has developed a flexible, integration-based business model based on a proprietary IT platform, strongly embedded in the e-commerce value chain, bringing significant benefits for all players. Country: Poland CEO Name: Radosław Nawrocki Industry sector: Fintech Revenue growth: 15 904% Website: https://paypo.pl/\n\nMultiplexDX – 3rd place of the Fast 50 category MultiplexDX is an innovative biotech company, created to bring its revolutionary technologies to the market of personalized molecular diagnostics. MultiplexDX IP-based and innovative platform merge histopathology methods, biomarker quantification, visualization, and gene expression with a single-cell resolution by combining MDX proprietary visual and sequencing technologies into one diagnostic test. This cross-validation approach eliminates diagnostic errors and creates 100% precise cancer profiling for each patient, which allows clinicians to suggest specific, personalized cancer treatment. In 2020, as a response to the global pandemic, MultiplexDX teamed up with Slovak and developed the first Slovak IVD-certified diagnostic PCR test for the detection of SARS-CoV-2. In 2022, MultiplexDX invested significant resources from the COVID-19 pandemic’s sales to improve its research infrastructure, accelerate personalized cancer diagnostics and finalize pre-clinical validation. Country: Slovakia CEO Name: Pavol Čekan Industry sector: Healthcare & Life Sciences Revenue growth: 6 222% Website: www.multiplexdx.com\n\nDIANA Biotechnologies – winner of the Companies to Watch category DIANA (DNA-linked Inhibitor ANtibody Assay) is a leading and highly innovative Czech biotech company that develops products based on cutting-edge research in molecular diagnostics and drug discovery. During the pandemic, it developed one of the world’s most innovative COVID-19 tests and became the biggest Czech manufacturer of RT-PCR tests. Today, with close to 100 employees, it has the scale and ambition to run ambitious long-term projects. Country: Czech Republic CEO Name: Václav Navrátil & Martin Dienstbier Industry sector: Healthcare & Life Sciences Revenue growth: 100 314% Website: https://www.dianabiotech.com/\n\nPayhawk – 2nd place of the Companies to Watch category Payhawk has developed a payments platform enabling businesses to combine all their spending processes in one place, putting finance teams in full control while allowing employees access to secure and convenient spending methods. Country: Bulgaria CEO Name: Hristo Borisov Industry sector: Fintech Revenue growth: 6 629% Website: https://payhawk.com\n\nFUMBI NETWORK – 3rd place of the Companies to Watch category FUMBI NETWORK makes it simple and convenient to create a cryptocurrency investment portfolio for both individual and business clients. A user-friendly platform, security of funds, access to current information on cryptocurrencies and advanced algorithms are the key to the company's success. Country: Slovakia CEO Name: Juraj Forgács Industry sector: Fintech Revenue growth: 6 055% Website: https://fumbi.network/en/\n\nAutenti – winner of the CE Tech Rocketship! category Autenti has created and brought to market a solution enabling every entrepreneur to sign legally-binding documents online – securely, in just one click, 24/7, at home, at work or on the go. The platform uniquely combines electronic signature and innovative technology within a legal environment based on European and national regulation. Today, with the company poised to accelerate its international expansion, the Autenti platform has already enabled the e-signature of more than 4.5 million documents. Country: Poland CEO Name: Grzegorz Wójcik Industry sector: Fintech Website: https://autenti.com/pl/\n\nFast 50 The main Deloitte Technology Fast 50 Central Europe category ranks 50 fast growing technology companies, public or private, based on percentage revenue growth over four years.In order to be eligible for the Technology Fast 50 Central Europe Programme companies must: 1. Be in business a minimum of 4 years - founded on or prior to December 31st, 2018. 2. Own proprietary intellectual property or proprietary technology, sold to customers in products that contribute to a majority of the company’s operating revenues.\n\n\n\n• Own proprietary technology that contributes to a significant portion of the company’s operating revenues.\n\n• Manufacture a technology related product.\n\n• Devote a significant proportion of operating revenues to research and development of technology.\n\n• Be technology intensive or use unique technology to solve problems. 3. Have base-year operating revenues of €50,000 in 2019, 2020, 2021 and a current year operating revenue (2022) of at least €100,000. 4. Be headquartered within Central Europe.* * The CE Fast 50 Programme is open to companies with headquarters based in the following countries: Estonia, Latvia, Lithuania, Poland, the Czech Republic, Slovakia, Hungary, Romania, Bulgaria, Croatia, Bosnia and Herzegovina, Slovenia, Serbia, Montenegro, North Macedonia, Moldova, Albania and Kosovo.\n\nCompanies to Watch This Technology Fast 50 Central Europe subcategory recognizes companies that are too young to be listed in Fast 50, but are growing rapidly. Companies to Watch must: 1. Be in business a minimum of 3 years - founded on or prior to December 31st, 2019.* 2.Own proprietary intellectual property or proprietary technology, sold to customers in products that contribute to a majority of the company’s operating revenues.\n\n\n\n• Own proprietary technology that contributes to a significant portion of the company’s operating revenues.\n\n• Manufacture a technology related product.\n\n• Devote a significant proportion of operating revenues to research and development of technology.\n\n• Be technology intensive, or use unique technology to solve problems. 3. Have base-year operating revenues of minimum €10,000 (2020) and current year operating revenue of minimum €30,000 (2022). 4. Be headquartered within Central Europe.** *In justified cases, we accept companies founded between January 1 – 3, 2020. **The CE Fast 50 Programme is open to companies with headquarters based in the following countries: Estonia, Latvia, Lithuania, Poland, the Czech Republic, Slovakia, Hungary, Romania, Bulgaria, Croatia, Bosnia and Herzegovina, Slovenia, Serbia, Montenegro, North Macedonia, Moldova, Albania and Kosovo.\n\nImpact Stars The Impact Stars is a special classification of entities which successfully link great products/services with a positive impact on at least one of the following: society, business, innovativeness, environment and diversity. Those interested in applying for the Impact Stars category must: 1. Sell a product and/or a service that makes an impact in the following fields:\n\n\n\n• Impact on the business, environment and society.\n\n• Diversity – amongst employees and/or management staff.\n\n• Unique assets and/or services development.\n\n2. Be headquartered within Central Europe* * The CE Fast 50 Programme is open to companies with headquarters based in the following countries: Estonia, Latvia, Lithuania, Poland, the Czech Republic, Slovakia, Hungary, Romania, Bulgaria, Croatia, Bosnia and Herzegovina, Slovenia, Serbia, Montenegro, North Macedonia, Moldova, Albania and Kosovo."}, {"url": "https://explodingtopics.com/blog/tech-startups", "page_content": "You may also like:\n\nThis is a list of 50 technology startups with signs of significant growth.\n\nAlmost every industry has created a subset of companies with a tech component.\n\nAgTech, HealthTech, FinTech, and InsurTech are just some examples of this phenomenon.\n\nAccording to CBRE, tech companies tracked by this database raised an impressive $212.5B in VC funding in 2021.\n\nThe tech sector is the most heavily invested industry and made up 77% of VC funding in 2021\n\nWith that, here are 50 emerging startups that are making a big impact on the tech space.\n\n1. GoMechanic\n\n5-year search growth: 5100%\n\nSearch growth status: Regular\n\nYear founded: 2016\n\nLocation: Haryana, India\n\nFunding: $54.8M (Series C)\n\nWhat they do: GoMechanic is an online car servicing platform operating in India. All cars go through the online platform that people use to book appointments, get price quotes and more. The startup services more than two million cars annually.\n\n2. Rytr\n\n5-year search growth: 9800%\n\nSearch growth status: Exploding\n\nYear founded: 2021\n\nLocation: Wilmington, Delaware\n\nFunding: Undisclosed\n\nWhat they do: Rytr is an AI-powered writing tool that helps users generate high-quality content quickly and easily. With Rytr, users can generate content for a variety of purposes, including blog posts, social media posts, product descriptions, and more, by simply providing some basic information and letting the AI take care of the rest.\n\n3. Niyo\n\n5-year search growth: 247%\n\nSearch growth status: Exploding\n\nYear founded: 2015\n\nLocation: Bengaluru, India\n\nFunding: $164.3M (Series C)\n\nWhat they do: Self-named “India’s leading FinTech company”, Niyo provides an array of digital banking solutions. Digital savings accounts and wealth management are their most popular services but the startup also offers travel cards, lending as well as insurance products. With over 4 million users so far, Niyo is aiming to reach 30 million users by the end of 2026.\n\n4. Lake Parime\n\n5-year search growth: 700%\n\nSearch growth status: Regular\n\nYear founded: 2019\n\nLocation: London, England\n\nFunding: $14.6M (Early Stage VC)\n\nWhat they do: Lake Parime operates a sustainable computing infrastructure designed for decentralized projects. Their flagship product, a portable data center powered by sustainable energy, supplies blockchain, ML and AI solutions with sustainable energy, minimizing their environmental impact.\n\n5. VineHealth\n\n5-year search growth: 100%\n\nSearch growth status: Regular\n\nYear founded: 2018\n\nLocation: London, England\n\nFunding: $8.5M (Seed)\n\nWhat they do: VineHealth is a digital health platform for cancer patients. Their platform allows patients to input symptoms and medication information. Then, through the usage of AI, it develops health reports showing the patient’s current health activity. VineHealth’s app has been downloaded over 15,000 times on iOS and Android devices.\n\n6. Holo-Light\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2015\n\nLocation: Bayern, Germany\n\nFunding: $12.3M (Series A)\n\nWhat they do: According to Holo-Light, they provide a “business-ready industrial metaverse solution.” Basically, they’ve developed an SDK that can render AR and VR projects. And, using cloud technology, these renders can be shared to allow people to work together on these projects. Holo-Light’s solutions are currently used by over 100 organizations, including major companies like BMW, T-Mobile, P&G and more.\n\n7. Dataships\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2019\n\nLocation: Dublin, Ireland\n\nFunding: $3.3M (Seed)\n\nWhat they do: Dataships is a data privacy compliance service. More specifically, the startup has built software that automatically manages databases to guarantee compliance with various data laws. The Dublin-based startup currently has over 70 customers.\n\n8. Nuanced Health\n\n5-year search growth: 66%\n\nSearch growth status: Exploding\n\nYear founded: 2020\n\nLocation: Los Angeles, California\n\nFunding: Undisclosed (Series Unknown)\n\nWhat they do: Nuanced Health is a biotech company that incorporates biological diversity into the therapeutic drug discovery pipeline. This allows researchers to study how drugs respond to various biological compositions and thus, develop personalized drugs and therapies.\n\n9. 6AM City\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2016\n\nLocation: Greenville, South Carolina\n\nFunding: $8.8M (Series A)\n\nWhat they do: 6AM City is a publishing technology company. Operating as a newsletter-first local news service, they aggregate, curate and condense various information on multiple cities across the US. All this information is then sent daily to their subscribers’ emails. The startup raised $5M in funding in late 2021 and, according to the founder, this money will help them grow approximately 300% in 2022.\n\n10. Alaiko\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2020\n\nLocation: Munich, Germany\n\nFunding: $30M (Series A)\n\nWhat they do: Alaiko delivers a logistics-as-a-service solution that enables online stores to automate their fulfillment processes. Alaiko provides warehouses, software, packing and delivering solutions. This, according to the startup, allows them to guarantee next-day delivery and shipping accuracy. Over 150 online brands use Alaiko’s services.\n\n11. Clemap\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2017\n\nLocation: Zurich, Switzerland\n\nFunding: Undisclosed (Seed)\n\nWhat they do: With rising energy prices, monitoring energy consumption levels is becoming more important for both individuals and enterprises. And this is where Clemap comes into the conversation. The startup provides smart energy measuring devices that show a detailed report of how much energy somebody consumes (and how that energy is being consumed). Their devices are labeled as an “Efficient Solution” after achieving 100% on their assessment by Solar Impulse.\n\n12. Flowy\n\n5-year search growth: 17%\n\nSearch growth status: Regular\n\nYear founded: 2017\n\nLocation: Kosice, Slovakia\n\nFunding: $5.5M (Early Stage VC)\n\nWhat they do: Flowy is a cash registry software. The company tries to differentiate themselves through two main features: cloud and AI. A cloud-based software lets businesses access their registry from any device. Whereas AI capabilities help stores conduct inventory analysis and come up with sales forecasts. The startup is looking to close a $5M funding round by the end of 2023.\n\n13. ID Ward\n\n5-year search growth: 60%\n\nSearch growth status: Regular\n\nYear founded: 2017\n\nLocation: London, England\n\nFunding: $1.1M (Seed)\n\nWhat they do: ID Ward is a data privacy startup. Their patent-pending solution, which utilizes blockchain technology, allows digital marketers to accurately target (and retarget) the right audience without collecting cookies and storing consumer data. The startup is in the process of closing a $5M funding round by the end of 2022.\n\n14. Inclusive Energy\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2017\n\nLocation: London, England\n\nFunding: $3.3M (Seed)\n\nWhat they do: Inclusive Energy is a manufacturer of energy monitoring devices. They currently have two products, the Cloud Solar and the Smart Biogas. The Cloud Solar monitors solar systems and enables businesses to provide a Solar-as-a-Service solution. Whereas the Smart Biogas provides performance monitoring for biogas systems. Inclusive Energy, currently serving 79 organizations, has already shipped over 2,700 devices.\n\n15. Koniku\n\n5-year search growth: 127%\n\nSearch growth status: Exploding\n\nYear founded: 2015\n\nLocation: San Rafael, California\n\nFunding: $49.2M (Series A)\n\nWhat they do: Koniku has created a neurocomputation platform that can interact with odor. Essentially, the startup has built a technology that allows a computer to smell. Their current product, called the KoniKore, is capable of sniffing bombs as well as detecting diseases.\n\n16. LawVu\n\n5-year search growth: 2000%\n\nSearch growth status: Exploding\n\nYear founded: 2015\n\nLocation: Gisborne, New Zealand\n\nFunding: $32.1M (Series A)\n\nWhat they do: LawVu is a cloud-based software designed for in-house legal teams. It is a platform that legal teams can use to communicate, schedule, access documents and more. Basically, “LawVu is to legal teams what Salesforce is to sales teams.” The startup reportedly tripled their revenue in 2020 and 2021.\n\n17. Probando\n\n5-year search growth: 5%\n\nSearch growth status: Regular\n\nYear founded: 2020\n\nLocation: Graz, Austria\n\nFunding: Undisclosed (Seed)\n\nWhat they do: Probando is an online platform that lets medical organizations recruit participants for their medical research. Participants sign up for free and are paid to take part in various research studies. Over 20,000 people are currently signed up as participants on the platform.\n\n18. Qerko\n\n5-year search growth: 1700%\n\nSearch growth status: Exploding\n\nYear founded: 2019\n\nLocation: Prague, Czech Republic\n\nFunding: $2.6M (Early Stage VC)\n\nWhat they do: Qerko is a contactless payment platform for restaurants. Customers scan a QR code on their table and this takes them to a payment platform. There, they can pay for the entire meal or they can split the bill so that each individual pays for what they order. This way, Qerko helps restaurants increase the efficiency of their billing process. Following a successful launch in the Czech Republic, the startup is now eyeing up international expansion into the EU and US markets.\n\n19. Tiba\n\n5-year search growth: 91%\n\nSearch growth status: Exploding\n\nYear founded: 2021\n\nLocation: Sao Paulo, Brazil\n\nFunding: $4M (Seed)\n\nWhat they do: Tiba is a business management SaaS. It enables SMBs to handle their accounting, payroll, sales and inventory online. According to Tiba, “their solution is built specifically for Brazilian entrepreneurs and thus, helps them overcome daily business management challenges.”\n\n20. Vero Technologies\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2020\n\nLocation: New York, New York\n\nFunding: $4.1M (Seed)\n\nWhat they do: Vero has built a lending-as-a-service software that helps banks and credit unions increase their product offering. The software supports funding, risk management, portfolio management and underwriting capabilities. The $20M-valued startup is looking to close another funding round by the end of Q1 of 2023.\n\n21. 3DLOOK\n\n5-year search growth: 1300%\n\nSearch growth status: Exploding\n\nYear founded: 2016\n\nLocation: San Mateo, California\n\nFunding: $14.7M (Series A)\n\nWhat they do: 42% of customers cite fit and size as the main reason they return a piece of clothing they bought online. 3DLOOK is aiming to solve this problem by bringing a new meaning to “a personalized shopping experience.” The startup has developed an AI-powered virtual fitting room. Basically, the product measures an individual’s body measurements and shape. Then, based on this information, it lets people buy clothes that fit best with their body type.\n\n22. Rocket Dollar\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2018\n\nLocation: Austin, Texas\n\nFunding: $13.5M (Series A)\n\nWhat they do: Rocket Dollar is a self-directed retirement platform enabling individuals to invest in alternative investments. Specifically, people use the platform to invest in startups, rental properties, cryptocurrencies and more. The Austin-based company has already topped $650M in invested assets. This growth has allowed them to hit $1.5M in revenue in 2021.\n\n23. Brinter\n\n5-year search growth: 150%\n\nSearch growth status: Regular\n\nYear founded: 2020\n\nLocation: Turku, Finland\n\nFunding: $1.3M (Seed)\n\nWhat they do: Britner offers 3D bioprinting technology designed to assist in discovering new drugs and understanding diseases. It started as a bootstrapped company and is now present in 10 countries. According to Pitchbook, Brinter is looking to close a $5M funding round in 2022.\n\n24. Cerecin\n\n5-year search growth: 500%\n\nSearch growth status: Exploding\n\nYear founded: 2001\n\nLocation: Denver, Colorado\n\nFunding: $77.3M (Series B)\n\nWhat they do: Cerecin develops therapeutics to treat various neurological conditions (like memory impairment.) The company specializes in lipid science and uses this method to test the potential benefits of lab-made fats. Cerecin raised an oversubscribed funding round of $40M back in December of 2021.\n\n25. Dendra Systems\n\n5-year search growth: 500%\n\nSearch growth status: Regular\n\nYear founded: 2014\n\nLocation: Oxford. England\n\nFunding: $15.7M (Series A)\n\nWhat they do: Dendra develops environmental technologies to support at-scale reforestation. One of their solutions involves using AI and high-resolution data capture to map degraded pieces of land and develop restoration plans. The startup raised a $10M funding round to help them develop and expand their fleet of aerial seeding drones that can sow approximately 150x faster than manual labor.\n\n26. Enzo\n\n5-year search growth: 203%\n\nSearch growth status: Exploding\n\nYear founded: 2021\n\nLocation: Heidelberg, Germany\n\nFunding: Undisclosed (Pre-Seed)\n\nWhat they do: Enzo is an insurance service startup using IoT data to assess and optimize the loss ratio on house insurance policies. The startup is looking to grow its employee count 3x by the end of this year.\n\n27. LEDCity\n\n5-year search growth: 150%\n\nSearch growth status: Exploding\n\nYear founded: 2017\n\nLocation: Zurich, Switzerland\n\nFunding: $2M (Seed)\n\nWhat they do: LEDCity has built an intelligent lighting system that helps reduce energy consumption. The system can automatically adjust the intensity of the light depending on the time of the day and the number of people present in a specific space. According to the startup, their solution helps companies reduce their lighting costs by up to 90%.\n\n28. WriteSonic\n\n5-year search growth: 99X+\n\nSearch growth status: Exploding\n\nYear founded: 2021\n\nLocation: San Francisco, California\n\nFunding: $2.6M (Seed)\n\nWhat they do: WriteSonic is an AI-powered copywriting tool that generates high-quality content for businesses and individuals. By analyzing the user's inputs and desired outcomes, WriteSonic produces text for a wide range of purposes, including website copy, marketing emails, and social media posts, among others. Its intuitive interface and customizable features make it an ideal solution for those seeking to streamline their content creation process.\n\n29. Lumeda\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2019\n\nLocation: Rocky Hill, Connecticut\n\nFunding: $7.4M (Series A)\n\nWhat they do: Lumeda, a MedTech company, has developed a device that makes it possible to apply Photodynamic Therapy as a lung cancer treatment. The $13M-valued startup is expecting to finish clinical studies of their device by the end of this year.\n\n30. Matidor\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2018\n\nLocation: Vancouver, Canada\n\nFunding: $1.9M (Seed)\n\nWhat they do: Matador is a project management platform for field services. Companies can use the platform to keep track of their tasks, budgets, GIS, forms, files and more. The startup made a name for themselves when they were announced as part of Y Combinator’s batch of 2021 startups. This helped them raise funding used for further product development and employee headcount increase.\n\n31. AnyFans\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2021\n\nLocation: Lake Havasu, Arizona\n\nFunding: $500K (Seed)\n\nWhat they do: Similarly to the popular OnlyFans, AnyFans is a social media platform where content creators can build engaging communities. But AnyFans’ focus is to provide a “safe, positive social media experience,” which also helps users combat their mental fatigue from traditional social media. The startup recently launched a crowdfunding campaign that raised $100K within 24 hours of launch.\n\n32. Sensei Labs\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2018\n\nLocation: Toronto, Canada\n\nFunding: $6.5M (Series A)\n\nWhat they do: Sensei Labs has developed a set of collaborative workplace management solutions. The startup’s flagship products, Conductor and Catalyst, are award-winning platforms currently used by companies in over 50 countries worldwide.\n\n33. SightGain\n\n5-year search growth: 500%\n\nSearch growth status: Exploding\n\nYear founded: 2016\n\nLocation: Fulton, Maryland\n\nFunding: $1.8M (Seed)\n\nWhat they do: SightGain’s software helps cybersecurity teams assess cyber risk and improve security performance. It does this by utilizing real-world attack simulations to test the readiness of current cybersecurity systems in place. SightGain brought in approximately $2.9M in 2021, this represented a 33% YoY increase over 2020.\n\n34. Sol-IT\n\n5-year search growth: 53%\n\nSearch growth status: Exploding\n\nYear founded: 2018\n\nLocation: Utrecht, Netherlands\n\nFunding: Undisclosed\n\nWhat they do: Sol-IT develops SaaS solutions for various industries. Their most recent project, Laura.app, collects business performance data and uses AI to build forecasts and develop other operational insights. The startup saw a modest growth of 4.39% in 2021.\n\n35. Wirex\n\n5-year search growth: 26%\n\nSearch growth status: Regular\n\nYear founded: 2014\n\nLocation: London, England\n\nFunding: $27.8M (Series B)\n\nWhat they do: Wirex, formerly known as E-Coin, brings the FinTech concept to cryptocurrencies. They have built a platform that lets users buy, store, trade, earn and spend digital assets. Their base of 4.5 million users has helped Wirex surpass over $3B worth of transactions.\n\n36. A:head Bio\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2018\n\nLocation: Vienna, Austria\n\nFunding: $4.2M (Seed)\n\nWhat they do: A:head Bio is a BioTech company developing therapeutics for the treatment of brain disorders. The Vienna-based startup’s method of discovery involves understanding human cerebral organoids and their impact on our brain. A:head is currently valued at approximately $3.77M.\n\n37. Airforestry\n\n5-year search growth: 100%\n\nSearch growth status: Regular\n\nYear founded: 2020\n\nLocation: Uppsala, Sweden\n\nFunding: $192K (Pre-Seed)\n\nWhat they do: Airforestry has developed a more sustainable forest management technology. Specifically, the platform has built an airborne tree thinning system. They use fully electric drones that thin trees from the air and thus, protect the ground and surrounding trees from damage.\n\n38. Airgram\n\n5-year search growth: 2400%\n\nSearch growth status: Exploding\n\nYear founded: 2020\n\nLocation: Wilmington, Delaware\n\nFunding: $10M (Series A)\n\nWhat they do: Airgram saw an opportunity when people started to move towards online meetings. Specifically, the startup recognized that there was a lack of meeting facilitator software that works with popular online meeting platforms. This is why Airgram created an AI-powered software that allows users to transcribe, record and use collaborative notes in an online meeting. The software can be integrated into the three major video conferencing platforms (Zoom, GMeets and MS Teams).\n\n39. Fitforce\n\n5-year search growth: 400%\n\nSearch growth status: Regular\n\nYear founded: 2019\n\nLocation: Bangkok, Thailand\n\nFunding: $250K (Early Stage VC)\n\nWhat they do: Fitforce is one of =many startups with a fitness app. But what makes Fitforce different is that they have taken a gamification approach to this idea. Basically, the startup has built a fitness platform that uses a smartphone’s motion-detecting capabilities to track user movement. This is then integrated into a video game that lets people exercise while executing various game-like tasks.\n\n40. Kaido Group\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2015\n\nLocation: Birmingham, England\n\nFunding: $540K (Seed)\n\nWhat they do: 90% of employers say they are investing more in their workers’ well-being. And startups like Kaido are looking to capitalize on this growth. Specifically, their platform delivers team-building services to support remote and hybrid teams. Although Kaido initially targeted in-person enterprises, it has recently switched their strategy to target hybrid and remote companies. And this has paid off because according to the company, this change in strategy has resulted in a 420% increase in the number of users.\n\n41. Matrixport\n\n5-year search growth: 2200%\n\nSearch growth status: Peaked\n\nYear founded: 2019\n\nLocation: Singapore, Singapore\n\nFunding: $100M (Series C)\n\nWhat they do: Matrixport has built an all-in-one crypto financial platform that enables users to trade, sell, earn, invest and borrow cryptocurrencies. The startup has witnessed impressive growth and currently facilitates around $5B in monthly trading volume. This growth was followed by a $100M funding round that made Matrixport one of the newest unicorns in the crypto space.\n\n42. Moduit\n\n5-year search growth: 1200%\n\nSearch growth status: Exploding\n\nYear founded: 2018\n\nLocation: Jakarta, Indonesia\n\nFunding: $4.2M (Seed)\n\nWhat they do: The explosive growth of FinTech in the US is now catching on in other countries. And Moduit is a startup bringing FinTech solutions to the Indonesian market. The startup has developed a platform that combines AI and data to provide streamlined investment management strategies to their clients. Seven investors participated in Moduit’s seed funding round.\n\n43. thatDot\n\n5-year search growth: 1300%\n\nSearch growth status: Exploding\n\nYear founded: 2019\n\nLocation: Portland, Oregon\n\nFunding: $2.1M (Seed)\n\nWhat they do: Big data is forecasted to be a $236B market by 2026. thatDot, looking to capitalize on this opportunity, has developed an AI-based platform that enables companies to analyze high-volume data and recognize complex patterns in less time. This product can analyze up to 1 million events per second.\n\n44. Parkn’sleep\n\n5-year search growth: 200%\n\nSearch growth status: Regular\n\nYear founded: 2021\n\nLocation: Luzern, Switzerland\n\nFunding: Undisclosed\n\nWhat they do: Parkn’sleep is a parking app for campers. It lets campers check the availability at different campsites and drive without prior reservation. Furthermore, campers can pay their parking fees directly in the app as soon as they check in. The platform is currently used by over 18,800 campers across 5 countries in Europe.\n\n45. Niflr\n\n5-year search growth: -100%\n\nSearch growth status: Peaked\n\nYear founded: 2017\n\nLocation: Bangalore, India\n\nFunding: Undisclosed\n\nWhat they do: 50% of the time people spend in a store is wasted either looking for a product or waiting to check out. Niflr has developed technologies that aim to reduce this number through the usage of virtual in-store assistants as well as the implementation of autonomous checkout systems. The startup has already installed over 50,000 autonomous checkout stations across stores in India. Niflr doubled their annual revenue in 2021 when it hit approximately $1.95M in sales.\n\n46. Agatsa\n\n5-year search growth: 0%\n\nSearch growth status: Peaked\n\nYear founded: 2010\n\nLocation: Noida, India\n\nFunding: $6.2M (Corporate Round)\n\nWhat they do: Agatsa has developed a heart monitoring device that keeps track of various health metrics. The device is linked to an application where doctors can view their patient’s health remotely. Their solution is used by over 6,000 doctors.\n\n47. Simango\n\n5-year search growth: 400%\n\nSearch growth status: Regular\n\nYear founded: 2018\n\nLocation: Rennes, France\n\nFunding: Undisclosed\n\nWhat they do: The Pitchbook database considers VR Health an emerging space currently seeing rapid growth. Simango is what you get when you combine VR, EdTech and HealthTech in that it provides a VR-based health training platform designed to train hospital staff. The platform has already been used to train over 10,000 health professionals.\n\n48. Skyfri\n\n5-year search growth: 500%\n\nSearch growth status: Regular\n\nYear founded: 2021\n\nLocation: Oslo, Norway\n\nFunding: $11.5M (Convertible Note)\n\nWhat they do: Skyfri is a SaaS solution for solar energy players. The software, using AI and IoT technology, enables companies to automate operations and asset maintenance. Although still in its second year of operations, Skyfri has already seen a rapid growth rate which saw them expand to over 100 employees across three continents.\n\n49. OfBusiness\n\n5-year search growth: 233%\n\nSearch growth status: Exploding\n\nYear founded: 2015\n\nLocation: Gurgaon, India\n\nFunding: $878.1M (Series G)\n\nWhat they do: OfBusiness is an online platform that facilitates the procurement of raw materials, with a focus on the manufacturing and industrial sectors. The platform is currently used by over 700,000 SMEs. OfBusiness saw a very interesting year in terms of its value in 2021. The company’s value increased multiple times, growing from around $400M in April to over $5B by the end of the year.\n\n50. Wyden\n\n5-year search growth: 112%\n\nSearch growth status: Exploding\n\nYear founded: 2014\n\nLocation: Zurich, Switzerland\n\nFunding: $11.9M (Series B)\n\nWhat they do: As the name suggests, AlgoTrader has built an algorithm-powered trading technology for digital assets. The startup delivers the trading infrastructure to crypto exchanges like Binance, FTX and Coinbase.\n\nConclusion\n\nThis concludes our list of growing tech startups.\n\nFrom medical devices to crypto trading platforms, the tech space represents a massive opportunity for startups.\n\nMore importantly, this list also highlights the fact that tech touches nearly every aspect of our daily lives. And seeing the rapid rate at which technological breakthroughs are happening, one can only wonder how intertwined our daily lives and tech will become in the future."}, {"url": "https://2020.stateofeuropeantech.com/chapter/investments/article/investments-geo-industry/", "page_content": "I'm looking at areas that benefit from community-based healthcare. Broadly, this includes chronic diseases, long-term diseases, and under resourced areas like menstrual and mental health. These are areas where public healthcare has limited budget and resources and where private healthcare can often be prohibitively expensive. In addition, even if you do receive healthcare for it, there's a social and community component that is lacking which can be highly value add from the perspective of knowledge transfer, mental well-being and peer support. We've already made one investment in this space, Second Nature, and I'm looking for more.\n\n\n\nFor Europe to create more health tech breakout success stories, one of two things is required: pan-European plays or companies that can successfully grow their business in the US. Both have their issues. Each country in Europe has a different national healthcare system and different cultural attitudes towards healthcare, so while in aggregate it's a compelling market, scaling across Europe is very challenging. The US on the other hand has a large market with a very different, profit driven attitude towards healthcare, but the healthcare system, payment coverage and attitudes towards healthcare are quite different from the most of the world, which makes it a daunting market to conquer."}, {"url": "https://www2.deloitte.com/ce/en/pages/about-deloitte/articles/2022-fast-50-edition.html", "page_content": "Impact Stars\n\nThe Impact Stars is a special classification of entities which successfully link great products/services with a positive impact on at least one of the following: society, business, innovativeness, environment and diversity.\n\n\n\nImpact Stars – Special award criterias\n\nThe Impact Stars (IS) is a special category which recognizes a company which successfully links great products/services with a positive impact on at least one of the following: society, business, innovativeness, environment and diversity.\n\nImpact Stars must:"}, {"url": "https://www.calcalistech.com/ctech/articles/0,7340,L-3901410,00.html", "page_content": "R&D Partnership Big-Tech 50, which was listed on the Tel Aviv Stock Exchange in February , is carrying on its strategy of investing in mature startups, with its Thursday announcement of three new investments in Israeli unicorns.\n\nAmong the three companies Big-Tech 50 invested in, is content recommendation platform Outbrain, in which it purchased $1.5 million worth of shares. Last week, it announced a $500,000 investment in Sisense.\n\nBig-Tech 50 CEO Yochai Zeid. Photo: Tal Cohen\n\nThe two other companies are Trax and Kenshoo. Trax was founded 10 years ago and has raised a total of $387 million. Trax’s image processing and machine learning-based solution identifies products at the point of sale and offers clients detailed product and category information including out-of-shelf, share of shelf, pricing, and promotional compliance insights. The Big Tech 50 Partnership invested $2 million in the company.\n\nKenshoo was founded 15 years ago and has raised $60 million to date, most recently in a $30 million round in 2014. The system developed by Kenshoo assists executives and marketing and sales managers to allocate overall advertising budgets and advertising campaigns online, while predicting the return on the investment. Marketing managers can, among other things, calculate where to invest their advertising budgets and what return they will receive, broken down to quarters, geography, and sectors even before they have launched their campaign. The Big Tech 50 Partnership invested $2 million in Kenshoo too.\n\nBig Tech 50, which raised about NIS 85 million ($26 million) on the Tel Aviv Stock Exchange in February has so far invested $11 million, roughly 40% of what it raised, to purchase shares in eight companies. Since its listing, its stock price has climbed by 33%.\n\nThe partnership plans to create an index of the 50 biggest privately-held technology companies in Israel and enable investment in them, while they are still in their pre-IPO phase or before they are sold to giant multinationals.\n\nThe target companies will be chosen according to the following criteria: the value of the company at the time of investment should be at least $250 million; the company would have been founded more than three years ago; at least one venture capital fund would have invested in the company; the company produces annual recurring revenue (ARR) of at least $10 million and has reported growth for the past three years; and the average rate of annual growth of the company's value should meet the criteria of over 30% per year, far above any other tradable technology index."}, {"url": "https://www.beauhurst.com/blog/top-tech-startups/", "page_content": "Despite taking on the double incursion of Brexit and the COVID-19 pandemic, the United Kingdom (specifically London) remains a top startup hub and the best tech ecosystem in Europe. The UK has a particularly large number of high-growth SaaS or software-as-a-service businesses (3,417), as well as those operating in fintech (1,163) and artificial intelligence (1,299).\n\nIn London especially, startups have access to leading venture capital funds, alongside some of the most active angel investors in the world. Tech entrepreneurs in the UK also benefit from an excellent network of accelerator programmes and grant schemes aimed at small businesses.\n\nIndeed, the UK offers an early-stage ecosystem that gives even Silicon Valley a run for its money. So which UK tech startups should you be watching this year? Read on to find out."}, {"url": "https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/", "page_content": "Strategy and business building for the data-driven economy:\n\nThe best of the best: the portal for top lists & rankings:\n\nGet quick analyses with our professional research service\n\nDirectly accessible data for 170 industries from 50 countries and over 1 million facts:\n\nDetailed information for 35,000+ online stores and marketplaces\n\nBusiness information on 70m+ public and private companies\n\nInsights on consumer attitudes and behavior worldwide\n\nMarket forecast and expert KPIs for 1000+ markets in 190+ countries & territories\n\nAll key figures about countries and regions\n\nDetailed information about political and social topics\n\nConsumer and brand insights and preferences in various industries\n\nKey figures and rankings about companies and products\n\nIndustry and market insights and forecasts\n\nOverview and forecasts on trending topics\n\nNumber of apps available in leading app stores Q3 2022\n\nQuarterly smartphone market share worldwide by vendor 2009-2023\n\nFacebook: quarterly number of MAU (monthly active users) worldwide 2008-2023\n\nPlease create an employee account to be able to mark statistics as favorites. Then you can access your favorite statistics via the star in the header. Register now\n\nCurrently, you are using a shared account. To use individual functions (e.g., mark statistics as favourites, set statistic alerts) please log in with your personal account. If you are an admin, please authenticate by logging in again. Login\n\nTo download this statistic in XLS format you need a Statista Account\n\nTo download this statistic in PNG format you need a Statista Account\n\nTo download this statistic in PDF format you need a Statista Account\n\nAs a Premium user you get access to the detailed source references and background information about this statistic.\n\nAs a Premium user you get access to background information and details about the release of this statistic.\n\nAs soon as this statistic is updated, you will immediately be notified via e-mail.\n\n… to incorporate the statistic into your presentation at any time.\n\nYou need at least a Starter Account to use this feature.\n\nStatista Accounts: Access All Statistics. Starting from $588 USD / Year\n\nBasic Account Get to know the platform You only have access to basic statistics.\n\nThis statistic is not included in your account. Starter Account The ideal entry-level account for individual users Instant access to 1m statistics\n\nto 1m statistics Download in XLS, PDF & PNG format\n\nin XLS, PDF & PNG format Detailed references $69 USD $49 USD / Month * in the first 12 months Professional Account Full access Business Solutions including all features. * Prices do not include sales tax.\n\nStatista Accounts: Access All Statistics. Starting from $588 USD / Year Learn more about how Statista can support your business. Request webinar\n\nNasdaq. (June 21, 2021). Ranking of the companies with the highest spending on research and development worldwide in 2020 (in billion U.S. dollars) [Graph]. In Statista . Retrieved June 09, 2023, from https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/\n\nNasdaq. \"Ranking of the companies with the highest spending on research and development worldwide in 2020 (in billion U.S. dollars).\" Chart. June 21, 2021. Statista. Accessed June 09, 2023. https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/\n\nNasdaq. (2021). Ranking of the companies with the highest spending on research and development worldwide in 2020 (in billion U.S. dollars) . Statista . Statista Inc.. Accessed: June 09, 2023. https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/\n\nNasdaq. \"Ranking of The Companies with The Highest Spending on Research and Development Worldwide in 2020 (in Billion U.S. Dollars).\" Statista , Statista Inc., 21 Jun 2021, https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/\n\nNasdaq, Ranking of the companies with the highest spending on research and development worldwide in 2020 (in billion U.S. dollars) Statista, https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/ (last visited June 09, 2023)\n\nRanking of the companies with the highest spending on research and development worldwide in 2020 (in billion U.S. dollars) [Graph], Nasdaq, June 21, 2021. [Online]. Available: https://www.statista.com/statistics/265645/ranking-of-the-20-companies-with-the-highest-spending-on-research-and-development/"}, {"url": "https://www.businessinsider.com/running-list-softbank-investments-2017-7", "page_content": "Morning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\n\nJapanese tech giant SoftBank has billions of dollars at its disposal to fund and acquire high-profile companies.\n\nThe massive corporation — led by Masayoshi Son, Japan's richest man — makes investments through the SoftBank Group and its $100 billion SoftBank Vision Fund.\n\nSoftBank has backed or bought a long list of established tech firms such as Nvidia, Slack, Uber, and ARM. It's also backed less well-known startups, like satellite internet firm OneWeb, Indian ecommerce company Paytm, and farming startup Plenty. Most of the money has gone to companies in Europe, Asia, and North America.\n\nSoftBank is raising a follow-up Vision Fund II, and at one point said it had financing commitments of $108 billion. But the status of that fund is now unclear as many of the startups that the first Vision Fund invested in have fallen on hard times.\n\nIn a widely publicized scandal, SoftBank took control of WeWork, the embattled coworking business. SoftBank's Son and Adam Neumann — the company's recently ousted CEO — once had a close personal relationship, but the Japanese investor was reportedly one of the first to call for Neumann to step down when the company's IPO plans started falling apart. Layoffs of WeWork staffers began almost immediately after the takeover.\n\nSoftBank reported a steep $6.5 billion loss in November, spurred by its biggest tech bet flops like WeWork, and Uber and Lyft's disappointing debuts on the stock market.\n\nIn the wake of the WeWork debacle, several other SoftBank startups have also begun to bleed. Zume, the SoftBank-backed robotic pizza startup valued at $1 billion, lost a third of its executive team and layoffs that affected 360 out of its 500 employees. The company isn't alone — in the first full week of 2020, SoftBank-backed Oyo, Rappi, Getaround and Zume laid off a combined total of 2,600 employees. More layoffs in Oyo's US offices have also been reported by Business Insider, though it isn't immediately clear how many jobs were cut.\n\nHere's a running list of SoftBank's investments, based on how much the firm has put into in each company:"}]}