{"Achille-Ferdinand Carrière was a professor of botany at the Muséum National d'Histoire Naturelle in Paris from 1876 to 1906.": [{"url": "https://www.mnhn.fr/en/historical-herbaria-collection", "page_content": "Presentation\n\nThe historical herbaria, which comprise around 150,000 specimens today, are stored separately. The most important ones are still classified according to the order followed by their designers, in the publications where the latter described plants or developed classification systems. These great authors include the Jussieus, active at the Muséum for three generations (from the 1710s to the 1850s), Michel Adanson (1727-1806), Jean-Baptiste de Lamarck (1744-1829), André Michaux (1746-1803), René-Louiche Desfontaines (1750-1833), Alexander von Humboldt (1769-1859) and Aimé Bonpland (1773-1858). In general, these collections cover a very broad taxonomic spectrum (vascular and non-vascular plants) and also have quite a vast geographical range.\n\nAmong the collections stored separately, there are also objects in specific formats. This is the case for older, bound herbaria such as those of Jehan Girault (this little book dates back to 1558 and was added to the collection thanks to the Jussieu family), Jean-Jacques Rousseau (15 binders containing types from Guiana harvested by Jean-Baptiste Fusée Aublet) and Albrecht von Haller (18th century). Lastly, some herbaria are stored in these collections because of their uniqueness, like the Léon Mercurin herbarium (20th century), whose specimens are beautifully mounted on Bristol board."}, {"url": "http://collections.mnhn.fr/ipt/resource?r=mnhn-p", "page_content": "Data Records\n\nThe data in this occurrence resource has been published as a Darwin Core Archive (DwC-A), which is a standardized format for sharing biodiversity data as a set of one or more data tables. The core data table contains 5,559,883 records. 3 extension data tables also exist. An extension record supplies extra information about a core record. The number of records in each extension data table is illustrated below.\n\nOccurrence (core) 5559883\n\nIdentification 6561553\n\nIdentifier 5805728\n\nMultimedia 5590581\n\nThis IPT archives the data and thus serves as the data repository. The data and resource metadata are available for download in the downloads section. The versions table lists other versions of the resource that have been made publicly available and allows tracking changes made to the resource over time."}, {"url": "https://www.nature.com/articles/sdata201716", "page_content": "Constitution of the physical collection\n\nThe oldest herbarium specimens deposited at P, which date back to 1558, are contained in the herbarium of Jehan Girault, who studied surgery in Lyon. They were incorporated into the historical herbarium of the Jussieu family but are now stored and curated separately. The first systematic effort to constitute an ‘herbarium’ was, however, that of Joseph Pitton de Tournefort (1656–1708)3,4, who initially acquired specimens from France, and particularly from around Paris, to serve as a working base for his Élements de Botanique5, later translated into Latin under the title ‘Institutiones rei herbariae’6. Tournefort’s herbarium was subsequently enriched with his own collections from the Middle East and was personally donated by him to King Louis XIV3,7,8.\n\nIt was during the reign of King Louis XV that interest in botany significantly increased in France. The king’s passion for the sciences, combined with the influence within his Court of scientists such as Guy-Crescent Fagon (1638–1718) and Louis Guillaume Le Monnier (1717–1799), created a thriving climate for botany at the Jardin royal. The path initiated by Tournefort was followed by scientists such as Sébastien Vaillant (1669–1722), Antoine de Jussieu (1686–1758), Bernard de Jussieu (1699–1777), Jean Baptiste de Lamarck (1744–1829) and Antoine Laurent de Jussieu (1748–1836), each of whom constituted a personal herbarium while also contributing to the emergence of modern botany. In parallel with the development of these natural history collections (referred to in French as a ‘cabinet d’histoire naturelle’), the king funded several expeditions spanning the globe with a declared aim of conducting scientific studies. These included expeditions by Joseph de Jussieu (1704–1779) to South America, André Michaux (1746–1802) to the Middle-East and then to North America, Jean Baptiste Christian Fusée-Aublet (1720–1778) to what is now French Guiana, René Louiche Desfontaines (1750–1833) to the Atlas mountains, Louis Antoine de Bougainville (1729–1811) and Philibert Commerson (1727–1773) around the world, and Jacques-Julien Houtou de La Billardière (1755–1834) to Lebanon3,9. Some of the specimens collected during these trips were included in Le Monnier’s private herbarium, which was later acquired by Jules Paul Benjamin Delessert (1773–1847), whose herbarium is now kept in Geneva (G). Duplicates of some of these specimens can also be found in Vaillant herbarium, now housed at P3.\n\nDuring the French Revolution, the Jardin royal and its collections were nationalized and in 1793 became the Muséum national d’histoire naturelle. Desfontaines, while holding the Chair of Botany at the Muséum, organised the National Herbarium (in the modern sense of the word) between 1793 and 1802 (refs 3,10), which comprised a general herbarium based on Vaillant’s collections enriched with Fagon’s herbarium3. For historical reasons Desfontaines kept Pitton de Tournefort’s collection separate. At the time the collection included about 25,000 specimens, including both vascular and non-vascular plants now housed in both parts of the National Herbarium (P and PC). By 1808 the collections had outgrown the Muséum’s Cabinet d’Histoire naturelle and were transferred to the Maison Léger, a building situated close to the Hôtel de Magny within the modern day Jardin des Plantes, which had been purchased in 1802 but was demolished in 1878 (ref. 1).\n\nDuring the first half of the 19th century many societies were established for the exchange of herbarium specimens. They persisted for a century and grew into one of the major sources of material for P. In parallel, from the beginning of the 19th century through the middle of the 20th century, material was received form missionaries and ‘correspondents’, botanists based in the field who collected at least in part for the MNHN and sent specimens to Paris. With the start of colonisation in the 1850s, military and colonial administrators also contributed greatly to P. Together these added significantly to the size and richness of today’s herbarium. By 1835, due to the tremendous increase in the size of the collection, it again became necessary to relocate the P herbarium, which was transferred to a newly built ‘Gallery of Botany and Mineralogy’, likewise within the Jardin des Plantes1.\n\nThe beginning of the 20th century was a period of rapid growth for P, with major donations enriching its holdings (Table 1). By 1935, the collections, which contained more than 4 million specimens, were stored in 4 separate buildings and most were inaccessible for research. Thanks to the pugnacity of Paul Henri Lecomte (1856–1934), who held the Chair of Botany starting in 1906, and a donation from the Rockefeller Foundation, the present herbarium building was constructed to host the collections and facilitate their study1. The collection was dramatically enriched with material from Madagascar during the period when Jean-Henri Humbert (1887–1967) held the Chair of Botany, from 1931 to 1958, reflecting his strong interest in the island’s flora, which was sustained by his successors, including André Aubréville (1897–1984), who held the Chair from 1958 to 1971 and was also interested of all of the other French-speaking territories (former colonies)10.\n\nTable 1 Major acquisitions at P. Full size table\n\nAfter World War II and the subsequent period of decolonisation, the rate at which the Paris collection grew started to decrease. Field work conducted by MNHN botanists and exchanges between herbaria became the main sources of new acquisitions. The main activities of botanists at P remained focused on the floras of the former colonies and French overseas territories, of which the holdings at P are particularly strong. The closure of several botanical institutions within France that were unable to maintain collections for financial reasons provided another source of material for P (Table 1).\n\nBy the end of the 20th century the collections had outgrown the capacity of the original storage facilities in the 1935 building and the decision was made in 2005 to undertake a complete renovation of the herbarium in order to increase its capacity and improve specimen storage conditions. Starting in 2008 the collections were moved into newly installed compactors, making it possible to integrate the accumulated backlog of some 830,000 previously unmounted specimens and accommodate new specimen acquisition for the next three decades. This operation included a comprehensive resorting of the entire collection into a linear sequence following the APG III classification system11. Concomitantly a mass digitisation project was undertaken1,12,13, which led to the integration of high resolutions images of all specimens into a dedicated database as described below, accompanied by basic information (accession number, family, genus, specific epithet, geographic region of origin and image) for those that had not already been fully databased.\n\nDatabasing of the physical collection\n\nThe first discussions about biodiversity databases began at P during the mid-1970s and the first tool specifically designed to manage herbarium information was developed during the mid-1980s with the creation of the Vaillant database14,15. Commissioned in 1993, the current herbarium database, named Sonnerat (Data Citation 1), was developed to serve as a computerised catalogue of the P collections. It was named after Pierre Sonnerat (1748–1814), a French naturalist, illustrator and explorer who identified, described and illustrated numerous species, mainly from Asia and Mauritius. The database has now developed into the repository for the other herbarium collections of the MNHN (registered in the index herbarorium as PC & PAT16) as well as for the network of herbaria in French-speaking countries and the partners in the e-ReColNat project (see below). Sonnerat serves as the core source for data delivered by other portals (e.g., GBIF, e-ReColNat). As with all of the other shared collection databases at the MNHN, Sonnerat is a relational database and was developed under Oracle. The main tables constituting Sonnerat, with the header of the conlumns they contain and the relations between them are presented in a Unified Modeling Language (UML) diagram in Fig. 1. To manage the data and facilitate their dissemination over the web, a specific tool was developed under Java starting in 1997 by the Centre Informatique du Muséum. It was initially named JCIM (for Java [solution] of the Centre Informatique du Muséum) and later renamed JACIM in order to avoid internal confusion with the name of the Ichtyological collection database (GICIM). Updates and upgrades are performed internally by a dedicated team in the Direction des Services Informatiques.\n\nFigure 1: Unified Modeling Language (UML) diagram of the main tables of the Sonnerat database. It presents the column header disposition through the tables, and the tables relations. Full size image\n\nData are published online through the Data Portal of the MNHN17. Additionally a Darwin Core archive (http://rs.tdwg.org/dwc/index.htm) is regularly generated and available on GBIF data portal (Data Citation 1). As for every collection database, the archive is generated using the Occurrence core. All field definitions (Darwin Core Terms) are available on the Darwin Core website (at: http://rs.tdwg.org/dwc/terms/index.htm#occurrenceindex). The archive itself is constitute of 4 text files containing the structural information (the occurrence core, which here comes together with 3 extensions: multimedia, identifier and identification), an eml file containing the data themselves, and an xml file doing the link in between the source database (here Sonnerat) and the archive.\n\nConsidering the sheer size of the collection at P, its digitisation has been a tremendous task and indeed this process is still ongoing to deal with the holdings that remain to be scanned (1% of the total; an estimated 10% of the collection remains to be databased).\n\nThe first databasing efforts were concentrated on the day to day activities of the herbarium, in particular recording specimens being sent on loan and new accessions related to studies conducted by MNHN researchers. Initially between 20,000 and 30,000 new entries were made per year, but since initiation of the mass digitisation of the collection carried out under the Renobota project starting in 2008, work on the database has changed radically and become a key tool for herbarium management, focusing mainly on updating and enriching the data and in particular adding collection information to those entries that have not yet been fully databased. Moreover, during the Renobota project only a single entry was made per specimen, even for those on which more than one distinct collection has been mounted (this is particularly true for the Cosson herbarium). A Nikon D800 camera mounted on a Kaiser R1 copy stand system is currently being used to image all new specimens and for image updates.\n\nIn order to increase the rate of databasing in addition to this routine herbarium work, systematic data entry efforts were developed from 2001 onwards, involving numerous skilled personnel (Supplementary File 1). Continental African Asteraceae, Malagasy Fabaceae-Caesalpinioideae and Papilionoideae, as well as specimens from Mayotte Island and the Union of the Comoros were treated during this process15,18,19.\n\nThe substantial dataset that is available today17 (Data Citation 1) was also achieved through the MNHN’s active involvement in several national and international databasing projects, each focusing on distinct aspects of data acquisition corresponding to different uses of the rich botanical collection housed at P. As shown in Fig. 2, the most notable of these projects, in terms of the amount of data captured, is the Renobota project, which would not have been possible without input from precursor projects, and for which much work remains to be done in order to achieve full digitisation of the collection. The main projects based at P are presented below and their output is fully integrated in the general dataset (Data Citation 1).\n\nFigure 2 Growth of the P dataset (number of specimen entries) per year according to project. Full size image\n\nCyperaceae from tropical Asia and tropical Americas digitising project (2001–2003)\n\nFunding: Institut Klorane, MNHN\n\nDigitising for the Cyperaceae from tropical Asia and tropical Americas project focused on all Cyperaceae specimens from these regions. Over 8,000 specimens from Asia and 23,000 from America were treated over a three year period.\n\nGlobal biodiversity information facility project (2002–2004)\n\nFunding: GBIF France\n\nThe GBIF project was the first global databasing effort undertaken at P. It focused on tropical material of two families: over 34,000 specimens of Orchidaceae and 16,800 specimens of Solanaceae where databased, and a search for type specimens was implemented.\n\nMillennium seed bank project (2004–2008)\n\nFunding: Royal Botanic Gardens, Kew\n\nThis project, which focused on databasing specimens from Mali, Burkina Faso and Madagascar, was conducted in collaboration with the Kew Millennium seed bank. A total of 31,000 specimens from 120 families (45 for Madagascar and 75 for Burkina Faso and Mali) were fully databased, including post-facto calculated geolocation data.\n\nGlobal plants projects (African plant initiative 2004–2006, latin American plant initiative 2007–2008, global plant initiative 2009–2015)\n\nFunding: Andrew W. Mellon Foundation\n\nThese three projects funded by the Mellon Foundation aimed at databasing and producing high-resolution (600 dpi) scans of all the type specimens held in herbaria throughout the world, including P. The first phase, the African Plant Initiative (API), which operated from 2004 to 2006, focused on the African type specimens. It was then followed by the Latin American Plant Initiative (LAPI), from 2007 to 2008, and finally the Global Plant Initiative (GPI) followed from 2009 to 2015, which sought to scan all types from throughout the world, with the exception of Europe.\n\nThese three projects resulted in the databasing and digitisation of 185,937 specimens (including 177,045 type specimens and 8,892 specimens of nomenclatural interest), amongst which 45,500 types were located for the first time in the collection, requiring verification. For most of these specimens, the digitisation process was done with Herbscan units, in which a scanner is mounted upside-down, which were provided by the Royal Botanic Gardens, Kew. For thick specimens as well as especially fragile material, high definition Leaf photographic equipment mounted on a motorized bench was used. A 300 dpi copy of each image is linked to the data on the MNHN server (Data Citation 1), while a 600 dpi image, together with the most important data, is duplicated on the Global Plants on JSTOR portal (materials contributed by the Muséum National d’Histoire Naturelle (P) available at: http://plants.jstor.org/partner/P).\n\nHerbier Lamarck project (2004)\n\nFunding: Centre national de la Recherche scientifique\n\nThis project sought to digitise the totality of Jean-Baptiste Lamarck’s herbarium, in its current composition, as part of a project portal dedicated to Lamarck’s scientific legacy. All of the ca. 19,000 specimens were scanned after having been given an accession number, and are available on a dedicated portal (http://www.lamarck.cnrs.fr/herbier.php). When a record for an accession in the Lamarck herbarium also exists in Sonnerat, a link is automatically provided. The data from the Lamarck portal will be fully integrated into the P dataset in the near future (Data Citation 1).\n\nAuguste de Saint-Hilaire virtual herbarium project (2009)\n\nFunding: Instituto de Botanica de São Paulo(IBt), Centro de Referência em Informação Ambiental (CRIA ), Fundação de Amparo à Pesquisa do Estado de São Paulo (Fapesp), Fundação Vitae, Institut des Herbiers Universitaires, CLF, Clermont-Ferrand\n\nThis project, conducted remotely in Brazil, concentrates on digitising the herbarium material collected by Auguste de Saint-Hilaire (1779–1853) in Brazil from 1816 to 1822. Specimen data are presented in a dedicated portal under the form of a virtual herbarium, where the sheets are linked to the relevant pages of Saint-Hilaire’s field notebooks. Data are harvested twice a day from Sonnerat by the virtual herbarium. To date P has contributed over 9,300 specimens, and the rate of data capture has increased significantly since 2012 mainly due to the databasing efforts of the Reflora project20 (available at: http://hvsh.cria.org.br/hv).\n\nRenobota project (2008–2013)\n\nFunding: Muséum national d’histoire naturelle, Paris (MNHN)\n\nRenobota is the abbreviated name used to designate the massive digitisation of the herbarium specimens at P as part of the MNHN’s comprehensive renovation project of the National Herbarium. This integrated project, carried out from 2008 to 2013, involved renovation of both the collection and the building (doubling its storage capacity, offering new working space, and providing controlled environmental condition for specimen storage).\n\nWork on the collections comprised two distinct and complementary operations. The first involved processing the huge backlog of material accumulated over decades, including unmounted and unfiled specimens that had long been unavailable for consultation and research. This material was sorted by the herbarium staff and ca. 120,000 duplicate specimens were dispatched to botanical institutions around the world, with priority given to the countries in which the collections had been made. A private company, Grahal, was contracted during a four year period to carry out this operation, which resulted in the mounting of 830,000 herbarium sheets of vascular plants. The specimens were arranged by family and packed, awaiting their incorporation into the general collection as part of the second operation.\n\nThe second step aimed to digitise and rearrange the entire holdings of vascular plants at P. Oce Business Services France was contracted to carry out a multi-objective process at a dedicated site selected for this specific purpose. The objectives included: integration of the newly mounted specimens among the remainder of the collection, reconditioning with new genus folders, mass digitisation of all specimens, rearrangement according to the APG III classification system and, within each family, to a new sequence of generic and of geographic areas. Each sheet received a barcoded accession number label (if one had not previously been given) and was then scanned, with the exception of type specimens (stored in red folders, which had already been treated as part of the Global Plants Science projects; see above) and Vaillant specimens (stored in green folders and treated in part by the GPI team). Essential data were captured (accession number, geographic region and taxon name), which is the basic information necessary to link the virtual collection (i.e., the scanned images) to the physical collection (the specimens). The resulting data and associated images were then uploaded into the Sonnerat database12,13. Over 5,000,000 specimens were digitised and for more than 90% of them, a new database entry was created in Sonnerat. The project resulted in a massive number of specimen entries, each associated with an image, but only limited collection label data were captured (Data Citation 1).\n\nAs a result of the Renobota project, the operating procedures at P as well as access for the botanical community to the herbarium’s facilities and collections have been significantly improved, although managing the process of updating both the virtual and real herbaria remains a considerable challenge.\n\nLes Herbonautes project (2012-present)\n\nFunding: MNHN, Fondation de la Maison de la Chimie, e-ReColNAt (ANR-11-INBS-0004), Muséum national d’histoire naturelle, Paris (MNHN)\n\nLes Herbonautes (http://lesherbonautes.mnhn.fr/) is an ongoing participatory science project aimed at transcribing the information written on herbarium labels through a dedicated web-based portal. Images are shown to registered web volunteers through thematic projects (called ‘missions’) designed by researchers curating collections and focusing on scientific research needs. The web volunteers (called ‘herbonauts’) transcribe, for each image, data on the collection locality, date, collector, collection number, identification, and geolocation, as requested. The data quality is cross-checked: in order to be validated, the same data must be captured independently by several different contributors. Tests of data quality have shown comparable levels between data obtained using this method and professional standards. Since the opening of the website in December 2012, 37 missions have been launched, 35 of which have been completed. As of September 9, 2015, a total of 2,181 contributors have examined 119,956 specimens, providing 1,685,738 entries (i.e., responses to a single question). After three years, the public’s enthusiasm for databasing herbarium specimens remains high, although a certain seasonality can be seen: more contributions are made in winter than summer (Fig. 3).\n\nFigure 3 Monthly contributions to Les Herbonautes from its launch (December 2012) to the end of September 2015. Full size image\n\nThe initial version of the Les Herbonautes portal was developed as part of the Renobota project and a Version 2, developed through the e-ReColNat project, was released in January 2016. This new version allows for better follow up by both the project managers and the public. The data generated through Les Herbonautes can now be transferred to the Sonnerat database (Data Citation 1) through the ReColNat portal.\n\nOpen Up! project (2013)\n\nFunding: Europeana grant for OpenUp!\n\nThe OpenUp! project aims to provide images from natural history museum collections to the Europeana portal (http://www.europeana.eu/). The images, selected based on criteria for potential interest to the broad public, were chosen from among those generated during the Renobota project. In parallel, curation of the entire set of the taxonomic data in the Sonnerat database was performed (Data Citation 1). Data from 385,286 specimens of P were provided to the Europeana portal (available at: http://www.europeana.eu/).\n\nReflora project (2013–2016)\n\nFunding: Conseil National pour la Recherche (CNPq)-Vale\n\nThe Reflora project aims to create a portal giving access to data from every botanical collection relating to the Brazilian flora. All of the ca. 300,000 images produced by the Renobota project from specimens collected in Brazil are being sent to the Herbarium Collection of the Rio de Janeiro Botanical Garden, where teams of botanists and students are databasing them. Data are then sent back to P for incorporation into Sonnerat (Data Citation 1). To date, some 130,000 images have been provided to Reflora and data derived from 30,000 of these have been added to the P dataset. The global data resulting from the Reflora project are available on a dedicated virtual herbarium (http://reflora.jbrj.gov.br/reflora/herbarioVirtual/).\n\nAs part of this project, and in partnership with the National Museum of the Federal University of Rio de Janeiro, a virtual herbarium was established that is dedicated to the specimens collected by Auguste Glaziou (http://glaziou.cria.org.br), build on the model of the Auguste de Saint-Hilaire virtual herbarium.\n\ne-ReColNat project (2013–2019)\n\nFunding: PIA Agence Nationale de la Recherche-11-INBS-0004, Muséum national d’histoire naturelle.\n\nThis project aims to facilitate online access to the biodiversity collections held in France. At P, it consists mainly of a quality control monitoring of the Sonnerat database, while also developing new accessibility tools. A platform (Explore, available at: https://explore.recolnat.org/), bringing together resources from most of the French natural history collections and allowing an advanced browsing and data enrichment process, is under development. Explore will allow enrichment of the databased specimens through participatory science projects, directly through the platform and through a dedicated version of Les Herbonautes.\n\nAdditionally, using the structure created by e-ReColNat, a backlog of ca. 70,000 specimens from P have been digitised by Picturae at Heiloo21, after having been mounted. These mainly include new material received recently, loans returned too late to be included in the Renobota project, and some material left over from the earlier mounting initiative.\n\nAdditional databasing\n\nMost of the databasing efforts described above concerned the general herbarium collection at P. The standing-alone collections housed at MNHN (referred to as ‘historical collections’) were not part of the Renobota digitisation process. However, some were treated in part during various projects, as follows:\n\n- The Humboldt & Bonpland Herbarium was fully digitised and databased by the GPI team. 3525 entries are available in the P dataset.\n\n- The Lamarck herbarium was completely digitised during a dedicated project. Data remain to be uploaded to Sonnerat. To date, 4053 specimens are available in the P dataset.\n\n- The American specimens of the Jussieu herbarium, estimated to represent ca. 10% of the material in this collection, are being digitised and databased as part of the Reflora project; 13,500 specimens (including the American material and some other specimens) have so far been databased.\n\n- Various specimens from other stand-alone collections were databased as part of the regular specimen loan procedure. The most significant of these are 543 specimens from the herbarium of Léon Mercurin (1898–1994), 230 from the Michaux herbarium, 133 from the Tournefort herbarium, 19 from Desfontaines Flora Atlantica herbarium, 18 from the herbarium of Elias Magloire Durand (1794–1873), and 6 from the Adanson herbarium.\n\nData published through GBIF: http://collections.mnhn.fr/ipt/resource.do?r=mnhn-p (Data Citation 1)\n\nSonnerat database taxonomic coverage\n\nDuring the Renobota project, the organisation of the collections at P was modified to follow the linear family sequence based on the APG III classification11. However, the placement of some specimens could not be updated at that time, and for various reasons, some collections are still filed under the same family as prior to the renovation, which followed the index developed by Théophile Durand (1855–1912) based on Bentham & Hooker’s classification22.\n\nThe P herbarium includes all vascular plant orders. A recent comparison (as of 19 October 2015) with The Plant List v.1.1 (http://www.theplantlist.org/) showed that 34% of the accepted species names are represented by one or more specimens, and an analysis of the non-matching data indicated that this was due to errors both in the P dataset and The Plant List. Once these issues have been resolved and remaining material at P is databased, coverage is estimated to be between 33 and 40% of all vascular plant species. As depicted in Fig. 4, the eudicots constitute the largest portion of the collection, with ca. 72%, followed by the monocots (ca. 17%) and the pteridophytes (ca. 9%).\n\nFigure 4: Taxonomic coverage of the P dataset in term of specimens. Following the APG IV classification for Angiosperms33 (entries through 24/03/2016). Full size image\n\nP dataset spatial coverage\n\nThe collections at P, which are global in scope, have been divided into 12 sectors based on place of collection to facilitate curation, access and regional studies (Fig. 5). The distribution of the accessions among these sectors is heterogeneous (Table 2). The FRA sector, corresponding to metropolitan France, is one of the largest, with ca. 970,000 specimens. The two continents with the largest number of specimens, Europe and Africa, have each been sub-divided into distinct sectors. For Europe, this dates back to the donation of de Candolle’s collection8 and to the creation of the France herbarium, which has evolved into the FRA sector, separate from the EUR sector, which encompasses the rest of Europe. The European flora comprises the largest portion of the P herbarium, with 29% of the holdings, a situation shared with other natural history collections at the MNHN23. Somewhat later, Africa was also sub-divided based on biogeographic considerations into AFT (Tropical Africa), AFM (Madagascar and the Western Indian Ocean islands) and AFN (Northern Africa), which together represent ca. 25% of the collections at P. The taxonomic composition within each sector is indicated in Table 2.\n\nFigure 5 Breakdown by geographic sectors at P. Full size image\n\nTable 2 Number of specimens per continent and geographic sector, and taxonomic coverage for each continent. Full size table\n\nTo date, 16% of the specimens included in Sonnerat are fully databased, resulting from a wide range of efforts (see detailed projects above). The percentages of specimens from which data are fully captured differ from one geographic sector to another (Table 2). All of the remaining specimens processed during the Renobota project are databased at least for family, genus and species names (when available), along with main geographical sector, but not for information related to the individual specimen (collector name, collection number, date, locality, etc.).\n\nEurope, France and Northern Africa have a very low percentage of fully databased specimens. Similarly, the very low rate for cultivated material reflects the scientific focus of P botanists, which is primarily on wild plants. By the time the Reflora project is completed, data capture for specimens from Brazil should increase the rate for America significantly. Oceania is divided into two sub-sectors: CAL for New Caledonia and OCE for the rest of the region. The P herbarium contains at least 200,000 specimens from New Caledonia, but a technical issue makes it impossible to calculate the exact number, so the following numbers are provided for Oceania as a whole. The level of databasing for this sector is comparatively high since P botanists are working on the Polynesian24,25 and New Caledonian floras, which account for most of the material available. The collections from Madagascar are among the most studied and actively curated at P, and have been since the early 20th century. As a result they are the most extensively databased (full data have been captured for 35%). Special efforts have been made on the collections from the circum-austral islands, which are relatively small in number (85% have been fully databased). Finally, the stand-alone (historical) collections were not treated as part of the Renobota imaging process so the only records are those resulting from projects that fully captured the associated data. As a consequence, the very low proportion for which data entry is not complete (0.02%) corresponds to background error rates in databasing.\n\nBecause of the heterogeneity in the proportion of fully databased specimens among geographic sectors, the distribution by country shown in Fig. 6a, which takes into consideration only these records, very likely does not reflect the true situation for the entire collection at P. For example, European and Northern African countries are under-represented while Madagascar and Brazil are over-represented. This map nevertheless provides important information on the geographical provenance of the specimens in the P herbarium. To facilitate interpreting this figure, we have calculated a factor of representativeness for each sector by dividing the average rate of full data capture per sector by the overall average for the collection as a whole:\n\n- Within Europe, metropolitan France is under-represented, as indicated by a factor of 0.52, and the rest of Europe by a factor of 0.38. However, excluding metropolitan France, the Mediterranean flora is better covered at P than northern Europe.\n\n- Within Africa, Madagascar is over represented by a factor 2.22, tropical continental Africa is close to the overall average with a factor 1.03, and northern Africa is significantly under represented, with a factor 0.37. Specimens from the former French colonies are well represented, but it is notable that South Africa, Ethiopia and Tanzania are as well.\n\n- For the Americas, the factor is 1.12, indicating that this sector is over-represented among the records for which data have been fully captured. While there is no way to calculate the factor for Brazil, it will surely exceed the value for the sector as a whole given that several projects are focusing on its flora.\n\n- For Asia, the collections are slightly over-represented, with a factor of 1.09. The value for former Indochina is expected to be the highest, whereas those for India, Japan and Siberia (most of the databased specimens from Russian at P were collected in Siberia) as well as China are expected to be lower than the average for the sector. The expected over-representation for Indochina reflects the historical relationship with this region and the flora project coordinated at P.\n\n- For Oceania, the factor of 1.50 indicates an over-representation, most of which reflects the impacts of major flora projects for French Polynesia and New Caledonia, areas from which the collections at P are particularly rich. P is also noteworthy for its rich folding of material from Australia.\n\n- For the circum-autral territories, the collections are over represented, as indicated by a factor of 5.54, although the small sample size makes it difficult to interpret this figure.\n\nFigure 6: Geographical and chronological composition of P dataset. (a). Geographical origin of vascular plant specimen in P (based on the 759,568 specimens bearing a valid country code (ISO 3166)) (b). Geographical origin of nomenclatural type specimens (based on the 186,809 bearing a valid country code (ISO 3166)) (c). Chronological distribution of vascular plant specimens in P by year of collection. (based on the 631,017 specimens with collection date between 1760 and 2010) (d). Chronological distribution of nomenclatural type specimens of vascular plants in P by year of collection. (based on the 130,189 type specimens with collection date between 1760 and 2010) (e). Number of accepted names of vascular plants by year of description (source: The Plant List34) represented as such (green), just by a synonym (blue), or not represented at all (red) in the P dataset (entries up to 04.04.2016). Full size image\n\nThe P herbarium is very rich in type specimens from throughout the world, a large proportion of which were systematically databased during the three Global Plants Projects. The distribution of types by country of collection (Fig. 6b) largely confirms the general trend observed for the collection as a whole. However, given that no systematic searches were made to detect previously unrecognised types in the African sector during the API project (only types already placed in distinctive red folders were considered), a significant but unknown number of types remains to be found among the continental African collections. Because none of projects supported by the Mellon Foundation concerned the European flora, collections from this sector are underrepresented in this map. Additionally, even though the GPI team conducted a systematic search for type specimens from America, Asia and Oceania, the Reflora project has shown that a systematic review of the collections from a given country by specialists will surely reveal additional, previously unrecognised types.\n\nBy comparing the country of collection (as indicated by the country isocode in the fully databased portion of the herbarium) with the broad geographical sector assigned to the entire collection, an estimate can be made of the geographical error rate, including mismatches, invalid country codes, and unassigned sector codes (even though in principle each specimen must be assigned to a sector). However, because it is sometimes difficult to determine the country from which a specimen was collected, especially for older material, empty country codes were not considered as errors. We obtained a correct match for over 97% of the records.\n\nTemporal coverage (year 1558-present)\n\nThe oldest plants preserved at P are sheets made out of the flower garlands found on the mummy of Ramesses II, which were sent for study to the MNHN4. These few extremely old specimens are, however, exceptions, as are those held in Jehan Girault’s collection, which dates from 1558. The number of specimens in the collection began to increase significantly during the late 17th century, but it is often impossible to determine the precise date of collection for this oldest material as this information was almost never mentioned by collectors on specimens made before the 19th century.\n\nThe number of specimens at P according to collection date (Fig. 6c) shows an increase starting in the 1820s. This is in large part related to the activities of French missionaries and later to the exploration that preceded colonisation and formation of botanical societies, which sent duplicates to the MNHN and those who held other collections that are now kept at P. The large number of specimens recorded for 1816 is an artefact of the fact that Auguste de Saint-Hilaire’s specimens, which were collected between 1816 and 1821, were all entered as 1816 because no precise date is generally indicated.\n\nThree major wars impacted the growth of the collections at P during the last two centuries:\n\n- the Franco-Prussian War (1870), followed by the French Commune (1871)\n\n- the First World War (1914–1918)\n\n- the Second World War (1939–1945)\n\nWar is not particularly compatible with botany, although botanical activities never totally ceased during times of conflict26. The decrease in the number of collections added per year at P at the end of the 1960s parallels documented decreases at other historical natural history collections in Australia, Germany and France23,27,28. In Paris this can be linked to decolonisation, but also to a decrease of funding for activities that generate material deposited in herbaria and to a societal perception of such collections as unimportant or unnecessary23,27,28. The apparent renewal of interest since the 1990s, as suggested by the increase in growth at P, might be linked with the development of the database Sonnerat and the systematic databasing of new collections made by MNHN botanists, facilitating the production of specimen labels, which could this explain the apparent higher rate of collection during these years. The lower rate of databasing of specimens in the last decade is seen among many natural history collections database23 and might be linked to the fact that significant numbers of specimens still being studied have not yet been incorporated into herbaria.\n\nFigure 6d shows the same information specifically for type specimens up to the end of World War II, after which a drop in the proportion of types in the collection can be seen, even though the worldwide number of accepted taxa described per year has increased. As depicted in Fig. 6e, a high portion of the taxa described in the first century after Linnaeus’ work are represented at P, and this proportion has declined ever since.. Moreover, over the last five to six decades, a growing number of species are filed in the Paris herbarium under a synonym rather than the currently accepted name, which in large part reflects the increasing amount of curatorial effort needed to ensure that the collection is regularly updated as taxonomic changes are made.\n\nDatabased samples collection and preservation methods\n\nVascular plants collection (P) of the Muséum national d’histoire naturelle (MNHN—Paris), active databasing period: 1993–2015 (Data Citation 1).\n\nSpecimen preservation methods\n\nThe collection consists in dry specimens mounted on herbarium sheets, dry wood samples, dry fruits and seed, samples preserved in alcohol, tissues and pollen mounted on microscope slides, tissue samples preserved in silica-gel.\n\nIt is mostly composed of herbarium sheets, which are divided into a general systematic collection (5.7 million specimens, 95% databased), ordered according to the APG III classification for the Angiosperms, and into several stand-alone collections of historical importance (estimated at 150,000 specimens, 14% databased), which are curated separately. In addition to the herbarium, P also includes some complementary collections:\n\n- Histology (70,000 slides, not yet databased, 20,000 of which came from the collection of Philippe van Tieghem)\n\n- Palynology (45,000 slides, not yet databased, ca. 12,000 of which have vouchers in the P herbarium)\n\n- Specimens preserved in alcohol (estimated to comprise 15,000 specimens, 4% databased)\n\n- Wood collection (estimated at 14,000 specimens, 83% databased). An significative curation effort, including data management, is currently being made on this particular collection\n\n- Dry fruit and seed collection (estimated to include 28,000 specimens, 6% databased)\n\n- Samples preserved in silica-gel for molecular studies (ca. 7,300 samples, 100% databased)\n\nSampling protocol\n\nNo single sampling protocol can be distinguished, the acquisition of the collection tremendously varies depending on the institute from which the sample is derived or the collector. An ideal label for those specimens consists in: taxonomic information, collection information (who?; where?, when?) completed by GPS coordinates and projection system, descriptive or ecological data which cannot physically be preserved on the specimen, ethnobotanical information (vernacular names, uses). Moreover, for most of the older, historical specimens, no information is available on the sampling methodology used.\n\nUse of the dataset\n\nThe P dataset (Data Citation 1) is widely used for a great range of botanical or organisms interactions researches encompassing systematics, evolution, phylogenetic diversity, conservation biology, taxonomy as well as monographs and flora treatments18,19,24,25,29–32."}, {"url": "https://www.mnhn.fr/en/the-history-of-the-museum", "page_content": "New areas of research\n\nThe 19th and 20th centuries, the high point of scientific exploration, saw the collections grow. In parallel with these new fields of activity, the Museum began to expand outside the capital. In 1849, it was entrusted with the management of the Sansan Paleosite, in the Gers (opened to the public in 2018). To promote its research activities related to the sea, in 1928 it set up its maritime laboratory in Dinard (Ille-et-Vilaine). As his botanical activities were booming, he became the owner of the Chèvreloup estate (Yvelines) in 1934. He also inherited the property of the entomologist Jean Henri Fabre in Sérignan-du-Comtat, near Orange, in 1822. Today, the Museum has 13 sites in mainland France, including 3 in Paris.\n\nAfter the war, it became involved in raising awareness of the ravages inflicted on natural environments by the expansion of the human race, pollution and the over-exploitation of the Earth's resources. In 1948, the Museum was involved in the creation of the International Union for Conservation of Nature (IUCN). Later, it set up a nature conservation service (1962), the Wildlife and Plant Secretariat (1979) and a permanent environmental delegation (1992). The provinces were not forgotten, with the acquisition in the 1950s and 1960s of the abri Pataud (Pataud shelter) in the Dordogne, le Parc animalier de la Haute-Touche (the Haute-Touche animal park in the Indre), the Jardin botanique de Val Rahmeh (Val Rahmeh botanical garden) in Menton and the marine biology station in Concarneau. Lastly, organisations such as the Nature Conservation Service have set up shop within its walls."}, {"url": "https://en.parisinfo.com/what-to-see-in-paris/info/guides/treasures-museum-d-histoire-naturelle-paris", "page_content": "With spaces dedicated to plants, animals, minerals and human beings alike, the Muséum Nationale d’Histoire Naturelle de Paris is a group of museums, gardens, galleries and even zoos throughout the Île-de-France region dedicated to natural treasures.\n\nThe Muséum offers a number of possibilities to satisfy the curiosity of all visitors: from children to adults, from traditional visits to virtual reality, in the heart of Paris or outside the city.\n\nAround the Jardin des Plantes\n\nSituated in Paris’ 5th arrondissement, the heart of the Muséum is comprised of four main spaces: the Jardin des Plantes, the Ménagerie, the Grande Galérie de l’Évolution and the Grandes Serres.\n\nThe Jardin des Plantes\n\nThe Jardin des Plantes is composed of a long row of trees, plants and pathways, explored by Parisians for nearly 400 years and now classed as a historical monument. Its Jardin de l’École de Botanique, rose garden, eco garden, vegetable garden and more can be explored freely or in a guided tour for a walk that is always changing thanks to different seasons in which the plants blossom. Notably, springtime brings Japanese cherry trees in full bloom, a breathtaking sight.\n\nMore info on the Jardin des Plantes\n\nThe Grande Galerie de l’Évolution\n\nThe Grande Galérie de l’Évolution impresses children and adults alike with its amazing collection: the gigantic skeleton of a southern right whale, coral reefs, taxidermy elephants, buffalo and giant squid and more. Different studies by naturalists such as Darwin and Lamarck let visitors get to grips with the classification of species and laws of genetic inheritance. Finally, an entire new level is dedicated to the relationship between human beings and the environment – immerse yourself in biodiversity!\n\nMore info on the Grande Galérie de l’Évolution\n\nThe Ménagerie\n\nThe superb Ménagerie of the Jardin des Plantes, with architecture as interesting as its animals, houses over 1,000 species, including some that are endangered. Birds, mammals, reptiles, amphibians, insects, spiders, crustaceans and more populate this centre of nature and science. And don’t miss the zoo’s stars: the red pandas.\n\nMore info on the Ménagerie of the Jardin des Plantes\n\nThe Grandes Serres\n\nThese iridescent structures situated on the way to the Ménagerie are the Jardin des Plantes’ large greenhouses. The four separate buildings each house plant life from a different ecosystem: humid tropical forests, deserts and arid landscapes, New Caledonia and the history and evolution of plants. Together they form an incredible homage to the flora of our planet and offer a unique journey to all four corners of the Earth.\n\nMore information on the Grandes Serres of the Jardin des Plantes\n\nBut wait, there’s more!\n\nSeveral other sites help make up the Muséum’s 23 hectares of spaces dedicated to research and discovery of our planet’s riches. The Galerie de Minéralogie et de Géologie brings together countless collections of giant crystals, rare minerals, meteorites and other geological specimens that explain how our solar system works and how our planet was formed.\n\nThe Galerie de Paléontologie et d’Anatomie Comparée exhibits the skeletons of many extinct and existing species, and the Galerie Botanique is the oldest herbarium in the world, with several million plants classified and displayed for public viewing. The Galerie des Enfants is a fun space where children aged 6 to 12 can learn and discover the flora and fauna of Paris with nature activities and interactive games.\n\nFinally, the Muséum is the first in France to offer a virtual reality room, the Cabinet de Réalité Virtuelle. Located in the Grande Galerie de L’Évolution, it offers two ‘voyages’ to let you travel into prehistory, discovering long-dead giants and even hunting for meteorites around Paris.\n\nThe Parc zoologique de Paris\n\nMoving away from the city centre, the Muséum offers more locations for you to discover.\n\nThe Parc Zoologique de Paris in the Bois de Vincennes is one such venue. With a commitment to defending biodiversity, this modern zoo with its iconic towering boulder takes visitors on a journey from Sub-Saharan Africa to Latin America, stopping by the North and South poles, the islands of the Indian Ocean and more, all in five distinct bio-zones. Various other routes also let you discover how the zoo is run, from the kitchen to the veterinary clinic. The zoo offers a range of activities, such as headphone discos, themed tours, ornithology sessions and even feeding the animals!\n\nMore info on the Parc Zoologique de Paris\n\nThe Musée de l’Homme\n\nHow many languages are spoken in the world? Why are there different hair colours? What did Neanderthals look like? Here are just some of the questions that the Musée de l’Homme can help you answer in a fun and accessible way. Situated in the heart of Paris’ 16th arrondissement, not far from the Eiffel Tower, this museum houses a lab to help visitors better understand the past and future of the human race. Adults and children alike will enjoy the informative and immersivepermanent collection, as well as workshops and temporary exhibitions.\n\nMore info on the Musée de l’Homme\n\nThe Arborétum de Versailles-Chèvreloup\n\nOver 2,500 species of trees and 8,000 plants share a home in the Arborétum de Versailles-Chèvreloup, a veritable city of plant life. In greenhouses or outdoors, these mainly wild plants grow in a 200 hectare space where curious visitors can explore routes organized by geographical origin or botanical characteristics. Immerse yourself in nature at the edge of Paris.\n\nPlus de 2500 espèces d’arbres et 8000 de plantes cohabitent au sein de l’arborétum de Versailles-Chèvreloup, véritable ville pour végétaux. Sous serres ou en extérieur, sauvages pour la plupart, ces plantes évoluent dans un espace de 200 hectares que les curieux peuvent visiter au hasard des allées classées selon les origines géographiques ou particularités botaniques. Une immersion dans la nature aux portes de Paris.\n\nMore info on the Arborétum de Versailles-Chèvreloup\n\nImmersive, innovative and accessible to all\n\n> Much more than just a museum, the Muséum National d’Histoire Naturelle is a dynamic institution where visitors take an active role in their own experience. It also offers several related mobile apps for games and observation: the Galerie de la Paléontologie’s app presents and explains its fossil collection, ‘Birdlab’ lets visitors better understand the behaviour of birds, ‘Allen mène l’enquête’ (‘Allen leads the investigation’, in French only, English coming soon) gets children exploring the Galerie de l’Homme, and ‘Le voyage d’Adeline la girafe’ (‘The journey of Adeline the giraffe’, in French only) lets them discover the bio-zones of the Parc Zoologique de Paris.\n\n> It is also worth noting that the different branches of the Muséum National d’Histoire Naturelle were built to be accessible to everybody and are equipped with adaptations for disabled visitors: tactile routes, guided tours for partially-sighted and hard-of-hearing visitors, adapted workshops for visitors with learning disabilities and accessible infrastructure for visitors with reduced mobility (excluding certain historic buildings)."}, {"url": "https://sciencepress.mnhn.fr/en/collections/archives/auguste-de-saint-hilaire-1779-1853", "page_content": "Botanist Auguste Prouvensal de Saint-Hilaire landed in Brazil with the delegation of the Duc de Luxembourg in December, 1816, when this country was first opening more widely to foreign scientists and artists. He returned to France six years later having gathered significant natural history collections (of plants, animals, and minerals) and a great deal of information on the region’s history, physical geography, and uses of its natural products. In this bilingual French-Portuguese book, contemporary French and Brazilian historians and biologists explore how the descriptions that appear in this little-known botanist and explorer’s writings not only provide a window onto the current state of Brazilian landscapes and society, revealing de Saint-Hilaire’s works as major contributions to our knowledge of this immense nation, but also show his scientific approach to be unusually modern. In particular, an annotated version of de Saint-Hilaire’s Réponse aux reproches que les gens du monde font à l’étude de la botanique and extracts from his notebooks provide readers with a better understanding of this learned botanist’s key concepts and research approach. Illustrated throughout, the book also includes an exhaustive and annotated bibliography in French and in Portuguese.\n\nDenis Lamy is a science historian at the Centre Alexandre Koyré, France, where he studies the concepts and networks that developed in botany from the eighteenth to the nineteenth centuries.\n\nCorinne Sarthou is assistant professor and a curator at the Muséum national d’Histoire naturelle, Paris, where she leads research on tropical botany and ecology.\n\nMarc Pignal is an engineer and curator at the Muséum national d’Histoire naturelle, Paris, where he works on Brazilian flora.\n\nSergio Romaniuc-Neto is professor of botany at the Instituto de Botanica, São Paulo. He is an expert on the order Urticales."}, {"url": "https://en.parisinfo.com/paris-museum-monument/71625/Le-Jardin-des-Plantes-Museum-national-d-Histoire-naturelle", "page_content": "- Physical disability: the Grande Galerie de l'Evolution and the Galerie des Enfants are accessible to visitors in wheelchairs with adapted toilets. The height of furniture and machines has been well thought out. No access to the Galerie de Paléontologie and Galerie d'Anatomie Comparée. Some others sites in the museum are partially accessible with an accompanying person (Ménagerie at the Jardin des Plantes).\n\n- All disabilities: permanent exhibitions (except for tactile visits), guided tours and workshops with speakers are free. Guided tours and workshops are specially designed using pedagogical materials to suit different audiences. Audio guides and adapted routes can be downloaded at http://www.museesenliberte.fr/index.php\n\n- Visual impairment: in the Grande Galerie de l'Evolution, a tactile tour enables the visitor to discover some 15 animal sculptures in bronze. Descriptions are in contrasting colours, large characters and relief are used.\n\n- Hearing impairment: guided tours and workshops in French Sign Language, lead by deaf guides. All multimedia and video material, including in the language spoken, are subtitled in French and English and translated into French Sign Language.\n\n- Mental disability: numerous mutli-sensory, enternaining and interactive elements, simple routes.\n\n\n\nFind out more at:\n\nhttp://www.mnhn.fr/le-museum/ (click on the top right)\n\nContact:\n\nhandicap@mnhn.fr\n\nWheelchair loan on +33 (0)1 40 79 54 79 (for the Grande Galerie de l'Evolution, the Galerie des Enfants and the Jardin des Plantes)."}, {"url": "https://www.gbif.org/dataset/b5cdf794-8fa4-4a85-8b26-755d087bf531", "page_content": "The vascular plants collection (P) at the Herbarium of the Muséum national d'Histoire Naturelle (MNHN - Paris)\n\nCitation MNHN, Chagnoux S (2023). The vascular plants collection (P) at the Herbarium of the Muséum national d'Histoire Naturelle (MNHN - Paris). Version 69.314. MNHN - Museum national d'Histoire naturelle. Occurrence dataset MNHN, Chagnoux S (2023). The vascular plants collection (P) at the Herbarium of the Muséum national d'Histoire Naturelle (MNHN - Paris). Version 69.314. MNHN - Museum national d'Histoire naturelle. Occurrence dataset https://doi.org/10.15468/nc6rxy accessed via GBIF.org on 2023-06-09.\n\nDescription The French National Herbarium, estimated at 8 million preserved specimens from around the world, but particularly in France, Francophone Africa, New Caledonia, Madagascar, Southeast Asia, in French Guiana . It also has important collections in light of the history of botany: Tournefort, Jussieu, Lamarck, Adanson, and those of famous travelers as Bonpland, Michaud, Saint-Hilaire, Richard, D'Orbigny etc. The designation at CITES is FR 75A. It publishes Adansonia, a botanical periodical, and journals on the flora of New Caledonia, Madagascar and Comores, Cambodia, Laos and Vietnam, Cameroon, and Gabon.\n\nTaxonomic Coverages\n\nGeographic Coverages\n\nBibliographic Citations Le Bras, G., Pignal, M., Jeanson, M. L., Muller, S., Aupic, C., Carré, B., … Haevermans, T. (2017, February 14). The French Muséum national d’histoire naturelle vascular plant herbarium collection dataset. Scientific Data. Springer Nature. https://doi.org/10.1038/sdata.2017.16 - https://doi.org/10.1038/sdata.2017.16"}]}