{"Achille-Ferdinand Carrière was a prolific author, publishing numerous books and articles on botany.": [{"url": "https://www.wikiwand.com/en/Achille-Ferdinand_Carrier", "page_content": "Achille-Ferdinand Carrier (February 15, 1859 – March 21, 1930) was a lawyer, judge, and political figure in Quebec. He represented Gaspé in the Legislative Assembly of Quebec from 1890 to 1892 as a Liberal.\n\nCanadian politician\n\nQuick facts: Achille-Ferdinand Carrier, Member of the Legi... ▼\n\nHe was born in Saint-Roch, Canada East, the son of Ferdinand Carrier and Mary Ann Donahue, and was educated at the Séminaire de Québec and the Université Laval. Carrier was called to the Quebec bar in 1882. He was also a member of the Minnesota bar and practised in Minneapolis in 1885 and 1886. Carrier was the editor of the L'Écho de l'Ouest, a French-Canadian newspaper in Minneapolis. He ran unsuccessfully for a seat in the Canadian House of Commons in 1887. Carrier was defeated when he ran for reelection in 1892; he also ran unsuccessfully for the Terrebonne seat in 1897. He served as judge in the Magistrate's Court for Terrebonne, Joliette and Ottawa districts from 1898 to 1924. Carrier died in Quebec City at the age of 71.\n\nHe was the uncle of Oscar Lefebvre Boulanger."}, {"url": "https://prabook.com/web/achille-ferdinand.carrier/2545007", "page_content": "Achille-Ferdinand Carrier\n\npolitician Member of the National Assembly\n\nFebruary 15, 1859 (age 71) Saint-Roch, Canada East\n\nHe represented Gaspé in the Legislative Assembly of Quebec from 1890 to 1892 as a Liberal. Carrier was called to the Quebec bar in 1882. Carrier was the editor of the L\"Écho de l\"Ouest, a French-Canadian newspaper in Minneapolis. He ran unsuccessfully for a seat in the Canadian House of Commons in 1887. Carrier was defeated when he ran for reelection in 1892. He also ran unsuccessfully for the Terrebonne seat in 1897. He served as judge in the Magistrate\"s Court for Terrebonne, Joliette and Ottawa districts from 1898 to 1924. Carrier died in Quebec City at the age of 71. He was the uncle of Oscar Lefebvre Boulanger."}, {"url": "https://link.springer.com/article/10.1007/s11192-021-03898-y", "page_content": "Data collection\n\nResearchers invest time to publish their research results and use their publications to demonstrate their research influence Therefore, senior researchers are supposedly more advantaged in terms of total research productivity than junior researchers by virtue of a higher number of publications. To reduce the influence of academic age on publication count for the purpose of comparison, individual research productivity obtained through an equivalent time length for each subject is required. Moreover, whether productivity peaks appear in different phrases of one’s academic career was considered. If researchers in their late career have been unable to compete with other researchers in terms of research productivity in the same duration of time, their seniority must be considered. Although some researchers were not productive during the later periods of their academic careers (Perlin et al. 2017), researchers’ productivity peak was not always achieved in the middle of their career (Chang et al. 2020; Stephan and Levin 1993). The controversial relation between research productivity and time factor also defines the relationship between academic positions and age, because academic positions and age were not always useful predictors of research productivity (McNally 2010; van Osselaer and Lim 2019; White et al. 2012). Kyvik (1990) observed a similar level of productivity among researchers in the social sciences across all age groups, who were assumed to be productive throughout their careers. This means that social science researchers are likely to be productive, irrespective of the stage their career is at. Moreover, highly cited papers were observed to be published in random years across academic careers (Chang et al. 2020; Sinatra et al. 2016). Therefore, this study did not limit the researchers analyzed in terms of their academic age.\n\nLIS articles published between 2009 and 2013 were used to identify high research performance authors, prolific authors and highly cited authors. LIS articles refer to articles published in journals of library and information science that are indexed by the database of Journal Citation Reports (JCR). Research productivity was analyzed across a 5-year period. Referencing the concept of the 5-year impact factor established by JCR, a 5-year citation window was considered to be the rational minimum length of time for measuring publication influence. Additionally, considering that the current study’s data collection started in the beginning of 2019, the last publication year of LIS articles considered was 2013. Thus, a 5-year period between 2009 and 2013 was decided for collecting LIS articles.\n\nAccording to the bibliographic records of articles obtained from the WoS on the basis of publication year (2009–2013), document type (article), and subject category (information science and library science), one list of prolific authors and another list of highly cited authors were individually identified after manual examination and processing. The prolific authors were limited to the top 100 researchers with the highest number of LIS articles published between 2009 and 2013, and the highly cited authors were the top 100 researchers with the largest total number of citations received by all of their LIS articles between 2009 and 2013. Because high research performance authors had both high research productivity and influence to their credit, they were the first to be identified from among the common authors and classified into two lists. The group of high research performance authors comprised 33 authors who were listed among the top 100 prolific and top 100 influential authors. The majority of the high research performance authors had different ranks in the two lists. Although the average rank in terms of the number of articles was approximately 23rd for each high research performance author, a substantial difference in individual ranks was observed—ranging between 1st and the 56th. Moreover, the average rank in terms of total number of citations was approximately 30th, and the rank scope spanned between 1st and the 66th. For instance, one high research performance author who was ranked 50th in the list of top 100 prolific authors was13th on the list of top 100 influential authors. This indicates that not all 33 high research performance authors featured in the lists of top 33 prolific and top 33 highly cited authors.\n\nTo distinguish characteristics of high research performance authors, two same-sized control groups comprising prolific authors and highly cited authors were used for comparison. Because 33 high research performance authors were identified, 33 researchers out of the remaining 67 prolific authors with the highest productivity formed the group of prolific authors. The same number of highly cited authors were identified from the remaining 67 highly cited authors. A total of 33 authors with the highest number of total citation count were identified, and they comprised the group of 33 highly cited authors. The groups of prolific authors and highly cited authors had no common authors between them.\n\nTo counter author name ambiguity, before identifying the aforementioned three groups of authors, the biographical information, such as the Curriculum Vitae (CV), of each of the 100 prolific authors originally provided by WoS was collected from the Internet. Additionally, their possible name spellings, affiliation information, and expertise were used to retrieve and examine their articles published in LIS journals between 2009 and 2013. The two lists presenting the number of articles published between 2009 and 2013 by top 100 prolific authors was used to adjust the original list of top prolific authors analyzed by the WoS. Finally, a revised list of top 100 prolific authors was created. Additionally, the top 100 highly cited authors were identified from the number of citations received and the author names for each article. Each author of coauthored articles shared the same citation count. Hundred authors with the highest citation counts were confirmed after the number of citations received by individual articles published between 2009 and 2013 were calculated.\n\nAdditional information was collected to provide more evidence on the characteristics of three groups of authors. To understand whether the academic age of subjects affected their research productivity and influence, the duration of time between the publication year of their first article and 2013, which was the final year set in this study, was defined as the academic age of individual researchers. Because not all subjects had PhD degrees and the years in which some authors had obtained PhD degrees were unavailable, the year when these authors obtained their PhD degrees could not be considered as the first year of their academic career. Therefore, the academic age in this study was to measure the duration of time for academic publishing. Moreover, non-LIS researchers published their research results in LIS journals (Chang 2018a, 2019). Information related to the research expertise of the three groups of authors, such as their research interests or research expertise outlined in their CVs, social media presence, institutional websites, and master’s and PhD degrees, were collected from the Internet to indicate the primary research field each author belonged to. Because of diverse research interests and changes in institutional affiliations, the disciplinary attributes of some authors could not be gleaned from the author affiliation information included in the bibliographic records of articles.\n\nData processing\n\nThe disciplinary attributes of journals in which articles were published were used to assess whether these authors published their articles only in the field of LIS. Journals classified under the subject category of Information Science and Library Science were defined as LIS journals. Other journals were considered to be non-LIS journals. LIS is an interdisciplinary field contributed by researchers with various professional backgrounds (Chang 2019; Huang and Chang 2008). LIS authors also published in non-LIS journals (Chang 2018b).Therefore, articles published in non-LIS journals by three groups of authors during the same 5-year study period were retrieved.\n\nEach journal covered by the JCR was assigned at least one subject category. Journals with two or more subject categories, including the subject category Information Science and Library Science, were classified as LIS journals. Moreover, the quartile of the IF distribution for LIS journals, as assigned by the 2018 version of JCR, was recorded. Q1 denoted the top 25% of the IF distribution, Q2 referred to the middle-high position (between top 50 and top 25%), Q3 the middle-low position (top 75–50%), and Q4 the lowest position. This demarcation helped understand whether prolific and highly cited authors tended to publish in journals with high impact factors, because the impact factor of journals that did not belong to the same subject category could not be compared. Regarding non-LIS journals with two or more subject categories and the various levels of IF distribution, the highest level was used.\n\nAdditionally, coauthored articles were divided into international and domestic collaborative articles. An article published by at least two authors affiliated with institutions in various countries was classified as international collaborative articles. Domestic collaborative articles were distinguished as inter-institutional and intra-institutional collaborations. To verify whether authors with LIS expertise preferred collaborating with fellow LIS researchers, interdisciplinary collaborative articles were identified as well from among the coauthored articles. As mentioned in the final paragraph discussing the area for data collection, individual researchers’ research specialties were considered. In particular, authors actively publishing non-LIS articles were identified and assumed to have non-LIS research expertise. Because researchers from various fields have similar research interests and research expertise, research specialties were used to identify papers produced through interdisciplinary collaboration. For example, researchers in the field of information system were more frequently affiliated with the departments of computer science, information management, and library and information science, among others. Scientometrics authors comprised researchers from departments such as computer science, economics, management, and library and information science because scientometrics is a highly interdisciplinary research domain. Among the several sources that provide information on researchers’ expertise and interests, those on expertise were given precedence, followed by information on their educational qualifications such as PhD and master’s degrees. For authors with vague information, their institutional affiliation information was used, in addition to the subject categories of the journals they preferred to publish their research in. Overall, the authors’ specific area of research expertise was decided on the basis of a combination of several relevant data."}, {"url": "https://irisreading.com/10-of-the-most-prolific-authors-of-all-time/", "page_content": "21 of the Most Prolific Authors of All Time\n\nIf you had to choose between quality versus quantity, which would you choose? What if we told you that you could have both!\n\nAt least, that is the case for those in the literature world. Over the years, authors of all genres put their creative minds to the test by seeing how many books they could write. Before computers, these prolific authors managed to publish as many as over 500 novels, novellas, short stories, and indeed any piece of writing!\n\nKeep reading to see what authors have written the most books in history.\n\n1. Stephen King\n\n“I had a period where I thought I might not be good enough to publish.” – Stephen King\n\nIt is no surprise to see Stephen King as one of the most published authors. He once said that he writes 2,000 words a day, which accounts for how quickly you see his books on shelves (and on the big screen). Records say that King has published 60 full-length works and over 200 short stories.\n\nKing also has essays, screenplays, and comics. You have to wonder how one author could write something as horrific as Carrie and then create a heart-warming story like The Green Mile. King is definitely a writer of all trades.\n\n2. Isaac Asimov\n\n“Science fiction writers foresee the inevitable, and although problems and catastrophes may be inevitable, solutions are not.” Isaac Asimov\n\nScience-fiction enthusiasts all know who Isaac Asimov is. A legend of the genre, Asimov wrote or edited more than 500 books and hundreds of short stories. He wrote a few series of publications, including the Foundation Series, Galactic Empire, and Robot Series.\n\nMost of Asimov’s books explain the history of science in great detail. These books came with reference guides to explain the terminology in his books. Books about books, who knew!\n\n3. Kathleen Mary Lindsay\n\n“The logic behind the magic is that we create what we are imagining.” – Mary Faulkner, Complete Idiot’s Guide to Women’s Spirituality\n\nKathleen Mary Lindsay held the world record for most published books for many years. Lindsay wrote under 11 pseudonyms: Mary Faulkner, Margaret Cameron, Mary Richmond, Molly Waring, Betty Manvers, Elizabeth Fenton, Nigel Mackenzie, and Hugh Desmond. The Guinness Book of World Records reports that Faulkner has a total of 904 books.\n\n4. Jozef Ignacy Kraszewski\n\n“I’m not a writer nor an artist. Although I write a lot and I love all the beauty – I am a man of my age, a child of my nation.” – Jozef Ignacy Kraszewski\n\nJozef Ignacy Kraszewski, also known as Kleofas Fakund Pasternak, published his first book in 1830. That book was one of many in Kraszewski’s collection. The author, activist, and historian published 600 books in his lifetime. He is most well-known for his work on historical Poland. There are 29 novels in the series in 79 parts.\n\n5. Ursula Bloom\n\n“Ann was thirty-five. What was worse, she looked thirty-five.” – Ursula Bloom, Wonder Cruise\n\nUrsula Bloom was a British romance novelist who wrote over 500 books. She, like many others on this list, wrote under pseudonyms. Bloom said Charles Dickens influenced her to become an author. She was an avid reader as a kid and read all of his works before she was ten. In the 1920s and 30s, it wasn’t common to have a female journalist, but Bloom fought back and wrote for various newspapers and magazines.\n\n6. Charles Hamilton\n\n“Yarooh!” – Frank Richards, Billy Bunter of Greyfriars School\n\nThe Billy Bunter series is the humorous children’s fiction novel written by Charles Hamilton’s pseudonym, Frank Richards. The stories were initially published in a boy’s weekly story paper. Before his passing at the age of 85, he wrote about 100 million words making him one of the most prolific authors in history.\n\nHis stories were easy for kids to read, and all had a moral message; don’t smoke or gamble, be honest, and respect other races. The BBC eventually made a TV show based on the series which Hamilton wrote the scripts for.\n\n7. Barbara Cartland\n\n“I’ll keep going till my face falls off.” – Barbara Cartland\n\nWell, Barbara, it turns out you kept writing even after that! Barbara Cartland was one of the most published authors and continued publishing after her death in 2000. Cartland holds the Guinness Book of World records for the most written novels in one year. She wrote roughly 23 novels each year and had a total of 723 published pieces. After she passed, they found manuscripts of a book and released it as the Barbara Cartland Pink Collection.\n\n8. Ryoki Inoue\n\n“Abandon inertia.” – Ryoki Inoue\n\nBrazilian author Ryoki Inoue holds the Guinness World Record for being the most prolific author, with 1,075 books published under many pseudonyms.\n\nInoue would write all day and all night until he finished a book. He wrote Sequesreo Fast Food in one night. According to Ryoki.com, “In his opinion, the secret of the creative process is in 98% of sweat, 1% of talent, and 1% of luck. Moreover, discipline and application are the motive that make him to be sit in front of his computer and don’t leave until the end of his new job.”\n\nIf you ever need the motivation to finish a book or project, think about Inoue’s philosophy.\n\n9. R.L. Stine\n\nR.L Stine was once asked in a Goodreads forum, “On a scale of one to ten, how much do you enjoy traumatizing young children?”\n\nR.L. Stine cooly replied, “I enjoy getting children to read. Traumatizing them is just a bonus.”\n\nThe infamous author of the Goosebumps series and Fear Street series, Stine has 157 books posted on his website. At one point, it was said that Stine wrote one book every two weeks. Stine is still at it and has a writing program for aspiring young authors. Visit his website for more information.\n\n10. Corín Tellado\n\n“Some months, the censors rejected four novels. I told things clearly. Censorship taught me to imply things.” – Corín Tellado\n\nRomance author Corín Tellado from Spain held the world record for having sold the most books written in Spanish. Tellado published over 5,000 titles selling more than 400 million books.\n\nTellado stood out amongst all other romance novelists because she didn’t fall into the trap of happy endings with all of her books. In the 70s, her novels raised a few eyebrows as they tackled tough subjects amid the women’s rights movement.\n\n11. Jane Austin\n\n“Laugh as much as you choose, but you will not laugh me out of my opinion.”\n\nJane Austen is one of the most well-known English writers ever. She is regarded by many as being second only to Shakespeare in her crafty use of language. What makes her story even more incredible is that she was at a disadvantage against all the other authors, because she was born a woman. Yet, she overcame adversity and cultural shackles to become the most iconic novelist that the English ever produced.\n\n12. Enid Mary Blyton\n\n“The best way to treat obstacles is to use them as stepping-stones.”\n\nEnid Mary Blyton is credited with writing over 800 different books for children. One report claims that she has a higher number of cumulative book sales than even J.K. Rowling herself. Although this might have changed even as you are reading this sentence, because Rowling has continued writing.\n\nUnfortunately, Blyton died in 1986, at the age of 71, but her stories remain forever popular with children, going so far as being translated into over 90 languages.\n\n13. Jacob Neusner\n\n“Do not let people put you down. Believe in yourself and stand for yourself and trust yourself.”\n\nJacob Neusner has some of the most neglected works that made rounds across the world. His books were centered on practicing Judaism during the Mishnaic and Talmudic eras. He has over 950 books to his name, which he was involved in either directly writing them or editing the drafts. Most of his books are around 400 pages, which displays the sheer magnitude of research that must have gone into writing them.\n\nWriting completely non-fiction takes up a lot more time because of the research required. Thus, the amount of time Jacob spent writing his books was most likely far longer than that of any of his fiction writing peers.\n\n14. John Creasey\n\n“Never buy an editor or publisher a lunch or a drink until he has bought an article, story or book from you. This rule is absolute and may be broken only at your peril.”\n\nJohn Creasey is one of the most interesting mysteries revolving around great writers. Legend has it that he was rejected 768 times before he got his first approval from a publishing firm for his book. He then went on to write more than 600 books. However, he did so using 28 different pseudonyms. Hence, there’s some conflict over the exact number that can be credited to him. He’s majorly focused on Westerns but was an avid romance writer and produced several novels using the pseudonym “Margaret Cooke.”\n\n15. Georges Joseph Christian Simenon\n\n“Writing is not a profession but a vocation of unhappiness. I don’t think an artist can ever be happy.”\n\nGeorges Joseph Christian Simenon is a writer of over 200 novels written using his name and has more than 300 books written under at least 12 different pseudonyms. Simenon’s niche was detective novels, and his unique talent was in the psychological aspects of the novels themselves. His best-known work is Inspector Maigret. His writing had more intuition than deductive reasoning in solving crimes, something which greatly resonated with the audience.\n\n16. Alexandre Dumas\n\n“All human wisdom is contained in these two words – Wait and Hope”\n\nAlexandre Dumas wrote 277 books. Dumas had reportedly told Napoleon the Third that he had written over 1,200 volumes. What sets him apart is that he is more openly known to be associated with various collaborators. This makes it very challenging to give an actual number containing the exact number of works Dumas was involved with.\n\nHowever, in the old days, authors often took multi-volume novels to be individual books in themselves, instead of the continuity of one book. Therefore, Dumas’ The Three Musketeers, although technically one book now, had been counted as separate volumes back in his day.\n\n17. Charles Dickens\n\n“It was the best of times, it was the worst of times.”\n\nCharles Dickens was undoubtedly an extraordinary writer. His major acclaim to fame was his works as an incredible novelist. He produced many classics during his day, for instance, Oliver Twist, A Tale of Two Cities, David Copperfield, Bleak House, Great Expectations, and many more. Unarguably, all of the novels that he wrote can be very easily considered to be English classics.\n\n18. Jules Verne\n\n“Anything one man can imagine, other men can make real.”\n\nA French poet, a novelist, and a playwright; Verne rightfully earns his place on this list. His novels add a futuristic adventurous overtone to them, which is greatly appreciated by his audience. Being called the “father of science fiction,” Verne has played an insurmountable role in the development of the infrastructure for science fiction writing.\n\nOne of the most interesting parts about his novels is their ability to predict the technology of the future. Several things described in Verne’s novels have now become a reality, long after his sad demise.\n\n19. Lewis Caroll\n\n“If you don’t know where you are going any road can take you there.”\n\nAlice’s Adventures in Wonderland is an English classic that is widely popular throughout the world; it has been adapted into many plays and even several blockbuster films. Lewis Carroll, was the genius behind this wonderful story.\n\nIn his day, he was far more than just a novelist; an English academic, Caroll was both a mathematician, and an Anglican deacon on the side.\n\nAs if Alice’s Adventures in Wonderland wasn’t enough, Caroll went on to write the hit sequel Through the Looking-Glass. The most notable aspects of his work were his genius wordplay, apparently nonsensical logic, and the fantastical imagination. He quite literally invented the entire genre of literary nonsense.\n\n20. Emily Dickinson\n\n“That it will never come again is what makes life sweet.”\n\nEmily Dickinson never received the fame she deserved during her lifetime. However, now she is recognized by notable poets and literarians throughout the world as one of the most influential representatives of the American culture.\n\nHer voice, which reverberated through her poetry, has been a source of inspiration for many other authors, most notably, the Brontes. In 1994, she was enlisted among the 26 pivotal writers of the Western civilization by literary critic Harold Bloom. Tragically, it was only after her death that her sister found the literary equivalent of Atlantis in the form of some two thousand poems Emily had composed.\n\n21. Rabindranath Tagore\n\n“Clouds come floating into my life, no longer to carry rain or usher storm, but to add color to my sunset sky.”\n\nWas the first ever non-European lyricist who won the Nobel Prize in literature. A Bengali polymath, Tagore was a writer, composer, poet, social reformer, playwright, philosopher, and even a painter.\n\nHe is largely credited for outrightly reshaping Bengali literature. Through music and art, Tagore brought Contextual Modernism to India during the late 19th century.\n\nHe wrote novels, short stories, poems, drama, essays, and songs, all in Bengali. He later translated them into English himself.\n\nTo make an idea of how prolific his artistic life was, know that he wrote approximately 2,232 songs and over 50 volumes of poetry, not to mention the plethora of drama plays.\n\nWrapping up…\n\nWOW! That’s a lot of books to add to your 2022 reading goal. Don’t think you can do it? Well, you can with the skill of speed reading. Learning to speed read can increase your productivity skills too. Enjoy all these books, all while becoming a more productive professional. Check out all of our courses to learn more.\n\nDid we miss anyone? Let us know in the comments!"}, {"url": "https://thebookslist.com/most-prolific-authors/", "page_content": "Who are, or were, the most prolific authors in the history of novel writing? The answer will surprise you – not necessarily because of who they were, but because of how many novels they wrote.\n\nThese prolific authors are not all among the most famous writers, although some are. If you are an Agatha Christie or a Stephen King fan, you may have binged on their novels and gasped at how many pleasant hours you have spent reading them – both close to a hundred. Stephen King, already at about 85 and still writing should make his century. Agatha Christie managed about 80, and that is now final. But there are writers who have written many more novels than they have.\n\nThe question is, how is it possible that one person could write several hundred novels in one lifetime? And what drives them? We could never know the answer to the second question but the answer to the first is, whatever it is that drives them, their books are evidence that it is, indeed, possible, although you and I would not be able to do it.\n\nHere are the ten most prolific writers in descending order of the number of books they wrote:\n\nCorin Tellado, 1927- 2009\n\nAround 4,000 romantic novels\n\nMaria del Socorro Tellado Lopez (pen name Corin Tellado) with some of her many novels\n\nSpanish writer Maria del Socorro Tellado Lopez, 1927- 2009, writing under the name Corin Tellado published more than four thousand romantic novels, most of them best-sellers in the Spanish speaking world. She sold more than 400 million copies.\n\nCharles Hamilton, 1876-1961\n\nThe equivalent of 1,200 novels\n\nCharles Hamilton enjoying a pipe\n\nThe second most prolific fiction writer is Charles Hamilton, 1876-1961. It is basically impossible to count his books but he is known to have written more than 100 million words, which is the equivalent of 1,200 full length novels He also wrote about 5000 short stories.\n\nNot heard of Charles Hamilton? He wrote several series of books, mainly set in public schools, and he used a different pen name for each series, although he used his own name for his short stories, which, although lively and interesting, are hard to find these days.\n\nStill not heard of him? Well, if you are of a certain age you will have enjoyed his most famous character, Billy Bunter, “the Owl of the Remove,” a pupil at Greyfriars School, by Frank Richards, alias Charles Hamilton. Billy Bunter is a great English fictional character and interesting as a main protagonist because he is an anti-hero, regarding himself as an exemplary character – handsome and talented, vastly superior to everyone, whereas in reality he is a fat, lazy, racist obnoxious and narcissistic boy.\n\nIn the middle of Hamilton’s somewhat dated fiction Billy Bunter stands out as somehow out of place for his time, and the books are still readable, and funny. His novels are generally interesting and entertaining reads. Perhaps you liked the St Jim’s series by Martin Clifford or the Rookwood series by Owen Conquest, or The Rio Kid series by Ralph Redway. All Charles Hamilton books.\n\nRyoki Inoue, 1946 –\n\n1075 books\n\nRyoki Inoue amongst his works\n\nBrazilian author Ryoki Inoue, born 1946 has published 1075 fiction books so far, using 13 pseudonyms. Once starting a book he writes night and day without any breaks until it is finished He sometimes writes a whole book in one day or one night. He is the person who coined the wonderful phrase:\n\n“The secret of the creative process is in 98% of sweat, 1% of talent, and 1% of luck.”\n\nLauran Bosworth Paine, 1916 – 2001\n\nOver 1,000 novels\n\nClose up of Lauran Bosworth Paine\n\nAmerican writer Lauran Bosworth Paine, 1916 – 2001, is probably the most unbelievable of these special novelists. He published more than a thousand novels under seventy pen names. He more or less captured the market for western novels under some famous western fiction writer names, like A.A. Andrews, Dennis Archer, Jim Slaughter.\n\nKathleen Mary Lindsay, 1903-1973\n\n904 romantic novels\n\nKathleen Mary Lindsay (right)\n\nKathleen Mary Lindsay, 1903-1973, is the author of 904 romantic novels. She is better known as the English/South African writer, Mary Faulkner, also wrote as Margaret Cameron, Mary Richmond, Molly Waring, Betty Manvers, Elizabeth Fenton, and wrote crime novels under the names Nigel Mackenzie and Hugh Desmond. She used a further four pen names.\n\nEnid Blyton,1897-1968\n\nOver 800 children’s books\n\nThe legendary Enid Blyton\n\nEnid Blyton, 1897-1968, needs no introduction. She is probably the most well known of all British writers and read by children all around the world in translation into most of the world’s languages. She wrote more than 800 children’s books. Her characters, like Noddy, are among the most famous in all children’s literature. The Famous Five children’s names trip easily off the tongue in several languages, There are other popular series like, the Secret Seven, the Castle and Island of Adventure, the Faraway Tree, and so on, series after series.\n\nHer books are regarded as racist and socially offensive these days but she tells a good story and once a child reads a book from the Famous Five series, for example, they often find they can’t put the book down.\n\nBarbara Cartland, 1901-2000\n\nAround 700 romance novels\n\nBarbara Cartland looking glamorous in her 80s\n\nThe English version of Corin Tellado is Barbara Cartland, 1901-2000, who wrote 700 romantic novels in addition to plays, musical works, journalism and operettas. She sold a stunning 750 million copies of her books. Someone who had been a secretary employed by Barbara Cartland reported that the author spent most mornings in bed dictating her novels to her secretary. She hardly paused or retraced her steps. She often wrote a novel in two weeks. She holds the Guiness book of Records record for the number of novels published in one year – twenty seven!\n\nColonel, Prentiss Ingraham, 1843-1904\n\nOver 600 dime novels\n\nColonel Prentiss Ingraham\n\nA Confederate colonel, Prentiss Ingraham 1843-1904, began his writing career in 1872 with the novel The Masked Spy and over the following thirty years wrote more than 600 dime novels, the best known of which are The Buffalo Bill series, the Merle Monte series and the Dick Doom series. As if that were not enough he worked for Colonel Bill Cody (Buffalo Bill), ghost writing many of the showman’s best-selling books. He used a number of pseudonyms.\n\nIsaac Asimov, 1920-1992\n\nOver 500 novels\n\nIsaac Asimov on a TV chat show\n\nThe remarkable American Writer Isaac Asimov, 1920-1992, is not only in the top ten prolific writers, with more than 500 novels and hundreds of short stories, but is also one of the greatest science fiction writers. He was also the professor of biochemistry at Boston University.\n\nAbove all though, Asimov is a science fiction legend, one of the “Big Three” during his lifetime, together with Arthur C Clarke and Robert Heinlein. He is most noted for his Robot series. He presented the world of science fiction with a code that is known as “The Three Laws of Robotics,” a set of rules for the conduct of robots. He also wrote the short story, Nightfall, generally regarded as the best science fiction short story ever written.\n\nR.L. Stine, 1943 –\n\nAround 450 books\n\nThe prolific R.L. Stine\n\nR.L. Stine, born 1943, is an American writer of macabre/horror/ghost novels and stories for teenagers, He has written about 450 books on those subjects and several series that enjoy enormous popularity, for example, the Goosebumps series, Rotten School, Fear Street, Mostly Ghostly and the Nightmare Room series.\n\nAnd that’s our round up done of the world’s most prolific writers. Any other writers with enormous bibliographies you think we should add to this list? Let us know in the comments section below."}, {"url": "https://www.nytimes.com/2021/02/11/movies/jean-claude-carriere-dead.html", "page_content": "Jean-Claude Carrière, an author, playwright and screenwriter who collaborated with the director Luis Buñuel on a string of important films and went on to work on scores of other movies, among them Philip Kaufman’s “The Unbearable Lightness of Being” (1988), died on Monday at his home in Paris. He was 89.\n\nThe death was confirmed by his daughter Kiara Carrière. No cause was given.\n\nMr. Carrière had barely started in the movie business when he met Buñuel, the Spanish-born director, in 1963 (although he had already won a short-subject Oscar for a 1962 comedy he made with Pierre Étaix, “Happy Anniversary”).\n\n“At the time, he was looking for a young French screenwriter who knew the French countryside well,” Mr. Carrière recalled in a 1983 interview with the writer Jason Weiss.\n\n“I was a beginner,” he said. “I had gone to Cannes, and he was seeing various screenwriters there. I had lunch with him, we got along well, and three weeks later he chose me and I left for Madrid. Since then I haven’t stopped.”"}, {"url": "https://hbr.org/2021/11/lifes-work-an-interview-with-danielle-steel", "page_content": "Working on an old Olympia typewriter that she’s had since the start of her career, Steel has written 170 novels (as well as nonfiction and children’s books). Her debut—Going Home—was published when the first of her nine children was a toddler, and she completed many of the rest while her kids were at school or sleeping, often juggling multiple drafts of different books at once. Her latest is Flying Angels. The best-selling author attributes her popularity to being able to write honestly about “the things that hurt us or scare us” while always giving her characters “safe harbor” and her readers “a sense of hope.”\n\n\n\nBrigitte Lacombe\n\nHBR: Why and how do you produce at such a crazy pace?\n\nSteel: I used to not do as many books because I was bringing up nine children, which is time-consuming. But at a certain point, people were saying, “Can’t you write more? Can’t you write faster?” My publisher asked me to go from four to six books a year, and I thought, There’s a challenge. I’ve always worked on several books at once anyway—like an artist working on different canvases, putting them aside, then coming back. Then they asked me if I would go to seven, and I find that I enjoy it.\n\nAfter so many books, how do you come up with new ideas?\n\nMost of the time they fall out of the sky. Sometimes I read a story in the newspaper or hear about someone’s experience, and it sparks. And then I play around with it for a day or two and make notes. If I don’t like the way it feels in those preliminary scribbles, I don’t pursue it. But if it looks like it’s beginning to work, I go with it. I start thinking of the different twists and characters, and it snowballs. Eventually I handwrite an outline. That can be a six-month process, which is very important because I get to know the people, and the plot starts rolling. Then I do a typewritten outline that I send to my editor: Does she thinks it’s cuckoo or boring or good? Sometimes she loves the idea, or two or three things concern her, and she’ll share those. When she sends it back, I start.\n\nHow does the process go from there?\n\nI write each first draft from beginning to end. If it’s stuck, I unstick it; otherwise it will stay stuck. I don’t work on some chapters of one book and then switch to another, because I would get confused. Once I accidentally put a character from one book in another, and when I was rereading, I thought, Oh my God, what is this person doing here? So I write a full draft, but I put it away while my editor goes over it and go to another book. I do about five drafts of each. The process is good. It’s like marinating and seasoning the books. When I come back, I see things that I want to add or things I think are unnecessary. It gives me perspective.\n\nHow do you manage all those deadlines?\n\nI’m not one of those writers who do two or three hours in the morning and then lead their lives. When I’m working on a book, I really stay with it. I have a lot of energy, and I don’t sleep a lot. I have no hobbies. I don’t do gardening or macramé. I’ve never taken piano lessons. I’m very, very disciplined. I work about a 20-hour day. I take about five days off at Christmas, if my publisher allows, and a week in the summer. Part of it is that my house emptied out. When your kids are young, you’re running to ballet class and soccer practice and the orthodontist, and there aren’t enough hours. But when that’s gone, it’s like, What do I do now? My marriage ended around the same time the kids left, so I just worked more and more. I don’t have anything else to do!\n\nBut even when you were in the thick of parenting, you were still publishing quite often.\n\nFour a year, which was more manageable. When they were very little, I wrote only when they were asleep. Once they were in school, I would write while they were there, stop and do all the running around with them, and then write again when they went to bed, so I would get about four hours’ sleep. Occasionally one would have a nightmare or an earache, and my sleep would go out the window. One of my sons had a gorilla under his bed for several years, which really interfered. But I just had a need to write. It’s a part of my soul.\n\nWhen did you realize it could be your profession?\n\nLike most things in life, it happened by accident. I always wanted to be a fashion designer. I was very artistic. I went to French school and spent a lot of my life in Europe, and my dream was to go to Parsons School of Design, which I did; it was a joint program with New York University. But then I got sidetracked. Parsons was very intense: It weeds out the people who aren’t made for the stress of the fashion business. I was 15 when I landed there, and one of their things was to have somebody from Seventh Avenue come and criticize your work. It was terrible. I was left absolutely crushed. So I ended up working in a boutique ad and PR agency, and one of our accounts was Ladies’ Home Journal. I freelanced for them, and the publisher told me, “You write very well. You should write a book.” I was 19 years old, married with a new baby, and I thought, Oh, OK. Youth is so bold: You think you can do anything. I tried it, and I enjoyed it. My husband had a friend whose father-in-law was an important agent, and I gave him my book. He took forever to get back to me and finally, very sweetly, said, “This isn’t your talent. You should enjoy your baby, learn to cook, blah, blah.” (I’ve never done that, by the way, as my children will testify; I cook, but it’s a terrible experience for everyone.) Then I found a second agent—a woman—who was very interested and sold the book to Simon & Schuster. By that point I’d already written another book. Then I wrote five more, but those didn’t sell to anybody, so don’t ask me why I kept writing. I just got hooked.\n\nWhy did you stick with it through that dry patch?\n\nI’m terminally stubborn. I still had a job. I worked at that ad agency for five years and then I taught creative writing, so the books were a sideline. Finally, after about 11 years, I decided to give it a shot and see if I could make it on my writing. And I did. But it didn’t happen overnight.\n\nYou just believed you could find an audience for your books?\n\nI actually never thought, Gee, what do they want? I just had stories in my head that I wanted to tell, so I kept writing more, and then I took off.\n\nDid you have any mentors?\n\nThat man who told me to forget about writing was actually Alex Haley’s agent, and Alex, who wrote Roots, became my mentor. We met at a luncheon, and he read my first book and said, “You’re going to be famous one day.” He was a wonderful support system, a good friend and a father figure to me. I’m a terrible night owl, because I get so much more done at night, and he was too. He used to call me at 3 in the morning: “Are you working?” “Yes, I’m working.” “OK, that’s good.” Then he’d hang up.\n\nWhat about agent relationships? How did you develop those?\n\nI was with my first agent for a number of years, writing paperback originals, but my dream was to write hardcovers for men and women. She was very discouraging. But I wanted more. Then I met Mort Janklow, who has been my agent for 30-some years now.\n\nWhat’s the key to great partnerships between writers and their agents and publishers?\n\nWith publishers, they have to want to kill themselves to make your book a success. Agents have to see something in you—the potential for growth—and be very energetic and extremely loyal. Publishing is much more difficult today than it was before, because there are so few big houses left, which means that if for any reason you’re not happy, there aren’t many places to go. Mort has always fought for me.\n\nSurely, though, you approach the industry from a position of strength.\n\nEven at my level, the publishers hold all the cards, call all the shots. Some are nice, and some aren’t, and if they don’t want to play, or don’t want to be good to you, it’s their game. I’ve always been told I would have done much better if I were a diva, if I had tantrums and scared them to death. But I’ve never been that person.\n\nDo you think it would be different if you were a man?\n\nThere’s no question that people have done things to me professionally that they would never have pulled on a man. I think I’m often made to feel intimidated for a purpose.\n\nBut you’ve also had support from men like Alex and Mort.\n\nYes, and that support was important because I didn’t have it from anybody else. My parents were European and brought me up in a certain way: Women didn’t work. My first husband, who was 20 years older, did not like the fact that I was writing. He thought it was very inappropriate. But so long as I didn’t bother anybody with it, it was fine. My job was this dark secret—something Mom does at night when everybody sleeps. We never talked about it, and I was always tiptoeing around trying not to inconvenience anybody. I’ve always written under my maiden name, so it was a kind of second identity. But it became very awkward when I suddenly had this massive career and was famous. That was never my goal. It really snuck up on me. I wasn’t expecting it at all.\n\nWhy do you think your work is so popular?\n\nI’ve had a very full life and experienced a lot—divorce, losing a son—and I write from the heart about stuff that happens to all of us. I’m open and honest about emotions and the things that hurt us or scare us or make us happy. People relate to that. The other thing is, I feel a real responsibility to give people a sense of hope and encourage them to hang on. Yes, bad things happen to my characters, but I bring them home to a safe harbor. I call it victory at a price. You don’t get out unmarked, but hopefully you can make the best of what happens.\n\nThrough those personal traumas, especially your son’s suicide, how did you cope? Was it difficult to work? Or did work help you get through?\n\nNeedless to say, the worst thing that ever happened to me was the death of my son, and in the three weeks after, I’d never written as much in my life. I decided to write about him, because at that time, nearly 20 years ago, there was a huge stigma. He was bipolar and an amazing kid, as many bipolar people are. But if I was at a dinner party and said in conversation, “I have a mentally ill son,” dropping a bomb on the table would have had less effect. It was such a taboo. To me, it was no different than if he’d had diabetes. We spent his entire life managing medications and treatments and trying to find solutions for him. His death left a gaping hole in our lives and in my heart. So I wrote a book about him, and it became—I think it still is—required reading in medical school psychiatry departments, because it was a very honest account of what it’s like to have a bipolar kid. Back then, they thought it couldn’t be diagnosed until patients were in their twenties. Today they diagnose them at age three, and you have a much better shot at helping. So that year I wrote intensively, and it did help.\n\nBut it’s hard to predict. I had another trauma that blocked rather than fueled me. And during the pandemic confinement here in France, I found it infinitely harder to write. It was like dragging a dead rhinoceros around. I sat there some days and produced two pages in 18 hours. It was ghastly. I never realized how much I’m like a bird making a nest when I’m writing. I’ll throw in a little thing that I saw that day on the street or in a restaurant, a sunset emerging, a child being silly. But we weren’t supposed to leave our houses, except to walk a dog. I was alone in my apartment for 77 days. There was no external input for the machine.\n\nWith so many best sellers, are you always chasing another?\n\nIn a word: yes. There are many yardsticks. First, can you get it published? Then, how much did you get paid, and how many people read it, and are you on the best seller list? I’m an anxious person by nature, so I’m always afraid that my next book will be the one everyone hates. And then I’m so thrilled when it isn’t. I mean, I don’t go into hysterics if it doesn’t hit number one. But I think, Why didn’t that do better? Should I have done something differently? I really try hard with every book. I’m very driven to compete with myself. I guess I chase excellence.\n\nI have to ask about the typewriter.\n\nI’m sitting six inches away from it, looking at it now. I’m just very low-tech. I do everything wrong on a computer; I get it all jammed up. The keys are too close together: They don’t clomp, clomp, clomp when I’m writing, and it’s so easy to hit the wrong button and erase something. It would give me heart failure. Also, I’m just used to the typewriter. When I was relatively poor, at the beginning of my career, I bought it for $20 at a junk shop. It’s a very fancy German machine: an Olympia, beautifully made, with a heavy, well-spaced keyboard. I’ve written all my books on it, and I just love it. I type the first draft once, and then it is a sea of hand notes, asterisks, arrows. My editor is very patient.\n\nYou do have an online presence, though.\n\nI do a blog once a week, because I want to have some personal contact with the fans. The publisher takes bits of it and puts it on Facebook, and my assistant chases me around and says, “I need your Twitter,” which is like writing a haiku. My daughters bugged me to do Instagram. I thought it was taking pictures of your lunch, which for me is an egg or half a sandwich or a banana. There are papers all over my desk, I’m wearing my cashmere nightgown, my hair isn’t combed. I could not see putting that on Instagram. But I was badgered into it. So somebody in my house occasionally takes pictures of my dogs or me, and my daughter curates, and I write the text. One daughter now has this booming business selling tie-dye T-shirts and sweatshirts, so she sends me mountains of shirts to model. I put the pictures up, and then she says, “You owe me $300 for the 10 shirts.” And I say, “Zara, you have to pay the model—the model doesn’t pay you.” And she says, “But you’ve got the shirts.” So I told her I cannot afford to keep getting them. Anyway, although I’m very private, these things do establish a bond with readers. They feel closer to you, which is nice.\n\nDo you see yourself ever slowing down?\n\nWhen I die. I mean, I’ve done two things in my life. One, I brought up a bunch of children. Two, I write. I’m way prouder of my kids than I am of my career, but I like my career a lot too."}, {"url": "https://destinworld.com/2021/09/18/yorkshires-most-famous-authors/", "page_content": "The wild landscapes and northern industrial cities of Yorkshire in northern England evoke many images in our minds, and many famous authors and writers have hailed from this region or been inspired by it in their works.\n\nHere we list some of Yorkshire’s most famous authors and a bit about how the region marked their work so noticeably.\n\nJ. C. Atkinson (1851-1900)\n\nTwo miles outside Danby in Danby Dale is St Hilda’s church. John Christopher Atkinson is buried there – ornithologist, natural historian and author of Forty Years in a Moorland Parish: Reminiscences and Researches in Danby in Cleveland (1891) in which he meticulously describes the 70,000 miles he is said to have covered hiking the North York Moors over fifty years.\n\nForty Years in a Moorland Parish reveals Atkinson’s love of nature and of the far-flung Yorkshire parish in which he so assiduously worked. The vivid descriptions of moorland life are matched with conversations with moorland folk, most of whom would never have set foot out of the hills and dales.\n\nAlan Bennett (b. 1934)\n\nAlan Bennett’s early days in Armley, Leeds, define the man and inform much of his work. His regular forays over forty years to his house in the Dales village of Clapham further reinforce his associations with Yorkshire and add a rural landscape to the decidedly urban, working class and back-to-back backdrop that is Armley. Taken together, the rural and the urban merge to provide an influence that is unmistakably Yorkshire, with characters that are often decidedly northern, if not specifically Yorkshire, folk. His uncanny ear for Yorkshire dialect, the absurd and just plain daft things people sometimes say, office gossip minutiae, and the eccentricities of the ordinary man and woman is unmatched.\n\nYorkshire is by no means everywhere in Bennett’s work but it is all over the place, including in his books, TV plays and monologues.\n\nBarbara Taylor Bradford (b. 1933)\n\nBarbara Taylor Bradford was born, like Alan Bennett, in Armley, Leeds. The two went to the same infant school.\n\nBradford’s first success came in 1979 when A Woman of Substance was a mighty multi-million selling success – one of the top-ten bestselling novels of all time. It tells the story of Emma Harte, a downtrodden Yorkshire housemaid who pulls herself together, gets her act together and accumulates huge wealth thanks to her amazing business skills, and, no doubt, her Yorkshire thrift.\n\nCharlotte Brontë (1816-1855)\n\nThe three Brontë sisters were born at 74 Market Street in Thornton on the edge of Bradford. In 1820 their father was appointed to the perpetual curacy in Haworth seven miles away and moved with the family into the five-roomed Haworth Parsonage. Countless books and articles have been written about landscape in the novels and poetry of the three Brontë sisters – and rightly so: the use of landscape in the Brontë books defines those books and their characters, and remains one of the reasons why they have enjoyed a wide appeal since publication.\n\nCharlotte worked briefly as a governess at Stone Gappe in Lothersdale, near Skipton – the model for Gateshead Hall, the childhood home of the eponymous heroine of Jane Eyre (1847).\n\nAnne Brontë (1820-1849)\n\nAnne’s unhappy times at Blake Hall near Mirfield where she worked as a governess for the Ingham family in 1839 are vividly recalled in Agnes Grey (1847). The moors around Haworth are referenced in the opening paragraphs.\n\nIn 1840Anne took up a second post as governess under the Reverend Edmund Robinson at Thorp Green Hall. During Anne’s time at Thorp Green, she went with the family on their five-week annual holidays to Scarborough, a place she loved; the resort features in Agnes Grey’s final scenes and as Linden-Car village in The Tenant of Wildfell Hall (1848).\n\nEmily Brontë (1818-1848)\n\nEmily Brontë taught at Miss Patchett Ladies’ Academy at Law House, near Halifax, for six months in 1837-1838. She later used her experiences here as a source for parts of her only novel, Wuthering Heights (1847), published under the pseudonym, Ellis Bell. If Dante Gabriel Rossetti is to be believed, the landscape created by Emily is nothing short of chthonic: ‘A fiend of a book – an incredible monster […] The action is laid in hell, – only it seems places and people have English names there’ [Letters of Dante Gabriel Rossetti to William Allingham, 1854–1870]. While maybe not quite hell on earth, wild, bleak and desolate the setting for Wuthering Heights certainly is, and Brontë has drawn for us one of the greatest, most vivid landscapes in English literature, made all the more atmospheric and dramatic because it was there, all around her, tangible, dynamic and visible on her very doorstep at the Haworth parsonage.\n\nGeorge Gissing (1857-1903)\n\nAuthor and teacher George Gissing was born and grew up in 2–4 Thompson’s Yard, behind 60 Westgate in the Cornmarket area of Wakefield. Many of his twenty-three novels and short stories are informed by his early life in the town. An exhibition in 2017 at the The Gissing Centre, Thompson’s Yard, captured this: it took the title of one of George’s novels, A Life’s Morning, which is set in a fictional town with unmistakable echoes of Wakefield. It tells us of the tangled and tortuous love life of a poor but cultured young woman, Emily Hood, from a small town in the north of England in service as a governess to a wealthy country family. This exhibition conjured up a morning walk of 1865 taken by George from his home to the Mechanics’ Institute in Wood Street, now Wakefield College’s Performing Arts Department. It relates stories behind the buildings he would have passed, some still there, others long gone. George would have seen the frantic preparations for the Wakefield Industrial and Fine Arts Exhibition of 1865, which his father helped to organise.\n\nJames Herriot (1916-1995)\n\nJames Herriot is the pen name for James Alfred ‘Alf’ Wight, a veterinary surgeon who tapped into his experiences as a vet in the Yorkshire Dales west and north of Thirsk to produce a series of semi-autobiographical works, beginning with If Only They Could Talk in 1970. The highly popular television series based on the books was called All Creatures Great and Small.\n\nThe Dales landscapes are inextricably bound up in these stories – all the more obvious from the visual impressions afforded by the television series.\n\nSusan Hill (b. 1942)\n\nSusan Hill is a prolific author of fiction and non-fiction books. She was born in Scarborough and from the age of three attended Scarborough Convent School where she developed an interest in the theatre and literature before relocating with her family in 1958 to Coventry. While in Scarborough, Hill, from a young age, attended many performances at the Scarborough Repertory Theatre, which was twinned with the Repertory in York, and alternated productions. When the Stephen Joseph Theatre in the Round opened in a large room above the Scarborough Library she went there as often as possible too.\n\nShe describes Scarborough as\n\n“A beautiful place, with dramatic cliffs, two sweeping bays, amazing views, a Castle, a Harbour with fishing boats…. And when I was growing up there, it was a very genteel resort, full of retired and older people. Of course there were young people and I had plenty of school friends, but I still remember it as a place full of the old.”\n\nIan McMillan (b. 1956)\n\nTo say that Ian McMillan is the voice of Yorkshire, with his signature Barnsleyesque accent, would be an understatement. The man is drenched in Yorkshire, a living epitome of the three counties and an ambassador beyond peer for Yorkshireness. McMillan was born in Darfield – four miles from Barnsley – and still lives there.\n\nMcMillan’s prolific work on radio, television, on the stage and in print speaks eloquently for itself and consistently reveals an unmistakeable literary landscape forged by his upbringing and grown-up life in Darfield – a landscape that is all, and always says, Yorkshire.\n\nHonorary Mention – Bram Stoker\n\nWhile not born in Yorkshire, Abraham ‘Bram’ Stoker is forever associated with its coast thanks to his most famous novel, Dracula.\n\nHe has provided us with one of the England’s famous and haunting Yorkshire literary landscapes by making Whitby the setting for his famous Gothic novel, Dracula, published in 1897. The associations live on to this day with the terrifying ‘Dracula Experience’, spooky Dracula walks with commentary, a Bram Stoker Film Festival, productions of Dracula in the Abbey ruins, and an annual Goth weekend that fills the town with wonderful Goth costumes, Goth makeup, Goth music and, of course, unfettered Gothic fear. All of this is comparatively easy to achieve due to the unique ambience and aura of Whitby – an atmosphere that would have shrouded Stoker on his morning walks and that remains to this day.\n\nGet the Book"}, {"url": "https://www.goodreads.com/author/list/10284.Jean_Claude_Carri_re", "page_content": "Showing 30 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nBig Bhishma in Madras: In Search of the Mahabharata with Peter Brook\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://adjkjc.github.io/en.wikipedia.org/wiki/List_of_prolific_writers.html", "page_content": "Some writers have had prolific careers with hundreds of their works being published. While some best-selling authors have written a small number of books that have sold millions of copies, others have had lengthy careers and maintained a high level of output year after year. Dame Agatha Christie, the most-published novelist in history, is estimated to have sold 4 billion books, having written 69 novels and 19 plays.[1] Her works were published between 1920 and 1976, equating to around three publications every two years. Dame Barbara Cartland has also sold millions of copies of her books but wrote many more than Christie. She spent 80 years as a novelist with 722 books published, averaging one book released every 40 days of her career.[2] While Cartland wrote a significant number of full-length novels, other authors have been published many more times but have specialised in short stories. Spanish author Corín Tellado wrote over 4,000 novellas, selling 400 million copies of her books.[3]\n\nNot all authors work alone. Groups of writers, sometimes led by one central figure, have published under shared pseudonyms. The Stratemeyer Syndicate, started by Edward Stratemeyer in 1905, created numerous book series including 190 volumes of The Hardy Boys and 175 volumes of Nancy Drew. More than 1,300 books were published by the group, and although Edward L. Stratemeyer wrote several hundred, he also employed ghostwriters to keep up with the demand. These writers were given storylines and strict guidelines to follow to ensure a level of consistency within each series. Amongst the writing team was Howard R. Garis, who contributed several hundred books to the collection, one of the most active authors. Sales were estimated at over two hundred million copies before the syndicate was sold to Simon & Schuster in 1984.[4]\n\nMost authors carefully craft their work, writing and rewriting several times before publication. Some authors simply use pen and paper, while others such as Isaac Asimov spent hours at a stretch working at a typewriter.[5] Philip M. Parker, by one measure the world's most prolific author, has an entirely different approach. Parker has over 200,000 titles listed on Amazon.com, having developed an algorithm to gather publicly available data and compile it into book form.[6][7] The computer-generated nature of the books is not detailed on the sales page and the books are printed only when ordered.[6][8]\n\nProlific writers [ edit ]\n\nNotes\n\nAuthors with more than 100 books are considered for inclusion.\n\n^a Asimov celebrated his birthday on 2 January but his true date of birth is unclear.\n\nOther notable writers [ edit ]\n\nSee also [ edit ]"}]}