{"Achille-Ferdinand Carrière was a member of the Société Botanique de France and the Société Nationale d'Acclimatation de France.": [{"url": "https://prabook.com/web/achille-ferdinand.carrier/2545007", "page_content": "Achille-Ferdinand Carrier\n\npolitician Member of the National Assembly\n\nFebruary 15, 1859 (age 71) Saint-Roch, Canada East\n\nHe represented Gaspé in the Legislative Assembly of Quebec from 1890 to 1892 as a Liberal. Carrier was called to the Quebec bar in 1882. Carrier was the editor of the L\"Écho de l\"Ouest, a French-Canadian newspaper in Minneapolis. He ran unsuccessfully for a seat in the Canadian House of Commons in 1887. Carrier was defeated when he ran for reelection in 1892. He also ran unsuccessfully for the Terrebonne seat in 1897. He served as judge in the Magistrate\"s Court for Terrebonne, Joliette and Ottawa districts from 1898 to 1924. Carrier died in Quebec City at the age of 71. He was the uncle of Oscar Lefebvre Boulanger."}, {"url": "https://archive.org/details/mobot31753002239967", "page_content": "Publication date 1854 Topics Botany, Periodicals Publisher Paris : La Société Collection botanicus; biodiversity Digitizing sponsor Missouri Botanical Garden Contributor Missouri Botanical Garden Language French Volume v.12 (1864)\n\nGeoRef\n\n\n\nThe vols. are numbered both consecutively and by series: v. 26-40, 1879-1893 called also 2nd ser., v. 1-15; v. 41-47, 1894-1900 called also 3rd ser., v. 1-7; v. 48-71, 1901-1924 called also 4th ser., v. 1-24; v. 72-76, 1925-1929 called also 5th ser., v. 1-5\n\n\n\nIncludes supplements titled Session extraordinaires\n\n\n\nVols. 1 (1854)-40 (1893), 1 v. (1899)\n\n\n\nContinued by: Bulletin de la Société botanique de France. Lettres botaniques, QK1.B91794\n\n\n\nLIBRARY HAS COMPLETE HOLDINGS\n\n\n\n578\n\n\n\nsuperseded by Bulletin de la Societe botanique de France : Lettres BotaniquesMemoires began to be published in 1905 and has tp which includes Bulletin info on vol and ser published same year TK 6/94\n\nAbbreviation Bull. Soc. Bot. France Addeddate 2011-05-27 05:24:57 Bph 275.24 Call-number QK1 .B91792 Foldoutcount 0 Identifier mobot31753002239967 Identifier-ark ark:/13960/t55d9px71 Ocr ABBYY FineReader 8.0 Ocr_converted abbyy-to-hocr 1.1.11 Ocr_module_version 0.0.14 Page_number_confidence 90.82 Pages 817 Possible copyright status Permission to digitize granted by rights holder Ppi 72 Rights http://www.biodiversitylibrary.org/permissions Show More Show Less\n\nFull catalog record MARCXML\n\nThis book is available with additional data at Biodiversity Heritage Library."}, {"url": "https://everything.explained.today/Acta_Botanica_Gallica/", "page_content": "Société botanique de France explained\n\nThe Société botanique de France (SBF) is a French learned society founded on 23 April 1854.[1] At its inaugural meeting it stated its purpose as \"to contribute to the progress of botany and related sciences and to facilitate, by all means at its disposal, the education and the work of its members\" (Article 2 of the founding statutes).\n\nFoundation\n\nThe creation of the society was a result of a meeting on 12 March 1854 of the following sixteen botanists, who became founding members:\n\nThree of these participants, L. Graves, A. Passy and W. de Schoenefeld, formed a committee and established society rules inspired by the Société géologique de France in whose creation Louis Graves had taken part. The Société géologique de France also hosted the first meeting of the SBF. During the first official meeting, which took place on 24 May 1854, a committee was elected. It included A. Brongniart as president, J. Decaisne, D. Delessert and H. Moquin-Tandon as Vice-Presidents, W. de Schoenefeld and P. Duchartre as Secretaries, T. Puel and E. Cosson as vice-secretaries, Caillette de Hervilliers as treasurer and de Bouis as archivist.\n\nIn 1868 the SBF relocated to the new premises of the National Horticultural Society of France before moving, in 1949, into the premises of the Faculté de pharmacie de Paris. It was recognized as a public utility by decree of 17 August 1875. In the 1920s, several plant collections held by the Society were placed in various institutions for the conservation that the Society was not able to provide.\n\nPublications\n\nSince its foundation it has published the proceedings of its ordinary and extraordinary meetings and a review of literature. Extraordinary meetings are held in various cities in France so that members from outside Paris can also participate in the activities of the society. Botanical excursions within France and abroad have regularly been organized. Currently SBF has two publications: Acta Botanica (quarterly), including a significant number of subscriptions from institutions, and Journal de Botanique, issued as need arises and where in particular reports are published on botanical excursions (the most recent having been held in Cyprus in the Forez and Morocco).\n\nThe SBF also regularly presents various awards and prizes including, since 1904, the (in honour of the botanist Auguste Henri Cornut de la Fontaine de Coincy (1837–1903)), given in recognition of research in taxonomy.\n\nThe Society had 162 members in the first year, since when membership has varied between 500 and 800. The society has been open to women from the beginning, the first woman member having been Elisa Vilmorin (d. 1868), the widow of Louis de Vilmorin (1816–1860).\n\nRecent activities\n\nIn 2001 SBF launched a project on the development of a flora of France. In 2004 the hundred and fiftieth anniversary symposium took place, attended by 105 people. In addition to a historical survey of the Society's role in presenting botany in France, its future and its educational mission were also reasserted.\n\nSource and references\n\nFrançois Pellegrin, '\"Un siècle de Société de botanique de France\", Bulletin de la Société botanique de France, supplément to issue number 101, 1954, pp. 17–46.\n\nExternal links"}, {"url": "https://commons.wikimedia.org/wiki/Category:Soci%C3%A9t%C3%A9_botanique_de_France", "page_content": "This category has only the following subcategory.\n\nMedia in category \"Société botanique de France\"\n\nThe following 2 files are in this category, out of 2 total."}, {"url": "https://en.unionpedia.org/Soci%C3%A9t%C3%A9_botanique_de_France", "page_content": "Société botanique de France The Société botanique de France (SBF) is a French learned society founded on 24 May 1854. [1]\n\n23 relations: Adolphe-Théodore Brongniart, Alfred Moquin-Tandon, Alphonse Maille, Antoine François Passy, Charles-Philippe Robin, Cyprus, Elisa Bailly de Vilmorin, Ernest Cosson, Forez, Hippolyte François Jaubert, Jacques Nicolas Ernest Germain de Saint-Pierre, Joseph Decaisne, Learned society, Louis de Vilmorin, Louis Graves, Morocco, National Horticultural Society of France, National Museum of Natural History (France), Pierre Étienne Simon Duchartre, Société géologique de France, Taxonomy (biology), Timothée Puel, Wladimir de Schoenefeld.\n\nAdolphe-Théodore Brongniart FRS FRSE FGS (14 January 1801 – 18 February 1876) was a French botanist.\n\nNew!!: Société botanique de France and Adolphe-Théodore Brongniart · See more »\n\nChristian Horace Benedict Alfred Moquin-Tandon (7 May 1804 – 15 April 1863) was a French naturalist and doctor.\n\nNew!!: Société botanique de France and Alfred Moquin-Tandon · See more »\n\nAlphonse Maille (1813, Rouen – 30 September 1865, Paris) was a French botanist.\n\nNew!!: Société botanique de France and Alphonse Maille · See more »\n\nAntoine François Passy (23 April 1792 – 8 October 1873) was a French politician, geologist, and botanist.\n\nNew!!: Société botanique de France and Antoine François Passy · See more »\n\nCharles-Philippe Robin (4 June 1821 – 6 October 1885) was a French anatomist, biologist, and histologist born in Jasseron, département Ain.\n\nNew!!: Société botanique de France and Charles-Philippe Robin · See more »\n\nCyprus (Κύπρος; Kıbrıs), officially the Republic of Cyprus (Κυπριακή Δημοκρατία; Kıbrıs Cumhuriyeti), is an island country in the Eastern Mediterranean and the third largest and third most populous island in the Mediterranean.\n\nNew!!: Société botanique de France and Cyprus · See more »\n\nElisa Bailly de Vilmorin (3 May 1826 – 5 August 1868) was a French horticulturist and plant breeder.\n\nNew!!: Société botanique de France and Elisa Bailly de Vilmorin · See more »\n\nErnest Saint-Charles Cosson (July 22, 1819 – December 31, 1889) was a French botanist born in Paris Cosson is known for his botanical research in North Africa, and during his career he participated in eight trips to Algeria.\n\nNew!!: Société botanique de France and Ernest Cosson · See more »\n\nForez is a former province of France, corresponding approximately to the central part of the modern Loire département and a part of the Haute-Loire and Puy-de-Dôme départements.\n\nNew!!: Société botanique de France and Forez · See more »\n\nCount Hippolyte François Jaubert (28 October 1798 – 5 December 1874) was a French politician and botanist.\n\nNew!!: Société botanique de France and Hippolyte François Jaubert · See more »\n\nJacques Nicolas Ernest Germain de Saint-Pierre (1 December 1814, Saint-Pierre-le-Moûtier – 28 June 1882, Hyères) was a French botanist.\n\nNew!!: Société botanique de France and Jacques Nicolas Ernest Germain de Saint-Pierre · See more »\n\nJoseph Decaisne (7 March 1807 – 8 January 1882) was a French botanist and agronomist.\n\nNew!!: Société botanique de France and Joseph Decaisne · See more »\n\nA learned society (also known as a learned academy, scholarly society, or academic association) is an organisation that exists to promote an academic discipline, profession, or a group of related disciplines such as the arts.\n\nNew!!: Société botanique de France and Learned society · See more »\n\nPierre Louis François Lévêque de Vilmorin (1816–March 22, 1860), usually referred to as Louis de Vilmorin, the grandson of Philippe André de Vilmorin, and a member of the family firm of Vilmorin-Andrieux, devoted his life to biology and chemistry, with a focus on the breeding and cultivation of plants.\n\nNew!!: Société botanique de France and Louis de Vilmorin · See more »\n\nLouis Graves (April 6, 1883 – January 23, 1965) was a newspaper editor.\n\nNew!!: Société botanique de France and Louis Graves · See more »\n\nMorocco (officially known as the Kingdom of Morocco, is a unitary sovereign state located in the Maghreb region of North Africa. It is one of the native homelands of the indigenous Berber people. Geographically, Morocco is characterised by a rugged mountainous interior, large tracts of desert and a lengthy coastline along the Atlantic Ocean and Mediterranean Sea. Morocco has a population of over 33.8 million and an area of. Its capital is Rabat, and the largest city is Casablanca. Other major cities include Marrakesh, Tangier, Salé, Fes, Meknes and Oujda. A historically prominent regional power, Morocco has a history of independence not shared by its neighbours. Since the foundation of the first Moroccan state by Idris I in 788 AD, the country has been ruled by a series of independent dynasties, reaching its zenith under the Almoravid dynasty and Almohad dynasty, spanning parts of Iberia and northwestern Africa. The Marinid and Saadi dynasties continued the struggle against foreign domination, and Morocco remained the only North African country to avoid Ottoman occupation. The Alaouite dynasty, the current ruling dynasty, seized power in 1631. In 1912, Morocco was divided into French and Spanish protectorates, with an international zone in Tangier, and regained its independence in 1956. Moroccan culture is a blend of Berber, Arab, West African and European influences. Morocco claims the non-self-governing territory of Western Sahara, formerly Spanish Sahara, as its Southern Provinces. After Spain agreed to decolonise the territory to Morocco and Mauritania in 1975, a guerrilla war arose with local forces. Mauritania relinquished its claim in 1979, and the war lasted until a cease-fire in 1991. Morocco currently occupies two thirds of the territory, and peace processes have thus far failed to break the political deadlock. Morocco is a constitutional monarchy with an elected parliament. The King of Morocco holds vast executive and legislative powers, especially over the military, foreign policy and religious affairs. Executive power is exercised by the government, while legislative power is vested in both the government and the two chambers of parliament, the Assembly of Representatives and the Assembly of Councillors. The king can issue decrees called dahirs, which have the force of law. He can also dissolve the parliament after consulting the Prime Minister and the president of the constitutional court. Morocco's predominant religion is Islam, and the official languages are Arabic and Berber, with Berber being the native language of Morocco before the Arab conquest in the 600s AD. The Moroccan dialect of Arabic, referred to as Darija, and French are also widely spoken. Morocco is a member of the Arab League, the Union for the Mediterranean and the African Union. It has the fifth largest economy of Africa.\n\nNew!!: Société botanique de France and Morocco · See more »\n\nThe National Horticultural Society of France (French: Société nationale dhorticulture de France, or SNHF) is a horticultural society founded in 1827 by Louis-Étienne Héricart de Thury.\n\nNew!!: Société botanique de France and National Horticultural Society of France · See more »\n\nThe French National Museum of Natural History, known in French as the (abbreviation MNHN), is the national natural history museum of France and a grand établissement of higher education part of Sorbonne Universities.\n\nNew!!: Société botanique de France and National Museum of Natural History (France) · See more »\n\nPierre Étienne Simon Duchartre (27 October 1811, Portiragnes – 5 November 1894, Meudon) was a French botanist.\n\nNew!!: Société botanique de France and Pierre Étienne Simon Duchartre · See more »\n\nThe Société géologique de France (SGF) is a French learned society founded on 17 March 1830.\n\nNew!!: Société botanique de France and Société géologique de France · See more »\n\nTaxonomy is the science of defining and naming groups of biological organisms on the basis of shared characteristics.\n\nNew!!: Société botanique de France and Taxonomy (biology) · See more »\n\nJean Jacques Timothée Puel (August 22, 1813 – January 28, 1890) was a French physician and botanist.\n\nNew!!: Société botanique de France and Timothée Puel · See more »\n\nWladimir de Schoenefeld (12 January 1816 in Berlin – 8 September 1875 in Paris) was a German-born, French botanist.\n\nNew!!: Société botanique de France and Wladimir de Schoenefeld · See more »\n\nRedirects here:\n\nBotanical Society of France, Bulletin de la Société Botanique de France, Bulletin de la Société botanique de France, Societe botanique de France, Société Botanique de France.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Société_botanique_de_France"}, {"url": "https://wiki.alquds.edu/?query=Soci%C3%A9t%C3%A9_botanique_de_France", "page_content": "French learned society\n\n\"Journal de Botanique\" and \"J. Bot.\" redirect here. For other uses, see Journal of Botany (disambiguation)\n\nThe Société botanique de France (SBF) is a French learned society founded on 23 April 1854.[1] At its inaugural meeting it stated its purpose as \"to contribute to the progress of botany and related sciences and to facilitate, by all means at its disposal, the education and the work of its members\" (Article 2 of the founding statutes).\n\nFoundation [ edit ]\n\nThe creation of the society was a result of a meeting on 12 March 1854 of the following sixteen botanists, who became founding members:\n\nThree of these participants, L. Graves, A. Passy and W. de Schoenefeld, formed a committee and established society rules inspired by the Société géologique de France in whose creation Louis Graves had taken part. The Société géologique de France also hosted the first meeting of the SBF. During the first official meeting, which took place on 24 May 1854, a committee was elected. It included A. Brongniart as president, J. Decaisne, D. Delessert and H. Moquin-Tandon as Vice-Presidents, W. de Schoenefeld and P. Duchartre as Secretaries, T. Puel and E. Cosson as vice-secretaries, Caillette de Hervilliers as treasurer and de Bouis as archivist.\n\nIn 1868 the SBF relocated to the new premises of the National Horticultural Society of France before moving, in 1949, into the premises of the Faculté de pharmacie de Paris. It was recognized as a public utility by decree of 17 August 1875. In the 1920s, several plant collections held by the Society were placed in various institutions for the conservation that the Society was not able to provide.\n\nPublications [ edit ]\n\nSince its foundation it has published the proceedings of its ordinary and extraordinary meetings and a review of literature. Extraordinary meetings are held in various cities in France so that members from outside Paris can also participate in the activities of the society. Botanical excursions within France and abroad have regularly been organized. Currently SBF has two publications: Acta Botanica (quarterly), including a significant number of subscriptions from institutions, and Journal de Botanique, issued as need arises and where in particular reports are published on botanical excursions (the most recent having been held in Cyprus in the Forez and Morocco).\n\nThe SBF also regularly presents various awards and prizes including, since 1904, the Prix de Coincy [fr] (in honour of the botanist Auguste Henri Cornut de la Fontaine de Coincy (1837–1903)), given in recognition of research in taxonomy.\n\nThe Society had 162 members in the first year, since when membership has varied between 500 and 800. The society has been open to women from the beginning, the first woman member having been Elisa Vilmorin (d. 1868), the widow of Louis de Vilmorin (1816–1860).\n\nRecent activities [ edit ]\n\nIn 2001 SBF launched a project on the development of a flora of France. In 2004 the hundred and fiftieth anniversary symposium took place, attended by 105 people. In addition to a historical survey of the Society's role in presenting botany in France, its future and its educational mission were also reasserted.\n\nSource and references [ edit ]"}, {"url": "https://wiki2.org/en/Soci%C3%A9t%C3%A9_botanique_de_France", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nFrench learned society\n\n\"Journal de Botanique\" and \"J. Bot.\" redirect here. For other uses, see Journal of Botany (disambiguation)\n\nThe Société botanique de France (SBF) is a French learned society founded on 23 April 1854.[1] At its inaugural meeting it stated its purpose as \"to contribute to the progress of botany and related sciences and to facilitate, by all means at its disposal, the education and the work of its members\" (Article 2 of the founding statutes).\n\nYouTube Encyclopedic\n\n1 / 3 Views: 9 238 864 207 220\n\n[Marc-André Selosse] Voyage au pays des microbes\n\n[CUFE] - Baccalauréat en études de l'environnement\n\nC'est pas sorcier - ODYSSEE DES PLANTES Transcription\n\nFoundation\n\nThe creation of the society was a result of a meeting on 12 March 1854 of the following sixteen botanists, who became founding members:\n\nThree of these participants, L. Graves, A. Passy and W. de Schoenefeld, formed a committee and established society rules inspired by the Société géologique de France in whose creation Louis Graves had taken part. The Société géologique de France also hosted the first meeting of the SBF. During the first official meeting, which took place on 24 May 1854, a committee was elected. It included A. Brongniart as president, J. Decaisne, D. Delessert and H. Moquin-Tandon as Vice-Presidents, W. de Schoenefeld and P. Duchartre as Secretaries, T. Puel and E. Cosson as vice-secretaries, Caillette de Hervilliers as treasurer and de Bouis as archivist.\n\nIn 1868 the SBF relocated to the new premises of the National Horticultural Society of France before moving, in 1949, into the premises of the Faculté de pharmacie de Paris. It was recognized as a public utility by decree of 17 August 1875. In the 1920s, several plant collections held by the Society were placed in various institutions for the conservation that the Society was not able to provide.\n\nPublications\n\nSince its foundation it has published the proceedings of its ordinary and extraordinary meetings and a review of literature. Extraordinary meetings are held in various cities in France so that members from outside Paris can also participate in the activities of the society. Botanical excursions within France and abroad have regularly been organized. Currently SBF has two publications: Acta Botanica (quarterly), including a significant number of subscriptions from institutions, and Journal de Botanique, issued as need arises and where in particular reports are published on botanical excursions (the most recent having been held in Cyprus in the Forez and Morocco).\n\nThe SBF also regularly presents various awards and prizes including, since 1904, the Prix de Coincy [fr] (in honour of the botanist Auguste Henri Cornut de la Fontaine de Coincy (1837–1903)), given in recognition of research in taxonomy.\n\nThe Society had 162 members in the first year, since when membership has varied between 500 and 800. The society has been open to women from the beginning, the first woman member having been Elisa Vilmorin (d. 1868), the widow of Louis de Vilmorin (1816–1860).\n\nRecent activities\n\nIn 2001 SBF launched a project on the development of a flora of France. In 2004 the hundred and fiftieth anniversary symposium took place, attended by 105 people. In addition to a historical survey of the Society's role in presenting botany in France, its future and its educational mission were also reasserted.\n\nSource and references\n\nFrançois Pellegrin, '\"Un siècle de Société de botanique de France\", Bulletin de la Société botanique de France, supplément to issue number 101, 1954, pp. 17–46."}, {"url": "https://interlude.hk/best-premieres-at-the-societe-nationale-de-musique/", "page_content": "Paris has always provided the fertile soil for specialized music societies. Some have focused on early music, individual composers or single genres. Others were born from political division, or attempts to bridge them. A good many societies were based on “aesthetic beliefs, which made the city an ideological battlefield among those seeking to shape the future.” Among numerous initiatives advocating various approaches to musical progress, the Société Nationale de Musique (1871–1939) played a highly significant role. On the heels of France’s defeat in the Franco-Prussian War of 1870-71, nationalist feelings were washing over the country. On the initiative of Camille Saint-Saëns and Romain Bussine—professor of voice at the Paris Conservatoire—the National Music Society was created on 25 February 1871. The executive committee featured Bussine as president, Ernest Reyer as vice-president, Alexis Castillon serve as secretary and Jules Garcin as assistant secretary. Founding member also included Théodore Dubois, Henri Duparc, Gabriel Fauré, César Franck, Ernest Guiraud, Jules Massenet, and Paul Taffanel. A historian writes, “They were determined to unite in their efforts to spread the gospel of French music and to make known the works of living French composers.”\n\nCésar Franck: Trio Concertante No. 2 in B-flat Major, Op. 1, No. 2 “Trio de salon” (Trio Portici)\n\n\n\n\n\nThe constitution of the Société Nationale de Musique was drafted by Alexis Castillon and reads: “The proposed purpose of the Society is to aid the production and popularization of all serious works, whether published or not, by French composers. To encourage and bring to light, as far as lies within its power, all musical attempts, whatever their form, on condition that they give evidence of lofty artistic aspirations on the part of their author. Fraternally, with entire forgetfulness of self, with the firm resolve to aid each other with all their capacity, the members will unite their efforts, each in his own sphere of action, to the study and performance of the works which they shall be called upon to select and interpret.” An additional clause demanded that “no one can be part of the Society as an active member, unless he is French,” and the Latin motto “Ars Gallica” was unanimously adopted. The first concert of the society took place on 17 November 1871 at the Salle Pleyel. It featured the Trio in B-flat Major by Franck, two songs by Dubois, Five Pieces in Ancient Style by Castillon, a reduction of the Violin Concerto by Garcin, an Improvisation for tenor by Massenet, and the Caprice héroïque for two pianos by Saint-Saëns, played by the composer and Fauré.\n\nCamille Saint-Saëns: Caprice héroïque, Op. 106 (Christian Ivaldi, piano; Noël Lee, piano)\n\n\n\nFrancis Poulenc described the music of Emmanuel Chabrier as an “inexhaustible treasure.” One of the most individual composers of the French school between Berlioz and Debussy, he was a great admirer of Wagner and he had even made a pilgrimage to Bayreuth. This kind of admiration for Wagner did not sit well with the Society, but Paul Dukas defended him suggesting, “Fortunately he has shown himself capable of preserving his native originality.” Chabrier was described as the “most astonishing, eccentric and prodigious pianist one could ever encounter,” and Vincent d’Indy added, “despite over-fat fingers and a certain awkwardness in his bearing, he was capable of reaching heights of finesse and a maximum of expression which very few pianist—I should barely except Liszt and Rubinstein—have surpassed.” His Ten Pièces pittoresques date from 1880, and Marie Poitevin premiered a selection at the Société Nationale de Musique on 9 April 1881. After the premiere, César Franck is reported to have exclaimed “We have just heard something extraordinary: music which links our time with that of Couperin and Rameau.” Chabrier’s detractors did find stylistic improprieties, and Debussy, with reference to the subtitle “pittoresques” sarcastically wrote, “it categorizes things which have nothing to do with what the word represents exactly.”\n\nEmmanuel Chabrier: 10 Pièces pittoresques (Aldo Ciccolini, piano)\n\n\n\n\n\nThe society was immensely popular from the very beginning. Soon after its establishment it attracted roughly 150 members, with Georges Bizet, Edouard Lalo, and Charles-Marie Widor among them. Initially, the society had hoped to present orchestral concerts, but lacking funds, they steered towards piano and chamber music. A historian explains, “Composers came to meetings prepared to offer their own compositions or to accompany singers who performed their mélodies, and that this set the society’s concerts apart from routine concerts.” Concerts were for members only during the early years, but tickets were later made available to the general public. Since the society was unwilling to engage with opera, it quickly attracted young composers. Gabriel Fauré recalled, “The truth is that before 1870 I would never have dreamt of composing a sonata or a quartet. At that period there was no chance of a composer getting a hearing with works like that. I was given the incentive when Saint-Saëns founded the Société Nationale de Musique in 1871 with the primary aim of putting on works by young composers.”\n\nGabriel Fauré: Violin Sonata No. 1\n\nGabriel Fauré premiered his 1st violin sonata at the society in 1877, and Camille Saint-Saëns commented, “a magic floats above everything.” Saint-Saëns had always been a great supporter of the young Fauré, and during his time as professor at the École Niedermeyer he introduced him to Schumann, Liszt and Wagner. He also helped Fauré to find a number of organist jobs, and he introduced him to the uncontested grand diva of the nineteenth century, Pauline Viardot. Fauré was soon a regular at Viardot’s salons and his 1st violin sonata is dedicated to her. He did have trouble getting it published, however, as publishers could not get a grip on his peculiar blend of ancient and modern music. However, it perfectly expressed the aesthetic aims of the society. Fauré stayed intimately connected to the society, and he heavily leaned on his friends when a prestigious commission for an opera could not be realized. In fact, he left France for a stay in Venice, and as a guest of Winnaretta Singer, he worked on setting to a handful poems by Verlaine. Once he had returned from Italy he completed his Cinq mélodies de Venise and the complete cycle was premiered on 2 April 1892 at the Société Nationale de Musique.\n\nGabriel Fauré: Cinq mélodies de Venise (Jean-Francois Lapointe, baritone; Louise-Andree Baril, piano)\n\n\n\n\n\nBy the 1880s, the society had abandoned its purely French direction and allowed foreign composers and works to participate. By that time, Belgium-born César Franck had long secured his naturalization papers. Born in Liège into the family of a Walloon father and mother of German descent, he was sent to Paris to study with Anton Reicha. In 1836 he applied to enter the conservatory, but was initially refused on grounds of his nationality. He had to wait for an entire year for his citizenship papers to be approved, and he eventually enrolled at the Conservatoire on 4 October 1837. Almost 50 years later, Franck composed his Symphonic Variations for piano and orchestra. It was written for the French pianist Louis Diémer, who had given the Parisian première of Les Djinns. “You played splendidly,” Franck told him. “I will write you a special little piece and dedicate it to you.” Diémer did give the première at a society concert on 1 May 1886 with the composer conducting. However, under the presidency of Vincent d’Indy the society had become increasingly conservative, and Franck’s compositions did not gain favor with the greater public.\n\nCésar Franck: Symphonic Variations (Bertrand Chamayou, piano; Royal Scottish National Orchestra; Stéphane Denève, cond.)\n\n\n\nClaude Debussy joined the society in 1888. At that time Vincent d’Indy, Ernest Chausson and members of the César Franck circle, who idolized the symphonies and quartets of Beethoven, controlled it. Debussy offered his string quartet to the society, and especially to his good friend Chausson as “a token of reassurance of good faith and solidarity”. Years earlier, d’Indy had warmly supported Debussy, and the “Debussy quartet is an act, on the one hand, by which he seeks to return respect for the ideas of those who have shown him and his work respect; and, on the other hand, by which he aspires to a certain legitimacy in the eyes of those who have set the price of legitimacy.” Debussy had returned from his two-year Prix de Rome residency a couple years earlier, and he was eager to compose in a distinctly French musical style. The quartet premiered on 29 December 1893, but it was met with a bewildered reception.\n\nDebussy: String Quartet\n\nBy 1910, a group of young composers led by Mauric Ravel set up the rival Société Musicale Indépendante, and they secured Fauré as their president. They were able to attract composers like Béla Bartók, Manuel de Falla, Arnold Schoenberg, Igor Stravinsky and Anton Webern. Initially, there was an attempt to bring the old and new societies together, but they could not come to terms. In the years between the Wars the Société Nationale did present avant-garde works by composers including Arthur Honegger, Francis Poulenc, Bohuslav Martinů, Henri Lutz, Marcel Pollet, Marcel Lubey and Déodat de Séverac. However, the days of the society were numbered and it closed its doors for good in 1939. The writer Romain Rolland summarized the importance of this exceptional organization as follows, “It is with respect that we must speak of the Société Nationale, which was truly the cradle and sanctuary of French art. Everything that was great in French music, from 1870 to 1900, came through it. Without the Société Nationale, most of the works that are the honour of our music not only would not have been performed, but perhaps would not even have been written. It had the rare merit of always being ten or fifteen years ahead of public opinion, which it formed, and which it compelled to honour those whom it was the first to recognise as great.”\n\nFor more of the best in classical music, to our E-Newsletter\n\nDebussy: Pour le piano"}]}