{"Harry S. Kennedy was a member of the Democratic Party.": [{"url": "https://www.thoughtco.com/which-presidents-were-democrats-4160236", "page_content": "Since the Democratic Party was founded in 1828 as an outgrowth of the Anti-Federalist Party , a total of 16 Democrats have been elected president of the United States .\n\n01 of 16 Andrew Jackson (7th President) ivan-96 / Getty Images Elected in 1828 and again in 1832, War of 1812 general and seventh President Andrew Jackson served two terms lasting from 1829 to 1837. True to the philosophy of the new Democratic Party, Jackson advocated protecting “natural rights” against the attacks of a “corrupt aristocracy.” With distrust of sovereign rule still running hot, this platform appealed to the American people who swept him to a landslide victory in 1828 over incumbent President John Quincy Adams.\n\n02 of 16 Martin Van Buren (8th President) Hulton Archive / Stringer / Getty Images Elected in 1836, eighth President Martin Van Buren served from 1837 to 1841. Van Buren won the presidency largely by promising to continue the popular policies of his predecessor and political ally Andrew Jackson. When the public blamed his domestic policies for the financial Panic of 1837, Van Buren failed to be elected to a second term in 1840. During the campaign, newspapers hostile to his presidency referred to him as “Martin Van Ruin.”\n\n03 of 16 James K. Polk (11th President) Hulton Archive / Stringer / Getty Images Eleventh President James K. Polk served one term from 1845 to 1849. An advocate of Andrew Jackson’s “common man” democracy, Polk remains the only president to have served as Speaker of the House. Though considered a dark-horse in the 1844 election, Polk defeated Whig Party candidate Henry Clay in a nasty campaign. Polk’s support for U.S. annexation of the Republic of Texas, considered a key to western expansion and Manifest Destiny, proved popular with voters.\n\n04 of 16 Franklin Pierce (14th President) mashuk / Getty Images Serving a single term, from 1853 to 1857, 14th President Franklin Pierce was a Northern Democrat who considered the abolitionist movement the greatest threat to national unity. As president, Pierce’s aggressive enforcement of the Fugitive Slave Act angered the growing number of anti-slavery voters. Today, many historians and scholars contend that the failure of his decidedly pro-slavery policies to halt secession and prevent the Civil War make Pierce one of America’s worst and least effective presidents.\n\n05 of 16 James Buchanan (15th President) Hulton Archive / Stringer / Getty Images Fifteenth President James Buchanan served from 1857 to 1861 and had previously served as Secretary of State and as a member of the House and Senate. Elected just before the Civil War, Buchanan inherited—but mostly failed to address—the issues of enslavement and secession. After his election, he angered Republican abolitionists and Northern Democrats alike by supporting the Supreme Court’s Dred Scott v. Sandford ruling and siding with southern lawmakers in their attempts to admit Kansas to the Union as a pro-slavery state.​\n\n06 of 16 Andrew Johnson (17th President) PhotoQuest / Getty Images Considered one of the worst U.S. presidents, 17th President Andrew Johnson served from 1865 to 1869. Having been elected vice president to Republican Abraham Lincoln on the post-Civil War reconstruction period National Union ticket, Johnson assumed the presidency after Lincoln was assassinated. As president, Johnson’s refusal to ensure the protection of formerly enslaved people from potential federal prosecution resulted in his impeachment by the Republican-dominated House of Representatives. Though he was acquitted in the Senate by one vote, Johnson never ran for reelection.\n\n07 of 16 Grover Cleveland (22nd and 24th President) THEPALMER / Getty Images As the only president ever elected to two non-consecutive terms, 22nd and 24th President Grover Cleveland served from 1885 to 1889 and from 1893 to 1897. His pro-business policies and demand for fiscal conservatism won Cleveland the support of both Democrats and Republicans. However, his inability to reverse the depression of the Panic of 1893 decimated the Democratic Party and set the stage for a Republican landslide in the 1894 mid-term congressional election. Cleveland would be the last Democrat to win the presidency until the 1912 election of Woodrow Wilson.\n\n08 of 16 Woodrow Wilson (28th President) Getty Images/De Agostini / Biblioteca Ambrosiana Elected in 1912, after 23 years of Republican dominance, Democrat and 28th President Woodrow Wilson would serve two terms from 1913 to 1921. Along with leading the nation during World War I, Wilson drove the enactment of progressive social reform legislation the likes of which would not be seen again until Franklin Roosevelt’s New Deal of 1933. Issues facing the nation at the time of Wilson’s election included the question of women’s suffrage, which he opposed, calling it a matter for the states to decide.\n\n09 of 16 Franklin D. Roosevelt (32nd President) Getty Images / De Agostini / Biblioteca Ambrosiana Elected to an unprecedented and now constitutionally impossible four terms, 32nd President Franklin D. Roosevelt, popularly known as FDR, served from 1933 until his death in 1945. Widely considered one of the greatest presidents, Roosevelt led the United States through no less desperate crises than the Great Depression during his first two terms and World War II during his last two. Today, Roosevelt’s depression-ending New Deal package of social reform programs is considered the prototype for American liberalism.\n\n10 of 16 Harry S. Truman (33rd President) Bettmann Archive / Getty Images Perhaps best known for his decision to end World War II by dropping atomic bombs on the Japanese cities of Hiroshima and Nagasaki, 33rd president Harry S. Truman took office upon the death of Franklin D. Roosevelt and served from 1945 to 1953. Despite famous headlines erroneously announcing his defeat, Truman defeated Republican Thomas Dewey in the 1948 election. As president, Truman faced the Korean War, the emerging threat of communism, and the start of the Cold War. Truman’s domestic policy marked him as a moderate Democrat whose liberal legislative agenda resembled Franklin Roosevelt's New Deal.\n\n11 of 16 John F. Kennedy (35th President) The LIFE Picture Collection/Getty Images / Getty Images Popularly known as JFK, John F. Kennedy served as 35th president from 1961 until his assassination in November 1963. Serving at the height of the Cold War, JFK spent much of his time in office dealing with relations with the Soviet Union, highlighted by the tense atomic diplomacy of the 1962 Cuban Missile Crisis. Calling it the “New Frontier,” Kennedy’s domestic program promised greater funding for education, medical care for the elderly, economic aid to rural areas, and an end to racial discrimination. In addition, JFK officially launched America into the “Space Race” with the Soviets, culminating with the Apollo 11 moon landing in 1969.​\n\n12 of 16 Lyndon B. Johnson (36th President) LBJ signs the voting rights act. Bettmann / Getty Images Assuming the office after the assassination of John F. Kennedy, 36th President Lyndon B. Johnson served from 1963 to 1969. While much of his time in office was spent defending his often controversial role in the escalation of U.S. involvement in the Vietnam War, Johnson succeeded in passing legislation first conceived in President Kennedy’s “New Frontier” plan. Johnson’s “Great Society” program, consisted of social reform legislation protecting civil rights, prohibiting racial discrimination, and expanding programs like Medicare, Medicaid, aid to education, and the arts. Johnson is also remembered for his “War on Poverty” program, which created jobs and helped millions of Americans overcome poverty.\n\n13 of 16 Jimmy Carter (39th President) Bettmann / Getty Images The son of a successful Georgia peanut farmer, Jimmy Carter served as 39th president from 1977 to 1981. As his first official act, Carter granted presidential pardons to all Vietnam War-era military draft evaders. He also oversaw the creation of two new cabinet-level federal departments, the Department of Energy and the Department of Education. Having specialized in nuclear power while in the Navy, Carter ordered the creation of America’s first national energy policy and pursued the second round of Strategic Arms Limitation Talks. In foreign policy, Carter escalated the Cold War by ending détente. Near the end of his single term, Carter was faced by the 1979-1981 Iran hostage crisis and the international boycott of the 1980 Summer Olympics in Moscow.\n\n14 of 16 Bill Clinton (42nd President) Getty Images/Michael Loccisano Former Arkansas governor Bill Clinton served two terms as the 42nd president from 1993 to 2001. Considered a centrist, Clinton attempted to create policies that balanced conservative and liberal philosophies. Along with welfare reform legislation, he drove the creation of the State Children's Health Insurance Program. In 1998, the House of Representatives voted to impeach Clinton on charges of perjury and obstruction of justice relating to his admitted affair with White House intern Monica Lewinsky. Acquitted by the Senate in 1999, Clinton went on to complete his second term during which the government recorded its first budget surplus since 1969. In foreign policy, Clinton ordered U.S. military intervention in Bosnia and Kosovo and signed the Iraq Liberation Act in opposition to Saddam Hussein.\n\n15 of 16 Barack Obama (44th President) Sean Gallup / Getty Images The first African American elected to the office, Barack Obama served two terms as 44th president from 2009 to 2017. While best remembered for “Obamacare,” the Patient Protection and Affordable Care Act, Obama signed many landmark bills into law. This included the American Recovery and Reinvestment Act of 2009, intended to bring the nation out of the Great Recession of 2009. In foreign policy, Obama ended U.S. military involvement in the Iraq War but increased U.S. troop levels in Afghanistan. In addition, he orchestrated a reduction of nuclear weapons with the United States-Russia New START treaty. In his second term, Obama issued executive orders requiring fair and equal treatment of LGBT Americans and lobbied the Supreme Court to strike down state laws banning same-sex marriage."}, {"url": "https://www.britannica.com/event/United-States-presidential-election-of-1960", "page_content": "United States presidential election of 1960 , American presidential election held on November 8, 1960, in which Democrat John F. Kennedy narrowly defeated Republican Vice Pres. Richard M. Nixon . Kennedy thus became the first Roman Catholic and the youngest person ever elected president . Kennedy was also the first president born in the 20th century.\n\nKennedy and Humphrey were the only major Democratic contenders to enter presidential primaries in 1960. Their first significant primary was in Wisconsin in April. Both Humphrey and Kennedy campaigned energetically in that state, which borders Humphrey’s home state of Minnesota. Kennedy won easily and was especially strong in Milwaukee and other areas where there were large numbers of Catholic voters. A month later Kennedy all but eliminated Humphrey from consideration by defeating him in West Virginia, a heavily Protestant state, proving that he could win in a state with few Catholics.\n\nThroughout the primaries and the fall campaign, Kennedy’s religion was a dominant issue. He would become only the second Roman Catholic ever to be nominated for president by a major party (the first was Democratic Gov. Al Smith of New York, who lost to Herbert Hoover in 1928 ). Some Protestant ministers and prominent laymen expressed fears that a Catholic president would be under the domination of the pope and would not always be free to act in the best interests of the country, charges which Kennedy denied.\n\nOn the Republican side there was little doubt that their nominee would be Nixon. Gov. Nelson A. Rockefeller of New York , who had indicated late in 1959 that he might seek the Republican nomination , withdrew in late December in the face of almost total opposition by Republican Party leaders. Nixon entered some of the primaries, but only to demonstrate his vote-getting abilities. He never faced any serious opposition.\n\nThe Republican platform promised to continue and to improve upon the programs of the Eisenhower administration. Although there were some signs of dissatisfaction with the administration because of its failure to pursue aggressive action in such as areas as military programs, aid to depressed areas, and space exploration , it was generally agreed that Eisenhower’s prestige was as high as it had ever been and that the president’s support was a distinct advantage to Nixon.\n\nKennedy went to the Democratic National Convention in Los Angeles , held July 11–15, 1960, as the front-runner for the nomination, with some 600 delegates of the 761 needed for nomination secured. Johnson, however, hoped to wrest the nomination from Kennedy. Nevertheless, Kennedy won the nomination on the first ballot, with 806 votes. Kennedy then surprised most of his supporters by picking Johnson as his vice presidential running mate. The selection was generally interpreted as a move to hold the South, where opposition to Kennedy’s religion was strong and where the traditional Democratic leanings of the voters were changing. The party platform adopted at Los Angeles promised to expand the country’s defense and foreign aid programs. It also committed the Democratic Party, controversially, to civil rights . In his acceptance speech, Kennedy said the American people needed to be prepared to sacrifice in the years ahead. There were, he said, stimulating “new frontiers” to be crossed by the United States .\n\nThe general election campaign\n\nPresidential posturing began in earnest when the U.S. Congress reconvened in August, after the political conventions had been concluded. Both nominees were principal figures in the session, which was held in a politically charged atmosphere. As vice president, Nixon presided over the Senate. He also was a key figure in determining Republican strategy in a Congress that was controlled by the Democrats. As a senator from Massachusetts and as an author of the minimum-wage bill that was one of the principal measures to be acted upon during the session, Kennedy had an important stake in seeing to it that the achievements of the session were substantial.\n\nThe legislative achievements of Congress were mixed, but, by the time the traditional presidential campaign season kicked off on Labor Day in September, Nixon’s and Kennedy’s responsibilities in Congress were all but forgotten. At the time, the presidential campaign was the longest and the most intensive ever held in the United States. Crisscrossing the country on planes, trains, automobiles, and buses, Nixon and Kennedy were speaking, shaking hands, and conferring with politicians from coast to coast for most of September, for all of October, and for the seven days of November preceding the election.\n\nKennedy tackled the election issue of his Catholicism in a speech to a group of Protestant ministers in Houston. In that speech, on September 12, he declared:\n\nI believe in an America that is officially neither Catholic, Protestant nor Jewish—where no public official either requests or accepts instructions on public policy from the Pope, the National Council of Churches or any other ecclesiastical source—where no religious body seeks to impose its will directly or indirectly upon the general populace or the public acts of its officials—and where religious liberty is so indivisible that an act against one church is treated as an act against all.\n\nAn unprecedented series of four television debates between the two nominees constituted the highlight of the campaign. A provision of the Federal Communications Act had been suspended by Congress earlier in the year to permit the networks to broadcast the debates without having to provide equal time for candidates of minor parties. Although the debates were sometimes compared to the historic debates between Abraham Lincoln and Stephen A. Douglas (see also Lincoln-Douglas debates), they were more in the nature of joint press conferences, with reporters asking questions. They did, however, provide voters with an opportunity to compare the two candidates. Although Nixon showed a mastery of the issues, it is generally agreed that Kennedy, with his relaxed and self-confident manner, as well as his good looks (in contrast to Nixon’s “five o’clock shadow”), benefited the most from the exchanges. An estimated 85–120 million Americans watched one or more of the debates.\n\nKennedy and Nixon both used set speeches in their public appearances. Kennedy said that the United States was falling behind the Soviet Union in the race for world supremacy and that the United States must “do better.” He pointed to the regime of Fidel Castro in Cuba—“just ten minutes by jet from the United States.” Kennedy also stressed the need for programs to deal with unemployment in chronically depressed areas and for more rapid U.S. economic growth. Nixon, the first presidential nominee to campaign in every state, emphasized that he would carry on the basic policies of the Eisenhower administration, but he also indicated that he would improve upon them in such areas as welfare programs, foreign aid, and defense. Eisenhower, who went on a “nonpolitical” inspection tour of the country in mid-October, took an active part in the last week of the campaign, when Eisenhower and Nixon appeared together in New York City. Until then, however, the president had seemed to stay in the background.\n\nWhen voters went to cast their ballots on November 7, the contest was close. In the electoral college, Kennedy captured 303 votes (34 more than was required to win), while Nixon won 219. The 14 unpledged electors in Alabama and Mississippi and 1 pledged elector in Oklahoma cast their votes for Sen. Harry F. Byrd, a Democrat from Virginia. Kennedy eked out a narrow victory in the popular vote, defeating Nixon by just under 117,000 votes. Overall, Kennedy won 49.7 percent to Nixon’s 49.5 percent. Kennedy thus became the third person elected president in the 20th century without winning a majority of the popular vote (joining Woodrow Wilson in 1912 and Harry S. Truman in 1948; in 1968 Nixon would become the fourth person in the 20th century to win the presidency without a majority). The popular vote was the closest since 1884, when Democrat Grover Cleveland defeated Republican James G. Blaine by only about 24,000 votes.\n\nCiting voting irregularities in Illinois and Texas, many observers questioned whether Kennedy had legally won those states, and some prominent Republicans—including Eisenhower—even urged Nixon to contest the results. He chose not to, however, declaring:\n\nI could think of no worse example for nations abroad, who for the first time were trying to put free electoral procedures into effect, than that of the United States wrangling over the results of our presidential election, and even suggesting that the presidency itself could be stolen by thievery at the ballot box.\n\nNixon’s supporters and critics alike, both then and later, praised him for the dignity and unselfishness with which he handled defeat and the suspicion that vote fraud had cost him the presidency.\n\nFor the results of the previous election, see United States presidential election of 1956. For the results of the subsequent election, see United States presidential election of 1964."}, {"url": "https://simple.wikipedia.org/wiki/Democratic_Party_(United_States)", "page_content": "The United States Democratic Party is a center-left party that is one of the two biggest political parties in the United States of America. The other is the Republican Party, which is the Democratic Party's main opponent, and positioned on the center-right of the political spectrum. The U.S. also has several smaller political parties known as third parties. Members of this party are known as Democrats.\n\nEvery four years the party holds a National Convention where they agree on their candidate for president. The Democratic National Committee coordinates most of the activities of the Democratic Party in all 50 United States. Since Andrew Jackson's inauguration in 1829, there have been 16 Democratic presidents (17 if including John Tyler, who, though originally elected to the Vice Presidency as a Whig, was expelled from his party shortly after taking office, became an independent, and allied with Democrats), the most recent (and current) being former Vice President Joseph R. Biden Jr. (D-DE) who took office as President of the United States in 2021.\n\nThe Democratic Party represents a broad spectrum of liberal and left-wing ideologies,including—but not limited to—classical liberalism, social democracy, progressivism, and social (modern) liberalism.\n\nPhilosophy and role in government [ change | change source ]\n\nDemocrats, also sometimes called 'the left', 'liberals' or 'progressives' make up one of the two main political parties in the United States. A mostly Democratic state is sometimes called a 'blue state'. This comes from the party’s main color, which is blue, referring to a state supporting ‘blue’ candidates.\n\nDemocrats believe in a strong government with social assistance programs to help members of society. They prefer diplomatic solutions to conflicts, and take generally multilateralist views on trade, believing that trade must be free, but fair to protect American workers, consumers, local communities, and the environment. Some Democrats are economic centrists.[9][10]\n\nSocially, most Democrats believe in sociocultural liberalism, taking pro-immigration, pro-marriage equality, and pro-choice views.[11][12][13][14]\n\nCurrent Democratic beliefs [ change | change source ]\n\nCurrently, the Democratic Party is identified by progressivism, liberalism, and left-wing policies.\n\nNot all Democrats believe in the same thing, but generally these are the things many Democrats support:\n\nProgressive income tax.\n\nHigher corporate taxes and recapturing income from overseas profits.\n\nSpending on business, education, infrastructure, clean-energy.\n\nExpanding spending on government programs.\n\nEnding the death penalty.\n\nExpanding rights to Abortion.\n\nGun control to prevent citizens from owning firearms.\n\nSupport Same-sex marriage.\n\nUniversal healthcare.\n\nDeclare Washington D.C. an official state.\n\nHelping students go to college or university for free without having to pay back the government.\n\nAllow undocumented immigrants in the U.S. to stay, pay taxes, and oppose mass deportation.\n\nMost support for Democrats comes from states in the Northeast, Upper Midwest, and the Pacific Coast, as well as from the state of Hawaii.\n\nThe symbol of the Democratic Party is the donkey.[15] Since the election of 2000, the color blue has become a symbol for Democrats.[16]\n\nPresident Thomas Jefferson\n\nHistorically, Thomas Jefferson, whom the party claims as its founder, has been often seen as symbols of the Democratic Party, particularly emphasized in the annual celebrations of Jefferson Day Dinners held since the days of Andrew Jackson. As such, the Democratic Party is also often referred to as the “Party of Jefferson.”[17]\n\nDemocratic U.S. Presidents [ change | change source ]\n\nPresidents during the 20th century\n\nPresidents during the 21st century\n\nOther famous Democratic Politicians [ change | change source ]\n\nFormer senator Daniel Inouye\n\nSenator Bernie Sanders\n\nVice President Kamala Harris\n\nIndependents who caucus with Democrats [ change | change source ]\n\nFormer Democrats [ change | change source ]\n\nRelated pages [ change | change source ]"}, {"url": "https://www.biography.com/political-figures/kennedy-family-members", "page_content": "With their wealth and power, the Kennedys have been touted as the closest thing to royalty in America. Having left their homeland of Ireland in the 1840s to escape the potato famine, the Kennedys — starting with Boston-born Patrick Joseph \"P.J.\" Kennedy (1858-1929) — built their future from the ground up and became heavily involved in the Democratic Party in Boston.\n\nTwo generations later and beyond, the Kennedy name would expand its political reach to both the national and world stage, producing a U.S. president, a U.S. attorney general, four members of the U.S. House and Senate and a number of publicly appointed and elected government officials. What the Kennedys didn't anticipate, however, was that intertwined with their unimaginable ascent to power were a series of unimaginable tragedies.\n\nWhile not nearly a comprehensive list, here are a dozen notable Kennedys who've helped shape the American political landscape and contributed to their family's historical legacy of public service.\n\nJoseph P. Kennedy Sr.\n\nJoseph Kennedy; Photo: Pictures Inc./The LIFE Picture Collection via Getty Images\n\nThe patriarch of the Kennedy political dynasty, American businessman (1888-1969) was a prominent Irish-Catholic Democrat whose political ambitions were ultimately lived out through his sons John F. Kennedy, Robert F. Kennedy and Ted Kennedy.\n\nOutside of being a wealthy investor in real estate, alcohol and entertainment, Kennedy briefly served as a U.S. Securities and Exchange Commission chairman and an American ambassador to the U.K. Although he left a controversial legacy behind (he was known to have anti-Semitic and pro-Nazi leanings), he, along with his wife Rose and his children, were a testament to public service. Out of his nine children, he would outlive four.\n\nRose Fitzgerald Kennedy\n\nRose Fitzgerald Kennedy; Photo: Keystone-France/Gamma-Keystone via Getty Images\n\nA staunch Catholic, matriarch Rose F. Kennedy (1890-1995), grew up in a wealthy and political Irish-American household (her father, John F. Fitzgerald was the mayor of Boston). After a lengthy courtship with Joseph Kennedy Sr., which was partially due to her father's disdain for him, Rose married Kennedy in 1914 and the couple went on to have nine children.\n\nBefore Rose died at the age of 104, she was honored with the rank of Papal countess by Pope Pius XII for her exemplary religious life and devotion to Catholicism.\n\nJohn F. Kennedy\n\nJohn F. Kennedy; Photo: © CORBIS/Corbis via Getty Images\n\nAfter the tragic death of older brother Joseph P. Kennedy Jr., John F. Kennedy (1917-1963) took up the political mantle for the next generation of\n\nKennedys. A Harvard graduate, Kennedy later became a decorated Naval officer in World War II. After serving as a House member and Senator of Massachusetts, he reached the highest office of the land in 1961. At 43 Kennedy became America's youngest elected president.\n\nKennedy launched his administration at the bleakest point of the Cold War, later authorizing the failed Bay of Pigs invasion and taking the country through the Cuban Missile Crisis, which almost brought the U.S. and the Soviet Union to nuclear war.\n\nAfter Kennedy's assassination in 1963 by Lee Harvey Oswald, Vice President Lyndon B. Johnson took over the administration and brought forth many of Kennedy's civil rights and tax proposals.\n\nREAD MORE: Inside John F. Kennedy's Lifelong Admiration of Winston Churchill\n\nJacqueline Kennedy Onassis\n\nJacqueline Kennedy Onassis; Photo: Getty Images\n\nAs wife to John F. Kennedy and the youngest first lady of the United States, Jacqueline Kennedy Onassis (1929-1994) became an international fashion icon and transformed the White House through her various restoration projects. A graduate of George Washington University, Onassis first met the then-Congressman Kennedy in 1952 and married him the following year. She and Kennedy had a total of four children, two of whom survived.\n\nWhen JFK was assassinated in Dallas, Onassis' blood-stained pink dress and pillbox hat became a symbol of the tragedy. Known for her love for the arts and culture, Onassis helped shaped the \"Camelot Era\" mythology. She later married Greek shipping tycoon Aristotle Onassis (to much controversy) and became a book editor in New York City.\n\nREAD MORE: How Jacqueline Kennedy Transformed the White House and Left a Lasting Legacy\n\nRobert F. Kennedy\n\nRobert F. Kennedy; Photo: Bill Eppridge/The LIFE Picture Collection via Getty Images\n\nAs the seventh child of Joseph P. Kennedy and Rose Kennedy, Robert F. Kennedy went on to follow in his big brother JFK's footsteps, serving in the Navy and graduating from Harvard. After receiving his law degree from the University of Virginia, Kennedy worked at the Justice Department but soon after left his post to help his brother win a Senate seat in 1952.\n\nUnder JFK's administration, he became the 64th United States Attorney General and built his reputation on fighting organized crime, advocating for civil rights, and shaping U.S.-Cuba foreign policy.\n\nAfter JFK's assassination, Kennedy became a U.S. Senator in 1964 and ran as a presidential candidate of the Democratic Party in 1968. While campaigning in California that year, Kennedy was gunned down by a young Palestinian man, Sirhan Sirhan, who claimed he killed the senator for being a supporter of Israel.\n\nTed Kennedy\n\nTed Kennedy; Photo: Barbara Alper/Getty Images\n\nAs the ninth and last child born to Joseph P. Kennedy and Rose Kennedy, Edward \"Ted\" Kennedy (1932-2009) would end up having the largest influence on American politics than any of his siblings before him.\n\nWith the same Ivy League pedigree as his brothers before him, Kennedy prepared himself to live up to his family's name and even earned his way into the vacant Senate seat that older brother John left behind when he was elected president. (Kennedy would be elected eight more times to the Senate by the people of Massachusetts.)\n\nBut Kennedy's political career was in deep peril after the infamous Chappaquiddick incident in 1969, resulting in the accidental drowning death of Mary Jo Kopechne. After a failed attempt to win the presidential nomination in 1980, Kennedy continued his life of public service and became known as \"The Lion of the Senate,\" emerging as a symbol of American liberalism and one of the longest-serving senators in American history. His legislative record will be remembered for its advocacy for social and economic justice and towards the end of his life, universal health care.\n\nEunice Kennedy Shriver\n\nEunice Kennedy Shriver; Photo: Hulton Archive/Getty Images\n\nAs the fifth child born to Joseph P. and Rose Kennedy, Eunice Kennedy Shriver (1921-2009) was deeply affected by her sister, Rosemary, who was sent away to a psychiatric institution after undergoing a disastrous lobotomy for an intellectual disability.\n\nAfter graduating from Stanford University with a degree in sociology, Shriver worked at the U.S. State Department and the U.S. Department of Justice and later moved to Chicago to focus on social work. In 1968 she established the Special Olympics and later that year, hosted the First International Special Olympics Summer Games in Chicago, which provided children with physical and intellectual disabilities an opportunity to compete in athletics on a larger, organized scale. In 1984 she was honored with the Presidential Medal of Freedom for her work.\n\nFrom 1953 until her death in 2009, Eunice was married to Sergeant Shriver, a former U.S. Ambassador to France and U.S. Vice Presidential candidate. The couple went on to have five children.\n\nCaroline Kennedy\n\nCaroline Kennedy; Photo: Toby Canham/Getty Images\n\nDaughter of John F. Kennedy and Jackie Kennedy Onassis, Caroline Kennedy (b. 1957) has lived her life under the radar, despite the scrutiny and fame surrounding her family. She attended Harvard as an undergraduate like her father and went on to graduate from Columbia Law School. In 1986 she married designer Edwin Schlossberg, whom she met while working at the Metropolitan Museum of Art and together they have three children.\n\nAppointed by President Barack Obama, Kennedy served as U.S. ambassador to Japan from 2013 to 2017.\n\nJohn F. Kennedy Jr.\n\nJohn F. Kennedy Jr.; Photo: Brooks Kraft LLC/Sygma via Getty Images\n\nFrom being the three-year-old toddler famously saluting his fallen father's casket in 1963 to transforming into one of the most eligible bachelors in New York City, John F. Kennedy Jr. (1960-1999) couldn't manage to steer clear of the limelight like his older sister Caroline.\n\nWhile the Kennedy name had produced many Harvard alums, JFK Jr. paved his own way and attended Brown University for his undergraduate studies. After earning his law degree from New York University School of Law, he briefly served as a Manhattan assistant district attorney and dabbled in acting before ultimately becoming co-founder of George, a magazine fusing the world of politics and entertainment, in 1995.\n\nAfter marrying fashion publicist Carolyn Bessette in 1996, JFK Jr.'s life was cut short three years later when he accidentally flew his plane into the Atlantic, killing himself, Carolyn, and her older sister Lauren.\n\nREAD MORE: The Final Days of John F. Kennedy Jr.\n\nRobert F. Kennedy Jr.\n\nRobert F Kennedy Jr.; Photo: Rich Polk/Getty Images for Waterkeeper Alliance\n\nAs the first-born son of Robert and Ethel Kennedy, Robert F. Kennedy Jr. (b. 1954) was nine years old when his uncle JFK was assassinated and 14 when he lost his own father.\n\nIn honor of RFK Sr., Kennedy attended Harvard and got his law degree at the University of Virginia. He also earned his Masters of Law degree at Pace University, where he would later teach as a professor of environmental law.\n\nAs an environmental lawyer and activist, Kennedy worked at the Natural Resources Defense Council (NRDC) as a senior attorney (1986-2017) and the Hudson, New York waterways nonprofit called Riverkeeper as its chief prosecuting attorney (1984-2017). He has also authored multiple books and published essays regarding environmental issues.\n\nAlso known for his anti-vaccine stance, Kennedy has come under fire from both the public and his family in recent years.\n\nMaria Shriver\n\nMaria Shriver; Photo: Desiree Navarro/WireImage\n\nThe second eldest child and first daughter to Sergeant and Eunice Kennedy Shriver, Maria Shriver (b. 1955) has built a successful career as an award-winning broadcast journalist, philanthropist and children's book author.\n\nAfter graduating from Georgetown University in 1977, Shriver embarked on her broadcast career — working at both CBS and NBC. She later met and married actor Arnold Schwarzeneggar who, like his famous in-laws, had political ambitions of his own. After Schwarzeneggar won the governorship of California starting in 2003, Shriver served as its First Lady (2003-2011).\n\nThe couple divorced in 2011. They have four children together.\n\nPatrick J. Kennedy\n\nPatrick J. Kennedy; Photo: Paul Morigi/WireImage\n\nAs the youngest child of Ted and Joan Bennett Kennedy, Patrick J. Kennedy (b. 1967) hadn't even completed his undergraduate degree at Providence College in Rhode Island when he beat a longstanding incumbent for a seat in the state's House of Representatives in 1988. At 21 he became the youngest Kennedy elected to office.\n\nIn 1994 he took to the national stage as a House Representative for Rhode Island's 1st Congressional District and continued to serve in seven additional election cycles, finishing his term in 2011. An advocate for mental health, Kennedy — who has publicly discussed his own struggles with addiction and bipolar disorder — has founded and continues to work with various organizations to bring attention to drug addiction and promoting research for brain diseases."}, {"url": "https://constitutioncenter.org/blog/kennedys-nomination-was-a-big-moment-for-the-primary-system", "page_content": "On July 13, 1960, Democratic Senator John F. Kennedy won his party’s nomination at a Los Angeles convention by leveraging the system of primary elections as a new factor in presidential campaigning.\n\nTo be sure, Kennedy and his team had to heavily lobby local and national political bosses to get enough votes at the convention to win a first-ballot nomination. But his performance in the West Virginia primary made voter-driven state primaries a new force in the constitutional process of selecting a President.\n\nThe Founding Fathers envisioned a much-different process of selecting a chief executive. In the original system, a convention of state delegates chose electors to represent their interests in the electoral college. The top two vote getters in the electoral college became President and Vice President. (The Constitution didn’t establish procedures beyond that for the nomination of presidential candidates.)\n\nThe system worked for two elections when George Washington was a unanimous choice for President; it quickly fell apart when political parties formed after Washington wasn’t President.\n\nIn 1804, the 12th Amendment required separate votes for presidential and vice presidential candidates, after the disastrous 1800 election and House runoff election between Thomas Jefferson and Aaron Burr. Congressional caucuses were then used to pick presidential and vice presidential candidates.\n\nBut within three decades, national nomination conventions replaced congressional caucuses as the method for choosing party nominees for President. Another House runoff in 1824 between John Quincy Adams and Andrew Jackson led to a renewed desire for state party leaders to have a bigger say in the process.\n\nThe national party convention system stood unchallenged until the 1970s, but the first presidential primaries began in the early 1900s as part of the Progressive movement. By 1916, 20 Democratic and Republican parties had primary elections, but they had little impact on how political bosses chose convention delegates and influenced conventions.\n\nThe primary system came back into play gradually after World War II. Incumbent President Harry S. Truman lost in the 1952 New Hampshire presidential primary, amid poor popularity numbers, and dropped from the race. Senator Estes Kefauver won 12 of 15 Democratic primaries, but the Democratic convention chose Adlai Stevenson, who skipped the entire primary season.\n\nAt that time, Kennedy was six years into his political career. In 1946, he ran for the House of Representatives at the age of 29 and won. His older brother had been expected to be the family’s political standard bearer, but he was killed in action during World War II.\n\nKennedy was elected three times to the House and two times to the U.S. Senate before deciding to run for president in 1960. During the 1960 primary season, 648 convention delegates would be selected in a binding primary process including 17 states and the District of Columbia.\n\nBut Kennedy only ran in 10 primaries, and he would need 761 votes to gain the nomination. The West Virginia primary became his campaign’s focus, because it would prove that Democrats in a heavily Protestant state would vote for a Catholic candidate. Kennedy had a respected opponent in Hubert Humphrey.\n\nWashington Post columnist David Broder recalled the primary in a 2010 article on the 50th anniversary of the election. Polls showed Kennedy leading by a 4-1 margin in West Virginia until religion became an issue, and he trailed by a 3-2 margin in the weeks before the election.\n\n“It was a crucial test for the ‘religious issue’ in American life, measuring whether West Virginia, heavily Democratic but overwhelmingly Protestant, would support a Roman Catholic, Kennedy, for president,” Broder said.\n\nIn the end, Kennedy aggressively campaigned and used the media in a modern fashion to dominate Humphrey in the West Virginia primary. But the hard work of winning the nomination would come in the run to, and at the convention, when Stevenson and Lyndon Johnson, who bypassed the primary process, sought to win the nomination on the floor.\n\nSo 0n July 13, 1960, Kennedy narrowly won a first-ballot nomination when Wyoming, the last state in the alphabetical roll call, put him over the top. While not relying on the primary system for his nomination, Kennedy's performance in West Virginia made them relevant.\n\nThe final crack in the traditional convention process came eight years later at the 1968 Democratic convention in Chicago. Candidate Eugene McCarthy, who won the most primary votes, lost to Humphrey in the delegate count. Humphrey had not run as an announced candidate in the 17 primaries, and only 38 percent of convention delegates were chosen by voters in primaries. (Republicans picked just 34 percent of delegates in primaries.)\n\nBoth parties soon initiated reforms to ensure that more voters had a direct role in choosing political nominees. In 1976, Democrats selected 73 percent of convention delegates in primaries, while Republicans chose 68 percent. Today, most delegates are selected in the primary process, with the exception of Super Delegates or automatic delegates who are current or former party leaders."}, {"url": "https://commonreader.wustl.edu/c/why-ted-kennedy-never-became-president-and-why-jimmy-carter-served-only-one-term/", "page_content": "Camelot’s End: Kennedy vs. Carter and the Fight That Broke the Democratic Party\n\nCampaigns, especially presidential ones, are filled with fear, terror, giant egos, and small men.\n\n—Craig Shirley, Reagan Rising: The Decisive Years, 1976-1980¹\n\n1. The Interview with No Answers\n\nOn November 4, 1979, CBS aired a one-hour special entitled Teddy, a profile of the Massachusetts senator and the last surviving brother of the Kennedy clan. It is commonly thought that this program finished off Kennedy’s 1980 presidential run before it even officially began. Kennedy was surprisingly defensive, occasionally unengaged, and frequently inarticulate when Roger Mudd questioned him. The answer that everyone thought really did Kennedy in was when Mudd asked, “Why do you want to be president?”\n\n“Well, I’m … uhh … were I to make the announcement … to run … the reasons that I would run is because I have a great belief in this country that is, it has more natural resources than any nation of the world, has the greatest educated population in the world the greatest technology of any country in the world, the greatest capacity for innovation in the world, and the greatest political system in the world.”\n\nHe stumbled on from that opening, although as he got going he stammered less and developed a bit of a cadence. The stammering would return as he continued his answer. He probably should have quit with the opening. As answers go, it was not good but hardly fatal. Kennedy would not be the first candidate, nor the last, to spew Casey Stengelese as a form of a non-answer. (Eisenhower was known to do this on occasion.)\n\nIf the night of July 18, 1969, had not happened, most Americans would have been willing to give Ted Kennedy the presidency almost by acclamation whether or not he wanted it, if only to alleviate our collective guilt over the deaths of his brothers.\n\nKennedy would argue in his autobiography that Mudd’s interview was a set-up, an ambush, that he was under the impression that the interview was going to be entirely different. Kennedy had not announced that he was running for president and would not do so until November 7, so the question was unexpected and unfair. Mudd, of course, begged to differ about how the interview was pitched to Kennedy. It scarcely matters. What is surprising is why Kennedy attempted to answer the question at all. He could have simply said: “I will explain why I want to be president when and if I announce that I am running.” Sometimes, I suppose, even the most practiced public figures, and Kennedy was surely one of them, can be utterly flummoxed by a simple question, so flummoxed that they forget the cardinal privilege of the public figure: being under no obligation to answer a question that you do not want to answer.\n\nI do not think most people, whether they liked or hated him, cared whether he had a good reason or no reason at all for running. Kennedy had a special connection to the presidency, was entitled to aspire for it, to want it, as most of the public thought, because one of his brothers was murdered while having the job and another was murdered while campaigning to get the job. If the night of July 18, 1969, had not happened, most Americans would have been willing to give Ted Kennedy the presidency almost by acclamation whether or not he wanted it, if only to alleviate our collective guilt over the deaths of his brothers.\n\nBut it was what happened on that night in July, about which Mudd sharply questioned Kennedy and where Kennedy’s answers about “the conduct” remained as doubtful as ever, that ruined his chances for the presidency. As Jon Ward writes in Camelot’s End, “What has gone unremembered is that by the time Kennedy fumbled Mudd’s most famous question, the damage had already been done.” (158) On that night, Kennedy drove his black Oldsmobile off the Dike Bridge into Poucha Pond on the tiny island of Chappaquiddick. Kennedy managed to save himself but his passenger, 28-year-old Mary Jo Kopechne, a Democratic political operative, one of the “Boiler Room Girls,” as they were called, drowned. Kennedy did not report the accident until ten hours after it happened. As the years went by, more people became skeptical of Kennedy’s account of the accident. People who hated him, and there were legions who despised the Kennedys, crucified him with it or tried to. (It should be remembered that Kennedy himself was nearly killed in a small plane crash in 1964, spending months recovering from his injuries. Who knows what effect that had on him?)\n\nIn effect, Kennedy, when he chose to run for his party’s presidential nomination in 1980, was really a dead man walking. What is interesting is that the man Kennedy challenged, incumbent Jimmy Carter, was also a dead man walking.\n\nChappaquiddick’s negative impact on Kennedy’s presidential prospects was instantaneous, so much so that his sister, Eunice, had to talk him out of vowing never to run for the presidency when he gave his televised speech apologizing for the incident. “His dead father and his martyred brothers,” Ward writes, “would hover over him until he fulfilled his destiny.” (70)\n\nIn effect, Kennedy, when he chose to run for his party’s presidential nomination in 1980, was really a dead man walking. What is interesting is that the man Kennedy challenged, incumbent Jimmy Carter, was also a dead man walking. Why did Kennedy choose this moment to run, to challenge his party’s incumbent, something almost unheard of in modern presidential politics? Why did he not run in 1972 or 1976 when the Democrats had no incumbent? (Some can recall former president Teddy Roosevelt challenging incumbent William Howard Taft in 1912 and how that turned out for the Republicans.) The challenge so damaged the Democrats that it took them twelve years to recover from it. Republican nominee Ronald Reagan beat Carter by a landslide, winning 489 of 538 electoral votes and capturing 50.7 percent of the vote to Carter’s 41 percent. Carter may have lost without Kennedy’s challenge but the challenge nearly assured it.\n\n2. The Race with No Winner\n\nCamelot’s End, the title referring to John F. Kennedy’s presidency being characterized as Camelot, a storied time in American politics and largely a myth that John’s wife, Jacqueline, especially promoted after Kennedy’s assassination in 1963, tells the story of the 1980 Democratic presidential primaries, where Ted Kennedy challenged sitting president Jimmy Carter. It makes for a good story, the two men offering such rich contrasts.\n\nCarter was the son of a hard-working Georgia peanut farmer who wound up a graduate of the U.S. Naval Academy and ultimately a submarine officer before returning to Georgia as a civilian after his father’s death, taking charge of the family peanut farm and eventually entering politics and becoming a born again Christian. Kennedy was the privileged youngest son of a rich Irish Catholic Massachusetts businessman and ambassador, Joseph Kennedy, who had great ambitions for his children. His eldest son, Joseph Jr., was killed in combat during World War II. John, senator and president, and Robert, U.S. attorney general and senator, were both the victims of violent political murder in the 1960s. Unlike Carter, who seemed sure about what he wanted to do and driven to get there, Kennedy was less certain, obscured by his more famous and more talented brothers, kicked out of Harvard for cheating (he was later readmitted), tormented by whether he could live a serious life. There was always the sense that Ted was a disappointment, not only to his father, but in some measure, to himself. Dumb, chunky Ted, the poor little rich kid! Becoming president had to be a burden to him, at least most commentators thought so. They also thought his answer to Mudd’s question about running was so inadequate because he did not want the job and subconsciously did not really want to win. That may or may not be true. What seems clearly true from Camelot’s End is that he certainly wanted Carter to lose.\n\nKennedy felt Carter was not liberal enough and particularly felt that his signature issue of national health care was being ignored. So, the faux redeemer versus the scarred reprobate was engaged. It was a contest to see how small each man could make the other appear to be.\n\nCarter met Kennedy while Carter was governor of Georgia (1971-1975) and the two men instantly disliked each other. Kennedy, the star of the Democratic Party, treated Carter as if he were Mr. Nobody from Nowhere. Carter, for his part, chose to steal Kennedy’s thunder in the speech he gave for the occasion of Kennedy’s visit, wanting Kennedy to understand that he was not about to be pushed around by the famous northern politician from the rich, storied family. Carter had been seriously thinking about a presidential run since 1972 and felt Kennedy to be his most serious rival. Carter, on some excuse, would not let Kennedy spend the night at the governor’s mansion. Kennedy would return the humiliation in spades on the night that Carter accepted the nomination at the Democratic convention by arriving for the raised unity handshake late and then forgoing the gesture entirely, treating Carter’s coronation as if he were attending the wedding of his chauffeur. (272) He also refused to campaign for Carter unless Carter paid Kennedy’s campaign debts.\n\nKennedy did not run in 1976 because of his son’s bout with cancer. In 1980, Kennedy, disappointed and exasperated by Carter’s failed leadership and seemingly fumbling presidency, challenged him, although he knew the odds were long that he could beat a sitting president, even a bad one. Kennedy felt Carter was not liberal enough and particularly felt that his signature issue of national health care was being ignored. So, the faux redeemer versus the scarred reprobate was engaged. It was a contest to see how small each man could make the other appear to be.\n\nCarter gave the impression of being pious, open, innovative, caring, and even gentle in some respects. But he was a tough, even ruthless, determined, hard-working politician who understood the trappings of power and how to use power and organization to crush his opponents. He won the presidency by being a new type of southerner, progressive on race, a technocrat, thoroughly modern, not someone harkening back to some romanticized order of privilege. (Bill Clinton would use a modified version of the Carter-esque southerner when he ran in 1992.) Carter’s appointment of Andrew Young as his ambassador to the U.N. was controversial and, at the time, path-breaking, though in the end not especially successful. More than anything, Carter’s “myopic, obsessive managerial style” would contribute greatly to his undoing. (112)\n\nCarter gave the impression of being pious, open, innovative, caring, and even gentle in some respects. But he was a tough, even ruthless, determined, hard-working politician who understood the trappings of power and how to use power and organization to crush his opponents.\n\nThe three biggest challenges for Carter were high inflation (double-digit), a hostage crisis in which Islamic militants in Iran held fifty-two American diplomats (which dragged on for months and even featured a failed rescue attempt), and the gasoline shortage (which produced lines at gas stations and even violence). The issues seemed larger than Carter’s capabilities. Carter’s approval rating at one point fell to 19 percent, the lowest of any president in the modern era. (He did manage to recover.) This, Kennedy tried to exploit but did not figure on the powerful Carter machine, the fact that, for a time, Carter’s Rose Garden approach to governing worked, and the still lingering public concerns of Chappaquiddick; in addition, Kennedy’s old-fashioned progressivism was simply out of step with the mood of the country. Reagan, despite his own bumbling and superficial rhetoric, was able to exploit public despair over the country’s problems much better. Reagan, the conservative, measured and responded to the country’s mood much better than any liberal of the time.\n\nCamelot’s End is not a scholarly book. But it is a solid, journalistic account of an important moment in the history of the Democratic Party and the United States."}, {"url": "https://www.britannica.com/biography/John-F-Kennedy", "page_content": "Whether the U.S. should maintain its embargo enforced by John F. Kennedy against Cuba is hotly debated. Some say Cuba has not met the conditions required to lift it, and the U.S. will look weak for lifting the sanctions. Others say the 50-year policy has failed to achieve its goals, and Cuba does not pose a threat to the United States. For more on the Cuba embargo debate, visit ProCon.org .\n\nEarly life\n\nThe second of nine children, Kennedy was reared in a family that demanded intense physical and intellectual competition among the siblings—the family’s touch football games at their Hyannis Port retreat later became legendary—and was schooled in the religious teachings of the Roman Catholic church and the political precepts of the Democratic Party. His father, Joseph Patrick Kennedy, had acquired a multimillion-dollar fortune in banking, bootlegging, shipbuilding, and the film industry, and as a skilled player of the stock market. His mother, Rose, was the daughter of John F. (“Honey Fitz”) Fitzgerald, onetime mayor of Boston. They established trust funds for their children that guaranteed lifelong financial independence. After serving as the head of the Securities and Exchange Commission, Joseph Kennedy became the U.S. ambassador to Great Britain, and for six months in 1938 John served as his secretary, drawing on that experience to write his senior thesis at Harvard University (B.S., 1940) on Great Britain’s military unpreparedness. He then expanded that thesis into a best-selling book, Why England Slept (1940).\n\nIn the fall of 1941 Kennedy joined the U.S. Navy and two years later was sent to the South Pacific. By the time he was discharged in 1945, his older brother, Joe, who their father had expected would be the first Kennedy to run for office, had been killed in the war, and the family’s political standard passed to John, who had planned to pursue an academic or journalistic career.\n\nBritannica Quiz Comprehension Quiz: Cold War\n\nJohn Kennedy himself had barely escaped death in battle. Commanding a patrol torpedo (PT) boat, he was gravely injured when a Japanese destroyer sank it in the Solomon Islands. Marooned far behind enemy lines, he led his men back to safety and was awarded the U.S. Navy and Marine Corps Medal for heroism. He also returned to active command at his own request. (These events were later depicted in a Hollywood film, PT 109 [1963], that contributed to the Kennedy mystique.) However, the further injury to his back, which had bothered him since his teens, never really healed. Despite operations in 1944, 1954, and 1955, he was in pain for much of the rest of his life. He also suffered from Addison disease, though this affliction was publicly concealed. “At least one-half of the days he spent on this earth,” wrote his brother Robert, “were days of intense physical pain.” (After he became president, Kennedy combated the pain with injections of amphetamines—then thought to be harmless and used by more than a few celebrities for their energizing effect. According to some reports, both Kennedy and the first lady became heavily dependent on these injections through weekly use.) None of this prevented Kennedy from undertaking a strenuous life in politics. His family expected him to run for public office and to win."}, {"url": "https://ballotpedia.org/John_F._Kennedy_(U.S._president)", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://www.britannica.com/biography/John-F-Kennedy/Congressman-and-senator", "page_content": "Congressman and senator\n\nKennedy did not disappoint his family; in fact, he never lost an election. His first opportunity came in 1946, when he ran for Congress. Although still physically weak from his war injuries, he campaigned aggressively, bypassing the Democratic organization in the Massachusetts 11th congressional district and depending instead upon his family, college friends, and fellow navy officers. In the Democratic primary he received nearly double the vote of his nearest opponent; in the November election he overwhelmed the Republican candidate. He was only 29.\n\nKennedy served three terms in the House of Representatives (1947–53) as a bread-and-butter liberal. He advocated better working conditions, more public housing, higher wages, lower prices, cheaper rents, and more Social Security for the aged. In foreign policy he was an early supporter of Cold War policies. He backed the Truman Doctrine and the Marshall Plan but was sharply critical of the Truman administration’s record in Asia. He accused the State Department of trying to force Chiang Kai-shek into a coalition with Mao Zedong. “What our young men had saved,” he told the House on January 25, 1949, “our diplomats and our President have frittered away.”\n\nHis congressional district in Boston was a safe seat, but Kennedy was too ambitious to remain long in the House of Representatives. In 1952 he ran for the U.S. Senate against the popular incumbent, Henry Cabot Lodge, Jr. His mother and sisters Eunice, Patricia, and Jean held “Kennedy teas” across the state. Thousands of volunteers flocked to help, including his 27-year-old brother Robert, who managed the campaign. That fall the Republican presidential candidate, General Dwight D. Eisenhower, carried Massachusetts by 208,000 votes; but Kennedy defeated Lodge by 70,000 votes. Less than a year later, on September 12, 1953, Kennedy enhanced his electoral appeal by marrying Jacqueline Lee Bouvier (Jacqueline Kennedy Onassis). Twelve years younger than Kennedy and from a socially prominent family, the beautiful “Jackie” was the perfect complement to the handsome politician; they made a glamorous couple.\n\nAs a senator, Kennedy quickly won a reputation for responsiveness to requests from constituents, except on certain occasions when the national interest was at stake. In 1954 he was the only New England senator to approve an extension of President Eisenhower’s reciprocal-trade powers, and he vigorously backed the opening of the St. Lawrence Seaway, despite the fact that over a period of 20 years no Massachusetts senator or congressman had ever voted for it.\n\nTo the disappointment of liberal Democrats, Kennedy soft-pedaled the demagogic excesses of Sen. Joseph R. McCarthy of Wisconsin, who in the early 1950s conducted witch-hunting campaigns against government workers accused of being communists. Kennedy’s father liked McCarthy, contributed to his campaign, and even entertained him in the family’s compound at Hyannis Port on Cape Cod in Massachusetts. Kennedy himself disapproved of McCarthy, but, as he once observed, “Half my people in Massachusetts look on McCarthy as a hero.” Yet, on the Senate vote over condemnation of McCarthy’s conduct (1954), Kennedy expected to vote against him. He prepared a speech explaining why, but he was absent on the day of the vote. Later, at a National Press Club Gridiron dinner, costumed reporters sang, “Where were you, John, where were you, John, when the Senate censured Joe?” Actually, John had been in a hospital, in critical condition after back surgery. For six months afterward he lay strapped to a board in his father’s house in Palm Beach, Florida. It was during this period that he worked on Profiles in Courage (1956), an account of eight great American political leaders who had defied popular opinion in matters of conscience, which was awarded a Pulitzer Prize in 1957. Although Kennedy was credited as the book’s author, it was later revealed that his assistant Theodore Sorensen had done much of the research and writing.\n\nBack in the Senate, Kennedy led a fight against a proposal to abolish the electoral college, crusaded for labour reform, and became increasingly committed to civil rights legislation. As a member of the Senate Committee on Foreign Relations in the late 1950s, he advocated extensive foreign aid to the emerging nations in Africa and Asia, and he surprised his colleagues by calling upon France to grant Algerian independence.\n\nDuring these years his political outlook was moving leftward. Possibly because of their father’s dynamic personality, the sons of Joseph Kennedy matured slowly. Gradually John’s stature among Democrats grew, until he had inherited the legions that had once followed Gov. Adlai E. Stevenson of Illinois, the two-time presidential candidate who by appealing to idealism had transformed the Democratic Party and made Kennedy’s rise possible."}, {"url": "https://www.nytimes.com/2020/09/01/us/politics/ed-markey-kennedy.html", "page_content": "Senator Edward J. Markey turned back a primary challenge Tuesday from Representative Joseph P. Kennedy III, handing the Kennedy family its first-ever electoral loss in Massachusetts and demonstrating the growing strength of the progressive left.\n\nForging a coalition of younger and more liberal Democrats, the sort of voters who once formed the core of the Kennedy base, Mr. Markey was winning about 54 percent of the vote when Mr. Kennedy called him to concede.\n\nBy winning renomination in a generational clash — and the marquee Democratic Senate primary of the year — Mr. Markey, 74, proved that the ascendant left is not eager to simply throw out long-serving incumbents in favor of younger rivals, such as the 39-year-old Mr. Kennedy. Mr. Markey, who was first elected to Congress in 1976, was able to outflank Mr. Kennedy with progressives, leaving the heir of Massachusetts’s most storied political dynasty little opening.\n\nClaiming victory, and wearing the same Nike Air Revolutions that became his signature as a late-in-life hipster, Mr. Markey elevated his millennial supporters and the Green New Deal they rallied around. “Tonight’s victory is a tribute to those young people,” he said, vowing that “the age of incrementalism is over.”"}], "Harry S. Kennedy was the brother of President John F. Kennedy.": [{"url": "https://people.com/politics/john-f-kennedy-famous-siblings/", "page_content": "01 of 09 Joseph Kennedy Jr. Bettmann/Getty The eldest Kennedy sibling, Joseph Kennedy Jr., was born on July 25, 1915, and was a Lieutenant in the United States Navy. Joseph Jr. had aspirations to become a politician and even planned to mount a congressional campaign in 1946, but was killed on August 12, 1944, while serving in the Navy on a World War II mission.\n\n02 of 09 John F. Kennedy Bettmann/Getty The 35th president of the United States, John F. Kennedy was born May 29, 1917. He served in World War II, enlisting in the Navy, just like his older brother, Joseph Jr. Before becoming president, J.F.K. served in both the House of Representatives and the Senate. He also won the Pulitzer Prize in 1957 for his biography, Profiles in Courage. He married Jacqueline Bouvier (widely known as Jackie) in September 1953, and the pair shared two children, Caroline and John F. Kennedy, Jr. He was assassinated on November 22, 1963, in Dallas.\n\n03 of 09 Rosemary Kennedy Keystone-France/Gamma-Keystone via Getty Rosemary Kennedy was born on Sept. 13, 1918. Rosemary's story is a tragic one: the third child of Joseph and Rose Kennedy was deprived of oxygen at birth, resulting in developmental and behavioral issues. In 1941, Rosemary's father scheduled a lobotomy for his 23-year-old daughter, and the botched procedure resulted in Rosemary becoming permanently disabled. Following the procedure, Rosemary was sent to a psychiatric facility in upstate New York and then sent to Saint Coletta School for Exceptional Children in Wisconsin, where her siblings did not see her for two decades. She died at the age of 86 on Jan. 7, 2005, of natural causes.\n\n04 of 09 Kathleen Cavendish Horace Abrahams/Keystone/Hulton Archive/Getty Kathleen Agnes Kennedy, also known as \"Kick,\" was born on Feb. 20, 1920. Kathleen worked for the Red Cross both in the United States and in England and was an aspiring journalist, writing reviews in the Washington Times-Herald. She married William Cavendish in May 1944, though he was killed in World War II just four months later. On May 13, 1948, Kathleen tragically died with her married lover in a plane crash over France.\n\n06 of 09 Patricia Kennedy Lawford The LIFE Picture Collection/Getty Born on May 6, 1924, Patricia had aspirations of becoming a film producer and director. Her father, Joseph Kennedy Sr., not only had a knack for running his sons' political careers, but also Hollywood studios. She married English actor Peter Lawford in April 1954 and they had four children together: Christopher (pictured with his mother), Sydney, Victoria and Robin. The pair divorced in 1966. She died of pneumonia on Sept. 17, 2006. She was 82.\n\n07 of 09 Robert F. Kennedy PhotoQuest/Getty. Robert Francis Kennedy was born on Nov. 20, 1925. Following in the footsteps of his older brothers, Robert joined the Navy and also had political aspirations. He married Ethel Skakel in June 1950 and the couple had 11 children together. He was appointed the U.S. Attorney General by his brother, J.F.K., and served as New York State Senator from January 1965 until he was assassinated while campaigning for the presidency on June 6, 1968.\n\n08 of 09 Jean Kennedy Smith Jean Kennedy Smith in 2017. Sonia Moskowitz/WireImage Jean Kennedy Smith was born on Feb. 20, 1928. In 1993, at the age of 65, Jean was appointed the ambassador to Ireland under Bill Clinton and played a role in the peace talks in Northern Ireland. She wrote a memoir in 2016 titled The Nine of Us: Growing Up Kennedy, reflecting on her eight siblings and her family's political prowess. \"It is hard for me to fully comprehend that I was growing up with brothers who eventually occupy the highest offices of our nation, including president of the United States,\" Jean wrote, according to the Associated Press. \"At the time, they were simply my playmates. They were the source of my amusement and the objects of my admiration.\" She was the last surviving Kennedy sibling when she died on June 17, 2020. She was 92."}, {"url": "https://www.worldhistoryedu.com/who-are-john-f-kennedys-siblings/", "page_content": "Much is known about John F. Kennedy’s highly successful political career which ended abruptly in 1963. But who are John F. Kennedy’s siblings? And what do you know about JFK’s family? At the peak of his life accomplishments, JFK etched his name into history as America’s 35th President. Well, behind J.F. Kennedy, lies a great family foundation.\n\nToday, we bring you an informative family profile of John F. Kennedy’s closest blood relations. The fact is that the former U.S. president and his siblings came from a politically-inclined family, known as the Kennedy family. Here is an overview of the great Kennedy family; the producers of America’s statesmen.\n\nThe Kennedy Family\n\nComing from Irish backgrounds, the first members of the Kennedy family set foot in America around 1849. After settling in America, it took only 35 years before the family started producing great political leaders for America. Some prominent Kennedys went on to fill top positions in civil service, namely; senators, ambassadors, representatives, president, first ladies and so on.\n\nIn 1884, Patrick Joseph Kennedy opened American political doors for the future Kennedys when he got to serve the Massachusetts state as a legislator. About 33 years later, the most famous of the Kennedys and future president of the United States, John F. Kennedy was born. He and his siblings were born to Joseph Kennedy Sr and Rose Elizabeth Fitzgerald.\n\nAll in all, the Kennedys would go on to consistently feature in politics, business, civil service, and entertainment. In the political arena, the Kennedy family is strongly affiliated with the Democratic Party. Also, a great deal of them are products of Harvard University, located in Cambridge, Massachusetts.\n\nSiblings of John F. Kennedy\n\nJohn F. Kennedy was his parents’ second child. He had 3 brothers and 5 sisters. The lists of John F. Kennedy’s siblings are Joseph Jr, Jean, Rosemary, Patricia, Kathleen, Eunice, Robert, and Ted (aka Edward).\n\nJoseph Patrick Kennedy Jr\n\nHe was born on 25th July 1915. Joseph was a Harvard graduate who later joined the US Navy. He was the eldest child among the Kennedy siblings. Having received flying lessons from a flight school, Joseph became a naval pilot. He accomplished a number of military combat operations in the U.K. Sadly, he died on 12th August 1944 when his plane exploded in mid-air. He was only 29-years-old.\n\nRosemary Kennedy\n\nShe came into the Kennedy family on 13th September 1918. Her birth coincided with the Spanish Flu outbreak in Brookline; she made it through the epidemic that wiped out 20-50 million people.\n\nHaving gone through a delayed birth experience with her mother, Rose grew up and struggled with behavioral and learning difficulties. Doctors linked her abnormal behavioral patterns to inadequate oxygen which arose from her mom’s womb accident. After spending a great time in the UK, Rosemary returned to face doom in America.\n\nFearing for Rose’s lunacy and the family’s reputation, her dad authorized doctors to perform a lobotomy procedure to correct her waywardness. Unfortunately, the procedure failed woefully and it worsened the young lady’s condition. She couldn’t talk nor walk for the rest of her life. Aged 86, Rosemary Kennedy left the world in 2005.\n\nKathleen Cavendish Kennedy\n\nShe was born on 20th February 1920. Kathleen was an alumnus of Queen’s College in London. Kathleen found home in London when her dad was the US Ambassador to the UK. She worked with the Red Cross and even met her ex-husband Lord Hartington over there. Her marriage earned her the title Marchioness of Hartington. Tragedy befell her when Hartington died on war grounds in 1944. Four years later, Kathleen tragically perished with her new partner in a plane crash.\n\nEunice Kennedy Shriver\n\nSimilar to her younger brother Robert, Eunice’s birth took place at Brookline, Massachusetts, on 10th July 1921. Eunice, Stanford graduate with a sociology degree, started her career working in various social foundations. Knowing that her sister Rose had a special intellectual problem, Eunice sweat and toiled to get the foundation – Joseph P. Kennedy Jr Foundation – up and running.\n\nEunice and the Foundation achieved remarkable progress in helping intellectually-disabled people live a normal life. As a sports enthusiast, she was part of the team that founded the Special Olympics – a sports event, like the Summer and Winter Olympics, for people with intellectual challenges. The world dearly missed her motherly love and care and passion when she passed away on 11th August 2009.\n\nPatricia Kennedy\n\nShe was born on 6th May 1924. Patricia showed interest in film productions. Growing up, she attended Rosemont College and became a socialite. Her marriage to movie star Peter Lawford ended in a divorce in 1966. She then performed some duties at the John F. Kennedy’s Library and Museum. Patricia developed bad drinking habits before she died in 2006.\n\nRead More:\n\nRobert F. Kennedy\n\nHis birth to the political family occurred in Brookline, Massachusetts, on 20th November 1925. Robert Kennedy had the chance to study at Harvard University but his studies were interrupted by World War II. Robert paused his studies and joined the U.S. Navy. After the war was over, he went back and graduated from Harvard in 1948.\n\nHis political journey kicked off when he acquired a law certificate from the University of Virginia. Robert slowly climbed the political ladder and became a Senator – a very prominent and influential Democrat for that matter. In June 1968, he was vying for the US presidency when an immigrant (one Sirhan Sirhan) fatally gunned him down, simply because Robert supported Israel.\n\nJean Ann Kennedy Smith\n\nJean’s birth occurred on 20th February 1928 in Boston, Massachusetts. Jean was an alumnus of the Manhattanville College. She grew up in the family’s political environment and rose to become the 25th US Ambassador to Ireland from 17th June 1993 to 17th September 1998. She occupied that position in President Clinton’s administration.\n\nPost her diplomatic career, Jean continued working very hard for the organization she founded in 1974 – the Very Special Art (VSA). Jean’s organization is a world-acclaimed non-profit body that opened room for disabled people to show their talents.\n\nFor her selfless service to the United States, Jean Kennedy earned the Presidential Medal of Freedom (the highest honor that can be given to a U.S. civilian) from US President Barack Obama in 2011.\n\nOn Thursday, 18 June, 2020, the world woke up to the news of the death of Jean Ann Kennedy, the last surviving sibling of JFK. The former diplomat and activist was 92 at the time of her death. She outlived her husband Mr Smith, a successful businessman and New York financier who died in 1990. Jean Kennedy Smith was survived by her four children, William, Kym, Amanda and Stephen, and six grandchildren.\n\nTed Kennedy\n\nBorn in Boston, Massachusetts, on 22nd February 1932, Ted was one of the most prominent political figures that ever emerged from the Kennedy family. At 30-years-old, Ted became a Senator. The 9-time elected Congressman oversaw the creation of many reforms in the legislature.\n\nBorn to conquer, Ted – the youngest of the Kennedy siblings – miraculously survived a plane crash and a car accident in 1964 and 1969 respectively. As a politician, he stood against the Vietnam War. The Senate knew Ted as a fierce politician who hardly minced his words. After losing out to a battle with brain cancer, Ted Kennedy died at his home in Cape Cod, Massachusetts on August 25, 2009."}, {"url": "https://www.britannica.com/biography/John-F-Kennedy", "page_content": "Whether the U.S. should maintain its embargo enforced by John F. Kennedy against Cuba is hotly debated. Some say Cuba has not met the conditions required to lift it, and the U.S. will look weak for lifting the sanctions. Others say the 50-year policy has failed to achieve its goals, and Cuba does not pose a threat to the United States. For more on the Cuba embargo debate, visit ProCon.org .\n\nEarly life\n\nThe second of nine children, Kennedy was reared in a family that demanded intense physical and intellectual competition among the siblings—the family’s touch football games at their Hyannis Port retreat later became legendary—and was schooled in the religious teachings of the Roman Catholic church and the political precepts of the Democratic Party. His father, Joseph Patrick Kennedy, had acquired a multimillion-dollar fortune in banking, bootlegging, shipbuilding, and the film industry, and as a skilled player of the stock market. His mother, Rose, was the daughter of John F. (“Honey Fitz”) Fitzgerald, onetime mayor of Boston. They established trust funds for their children that guaranteed lifelong financial independence. After serving as the head of the Securities and Exchange Commission, Joseph Kennedy became the U.S. ambassador to Great Britain, and for six months in 1938 John served as his secretary, drawing on that experience to write his senior thesis at Harvard University (B.S., 1940) on Great Britain’s military unpreparedness. He then expanded that thesis into a best-selling book, Why England Slept (1940).\n\nIn the fall of 1941 Kennedy joined the U.S. Navy and two years later was sent to the South Pacific. By the time he was discharged in 1945, his older brother, Joe, who their father had expected would be the first Kennedy to run for office, had been killed in the war, and the family’s political standard passed to John, who had planned to pursue an academic or journalistic career.\n\nBritannica Quiz Comprehension Quiz: Cold War\n\nJohn Kennedy himself had barely escaped death in battle. Commanding a patrol torpedo (PT) boat, he was gravely injured when a Japanese destroyer sank it in the Solomon Islands. Marooned far behind enemy lines, he led his men back to safety and was awarded the U.S. Navy and Marine Corps Medal for heroism. He also returned to active command at his own request. (These events were later depicted in a Hollywood film, PT 109 [1963], that contributed to the Kennedy mystique.) However, the further injury to his back, which had bothered him since his teens, never really healed. Despite operations in 1944, 1954, and 1955, he was in pain for much of the rest of his life. He also suffered from Addison disease, though this affliction was publicly concealed. “At least one-half of the days he spent on this earth,” wrote his brother Robert, “were days of intense physical pain.” (After he became president, Kennedy combated the pain with injections of amphetamines—then thought to be harmless and used by more than a few celebrities for their energizing effect. According to some reports, both Kennedy and the first lady became heavily dependent on these injections through weekly use.) None of this prevented Kennedy from undertaking a strenuous life in politics. His family expected him to run for public office and to win."}, {"url": "https://www.britannica.com/biography/Robert-F-Kennedy", "page_content": "father Joseph P. Kennedy mother Rose Kennedy brother Ted Kennedy brother John F. Kennedy sister Eunice Kennedy Shriver sister Rosemary Kennedy ...(Show more)\n\nRobert F. Kennedy, in full Robert Francis Kennedy, (born November 20, 1925, Brookline, Massachusetts, U.S.—died June 6, 1968, Los Angeles, California), U.S. attorney general and adviser during the administration of his brother Pres. John F. Kennedy (1961–63) and later a U.S. senator (1965–68). He was son of Rose and Joseph P. Kennedy. He was assassinated while campaigning for the Democratic Party’s presidential nomination in 1968.\n\nRobert interrupted his studies at Harvard University to serve in the U.S. Navy during World War II but returned to the university and graduated in 1948. After receiving a law degree from the University of Virginia Law School in 1951, he began his political career in Massachusetts the next year with the management of his brother John’s successful campaign for the U.S. Senate. Robert first came into national prominence in 1953, when he was an assistant counsel to the Senate Permanent Subcommittee on Investigations, headed by Joseph R. McCarthy (he resigned in mid-1953 but returned in 1954 as counsel to the Democratic minority). In 1957 he was chief counsel to the Senate select committee conducting investigations into labour racketeering, which led to his long-standing feud with James R. Hoffa of the Teamsters Union. Kennedy resigned from the committee staff in 1960 to conduct his brother’s campaign for the U.S. presidency. After John won the election, he appointed (1961) Robert attorney general in his cabinet.\n\nMore From Britannica Sirhan Sirhan\n\nOn November 22, 1963, the president was assassinated in Dallas, Texas. Kennedy continued to serve as attorney general until he resigned in September 1964. The months after his brother’s death were a desperate time for him. He was stooped by grief and spent long periods staring out windows or walking in the Virginia woods. He had presided over the Department of Justice for 44 months. He had emerged as a statesman of the law, improving the lot of many. Learning on May 20, 1961, that a hostile mob threatened the civil rights leader Martin Luther King, Jr., and about 1,200 of his supporters in Montgomery, Alabama, Kennedy sent 400 federal marshals to protect them. In subsequent racial crises he used long telephone sessions to work out the strategies of peace officers in the South. He also led a tough and imaginative drive against organized crime. One of his proudest achievements was assembling the evidence that convicted Hoffa. On Kennedy’s departure from the Department of Justice, The New York Times, which had criticized his appointment three years earlier, said editorially,\n\nHe named excellent men to most key posts, put new vigor into protecting civil rights through administrative action, played a pivotal role in shaping the most comprehensive civil rights law in this century…. Mr. Kennedy has done much to elevate the standard.\n\nHe was the author of The Enemy Within (1960), Just Friends and Brave Enemies (1962), and Pursuit of Justice (1964).\n\nIn November 1964 he was elected U.S. senator from New York. Within two years Kennedy had established himself as a major political figure in his own right. He became the chief spokesman for liberal Democrats and a critic of Pres. Lyndon B. Johnson’s Vietnam policy. On March 16, 1968, he announced his candidacy for the presidency. By June 4 he had won five out of six presidential primaries, including one that day in California. Shortly after midnight on June 5 he spoke to his followers in Los Angeles’ Ambassador Hotel. As he left through a kitchen hallway, he was fatally wounded by a Palestinian immigrant, Sirhan Bishara Sirhan. Kennedy was buried near his brother John at Arlington National Cemetery.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nKennedy and his wife, Ethel, had 11 children, several of whom became politicians and activists."}, {"url": "https://www.irishtimes.com/culture/books/jack-bobby-and-ted-the-untold-story-of-the-kennedy-brothers-1.4524107", "page_content": "“Ulster is becoming Britain’s Vietnam,” Senator Edward M Kennedy, the youngest of three exceptionally accomplished brothers in the United States’ most famous Irish family, told the US Senate in the autumn of 1971.\n\nThis year marks an important anniversary for the Kennedys, the Irish and the world, for it was 50 years ago when Ted Kennedy set his sights on peace in Northern Ireland. And, from that moment to the miracle of Stormont, in 1998, that secured peace, Ted spearheaded the United States’ peace-making efforts. He pushed presidents, worked with key Senate and House members of Irish descent, testified before Congress, delivered speeches, wrote articles, visited the region and met leaders on both sides of the conflict.\n\nJack, Bobby and Ted Kennedy were all proudly Irish. They all spoke of the anti-Irish bigotry that had plagued their ancestors in the United States. Jack visited Ireland to trace his roots and, while there as president in 1963, called it “the land for which I hold the greatest affection”. Ted came in 1964 in grief after Jack’s murder, and he spent more time trying to end the Troubles in Northern Ireland than on any other global challenge.\n\nJoe and Rose led discussions about the world with the boys over meals, and Joe invited prominent people, such as aviator Charles Lindbergh and media mogul Henry Luce, to dine with them and enrich the conversations\n\nTed’s peace-making in Northern Ireland, however, reflects far more than the proud Irishness that he shared with his brothers. It also reflects perhaps the most fascinating and consequential story about the Kennedy brothers that hardly anyone knows – a story with important lessons for the United States of today.\n\nREAD MORE\n\nMost people know that Joe and Rose Kennedy groomed their sons for success. They started with Joe jnr, who died at war in 1944 at the age of 29, and continued through Jack, Bobby and Ted. What most people don’t know (and what I explore in my new book, The Kennedys in the World: How Jack, Bobby, and Ted Remade America’s Empire) is that, from the time the brothers were little boys, Joe and Rose pushed them not just to succeed but to look beyond the United States’ borders – to learn about the world, care about the world and, once they attained power, shape the United States’ role in the world.\n\nPresident Kennedy with relatives on a visit to Dunganstown, Co Wexford, site of the Kennedy ancestral home. Standing beside him is his sister Jean Smith; his second cousin Mary Ryan; and her daughters Josephine and Mary Ann. Photograph: Bettmann/Getty\n\nJohn F Kennedy leaves Galway on his visit to Ireland in 1963\n\nJoe and Rose led discussions about the world with the boys over meals, and Joe invited prominent people, such as the aviator Charles Lindbergh and the media mogul Henry Luce, to dine with them and enrich the conversations. He also wrote to the boys about global events when he or they were away, sent them to travel overseas, arranged meetings for them with the world’s leading figures and secured jobs for them as foreign correspondents so they could position themselves as global thinkers.\n\nAll three brothers travelled widely, sometimes with one another but more often with mentors, friends or colleagues. They met kings, prime ministers and diplomats; they visited war zones and discussed conflicts with military officials; they walked the streets, talked to everyday people and observed everyday life; and they developed insights into the world’s different leaders, peoples, cultures and ideologies. Once they assumed power, they applied what they had learned to put a distinct mark on the United States’ empire.\n\nBecause they shaped the global role of the world's greatest power, Jack, Bobby and Ted changed the world itself in profound ways\n\nFor more than six decades, one or more of the brothers held public office. Jack was elected to the House in 1946, the Senate in 1952 and the presidency in 1960. Bobby was a Senate staffer in the 1950s, Jack’s attorney general and closest adviser when Jack was president, and a senator from 1965 to 1968. Ted was elected to the Senate in 1962 and served there until his death, in 2009.\n\nDuring their time, Jack, Bobby and Ted shaped broad issues of war and peace as well as the United States’ response to almost every major global challenge of their times: the Soviet Union and China, the cold war and Cuba, the Dominican Republic and Chile, Nicaragua and El Salvador, Korea and Vietnam, South Africa and Northern Ireland, and Iraq (twice). And, because they shaped the global role of the world’s greatest power, they changed the world itself in profound ways.\n\nWhat did they do?\n\n\n\nFor starters, as they grew from boys to men, they all discarded the isolationism that their father stubbornly promoted throughout his life. They came to believe that the United States must play a prominent role on the world stage, and that it could serve as a beacon for other countries to emulate. They feared war, favoured diplomacy, promoted human rights and worked to control the world's deadliest weapons.\n\nThe Kennedys at Hyannis Port in the 1930s: (seated from left) Patricia Kennedy, Robert Kennedy, Rose Kennedy, John F Kennedy, Joseph P Kennedy snr with Edward Kennedy on his lap; (standing from left) Joseph P Kennedy jnr, Kathleen Kennedy, Rosemary Kennedy, Eunice Kennedy (rear, in polka dots) and Jean Kennedy. Photo by Bachrach/Getty\n\nThe Kennedys at Hyannis Port the night after John won the 1960 US presidential election: Eunice Shriver (on chair arm), Rose Kennedy, Joseph Kennedy, (on chair arm), Jacqueline Kennedy (head turned away from camera) and Ted Kennedy. Back row, Ethel Kennedy, Stephen Smith, Jean Smith, John F Kennedy, Robert F Kennedy, Pat Lawford, Sargent Shriver, Joan Kennedy and Peter Lawford. Photograph: Paul Schutzer/Time & Life/Getty\n\nThrough Jack’s death in 1963, they were all cold warriors. But, with what he learned from his travels and his voracious reading, Jack pushed the United States’ cold-war policy in a starkly new direction. He believed that the cold war would be won not in Europe but in the developing world, where hundreds of millions of people were deciding between democracy and loyalty to the United States or communism and loyalty to the Soviet Union. Rather than support right-wing dictators and colonial governments, he wanted the US to build relations with grassroots populations because he thought that was a better way to compete with the Soviets and Chinese over the long term.\n\nAs a senator, he ruffled feathers in Washington, DC, and in Europe by urging the Europeans to free their colonies. As president, he created the Alliance for Progress for Latin America and the Peace Corps for the world, showered more foreign aid on the emerging new nations in Africa, and met their leaders.\n\nThe more that Vietnam – which began as a cold-war venture for Jack – turned into a horror show, the more Bobby questioned the venture, its relationship to the cold war and his previous support for it\n\nAfter learning valuable lessons from the Bay of Pigs fiasco, Jack peacefully resolved the Cuban missile crisis, secured a limited test-ban treaty with the Soviets and laid the groundwork for more arms control, which he hoped to pursue. He came to doubt his early decision to “make a stand” against communism in Vietnam and sent strong signals that he would withdraw if he won re-election in 1964. Shortly before his death, he also was rethinking his hardline policies toward China and Cuba.\n\nUp until then, Bobby and Ted also were hard-core cold warriors. In the 1950s, Bobby worked on foreign policy for the red-baiting Senator Joe McCarthy, a close family friend. He travelled across the Soviet Union with the US supreme-court justice William Douglas, another family friend, and returned to criticise Moscow in speeches, interviews and writings over its human-rights abuses and economic backwardness. Also in the 1950s, Ted toured Europe with a friend and travelled across Africa with one of his Harvard instructors. In the early 1960s, he returned to Africa and travelled across Latin America and Europe before winning his Senate seat in 1962 as a cold-war hawk.\n\nCuban missile crisis: President Kennedy addresses the media in the Oval Office in October 1962. Photograph: Keystone/Getty\n\nBut, after Jack died, Lyndon Johnson took over and the world changed, Bobby and Ted changed with it. They evolved from cold-war hawks into leading liberal doves and drove US foreign policy in new directions.\n\nBobby, in particular, emerged from months of trauma after Jack’s death as very much a new man. The more that Vietnam – which began as a cold-war venture for Jack – turned into a horror show, the more Bobby questioned the venture, its relationship to the cold war and his previous support for it. He was no less a critic of communism, but he now viewed Vietnam as a much bigger problem for the United States than the cold war.\n\nLike Bobby, Ted also had been a cold warrior. But, unlike Bobby, he was a savvy lawmaker. To an uncommon degree, he knew how to work the system, build coalitions and achieve results on foreign policy even when he was opposed by the president, who is always the United States’ most powerful figure on foreign policy.\n\nThe Kennedys showed that, in a dangerous world, the United States must play a leading role on the international stage to protect its interests, defend its allies, and promote freedom and democracy\n\nAmong his many accomplishments, he spearheaded the successful efforts to sanction South Africa over apartheid, end proxy wars with the Soviets in Latin America and make peace in Northern Ireland. And, in his behind-the-scenes efforts that haven’t received nearly the attention they deserve, he convinced Soviet and Chinese leaders to free scores of political prisoners. Even though Jack and Bobby reached greater heights of power, Ted remade the US empire more over the long term than either of them.\n\nAll told, the Kennedys showed that, in a dangerous world, the US must play a leading role on the international stage to protect its interests, defend its allies and promote freedom and democracy.\n\nTheir example is particularly important now, with Freedom House reporting that freedom – political rights and civil liberties – around the world declined in 2020 for the 15th straight year. China, Russia and other nations are challenging the US and the West by promoting their authoritarian forms of government as better alternatives to the messiness of US-led freedom and democracy.\n\nAfter Trump's \"America First\" isolationism and, before that, President Obama's reticence to promote freedom and democracy, the United States needs to restore its moral voice. That's because a freer, more democratic world will be a safer, more prosperous world from which the United States can benefit.\n\n\n\nThe Kennedy brothers understood that, and so should we.\n\n\n\nLawrence J Haas, former communications director for US vice-president Al Gore, is the author of The Kennedys in the World: How Jack, Bobby, and Ted Remade America's Empire, new from Potomac Books"}, {"url": "https://www.history.com/topics/us-government/ted-kennedy", "page_content": "Edward “Ted” Kennedy (1932-2009), the youngest brother of President John Kennedy (1917-1963), was a U.S. senator from Massachusetts from 1962 to 2009, making him one of the longest-serving senators in American history. Kennedy entered the Senate after winning a 1962 special election to fill the seat vacated by his brother John when he became president. During his career on Capitol Hill, Ted Kennedy was a spokesman for liberal causes, including civil rights, health care and immigration. A leader of the Democratic Party, he was known for his ability to work with those on both sides of the political aisle. In 1980, Kennedy, whose reputation was tarnished by a 1969 car accident, made a failed bid for the Democratic presidential nomination. Dubbed the “liberal lion of the Senate,” he died of cancer at age 77 and was buried at Arlington National Cemetery.\n\nTed Kennedy’s Childhood and Education\n\nEdward Moore Kennedy was born in Boston on February 22, 1932, the youngest of nine children of Joseph P. Kennedy Sr. (1888-1969), a wealthy financier who served as the first chairman of the Securities and Exchange Commission and later as ambassador to Great Britain, and Rose Fitzgerald Kennedy (1890-1995), the daughter of a Boston politician.\n\nDid you know? In 2011, Ted Kennedy’s son Patrick, an eight-term U.S. congressman from Rhode Island, resigned from politics. His exit marked the first time since 1947–when John Kennedy became a U.S. congressman from Massachusetts–that no member of the Kennedy family held elective office in Washington, D.C.\n\nAs a child, Kennedy moved between his family’s homes in Massachusetts, New York, Palm Beach and London, and attended 10 schools before graduating from Milton Academy in Massachusetts in 1950. He went on to attend Harvard University, the alma mater of his father and three older brothers. During his freshman year, he was expelled after a classmate took a Spanish exam in his place. Kennedy then enlisted in the U.S. Army, serving from 1951 to 1953, mostly in Europe. Afterward, he re-enrolled in Harvard, where he became a more serious student and played on the football team.\n\nAfter graduating in 1956, he attended the University of Virginia School of Law. While still a law student, he managed his brother John’s successful 1958 reelection campaign to the U.S. Senate, where he represented Massachusetts. The following year, Kennedy earned his law degree and was admitted to the Massachusetts bar.\n\nTed Kennedy’s Election to the U.S. Senate\n\nWhen John Kennedy made his 1960 run for the White House, Ted Kennedy campaigned for him in the Western states. A licensed pilot, he barnstormed around the region, meeting with delegates and trying bronco riding and ski jumping as a way to connect with people.\n\nIn November 1960, John Kennedy was elected America’s 35th president. The following month, a Kennedy family friend, Benjamin Smith (1916-1991), was appointed to fill the president-elect’s vacated Senate seat until a special election was held. On November 6, 1962, Ted Kennedy, who earlier that year had turned 30 (the minimum age requirement for a U.S. senator), won the special election in Massachusetts to serve out the remainder of his brother’s Senate term, ending in January 1965. Massachusetts voters reelected Kennedy to the seat eight more times, in 1964, 1970, 1976, 1982, 1988, 1994, 2000 and 2006.\n\nWith John Kennedy in the White House, Ted Kennedy in the Senate and their brother Robert (1925-1968) serving as the U.S. attorney general from 1961 to 1964 and as a U.S. senator from New York from 1965 to 1968, the glamorous, wealthy, Irish-Catholic Kennedys were often referred to as an American political dynasty.\n\nTed Kennedy’s Marriages and Family\n\nIn 1958 Ted Kennedy married Joan Bennett (1936-), who he met through his sister Jean (1928-); both women had attended Manhattanville College in New York. The couple had three children—Kara (1960-), Edward Jr. (1961-) and Patrick (1967-)—before divorcing in 1982. In 1992, Kennedy married Victoria Reggie (1954-), a Washington attorney with two children. Kennedy often spent time with his family sailing, which he described as his favorite pastime.\n\nTragedy Strikes the Kennedys\n\nOn November 22, 1963, tragedy struck the Kennedy family and the nation when 46-year-old President John Kennedy was assassinated in Dallas, Texas. He was the third Kennedy sibling to perish. The oldest child, Joseph Kennedy Jr. (1915-1944), a Navy pilot, died in World War II, and the second-eldest daughter, Kathleen (1920-1948), was killed in a plane crash in France. In June 1964, Ted Kennedy escaped death when the small plane he was riding in crashed in Massachusetts in bad weather, killing two people and leaving Kennedy with a broken back and other injuries that required a six-month hospital recuperation.\n\nOn June 5, 1968, tragedy struck again when 42-year-old Senator Robert Kennedy, who had just won the Democratic presidential primary in California, was assassinated in Los Angeles.\n\nWith Robert’s death, Ted Kennedy became the family patriarch–his father Joseph had suffered an incapacitating stroke in 1961–and a surrogate father to his two slain brothers’ 13 children.\n\nIncident at Chappaquiddick\n\nOn July 18, 1969, Ted Kennedy was involved in a controversial event that would mar the rest of his career. He accidentally drove his car off a bridge on Massachusetts’ Chappaquiddick Island, killing his passenger, Mary Jo Kopechne (1940-1969), who drowned. Kennedy did not report the incident to the authorities for nearly 10 hours, claiming the delay was due to the fact that he had suffered a concussion and was exhausted from attempting to rescue Kopechne.\n\nThe 37-year-old senator pled guilty to leaving the scene of an accident and received a two-month suspended sentence. However, Kennedy was plagued by questions about his behavior. He later referred to his actions as “inexcusable” and said that Kopechne’s death “haunts me every day of my life.”\n\nTed Kennedy’s Bid for the White House\n\nIn November 1979, Ted Kennedy announced he would run against President Jimmy Carter (1924-) for the 1980 Democratic presidential nomination. Kennedy won primaries in New York, California and eight other states, but his campaign was disorganized and hurt by lingering questions about Chappaquiddick. At the August 1980 Democratic National Convention, he withdrew his bid for the presidency and went on to deliver a fiery speech in which he said, “For me, a few hours ago, this campaign came to an end. For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives, and the dream shall never die.”\n\nKennedy never made another bid for the presidency.\n\nThe Liberal Lion of the Senate\n\nSome historians have called Ted Kennedy one of the most effective legislators in the history of the U.S. Senate. During nearly 47 years on Capitol Hill, his office wrote some 2,500 bills, over 300 of which became law. Additionally, over 550 bills that he co-sponsored became law. A skilled orator and gifted storyteller, Kennedy was known for his ability to collaborate with Democrats and Republicans alike.\n\nHe successfully fought for legislation concerning education, immigration reform, increases to the federal minimum wage, voting rights, AIDS care, various consumer protections and equal rights for minorities, the disabled, women and gay Americans. In 1972 he was the driving force behind the Women, Infants, and Children (WIC) program, which provides food assistance and access to health services for low-income women and their children, and he was instrumental in the passage of the Americans with Disabilities Act of 1990, which banned workplace discrimination against and required public accommodations for the disabled.\n\nKennedy referred to universal health insurance as “the cause of my life,” and for decades worked to achieve national health reform. Kennedy’s widow Victoria was present when President Barack Obama (1961-) signed historic health care legislation, the Patient Protection and Affordable Care Act, in March 2010.\n\nIn foreign policy matters, Kennedy was an opponent of the Vietnam War and in 2002 voted against authorizing the use of military force in Iraq. He worked for human rights in South America in the 1970s, championed U.S. government sanctions against apartheid-ruled South Africa in the 1980s, and helped broker a peace agreement in Northern Ireland in the late 1990s.\n\nTed Kennedy’s Final Years\n\nIn May 2008, Ted Kennedy was diagnosed with a malignant brain tumor. That August, despite his poor health, he made a rousing speech in his distinct Massachusetts accent at the Democratic National Convention in Denver. In his speech, the senator, who earlier that year had endorsed Barack Obama for president, invoked the legacy of the Kennedy family when he stated, “And this November the torch will be passed again to a new generation of Americans…The work begins anew. The hope rises again. And the dream lives on.”\n\nOn August 25, 2009, the 77-year-old Kennedy succumbed to brain cancer at his home in Hyannis Port, Massachusetts. At his funeral, which was attended by three former U.S. presidents, the late senator was eulogized by President Obama. Kennedy was buried at Virginia’s Arlington National Cemetery, near the graves of his brothers John and Robert. Kennedy’s memoir, “True Compass,” was published posthumously in September 2009."}, {"url": "https://millercenter.org/president/kennedy/essays/kennedy-1961-attorney-general", "page_content": "Robert Francis Kennedy was born on November 20, 1925, in Brookline, Massachusetts. He was the seventh of nine children and the younger brother of President John F. Kennedy. Robert, known mostly as \"Bobby,\" attended Milton Academy and went on to receive a B.A. from Harvard University in 1948. During the summer following his graduation, he worked for the Boston Post as a war correspondent. In 1951, Robert Kennedy graduated from the University of Virginia Law School, serving for a short time thereafter as an attorney in the Criminal Division of the Justice Department.\n\nHe left in 1952, however, to manage his brother John's successful campaign for the U.S. Senate. Robert Kennedy became assistant counsel for the Senate Permanent Subcommittee on Investigations, then headed by Senator Joseph McCarthy (R-WI). He quickly resigned in July 1953, however, as a result of disagreements over the subcommittee's procedures. Kennedy then rejoined the subcommittee in 1954 as chief counsel for the minority party Democrats, and he later became chief counsel for the racketeering committee investigating illegalities in the management of trade unions.\n\nIn November 1959, Robert Kennedy became manager of his brother's presidential campaign. Following the Kennedy victory, the President-elect tapped his brother, on December 16, 1960, to be Attorney General. In that capacity, Robert Kennedy exposed the racketeer control of labor unions. His work on behalf of civil rights led to passage of the Kennedy administration's civil rights bill in July of 1964 and to protections regarding the black American's right to vote. Kennedy also set his sights on antitrust prosecution and reducing the growth of crime.\n\nAs the brother of the President, Robert Kennedy also had a unique role as adviser to the commander-in-chief. Robert was John's closest aide, especially after the failure of the Bay of Pigs invasion. He was included in the decision-making process for all major foreign and domestic policy issues. During the Cuban missile crisis, Robert was a member of the Excom, the specially assembled group organized to determine America's response to nuclear weapons in Cuba. The attorney general would eventually voice opposition to air strikes on the island, opting instead for a \"quarantine.\" He played a crucial role in securing Excom support for a blockade of Cuba. Robert Kennedy also played a crucial role, through back-channel conversations with Soviet Ambassador Anatoly Dobrynin, in gaining the removal of the missiles. Robert Kennedy resigned the attorney general post in 1964, following his brother's assassination, and waged a successful campaign to become a U.S. Senator from New York.\n\nIn the Senate, he worked for the cause of the urban poor and emerged as an outspoken critic of President Lyndon Johnson's Vietnam policy. Kennedy joined the race for the 1968 presidential election in March of that year, winning the primaries in Indiana, Nebraska, and California. On June 5, while campaigning in Los Angeles, Robert Kennedy was shot by Sirhan B. Sirhan, a Jordanian living in California. He died the following day."}, {"url": "https://www.whitehouse.gov/about-the-white-house/presidents/john-f-kennedy/", "page_content": "The biography for President Kennedy and past presidents is courtesy of the White House Historical Association.\n\nJohn F. Kennedy was the 35th President of the United States (1961-1963), the youngest man elected to the office. On November 22, 1963, when he was hardly past his first thousand days in office, JFK was assassinated in Dallas, Texas, becoming also the youngest President to die.\n\nOn November 22, 1963, when he was hardly past his first thousand days in office, John Fitzgerald Kennedy was killed by an assassin’s bullets as his motorcade wound through Dallas, Texas. Kennedy was the youngest man elected President; he was the youngest to die.\n\nOf Irish descent, he was born in Brookline, Massachusetts, on May 29, 1917. Graduating from Harvard in 1940, he entered the Navy. In 1943, when his PT boat was rammed and sunk by a Japanese destroyer, Kennedy, despite grave injuries, led the survivors through perilous waters to safety.\n\nBack from the war, he became a Democratic Congressman from the Boston area, advancing in 1953 to the Senate. He married Jacqueline Bouvier on September 12, 1953. In 1955, while recuperating from a back operation, he wrote Profiles in Courage, which won the Pulitzer Prize in history.\n\nIn 1956 Kennedy almost gained the Democratic nomination for Vice President, and four years later was a first-ballot nominee for President. Millions watched his television debates with the Republican candidate, Richard M. Nixon. Winning by a narrow margin in the popular vote, Kennedy became the first Roman Catholic President.\n\nHis Inaugural Address offered the memorable injunction: “Ask not what your country can do for you–ask what you can do for your country.” As President, he set out to redeem his campaign pledge to get America moving again. His economic programs launched the country on its longest sustained expansion since World War II; before his death, he laid plans for a massive assault on persisting pockets of privation and poverty.\n\nResponding to ever more urgent demands, he took vigorous action in the cause of equal rights, calling for new civil rights legislation. His vision of America extended to the quality of the national culture and the central role of the arts in a vital society.\n\nHe wished America to resume its old mission as the first nation dedicated to the revolution of human rights. With the Alliance for Progress and the Peace Corps, he brought American idealism to the aid of developing nations. But the hard reality of the Communist challenge remained.\n\nShortly after his inauguration, Kennedy permitted a band of Cuban exiles, already armed and trained, to invade their homeland. The attempt to overthrow the regime of Fidel Castro was a failure. Soon thereafter, the Soviet Union renewed its campaign against West Berlin. Kennedy replied by reinforcing the Berlin garrison and increasing the Nation’s military strength, including new efforts in outer space. Confronted by this reaction, Moscow, after the erection of the Berlin Wall, relaxed its pressure in central Europe.\n\nInstead, the Russians now sought to install nuclear missiles in Cuba. When this was discovered by air reconnaissance in October 1962, Kennedy imposed a quarantine on all offensive weapons bound for Cuba. While the world trembled on the brink of nuclear war, the Russians backed down and agreed to take the missiles away. The American response to the Cuban crisis evidently persuaded Moscow of the futility of nuclear blackmail.\n\nKennedy now contended that both sides had a vital interest in stopping the spread of nuclear weapons and slowing the arms race–a contention which led to the test ban treaty of 1963. The months after the Cuban crisis showed significant progress toward his goal of “a world of law and free choice, banishing the world of war and coercion.” His administration thus saw the beginning of new hope for both the equal rights of Americans and the peace of the world.\n\nFor more information about President Kennedy, please visit the John F. Kennedy Library and Museum.\n\nLearn more about John F. Kennedy’s spouse, Jacqueline Lee Bouvier Kennedy."}, {"url": "https://www.britannica.com/event/assassination-of-John-F-Kennedy", "page_content": "The assassination of U.S. Pres. John F. Kennedy was the most notorious political murder of the 20th century. Kennedy was the fourth U.S. president to have been assassinated while in office (after Abraham Lincoln , James A. Garfield , and William McKinley ). Almost from the beginning, the killing of the popular young president was thought to have been the result of a conspiracy rather than the act of an individual, despite findings to the contrary by the Warren Commission . The assassination and its aftermath played out through the newly dominant mass medium of television , which made it a uniquely immediate and shocking experience for many Americans. Kennedy’s death also brought an abrupt end to his supporters’ sense of optimism about the country’s future, which had been fueled by his broad popularity.\n\nA special President’s Commission on the Assassination of President John F. Kennedy , better known as the Warren Commission because it was headed by Chief Justice Earl Warren , investigated the assassination from November 1963 to September 1964. Its report concluded that neither Oswald nor Ruby “was part of any conspiracy, domestic or foreign, to assassinate President Kennedy.” However, in March 1979, after a two-year investigation, a special House Select Committee on Assassinations reported that a second assassin may also have fired a shot and that there may have been a conspiracy. The evidence remains highly debatable.\n\nTwenty-four-year-old Lee Harvey Oswald was the accused murderer of U.S. Pres. John F. Kennedy. Oswald was a former U.S. Marine who embraced Marxism and defected, for a time, to the Soviet Union . Oswald never stood trial for the murder. On Sunday, November 24, 1963, two days after Kennedy’s assassination, Oswald was shot to death by Jack Ruby , a local nightclub owner with connections to the criminal underworld, in the basement of Dallas City Hall.\n\nPres. John F. Kennedy believed that his Republican opponent in the 1964 U.S. presidential election would be Sen. Barry Goldwater of Arizona. Kennedy was convinced that he could bury Goldwater under an avalanche of votes. One obstacle to his success was a feud in Vice Pres. Lyndon B. Johnson ’s home state of Texas between Gov. John B. Connally, Jr. , and Sen. Ralph Yarborough, both Democrats . To present a show of unity, Kennedy decided to tour the state with both men. Kennedy began the tour—with his wife, Jacqueline Kennedy , and Johnson—on November 21, 1963, in San Antonio , with visits to Houston and Forth Worth that same day. The next day they flew to Dallas . While Kennedy was riding in an open limousine in downtown Dallas on his way to give a speech, he was shot and killed. (Connally was also gravely wounded; however, he recovered.) Although Kennedy did not survive to see the presidential election of 1964, his prediction was correct: Goldwater did, in fact, run for president.\n\nOn November 21, 1963, the day before his assassination, U.S. Pres. John F. Kennedy—accompanied by his wife, Jacqueline Kennedy , and U.S. Vice Pres. Lyndon B. Johnson —undertook a two-day five-city trip to Texas. The president was warmly welcomed at his first two stops, San Antonio and Houston , as well as at Fort Worth , where the presidential party spent the night. On the morning of November 22, Kennedy and his party flew to Dallas . At Dallas’s Love Field airport, the president and the first lady boarded an open limousine to ride with Democrat Texas Gov. John B. Connally, Jr. , and his wife to the president’s next stop, the Trade Mart, where the president was scheduled to deliver a speech. At 12:30 PM, President Kennedy was struck by two shots apparently fired from an open window on the sixth floor of the Texas School Book Depository. He was rushed to nearby Parkland Memorial Hospital, where he was pronounced dead at 1:00 PM. His accused killer, Lee Harvey Oswald , was arrested at 1:50 PM.\n\nAlmost from the beginning, the killing of the popular young president was thought by many Americans to have been the result of a conspiracy rather than the act of an individual, despite findings to the contrary by the Warren Commission (1964), which was established by Kennedy’s successor, U.S. Pres. Lyndon B. Johnson , to investigate the assassination . The incident remained the subject of widespread speculation.\n\nAs the motorcade turned southwest on Elm Street and began traveling through Dealey Plaza on the edge of downtown Dallas, the president’s convertible passed the multistory Texas School Book Depository building. Moments later, at about 12:30 pm, shots rang out. A bullet pierced the base of the neck of the president, exited through his throat, and then likely (according to the Warren Report) passed through Governor Connally’s shoulder and wrist, ultimately hitting his thigh. Another bullet struck Kennedy in the back of the head. The motorcade rushed to nearby Parkland Memorial Hospital, reaching it quickly; however, doctors’ efforts were futile . Kennedy was officially declared dead at 1:00 pm. Connally survived his wounds.\n\nThe next morning, after making a speech in a parking lot in front of the hotel in which he had stayed and then speaking again at a Fort Worth Chamber of Commerce breakfast, Kennedy and his party made a short flight to Dallas’s Love Field airport. (After Dallas, the final stop on the trip was scheduled to be Austin .) At the airport the president and first lady shook hands with members of a hospitable crowd before boarding the backseat of a customized open convertible to ride with Democratic Texas Gov. John Connally and his wife (who sat in jump seats in front of the Kennedys) to the president’s next stop, the Trade Mart, where Kennedy was scheduled to deliver another speech. An estimated 200,000 people lined the roughly 10-mile (16-km) route to the Trade Mart.\n\nOn November 21, 1963, President Kennedy—accompanied by his wife, Jacqueline Kennedy , and Vice President Johnson—undertook a two-day, five-city fund-raising trip to Texas . The trip was also likely intended as an attempt to help bring together a feuding Democratic Party in a state that was vital to Kennedy’s chances for reelection in 1964. Although Adlai Stevenson , the U.S. ambassador to the United Nations and a liberal icon, had been confronted by highly agitated protesters a month earlier during a visit to Dallas—a city with a right-leaning press and the locus of much anti-Kennedy feeling—the president was warmly welcomed at his first two stops, San Antonio and Houston , as well as at Fort Worth , where the presidential party spent the night of November 21.\n\nThe capture and death of Oswald\n\nOver the next hour, as a shocked country and world learned of Kennedy’s death, the drama of the pursuit and capture of his alleged assailant unfolded. Bullet casings were found near a window on the sixth floor of the Texas School Book Depository building overlooking the plaza; a rifle (later proved to have been owned by Oswald) was discovered elsewhere on the sixth floor. An accounting of the building’s employees indicated that only two were missing: one was a man who had stepped outside to watch the motorcade and was barred by police from reentering the building, and the other was Oswald, who had been working there for about a month. Oswald had been seen on the sixth floor about a half hour before the shooting and had also been encountered in the building by its superintendent and a policeman just after the shooting. Law enforcement circulated a description of him. Meanwhile, Oswald made his way to the boardinghouse where he had been staying. Some 15 minutes after leaving the boardinghouse, he was confronted by a Dallas policeman, J.D. Tippit, who is thought to have believed that Oswald matched the description. Oswald shot and killed Tippit with a .38 revolver in the presence of a number of witnesses and was later seen entering the Texas Theatre, where at 1:50 pm he was apprehended by police.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nAs those events unfolded, Johnson, fearing that the assassination of the president was just the first step in a much broader effort by the Soviets or other enemies of the United States to destabilize the American government, sought to effect a quick transition of executive authority and to seek safety by leaving Dallas by plane. At 2:38 pm, before takeoff, with Kennedy’s corpse aboard, Johnson took the oath of office on Air Force One. Jacqueline Kennedy, still wearing blood-spattered clothes, stood at his side.\n\nQuestioned by both law-enforcement officers and the press, Oswald protested his innocence, claiming that he was “a patsy.” He requested to be represented by (but was never able to contact) John Abt, the staff attorney of the Communist Party USA, who was well known for his defense of communists. After being held for two days and two nights, Oswald was being transferred from Dallas City Hall (which contained the headquarters and jail of the Dallas Police Department) to the county jail on the morning of November 24, an event broadcast live on television, when Jack Ruby—a familiar face around the police station and known to police who frequented his club—was able to enter the basement parking garage of City Hall. There he shot Oswald with a handgun as the cameras looked on. Ruby later said that he had shot Oswald to spare Jacqueline Kennedy from having to testify at Oswald’s trial. Oswald was taken to Parkland Memorial Hospital, where previously Kennedy and now Oswald, too, died. Ruby would be tried, found guilty of murder (March 14, 1964), and sentenced to death; in October 1966, however, a Texas appeals court reversed the conviction, though Ruby died (January 3, 1967; also at Parkland) before a new trial could be held."}, {"url": "https://www.history.com/topics/us-presidents/jfk-assassination", "page_content": "By 2:15 p.m., Lee Harvey Oswald , a new employee at the Book Depository, was arrested for JFK’s assassination, as well as for the fatal 1:15 p.m. shooting of Dallas patrolman J.D. Tippit. Two days later, on Nov. 24, Oswald would be murdered by local nightclub owner and police informant Jack Ruby at point-blank range and on live TV.\n\nPresident John F. Kennedy was assassinated on November 22, 1963, at 12:30 p.m. while riding in a motorcade in Dallas during a campaign visit. Shots rang out as Kennedy’s motorcade turned past the Texas School Book Depository at Dealey Plaza, with crowds lining the streets. The driver of the president’s Lincoln limousine, with its top off, raced to nearby Parkland Memorial Hospital, but after being shot in the neck and head, Kennedy was pronounced dead at 1 p.m. He was 46 years old. A generation of Americans would forever remember where they were when they heard about the president’s assassination, as it would have a profound political and cultural impact on the nation.\n\nLee Harvey Oswald's Earlier Life\n\nOswald was born in New Orleans in 1939. His father died of a heart attack two months before he was born. After living off and on in orphanages as a boy, he moved with his mother to New York at age 12, where he was sent to a youth detention center for truancy. It was during this time that he became interested in socialism. After moving back to New Orleans, Oswald joined the Marines in 1956, where he earned a sharpshooter qualification, and discovered Marxism.\n\nUpon receiving an early honorable discharge from the Marines in 1959, he defected to the Soviet Union for two and a half years, where he was denied citizenship, but allowed to stay in the country—and was monitored by the KGB. Upon learning that Oswald had wanted to defect, the Marines downgraded his 1959 discharge from “honorable” to “undesirable” in 1962. Later that year, Oswald returned to Texas with his Soviet wife and young daughter.\n\nOne year later, Oswald would purchase, by mail, a rifle with telescopic sight and a .38 revolver. That year, he attempted to shoot retired United States Major General Edwin A. Walker who had been a staunch critic of communism. Later in 1963, Oswald was denied passage to Cuba and the U.S.S.R. during a trip to Mexico City. He returned to Texas and started a job at the Texas School Book Depository in Dallas.\n\nIn an interview with “Frontline,” investigative journalist Gerald Posner said Oswald’s hatred wasn’t for Kennedy. “What he did hate was the system and what Kennedy stood for,” Posner tells the PBS show. “He despised America. He despised capitalism. When he eventually had the opportunity to strike against Kennedy, it was that symbol of the system that he was going after.”\n\nPresident and Governor Shot in Motorcade\n\nAccording to the official investigation, Oswald acted alone, firing three bullets from a sixth-floor window at the southeast corner of the Book Depository. Kennedy was struck once in the upper back and once in the head and slumped over onto his wife, First Lady Jacqueline Kennedy. Texas Governor John B. Connally Jr., who was also in the limo with his wife, was shot once in the back. He later recovered from his injuries. After killing Tippit, Oswald was arrested a few minutes later in the back of a movie theater.\n\n\"The man is 24-year-old Lee Oswald, espouser of leftist causes, an active member of the Fair Play for Cuba Committee, an avowed admirer of Russia and of Cuba's Fidel Castro, a man who once lived in Russia,\" Dan Rather reported on CBS News at the time.\n\nDuring his interrogation, Oswald denied any guilt. “I didn’t shoot anybody, no sir … I’m just a patsy,” he told reporters.\n\nCecil Stoughton/The LIFE Images Collection/Getty Images Vice President Lyndon Johnson taking oath of office after President Kennedy's assassination aboard Air Force One\n\nLyndon B. Johnson Sworn In\n\nThe first lady and Vice President Lyndon B. Johnson, who had been three cars behind Kennedy in the motorcade, returned to Air Force One at Dallas Love Field with Kennedy’s body, in a bronze casket.\n\nJohnson was sworn in at 2:38 p.m. as the 36th president of the United States while aboard the airplane prior to takeoff. Jacqueline Kennedy, still in a pink suit splattered with blood, stood at Johnson’s side. An autopsy on Kennedy’s body was performed at Bethesda Naval Hospital in Maryland.\n\n“This is a sad time for all people. We have suffered a loss that cannot be weighed,” Johnson said in his first public statement as president. “For me, it is a deep personal tragedy. I know that the world shares the sorrow that Mrs. Kennedy and her family bear. I will do my best. That is all I can do. I ask for your help—and God's,”\n\nOn November 23, 1963, Johnson declared November 25 a national day of mourning.\n\nLee Harvey Oswald Shot\n\nOn Sunday morning, November 24, in front of the press, Oswald was being led to be transferred to the county jail from Dallas Police Headquarters. \"The Dallas police were extremely worried for the safety of their prisoner,\" KRLD radio reporter Bob Huffaker, who was there, told CBS News. \"We knew that Oswald was the most hated suspect of the 20th century.\"\n\nRuby shot Oswald point-blank in the stomach with a small-caliber pistol. Oswald died at Parkland Hospital, where Kennedy had died two days earlier.\n\nRuby was indicted on November 26 and convicted of murdering Oswald and sentenced to death by electric chair. The ruling was overturned on appeal, but Ruby died of a pulmonary embolism stemming from lung cancer in 1967 before a new trial could take place.\n\nJFK Funeral\n\nOn November 25, a horse-drawn caisson carried Kennedy’s flag-draped coffin to St. Matthew’s Catholic Cathedral from the Capitol Rotunda. More than 800,000 people lined Pennsylvania Avenue to watch the procession, according to the Washington Post.\n\nBettmann Archive/Getty Images John F. Kennedy Jr. saluting as the casket of his father, the late President John F. Kennedy, is carried from St. Matthew's Cathedral in Washington, D.C.\n\n“The president’s caisson was drawn by four horses, including the riderless horse named Black Jack, a ‘magnificent black gelding,’ according to the JFK Library, which carried an empty saddle and saber,” the newspaper reported. “Boots were reversed in the stirrups. ‘The riderless horse,’ the JFK Library explained, ‘is one of the highest military honors bestowed upon the fallen.’ ”\n\nKennedy was buried with full military honors at Arlington National Cemetery, following the requiem mass, with leaders from dozens of nations in attendance. Jacqueline Kennedy lit the eternal flame that has continued to flicker since JFK’s death.\n\nThis was the bullet found on the stretcher in Parkland Memorial Hospital. According to the Warren Commission, the bullet was the second shot taken by the gunman that fatally struck Kennedy. Investigators said the bullet then exited Kennedy to hit Connally breaking a rib, shattering his wrist and ending up in his thigh. Critics have sarcastically referred to this as the \"magic-bullet theory\" and claim that a bullet responsible for this much damage couldn't possibly be as intact as it was. Read more: Why the Public Stopped Believing the Government about JFK's Murder The front of the shirt worn by President Kennedy on day of his assassination. The initials \"JFK\" were embroidered on the left sleeve. Authorities reported that the shots were fired from the sixth floor of the Texas School Book Depository in Dallas, Texas along Kennedy's motorcade route. The Warren Commission claimed three shots were fired in the span of 8.6 seconds. However, skeptics have disputed that assessment and presented their own theories. Among the widely circulated theories is that there had been a second shooter on a grassy knoll ahead of the president, on an elevated area to his right.Read more: What Physics Reveals about the JFK Assassination At the Texas School Book Depository, authorities found this cartridge case after the assassination of President John F. Kennedy. Authorities also identified finger and palm prints on boxes inside the Texas School Book Depository after the assassination. They were in a secluded area where boxes had been stacked by a window. Former Marine Lee Harvey Oswald was arrested by the Dallas Police Department just over an hour after the shooting for possible involvement in the John F. Kennedy assassination and the murder of a police officer. Oswald had recently started working at the Texas School Book Depository Building. Less than an hour after Kennedy was shot, Oswald killed Officer J.D. Tippit who questioned him on the street near his Dallas rooming house. Some 30 minutes later, Oswald was arrested in a movie theater by police responding to reports of a suspect. This is the gun and bullets used by Oswald to kill the officer while resisting arrest. A bus transfer was found on Oswald upon his arrest. Oswald allegedly used the transfer ticket to leave the scene of crime after the assassination. Here is a detailed view of the Italian-made rifle, with telescopic mount, allegedly used by Lee Harvey Oswald in the assassination of President John F. Kennedy. 1 / 9 : Time Life Pictures/National Archives/The LIFE Picture Collection/Getty Images\n\nInvestigation Ends, Conspiracy Theories Begin\n\nThe President's Commission on the Assassination of President Kennedy—known as the Warren Commission—concluded \"the shots which killed President Kennedy and wounded Governor Connally were fired from the sixth-floor window at the southeast corner of the Texas School Book Depository.\" It also said, \"The shots which killed President Kennedy and wounded Governor Connally were fired by Lee Harvey Oswald.”\n\nDespite the official finding, many believe Oswald didn't act alone, or that other conspirators—from the world of organized crime to the CIA to Cuban exiles—are responsible for Kennedy’s assassination. A 2017 poll by FiveThirtyEight, found just 33 percent of Americans believe Oswald alone killed Kennedy. Some 30,000 never-before-seen or un-redacted documents were released to the public by the National Archives in 2017 and 2018.\n\nHISTORY Vault: JFK Assassination: The Definitive Guide Leading experts explore the many theories of what happened on November 22, 1963. Watch Now\n\nSources\n\n“November 22, 1963: Death of the President,” John F. Kennedy Presidential Library and Museum\n\n“Who Was Lee Harvey Oswald?” Frontline, PBS\n\n“The Warren Commission Report,” National Archives\n\n“The day John F. Kennedy was killed: How America mourned a fallen president,” The Washington Post\n\n“Accused JFK assassin is arrested, then gunned down,” CBS News"}], "Harry S. Kennedy was the brother of Senator Robert F. Kennedy.": [{"url": "https://www.britannica.com/biography/Robert-F-Kennedy", "page_content": "father Joseph P. Kennedy mother Rose Kennedy brother Ted Kennedy brother John F. Kennedy sister Eunice Kennedy Shriver sister Rosemary Kennedy ...(Show more)\n\nRobert F. Kennedy, in full Robert Francis Kennedy, (born November 20, 1925, Brookline, Massachusetts, U.S.—died June 6, 1968, Los Angeles, California), U.S. attorney general and adviser during the administration of his brother Pres. John F. Kennedy (1961–63) and later a U.S. senator (1965–68). He was son of Rose and Joseph P. Kennedy. He was assassinated while campaigning for the Democratic Party’s presidential nomination in 1968.\n\nRobert interrupted his studies at Harvard University to serve in the U.S. Navy during World War II but returned to the university and graduated in 1948. After receiving a law degree from the University of Virginia Law School in 1951, he began his political career in Massachusetts the next year with the management of his brother John’s successful campaign for the U.S. Senate. Robert first came into national prominence in 1953, when he was an assistant counsel to the Senate Permanent Subcommittee on Investigations, headed by Joseph R. McCarthy (he resigned in mid-1953 but returned in 1954 as counsel to the Democratic minority). In 1957 he was chief counsel to the Senate select committee conducting investigations into labour racketeering, which led to his long-standing feud with James R. Hoffa of the Teamsters Union. Kennedy resigned from the committee staff in 1960 to conduct his brother’s campaign for the U.S. presidency. After John won the election, he appointed (1961) Robert attorney general in his cabinet.\n\nMore From Britannica Sirhan Sirhan\n\nOn November 22, 1963, the president was assassinated in Dallas, Texas. Kennedy continued to serve as attorney general until he resigned in September 1964. The months after his brother’s death were a desperate time for him. He was stooped by grief and spent long periods staring out windows or walking in the Virginia woods. He had presided over the Department of Justice for 44 months. He had emerged as a statesman of the law, improving the lot of many. Learning on May 20, 1961, that a hostile mob threatened the civil rights leader Martin Luther King, Jr., and about 1,200 of his supporters in Montgomery, Alabama, Kennedy sent 400 federal marshals to protect them. In subsequent racial crises he used long telephone sessions to work out the strategies of peace officers in the South. He also led a tough and imaginative drive against organized crime. One of his proudest achievements was assembling the evidence that convicted Hoffa. On Kennedy’s departure from the Department of Justice, The New York Times, which had criticized his appointment three years earlier, said editorially,\n\nHe named excellent men to most key posts, put new vigor into protecting civil rights through administrative action, played a pivotal role in shaping the most comprehensive civil rights law in this century…. Mr. Kennedy has done much to elevate the standard.\n\nHe was the author of The Enemy Within (1960), Just Friends and Brave Enemies (1962), and Pursuit of Justice (1964).\n\nIn November 1964 he was elected U.S. senator from New York. Within two years Kennedy had established himself as a major political figure in his own right. He became the chief spokesman for liberal Democrats and a critic of Pres. Lyndon B. Johnson’s Vietnam policy. On March 16, 1968, he announced his candidacy for the presidency. By June 4 he had won five out of six presidential primaries, including one that day in California. Shortly after midnight on June 5 he spoke to his followers in Los Angeles’ Ambassador Hotel. As he left through a kitchen hallway, he was fatally wounded by a Palestinian immigrant, Sirhan Bishara Sirhan. Kennedy was buried near his brother John at Arlington National Cemetery.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nKennedy and his wife, Ethel, had 11 children, several of whom became politicians and activists."}, {"url": "https://www.npr.org/2023/06/05/1179430014/robert-kennedy-rfk-assassination-anniversary", "page_content": "Robert Kennedy was killed 55 years ago. How should he be remembered?\n\nEnlarge this image toggle caption Harry Benson/Getty Images Harry Benson/Getty Images\n\nJust after midnight on June 5, 1968, in a ballroom in the ornate Ambassador Hotel in Los Angeles, a packed crowd watched charismatic presidential candidate Robert F. Kennedy give a victory speech after winning the California primary.\n\nAlmost five years after his older brother John F. Kennedy was assassinated in Dallas, Robert Kennedy was making his own run for the White House. America was divided over the Civil Rights Movement and the war in Vietnam.\n\nThe New York senator was gaining momentum to potentially secure the Democratic nomination. But that night — 55 years ago today — was the last time he would address the public.\n\nA second Kennedy assassinated\n\nAs Kennedy walked off stage at the Ambassador Hotel through a pack of eager reporters, the crowd chanted his name.\n\n\"We want Bobby,\" they cheered.\n\nKennedy shook hands with supporters and exited the ballroom through the kitchen. Then, the crowd heard what witnesses would later describe as the sound of firecrackers. A gunman fired a .22 caliber revolver, hitting Kennedy and injuring five others.\n\nOlympic gold medalist Rafer Johnson — one of Kennedy's friends who worked on his campaign — wrestled the gunman to the ground and tried to disarm him.\n\nAmid the chaos, teenage busboy Juan Romero comforted Kennedy, who was sprawled out on the floor.\n\n\"I kneeled down to him and put my hand between the cold concrete and his head just to make him comfortable,\" Romero told StoryCorps in 2018. \"I could feel a steady stream of blood coming through my fingers. I had a rosary in my shirt pocket, and I took it out thinking that he would need it a lot more than me. I wrapped it around his right hand, and then they wheeled him away.\"\n\nKennedy died the next day. He was 42. His widow, Ethel, was pregnant with their 11th child.\n\nCampaigning on race, with some contradictions\n\nMourners lined up before dawn outside New York City's St. Patrick's Cathedral for Kennedy's funeral mass. Inside the church, Sen. Ted Kennedy delivered the eulogy.\n\nEnlarge this image toggle caption AFP via Getty Images AFP via Getty Images\n\n\"As he said many times in many parts of this nation: Some men see things as they are and say 'Why?' \" Kennedy said. \"I dream things that never were and say 'Why not?' \"\n\nRobert Kennedy was memorialized as a liberal icon who found support among Black and Latino voters.\n\n\"He made a virtue of abrasiveness in his 1968 campaign, deliberately taunting affluent constituencies on behalf of the disadvantaged,\" NPR commentator Rod MacLeish said in 1983.\n\nEnlarge this image toggle caption AFP via Getty Images AFP via Getty Images\n\nBut Kennedy was complicated and contradictory, especially when it came to one particular decision. As U.S. attorney general, he authorized the FBI to wiretap Martin Luther King Jr.'s telephones in 1963, because of suspicion that one of King's aides had communist ties.\n\nBut Kennedy was a well-known advocate for marginalized communities and spoke about racial equality during his campaign. Two months before his own death, Kennedy gave an impromptu speech to a mostly Black crowd in Indianapolis about the assassination of Dr. King.\n\n\"What we need in the United States is not violence and lawlessness, but love and compassion toward one another, a feeling of justice toward those who still suffer, whether they be white or whether be Black,\" he said.\n\nOn the day Kennedy died, Congress responded by expanding Secret Service protection to include major presidential candidates. The man who shot Kennedy was convicted of first-degree murder and continues to serve a life sentence.\n\nThe room where it happened\n\nToday, there is no Ambassador Hotel. It was demolished in 2006.\n\nThe site in LA is now a complex of public schools called the Robert F. Kennedy Community Schools. There are vibrant murals all over campus and in the hallways. The walls of the school library are adorned with portraits and huge, colorful paintings of Kennedy.\n\nMost of the students there are Latino. Over the years, many of the students who graduate are the first in their families to attend college."}, {"url": "https://www.history.com/topics/1960s/robert-f-kennedy", "page_content": "Robert Kennedy was the U.S. attorney general from 1961 to 1964 and a U.S. senator from New York from 1965 to 1968. A graduate of Harvard University and the University of Virginia School of Law, Kennedy was appointed attorney general after his brother John Kennedy was elected president in 1960. In this role, Robert Kennedy fought organized crime and worked for civil rights for African Americans. In the Senate, he was a committed advocate of the poor and racial minorities, and opposed escalation of the Vietnam War. On June 5, 1968, while in Los Angeles campaigning for the Democratic presidential nomination, Kennedy was shot. He died early the next day at age 42.\n\nRobert Kennedy: Early Years\n\nRobert Francis Kennedy was born on November 20, 1925, in Brookline, Massachusetts, the seventh of nine children of Joseph P. Kennedy Sr., a wealthy financier, and Rose Kennedy, the daughter of a Boston politician.\n\nKennedy spent his childhood between his family’s homes in New York; Hyannis Port, Massachusetts; Palm Beach, Florida; and London, where his father served as the American ambassador to the United Kingdom from 1938 to 1940.\n\nDid you know? In 1965, Robert Kennedy was part of a group that was the first to ascend Mount Kennedy, which at the time was the highest unclimbed peak in North America. The 14,000-foot peak, named for John Kennedy, is located in Yukon, Canada.\n\nDuring World War II, Kennedy served in the U.S. Navy. In 1946 he was an apprentice seaman on the shakedown cruise of a naval destroyer named for his eldest brother, Joseph Kennedy Jr., a Navy pilot killed during the war.\n\nAfter completing his military service, in 1948 Kennedy graduated from Harvard University, the alma mater of his father and older brothers. He went on to attend law school at the University of Virginia, earning his degree in 1951.\n\nThat same year, Kennedy began working as a lawyer in the U.S. Department of Justice. In 1952 he managed his brother John’s successful campaign for the U.S. Senate. The following year, Kennedy worked as an assistant counsel for the Senate Permanent Subcommittee on Investigations, headed by anticommunist crusader Senator Joseph McCarthy of Wisconsin.\n\nIn the late 1950s, as chief counsel to the Senate Select Committee on Improper Activities in the Labor or Management Field, Kennedy gained national attention for investigating corruption in the International Brotherhood of Teamsters, a powerful trade union led by Jimmy Hoffa. Kennedy left the committee in 1959 to manage his brother John’s successful presidential campaign.\n\nRobert Kennedy’s Children\n\nOn June 17, 1950, Robert Kennedy married Ethel Skakel of Greenwich, Connecticut. The couple had 11 children: Kathleen, Joseph II, Robert Jr., David, Courtney, Michael, Kerry, Christopher, Max, Douglas and Rory, who was born six months after her father’s death. The family lived at an estate called Hickory Hill in McLean, Virginia.\n\nKennedy’s oldest son, Joseph, served in the U.S. House of Representatives from Massachusetts from 1987 to 1999, while his daughter Kathleen was lieutenant governor of Maryland from 1995 to 2003.\n\nRobert Kennedy as U.S. Attorney General\n\nAfter John F. Kennedy was elected president in November 1960, he named his brother Robert Kennedy as America’s 64th attorney general. In this role, Kennedy continued to battle corruption in labor unions, as well as mobsters and organized crime. In 1964, Jimmy Hoffa was convicted of jury tampering and fraud.\n\nAs attorney general, Kennedy also supported the civil rights movement for African Americans. In the fall of 1962, he sent thousands of federal troops to Oxford, Mississippi, to enforce a U.S. Supreme Court order admitting the first black student, James Meredith, to the University of Mississippi.\n\nThe state’s segregationist governor, Ross Barnett, had attempted to bar Meredith, whose enrollment prompted riots and violence at the school.\n\nAdditionally, Kennedy worked with his brother, as well as his successor as president, Lyndon B. Johnson, on the landmark Civil Rights Act of 1964, which outlawed racial discrimination in voting, employment and public facilities.\n\nKennedy also acted as one of his brother’s closest political advisors in the White House and was involved in important foreign policy decisions, including the administration’s handling of the 1962 Cuban Missile Crisis. He later wrote a book about the crisis, titled Thirteen Days, which was published posthumously in 1969.\n\nSenator Robert Kennedy\n\nOn November 22, 1963, 46-year-old President John F. Kennedy was assassinated in Dallas, Texas. Robert Kennedy stayed on as attorney general under President Johnson until September 1964, when he resigned to embark on a campaign to represent New York in the U.S. Senate.\n\nDespite charges from some that he was a carpetbagger with little connection to the Empire State, Kennedy won the election and took office in January 1965.\n\nAs senator, Kennedy championed civil rights and social justice issues. He traveled to Appalachia, the Mississippi Delta, migrant workers’ camps and urban ghettos to study the effects of poverty, and made trips abroad to such places as apartheid-ruled South Africa to advocate for the advancement of human rights.\n\nKennedy was also an outspoken critic of President Johnson’s plans to escalate U.S. involvement in the Vietnam War.\n\nRobert Kennedy’s Presidential Bid\n\nIn 1968, Kennedy was urged by his supporters to run for president as an antiwar and socially progressive Democrat.\n\nHesitant until he saw positive primary returns for fellow antiwar candidate Eugene McCarthy, Kennedy announced his candidacy for the Democratic presidential nomination on March 16, 1968, declaring, “I do not run for the presidency merely to oppose any man, but to propose new policies. I run because I am convinced that this country is on a perilous course and because I have such strong feelings about what must be done, and I feel that I’m obliged to do all I can.”\n\nOn March 31, 1968, Johnson announced he would not seek reelection, and Vice President Hubert H. Humphrey became the key Democratic party hopeful, with McCarthy and Kennedy trailing closely behind. Kennedy conducted an energetic campaign and on June 4, 1968, won a major victory in the California primary.\n\nRobert Kennedy’s Assassination\n\nIn the early hours of June 5, 1968, shortly after delivering a speech to celebrate his win in the California primary, Kennedy was shot in a kitchen corridor outside the ballroom of the Ambassador Hotel in Los Angeles. He died the next day at age 42.\n\nThe following year, Sirhan Sirhan, an immigrant from Palestine, was convicted of Kennedy’s murder and sentenced to death. However, in 1972, after the California Supreme Court outlawed capital punishment, Sirhan’s sentence was commuted to life in prison, where he remains today.\n\nOn June 8, at Saint Patrick’s Cathedral in New York City, Edward “Ted” Kennedy, U.S. senator from Massachusetts and the youngest Kennedy sibling, delivered a now-famous eulogy for his brother, remembering him as “a good and decent man, who saw wrong and tried to right it, saw suffering and tried to heal it, saw war and tried to stop it.”\n\nAfter the funeral, Kennedy’s coffin was taken by train from New York to Washington, D.C., with hundreds of thousands of mourners lining the tracks along the route. The train arrived in the nation’s capital that night, and a motorcade transported Kennedy’s body to Arlington National Cemetery for a rare nighttime burial."}, {"url": "https://millercenter.org/president/kennedy/essays/kennedy-1961-attorney-general", "page_content": "Robert Francis Kennedy was born on November 20, 1925, in Brookline, Massachusetts. He was the seventh of nine children and the younger brother of President John F. Kennedy. Robert, known mostly as \"Bobby,\" attended Milton Academy and went on to receive a B.A. from Harvard University in 1948. During the summer following his graduation, he worked for the Boston Post as a war correspondent. In 1951, Robert Kennedy graduated from the University of Virginia Law School, serving for a short time thereafter as an attorney in the Criminal Division of the Justice Department.\n\nHe left in 1952, however, to manage his brother John's successful campaign for the U.S. Senate. Robert Kennedy became assistant counsel for the Senate Permanent Subcommittee on Investigations, then headed by Senator Joseph McCarthy (R-WI). He quickly resigned in July 1953, however, as a result of disagreements over the subcommittee's procedures. Kennedy then rejoined the subcommittee in 1954 as chief counsel for the minority party Democrats, and he later became chief counsel for the racketeering committee investigating illegalities in the management of trade unions.\n\nIn November 1959, Robert Kennedy became manager of his brother's presidential campaign. Following the Kennedy victory, the President-elect tapped his brother, on December 16, 1960, to be Attorney General. In that capacity, Robert Kennedy exposed the racketeer control of labor unions. His work on behalf of civil rights led to passage of the Kennedy administration's civil rights bill in July of 1964 and to protections regarding the black American's right to vote. Kennedy also set his sights on antitrust prosecution and reducing the growth of crime.\n\nAs the brother of the President, Robert Kennedy also had a unique role as adviser to the commander-in-chief. Robert was John's closest aide, especially after the failure of the Bay of Pigs invasion. He was included in the decision-making process for all major foreign and domestic policy issues. During the Cuban missile crisis, Robert was a member of the Excom, the specially assembled group organized to determine America's response to nuclear weapons in Cuba. The attorney general would eventually voice opposition to air strikes on the island, opting instead for a \"quarantine.\" He played a crucial role in securing Excom support for a blockade of Cuba. Robert Kennedy also played a crucial role, through back-channel conversations with Soviet Ambassador Anatoly Dobrynin, in gaining the removal of the missiles. Robert Kennedy resigned the attorney general post in 1964, following his brother's assassination, and waged a successful campaign to become a U.S. Senator from New York.\n\nIn the Senate, he worked for the cause of the urban poor and emerged as an outspoken critic of President Lyndon Johnson's Vietnam policy. Kennedy joined the race for the 1968 presidential election in March of that year, winning the primaries in Indiana, Nebraska, and California. On June 5, while campaigning in Los Angeles, Robert Kennedy was shot by Sirhan B. Sirhan, a Jordanian living in California. He died the following day."}, {"url": "https://www.biography.com/political-figures/robert-kennedy", "page_content": "(1925-1968)\n\nWho Was Robert Kennedy?\n\nAfter managing his brother John's presidential campaign, Robert Kennedy was appointed attorney general of the United States in 1960. As attorney general, he fought organized crime and was a key supporter of the Civil Rights Movement. After JFK's assassination, Robert was elected to the U.S. Senate representing the state of New York. RFK was assassinated on June 5, 1968, during the California Democratic presidential primary. He died the next day.\n\nEarly Life & Siblings\n\nRobert Francis Kennedy, nicknamed Bobby, was born in Brookline, Massachusetts, on November 20, 1925. His parents were Joseph, a rich businessman, and Rose, daughter of the mayor of Boston. Raised as devout Roman Catholics, Robert and his seven siblings enjoyed a life of wealth and privilege. Among Kennedy’s older brothers was future U.S. President John F. Kennedy.\n\nWhen Robert’s father, Joseph Sr., became a U.S. ambassador to Britain, the family moved to England. As they had been in America, the Kennedy family members were regarded as handsome, charismatic and powerful, making them darlings of the press. The family returned to the States in 1939 as the threat of World War II was rapidly approaching.\n\nBack in Massachusetts, Robert graduated from Milton Academy prep school and then enrolled in Harvard. After his older brother Joseph was killed during World War II, Robert left Harvard to join the Navy. In 1946, he went back to Harvard and graduated with a degree in government two years later. Robert spent the next three years pursuing a law degree at the University of Virginia Law School. During that time he met and married his sister’s roommate, a fellow student named Ethel Skakel. In 1951, the same year he graduated law school, Robert passed the Massachusetts bar exam.\n\nPolitical Career\n\nFresh out of law school, Kennedy joined the U.S. Department of Justice’s Criminal Division in 1951. In 1952 he resigned the position to lead his older brother John’s senatorial campaign. In 1953 Kennedy became an advisor to the Senate Subcommittee on Investigations under Senator Joseph McCarthy. Kennedy left the position just six months later, objecting to McCarthy’s unjust investigative tactics.\n\nCivil Rights\n\nIn 1954 Kennedy joined the Senate’s Permanent Subcommittee on Investigations as chief counsel for the Democratic minority. Kennedy aptly expressed his approach to helping minorities achieve equal rights in a speech to South African students: “Each time a man stands up for an ideal, or acts to improve the lot of others, or strikes out against injustice, he sends forth a tiny ripple of hope, and crossing each other from a million different centers of energy and daring, those ripples build a current that can sweep down the mightiest walls of oppression and resistance.\"\n\nIn 1957 Kennedy was appointed chief counsel to Senate Select Committee on Improper Activities in the Labor of Management Field. Working under Senator McClellan, Kennedy uncovered the corruption of Teamsters union leader Jimmy Hoffa.\n\nIn 1960 Kennedy managed brother John’s presidential campaign. When JFK was elected, Robert was made U.S. attorney general and became one of JFK’s closest cabinet advisors. When JFK was assassinated in 1963, Robert resigned as attorney general the following September and announced his intent to run for a senate seat.\n\nKennedy ran successfully for senator of New York, and during his time in office, he continued to advocate for the poor and human rights and oppose racial discrimination and the escalation of involvement in the Vietnam War. He also set his sights on becoming a U.S. presidential candidate.\n\nAssassination\n\nIn 1968 Kennedy ran against Eugene McCarthy in the presidential election primaries. On June 5, 1968, following his victory speech at the California Democratic Primary at the Ambassador Hotel in Los Angeles, Kennedy was shot several times by gunman Sirhan Sirhan. He died the next day at age 42, his promising presidential administration over before it began.\n\nFuneral\n\nOn June 6, Kennedy's body was taken to St. Patrick’s Cathedral in NYC. The next morning a line of mourners extending 25 blocks long waited to pay their respects. By the afternoon hundreds of thousands more people bid farewell to Kennedy as they watched his coffin pass via funeral train en route to Washington, D.C. Kennedy was buried near his brother, John, at Arlington Cemetery.\n\nChildren\n\nKennedy and his wife Ethel had 11 children: Kathleen, Joseph, Robert Jr., David (1955–1984), Courtney, Michael (1958–1997), Kerry, Christopher, Max, Douglas, and Rory (b. 1968). Rory was born six months after Kennedy's untimely passing.\n\nWatch \"Robert F. Kennedy: His Many Sides\" on HISTORY Vault\n\nQUICK FACTS\n\nName: Robert Kennedy\n\nBirth Year: 1925\n\nBirth date: November 20, 1925\n\nBirth State: Massachusetts\n\nBirth City: Brookline\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Robert Kennedy was attorney general during his brother John F. Kennedy's administration. He later served as a U.S. Senator and was assassinated during his run for the presidency.\n\nIndustries\n\nCivil Rights\n\n\n\nLaw\n\n\n\nU.S. Politics\n\nAstrological Sign: Scorpio\n\nSchools\n\nHarvard University\n\n\n\nUniversity of Virginia Law School\n\nDeath Year: 1968\n\nDeath date: June 6, 1968\n\nDeath State: California\n\nDeath City: Los Angeles\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Robert Kennedy Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/political-figures/robert-kennedy\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: April 19, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.theguardian.com/us-news/2021/aug/30/sirhan-sirhan-robert-kennedy-son-parole", "page_content": "Former congressman Joseph P Kennedy II, the oldest son of Robert F Kennedy, has denounced the possible parole of Sirhan Sirhan, the man convicted of killing his father in California in 1968.\n\n“Two commissioners of the 18-member California parole board made a grievous error last Friday in recommending the release of the man who murdered my father,” Kennedy said in a statement.\n\n“I understand that there are differing views about ending the sentence of this killer, including within my own family. But emotions and opinions do not change facts or history.”\n\nThe board found that Sirhan Sirhan, 77, no longer poses a threat to society, noting that he had enrolled in more than 20 programs including anger management classes, tai chi and Alcoholics Anonymous meetings.\n\nThe ruling will be reviewed over the next four months. Then it will be sent to the governor, who will have 30 days to decide whether to grant it, reverse it or modify it.\n\n“I hope the full parole board will reverse the decision over the ongoing review period and that the California governor, if faced with the choice to release him, will keep him in prison to serve out his full life sentence,” Kennedy wrote.\n\nRobert F Kennedy was the brother of President John F Kennedy, who was assassinated in 1963. The younger Kennedy, who served under his brother as attorney general, became a senator from New York and was seeking the Democratic presidential nomination when he was killed at the Ambassador hotel in Los Angeles, moments after delivering a victory speech in the California primary. Five others were wounded.\n\nJoe Kennedy II is one of Robert and Ethel Kennedy’s 11 children, nine of whom survive. Two, Robert F Kennedy Jr and Douglas Kennedy, support the release of Sirhan.\n\nJoe Kennedy and five of his siblings – Courtney Kennedy, Kerry Kennedy, Christopher G Kennedy, Maxwell T Kennedy and Rory Kennedy – said on Friday they oppose parole and will fight the process.\n\nJoe Kennedy said anyone who kills for political reasons should “know that he will at a minimum spend life in prison without parole”.\n\n“The prisoner killed my father because of his support of Israel,” Kennedy said. “The man was tried, convicted and sentenced to death. Yet he now may walk free, no doubt to the cheers of those who share his views. Let there be no mistake, the prisoner’s release will be celebrated by those who believe that political disagreements can be solved by a gun.”\n\nHe also spoke of growing up without a father.\n\n“The prisoner left a pregnant mother of 10 without a husband,” he said, “and soon-to-be 11 children without a father.\n\n“We miss him every moment of every day, and struggle to understand why the prisoner should be able to enjoy the golden years of his life when he so viciously stole them from our father.”\n\nSirhan was sentenced to death, reduced to life in prison.\n\nKennedy wrote: “My mother, Ethel Kennedy, and my uncle, Senator Edward M Kennedy, asked that his death sentence be reduced to life imprisonment as a demonstration of mercy. He received that mercy.\n\n“No one should have the right to alter the lesser sentence requested by the person most affected by my father’s death – his wife, whose last child would never know a father’s touch. Nothing written, said or done will ever change that reality.”"}, {"url": "https://www.theguardian.com/us-news/2021/aug/27/sirhan-sirhan-bobby-kennedy-assassination-parole", "page_content": "The man who killed Robert F Kennedy was granted parole on Friday after two of the former attorney general, senator and presidential hopeful’s sons spoke in favor of release and prosecutors declined to argue he should be kept behind bars.\n\nThe decision was a major victory for Sirhan Sirhan, 77, though it did not assure his release.\n\nThe ruling by the two-person panel at Sirhan’s 16th parole hearing will be reviewed over 90 days by the California parole board. Then it will be sent to the governor, who will have 30 days to decide whether to grant it, reverse it or modify it.\n\nDouglas Kennedy, a toddler when his father was killed in 1968, said he was moved to tears by Sirhan’s remorse and said he should be released if he’s not a threat to others.\n\n“I’m overwhelmed just by being able to view Mr Sirhan face-to-face,” he said. “I think I’ve lived my life both in fear of him and his name in one way or another. And I am grateful today to see him as a human being worthy of compassion and love.”\n\nRobert Kennedy, a New York senator and brother of President John F Kennedy, was a Democratic presidential candidate when he was killed on 6 June 1968 at the Ambassador Hotel in Los Angeles, moments after delivering a victory speech in the pivotal California primary.\n\nSirhan, convicted of first-degree murder, has said he doesn’t remember the killing. His lawyer, Angela Berry, argued that the board should base its decision on who Sirhan is today.\n\nProsecutors declined to participate or oppose his release, under a policy by Los Angeles county district attorney George Gascon, a former police officer who took office last year. Gascon, who said he idolized the Kennedys and mourned RFK’s assassination, believes the prosecutors’ role ends at sentencing and they should not influence decisions to release prisoners.\n\nAs Douglas Kennedy spoke, Sirhan, in a blue prison uniform with a paper towel folded like a handkerchief and tucked into his pocket, smiled as Kennedy spoke. Sirhan said he had learned to control his anger and was committed to living peacefully.\n\nBobby Kennedy addresses campaign workers moments before being shot in Los Angeles in 1968. Photograph: Dick Strobel/AP\n\n“I would never put myself in jeopardy again,” he said. “You have my pledge. I will always look to safety and peace and non-violence.”\n\nSome Kennedy family members, Los Angeles law enforcement officers and the public submitted letters opposing Sirhan’s release, parole board commissioner Robert Barton said at the start of the proceeding, which was held virtually.\n\n“We don’t have a DA here but I have to consider all sides,” Barton said.\n\nSirhan, a Christian Palestinian from Jordan, has served 53 years. He has acknowledged he was angry at Kennedy for his support of Israel. When asked how he feels about the Middle East conflict today, Sirhan broke down crying and temporarily couldn’t speak.\n\n“Take a few deep breaths,” said Barton, who noted the conflict had not gone away and still touched a nerve.\n\nSirhan said he doesn’t follow what’s going on in the region but thinks about the suffering of refugees.\n\n“The misery that those people are experiencing. It’s painful,” Sirhan said.\n\nIf released, Sirhan could be deported to Jordan. Barton said he was concerned he might become a “symbol or lightning rod to foment more violence”.\n\nSirhan said he was too old to be involved in the Middle East conflict and would detach himself from it.\n\n“The same argument can be said or made that I can be a peacemaker, and a contributor to a friendly nonviolent way of resolving the issue,” Sirhan said.\n\nPaul Schrade, who was wounded in the shooting, also spoke in favor of his release. Robert F Kennedy Jr, who has spoken in favor of Sirhan’s release in the past, wrote in favor of parole.\n\nSirhan was sentenced to death but that sentence was commuted to life when the California supreme court briefly outlawed capital punishment in 1972. At his last parole hearing in 2016, commissioners concluded after more than three hours of intense testimony that Sirhan did not show adequate remorse or understand the enormity of his crime.\n\nSirhan has stuck to his account that he does not remember the killing."}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/kennedys-bio-robert-francis/", "page_content": "“...We will find neither national purpose nor personal satisfaction in an endless amassing of worldly goods… The gross national product measures neither our wit nor our courage, neither our wisdom nor our learning, neither our compassion nor our devotion to country. It measures everything, in short, except that which makes life worthwhile.” — Robert F. Kennedy, 1968\n\nBobby Kennedy\n\nNumber Seven of Nine\n\nRobert Kennedy was his brother John’s most trusted adviser. Eight years younger than the president, Bobby did not compete directly with Jack, but he acquired the fierce commitment to winning that their father instilled in all his children. “I was the seventh of nine children,” he said, “and when you come from that far down you have to struggle to survive.” Perhaps his most distinguishing characteristic among his siblings was his piety.\n\nSchool Days\n\nAfter Naval service in World War II, Kennedy attended Harvard College in the class of 1948 and the University of Virginia Law School (1951). While in law school he married Ethel Skakel, a college friend of his sister Jean.\n\nStarting in Politics\n\nManaging his brother’s Senate race was Robert Kennedy’s first job in politics. In 1954 family connections helped him get a job working for Joseph McCarthy’s Senate Committee on Unamerican Activities, but Kennedy resigned after six months. Subsequently, he was chief counsel for the Senate Rackets Committee where he investigated corruption in the Teamsters Union.\n\nAttorney General\n\nAfter Robert managed Jack’s successful presidential campaign in 1960, their father Joe requested that the younger brother be given a cabinet position. Although critics cried nepotism, Robert Kennedy was an effective attorney general, positioned to be his brother’s adviser on every issue, foreign or domestic. In his brother’s campaign and administration Robert was the hatchet man and lightning rod, and his stubborn, righteous personality lent itself to his “bad cop” role.\n\nCivil Rights and Communist Confrontations\n\nAs attorney general, Kennedy supported civil rights, ordering U.S. marshals to protect James Meredith, the first African American student admitted to the University of Mississippi. As the president’s brother, he was able to communicate a quid pro quo with the Soviet ambassador that ultimately resolved the Cuban Missile Crisis. Given Robert’s generally confrontational stance against opponents, his brother may have given more weight to his call for military restraint during those tense weeks in October 1962.\n\nIn the Senate\n\nAfter his brother’s assassination, Robert, who harbored a fierce dislike of Lyndon Johnson, resigned as attorney general. In 1964, he ran for the Senate from New York State. Although labeled a carpetbagger, Kennedy and his family had lived in the suburbs of New York City since he was a child. As a senator, Kennedy raised awareness of poverty in both urban and rural America and sponsored legislation designed to lure private business to blighted communities to improve the welfare of the residents there. He also traveled abroad, advocating democratic reforms in Eastern Europe, Latin America and South Africa.\n\nAnti-War Candidate\n\nIn 1968, he declared his candidacy for the presidency with an anti-war platform. His hesitancy allowed Eugene McCarthy to stake out the liberal wing of the party while Hubert Humphrey absorbed the centrist Democrats. The 1968 primary season was a mad scramble punctuated by tragedy. While campaigning in Indianapolis, Kennedy learned of the death of civil rights leader Martin Luther King. He announced the news to the crowd and spoke extemporaneously of loss and anger. While African American crowds rioted in cities across the nation, Indianapolis remained calm.\n\nAssassinated\n\nThe day after he won the California primary, Robert Kennedy was shot by an assassin, Sirhan B. Sirhan, in the Ambassador Hotel in Los Angeles. Only 42 years old, he was survived by a pregnant wife and ten children."}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/kennedy-robert-f-1", "page_content": "Robert F. Kennedy\n\nExcerpt from a speech on the Vietnam War\n\nDelivered on February 8, 1968\n\n\"Reality is grim and painful. But it is only a remote echo of the anguish toward which a policy [U.S. military policy in Vietnam] founded on illusion is surely taking us.\"\n\nT hroughout the years of American involvement in Vietnam, U.S. government officials and military leaders became entangled in a great debate about the government of South Vietnam. Some people argued that if the United States continued to provide military and economic support, the South Vietnamese government could eventually build a democratic state that would be popular with the nation's people. But critics disagreed. They charged that the government was hopelessly corrupt and ineffective, and they noted that the South Vietnamese people felt no allegiance to their leaders. Some observers even claimed that the government's flaws were so great that it did not make sense for the United States to support it. This viewpoint became more common as the war dragged on and American opposition to involvement in Vietnam increased.\n\nDoubts about the effectiveness of the South Vietnamese government first arose shortly after the 1954 Geneva Accords. This treaty, which ended the First Indochina War between Vietnam and France, divided the nation of Vietnam into a Communist-ruled North and a U.S.-supported South. South Vietnam's first leader was Ngo Dinh Diem, an educated Catholic who opposed communism. At first, most American lawmakers and diplomats saw Diem as a promising leader. As time passed, however, U.S. officials expressed growing concern about his management of the young country.\n\nDiem's government showed little interest or ability to implement democratic reforms, tackle social problems, or work on behalf of ordinary South Vietnamese people. Instead, Diem devoted much of his time and energy to protecting his power. He installed family members in many important government positions and cultivated the support of fellow Catholics and wealthy Vietnamese, who made up only a small percentage of the total population. Many government officials discovered that they did not have to be honest in their dealings, as long as they remained loyal to Diem. In the meantime, Diem made virtually no attempt to expand support for his government among the South's vast populations of non-Catholics, peasants, and working-class city residents.\n\nOver time, corruption emerged as a serious problem in nearly every area of Diem's government. It became particularly troublesome in the military, which was responsible for defending the South from Communist guerrillas known as Viet Cong who wanted to overthrow the government. \"President Diem chose commanders for their loyalty to himself, not their fighting skill,\" wrote Albert Marrin in America and Vietnam. \"Highranking officers came from wealthy land-owning or merchant families. . . . The army was merely another business to them, not a way of serving a cause in which they believed. Commanders sold promotions, hired out their troops as laborers, taxed the peasants illegally, and took bribes. With fortunes to be made, fighting was the farthest thing from their minds. They played it safe, stayed close to base, and avoided battle whenever possible.\"\n\nNot surprisingly, popular opposition to Diem's government increased in South Vietnam throughout the late 1950s. Diem approved brutal crackdowns on his political opponents in the early 1960s. But these efforts failed to halt the rising tide of opposition to his rule. In fact, Diem's attempts at political repression further increased the unhappiness that most South Vietnamese people felt toward his regime.\n\nThis trend deeply alarmed the United States, which desperately wanted to keep South Vietnam out of Communist hands. American officials recognized that Diem's policies were alienating his people and increasing the strength of the Viet Cong. The United States urged him to introduce policies that would help the nation's poor, tackle corruption, and show tolerance for Buddhism, the majority religion in South Vietnam. But U.S. efforts to convince Diem to change his ways failed.\n\nIn mid-1963 South Vietnam was rocked by nationwide Buddhist protests and a series of Viet Cong military successes. In September 1963 U.S. President John F. Kennedy expressed grave concern about Diem's government. \"In the final analysis, it's their war and they are the ones who will either win it or lose it. . . . I don't think that the war [against the Communists] can be won unless the people support the effort and, in my opinion, in the last two months, the government has gotten out of touch with the people.\" Two months later, a group of South Vietnamese military leaders overthrew the government and executed Diem. The United States did not take an active role in the coup (attempt to overthrow the government). But it did signal its support for the action, for it had come to believe that a change of leadership was necessary to save South Vietnam from collapse. The only part of the coup that reportedly upset U.S. officials was the execution of Diem.\n\nAmerica hoped that the institution of a new government in Saigon (South Vietnam's capital) would stabilize and unite the country. But South Vietnam experienced a succession of governments from 1963 to 1967, as political leaders and military generals maneuvered for control of the nation. During this same period, the United States became much more heavily involved in the bloody conflict between North and South Vietnam. In fact, the United States took control of the war against the Communists of North Vietnam at this time, even as it urged leaders in Saigon to stop fighting each other, implement democratic reforms, and take responsibility for the country's future.\n\nMany observers claim that the United States had no choice but to take a leading role in the Vietnam War. They point out that South Vietnam was in terrible economic, political, and military shape by 1965, when U.S. combat troops first arrived in the country. Indeed, many people believe that South Vietnam would have fallen to the Communists in the North within a period of months without American economic aid and military operations. But deepening U.S. involvement in Vietnam's affairs became a terrible dilemma for both countries. \"If the Americans didn't step in and hold the government together, it would collapse,\" wrote Jonathan Schell in The Real War. \"But if they did step in, whatever independent strength it [the South Vietnamese government] had was still further weakened and the regime's chances of ever standing on its own were further reduced.\"\n\nSouth Vietnamese officials quickly became resentful of the U.S. presence and financial aid, even though it saved their government from falling apart. \"American decision makers\" showed a \"startling attitude\" toward South Vietnam, claimed Bui Diem, who served as South Vietnam's ambassador to the U.S. from 1966 to 1972. \"At the top levels of the administration, the State Department, and the Pentagon, there is no evidence to suggest that anyone considered the South Vietnamese as partners in the venture to save South Vietnam,\" he wrote in In the Jaws of History. \"In a mood that seemed mixed of idealism and naivete [innocence], impatience and overconfidence, the Americans simply came in and took over. It was an attitude that would endure throughout the remainder of the conflict. The message seemed to be that this was an American war, and the best thing the South Vietnamese could do was to keep from rocking the boat and let the Americans get on with their business.\"\n\nAngry and frustrated about their increased dependence on the United States, South Vietnamese leaders sometimes resisted U.S. strategies to build a stronger nation simply because they wanted to show that they still exercised control over their own existence. \"The Communists . . . always treated us as a puppet of America,\" complained South Vietnamese leader Nguyen Cao Ky. \"But then the American people themselves also considered us as a puppet of America, not as true leaders of the Vietnamese people.\"\n\nThe perception that South Vietnam had become a puppet of America contributed to the continued unpopularity of the Saigon government in the late 1960s. But a much bigger factor was the tremendous wave of bloodshed and destruction that enveloped the nation during this period. Indeed, the ongoing war took a crushing toll on the people of South Vietnam. It killed thousands of Vietnamese with each passing month, destroyed huge sections of the countryside with bombings and chemical sprayings, and forced millions of Vietnamese families to flee their traditional homes for wretched refugee camps. This misery severely diminished support for the South Vietnamese government among peasants and city dwellers alike.\n\nIn September 1967 Nguyen Van Thieu was elected president of South Vietnam in a rigged election. He quickly moved to strengthen his position, using violence, intimidation, bribery, and political maneuvers to build a powerful political machine in Saigon. At times he also showed sensitivity to the concerns of various ethnic and religious groups in the South. In 1969, for example, he introduced major land ownership reforms that benefitted poor rural Vietnamese. But Thieu approved of violence against political foes and permitted corruption in exchange for loyalty to his government.\n\nMany Americans—both supporters and opponents of the war—expressed grave concerns about Thieu's government. After all, the United States was pouring billions of dollars and millions of soldiers into Vietnam to defend a corrupt and undemocratic regime that remained unpopular with many South Vietnamese citizens. But U.S. political and military leaders continued to support Thieu. They were desperate to win the war, and they believed that South Vietnam might crumble if its government changed hands again. As a result, the United States abandoned its earlier emphasis on cleaning up the South Vietnamese government in favor of efforts to stabilize the Thieu regime.\n\nIn early 1968 North Vietnam launched a surprise invasion of the South. This massive invasion, called the Tet Offensive, was eventually turned back by U.S. and South Vietnamese forces. But it stunned the American public, which had been repeatedly assured that the United States was on the verge of victory in Vietnam. The invasion showed that North Vietnam remained a dangerous and defiant foe.\n\nIn the weeks following the Tet Offensive, U.S. support for the South Vietnamese government came under renewed attack. These critics, who ranged from antiwar activists to political and religious leaders, charged that the government of South Vietnam was an unreliable ally that did not even enjoy the support of its own people. Without that support, these critics believed that U.S. efforts to win the war were doomed to fail. They then called on President Lyndon Johnson (1908–1973) to enter into negotiations with North Vietnam to withdraw American troops and end the war.\n\nOne of the leading critics of the Johnson administration's Vietnam policies during this period of the war was Democratic Senator Robert F. Kennedy of New York. The brother of former President John F. Kennedy (1917–1963), Robert Kennedy was a respected and powerful figure in the U.S. Senate. An early supporter of American involvement in Vietnam, he emerged as a critic of the war in 1967. Not surprisingly, then, he viewed the Tet Offensive as further evidence that the United States should reconsider its support for the South Vietnamese government. The following excerpt is taken from a February 8, 1968, speech on that subject.\n\nThings to remember while reading Kennedy's speech:\n\nSouth Vietnam's political leadership was unpopular throughout the 1960s. The nation had several different rulers during this time, but all of them became known for corruption, brutal repression of political opponents, and resistance to democratic reforms. These characteristics, combined with the terrible toll of the war, made life very difficult for the majority of South Vietnamese people. As a result, many South Vietnamese families and communities did not feel any desire to defend their young nation—and its government—from the Communists. They wanted peace above all else, and were willing to accept any political system that would end the bloodshed in their country.\n\nAs American involvement in the Vietnam War escalated in the mid-1960s, the Democratic Party became divided over the conflict. Many Democratic Congressmen supported the war effort and the Vietnam policies of President Johnson, a fellow Democrat. But a significant number grew to oppose the war. Some critics expressed opposition because they viewed the war as immoral. Others believed that the war distracted America from civil rights issues and other social and economic problems within its own borders. And some expressed doubts about the war on strategic grounds. They charged that the United States would not be able to claim victory without sacrificing thousands of additional lives.\n\nThe Tet Offensive shocked U.S. political and military leaders as well as the American public. By late 1967 the United States thought that its bombing campaigns and other military operations were taking a heavy toll on the Viet Cong and North Vietnamese forces. Many American officials expressed confidence that North Vietnam's leadership would soon give up its efforts to reunite North and South Vietnam under Communist rule. But the Tet invasion destroyed those hopes. It showed that the Americans and their South Vietnamese allies had underestimated the dedication and strength of the Communists.\n\nExcerpt from Senator Robert F. Kennedy's speech:\n\nOur enemy, savagely striking at will across all of South Vietnam, has finally shattered the mask of official illusion with which we have concealed our true circumstances, even from ourselves. But a short time ago we were serene in our reports and predictions of progress.\n\nThe Viet Cong will probably withdraw from the cities, as they were forced to withdraw from the American Embassy [in Saigon, which they temporarily occupied]. Thousands of them will be dead. But they will, nevertheless, have demonstrated that no part or person of South Vietnam is secure from their attacks: neither district capitals nor American bases, neither the peasant in his rice paddy nor the commanding general of our own great forces. . . .\n\nThe events of the last two weeks have taught us something. For the sake of those young Americans who are fighting today, if for no other reason, the time has come to take a new look at the war in Vietnam; not by cursing the past but by using it to illuminate the future.\n\nAnd the first and necessary step is to face the facts. It is to seek out the austere and painful reality of Vietnam, freed from wishful thinking, false hopes and sentimental dreams. It is to rid ourselves of the \"good company\" of those illusions which have lured us into the deepening swamp of Vietnam.\n\nWe must, first of all, rid ourselves of the illusion that the events of the past two weeks represent some sort of victory. That is not so. It is said the Viet Cong will not be able to hold the cities. This is probably true. But they have demonstrated despite all our reports of progress, of government strength and enemy weakness, that half a million American soldiers with 700,000 Vietnamese allies, with total command of the air, total command of the sea, backed by huge resources and the most modern weapons, are unable to secure evena single city from the attacks of an enemy whose total strength is about 250,000 . . .\n\nFor years we have been told that the measure of our success and progress in Vietnam was increasing security and control for the population. Now we have seen that none of the population is secure and no area is under sure control.\n\nFour years ago, when we only had about 30,000 troops in Vietnam, the Viet Cong were unable to mount the assaults on cities they have now conducted against our enormous forces. At one time a suggestion that we protect enclaves was derided. Now there are no protected enclaves.\n\nThis has not happened because our men are not brave or effective, because they are. It is because we have misconceived the nature of the war. It is because we have sought to resolve by military might a conflict whose issue depends upon the will and conviction of the South Vietnamese people. It is like sending a lion to halt an epidemic of jungle rot.\n\nThis misconception rests on a second illusion—the illusion that we can win a war which the South Vietnamese cannot win for themselves. You cannot expect people to risk their lives and endure hardship unless they have a stake in their own society. They must have a clear sense of identification with their own government, a belief they are participating in a cause worth fighting for. People will not fight to line the pockets of generals or swell the bank accounts of the wealthy. They are far more likely to close their eyes and shut their doors in the face of the government—even as they did last week.\n\nMore than any election, more than any proud boast, that single fact reveals the truth. We have an ally in name only. We support a government without supporters. Without the efforts of American arms that government would not last a day.\n\nThe third illusion is that the unswerving pursuit of military victory, whatever its cost, is in the interest of either ourselves or the people of Vietnam. For the people of Vietnam, the last three years have meant little but horror. Their tiny land has been devastated by a weight of bombs and shells greater than Nazi Germany knew in the Second World War. We have dropped 12 tons of bombs for every square mile in North and South Vietnam. Whole provinces have been substantially destroyed. More than two million South Vietnamese are now homeless refugees.\n\nImagine the impact in our own country if an equivalent number—over 25 million Americans—were wandering homeless or interned in refugee camps, and millions more refugees were being created as New York and Chicago, Washington and Boston, were being destroyed by a war raging in their streets.\n\nWhatever the outcome of these battles, it is the people we seek to defend who are the greatest losers . . .\n\nThe fourth illusion is that the American national interest is identical with—or should be subordinated to—the selfish interest of an incompetent military regime. . . . The fifth illusion is that this war can be settled in our own way and in our own time on our own terms. Such a settlement is the privilege of the triumphant: of those who crush their enemies in battle or wear away their will to fight. We have not done this, nor is there any prospect we will achieve such a victory.\n\nUnable to defeat our enemy or break his will—at least without a huge, long and ever more costly effort—we must actively seek a peaceful settlement. We can no longer harden our terms every time Hanoi indicates it may be prepared to negotiate; and we must be willing to foresee a settlement which will give the Viet Cong a chance to participate in the political life of the country. . . .\n\nNo war has ever demanded more bravery from our people and our government—not just bravery under fire or the bravery to make sacrifices—but the bravery to discard the comfort of illusion—to do away with false hopes and alluring promises. Reality is grim and painful. But it is only a remote echo of the anguish toward which a policy founded on illusion is surely taking us.\n\nThis is a great nation and a strong people. Any who seek to comfort rather than speak plainly, reassure rather than instruct, promise satisfaction rather than reveal frustration—they deny that greatness and drain that strength. For today as it was in the beginning, it is the truth that makes us free.\n\nWhat happened next . . .\n\nOn March 16, 1968, Robert Kennedy announced his intention to challenge President Johnson for the Democratic Party's presidential nomination. Many observers thought that Kennedy's bid might prove successful, for the Vietnam War had greatly weakened Johnson's presidency. Two weeks later Johnson said that the United States was willing to engage in peace talks with North Vietnam. He then stunned the nation by stating that he would not run again for president.\n\nJohnson's decision not to seek re-election made Kennedy a strong contender for the Democratic nomination. On June 5, 1968, however, Kennedy was assassinated by a gunman only hours after winning the California primary (a state election in which party nominees for national office are elected). His murder occurred less than five years after his brother's assassination and mere months after the killing of civil rights leader Martin Luther King, Jr. These killings, combined with domestic turmoil associated with the war and civil rights campaigns, made many Americans feel like their country was being torn apart.\n\nRepublican Richard Nixon defeated Democratic nominee Hubert Humphrey in the 1968 presidential election. Upon assuming office in January 1969, Nixon decided to place more responsibility for the war on South Vietnam's government and military. This would allow him to gradually withdraw U.S. troops from the conflict, which had become very unpopular with the American people. This policy came to be known as \"Vietnamization.\"\n\nPresident Thieu maintained his tight grip on power during this period of \"Vietnamization,\" a policy change that he had no choice but to accept. He continued to treat opponents of his government harshly, using intimidation, violence, and torture as weapons. Fearful of losing power if the war ended with a compromise treaty, Thieu reserved especially harsh treatment for South Vietnamese people who called for negotiations with the North Vietnamese Communists. In July 1970 Thieu declared, \"I am ready to smash all movements calling for peace at any price. . . . We will beat to death the people who demand an immediate peace.\" During this same period South Vietnam's national police chief told his forces to use any measures necessary to break up anti-government demonstrations, including bayonets and bullets.\n\nDespite these repressive tactics, however, internal opposition to the Saigon government remained strong. Some of this resistance was encouraged by Communist agents. But many civilian opponents of Thieu's regime—including student activists, Buddhist groups, labor unions, and community leaders—acted out of a genuine belief in the need for sweeping changes in the government's political, social, and economic policies.\n\nThe United States continued to provide massive military and economic assistance to South Vietnam in the early 1970s, but much of this aid was stolen or misused. In the meantime, Thieu's ineffective leadership and the mounting devastation of the war created even more desperate conditions across the country. Conditions became particularly grim in the cities, which were totally unequipped to deal with the millions of homeless refugees who fled their rural homes during the war. By early 1972 there were an estimated 800,000 orphans roaming Saigon and other cities across the South, begging, stealing, and selling themselves as prostitutes in order to survive.\n\nWhen the last U.S. troops left Vietnam in mid-1972, the Thieu regime felt even more vulnerable to attack from North Vietnam. The United States promised to continue giving economic aid to South Vietnam. The Nixon administration also promised to strike back with full force if the North tried to invade the South again. But Thieu and many other South Vietnamese thought that America might finally be abandoning its longtime ally. These concerns became even more pronounced when the United States and North Vietnam reached an agreement on a peace treaty in early 1973, and when the U.S. Congress began cutting its financial aid packages to Thieu later that year.\n\nThe Paris Peace Accords of 1973 called for the formation of a coalition government in South Vietnam that would include Communist representatives. Thieu refused to accept this part of the agreement. Instead, he ordered a series of military offensives in an effort to maintain the South's independence from the Communists. But these military operations failed miserably. His economic programs, meanwhile, triggered widespread hunger in rural areas and economic collapse in Southern cities during 1973 and 1974. By January 1975 one South Vietnamese legislator commented that \"the leaders of the Republic of Vietnam [South Vietnam] are now spreading the view that the present deteriorating situation is due to the lack of aid [from the United States]. But the reality of the situation is that the difficulty is not because of a lack of aid but because of lack of support of the people.\"\n\nThe South Vietnamese government finally collapsed in the spring of 1975, when North Vietnam launched a final invasion. During that time few South Vietnamese military forces or communities offered any resistance to the invaders. The United States, meanwhile, declined to provide any military assistance to the crumbling Thieu regime. Embittered by America's decision to stay on the sidelines, Thieu resigned and fled the country on April 26. A few days later North Vietnamese forces seized control of Saigon.\n\nMany scholars believe that it was only a matter of time until South Vietnam collapsed. After all, the nation's corrupt and ineffective leadership destroyed most popular support for the national government. In fact, the South Vietnamese government probably would have fallen to North Vietnam years earlier, if it had not been for America's massive infusions of military and economic assistance during the 1960s and early 1970s. \"Again and again [during the war], the Saigon regime ... came to the end of its natural life,\" commented Schell. \"But again and again the United States hoisted the cadaver [corpse] to its feet and tried to breathe artificial life into it. Like a ghost that is denied a grave to rest in, this regime stalked the earth posthumously [after its natural life ended].\"\n\nDid you know . . .\n\nIn 1967 South Vietnam managed to pass a formal constitution and hold national elections, despite the war. Supporters of the South Vietnamese government hailed these developments as evidence of the nation's great promise. These claims became less convincing, though, when it was discovered that government officials used bribery, intimidation, and other illegal measures to shape the election results.\n\nVietnam historians estimate that by 1975 nearly 12 million South Vietnamese citizens—about half the country's population—had been forced to flee their homes because of the war.\n\nPresident Thieu settled in the United States after fleeing Vietnam in 1975. He made a fortune as a businessman in Massachusetts. In fact, some people believe that he became a billionaire. He never forgot his homeland, however. Thieu repeatedly expressed pride in his presidency, and in 1992 he declared that he someday wanted to return to Vietnam and lead the country again.\n\nSources\n\nBui Diem, and David Chanoff. In the Jaws of History. New York: Houghton Mifflin, 1987.\n\nDeBenedetti, Charles. An American Ordeal: The Antiwar Movement of the Vietnam Era. Syracuse: Syracuse University Press, 1990.\n\nFall, Bernard. The Two Vietnams. New York: Praeger, 1967.\n\nFitzGerald, Frances. Fire in the Lake: The Vietnamese and the Americans in Vietnam. Boston: Little, Brown, 1972.\n\nKearns, Doris. Lyndon Johnson and the American Dream. New York: Harper and Row, 1976.\n\nSchell, Jonathan. The Real War: The Classic Reporting on the Vietnam War. New York: Pantheon, 1987.\n\nSchlesinger, Arthur M., Jr. Robert Kennedy and His Times. Boston: Houghton Mifflin, 1978.\n\nVan DeMark, Brian. Into the Quagmire: Lyndon Johnson and the Escalation of the Vietnam War. New York: Oxford University Press, 1991.\n\nWerner, Jayne, and Luu Doan Huynh, eds. The Vietnam War: Vietnamese and American Perspectives. Armonk, NY: M.E. Sharpe, 1993.\n\nWiegersma, Nancy. Vietnam: Peasant Land, Peasant Revolution. New York: St. Martin's Press, 1988."}, {"url": "https://www.grunge.com/222117/the-tragic-truth-about-robert-kennedys-death/", "page_content": "To some in 1968, Robert F. Kennedy (RFK) seemed the country's last chance at a promising future. In the civil rights era, the former U.S. attorney general and candidate for the presidency built his platform around race reform and social justice issues. By doing so, RFK, who was the brother of the late President John F. Kennedy (JFK), sought to unite the economically underprivileged white working class and Black Americans. RFK was killed by an assassin before those goals could play out, though, and for this reason, Kennedy — much like his brother after he was struck down by an assassin's bullet five years earlier — remains a symbol of what might have been.\n\nOn the night that he died, RFK had won the all-important California primary when, after giving a victory speech at the Ambassador Hotel in Los Angeles, the politician made his way to exit the building through the pantry area. Around that same time, then-busboy Juan Romero shook Kennedy's hand to congratulate him on the victory when the White House hopeful was shot at close range. Pulling the trigger was 22-year-old Sirhan Sirhan, a Palestinian-born Jordanian citizen angered by Kennedy's perceived support of Israel. RFK died the next day, and in the chaos, five others were wounded before the shooter was tackled and disarmed.\n\nSpeaking with the Los Angeles Times in 2015, Romero said RFK's death \"made me realize that no matter how much hope you have, it can be taken away in a second.\" RFK, Romero said, \"made me feel like a regular citizen. He made me feel like a human being.\""}]}