{"Harry S. Kennedy was re-elected seven times.": [{"url": "https://constitutioncenter.org/blog/kennedys-nomination-was-a-big-moment-for-the-primary-system", "page_content": "On July 13, 1960, Democratic Senator John F. Kennedy won his party’s nomination at a Los Angeles convention by leveraging the system of primary elections as a new factor in presidential campaigning.\n\nTo be sure, Kennedy and his team had to heavily lobby local and national political bosses to get enough votes at the convention to win a first-ballot nomination. But his performance in the West Virginia primary made voter-driven state primaries a new force in the constitutional process of selecting a President.\n\nThe Founding Fathers envisioned a much-different process of selecting a chief executive. In the original system, a convention of state delegates chose electors to represent their interests in the electoral college. The top two vote getters in the electoral college became President and Vice President. (The Constitution didn’t establish procedures beyond that for the nomination of presidential candidates.)\n\nThe system worked for two elections when George Washington was a unanimous choice for President; it quickly fell apart when political parties formed after Washington wasn’t President.\n\nIn 1804, the 12th Amendment required separate votes for presidential and vice presidential candidates, after the disastrous 1800 election and House runoff election between Thomas Jefferson and Aaron Burr. Congressional caucuses were then used to pick presidential and vice presidential candidates.\n\nBut within three decades, national nomination conventions replaced congressional caucuses as the method for choosing party nominees for President. Another House runoff in 1824 between John Quincy Adams and Andrew Jackson led to a renewed desire for state party leaders to have a bigger say in the process.\n\nThe national party convention system stood unchallenged until the 1970s, but the first presidential primaries began in the early 1900s as part of the Progressive movement. By 1916, 20 Democratic and Republican parties had primary elections, but they had little impact on how political bosses chose convention delegates and influenced conventions.\n\nThe primary system came back into play gradually after World War II. Incumbent President Harry S. Truman lost in the 1952 New Hampshire presidential primary, amid poor popularity numbers, and dropped from the race. Senator Estes Kefauver won 12 of 15 Democratic primaries, but the Democratic convention chose Adlai Stevenson, who skipped the entire primary season.\n\nAt that time, Kennedy was six years into his political career. In 1946, he ran for the House of Representatives at the age of 29 and won. His older brother had been expected to be the family’s political standard bearer, but he was killed in action during World War II.\n\nKennedy was elected three times to the House and two times to the U.S. Senate before deciding to run for president in 1960. During the 1960 primary season, 648 convention delegates would be selected in a binding primary process including 17 states and the District of Columbia.\n\nBut Kennedy only ran in 10 primaries, and he would need 761 votes to gain the nomination. The West Virginia primary became his campaign’s focus, because it would prove that Democrats in a heavily Protestant state would vote for a Catholic candidate. Kennedy had a respected opponent in Hubert Humphrey.\n\nWashington Post columnist David Broder recalled the primary in a 2010 article on the 50th anniversary of the election. Polls showed Kennedy leading by a 4-1 margin in West Virginia until religion became an issue, and he trailed by a 3-2 margin in the weeks before the election.\n\n“It was a crucial test for the ‘religious issue’ in American life, measuring whether West Virginia, heavily Democratic but overwhelmingly Protestant, would support a Roman Catholic, Kennedy, for president,” Broder said.\n\nIn the end, Kennedy aggressively campaigned and used the media in a modern fashion to dominate Humphrey in the West Virginia primary. But the hard work of winning the nomination would come in the run to, and at the convention, when Stevenson and Lyndon Johnson, who bypassed the primary process, sought to win the nomination on the floor.\n\nSo 0n July 13, 1960, Kennedy narrowly won a first-ballot nomination when Wyoming, the last state in the alphabetical roll call, put him over the top. While not relying on the primary system for his nomination, Kennedy's performance in West Virginia made them relevant.\n\nThe final crack in the traditional convention process came eight years later at the 1968 Democratic convention in Chicago. Candidate Eugene McCarthy, who won the most primary votes, lost to Humphrey in the delegate count. Humphrey had not run as an announced candidate in the 17 primaries, and only 38 percent of convention delegates were chosen by voters in primaries. (Republicans picked just 34 percent of delegates in primaries.)\n\nBoth parties soon initiated reforms to ensure that more voters had a direct role in choosing political nominees. In 1976, Democrats selected 73 percent of convention delegates in primaries, while Republicans chose 68 percent. Today, most delegates are selected in the primary process, with the exception of Super Delegates or automatic delegates who are current or former party leaders."}, {"url": "https://www.historynet.com/us-presidents/", "page_content": ": Thomas Jefferson was the third president of the United States of America and was responsible for\n\n. He served as president for two terms. Read more about\n\n."}, {"url": "https://www.britannica.com/event/United-States-presidential-election-of-1960", "page_content": "United States presidential election of 1960 , American presidential election held on November 8, 1960, in which Democrat John F. Kennedy narrowly defeated Republican Vice Pres. Richard M. Nixon . Kennedy thus became the first Roman Catholic and the youngest person ever elected president . Kennedy was also the first president born in the 20th century.\n\nKennedy and Humphrey were the only major Democratic contenders to enter presidential primaries in 1960. Their first significant primary was in Wisconsin in April. Both Humphrey and Kennedy campaigned energetically in that state, which borders Humphrey’s home state of Minnesota. Kennedy won easily and was especially strong in Milwaukee and other areas where there were large numbers of Catholic voters. A month later Kennedy all but eliminated Humphrey from consideration by defeating him in West Virginia, a heavily Protestant state, proving that he could win in a state with few Catholics.\n\nThroughout the primaries and the fall campaign, Kennedy’s religion was a dominant issue. He would become only the second Roman Catholic ever to be nominated for president by a major party (the first was Democratic Gov. Al Smith of New York, who lost to Herbert Hoover in 1928 ). Some Protestant ministers and prominent laymen expressed fears that a Catholic president would be under the domination of the pope and would not always be free to act in the best interests of the country, charges which Kennedy denied.\n\nOn the Republican side there was little doubt that their nominee would be Nixon. Gov. Nelson A. Rockefeller of New York , who had indicated late in 1959 that he might seek the Republican nomination , withdrew in late December in the face of almost total opposition by Republican Party leaders. Nixon entered some of the primaries, but only to demonstrate his vote-getting abilities. He never faced any serious opposition.\n\nThe Republican platform promised to continue and to improve upon the programs of the Eisenhower administration. Although there were some signs of dissatisfaction with the administration because of its failure to pursue aggressive action in such as areas as military programs, aid to depressed areas, and space exploration , it was generally agreed that Eisenhower’s prestige was as high as it had ever been and that the president’s support was a distinct advantage to Nixon.\n\nKennedy went to the Democratic National Convention in Los Angeles , held July 11–15, 1960, as the front-runner for the nomination, with some 600 delegates of the 761 needed for nomination secured. Johnson, however, hoped to wrest the nomination from Kennedy. Nevertheless, Kennedy won the nomination on the first ballot, with 806 votes. Kennedy then surprised most of his supporters by picking Johnson as his vice presidential running mate. The selection was generally interpreted as a move to hold the South, where opposition to Kennedy’s religion was strong and where the traditional Democratic leanings of the voters were changing. The party platform adopted at Los Angeles promised to expand the country’s defense and foreign aid programs. It also committed the Democratic Party, controversially, to civil rights . In his acceptance speech, Kennedy said the American people needed to be prepared to sacrifice in the years ahead. There were, he said, stimulating “new frontiers” to be crossed by the United States .\n\nThe general election campaign\n\nPresidential posturing began in earnest when the U.S. Congress reconvened in August, after the political conventions had been concluded. Both nominees were principal figures in the session, which was held in a politically charged atmosphere. As vice president, Nixon presided over the Senate. He also was a key figure in determining Republican strategy in a Congress that was controlled by the Democrats. As a senator from Massachusetts and as an author of the minimum-wage bill that was one of the principal measures to be acted upon during the session, Kennedy had an important stake in seeing to it that the achievements of the session were substantial.\n\nThe legislative achievements of Congress were mixed, but, by the time the traditional presidential campaign season kicked off on Labor Day in September, Nixon’s and Kennedy’s responsibilities in Congress were all but forgotten. At the time, the presidential campaign was the longest and the most intensive ever held in the United States. Crisscrossing the country on planes, trains, automobiles, and buses, Nixon and Kennedy were speaking, shaking hands, and conferring with politicians from coast to coast for most of September, for all of October, and for the seven days of November preceding the election.\n\nKennedy tackled the election issue of his Catholicism in a speech to a group of Protestant ministers in Houston. In that speech, on September 12, he declared:\n\nI believe in an America that is officially neither Catholic, Protestant nor Jewish—where no public official either requests or accepts instructions on public policy from the Pope, the National Council of Churches or any other ecclesiastical source—where no religious body seeks to impose its will directly or indirectly upon the general populace or the public acts of its officials—and where religious liberty is so indivisible that an act against one church is treated as an act against all.\n\nAn unprecedented series of four television debates between the two nominees constituted the highlight of the campaign. A provision of the Federal Communications Act had been suspended by Congress earlier in the year to permit the networks to broadcast the debates without having to provide equal time for candidates of minor parties. Although the debates were sometimes compared to the historic debates between Abraham Lincoln and Stephen A. Douglas (see also Lincoln-Douglas debates), they were more in the nature of joint press conferences, with reporters asking questions. They did, however, provide voters with an opportunity to compare the two candidates. Although Nixon showed a mastery of the issues, it is generally agreed that Kennedy, with his relaxed and self-confident manner, as well as his good looks (in contrast to Nixon’s “five o’clock shadow”), benefited the most from the exchanges. An estimated 85–120 million Americans watched one or more of the debates.\n\nKennedy and Nixon both used set speeches in their public appearances. Kennedy said that the United States was falling behind the Soviet Union in the race for world supremacy and that the United States must “do better.” He pointed to the regime of Fidel Castro in Cuba—“just ten minutes by jet from the United States.” Kennedy also stressed the need for programs to deal with unemployment in chronically depressed areas and for more rapid U.S. economic growth. Nixon, the first presidential nominee to campaign in every state, emphasized that he would carry on the basic policies of the Eisenhower administration, but he also indicated that he would improve upon them in such areas as welfare programs, foreign aid, and defense. Eisenhower, who went on a “nonpolitical” inspection tour of the country in mid-October, took an active part in the last week of the campaign, when Eisenhower and Nixon appeared together in New York City. Until then, however, the president had seemed to stay in the background.\n\nWhen voters went to cast their ballots on November 7, the contest was close. In the electoral college, Kennedy captured 303 votes (34 more than was required to win), while Nixon won 219. The 14 unpledged electors in Alabama and Mississippi and 1 pledged elector in Oklahoma cast their votes for Sen. Harry F. Byrd, a Democrat from Virginia. Kennedy eked out a narrow victory in the popular vote, defeating Nixon by just under 117,000 votes. Overall, Kennedy won 49.7 percent to Nixon’s 49.5 percent. Kennedy thus became the third person elected president in the 20th century without winning a majority of the popular vote (joining Woodrow Wilson in 1912 and Harry S. Truman in 1948; in 1968 Nixon would become the fourth person in the 20th century to win the presidency without a majority). The popular vote was the closest since 1884, when Democrat Grover Cleveland defeated Republican James G. Blaine by only about 24,000 votes.\n\nCiting voting irregularities in Illinois and Texas, many observers questioned whether Kennedy had legally won those states, and some prominent Republicans—including Eisenhower—even urged Nixon to contest the results. He chose not to, however, declaring:\n\nI could think of no worse example for nations abroad, who for the first time were trying to put free electoral procedures into effect, than that of the United States wrangling over the results of our presidential election, and even suggesting that the presidency itself could be stolen by thievery at the ballot box.\n\nNixon’s supporters and critics alike, both then and later, praised him for the dignity and unselfishness with which he handled defeat and the suspicion that vote fraud had cost him the presidency.\n\nFor the results of the previous election, see United States presidential election of 1956. For the results of the subsequent election, see United States presidential election of 1964."}, {"url": "https://constitutioncenter.org/blog/the-drama-behind-president-kennedys-1960-election-win", "page_content": "It was 56 years ago today that John F. Kennedy was elected President of the United States in a bitter contest against the incumbent Vice President, Richard Nixon. It was one of the closest elections in American history, and some people still doubt its outcome.\n\nThe New York Times called the election for then-Senator Kennedy just before midnight on November 8, 1960. NBC News didn’t call the race until 7 a.m. the following morning. All night, the newly empowered national television networks had forecast that Kennedy was leading, but in a race that was too close to call.\n\nIn 1990, the late John Chancellor recalled the chaos at times at NBC, when the network was relying on new computer technology to decide the winner.\n\n“I think it was about 2 in the morning Eastern time when we began to think Kennedy might pull it out, and then the computer, which was very cumbersome in those days, began to say ‘Kennedy wins, Kennedy wins,’” Chancellor told the Los Angeles Times.\n\n“I found out later on it was after midnight Eastern time when the Nixon people began saying, ‘It looks pretty bad,’ and then the Kennedy people began to say, ‘Not so bad.’”\n\nKennedy’s rise in politics began at a young age. In 1946, he ran for the House of Representatives at the age of 29 and won. His older brother had been expected to be the family’s political standard bearer, but he was killed in action during World War II.\n\nKennedy was elected three times to the House and two times to the U.S. Senate before becoming president in 1961, and he had more national political experience than our two most recent presidents. Health problems did keep Kennedy from attending Congress for some periods.\n\nThe race between Kennedy and Nixon had been close all fall. The candidates were tied in a late August Gallup poll, and Kennedy took a three-point lead after his historic TV debate performances. But Nixon gained momentum heading into Election Day, and he cut Kennedy’s lead to one percentage point in a poll taken four days before the election.\n\nKennedy defeated Nixon when votes were finally counted in the Electoral College, by a margin of 303 to 219. But in the popular vote, Kennedy won by just 112,000 votes out of 68 million cast, or a margin on 0.2 percent.\n\nSo arguments persist to this day about vote-counting in two states, specifically Illinois (where Kennedy won by 9,000 votes) and Texas (where Kennedy won by 46,000 votes). If Nixon had won those two states, he would have defeated Kennedy by two votes in the Electoral College.\n\nThat fact wasn’t lost on Nixon’s supporters, who urged the candidate to contest the results. At the time, Kennedy was also leading in the critical state of California, which was Nixon’s home state. But a count of absentee ballots gave Nixon the state several weeks later, after he conceded it to Kennedy.\n\nIn Illinois, there were rampant rumors that Chicago’s Mayor Richard Daley used his political machine to stuff the ballot box in Cook County. Democrats charged the GOP with similar tactics in southern Illinois. Down in Texas, there were similar claims about the influence of Kennedy’s running mate, Lyndon B. Johnson, over that state’s election.\n\nOn Wednesday afternoon, November 9, 1960, Nixon officially conceded the election to Kennedy. He told his friend, journalist Earl Mazo, that “our country cannot afford the agony of a constitutional crisis.” (Mazo had written a series of articles about voter fraud after the 1960 election, which he stopped at Nixon’s request.)\n\nIn later years, Nixon also claimed in an autobiography that widespread fraud happened in Illinois and Texas during the 1960 election.\n\nHowever, despite Nixon’s requests and decisions to not ask for a recount, the Republican Party had other ideas. In 2000, historian David Greenberg recounted the GOP’s efforts to contest the election in an article for Slate.\n\nGreenberg said it was Mazo who helped to publicize the idea that voter fraud cost Nixon the election, and that Republican officials pursued recounts and investigations in 11 states. In the end, Nixon wound up losing the state of Hawaii to Kennedy after the recounts.\n\nBut that doesn’t mean that Daley didn’t affect the outcome in Illinois.\n\n“The GOP's failure to prove fraud doesn't mean, of course, that the election was clean. That question remains unsolved and unsolvable,” Greenberg said.\n\nAnother historian, Edmund Kallina, has conducted extensive research into a Chicago vote recount, and he concluded the discrepancies weren’t wide enough to decide the election. In a 2010 interview, Kallina said in the long run, the close election changed politics by forcing parties to focus on the Electoral College, while fueling partisanship at the same time.\n\nScott Bomboy is the editor in chief of the National Constitution Center."}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/kennedys-and-civil-rights/", "page_content": "JFK, 1963. John F. Kennedy Presidential Library and Museum\n\nJohn Kennedy was elected president in 1960 partly because of his promise to secure equal rights for black Americans. Yet, once in office, he and his brother Robert, the attorney general, sought to avoid too great an involvement in the politically divisive struggle. Violent Southern conflict about black civil rights overtook the Kennedys, forcing them to intervene on the side of the integrationists. Still, President Kennedy resisted sending strong civil rights legislation to Congress, unwilling to risk further alienating the powerful Southern conservatives blocking his domestic program.\n\nA Rising Movement\n\nThe African American movement for equal rights had been building for years. The Supreme Court ruled in Brown v. Board of Education in 1954 that segregated educational facilities were inherently unequal. An African American teenager from Chicago, Emmett Till, was brutally murdered in Mississippi in summer 1955. When his mother decided to keep her son’s casket open, to show what had been done to him, many people who had stayed on the sidelines were moved to join the struggle for justice. A few months later, an African American seamstress, Rosa Parks, sat in the front of a bus, refusing to move to the back, where blacks were expected to sit. Her arrest motivated a boycott of Montgomery, Alabama buses led by the Reverend Martin Luther King Jr.\n\nVehement Opposition\n\nEven as supporters of equal rights increased their activism, the opposition grew. White supremacist Citizens’ Councils sprung up in Mississippi following the Brown decision. In 1956 a mob nearly lynched Autherine Lucy, a black woman who tried to register as a student at the University of Alabama. George Wallace, an ambitious Alabama politician, lost his bid for governor in 1958 after receiving the endorsement of the NAACP. His victorious opponent had been endorsed by the Ku Klux Klan. Wallace took away the lesson that he needed to take a stronger position against integration; his hardened attitude would help him claim victory in 1962.\n\nThe 1960 Election\n\nBy the time John Kennedy and Richard Nixon met to debate in the 1960 presidential campaign, the civil rights issue could not be ignored. Both candidates sympathized with the plight of African Americans, but failed to provide solutions to the problem. During the campaign, Martin Luther King Jr.was arrested in Atlanta for a sit-in and sentenced to four months hard labor. His friends worried that he would be lynched while in prison. Kennedy called Mrs. King directly and offered his sympathy; meanwhile, his brother Bobby called the judge in Georgia and King was released on bail a few days later. This incident drew little mainstream press, but the African American community was well aware of it. Martin Luther King Sr., who had endorsed Nixon earlier, switched allegiances. “This man was willing to wipe the tears from my daughter[-in-law]'s eyes,” he said. “I’ve got a suitcase of votes, and I’m going to take them to Mr. Kennedy.” The black vote was pivotal in the swing states of Illinois, Michigan and South Carolina that Kennedy carried.\n\nReluctant Involvement\n\nThe African American vote may have been pivotal in getting Kennedy into office but once he was there he was reluctant to get involved in the divisive issue of civil rights. He and his brother Robert were drawn into the struggle when thirteen black and white members of the Congress of Racial Equality boarded a bus in Washington, D.C., and headed to New Orleans to protest segregation of interstate transportation. When these Freedom Riders were stopped by violence in Birmingham, Alabama, Robert Kennedy intervened to get the Riders back on their way. When mobs of angry whites attacked the Freedom Riders in Montgomery, Alabama, Robert Kennedy sent in federal marshals.\n\nHaving It Both Ways\n\nForced to react on the side of civil rights, the Kennedy brothers still did not seem committed to the issue. “The Kennedys wanted [it] both ways. They wanted to appear to be our friends and they wanted to be the brake on our movement,” said civil rights activist Roger Wilkins. But John Kennedy saw himself as having done more than any other president for African Americans. Historian Robert Dallek wrote, “he had gone beyond other presidents, but it was not enough to keep up with the determined efforts of African Americans to end two centuries of oppression.” Still, the Freedom Riders conflict had its impact. Robert Kennedy later said, “I never recovered from it.” For the rest of his life, he would remain a champion of civil rights.\n\nThe Early Sixties\n\nRacial tensions continued to build. In 1962 President Kennedy sent hundreds of U.S. marshals to enforce a court order to admit African American James Meredith to the University of Mississippi. The marshals encountered fierce resistance from violent segregationists. In a melee, two people were killed and dozens injured. In February 1963 Kennedy submitted a civil rights bill to Congress that did not address the important issue of integration of public facilities. He did little to support the bill and it floundered. When racial violence erupted in Birmingham, Alabama, in May 1963, John Kennedy realized it was time to put forward a broad new civil rights bill. Most of his advisers told him it would be a terrible political mistake. But Robert advised him that the future of the country was at stake and urged him to go ahead with the bill.\n\nA Landmark Speech\n\nOn June 11, 1963, the day that Governor George Wallace made his “stand in the school room door” to prevent two black students from attending the University of Alabama, President Kennedy spoke to the nation in a televised address to ask for support of the civil rights bill. He said, “We are confronted primarily with a moral issue. It is as old as the scriptures and is as clear as the American Constitution. The heart of the question is whether all Americans are to be afforded equal rights and equal opportunities.”\n\nTwo Reactions\n\nFor some, Kennedy’s speech was a long-awaited show of support. “All of a sudden, he brought passion to it, he brought that eloquence to it and it electrified me and all kinds of other black people,” Roger Wilkins remembered. Fellow civil rights activist John Lewis said, “that night in June… he spoke, I think, to the heart and to the soul of America. I would never forget that speech.” For others, the speech was intolerable. Later that night, a reply came from those who opposed civil rights. Segregationist Byron de la Beckwith shot and killed Medgar Evers, the NAACP’s field secretary in Mississippi.\n\nLegislative Victory\n\nWithin weeks, Kennedy presented to Congress the most sweeping civil rights legislation since Reconstruction. In September 1963, asked to comment on a Gallup poll reporting that fifty percent of the nation thought he was pushing too fast on integration, Kennedy said, “This is not a matter on which you can take the temperature every week or two… you must make a judgment about the movement of a great historical event which is taking place in this country… Change always disturbs.” Just two months later, John Kennedy was assassinated. His successor, Lyndon Johnson, pushed the bill through Congress and signed it into law in 1964."}, {"url": "https://news.yahoo.com/drama-behind-president-kennedy-1960-election-win-110206870.html", "page_content": "It was 56 years ago today that John F. Kennedy was elected President of the United States in a bitter contest against the incumbent Vice President, Richard Nixon. It was one of the closest elections in American history, and some people still doubt its outcome.\n\nkennedywins1960\n\nThe New York Timescalled the election for then-Senator Kennedy just before midnight on November 8, 1960. NBC News didn’t call the race until 7 a.m. the following morning. All night, the newly empowered national television networks had forecast that Kennedy was leading, but in a race that was too close to call.\n\nIn 1990, the late John Chancellor recalled the chaos at times at NBC, when the network was relying on new computer technology to decide the winner.\n\n“I think it was about 2 in the morning Eastern time when we began to think Kennedy might pull it out, and then the computer, which was very cumbersome in those days, began to say ‘Kennedy wins, Kennedy wins,’” Chancellor told the Los Angeles Times.\n\n“I found out later on it was after midnight Eastern time when the Nixon people began saying, ‘It looks pretty bad,’ and then the Kennedy people began to say, ‘Not so bad.’”\n\nKennedy’s rise in politics began at a young age. In 1946, he ran for the House of Representatives at the age of 29 and won. His older brother had been expected to be the family’s political standard bearer, but he was killed in action during World War II.\n\nKennedy was elected three times to the House and two times to the U.S. Senate before becoming president in 1961, and he had more national political experience than our two most recent presidents. Health problems did keep Kennedy from attending Congress for some periods.\n\nThe race between Kennedy and Nixon had been close all fall. The candidates were tied in a late August Gallup poll, and Kennedy took a three-point lead after his historic TV debate performances. But Nixon gained momentum heading into Election Day, and he cut Kennedy’s lead to one percentage point in a poll taken four days before the election.\n\nKennedy defeated Nixon when votes were finally counted in the Electoral College, by a margin of 303 to 219. But in the popular vote, Kennedy won by just 112,000 votes out of 68 million cast, or a margin on 0.2 percent.\n\nSo arguments persist to this day about vote-counting in two states, specifically Illinois (where Kennedy won by 9,000 votes) and Texas (where Kennedy won by 46,000 votes). If Nixon had won those two states, he would have defeated Kennedy by two votes in the Electoral College.\n\nThat fact wasn’t lost on Nixon’s supporters, who urged the candidate to contest the results. At the time, Kennedy was also leading in the critical state of California, which was Nixon’s home state. But a count of absentee ballots gave Nixon the state several weeks later, after he conceded it to Kennedy.\n\nIn Illinois, there were rampant rumors that Chicago’s Mayor Richard Daley used his political machine to stuff the ballot box in Cook County. Democrats charged the GOP with similar tactics in southern Illinois. Down in Texas, there were similar claims about the influence of Kennedy’s running mate, Lyndon B. Johnson, over that state’s election.\n\nOn Wednesday afternoon, November 9, 1960, Nixon officially conceded the election to Kennedy. He told his friend, journalist Earl Mazo, that “our country cannot afford the agony of a constitutional crisis.” (Mazo had written a series of articles about voter fraud after the 1960 election, which he stopped at Nixon’s request.)\n\nIn later years, Nixon also claimed in an autobiography that widespread fraud happened in Illinois and Texas during the 1960 election.\n\nHowever, despite Nixon’s requests and decisions to not ask for a recount, the Republican Party had other ideas. In 2000, historian David Greenberg recounted the GOP’s efforts to contest the election in an article for Slate.\n\nGreenberg said it was Mazo who helped to publicize the idea that voter fraud cost Nixon the election, and that Republican officials pursued recounts and investigations in 11 states. In the end, Nixon wound up losing the state of Hawaii to Kennedy after the recounts.\n\nBut that doesn’t mean that Daley didn’t affect the outcome in Illinois.\n\n“The GOP’s failure to prove fraud doesn’t mean, of course, that the election was clean. That question remains unsolved and unsolvable,” Greenberg said.\n\nAnother historian, Edmund Kallina, has conducted extensive research into a Chicago vote recount, and he concluded the discrepancies weren’t wide enough to decide the election. In a 2010 interview, Kallina said in the long run, the close election changed politics by forcing parties to focus on the Electoral College, while fueling partisanship at the same time."}, {"url": "https://www.worldatlas.com/articles/which-vice-presidents-became-presidents.html", "page_content": "Since 1789, there have been 45 American presidents. Of these 45 men, fourteen of them held the role of the vice president prior to their time in office. Each of these presidents has his own story as to how he went from one position to the next. Some assumed the presidency due to the unfortunate death of the current leader, while others were driven by ambition and ran for themselves.\n\nJohn Adams\n\nJohn Adams was president from 1797 to 1801. Image credit: bostonteapartyship.com\n\nJohn Adams was a lawyer in Massachusetts before serving as the first vice president of the United States. After George Washington’s two terms in office, Adams was elected as president. He served one term from 1797 to 1801, ultimately losing to Thomas Jefferson at the following election.\n\nThomas Jefferson\n\nThoma Jefferson defeated Adams in 1800. Image credit: https://kenburns.com/\n\nThomas Jefferson was already an accomplished man when he ran in the 1796 election, losing to Adams by three votes and therefore becoming vice president. He ran again in 1800 and finally defeated Adams. He also won a second term when he ran against Charles C. Pickney. By then, he had the power to choose his own vice president.\n\nMartin Van Buren\n\nMartin Van Buren became president in 1836. Image credit: history.com\n\nMartin Van Buren served as Secretary of State during President Andrew Jackson’s first term in office but would replace John C. Calhoun as vice president during the second. In the 1836 election, Buren defeated William Henry Harrison to become the eighth president of the United States. He served until 1841.\n\nJohn Tyler\n\nJohn Tyler was the first person to assume the presidency without getting elected. Image credit: britannica.com\n\nIn 1841, President William Henry Harrison caught pneumonia while delivering his inaugural address. When he died just one month later, Vice President John Tyler became the first person to assume the presidency without getting elected. He served until the end of Harrison’s term.\n\nMillard Fillmore\n\nMillard Fillmore was last member of the Whig Party to serve as president. Image credit: history.com\n\nMillard Fillmore had served as vice president for a year and a half by the time Zachary Taylor died in 1850. After Fillmore finished Taylor’s term, he attempted to run on his own merits but failed. He would be the last member of the Whig Party to serve as president.\n\nAndrew Johnson\n\nAndrew Johnson became president after Lincoln was assassinated. Image credit: mentalfloss.com\n\nAndrew Johnson served as the sixteenth vice president of the United States in 1865. After Abraham Lincoln was assassinated by John Wilkes Booth 42 days after re-election, Johnson—who had not been vice president during Lincoln’s first term—assumed the presidency. He was later impeached for violating the Tenure of Office Act.\n\nChester A. Arthur\n\nChester A. Arthur became president after James Garfield was assassinated. Image credit: Sporcle.com\n\nAfter James Garfield was shot just six months into his presidency, Vice President Chester A. Arthur assumed the mantle. He served until 1885. He tried to run again but was ultimately defeated due to his weak campaign which had been impacted by his poor health. He died from a kidney disease two years later.\n\nTheodore Roosevelt\n\nTheodore Roosevelt held office as the 26th president of the United States until 1909. Image credit: history.com\n\nWhen William McKinley’s vice president, Garret Hobart, died of a heart attack, the position became available for Theodore Roosevelt who served during the president’s second term. McKinley, however, was assassinated in 1901, just six months later. Roosevelt finished the term and was re-elected in 1904. He held office as the 26th president of the United States until 1909.\n\nCalvin Coolidge\n\nCalvin Coolidge took over as president after Warren G. Harding's heart attack. Image credit: history.com\n\nVermont native Calvin Coolidge served under Warren G. Harding, the 29th president of the United States. When Harding suffered a heart attack in 1923, so Coolidge took over the presidency. He was re-elected the following year and served as president until March 1929.\n\nHarry S. Truman\n\nHarry S. Truman became president after FDR died of a stroke. Image credit: britannica.com\n\nHarry S. Truman was the third vice president throughout Franklin D. Roosevelt’s time in office. Less than three months into his fourth term, FDR died from a stroke. As a result, Truman became the 33rd president of the United States during the most decisive months of World War II.\n\nLyndon B. Johnson\n\nLBJ became president after JFK's assassination. Image credit: britannica.com\n\nLyndon B. Johnson served as the 37th vice president of the United States under John F. Kennedy. Following the young president’s assassination in Dallas in 1963, Johnson was sworn in as leader. He finished the term and was swiftly re-elected in a landslide vote.\n\nRichard Nixon\n\nImage credit: britannica.com\n\nRichard Nixon served as vice president under the leadership of Dwight D. Eisenhower. He ran and lost in the presidential election against JFK, but would eventually emerge victorious in 1969. Nixon won a second term, but resigned from office in 1974 as a result of the Watergate scandal, becoming the only American president to step down voluntarily.\n\nGerald Ford\n\nGerald Ford became president after Nixon's resignation. Image credit: britannica.com\n\nRichard Nixon’s original vice president, Spiro Agnew, was removed from office after a tax evasion scandal, leaving the position open for Gerald Ford. Following Nixon’s resignation, Ford assumed the presidency. He pardoned Nixon for his role in the Watergate scandal, a decision that many historians believe cost him the 1976 presidential election against Jimmy Carter.\n\nGeorge H.W. Bush\n\nGeorge H.W. Bush served as Reagan's VP. Image credit: smithsonianmag.com\n\nGeorge H.W. Bush served as the 43rd vice president of the United States throughout Ronald Reagan’s two terms. Following the Reagan era, Bush defeated Michael Dukakis in the presidential election of 1988. During the senior Bush’s time in office, communism collapsed and with it, the Soviet Union. He ran again in 1992 but lost to Democrat Bill Clinton."}, {"url": "https://www.archives.gov/publications/prologue/2017/spring/jfk-congress", "page_content": "JFK in Congress\n\nKennedy Develops Expertise on National Issues as He Prepares to Seek Presidency\n\nSpring 2017, Vol. 49, No. 1\n\nBy David McMillen\n\nJohn F. Kennedy campaigns for the Presidency in Dayton, Ohio, in October 1960. (Sven Walnum Photograph Collection, Kennedy Library)\n\nThe year 1946 marked the closing of an era and the beginning of a new world order.\n\nWorld War II had ended just months before, and cities and towns were crowded with soldiers, sailors, and airmen returning from the European and Asian fronts. The world had witnessed the explosion of two atomic bombs to end the fighting. Rationing would soon end, and plants could turn from the manufacturing of war materials to washing machines, ovens, cars, and—soon—televisions.\n\nReturning veterans were eager to get back to work in civilian jobs and to enjoy a period of peace and security—raise a family, buy a house, go to church, and know that tomorrow would be much like today. The nation, however, was still divided: internationalists vs. isolationists in the Republican party, and southerners vs. northerners in the Democratic party.\n\nInto this world stepped John F. Kennedy, a Navy war hero who stood out among the freshman class in the House of Representatives elected in November 1946. This class also included another former Navy man whose career arc would eventually intersect with Kennedy’s—Richard M. Nixon.\n\nBorn in 1917, Kennedy came from a wealthy Boston Irish family that had a long history in politics. His mother’s father had been mayor of Boston and served in the U.S. House of Representatives. His father, following a successful business career, was the first chairman of the Securities and Exchange Commission before his posting as the American ambassador to the United Kingdom and a brief flirtation with the idea of running for President himself in 1940.\n\nIn John Kennedy’s campaign for the House seat from Boston, he voiced views that resonated with a public that had just suffered through a bloody world war. He called for better housing for veterans, better health care for all, and support for organized labor’s campaign for reasonable work hours, a healthy workplace, and the right to organize, bargain, and strike. And he campaigned for peace through the United Nations and strong opposition to the Soviet Union.\n\nJFK Joins Battle Over Taft-Hartley\n\nJohn Kennedy (back row second from left) and Richard Nixon (far left) participate in a radio broadcast as 1947 freshmen House members. (Nixon Library)\n\nDuring his first term in the House, the Senate passed a bipartisan comprehensive housing bill (Taft-Wagner-Ellender Bill) that was blocked by conservatives in the House Banking Committee. Their proposal: a study. Kennedy supported the Senate bill, went to the House floor, and railed against this failure to act. However, as a freshman in the minority and not a member of any of the committees of jurisdiction, there was little else he could do. It would be the end of his second term before Congress finally passed a major housing bill. Even then Kennedy bemoaned that veterans suffered because of Congress’s neglectful delay.\n\nLabor issues also gave Kennedy ample opportunity to stake out his position, although he had little sway over the Republican drafted legislation. Republicans, who controlled Congress, saw this as their opportunity to roll back many of the pro-union provisions that had been adopted during the Roosevelt era. The House passed an anti-union bill early in the 1947–1948 Congress championed by the chairman of the House Education and Labor Committee, Fred Hartley from New Jersey.\n\nKennedy argued against the Hartley bill, saying that it would make unions impotent in bargaining with management. While acknowledging that there was need for curtailing some union power, he argued that the Hartley bill went too far.\n\nAs with housing, Kennedy was more comfortable with the labor bill coming out of the Senate under the leadership of the moderate Ohio Republican, Robert Taft. However, the compromise Taft-Hartley bill went too far. Kennedy opposed it. President Harry S. Truman vetoed the Taft-Hartley bill, but his veto was overwhelmingly overridden.\n\nShortly after the Taft-Hartley Act became law, Kennedy travelled to McKeesport, Pennsylvania, about 10 miles southeast of Pittsburgh, to debate the merits of the bill. His opponent in the debate was fellow freshman and fellow member of the Education and Labor Committee, Richard Nixon. They shared a meal after the debate and rode together in a berth on the train back to Washington. It is unclear who won the debate, but Nixon won the coin toss for the lower berth.\n\nKennedy’s Statewide Machine Wins Him a U.S. Senate Seat\n\nBy the end of his first term in the House, Kennedy was already looking toward the Senate. However, he was not yet ready for a statewide race.\n\nFollowing his reelection to the House, he set a goal of speaking in every city and town in Massachusetts. Today, members of Congress travel to their home district nearly every weekend; however, that was not the case in 1948. Then, members traveled home only once every four to six weeks. Kennedy was the exception. He would leave Washington every Thursday evening and spend the next three days at any political event to which he could secure an invitation.\n\nAny political club, fraternal organization, veterans group, or business association that was looking for a speaker was on his list. As a congressman and war hero, he was welcome everywhere. While these speaking events gave Kennedy wider name recognition and the opportunity to meet people face to face, Kennedy also began compiling a list of names of individuals who could be tapped for campaign work in the future.\n\nJohn F. Kennedy and Henry Cabot Lodge exchange greetings during the 1952 U.S. Senate campaign. (Kennedy Library)\n\nThat future began arriving in 1952. Kennedy ran for the Senate seat held by Henry Cabot Lodge, Jr., and won.\n\nKennedy’s victory over Lodge was neither a sure thing nor an easy one. Lodge was first elected to the Senate in 1936 and took a leave of absence to serve in World War II. When, in 1944, the secretary of war barred members of Congress from active duty, Lodge resigned his Senate seat to serve.\n\nLodge, too, was a war hero, just as Kennedy became when he rescued his crew after the Japanese destroyed his PT-109 in the Pacific. Fighting in Europe, Lodge single-handedly captured a four-man German patrol. Both men received high military honors.\n\nAfter the war, Lodge, a well-known moderate Republican, returned to Massachusetts and was reelected to the Senate in 1946. In 1952 Lodge spearheaded the effort to persuade Dwight D. Eisenhower to run for the presidency and, following a hard-fought convention battle against Taft, became Eisenhower’s campaign manager.\n\nNot surprisingly, Kennedy’s Senate campaign got off to a slow start. It was his first statewide election, and he was still a relative newcomer to politics. However, before long, the Kennedy campaign began to take advantage of those thousands of names and contacts Kennedy had collected in his four-year barnstorming of the state. The women in the Kennedy family, his sisters and cousins, hosted teas across the state. Shaw reports that “about 75,000 women” attended the Kennedy teas.\n\nThe Eisenhower campaign, however, may have been Lodge’s undoing. By the time he turned his attention to his own campaign, Kennedy had a substantial campaign machine in operation. Kennedy won the election with 51.5 percent of the vote.\n\n(Elections with a Kennedy facing a Lodge have not been unusual in Massachusetts. In 1916, Lodge Sr. defeated Kennedy’s grandfather for the same Senate seat, and in 1962 Edward Kennedy defeated Lodge’s son George for the seat’s unexpired term vacated when John Kennedy was elected President.)\n\nKennedy in the Senate: Now a National Figure\n\nPolitically, the 1950s are defined by the Eisenhower/Nixon administration. Kennedy’s defeat of Lodge came in the midst of a Republican landslide. In 1952, Eisenhower captured 55 percent of the popular vote and 81 percent of the Electoral College. The Republicans took control of the House with a 42-seat swing. The Senate was more closely divided with 48 Republicans, 47 Democrats, and 1 Independent; however, nine deaths and one resignation during the 1953–1954 Congress resulted in control of the Senate shifting from Republican to Democrat to Republican again.\n\nThe 1950s are often characterized as an idyllic time. Television shows like Leave it to Beaver and Father Knows Best showed family harmony and a time of little stress. Eisenhower governed as a modern Republican in contrast to the frenzied pace of Roosevelt’s New Deal.\n\nIn fact, the 1950s was a period of rapid social change.\n\nThe baby boom encompassed the entire decade, and rapid population growth spurred economic demand. Housing adopted the automobile’s mass production techniques, which made homes affordable and made the suburbs possible. Families were more mobile, thanks to the automobile, the interstate highway system, the rise of fast food restaurants, and motel chains to serve those exploring America by car.\n\nThis rapid transformation of the social background was accompanied by an equally rapid transformation in Kennedy. He had progressed quickly during his six years in the House. He developed a potent campaign machine and defeated a popular incumbent. Now in the Senate, he set his sights on expanding his political skills and his attention to foreign affairs.\n\nKennedy’s first committee assignments in the Senate were the Labor and Public Welfare Committee and the Government Operations Committee. His office was on the third floor of the Russell Senate Office Building, at the time the only Senate office building. Across the hall was the office of the President of the Senate, Vice President Richard Nixon.\n\nBreaking with New Englanders Over St. Lawrence Seaway\n\nIn late spring 1953, Kennedy gave three speeches on the Senate floor outlining his New England economic plan—a plan he argued was good for both New England and the nation. Kennedy argued for a diversified economic base for New England with job training and technical assistance for the workers and relief from harmful tax provisions for the firms. He called for increasing the minimum wage and stronger enforcement of the child labor laws.\n\nKennedy argued that his economic plan would also strengthen the country’s fight against communism. Federal and state programs that supported workers both on the job and when unemployed would challenge some of the allure of the communist program pitched to the unemployed and the poorly paid workers.\n\nFellow senators from New England and beyond, the press, and even the White House praised the young senator for addressing real problems and offering concrete solutions.\n\nKennedy distinguished himself again as a national figure in the debate and vote on building the St. Lawrence Seaway. Congress had discussed the seaway for more than 30 years without action, but in the 1953–1954 Congress it appeared that would change. In the first term, the Senate Foreign Relations Committee approved a bill authorizing American participation in the construction of the seaway. The House Public Works Committee held hearings on the seaway but did not report a bill.\n\nAs a member of the House, Kennedy, like all members of the New England delegation, opposed the seaway. Conventional wisdom was that the seaway would harm both the Port of Boston and the entire New England economy. Now in the Senate, he took a broader perspective.\n\nAt the beginning of the second session of the 1953–1954 Congress, Kennedy announced his support for the seaway. It will be built, he argued, and thus the only question is whether it was better for the United States to participate in the construction and administration of the seaway. Both national security and the national economy would benefit from U.S. participation. The seaway was authorized later that year with Kennedy voting in support of the bill. No Massachusetts senator or representative had ever supported the seaway project.\n\nKennedy’s vote was criticized in the New England press, but he was praised nationally for his willingness to put the interests of the country above parochial concerns. Kennedy positioned himself as a national statesman.\n\nCampaign paths crossed for Adlai Stevenson (left) and Estes Kefauver in Tampa, Florida. (National Archives, 306-PS-56-7877)\n\nA Chance to Burnish A Scholarly Reputation\n\nKennedy was also making his mark as the scholar senator. Kennedy’s Harvard senior thesis had been published in 1940 as Why England Slept and quickly became a bestseller. In 1956, he published Profiles in Courage, which spent months on the New York Times bestseller list and won a Pulitzer Prize in 1957. His reputation as a scholar led Vice President Nixon to appoint Kennedy chair of a committee to select the five most outstanding senators to appear in a Senate Hall of Fame. The chairmanship was destined to produce considerable publicity, and his name also appeared each week on the bestseller list.\n\nNow Kennedy’s name began to appear on lists of potential running mates for Adlai Stevenson to challenge the Eisenhower/Nixon ticket in the 1956 election.\n\nKennedy was a star at the August 1956 Democratic convention. He narrated the introductory film about the Democratic Party, The Pursuit of Happiness. Stevenson asked Kennedy to place his name in nomination. Kennedy responded with a glowing defense of Stevenson and the party and a tough critique of the Eisenhower/Nixon record.\n\nTurning Point in 1956: A Loss Becomes a Win\n\nSenator Estes Kefauver of Tennessee was the favorite for the vice-presidential nomination, which Stevenson threw open to the convention. Kefauver had led a special committee investigation into organized crime that was one of the first televised Senate hearings, and the publicity made him a well-known name. Despite Kefauver’s advantage, Kennedy made a strong showing at the convention. No candidate was selected on the first ballot, and Kennedy had the lead on the second ballot, but not enough votes to secure the nomination. When Kefauver ultimately won the nomination, Kennedy called on the convention to make the nomination unanimous. Even in defeat, his star rose.\n\nKennedy campaigned relentlessly for the Stevenson/Kefauver ticket. According to John T. Shaw in JFK in the Senate: Pathway to the Presidency, Kennedy traveled more than 30,000 miles, gave more than 150 speeches, and covered 24 states in the weeks leading up to the election. Stevenson and Kefauver lost the election, and by Thanksgiving, Kennedy had decided to run for President.\n\nKennedy negotiated the Senate Hall of Fame committee with political skill. What could have been a minefield with everyone pushing their own agenda turned into unanimous support for the committee’s selections. Kennedy established rigorous evaluation criteria, consulted with noted historians, and recognized both the context of the Senate and the times in which the senators served. The five senators honored were Henry Clay of Kentucky (Whig 1831–1842, 1849–1852), Daniel Webster of Massachusetts (Whig, 1827–1841, 1845–1850), John C. Calhoun of South Carolina (Democrat, 1832–1843, 1845–1850), Robert M. LaFollette, Sr., of Wisconsin (Republican, 1906–1925), and Robert Taft of Ohio (Republican, 1939–1953).\n\nWhile planning a run for the presidency, Kennedy made good use of his time in the Senate.\n\nHe used his position on the Senate Labor Committee to push for an increase in the minimum wage and to protect union rights in an environment where Congress was trying to strip unions of any power to bargain effectively.\n\nKennedy joined the Foreign Relations Committee in 1957. There he supported Algerian independence from France and sponsored an amendment that would provide aid to Russian satellite nations. Kennedy also introduced an amendment to the National Defense Education Act to eliminate the requirement that aid recipients sign a loyalty oath and provide supporting affidavits. Service on the Foreign Relations committee strengthened candidate Kennedy’s international credentials.\n\nThe McClellan Committee Gets a National TV Audience\n\nRobert and John Kennedy confer during a session of the Senate Select Committee on Improper Activities in Labor and Management. (Kennedy Library)\n\nKennedy’s role on the McClellan Committee, chaired by Arkansas Democrat John McClellan, also bolstered his credentials as a candidate. The McClellan Committee was established in 1957 to investigate labor management relations in the postwar environment of organized labor. When the time came to write legislation, the committee turned to Kennedy, who drafted and managed the labor bill through the Senate and managed the conference committee with the House.\n\nThe formal title of the committee was the Select Committee on Improper Activities in Labor and Management. McClellan had been investigating organized labor through his subcommittee in the Government Operations Committee. The unions objected, arguing that the appropriate place for such investigations was in the Senate Labor Committee, where Kennedy chaired the Labor Subcommittee. McClellan resisted transferring jurisdiction because he feared Kennedy was too pro-union. To resolve this jurisdictional conflict, the Senate created the Select Committee; Robert Kennedy, the senator’s brother, was selected as chief counsel.\n\nThe growth of television in the 1950s changed the political landscape in Congress. The broadcast of the McClellan Committee hearings provided an opportunity for senators to be seen by voters across the country. Kennedy took full advantage of the hearings to be seen as a fair and intelligent senator. Earlier in the decade, gavel-to-gavel telecasts of the Army-McCarthy hearings were a significant factor in the decline of Senator Joseph McCarthy, the Wisconsin Republican who had been riding an anticommunist wave since the beginning of the decade.\n\nCorruption in the Teamsters Union was a continuing focus of the select committee. After repeatedly invoking the Fifth Amendment before the committee, Dave Beck was forced out as president of the union. That led to repeated clashes between Kennedy and James Hoffa, who succeeded Beck. While the committee repeatedly uncovered evidence of corruption in the Teamsters Union, it was unsuccessful in removing Hoffa. However, Hoffa’s reputation was tarnished enough that the Teamsters were expelled from the AFL-CIO.\n\nWhen it came time to draft legislation based on the findings of the McClellan Committee investigation, the committee turned to Kennedy. He consulted widely with political and legal experts, held 15 hearings, and worked with his Republican counterpart, Senator Irving Ives of New York, to craft the bill. The Kennedy-Ives bill contained a number of provisions to constrain both management and union activity. The bill passed the Senate 88 to 1; however, the House refused to act on it before Congress adjourned. Early in his career, Kennedy had gone to the House floor to scold his colleagues for failing to act on economic reform. He took to the Senate floor to do the same when the House failed to act on the Kennedy-Ives bill.\n\nIves retired at the end of the 1957–1958 Congress, and Kennedy, reelected easily in 1958, turned to fellow Democrat Sam Ervin from North Carolina for support. The Kennedy-Ervin bill passed the Senate early in the 1959–1960 Congress with added provisions to garner stronger support from labor. The House responded by passing a strong anti-labor bill, and Kennedy presided over the House-Senate conference to resolve the differences.\n\nKennedy saw the compromise bill as deeply flawed because it contained too many of the anti-union provisions from the House; however, it was the only bill possible. Despite the disappointing content of the bill, Kennedy won high praise from several of his Senate colleagues for his command of the subject matter and his political skills in managing the bill to conclusion.\n\nOn January 2, 1960, Kennedy announced his candidacy for President of the United States. From that point forward, he was no longer Senator Kennedy but Candidate Kennedy, and he rarely attended committee hearings or Senate votes.\n\nHe put together a careful plan for winning the nomination and in the process defeated more experienced politicians like Hubert Humphrey, Stuart Symington, and Lyndon Johnson. He then built a skillful general election campaign for the presidency, defeating his freshman colleague, Richard Nixon.\n\nNote on Sources\n\nFor information about John F. Kennedy during his years in the Senate, one of the best sources is John T. Shaw’s book JFK in the Senate: Pathway to the Presidency, published by St Martin’s Press in 2013.\n\nIn addition, the John F. Kennedy Library has a detailed report of Kennedy’s voting record in the House and Senate at www.jfklibrary.org/Research/Research-Aids/Ready-Reference/JFK-Fast-Facts/Voting-Record-and-Stands-on-Issues.aspx.\n\nA more general look at the social and political climate during this period is available in David Halberstam’s book The Fifties, published in 1993 by Villard Books.\n\nA detailed study of the presidential campaign in 1959 and 1960 is available in Theodore White’s book The Making of the President, 1960 (Cambridge, MA: Atheneum Publishers, 1961).\n\nArticles published in Prologue do not necessarily represent the views of NARA or of any other agency of the United States Government.\n\nPurchase This Issue"}, {"url": "https://www.latimes.com/politics/story/2020-09-01/a-kennedy-loses-in-massachusetts-and-a-storied-dynasty-fades", "page_content": "The 2020 political season has delivered a lot of curveballs, and here’s another: For the first time in U.S. history, a Kennedy has lost an election in Massachusetts.\n\nSen. Edward J. Markey’s ability to beat back a challenge from Rep. Joseph P. Kennedy III in the state’s Democratic primary Tuesday was a tribute to the incumbent’s skill at organizing progressive activists behind him against a scion of a storied political family.\n\nIt was also a tribute to a broader political dynamic that reaches beyond Massachusetts and the Democratic Party: The loosening grip of family dynasties in American politics.\n\nAdvertisement\n\nIn both parties, the Old Guard has been challenged by the rise of populist movements: the white nationalism that brought Trump to power in the GOP, and the multiracial progressivism that nearly gave Vermont Sen. Bernie Sanders the Democratic presidential nomination.\n\nWith the rise of those anti-establishment forces, some of the most famous names in politics have been thrown to the sidelines in the last five years: Clinton. Bush. Romney.\n\nBeing a Kennedy in Massachusetts gave the 39-year-old the momentum, money and political connections to have a good shot at unseating Markey, a 74-year-old who has served more than four decades in Congress.\n\nBut it was not enough to get Kennedy over the finish line. Three hours after polls closed Tuesday, the Associated Press declared Markey the winner in one of the nation’s most hotly contested primaries.\n\n“The Kennedy name has lost some of its magic in the Bay State,” said Jim Manley, a longtime advisor to the late Sen. Edward M. Kennedy (D-Mass.), who was Joseph Kennedy’s great-uncle. “Things are changing and a political dynasty doesn’t mean what it used to.”\n\nMarkey is all but guaranteed to win reelection this fall in the heavily Democratic state. Kennedy loses his House seat, which will leave Congress without any members of the Kennedy clan for only the second time in 73 years. (There were no Kennedys seated there in 2011-12.)\n\nPolitical dynasties are fading at the presidential level as well. In each of the last eight presidential contests, the lineup of major candidates has included at least one member of the Bush, Clinton or Romney families.\n\nMany had expected the 2016 race to be a clash of dynasties, when former First Lady and Secretary of State Hillary Clinton seemed likely to face off against Jeb Bush, a brother and son of presidents. But Donald Trump, a businessman outsider with no political pedigree, beat them both.\n\nThe previous GOP presidential nominee, Mitt Romney — son of the Michigan governor who ran unsuccessfully for the Republican nomination in 1968 — has been sidelined by his own party because of his outspoken criticism of Trump.\n\nPlenty of legacy politicians remain on the scene, but their pathways are not unobstructed.\n\nDonald J. Trump Jr. may try to succeed his father in 2024, but many ambitious Republicans have the same idea.\n\nLiz Cheney, daughter of former vice president Dick Cheney, is in the House GOP leadership and has designs on moving up — although she faces resistance from Trump loyalists over her occasional criticism of the president.\n\nNew York Gov. Andrew Cuomo — son of the late Gov. Mario Cuomo — is seen as a possible presidential contender, but his centrist pragmatism puts him at odds with progressives, and he chose not to run in 2020.\n\nNo family has a legacy as broad and deep as the Kennedy clan, which has produced one president, two senators, and three House members. Most came from Massachusetts. None of them ever lost a race there. Until Tuesday.\n\nEver since Kennedy — a fourth-term House member who is the son of former Rep. Joseph P. Kennedy II and grandson of Robert F. Kennedy — announced his challenge to Markey, it was seen as more of a generational clash than an ideological one because the two differ little on issues.\n\nKennedy was almost immediately seen as a front-runner, enjoying double-digit leads in some polls. Markey — first elected to Congress in 1976, before Kennedy was born — has been a low-profile senator with a relatively thin record of legislative accomplishment.\n\nSome Kennedy boosters assumed Markey would retire rather than face a bitter fight. The 2020 campaign season had been littered with insurgent candidates beating longtime incumbents in New York, Illinois and Missouri.\n\nPolitics Massachusetts Rep. Joe Kennedy to challenge Sen. Markey in Democratic primary Massachusetts Rep. Joseph P. Kennedy III, a scion of one of America’s most storied political families, is set to announce he will challenge U.S. Sen. Edward Markey in the state’s Democratic primary in 2020.\n\nThat did not happen. Markey fought back aggressively and flipped the script that had bedeviled other embattled incumbents: He presented himself in ads and campaign messaging as the insurgent fighter from a blue-collar town — “Markey from Malden” — against a privileged member of the political elite.\n\nHe traded on his decades of work on climate change, a top priority among young Democratic voters. In a game-changing endorsement, he won the backing of Rep. Alexandria Ocasio-Cortez of New York, the rising progressive star with whom he’d cosponsored the Green New Deal. She immunized him against the rap that he was too old and irrelevant.\n\n“When it comes to progressive leadership it’s not your age that counts. It’s the age of your ideas,” she said in an ad.\n\nKennedy initially tried to downplay his family ties — until Markey went after them and ended one ad with a tagline resonant of President Kennedy’s inaugural address.\n\n“We asked what we could do for our country. We went out, we did it,” Markey said. “With all due respect, it’s time to start asking what your country can do for you.”\n\nKennedy defended his family, accusing Markey of “questioning their integrity, weaponizing their history, appropriating their words.”\n\n“If he wants to talk about the Kennedys, then I will talk about the Kennedys,” he said.\n\nThe increasingly personal campaign vaporized Kennedy’s polling lead, suggesting that the Kennedy name was not the political talisman it once was. It had, after all, been 14 years since a Kennedy was on the statewide ballot.\n\n“Since then, a lot of Democrats in Massachusetts have come into the process because of Barack Obama in 2008,” said Mary Anne Walsh, a Democratic consultant in Boston. “It’s a different kind of politics, a different kind of activism.”\n\nMarkey made an implausible connection with young insurgents through Ocasio-Cortez, as well as endorsements from Sen. Elizabeth Warren and some of the progressive congressional candidates like Missouri’s Cori Bush who had ousted incumbents elsewhere.\n\nThe Kennedy name may have been a liability as well as an asset if he was trying to make the case for generational change.\n\n“Kennedy got the benefit of being a Kennedy, but he also got the problem that it’s hard to look like the challenging underdog,” said former Rep. Barney Frank (D-Mass.), who retired in 2012 from the House seat that Kennedy won with only token opposition. “The advantage that led him to clear the field in the first place took away from him the mantle of the daring young outsider on the flying trapeze.”"}, {"url": "https://www.whitehouse.gov/about-the-white-house/presidents/john-f-kennedy/", "page_content": "The biography for President Kennedy and past presidents is courtesy of the White House Historical Association.\n\nJohn F. Kennedy was the 35th President of the United States (1961-1963), the youngest man elected to the office. On November 22, 1963, when he was hardly past his first thousand days in office, JFK was assassinated in Dallas, Texas, becoming also the youngest President to die.\n\nOn November 22, 1963, when he was hardly past his first thousand days in office, John Fitzgerald Kennedy was killed by an assassin’s bullets as his motorcade wound through Dallas, Texas. Kennedy was the youngest man elected President; he was the youngest to die.\n\nOf Irish descent, he was born in Brookline, Massachusetts, on May 29, 1917. Graduating from Harvard in 1940, he entered the Navy. In 1943, when his PT boat was rammed and sunk by a Japanese destroyer, Kennedy, despite grave injuries, led the survivors through perilous waters to safety.\n\nBack from the war, he became a Democratic Congressman from the Boston area, advancing in 1953 to the Senate. He married Jacqueline Bouvier on September 12, 1953. In 1955, while recuperating from a back operation, he wrote Profiles in Courage, which won the Pulitzer Prize in history.\n\nIn 1956 Kennedy almost gained the Democratic nomination for Vice President, and four years later was a first-ballot nominee for President. Millions watched his television debates with the Republican candidate, Richard M. Nixon. Winning by a narrow margin in the popular vote, Kennedy became the first Roman Catholic President.\n\nHis Inaugural Address offered the memorable injunction: “Ask not what your country can do for you–ask what you can do for your country.” As President, he set out to redeem his campaign pledge to get America moving again. His economic programs launched the country on its longest sustained expansion since World War II; before his death, he laid plans for a massive assault on persisting pockets of privation and poverty.\n\nResponding to ever more urgent demands, he took vigorous action in the cause of equal rights, calling for new civil rights legislation. His vision of America extended to the quality of the national culture and the central role of the arts in a vital society.\n\nHe wished America to resume its old mission as the first nation dedicated to the revolution of human rights. With the Alliance for Progress and the Peace Corps, he brought American idealism to the aid of developing nations. But the hard reality of the Communist challenge remained.\n\nShortly after his inauguration, Kennedy permitted a band of Cuban exiles, already armed and trained, to invade their homeland. The attempt to overthrow the regime of Fidel Castro was a failure. Soon thereafter, the Soviet Union renewed its campaign against West Berlin. Kennedy replied by reinforcing the Berlin garrison and increasing the Nation’s military strength, including new efforts in outer space. Confronted by this reaction, Moscow, after the erection of the Berlin Wall, relaxed its pressure in central Europe.\n\nInstead, the Russians now sought to install nuclear missiles in Cuba. When this was discovered by air reconnaissance in October 1962, Kennedy imposed a quarantine on all offensive weapons bound for Cuba. While the world trembled on the brink of nuclear war, the Russians backed down and agreed to take the missiles away. The American response to the Cuban crisis evidently persuaded Moscow of the futility of nuclear blackmail.\n\nKennedy now contended that both sides had a vital interest in stopping the spread of nuclear weapons and slowing the arms race–a contention which led to the test ban treaty of 1963. The months after the Cuban crisis showed significant progress toward his goal of “a world of law and free choice, banishing the world of war and coercion.” His administration thus saw the beginning of new hope for both the equal rights of Americans and the peace of the world.\n\nFor more information about President Kennedy, please visit the John F. Kennedy Library and Museum.\n\nLearn more about John F. Kennedy’s spouse, Jacqueline Lee Bouvier Kennedy."}], "Harry S. Kennedy served in the Senate for almost 47 years.": [{"url": "https://www.newworldencyclopedia.org/entry/Ted_Kennedy", "page_content": "Ted Kennedy\n\nUnited States Senator In office\n\nNovember 7, 1962 – August 25, 2009 Preceded by Benjamin A. Smith II Succeeded by Paul G. Kirk Chair of the Senate Health Committee In office\n\nJanuary 3, 2007 – August 25, 2009\n\nOn leave: June 9 – August 25, 2009* Preceded by Mike Enzi Succeeded by Chris Dodd (acting) In office\n\nJune 6, 2001 – January 3, 2003 Preceded by Jim Jeffords Succeeded by Judd Gregg In office\n\nJanuary 3, 2001 – January 20, 2001 Preceded by Jim Jeffords Succeeded by Jim Jeffords In office\n\nJanuary 3, 1987 – January 3, 1995 Preceded by Orrin Hatch Succeeded by Nancy Kassebaum Chair of the Senate Judiciary Committee In office\n\nJanuary 3, 1979 – January 3, 1981 Preceded by James Eastland Succeeded by Strom Thurmond Senate Majority Whip In office\n\nJanuary 3, 1969 – January 3, 1971 Preceded by Russell B. Long Succeeded by Robert Byrd Born February 22 1932 ( 1932-02-22 )\n\nBoston, Massachusetts, U.S. Died August 25 2009 (aged 77)\n\nHyannis Port, Massachusetts, U.S. Political party Democratic Spouse Joan Bennett\n\n(m. 1958; div. 1983)\n\nVicki Reggie (m. 1992) Relations Kennedy family Children Kara · Edward Jr. · Patrick Signature Website Official website\n\nEdward Moore Kennedy (February 22, 1932 – August 25, 2009) was an American politician who served as a U.S. Senator from Massachusetts for almost 47 years, from 1962 until his death in 2009. A member of the Democratic Party and the Kennedy political family, he was the second most senior member of the Senate when he died and the third-longest-continuously-serving senator in United States history. Kennedy was a brother of President John F. Kennedy and U.S. Attorney General and U.S. Senator Robert F. Kennedy—both victims of assassination—and was the father of Congressman Patrick J. Kennedy.\n\nKennedy was 30 years old when he first entered the Senate following a November 1962 special election in Massachusetts to fill the vacant seat previously held by his brother John, who had taken office as the president. He was elected to a full six-year term in 1964 and was later re-elected seven more times. The Chappaquiddick incident in 1969 resulted in the death of his automobile passenger, Mary Jo Kopechne, a former campaign worker for his brother Robert's Presidential campaign. He pleaded guilty to a charge of leaving the scene of an accident and later received a two-month suspended sentence. The incident and its aftermath hindered his chances of ever becoming president. His only attempt, in the 1980 election, resulted in a Democratic primary campaign loss to the incumbent president, Jimmy Carter.\n\nKennedy was known for his oratorical skills. His 1968 eulogy for his brother Robert and his 1980 rallying cry for modern American liberalism were among his best-known speeches. He became recognized as \"The Lion of the Senate\" through his long tenure and influence. Kennedy and his staff wrote more than 300 bills that were enacted into law. Unabashedly liberal, Kennedy championed an interventionist government that emphasized economic and social justice, but he was also known for working with Republicans to find compromises. Kennedy played a major role in passing many laws, including the Immigration and Nationality Act of 1965, the National Cancer Act of 1971, the COBRA health insurance provision, the Comprehensive Anti-Apartheid Act of 1986, the Americans with Disabilities Act of 1990, the Ryan White AIDS Care Act, the Civil Rights Act of 1991, the Mental Health Parity Act, the S-CHIP children's health program, the No Child Left Behind Act, and the Edward M. Kennedy Serve America Act. During the 2000s, he led several unsuccessful immigration reform efforts. Over the course of his Senate career, Kennedy made efforts to enact universal health care, which he called the \"cause of my life.\" Despite his role as a major figure and spokesman for American progressivism, Kennedy was a champion of the Senate and Senate collegiality who worked across the aisle with conservative Senators like Orrin Hatch on issues of mutual interest.\n\nKennedy died on August 25, 2009 of a malignant brain tumor at his home in Hyannis Port, Massachusetts, and was buried near his brothers John and Robert at Arlington National Cemetery.\n\nEarly life\n\nEdward Moore Kennedy was born on February 22, 1932, at St. Margaret's Hospital in the Dorchester section of Boston, Massachusetts. He was the last of the nine children of Joseph Patrick Kennedy and Rose Fitzgerald, members of prominent Irish American families in Boston,[1] who constituted one of the wealthiest families in the nation once they were joined.[2] His eight siblings were Joseph Jr., John, Rosemary, Kathleen, Eunice, Patricia, Robert, and Jean. John asked to be the newborn's godfather, a request his parents honored, though they did not agree to his request to name the baby George Washington Kennedy (Ted was born on President George Washington's 200th birthday) and instead named him after their father's assistant.[3]\n\nAs a child, Ted was frequently uprooted by his family's moves among Bronxville, New York; Hyannis Port, Massachusetts; Palm Beach, Florida; and the Court of St. James's, in London, England.[4] His formal education started at Gibbs School in Kensington, London.[5] He had attended ten schools by the age of eleven; this was a series of disruptions that interfered with his academic success.[6] He was an altar boy at the St. Joseph's Church and was seven when he received his First Communion from Pope Pius XII in the Vatican.[7] He spent sixth and seventh grades at the Fessenden School, where he was a mediocre student, and eighth grade at Cranwell Preparatory School; both schools located in Massachusetts.[4] He was the youngest child and his parents were affectionate towards him, but they also compared him unfavorably with his older brothers. Ted's affable maternal grandfather, John F. Fitzgerald, was the Mayor of Boston, a U.S. Congressman, and an early political and personal influence.[1]\n\nBetween the ages of eight and sixteen, Ted suffered the traumas of Rosemary's failed lobotomy and the deaths of Joseph Jr. in World War II and Kathleen in an airplane crash.[1] He spent his four high-school years at Milton Academy, a preparatory school in Milton, Massachusetts, where he received B and C grades and, in 1950, finished 36th in a graduating class of 56. He did well at football there, playing on the varsity in his last two years; the school's headmaster later described his play as \"absolutely fearless ... he would have tackled an express train to New York if you asked ... he loved contact sports.\"[8] Kennedy also played on the tennis team and was in the drama, debate, and glee clubs.\n\nCollege, military service, and law school\n\nLike his father and brothers before him, Ted graduated from Harvard College. An offense and defensive end on the football team, Kennedy was anxious about maintaining his eligibility for athletics for the next year,[1] so at the end of his second semester in May 1951 he had a classmate take his place at a Spanish exam. The deception was immediately discovered and both students were expelled for cheating. In a standard Harvard treatment for serious disciplinary cases, they were told they could apply for readmission within a year or two if they demonstrated good behavior during that time.[9][10]\n\nIn June 1951, Kennedy enlisted in the United States Army and signed up for an optional four-year term that was shortened to the minimum of two years after his father intervened. Following basic training at Fort Dix in New Jersey, he requested assignment to Fort Holabird in Maryland for Army Intelligence training, but was dropped without explanation after a few weeks. He went to Camp Gordon in Georgia for training in the Military Police Corps. In June 1952, Kennedy was assigned to the honor guard at SHAPE headquarters in Paris, France.[9] His father's political connections ensured that he was not deployed to the ongoing Korean War.[11] After 21 months, he was discharged in March 1953 as a private first class.[9]\n\nKennedy re-entered Harvard in the summer of 1953 and improved his study habits.[1] His brother John was a U.S. Senator and the family was attracting more public attention.[12] Academically, Kennedy received mediocre grades for his first three years, improved to a B average for his senior year, and finished barely in the top half of his class. Kennedy graduated from Harvard at age 24 in 1956 with an AB in history and government.[13]\n\nDue to his low grades, Kennedy was not accepted by Harvard Law School.[10] He instead followed his brother Bobby and enrolled in the University of Virginia School of Law in 1956.[1] That acceptance was controversial among faculty and alumni, who judged Kennedy's past cheating episodes at Harvard to be incompatible with the University of Virginia's honor code; it took a full faculty vote to admit him.[14] Kennedy also attended the Hague Academy of International Law during one summer.[15] At Virginia, Kennedy felt that he had to study \"four times as hard and four times as long\" as other students to keep up with them.[16] He received mostly C grades and was in the middle of the class ranking, but was the winner of the prestigious William Minor Lile Moot Court Competition.[1] He was elected head of the Student Legal Forum and brought many prominent speakers to the campus via his family connections.[17] While there, his careless driving caught up with him and he was charged with reckless driving and driving without a license.[1] While attending law school, he was officially named as manager of his brother John's 1958 Senate re-election campaign; Ted's ability to connect with ordinary voters on the street helped bring a record-setting victory margin that gave credibility to John's presidential aspirations.[18] Ted graduated from law school in 1959.[17]\n\nIn October 1957 (early in his second year of law school), Kennedy met Joan Bennett at Manhattanville College; they were introduced after a dedication speech for a gymnasium that his family had donated at the campus. Bennett was a senior at Manhattanville and had worked as a model and won beauty contests, but she was unfamiliar with the world of politics. After the couple became engaged, she grew nervous about marrying someone she did not know that well, but Joe Kennedy insisted that the wedding should proceed.[19] The couple was married by Cardinal Francis Spellman on November 29, 1958, at St. Joseph's Church in Bronxville, New York,[1] with a reception at nearby Siwanoy Country Club.[20] Ted and Joan had three children: Kara (1960–2011), Ted Jr. (b. 1961) and Patrick (b. 1967). By the 1970s, the marriage became troubled due to Ted's infidelity and Joan's growing alcoholism. They would separate in 1977 and eventually divorce in 1983.\n\nEarly career\n\nJohn, Bobby , and Ted Kennedy during John's presidential campaign, July 1960\n\nKennedy was admitted to the Massachusetts Bar in 1959. In 1960, his brother John announced his candidacy for President of the United States and Ted managed his campaign in the Western states.[1] The seven weeks he spent in Wisconsin helped his brother win the first contested primary of the season there and a similar time spent in Wyoming was rewarded when a unanimous vote from that state's delegates put his brother over the top at the 1960 Democratic National Convention.[21]\n\nFollowing his victory in the presidential election, John resigned from his seat as U.S. Senator from Massachusetts, but Ted was not eligible to fill the vacancy until his thirtieth birthday on February 22, 1962.[22] Ted's brothers were not in favor of his running immediately, but Ted ultimately coveted the Senate seat as an accomplishment to match his brothers, and their father overruled them. John asked Massachusetts Governor Foster Furcolo to name Kennedy family friend Ben Smith as interim senator for John's unexpired term, which he did in December 1960.[23] This kept the seat available for Ted.\n\nFirst Senate campaign, 1962\n\nIn the November special election, Kennedy defeated Republican George Cabot Lodge II, product of another noted Massachusetts political family, gaining 55 percent of the vote.\n\nBrothers' assassinations\n\nKennedy was sworn into the Senate on November 7, 1962. He maintained a deferential attitude towards the older Southern members when he first entered the Senate. He recognized the seniority system in the Senate, avoiding publicity and focusing on committee work and local issues.[24] Compared to his brothers in office, he lacked John's sophistication and Robert's intense, sometimes grating drive, but was more affable than either of them.\n\nOn November 22, 1963, Kennedy was presiding over the Senate—a task given to junior members—when an aide rushed in to tell him that his brother, President John F. Kennedy, had been shot. His brother Robert soon told him that the President was dead. Ted and his sister Eunice Kennedy Shriver immediately flew to the family home in Hyannis Port, Massachusetts, to give the news to their invalid father, who had been afflicted by a stroke suffered two years earlier.\n\nTed Kennedy, accompanied by his brother Robert and sister-in-law Jacqueline , walks from the White House for the funeral procession accompanying President Kennedy's casket to Cathedral of St. Matthew the Apostle.\n\nKennedy in 1967\n\nKennedy initially said he had \"no reservations\" about the expanding U.S. role in the Vietnam War and acknowledged that it would be a \"long and enduring struggle.\" He held hearings on the plight of refugees in the conflict, which revealed that the U.S. government had no coherent policy for refugees.[25] Kennedy also tried to reform \"unfair\" and \"inequitable\" aspects of the draft. By the time of a January 1968 trip to Vietnam, Kennedy was disillusioned by the lack of U.S. progress, and suggested publicly that the U.S. should tell South Vietnam, \"Shape up or we're going to ship out.\"[26] On March 31, 1968 President Lyndon Johnson made a surprise announcement that he would not seek the Presidency again in the 1968 election.\n\nTed initially advised his brother Robert against challenging for the Democratic nomination in the 1968 presidential election. Once Eugene McCarthy's strong showing in the New Hampshire primary led to Robert's presidential campaign starting in March 1968, Ted recruited political leaders for endorsements to his brother in the western states.[27] Ted was in San Francisco when his brother Robert won the crucial California primary on June 4, 1968, and then after midnight, Robert was shot in Los Angeles and died a day later. Ted Kennedy was devastated by his brother's death, as he was closest to Robert among those in the Kennedy family. Kennedy aide Frank Mankiewicz said of seeing Ted at the hospital where Robert lay mortally wounded: \"I have never, ever, nor do I expect ever, to see a face more in grief.\" At Robert's funeral, Kennedy eulogized his older brother:\n\nMy brother need not be idealized, or enlarged in death beyond what he was in life; to be remembered simply as a good and decent man, who saw wrong and tried to right it, saw suffering and tried to heal it, saw war and tried to stop it. Those of us who loved him and who take him to his rest today, pray that what he was to us and what he wished for others will some day come to pass for all the world. As he said many times, in many parts of this nation, to those he touched and who sought to touch him: \"Some men see things as they are and say why. I dream things that never were and say why not.\"[28]\n\nAfter the deaths of his brothers, Kennedy took on the role of a surrogate father for his 13 nephews and nieces.[29] By some reports, he also negotiated the October 1968 marital contract between Jacqueline Kennedy and Aristotle Onassis.[30]\n\nChappaquiddick incident\n\nFollowing Republican Richard Nixon's victory in November, Kennedy was widely assumed to be the front-runner for the 1972 Democratic nomination.[31] In January 1969, Kennedy defeated Louisiana Senator Russell B. Long by a 31–26 margin to become Senate Majority Whip, the youngest person to attain that position.[32] While this further boosted his presidential image, he also appeared conflicted by the inevitability of having to run for the position;[29] \"Few who knew him doubted that in one sense he very much wanted to take that path\", Time magazine reported, but \"he had a fatalistic, almost doomed feeling about the prospect\".\n\nOn the night of July 18, 1969, Kennedy was at Chappaquiddick Island on the eastern end of Martha's Vineyard. He was hosting a party for the Boiler Room Girls, a group of young women who had worked on his brother Robert's ill-fated 1968 presidential campaign.[31] Kennedy left the party with one of the women, 28-year-old Mary Jo Kopechne.\n\nDriving a 1967 Oldsmobile Delmont 88, he attempted to cross the Dike Bridge, which did not have a guardrail at that time. Kennedy later denied that he was drunk but he lost control of his vehicle and crashed in the Poucha Pond inlet, which was a tidal channel on Chappaquiddick Island. Kennedy escaped from the overturned vehicle, and, by his description, dove below the surface seven or eight times, vainly attempting to reach and rescue Kopechne. Ultimately, he swam to shore and left the scene, with Kopechne still trapped inside the vehicle. Kennedy did not report the accident to authorities until the next morning, by which time Kopechne's body had already been discovered.[31] Kennedy's cousin Joe Gargan later said that he and Kennedy's friend Paul Markham, both of whom were at the party and came to the scene, urged Kennedy to report it at the time.[33]\n\nA week after the incident, Kennedy pleaded guilty to leaving the scene of an accident and was given a suspended sentence of two months in jail. That night, he gave a national broadcast in which he said, \"I regard as indefensible the fact that I did not report the accident to the police immediately,\" but he denied driving under the influence of alcohol and also denied any immoral conduct between him and Kopechne.[31] Kennedy asked the Massachusetts electorate whether he should stay in office or resign; after getting a favorable response in messages sent to him, Kennedy announced on July 30 that he would remain in the Senate and run for re-election the next year.[34]\n\nIn January 1970, an inquest into Kopechne's death was held in Edgartown, Massachusetts. At the request of Kennedy's lawyers, the Massachusetts Supreme Judicial Court ordered the inquest to be conducted in secret.[35] The presiding judge, James A. Boyle, concluded that some aspects of Kennedy's story about that night were not true, and that negligent driving \"appears to have contributed\" to the death of Kopechne. A grand jury on Martha's Vineyard conducted a two-day investigation in April 1970 but issued no indictment, after which Boyle made his inquest report public. Kennedy deemed its conclusions \"not justified.\"[31] Questions about the Chappaquiddick incident generated a large number of articles and books during the following years.\n\n1980 presidential campaign\n\nThe Chappaquiddick incident impacted any Presidential aspirations Kennedy might have had in 1972 and 1976. In 1980, he would have to face an incumbent President from his own party. As the Democratic nominee, Jimmy Carter developed little relationship with Kennedy during his primary campaign, the convention, or the general election campaign.[36] This continued during the Carter administration, which were difficult year for Kennedy. He had been the most important Democrat in Washington ever since his brother Robert's death, but now Carter was, and Kennedy at first did not have a full committee chairmanship with which to wield influence.[37] Carter in turn sometimes resented Kennedy's status as a political celebrity.[3] Despite generally similar ideologies, their priorities were different. Kennedy expressed to reporters that he was content with his congressional role and viewed presidential ambitions as almost far-fetched, but Kennedy finally decided to seek the Democratic nomination in the 1980 presidential election by launching an unusual, insurgent campaign against the incumbent Carter.[38]\n\nA midsummer 1978 poll showed that Democrats preferred Kennedy over Carter by a 5-to-3 margin. Labor unions urged Kennedy to run, as did some Democratic party officials who feared that Carter's unpopularity could result in heavy losses in the 1980 congressional elections.[39] Kennedy decided to run in August 1979, when polls showed him with a 2-to-1 advantage over Carter;[40] Carter's approval rating slipped to 19 percent.[41] Kennedy formally announced his campaign on November 7, 1979, at Boston's Faneuil Hall.[42] The Iranian hostage crisis, which began on November 4, and the Soviet invasion of Afghanistan, which began on December 27, prompted the electorate to rally around the president and allowed Carter to pursue a Rose Garden strategy of staying at the White House, which kept Kennedy's campaign out of the headlines.[42]\n\nKennedy's campaign staff was disorganized and Kennedy was initially an ineffective campaigner.[43] The Chappaquiddick incident emerged as a more significant issue than the staff had expected, with several newspaper columnists and editorials criticizing Kennedy's answers on the matter.[44] In the January 1980 Iowa caucuses that initiated the primaries season, Carter demolished Kennedy by a 59–31 percent margin. Kennedy lost three New England contests.[42] Kennedy did form a more coherent message about why he was running, saying at Georgetown University: \"I believe we must not permit the dream of social progress to be shattered by those whose promises have failed.\"[45] However, concerns over Chappaquiddick and issues related to personal character prevented Kennedy from gaining the support of many people who were disillusioned with Carter.[46] During a St. Patrick's Day Parade in Chicago, Kennedy had to wear a bullet-proof vest due to assassination threats, and hecklers yelled \"Where's Mary Jo?\" at him.[47] In the key March 18 primary in Illinois, Kennedy failed to gain the support of Catholic voters, and Carter crushed him, winning 155 of 169 delegates.[48]\n\nWith little mathematical hope of winning the nomination and polls showing another likely defeat in the New York primary, Kennedy prepared to withdraw from the race. However, partially due to Jewish voter unhappiness with a U.S. vote at the United Nations against Israeli settlements in the West Bank, Kennedy staged an upset and won the March 25 vote by a 59–41 percent margin. Carter responded with an advertising campaign that attacked Kennedy's character in general without explicitly mentioning Chappaquiddick, but Kennedy still managed a narrow win in the April 22 Pennsylvania primary.[42] Carter won 11 of 12 primaries held in May, while on the June 3 Super Tuesday primaries, Kennedy won California, New Jersey, and three smaller states out of eight contests.[49] Overall, Kennedy had won 10 presidential primaries against Carter, who won 24.\n\nAlthough Carter now had enough delegates to clinch the nomination, Kennedy carried his campaign on to the 1980 Democratic National Convention in August in New York, hoping to pass a rule there that would free delegates from being bound by primary results and open the convention. This move failed on the first night of the convention, and Kennedy withdrew.[42] On the second night, August 12, Kennedy delivered the most famous speech of his career. Drawing on allusions to and quotes of Martin Luther King Jr., Franklin Delano Roosevelt, and Alfred Lord Tennyson to say that American liberalism was not passé,[50] he concluded with the words:\n\nFor me, a few hours ago, this campaign came to an end. For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives, and the dream shall never die.[51]\n\nThe Madison Square Garden audience reacted with wild applause and demonstrations for half an hour.[42] On the final night, Kennedy arrived late after Carter's acceptance speech and while he shook Carter's hand, he failed to raise Carter's arm in the traditional show of party unity.[48] Carter's difficulty in securing the assistance of Kennedy supporters during the election campaign has long been considered as a contributing factor to his November defeat by Ronald Reagan.\n\nSenate Career\n\nHealth Care\n\nKennedy giving a presentation on his healthcare proposal in June 1971\n\nAt the end of 1968, Kennedy had joined the new Committee for National Health Insurance at the invitation of its founder, United Auto Workers president Walter Reuther.[52] In May 1970, Reuther died and Senator Ralph Yarborough, chairman of the full Senate Labor and Public Welfare Committee and its Health subcommittee, lost his primary election, propelling Kennedy into a leadership role on the issue of national health insurance.[53] Kennedy introduced a bipartisan bill in August 1970 for single-payer universal national health insurance with no cost sharing, paid for by payroll taxes and general federal revenue. Health care would remain one of the issues that Kennedy would champion throughout his career.\n\nIn February 1971, President Nixon proposed health insurance reform—an employer mandate to offer private health insurance if employees volunteered to pay 25 percent of premiums, federalization of Medicaid for the poor with dependent minor children, and support for health maintenance organizations. Hearings on national health insurance were held in 1971, but no bill had the support of House Ways and Means and Senate Finance Committee chairmen Representative Wilbur Mills and Senator Russell Long.[54] Kennedy sponsored and helped pass the limited Health Maintenance Organization Act of 1973.[55]\n\nIn February 1974, President Nixon proposed more comprehensive health insurance reform—an employer mandate to offer private health insurance if employees volunteered to pay 25 percent of premiums, replacement of Medicaid by state-run health insurance plans available to all with income-based premiums and cost sharing, and replacement of Medicare with a new federal program that eliminated the limit on hospital days, added income-based out-of-pocket limits, and added outpatient prescription drug coverage.[56] In April 1974, Kennedy and Mills introduced a bill for near-universal national health insurance with benefits identical to the expanded Nixon plan, but with mandatory participation by employers and employees through payroll taxes. Both plans were criticized by labor, consumer, and senior citizen organizations because of their substantial cost sharing.[57] In August 1974, after Nixon's resignation and President Ford's call for health insurance reform, Mills tried to advance a compromise based on Nixon's plan but with mandatory participation by employers and employees through premiums to private health insurance companies. He gave up when he was unable to get more than a 13–12 majority of his committee to support his compromise plan.\n\nAfter the 1976 election of President Carter, Kennedy renewed his efforts. As a candidate, Carter had proposed health care reform that included key features of Kennedy's national health insurance bill, but in December 1977, President Carter told Kennedy his bill must be changed to preserve a large role for private insurance companies, minimize federal spending (precluding payroll tax financing), and be phased-in so as to not interfere with Carter's paramount domestic policy objective—balancing the federal budget.[58] Kennedy and labor compromised, making the requested changes, but broke with Carter in July 1978 when he would not commit to pursuing a single bill with a fixed schedule for phasing-in comprehensive coverage.[58] Frustrated by Carter's budgetary concerns and political caution,[2] Kennedy said in a December 1978 speech on national health insurance at the Democratic midterm convention that \"sometimes a party must sail against the wind\" and in particular should provide health care as \"a basic right for all, not just an expensive privilege for the few.\"[59]\n\nIn May 1979, Kennedy proposed a new bipartisan universal national health insurance bill. Provision included a choice of competing federally regulated private health insurance plans with no cost sharing-financed by income-based premiums via an employer mandate and individual mandate-replacement of Medicaid by government payment of premiums to private insurers, and enhancement of Medicare by adding prescription drug coverage and eliminating premiums and cost sharing.[60] In June 1979, Carter proposed more limited health insurance reform—an employer mandate to provide catastrophic private health insurance plus coverage without cost sharing for pregnant women and infants, federalization of Medicaid with extension to all of the very poor, plus enhancement of Medicare by adding catastrophic coverage. Neither plan gained any traction in Congress and the failure to come to agreement represented the final political breach between the two. Carter wrote in 1982 that Kennedy's disagreements with Carter's proposed approach \"ironically\" thwarted Carter's efforts to provide a comprehensive health-care system for the country.[61] In turn, Kennedy wrote in his memoir that his relationship with Carter was \"unhealthy\" and that \"Clearly President Carter was a difficult man to convince – of anything.\"[62]\n\nMuch later, following the failure of the Clinton health care plan, Kennedy went against his previous strategy and sought incremental measures instead.[63] Kennedy worked with Republican Senator Nancy Kassebaum to create and pass the Health Insurance Portability and Accountability Act in 1996, which set new marks for portability of insurance and confidentiality of records. The same year, Kennedy's Mental Health Parity Act forced insurance companies to treat mental health payments the same as others with respect to limits reached. In 1997, Kennedy was the prime mover behind the State Children's Health Insurance Program,[64] which used increased tobacco taxes to fund the largest expansion of taxpayer-funded health insurance coverage for children in the U.S. since Medicaid began in the 1960s.\n\nForeign Policy\n\nSenator Kennedy meeting with Justice Minister Horst Ehmke at Bonn, West Germany in April 1971\n\nIn April 1974, Kennedy traveled to the Soviet Union, where he met with leader Leonid Brezhnev and advocated a full nuclear test ban as well as relaxed emigration, gave a speech at Moscow State University, met with Soviet dissidents, and secured an exit visa for famed cellist Mstislav Rostropovich.[65] Kennedy's Subcommittee on Refugees and Escapees continued to focus on Vietnam, especially after the Fall of Saigon in 1975.\n\nKennedy visited China on a goodwill mission in late December 1977, meeting with leader Deng Xiaoping and eventually gained permission for a number of Mainland Chinese nationals to leave the country; in 1978, he also visited the Soviet Union, meeting with Brezhnev and also with dissidents there again.[66] During the 1970s, Kennedy also showed interest in nuclear disarmament, and as part of his efforts in this field even visited Hiroshima in January 1978 and gave a public speech to that effect at Hiroshima University.[67] He became chairman of the Senate Judiciary Committee in 1978.\n\nAfter the election of Ronald Reagan, Kennedy became very visible in opposing aspects of the foreign policy of the Reagan administration, including U.S. intervention in the Salvadoran Civil War and U.S. support for the Contras in Nicaragua, and in opposing Reagan-supported weapons systems, including the B-1 bomber, the MX missile, and the Strategic Defense Initiative. Kennedy became the Senate's leading advocate for a nuclear freeze and was a critic of Reagan's confrontational policies toward the Soviet Union.[68][69]\n\nA 1983 KGB memo indicates that Kennedy engaged in back-channel communication with the Soviet Union. According to a May 14, 1983 memorandum from KGB chairman Viktor Chebrikov to general secretary Yuri Andropov, former U.S. Senator John Tunney—a friend and former college roommate of Kennedy's—visited Moscow that month and conveyed a message from Kennedy to Andropov.[70] The memo indicates that the stated purpose of the communication was to \"'root out the threat of nuclear war', 'improve Soviet-American relations' and 'define the safety of the world'\". Chebrikov wrote that Kennedy was \"'very troubled by the current state of Soviet-American relations'\" and believed that the \"'only real threats to Reagan [were] problems of war and peace and Soviet-American relations'\". Chebrikov added that those issues, \"'according to the senator, will without a doubt become the most important of the [1984] election campaign'\".[71] Kennedy reportedly offered to visit Moscow \"'to arm Soviet officials with explanations regarding problems of nuclear disarmament so they may be better prepared and more convincing during appearances in the USA'\" and to set up U.S. television appearances for Andropov.[70]\n\nChebrikov also noted \"a little-hidden secret that [Kennedy] intended to run for president in 1988 and that the Democratic Party 'may officially turn to him to lead the fight against the Republicans' in 1984 — turning the proposal from one purely about international cooperation to one tinged with personal political aspiration.\"[71] Andropov was unimpressed by Kennedy's overtures.[72] After the Chebrikov memo was unearthed, both Tunney and a Kennedy spokesperson denied that it was true.[71]\n\nKennedy staged a high-profile trip to South Africa in January 1985.[73] He defied both the apartheid government's wishes and militant leftist AZAPO demonstrators by spending a night in the Soweto home of Bishop Desmond Tutu and also visited Winnie Mandela, wife of imprisoned black leader Nelson Mandela.[42] Upon returning, Kennedy became a leader in the push for economic sanctions against South Africa; collaborating with Senator Lowell Weicker, he secured Senate passage, and the overriding of Reagan's veto, of the Comprehensive Anti-Apartheid Act of 1986.[73] Despite their many political differences, Kennedy and Reagan had a good personal relationship,[74] and with the administration's approval Kennedy traveled to the Soviet Union in 1986 to act as a go-between in arms control negotiations with reformist Soviet leader Mikhail Gorbachev.[42] The discussions were productive, and Kennedy also helped gain the release of a number of Soviet Jewish refuseniks, including Anatoly Shcharansky.[75]\n\nSupreme Court Confirmations\n\nRobert Bork\n\nOne of Kennedy's biggest battles in the Senate came with Reagan's July 1987 nomination of Judge Robert Bork to the U.S. Supreme Court. Kennedy saw a possible Bork appointment as leading to a dismantling of civil rights law that he had helped put into place, and feared Bork's originalist judicial philosophy.[42] Kennedy's staff had researched Bork's writings and record, and within an hour of the nomination – which was initially expected to succeed – Kennedy went on the Senate floor to announce his opposition:\n\nRobert Bork's America is a land in which women would be forced into back-alley abortions, blacks would sit at segregated lunch counters, rogue police could break down citizens' doors in midnight raids, schoolchildren could not be taught about evolution, writers and artists could be censored at the whim of the Government, and the doors of the Federal courts would be shut on the fingers of millions of citizens ...[76]\n\nThe incendiary rhetoric of what became known as the \"Robert Bork's America\" speech enraged Bork supporters, who considered it slanderous, and worried some Democrats as well.[76] Bork responded, \"There was not a line in that speech that was accurate.\"[77] In 1988, an analysis published in the Western Political Quarterly of amicus curiae briefs filed by U.S. Solicitors General during the Warren and Burger Courts found that during Bork's tenure in the position during the Nixon and Ford Administrations (1973–1977), Bork took liberal positions in the aggregate as often as Thurgood Marshall did during the Johnson Administration (1965–1967) and more often than Wade H. McCree did during the Carter Administration (1977–1981), in part because Bork filed briefs in favor of the litigates in civil rights cases 75 percent of the time (contradicting a previous review of his civil rights record published in 1983).[78]\n\nHowever, the Reagan administration was unprepared for the assault, and the speech froze some Democrats from supporting the nomination and gave Kennedy and other Bork opponents time to prepare the case against him.[79] When the September 1987 Judiciary Committee hearings began, Kennedy challenged Bork forcefully on civil rights, privacy, women's rights, and other issues. Bork's own demeanor hurt him,[76] and the nomination was defeated both in committee and the full Senate.[42] The tone of the Bork battle changed the way Washington worked – with controversial nominees or candidates now experiencing all-out war waged against them – and the ramifications of it were still being felt decades later.[79]\n\nClarence Thomas\n\nBork and Clarence Thomas were the two most contentious Supreme Court nominations in United States history.[80] When the Thomas hearings began in September 1991, Kennedy pressed Thomas on his unwillingness to express an opinion about Roe v. Wade, but the nomination appeared headed for success.[81] When Anita Hill brought the sexual harassment charges against Thomas the following month, the nomination battle dominated public discourse. Kennedy was hamstrung by his past reputation and the ongoing developments in the William Kennedy Smith rape case.[82] He said almost nothing until the third day of the Thomas–Hill hearings, and when he did it was criticized by Hill supporters for being too little, too late.\n\nBiographer Adam Clymer rated Kennedy's silence during the Thomas hearings as the worst moment of his Senate career. Writer Anna Quindlen said \"[Kennedy] let us down because he had to; he was muzzled by the facts of his life.\"[82] On the day before the full Senate vote, Kennedy gave an impassioned speech against Thomas, declaring that the treatment of Hill had been \"shameful\" and that \"[t]o give the benefit of the doubt to Judge Thomas is to say that Judge Thomas is more important than the Supreme Court.\"[83] He then voted against the nomination. Thomas was confirmed by a 52–48 vote, one of the narrowest margins ever for a successful nomination.[82]\n\nLion of the Senate\n\nDid you know? Ted Kennedy, younger brother of President John F. Kennedy and Robert F. Kennedy , was known as the \"The Lion of the Senate\" due to his long tenure and influence\n\nKennedy's role as a liberal lion in the Senate came to the fore in 1995, when the Republican Revolution took control and legislation intending to fulfill the Contract with America was coming from Newt Gingrich's House of Representatives. Many Democrats in the Senate and the country overall felt depressed but Kennedy rallied forces to combat the Republicans.[84] By the beginning of 1996, most of the Contract had failed to pass the Senate and the Democrats could once again move forward with legislation, almost all of it coming out of Kennedy's staff.[85]\n\nKennedy's official Senate portrait in the 1990s\n\nIn 1996, Kennedy secured an increase in the minimum wage, which was one of his favorite issues;[86] there would not be another increase for ten years.\n\nAfter the long, disputed post-presidential election battle in Florida in 2000, many Democrats in Congress did not want to work with incoming President George W. Bush. Kennedy, however, saw Bush as genuinely interested in a major overhaul of elementary and secondary education, Bush saw Kennedy as a potential major ally in the Senate, and the two partnered together on the legislation.[87] Kennedy accepted provisions governing mandatory student testing and teacher accountability that other Democrats and the National Education Association did not like, in return for increased funding levels for education. The No Child Left Behind Act was passed by Congress in May and June 2001 and signed into law by Bush in January 2002. Kennedy soon became disenchanted with the implementation of the act, however, saying for 2003 that it was $9 billion short of the $29 billion authorized. Kennedy said, \"The tragedy is that these long overdue reforms are finally in place, but the funds are not,\"[87] and accused Bush of not living up to his personal word on the matter. Other Democrats concluded that Kennedy's penchant for cross-party deals had gotten the better of him. The White House defended its spending levels given the context of two wars going on. He would continue his cross-party deals in the coming years.\n\nDespite the strained relationship between Kennedy and Bush over No Child Left Behind spending, the two attempted to work together again on extending Medicare to cover prescription drug benefits. Kennedy's strategy was again doubted by other Democrats, but he saw the proposed $400 billion program as an opportunity that should not be missed. However, when the final formulation of the Medicare Prescription Drug, Improvement, and Modernization Act contained provisions to steer seniors towards private plans, Kennedy switched to opposing it. It passed in late 2003, and led Kennedy to again say he had been betrayed by the Bush administration.\n\nAfter Bush won a second term in the 2004 general election, Kennedy continued to oppose him on Iraq and many other issues. However, Kennedy sought to partner with Republicans again on the matter of immigration reform in the context of the ongoing United States immigration debate. Kennedy was chair of the United States Senate Judiciary Subcommittee on Immigration, Border Security, and Refugees, and in 2005, Kennedy teamed with Republican Senator John McCain on the Secure America and Orderly Immigration Act. The \"McCain-Kennedy bill\" did not reach a Senate vote, but provided a template for further attempts at dealing comprehensively with legalization, guest worker programs, and border enforcement components. Kennedy returned again with the Comprehensive Immigration Reform Act of 2007, which was sponsored by an ideologically diverse, bipartisan group of senators[88] and had strong support from the Bush administration. The bill aroused furious grassroots opposition among talk radio listeners and others as an \"amnesty\" program,[89] and despite Kennedy's last-minute attempts to salvage it, failed a cloture vote in the Senate.[90] Kennedy was philosophical about the defeat, saying that it often took several attempts across multiple Congresses for this type of legislation to build enough momentum for passage.\n\nPortrait of Kennedy in the mid-2000s\n\nSupport for Obama\n\nFollowing his endorsement of Barack Obama , Kennedy staged a campaign appearance with Obama in Hartford, Connecticut, on February 4, 2008, the day before the Super Tuesday primaries.\n\nKennedy remained neutral as the 2008 Democratic nomination battle between Senators Hillary Clinton and Barack Obama intensified, because his friend Chris Dodd was also running for the nomination.[91] The initial caucuses and primaries were split between Clinton and Obama. When Dodd withdrew from the race, Kennedy became dissatisfied with the tone of the Clinton campaign and what he saw as racially tinged remarks by Bill Clinton [92] Kennedy gave an endorsement to Obama on January 28, 2008, despite appeals by both Clintons not to do so.[93] In a move that was seen as a symbolic passing of the torch, Kennedy said that it was \"time again for a new generation of leadership,\" and compared Obama's ability to inspire with that of his fallen brothers.[92] In return, Kennedy gained a commitment from Obama to make universal health care a top priority of his administration if he were elected.[91] Kennedy's endorsement was considered among the most influential that any Democrat could get, and raised the possibility of improving Obama's vote-getting among unions, Hispanics, and traditional base Democrats.[93] It dominated the political news, and gave national exposure to a candidate who was still not well known in much of the country, as the Super Tuesday primaries across the nation approached.[94]\n\nIllness and death\n\nOn May 17, 2008, Kennedy suffered a seizure, which was followed by a second seizure as he was being rushed from the Kennedy Compound to Cape Cod Hospital and then by helicopter to Massachusetts General Hospital in Boston. Within days, doctors announced that Kennedy had a malignant glioma, a type of cancerous brain tumor. The grim diagnosis brought reactions of shock and prayer from many senators of both parties and from President Bush.[95]\n\nKennedy speaks during the first night of the 2008 Democratic National Convention in Denver, Colorado , while delegates hold signs reading \"KENNEDY\"\n\nKennedy made his first post-illness public appearance on July 9, when he surprised the Senate by showing up to supply the added vote to break a Republican filibuster against a bill to preserve Medicare fees for doctors.[96] In addition, Kennedy was ill from an attack of kidney stones. Against the advice of some associates,[97] he insisted on appearing during the first night of the 2008 Democratic National Convention on August 25, 2008, where a video tribute to him was played. Introduced by his niece Caroline Kennedy, the senator said, \"It is so wonderful to be here. Nothing – nothing – is going to keep me away from this special gathering tonight.\" He then delivered a speech to the delegates (which he had to memorize, as his impaired vision left him unable to read a teleprompter) in which, reminiscent of his speech at the 1980 Democratic National Convention, he said, \"this November, the torch will be passed again to a new generation of Americans. So, with Barack Obama and for you and for me, our country will be committed to his cause. The work begins anew. The hope rises again. And the dream lives on.\"[98] The dramatic appearance and speech electrified the convention audience,[97] as Kennedy vowed that he would be present to see Obama inaugurated.[98]\n\nOn January 20, 2009, Kennedy attended Barack Obama's presidential inauguration, but then suffered a seizure at the luncheon immediately afterwards. He was taken by wheelchair from the Capitol building and then by ambulance to Washington Hospital Center. Doctors attributed the episode to \"simple fatigue.\" He was released from the hospital the following morning, and he returned to his home in Washington, D.C.[99]\n\nKennedy with President Obama, the day the Edward M. Kennedy Serve America Act was signed, April 21, 2009, four months before Kennedy's death\n\nWhen the 111th Congress began, Kennedy dropped his spot on the Senate Judiciary Committee to focus all his attentions on national health care issues, which he regarded as \"the cause of my life.\"[100] He saw the characteristics of the Obama administration and the Democratic majorities in Congress as representing the third and best great chance for universal health care, following the lost 1971 Nixon and 1993 Clinton opportunities, and as his last big legislative battle. He would not live to see the passage of the Affordable Care Act.\n\nBasilica of Our Lady of Perpetual Help in Boston\n\nFifteen months after he was initially diagnosed with brain cancer, Kennedy succumbed to the disease on August 25, 2009, at age 77 at his home in Hyannis Port, Massachusetts. In a statement, Kennedy's family said:\n\nWe've lost the irreplaceable center of our family and joyous light in our lives, but the inspiration of his faith, optimism, and perseverance will live on in our hearts forever. He loved this country and devoted his life to serving it.[101]\n\nWhen Kennedy died in August 2009, he was the second-most senior member of the Senate (after President pro tempore Robert Byrd of West Virginia) and the third longest-serving senator of all time, behind Byrd and Strom Thurmond of South Carolina.\n\nWhen the Patient Protection and Affordable Care Act passed, Speaker Nancy Pelosi, who was instrumental in doing so, credited Kennedy's life work in her closing remarks on the House floor before the final vote. Kennedy's widow Vicki attended the signing of the Act, at which both she and President Obama wore blue \"Tedstrong\" bracelets.[102] Congressman Patrick Kennedy brought a copy of a national health insurance bill his father had introduced in 1970 as a gift for the president.[102] Patrick Kennedy then laid a note on his father's grave that said, \"Dad, the unfinished business is done.\"[103]\n\nLegacy\n\nDuring his tenure, Kennedy became one of the most recognizable and influential members of his party and was sometimes called a \"Democratic icon\"[104] as well as \"The Lion of the Senate\".[105] Kennedy and his Senate staff authored around 2,500 bills, of which more than 300 were enacted into law. Kennedy co-sponsored another 550 bills that became law after 1973. Kennedy was known for his effectiveness in dealing with Republican senators and administrations, sometimes to the irritation of other Democrats. During the 101st Congress under President George H. W. Bush, at least half of the successful proposals put forward by the Senate Democratic policy makers came out of Kennedy's Labor and Human Resources Committee.[106] During the 2000s, almost every bipartisan bill signed during the George W. Bush administration had significant involvement from Kennedy. A late 2000s survey of Republican senators ranked Kennedy first among Democrats in bipartisanship.[105] Kennedy strongly believed in the principle \"never let the perfect be the enemy of the good,\" and would agree to pass legislation he viewed as incomplete or imperfect with the goal of improving it down the road. In May 2008, soon-to-be Republican presidential nominee John McCain said, \"[Kennedy] is a legendary lawmaker and I have the highest respect for him. When we have worked together, he has been a skillful, fair and generous partner.\" Republican Governor of California and Kennedy relative by marriage Arnold Schwarzenegger described \"Uncle Teddy\" as \"a liberal icon, a warrior for the less fortunate, a fierce advocate for health-care reform, a champion of social justice here and abroad\" and \"the rock of his family\".[105]\n\nAfter Robert Kennedy's assassination in 1968, Ted was the most prominent living member of the Kennedy family and the last surviving son of Joseph P. Kennedy, Sr. and Rose Fitzgerald Kennedy. John F. Kennedy had said in 1957, \"Just as I went into politics because Joe died, if anything happened to me tomorrow, my brother Bobby would run for my seat in the Senate. And if Bobby died, Teddy would take over for him.\"[107] However, Ted was never able to carry on the \"Camelot\" mystique in the same way that both of his fallen brothers had, with much of it disappearing during his failed 1980 presidential bid. His negligence in the death of Mary Jo Kopechne at Chappaquiddick and his well-documented later personal problems further tarnished his image in relation to the Kennedy name,[1] and significantly damaged his chances of ever becoming president.[2][48] The Associated Press wrote that, \"Unlike his brothers, Edward M. Kennedy has grown old in public, his victories, defeats and human contradictions played out across the decades in the public glare.\"[108] But Kennedy's legislative accomplishments remained, and as The Boston Globe wrote, \"By the early 21st century, the achievements of the younger brother would be enough to rival those of many presidents.\"[1]\n\nKennedy's New York Times obituary described him via a character sketch: \"He was a Rabelaisian figure in the Senate and in life, instantly recognizable by his shock of white hair, his florid, oversize face, his booming Boston brogue, his powerful but pained stride. He was a celebrity, sometimes a self-parody, a hearty friend, an implacable foe, a man of large faith and large flaws, a melancholy character who persevered, drank deeply and sang loudly. He was a Kennedy.\"[2]\n\nAwards and honors\n\nSenator Kennedy received many awards and honors over the years. These include an honorary knighthood bestowed by Queen Elizabeth II of the United Kingdom, the Order of the Aztec Eagle from Mexico, the U.S. Presidential Medal of Freedom, the Order of the Merit of Chile, and honorary degrees from a number of institutions including Harvard University.\n\nWritings\n\nKennedy, Edward M. (ed.). The Fruitful Bough (Collected essays on Joseph P. Kennedy) . 1965.\n\n. 1965. Kennedy, Edward M. Decisions for a Decade: Policies and Programs for the 1970s . Doubleday, 1968.\n\n. Doubleday, 1968. Kennedy, Edward M. In Critical Condition: The Crisis in America's Health Care . Simon & Schuster, 1972. ISBN 978-0671213145\n\n. Simon & Schuster, 1972. ISBN 978-0671213145 Kennedy, Edward M. Our Day and Our Generation: The Words of Edward M. Kennedy . Simon & Schuster, 1979. ISBN 978-0671241339\n\n. Simon & Schuster, 1979. ISBN 978-0671241339 Kennedy, Edward M., and Mark Hatfield. Freeze!: How You Can Prevent Nuclear War . Bantam Books, 1982. ISBN 978-0553140774\n\n. Bantam Books, 1982. ISBN 978-0553140774 Kennedy, Edward M. America Back on Track . Viking Adult, 2006. ISBN 978-0670037643\n\n. Viking Adult, 2006. ISBN 978-0670037643 Kennedy, Edward M. My Senator and Me: A Dog's-Eye View of Washington, D.C. Scholastic Press, 2006. ISBN 978-0439650779\n\nScholastic Press, 2006. ISBN 978-0439650779 Kennedy, Edward M. True Compass: A Memoir. Twelve, 2009. ISBN 978-0446539258\n\nNotes\n\nReferences ISBN links support NWE through referral fees\n\nAll links retrieved February 26, 2023.\n\n\n\n\n\nParty Political Offices Preceded by:\n\nJohn F. Kennedy Democratic nominee for U.S. Senator from Massachusetts\n\n(Class 1)\n\n1962, 1964, 1970, 1976, 1982, 1988, 1994, 2000, 2006 Succeeded by: Martha Coakley Preceded by:\n\nRussell B. Long Senate Democratic Whip\n\n1969–1971 Succeeded by: Robert Byrd United States Senate Preceded by:\n\nBenjamin A. Smith II U.S. Senator (Class 1) from Massachusetts\n\n1962–2009\n\nServed alongside: Leverett Saltonstall, Edward Brooke, Paul Tsongas, John Kerry Succeeded by: Paul G. Kirk Preceded by:\n\nRussell B. Long Senate Majority Whip\n\n1969–1971 Succeeded by: Robert Byrd Preceded by:\n\nJames Eastland Chair of the Senate Judiciary Committee\n\n1978–1981 Succeeded by: Strom Thurmond Preceded by:\n\nOrrin Hatch Chair of the Senate Labor Committee\n\n1987–1995 Succeeded by: Nancy Kassebaum Preceded by:\n\nJim Jeffords Chair of the Senate Health Committee\n\n2001–2003 Succeeded by: Judd Gregg Preceded by:\n\nMike Enzi Chair of the Senate Health Committee\n\n2007–2009 Succeeded by: Tom Harkin Honorary Titles Preceded by:\n\nMaurice J. Murphy Jr. Baby of the Senate\n\n1962–1969 Succeeded by: Bob Packwood\n\n\n\n"}, {"url": "https://www.bostonherald.com/2019/08/26/kennedy-clan-has-long-history-in-the-u-s-senate/", "page_content": "Joe Kennedy III, now exploring a run for U.S. Senate, could keep a family tradition going that started with former President John F. Kennedy. That’s if he can beat the Democratic incumbent.\n\nThe younger Kennedy announced in a Facebook post Monday that he’s considering a run for the lofty office now held by U.S. Sen. Edward Markey. If he were to win, he’d join his two great uncles and grandfather who all served in the Senate.\n\nJohn F. Kennedy served in the U.S. Senate from Massachusetts between 1953 and 1960. He resigned after being elected president.\n\nBenjamin A. Smith II, a Kennedy family friend, served as a placeholder in that seat until Edward M. Kennedy was eligible to run — a race he won in 1962 in a special election.\n\nRobert F. Kennedy, Joe Kennedy III’s grandfather, served in the Senate from New York from 1965 until his assassination in June 1968. He was also running for president at the time.\n\nEdward Kennedy was the longest-serving senator in the family, remaining in the Senate for almost 47 years, from 1962 until his death in 2009.\n\nJoe Kennedy III, 38, said he’s “thinking about what I have to offer Massachusetts voters, what is most important in this political moment, and what kind of party Democrats need to be building for the future.”"}, {"url": "https://www.washingtonpost.com/lifestyle/kennedy-markey-senate-primary-massachusetts/2020/08/28/def9efdc-e7bd-11ea-970a-64c73a1c2392_story.html", "page_content": "Comment on this story Comment Gift Article Share\n\nThere’s an old saying in Massachusetts: You’re born a Democrat and a Red Sox fan, and you’re baptized a Catholic seven days later. As if 2020 couldn’t get any worse, this year’s Red Sox team is historically bad — embarrassingly, soul-crushingly, missing-Mookie bad. And now Democrats are faced with a U.S. Senate primary that most voters in the state, if we’re going to be frank, really wish wasn’t happening.\n\nThe incumbent is 74-year-old Edward J. Markey, who served for 37 years in the House before winning a special election in 2013 to replace John F. Kerry in the Senate. The challenger is 39-year-old Joseph Patrick Kennedy III, a four-term congressman and scion of America’s legendary political dynasty. Markey has never lost an election in his 47 years of public service, but no Kennedy has ever lost an election in Massachusetts.\n\nAdvertisement\n\nBoth men are well-known and well-liked: Polls show that 80 percent of likely Democratic voters recognize their names and 70 percent view each candidate favorably. They’re both self-described progressives with similar positions. Markey snagged a huge endorsement from Rep. Alexandria Ocasio-Cortez (D-N.Y.); Kennedy got a rare and critical nod from House Speaker Nancy Pelosi (D-Calif.).\n\nIn the absence of ideological differences, Tuesday’s contest comes down to age, relatability and loyalty. Do voters want an old dog with new tricks? Or new blood with old money?\n\nDemocratic Rep. Joe Kennedy’s primary challenge to Sen. Edward J. Markey (D) will gauge voters’ interest for generational change in the Senate. (Video: The Washington Post)\n\n“I have more than 500 laws on the books. He does not. I’ve led national movements, from the Green New Deal to the nuclear freeze movement to the net neutrality movement. And he has not,” says Markey. “And so I am able to use my record of achievement as a contrast.”\n\nAdvertisement\n\nKennedy defines the role differently. He says Markey is a “decent man,” but adds, “I wholeheartedly disagree with the idea that this job stops with the votes that you cast or the bills you file, because there’s so much more to the job, and that there’s so much more good you can do than that.”\n\nTheir supporters are excited. But most Democrats are annoyed that two “good guys” are locked in this fight — one will emerge victorious, the other will be out of office.\n\n“I’m losing a good, promising congressman or I’m losing one of the best, most progressive senators we’ve ever had,” says political writer Charlie Pierce, a Massachusetts native. “To me, that’s a lose-lose. What makes this election so easy to hate is that it seems, to me, unnecessary — an unnecessary waste of political energy and unnecessary squandering of two good careers.”\n\nMarkey’s signature look on the campaign trail is a mask, a shirt with no tie and rolled-up sleeves, and Nike Air Revolutions. The red-and-white sneakers got so worn he had to send them to the shoe hospital; now they’re back, and “I’ll have them on all day, every day until primary night,” he says.\n\nAdvertisement\n\nThis is not a race he expected to run. He represented his district outside Boston — with few Republican challengers — for more than three decades, which propelled him into the Senate after Kerry was named secretary of state. He won again the following year.\n\nWinning a Democratic primary is effectively winning the election. In the past 50 years, the state has sent only two Republicans to the Senate: Ed Brooke, who served from 1967 to 1979, and Scott Brown, who won a special election in 2010 after the death of Ted Kennedy (then lost to Elizabeth Warren two years later).\n\nYoung Democrats have a hard time moving up because old Democrats keep getting reelected: Ted Kennedy served in the Senate for almost 47 years, Kerry for 28.\n\nThe Kennedys have never been fans of patiently waiting for a seat. John Kennedy was only 35 years old when he took on Henry Cabot Lodge in the 1952 Senate race. Ted had just turned 30 when he ran in 1962. Joe’s grandfather, Robert F. Kennedy, was 38 in 1964 when he won a Senate seat in New York. Joe’s dad, Joe Kennedy II, was 34 when he was elected in 1986 to the first of his six House terms.\n\nAdvertisement\n\nSo it probably shouldn’t have been all that surprising when Joe Kennedy announced last fall he was challenging Markey, but it was.\n\n“I don’t think Ed saw it coming, nor did most people,” says a longtime Democratic fundraiser familiar with the politics in the state, who spoke on the condition of anonymity because the person was not authorized to speak on behalf of the campaign, adding, “People in Massachusetts appreciate his progressive positions that have been there long before AOC or the progressives now in style.”\n\nThe incumbent is now highlighting his decades in Washington. His signature initiatives include breaking up telephone monopolies, nuclear arms control, Medicare-for-all, finding a cure for Alzheimer’s and the Green New Deal. When he started the campaign last year, Markey thought a central issue would be the existential threat of climate change.\n\nAdvertisement\n\nBut early polls showed him down double digits against Kennedy, and the strategy shifted to not just what he’s been fighting for, but why.\n\n“I can only run as a Markey from Malden,” he says. That working-class story includes a father who drove a milk truck and a mother who survived the 1918 flu pandemic but died of Alzheimer’s. His message now is that President Trump has betrayed the American people. “It’s time for the government to respond to the needs of these families,” he says. “It’s not their fault that the coronaviruses came. It’s not their fault that we’re in the middle of the greatest depression since the 1930s.”\n\nDespite Markey’s roots, his opponent says the senator is now out of touch with many voters — especially minority and poorer constituents — because he’s rarely in the state. The Boston Globe reported last month that Markey spends less time in Massachusetts than any other member of the state’s congressional delegation.\n\nAdvertisement\n\nMarkey’s campaign has batted down that charge. “I would just say it’s been brought up every time he had a real race, and he’s never lost a race,” says campaign manager John Walsh. The senator’s national profile — along with the power that comes with seniority in Congress — is an advantage no challenger can match.\n\n“Well, the test is effectiveness,” says Markey. “All of these mayors are with me because I’d had their back on everything that they wanted. All of the state representatives and state senators are with me. NARAL [Pro-Choice America] is with me. Planned Parenthood is with me. All the environmental groups in the state are with me.”\n\nAnd AOC is with him, bestowing her endorsement and legions of young liberals. That was followed by an endorsement from the Globe last month, the first time the paper has ever not endorsed a Kennedy.\n\nAdvertisement\n\nThat leaves the delicate question of age. Kennedy is running, as young Kennedys do, on the promise of a new generation. He’s never called Markey, who is older than Kennedy’s father, too old for the job. But the suggestion hangs in the air like a wet sock.\n\nMarkey bats that away, too. “Alexandria Ocasio-Cortez, in endorsing me, said, ‘It’s not your age, it’s the age of your ideas.’ I’m the youngest guy in the race.”\n\nLast year, a Massachusetts political reporter confronted Markey’s campaign manager. “He said, ‘John, just tell me, what are Joe Kennedy’s weaknesses?’ ” says Walsh. “And I said, ‘Joe Kennedy has no weaknesses. He’s young, he’s handsome, he’s rich, he’s a Kennedy, and he’s a nice guy. You know what his problem in this election is going to be? He’s not Ed Markey.’ ”\n\nWhen Ted Kennedy first ran for Senate in 1962, he had no real qualifications except for the fact that his brother was president of the United States. His opponent, the nephew of House Speaker John McCormack, took a jab during a televised debate saying the candidate by any other name “would be a joke.” Kennedy, of course, won that race and held the seat until he died in 2009.\n\nAdvertisement\n\nThe consensus today is that Joe Kennedy would never stand a chance against Markey but for his famous name.\n\nThis is not to say “Joe” — his preferred moniker — hasn’t prepared himself for the family business. Raised primarily by his mother Sheila Rauch, after a public and messy annulment of her marriage to his father, Kennedy attended Stanford and then Harvard Law School. His political “coming out” was at Ted’s funeral, where he greeted guests and charmed almost everyone he met.\n\n“The feeling was that one of the things Joe had going for him was that he wasn’t really a Kennedy,” says Pierce. “He didn’t have the Kennedy sense of entitlement. He didn’t have the Kennedy sense of wearing your legacy like a suit of armor.”\n\nIn 2012, he ran for Congress and handily won. “He is exceptionally well-liked by the old Kennedy people,” says the Democratic fundraiser. “Everybody who ever had a relationship with Jack, Bobby, or Ted really likes ‘young Joe.’ ”\n\n“First, and I mean this respectfully, literally anything I’ve ever done, any accomplishment I’ve ever had, people have said it’s because of my name,” says Kennedy. “And that just is what it is. I’m used to it.”\n\nThe only thing he asks is that he gets a fair chance to make his case. “I understand that my family means an awful lot to an awful lot of people. And I understand the people will project onto me certain things, positive and negative. I have been trying to be very clear throughout all of my campaigns and throughout my professional life, given my chosen profession, that I am who I am. Voting for me doesn’t mean you get Robert Kennedy. It doesn’t mean that you get Ted or Jack. It doesn’t mean you get my dad. It means you get me.”\n\nHis record is not long but solidly liberal. After charges that the older members of Congress were shutting out newcomers, Kennedy was selected to give the 2018 Democratic State of the Union response, a prestigious showcase for rising stars. Later that year, Pelosi sent him across the country to raise money for Democratic members.\n\nKennedy says he had to be talked into challenging Markey, but he thought voters deserved to have a choice. He’s running on his core issues: jobs and manufacturing, affordable child care, racial justice, mental health and addiction, climate change, and health care for all. Since his positions are similar to Markey in so many ways, Kennedy is leaning heavily on his energy and engagement with voters throughout the state, especially minority communities.\n\n“I think that the role and the opportunity of what it means to be a United States senator has changed such that if you’re going to try to claim to tackle the big challenges of this moment — racial justice and equity, economic inequality — that’s not going to be signed in some backroom deal in Washington,” says Kennedy. “If it would’ve, it would’ve been done by now.” Markey, he believes, doesn’t see the job “with the same degree of opportunity, possibility or the relentlessness required in order to deliver on the change that we want to see.”\n\nWhere Kennedy sees opportunity, others see an opportunist. Kennedy is well-liked as a House member but has failed to give, according to critics, a compelling rationale for his Senate bid beyond his youth. Some liberals are offended that he’s trying to ride the wave of progressivism in the state without fully acknowledging the work by people of color. The goodwill he accrued over the years? “I think he sacrificed all of that in this run,” says Pierce. “Now he just looks like another ambitious Kennedy.”\n\n“Politics is extremely complex at the moment,” says the congressman, so “people are looking for labels to associate with this race: Are you more progressive or not? Are you running as a Kennedy or not?” He rejects the labels — and just thinks he’d be more effective in the Senate.\n\nBut the name issue came up again earlier this month when Markey released a viral ad that flipped JFK’s famous 1961 inaugural speech on its head. “We asked what we could do for our country,” Markey says in the video. “We went out, we did it. With all due respect, it’s time to start asking what your country can do for you.”\n\nWithin days, Pelosi endorsed Kennedy, telling The Post’s Karen Tumulty she was offended that Markey — who served with her for many years — had crossed a hallowed line. “I wasn’t too happy with some of the assault that I saw made on the Kennedy family,” she says. “And I thought, Joe didn’t ask me to endorse him, but I felt an imperative to do so.” Pundits were baffled that Pelosi had interjected herself into a Senate primary, and assumed it was because she is still fiercely loyal to the Kennedys, whom she has known for decades.\n\nIf Kennedy loses this primary, he could theoretically run again if Warren’s Senate seat became available because of a Biden Cabinet appointment, or if Markey retires. But he doesn’t want to wait and take the chance that one of the state’s rising stars could eclipse him at some point in the future.\n\n“It’s up or out for him,” Pierce believes. “That is the fundamental rationale for his campaign. And he’s got Ayanna Pressley in his rearview mirror, which is not an inconsiderable factor,” referring to the popular liberal congresswoman.\n\nThere’s one more reason Kennedy might be in such a hurry. Says one longtime observer: “There are a lot of people in the state who think this is a steppingstone to the presidency.”\n\nKennedy’s early lead has been erased; Markey has pulled into a double-digit lead in some polls. But the race is seen as too close to call, and both campaigns say they expect to win by bringing out a record number of first-time voters: Young liberals for Markey; minorities and other underrepresented communities for Kennedy.\n\nThe Globe’s endorsement of Markey last month was a blow to the Kennedy camp, which dismissed it as pandering to the paper’s “disproportionately white, well-off, well-educated readers.” Markey has racked up other endorsements (Warren, MoveOn.org), cutting further into Kennedy’s support.\n\nPelosi’s endorsement is widely seen as a reaction to the Globe and as the lifeline the congressman needed to blunt Markey’s momentum.\n\nIn the last days of the campaign, Markey has doubled down on his liberal bona fides and Kennedy has aired ads showcasing his grandfather and JFK. The challenger thinks he will win. “Yes, I do,” says Kennedy. “And I’m excited about that.”\n\nMarkey isn’t making predictions.\n\n“I’m running to the wire,” he says. “I’m 24/7. I’m all gas and no brakes until 8 o’clock on primary night.”\n\nGiftOutline Gift Article"}, {"url": "https://nypost.com/2009/08/27/ted-most-powerful-knight-in-camelot/", "page_content": "WASHINGTON — At the Democrats’ 1960 convention in Los Angeles that nominated John Kennedy, his 28-year-old brother, Ted, was standing with the Wyoming delegation when it sealed the victory. He was then a sibling for minor missions. He would become the most consequential brother.\n\nAllies Taking Up Ted’s Torch\n\nPlenty of Kennedys in Mix for Senate Seat\n\nPHOTOS: Life of Ted Kennedy\n\nHis two political brothers were young men in a hurry: John became the youngest elected president, at 43; Robert died at 42, seeking the presidency as soon as possible after the murder of his brother. Ted came to embody the patience of politics. Charisma is less potent than the smitten imagine; endurance is not sufficient, but is necessary.\n\nThere is the arithmetic of the Constitution and then there is the life of the institution. The Constitution makes a senator 1 percent of one-half of one of the three branches of the federal government. But the intangible and unquantifiable chemistry of personality in a little laboratory like the Senate made Ted Kennedy forceful.\n\nIn the Senate, as elsewhere, 80 percent of the important work is done by a talented 20 percent. And 95 percent of the work is done off the floor, away from committees, out of sight, where strong convictions leavened by good humor are the currency of accomplishment.\n\nThere Ted Kennedy, who had the politics of the Boston Irish in his chromosomes, flourished. What Winston Churchill said about Franklin Roosevelt — that meeting him was like opening a bottle of champagne, and knowing him was like drinking it — was true of Ted Kennedy, too.\n\nHe was an unapologetic liberal in an era during which liberalism lost ground. It began to recede in 1966, when he had 43 Senate years ahead of him. His most famous speech, to the 1980 convention, is remembered for its “the dream shall never die” peroration, but much of it was robust condescension regarding Ronald Reagan, whose subsequent landslide victory was proof of a political tide that would not be turned by ridicule. Kennedy’s second-most memorable speech, a remarkably meretricious denunciation of Robert Bork, demonstrated the merely contingent connection between truth and rhetorical potency.\n\nIt is an old axiom: “All men are by nature equal / But differ greatly in the sequel.” This presidency-obsessed nation should note that most of Ted Kennedy’s achievements were sequels to his presidential possibilities. He may have known, in the realism of his fine political mind, that his behavior at Chappaquiddick, 40 years ago last month, would be an insuperable obstacle to his presidential ambitions, about which he seems to have been deeply ambivalent.\n\nWhen he unsuccessfully challenged an incumbent president of his own party for the 1980 nomination, he was at last liberated from the burdens of his sense of duty and of other peoples’ expectations and ambitions.\n\nKennedy served in the Senate for almost 47 years, more than a fifth of the life of the Constitution. He arrived in 1962, before passage of the important civil-rights laws, and before the more humane sensibilities that those laws helped to shape.\n\nFor most of his career, he served with the only two senators whose tenures were longer than his — South Carolina’s Strom Thurmond and West Virginia’s Robert Byrd, still serving at 91. The latter was once a member of the Ku Klux Klan. The former was an unyielding segregationist until the Voting Rights Act of 1965 — which a larger percentage of Republican than Democratic senators voted for — began changing Southern electoral arithmetic. Ted Kennedy participated in unmaking the society that made them.\n\nThe last of Joe and Rose Kennedy’s nine children, Ted died 14 days after his sister Eunice.\n\nIt is arguable, and he might have cheerfully conceded, that Eunice was the most consequential Kennedy, at least as measured by the selfless enlargement of happiness. She lived a luminous life, perhaps because of the dark fate of the third oldest of Ted’s siblings.\n\nRosemary was mentally retarded. She was lobotomized and institutionalized. This grotesque response by Rosemary’s father to her handicap became a blessing for subsequent mentally disabled Americans, whose afflictions summoned Eunice to her vocation of amelioration.\n\nLet us pay the Kennedys tributes unblurred by tears. Although a great American family, they are not even Massachusetts’ greatest family: The Adamses provided two presidents, John and John Quincy, and Charles Francis, who was ambassador to Britain during the Civil War, and the unclassifiable Henry. Never mind. It diminishes Ted to assess him as a fragment of a family. He lived his own large life, and the ledger of it shows a substantial positive balance.\n\ngeorgewill@washpost.com 2009 Washington Post Writers Group"}, {"url": "https://www.britannica.com/biography/Ted-Kennedy-American-senator", "page_content": "Ted Kennedy was awarded the Presidential Medal of Freedom on August 15, 2009. The award was accepted on his behalf by his children just 10 days before his death at his home.\n\nTed Kennedy was a leading advocate in the Senate for several causes, including voting rights, fair housing, consumer protection, and national health insurance. He was recognized for his willingness to cooperate with Republicans to pass legislation, such as the No Child Left Behind Act (2001) and other initiatives of the President George W. Bush administration.\n\nOn the night of July 18, 1969, Ted Kennedy accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident.\n\nTed Kennedy, in full Edward Moore Kennedy, byname Lion of the Senate, (born February 22, 1932, Boston, Massachusetts, U.S.—died August 25, 2009, Hyannis Port, Massachusetts), U.S. senator (1962–2009), a prominent figure in the Democratic Party and in liberal politics from the 1960s who became among the most influential and respected members of the Senate during his long tenure in office. He was the youngest child of Rose and Joseph Kennedy and the last surviving brother of Pres. John F. Kennedy. His other brother, Robert Kennedy, was also a U.S. Senator, and his sister, Eunice, founded (1968) the Special Olympics.\n\nTed Kennedy graduated from Harvard University in 1956. He then studied at the International Law School (The Hague) and received a law degree from the University of Virginia (1959). He campaigned for his brother John in the 1960 presidential race and in 1962 was elected to the president’s former U.S. Senate seat representing Massachusetts. The following year John was assassinated in Dallas, Texas. Although unable to campaign actively for reelection (1964) for a full term because of an injury, Kennedy was swept back into office by a landslide vote. In 1968 he lent his support to his brother Robert’s campaign for the Democratic presidential nomination. However, Robert was assassinated in June of that year.\n\nEarly in 1969 Kennedy was elected majority whip in the U.S. Senate, and he became an early front-runner for the next Democratic presidential nomination. Then, on the night of July 18, 1969, he accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident. He was reelected to the Senate in 1970 but announced that he would not seek the presidency in 1972.\n\nKennedy won reelection to a third full term as senator in 1976. He was a serious contender for the 1980 Democratic presidential nomination but withdrew from the race during the convention. He won a fourth term in 1982 and was again reelected to the Senate in 1988, 1994, 2000, and 2006.\n\nKennedy continued to be a prominent spokesman for the policies that had come to be associated with his family name—i.e., support for social welfare legislation and active participation in world affairs. He became a leading advocate in the Senate for many liberal causes, including voting rights, fair housing, consumer protection, and national health insurance. At the same time, he was recognized for his willingness to cooperate with Republicans in the Senate to advance important legislation, such as the No Child Left Behind Act (2001) and other initiatives of the administration of Pres. George W. Bush. In 2008, after being hospitalized for a seizure, Kennedy was diagnosed with a malignant brain tumour. In March 2009 he was made an honorary Knight of the British Empire, and on August 15 he was awarded the Presidential Medal of Freedom (it was accepted on his behalf by his children); 10 days later he died at his home. In his eulogy for Kennedy, Pres. Barack Obama called him the “soul of the Democratic Party” and the “greatest legislator of our time.” Kennedy’s autobiography, True Compass, was published in September 2009."}, {"url": "https://www.britannica.com/biography/John-F-Kennedy/Congressman-and-senator", "page_content": "Congressman and senator\n\nKennedy did not disappoint his family; in fact, he never lost an election. His first opportunity came in 1946, when he ran for Congress. Although still physically weak from his war injuries, he campaigned aggressively, bypassing the Democratic organization in the Massachusetts 11th congressional district and depending instead upon his family, college friends, and fellow navy officers. In the Democratic primary he received nearly double the vote of his nearest opponent; in the November election he overwhelmed the Republican candidate. He was only 29.\n\nKennedy served three terms in the House of Representatives (1947–53) as a bread-and-butter liberal. He advocated better working conditions, more public housing, higher wages, lower prices, cheaper rents, and more Social Security for the aged. In foreign policy he was an early supporter of Cold War policies. He backed the Truman Doctrine and the Marshall Plan but was sharply critical of the Truman administration’s record in Asia. He accused the State Department of trying to force Chiang Kai-shek into a coalition with Mao Zedong. “What our young men had saved,” he told the House on January 25, 1949, “our diplomats and our President have frittered away.”\n\nHis congressional district in Boston was a safe seat, but Kennedy was too ambitious to remain long in the House of Representatives. In 1952 he ran for the U.S. Senate against the popular incumbent, Henry Cabot Lodge, Jr. His mother and sisters Eunice, Patricia, and Jean held “Kennedy teas” across the state. Thousands of volunteers flocked to help, including his 27-year-old brother Robert, who managed the campaign. That fall the Republican presidential candidate, General Dwight D. Eisenhower, carried Massachusetts by 208,000 votes; but Kennedy defeated Lodge by 70,000 votes. Less than a year later, on September 12, 1953, Kennedy enhanced his electoral appeal by marrying Jacqueline Lee Bouvier (Jacqueline Kennedy Onassis). Twelve years younger than Kennedy and from a socially prominent family, the beautiful “Jackie” was the perfect complement to the handsome politician; they made a glamorous couple.\n\nAs a senator, Kennedy quickly won a reputation for responsiveness to requests from constituents, except on certain occasions when the national interest was at stake. In 1954 he was the only New England senator to approve an extension of President Eisenhower’s reciprocal-trade powers, and he vigorously backed the opening of the St. Lawrence Seaway, despite the fact that over a period of 20 years no Massachusetts senator or congressman had ever voted for it.\n\nTo the disappointment of liberal Democrats, Kennedy soft-pedaled the demagogic excesses of Sen. Joseph R. McCarthy of Wisconsin, who in the early 1950s conducted witch-hunting campaigns against government workers accused of being communists. Kennedy’s father liked McCarthy, contributed to his campaign, and even entertained him in the family’s compound at Hyannis Port on Cape Cod in Massachusetts. Kennedy himself disapproved of McCarthy, but, as he once observed, “Half my people in Massachusetts look on McCarthy as a hero.” Yet, on the Senate vote over condemnation of McCarthy’s conduct (1954), Kennedy expected to vote against him. He prepared a speech explaining why, but he was absent on the day of the vote. Later, at a National Press Club Gridiron dinner, costumed reporters sang, “Where were you, John, where were you, John, when the Senate censured Joe?” Actually, John had been in a hospital, in critical condition after back surgery. For six months afterward he lay strapped to a board in his father’s house in Palm Beach, Florida. It was during this period that he worked on Profiles in Courage (1956), an account of eight great American political leaders who had defied popular opinion in matters of conscience, which was awarded a Pulitzer Prize in 1957. Although Kennedy was credited as the book’s author, it was later revealed that his assistant Theodore Sorensen had done much of the research and writing.\n\nBack in the Senate, Kennedy led a fight against a proposal to abolish the electoral college, crusaded for labour reform, and became increasingly committed to civil rights legislation. As a member of the Senate Committee on Foreign Relations in the late 1950s, he advocated extensive foreign aid to the emerging nations in Africa and Asia, and he surprised his colleagues by calling upon France to grant Algerian independence.\n\nDuring these years his political outlook was moving leftward. Possibly because of their father’s dynamic personality, the sons of Joseph Kennedy matured slowly. Gradually John’s stature among Democrats grew, until he had inherited the legions that had once followed Gov. Adlai E. Stevenson of Illinois, the two-time presidential candidate who by appealing to idealism had transformed the Democratic Party and made Kennedy’s rise possible."}, {"url": "https://www.nbcnews.com/id/wbna32491712", "page_content": "Sen. Edward M. Kennedy, the liberal lion of the Senate and haunted bearer of the Camelot torch after two of his brothers fell to assassins' bullets, has died at his home in Hyannis Port after battling a brain tumor. He was 77.\n\nIn nearly 50 years in the Senate, Kennedy served alongside 10 presidents — his brother John Fitzgerald Kennedy among them — compiling an impressive list of legislative achievements on health care, civil rights, education, immigration and more.\n\nHis only run for the White House ended in defeat in 1980. More than a quarter-century later, he handed then-Sen. Barack Obama an endorsement at a critical point in the campaign for the Democratic presidential nomination, explicitly likening the young contender to President Kennedy.\n\nTo the American public, Kennedy — known to friends and foes alike simply as Ted — was best known as the last surviving son of America's most glamorous political family, father figure and, memorably, eulogist of an Irish-American clan plagued again and again by tragedy.\n\nHis family announced his death in a brief statement released early Wednesday.\n\n\"We've lost the irreplaceable center of our family and joyous light in our lives, but the inspiration of his faith, optimism, and perseverance will live on in our hearts forever,\" the statement said. \"We thank everyone who gave him care and support over this last year, and everyone who stood with him for so many years in his tireless march for progress toward justice, fairness and opportunity for all.\"\n\nA few hours later, two vans left the family compound at Hyannis Port in pre-dawn darkness. Both bore hearse license plates — with the word \"hearse\" blacked out.\n\nKennedy will lie in repose Thursday and Friday at the John F. Kennedy Presidential Library and Museum in Boston before his funeral at a city church, the senator's office said.\n\nKennedy is to be buried at Arlington National Cemetery near his slain brothers, said Kennedy spokesman Keith Maley.\n\nKennedy's funeral Mass will take place Saturday at Our Lady of Perpetual Help Basilica — commonly known as the Mission Church — in the Mission Hill neighborhood of Boston.\n\nObama, on vacation in Martha's Vineyard, Mass., said he and the first lady were “heartbroken” to hear of Kennedy's passing.\n\n“An important chapter in our history has come to an end. Our country has lost a great leader, who picked up the torch of his fallen brothers and became the greatest United States Senator of our time,” Obama said.\n\nYoung senator\n\nKennedy was elected to the Senate in 1962, taking the seat that his brother John had occupied before winning the White House, and served longer than all but two senators in history.\n\nHis own hopes of reaching the White House were damaged — perhaps doomed — in 1969 by the scandal that came to be known as Chappaquiddick, an auto accident that left a young woman dead.\n\nHe sought the White House more than a decade later, lost the Democratic nomination to President Jimmy Carter, and bowed out with a stirring valedictory that echoed across the decades: \"For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives and the dream shall never die.\"\n\nKennedy was diagnosed with a cancerous brain tumor in May 2008 and underwent surgery and a grueling regimen of radiation and chemotherapy.\n\n‘Ally and a dear friend’\n\nKennedy's death .\n\nFormer First Lady Nancy Reagan said in a statement that her husband and Kennedy \"could always find common ground, and they had great respect for one another.\"\n\nShe added that she considered Kennedy \"an ally and a dear friend. I will miss him.\"\n\nRepublican California Gov. Arnold Schwarzenegger, whose wife, Maria Shriver, was Kennedy's niece, praised “the rock of our family: a loving husband, father, brother and uncle.”\n\nSenate Democratic Leader Harry Reid said that both the Kennedy family and the Senate have \"lost our patriarch\" and vowed Congress would renew the push for the cause of Kennedy's life, health care reform.\n\nBuilding a legacy\n\nIn a recent interview with The Associated Press, Kennedy's son Rep. Patrick Kennedy, D-R.I., said his father had defied the predictions of doctors by surviving more than a year with his fight against brain cancer.\n\nThe younger Kennedy also said his father's legacy was built largely in the Senate.\n\n\"He has authored more pieces of major legislation than any other United States senator,\" Patrick Kennedy said. \"He is the penultimate senator. I don't need to exaggerate when I talk about my father. That's the amazing thing. He breaks all the records himself.\"\n\nTed Kennedy made a surprise return to the Capitol last summer to cast the decisive vote for the Democrats on Medicare. He made sure he was there again last January to see his former Senate colleague Barack Obama sworn in as the nation's first black president, but suffered a seizure at a celebratory luncheon afterward.\n\nHe also made a surprise and forceful appearance at last summer's Democratic National Convention, where he spoke of his own illness and said health care was the cause of his life. His death occurred precisely one year later, almost to the hour.\n\nKennedy was away from the Senate for much of this year, leaving Republicans and Democrats to speculate about the impact what his absence meant for the fate of Obama's health care proposals.\n\nUnder state law, . In his last known public act, the senator urged state officials to give Democratic Gov. Deval Patrick the power to name an interim replacement. But that appears unlikely, leaving Democrats in Washington with one less vote for the next several months as they struggle to pass Obama's health care legislation.\n\nHis death came less than two weeks after that of his sister Eunice Kennedy Shriver on Aug. 11. Kennedy was not present for the funeral, an indication of the precariousness of his own health.\n\nTragic figure\n\nAfter Chappaquiddick especially, Kennedy gained a reputation as a heavy drinker and a womanizer, a tragically flawed figure haunted by the fear that he did not quite measure up to his brothers. As his weight ballooned, he was lampooned by comics and cartoonists in the 1980s and '90s as the very embodiment of government waste, bloat and decadence.\n\nBut in his later years, after he had remarried, he buckled down and came to be regarded as a statesman on Capitol Hill, seen as one of the most effective, hardworking lawmakers Washington has ever seen.\n\nA barrel-chested figure with a swath of white hair, a booming voice and a thick, widely imitated Boston accent, he coupled fist-pumping floor speeches with his well-honed Irish charm and formidable negotiating skills. He was both a passionate liberal and a clear-eyed pragmatist, unafraid to reach across the aisle to get things done.\n\nOver the decades, he managed to put his imprint on every major piece of social legislation to clear the Congress. In fact, for all his insecurities, he ended up perhaps the most influential liberal voice of his time.\n\nHe arrived at his place in the Senate after a string of family tragedies so terrible it sometimes seemed as if the Kennedys — America's foremost political dynasty — were as cursed as they were charmed. He was the only one of the four Kennedy brothers to die of natural causes.\n\nKennedy's eldest brother, Joseph, was killed in a plane crash in World War II. President John F. Kennedy was assassinated in Dallas in 1963. Sen. Robert F. Kennedy was gunned down in Los Angeles as he campaigned for the 1968 Democratic presidential nomination. John F. Kennedy Jr. was killed in a plane crash at age 38 along with his wife in 1999.\n\nIt fell to Ted Kennedy to deliver the eulogies, to comfort his brothers' widows, to mentor fatherless nieces and nephews. It was Ted Kennedy who walked JFK's daughter, Caroline, down the aisle at her wedding.\n\nEloquence and scandal\n\nTragedy had a way of bringing out his eloquence.\n\nKennedy sketched a dream of a better future as he laid to rest his brother Robert in 1968: \"My brother need not be idealized, or enlarged in death beyond what he was in life; to be remembered simply as a good and decent man, who saw wrong and tried to right it, saw suffering and tried to heal it, saw war and tried to stop it.\"\n\nAfter John Jr.'s death, the senator eulogized the young man by saying: \"We dared to think, in that other Irish phrase, that this John Kennedy would live to comb gray hair, with his beloved Carolyn by his side. But like his father, he had every gift but length of years.\"\n\nHis own legacy was blighted on the night of July 18, 1969, when Kennedy drove his car off a bridge and into a pond on Chappaquiddick Island, on Martha's Vineyard. Mary Jo Kopechne, a 28-year-old worker with RFK's campaign, was found dead in the submerged car's back seat 10 hours later.\n\nKennedy, then 37, pleaded guilty to leaving the scene of an accident and received a two-month suspended sentence and a year's probation. A judge eventually determined there was \"probable cause to believe that Kennedy operated his motor vehicle negligently ... and that such operation appears to have contributed to the death of Mary Jo Kopechne.\"\n\nAt the height of the scandal, Kennedy went on national television to explain himself in an extraordinary 13-minute address in which he denied driving drunk and rejected rumors of \"immoral conduct\" with Ms. Kopechne. He said he was haunted by \"irrational\" thoughts immediately after the accident, and wondered \"whether some awful curse did actually hang over all the Kennedys.\" He said his failure to report the accident right away was \"indefensible.\"\n\nIn 1980, Kennedy took the extraordinary step of challenging a sitting president, Carter, for the party's nomination. Kennedy's left-of-center politics made him an unlikely choice. But Chappaquiddick — and lingering suspicions that the famous Kennedy money and clout had gotten him out of the trouble — damaged his chances, too.\n\nWide-ranging legislative record\n\nFirst elected to the Senate in 1962, easily re-elected in 2006, Kennedy served close to 47 years, longer than all but two senators in history: Robert Byrd of West Virginia (more than 50 1/2 years and counting) and the late Strom Thurmond of South Carolina, who put in nearly 47 1/2 years.\n\nHis legislative achievements included bills to provide health insurance for children of the working poor, the landmark 1990 Americans with Disabilities Act, Meals on Wheels for the elderly, abortion clinic access, family leave, and the Occupational Safety and Health Administration.\n\nHe was also a key negotiator on legislation creating a Medicare prescription drug benefit for senior citizens and was a driving force for peace in Ireland and a persistent critic of the war in Iraq.\n\nKennedy did not always prevail. In late 2008, he unsuccessfully lobbied for niece Caroline's appointment to the Senate from New York.\n\nWildly popular among Democrats, Kennedy routinely won re-election by large margins. He grew comfortable in his role as Republican foil and leader of his party's liberal wing.\n\nPresident George W. Bush welcomed Kennedy to the Rose Garden on several occasions as he signed bills that the Democrat helped write.\n\n\"He's the kind of person who will state his case, sometimes quite eloquently and vociferously, and then on another issue will come along and you can work with him,\" Bush said shortly before his first term began in 2001.\n\nBut Bush was also the target of some of Kennedy's sharpest attacks. Kennedy assailed the Iraq war as Bush's Vietnam, a conflict \"made up in Texas\" and marketed by the Bush administration for political gain.\n\nPassing the torch\n\nKennedy and his niece Caroline shook up the Democratic establishment in January 2008 when they endorsed Obama over Hillary Rodham Clinton for the nomination for president. The ailing Massachusetts senator electrified delegates when he made a surprise trip to Denver last August to address the Democratic convention and press for Obama's election.\n\nAfter Obama won in November, Kennedy renewed words once spoken by his brother John, declaring: \"The world is changing. The old ways will not do. ... It is time for a new generation of leadership.\"\n\nBorn in 1932, the youngest of Joseph and Rose Kennedy's nine children, Edward Moore Kennedy was part of a family bristling with political ambition, beginning with maternal grandfather John F. \"Honey Fitz\" Fitzgerald, a congressman and mayor of Boston.\n\nRound-cheeked Teddy was thrown out of Harvard in 1951 for cheating, after arranging for a classmate to take a freshman Spanish exam for him. He eventually returned, earning his degree in 1956.\n\nIn 1955, Kennedy's performance on the football field for Harvard earned him the notice of the Green Bay Packers, who suggested he could have a professional sports career. Kennedy declined the approach, however, saying he planned to to \"go into another contact sport, politics.\"\n\nHe went on to the University of Virginia Law School, and in 1962, while his brother John was president, announced plans to run for the Senate seat JFK had vacated in 1960. A family friend had held the seat in the interim because Kennedy was not yet 30, the minimum age for a senator. He ultmately won the general election.\n\nBut devastated by his brothers' assassinations and injured in a 1964 plane crash that left him with back pain that would plague him for decades, Kennedy temporarily withdrew from public life in 1968. He re-emerged in 1969 to be elected majority whip of the Senate.\n\nThen came Chappaquiddick.\n\nKennedy still handily won re-election in 1970, but he lost his leadership job. He remained outspoken in his opposition to the Vietnam War and support of social programs but ruled out a 1976 presidential bid.\n\nKennedy married Virginia Joan Bennett, known as Joan, in 1958. They divorced in 1982. In 1992, he married Washington lawyer Victoria Reggie. His survivors include a daughter, Kara Kennedy Allen; two sons, Edward Jr. and Patrick, a congressman from Rhode Island; and two stepchildren, Caroline and Curran Raclin.\n\nIn 1991, Kennedy roused his nephew William Kennedy Smith and his son Patrick from bed to go out for drinks while staying at the family's Palm Beach, Fla., estate. Later that night, a woman Smith met at a bar accused him of raping her at the home.\n\nSmith was acquitted, but the senator's carousing — and testimony about him wandering about the house in his shirttails and no pants — further damaged his reputation.\n\nLater on, his second wife appeared to have a calming influence on him, helping him rehabilitate his image.\n\nMemoir forthcoming\n\nKennedy's family life has been marked by illness.\n\nEdward Jr. lost a leg to bone cancer in 1973 at age 12. Kara had a cancerous tumor removed from her lung in 2003. In 1988, Patrick had a noncancerous tumor pressing on his spine removed. He has also struggled with mental problems and addiction and announced in June that he was re-entering rehab.\n\nIn 2005, the senator's ex-wife underwent surgery for breast cancer. She has also battled alcoholism.\n\nKennedy's memoir, \"True Compass,\" is set to be published on Sept. 14.\n\nMore on: Ted Kennedy"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/kennedys-bio-edward-kennedy/", "page_content": "Edward Kennedy, known as Ted, was the youngest of nine children, 17 years younger than his brother John F. Kennedy. As a United States senator, he served the people of Massachusetts for 47 years.\n\nTed Kennedy, 1967. PD\n\nSchool Years\n\nLike his brothers, Ted attended Harvard College. While there, he arranged for a friend to take a Spanish exam for him, an incident he later had to own up to before taking public office. After college he earned his law degree from the University of Virginia and got a job at the Suffolk County, Massachusetts district attorney’s office in Boston.\n\nIn the Senate\n\nAfter John F. Kennedy was inaugurated as president in 1961, he arranged for a family friend to hold his seat in the U.S. Senate until Ted became old enough to serve there. The people of Massachusetts elected Ted as their senator in 1962 — a position he held until his death in 2009.\n\nHead of the Family\n\nThe Kennedy brothers were taught by their father to strive for the highest office in the land. As each died, the next was expected to take up the cause. Joe Jr., the oldest brother, died when Ted was twelve, John and Robert were murdered two decades later. His father, cut down by a stroke in 1961, died in 1969, leaving Ted, the baby of the family, as the patriarch. “I can’t let go,” he told an aide. “If I let go, Ethel will let go, and my mother will let go, and all my sisters.”\n\nChappaquiddick\n\nKennedy’s family legacy seemed to assure him a competitive candidacy for the presidency — but for a fatal mistake on July 18, 1969. Following a dutiful appreciation party for the “boiler room girls” who had worked on his brother Robert’s campaign, Kennedy drove his car off a bridge in Chappaquiddick, Massachusetts. Although Kennedy managed to escape, his passenger, Mary Jo Kopechne, drowned. Furthermore, Kennedy did not report the incident immediately. Later, he pleaded guilty to leaving the scene of an accident. Chappaquiddick seemed to quash Kennedy’s presidential prospects.\n\nPresidential Run\n\nIn 1980, however, Kennedy challenged incumbent President Jimmy Carter in the Democratic primaries. Initially popular in opinion polls, he quickly lost ground in the actual primaries, finally conceding.\n\nEffective Legislator\n\nAlthough never president, Kennedy became an effective senator, exceeding both of his brothers in his legislative accomplishments. An advocate of liberal ideals — and a lightning rod for conservative criticism — he focused much of his energy on health care and education bills. Though a standard bearer for the left, Kennedy was able to forge bipartisan alliances to get his legislation passed. According to journalist and biographer Adam Clymer, Kennedy deserves “recognition not just as the leading senator of his time, but as one of the greats in [Senate] history.”\n\nFamily Life\n\nSince Chappaquiddick, Kennedy’s personal life has been scrutinized intensely. He married Virginia Joan Bennett in 1958; they divorced in 1982. In 1992 he married Victoria Reggie. Kennedy had three children from his first marriage and two stepchildren from his second. He was a particularly strong presence in the lives of his nieces and nephews and he had a self-deprecating sense of humor. He told a story about his nephew John F. Kennedy Jr.: “Once, when they asked John what he would do if he went into politics and was elected president, he said: 'I guess the first thing is call up Uncle Teddy and gloat.’ I loved that.”\n\nOn August 25, 2009, Ted Kennedy died at the family compound in Hyannis Port after being diagnosed with a brain tumor in May 2008."}, {"url": "https://american-history.net/american-presidents/american-presidents-list/john-f-kennedy-35/", "page_content": "John F. Kennedy – 35\n\nJohn F. Kennedy served as the 35th President of the United States. He served for only about three years before he was assassinated while visiting Texas. His assassination has become one of the most controversial events of American history, leading to various conspiracy theories.\n\nLife before President\n\nJ. F. Kennedy was born to an affluent family. He graduated from the Harvard University and then had a career in the United States military from 1941 to 1945. He later joined politics and was elected as a member of the U.S. House of Representatives from Massachusetts.\n\nKennedy served in the U.S. Senate from 1953 to 1960. He was able to gain a lot of followers because of his charismatic personality. He also became a quite popular and well-recognized face of American politics. By the time he contested the presidential elections in 1960, Kennedy already had a lot of support. His main opponent in the presidential elections was Richard Nixon.\n\nKennedy as President\n\nKennedy ran for the President during the 1960 presidential campaign. He was Catholic and his Catholic background created doubts in the minds of many Americans. However, Kennedy was able to diffuse these doubts. Thanks to his extensive campaigning, powerful rhetoric and charisma, Kennedy was able to win the presidential election.\n\nThe results were very close and Kennedy became the youngest person to be elected as the American president. He was also the only Roman Catholic to have reached the position.\n\nLife as President\n\nJohn F. Kennedy’s brief role as the President was marked with tensions with the Soviet Union. At the time, the Cold War was the main issue. Kennedy undertook an active role to combat the spread of communism. He increased the American presence in South Vietnam while also overseeing a failed coup attempt in Cuba during the Bay of Pigs invasion.\n\nThe Cuban Missile Crisis also took place during his presidency – a nuclear war was averted through the rigorous diplomatic efforts of President Kennedy and his administration.\n\nPresident John F. Kennedy and Civil Rights\n\nDuring his role as President for nearly three years, John F. Kennedy staunchly supported civil rights and liberties. He opposed discrimination on the basis of national origin or race. This encouraged more people to stat immigrating to United States from Asia and Latin America.\n\nOn the downside, President Kennedy allowed FBI’s Director, J. Edgar Hoover, to wiretap civil rights leader Martin Luther King. Hoover manipulated this permission which was granted for a month or so, and continued to wiretap King for many years.\n\nAssassination of John F. Kennedy\n\nOn November 22, 1963, President John F. Kennedy was assassinated. He was visiting the state of Texas and driving through a public place in a motorcade. Lee Harvey Oswald was later charged with shooting the President from a nearby building. The president was shot twice and died nearly 30 minutes later.\n\nOswald was later charged with the assassination but he was later killed publicly before he could be prosecuted. This led to many conspiracy theories surrounding the assassination and many people today believe that the truth is not yet revealed.\n\nlearn more about American President John Kennedy at Wikipedia"}, {"url": "https://www.nytimes.com/2009/08/28/us/politics/28mourn.html", "page_content": "As the motorcade sped along a 70-mile route from Cape Cod to Boston, taking Mr. Kennedy’s body on its final journey through the state he had represented for 47 years, people of all ages, races and nationalities waited at various landmarks in the city for the procession to pass. Some waved flags or signs that said, “Thank You Teddy”; some looked bereft as helicopters droned and gulls squawked overhead.\n\nImage People lined balconies and sidewalks as the hearse carrying Senator Edward M. Kennedy\u0092s body drove through Boston Thursday. Credit... Damon Winter/The New York Times\n\n“I know it’s going to give me chills,” said Annette Luc, 51, a state employee who was waiting for the cortege near Boston Common. “Washington, the Senate, the White House \u0097 they all lost a real leader.”\n\nAs the motorcade entered the city about 4 p.m., Kennedy family members in the vehicles rolled down their windows and waved at the crowds. Hundreds of onlookers applauded as the hearse passed St. Stephen’s Church in the city’s North End, where Rose Fitzgerald was baptized in 1890 and where her funeral was held in 1995. And as the hearse passed Faneuil Hall, in the heart of downtown, a bell atop the 267-year-old building rang 47 times, once for each year Mr. Kennedy had served in the Senate.\n\nAlberto Castro, 65, who had admired the Kennedy family as a boy growing up in the Dominican Republic, said it felt as if he were losing a piece of himself along with his senator.\n\n“I’m paying my respects to the last of this part of my identity,” said Mr. Castro, who lives in Dorchester and was waiting for the cortege near the State House. “I grew up with J. F. K. in the White House, and it was then I realized there was someone looking out for me. This is the last of that part of my personal history. Senator Kennedy was the youngest of those men who did so much.”"}], "Harry S. Kennedy had the fourth-longest tenure in Senate history.": [{"url": "https://www.statista.com/statistics/1035607/length-every-us-presidents-term/", "page_content": "Strategy and business building for the data-driven economy:\n\nThe best of the best: the portal for top lists & rankings:\n\nGet quick analyses with our professional research service\n\nDirectly accessible data for 170 industries from 50 countries and over 1 million facts:\n\nDetailed information for 35,000+ online stores and marketplaces\n\nBusiness information on 70m+ public and private companies\n\nInsights on consumer attitudes and behavior worldwide\n\nMarket forecast and expert KPIs for 1000+ markets in 190+ countries & territories\n\nAll key figures about countries and regions\n\nDetailed information about political and social topics\n\nConsumer and brand insights and preferences in various industries\n\nKey figures and rankings about companies and products\n\nIndustry and market insights and forecasts\n\nOverview and forecasts on trending topics\n\nNumber of apps available in leading app stores Q3 2022\n\nQuarterly smartphone market share worldwide by vendor 2009-2023\n\nFacebook: quarterly number of MAU (monthly active users) worldwide 2008-2023\n\nPlease create an employee account to be able to mark statistics as favorites. Then you can access your favorite statistics via the star in the header. Register now\n\nCurrently, you are using a shared account. To use individual functions (e.g., mark statistics as favourites, set statistic alerts) please log in with your personal account. If you are an admin, please authenticate by logging in again. Login\n\nStatista Accounts: Access All Statistics. Starting from $588 USD / Year\n\nBasic Account Get to know the platform You only have access to basic statistics. Starter Account The ideal entry-level account for individual users Instant access to 1m statistics\n\nto 1m statistics Download in XLS, PDF & PNG format\n\nin XLS, PDF & PNG format Detailed references $69 USD $49 USD / Month * in the first 12 months Professional Account Full access Business Solutions including all features. * Prices do not include sales tax.\n\nStatista Accounts: Access All Statistics. Starting from $588 USD / Year Learn more about how Statista can support your business. Request webinar\n\nProCon, & Encyclopædia Britannica. (February 18, 2021). Length of time spent in office by every President of the United States from 1789 to 2021 (in years) [Graph]. In Statista . Retrieved June 09, 2023, from https://www.statista.com/statistics/1035607/length-every-us-presidents-term/\n\nProCon, und Encyclopædia Britannica. \"Length of time spent in office by every President of the United States from 1789 to 2021 (in years).\" Chart. February 18, 2021. Statista. Accessed June 09, 2023. https://www.statista.com/statistics/1035607/length-every-us-presidents-term/\n\nProCon, Encyclopædia Britannica. (2021). Length of time spent in office by every President of the United States from 1789 to 2021 (in years) . Statista . Statista Inc.. Accessed: June 09, 2023. https://www.statista.com/statistics/1035607/length-every-us-presidents-term/\n\nProCon, and Encyclopædia Britannica. \"Length of Time Spent in Office by Every President of The United States from 1789 to 2021 (in Years).\" Statista , Statista Inc., 18 Feb 2021, https://www.statista.com/statistics/1035607/length-every-us-presidents-term/\n\nProCon & Encyclopædia Britannica, Length of time spent in office by every President of the United States from 1789 to 2021 (in years) Statista, https://www.statista.com/statistics/1035607/length-every-us-presidents-term/ (last visited June 09, 2023)\n\nLength of time spent in office by every President of the United States from 1789 to 2021 (in years) [Graph], ProCon, & Encyclopædia Britannica, February 18, 2021. [Online]. Available: https://www.statista.com/statistics/1035607/length-every-us-presidents-term/"}, {"url": "https://www.quorum.us/data-driven-insights/who-are-the-longest-serving-members-of-congress/", "page_content": "Longest Serving Former and Current Senators\n\nLongest-Serving Former Senators\n\nSen. Robert Byrd (D-WV) — 51 years in office (1959-2010) — As the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill.\n\nAs the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill. Sen. Daniel Inouye (D-HI) — 49 years in office (1963-2012) — Inouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012.\n\nInouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012. Sen. Strom Thurmond (D-SC 1954-1964, R-SC 1964-2003) — 48 years in office (1954-2003) — A notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate.\n\nA notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate. Sen. Patrick Leahy (D-VT) — 47 years — Leahy served as the President pro tempore of the US Senate, presiding over the Senate when the Vice President is absent. This position put Sen. Leahy third in the line of succession to the presidency, behind the Vice President and Speaker of the House. He sponsored 564 bills during his tenure, voting with his party 92.0 percent of the time, getting 31.56 percent of his bills out of committee, and 7.62 percent of his sponsored bills enacted. Leahy most frequently cosponsors bills with Sen. Dick Durbin (D-IL) (111 bills), Sen. Dianne Feinstein (D-CA) (103 bills), and Sen. Chuck Grassley (R-IA) (91 bills). Sen. Leahy did not seek reelection in 2022 and retired at the end of his term.\n\nLongest-Serving Active Senators\n\nSen. Chuck Grassley (R-IA) — 41 years — One of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022.\n\nOne of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022. Sen. Mitch McConnell (R-KY) — 37 years — Leading the Senate Republican caucus for 16 years, McConnell is the longest-serving Republican leader in Senate history. McConnell has somehow managed to unite a caucus ranging from centrists to unyielding conservatives. McConnell was first elected to the Senate in 1984. Since then, he has risen in the ranks to hold many party leadership positions, including Majority Whip, Majority Leader, and now currently Minority Leader of the Senate. He works most frequently on bills that cover Intergovernmental relations (107 bills), Law (97 bills), Crime and Law Enforcement (89 bills), Commerce (85 bills), and Labor and Employment (69 bills). He has sponsored 249 bills in his last thirty-seven year(s) in office, voting with his party 93.0 percent of the time, getting 17.27 percent of his bills out of committee, and 4.42 percent of his sponsored bills enacted. Sen. McConnell is up for re-election in 2026.\n\nLongest Serving House Members\n\nLongest-Serving Former Representatives\n\nRep. John Dingell (D-MI-12) — 59 years in office (1955-2015) — Beginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat.\n\nBeginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat. Rep. Jamie Whitten (D-MS-01) — 53 years in office (1941-1995) — Throughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs.\n\nThroughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs. Rep. John Conyers (D-MI-13) — 52 years in office (1965-2017) — The longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality.\n\nThe longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality. Rep. Don Young (R-AK-01) — 48 years (1973-2022) — Don Young passed away on March 18, 2022, ending his 48-year term in office. This section has been updated to reflect on his tenure in office. With the title of longest continuously serving representative, Young served as the Dean of the House of Representatives, a symbolic post who is responsible for swearing in the Speaker of the House at the beginning of a new Congress. Young hailed from Alaska, and sat on the Natural Resources and Transportation committees. He worked most frequently on bills that covered natural resources, transportation, public works, and Native American issues.\n\nLongest-Serving Active Representatives\n\nRep. Hal Rogers (R-KY-05) — 41 years — Tied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022.\n\nTied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022. Rep. Chris Smith (R-NJ-04) — 41 years — A member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022.\n\nA member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022. Leader Steny Hoyer (D-MD-05) — 40 years — As the House majority leader, Hoyer draws on his 40 years in the House to serve as the second-highest-ranking member of the House. His tenure also makes him the most senior Democrat in the House. Rep. Hoyer won re-election in 2022.\n\n13 Longest Serving Active Members of Congress\n\nSen. Chuck Grassley (R-IA) — 47 years*\n\nSen. Ed Markey (D-MA) — 45 years*\n\nSen. Ron Wyden (D-OR) — 41 years*\n\nSen. Chuck Schumer (D-NY) — 41 years*\n\nRep. Hal Rogers (R-KY-05) — 41 years\n\nRep. Chris Smith (R-NJ-04) — 41 years\n\nLeader Steny Hoyer (D-MD-05) — 40 years\n\nWhy Does Length of Time Served Matter?\n\nIt’s my birthday today. I’m turning 64, or as we like to call it in the Senate: middle-aged. — Senator Tina Smith (@SenTinaSmith) March 4, 2022\n\nLongest Serving Former and Current Senators\n\nLongest-Serving Former Senators\n\nSen. Robert Byrd (D-WV) — 51 years in office (1959-2010) — As the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill.\n\nAs the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill. Sen. Daniel Inouye (D-HI) — 49 years in office (1963-2012) — Inouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012.\n\nInouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012. Sen. Strom Thurmond (D-SC 1954-1964, R-SC 1964-2003) — 48 years in office (1954-2003) — A notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate.\n\nA notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate. Sen. Patrick Leahy (D-VT) — 47 years — Leahy served as the President pro tempore of the US Senate, presiding over the Senate when the Vice President is absent. This position put Sen. Leahy third in the line of succession to the presidency, behind the Vice President and Speaker of the House. He sponsored 564 bills during his tenure, voting with his party 92.0 percent of the time, getting 31.56 percent of his bills out of committee, and 7.62 percent of his sponsored bills enacted. Leahy most frequently cosponsors bills with Sen. Dick Durbin (D-IL) (111 bills), Sen. Dianne Feinstein (D-CA) (103 bills), and Sen. Chuck Grassley (R-IA) (91 bills). Sen. Leahy did not seek reelection in 2022 and retired at the end of his term.\n\nLongest-Serving Active Senators\n\nSen. Chuck Grassley (R-IA) — 41 years — One of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022.\n\nOne of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022. Sen. Mitch McConnell (R-KY) — 37 years — Leading the Senate Republican caucus for 16 years, McConnell is the longest-serving Republican leader in Senate history. McConnell has somehow managed to unite a caucus ranging from centrists to unyielding conservatives. McConnell was first elected to the Senate in 1984. Since then, he has risen in the ranks to hold many party leadership positions, including Majority Whip, Majority Leader, and now currently Minority Leader of the Senate. He works most frequently on bills that cover Intergovernmental relations (107 bills), Law (97 bills), Crime and Law Enforcement (89 bills), Commerce (85 bills), and Labor and Employment (69 bills). He has sponsored 249 bills in his last thirty-seven year(s) in office, voting with his party 93.0 percent of the time, getting 17.27 percent of his bills out of committee, and 4.42 percent of his sponsored bills enacted. Sen. McConnell is up for re-election in 2026.\n\nLongest Serving House Members\n\nLongest-Serving Former Representatives\n\nRep. John Dingell (D-MI-12) — 59 years in office (1955-2015) — Beginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat.\n\nBeginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat. Rep. Jamie Whitten (D-MS-01) — 53 years in office (1941-1995) — Throughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs.\n\nThroughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs. Rep. John Conyers (D-MI-13) — 52 years in office (1965-2017) — The longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality.\n\nThe longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality. Rep. Don Young (R-AK-01) — 48 years (1973-2022) — Don Young passed away on March 18, 2022, ending his 48-year term in office. This section has been updated to reflect on his tenure in office. With the title of longest continuously serving representative, Young served as the Dean of the House of Representatives, a symbolic post who is responsible for swearing in the Speaker of the House at the beginning of a new Congress. Young hailed from Alaska, and sat on the Natural Resources and Transportation committees. He worked most frequently on bills that covered natural resources, transportation, public works, and Native American issues.\n\nLongest-Serving Active Representatives\n\nRep. Hal Rogers (R-KY-05) — 41 years — Tied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022.\n\nTied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022. Rep. Chris Smith (R-NJ-04) — 41 years — A member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022.\n\nA member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022. Leader Steny Hoyer (D-MD-05) — 40 years — As the House majority leader, Hoyer draws on his 40 years in the House to serve as the second-highest-ranking member of the House. His tenure also makes him the most senior Democrat in the House. Rep. Hoyer won re-election in 2022.\n\n13 Longest Serving Active Members of Congress\n\nSen. Chuck Grassley (R-IA) — 47 years*\n\nSen. Ed Markey (D-MA) — 45 years*\n\nSen. Ron Wyden (D-OR) — 41 years*\n\nSen. Chuck Schumer (D-NY) — 41 years*\n\nRep. Hal Rogers (R-KY-05) — 41 years\n\nRep. Chris Smith (R-NJ-04) — 41 years\n\nLeader Steny Hoyer (D-MD-05) — 40 years\n\nWhy Does Length of Time Served Matter?\n\nIt’s my birthday today. I’m turning 64, or as we like to call it in the Senate: middle-aged. — Senator Tina Smith (@SenTinaSmith) March 4, 2022\n\nLongest Serving Former and Current Senators\n\nLongest-Serving Former Senators\n\nSen. Robert Byrd (D-WV) — 51 years in office (1959-2010) — As the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill.\n\nAs the longest ever serving senator in U.S. history, Byrd certainly left his mark on the chamber. Byrd was renowned for his parliamentary procedure and precedent knowledge and developed several rules and concepts such as pork-barrel spending, and the ever aggrieved Byrd Rule, which requires a ⅗ Senate majority vote to pass a bill. Sen. Daniel Inouye (D-HI) — 49 years in office (1963-2012) — Inouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012.\n\nInouye was the first legislator elected to represent Hawaii after it achieved full statehood in 1959 and was later elected to the Senate in 1962. Inouye was the first Japanese American to serve the House and Senate. A Medal of Honor recipient, Inouye pursued civic service after losing an arm to a battle wound during World War II. Inouye served as Hawaii’s senator up until his death in 2012. Sen. Strom Thurmond (D-SC 1954-1964, R-SC 1964-2003) — 48 years in office (1954-2003) — A notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate.\n\nA notorious segregationist, Thurmond conducted the longest ever speaking filibuster delivered by a single senator, speaking for 24 hours and 18 minutes in an unsuccessful attempt to block the passage of the Civil Rights Act of 1957. Thurmond reached the age of 100 while in office in 2003, also giving him the title of the oldest serving senator ever in office. Thurmond was also the longest-serving member of Congress to solely serve in the Senate. Sen. Patrick Leahy (D-VT) — 47 years — Leahy served as the President pro tempore of the US Senate, presiding over the Senate when the Vice President is absent. This position put Sen. Leahy third in the line of succession to the presidency, behind the Vice President and Speaker of the House. He sponsored 564 bills during his tenure, voting with his party 92.0 percent of the time, getting 31.56 percent of his bills out of committee, and 7.62 percent of his sponsored bills enacted. Leahy most frequently cosponsors bills with Sen. Dick Durbin (D-IL) (111 bills), Sen. Dianne Feinstein (D-CA) (103 bills), and Sen. Chuck Grassley (R-IA) (91 bills). Sen. Leahy did not seek reelection in 2022 and retired at the end of his term.\n\nLongest-Serving Active Senators\n\nSen. Chuck Grassley (R-IA) — 41 years — One of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022.\n\nOne of the longest-serving senators ever, Chuck Grassley is the Ranking Member of the Judiciary Committee, and a member of the Finance, Budget, Agriculture, and Taxation committees. As Judiciary chairman, the conservative Iowan was responsible for confirming the most federal judges ever in a two-year period from 2018-2020, including two Supreme Court justices — reorienting the third branch of government. His legacy also includes passing the First Step Act of 2018, which made the biggest change to federal sentencing laws in a generation. Notorious for his colorful tweets, Grassley summed up his own legacy in 2018 tweeting “To all the ppl who always disagree w my tweets bc I’m a Republican-what do u think of us passing bipartisan criminal justice reform that I’ve worked on for yrs???” Sen. Grassley won re-election in 2022. Sen. Mitch McConnell (R-KY) — 37 years — Leading the Senate Republican caucus for 16 years, McConnell is the longest-serving Republican leader in Senate history. McConnell has somehow managed to unite a caucus ranging from centrists to unyielding conservatives. McConnell was first elected to the Senate in 1984. Since then, he has risen in the ranks to hold many party leadership positions, including Majority Whip, Majority Leader, and now currently Minority Leader of the Senate. He works most frequently on bills that cover Intergovernmental relations (107 bills), Law (97 bills), Crime and Law Enforcement (89 bills), Commerce (85 bills), and Labor and Employment (69 bills). He has sponsored 249 bills in his last thirty-seven year(s) in office, voting with his party 93.0 percent of the time, getting 17.27 percent of his bills out of committee, and 4.42 percent of his sponsored bills enacted. Sen. McConnell is up for re-election in 2026.\n\nLongest Serving House Members\n\nLongest-Serving Former Representatives\n\nRep. John Dingell (D-MI-12) — 59 years in office (1955-2015) — Beginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat.\n\nBeginning his career by replacing his father John Dingell Sr. as representative for Michigan’s 16th district in a special election in 1955, and was re-elected 29 times to that seat, running unopposed twice. Upon Dingell’s retirement from office in 2015, he was succeeded by his wife, Rep. Debbie Dingell (D-MI-12) in a special election to fill his seat. Rep. Jamie Whitten (D-MS-01) — 53 years in office (1941-1995) — Throughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs.\n\nThroughout his tenure, Whitten served on the Appropriations Committee, chairing it from 1979-1992, and used his time to advocate for agricultural spending. Coined a “New Dealer” for supporting FDR’s New Deal economic policies, Whitten pushed for liberal spending that established free and reduced school lunches and food stamp programs. Rep. John Conyers (D-MI-13) — 52 years in office (1965-2017) — The longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality.\n\nThe longest-serving African American in Congress, Conyers co-founded the powerful Congressional Black Caucus in 1969. Conyers’ legacy in the House included establishing Martin Luther King Jr. Day as a federal holiday and getting the Voting Rights Act passed in 1965. A leader in civil rights, Conyers represented much of the historically African American community in western Detroit and used his position to advocate for racial equality. Rep. Don Young (R-AK-01) — 48 years (1973-2022) — Don Young passed away on March 18, 2022, ending his 48-year term in office. This section has been updated to reflect on his tenure in office. With the title of longest continuously serving representative, Young served as the Dean of the House of Representatives, a symbolic post who is responsible for swearing in the Speaker of the House at the beginning of a new Congress. Young hailed from Alaska, and sat on the Natural Resources and Transportation committees. He worked most frequently on bills that covered natural resources, transportation, public works, and Native American issues.\n\nLongest-Serving Active Representatives\n\nRep. Hal Rogers (R-KY-05) — 41 years — Tied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022.\n\nTied for second most-senior member in the House, Rogers has served his district for 41 years. Rogers’ deal-making harkens back to how Congress used to operate, including his affinity for earmarks, which he used to steer funds back to his rural district before they were banned from 2011-2021 but he is probably thrilled that earmarks are back again! Rep. Rogers won re-election in 2022. Rep. Chris Smith (R-NJ-04) — 41 years — A member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022.\n\nA member of the Foreign Affairs Committee, Smith has focused much of his tenure on international human rights. This work culminated in passing the Victims of Trafficking and Violence Act of 2000, which provides assistance to trafficking victims and implements harsher punishment for traffickers. Smith works most frequently on bills that cover international affairs, and crime and law enforcement. Rep. Smith won re-election in 2022. Leader Steny Hoyer (D-MD-05) — 40 years — As the House majority leader, Hoyer draws on his 40 years in the House to serve as the second-highest-ranking member of the House. His tenure also makes him the most senior Democrat in the House. Rep. Hoyer won re-election in 2022.\n\n13 Longest Serving Active Members of Congress\n\nSen. Chuck Grassley (R-IA) — 47 years*\n\nSen. Ed Markey (D-MA) — 45 years*\n\nSen. Ron Wyden (D-OR) — 41 years*\n\nSen. Chuck Schumer (D-NY) — 41 years*\n\nRep. Hal Rogers (R-KY-05) — 41 years\n\nRep. Chris Smith (R-NJ-04) — 41 years\n\nLeader Steny Hoyer (D-MD-05) — 40 years\n\nWhy Does Length of Time Served Matter?\n\nIt’s my birthday today. I’m turning 64, or as we like to call it in the Senate: middle-aged. — Senator Tina Smith (@SenTinaSmith) March 4, 2022\n\nWP_Query Object ( [query] => Array ( [name] => who-are-the-longest-serving-members-of-congress [post_type] => resources [resource-type] => data-driven-insights ) [query_vars] => Array ( [name] => who-are-the-longest-serving-members-of-congress [post_type] => resources [resource-type] => data-driven-insights [error] => [m] => [p] => 0 [post_parent] => [subpost] => [subpost_id] => [attachment] => [attachment_id] => 0 [pagename] => [page_id] => 0 [second] => [minute] => [hour] => [day] => 0 [monthnum] => 0 [year] => 0 [w] => 0 [category_name] => [tag] => [cat] => [tag_id] => [author] => [author_name] => [feed] => [tb] => [paged] => 0 [meta_key] => [meta_value] => [preview] => [s] => [sentence] => [title] => [fields] => [menu_order] => [embed] => [category__in] => Array ( ) [category__not_in] => Array ( ) [category__and] => Array ( ) [post__in] => Array ( ) [post__not_in] => Array ( ) [post_name__in] => Array ( ) [tag__in] => Array ( ) [tag__not_in] => Array ( ) [tag__and] => Array ( ) [tag_slug__in] => Array ( ) [tag_slug__and] => Array ( ) [post_parent__in] => Array ( ) [post_parent__not_in] => Array ( ) [author__in] => Array ( ) [author__not_in] => Array ( ) [search_columns] => Array ( ) [ignore_sticky_posts] => [suppress_filters] => [cache_results] => 1 [update_post_term_cache] => 1 [update_menu_item_cache] => [lazy_load_term_meta] => 1 [update_post_meta_cache] => 1 [posts_per_page] => 10 [nopaging] => [comments_per_page] => 50 [no_found_rows] => [order] => DESC ) [tax_query] => [meta_query] => WP_Meta_Query Object ( [queries] => Array ( ) [relation] => [meta_table] => [meta_id_column] => [primary_table] => [primary_id_column] => [table_aliases:protected] => Array ( ) [clauses:protected] => Array ( ) [has_or_relation:protected] => ) [date_query] => [queried_object] => WP_Post Object ( [ID] => 6475 [post_author] => 23 [post_date] => 2022-01-17 22:30:01 [post_date_gmt] => 2022-01-17 22:30:01 [post_content] => Congressional term limits have recently gotten the spotlight in campaign promises. “Drain the swamp,” and calls for “new blood” in Congress are popular refrains we’ve heard on the campaign trails. A 2018 survey showed 82 percent of Americans supported implementing term limits for members of Congress. If term limits were passed in Congress, which members of Congress would no longer be allowed to serve? We put together a list of the longest-serving members of Congress as well as historical record holders for longest tenure in office. The members of Congress included in this blog have served for at least 36 years in the House, Senate, or a combination of both. In matters where there was a tie for the amount of time served in Congress, members were sorted first by uninterrupted service, chronological order, senators over representatives, and Senate and House seniority. To provide a comparison to current members of Congress’s tenure length, we also included former members of Congress that hold records for the longest service.While there have been efforts made by both former President Trump and others in the past to limit the number of terms senators can serve, there are currently no term limits for Congress. Proposed term limits have been proposed to limit service to two consecutive terms, totaling 12 years of service consecutively. These measures, however, have never been enacted into law.The most recent proposed term limit legislation was introduced in the House by Rep. Tim Burchett (R-TN-02) in November 2021, which would limit incoming members of Congress to serve a maximum of three two-year terms consecutively. So far, this joint resolution has garnered 79 cosponsors, all of whom are Republicans. If this bill had been passed during these representatives’ tenure, their careers may have been cut short.There are 13 active members of Congress that have the longest tenure of service, some of whom have served only in one chamber and some of whom have served both the Senate and House of Representatives. These are members of Congress actively serving that have the longest combined record of service on anyone currently serving in Congress.The average age of members of Congress skews older than the average age of most Americans, with the average American being 20 years younger than their representative in Congress. As of 2015, 19 percent of Americans eligible to run for Congress are 65 or older . With Congress meant to reflect the diversity (including age) of the United States population, it’s notable that 40 percent of current senators and 26 percent of representatives are 65 or older. Less than 5 percent of members of Congress are between the ages of 25 and 40, despite the fact that 33 percent of the over-25 population in the U.S. are under 40 years of age.When meeting with a member of Congress, examining their tenure in office and their age help you develop an understanding of what issues may matter to them based on their legislative history and experience. Understanding these factors can better inform your strategy when interacting with members of Congress to achieve your policy goals. A member of Congress that has served for more than 40 years may have immense institutional knowledge but may require more thorough education on your issues depending on their policy areas of expertise. However, with a longer tenure comes a more clear record of how they may react to your issues. Say you’re planning to meet with a representative who has been in office for more than 40 years. Before your meeting, do some research into their legislative and professional experience to better plan your messaging strategy— what legislation have they sponsored in the past? Which committees have they sat on? What was their profession before assuming office? How do they talk about your issues on social media? Use this knowledge base and historical information to guide your conversation to meet members of Congress where they are in their decision-making and education process. [post_title] => Who Are the Longest Serving Members of Congress? [post_excerpt] => Members of Congress often fill many positions during their service, which leads to longer tenures that go beyond the term limits due to position changes. [post_status] => publish [comment_status] => closed [ping_status] => closed [post_password] => [post_name] => who-are-the-longest-serving-members-of-congress [to_ping] => [pinged] => [post_modified] => 2023-01-17 20:45:33 [post_modified_gmt] => 2023-01-17 20:45:33 [post_content_filtered] => [post_parent] => 0 [guid] => https://www.quorum.us/?post_type=resources&p=6475 [menu_order] => 0 [post_type] => resources [post_mime_type] => [comment_count] => 0 [filter] => raw ) [queried_object_id] => 6475 [request] => SELECT wp_posts.* FROM wp_posts WHERE 1=1 AND wp_posts.post_name = 'who-are-the-longest-serving-members-of-congress' AND wp_posts.post_type = 'resources' ORDER BY wp_posts.post_date DESC [posts] => Array ( [0] => WP_Post Object ( [ID] => 6475 [post_author] => 23 [post_date] => 2022-01-17 22:30:01 [post_date_gmt] => 2022-01-17 22:30:01 [post_content] => Congressional term limits have recently gotten the spotlight in campaign promises. “Drain the swamp,” and calls for “new blood” in Congress are popular refrains we’ve heard on the campaign trails. A 2018 survey showed 82 percent of Americans supported implementing term limits for members of Congress. If term limits were passed in Congress, which members of Congress would no longer be allowed to serve? We put together a list of the longest-serving members of Congress as well as historical record holders for longest tenure in office. The members of Congress included in this blog have served for at least 36 years in the House, Senate, or a combination of both. In matters where there was a tie for the amount of time served in Congress, members were sorted first by uninterrupted service, chronological order, senators over representatives, and Senate and House seniority. To provide a comparison to current members of Congress’s tenure length, we also included former members of Congress that hold records for the longest service.While there have been efforts made by both former President Trump and others in the past to limit the number of terms senators can serve, there are currently no term limits for Congress. Proposed term limits have been proposed to limit service to two consecutive terms, totaling 12 years of service consecutively. These measures, however, have never been enacted into law.The most recent proposed term limit legislation was introduced in the House by Rep. Tim Burchett (R-TN-02) in November 2021, which would limit incoming members of Congress to serve a maximum of three two-year terms consecutively. So far, this joint resolution has garnered 79 cosponsors, all of whom are Republicans. If this bill had been passed during these representatives’ tenure, their careers may have been cut short.There are 13 active members of Congress that have the longest tenure of service, some of whom have served only in one chamber and some of whom have served both the Senate and House of Representatives. These are members of Congress actively serving that have the longest combined record of service on anyone currently serving in Congress.The average age of members of Congress skews older than the average age of most Americans, with the average American being 20 years younger than their representative in Congress. As of 2015, 19 percent of Americans eligible to run for Congress are 65 or older . With Congress meant to reflect the diversity (including age) of the United States population, it’s notable that 40 percent of current senators and 26 percent of representatives are 65 or older. Less than 5 percent of members of Congress are between the ages of 25 and 40, despite the fact that 33 percent of the over-25 population in the U.S. are under 40 years of age.When meeting with a member of Congress, examining their tenure in office and their age help you develop an understanding of what issues may matter to them based on their legislative history and experience. Understanding these factors can better inform your strategy when interacting with members of Congress to achieve your policy goals. A member of Congress that has served for more than 40 years may have immense institutional knowledge but may require more thorough education on your issues depending on their policy areas of expertise. However, with a longer tenure comes a more clear record of how they may react to your issues. Say you’re planning to meet with a representative who has been in office for more than 40 years. Before your meeting, do some research into their legislative and professional experience to better plan your messaging strategy— what legislation have they sponsored in the past? Which committees have they sat on? What was their profession before assuming office? How do they talk about your issues on social media? Use this knowledge base and historical information to guide your conversation to meet members of Congress where they are in their decision-making and education process. [post_title] => Who Are the Longest Serving Members of Congress? [post_excerpt] => Members of Congress often fill many positions during their service, which leads to longer tenures that go beyond the term limits due to position changes. [post_status] => publish [comment_status] => closed [ping_status] => closed [post_password] => [post_name] => who-are-the-longest-serving-members-of-congress [to_ping] => [pinged] => [post_modified] => 2023-01-17 20:45:33 [post_modified_gmt] => 2023-01-17 20:45:33 [post_content_filtered] => [post_parent] => 0 [guid] => https://www.quorum.us/?post_type=resources&p=6475 [menu_order] => 0 [post_type] => resources [post_mime_type] => [comment_count] => 0 [filter] => raw ) ) [post_count] => 1 [current_post] => -1 [in_the_loop] => [post] => WP_Post Object ( [ID] => 6475 [post_author] => 23 [post_date] => 2022-01-17 22:30:01 [post_date_gmt] => 2022-01-17 22:30:01 [post_content] => Congressional term limits have recently gotten the spotlight in campaign promises. “Drain the swamp,” and calls for “new blood” in Congress are popular refrains we’ve heard on the campaign trails. A 2018 survey showed 82 percent of Americans supported implementing term limits for members of Congress. If term limits were passed in Congress, which members of Congress would no longer be allowed to serve? We put together a list of the longest-serving members of Congress as well as historical record holders for longest tenure in office. The members of Congress included in this blog have served for at least 36 years in the House, Senate, or a combination of both. In matters where there was a tie for the amount of time served in Congress, members were sorted first by uninterrupted service, chronological order, senators over representatives, and Senate and House seniority. To provide a comparison to current members of Congress’s tenure length, we also included former members of Congress that hold records for the longest service.While there have been efforts made by both former President Trump and others in the past to limit the number of terms senators can serve, there are currently no term limits for Congress. Proposed term limits have been proposed to limit service to two consecutive terms, totaling 12 years of service consecutively. These measures, however, have never been enacted into law.The most recent proposed term limit legislation was introduced in the House by Rep. Tim Burchett (R-TN-02) in November 2021, which would limit incoming members of Congress to serve a maximum of three two-year terms consecutively. So far, this joint resolution has garnered 79 cosponsors, all of whom are Republicans. If this bill had been passed during these representatives’ tenure, their careers may have been cut short.There are 13 active members of Congress that have the longest tenure of service, some of whom have served only in one chamber and some of whom have served both the Senate and House of Representatives. These are members of Congress actively serving that have the longest combined record of service on anyone currently serving in Congress.The average age of members of Congress skews older than the average age of most Americans, with the average American being 20 years younger than their representative in Congress. As of 2015, 19 percent of Americans eligible to run for Congress are 65 or older . With Congress meant to reflect the diversity (including age) of the United States population, it’s notable that 40 percent of current senators and 26 percent of representatives are 65 or older. Less than 5 percent of members of Congress are between the ages of 25 and 40, despite the fact that 33 percent of the over-25 population in the U.S. are under 40 years of age.When meeting with a member of Congress, examining their tenure in office and their age help you develop an understanding of what issues may matter to them based on their legislative history and experience. Understanding these factors can better inform your strategy when interacting with members of Congress to achieve your policy goals. A member of Congress that has served for more than 40 years may have immense institutional knowledge but may require more thorough education on your issues depending on their policy areas of expertise. However, with a longer tenure comes a more clear record of how they may react to your issues. Say you’re planning to meet with a representative who has been in office for more than 40 years. Before your meeting, do some research into their legislative and professional experience to better plan your messaging strategy— what legislation have they sponsored in the past? Which committees have they sat on? What was their profession before assuming office? How do they talk about your issues on social media? Use this knowledge base and historical information to guide your conversation to meet members of Congress where they are in their decision-making and education process. [post_title] => Who Are the Longest Serving Members of Congress? [post_excerpt] => Members of Congress often fill many positions during their service, which leads to longer tenures that go beyond the term limits due to position changes. [post_status] => publish [comment_status] => closed [ping_status] => closed [post_password] => [post_name] => who-are-the-longest-serving-members-of-congress [to_ping] => [pinged] => [post_modified] => 2023-01-17 20:45:33 [post_modified_gmt] => 2023-01-17 20:45:33 [post_content_filtered] => [post_parent] => 0 [guid] => https://www.quorum.us/?post_type=resources&p=6475 [menu_order] => 0 [post_type] => resources [post_mime_type] => [comment_count] => 0 [filter] => raw ) [comment_count] => 0 [current_comment] => -1 [found_posts] => 1 [max_num_pages] => 0 [max_num_comment_pages] => 0 [is_single] => 1 [is_preview] => [is_page] => [is_archive] => [is_date] => [is_year] => [is_month] => [is_day] => [is_time] => [is_author] => [is_category] => [is_tag] => [is_tax] => [is_search] => [is_feed] => [is_comment_feed] => [is_trackback] => [is_home] => [is_privacy_policy] => [is_404] => [is_embed] => [is_paged] => [is_admin] => [is_attachment] => [is_singular] => 1 [is_robots] => [is_favicon] => [is_posts_page] => [is_post_type_archive] => [query_vars_hash:WP_Query:private] => e6c5dcd5a5982b443a2c6665aa11234f [query_vars_changed:WP_Query:private] => [thumbnails_cached] => [allow_query_attachment_by_filename:protected] => [stopwords:WP_Query:private] => [compat_fields:WP_Query:private] => Array ( [0] => query_vars_hash [1] => query_vars_changed ) [compat_methods:WP_Query:private] => Array ( [0] => init_query_flags [1] => parse_tax_query ) )"}, {"url": "https://time.com/3398873/10-shortest-stints-in-the-oval-office/", "page_content": "When presidential hopefuls envision their time in office, it’s almost certain that none dream of anything less than a four year stint. Most probably aspire to eight. But a surprisingly high 23% of all U.S. presidents—10 out of our 43 commanders in chief—never made it through a single full term.\n\nSo why have so many of our nation’s chief executives called the White House home for less than four years? To find out, see the list compiled by research engine FindTheBest below.\n\n10. John Tyler\n\nIn office 3.92 years\n\n1841-1845\n\nJohn Tyler came the closest to completing four years in office of all 10 presidents on the list above. He was also the first president to reach the White House without being elected to office, assuming the title upon President Harrison’s death in 1841. Although he started running for reelection in the 1844 campaign, he withdrew his candidacy in August due to insufficient support from the Whig party.\n\n9. Andrew Johnson\n\nIn office 3.86 years\n\n1865-1869\n\nAndrew Johnson ascended to the presidency after President Lincoln’s assassination in 1865. Johnson wanted a quick reconciliation with the South in post-Civil War America, so he didn’t give protection to former slaves, and was impeached by the House of Representatives in 1868 as a result. He was acquitted by the Senate by one vote, and remained in office to see his term through, but had lost the support he needed to run for reelection in 1870.\n\n8. Chester A. Arthur\n\nIn office 3.86 years\n\n1881-1885\n\nChester A. Arthur became the fourth vice president to attain the presidency through the death of a predecessor—in this case, James A. Garfield. Arthur chose not to run for reelection, and returned to practicing law instead. Almost a year after his presidency ended, however, he fell ill and died.\n\n7. John F. Kennedy\n\nIn office 2.83 years\n\n1961-1963\n\nPerhaps one of the most well-known and beloved presidents, John F. Kennedy was assassinated by Lee Harvey Oswald in 1963. Oswald was arrested on the same day of the assassination, but he was shot and killed by a man named Jack Ruby two days later. While the FBI and the Warren Commission investigation concluded that Oswald had acted alone, the exact details of what happened are still a mystery, and many conspiracy theories abound.\n\n6. Millard Fillmore\n\nIn office 2.67 years\n\n1850-1853\n\nMillard Fillmore was the last Whig president, and took office after the death of President Taylor in 1850. Unlike the other vice presidents on this list who did not seek reelection, Fillmore threw his hat in the ring in 1852, but lost the Whig nomination to his secretary of state, Daniel Webster. He also ran on the American Party ticket in 1856, but came in third place.\n\n5. Warren G. Harding\n\nIn office 2.42 years\n\n1921-1923\n\nWarren G. Harding campaigned on the promise of a “return to normalcy” after the First World War. He’s most well-known for the Teapot Dome Scandal, but in recent years has been viewed more positively as a moderate politician who passed the first federal child welfare program and endorsed African-American civil rights. He intended to run for reelection in 1924, but passed away for unknown reasons in 1923. The most likely reason for his death is heart failure, but some have speculated that he was poisoned or committed suicide.\n\n4. Gerald Ford\n\nIn office 2.42 years\n\n1974-1977\n\nGerald Ford is the only person to rise to both the presidency and the vice presidency without being elected. He was appointed to the vice presidency when Spiro Agnew resigned in the face of extortion, bribery, and conspiracy charges, and was elevated to the presidency upon Nixon’s resignation in 1974. Ford ran for reelection, defeating Reagan for the Republican nomination, but lost to Jimmy Carter in the presidential election.\n\n3. Zachary Taylor\n\nIn office 1.33 years\n\n1849-1850\n\nZachary Taylor rose to stardom when he led (and won) several battles in the Mexican-American War, helping America keep control over the annexed territory of Texas. Although he had little interest in politics, he was persuaded to leverage his popularity and run for the presidency in 1849. Taylor won the election, but died of a stomach related illness shortly into his term.\n\n2. James A. Garfield\n\nIn office .54 years\n\n1881-1881\n\nJames A. Garfield was elected in 1881, but only served for a few months before he was shot by outraged political office seeker Charles J. Guiteau. Although Garfield was shot in June, he passed away (officially leaving office) 80 days later in September 1881. During his short time as president, Garfield appointed a justice to the U.S. Supreme Court and proposed a civil service reform act that was eventually passed into law by his successor, Chester A. Arthur.\n\n1. William Henry Harrison\n\nIn office .08 years\n\n1841-1841\n\nWilliam Henry Harrison died of pneumonia 32 days into his term, claiming the title for shortest presidency by a longshot. It had generally been believed that Harrison caught a cold that lead to pneumonia during his inauguration, where he delivered the longest address in American history, in stormy weather without a coat or gloves. But a 2014 analysis shows that the president actually died of typhoid, and likely contracted it in a marsh close to the White House.\n\nFindTheBest is a research website that’s collected all the data on U.S.. presidents, and put it all in one place so you don’t have to go searching for it. Join FindTheBest to get all the information on presidents, Congress members, and thousands of other topics.\n\nContact us at letters@time.com."}, {"url": "https://www.thecrimson.com/article/2013/5/27/teddy_boy_senate_1962/", "page_content": "On the morning of Wednesday, November 7, 1962, one might have expected the Editorial Board of The Harvard Crimson to strike a celebratory tone. It did not. The night before, Edward M. “Ted” Kennedy ‘54-’56 had been elected to the U.S. Senate, and though it had supported the ascension of President John F. Kennedy ‘40, the Editorial Board was not at all happy to see youngest Kennedy brother bound for Capitol Hill.\n\nAccusing Kennedy of using his name and wealth to get elected, doing a disservice to voters by not engaging in meaningful debate with his opponents, and being generally unworthy of his new seat, The Crimson was harsh on November 7. “It is with the severest pessimism that we now regard [Ted Kennedy’s] ascendancy,” the board concluded.\n\nThough Kennedy would eventually earn respect and support on campus—The Crimson endorsed Kennedy for reelection in 1964—sentiment on campus supported fellow Democrat Edward J. McCormack in the primary and Republican opponent George Cabot Lodge ’50 in the special election, viewing Kennedy as unqualified and riding the coattails of his presidential brother.\n\nA FRUSTRATED CAMPUS\n\nKennedy in 1962 was seeking the same U.S. Senate seat his brother had held from 1953 until 1960. Running on his brother’s platform, Ted also used John’s original campaign slogan: “He Can Do More for Massachusetts.”\n\nBut while the elder Kennedy filled White House offices with Harvard professors, administrators, and graduates—a community that had been enormously supportive of his presidential bid—the younger Kennedy struggled to find support on the campus that both brothers had called home.\n\nAccording to many students who attended Harvard in 1962, Ted was widely perceived as a man looking to inherit, rather than earn, his place in the Senate. Though Kennedy won the seat in November’s special election with 55 percent of the vote, he came in a distant third in an October poll of Harvard and Rafcliffe students with only 36 percent.\n\n“Teddy was seen as an oafish younger brother with no credentials trading totally on his brother’s success,” Steven V. Roberts ’63, a former Crimson news editor who contributed to The Crimson’s coverage of Kennedy’s senate campaign, wrote in an email.\n\nKennedy’s reputation on campus as ill-credentialed was not helped by the emergence of information about his academic career at the College.\n\nSixty years before about 70 students were forced to withdraw from the College for cheating on a take-home exam in Government 1310: “Intro to Congress,” the future Senator Kennedy was asked to leave campus for cheating on a Spanish exam. Kennedy had paid the roommate of a fellow football player to take a Spanish exam under his name. Minutes after the exam ended, Kennedy received a call from the College informing him he would be suspended immediately. After spending two years in the military, Ted returned to the school and graduated in 1956—six years after he took up residence in Wigglesworth in the fall of 1950.\n\nAdvertisement\n\nWhen he launched his senate campaign in early 1962, Kennedy sought to keep the cheating issue under wraps.\n\nStill, the story gained traction in the media after The Boston Globe broke it on March 30. The Crimson Review, a precursor to Fifteen Minutes magazine, featured the scandal prominently in a profile that ran shortly before election day.\n\nBut the cheating incident was not the only factor behind the budding senator’s negative reception at Harvard.\n\n“I remember hearing about it, but I can’t fairly say how prevalent that was,” said Todd A. Gitlin ’63, former president of Tocsin, a campus group seeking to promote a more liberal foreign policy and to ban the atomic weapon.\n\nInstead, Gitlin said, rejection of Kennedy grew along with discontent with his brother’s actions as president, particularly his aggressive diplomacy. Highlights of the elder Kennedy’s early foreign policy included a futile invasion of Cuba in 1961 and a barely-averted nuclear crisis in October of 1962.\n\nBoth events hurt the president’s support at Harvard. Gitlin said that Kennedy “had lost his glow” in the eyes of campus Democrats.\n\nAs frustration grew, so did left-wing groups like Tocsin, which had been promoting more liberal foreign policy since Kennedy’s inauguration and began to organize protests and demonstrations, according to Gitlin.\n\n“There were many protest rallies,” said Gitlin of the campus after the events in Cuba. “We filled Emerson D with 300 people...we could do that very quickly.”\n\nThus, at least within the gates of Harvard Yard, Ted was hitching his wagon to a president whose popularity was waning. As the September 18 primary approached, major segments of the Harvard community declared support for McCormack, Kennedy’s opponent and the state’s attorney general.\n\nIn McCormack’s camp was a group of professors, led by Mark DeWolfe Howe ’28 of Harvard Law School. Howe’s group was soon joined by the Young Democratic Club of Harvard College, despite the fact that the Young Dems were, according to students and the club’s actions, a group of relatively moderate Democrats.\n\nAdvertisement\n\n“Many of us thought that Ted Kennedy had no qualifications for the office and no relevant experience,” remembered Henry F. Greene ’63, former president of the Young Democrats, adding that the group was impressed with McCormack’s more progressive platform. Echoing his peers, Greene added that Kennedy “was a viable candidate only by virtue of being the president’s brother.”\n\nA MAN AND HIS LEGACY\n\nWhile on November 7 the Editorial Board of The Crimson lamented that Kennedy would not be a “thoughtful, independent voice in the senate” or a “representative who comprehends the magnitude of civil rights, civil liberties, and unemployment problems facing America,” Ted would become the fourth-longest serving senator and an icon of progressivism.\n\nHe provided influential support for the Civil Rights Act of 1964—which had been proposed by his brother, the President, before he had been assassinated—and, among other things, went on to be the Senate’s champion of education and health care reform.\n\nIn 1964, The Crimson Editorial Board endorsed Kennedy for reelection. Former opponents of Ted’s senate campaign acknowledged that they later supported his tenure.\n\n“For what it’s worth, I have increasingly thought over the years that few events in American campus politics have ever so dramatically proven how wrong a campus politician can be in thinking he or she knows much about our politics,” Greene, the former president of the Young Dems, wrote in an email. “I have come to very much regret my opposition to Ted Kennedy’s election in 1962, just as I have simultaneously come to think he was one of the greatest Senators in our history.”\n\n—Staff writer Matthew Q. Clarida can be reached at clarida@college.harvard.edu. Follow him on Twitter @MattClarida."}, {"url": "https://smartpolitics.lib.umn.edu/2022/02/27/jim-inhofes-us-senate-tenure-by-the-numbers/", "page_content": "By Dr. Eric Ostermeier | |\n\nInhofe is one of six current members of the chamber to have notched record-setting service from their state\n\nOklahoma Republican U.S. Senator Jim Inhofe announced this week he was cutting his sixth term short and resigning at the end of the 117th Congress this January.\n\nInhofe is already the longest-serving Oklahoma U.S. Senator in history – at 27 years, 3 months, and 11 days through February 27th. [That number would reach 28 years, 1 month, 18 days on January 3, 2023].\n\nOnly two other Oklahomans have eclipsed 20 years representing their state in the chamber: Republican Don Nickles (1981-2005; 24 years) and Democrat Elmer Thomas (1927-1951; 23 years, 9 months, 30 days).\n\nTwelve of the state’s 18 senators have served more than one term with the average tenure of just under 13 years.\n\nInhofe is also by far the oldest Oklahoma U.S. Senator in history at 87 years, 3 months, and 10 days through Sunday. He would reach 88 years, 1 month, and 17 days of age on his intended last day on the job.\n\nJust two predecessors served into their 70s: Republican Edward Moore (1943-1949; 77 years, 1 month, 15 days upon his exit from the chamber) and the aforementioned Democrat Elmer Thomas (74 years, 3 months, 26 days).\n\nSenator Inhofe is currently one of six U.S. Senators who has recorded the longest tenure in the chamber from his or her state.\n\nThe other five are Vermont Democrat Patrick Leahy (47 years, 1 month, 24 days through Sunday), Iowa Republican Chuck Grassley (41 years, 1 month, 24 days). Kentucky Republican Mitch McConnell (37 years, 1 month, 24 days), Alabama Republican Richard Shelby (35 years, 1 month, 24 days), and California Democrat Dianne Feinstein (29 years, 3 months, 23 days).\n\nMeanwhile, New York Democrat Chuck Schumer (23 years, 1 month, 24 days) will pass up Jacob Javits (23 years, 11 months, 25 days) in December and tie current Empire State record holder Democrat Daniel Patrick Moyhnihan (24 years) on January 3rd.\n\nFollow Smart Politics on Twitter."}, {"url": "https://mympsc.com/Share.aspx?Articleid=ae0f93bb-1423-4f8f-8ef9-6841073e0c14", "page_content": "Who had the longest tenure as President of USA?\n\nmympsc.com\n\nUSA GK MCQ\n\nUSA GK MCQ\n\n2015\n\np. 1 - 1 [Multi Choice Question]\n\nDescription: This is a Most important question of gk exam. Question is : Who had the longest tenure as President of USA? , Options is : 1. a) John F. Kennedy, 2. b) Franklin D. Roosevelt, 3.c) George Washington, 4. d) James Carter, 5. NULL\n\nPublisher: mympsc.com\n\nSource: Online General Knolwedge\n\n\n\nWho had the longest tenure as President of USA?\n\nThis is a Most important question of gk exam. Question is : Who had the longest tenure as President of USA? , Options is : 1. a) John F. Kennedy, 2. b) Franklin D. Roosevelt, 3.c) George Washington, 4. d) James Carter, 5. NULL\n\nCorrect Answer of this Question is :\n\n2"}, {"url": "https://www.britannica.com/biography/Ted-Kennedy-American-senator", "page_content": "Ted Kennedy was awarded the Presidential Medal of Freedom on August 15, 2009. The award was accepted on his behalf by his children just 10 days before his death at his home.\n\nTed Kennedy was a leading advocate in the Senate for several causes, including voting rights, fair housing, consumer protection, and national health insurance. He was recognized for his willingness to cooperate with Republicans to pass legislation, such as the No Child Left Behind Act (2001) and other initiatives of the President George W. Bush administration.\n\nOn the night of July 18, 1969, Ted Kennedy accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident.\n\nTed Kennedy, in full Edward Moore Kennedy, byname Lion of the Senate, (born February 22, 1932, Boston, Massachusetts, U.S.—died August 25, 2009, Hyannis Port, Massachusetts), U.S. senator (1962–2009), a prominent figure in the Democratic Party and in liberal politics from the 1960s who became among the most influential and respected members of the Senate during his long tenure in office. He was the youngest child of Rose and Joseph Kennedy and the last surviving brother of Pres. John F. Kennedy. His other brother, Robert Kennedy, was also a U.S. Senator, and his sister, Eunice, founded (1968) the Special Olympics.\n\nTed Kennedy graduated from Harvard University in 1956. He then studied at the International Law School (The Hague) and received a law degree from the University of Virginia (1959). He campaigned for his brother John in the 1960 presidential race and in 1962 was elected to the president’s former U.S. Senate seat representing Massachusetts. The following year John was assassinated in Dallas, Texas. Although unable to campaign actively for reelection (1964) for a full term because of an injury, Kennedy was swept back into office by a landslide vote. In 1968 he lent his support to his brother Robert’s campaign for the Democratic presidential nomination. However, Robert was assassinated in June of that year.\n\nEarly in 1969 Kennedy was elected majority whip in the U.S. Senate, and he became an early front-runner for the next Democratic presidential nomination. Then, on the night of July 18, 1969, he accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident. He was reelected to the Senate in 1970 but announced that he would not seek the presidency in 1972.\n\nKennedy won reelection to a third full term as senator in 1976. He was a serious contender for the 1980 Democratic presidential nomination but withdrew from the race during the convention. He won a fourth term in 1982 and was again reelected to the Senate in 1988, 1994, 2000, and 2006.\n\nKennedy continued to be a prominent spokesman for the policies that had come to be associated with his family name—i.e., support for social welfare legislation and active participation in world affairs. He became a leading advocate in the Senate for many liberal causes, including voting rights, fair housing, consumer protection, and national health insurance. At the same time, he was recognized for his willingness to cooperate with Republicans in the Senate to advance important legislation, such as the No Child Left Behind Act (2001) and other initiatives of the administration of Pres. George W. Bush. In 2008, after being hospitalized for a seizure, Kennedy was diagnosed with a malignant brain tumour. In March 2009 he was made an honorary Knight of the British Empire, and on August 15 he was awarded the Presidential Medal of Freedom (it was accepted on his behalf by his children); 10 days later he died at his home. In his eulogy for Kennedy, Pres. Barack Obama called him the “soul of the Democratic Party” and the “greatest legislator of our time.” Kennedy’s autobiography, True Compass, was published in September 2009."}, {"url": "https://www.britannica.com/event/United-States-presidential-election-of-1960", "page_content": "United States presidential election of 1960 , American presidential election held on November 8, 1960, in which Democrat John F. Kennedy narrowly defeated Republican Vice Pres. Richard M. Nixon . Kennedy thus became the first Roman Catholic and the youngest person ever elected president . Kennedy was also the first president born in the 20th century.\n\nKennedy and Humphrey were the only major Democratic contenders to enter presidential primaries in 1960. Their first significant primary was in Wisconsin in April. Both Humphrey and Kennedy campaigned energetically in that state, which borders Humphrey’s home state of Minnesota. Kennedy won easily and was especially strong in Milwaukee and other areas where there were large numbers of Catholic voters. A month later Kennedy all but eliminated Humphrey from consideration by defeating him in West Virginia, a heavily Protestant state, proving that he could win in a state with few Catholics.\n\nThroughout the primaries and the fall campaign, Kennedy’s religion was a dominant issue. He would become only the second Roman Catholic ever to be nominated for president by a major party (the first was Democratic Gov. Al Smith of New York, who lost to Herbert Hoover in 1928 ). Some Protestant ministers and prominent laymen expressed fears that a Catholic president would be under the domination of the pope and would not always be free to act in the best interests of the country, charges which Kennedy denied.\n\nOn the Republican side there was little doubt that their nominee would be Nixon. Gov. Nelson A. Rockefeller of New York , who had indicated late in 1959 that he might seek the Republican nomination , withdrew in late December in the face of almost total opposition by Republican Party leaders. Nixon entered some of the primaries, but only to demonstrate his vote-getting abilities. He never faced any serious opposition.\n\nThe Republican platform promised to continue and to improve upon the programs of the Eisenhower administration. Although there were some signs of dissatisfaction with the administration because of its failure to pursue aggressive action in such as areas as military programs, aid to depressed areas, and space exploration , it was generally agreed that Eisenhower’s prestige was as high as it had ever been and that the president’s support was a distinct advantage to Nixon.\n\nKennedy went to the Democratic National Convention in Los Angeles , held July 11–15, 1960, as the front-runner for the nomination, with some 600 delegates of the 761 needed for nomination secured. Johnson, however, hoped to wrest the nomination from Kennedy. Nevertheless, Kennedy won the nomination on the first ballot, with 806 votes. Kennedy then surprised most of his supporters by picking Johnson as his vice presidential running mate. The selection was generally interpreted as a move to hold the South, where opposition to Kennedy’s religion was strong and where the traditional Democratic leanings of the voters were changing. The party platform adopted at Los Angeles promised to expand the country’s defense and foreign aid programs. It also committed the Democratic Party, controversially, to civil rights . In his acceptance speech, Kennedy said the American people needed to be prepared to sacrifice in the years ahead. There were, he said, stimulating “new frontiers” to be crossed by the United States .\n\nThe general election campaign\n\nPresidential posturing began in earnest when the U.S. Congress reconvened in August, after the political conventions had been concluded. Both nominees were principal figures in the session, which was held in a politically charged atmosphere. As vice president, Nixon presided over the Senate. He also was a key figure in determining Republican strategy in a Congress that was controlled by the Democrats. As a senator from Massachusetts and as an author of the minimum-wage bill that was one of the principal measures to be acted upon during the session, Kennedy had an important stake in seeing to it that the achievements of the session were substantial.\n\nThe legislative achievements of Congress were mixed, but, by the time the traditional presidential campaign season kicked off on Labor Day in September, Nixon’s and Kennedy’s responsibilities in Congress were all but forgotten. At the time, the presidential campaign was the longest and the most intensive ever held in the United States. Crisscrossing the country on planes, trains, automobiles, and buses, Nixon and Kennedy were speaking, shaking hands, and conferring with politicians from coast to coast for most of September, for all of October, and for the seven days of November preceding the election.\n\nKennedy tackled the election issue of his Catholicism in a speech to a group of Protestant ministers in Houston. In that speech, on September 12, he declared:\n\nI believe in an America that is officially neither Catholic, Protestant nor Jewish—where no public official either requests or accepts instructions on public policy from the Pope, the National Council of Churches or any other ecclesiastical source—where no religious body seeks to impose its will directly or indirectly upon the general populace or the public acts of its officials—and where religious liberty is so indivisible that an act against one church is treated as an act against all.\n\nAn unprecedented series of four television debates between the two nominees constituted the highlight of the campaign. A provision of the Federal Communications Act had been suspended by Congress earlier in the year to permit the networks to broadcast the debates without having to provide equal time for candidates of minor parties. Although the debates were sometimes compared to the historic debates between Abraham Lincoln and Stephen A. Douglas (see also Lincoln-Douglas debates), they were more in the nature of joint press conferences, with reporters asking questions. They did, however, provide voters with an opportunity to compare the two candidates. Although Nixon showed a mastery of the issues, it is generally agreed that Kennedy, with his relaxed and self-confident manner, as well as his good looks (in contrast to Nixon’s “five o’clock shadow”), benefited the most from the exchanges. An estimated 85–120 million Americans watched one or more of the debates.\n\nKennedy and Nixon both used set speeches in their public appearances. Kennedy said that the United States was falling behind the Soviet Union in the race for world supremacy and that the United States must “do better.” He pointed to the regime of Fidel Castro in Cuba—“just ten minutes by jet from the United States.” Kennedy also stressed the need for programs to deal with unemployment in chronically depressed areas and for more rapid U.S. economic growth. Nixon, the first presidential nominee to campaign in every state, emphasized that he would carry on the basic policies of the Eisenhower administration, but he also indicated that he would improve upon them in such areas as welfare programs, foreign aid, and defense. Eisenhower, who went on a “nonpolitical” inspection tour of the country in mid-October, took an active part in the last week of the campaign, when Eisenhower and Nixon appeared together in New York City. Until then, however, the president had seemed to stay in the background.\n\nWhen voters went to cast their ballots on November 7, the contest was close. In the electoral college, Kennedy captured 303 votes (34 more than was required to win), while Nixon won 219. The 14 unpledged electors in Alabama and Mississippi and 1 pledged elector in Oklahoma cast their votes for Sen. Harry F. Byrd, a Democrat from Virginia. Kennedy eked out a narrow victory in the popular vote, defeating Nixon by just under 117,000 votes. Overall, Kennedy won 49.7 percent to Nixon’s 49.5 percent. Kennedy thus became the third person elected president in the 20th century without winning a majority of the popular vote (joining Woodrow Wilson in 1912 and Harry S. Truman in 1948; in 1968 Nixon would become the fourth person in the 20th century to win the presidency without a majority). The popular vote was the closest since 1884, when Democrat Grover Cleveland defeated Republican James G. Blaine by only about 24,000 votes.\n\nCiting voting irregularities in Illinois and Texas, many observers questioned whether Kennedy had legally won those states, and some prominent Republicans—including Eisenhower—even urged Nixon to contest the results. He chose not to, however, declaring:\n\nI could think of no worse example for nations abroad, who for the first time were trying to put free electoral procedures into effect, than that of the United States wrangling over the results of our presidential election, and even suggesting that the presidency itself could be stolen by thievery at the ballot box.\n\nNixon’s supporters and critics alike, both then and later, praised him for the dignity and unselfishness with which he handled defeat and the suspicion that vote fraud had cost him the presidency.\n\nFor the results of the previous election, see United States presidential election of 1956. For the results of the subsequent election, see United States presidential election of 1964."}, {"url": "https://www.history.com/topics/us-government/ted-kennedy", "page_content": "Edward “Ted” Kennedy (1932-2009), the youngest brother of President John Kennedy (1917-1963), was a U.S. senator from Massachusetts from 1962 to 2009, making him one of the longest-serving senators in American history. Kennedy entered the Senate after winning a 1962 special election to fill the seat vacated by his brother John when he became president. During his career on Capitol Hill, Ted Kennedy was a spokesman for liberal causes, including civil rights, health care and immigration. A leader of the Democratic Party, he was known for his ability to work with those on both sides of the political aisle. In 1980, Kennedy, whose reputation was tarnished by a 1969 car accident, made a failed bid for the Democratic presidential nomination. Dubbed the “liberal lion of the Senate,” he died of cancer at age 77 and was buried at Arlington National Cemetery.\n\nTed Kennedy’s Childhood and Education\n\nEdward Moore Kennedy was born in Boston on February 22, 1932, the youngest of nine children of Joseph P. Kennedy Sr. (1888-1969), a wealthy financier who served as the first chairman of the Securities and Exchange Commission and later as ambassador to Great Britain, and Rose Fitzgerald Kennedy (1890-1995), the daughter of a Boston politician.\n\nDid you know? In 2011, Ted Kennedy’s son Patrick, an eight-term U.S. congressman from Rhode Island, resigned from politics. His exit marked the first time since 1947–when John Kennedy became a U.S. congressman from Massachusetts–that no member of the Kennedy family held elective office in Washington, D.C.\n\nAs a child, Kennedy moved between his family’s homes in Massachusetts, New York, Palm Beach and London, and attended 10 schools before graduating from Milton Academy in Massachusetts in 1950. He went on to attend Harvard University, the alma mater of his father and three older brothers. During his freshman year, he was expelled after a classmate took a Spanish exam in his place. Kennedy then enlisted in the U.S. Army, serving from 1951 to 1953, mostly in Europe. Afterward, he re-enrolled in Harvard, where he became a more serious student and played on the football team.\n\nAfter graduating in 1956, he attended the University of Virginia School of Law. While still a law student, he managed his brother John’s successful 1958 reelection campaign to the U.S. Senate, where he represented Massachusetts. The following year, Kennedy earned his law degree and was admitted to the Massachusetts bar.\n\nTed Kennedy’s Election to the U.S. Senate\n\nWhen John Kennedy made his 1960 run for the White House, Ted Kennedy campaigned for him in the Western states. A licensed pilot, he barnstormed around the region, meeting with delegates and trying bronco riding and ski jumping as a way to connect with people.\n\nIn November 1960, John Kennedy was elected America’s 35th president. The following month, a Kennedy family friend, Benjamin Smith (1916-1991), was appointed to fill the president-elect’s vacated Senate seat until a special election was held. On November 6, 1962, Ted Kennedy, who earlier that year had turned 30 (the minimum age requirement for a U.S. senator), won the special election in Massachusetts to serve out the remainder of his brother’s Senate term, ending in January 1965. Massachusetts voters reelected Kennedy to the seat eight more times, in 1964, 1970, 1976, 1982, 1988, 1994, 2000 and 2006.\n\nWith John Kennedy in the White House, Ted Kennedy in the Senate and their brother Robert (1925-1968) serving as the U.S. attorney general from 1961 to 1964 and as a U.S. senator from New York from 1965 to 1968, the glamorous, wealthy, Irish-Catholic Kennedys were often referred to as an American political dynasty.\n\nTed Kennedy’s Marriages and Family\n\nIn 1958 Ted Kennedy married Joan Bennett (1936-), who he met through his sister Jean (1928-); both women had attended Manhattanville College in New York. The couple had three children—Kara (1960-), Edward Jr. (1961-) and Patrick (1967-)—before divorcing in 1982. In 1992, Kennedy married Victoria Reggie (1954-), a Washington attorney with two children. Kennedy often spent time with his family sailing, which he described as his favorite pastime.\n\nTragedy Strikes the Kennedys\n\nOn November 22, 1963, tragedy struck the Kennedy family and the nation when 46-year-old President John Kennedy was assassinated in Dallas, Texas. He was the third Kennedy sibling to perish. The oldest child, Joseph Kennedy Jr. (1915-1944), a Navy pilot, died in World War II, and the second-eldest daughter, Kathleen (1920-1948), was killed in a plane crash in France. In June 1964, Ted Kennedy escaped death when the small plane he was riding in crashed in Massachusetts in bad weather, killing two people and leaving Kennedy with a broken back and other injuries that required a six-month hospital recuperation.\n\nOn June 5, 1968, tragedy struck again when 42-year-old Senator Robert Kennedy, who had just won the Democratic presidential primary in California, was assassinated in Los Angeles.\n\nWith Robert’s death, Ted Kennedy became the family patriarch–his father Joseph had suffered an incapacitating stroke in 1961–and a surrogate father to his two slain brothers’ 13 children.\n\nIncident at Chappaquiddick\n\nOn July 18, 1969, Ted Kennedy was involved in a controversial event that would mar the rest of his career. He accidentally drove his car off a bridge on Massachusetts’ Chappaquiddick Island, killing his passenger, Mary Jo Kopechne (1940-1969), who drowned. Kennedy did not report the incident to the authorities for nearly 10 hours, claiming the delay was due to the fact that he had suffered a concussion and was exhausted from attempting to rescue Kopechne.\n\nThe 37-year-old senator pled guilty to leaving the scene of an accident and received a two-month suspended sentence. However, Kennedy was plagued by questions about his behavior. He later referred to his actions as “inexcusable” and said that Kopechne’s death “haunts me every day of my life.”\n\nTed Kennedy’s Bid for the White House\n\nIn November 1979, Ted Kennedy announced he would run against President Jimmy Carter (1924-) for the 1980 Democratic presidential nomination. Kennedy won primaries in New York, California and eight other states, but his campaign was disorganized and hurt by lingering questions about Chappaquiddick. At the August 1980 Democratic National Convention, he withdrew his bid for the presidency and went on to deliver a fiery speech in which he said, “For me, a few hours ago, this campaign came to an end. For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives, and the dream shall never die.”\n\nKennedy never made another bid for the presidency.\n\nThe Liberal Lion of the Senate\n\nSome historians have called Ted Kennedy one of the most effective legislators in the history of the U.S. Senate. During nearly 47 years on Capitol Hill, his office wrote some 2,500 bills, over 300 of which became law. Additionally, over 550 bills that he co-sponsored became law. A skilled orator and gifted storyteller, Kennedy was known for his ability to collaborate with Democrats and Republicans alike.\n\nHe successfully fought for legislation concerning education, immigration reform, increases to the federal minimum wage, voting rights, AIDS care, various consumer protections and equal rights for minorities, the disabled, women and gay Americans. In 1972 he was the driving force behind the Women, Infants, and Children (WIC) program, which provides food assistance and access to health services for low-income women and their children, and he was instrumental in the passage of the Americans with Disabilities Act of 1990, which banned workplace discrimination against and required public accommodations for the disabled.\n\nKennedy referred to universal health insurance as “the cause of my life,” and for decades worked to achieve national health reform. Kennedy’s widow Victoria was present when President Barack Obama (1961-) signed historic health care legislation, the Patient Protection and Affordable Care Act, in March 2010.\n\nIn foreign policy matters, Kennedy was an opponent of the Vietnam War and in 2002 voted against authorizing the use of military force in Iraq. He worked for human rights in South America in the 1970s, championed U.S. government sanctions against apartheid-ruled South Africa in the 1980s, and helped broker a peace agreement in Northern Ireland in the late 1990s.\n\nTed Kennedy’s Final Years\n\nIn May 2008, Ted Kennedy was diagnosed with a malignant brain tumor. That August, despite his poor health, he made a rousing speech in his distinct Massachusetts accent at the Democratic National Convention in Denver. In his speech, the senator, who earlier that year had endorsed Barack Obama for president, invoked the legacy of the Kennedy family when he stated, “And this November the torch will be passed again to a new generation of Americans…The work begins anew. The hope rises again. And the dream lives on.”\n\nOn August 25, 2009, the 77-year-old Kennedy succumbed to brain cancer at his home in Hyannis Port, Massachusetts. At his funeral, which was attended by three former U.S. presidents, the late senator was eulogized by President Obama. Kennedy was buried at Virginia’s Arlington National Cemetery, near the graves of his brothers John and Robert. Kennedy’s memoir, “True Compass,” was published posthumously in September 2009."}, {"url": "https://www.britannica.com/biography/John-F-Kennedy/Congressman-and-senator", "page_content": "Congressman and senator\n\nKennedy did not disappoint his family; in fact, he never lost an election. His first opportunity came in 1946, when he ran for Congress. Although still physically weak from his war injuries, he campaigned aggressively, bypassing the Democratic organization in the Massachusetts 11th congressional district and depending instead upon his family, college friends, and fellow navy officers. In the Democratic primary he received nearly double the vote of his nearest opponent; in the November election he overwhelmed the Republican candidate. He was only 29.\n\nKennedy served three terms in the House of Representatives (1947–53) as a bread-and-butter liberal. He advocated better working conditions, more public housing, higher wages, lower prices, cheaper rents, and more Social Security for the aged. In foreign policy he was an early supporter of Cold War policies. He backed the Truman Doctrine and the Marshall Plan but was sharply critical of the Truman administration’s record in Asia. He accused the State Department of trying to force Chiang Kai-shek into a coalition with Mao Zedong. “What our young men had saved,” he told the House on January 25, 1949, “our diplomats and our President have frittered away.”\n\nHis congressional district in Boston was a safe seat, but Kennedy was too ambitious to remain long in the House of Representatives. In 1952 he ran for the U.S. Senate against the popular incumbent, Henry Cabot Lodge, Jr. His mother and sisters Eunice, Patricia, and Jean held “Kennedy teas” across the state. Thousands of volunteers flocked to help, including his 27-year-old brother Robert, who managed the campaign. That fall the Republican presidential candidate, General Dwight D. Eisenhower, carried Massachusetts by 208,000 votes; but Kennedy defeated Lodge by 70,000 votes. Less than a year later, on September 12, 1953, Kennedy enhanced his electoral appeal by marrying Jacqueline Lee Bouvier (Jacqueline Kennedy Onassis). Twelve years younger than Kennedy and from a socially prominent family, the beautiful “Jackie” was the perfect complement to the handsome politician; they made a glamorous couple.\n\nAs a senator, Kennedy quickly won a reputation for responsiveness to requests from constituents, except on certain occasions when the national interest was at stake. In 1954 he was the only New England senator to approve an extension of President Eisenhower’s reciprocal-trade powers, and he vigorously backed the opening of the St. Lawrence Seaway, despite the fact that over a period of 20 years no Massachusetts senator or congressman had ever voted for it.\n\nTo the disappointment of liberal Democrats, Kennedy soft-pedaled the demagogic excesses of Sen. Joseph R. McCarthy of Wisconsin, who in the early 1950s conducted witch-hunting campaigns against government workers accused of being communists. Kennedy’s father liked McCarthy, contributed to his campaign, and even entertained him in the family’s compound at Hyannis Port on Cape Cod in Massachusetts. Kennedy himself disapproved of McCarthy, but, as he once observed, “Half my people in Massachusetts look on McCarthy as a hero.” Yet, on the Senate vote over condemnation of McCarthy’s conduct (1954), Kennedy expected to vote against him. He prepared a speech explaining why, but he was absent on the day of the vote. Later, at a National Press Club Gridiron dinner, costumed reporters sang, “Where were you, John, where were you, John, when the Senate censured Joe?” Actually, John had been in a hospital, in critical condition after back surgery. For six months afterward he lay strapped to a board in his father’s house in Palm Beach, Florida. It was during this period that he worked on Profiles in Courage (1956), an account of eight great American political leaders who had defied popular opinion in matters of conscience, which was awarded a Pulitzer Prize in 1957. Although Kennedy was credited as the book’s author, it was later revealed that his assistant Theodore Sorensen had done much of the research and writing.\n\nBack in the Senate, Kennedy led a fight against a proposal to abolish the electoral college, crusaded for labour reform, and became increasingly committed to civil rights legislation. As a member of the Senate Committee on Foreign Relations in the late 1950s, he advocated extensive foreign aid to the emerging nations in Africa and Asia, and he surprised his colleagues by calling upon France to grant Algerian independence.\n\nDuring these years his political outlook was moving leftward. Possibly because of their father’s dynamic personality, the sons of Joseph Kennedy matured slowly. Gradually John’s stature among Democrats grew, until he had inherited the legions that had once followed Gov. Adlai E. Stevenson of Illinois, the two-time presidential candidate who by appealing to idealism had transformed the Democratic Party and made Kennedy’s rise possible."}]}