{"Harry S. Kennedy was the most senior member of the Senate when he retired in 2009.": [{"url": "https://www.thecrimson.com/article/2020/5/27/commencement-2020-kennedy/", "page_content": "At Harvard, it is not uncommon to hear speculation about who could someday be bound for the White House. When former President John F. Kennedy ’40 arrived at the College in 1936, however, few would have made such a prediction.\n\nBut eighty years later, JFK’s political dynasty is still alive at the school that helped spur it — thanks, in part, to a family-University relationship unlike any other.\n\nHarvard’s relationship with the Kennedys is one that has lasted more than four generations, transcended traditional boundaries, endured turbulence, and ultimately proven mutually prosperous. It has helped create a political dynasty that has produced a United States president, numerous influential members of Congress, and one of the country’s most prominent schools of government.\n\nToday, a new generation of Kennedys maintains the mantle of the family legacy, as well as its relationship with the school that helped to build it.\n\nAs U.S. Representative Joseph P. Kennedy III (D-Mass.) makes an audacious run for the U.S. Senate in Massachusetts, arousing memories of Camelot for many, the Kennedy family political legacy — one that has never lost when on the ballot in the Bay State — is at a crossroads. And with former U.S. ambassador Caroline B. Kennedy ’80’s headline-grabbing departure from the Harvard Institute of Politics Senior Advisory Committee, the family’s involvement with the University, too, stands at an important juncture.\n\n‘THE RULING CLASS’\n\nThe Kennedys are not the first bloodline to have produced many prominent Harvard graduates. But since Joseph P. Kennedy Sr. graduated from the College in 1912, the family and the school have held a unique, mutually beneficial relationship that has had lasting implications on the family’s political pursuits and the University’s growth.\n\nAfter gaining prominence in business and politics, Kennedy Sr. raised his nine children — in particular, the four boys — with exceedingly high expectations.\n\nHis sons — Joseph P. Kennedy Jr. ’38, John F. Kennedy ’40, Robert F. Kennedy ’48, and Edward M. “Ted” Kennedy ’54-’56 — all went on to follow in his footsteps by attending the University.\n\nAdvertisement\n\n“The Kennedys kind of became part of the ruling class at this time,” said Thomas J. Whalen, a professor at Boston University who has studied the family. “But an institution like Harvard allowed them to stay in that… to kind of pass on these connections to their children. That’s how an elite survives.”\n\nBy Camille G. Caldera It was the eldest of the Kennedy clan who many expected to gain political prominence even from a young age. But following his death in a plane crash in World War II, the political legacy was left to his brothers to fulfill. John F. Kennedy, the next oldest of the brothers, entered Harvard with a high school transcript riddled with Cs and Ds. As a freshman living in Weld Hall, Kennedy worked harder to succeed on various Harvard athletic teams than he did at academics: He earned a spot on the swim team, though he left little impression on the coaches. In his sophomore year, after moving into Winthrop House, Kennedy joined the Spee Club, the Hasty Pudding, and The Crimson, where he served as a business editor. JFK’s brothers, Bobby and Ted, both attended Harvard after him. They, too, were exceedingly focused on athletics during their undergraduate years, earning varsity football letters. “Being an athlete was like the other kinds of pressure in their life,” said Larry Tye, a Robert Kennedy biographer. “There was an expectation that they would compete. There was an expectation that the only thing worthy, in terms of the way you competed, was if you won.” “This was Joe Kennedy’s metaphor for what life ought to be like generally,” Tye said. “You had to win things, whether it was competing in a football game or competing in a political campaign.” After graduating Harvard, serving in World War II, and working briefly as a newspaper reporter, JFK went on to run for Congress in 1946 with strong support from his father. He spent six years in the House before being elected to the Senate twice, and made the leap to run for president in 1960. Whalen said Harvard played a crucial role in JFK’s entry into politics. “John Kennedy certainly spent his entire life drawing on those connections,” he said. Advertisement When Kennedy was elected to the White House, he brought Harvard with him. He tapped numerous academics to serve in his administration, including National Security Advisor McGeorge Bundy, Ambassador to India John Kenneth Galbraith, Defense Secretary Robert S. McNamara, and advisor Arthur M. Schlesinger Jr. ’38. “The joke at the time in 1961 was: How do you get to Washington? Well, you go to Harvard Square and turn left,” said former U.S. Representative Barnett “Barney” Frank ’61-’62 (D-Mass.). Harvard became a part of the fabric of Kennedy’s White House. He returned to Cambridge numerous times following his election, had The Crimson delivered to 1600 Pennsylvania Ave., and sometimes listened to Harvard football games on the radio. President John F. Kennedy ‘40 sits at a typewriter with his book “Why England Slept,” the published version of Kennedy’s thesis written in his senior year at Harvard College. By Courtesy of The John F. Kennedy Presidential Library and Museum As president-elect in December 1960, JFK visited Harvard Yard, where he was greeted by thousands of cheering students. “It’s like feeling like you were at the center of where history was unfolding,” said Marshall L. Ganz ’64-’92, a Harvard Kennedy School professor who was a freshman at the College at the time. “And then when so many faculty went off to D.C. — aside from being pissed off that you didn’t get the course that you wanted to get, like with John Kenneth Galbraith — it was the same thing.” “There was kind of this proximity to this generation change and this new generation taking power,” Ganz said. “It was very energizing.” LEAVING A LEGACY On John F. Kennedy’s final trip to Boston in October 1963, prior to attending a Harvard-Columbia football game, he picked out a location on Harvard’s campus near the bend of the Charles River for the Kennedy Presidential Library and Museum. President John F. Kennedy ‘40 motions with his arm towards the proposed site of his future Presidential Library, along the banks of the Charles River in Boston, with Eliot House and Dunster House visible in the horizon. By Courtesy of The John F. Kennedy Presidential Library and Museum Advertisement One month later, Lee Harvey Oswald killed JFK in Dallas, Texas, sending the country — and campus — into a frenzy. Following his death, a group of JFK’s closest allies, including his two brothers, began working on plans to memorialize him, albeit far sooner than they expected. The group settled on the creation of a presidential library that would house a museum and his presidential archives. They also debated proposals to create a memorial of Kennedy that would have an ongoing impact on students. The discussions ultimately led to Harvard’s Graduate School of Public Administration becoming the John F. Kennedy School of Government, and to the founding of the Institute of Politics. The creation of the Kennedy Library — which was originally supposed to be part of a complex designed by architect I.M. Pei that would house the Kennedy School, the IOP, and several academic departments — was hampered by years of controversy and anger among some Cambridge residents. Community members raised concerns over the influx of tourism a museum would bring to the area. “It was a brawl,” said Dan H. Fenn Jr. ’44, the JFK Library’s founding director and a current Kennedy School lecturer. Some residents advocated to keep the archives housed at Harvard but move the museum elsewhere — a proposal Fenn, a former Crimson president, opposed. Eventually, when building the museum and the archive together in Cambridge became unfeasible, the family gave up on housing the memorial in Harvard Square. In 1979, the library opened on Columbia Point in Dorchester, alongside the archives and museum. The IOP, which was also mired in controversy in its early days, became the Kennedy family’s chief point of engagement with the University. Jacqueline L. “Jackie” Kennedy Onassis, JFK’s widow, sat on the Institute’s inaugural Senior Advisory Committee. Advertisement Ted Kennedy, who served in the U.S. Senate from 1962 until his death in 2009, also joined the Senior Advisory Committee shortly after its inception and became its most influential member. Committee members said Ted Kennedy never missed a meeting during his time on the committee, which gathers several times per year. “He was the leading steward of the family,” longtime IOP Advisory Committee member Heather P. Campion said. “He built the Senior Advisory Committee.” Beyond his engagement with the committee, Ted Kennedy also leaned heavily on Harvard affiliates in his policy work as a senator, according to Scott Ferson, who worked for Kennedy in the ’90s. “For his legislative work — and for the work he did on health care, education, justice reform, immigration — he very much relied on the experts at Harvard,” Ferson said. “The staff lists from his entirety in the Senate is littered with Harvard degrees.” The rapid growth of the Kennedy School under former Dean Graham T. Allison Jr. ’62 in the 1970s and 1980s created conflict between the family and the University at times. Allison found that the Kennedy name hindered fundraising efforts, according to a 1989 New York Times Magazine story about HKS. In printed materials from 1981, for instance, the school abbreviated its name as “HSG,” for the Harvard School of Government, instead of “KSG,” the acronym normally used at the time to refer to the school. “In any productive relationship,” Ted Kennedy told the Times in 1989, “you’re going to have these blips. I still have some criticisms. I’d like to see them pay less attention to techniques, more to the values of public life. But I’m proud to have our name on the school and I think my brother would have been too.” ‘TRADITION’ Though the Kennedy family has always maintained strong ties to the IOP, this year brought significant change to the Institute’s Advisory Committee leadership. In February, the Advisory Committee saw a major shakeup as Caroline B. Kennedy ’80, JFK’s daughter, and Kenneth M. Duberstein stepped down as its honorary chairs. Joe Kennedy III is now the only member of the Kennedy family who is officially involved with the IOP. Advertisement Caroline Kennedy — who served as U.S. Ambassador to Japan under President Barack Obama — took on a bigger role on the Advisory Committee following the death of her brother, John F. Kennedy Jr. JFK Jr. had worked closely with Campion on improving the forum, which was dedicated to him in 2003, four years after he was killed in a plane crash. “As an undergrad and just after I graduated, I attended a lot of meetings with my mother and my uncle, and then with John as he became very engaged and really sort of gave the IOP — and the forum in particular — a real burst of energy through his involvement,” Caroline Kennedy said in an interview with The Crimson. “After he died, I started becoming more engaged with my uncle Teddy,” she added. “And then after he died I’ve continued to stay engaged and work hard to make sure the IOP stays true to its spirit and mission.” Caroline Kennedy declined to comment on the specific reasons for her departure. “My goal is to make sure the IOP stays true to its founding ideals and mission and is inspirational and innovative, nimble and dedicated to public service, and committed to undergraduates primarily,” she said. Asked if she would consider rejoining the board in the future, however, she left the door open to the possibility. “I need to make sure that I can do what I just said, or that everybody is committed to that same set of ideals,” she said. “And then I would be thrilled to come back.” The Washington Post reported in February that Caroline Kennedy clashed with Kennedy School Dean Douglas W. Elmendorf, and that she and other committee members felt he micromanaged the IOP. “There were issues between her and school officials over the role of the Senior Advisory Committee and over her role at the IOP and just the structure,” Advisory Committee member Richard L. Berke said in an interview with The Crimson. “It is critically important that Caroline be a central figure in the leadership of the IOP,” Berke said. “I’m hopeful that the Harvard administration will go all out to try to get her back.” Advertisement IOP Director Mark D. Gearan ’78 said in an interview that he, too, hopes to get Caroline Kennedy back on the committee. “She has been so constructively engaged with our students and so helpful to the Institute of Politics,” Gearan, a former Crimson editor, said. “It would be very helpful to continue her engagement and her passion for the Kennedy School, for Harvard, and for the Institute. That would be, certainly, my hope.” ‘SOMETHING A BIT NEW’ Today, the Kennedy legacy is back on the ballot in Massachusetts. The only Kennedy currently holding public office in the state, Joe Kennedy III, is challenging U.S. Senator Edward J. Markey (D-Mass.) in a closely-watched primary. Tye, the Robert Kennedy biographer, said the young Kennedy’s brand of politics is reminiscent of his grandfather’s. “I would say that Joe III, in lots of ways, is the closest thing the Kennedys have come to producing another Bobby Kennedy since Bobby Kennedy,” Tye said. Robert Kennedy served in the Senate from New York and as his brother’s attorney general before being killed while running for president in 1968. Following his high school days at the Buckingham Browne & Nichols School in Cambridge, Joe Kennedy III did not follow the family tradition of attending Harvard and instead matriculated at Stanford as an undergraduate. “To have family members of mine that were alumni [at Harvard] was a great source of pride for me,” Kennedy said in an interview with The Crimson. Advertisement “I, for a variety of reasons, having grown up basically in its backyard and having a family that had pretty deep roots in Massachusetts, just wanted to go some place a bit new, and try something a bit new,” he added. United States Representative Joseph P. Kennedy III (D-Mass.) is challenging Senator Edward J. Markey (D-Mass.) in a tight race for a Massachusetts Senate seat. By Allison G. Lee After his undergraduate years and a stint in the Peace Corps, Kennedy returned to Cambridge for law school at Harvard. Harvard Law School classmates described Kennedy as friendly but low-key, and as a talented quarterback in the flag football league. “He was friends with pretty much everyone in our section,” said Patrick T. Childress, one of Kennedy’s Law School section mates. “He was always just very relatable and friendly.” Childress, who was friends with Kennedy, said Kennedy didn’t express plans to run for office during his time at the Law School. But after several years working as a prosecutor, Kennedy won a U.S. House seat in Massachusetts’s Fourth Congressional District. With his Harvard degree, famous surname, and progressive politics, Joe Kennedy III seems to have many of the same tools his grandfather and great-uncles did. His very appeal in the state still rests, in some part, upon his claim to familial fame. Nicholas Karnovsky ’19, a 2016 IOP Director’s Intern in Kennedy’s district office, said that legacy “was definitely part of the appeal” of his position. “While when I interned with him back in 2016, he was still a fairly new congressman, it was pretty clear, to me at least, that he was going somewhere,” Karnovsky said. “He’s the type of person you want to attach your anchor to.” “I’m not at all surprised that he’s running for the Senate now, given just his accomplishments and his credentials. I think the Senate is step two, who knows what step three might be,” he added. “That was certainly why I was interested.” Advertisement United States Representative Joseph P. Kennedy III (D-Mass.) visited the Harvard Institute of Politics in October 2019 to discuss his U.S. Senate campaign. By Steve S. Li Like many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016. Kennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so. “I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.” “The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added. Asked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat. “Without question, I’m proud of both,” he said. —Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman. Tags Commencement 2020Commencement 2020 News Advertisement Advertisement The Harvard Crimson The University Daily, Est. 1873\n\nCopyright © 2023 The Harvard Crimson, Inc.\n\nIt was the eldest of the Kennedy clan who many expected to gain political prominence even from a young age. But following his death in a plane crash in World War II, the political legacy was left to his brothers to fulfill.\n\nJohn F. Kennedy, the next oldest of the brothers, entered Harvard with a high school transcript riddled with Cs and Ds. As a freshman living in Weld Hall, Kennedy worked harder to succeed on various Harvard athletic teams than he did at academics: He earned a spot on the swim team, though he left little impression on the coaches. In his sophomore year, after moving into Winthrop House, Kennedy joined the Spee Club, the Hasty Pudding, and The Crimson, where he served as a business editor.\n\nJFK’s brothers, Bobby and Ted, both attended Harvard after him. They, too, were exceedingly focused on athletics during their undergraduate years, earning varsity football letters.\n\n“Being an athlete was like the other kinds of pressure in their life,” said Larry Tye, a Robert Kennedy biographer. “There was an expectation that they would compete. There was an expectation that the only thing worthy, in terms of the way you competed, was if you won.”\n\n“This was Joe Kennedy’s metaphor for what life ought to be like generally,” Tye said. “You had to win things, whether it was competing in a football game or competing in a political campaign.”\n\nAfter graduating Harvard, serving in World War II, and working briefly as a newspaper reporter, JFK went on to run for Congress in 1946 with strong support from his father. He spent six years in the House before being elected to the Senate twice, and made the leap to run for president in 1960.\n\nWhalen said Harvard played a crucial role in JFK’s entry into politics.\n\n“John Kennedy certainly spent his entire life drawing on those connections,” he said.\n\nAdvertisement\n\nWhen Kennedy was elected to the White House, he brought Harvard with him. He tapped numerous academics to serve in his administration, including National Security Advisor McGeorge Bundy, Ambassador to India John Kenneth Galbraith, Defense Secretary Robert S. McNamara, and advisor Arthur M. Schlesinger Jr. ’38.\n\n“The joke at the time in 1961 was: How do you get to Washington? Well, you go to Harvard Square and turn left,” said former U.S. Representative Barnett “Barney” Frank ’61-’62 (D-Mass.).\n\nHarvard became a part of the fabric of Kennedy’s White House. He returned to Cambridge numerous times following his election, had The Crimson delivered to 1600 Pennsylvania Ave., and sometimes listened to Harvard football games on the radio.\n\nPresident John F. Kennedy ‘40 sits at a typewriter with his book “Why England Slept,” the published version of Kennedy’s thesis written in his senior year at Harvard College. By Courtesy of The John F. Kennedy Presidential Library and Museum As president-elect in December 1960, JFK visited Harvard Yard, where he was greeted by thousands of cheering students. “It’s like feeling like you were at the center of where history was unfolding,” said Marshall L. Ganz ’64-’92, a Harvard Kennedy School professor who was a freshman at the College at the time. “And then when so many faculty went off to D.C. — aside from being pissed off that you didn’t get the course that you wanted to get, like with John Kenneth Galbraith — it was the same thing.” “There was kind of this proximity to this generation change and this new generation taking power,” Ganz said. “It was very energizing.” LEAVING A LEGACY On John F. Kennedy’s final trip to Boston in October 1963, prior to attending a Harvard-Columbia football game, he picked out a location on Harvard’s campus near the bend of the Charles River for the Kennedy Presidential Library and Museum. President John F. Kennedy ‘40 motions with his arm towards the proposed site of his future Presidential Library, along the banks of the Charles River in Boston, with Eliot House and Dunster House visible in the horizon. By Courtesy of The John F. Kennedy Presidential Library and Museum Advertisement One month later, Lee Harvey Oswald killed JFK in Dallas, Texas, sending the country — and campus — into a frenzy. Following his death, a group of JFK’s closest allies, including his two brothers, began working on plans to memorialize him, albeit far sooner than they expected. The group settled on the creation of a presidential library that would house a museum and his presidential archives. They also debated proposals to create a memorial of Kennedy that would have an ongoing impact on students. The discussions ultimately led to Harvard’s Graduate School of Public Administration becoming the John F. Kennedy School of Government, and to the founding of the Institute of Politics. The creation of the Kennedy Library — which was originally supposed to be part of a complex designed by architect I.M. Pei that would house the Kennedy School, the IOP, and several academic departments — was hampered by years of controversy and anger among some Cambridge residents. Community members raised concerns over the influx of tourism a museum would bring to the area. “It was a brawl,” said Dan H. Fenn Jr. ’44, the JFK Library’s founding director and a current Kennedy School lecturer. Some residents advocated to keep the archives housed at Harvard but move the museum elsewhere — a proposal Fenn, a former Crimson president, opposed. Eventually, when building the museum and the archive together in Cambridge became unfeasible, the family gave up on housing the memorial in Harvard Square. In 1979, the library opened on Columbia Point in Dorchester, alongside the archives and museum. The IOP, which was also mired in controversy in its early days, became the Kennedy family’s chief point of engagement with the University. Jacqueline L. “Jackie” Kennedy Onassis, JFK’s widow, sat on the Institute’s inaugural Senior Advisory Committee. Advertisement Ted Kennedy, who served in the U.S. Senate from 1962 until his death in 2009, also joined the Senior Advisory Committee shortly after its inception and became its most influential member. Committee members said Ted Kennedy never missed a meeting during his time on the committee, which gathers several times per year. “He was the leading steward of the family,” longtime IOP Advisory Committee member Heather P. Campion said. “He built the Senior Advisory Committee.” Beyond his engagement with the committee, Ted Kennedy also leaned heavily on Harvard affiliates in his policy work as a senator, according to Scott Ferson, who worked for Kennedy in the ’90s. “For his legislative work — and for the work he did on health care, education, justice reform, immigration — he very much relied on the experts at Harvard,” Ferson said. “The staff lists from his entirety in the Senate is littered with Harvard degrees.” The rapid growth of the Kennedy School under former Dean Graham T. Allison Jr. ’62 in the 1970s and 1980s created conflict between the family and the University at times. Allison found that the Kennedy name hindered fundraising efforts, according to a 1989 New York Times Magazine story about HKS. In printed materials from 1981, for instance, the school abbreviated its name as “HSG,” for the Harvard School of Government, instead of “KSG,” the acronym normally used at the time to refer to the school. “In any productive relationship,” Ted Kennedy told the Times in 1989, “you’re going to have these blips. I still have some criticisms. I’d like to see them pay less attention to techniques, more to the values of public life. But I’m proud to have our name on the school and I think my brother would have been too.” ‘TRADITION’ Though the Kennedy family has always maintained strong ties to the IOP, this year brought significant change to the Institute’s Advisory Committee leadership. In February, the Advisory Committee saw a major shakeup as Caroline B. Kennedy ’80, JFK’s daughter, and Kenneth M. Duberstein stepped down as its honorary chairs. Joe Kennedy III is now the only member of the Kennedy family who is officially involved with the IOP. Advertisement Caroline Kennedy — who served as U.S. Ambassador to Japan under President Barack Obama — took on a bigger role on the Advisory Committee following the death of her brother, John F. Kennedy Jr. JFK Jr. had worked closely with Campion on improving the forum, which was dedicated to him in 2003, four years after he was killed in a plane crash. “As an undergrad and just after I graduated, I attended a lot of meetings with my mother and my uncle, and then with John as he became very engaged and really sort of gave the IOP — and the forum in particular — a real burst of energy through his involvement,” Caroline Kennedy said in an interview with The Crimson. “After he died, I started becoming more engaged with my uncle Teddy,” she added. “And then after he died I’ve continued to stay engaged and work hard to make sure the IOP stays true to its spirit and mission.” Caroline Kennedy declined to comment on the specific reasons for her departure. “My goal is to make sure the IOP stays true to its founding ideals and mission and is inspirational and innovative, nimble and dedicated to public service, and committed to undergraduates primarily,” she said. Asked if she would consider rejoining the board in the future, however, she left the door open to the possibility. “I need to make sure that I can do what I just said, or that everybody is committed to that same set of ideals,” she said. “And then I would be thrilled to come back.” The Washington Post reported in February that Caroline Kennedy clashed with Kennedy School Dean Douglas W. Elmendorf, and that she and other committee members felt he micromanaged the IOP. “There were issues between her and school officials over the role of the Senior Advisory Committee and over her role at the IOP and just the structure,” Advisory Committee member Richard L. Berke said in an interview with The Crimson. “It is critically important that Caroline be a central figure in the leadership of the IOP,” Berke said. “I’m hopeful that the Harvard administration will go all out to try to get her back.” Advertisement IOP Director Mark D. Gearan ’78 said in an interview that he, too, hopes to get Caroline Kennedy back on the committee. “She has been so constructively engaged with our students and so helpful to the Institute of Politics,” Gearan, a former Crimson editor, said. “It would be very helpful to continue her engagement and her passion for the Kennedy School, for Harvard, and for the Institute. That would be, certainly, my hope.” ‘SOMETHING A BIT NEW’ Today, the Kennedy legacy is back on the ballot in Massachusetts. The only Kennedy currently holding public office in the state, Joe Kennedy III, is challenging U.S. Senator Edward J. Markey (D-Mass.) in a closely-watched primary. Tye, the Robert Kennedy biographer, said the young Kennedy’s brand of politics is reminiscent of his grandfather’s. “I would say that Joe III, in lots of ways, is the closest thing the Kennedys have come to producing another Bobby Kennedy since Bobby Kennedy,” Tye said. Robert Kennedy served in the Senate from New York and as his brother’s attorney general before being killed while running for president in 1968. Following his high school days at the Buckingham Browne & Nichols School in Cambridge, Joe Kennedy III did not follow the family tradition of attending Harvard and instead matriculated at Stanford as an undergraduate. “To have family members of mine that were alumni [at Harvard] was a great source of pride for me,” Kennedy said in an interview with The Crimson. Advertisement “I, for a variety of reasons, having grown up basically in its backyard and having a family that had pretty deep roots in Massachusetts, just wanted to go some place a bit new, and try something a bit new,” he added. United States Representative Joseph P. Kennedy III (D-Mass.) is challenging Senator Edward J. Markey (D-Mass.) in a tight race for a Massachusetts Senate seat. By Allison G. Lee After his undergraduate years and a stint in the Peace Corps, Kennedy returned to Cambridge for law school at Harvard. Harvard Law School classmates described Kennedy as friendly but low-key, and as a talented quarterback in the flag football league. “He was friends with pretty much everyone in our section,” said Patrick T. Childress, one of Kennedy’s Law School section mates. “He was always just very relatable and friendly.” Childress, who was friends with Kennedy, said Kennedy didn’t express plans to run for office during his time at the Law School. But after several years working as a prosecutor, Kennedy won a U.S. House seat in Massachusetts’s Fourth Congressional District. With his Harvard degree, famous surname, and progressive politics, Joe Kennedy III seems to have many of the same tools his grandfather and great-uncles did. His very appeal in the state still rests, in some part, upon his claim to familial fame. Nicholas Karnovsky ’19, a 2016 IOP Director’s Intern in Kennedy’s district office, said that legacy “was definitely part of the appeal” of his position. “While when I interned with him back in 2016, he was still a fairly new congressman, it was pretty clear, to me at least, that he was going somewhere,” Karnovsky said. “He’s the type of person you want to attach your anchor to.” “I’m not at all surprised that he’s running for the Senate now, given just his accomplishments and his credentials. I think the Senate is step two, who knows what step three might be,” he added. “That was certainly why I was interested.” Advertisement United States Representative Joseph P. Kennedy III (D-Mass.) visited the Harvard Institute of Politics in October 2019 to discuss his U.S. Senate campaign. By Steve S. Li Like many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016. Kennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so. “I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.” “The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added. Asked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat. “Without question, I’m proud of both,” he said. —Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman. Tags Commencement 2020Commencement 2020 News Advertisement Advertisement The Harvard Crimson The University Daily, Est. 1873\n\nCopyright © 2023 The Harvard Crimson, Inc.\n\nAs president-elect in December 1960, JFK visited Harvard Yard, where he was greeted by thousands of cheering students.\n\n“It’s like feeling like you were at the center of where history was unfolding,” said Marshall L. Ganz ’64-’92, a Harvard Kennedy School professor who was a freshman at the College at the time. “And then when so many faculty went off to D.C. — aside from being pissed off that you didn’t get the course that you wanted to get, like with John Kenneth Galbraith — it was the same thing.”\n\n“There was kind of this proximity to this generation change and this new generation taking power,” Ganz said. “It was very energizing.”\n\nLEAVING A LEGACY\n\nOn John F. Kennedy’s final trip to Boston in October 1963, prior to attending a Harvard-Columbia football game, he picked out a location on Harvard’s campus near the bend of the Charles River for the Kennedy Presidential Library and Museum.\n\nPresident John F. Kennedy ‘40 motions with his arm towards the proposed site of his future Presidential Library, along the banks of the Charles River in Boston, with Eliot House and Dunster House visible in the horizon. By Courtesy of The John F. Kennedy Presidential Library and Museum Advertisement One month later, Lee Harvey Oswald killed JFK in Dallas, Texas, sending the country — and campus — into a frenzy. Following his death, a group of JFK’s closest allies, including his two brothers, began working on plans to memorialize him, albeit far sooner than they expected. The group settled on the creation of a presidential library that would house a museum and his presidential archives. They also debated proposals to create a memorial of Kennedy that would have an ongoing impact on students. The discussions ultimately led to Harvard’s Graduate School of Public Administration becoming the John F. Kennedy School of Government, and to the founding of the Institute of Politics. The creation of the Kennedy Library — which was originally supposed to be part of a complex designed by architect I.M. Pei that would house the Kennedy School, the IOP, and several academic departments — was hampered by years of controversy and anger among some Cambridge residents. Community members raised concerns over the influx of tourism a museum would bring to the area. “It was a brawl,” said Dan H. Fenn Jr. ’44, the JFK Library’s founding director and a current Kennedy School lecturer. Some residents advocated to keep the archives housed at Harvard but move the museum elsewhere — a proposal Fenn, a former Crimson president, opposed. Eventually, when building the museum and the archive together in Cambridge became unfeasible, the family gave up on housing the memorial in Harvard Square. In 1979, the library opened on Columbia Point in Dorchester, alongside the archives and museum. The IOP, which was also mired in controversy in its early days, became the Kennedy family’s chief point of engagement with the University. Jacqueline L. “Jackie” Kennedy Onassis, JFK’s widow, sat on the Institute’s inaugural Senior Advisory Committee. Advertisement Ted Kennedy, who served in the U.S. Senate from 1962 until his death in 2009, also joined the Senior Advisory Committee shortly after its inception and became its most influential member. Committee members said Ted Kennedy never missed a meeting during his time on the committee, which gathers several times per year. “He was the leading steward of the family,” longtime IOP Advisory Committee member Heather P. Campion said. “He built the Senior Advisory Committee.” Beyond his engagement with the committee, Ted Kennedy also leaned heavily on Harvard affiliates in his policy work as a senator, according to Scott Ferson, who worked for Kennedy in the ’90s. “For his legislative work — and for the work he did on health care, education, justice reform, immigration — he very much relied on the experts at Harvard,” Ferson said. “The staff lists from his entirety in the Senate is littered with Harvard degrees.” The rapid growth of the Kennedy School under former Dean Graham T. Allison Jr. ’62 in the 1970s and 1980s created conflict between the family and the University at times. Allison found that the Kennedy name hindered fundraising efforts, according to a 1989 New York Times Magazine story about HKS. In printed materials from 1981, for instance, the school abbreviated its name as “HSG,” for the Harvard School of Government, instead of “KSG,” the acronym normally used at the time to refer to the school. “In any productive relationship,” Ted Kennedy told the Times in 1989, “you’re going to have these blips. I still have some criticisms. I’d like to see them pay less attention to techniques, more to the values of public life. But I’m proud to have our name on the school and I think my brother would have been too.” ‘TRADITION’ Though the Kennedy family has always maintained strong ties to the IOP, this year brought significant change to the Institute’s Advisory Committee leadership. In February, the Advisory Committee saw a major shakeup as Caroline B. Kennedy ’80, JFK’s daughter, and Kenneth M. Duberstein stepped down as its honorary chairs. Joe Kennedy III is now the only member of the Kennedy family who is officially involved with the IOP. Advertisement Caroline Kennedy — who served as U.S. Ambassador to Japan under President Barack Obama — took on a bigger role on the Advisory Committee following the death of her brother, John F. Kennedy Jr. JFK Jr. had worked closely with Campion on improving the forum, which was dedicated to him in 2003, four years after he was killed in a plane crash. “As an undergrad and just after I graduated, I attended a lot of meetings with my mother and my uncle, and then with John as he became very engaged and really sort of gave the IOP — and the forum in particular — a real burst of energy through his involvement,” Caroline Kennedy said in an interview with The Crimson. “After he died, I started becoming more engaged with my uncle Teddy,” she added. “And then after he died I’ve continued to stay engaged and work hard to make sure the IOP stays true to its spirit and mission.” Caroline Kennedy declined to comment on the specific reasons for her departure. “My goal is to make sure the IOP stays true to its founding ideals and mission and is inspirational and innovative, nimble and dedicated to public service, and committed to undergraduates primarily,” she said. Asked if she would consider rejoining the board in the future, however, she left the door open to the possibility. “I need to make sure that I can do what I just said, or that everybody is committed to that same set of ideals,” she said. “And then I would be thrilled to come back.” The Washington Post reported in February that Caroline Kennedy clashed with Kennedy School Dean Douglas W. Elmendorf, and that she and other committee members felt he micromanaged the IOP. “There were issues between her and school officials over the role of the Senior Advisory Committee and over her role at the IOP and just the structure,” Advisory Committee member Richard L. Berke said in an interview with The Crimson. “It is critically important that Caroline be a central figure in the leadership of the IOP,” Berke said. “I’m hopeful that the Harvard administration will go all out to try to get her back.” Advertisement IOP Director Mark D. Gearan ’78 said in an interview that he, too, hopes to get Caroline Kennedy back on the committee. “She has been so constructively engaged with our students and so helpful to the Institute of Politics,” Gearan, a former Crimson editor, said. “It would be very helpful to continue her engagement and her passion for the Kennedy School, for Harvard, and for the Institute. That would be, certainly, my hope.” ‘SOMETHING A BIT NEW’ Today, the Kennedy legacy is back on the ballot in Massachusetts. The only Kennedy currently holding public office in the state, Joe Kennedy III, is challenging U.S. Senator Edward J. Markey (D-Mass.) in a closely-watched primary. Tye, the Robert Kennedy biographer, said the young Kennedy’s brand of politics is reminiscent of his grandfather’s. “I would say that Joe III, in lots of ways, is the closest thing the Kennedys have come to producing another Bobby Kennedy since Bobby Kennedy,” Tye said. Robert Kennedy served in the Senate from New York and as his brother’s attorney general before being killed while running for president in 1968. Following his high school days at the Buckingham Browne & Nichols School in Cambridge, Joe Kennedy III did not follow the family tradition of attending Harvard and instead matriculated at Stanford as an undergraduate. “To have family members of mine that were alumni [at Harvard] was a great source of pride for me,” Kennedy said in an interview with The Crimson. Advertisement “I, for a variety of reasons, having grown up basically in its backyard and having a family that had pretty deep roots in Massachusetts, just wanted to go some place a bit new, and try something a bit new,” he added. United States Representative Joseph P. Kennedy III (D-Mass.) is challenging Senator Edward J. Markey (D-Mass.) in a tight race for a Massachusetts Senate seat. By Allison G. Lee After his undergraduate years and a stint in the Peace Corps, Kennedy returned to Cambridge for law school at Harvard. Harvard Law School classmates described Kennedy as friendly but low-key, and as a talented quarterback in the flag football league. “He was friends with pretty much everyone in our section,” said Patrick T. Childress, one of Kennedy’s Law School section mates. “He was always just very relatable and friendly.” Childress, who was friends with Kennedy, said Kennedy didn’t express plans to run for office during his time at the Law School. But after several years working as a prosecutor, Kennedy won a U.S. House seat in Massachusetts’s Fourth Congressional District. With his Harvard degree, famous surname, and progressive politics, Joe Kennedy III seems to have many of the same tools his grandfather and great-uncles did. His very appeal in the state still rests, in some part, upon his claim to familial fame. Nicholas Karnovsky ’19, a 2016 IOP Director’s Intern in Kennedy’s district office, said that legacy “was definitely part of the appeal” of his position. “While when I interned with him back in 2016, he was still a fairly new congressman, it was pretty clear, to me at least, that he was going somewhere,” Karnovsky said. “He’s the type of person you want to attach your anchor to.” “I’m not at all surprised that he’s running for the Senate now, given just his accomplishments and his credentials. I think the Senate is step two, who knows what step three might be,” he added. “That was certainly why I was interested.” Advertisement United States Representative Joseph P. Kennedy III (D-Mass.) visited the Harvard Institute of Politics in October 2019 to discuss his U.S. Senate campaign. By Steve S. Li Like many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016. Kennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so. “I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.” “The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added. Asked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat. “Without question, I’m proud of both,” he said. —Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman. Tags Commencement 2020Commencement 2020 News Advertisement Advertisement The Harvard Crimson The University Daily, Est. 1873\n\nCopyright © 2023 The Harvard Crimson, Inc.\n\nAdvertisement\n\nOne month later, Lee Harvey Oswald killed JFK in Dallas, Texas, sending the country — and campus — into a frenzy.\n\nFollowing his death, a group of JFK’s closest allies, including his two brothers, began working on plans to memorialize him, albeit far sooner than they expected.\n\nThe group settled on the creation of a presidential library that would house a museum and his presidential archives. They also debated proposals to create a memorial of Kennedy that would have an ongoing impact on students.\n\nThe discussions ultimately led to Harvard’s Graduate School of Public Administration becoming the John F. Kennedy School of Government, and to the founding of the Institute of Politics.\n\nThe creation of the Kennedy Library — which was originally supposed to be part of a complex designed by architect I.M. Pei that would house the Kennedy School, the IOP, and several academic departments — was hampered by years of controversy and anger among some Cambridge residents. Community members raised concerns over the influx of tourism a museum would bring to the area.\n\n“It was a brawl,” said Dan H. Fenn Jr. ’44, the JFK Library’s founding director and a current Kennedy School lecturer.\n\nSome residents advocated to keep the archives housed at Harvard but move the museum elsewhere — a proposal Fenn, a former Crimson president, opposed.\n\nEventually, when building the museum and the archive together in Cambridge became unfeasible, the family gave up on housing the memorial in Harvard Square. In 1979, the library opened on Columbia Point in Dorchester, alongside the archives and museum.\n\nThe IOP, which was also mired in controversy in its early days, became the Kennedy family’s chief point of engagement with the University.\n\nJacqueline L. “Jackie” Kennedy Onassis, JFK’s widow, sat on the Institute’s inaugural Senior Advisory Committee.\n\nAdvertisement\n\nTed Kennedy, who served in the U.S. Senate from 1962 until his death in 2009, also joined the Senior Advisory Committee shortly after its inception and became its most influential member. Committee members said Ted Kennedy never missed a meeting during his time on the committee, which gathers several times per year.\n\n“He was the leading steward of the family,” longtime IOP Advisory Committee member Heather P. Campion said. “He built the Senior Advisory Committee.”\n\nBeyond his engagement with the committee, Ted Kennedy also leaned heavily on Harvard affiliates in his policy work as a senator, according to Scott Ferson, who worked for Kennedy in the ’90s.\n\n“For his legislative work — and for the work he did on health care, education, justice reform, immigration — he very much relied on the experts at Harvard,” Ferson said. “The staff lists from his entirety in the Senate is littered with Harvard degrees.”\n\nThe rapid growth of the Kennedy School under former Dean Graham T. Allison Jr. ’62 in the 1970s and 1980s created conflict between the family and the University at times.\n\nAllison found that the Kennedy name hindered fundraising efforts, according to a 1989 New York Times Magazine story about HKS. In printed materials from 1981, for instance, the school abbreviated its name as “HSG,” for the Harvard School of Government, instead of “KSG,” the acronym normally used at the time to refer to the school.\n\n“In any productive relationship,” Ted Kennedy told the Times in 1989, “you’re going to have these blips. I still have some criticisms. I’d like to see them pay less attention to techniques, more to the values of public life. But I’m proud to have our name on the school and I think my brother would have been too.”\n\nThough the Kennedy family has always maintained strong ties to the IOP, this year brought significant change to the Institute’s Advisory Committee leadership.\n\nIn February, the Advisory Committee saw a major shakeup as Caroline B. Kennedy ’80, JFK’s daughter, and Kenneth M. Duberstein stepped down as its honorary chairs. Joe Kennedy III is now the only member of the Kennedy family who is officially involved with the IOP.\n\nAdvertisement\n\nCaroline Kennedy — who served as U.S. Ambassador to Japan under President Barack Obama — took on a bigger role on the Advisory Committee following the death of her brother, John F. Kennedy Jr. JFK Jr. had worked closely with Campion on improving the forum, which was dedicated to him in 2003, four years after he was killed in a plane crash.\n\n“As an undergrad and just after I graduated, I attended a lot of meetings with my mother and my uncle, and then with John as he became very engaged and really sort of gave the IOP — and the forum in particular — a real burst of energy through his involvement,” Caroline Kennedy said in an interview with The Crimson.\n\n“After he died, I started becoming more engaged with my uncle Teddy,” she added. “And then after he died I’ve continued to stay engaged and work hard to make sure the IOP stays true to its spirit and mission.”\n\nCaroline Kennedy declined to comment on the specific reasons for her departure.\n\n“My goal is to make sure the IOP stays true to its founding ideals and mission and is inspirational and innovative, nimble and dedicated to public service, and committed to undergraduates primarily,” she said.\n\nAsked if she would consider rejoining the board in the future, however, she left the door open to the possibility.\n\n“I need to make sure that I can do what I just said, or that everybody is committed to that same set of ideals,” she said. “And then I would be thrilled to come back.”\n\nThe Washington Post reported in February that Caroline Kennedy clashed with Kennedy School Dean Douglas W. Elmendorf, and that she and other committee members felt he micromanaged the IOP.\n\n“There were issues between her and school officials over the role of the Senior Advisory Committee and over her role at the IOP and just the structure,” Advisory Committee member Richard L. Berke said in an interview with The Crimson.\n\n“It is critically important that Caroline be a central figure in the leadership of the IOP,” Berke said. “I’m hopeful that the Harvard administration will go all out to try to get her back.”\n\nAdvertisement\n\nIOP Director Mark D. Gearan ’78 said in an interview that he, too, hopes to get Caroline Kennedy back on the committee.\n\n“She has been so constructively engaged with our students and so helpful to the Institute of Politics,” Gearan, a former Crimson editor, said. “It would be very helpful to continue her engagement and her passion for the Kennedy School, for Harvard, and for the Institute. That would be, certainly, my hope.”\n\n‘SOMETHING A BIT NEW’\n\nToday, the Kennedy legacy is back on the ballot in Massachusetts.\n\nThe only Kennedy currently holding public office in the state, Joe Kennedy III, is challenging U.S. Senator Edward J. Markey (D-Mass.) in a closely-watched primary.\n\nTye, the Robert Kennedy biographer, said the young Kennedy’s brand of politics is reminiscent of his grandfather’s.\n\n“I would say that Joe III, in lots of ways, is the closest thing the Kennedys have come to producing another Bobby Kennedy since Bobby Kennedy,” Tye said.\n\nRobert Kennedy served in the Senate from New York and as his brother’s attorney general before being killed while running for president in 1968.\n\nFollowing his high school days at the Buckingham Browne & Nichols School in Cambridge, Joe Kennedy III did not follow the family tradition of attending Harvard and instead matriculated at Stanford as an undergraduate.\n\n“To have family members of mine that were alumni [at Harvard] was a great source of pride for me,” Kennedy said in an interview with The Crimson.\n\nAdvertisement\n\n“I, for a variety of reasons, having grown up basically in its backyard and having a family that had pretty deep roots in Massachusetts, just wanted to go some place a bit new, and try something a bit new,” he added.\n\nUnited States Representative Joseph P. Kennedy III (D-Mass.) is challenging Senator Edward J. Markey (D-Mass.) in a tight race for a Massachusetts Senate seat. By Allison G. Lee After his undergraduate years and a stint in the Peace Corps, Kennedy returned to Cambridge for law school at Harvard. Harvard Law School classmates described Kennedy as friendly but low-key, and as a talented quarterback in the flag football league. “He was friends with pretty much everyone in our section,” said Patrick T. Childress, one of Kennedy’s Law School section mates. “He was always just very relatable and friendly.” Childress, who was friends with Kennedy, said Kennedy didn’t express plans to run for office during his time at the Law School. But after several years working as a prosecutor, Kennedy won a U.S. House seat in Massachusetts’s Fourth Congressional District. With his Harvard degree, famous surname, and progressive politics, Joe Kennedy III seems to have many of the same tools his grandfather and great-uncles did. His very appeal in the state still rests, in some part, upon his claim to familial fame. Nicholas Karnovsky ’19, a 2016 IOP Director’s Intern in Kennedy’s district office, said that legacy “was definitely part of the appeal” of his position. “While when I interned with him back in 2016, he was still a fairly new congressman, it was pretty clear, to me at least, that he was going somewhere,” Karnovsky said. “He’s the type of person you want to attach your anchor to.” “I’m not at all surprised that he’s running for the Senate now, given just his accomplishments and his credentials. I think the Senate is step two, who knows what step three might be,” he added. “That was certainly why I was interested.” Advertisement United States Representative Joseph P. Kennedy III (D-Mass.) visited the Harvard Institute of Politics in October 2019 to discuss his U.S. Senate campaign. By Steve S. Li Like many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016. Kennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so. “I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.” “The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added. Asked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat. “Without question, I’m proud of both,” he said. —Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman. Tags Commencement 2020Commencement 2020 News Advertisement Advertisement The Harvard Crimson The University Daily, Est. 1873\n\nCopyright © 2023 The Harvard Crimson, Inc.\n\nAfter his undergraduate years and a stint in the Peace Corps, Kennedy returned to Cambridge for law school at Harvard.\n\nHarvard Law School classmates described Kennedy as friendly but low-key, and as a talented quarterback in the flag football league.\n\n“He was friends with pretty much everyone in our section,” said Patrick T. Childress, one of Kennedy’s Law School section mates. “He was always just very relatable and friendly.”\n\nChildress, who was friends with Kennedy, said Kennedy didn’t express plans to run for office during his time at the Law School. But after several years working as a prosecutor, Kennedy won a U.S. House seat in Massachusetts’s Fourth Congressional District.\n\nWith his Harvard degree, famous surname, and progressive politics, Joe Kennedy III seems to have many of the same tools his grandfather and great-uncles did. His very appeal in the state still rests, in some part, upon his claim to familial fame.\n\nNicholas Karnovsky ’19, a 2016 IOP Director’s Intern in Kennedy’s district office, said that legacy “was definitely part of the appeal” of his position.\n\n“While when I interned with him back in 2016, he was still a fairly new congressman, it was pretty clear, to me at least, that he was going somewhere,” Karnovsky said. “He’s the type of person you want to attach your anchor to.”\n\n“I’m not at all surprised that he’s running for the Senate now, given just his accomplishments and his credentials. I think the Senate is step two, who knows what step three might be,” he added. “That was certainly why I was interested.”\n\nAdvertisement\n\nUnited States Representative Joseph P. Kennedy III (D-Mass.) visited the Harvard Institute of Politics in October 2019 to discuss his U.S. Senate campaign. By Steve S. Li Like many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016. Kennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so. “I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.” “The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added. Asked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat. “Without question, I’m proud of both,” he said. —Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman. Tags Commencement 2020Commencement 2020 News Advertisement Advertisement The Harvard Crimson The University Daily, Est. 1873\n\nCopyright © 2023 The Harvard Crimson, Inc.\n\nLike many of his family members, Kennedy has, too, reaped the rewards of Harvard connections. His introduction of U.S. Senator Elizabeth Warren (D-Mass.), his former Law School professor, at the Democratic National Convention put him in the national spotlight in 2016.\n\nKennedy, who has long been the beacon of establishment politics in the Bay State, has tried to distinguish himself — but hasn’t shied away from his family’s reputation in doing so.\n\n“I think the lesson that I take from my family’s participation in public life has been one that has not been afraid to challenge the structures and institutions of our society to, in fact, be bigger, dream bolder, and deliver more,” he said. “I believe that’s what politics is supposed to do.”\n\n“The role of people in it is not to work your way into an establishment platform and then enjoy the comforts that are provided by it, but to recognize that if that establishment is in fact going to deliver on the promises that we make to our people, then that establishment needs to be constantly be pushed and to constantly be driven to be more and to focus even more deliberately in the ways in which we fall short,” he added.\n\nAsked if, in his current race, his family legacy and Harvard background are an asset or a burden, Kennedy didn’t miss a beat.\n\n“Without question, I’m proud of both,” he said.\n\n—Staff writer Jasper G. Goodman can be reached at jasper.goodman@thecrimson.com. Follow him on Twitter @Jasper_Goodman."}, {"url": "https://www.newworldencyclopedia.org/entry/Ted_Kennedy", "page_content": "Ted Kennedy\n\nUnited States Senator In office\n\nNovember 7, 1962 – August 25, 2009 Preceded by Benjamin A. Smith II Succeeded by Paul G. Kirk Chair of the Senate Health Committee In office\n\nJanuary 3, 2007 – August 25, 2009\n\nOn leave: June 9 – August 25, 2009* Preceded by Mike Enzi Succeeded by Chris Dodd (acting) In office\n\nJune 6, 2001 – January 3, 2003 Preceded by Jim Jeffords Succeeded by Judd Gregg In office\n\nJanuary 3, 2001 – January 20, 2001 Preceded by Jim Jeffords Succeeded by Jim Jeffords In office\n\nJanuary 3, 1987 – January 3, 1995 Preceded by Orrin Hatch Succeeded by Nancy Kassebaum Chair of the Senate Judiciary Committee In office\n\nJanuary 3, 1979 – January 3, 1981 Preceded by James Eastland Succeeded by Strom Thurmond Senate Majority Whip In office\n\nJanuary 3, 1969 – January 3, 1971 Preceded by Russell B. Long Succeeded by Robert Byrd Born February 22 1932 ( 1932-02-22 )\n\nBoston, Massachusetts, U.S. Died August 25 2009 (aged 77)\n\nHyannis Port, Massachusetts, U.S. Political party Democratic Spouse Joan Bennett\n\n(m. 1958; div. 1983)\n\nVicki Reggie (m. 1992) Relations Kennedy family Children Kara · Edward Jr. · Patrick Signature Website Official website\n\nEdward Moore Kennedy (February 22, 1932 – August 25, 2009) was an American politician who served as a U.S. Senator from Massachusetts for almost 47 years, from 1962 until his death in 2009. A member of the Democratic Party and the Kennedy political family, he was the second most senior member of the Senate when he died and the third-longest-continuously-serving senator in United States history. Kennedy was a brother of President John F. Kennedy and U.S. Attorney General and U.S. Senator Robert F. Kennedy—both victims of assassination—and was the father of Congressman Patrick J. Kennedy.\n\nKennedy was 30 years old when he first entered the Senate following a November 1962 special election in Massachusetts to fill the vacant seat previously held by his brother John, who had taken office as the president. He was elected to a full six-year term in 1964 and was later re-elected seven more times. The Chappaquiddick incident in 1969 resulted in the death of his automobile passenger, Mary Jo Kopechne, a former campaign worker for his brother Robert's Presidential campaign. He pleaded guilty to a charge of leaving the scene of an accident and later received a two-month suspended sentence. The incident and its aftermath hindered his chances of ever becoming president. His only attempt, in the 1980 election, resulted in a Democratic primary campaign loss to the incumbent president, Jimmy Carter.\n\nKennedy was known for his oratorical skills. His 1968 eulogy for his brother Robert and his 1980 rallying cry for modern American liberalism were among his best-known speeches. He became recognized as \"The Lion of the Senate\" through his long tenure and influence. Kennedy and his staff wrote more than 300 bills that were enacted into law. Unabashedly liberal, Kennedy championed an interventionist government that emphasized economic and social justice, but he was also known for working with Republicans to find compromises. Kennedy played a major role in passing many laws, including the Immigration and Nationality Act of 1965, the National Cancer Act of 1971, the COBRA health insurance provision, the Comprehensive Anti-Apartheid Act of 1986, the Americans with Disabilities Act of 1990, the Ryan White AIDS Care Act, the Civil Rights Act of 1991, the Mental Health Parity Act, the S-CHIP children's health program, the No Child Left Behind Act, and the Edward M. Kennedy Serve America Act. During the 2000s, he led several unsuccessful immigration reform efforts. Over the course of his Senate career, Kennedy made efforts to enact universal health care, which he called the \"cause of my life.\" Despite his role as a major figure and spokesman for American progressivism, Kennedy was a champion of the Senate and Senate collegiality who worked across the aisle with conservative Senators like Orrin Hatch on issues of mutual interest.\n\nKennedy died on August 25, 2009 of a malignant brain tumor at his home in Hyannis Port, Massachusetts, and was buried near his brothers John and Robert at Arlington National Cemetery.\n\nEarly life\n\nEdward Moore Kennedy was born on February 22, 1932, at St. Margaret's Hospital in the Dorchester section of Boston, Massachusetts. He was the last of the nine children of Joseph Patrick Kennedy and Rose Fitzgerald, members of prominent Irish American families in Boston,[1] who constituted one of the wealthiest families in the nation once they were joined.[2] His eight siblings were Joseph Jr., John, Rosemary, Kathleen, Eunice, Patricia, Robert, and Jean. John asked to be the newborn's godfather, a request his parents honored, though they did not agree to his request to name the baby George Washington Kennedy (Ted was born on President George Washington's 200th birthday) and instead named him after their father's assistant.[3]\n\nAs a child, Ted was frequently uprooted by his family's moves among Bronxville, New York; Hyannis Port, Massachusetts; Palm Beach, Florida; and the Court of St. James's, in London, England.[4] His formal education started at Gibbs School in Kensington, London.[5] He had attended ten schools by the age of eleven; this was a series of disruptions that interfered with his academic success.[6] He was an altar boy at the St. Joseph's Church and was seven when he received his First Communion from Pope Pius XII in the Vatican.[7] He spent sixth and seventh grades at the Fessenden School, where he was a mediocre student, and eighth grade at Cranwell Preparatory School; both schools located in Massachusetts.[4] He was the youngest child and his parents were affectionate towards him, but they also compared him unfavorably with his older brothers. Ted's affable maternal grandfather, John F. Fitzgerald, was the Mayor of Boston, a U.S. Congressman, and an early political and personal influence.[1]\n\nBetween the ages of eight and sixteen, Ted suffered the traumas of Rosemary's failed lobotomy and the deaths of Joseph Jr. in World War II and Kathleen in an airplane crash.[1] He spent his four high-school years at Milton Academy, a preparatory school in Milton, Massachusetts, where he received B and C grades and, in 1950, finished 36th in a graduating class of 56. He did well at football there, playing on the varsity in his last two years; the school's headmaster later described his play as \"absolutely fearless ... he would have tackled an express train to New York if you asked ... he loved contact sports.\"[8] Kennedy also played on the tennis team and was in the drama, debate, and glee clubs.\n\nCollege, military service, and law school\n\nLike his father and brothers before him, Ted graduated from Harvard College. An offense and defensive end on the football team, Kennedy was anxious about maintaining his eligibility for athletics for the next year,[1] so at the end of his second semester in May 1951 he had a classmate take his place at a Spanish exam. The deception was immediately discovered and both students were expelled for cheating. In a standard Harvard treatment for serious disciplinary cases, they were told they could apply for readmission within a year or two if they demonstrated good behavior during that time.[9][10]\n\nIn June 1951, Kennedy enlisted in the United States Army and signed up for an optional four-year term that was shortened to the minimum of two years after his father intervened. Following basic training at Fort Dix in New Jersey, he requested assignment to Fort Holabird in Maryland for Army Intelligence training, but was dropped without explanation after a few weeks. He went to Camp Gordon in Georgia for training in the Military Police Corps. In June 1952, Kennedy was assigned to the honor guard at SHAPE headquarters in Paris, France.[9] His father's political connections ensured that he was not deployed to the ongoing Korean War.[11] After 21 months, he was discharged in March 1953 as a private first class.[9]\n\nKennedy re-entered Harvard in the summer of 1953 and improved his study habits.[1] His brother John was a U.S. Senator and the family was attracting more public attention.[12] Academically, Kennedy received mediocre grades for his first three years, improved to a B average for his senior year, and finished barely in the top half of his class. Kennedy graduated from Harvard at age 24 in 1956 with an AB in history and government.[13]\n\nDue to his low grades, Kennedy was not accepted by Harvard Law School.[10] He instead followed his brother Bobby and enrolled in the University of Virginia School of Law in 1956.[1] That acceptance was controversial among faculty and alumni, who judged Kennedy's past cheating episodes at Harvard to be incompatible with the University of Virginia's honor code; it took a full faculty vote to admit him.[14] Kennedy also attended the Hague Academy of International Law during one summer.[15] At Virginia, Kennedy felt that he had to study \"four times as hard and four times as long\" as other students to keep up with them.[16] He received mostly C grades and was in the middle of the class ranking, but was the winner of the prestigious William Minor Lile Moot Court Competition.[1] He was elected head of the Student Legal Forum and brought many prominent speakers to the campus via his family connections.[17] While there, his careless driving caught up with him and he was charged with reckless driving and driving without a license.[1] While attending law school, he was officially named as manager of his brother John's 1958 Senate re-election campaign; Ted's ability to connect with ordinary voters on the street helped bring a record-setting victory margin that gave credibility to John's presidential aspirations.[18] Ted graduated from law school in 1959.[17]\n\nIn October 1957 (early in his second year of law school), Kennedy met Joan Bennett at Manhattanville College; they were introduced after a dedication speech for a gymnasium that his family had donated at the campus. Bennett was a senior at Manhattanville and had worked as a model and won beauty contests, but she was unfamiliar with the world of politics. After the couple became engaged, she grew nervous about marrying someone she did not know that well, but Joe Kennedy insisted that the wedding should proceed.[19] The couple was married by Cardinal Francis Spellman on November 29, 1958, at St. Joseph's Church in Bronxville, New York,[1] with a reception at nearby Siwanoy Country Club.[20] Ted and Joan had three children: Kara (1960–2011), Ted Jr. (b. 1961) and Patrick (b. 1967). By the 1970s, the marriage became troubled due to Ted's infidelity and Joan's growing alcoholism. They would separate in 1977 and eventually divorce in 1983.\n\nEarly career\n\nJohn, Bobby , and Ted Kennedy during John's presidential campaign, July 1960\n\nKennedy was admitted to the Massachusetts Bar in 1959. In 1960, his brother John announced his candidacy for President of the United States and Ted managed his campaign in the Western states.[1] The seven weeks he spent in Wisconsin helped his brother win the first contested primary of the season there and a similar time spent in Wyoming was rewarded when a unanimous vote from that state's delegates put his brother over the top at the 1960 Democratic National Convention.[21]\n\nFollowing his victory in the presidential election, John resigned from his seat as U.S. Senator from Massachusetts, but Ted was not eligible to fill the vacancy until his thirtieth birthday on February 22, 1962.[22] Ted's brothers were not in favor of his running immediately, but Ted ultimately coveted the Senate seat as an accomplishment to match his brothers, and their father overruled them. John asked Massachusetts Governor Foster Furcolo to name Kennedy family friend Ben Smith as interim senator for John's unexpired term, which he did in December 1960.[23] This kept the seat available for Ted.\n\nFirst Senate campaign, 1962\n\nIn the November special election, Kennedy defeated Republican George Cabot Lodge II, product of another noted Massachusetts political family, gaining 55 percent of the vote.\n\nBrothers' assassinations\n\nKennedy was sworn into the Senate on November 7, 1962. He maintained a deferential attitude towards the older Southern members when he first entered the Senate. He recognized the seniority system in the Senate, avoiding publicity and focusing on committee work and local issues.[24] Compared to his brothers in office, he lacked John's sophistication and Robert's intense, sometimes grating drive, but was more affable than either of them.\n\nOn November 22, 1963, Kennedy was presiding over the Senate—a task given to junior members—when an aide rushed in to tell him that his brother, President John F. Kennedy, had been shot. His brother Robert soon told him that the President was dead. Ted and his sister Eunice Kennedy Shriver immediately flew to the family home in Hyannis Port, Massachusetts, to give the news to their invalid father, who had been afflicted by a stroke suffered two years earlier.\n\nTed Kennedy, accompanied by his brother Robert and sister-in-law Jacqueline , walks from the White House for the funeral procession accompanying President Kennedy's casket to Cathedral of St. Matthew the Apostle.\n\nKennedy in 1967\n\nKennedy initially said he had \"no reservations\" about the expanding U.S. role in the Vietnam War and acknowledged that it would be a \"long and enduring struggle.\" He held hearings on the plight of refugees in the conflict, which revealed that the U.S. government had no coherent policy for refugees.[25] Kennedy also tried to reform \"unfair\" and \"inequitable\" aspects of the draft. By the time of a January 1968 trip to Vietnam, Kennedy was disillusioned by the lack of U.S. progress, and suggested publicly that the U.S. should tell South Vietnam, \"Shape up or we're going to ship out.\"[26] On March 31, 1968 President Lyndon Johnson made a surprise announcement that he would not seek the Presidency again in the 1968 election.\n\nTed initially advised his brother Robert against challenging for the Democratic nomination in the 1968 presidential election. Once Eugene McCarthy's strong showing in the New Hampshire primary led to Robert's presidential campaign starting in March 1968, Ted recruited political leaders for endorsements to his brother in the western states.[27] Ted was in San Francisco when his brother Robert won the crucial California primary on June 4, 1968, and then after midnight, Robert was shot in Los Angeles and died a day later. Ted Kennedy was devastated by his brother's death, as he was closest to Robert among those in the Kennedy family. Kennedy aide Frank Mankiewicz said of seeing Ted at the hospital where Robert lay mortally wounded: \"I have never, ever, nor do I expect ever, to see a face more in grief.\" At Robert's funeral, Kennedy eulogized his older brother:\n\nMy brother need not be idealized, or enlarged in death beyond what he was in life; to be remembered simply as a good and decent man, who saw wrong and tried to right it, saw suffering and tried to heal it, saw war and tried to stop it. Those of us who loved him and who take him to his rest today, pray that what he was to us and what he wished for others will some day come to pass for all the world. As he said many times, in many parts of this nation, to those he touched and who sought to touch him: \"Some men see things as they are and say why. I dream things that never were and say why not.\"[28]\n\nAfter the deaths of his brothers, Kennedy took on the role of a surrogate father for his 13 nephews and nieces.[29] By some reports, he also negotiated the October 1968 marital contract between Jacqueline Kennedy and Aristotle Onassis.[30]\n\nChappaquiddick incident\n\nFollowing Republican Richard Nixon's victory in November, Kennedy was widely assumed to be the front-runner for the 1972 Democratic nomination.[31] In January 1969, Kennedy defeated Louisiana Senator Russell B. Long by a 31–26 margin to become Senate Majority Whip, the youngest person to attain that position.[32] While this further boosted his presidential image, he also appeared conflicted by the inevitability of having to run for the position;[29] \"Few who knew him doubted that in one sense he very much wanted to take that path\", Time magazine reported, but \"he had a fatalistic, almost doomed feeling about the prospect\".\n\nOn the night of July 18, 1969, Kennedy was at Chappaquiddick Island on the eastern end of Martha's Vineyard. He was hosting a party for the Boiler Room Girls, a group of young women who had worked on his brother Robert's ill-fated 1968 presidential campaign.[31] Kennedy left the party with one of the women, 28-year-old Mary Jo Kopechne.\n\nDriving a 1967 Oldsmobile Delmont 88, he attempted to cross the Dike Bridge, which did not have a guardrail at that time. Kennedy later denied that he was drunk but he lost control of his vehicle and crashed in the Poucha Pond inlet, which was a tidal channel on Chappaquiddick Island. Kennedy escaped from the overturned vehicle, and, by his description, dove below the surface seven or eight times, vainly attempting to reach and rescue Kopechne. Ultimately, he swam to shore and left the scene, with Kopechne still trapped inside the vehicle. Kennedy did not report the accident to authorities until the next morning, by which time Kopechne's body had already been discovered.[31] Kennedy's cousin Joe Gargan later said that he and Kennedy's friend Paul Markham, both of whom were at the party and came to the scene, urged Kennedy to report it at the time.[33]\n\nA week after the incident, Kennedy pleaded guilty to leaving the scene of an accident and was given a suspended sentence of two months in jail. That night, he gave a national broadcast in which he said, \"I regard as indefensible the fact that I did not report the accident to the police immediately,\" but he denied driving under the influence of alcohol and also denied any immoral conduct between him and Kopechne.[31] Kennedy asked the Massachusetts electorate whether he should stay in office or resign; after getting a favorable response in messages sent to him, Kennedy announced on July 30 that he would remain in the Senate and run for re-election the next year.[34]\n\nIn January 1970, an inquest into Kopechne's death was held in Edgartown, Massachusetts. At the request of Kennedy's lawyers, the Massachusetts Supreme Judicial Court ordered the inquest to be conducted in secret.[35] The presiding judge, James A. Boyle, concluded that some aspects of Kennedy's story about that night were not true, and that negligent driving \"appears to have contributed\" to the death of Kopechne. A grand jury on Martha's Vineyard conducted a two-day investigation in April 1970 but issued no indictment, after which Boyle made his inquest report public. Kennedy deemed its conclusions \"not justified.\"[31] Questions about the Chappaquiddick incident generated a large number of articles and books during the following years.\n\n1980 presidential campaign\n\nThe Chappaquiddick incident impacted any Presidential aspirations Kennedy might have had in 1972 and 1976. In 1980, he would have to face an incumbent President from his own party. As the Democratic nominee, Jimmy Carter developed little relationship with Kennedy during his primary campaign, the convention, or the general election campaign.[36] This continued during the Carter administration, which were difficult year for Kennedy. He had been the most important Democrat in Washington ever since his brother Robert's death, but now Carter was, and Kennedy at first did not have a full committee chairmanship with which to wield influence.[37] Carter in turn sometimes resented Kennedy's status as a political celebrity.[3] Despite generally similar ideologies, their priorities were different. Kennedy expressed to reporters that he was content with his congressional role and viewed presidential ambitions as almost far-fetched, but Kennedy finally decided to seek the Democratic nomination in the 1980 presidential election by launching an unusual, insurgent campaign against the incumbent Carter.[38]\n\nA midsummer 1978 poll showed that Democrats preferred Kennedy over Carter by a 5-to-3 margin. Labor unions urged Kennedy to run, as did some Democratic party officials who feared that Carter's unpopularity could result in heavy losses in the 1980 congressional elections.[39] Kennedy decided to run in August 1979, when polls showed him with a 2-to-1 advantage over Carter;[40] Carter's approval rating slipped to 19 percent.[41] Kennedy formally announced his campaign on November 7, 1979, at Boston's Faneuil Hall.[42] The Iranian hostage crisis, which began on November 4, and the Soviet invasion of Afghanistan, which began on December 27, prompted the electorate to rally around the president and allowed Carter to pursue a Rose Garden strategy of staying at the White House, which kept Kennedy's campaign out of the headlines.[42]\n\nKennedy's campaign staff was disorganized and Kennedy was initially an ineffective campaigner.[43] The Chappaquiddick incident emerged as a more significant issue than the staff had expected, with several newspaper columnists and editorials criticizing Kennedy's answers on the matter.[44] In the January 1980 Iowa caucuses that initiated the primaries season, Carter demolished Kennedy by a 59–31 percent margin. Kennedy lost three New England contests.[42] Kennedy did form a more coherent message about why he was running, saying at Georgetown University: \"I believe we must not permit the dream of social progress to be shattered by those whose promises have failed.\"[45] However, concerns over Chappaquiddick and issues related to personal character prevented Kennedy from gaining the support of many people who were disillusioned with Carter.[46] During a St. Patrick's Day Parade in Chicago, Kennedy had to wear a bullet-proof vest due to assassination threats, and hecklers yelled \"Where's Mary Jo?\" at him.[47] In the key March 18 primary in Illinois, Kennedy failed to gain the support of Catholic voters, and Carter crushed him, winning 155 of 169 delegates.[48]\n\nWith little mathematical hope of winning the nomination and polls showing another likely defeat in the New York primary, Kennedy prepared to withdraw from the race. However, partially due to Jewish voter unhappiness with a U.S. vote at the United Nations against Israeli settlements in the West Bank, Kennedy staged an upset and won the March 25 vote by a 59–41 percent margin. Carter responded with an advertising campaign that attacked Kennedy's character in general without explicitly mentioning Chappaquiddick, but Kennedy still managed a narrow win in the April 22 Pennsylvania primary.[42] Carter won 11 of 12 primaries held in May, while on the June 3 Super Tuesday primaries, Kennedy won California, New Jersey, and three smaller states out of eight contests.[49] Overall, Kennedy had won 10 presidential primaries against Carter, who won 24.\n\nAlthough Carter now had enough delegates to clinch the nomination, Kennedy carried his campaign on to the 1980 Democratic National Convention in August in New York, hoping to pass a rule there that would free delegates from being bound by primary results and open the convention. This move failed on the first night of the convention, and Kennedy withdrew.[42] On the second night, August 12, Kennedy delivered the most famous speech of his career. Drawing on allusions to and quotes of Martin Luther King Jr., Franklin Delano Roosevelt, and Alfred Lord Tennyson to say that American liberalism was not passé,[50] he concluded with the words:\n\nFor me, a few hours ago, this campaign came to an end. For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives, and the dream shall never die.[51]\n\nThe Madison Square Garden audience reacted with wild applause and demonstrations for half an hour.[42] On the final night, Kennedy arrived late after Carter's acceptance speech and while he shook Carter's hand, he failed to raise Carter's arm in the traditional show of party unity.[48] Carter's difficulty in securing the assistance of Kennedy supporters during the election campaign has long been considered as a contributing factor to his November defeat by Ronald Reagan.\n\nSenate Career\n\nHealth Care\n\nKennedy giving a presentation on his healthcare proposal in June 1971\n\nAt the end of 1968, Kennedy had joined the new Committee for National Health Insurance at the invitation of its founder, United Auto Workers president Walter Reuther.[52] In May 1970, Reuther died and Senator Ralph Yarborough, chairman of the full Senate Labor and Public Welfare Committee and its Health subcommittee, lost his primary election, propelling Kennedy into a leadership role on the issue of national health insurance.[53] Kennedy introduced a bipartisan bill in August 1970 for single-payer universal national health insurance with no cost sharing, paid for by payroll taxes and general federal revenue. Health care would remain one of the issues that Kennedy would champion throughout his career.\n\nIn February 1971, President Nixon proposed health insurance reform—an employer mandate to offer private health insurance if employees volunteered to pay 25 percent of premiums, federalization of Medicaid for the poor with dependent minor children, and support for health maintenance organizations. Hearings on national health insurance were held in 1971, but no bill had the support of House Ways and Means and Senate Finance Committee chairmen Representative Wilbur Mills and Senator Russell Long.[54] Kennedy sponsored and helped pass the limited Health Maintenance Organization Act of 1973.[55]\n\nIn February 1974, President Nixon proposed more comprehensive health insurance reform—an employer mandate to offer private health insurance if employees volunteered to pay 25 percent of premiums, replacement of Medicaid by state-run health insurance plans available to all with income-based premiums and cost sharing, and replacement of Medicare with a new federal program that eliminated the limit on hospital days, added income-based out-of-pocket limits, and added outpatient prescription drug coverage.[56] In April 1974, Kennedy and Mills introduced a bill for near-universal national health insurance with benefits identical to the expanded Nixon plan, but with mandatory participation by employers and employees through payroll taxes. Both plans were criticized by labor, consumer, and senior citizen organizations because of their substantial cost sharing.[57] In August 1974, after Nixon's resignation and President Ford's call for health insurance reform, Mills tried to advance a compromise based on Nixon's plan but with mandatory participation by employers and employees through premiums to private health insurance companies. He gave up when he was unable to get more than a 13–12 majority of his committee to support his compromise plan.\n\nAfter the 1976 election of President Carter, Kennedy renewed his efforts. As a candidate, Carter had proposed health care reform that included key features of Kennedy's national health insurance bill, but in December 1977, President Carter told Kennedy his bill must be changed to preserve a large role for private insurance companies, minimize federal spending (precluding payroll tax financing), and be phased-in so as to not interfere with Carter's paramount domestic policy objective—balancing the federal budget.[58] Kennedy and labor compromised, making the requested changes, but broke with Carter in July 1978 when he would not commit to pursuing a single bill with a fixed schedule for phasing-in comprehensive coverage.[58] Frustrated by Carter's budgetary concerns and political caution,[2] Kennedy said in a December 1978 speech on national health insurance at the Democratic midterm convention that \"sometimes a party must sail against the wind\" and in particular should provide health care as \"a basic right for all, not just an expensive privilege for the few.\"[59]\n\nIn May 1979, Kennedy proposed a new bipartisan universal national health insurance bill. Provision included a choice of competing federally regulated private health insurance plans with no cost sharing-financed by income-based premiums via an employer mandate and individual mandate-replacement of Medicaid by government payment of premiums to private insurers, and enhancement of Medicare by adding prescription drug coverage and eliminating premiums and cost sharing.[60] In June 1979, Carter proposed more limited health insurance reform—an employer mandate to provide catastrophic private health insurance plus coverage without cost sharing for pregnant women and infants, federalization of Medicaid with extension to all of the very poor, plus enhancement of Medicare by adding catastrophic coverage. Neither plan gained any traction in Congress and the failure to come to agreement represented the final political breach between the two. Carter wrote in 1982 that Kennedy's disagreements with Carter's proposed approach \"ironically\" thwarted Carter's efforts to provide a comprehensive health-care system for the country.[61] In turn, Kennedy wrote in his memoir that his relationship with Carter was \"unhealthy\" and that \"Clearly President Carter was a difficult man to convince – of anything.\"[62]\n\nMuch later, following the failure of the Clinton health care plan, Kennedy went against his previous strategy and sought incremental measures instead.[63] Kennedy worked with Republican Senator Nancy Kassebaum to create and pass the Health Insurance Portability and Accountability Act in 1996, which set new marks for portability of insurance and confidentiality of records. The same year, Kennedy's Mental Health Parity Act forced insurance companies to treat mental health payments the same as others with respect to limits reached. In 1997, Kennedy was the prime mover behind the State Children's Health Insurance Program,[64] which used increased tobacco taxes to fund the largest expansion of taxpayer-funded health insurance coverage for children in the U.S. since Medicaid began in the 1960s.\n\nForeign Policy\n\nSenator Kennedy meeting with Justice Minister Horst Ehmke at Bonn, West Germany in April 1971\n\nIn April 1974, Kennedy traveled to the Soviet Union, where he met with leader Leonid Brezhnev and advocated a full nuclear test ban as well as relaxed emigration, gave a speech at Moscow State University, met with Soviet dissidents, and secured an exit visa for famed cellist Mstislav Rostropovich.[65] Kennedy's Subcommittee on Refugees and Escapees continued to focus on Vietnam, especially after the Fall of Saigon in 1975.\n\nKennedy visited China on a goodwill mission in late December 1977, meeting with leader Deng Xiaoping and eventually gained permission for a number of Mainland Chinese nationals to leave the country; in 1978, he also visited the Soviet Union, meeting with Brezhnev and also with dissidents there again.[66] During the 1970s, Kennedy also showed interest in nuclear disarmament, and as part of his efforts in this field even visited Hiroshima in January 1978 and gave a public speech to that effect at Hiroshima University.[67] He became chairman of the Senate Judiciary Committee in 1978.\n\nAfter the election of Ronald Reagan, Kennedy became very visible in opposing aspects of the foreign policy of the Reagan administration, including U.S. intervention in the Salvadoran Civil War and U.S. support for the Contras in Nicaragua, and in opposing Reagan-supported weapons systems, including the B-1 bomber, the MX missile, and the Strategic Defense Initiative. Kennedy became the Senate's leading advocate for a nuclear freeze and was a critic of Reagan's confrontational policies toward the Soviet Union.[68][69]\n\nA 1983 KGB memo indicates that Kennedy engaged in back-channel communication with the Soviet Union. According to a May 14, 1983 memorandum from KGB chairman Viktor Chebrikov to general secretary Yuri Andropov, former U.S. Senator John Tunney—a friend and former college roommate of Kennedy's—visited Moscow that month and conveyed a message from Kennedy to Andropov.[70] The memo indicates that the stated purpose of the communication was to \"'root out the threat of nuclear war', 'improve Soviet-American relations' and 'define the safety of the world'\". Chebrikov wrote that Kennedy was \"'very troubled by the current state of Soviet-American relations'\" and believed that the \"'only real threats to Reagan [were] problems of war and peace and Soviet-American relations'\". Chebrikov added that those issues, \"'according to the senator, will without a doubt become the most important of the [1984] election campaign'\".[71] Kennedy reportedly offered to visit Moscow \"'to arm Soviet officials with explanations regarding problems of nuclear disarmament so they may be better prepared and more convincing during appearances in the USA'\" and to set up U.S. television appearances for Andropov.[70]\n\nChebrikov also noted \"a little-hidden secret that [Kennedy] intended to run for president in 1988 and that the Democratic Party 'may officially turn to him to lead the fight against the Republicans' in 1984 — turning the proposal from one purely about international cooperation to one tinged with personal political aspiration.\"[71] Andropov was unimpressed by Kennedy's overtures.[72] After the Chebrikov memo was unearthed, both Tunney and a Kennedy spokesperson denied that it was true.[71]\n\nKennedy staged a high-profile trip to South Africa in January 1985.[73] He defied both the apartheid government's wishes and militant leftist AZAPO demonstrators by spending a night in the Soweto home of Bishop Desmond Tutu and also visited Winnie Mandela, wife of imprisoned black leader Nelson Mandela.[42] Upon returning, Kennedy became a leader in the push for economic sanctions against South Africa; collaborating with Senator Lowell Weicker, he secured Senate passage, and the overriding of Reagan's veto, of the Comprehensive Anti-Apartheid Act of 1986.[73] Despite their many political differences, Kennedy and Reagan had a good personal relationship,[74] and with the administration's approval Kennedy traveled to the Soviet Union in 1986 to act as a go-between in arms control negotiations with reformist Soviet leader Mikhail Gorbachev.[42] The discussions were productive, and Kennedy also helped gain the release of a number of Soviet Jewish refuseniks, including Anatoly Shcharansky.[75]\n\nSupreme Court Confirmations\n\nRobert Bork\n\nOne of Kennedy's biggest battles in the Senate came with Reagan's July 1987 nomination of Judge Robert Bork to the U.S. Supreme Court. Kennedy saw a possible Bork appointment as leading to a dismantling of civil rights law that he had helped put into place, and feared Bork's originalist judicial philosophy.[42] Kennedy's staff had researched Bork's writings and record, and within an hour of the nomination – which was initially expected to succeed – Kennedy went on the Senate floor to announce his opposition:\n\nRobert Bork's America is a land in which women would be forced into back-alley abortions, blacks would sit at segregated lunch counters, rogue police could break down citizens' doors in midnight raids, schoolchildren could not be taught about evolution, writers and artists could be censored at the whim of the Government, and the doors of the Federal courts would be shut on the fingers of millions of citizens ...[76]\n\nThe incendiary rhetoric of what became known as the \"Robert Bork's America\" speech enraged Bork supporters, who considered it slanderous, and worried some Democrats as well.[76] Bork responded, \"There was not a line in that speech that was accurate.\"[77] In 1988, an analysis published in the Western Political Quarterly of amicus curiae briefs filed by U.S. Solicitors General during the Warren and Burger Courts found that during Bork's tenure in the position during the Nixon and Ford Administrations (1973–1977), Bork took liberal positions in the aggregate as often as Thurgood Marshall did during the Johnson Administration (1965–1967) and more often than Wade H. McCree did during the Carter Administration (1977–1981), in part because Bork filed briefs in favor of the litigates in civil rights cases 75 percent of the time (contradicting a previous review of his civil rights record published in 1983).[78]\n\nHowever, the Reagan administration was unprepared for the assault, and the speech froze some Democrats from supporting the nomination and gave Kennedy and other Bork opponents time to prepare the case against him.[79] When the September 1987 Judiciary Committee hearings began, Kennedy challenged Bork forcefully on civil rights, privacy, women's rights, and other issues. Bork's own demeanor hurt him,[76] and the nomination was defeated both in committee and the full Senate.[42] The tone of the Bork battle changed the way Washington worked – with controversial nominees or candidates now experiencing all-out war waged against them – and the ramifications of it were still being felt decades later.[79]\n\nClarence Thomas\n\nBork and Clarence Thomas were the two most contentious Supreme Court nominations in United States history.[80] When the Thomas hearings began in September 1991, Kennedy pressed Thomas on his unwillingness to express an opinion about Roe v. Wade, but the nomination appeared headed for success.[81] When Anita Hill brought the sexual harassment charges against Thomas the following month, the nomination battle dominated public discourse. Kennedy was hamstrung by his past reputation and the ongoing developments in the William Kennedy Smith rape case.[82] He said almost nothing until the third day of the Thomas–Hill hearings, and when he did it was criticized by Hill supporters for being too little, too late.\n\nBiographer Adam Clymer rated Kennedy's silence during the Thomas hearings as the worst moment of his Senate career. Writer Anna Quindlen said \"[Kennedy] let us down because he had to; he was muzzled by the facts of his life.\"[82] On the day before the full Senate vote, Kennedy gave an impassioned speech against Thomas, declaring that the treatment of Hill had been \"shameful\" and that \"[t]o give the benefit of the doubt to Judge Thomas is to say that Judge Thomas is more important than the Supreme Court.\"[83] He then voted against the nomination. Thomas was confirmed by a 52–48 vote, one of the narrowest margins ever for a successful nomination.[82]\n\nLion of the Senate\n\nDid you know? Ted Kennedy, younger brother of President John F. Kennedy and Robert F. Kennedy , was known as the \"The Lion of the Senate\" due to his long tenure and influence\n\nKennedy's role as a liberal lion in the Senate came to the fore in 1995, when the Republican Revolution took control and legislation intending to fulfill the Contract with America was coming from Newt Gingrich's House of Representatives. Many Democrats in the Senate and the country overall felt depressed but Kennedy rallied forces to combat the Republicans.[84] By the beginning of 1996, most of the Contract had failed to pass the Senate and the Democrats could once again move forward with legislation, almost all of it coming out of Kennedy's staff.[85]\n\nKennedy's official Senate portrait in the 1990s\n\nIn 1996, Kennedy secured an increase in the minimum wage, which was one of his favorite issues;[86] there would not be another increase for ten years.\n\nAfter the long, disputed post-presidential election battle in Florida in 2000, many Democrats in Congress did not want to work with incoming President George W. Bush. Kennedy, however, saw Bush as genuinely interested in a major overhaul of elementary and secondary education, Bush saw Kennedy as a potential major ally in the Senate, and the two partnered together on the legislation.[87] Kennedy accepted provisions governing mandatory student testing and teacher accountability that other Democrats and the National Education Association did not like, in return for increased funding levels for education. The No Child Left Behind Act was passed by Congress in May and June 2001 and signed into law by Bush in January 2002. Kennedy soon became disenchanted with the implementation of the act, however, saying for 2003 that it was $9 billion short of the $29 billion authorized. Kennedy said, \"The tragedy is that these long overdue reforms are finally in place, but the funds are not,\"[87] and accused Bush of not living up to his personal word on the matter. Other Democrats concluded that Kennedy's penchant for cross-party deals had gotten the better of him. The White House defended its spending levels given the context of two wars going on. He would continue his cross-party deals in the coming years.\n\nDespite the strained relationship between Kennedy and Bush over No Child Left Behind spending, the two attempted to work together again on extending Medicare to cover prescription drug benefits. Kennedy's strategy was again doubted by other Democrats, but he saw the proposed $400 billion program as an opportunity that should not be missed. However, when the final formulation of the Medicare Prescription Drug, Improvement, and Modernization Act contained provisions to steer seniors towards private plans, Kennedy switched to opposing it. It passed in late 2003, and led Kennedy to again say he had been betrayed by the Bush administration.\n\nAfter Bush won a second term in the 2004 general election, Kennedy continued to oppose him on Iraq and many other issues. However, Kennedy sought to partner with Republicans again on the matter of immigration reform in the context of the ongoing United States immigration debate. Kennedy was chair of the United States Senate Judiciary Subcommittee on Immigration, Border Security, and Refugees, and in 2005, Kennedy teamed with Republican Senator John McCain on the Secure America and Orderly Immigration Act. The \"McCain-Kennedy bill\" did not reach a Senate vote, but provided a template for further attempts at dealing comprehensively with legalization, guest worker programs, and border enforcement components. Kennedy returned again with the Comprehensive Immigration Reform Act of 2007, which was sponsored by an ideologically diverse, bipartisan group of senators[88] and had strong support from the Bush administration. The bill aroused furious grassroots opposition among talk radio listeners and others as an \"amnesty\" program,[89] and despite Kennedy's last-minute attempts to salvage it, failed a cloture vote in the Senate.[90] Kennedy was philosophical about the defeat, saying that it often took several attempts across multiple Congresses for this type of legislation to build enough momentum for passage.\n\nPortrait of Kennedy in the mid-2000s\n\nSupport for Obama\n\nFollowing his endorsement of Barack Obama , Kennedy staged a campaign appearance with Obama in Hartford, Connecticut, on February 4, 2008, the day before the Super Tuesday primaries.\n\nKennedy remained neutral as the 2008 Democratic nomination battle between Senators Hillary Clinton and Barack Obama intensified, because his friend Chris Dodd was also running for the nomination.[91] The initial caucuses and primaries were split between Clinton and Obama. When Dodd withdrew from the race, Kennedy became dissatisfied with the tone of the Clinton campaign and what he saw as racially tinged remarks by Bill Clinton [92] Kennedy gave an endorsement to Obama on January 28, 2008, despite appeals by both Clintons not to do so.[93] In a move that was seen as a symbolic passing of the torch, Kennedy said that it was \"time again for a new generation of leadership,\" and compared Obama's ability to inspire with that of his fallen brothers.[92] In return, Kennedy gained a commitment from Obama to make universal health care a top priority of his administration if he were elected.[91] Kennedy's endorsement was considered among the most influential that any Democrat could get, and raised the possibility of improving Obama's vote-getting among unions, Hispanics, and traditional base Democrats.[93] It dominated the political news, and gave national exposure to a candidate who was still not well known in much of the country, as the Super Tuesday primaries across the nation approached.[94]\n\nIllness and death\n\nOn May 17, 2008, Kennedy suffered a seizure, which was followed by a second seizure as he was being rushed from the Kennedy Compound to Cape Cod Hospital and then by helicopter to Massachusetts General Hospital in Boston. Within days, doctors announced that Kennedy had a malignant glioma, a type of cancerous brain tumor. The grim diagnosis brought reactions of shock and prayer from many senators of both parties and from President Bush.[95]\n\nKennedy speaks during the first night of the 2008 Democratic National Convention in Denver, Colorado , while delegates hold signs reading \"KENNEDY\"\n\nKennedy made his first post-illness public appearance on July 9, when he surprised the Senate by showing up to supply the added vote to break a Republican filibuster against a bill to preserve Medicare fees for doctors.[96] In addition, Kennedy was ill from an attack of kidney stones. Against the advice of some associates,[97] he insisted on appearing during the first night of the 2008 Democratic National Convention on August 25, 2008, where a video tribute to him was played. Introduced by his niece Caroline Kennedy, the senator said, \"It is so wonderful to be here. Nothing – nothing – is going to keep me away from this special gathering tonight.\" He then delivered a speech to the delegates (which he had to memorize, as his impaired vision left him unable to read a teleprompter) in which, reminiscent of his speech at the 1980 Democratic National Convention, he said, \"this November, the torch will be passed again to a new generation of Americans. So, with Barack Obama and for you and for me, our country will be committed to his cause. The work begins anew. The hope rises again. And the dream lives on.\"[98] The dramatic appearance and speech electrified the convention audience,[97] as Kennedy vowed that he would be present to see Obama inaugurated.[98]\n\nOn January 20, 2009, Kennedy attended Barack Obama's presidential inauguration, but then suffered a seizure at the luncheon immediately afterwards. He was taken by wheelchair from the Capitol building and then by ambulance to Washington Hospital Center. Doctors attributed the episode to \"simple fatigue.\" He was released from the hospital the following morning, and he returned to his home in Washington, D.C.[99]\n\nKennedy with President Obama, the day the Edward M. Kennedy Serve America Act was signed, April 21, 2009, four months before Kennedy's death\n\nWhen the 111th Congress began, Kennedy dropped his spot on the Senate Judiciary Committee to focus all his attentions on national health care issues, which he regarded as \"the cause of my life.\"[100] He saw the characteristics of the Obama administration and the Democratic majorities in Congress as representing the third and best great chance for universal health care, following the lost 1971 Nixon and 1993 Clinton opportunities, and as his last big legislative battle. He would not live to see the passage of the Affordable Care Act.\n\nBasilica of Our Lady of Perpetual Help in Boston\n\nFifteen months after he was initially diagnosed with brain cancer, Kennedy succumbed to the disease on August 25, 2009, at age 77 at his home in Hyannis Port, Massachusetts. In a statement, Kennedy's family said:\n\nWe've lost the irreplaceable center of our family and joyous light in our lives, but the inspiration of his faith, optimism, and perseverance will live on in our hearts forever. He loved this country and devoted his life to serving it.[101]\n\nWhen Kennedy died in August 2009, he was the second-most senior member of the Senate (after President pro tempore Robert Byrd of West Virginia) and the third longest-serving senator of all time, behind Byrd and Strom Thurmond of South Carolina.\n\nWhen the Patient Protection and Affordable Care Act passed, Speaker Nancy Pelosi, who was instrumental in doing so, credited Kennedy's life work in her closing remarks on the House floor before the final vote. Kennedy's widow Vicki attended the signing of the Act, at which both she and President Obama wore blue \"Tedstrong\" bracelets.[102] Congressman Patrick Kennedy brought a copy of a national health insurance bill his father had introduced in 1970 as a gift for the president.[102] Patrick Kennedy then laid a note on his father's grave that said, \"Dad, the unfinished business is done.\"[103]\n\nLegacy\n\nDuring his tenure, Kennedy became one of the most recognizable and influential members of his party and was sometimes called a \"Democratic icon\"[104] as well as \"The Lion of the Senate\".[105] Kennedy and his Senate staff authored around 2,500 bills, of which more than 300 were enacted into law. Kennedy co-sponsored another 550 bills that became law after 1973. Kennedy was known for his effectiveness in dealing with Republican senators and administrations, sometimes to the irritation of other Democrats. During the 101st Congress under President George H. W. Bush, at least half of the successful proposals put forward by the Senate Democratic policy makers came out of Kennedy's Labor and Human Resources Committee.[106] During the 2000s, almost every bipartisan bill signed during the George W. Bush administration had significant involvement from Kennedy. A late 2000s survey of Republican senators ranked Kennedy first among Democrats in bipartisanship.[105] Kennedy strongly believed in the principle \"never let the perfect be the enemy of the good,\" and would agree to pass legislation he viewed as incomplete or imperfect with the goal of improving it down the road. In May 2008, soon-to-be Republican presidential nominee John McCain said, \"[Kennedy] is a legendary lawmaker and I have the highest respect for him. When we have worked together, he has been a skillful, fair and generous partner.\" Republican Governor of California and Kennedy relative by marriage Arnold Schwarzenegger described \"Uncle Teddy\" as \"a liberal icon, a warrior for the less fortunate, a fierce advocate for health-care reform, a champion of social justice here and abroad\" and \"the rock of his family\".[105]\n\nAfter Robert Kennedy's assassination in 1968, Ted was the most prominent living member of the Kennedy family and the last surviving son of Joseph P. Kennedy, Sr. and Rose Fitzgerald Kennedy. John F. Kennedy had said in 1957, \"Just as I went into politics because Joe died, if anything happened to me tomorrow, my brother Bobby would run for my seat in the Senate. And if Bobby died, Teddy would take over for him.\"[107] However, Ted was never able to carry on the \"Camelot\" mystique in the same way that both of his fallen brothers had, with much of it disappearing during his failed 1980 presidential bid. His negligence in the death of Mary Jo Kopechne at Chappaquiddick and his well-documented later personal problems further tarnished his image in relation to the Kennedy name,[1] and significantly damaged his chances of ever becoming president.[2][48] The Associated Press wrote that, \"Unlike his brothers, Edward M. Kennedy has grown old in public, his victories, defeats and human contradictions played out across the decades in the public glare.\"[108] But Kennedy's legislative accomplishments remained, and as The Boston Globe wrote, \"By the early 21st century, the achievements of the younger brother would be enough to rival those of many presidents.\"[1]\n\nKennedy's New York Times obituary described him via a character sketch: \"He was a Rabelaisian figure in the Senate and in life, instantly recognizable by his shock of white hair, his florid, oversize face, his booming Boston brogue, his powerful but pained stride. He was a celebrity, sometimes a self-parody, a hearty friend, an implacable foe, a man of large faith and large flaws, a melancholy character who persevered, drank deeply and sang loudly. He was a Kennedy.\"[2]\n\nAwards and honors\n\nSenator Kennedy received many awards and honors over the years. These include an honorary knighthood bestowed by Queen Elizabeth II of the United Kingdom, the Order of the Aztec Eagle from Mexico, the U.S. Presidential Medal of Freedom, the Order of the Merit of Chile, and honorary degrees from a number of institutions including Harvard University.\n\nWritings\n\nKennedy, Edward M. (ed.). The Fruitful Bough (Collected essays on Joseph P. Kennedy) . 1965.\n\n. 1965. Kennedy, Edward M. Decisions for a Decade: Policies and Programs for the 1970s . Doubleday, 1968.\n\n. Doubleday, 1968. Kennedy, Edward M. In Critical Condition: The Crisis in America's Health Care . Simon & Schuster, 1972. ISBN 978-0671213145\n\n. Simon & Schuster, 1972. ISBN 978-0671213145 Kennedy, Edward M. Our Day and Our Generation: The Words of Edward M. Kennedy . Simon & Schuster, 1979. ISBN 978-0671241339\n\n. Simon & Schuster, 1979. ISBN 978-0671241339 Kennedy, Edward M., and Mark Hatfield. Freeze!: How You Can Prevent Nuclear War . Bantam Books, 1982. ISBN 978-0553140774\n\n. Bantam Books, 1982. ISBN 978-0553140774 Kennedy, Edward M. America Back on Track . Viking Adult, 2006. ISBN 978-0670037643\n\n. Viking Adult, 2006. ISBN 978-0670037643 Kennedy, Edward M. My Senator and Me: A Dog's-Eye View of Washington, D.C. Scholastic Press, 2006. ISBN 978-0439650779\n\nScholastic Press, 2006. ISBN 978-0439650779 Kennedy, Edward M. True Compass: A Memoir. Twelve, 2009. ISBN 978-0446539258\n\nNotes\n\nReferences ISBN links support NWE through referral fees\n\nAll links retrieved February 26, 2023.\n\n\n\n\n\nParty Political Offices Preceded by:\n\nJohn F. Kennedy Democratic nominee for U.S. Senator from Massachusetts\n\n(Class 1)\n\n1962, 1964, 1970, 1976, 1982, 1988, 1994, 2000, 2006 Succeeded by: Martha Coakley Preceded by:\n\nRussell B. Long Senate Democratic Whip\n\n1969–1971 Succeeded by: Robert Byrd United States Senate Preceded by:\n\nBenjamin A. Smith II U.S. Senator (Class 1) from Massachusetts\n\n1962–2009\n\nServed alongside: Leverett Saltonstall, Edward Brooke, Paul Tsongas, John Kerry Succeeded by: Paul G. Kirk Preceded by:\n\nRussell B. Long Senate Majority Whip\n\n1969–1971 Succeeded by: Robert Byrd Preceded by:\n\nJames Eastland Chair of the Senate Judiciary Committee\n\n1978–1981 Succeeded by: Strom Thurmond Preceded by:\n\nOrrin Hatch Chair of the Senate Labor Committee\n\n1987–1995 Succeeded by: Nancy Kassebaum Preceded by:\n\nJim Jeffords Chair of the Senate Health Committee\n\n2001–2003 Succeeded by: Judd Gregg Preceded by:\n\nMike Enzi Chair of the Senate Health Committee\n\n2007–2009 Succeeded by: Tom Harkin Honorary Titles Preceded by:\n\nMaurice J. Murphy Jr. Baby of the Senate\n\n1962–1969 Succeeded by: Bob Packwood\n\n\n\n"}, {"url": "https://www.biography.com/political-figures/ted-kennedy", "page_content": "(1932-2009)\n\nWho Was Ted Kennedy?\n\nTed Kennedy was the youngest brother of John F. Kennedy and Robert Kennedy. He was elected to the Senate when he was 30, and continued to work in Congress throughout his life. Though marked by scandal, Kennedy was viewed as an icon of political progressivism and liberal thought by the time of his death, on August 25, 2009.\n\nEarly Life\n\nTed Kennedy was born Edward Moore Kennedy in Boston, Massachusetts, on February 22, 1932. The youngest of nine children, Ted grew up in a privileged, Irish Catholic family steeped in tradition. His mother, Rose Fitzgerald, was the daughter of Boston mayor John \"Honey Fitz\" Fitzgerald. His father, millionaire businessman Joseph P. Kennedy, held many important posts in and out of government.\n\nAs a result, the family moved frequently to accommodate Joesph's various posts. The children also changed schools often; by the age of 11, young Ted had already transferred schools 10 times. Despite his busy job, Joseph was careful to put his family first, always writing letters and sending telegrams when he was away, and welcoming any interruptions to his work that had to do with matters involving his children.\n\nTed's mother, Rose, was the member of the family who enforced a high level of academic performance in her children. Both parents, however, discouraged idleness and emphasized the importance of healthy competition and success. Dinner was often the staging ground for various quizzes on politics, history, and literature. Discussion and debate were highly encouraged. This taught Ted at an early age to immerse himself in his education and worldly pursuits. \"If I wanted to contribute something worthwhile to the conversation, I would have to talk about a book I was reading or an interesting place I had visited,\" he later said about his time at the Kennedy dinner table.\n\nBut Ted preferred sports to academics and lagged behind his brothers and sisters in school performance, so he learned other ways to hog the spotlight. He quickly became the family jester and an extrovert, always cracking jokes, planning family outings, and charming strangers with his friendly nature. As the baby he also developed a close emotional bond with both his parents. Their soft spot for their youngest child also took the pressure off of him to perform as rigorously as his elder siblings. This sense of lowered expectations would later haunt Kennedy as he tried to make his way into the professional world.\n\nTragedy would also mar Ted Kennedy's early life. In 1941, his father secretly had his older, developmentally delayed sister Rosemary lobotomized. The operation failed, and the family had her permanently institutionalized. Several years later, in 1944, brother Joe Jr. was killed when his plane was shot down during a Navy mission. In 1948, his sister, Kathleen, died in a private plane crash over the French Alps. These incidents, and the others to soon follow, would become part of what was later referred to as \"The Kennedy Curse.\" Ted worked hard to cheer his grief-laden family.\n\nIn 1946, Ted entered Milton Academy, an exclusive college prep boarding school eight miles south of Boston. At Milton, Ted immersed himself in athletics, drama, debate, and the glee club. While he performed well, he failed to be a standout student when compared to his over-achieving brothers. His father rode him relentlessly about his grades as well as his weight, and encouraged his son to push himself harder. Ted graduated in 1950, and followed his brothers to Harvard University.\n\nIvy League Life\n\nThe youngest Kennedy immediately immersed himself in Harvard's football team, but that Spring, he discovered that he was failing his Spanish class. In order to stay on the team, he would have to pass his final Spanish exam. Ted was expelled when, in desperation, he had another student take a Spanish exam in his place. The school would allow the boys to return in two years if they demonstrated good behavior. As a result, Kennedy enlisted for a two-year term in the U.S. Army and, through his father's influence, received an assignment as a guard at the Supreme Headquarters Allied Command in Paris, France.\n\nIn 1952, Kennedy enrolled again at Harvard and was accepted. He returned to his football career, where his performance attracted the interest of the Green Bay Packers, who tried to recruit Ted in 1955. Kennedy declined the offer, saying he was flattered but wanted to go to law school and enter another contact sport—politics. After Harvard, he studied for a brief time at the International Law School (The Hague) before entering Virginia Law School, where he received his law degree in 1959.\n\nSenate Career\n\nTed Kennedy campaigned for his brother, John F. Kennedy, in the 1960 presidential race. In 1962, shortly after his brother's victory, Ted was elected to John's former U.S. Senate seat. At the age of 30, he became a representative for the state of Massachusetts.\n\nBut tragedy was to plague the Kennedy family yet again. In 1963, John F. Kennedy, was assassinated in Dallas, Texas. A year later, Ted was in a plane crash and spent weeks in the hospital recovering from a back injury and internal bleeding. The injuries resulted in chronic pain, from which he would suffer throughout his life. Although he was unable to campaign actively for reelection for a full term in 1964, he was swept back into office by a landslide vote.\n\nBy 1967, Ted Kennedy began to speak out against the Vietnam War, which the United States had become deeply involved in during his brother John's administration. The United States government set a policy of containing communist expansion worldwide, and it felt Vietnam was the first line of defense. The U.S. government supported the protection of the fledgling democratic government in South Vietnam from the communist government in North Vietnam.\n\nKennedy, like many Democratic \"cold warriors,\" initially supported the war. However, as revelations of poor military planning on the part of the United States and political corruption in South Vietnam arose, Kennedy grew critical of America's involvement. He specifically debated the merits of the military draft, and decried the failure of the United States to provide for the victims of the war. Kennedy visited South Vietnam after the disastrous Tet Offensive, in which North Vietnamese regulars and Viet Cong insurgents simultaneously attacked more than 100 South Vietnamese cities. Kennedy stepped up his criticism, yet managed to stay on good terms with the Democratic administration of President Lyndon Johnson.\n\nTed Kennedy encountered family tragedy again when his closest brother, Robert Kennedy, was assassinated in 1968 during his presidential campaign. Eulogizing his brother, Ted stated, \"My brother need not be idealized, or enlarged in death beyond what he was in life; to be remembered simply as a good and decent man, who saw wrong and tried to right it, saw suffering and tried to heal it, saw war and tried to stop it.\"\n\nAfter Robert's death, Ted became the standard-bearer of the Kennedy clan. In 1969, he became the youngest-ever majority whip in the U.S. Senate, and an early front-runner for the Democratic presidential nomination. A year later, on the night of July 18, 1969, he accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha's Vineyard, Massachusetts. His companion in the car, 28-year-old Mary Jo Kopechne, drowned. A judge later found Ted Kennedy guilty of leaving the scene of an accident.\n\nKennedy was reelected to the Senate in 1970 despite the scandal, but the incident dogged his subsequent political career and discouraged him from running for president in 1972 and 1976. In 1980, however, Kennedy decided to launch a presidential campaign against Democratic incumbent Jimmy Carter. Kennedy felt Carter's difficult first term threatened to give control of the government to the Republicans, and the senator was unafraid of publicly criticizing the president. He vowed, however, to support Carter if he happened to win in the presidential primaries. Kennedy won only 10 of the primaries. At the 1980 Democratic National Convention, Kennedy conceded his presidential bid, but gave a hallmark convention speech.\n\nAs the 1980s transpired, President Ronald Reagan's sweeping changes of government gained a stronghold on both the presidency and Congress. Ted Kennedy's liberalism soon lost favor with many mainstream Democrats. Those years proved to be difficult for Kennedy as he grappled with minority party status and wrestled with his ideological nemesis, Reagan.\n\nKennedy also faced trouble in his personal life, as accusations of philandering and alcohol abuse surfaced. In 1982, after 24 years of turbulent marriage, he and wife Joan Bennett Kennedy divorced. In spite of his private struggles, Kennedy won reelection to the Senate in 1982 and again in 1988. In 1992 he remarried — this time to Washington, D.C., lawyer Victoria Reggie — and credits his recovery to his new relationship. Together the couple had two more children: Curran and Caroline Raclin.\n\nWith the Democratic victory of Bill Clinton for president in 1992, Ted Kennedy became once again an influential legislator supporting health-care reform. He was an author of the 1996 Health Insurance Portability and Accountability Act, which allows those who change or lose their job to maintain health insurance and protects the privacy of patient information. He also helped author the 1997 Children's Health Act, which increased access to health care for children age 18 and under.\n\nBut by the late 1990s, Ted Kennedy had become one of the Senate's most prominent members. He amassed a monumental legislative record, passing bills that affected the lives of many Americans of all classes and races. Kennedy sponsored legislation on immigration reform, criminal code reform, fair housing, public education, health care, AIDS research, and a variety of programs to aid the poor. On the Senate Judiciary Committee, he upheld liberal positions on abortion, capital punishment, and busing. Kennedy did this through political skill and bipartisan friendships with conservative Republicans, all the while maintaining his principled liberal roots. Teaming up with conservative stalwarts such as Senators Nancy Kassebaum, John McCain, and Orrin Hatch, Kennedy has cosponsored legislation on worker's healthcare benefits, immigration, and funding for traumatic brain injuries.\n\nKennedy extended his legislative record in the new millennium. He worked with both Democrats and Republicans to pass the No Child Left Behind Act, in an effort to close the achievement gap in public schools. Following the attacks of September 11, 2001, he coordinated with various agencies to respond to the mental health needs of victims' families. He also helped sponsor the bipartisan Bioterrorism Preparedness and Response Act to prevent, prepare for, and respond to bioterrorism emergencies. An initial opponent of the war in Iraq, Kennedy sponsored legislation to procure additional armored Humvees in Iraq battle zones. Throughout the rest of the decade, Kennedy sponsored or cosponsored legislation to enhance the ability of law enforcement to protect abducted children; reauthorize the Individuals with Disabilities Education Act; boost support for Hurricane Katrina victims; and expand Medicaid coverage.\n\nFinal Years and Death\n\nOn May 17, 2008, Ted Kennedy entered Cape Cod Hospital after suffering a seizure. Three days later doctors diagnosed the senator with a malignant glioma, an especially lethal type of brain tumor. Kennedy underwent surgery on June 2. \"I am deeply grateful to the people of Massachusetts and to my friends, colleagues and so many others across the country and around the world who have expressed their support and good wishes as I tackle this new and unexpected health challenge,\" Kennedy said in a statement released hours before the surgery began. \"I am humbled by the outpouring and am strengthened by your prayers and kindness.\"\n\nFollowing the operation, doctors pronounced the procedure successful, saying Kennedy should experience no permanent neurological effects. A spokeswoman for Kennedy also said the senator spoke with his wife shortly after surgery, telling her, \"I feel like a million bucks. I think I'll do that again tomorrow.\"\n\nAs the 2008 presidential primaries moved into full throttle in January, Kennedy endorsed Illinois Senator Barack Obama for president. After the primaries had all but determined Obama to be the presidential candidate, Kennedy made an emotional appearance at the Democratic Convention in Denver, Colorado. Looking somewhat weak, but elated, Kennedy delivered a short but rousing speech to hundreds of delegates.\n\nOn January 20, 2009, during Obama's post-inauguration luncheon at the U.S. Capitol, Kennedy suffered another seizure. Paramedics arrived quickly, and he was escorted to an ambulance by Senators John Kerry, Chris Dodd and Orrin Hatch. His doctor released a statement saying he believed the incident was a result of \"simple fatigue.\"\n\nAfter convalescing in Florida for several weeks, Kennedy called Senate Majority Leader Harry Reid and said, \"Kennedy, reporting for duty.\" On the following Monday, he came to the Senate to vote for its version of the economic stimulus package. In a statement released that day, he said, \"I returned to the Senate today to do all I can to support our President and his plan to get our country back on track. We face a historic crisis and must act quickly, boldly and responsibly to enable our economy to begin growing again in Massachusetts and across America.\"\n\nOn August 20, 2009, Kennedy made a sudden request to change Massachusetts state law, allowing for his swift replacement. The note to state leaders asked for an interim senator to be appointed in the case that his seat was suddenly vacated. Current law requires a special election to be held within five moths of the seat vacancy. It was Kennedy's hope that if his seat were to be unexpectedly empty, another Democratic senator could continue work on new healthcare legislation that Kennedy felt was vital to the country's progress.\n\nKennedy's aides insisted the move had nothing to do with the senator's health. But several days later, on August 25, 2009, Kennedy's struggle with brain cancer came to an end. He passed away in the evening at his Cape Cod, Massachusetts, home.\n\nSenator Kennedy was considered the \"liberal lion of the Senate.\" His massive compilation of legislative acts reflect his savvy political skills, pragmatic vision, and ability to reach across party lines. As the youngest member of a family with many larger-than-life figures, Ted Kennedy consistently proved that he was a formidable force in American politics—and one that left a legacy of public service to be studied, admired, and emulated.\n\nQUICK FACTS\n\nName: Ted Kennedy\n\nBirth Year: 1932\n\nBirth date: February 22, 1932\n\nBirth State: Massachusetts\n\nBirth City: Boston\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Known as the \"Lion of the Senate,\" Democrat Ted Kennedy was a staunch liberal who was elected to Congress nine times, spearheading many legislative reforms.\n\nIndustries\n\nU.S. Politics\n\nAstrological Sign: Pisces\n\nSchools\n\nInternational Law School (The Hague)\n\n\n\nVirginia Law School\n\n\n\nHarvard University\n\n\n\nMilton Academy\n\nCultural Associations\n\nIrish American\n\nDeath Year: 2009\n\nDeath date: August 25, 2009\n\nDeath State: Massachusetts\n\nDeath City: Hyannis Port\n\nDeath Country: Unites States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Ted Kennedy Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/political-figures/ted-kennedy\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: June 22, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.history.com/topics/us-government/ted-kennedy", "page_content": "Edward “Ted” Kennedy (1932-2009), the youngest brother of President John Kennedy (1917-1963), was a U.S. senator from Massachusetts from 1962 to 2009, making him one of the longest-serving senators in American history. Kennedy entered the Senate after winning a 1962 special election to fill the seat vacated by his brother John when he became president. During his career on Capitol Hill, Ted Kennedy was a spokesman for liberal causes, including civil rights, health care and immigration. A leader of the Democratic Party, he was known for his ability to work with those on both sides of the political aisle. In 1980, Kennedy, whose reputation was tarnished by a 1969 car accident, made a failed bid for the Democratic presidential nomination. Dubbed the “liberal lion of the Senate,” he died of cancer at age 77 and was buried at Arlington National Cemetery.\n\nTed Kennedy’s Childhood and Education\n\nEdward Moore Kennedy was born in Boston on February 22, 1932, the youngest of nine children of Joseph P. Kennedy Sr. (1888-1969), a wealthy financier who served as the first chairman of the Securities and Exchange Commission and later as ambassador to Great Britain, and Rose Fitzgerald Kennedy (1890-1995), the daughter of a Boston politician.\n\nDid you know? In 2011, Ted Kennedy’s son Patrick, an eight-term U.S. congressman from Rhode Island, resigned from politics. His exit marked the first time since 1947–when John Kennedy became a U.S. congressman from Massachusetts–that no member of the Kennedy family held elective office in Washington, D.C.\n\nAs a child, Kennedy moved between his family’s homes in Massachusetts, New York, Palm Beach and London, and attended 10 schools before graduating from Milton Academy in Massachusetts in 1950. He went on to attend Harvard University, the alma mater of his father and three older brothers. During his freshman year, he was expelled after a classmate took a Spanish exam in his place. Kennedy then enlisted in the U.S. Army, serving from 1951 to 1953, mostly in Europe. Afterward, he re-enrolled in Harvard, where he became a more serious student and played on the football team.\n\nAfter graduating in 1956, he attended the University of Virginia School of Law. While still a law student, he managed his brother John’s successful 1958 reelection campaign to the U.S. Senate, where he represented Massachusetts. The following year, Kennedy earned his law degree and was admitted to the Massachusetts bar.\n\nTed Kennedy’s Election to the U.S. Senate\n\nWhen John Kennedy made his 1960 run for the White House, Ted Kennedy campaigned for him in the Western states. A licensed pilot, he barnstormed around the region, meeting with delegates and trying bronco riding and ski jumping as a way to connect with people.\n\nIn November 1960, John Kennedy was elected America’s 35th president. The following month, a Kennedy family friend, Benjamin Smith (1916-1991), was appointed to fill the president-elect’s vacated Senate seat until a special election was held. On November 6, 1962, Ted Kennedy, who earlier that year had turned 30 (the minimum age requirement for a U.S. senator), won the special election in Massachusetts to serve out the remainder of his brother’s Senate term, ending in January 1965. Massachusetts voters reelected Kennedy to the seat eight more times, in 1964, 1970, 1976, 1982, 1988, 1994, 2000 and 2006.\n\nWith John Kennedy in the White House, Ted Kennedy in the Senate and their brother Robert (1925-1968) serving as the U.S. attorney general from 1961 to 1964 and as a U.S. senator from New York from 1965 to 1968, the glamorous, wealthy, Irish-Catholic Kennedys were often referred to as an American political dynasty.\n\nTed Kennedy’s Marriages and Family\n\nIn 1958 Ted Kennedy married Joan Bennett (1936-), who he met through his sister Jean (1928-); both women had attended Manhattanville College in New York. The couple had three children—Kara (1960-), Edward Jr. (1961-) and Patrick (1967-)—before divorcing in 1982. In 1992, Kennedy married Victoria Reggie (1954-), a Washington attorney with two children. Kennedy often spent time with his family sailing, which he described as his favorite pastime.\n\nTragedy Strikes the Kennedys\n\nOn November 22, 1963, tragedy struck the Kennedy family and the nation when 46-year-old President John Kennedy was assassinated in Dallas, Texas. He was the third Kennedy sibling to perish. The oldest child, Joseph Kennedy Jr. (1915-1944), a Navy pilot, died in World War II, and the second-eldest daughter, Kathleen (1920-1948), was killed in a plane crash in France. In June 1964, Ted Kennedy escaped death when the small plane he was riding in crashed in Massachusetts in bad weather, killing two people and leaving Kennedy with a broken back and other injuries that required a six-month hospital recuperation.\n\nOn June 5, 1968, tragedy struck again when 42-year-old Senator Robert Kennedy, who had just won the Democratic presidential primary in California, was assassinated in Los Angeles.\n\nWith Robert’s death, Ted Kennedy became the family patriarch–his father Joseph had suffered an incapacitating stroke in 1961–and a surrogate father to his two slain brothers’ 13 children.\n\nIncident at Chappaquiddick\n\nOn July 18, 1969, Ted Kennedy was involved in a controversial event that would mar the rest of his career. He accidentally drove his car off a bridge on Massachusetts’ Chappaquiddick Island, killing his passenger, Mary Jo Kopechne (1940-1969), who drowned. Kennedy did not report the incident to the authorities for nearly 10 hours, claiming the delay was due to the fact that he had suffered a concussion and was exhausted from attempting to rescue Kopechne.\n\nThe 37-year-old senator pled guilty to leaving the scene of an accident and received a two-month suspended sentence. However, Kennedy was plagued by questions about his behavior. He later referred to his actions as “inexcusable” and said that Kopechne’s death “haunts me every day of my life.”\n\nTed Kennedy’s Bid for the White House\n\nIn November 1979, Ted Kennedy announced he would run against President Jimmy Carter (1924-) for the 1980 Democratic presidential nomination. Kennedy won primaries in New York, California and eight other states, but his campaign was disorganized and hurt by lingering questions about Chappaquiddick. At the August 1980 Democratic National Convention, he withdrew his bid for the presidency and went on to deliver a fiery speech in which he said, “For me, a few hours ago, this campaign came to an end. For all those whose cares have been our concern, the work goes on, the cause endures, the hope still lives, and the dream shall never die.”\n\nKennedy never made another bid for the presidency.\n\nThe Liberal Lion of the Senate\n\nSome historians have called Ted Kennedy one of the most effective legislators in the history of the U.S. Senate. During nearly 47 years on Capitol Hill, his office wrote some 2,500 bills, over 300 of which became law. Additionally, over 550 bills that he co-sponsored became law. A skilled orator and gifted storyteller, Kennedy was known for his ability to collaborate with Democrats and Republicans alike.\n\nHe successfully fought for legislation concerning education, immigration reform, increases to the federal minimum wage, voting rights, AIDS care, various consumer protections and equal rights for minorities, the disabled, women and gay Americans. In 1972 he was the driving force behind the Women, Infants, and Children (WIC) program, which provides food assistance and access to health services for low-income women and their children, and he was instrumental in the passage of the Americans with Disabilities Act of 1990, which banned workplace discrimination against and required public accommodations for the disabled.\n\nKennedy referred to universal health insurance as “the cause of my life,” and for decades worked to achieve national health reform. Kennedy’s widow Victoria was present when President Barack Obama (1961-) signed historic health care legislation, the Patient Protection and Affordable Care Act, in March 2010.\n\nIn foreign policy matters, Kennedy was an opponent of the Vietnam War and in 2002 voted against authorizing the use of military force in Iraq. He worked for human rights in South America in the 1970s, championed U.S. government sanctions against apartheid-ruled South Africa in the 1980s, and helped broker a peace agreement in Northern Ireland in the late 1990s.\n\nTed Kennedy’s Final Years\n\nIn May 2008, Ted Kennedy was diagnosed with a malignant brain tumor. That August, despite his poor health, he made a rousing speech in his distinct Massachusetts accent at the Democratic National Convention in Denver. In his speech, the senator, who earlier that year had endorsed Barack Obama for president, invoked the legacy of the Kennedy family when he stated, “And this November the torch will be passed again to a new generation of Americans…The work begins anew. The hope rises again. And the dream lives on.”\n\nOn August 25, 2009, the 77-year-old Kennedy succumbed to brain cancer at his home in Hyannis Port, Massachusetts. At his funeral, which was attended by three former U.S. presidents, the late senator was eulogized by President Obama. Kennedy was buried at Virginia’s Arlington National Cemetery, near the graves of his brothers John and Robert. Kennedy’s memoir, “True Compass,” was published posthumously in September 2009."}, {"url": "https://www.biography.com/political-figures/kennedy-family-members", "page_content": "With their wealth and power, the Kennedys have been touted as the closest thing to royalty in America. Having left their homeland of Ireland in the 1840s to escape the potato famine, the Kennedys — starting with Boston-born Patrick Joseph \"P.J.\" Kennedy (1858-1929) — built their future from the ground up and became heavily involved in the Democratic Party in Boston.\n\nTwo generations later and beyond, the Kennedy name would expand its political reach to both the national and world stage, producing a U.S. president, a U.S. attorney general, four members of the U.S. House and Senate and a number of publicly appointed and elected government officials. What the Kennedys didn't anticipate, however, was that intertwined with their unimaginable ascent to power were a series of unimaginable tragedies.\n\nWhile not nearly a comprehensive list, here are a dozen notable Kennedys who've helped shape the American political landscape and contributed to their family's historical legacy of public service.\n\nJoseph P. Kennedy Sr.\n\nJoseph Kennedy; Photo: Pictures Inc./The LIFE Picture Collection via Getty Images\n\nThe patriarch of the Kennedy political dynasty, American businessman (1888-1969) was a prominent Irish-Catholic Democrat whose political ambitions were ultimately lived out through his sons John F. Kennedy, Robert F. Kennedy and Ted Kennedy.\n\nOutside of being a wealthy investor in real estate, alcohol and entertainment, Kennedy briefly served as a U.S. Securities and Exchange Commission chairman and an American ambassador to the U.K. Although he left a controversial legacy behind (he was known to have anti-Semitic and pro-Nazi leanings), he, along with his wife Rose and his children, were a testament to public service. Out of his nine children, he would outlive four.\n\nRose Fitzgerald Kennedy\n\nRose Fitzgerald Kennedy; Photo: Keystone-France/Gamma-Keystone via Getty Images\n\nA staunch Catholic, matriarch Rose F. Kennedy (1890-1995), grew up in a wealthy and political Irish-American household (her father, John F. Fitzgerald was the mayor of Boston). After a lengthy courtship with Joseph Kennedy Sr., which was partially due to her father's disdain for him, Rose married Kennedy in 1914 and the couple went on to have nine children.\n\nBefore Rose died at the age of 104, she was honored with the rank of Papal countess by Pope Pius XII for her exemplary religious life and devotion to Catholicism.\n\nJohn F. Kennedy\n\nJohn F. Kennedy; Photo: © CORBIS/Corbis via Getty Images\n\nAfter the tragic death of older brother Joseph P. Kennedy Jr., John F. Kennedy (1917-1963) took up the political mantle for the next generation of\n\nKennedys. A Harvard graduate, Kennedy later became a decorated Naval officer in World War II. After serving as a House member and Senator of Massachusetts, he reached the highest office of the land in 1961. At 43 Kennedy became America's youngest elected president.\n\nKennedy launched his administration at the bleakest point of the Cold War, later authorizing the failed Bay of Pigs invasion and taking the country through the Cuban Missile Crisis, which almost brought the U.S. and the Soviet Union to nuclear war.\n\nAfter Kennedy's assassination in 1963 by Lee Harvey Oswald, Vice President Lyndon B. Johnson took over the administration and brought forth many of Kennedy's civil rights and tax proposals.\n\nREAD MORE: Inside John F. Kennedy's Lifelong Admiration of Winston Churchill\n\nJacqueline Kennedy Onassis\n\nJacqueline Kennedy Onassis; Photo: Getty Images\n\nAs wife to John F. Kennedy and the youngest first lady of the United States, Jacqueline Kennedy Onassis (1929-1994) became an international fashion icon and transformed the White House through her various restoration projects. A graduate of George Washington University, Onassis first met the then-Congressman Kennedy in 1952 and married him the following year. She and Kennedy had a total of four children, two of whom survived.\n\nWhen JFK was assassinated in Dallas, Onassis' blood-stained pink dress and pillbox hat became a symbol of the tragedy. Known for her love for the arts and culture, Onassis helped shaped the \"Camelot Era\" mythology. She later married Greek shipping tycoon Aristotle Onassis (to much controversy) and became a book editor in New York City.\n\nREAD MORE: How Jacqueline Kennedy Transformed the White House and Left a Lasting Legacy\n\nRobert F. Kennedy\n\nRobert F. Kennedy; Photo: Bill Eppridge/The LIFE Picture Collection via Getty Images\n\nAs the seventh child of Joseph P. Kennedy and Rose Kennedy, Robert F. Kennedy went on to follow in his big brother JFK's footsteps, serving in the Navy and graduating from Harvard. After receiving his law degree from the University of Virginia, Kennedy worked at the Justice Department but soon after left his post to help his brother win a Senate seat in 1952.\n\nUnder JFK's administration, he became the 64th United States Attorney General and built his reputation on fighting organized crime, advocating for civil rights, and shaping U.S.-Cuba foreign policy.\n\nAfter JFK's assassination, Kennedy became a U.S. Senator in 1964 and ran as a presidential candidate of the Democratic Party in 1968. While campaigning in California that year, Kennedy was gunned down by a young Palestinian man, Sirhan Sirhan, who claimed he killed the senator for being a supporter of Israel.\n\nTed Kennedy\n\nTed Kennedy; Photo: Barbara Alper/Getty Images\n\nAs the ninth and last child born to Joseph P. Kennedy and Rose Kennedy, Edward \"Ted\" Kennedy (1932-2009) would end up having the largest influence on American politics than any of his siblings before him.\n\nWith the same Ivy League pedigree as his brothers before him, Kennedy prepared himself to live up to his family's name and even earned his way into the vacant Senate seat that older brother John left behind when he was elected president. (Kennedy would be elected eight more times to the Senate by the people of Massachusetts.)\n\nBut Kennedy's political career was in deep peril after the infamous Chappaquiddick incident in 1969, resulting in the accidental drowning death of Mary Jo Kopechne. After a failed attempt to win the presidential nomination in 1980, Kennedy continued his life of public service and became known as \"The Lion of the Senate,\" emerging as a symbol of American liberalism and one of the longest-serving senators in American history. His legislative record will be remembered for its advocacy for social and economic justice and towards the end of his life, universal health care.\n\nEunice Kennedy Shriver\n\nEunice Kennedy Shriver; Photo: Hulton Archive/Getty Images\n\nAs the fifth child born to Joseph P. and Rose Kennedy, Eunice Kennedy Shriver (1921-2009) was deeply affected by her sister, Rosemary, who was sent away to a psychiatric institution after undergoing a disastrous lobotomy for an intellectual disability.\n\nAfter graduating from Stanford University with a degree in sociology, Shriver worked at the U.S. State Department and the U.S. Department of Justice and later moved to Chicago to focus on social work. In 1968 she established the Special Olympics and later that year, hosted the First International Special Olympics Summer Games in Chicago, which provided children with physical and intellectual disabilities an opportunity to compete in athletics on a larger, organized scale. In 1984 she was honored with the Presidential Medal of Freedom for her work.\n\nFrom 1953 until her death in 2009, Eunice was married to Sergeant Shriver, a former U.S. Ambassador to France and U.S. Vice Presidential candidate. The couple went on to have five children.\n\nCaroline Kennedy\n\nCaroline Kennedy; Photo: Toby Canham/Getty Images\n\nDaughter of John F. Kennedy and Jackie Kennedy Onassis, Caroline Kennedy (b. 1957) has lived her life under the radar, despite the scrutiny and fame surrounding her family. She attended Harvard as an undergraduate like her father and went on to graduate from Columbia Law School. In 1986 she married designer Edwin Schlossberg, whom she met while working at the Metropolitan Museum of Art and together they have three children.\n\nAppointed by President Barack Obama, Kennedy served as U.S. ambassador to Japan from 2013 to 2017.\n\nJohn F. Kennedy Jr.\n\nJohn F. Kennedy Jr.; Photo: Brooks Kraft LLC/Sygma via Getty Images\n\nFrom being the three-year-old toddler famously saluting his fallen father's casket in 1963 to transforming into one of the most eligible bachelors in New York City, John F. Kennedy Jr. (1960-1999) couldn't manage to steer clear of the limelight like his older sister Caroline.\n\nWhile the Kennedy name had produced many Harvard alums, JFK Jr. paved his own way and attended Brown University for his undergraduate studies. After earning his law degree from New York University School of Law, he briefly served as a Manhattan assistant district attorney and dabbled in acting before ultimately becoming co-founder of George, a magazine fusing the world of politics and entertainment, in 1995.\n\nAfter marrying fashion publicist Carolyn Bessette in 1996, JFK Jr.'s life was cut short three years later when he accidentally flew his plane into the Atlantic, killing himself, Carolyn, and her older sister Lauren.\n\nREAD MORE: The Final Days of John F. Kennedy Jr.\n\nRobert F. Kennedy Jr.\n\nRobert F Kennedy Jr.; Photo: Rich Polk/Getty Images for Waterkeeper Alliance\n\nAs the first-born son of Robert and Ethel Kennedy, Robert F. Kennedy Jr. (b. 1954) was nine years old when his uncle JFK was assassinated and 14 when he lost his own father.\n\nIn honor of RFK Sr., Kennedy attended Harvard and got his law degree at the University of Virginia. He also earned his Masters of Law degree at Pace University, where he would later teach as a professor of environmental law.\n\nAs an environmental lawyer and activist, Kennedy worked at the Natural Resources Defense Council (NRDC) as a senior attorney (1986-2017) and the Hudson, New York waterways nonprofit called Riverkeeper as its chief prosecuting attorney (1984-2017). He has also authored multiple books and published essays regarding environmental issues.\n\nAlso known for his anti-vaccine stance, Kennedy has come under fire from both the public and his family in recent years.\n\nMaria Shriver\n\nMaria Shriver; Photo: Desiree Navarro/WireImage\n\nThe second eldest child and first daughter to Sergeant and Eunice Kennedy Shriver, Maria Shriver (b. 1955) has built a successful career as an award-winning broadcast journalist, philanthropist and children's book author.\n\nAfter graduating from Georgetown University in 1977, Shriver embarked on her broadcast career — working at both CBS and NBC. She later met and married actor Arnold Schwarzeneggar who, like his famous in-laws, had political ambitions of his own. After Schwarzeneggar won the governorship of California starting in 2003, Shriver served as its First Lady (2003-2011).\n\nThe couple divorced in 2011. They have four children together.\n\nPatrick J. Kennedy\n\nPatrick J. Kennedy; Photo: Paul Morigi/WireImage\n\nAs the youngest child of Ted and Joan Bennett Kennedy, Patrick J. Kennedy (b. 1967) hadn't even completed his undergraduate degree at Providence College in Rhode Island when he beat a longstanding incumbent for a seat in the state's House of Representatives in 1988. At 21 he became the youngest Kennedy elected to office.\n\nIn 1994 he took to the national stage as a House Representative for Rhode Island's 1st Congressional District and continued to serve in seven additional election cycles, finishing his term in 2011. An advocate for mental health, Kennedy — who has publicly discussed his own struggles with addiction and bipolar disorder — has founded and continues to work with various organizations to bring attention to drug addiction and promoting research for brain diseases."}, {"url": "https://heavy.com/news/2019/05/ted-kennedy-cause-of-death/", "page_content": "Ted Kennedy was an American politician who served as the U.S. Senator from Massachusetts. He held the position from 1962 until his death on August 25, 2009. He was 77. At the time of his death, he was the second most senior member of the Senate and the third-longest-continuously-serving senator in U.S. history.\n\nKennedy was also the longest-living of his siblings, as older brothers John and Robert were assassinated in the 1960s. He dealt with several health issues during the last few years of his life, including the diagnosis of a malignant brain tumor and cancer. Read on to learn more about his death.\n\nHere’s what you need to know:\n\n1. He Suffered Major Injuries During an Airplane Crash In 1964\n\nPlay\n\n1964 – Edward Kennedy's plane crash & Presidential Election Day June 19, 1964 – Massachusetts Senator Ted Kennedy is involved in a plane crash in which one of his aides and the pilot were killed. He was pulled from the wreckage by fellow senator Birch E. Bayh II (D-Ind.) and spent weeks in a hospital recovering from a broken back, a punctured lung, broken ribs,… 2009-04-22T15:25:20.000Z\n\nKennedy nearly lost his life on June 19, 1964, when the plane he was flying on crashed into an apple orchard in Southampton, Massachusetts. The pilot was instantly killed, as was one of Kennedy’s aids Edward Moss. Kennedy was pulled from the wreckage, but he sustained major injuries in the process. “My friend and colleague in the Senate, Birch Bayh, risked his life to pull me from the wreckage,” he told Newsweek.\n\nKennedy spent months in a hospital recovering from a punctured lung and internal bleeding. He also broke his back, which led to him suffering chronic pain for the rest of his life. “With crushed vertebrae, broken ribs, and a collapsed lung, I spent months in New England Baptist Hospital in Boston,” he recalled, adding that he would have been paralyzed were it not for the efforts of the hospital staff. “To prevent paralysis, I was strapped into a special bed that immobilizes a patient between two canvas slings,” he explained. “Nurses would regularly turn me over so my lungs didn’t fill with fluid.”\n\nKennedy’s near-death experience led to him walking with a cane for much of 1965. It also led to him developing a lifelong interest in health care, as he felt every American should get the treatment that he did. “I knew the care was expensive, but I didn’t have to worry about that. I needed the care and I got it,” he said.\n\n2. He Was Diagnosed With a Malignant Brain Tumor In May 2008\n\nPlay\n\nTed Kennedy on his Childhood Give yourself the gift of knowledge — subscribe to Big Think Edge: bit.ly/bigthinkedge If you're interested in licensing this or any other Big Think clip for commercial or private use, contact our licensing partner Executive Interviews: executiveinterviews.biz/rightsholders/bigthink/ Two driving forces are behind Kennedy: family and religion. 2011-06-02T16:10:14.000Z\n\nOn May 17, 2008, Kennedy suffered a seizure, and was rushed from the Kennedy Compound to Massachusetts General Hospital in Boston. Within days, doctors had diagnosed that Kennedy had a malignant glioma, which is a kind of cancerous brain tumor. He was initially told that the glioma was inoperable, but he pursued different opinions and surgical experts.\n\nOn June 2, 2008, Kennedy underwent brain surgery at Duke University Medical Center. According to CNN, the operation lasted over three hours, and was conducted by Dr. Allan Friedman. Kennedy was conscious during the surgery to minimize the risk of any neurological effects. The surgery was deemed a success, and the Senator left the hospital a week later.\n\nDespite the surgery and several chemotherapy treatments, Kennedy suffered many more seizures. He suffered a mild seizure on September 26, 2008, and was immediately rushed to the nearby hospital. He also suffered one on January 20, 2009, during the luncheon for Barack Obama’s presidential inauguration. Kennedy’s tumor continued to spread, and by spring 2009, he was told that treatments for it were no longer effective.\n\n3. He Considered Health Care Reform to Be the ‘Cause of His Life’ As a U.S. Senator\n\nPlay\n\nHealth Care: Sen. Ted Kennedy's Battle Cry The senator battled for health care reform for more than five decades. 2009-08-26T15:51:09.000Z\n\nDuring his time in the U.S. Senate, Kennedy lobbied for universal health care and health care reform. He explained his stance during a 2009 interview with Newsweek. “I have enjoyed the best medical care money can buy. But quality care shouldn’t depend on your financial resources, or the type of job you have, or the medical condition you face,” he said. “Every American should be able to get the same treatment that U.S. senators are entitled to.”\n\nKennedy, who considered health care reform to be “the cause of [his] life,” felt that his personal experiences were instrumental in shaping his passions. “In 1973, when I was first fighting in the Senate for universal coverage, we learned that my 12-year-old son Teddy had bone cancer,” he shared. “He had to have his right leg amputated above the knee. Even then, the pathology report showed that some of the cancer cells were very aggressive.”\n\n“That experience with Teddy made it clear to me, as never before, that health care must be affordable and available for every mother or father who hears a sick child cry in the night and worries about the deductibles and co-pays if they go to the doctor,” he continued. “My family has had the care it needed. Other families have not, simply because they could not afford it.”\n\n4. He Was Confined to a Wheelchair & Had Difficulty Speaking Before His Death In August 2009\n\nDuring the last few months of his life, Kennedy was confined to a wheelchair and had difficulty speaking. He was awarded the Presidential Medal of Freedom in July 2009, but could not attend the ceremony to receive this medal. He was also unable to attend the public funeral of his sister Eunice Kennedy Shriver, but he did attend the private service. Kennedy told the New York Times that he was thankful for the “wonderful life” that he led and was determined to make a “good ending” for himself.\n\nHe spend his final days at home with his wife Vicki. His routine consisted of reading the newspaper, drinking coffee, and playing with his dogs Sunny and Splash. He was also in process of watching every James Bond film on DVD. Dr. Lawrence C. Horowitz, Kennedy’s former Senate Chief of Staff, said that there was lots of happiness. “There were a lot of joyous moments at the end,” he confirmed. “There was a lot of frankness, a lot of hugging, a lot of emotion.”\n\n“He was the only one of the Kennedy boys who had a semi-knowledge that his end was near,” added former Boston Globe columnist Mike Barnicle. “There was no gunman in the shadows, just an M.R.I. It was a bad diagnosis, but it allowed for the gift of reflection and some good times.” Kennedy died at his home on August 25, 2009.\n\n5. He Was Laid to Rest Next At Arlington Cemetery Next to His Brothers\n\nPlay\n\nTed Kennedy Dies of Cancer at Age 77 Democratic senator led Kennedys after the assassinations of his two brothers. Read more about Sen. Edward Kennedy at ABCNews.com: abcnews.go.com/Politics/TedKennedy/story?id=6692022 2009-08-26T09:01:06.000Z\n\nKennedy’s funeral procession was held on August 29, 2009. It was attended by President Barack Obama, as well as former presidents Jimmy Carter, Bill Clinton, and George W. Bush. There were also three former Vice presidents, 58 senators, 21 former senators, and several members of the House of Representatives. Obama gave the eulogy, calling Kennedy the greatest legislator of our times.\n\n“He was a product of an age when the joy and nobility of politics prevented differences of party and philosophy from becoming barriers to cooperation and mutual respect, a time when adversaries still saw each other as patriots,” Obama said. “I, like so many others in the city where he worked for nearly half a century, knew him as a colleague, a mentor, and above all, a friend.”\n\nThere were several entertainers and celebrities who attended Kennedy’s funeral, including singer Tony Bennett, actors Jack Nicholson and Lauren Bacall, and former Boston Celtics basketball player Bill Russell. He was laid to rest at Arlington National Cemetery, near the graves of his assassinated brothers John and Robert. His grave marker is identical to that of his brother Robert’s; which is a white oak cross and a white marble foot marker bearing his full name."}, {"url": "https://abcnews.go.com/Politics/TedKennedy/story?id=7787098", "page_content": "Aug. 26, 2009— -- Ted Kennedy's 46-year career in the Senate was marked by landmark legislations -- from health care to education and he made Congress his forum for achieving his policy goals.\n\n\"It's a great national service when we get legislators that love to legislate, not because we need more laws or bills, but how to accomplish certain public purposes, by working effectively with others, and on a bipartisan basis, and to stay with it,\" said Kennedy's longtime friend John Culver.\n\n\"He's always seen politics as the way grease is supplied to our system to make it work,\" said former Boston Globe reporter Tom Oliphant.\n\nVisit ABC News' special section on Sen. Ted Kennedy.\n\nWatch video of historic moments in the life of Ted Kennedy.\n\nKennedy made health care reform the focal point of his decades-long career. The \"liberal lion of the Senate\" rallied his counterparts on many occasions with rousing speeches on the subject.\n\nFor Kennedy, President Obama's ascension to the White House was an important step toward realizing his goal of health care reform. Many say Kennedy's views were closely aligned to those of Obama's.\n\n\"This is the cause of my life,\" Kennedy said at an emotional speech at the Democratic National Convention in August 2008 while endorsing then-candidate Obama. He spoke of \"new hope that we will break the old gridlock and guarantee that every American -- North, South, East, West, young, old -- will have decent, quality health care as a fundamental right and not a privilege.\"\n\nKennedy, a longtime chair of the Senate's Committee on Health, Education, Labor and Pensions, called for extending Medicare coverage to all Americans, medical coverage for the uninsured and modernizing health care systems by using new technologies to cut costs. He also proposed to implement a rule that would require every American to have some form of health insurance, a point which became one of the key points of contention between Democrats and Republicans.\n\n\"We'll negotiate with insurance companies to keep premiums and co-pays low and help you with your premiums if you can't afford them,\" Kennedy wrote in a column published in the Boston Globe in June to push support for his plan. \"We're also hearing that some Americans want the choice of enrolling in a health insurance program backed by the government for the public good, not private profit -- so that option will be available, too.\"\n\nKennedy first called for a national health care system in 1966, when he proposed an amendment to the Economic Opportunity Act.\n\nKennedy, along with other senators, sponsored the Health Insurance Portability and Accountability Act (HIPAA) in 1996.\n\nIn 1997, he rallied for the State Children's Health Insurance Program (SCHIP) under which uninsured children from low-income families could get insurance.\n\nKennedy sponsored the Family Opportunity Act of 2006, allowing states to expand Medicaid coverage to children with special needs. That same year, he voted for expanding the enrollment period for Medicare, and would later support a bill that required pharmaceutical companies to negotiate prescription drug prices covered under the same plan.\n\nAfter he was diagnosed with cancer in May 2008, Kennedy was sidelined in congressional debates on health care overhaul, but, on July 9, 2008, he made a dramatic return and one of his final appearances on the Senate floor. He arrived to applause and cast one of the 69 votes to break a Republican filibuster against a bill that blocked cuts in Medicare payments to doctors. Days later, then-President George W. Bush's attempt to veto the bill was overridden.\n\nEven though he was not able to attend health care hearings on Capitol Hill because of his medical treatment Kennedy led efforts to create a sweeping overhaul of the health care bill in the Senate and to lobby the White House on new legislation. In his absence, Sen. Chris Dodd of Connecticut took the helm of the Senate Democrats' effort to create a health care bill.\n\n\"For four decades I have carried this cause -- from the floor of the United States Senate to every part of this country. It has never been merely a question of policy; it goes to the heart of my belief in a just society. Now the issue has more meaning for me -- and more urgency -- than ever before. But it's always been deeply personal, because the importance of health care has been a recurrent lesson throughout most of my 77 years,\" Kennedy wrote in a July Newsweek editorial he penned with longtime friend and speechwriter Robert Shrum.\n\nTed Kennedy's Legislative Achievements\n\nEven though his presidential dreams were shattered when a controversial car accident -- in which he was the driver -- led to the death of a 28-year-old woman, Kennedy became an influential liberal voice in the Senate. But he was also known for his bipartisan work on legislation such as the No Child Left Behind Act of 2001.\n\n\"One of the things he's been extraordinarily skillful at is his ability to work across the aisle,\" Culver said. \"It's remarkable with Ted Kennedy being recognized as such an intense partisan figure, but how effectively he can work with the other party in the Senate, and have their respect.\"\n\nFirst elected to represent Massachusetts in the Senate at age 30, Kennedy's commitment to a liberal legislative agenda -- pushing bills on health care and labor laws -- made him a powerful force in the Democratic Party, especially during his primary battle with Jimmy Carter in 1980 and arguments against Bill Clinton's centrist leanings in the 1990s.\n\nSee photos of Sen. Ted Kennedy's life.\n\nSee photos of the Kennedy family's history of privilege and loss.\n\n\"In the four areas that Kennedy has dominated... health care, in education, civil rights, immigration,\" Boston Globe reporter Peter Canellos said. \"He has fundamentally changed the relationship between the government and individuals in that arena.\"\n\nHere's a closer look at some of the other issues Kennedy heralded:\n\nKennedy's brother, President John F. Kennedy, introduced the Civil Rights Bill in June of 1963, only months after Ted Kennedy joined the Senate in November 1962. During a speech, President Kennedy asked Congress to \"enact legislation giving all Americans the right to be served in facilities which are open to the public -- hotels, restaurants, theaters, retail stores and similar establishments.\"\n\nThe bill that, after a struggle, eventually passed the House of Representatives Feb. 10, 1964, and met strong resistance in the Senate, remained on the floor for a 57-day filibuster. Though Ted Kennedy was still recovering from injuries he sustained in a devastating plane crash April 9, 1964, he gave an impassioned speech pleading with members of the Senate to end the filibuster of the Civil Rights Bill.\n\n\"My brother was the first president of the United States to state publicly that segregation was morally wrong,\" Kennedy said. \"His heart and his soul are in this bill. If his life and death had a meaning, it was that we should not hate but love one another; we should use our powers not to create conditions of oppression that lead to violence, but conditions of freedom that lead to peace.\"\n\nThe bill was passed by the Senate several months later and signed into law by President Lyndon B. Johnson July 2, 1964.\n\nIn 1970, Kennedy supported the Voting Rights Act Extension, which essentially lowered the voting age to 18.\n\n\"He has a commitment not just to civil rights in any racial or other aspects, but in terms of the forgotten and the outcasts and the dispossessed, that's his instinct,\" said Frank Mankiewicz, press secretary for then-Sen. Robert F. Kennedy during the 1968 presidential campaign. \"Whether it's the 18-year-old vote, or farm workers or ordinary sort of run of the mill civil rights legislation, women's rights, children, it's all there.\"\n\nKennedy also came out as a strong supporter of gay rights and women's issues.\n\n\"Kennedy is one of the earliest advocates for gay rights,\" Oliphant, the former Globe reporter, said.\n\nA few instances of Kennedy advocating gay rights include his opposition to the Defense of Marriage Act and the constitutional ban on same-sex marriage, his efforts to gain funding for HIV/AIDS prevention and treatment programs and, most recently, his support for expanding hate crimes to include sexual orientation.\n\nAs late as 2007, Kennedy voted to re-introduce the Equal Rights Amendment and ensured access to and funding for contraception. He also supported what many hailed as a women's rights issue by voting against a proposal to end funding for women-owned businesses, among other measures.\n\nKennedy introduced the Americans With Disabilities Act in 1990. The bill was designed to prohibit employers from discriminating in job hiring and in the workplace against people who had a disability.\n\n\"The crowning achievement of these decades of progress was passage of the Americans With Disabilities Act of 1990, and its promise of a new and better life for every disabled citizen, in which their disabilities would no longer put an end to their dreams,\" Kennedy said on the 17th anniversary of the act in 2007. \"The Americans With Disabilities Act was an extraordinary milestone in the pursuit of the American dream. Many disability and civil rights leaders in communities throughout the country worked long and hard and well to achieve it.\"\n\nIn 1978, Kennedy co-sponsored Civil Rights Commission Act Amendments, which expanded the jurisdiction of the Civil Rights Commission to protect people from discrimination on the basis of disability.\n\nIn 2001, the third-longest serving senator supported the No Child Left Behind Act, which was first proposed by then-President George W. Bush. The bipartisan bill made it a requirement for states that received federal funding to develop a standardized assessment test for students in certain grades.\n\nSupporters of the bipartisan bill said it increased accountability, but critics argued against standardized testing, saying it is not a true test of a student's ability.\n\n\"This is a defining issue about the future of our nation and about the future of democracy, the future of liberty, and the future of the United States in leading the free world,\" Kennedy said of the bill on the Senate floor. \"No piece of legislation will have a greater impact or influence on that.\"\n\nKennedy's support earned him a fair share of controversy, even within his own party.\n\n\"I want you to think about this, and I have to say, this was a train wreck that was not intended. No Child Left Behind was supported by George Bush and Sen. Ted Kennedy and everybody in between. Why? Because they didn't talk to enough teachers before they did that,\" Bill Clinton said of the act in 2008.\n\nBut despite the criticisms, some say Kennedy is likely to be remembered as one of the greatest Senators of his time.\n\n\"I think they're gonna say he is one of the greatest legislators, or most effective legislators -- if not the most effective legislator -- the Senate has ever seen,\" Boston Globe reporter and author Susan Milligan said. \"And I don't think you could find a sitting senator right now, Democrat or Republican, who would disagree with that assessment.\""}, {"url": "https://www.britannica.com/biography/John-F-Kennedy/Congressman-and-senator", "page_content": "Congressman and senator\n\nKennedy did not disappoint his family; in fact, he never lost an election. His first opportunity came in 1946, when he ran for Congress. Although still physically weak from his war injuries, he campaigned aggressively, bypassing the Democratic organization in the Massachusetts 11th congressional district and depending instead upon his family, college friends, and fellow navy officers. In the Democratic primary he received nearly double the vote of his nearest opponent; in the November election he overwhelmed the Republican candidate. He was only 29.\n\nKennedy served three terms in the House of Representatives (1947–53) as a bread-and-butter liberal. He advocated better working conditions, more public housing, higher wages, lower prices, cheaper rents, and more Social Security for the aged. In foreign policy he was an early supporter of Cold War policies. He backed the Truman Doctrine and the Marshall Plan but was sharply critical of the Truman administration’s record in Asia. He accused the State Department of trying to force Chiang Kai-shek into a coalition with Mao Zedong. “What our young men had saved,” he told the House on January 25, 1949, “our diplomats and our President have frittered away.”\n\nHis congressional district in Boston was a safe seat, but Kennedy was too ambitious to remain long in the House of Representatives. In 1952 he ran for the U.S. Senate against the popular incumbent, Henry Cabot Lodge, Jr. His mother and sisters Eunice, Patricia, and Jean held “Kennedy teas” across the state. Thousands of volunteers flocked to help, including his 27-year-old brother Robert, who managed the campaign. That fall the Republican presidential candidate, General Dwight D. Eisenhower, carried Massachusetts by 208,000 votes; but Kennedy defeated Lodge by 70,000 votes. Less than a year later, on September 12, 1953, Kennedy enhanced his electoral appeal by marrying Jacqueline Lee Bouvier (Jacqueline Kennedy Onassis). Twelve years younger than Kennedy and from a socially prominent family, the beautiful “Jackie” was the perfect complement to the handsome politician; they made a glamorous couple.\n\nAs a senator, Kennedy quickly won a reputation for responsiveness to requests from constituents, except on certain occasions when the national interest was at stake. In 1954 he was the only New England senator to approve an extension of President Eisenhower’s reciprocal-trade powers, and he vigorously backed the opening of the St. Lawrence Seaway, despite the fact that over a period of 20 years no Massachusetts senator or congressman had ever voted for it.\n\nTo the disappointment of liberal Democrats, Kennedy soft-pedaled the demagogic excesses of Sen. Joseph R. McCarthy of Wisconsin, who in the early 1950s conducted witch-hunting campaigns against government workers accused of being communists. Kennedy’s father liked McCarthy, contributed to his campaign, and even entertained him in the family’s compound at Hyannis Port on Cape Cod in Massachusetts. Kennedy himself disapproved of McCarthy, but, as he once observed, “Half my people in Massachusetts look on McCarthy as a hero.” Yet, on the Senate vote over condemnation of McCarthy’s conduct (1954), Kennedy expected to vote against him. He prepared a speech explaining why, but he was absent on the day of the vote. Later, at a National Press Club Gridiron dinner, costumed reporters sang, “Where were you, John, where were you, John, when the Senate censured Joe?” Actually, John had been in a hospital, in critical condition after back surgery. For six months afterward he lay strapped to a board in his father’s house in Palm Beach, Florida. It was during this period that he worked on Profiles in Courage (1956), an account of eight great American political leaders who had defied popular opinion in matters of conscience, which was awarded a Pulitzer Prize in 1957. Although Kennedy was credited as the book’s author, it was later revealed that his assistant Theodore Sorensen had done much of the research and writing.\n\nBack in the Senate, Kennedy led a fight against a proposal to abolish the electoral college, crusaded for labour reform, and became increasingly committed to civil rights legislation. As a member of the Senate Committee on Foreign Relations in the late 1950s, he advocated extensive foreign aid to the emerging nations in Africa and Asia, and he surprised his colleagues by calling upon France to grant Algerian independence.\n\nDuring these years his political outlook was moving leftward. Possibly because of their father’s dynamic personality, the sons of Joseph Kennedy matured slowly. Gradually John’s stature among Democrats grew, until he had inherited the legions that had once followed Gov. Adlai E. Stevenson of Illinois, the two-time presidential candidate who by appealing to idealism had transformed the Democratic Party and made Kennedy’s rise possible."}, {"url": "https://www.britannica.com/biography/Ted-Kennedy-American-senator", "page_content": "Ted Kennedy was awarded the Presidential Medal of Freedom on August 15, 2009. The award was accepted on his behalf by his children just 10 days before his death at his home.\n\nTed Kennedy was a leading advocate in the Senate for several causes, including voting rights, fair housing, consumer protection, and national health insurance. He was recognized for his willingness to cooperate with Republicans to pass legislation, such as the No Child Left Behind Act (2001) and other initiatives of the President George W. Bush administration.\n\nOn the night of July 18, 1969, Ted Kennedy accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident.\n\nTed Kennedy, in full Edward Moore Kennedy, byname Lion of the Senate, (born February 22, 1932, Boston, Massachusetts, U.S.—died August 25, 2009, Hyannis Port, Massachusetts), U.S. senator (1962–2009), a prominent figure in the Democratic Party and in liberal politics from the 1960s who became among the most influential and respected members of the Senate during his long tenure in office. He was the youngest child of Rose and Joseph Kennedy and the last surviving brother of Pres. John F. Kennedy. His other brother, Robert Kennedy, was also a U.S. Senator, and his sister, Eunice, founded (1968) the Special Olympics.\n\nTed Kennedy graduated from Harvard University in 1956. He then studied at the International Law School (The Hague) and received a law degree from the University of Virginia (1959). He campaigned for his brother John in the 1960 presidential race and in 1962 was elected to the president’s former U.S. Senate seat representing Massachusetts. The following year John was assassinated in Dallas, Texas. Although unable to campaign actively for reelection (1964) for a full term because of an injury, Kennedy was swept back into office by a landslide vote. In 1968 he lent his support to his brother Robert’s campaign for the Democratic presidential nomination. However, Robert was assassinated in June of that year.\n\nEarly in 1969 Kennedy was elected majority whip in the U.S. Senate, and he became an early front-runner for the next Democratic presidential nomination. Then, on the night of July 18, 1969, he accidentally drove his car off an unmarked bridge on Chappaquiddick Island, near Martha’s Vineyard, Massachusetts, and his companion in the car, 28-year-old Mary Jo Kopechne, was drowned. Kennedy was found guilty of leaving the scene of an accident. He was reelected to the Senate in 1970 but announced that he would not seek the presidency in 1972.\n\nKennedy won reelection to a third full term as senator in 1976. He was a serious contender for the 1980 Democratic presidential nomination but withdrew from the race during the convention. He won a fourth term in 1982 and was again reelected to the Senate in 1988, 1994, 2000, and 2006.\n\nKennedy continued to be a prominent spokesman for the policies that had come to be associated with his family name—i.e., support for social welfare legislation and active participation in world affairs. He became a leading advocate in the Senate for many liberal causes, including voting rights, fair housing, consumer protection, and national health insurance. At the same time, he was recognized for his willingness to cooperate with Republicans in the Senate to advance important legislation, such as the No Child Left Behind Act (2001) and other initiatives of the administration of Pres. George W. Bush. In 2008, after being hospitalized for a seizure, Kennedy was diagnosed with a malignant brain tumour. In March 2009 he was made an honorary Knight of the British Empire, and on August 15 he was awarded the Presidential Medal of Freedom (it was accepted on his behalf by his children); 10 days later he died at his home. In his eulogy for Kennedy, Pres. Barack Obama called him the “soul of the Democratic Party” and the “greatest legislator of our time.” Kennedy’s autobiography, True Compass, was published in September 2009."}, {"url": "https://www.insider.com/most-famous-politician-from-every-state", "page_content": "Every state has produced powerful political figures.\n\nPolitical leaders often represent different states than those they were born in.\n\nBarack Obama was born in Hawaii, but started his political career in the Illinois Senate.\n\nPresident Donald Trump was born in New York City.\n\nVisit Insider's homepage for more stories.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nEvery state has produced powerful political leaders, from presidents to senators.\n\nPolitical figures on this list were born in a certain state, even if they ended up representing a different part of the country. Barack Obama, for example, was born in Hawaii, but represented Illinois in the Senate, and George W. Bush was born in Connecticut but was governor of Texas before becoming president.\n\nHere is the most famous political figure from every state."}]}