{"Harry S. Kennedy was known as a leader in health care reform.": [{"url": "https://www.trumanlibrary.gov/education/presidential-inquiries/challenge-national-healthcare", "page_content": "Background\n\nImage credit: National Archives, Records of the Committee on Fair Employment Practice.\n\nhttp://recordsofrights.org/records/128/for-the-peoples-health\n\nTo many Americans, healthcare is considered a human right. In fact, Harry S. Truman, 33rd president of the United States, said, “I put it to you, is it un-American to visit the sick, aid the afflicted or comfort the dying? I thought that was simple Christianity.” Harry Truman would carry on the legacy of FDR in trying to provide American men, women, children and elderly with national healthcare. Truman would pave the way for future presidents such as Lyndon Johnson, Bill Clinton and Barack Obama, whose administrations strove toward the same goal.\n\nIn 1945, President Truman proposed a national healthcare plan to Congress. In his plan, he outlined five main goals:\n\nAddress the lack of trained healthcare professionals in all communities. Grow public health services. Increase funding to medical research and education. Lower the cost of individual medical care. Bring attention to the loss of income when severe illness takes hold.\n\nTruman’s plan was that all Americans would pay a certain amount in fees and taxes each month to cover the new healthcare program’s costs. With a Democratic controlled House, Truman’s proposal turned into a bill that would end up as part of the Social Security expansion, but it was quickly shot down as people began to fear an increase in taxes. Some people even feared the program would be a “Communist” act, giving too much control to the federal government. This fear was spread specifically by the American Medical Association (AMA). The bill was also halted by Republican Senator Robert Taft’s Taft-Smith-Ball Bill, which would allow states to make healthcare private. As Republicans regained control of the House in 1946, Truman’s healthcare bill died. Truman considered this a failure of his presidency.\n\nThe United States would continue its fight over national healthcare during Lyndon B. Johnson’s presidency. In 1965, Johnson signed the Medicare Act of 1965, which would provide healthcare to U.S. citizens age 65 and older. Harry and Bess Truman were present at the signing, and President Johnson dubbed former President Truman “the real daddy of healthcare.” The issue came to the forefront again during the Clinton and Obama administrations. While the Affordable Care Act was signed into law during Barack Obama’s term, opposition to the legislation continues. Many people disagree with the federal government’s involvement and mandates where healthcare is concerned. These arguments echo the backlash against Truman’s, Clinton’s and even Johnson’s bills. Harry S. Truman paved the way for healthcare reform in the United States, and criticisms against his bill have also remained throughout American history."}, {"url": "https://historynewsnetwork.org/article/146911", "page_content": "tags: LBJ\n\n\n\nLyndon Johnson signing the Medicare bill, July 30, 1965. At left is former president Harry Truman. Credit: NARA\n\nA Century of American Healthcare Reform\n\nFor the first century of United States history, medical care was simple to access and relatively inexpensive. Services were, from a twenty-first century perspective, inadequate and primitive. Today the quality of care is far better, but Americans have to deal with a complex, confusing, and—by some standards—inefficient system, with terms like HMO, PPO, HSA, and FSA becoming household acronyms. Was it inevitable that the system become as convoluted as it is today, with health care costs passing 15% of GDP?\n\n1900-1920\n\nThe origin of our modern system of healthcare can be traced to the beginning of the twentieth century. Medical technology had progressed rapidly, and expectations grew with them. Training, technique, and technology all improved substantially. Hospitals, once exclusively way stations for the chronically ill and dying, became centers for specialized medicine, surgery, and research. Medical costs began to soar and would continue to rise far above the cost of living for the rest of the century.\n\nThe 1920s\n\nThe First World War spurred even greater advancements in medical technology, including X-rays, electrocardiographs, and early (pre-penicillin) antibiotics. In the 1920s, these advancements spread to civilian hospitals around the country. By the end of the decade, the middle class found itself struggling to deal with growing medical costs, once a concern only of the poor.\n\nWhile the American Medical Association (AMA), a powerful association of doctors, opposed any government role in healthcare, doctors began to realize that more and more Americans were unable to meet their medical expenses. In 1927 the AMA formed a Committee on the Costs of Medical Care to report on options for helping Americans pay for their medical services. The Committee concluded that private insurance was the best solution.\n\nIn 1929, Baylor University Hospital in Dallas began offering non-profit, pre-paid medical insurance to local schoolteachers for 50 cents per month. The program was so successful hospitals across the country started offering similar programs, usually advertised with the symbol of a blue cross. That same year the stock market collapsed and the Great Depression began, creating tremendous new economic challenges, even as healthcare costs continued to rise.\n\nThe 1930s\n\nThe Blue Cross plans proved popular, and hospitals began to band together to offer joint regional plans. These plans continued to be offered mostly to professional groups, clubs, or other fixed membership bodies rather than the general public. By 1938, almost three million Americans were enrolled in Blue Cross plans. This growing market began to attract commercial insurers.\n\nIn 1932 Franklin Roosevelt (D) won the presidency, and the following year his administration began an aggressive program of economic and social intervention known as the “New Deal.” Many liberal Democrats expected some form of national health insurance to be a part of this program. Indeed, in 1933 Roosevelt’s Federal Emergency Relief Administration (FERA) declared healthcare to be a fundamental human right.\n\nBut resistance to government intervention in medicine continued to be strong among doctors and hospitals. The Roosevelt administration initially planned to include national health insurance in the Social Security Act, but fierce AMA resistance persuaded Roosevelt to remove it.\n\nThe 1940s\n\nThe Second World War came to occupy the full attention of the Roosevelt administration, and many ambitious domestic goals were put on hold, including healthcare reform.\n\nBut during the war, a policy designed to keep inflation in check had an unintended consequence that was to shape the way most Americans would receive healthcare for the next seventy years. The federal government imposed strict price and wage controls on many industries, so companies found that they no longer could use competitive wages to attract talent. A growing number found that company-subsidized health insurance, then unregulated, fit this need.\n\nAt the end of the war, President Harry Truman (D) made universal health insurance integral to his “Fair Deal” domestic agenda. He gave a special address to Congress in November, 1945, calling for the expansion of the popular Social Security program to national health insurance, federal healthcare funds for rural areas, and national standards for hospitals.\n\nThe AMA continued to strongly resist this agenda, and after the National Labor Relations Board ruled that unions could negotiate for health coverage with their employers, unions lobbied less aggressively for health reform, fearing that a national health insurance program would be less comprehensive than the benefits they were already winning directly. Democrats lost both houses of Congress to Republicans in 1946, ending for the moment any chance for the passage of Truman’s health insurance plan.\n\nAfter his upset re-election in 1948, with the Democrats’ gain of 9 Senate seats and 75 House seats, Truman expected to resume his aggressive domestic agenda. However, foreign policy challenges, including the Chinese Civil War, the Soviet acquisition of the atomic bomb, and the Korean War, served to distract the administration. Truman eventually won expansions of public housing and Social Security, but promises of health reform went unfulfilled.\n\nThe 1950s\n\nThe decade of the 1950s was an era of increasing prosperity and expanding availability of employer-based health insurance. In 1954, Congress reformed the tax code to exclude employer contributions to employees’ health insurance, effectively providing a government subsidy to employer-based coverage. However, the vast majority of the poor and elderly continued to receive their medical care from large public hospitals, country doctors, and private charities.\n\nBlue Cross programs now enrolled more than 20 million Americans, and commercial insurance aggressively entered the market, offering individual rates based on a customer’s unique health risks, allowing them to undercut the community rates offered by the Blue Cross plans for many healthier and younger Americans. This put pressure on the Blues to follow suit, since they would otherwise be left with the highest risk members of the insurance pool. Insurance companies charged the higher-risk individuals correspondingly higher rates, while refusing coverage to others entirely. The once affordable health insurance plans moved out of reach for many middle class Americans.\n\nThe Dwight D. Eisenhower (R) administration was opposed to government intervention in healthcare, and no serious healthcare legislation was considered until the very end of the decade. However, Republicans missed an opportunity to obstruct Democratic efforts and enact their own market-based alternative to national health insurance. With a debate effectively limited to two choices -- between government action and no action at all -- Americans in need of a healthcare solution increasingly leaned towards the former.\n\nThe 1960s\n\nWith both houses of Congress again under Democratic control and the AMA eager for alternatives to government health insurance, Eisenhower was persuaded to sign the Kerr-Mills Act in 1960. Kerr-Mills created a federal program to subsidize states’ health services for the elderly and infirm. The funds were limited and many states declined to participate altogether. The bill was a middle-ground between competing health bills championed by presidential candidates John F. Kennedy (D) and Richard Nixon (R).\n\nOn the campaign trail Kennedy called Kerr-Mills “most inadequate” and proposed a far more sweeping national insurance program called “Medicare.” When Kennedy became president, the AMA undertook a massive, expensive public campaign to oppose Medicare, including mass-mailings, speakers’ tours, and radio and TV ads (some featuring a future president, Ronald Reagan). Organized labor, the National Council of Churches, and elderly groups began to organize in support of Medicare.\n\nIn 1962, the Kennedy administration began an aggressive healthcare push, with Kennedy speaking to large crowds of seniors and administration officials traveling across the country in support of the legislation. The well-funded counter-campaign by the AMA and insurance industry, along with election year pressures, contributed to the legislation dying in Senate committee.\n\nWhile Kennedy failed to pass Medicare, the issue wouldn’t die. Medical costs were growing faster than the overall inflation rate. And the population was rapidly aging. Nearly 10% of Americans were now over 65 (up from 4% in 1900). By 1964, the first full year of Lyndon Johnson’s presidency, over 60% of voters supported the enactment of Medicare. Also in its favor was the prevailing optimism of the period. Americans at the time believed they could do anything they set their minds to. If they could send Americans into space (and go to the moon, as leaders promised), they could certainly provide health insurance for the aged.\n\nAfter a landslide re-election, with large gains in both houses of Congress, Johnson was emboldened to push forward with some of the most liberal legislation since the New Deal. In 1965, Congress passed both Medicare, which effectively expanded the Social Security mechanism to include health benefits, and Medicaid, which provided for health assistance to certain categories of low-income Americans.\n\nThe 1970s\n\nPresident Richard Nixon’s (R) election in 1968 largely ended the liberal era. In place of government solutions the emphasis shifted to reforms involving private enterprise or non-profits. One such reform was the promotion of Health Maintenance Organizations (HMOs), which were designed to undercut the prevailing fee-for-service system that encouraged doctors to order expensive tests and potentially unnecessary treatments. HMOs were based on the model pioneered by health organizations like the for-profit Kaiser Permanente in California and non-profit Group Health in Washington State, which offered medical care on a pre-paid basis.\n\nThe HMO Act of 1973 created incentives for the formation of for-profit HMOs and introduced the managed care approach that would quickly come to dominate private insurance.\n\nDemocrats continued to press for expansion of direct government intervention in healthcare. In 1974, Nixon, seeking to neutralize healthcare as a Democratic advantage, proposed the Comprehensive Health Insurance Act, a bill that would mandate health insurance by private employers while giving individuals without coverage a federal “public option.” Senate Democrats, led by Edward Kennedy, rejected the proposal as insufficient.\n\nIn 1976, Democrats won back the presidency. But liberals like Kennedy in Congress were unable to reach an agreement on a robust healthcare plan with President Jimmy Carter (D). Democrats would soon come to regret their missed window of liberal opportunity.\n\nThe 1980s\n\nUnlike the more ideologically-flexible Richard Nixon, Ronald Reagan (R) came into office in 1981 determined to scale back the reach of the federal government. In his first term, Reagan successfully enacted major tax cuts as well as reductions in many government services, including Medicaid. Medicare, however, had become too entrenched for even Reagan and a relatively conservative Congress to take on.\n\nEmployer-based health insurance was becoming less reliable, as heavily unionized industries fell into deep decline, and the expanding retail and service industries imposed strict restrictions on health coverage eligibility (until 2008, a large percentage of Wal-Mart employees did not receive health insurance benefits). Employment mobility also increased, as fewer Americans spent long segments of their career with the same company. As the number of Americans lacking reliable health insurance grew so did their anxieties. To address the problem, Congress passed the Consolidated Ombnibus Budget Reconciliation Act (COBRA), which allowed some degree of health insurance portability, while requiring relatively high premiums.\n\nThe 1990s\n\nIn 1992, Bill Clinton (D) made his plan for universal health insurance a prominent part of his platform. Upon taking office, he appointed First Lady Hillary Rodham Clinton to head up a healthcare task force and made achieving universal healthcare legislation his principal first-term goal. The Clinton bill was met with concentrated opposition from conservatives and insurance industry groups. The bill, which would use a complex series of mechanisms, national boards, and rules to achieve universal coverage, was easy for opponents to demonize. Opponents contended that Clinton’s reforms would lead to the government’s deciding on Americans’ health care rather than their doctors.\n\nThe bill died in Congress, and its failure contributed to Republican victories in the mid-term elections in 1994, giving the GOP control of both houses for the first time since the 1950s. Clinton spent the rest of his presidency fighting for less ambitious healthcare reforms, including: the S-CHIP, a program which dramatically reduced the number of uninsured children; the Health Insurance Portability and Accountability Act, an initiative that helped some Americans maintain their health insurance after losing or changing jobs; and Medicare Advantage, which permitted Medicare recipients to receive insurance coverage (including an expanded list of benefits) through subsidized private insurance plans instead of traditional Medicare.\n\nThe 2000s\n\nFor most of his first six years in office, George W. Bush (R) presided over Republican majorities in Congress, stifling any hope among Democrats for a substantial expansion of publicly funded health insurance. But Bush embraced one reform that even Democrats largely approved in concept: expanded Medicare coverage of prescription drugs (known as Medicare Part D). Although this was the largest expansion of Medicare since its establishment, some Democrats objected to a provision that forbade the federal government from negotiating discounts with pharmaceutical companies.\n\nWith the federal government unlikely to act to expand health coverage to the growing population of uninsured Americans, several states, including Tennessee (1994), Massachusetts (2006), and Connecticut(2009), undertook efforts to offer greater coverage to their residents. Both Tennessee and Massachusetts saw costs exceed predictions and adjusted their programs substantially after passage. The Massachusetts plan was the first to achieve effectively universal health insurance coverage, and was seen as a template for the healthcare plans of the major Democratic candidates for president in 2008.\n\nWhen Barack Obama (D) became president in 2009, his large Democratic majorities in both houses of Congress offered the opportunity to achieve the substantial expansion and reform of healthcare in the United States long envisioned by Democrats. Compromises made to accommodate Democrats from conservative states and districts, however, led to an intra-party fight over the legislation, with more liberal Democrats championing a public option similar to Nixon’s proposal in 1974. Obama said he personally favored the public option, but in the end agreed to a deal taking it off the table, and the Affordable Care Act, which was designed to dramatically reduce the number of uninsured Americans, was signed into law in March, 2010, with most of the changes staggered over the following four years. Going into the 2010 mid-term election Republicans vowed to campaign against the reform and repeal it if they regained control of Congress."}, {"url": "https://www.beckershospitalreview.com/news-analysis/a-brief-history-on-the-road-to-healthcare-reform-from-truman-to-obama.html", "page_content": "A brief history of healthcare reform in the U.S., through the years.\n\nThe healthcare and insurance industries, and all of us as healthcare consumers, are experiencing the birth pangs of the difficult roll out of the Patient Protection and Affordable Care Act. The natural inclination is to view the PPACA as unique in its scope, impact and political implications. But such a view is myopic, for the road to healthcare reform in America is well traveled. Every American presidential administration following the end of World War II has, to some extent, proposed or supported changes to the healthcare system in this country. And many of those previous reforms have been eerily similar to some of the provisions in the PPACA.\n\n\n\nThis is not the first time the nation has debated controversial healthcare reform proposals. This is not the first time bitter partisan politics have complicated, and sometimes obfuscated, attempts at reform. Some attempts at healthcare reform have succeeded and some have failed, and the political process has often been ugly and divisive. Here is a look at some past attempts at health care reform in the modern era: the good, the bad, and the ugly.\n\n\n\nThe Truman Administration (1945-1953)\n\nThe first attempt at healthcare reform in the post-war era occurred during the administration of President Harry S. Truman. His predecessor Franklin D. Roosevelt did little to advance the cause, and healthcare accessibility was one of the few societal needs not addressed in the New Deal programs. There is evidence President Roosevelt intended to pursue some form of healthcare reform after the end of World War II, but he died before then, in April 1945.\n\n\n\nPresident Truman recommended to Congress a proposal for universal health insurance coverage, administered and paid for by a National Health Insurance Board. Opponents of the proposal, including the American Medical Association, decried it as \"socialized medicine,\" and the bill died in Congress. Truman made a second effort at healthcare reform in 1948, following his re-election, but the outbreak of the Korean War proved to be the death knell of the proposal.\n\n\n\nThe Truman administration's efforts were not all for naught, however; its efforts to modernize and increase the number of hospitals in the U.S. was achieved. The Hospital Survey and Construction Act of 1946 (commonly known as the Hill-Burton Act) was passed by Congress in 1946. The law provided federal grants and loans to build, expand and modernize hospitals. The consequences of the resulting rapid and unregulated growth in healthcare facilities would require future legislation, during the Ford administration, to bring it under control.\n\n\n\nThe Eisenhower Administration (1953-1961)\n\nWith its focus on the emerging Cold War, the Eisenhower administration supported only limited healthcare reform proposals. In 1956 the \"Military Medicare\" program was enacted, providing payment for healthcare services for military dependents. The administration supported the Forand bill, which would provide health insurance for Social Security beneficiaries. Despite support from the AFL-CIO, the Forand bill never gained much traction in Congress.\n\n\n\nThe Kennedy Administration (1961-1963)\n\nThe Kennedy administration pursued a more modest form of healthcare coverage than that proposed by President Truman. The Kennedy administration supported the King-Anderson bill, under which health insurance coverage would be limited to those 65 years of age and older and be part of the Social Security benefits package. In so doing, Kennedy laid additional blocks to the foundation of what would ultimately become Medicare.\n\n\n\nFrustrated by the efforts of special interests to kill the proposal, President Kennedy took his case on the road directly to the public. On May 20, 1962, a series of 33 public rallies were simultaneously held in various parts of the country. The President made a personal appearance and a nationally televised speech at the largest of those — Madison Square Garden in New York City with 17,500 attendees inside and a crowd estimated at 2,500 in standing room only outside the arena.\n\n\n\nIn a speech at the rally, President Kennedy confidently predicted the King-Anderson bill would pass Congress \"this year, or as inevitably as the tide comes in, next year.\" President Kennedy was wrong. Opposed by the powerful AMA and with help from conservative Democrat Wilbur Mills, chairman of the House Ways and Means Committee, the bill was defeated in Committee. President Kennedy did not live to see the proposal's chances through the following Congress, and the mantel was passed to Lyndon Johnson.\n\n\n\nThe Johnson Administration (1963-1969)\n\nLyndon B. Johnson won a landslide victory to be elected to a full term as president in November, 1964. With a Democratic super-majority in both houses, President Johnson had a receptive body for the extensive social reforms he dubbed the Great Society.\n\n\n\nDespite continued vocal opposition from the AMA and some conservative Republicans, legislation establishing the Medicare and Medicaid programs steam-rolled through Congress. It was introduced in the House Ways and Means Committee in March of 1965, gained final approval by the Senate on July 28, 1965 and was signed into law by President Johnson on July 30, 1965.\n\n\n\nAs originally enacted, the Social Security Amendments of 1965 provided healthcare coverage to those 65 years of age and older, and to the poor, blind and disabled. It covered healthcare services provided by hospitals, physicians, nursing facilities and home care providers. It would not be long before proposals for health coverage for those not covered under Medicare/Medicaid would surface.\n\n\n\nThe Nixon Administration (1969-1974)\n\nIn 1971, the Nixon administration proposed the National Health Insurance Standard Act. The proposal called for government-prescribed minimal levels of insurance coverage, mandated to be provided through employers and financed by payment of premiums by employers and employees. This plan would maintain competition between private insurers and expand coverage. The NHISA would also provide government subsidies for premiums for certain employees. While the NHISA did not pass, Nixon was successful in gaining passage of the Health Maintenance Organization Act of 1973, which laid some of the ground work for managed care.\n\n\n\nA competing proposal was advanced by a familiar Nixon nemesis, the Kennedys; this time it was Sen. Edward M. Kennedy of Massachusetts. Kennedy introduced the Health Security Act, calling for a single federal payer, providing comprehensive health coverage for nearly all Americans. Although the Health Security Act never advanced far in Congress, it was the beginning of a career-long effort by Sen. Kennedy at major healthcare reform.\n\n\n\nThe Ford Administration (1974-1977)\n\nThe abbreviated Ford presidency was consumed by healing the nation's post-Watergate wounds (\"our long national nightmare\" as President Ford termed it, and fighting run-away domestic inflation. The unrestrained and federally incentivized growth of healthcare facilites, ushered in by Hill-Burton in 1946, and exacerbated by the infusion of vast federal funds into the healthcare payment system, were seen as contributing causes to medical inflation.\n\n\n\nThe National Health Planning and Resources Development Act of 1974 was an effort to reign in escalating healthcare costs. The goals of the HPRDA were to reduce and avoid unnecessary duplication of healthcare facilities and services; it sought to do so by essentially mandating certificate of need programs in the states. Although the CON mandate of the HPRDA was repealed in 1986, thirty-six states and the District of Columbia still operate CON programs today.\n\n\n\nThe Carter Administration (1977-1981)\n\nJimmy Carter campaigned for president calling for national healthcare insurance with universal coverage, and as president he went to work to prepare a legislative proposal for the same. The American Hospital Association endorsed the concept in principle, but had reservations about any system that took a universal, \"one-size-fits-all\" approach. The details of President Carter's plan never received much of a congressional or public audience, as a deep recession and other economic issues took priority.\n\n\n\nOther than the tepid support of the AMA, little other healthcare industry or public support was apparent. President Carter later maintained he had strong support from the chairmen of the House and Senate committees with responsibility for healthcare legislation and could have succeeded in passing his proposal had it not been for the abrupt withdrawal of support by one of those chairmen. Ironically, the vacillating Senate committee chairman was none other than Sen. Edward M. Kennedy. Senator Kennedy was to run against Carter for the Democratic presidential nomination in 1980.\n\n\n\nThe Reagan Administration (1981-1989)\n\nIn his inaugural address, after lamenting the consequences of excessive government borrowing and deficit spending, President Reagan declared: \"In this current crisis, government is not the solution to our problem. Government is the problem.\" Understandably, there were no administration proposals for new government-run or administered healthcare programs under President Reagan.\n\n\n\nDuring President Reagan's term of office several new laws were enacted aimed primarily at reducing the growth in federal spending on health care, and improving efficiencies. This was to be accomplished by changing Medicare reimbursement methodologies — in most cases reducing reimbursement to hospitals and physicians — and stepping up anti-fraud measures.\n\n\n\nBut the Reagan Administration also advanced through Congress the first major expansion of Medicare benefits: the Medicare Catastrophic Coverage Act of 1988. The law expanded Medicare coverage for outpatient drugs, put a ceiling on out of pocket co-pays for hospital and physician services, and modestly expanded payments for long term care. The program was to be funded entirely by Medicare beneficiaries through increased premiums and a surtax on wealthier beneficiaries based on income.\n\n\n\nThe George H.W. Bush Administration (1989-1993)\n\nPresident George H.W. Bush inherited a political catastrophe in the Medicare Catastrophic Coverage Act of 1988. Among the elderly there was wide-spread disappointment over the level of expanded benefits and strong resentment over having to pay higher premiums and taxes to fund it. These sentiments led to a senior revolt against the law, and in 1989 — just 17 months after it was enacted — a bipartisan effort in Congress repealed most of the MCCA.\n\n\n\nPresident Bush's agenda for healthcare legislation consisted of additional measures to reduce the growth of federal health care spending and reduce fraud and abuse in the Medicare and Medicaid programs. Notable among the Bush healthcare legislative reforms was a prohibition on physician \"self-referrals\" for clinical laboratory services (Stark I).\n\n\n\nThe Clinton Administration (1993-2001)\n\nBill Clinton was the first Democrat elected president in 12 years, and his administration wasted little time in proposing major health care reforms. After the release of a report by a highly controversial task force headed by First Lady Hillary Clinton, President Clinton sent the American Health Security Act of 1993 to Congress. It proposed to provide affordable health insurance for all through a concept called \"managed competition.\"\n\n\n\nUnder the Clinton proposal, health insurance coverage would be provided through private insurers competing for customers in a highly regulated market, overseen and coordinated by regional health alliances to be established in each state. All health plans would be required to provide a minimum level of benefits. Employers would be required to provide insurance coverage for their employees and pay 80 percent of the premium.\n\n\n\nThe AHSA was opposed by much of the healthcare industry and the health insurance industry. It was subjected to bitter partisanship in Congress, with even Democratic lawmakers split and some offering alternative or compromise plans. By September 1994, the proposal was declared dead by Senate Majority Leader George Mitchell.\n\n\n\nOther important healthcare reform measures were enacted during President Clinton's term of office. Among the notable reforms was The Health Insurance Portability and Accountability Act, a significant expansion of the Stark physician self-referral law (Stark II), and the State Children's Health Insurance Program.\n\n\n\nThe George W. Bush Administration (2001-2009)\n\nPresident George W. Bush bore the burden of being President during the tragedy of 9/11. Much of his presidency, especially his first term, was consumed with the aftermath of that and the war on terrorism at home and abroad. It is understandable that healthcare reform was not at the top of his agenda for many practical as well as political reasons.\n\n\n\nPresident Bush's domestic legacy does, however, include one of the largest expansions of Medicare in the program's history. The Medicare Drug Improvement and Modernization Act of 2003 made numerous changes to the Medicare program, the most important of which is the prescription drug coverage benefit, created as Medicare Part D.\n\n\n\nThe MMA passed by narrow margins in both the House and the Senate. In each chamber, the vote was almost straight down party lines, with Republicans controlling the \"Yea\" vote.\n\n\n\nThe Obama Administration (2009 - present)\n\nIt came as little surprise that President Obama made healthcare reform one of his first priorities: He campaigned on the promise of sweeping changes to the healthcare system in an effort to reduce costs and make coverage available to most Americans. He sent a major reform bill to Congress within six months of the inauguration.\n\n\n\nA painful political process ensued. Bitter partisan divisiveness, debates over the public option health plan, public misinformation (e.g., allegations the legislation provided for \"death panels\") and charges of socialized medicine filled the airwaves, internet and print media. After much political maneuvering and intrigue rarely seen even in Washington, the legislation gained the final necessary House of Representatives approval on March 21, 2010. The PPACA was signed into law on March 23, 2010.\n\n\n\nOn June 28, 2012, the United States Supreme Court issued its ruling in National Federation of Independent Business v. Sebelius, which called into question the PPACA's constitutionality. In a creatively crafted opinion, Chief Justice Roberts wrote for the majority upholding the constitutionality of all but one of the major provision of the PPACA. The Court ruled:\n\n\n\n\n\nThe individual mandate is a permissible exercise of Congress' taxing power and thus constitutional.\n\nThe Medicaid expansion \"cram down\" provision (essentially requiring all states to expand Medicaid coverage to all otherwise eligible individuals with incomes up to 133 percent of the federal poverty level) is an impermissible exercise of Congressional power and thus unconstitutional.\n\nIn its irreducible essence, the PPAACA provides for:\n\nA mandate for \"large\" employers to provide health insurance coverage for its employees;\n\nA mandate for virtually all citizens to have health insurance coverage through an employer sponsored plan, a government plan or an individual plan;\n\nCreation of federal and/or state healthcare exchanges to facilitate obtaining healthcare insurance;\n\nFederal financial subsidies for health care insurance for individuals meeting low income standards;\n\nA mandate that all health plans provide a certain minimal level of essential benefits; and\n\nProhibitions against denials of coverage based on pre-existing conditions and against lifetime benefit limits.\n\nConclusion\n\nThe PPACA is in some respects a conglomeration of some of the pieces of past proposals for major healthcare reform. The provision of health insurance coverage through private insurers instead of directly through the government, employer mandated health insurance, the creation of state, regional or national clearinghouses for insurance, federal subsidies for low income individuals, and \"guaranteed eligibility\" have all been proposed in previous attempts at reform.\n\n\n\nLikewise, partisan divisiveness, bitter congressional fights, grassroots campaigns and political intrigue have been ubiquitous characteristics of healthcare reform efforts. But in the end, the democratic process has worked. Legislation deemed not in the public interest has been defeated in Congress, and enacted legislation that proved to be unpopular or unworkable has been repealed. The surviving reform measures have improved and saved the lives of millions of Americans.\n\n\n\nWe have traveled this long and bumpy road to healthcare reform before. We have not yet arrived at the destination of a more accessible, cost efficient and high quality heath care system, but that destination is surely worth the difficult journey.\n\n\n\nJerry W. Taylor, JD, is a member of Stites & Harbison, PLLC, located in the Nashville, Tenn., office. His practice focuses on healthcare law, business transactions and commercial loan financing. He has practiced healthcare law in both private practice and for government regulatory agencies. He is a member of the Nashville Bar Association, Tennessee Bar Association and the American Health Lawyers Association.\n\n"}, {"url": "https://kffhealthnews.org/news/kennedy-health-care-timeline/", "page_content": "This timeline was originally published Aug. 26, 2009\n\nSen. Edward Kennedy never had to worry about getting quality healthcare, but he spent much of his career seeking to guarantee that all Americans had that same access to health services he had. “Every American should be able to get the same treatment that U.S. senators are entitled to,” he wrote in Newsweek last month. “This is the cause of my life.”\n\nHere are highlights of his health policy milestones:\n\n–1962: Edward M. Kennedy is elected to the Senate from Massachusetts to fill the seat left by his brother, John, who had been elected president in 1960.\n\n–1966: After a trip to the Columbia Point Health Center in Boston, which provided health care to low-income residents, the first-term senator introduces and helps pass legislation that adds $51 million to the Economic Opportunity Act for a national system of community health centers.\n\n–1971: Kennedy becomes chairman of the Senate Health subcommittee and begins his long campaign for national health insurance.\n\n— 1971: On Jan. 5, Kennedy co-sponsors a bill calling for a significant increase in funding for cancer research \u0096 providing a total of $1.2 billion over three years to the National Cancer Institute, more than what was proposed by the Nixon administration. A modified version of the bill is enacted Dec. 23, 1971.\n\n–1971: Kennedy offers his national health-insurance plan. The “Health Security Act” calls for a universal single-payer plan financed through payroll taxes.\n\nWith support from organized labor and senior citizens, Kennedy holds hearings around the country and releases his report, “The Health Care Crisis in America,” which aims to garner support for his national insurance plan. President Richard M. Nixon, concerned about Democrats gaining advantages from the issue and a possible Kennedy campaign for president, later offers his own version of a bill, the National Health Insurance Partnership Act. It preserves private insurance but requires businesses to provide coverage to employees or make payments to a government-run fund. It also endorses the concept of health maintenance organizations.\n\n“It’s really a partnership between the administration and insurance companies,” Kennedy says of the Nixon health plan. “It’s not a partnership between patients and doctors of this nation.” But Kennedy’s efforts on health insurance were pushed to the backburner by public concerns about the Vietnam War and later the Watergate scandal.\n\n–1972: Working with other members of the Senate Select Committee on Nutrition and Human Needs, Kennedy helps secure authorization for a two-year pilot project for the Special Supplemental Nutrition Program for Women, Infants and Children, which provides food and health benefits to poor women who are pregnant and their children up to five years of age. In 1974 Kennedy fights to expand the program, and it is permanently authorized by the legislation.\n\n–1973: Under pressure from doctors and other groups, the Nixon administration backs away from its proposal to expand HMO services, but Kennedy moves ahead on the issue. He sponsors the HMO Act of 1973, which is revised several times before it is eventually signed into law Dec. 29, 1973. The bill authorizes the spending of $375 million over five years to evaluate HMOs and requires employers with more than 25 employees to provide them with the option of a federally certified HMO where available. It also prevents states from restricting doctors who want to join HMOs.\n\n–1973: Kennedy puts up “intense opposition” to the appointment of Caspar Weinberger as secretary of health education and welfare, according to a biography by Adam Clymer, a former New York Times reporter. Kennedy and other senators voice doubts about whether Weinberger can serve the interests of the poor, older Americans and uneducated people, but Weinberger is confirmed.\n\n–1974: Kennedy teams up with Rep. Wilbur Mills, D-Ark., the head of the House Ways and Means Committee, to propose a compulsory national health insurance plan to be paid for by payroll taxes and general revenues. Kennedy’s aides secretly meet with Nixon administration officials but Kennedy and Nixon never agreed on a compromise. The Democrats’ plan is opposed by the American Medical Association and other groups. Kennedy tries unsuccessfully to revive the effort after Nixon resigns. Years later, Kennedy tells the Boston Globe that he may have missed an opportunity by not working closer with Nixon to find a consensus. Perhaps, he says, “We should have jumped on that.”\n\n–1976: Although Democratic presidential candidate Jimmy Carter campaigns on the promise of a national health insurance program, Kennedy criticizes him for “intentionally [having] made his position on some issues indefinite and imprecise.”\n\n–1977: Carter, concerned about the strength of the economy, moves away from national health insurance and proposes measures to contain expenses, such as hospital cost control. This prompts Kennedy in May at a United Auto Workers conference to lambast Carter for not setting a timetable to establish his health insurance program \u0096 a promise Carter made on the campaign trail. “Health reform is in danger of becoming the missing promise in the administration’s plans,” Kennedy says.\n\n–1979: In March, Carter proposes phasing in a national health program, which he says will cost $10 billion to $15 billion, beginning in 1983. Kennedy quickly opposes the plan, calling Carter’s approach to health reform “piecemeal.” The administration shoots back that Kennedy’s proposal for a complete national health plan is too expensive. Kennedy later credits this disagreement as one of the influences on his decision to challenge Carter for the Democratic nomination for the president in 1980.\n\n–1986: As part of what Kennedy calls “a fairly small step” to extend coverage to the country’s uninsured, he introduces legislation requiring employers to allow employees and others who lose group health coverage to purchase their employer-based insurance at their own expense for a fixed time period. It passes as part of the 1985 budget reconciliation bill. On April 7, President Ronald Reagan signs the Consolidated Omnibus Budget Reconciliation Act or COBRA, which was adopted as the name for Kennedy’s program.\n\n–1987: Kennedy becomes the chairman of the Senate’s Labor and Human Resources Committee (later known as the Health, Education, Labor and Pensions Committee).\n\n–1990: As chief co-sponsor, Kennedy joins forces with with Sen. Tom Harkin, D-Iowa, to drive the passage of the Americans with Disabilities Act, prohibiting discrimination based on disability.\n\n–1990: Joined by Elizabeth Taylor, Kennedy and Sen. Orrin Hatch, R-Utah, hold a press conference on March 6 introducing a bill that eventually would be known as the Ryan White Comprehensive AIDS Resources Emergency (CARE) Act to provide federal grants to improve care for individuals and families hit by HIV and AIDS. The measure passes later in the year and is signed by President George H.W. Bush on Aug. 18.\n\n–1992: Kennedy co-sponsors the Mammography Quality Standards Act, which seeks to ensure that all women have access to quality mammography by dealing with issues at screening facilities, including lack of oversight, inferior equipment and poorly trained staff. The law, which has been reauthorized several times, requires all facilities to be inspected, accredited by an FDA-approved group and certified by the FDA or the state.\n\n–1996: Together with Sen. Nancy Landon Kassebaum, R-Kan., Kennedy co-sponsors the Health Insurance Portability and Accountability Act (HIPAA) to protect workers and their families who change jobs or lose employer-based health insurance from being locked out of health coverage or forced to wait for coverage due to pre-existing medical conditions. It also prohibits insurance from being cancelled because of illness. Also, for what the bill is now most well-known, HIPAA establishes provisions on medical confidentiality. President Bill Clinton signs the bill into law on Aug. 21, 1996.\n\n–1997: Kennedy and Hatch announce plans to provide health insurance for millions of uninsured children through the State Children’s Health Insurance Program (SCHIP) and fund the program through an increase in cigarette taxes. Hatch says, “Some have referred to us as the odd couple of the United States Senate. I like to think of us as the dynamic duo.”\n\nThe legislation, although initially a victim to budget rules, passes and is signed by Clinton in August as part of the Balanced Budget Act. It provides money to the states to pay for health coverage for children who do not qualify for Medicaid but whose families cannot afford private insurance. Kennedy calls it “the most far-reaching step that Congress has ever taken to help the nation’s children, and the most far-reaching advance in health care since the enactment of Medicare and Medicaid a generation ago.”\n\n–1998: Kennedy is one of 31 co-sponsors for the Patient Bill of Rights. Although this measure is not the first such bill to be introduced, it becomes the leading vehicle to address public anger toward managed care practices. The legislation aims to protect patients who are members of managed care plans from, among other things, being denied care for the purposes of cost-containment. It also opens the door for patients who are injured as the result of being denied care to sue health plans in state courts.\n\nLater, a more sweeping measure advanced by Rep. Charles Norwood, R-Ga., a retired dentist, passes the House, but Senate GOP leaders hold off Democratic efforts to bring up the bill in that chamber before the close of the 105th Congress. In 1999, the Republican-controlled Senate approves a scaled-back measure while the House, in November, approves a Democratic-backed version. In 2000, after six months of House-Senate negotiations, the conference committee is unable to reach a final agreement.\n\n–2001: Kennedy together with Sens. John McCain, R-Ariz., and John Edwards, D-N.C., introduce the Bipartisan Patient Protection Act, giving patients the right to sue health plans in state courts based on denied care. Although President George W. Bush vows to veto the bill, it passes the Senate 59-36 in June.\n\nThe House passes a modified GOP-backed measure that allows employers to protect themselves from liability, the result of a closed-door compromise made between Bush and Norwood, a long-time patients’ bill of rights leader. The compromise, Kennedy said, ”makes [the patients’ bill of] rights unenforceable.” Adding ”a right without a remedy is not an effective right.” A Senate-House conference never convenes to work out differences between the two chambers. Kennedy and the bill’s other primary sponsors continue attempts to reach agreement with the administration, but abandon these negotiations in 2002.\n\n–August 2001: Kennedy and Hatch introduce the Rare Diseases Act. The legislation increases funding for the NIH Office of Rare Diseases and expands its work. It later splits into two different acts–the Rare Diseases Act and the Rare Diseases Orphan Product Development Act–which are signed into law by Bush in November 2002.\n\n–2003: Kennedy backs Bush’s 2003 plan to add a prescription benefit to Medicare that came with a $400 billion price tag spread out over 10 years. But when Kennedy learns that the Medicare Prescription Drug and Modernization Act of 2003 would, for the first time, allow private HMOs to compete with Medicare for patients, Kennedy works to amend the bill, criticizing the proposal for Medicare competition as “an untried, untested, unworkable program.” His efforts ultimately prove futile and he opposes the final bill. The Medicare Prescription Drug and Modernization Act of 2003 passes Congress and is signed into law by Bush on Dec. 8, 2003.\n\nLater, in an interview with the Boston Globe, Bill Novelli, chief executive of the AARP, which broke with Kennedy, a longtime ally, to endorse the Republican-backed bill, credits the prescription drug benefit to Kennedy. “I think the lesson he learned from the Nixon era is a lesson that history teaches us: You should not let the perfect be the enemy of the good,” he says. “The Medicare Modernization Act was certainly not perfect, but the idea was, get it done and improve it over the coming years.”\n\n–2006: Kennedy and Sen. Charles Grassley, R-Iowa, secure passage of the Family Opportunity Act, which expands Medicaid coverage for children with special needs even if their parents earn more than the usual limit.\n\n–2006: Kennedy, and Sen. Pete Domenici, R-N.M., work with mental health advocates, private insurers and industry on legislation to require private insurers to offer mental health benefits equivalent to traditional health benefits. The bill builds on 1996 legislation seeking to end restrictions on mental health coverage. The Senate approves the bill in September 2007 and the House in March 2008. After negotiations between the Senate and House, language supporting the combined plan is written into law as part of the economic stimulus bill. The effective date for most health plans to make the change is Jan. 1, 2010.\n\n–May 20, 2008: Kennedy is diagnosed with a malignant glioma, a common, highly lethal form of brain tumor. He undergoes surgery and other treatments.\n\n–July 9, 2008: Just a month after undergoing surgery for brain cancer, Kennedy makes a surprise appearance in the Senate, which gives Democrats enough votes to prevent a Republican filibuster that would have cut Medicare fees to doctors. “We got this victory because of Ted,” Sen. Max Baucus, D-Mont., tells the Los Angeles Times. The bill passes later that month after the Senate overrides President Bush’s veto.\n\n— 2008: Kennedy, weakened by cancer treatment, addresses the Democratic National Convention in Denver Aug. 25, pushing the party to continue his efforts on reform. “For me this is a season of hope — new hope for a justice and fair prosperity for the many, and not just for the few — new hope,” he says. “And this is the cause of my life — new hope that we will break the old gridlock and guarantee that every American — north, south, east, west, young, old — will have decent, quality health care as a fundamental right and not a privilege.”\n\n–2009: On June 9, Kennedy submits the Affordable Health Choices Act, and although Kennedy is sidelined fighting his cancer and not able to participate, the measure passes in his Senate Health, Education, Labor and Pensions Committee as part of the larger Capitol Hill effort on health reform. However, the Senate Finance Committee is expected to significantly alter the bill. In July, Kennedy, along with long-time speechwriter and friend Robert Shrum, published an article in Newsweek outlining his personal and political experiences with health issues over the years and describing his vision for reform. He wrote: “For four decades I have carried this cause-from the floor of the United States Senate to every part of this country. It has never been merely a question of policy; it goes to the heart of my belief in a just society.”"}, {"url": "https://www.psychologytoday.com/us/blog/overcoming-pain/201002/edward-m-kennedy-the-man-who-killed-health-care-reform", "page_content": "As Mr. Obama works feverishly to salvage health care reform, he is often heard to invoke-at least when he speaks before an audience of Democrats-the memory of the late Senator Kennedy, as he alternately inveigles and intimidates his legislative branch colleagues. Alas, it may be the President is, unwittingly or not, using a straw man in these final frantic hours of arm-twisting, as anemic election year polls have made naysayers of those who were once reformers.\n\nOver 35 years ago, none other than Richard Nixon proposed a form of \"universal health care\". His final State of the Union address called for universal access to health insurance: His plan would have provided government subsidies to the self-employed and small businesses, and build on existing employer-sponsored insurance plans. However, as one might expect, partisan politics provided the usual obstacles: It was difficult for Democrats to concede that the anti-communist Nixon had become a supporter of \"socialized medicine\". Teddy Kennedy declared that the plan was designed to benefit the insurance companies; however, the reality was that the insurance companies were in for more regulation.\n\nNixon strongly believed that a national health insurance plan was crucial. In that 1974 State of the Union Address, he declared that \"the time is at hand this year to bring comprehensive, high quality health care within the reach of every American\". Actually, this statement is not surprising considering Nixon's personal history of poverty and family illness. (He lost two brothers to tuberculosis, the illnesses dealing a heavy blow to the family finances, and in fact proposed a national health insurance bill when he arrived in Congress in 1947.) Nixon sounds very much like Obama, when he said in 1974 that he did not want to see \"other families of modest means...driven ...to bankruptcy because of the inability to handle medical care problems of a catastrophic type\".\n\nHowever, the \"liberal\" opposition, spearheaded by the lobbying of the then-powerful AFL-CIO and United Autowokers, proved too much for an administration spending significant energy on defending against the rising tide of the Watergate affair.\n\nKennedy did begin secret negotiations with the Nixon White House, but he fell prey to the pressures of the unions, as labor leaders wished for a single-payor system which they felt would be rather easily achieved once a Democrat was elected to the presidency in the face of the Watergate scandal. Many felt that Kennedy would be that Democrat, and therefore he had no business throwing a lifeline to the sinking Nixon administration.\n\nOne can not help but also wonder whether the late Senator got wind of the Nixon administration musings on Teddy, as they discussed monitoring for any moral misbehavior which could be used as political weaponry. Or did Teddy learn that Nixon and aides Haldeman and Ehrlichman at one point discussed the \"crude hot pants\" then-wife Joan was considering wearing to a White House function?\n\nIt would be ironic if national health care met defeat at the hands of a pair of hot pants.\n\nBy the way, Health Care Reform, rest in peace. Not even Pat Buchanan can save you now."}, {"url": "https://abcnews.go.com/GMA/TedKennedy/story?id=8415706", "page_content": "Despite talks of bill named after him, Kennedy's death could be a colossal blow.\n\nAug. 26, 2009— -- Ted Kennedy made affordable health care for all Americans the goal of his Senate career and hoped to see that reform achieved in his lifetime. But the political giant's death raises the question of whether a Congressional bipartisan solution can be achieved.\n\nEven though Kennedy's battle cry for health care continued in his absence from the Senate, while he battled cancer, both Democrat and Republican leaders said he was sorely missed and his absence created a huge gap since he was the leader most easily positioned to advance bipartisan negotiations.\n\nVisit ABC News' special section on Sen. Ted Kennedy.\n\nWatch video of historic Kennedy moments.\n\nWhile the Senate's \"Liberal Lion's\" death could be a colossal blow to a health care reform bill, his memory will likely stay in the forefront of negotiations, and there is already talk of a bill being named after him.\n\n\"It was the cause of his life and he fought it all the way to the end of his life,\" said Kennedy's friend and former press secretary Bob Shrum on ABC's \"Good Morning America\" today. \"Maybe his absence now will cast a long shadow and actually make it happen.\"\n\nFor more on the life and legacy of Sen. Ted Kennedy, watch \"World News\" at 6:30 p.m. ET and the ABC News Special \"Remembering Ted Kennedy\" at 10 p.m. ET. Click here for ABC News' full coverage.\n\nThe corner stone to Kennedy's health care fight was the idea that health care was a basic right, but leading specialists also remember him as a champion of neglected or controversial corners in America's health care system.\n\n\"He lent his voice of reason and passion to virtually every major health or health research issue that the country faced in the last 40- plus years. On DNA research, in vitro fertilization, fetal tissue research, and most recently, stem cell research, 'Teddy' was always there,\" said Dr. Sam Gandy, a professor of Alzheimer's Disease Research at Mount Sinai School of Medicine in New York City.\n\nDoctors in the mental health profession have long hailed his efforts to legislate coverage for mental illness and substance abuse disorders. Mental health has long been a Kennedy family concern, as Ted's older sister Rosemary suffered lived in institutions for most of her life.\n\nDr. David Fassler, of the University of Vermont, called Kennedy \"the driving force\" behind last year's passage of the Mental Health Parity and Addiction Equity Act. Yet on Capitol Hill, Kennedy will largely be remembered for his unfinished work on the health care policy.\n\nKennedy's Mission to Expand Health Care\n\nA longtime chair of the Senate's Committee on Health, Education, Labor and Pensions, Kennedy called for extending Medicare coverage to all Americans, providing health coverage for the uninsured and modernizing health care systems by using new technologies to cut costs. He also proposed requiring every American to have some form of health insurance, a key point of contention even within his own party.\n\n\"I've been able to receive it for myself and my family, just like all of us on the tip of the iceberg. But I want every delegate at this convention to understand, that as long as I can vote, as long as I have a voice in the United States Senate, it's going to be for that Democratic Party platform plank, that provides decent quality health care, North and South, East and West, for all Americans, as a matter of right and not of privilege,\" a fired-up Kennedy said in 1978 at the midterm Democratic convention in Memphis.\n\nThat mantra still rings true with many physicians around the country, but not necessarily with everyone in health care.\n\n\"Ted Kennedy was a person of many talents,\" said Dr. Henry Miller, a research fellow at the Hoover Institution at Stanford University and a leader in biomedical research and pharmaceuticals.\n\n\"He worked hard and passionately to advance the extreme left-wing values that he held, and was known for doing his homework and hiring able staffers,\" Miller continued. \"However, he never let facts or scientific or economic principles get in the way of his socialist ideology and do-gooder mentality.\"\n\nStill others in the health care field were supportive of his mission.\n\n\"Those of us who work in busy, overcrowded emergency departments functioning as safety nets for the millions of Americans who have no insurance coverage know how desperately this nation needs healthcare reform. Ted Kennedy has always championed this cause,\" said Dr. Joseph Ornato, chairman of the Department of Emergency Medicine at Virginia Commonwealth University.\n\nKennedy retreated to Massachusetts following his brain tumor diagnoses in May 2008, but he remained in the fray through op-ed pieces and colleagues said he closely monitored the health care debate in newspapers and on C-Span. Friends said Kennedy's absence from the debate was painful for him and he hoped to be able to partake in the discussions at some point.\n\nKennedy handed the reins of the health committee to Sen. Chris Dodd of Connecticut, who kept in touch with him on Senate proceedings but that became increasingly difficult as Kennedy had problems communicating.\n\n\"His committee was very instrumental by passing a health care bill out in June... and he was involved in that,\" said White House adviser David Axelrod on \"GMA.\" \"He was to the end very much interested and very much committed to seeing this become a reality.\"\n\nKennedy envisioned a system of universal health care but was willing to compromise as long as the agenda was furthered.\n\nKennedy's Bipartisan Work\n\n\"The essence of his legislative record is that he understood life in the arena meant compromise,\" Newsweek editor and presidential historian Jon Meacham said on \"GMA.\" \"He believed in getting things done.\"\n\nOne example of such compromise was the Massachusetts health care plan. Kennedy, a key architect of the plan, compromised essentially on the single payer plan he was pushing just so the plan would move forward, ABC News Medical Editor Dr. Timothy Johnson said.\n\n\"He looked very hard for common ground... He was willing to make a compromise,\" Shrum said. \"He would get as much as he could to try to advance the goals.\"\n\nSee photos of Sen. Ted Kennedy's life.\n\nSee photos of the Kennedy family's history of privilege and loss.\n\nAt the height of his career, Kennedy was favorably associated with health care reform. In 1978, when he pushed then President Carter to come up with a national health program, Kennedy was favored by 44 to 25 percent in a Time magazine poll. And in a November 1979 ABC News poll, Kennedy had a 65 percent favorable rating for his ability to handle health care.\n\n\"This is the cause of my life,\" Kennedy said at an emotional speech at the Democratic National Convention in August 2008 while endorsing then candidate Obama. He spoke of \"new hope that we will break the old gridlock and guarantee that every American … will have decent, quality health care as a fundamental right and not a privilege.\"\n\nKennedy, who staunchly supported President Obama's run for the presidency and hoped to see a bill passed in his lifetime, won't live to see his dream.\n\nThe future of the health care reform remains uncertain with deep partisan divides on the measures being proposed. It is likely to be a tough fight ahead in Kennedy's absence, but his voice, while lost in actuality, is likely to stay in spirit.\n\n\"His basic instruction was to keep pushing forward,\" Axelrod said. \"I think he believed, and we believe, that there's forward momentum here.\"\n\nABC News' Lauren Cox, Gary Langer and Jonathan Karl contributed to this story."}, {"url": "https://millercenter.org/health-care-policy/presidents-health-care", "page_content": "Franklin Roosevelt FDR took office on March 1, 1933, amid an economic catastrophe and pledged to lead “this great army of our people dedicated to a disciplined attack upon our common problems,\" asserting that \"our Constitution is so simple and practical that it is possible always to meet extraordinary needs by changes in emphasis and arrangement without loss of essential form.” During his time in office he came to argue that freedom included “freedom from want.” His New Deal, however, steered clear of pushing the government into health care. In a 1934 speech, for instance, he asserted, “On some points it is possible to be definite. Unemployment insurance will be in the program. I am still of the opinion expressed in my message of June eighth that this part of social insurance should be a cooperative federal-state undertaking.” In contrast, of national health insurance he said, “Whether we came to this form of insurance soon or later on I am confident that we can devise a system which will enhance and not hinder the remarkable progress which has been made and is being made in the practice of the professions of medicine and surgery in the United States.” Similarly, in his 1941 State of the Union, Roosevelt was quite specific that “we should bring more citizens under the coverage of old-age pensions and unemployment insurance\" while keeping health care objectives vague: “We should widen the opportunities for adequate medical care.” For more detail: Kooijman, Jaap. “Soon or Later On: Franklin D. Roosevelt and National Health Insurance, 1933-1945.” Presidential Studies Quarterly 29, no. 2 (1999): 336–50. http://www.jstor.org/stable/27551992.\n\nHarry Truman After seeing the United States through to the end of World War II, Harry Truman faced the question of how to approach his predecessor's New Deal legacy. In September 1945, he made clear his intentions when he delivered a rambling 21-point economic plan that called for new public works programs, legislation guaranteeing \"full employment,\" a higher minimum wage, extension of the Fair Employment Practices Committee, a larger Social Security System, and a national health insurance system. Two months later, he delivered a Special Message to the Congress Recommending a Comprehensive Health Program, in which he said, “In the past, the benefits of modern medical science have not been enjoyed by our citizens with any degree of equality. Nor are they today. Nor will they be in the future—unless government is bold enough to do something about it.” Truman laid out his preferred plan for how a national health system would work: Everyone should have ready access to all necessary medical, hospital and related services.\n\n\n\nI recommend solving the basic problem by distributing the costs through expansion of our existing compulsory social insurance system. This is not socialized medicine.\n\n\n\nEveryone who carries fire insurance knows how the law of averages is made to work so as to spread the risk, and to benefit the insured who actually suffers the loss. If instead of the costs of sickness being paid only by those who get sick, all the people—sick and well—were required to pay premiums into an insurance fund, the pool of funds thus created would enable all who do fall sick to be adequately served without overburdening anyone. That is the principle upon which all forms of insurance are based.\n\n\n\nDuring the past fifteen years, hospital insurance plans have taught many Americans this magic of averages. Voluntary health insurance plans have been expanding during recent years; but their rate of growth does not justify the belief that they will meet more than a fraction of our people's needs. Only about 3% or 4% of our population now have insurance providing comprehensive medical care.\n\n\n\nA system of required prepayment would not only spread the costs of medical care, it would also prevent much serious disease. Since medical bills would be paid by the insurance fund, doctors would more often be consulted when the first signs of disease occur instead of when the disease has become serious. Modern hospital, specialist and laboratory services, as needed, would also become available to all, and would improve the quality and adequacy of care. Prepayment of medical care would go a long way toward furnishing insurance against disease itself, as well as against medical bills.\n\n\n\nSuch a system of prepayment should cover medical, hospital, nursing and laboratory services. It should also cover dental care—as fully and for as many of the population as the available professional personnel and the financial resources of the system permit.\n\n\n\nThe ability of our people to pay for adequate medical care will be increased if, while they are well, they pay regularly into a common health fund, instead of paying sporadically and unevenly when they are sick. This health fund should be built up nationally, in order to establish the broadest and most stable basis for spreading the costs of illness, and to assure adequate financial support for doctors and hospitals everywhere. If we were to rely on state-by-state action only, many years would elapse before we had any general coverage. Meanwhile health service would continue to be grossly uneven, and disease would continue to cross state boundary lines.\n\n\n\nMedical services are personal. Therefore the nation-wide system must be highly decentralized in administration. The local administrative unit must be the keystone of the system so as to provide for local services and adaptation to local needs and conditions. Locally as well as nationally, policy and administration should be guided by advisory committees in which the public and the medical professions are represented.\n\n\n\nSubject to national standards, methods and rates of paying doctors and hospitals should be adjusted locally. All such rates for doctors should be adequate, and should be appropriately adjusted upward for those who are qualified specialists.\n\n\n\nPeople should remain free to choose their own physicians and hospitals. The removal of financial barriers between patient and doctor would enlarge the present freedom of choice. The legal requirement on the population to contribute involves no compulsion over the doctor's freedom to decide what services his patient needs. People will remain free to obtain and pay for medical service outside of the health insurance system if they desire, even though they are members of the system; just as they are free to send their children to private instead of to public schools, although they must pay taxes for public schools.\n\n\n\nLikewise physicians should remain free to accept or reject patients. They must be allowed to decide for themselves whether they wish to participate in the health insurance system full time, part time, or not at all. A physician may have some patients who are in the system and some who are not. Physicians must be permitted to be represented through organizations of their own choosing, and to decide whether to carry on in individual practice or to join with other doctors in group practice in hospitals or in clinics.\n\n\n\nOur voluntary hospitals and our city, county and state general hospitals, in the same way, must be free to participate in the system to whatever extent they wish. In any case they must continue to retain their administrative independence.\n\n\n\nVoluntary organizations which provide health services that meet reasonable standards of quality should be entitled to furnish services under the insurance system and to be reimbursed for them. Voluntary cooperative organizations concerned with paying doctors, hospitals or others for health services, but not providing services directly, should be entitled to participate if they can contribute to the efficiency and economy of the system.\n\n\n\nNone of this is really new. The American people are the most insurance-minded people in the world. They will not be frightened off from health insurance because some people have misnamed it “socialized medicine.”\n\n\n\nI repeat—what I am recommending is not socialized medicine.\n\n\n\nSocialized medicine means that all doctors work as employees of government. The American people want no such system. No such system is here proposed.\n\n\n\n. . .\n\n\n\nPremiums for present social insurance benefits are calculated on the first $3,000 of earnings in a year. It might be well to have all such premiums, including those for health, calculated on a somewhat higher amount such as $3,600.\n\n\n\nA broad program of prepayment for medical care would need total amounts approximately equal to 4% of such earnings. The people of the United States have been spending, on the average, nearly this percentage of their incomes for sickness care. How much of the total fund should come from the insurance premiums and how much from general revenues is a matter for the Congress to decide.\n\n\n\nThe plan which I have suggested would be sufficient to pay most doctors more than the best they have received in peacetime years. The payments of the doctors' bills would be guaranteed, and the doctors would be spared the annoyance and uncertainty of collecting fees from individual patients. The same assurance would apply to hospitals, dentists and nurses for the services they render.\n\n\n\nFederal aid in the construction of hospitals will be futile unless there is current purchasing power so that people can use these hospitals. Doctors cannot be drawn to sections which need them without some assurance that they can make a living. Only a nation-wide spreading of sickness costs can supply such sections with sure and sufficient purchasing power to maintain enough physicians and hospitals.\n\n\n\nWe are a rich nation and can afford many things. But ill-health which can be prevented or cured is one thing we cannot afford. Like much of Truman's program, his plan to insure Americans went nowhere. Still, he continued to make the case, offering another special message to Congress on the subject in May 1947, “The total health program which I have proposed is crucial to our national welfare. The heart of that program is national health insurance. Until it is a part of our national fabric, we shall be wasting our most precious national resource and shall be perpetuating unnecessary misery and human suffering.” And on the 1948 campaign trail he said, “Only 20 percent–one-fifth of our population is able to afford the medical care they need. Now that means that there are 110 million people in this country who can’t afford proper medical attention. That is a disgrace to the richest country in the world.”\n\nThe Board of Trustees of the American Medical Association has approved the expenditure in October of $1,100,000 in a newspaper and radio advertising campaign in an effort to deliver a knockout blow to the Administration pro gram for compulsory health insurance. William Laurence, New York Times, June 27, 1950 Following a surprising and close victory in the 1948 election (he won a plurality but not a majority of the popular vote) Truman continued to argue for national health insurance: Many people are concerned about the cost of a national health program. The truth is that it will save a great deal more than it costs. We are already paying about four per cent of our national income for health care. More and better care can be obtained for this same amount of money under the program I am recommending. Furthermore, we can and should invest additional amounts in an adequate health program-for the additional investment will more than pay for itself. [April 22, 1949]\n\n[April 22, 1949] Now, personally, I have always understood that the Constitution of the United States imposes upon the Government of the United States a responsibility with respect to the general welfare of its citizens. And certainly no one can pretend that good health is not a matter of first importance so far as the general welfare is concerned. That is why, ever since I have been President, I have recommended programs which I believe will provide better medical and health services for all our people. Some groups have received these proposals enthusiastically. Others have been strongly against them. [September 16, 1952]\n\n[September 16, 1952] The health of the American people is one of our basic national resources. It is as important to the welfare of our country as our land, our water, and our minerals. Our National Government has been concerned about the preservation and development of these resources for decades. It is just as logical, and just as important, for us to be concerned about health. [November 19, 1952] Harry Truman wrote this letter to Donald Cook, chairman of the Securities and Exchange Commission, on August 14, 1952 Ultimately, Truman had to admit defeat, writing towards the end of his presidency, “These ‘skin flint’ loan companies who charge the people from twenty-seven to fifty per cent interest on small loans, I think are the worst vultures we have to contend with—they and the American Medical Association are the very reason there has been such a howl about health insurance. One of their sources of ill-gotten income would be dried up. I can see very well why these loan companies wouldn't want health insurance but for the life of me I can't get the doctors [sic] point of view because the objective is to help these people have a nest egg so the doctors and hospitals can be paid.”\n\nDwight Eisenhower During his successful 1952 campaign for the presidency, Dwight Eisenhower stated his opposition to “socialized medicine,” a reflection of the language used to defeat Truman's comprehensive national health insurance plan. But Ike, assumed by many Democrats before the 1948 campaign to be one of them, considered himself a “modern Republican.” He had no desire to roll back the New Deal even as he criticized Truman's plans to expand it. He signed legislation that expanded Social Security, increased the minimum wage, and created the Department of Health, Education and Welfare, and he championed increased investment in the nation's infrastructure. His goals for health care were more restrained, but even as a candidate he balanced his opposition to government intervention in the health care system with the observation that, “Too many of our people live too far from adequate medical aid; too many of our people find the cost of adequate medical care too heavy.” During his 1954 State of the Union, Eisenhower professed his faith that “The great need for hospital and medical services can best be met by the initiative of private plans.” But he did suggest a role for the Federal Government. It is unfortunately a fact that medical costs are rising and already impose severe hardships on many families. The Federal Government can do many helpful things and still carefully avoid the socialization of medicine. The Federal Government should encourage medical research in its battle with such mortal diseases as cancer and heart ailments, and should continue to help the states in their health and rehabilitation programs. The present Hospital Survey and Construction Act should be broadened in order to assist in the development of adequate facilities for the chronically ill, and to encourage the construction of diagnostic centers, rehabilitation facilities, and nursing homes. The war on disease also needs a better working relationship between Government and private initiative. Private and non-profit hospital and medical insurance plans are already in the field, soundly based on the experience and initiative of the people in their various communities. A limited Government reinsurance service would permit the private and non-profit insurance companies to offer broader protection to more of the many families which want and should have it. On January 31, 1955, Eisenhower offered a Special Message to the Congress Recommending a Health Program: I recommend, consequently, the establishment of a Federal health reinsurance service to encourage private health insurance organizations in offering broader benefits to insured individuals and families and coverage to more people. In addition, to improve medical care for the aged, the blind, dependent children, and the permanently and totally disabled who are public assistance recipients, I recommend the authorization of limited Federal grants to match State and local expenditures. Reinsurance: The purpose of the reinsurance proposal is to furnish a system for broad sharing among health insurance organizations of the risks of experimentation. A system of this sort will give an incentive to the improvement of existing health insurance plans. It will encourage private, voluntary health insurance organizations to provide better protection—particularly against expensive illness—for those who now are insured against some of the financial hazards of illness. Reinsurance will also help to stimulate extension of private voluntary health insurance plans to millions of additional people who do not now have, but who could afford to purchase, health insurance. The Department of Health, Education, and Welfare has been working with specialists from the insurance industry, with experts from the health professions, and with many other interested citizens, in its effort to perfect a sound reinsurance program—a program which involves no Government subsidy and no government competition with private insurance carriers. The time has come to put such a program to work for the American people. I urge the Congress to launch the reinsurance service this year by authorizing a reasonable capital fund and by providing for its use as necessary to reinsure three broad areas for expansion in private voluntary health insurance: 1. health insurance plans providing protection against the high costs of severe or prolonged illness, 2. health insurance plans providing coverage for individuals and families in predominantly rural areas, 3. health insurance plans designed primarily for coverage of individuals and families of average or lower income against medical care costs in the home and physician's office as well as in the hospital. Medical care [or public assistance recipients. Nearly 5 million persons in the United States are now receiving public assistance under State programs aided by Federal grants. Present arrangements for their medical care, however, are far from adequate. Special provision for improving health services for these needy persons must be made. I recommend to the Congress, therefore, that it authorize separate Federal matching of State and local expenditures for the medical care needed by public assistance recipients. The separate matching should apply to each of the four Federally-aided categories--the aged, the permanently and totally disabled, the blind and children deprived of parental care. Though Ike did succeed in providing tax cuts for employers who gave their workers health insurance, the national reinsurance plan was not a priority and was never realized. For more detail: Derickson, Alan, “Health Security for All? Social Unionism and Universal Health Insurance, 1935-1958” Journal of American History 80, no. 4 (Mar., 1994): 1333-1356. https://www.jstor.org/stable/2080603 Graham, Jordan M., \"We Are Against Socialized Medicine, But What Are We For?: Federal Health Reinsurance, National Health Policy, and the Eisenhower Presidency\" (2015). Graduate Student Theses, Dissertations, & Professional Papers. 4492.\n\nhttps://scholarworks.umt.edu/etd/4492\n\nJohn Kennedy JFK's narrow victory over Eisenhower's vice president, Richard Nixon, gave him the opportunity to pursue a domestic agenda he called the “New Frontier.”B Kennedy was unable to call on the Democratic majority in Congress to support his most progressive legislative reforms, with many Southerners in his own party deeply suspicious of him. Among other social programs, he proposed medical care for the elderly through an expansion of Social Security. What we are now talking about doing, most of the countries of Europe did years ago. Kennedy took his case to the American public through a rally held at Madison Square Garden in New York on May 20, 1962. As were his predecessors, however, the president was at odds with the American Medical Association, which again launched a campaign against “socialized medicine.” When the bill failed in July by two votes in the Senate, JFK was left to lament, “I believe this is a most serious defeat for every American family, for the 17 million Americans who are over 65, whose means of support, whose livelihood, is certainly lessened over what it was in their working days, who are more inclined to be ill, who are more likely to be in hospitals, who are less able to pay their bills.”\n\nLyndon Johnson Lyndon Johnson assumed the presidency following the stunning assassination of his predecessor, and his first months in office would be oriented by JFK's policies. But having felt sidelined as vice president, Johnson was anxious to put his formidable political skills to work, to succeed where Kennedy had not. “I do understand power,” he once said about himself. “I know where to look for it, and how to use it.” He swiftly moved beyond the Kennedy legacy to an ambitious domestic agenda he called “The Great Society.” Among other issues, health care was squarely in his sights. Rather than address the health care system as a whole, Johnson pushed for the passage of Medicare for the elderly before the 1964 election. He was unsuccessful in the short-term but used the issue in his campaign against Barry Goldwater. After Johnson's landslide victory, passage of national health insurance for the elderly appeared imminent. The idea was popular, Democrats held solid majorities in both houses of Congress, and moderate Republicans were seeking to move toward the political center. Still, the particular form of the program, how much it would cost, and how it would be payed for were very much up for debate—and there were several proposals circulating around Capitol Hill. You just tell them not to let it lay around; they can do that if they want to, but they might not. Then that gets the doctors organized, then they get the others organized, and they damn near killed my education bill lettin’ it lay around. And it stinks. It’s just like a dead cat on the door. When the committee reports it, you better either bury that cat or give it some life. Lyndon Johnson, pushing for passage of Medicare, March 3, 1965 Republicans criticized the lack of coverage for physicians' fees and prescriptions and offered plans to add those benefits. Other members were concerned that the rising costs of health care would leave the Social Security trust fund vulnerable. Thus in its final form, the bill included coverage of physicians' fees and provided for a separate trust fund for Medicare. And to decrease the opposition of the AMA, the final bill left physicians and insurance companies with a substantial amount of control over fees. But Johnson also was able to include Medicaid, which covered poorer Americans. Thus, much like Civil Rights, his final triumph went beyond what Kennedy had proposed. On July 30, 1965, Johnson traveled to the Harry S. Truman Library and Museum in Independence, Missouri, to sign the bill and pay homage to the man who had pushed so hard for a Federal health plan. He presented the first two Medicare cards to President Truman and his wife, Bess, and addressed his remarks to the 33rd president and tracing the roots of the bill back to FDR. There are more than 18 million Americans over the age of 65. Most of them have low incomes. Most of them are threatened by illness and medical expenses that they cannot afford. And through this new law, Mr. President, every citizen will be able, in his productive years when he is earning, to insure himself against the ravages of illness in his old age. This insurance will help pay for care in hospitals, in skilled nursing homes, or in the home. And under a separate plan it will help meet the fees of the doctors. Now here is how the plan will affect you: President Truman (left) greets President Johnson in Independence, MO, for the signing of the Medicare bill. LBJ Library photo by Yoichi Okamoto During your working years, the people of America—you—will contribute through the social security program a small amount each payday for hospital insurance protection. For example, the average worker in 1966 will contribute about $1.50 per month. The employer will contribute a similar amount. And this will provide the funds to pay up to 90 days of hospital care for each illness, plus diagnostic care, and up to 100 home health visits after you are 65. And beginning in 1967, you will also be covered for up to 100 days of care in a skilled nursing home after a period of hospital care. And under a separate plan, when you are 65—that the Congress originated itself, in its own good judgment—you may be covered for medical and surgical fees whether you are in or out of the hospital. You will pay $3 per month after you are 65 and your Government will contribute an equal amount. The benefits under the law are as varied and broad as the marvelous modern medicine itself. If it has a few defects—such as the method of payment of certain specialists-then I am confident those can be quickly remedied and I hope they will be. No longer will older Americans be denied the healing miracle of modern medicine. No longer will illness crush and destroy the savings that they have so carefully put away over a lifetime so that they might enjoy dignity in their later years. No longer will young families see their own incomes, and their own hopes, eaten away simply because they are carrying out their deep moral obligations to their parents, and to their uncles, and their aunts. And no longer will this Nation refuse the hand of justice to those who have given a lifetime of service and wisdom and labor to the progress of this progressive country. And this bill, Mr. President, is even broader than that. It will increase social security benefits for all of our older Americans. It will improve a wide range of health and medical services for Americans of all ages. In 1935 when the man that both of us loved so much, Franklin Delano Roosevelt, signed the Social Security Act, he said it was, and I quote him, \"a cornerstone in a structure which is being built but it is by no means complete.\" Well, perhaps no single act in the entire administration of the beloved Franklin D. Roosevelt really did more to win him the illustrious place in history that he has as did the laying of that cornerstone. And I am so happy that his oldest son Jimmy could be here to share with us the joy that is ours today. And those who share this day will also be remembered for making the most important addition to that structure, and you are making it in this bill, the most important addition that has been made in three decades.\n\n\n\nRichard Nixon Now it is time that we move forward again in still another critical area: health care. Richard Nixon tried not once, but twice to make major changes to the American health care system. A mandate for employer-provided heath insurance was a key foundations of his 1971 health strategy. During his State of the Union address in January, Nixon set out his goals: I will offer a far-reaching set of proposals for improving America's health care and making it available more fairly to more people.\n\n\n\nI will propose:\n\n\n\n—A program to insure that no American family will be prevented from obtaining basic medical care by inability to pay.\n\n\n\n—I will propose a major increase in and redirection of aid to medical schools, to greatly increase the number of doctors and other health personnel.\n\n\n\n—Incentives to improve the delivery of health services, to get more medical care resources into those areas that have not been adequately served, to make greater use of medical assistants, and to slow the alarming rise in the costs of medical care.\n\n\n\n—New programs to encourage better preventive medicine, by attacking the causes of disease and injury, and by providing incentives to doctors to keep people well rather than just to treat them when they are sick.\n\n\n\nI will also ask for an appropriation of an extra $100 million to launch an intensive campaign to find a cure for cancer, and I will ask later for whatever additional funds can effectively be used. The time has come in America when the same kind of concentrated effort that split the atom and took man to the moon should be turned toward conquering this dread disease. Let us make a total national commitment to achieve this goal.\n\n\n\nAmerica has long been the wealthiest nation in the world. Now it is time we became the healthiest nation in the world. Nixon's initial proposal included the following: Employers would be required to provide basic health insurance with specific coverage requirements.\n\nEmployees would share the cost up to a cap.\n\nFor the self-employed and others, special insurance programs at reasonable rates would be made available.\n\nA completely federal plan open to any family below a certain income level would replace Medicaid—cost-sharing would rise with income. Nixon's efforts during his first term, however, went nowhere. In 1974, following his re-election, like Truman before him, he tried again. When he launched the effort in his State of the Union, however, he was at pains to suggest that no taxes would be required and that he would not “put our whole health care system under the heavy hand of the Federal government.” And in February, Nixon delivered a Special Message to the Congress Proposing a Comprehensive Health Insurance Plan—the third special message on health care of his presidency. Beyond the question of the prices of health care, our present system of health care insurance suffers from two major flaws : First, even though more Americans carry health insurance than ever before, the 25 million Americans who remain uninsured often need it the most and are most unlikely to obtain it. They include many who work in seasonal or transient occupations, high-risk cases, and those who are ineligible for Medicaid despite low incomes. Second, those Americans who do carry health insurance often lack coverage which is balanced, comprehensive and fully protective: —Forty percent of those who are insured are not covered for visits to physicians on an out-patient basis, a gap that creates powerful incentives toward high cost care in hospitals;\n\n\n\n—Few people have the option of selecting care through prepaid arrangements offered by Health Maintenance Organizations so the system at large does not benefit from the free choice and creative competition this would offer;\n\n\n\n—Very few private policies cover preventive services;\n\n\n\n—Most health plans do not contain built-in incentives to reduce waste and inefficiency. The extra costs of wasteful practices are passed on, of course, to consumers; and\n\n\n\n—Fewer than half of our citizens under 65—and almost none over 65—have major medical coverage which pays for the cost of catastrophic illness. These gaps in health protection can have tragic consequences. They can cause people to delay seeking medical attention until it is too late. Then a medical crisis ensues, followed by huge medical bills—or worse. Delays in treatment can end in death or lifelong disability. COMPREHENSIVE HEALTH INSURANCE PLAN (CHIP) Early last year, I directed the Secretary of Health, Education, and Welfare to prepare a new and improved plan for comprehensive health insurance. That plan, as I indicated in my State of the Union message, has been developed and I am presenting it to the Congress today. I urge its enactment as soon as possible. The plan is organized around seven principles: First, it offers every American an opportunity to obtain a balanced, comprehensive range of health insurance benefits; Second, it will cost no American more than he can afford to pay;\n\n\n\nThird, it builds on the strength and diversity of our existing public and private systems of health financing and harmonizes them into an overall system; Fourth, it uses public funds only where needed and requires no new Federal taxes; Fifth, it would maintain freedom of choice by patients and ensure that doctors work for their patient, not for the Federal Government. Sixth, it encourages more effective use of our health care resources; And finally, it is organized so that all parties would have a direct stake in making the system work--consumer, provider, insurer, State governments and the Federal Government. By August, Watergate had consumed the Nixon presidency, and with it, any hopes for health care reform.\n\nGerald Ford Nixon's vice president, Gerald Ford, had a host of problems to consider when he assumed the presidency on August 9, 1974, not least of which was to restore the nation's trust in the highest office in the land. Three days later, in an address to a joint session of Congress, Ford kept his plans vague, saying, “As vice president, I studied various proposals for better health care financing. I saw them coming closer together and urged my friends in the Congress and in the administration to sit down and sweat out a sound compromise. The comprehensive health insurance plan goes a long ways toward providing early relief to people who are sick. Why don't we write—and I ask this with the greatest spirit of cooperation—why don't we write a good health bill on the statute books in 1974, before this Congress adjourns?” We cannot realistically afford federally dictated national health insurance providing full coverage for all 215 million Americans. Further efforts on health care were similarly restrained. Inflation began to soar in the Ford years, and it is not surprising that he saw the issue through the lens of cost. In his 1976 State of the Union, he focused more on health care costs than on quality or expansion of coverage. Hospital and medical services in America are among the best in the world, but the cost of a serious and extended illness can quickly wipe out a family's lifetime savings. Increasing health costs are of deep concern to all and a powerful force pushing up the cost of living. The burden of catastrophic illness can be borne by very few in our society. We must eliminate this fear from every family. I propose catastrophic health insurance for everybody covered by Medicare. To finance this added protection, fees for short-term care will go up somewhat, but nobody after reaching age 65 will have to pay more than $500 a year for covered hospital or nursing home care, nor more than $250 for one year's doctor bills. We cannot realistically afford federally dictated national health insurance providing full coverage for all 215 million Americans. The experience of other countries raises questions about the quality as well as the cost of such plans. But I do envision the day when we may use the private health insurance system to offer more middle-income families high quality health services at prices they can afford and shield them also from their catastrophic illnesses.\n\nWe have built a haphazard, unsound, undirected, inefficient nonsystem which has left us unhealthy and unwealthy at the same time. Jimmy Carter, April 16, 1976 Jimmy Carter Jimmy Carter ran for the presidency in 1976 at the head of a Democratic Party that had been pushing for a national health insurance plan during the early 1970s. At the head of the effort was Senator Edward Kennedy, who would become a major opponent of the president. Kennedy was passionate about his bill to establish a single-payer insurance system to cover all Americans, and had lined up supporters among labor unions and other core groups. During the campaign, Carter endorsed the idea, but once in office began to grapple with the financial and political realities. The issue brought out the stark personality differences between himself and Kennedy, who grew deeply frustrated at Carter's unwillingness to move decisively. Everybody in the Democratic Party wanted a health care bill. The issue was what kind of a health care bill. Joseph Califano, Secretary of Health, Education, and Welfare, 1977–1979 Jimmy Carter on his last day in office. Photo: National Archives Believing it was politically unfeasible to change the healthcare system in one fell swoop, Carter focused on a plan that would keep costs down and gradually cover all Americans, recalled Joseph Califano, Carter's secretary of Health, Education, and Welfare, during his interview for the Miller Center's Edward M. Kennedy Oral History: \"We would have combined Medicare and Medicaid into one program. The government would have paid for the poor and the old, and we would have mandated employers—starting the way [Franklin] Roosevelt started the minimum wage—we'd mandate the big employers, who were already providing more than the mandate, to provide mandated coverage, and then gradually, over a period of time, cover everybody.” That wasn't good enough for Kennedy, who thought an incremental, piecemeal approach was a formula for failure. Though willing to negotiate with Carter, by 1978 the senator had broken with the president and prepared not only to introduce his own health care bill but also to mount a primary challenge to a second Carter term. Needless to say, there was no real way to pass legislation as the Carter years came to an end. Stuart Eizenstat, a Carter assistant for domestic affairs and policy, pointed to something else. “It’s interesting and ironic that during a Republican President—Ford and then Nixon—you had a very activist Congress,” he told Miller Center historians during a Jimmy Carter Oral History interview. “And here a Democrat comes into office, committed to furthering that, and you’ve got a Democratic Congress which begins to resist. I think that what happened is that even though they were Democrats, they began to reflect what was happening out there in their districts, which was a growing sense of conservatism.”"}, {"url": "https://www.newyorker.com/magazine/2009/09/07/kennedy-care", "page_content": "Illustration by Tom Bachtell\n\n“One of the traditional methods of imposing statism or socialism on a people has been by way of medicine. It’s very easy to disguise a medical program as a humanitarian project. Most people are a little reluctant to oppose anything that suggests medical care for people who possibly can’t afford it.” This was Ronald Reagan, in 1961, speaking in opposition to an early version of Medicare, the big federal health-insurance program for senior citizens. An important station on Reagan’s road from actor to politician—coming between the national barnstorming he did as a spokesman for General Electric and his sensational campaign speech for Barry Goldwater, in 1964—was the eleven-minute recording from which this quotation comes. It was called “Ronald Reagan Speaks Out Against Socialized Medicine,” and the American Medical Association distributed it to its members.\n\nReagan believed that government health insurance for senior citizens was a Trojan horse: the real goal was universal health care and then full-on socialism. So it was important to resist sentimental appeals: “Now, the advocates of this bill, when you try to oppose it, challenge you on an emotional basis. They say, ‘What would you do, throw these poor old people out to die with no medical attention?’ That’s ridiculous, and, of course, no one has advocated it.”\n\nFour years later, Congress passed Medicare, the emblematic achievement of Lyndon Johnson’s Great Society. Politics is moved less by new ideas than by the ability of politicians to bend the direction of history, even slightly. Government health care had been a leading item on the liberal agenda at least since Harry Truman first proposed it, in 1946. When Reagan made his recording, the time for federal health care had not yet come; what had changed by 1965 was the martyrdom of John F. Kennedy, which made Congress and the public far more amenable to liberal reforms, and the legislative skill of Lyndon Johnson. The first law putting substantial federal money into needy local schools passed at around the same time, and for the same reasons. So did the first tough civil-rights law since Reconstruction. But health care for all was, even in the heyday of the Great Society, a step too far.\n\nBarack Obama, early in his Presidential campaign, did not push universal health care as forcefully as his rivals did. (His position on health care was several notches more centrist than it had been earlier in his career, no doubt because he was aware of the issue’s sixty-year history of drawing relentless and successful Republican attacks.) That changed after Edward Kennedy endorsed him, at a crucial moment in the campaign—most likely, as a result of Kennedy’s prodding. As President, Obama has emerged with a decidedly ambitious agenda, and an all-out first-year push for universal health care, the goal that eluded five of his Democratic predecessors, is part of that. Kennedy’s death, last week, will cost Obama a vote in the Senate, but this may be outweighed—is it too much to hope?—by the good feeling that Kennedy’s decades of large-heartedness have generated, and by the unmistakable sense that universal health care was his enduring wish. His death could spur health-care legislation the way his brother’s death spurred civil-rights legislation.\n\n“I swore I wouldn’t make the same mistakes with my children as my parents did with me.” Copy link to cartoon Copy link to cartoon Shop Shop\n\nKennedy, who entered the Senate in 1963, didn’t come to support universal health care until he was in his second term, when the country had become more liberal. Even Richard Nixon endorsed a form of universal health care. Then history moved again: by 1980, Kennedy was too liberal to get the nomination of his own party and Ronald Reagan was no longer too conservative to be elected President. But Kennedy’s relentless support for universal health care kept it in a kind of incubated state, ready to reëmerge whenever the political climate shifted again.\n\nDuring last year’s Presidential campaign, Obama remarked to the editorial board of the Reno Gazette-Journal, “I think Ronald Reagan changed the trajectory of America in a way that Richard Nixon did not and in a way that Bill Clinton did not. He put us on a fundamentally different path because the country was ready for it.” He then had to spend several days apologizing, but it’s easy to see what he was trying to say: as President, he wanted to have a liberal effect equivalent to Reagan’s conservative one.\n\nIt’s important to remember, though, that Reagan was not so maximalist as he sounded. During his first Inaugural Address, he declared that “government is the problem,” but he did not try to dismantle the “socialized medicine” program he had begun his political career railing against. Welfare reform came not under Reagan but under Bill Clinton, who governed in Reagan’s long shadow. Reagan’s critical contribution was to change the terms of the debate.\n\nOn health care, Reagan’s party has now been reduced to making the argument that he mocked back in 1961—that Obama and the Democrats want to deny medical care to seniors. To say this is to indicate that you regard unlimited Medicare benefits as a sacred right, and, once you’ve taken that step, it becomes difficult—for reasons that Reagan gave in his recording—to oppose government-guaranteed health benefits for people who aren’t senior citizens. The times have changed. The largest increase in government health-care provision since Medicare was George W. Bush’s prescription-drug benefit.\n\nNow, suddenly, it seems that everybody—from Rachel Maddow, on the left, to Peggy Noonan, on the right—is beating up on the formerly untouchable Obama, and taking the health-care battles to be evidence of Presidential weakness. This is absurd. Obama has already substantially realized his Reagan-size Presidential ambition, though in a manner almost opposite from Reagan’s: he has significantly increased the size and scope of government—just look at the classic measure, the increase in federal spending—but hasn’t set out to change the prevailing rhetoric about government. Nonetheless, on health care and other issues the rhetoric has changed. If a health-care bill passes this fall, it will be full of compromises: departures from liberal ideals, and fudges about how much it will cost. But anybody who stops fighting for it now is going to spend years repenting. As long as Congress passes, and Obama signs, a law that embodies the principle of universal, government-guaranteed coverage, the country will have achieved an enormous, and previously elusive, advance. Reagan nailed it in 1961: medical care is a core element in the liberal social compact.\n\nThe passage of a substantive health-care bill would be immensely to Obama’s credit, but he would not be its only begetter. What he said in Reno was exactly right: if he winds up being able to shift the trajectory of American politics, it will be because the country was ready. Ted Kennedy spent a career making sure that it would be. ♦"}, {"url": "https://slate.com/news-and-politics/2013/11/john-f-kennedys-health-care-failure-jfk-and-barack-obamas-tough-fights-to-reform-health-care.html", "page_content": "In the spring of 1962, President John F. Kennedy launched a bold effort to provide health care for the aged—later to be known as Medicare. It culminated in a nationally televised presidential address from Madison Square Garden, carried on the three television networks. It was a flop. The legislation foundered amid charges that it was an attempt to socialize medicine and a threat to individual liberty—the same charges President Obama encountered over the Affordable Care Act five decades later.\n\nAdvertisement\n\nWhile Obama crosses his fingers and waits for healthcare.gov to flicker to life, he can at least comfort himself knowing that he has already done more to reform the health care system than JFK, a president with a vigorous reputation and vibrant legacy. The Gallup poll reports that 74 percent of the country believe John F. Kennedy will go down in history as an outstanding or above-average president, a more positive review than any other post-World War II president receives.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nBut the story of Kennedy’s health care failure is not just about the enduring difficulty of addressing such a thorny issue. It is about how even an energetic and determined chief executive can be constrained by the limitations of the office. Kennedy’s story of botched congressional relations, the limits of public persuasion, and the rise of a grassroots opposition that can match the power of the bully pulpit foreshadows many of the same problems President Obama faces today.\n\nAdvertisement\n\nKennedy took office with a grand new vision for the presidency. In September 1960, before his narrow victory over Richard Nixon, the then-senator read the first of several memos he had requested from political scientist Richard Neustadt. The Columbia professor had just published his seminal work Presidential Power, which offered a new theory on how a president, limited by the Constitution, can still succeed through personal persuasion, backroom maneuvering, and public prestige. Kennedy was in a hurry to put its thinking into action. By using the right formula, he could achieve the greatness he craved. Days before taking the oath, he outlined his approach to the National Press Club. Eisenhower had a “detached, limited concept of the presidency,” he said. The 1960s required a president to “place himself in the very thick of the fight … prepared to exercise the fullest powers of his office … to ensure enactment of that legislation—even when conflict is the result.”\n\nAdvertisement\n\nAdvertisement\n\nKennedy embraced conflict on Medicare. Soon after taking office, he asked Congress to move on the issue, but like Obamacare it languished while its members pawed over it. By the spring of 1962, the president had political and personal reasons to push the fight again. Kennedy’s pollster Lou Harris counseled that he would need domestic accomplishments for his re-election and that Medicare would be an important one. The issue was also essential for the AFL-CIO, a key Democratic Party ally, and so could be incredibly helpful for Democrats facing election that year.\n\nAdvertisement\n\nKennedy had his eye on his legacy, too. That’s usually a topic for a president’s second term, but Kennedy was always in a hurry. JFK, who repeatedly referred to the gravity of foreign policy issues, also thought the measure of a great president was how much of his agenda had been pushed through Congress. He quibbled with presidential rankings that had put Teddy Roosevelt and Woodrow Wilson ahead of Harry Truman and James Polk, who had actually achieved more. “[P]eople who educated the nation without necessarily accomplishing their particular purposes rated, in his judgment, below those who accomplished their purposes without necessarily bringing the nation along with them,” wrote Arthur Schlesinger Jr. in A Thousand Days, his chronicle of his time in the Kennedy administration.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nInside the administration they debated how to proceed. Should the president’s aides play the inside legislative game or should the president build public pressure that would force members of Congress to act? Wilbur Mills, the powerful chairman of the House Ways and Means Committee, had blocked the legislation, and Kennedy had to treat Mills carefully. He was the gatekeeper for all of Kennedy’s policy priorities, from taxes to trade to foreign aid. But Mills had sent signals that he might allow Medicare to sneak in under the cloak of a welfare bill, which Mills wanted to pass. Medicare would be added to the bill in the Senate, and then Mills could water it down in the conference committee where the House and Senate versions of the welfare bill were reconciled.\n\nAdvertisement\n\nIt was a plausible strategy, but some on Kennedy’s staff and the AFL-CIO wanted a public fight to get a stronger bill. Since the dawn of the television age, every president has faced this inside-outside tension, with presidents and their staff putting more and more stock in their ability to rally the country. It was also President Obama’s main legislative strategy.\n\nAdvertisement\n\nKennedy, who faced this presidential conundrum in its infancy, decided to follow both routes, working to persuade on the inside but also “going public”—over the heads of Congress and directly to the voters—to create pressure in Washington. He was determined to take control of his office and he had cause to press his advantage. The New York Times reported on the eve of the fight that members of Congress “on the whole appear to be far friendlier toward him and his program than at any other time since the session began in 1961. This results chiefly from the growing election-year sensitivity to Mr. Kennedy’s popular influence in the country. Even Republicans are sensitive to this influence.”\n\nAdvertisement\n\nThe AFL-CIO held 33 rallies across the country, culminating with Kennedy’s address on May 20 in Madison Square Garden; the union packed the arena with almost 20,000 older voters.\n\nAdvertisement\n\nThe president started his remarks by addressing criticisms that he was unduly trying to whip up the public, instead of leaving the business of government to those who govern. He argued any large piece of legislation required public consent and called on his audience to make Medicare a public crusade. He referred to his father, whom he had just visited in the hospital—much as President Obama spoke about his mother when making the case for his reforms. But where Obama had talked about his mother wrestling with medical bills, Kennedy referred to his father’s good experience with the health care system and suggested the same should be available for any elderly person. Kennedy concluded by saying, “I refuse to see this country, and all of us, shrink from these struggles which are our responsibility in our time. Because what we are now talking about, in our children’s day will seem to be the ordinary business of government.”\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nThe ladies in flowered hats and men in thick black glasses cheered enthusiastically, but they weren’t the audience the president needed. “[T]he president had forgotten the lesson of his campaign that arousing a partisan crowd in a vast arena and convincing the skeptical TV viewer at home require wholly different kinds of presentation,” wrote his closest aide, Ted Sorensen. “He already had support from the senior citizens; he needed more support from the home viewers, and that speech did not induce it.”\n\nThat wasn’t Kennedy’s only problem. He had competition for the public mood. After the 1960 election, the American Medical Association girded for the Medicare battle, raising its dues from $35 to $70 and blanketing its members with warnings about Kennedy’s plan to socialize medicine. The organization brought in doctors from England to describe the dire straits of Great Britain’s insurance system. In advance of the Madison Square Garden push, the AMA said the Treasury was being “looted” to subsidize the biggest lobbying campaign the nation had ever seen.\n\nAdvertisement\n\nTo rebut Kennedy directly, the lobby purchased half an hour of television time and Dr. Edward Annis, a Miami surgeon, went to Madison Square Garden to deliver his own address. Annis spoke to an empty hall, where the banners from two nights before still hung, portraying himself as an underdog. “Nobody—certainly not your doctors—can compete in this unfamiliar art of public persuasion,” he said, lamenting that the president appeared on all three networks but the AMA (your doctor) had to purchase time and therefore could appear on only one. “We doctors fear that the American public is in danger of being blitzed, brainwashed, and bandwagoned,” he said, arguing the laws on the books allowed people to be covered through private programs. Annis then held up the legislation and attacked the president’s claims one by one. Kennedy and his aides knew immediately that they had lost the battle with the good family doctor.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nBut the damage didn’t end there. By going to the public, Kennedy antagonized the very members of Congress he needed to get the legislation moving. “To get a vote on Medicare in the House, we had to persuade Mills, and you don’t persuade Mills with a rally in Madison Square Garden,” said Larry O’Brien, Kennedy’s close aide, who was working the bill in Congress. “Kennedy understandably wanted to take his case to the people, but in this particular instance that approach didn’t work.”\n\nThe last chapter of Kennedy’s failure on Medicare came as a result of either being hoodwinked by members of Congress or in misreading them, which, given the nature of backroom deals in the 1960s, may have been the same thing. In a last-ditch effort, the president and Medicare proponents returned to the original strategy of trying to attach the health care program to the welfare bill in the Senate. The measure was debated for three weeks, after which Democratic leader Mike Mansfield thought he had the 50 votes needed for passage. (Vice President Lyndon Johnson would break the tie.)\n\nAdvertisement\n\nThe opposition, made up of Republicans and Southern Democrats, did not filibuster the bill the way they would today, but that’s because they had better weaponry. Oklahoma Sen. Robert Kerr, a Democrat and one of the most powerful men in the Senate, was the leader of the opposition. He was highly skilled at manipulating his colleagues through almost any means necessary. (“Mr. Kennedy asked; Mr. Kerr decided,” wrote the Wall Street Journal at the time.) Kennedy and Kerr had both been trying to win over West Virginia Sen. Jennings Randolph to their side, but according to historian Irving Bernstein, Kerr wrote a provision into the welfare bill that extended a $21 million overexpenditure to West Virginia—essentially a kickback—and Randolph voted against Kennedy.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nIn the end, Kennedy’s attempt to play both the outside game and the inside game failed. Such defeats led to the kind of appraisals that President Obama now faces as his approval ratings and personal ratings hit new lows. “There is a vague feeling of doubt and disappointment about President Kennedy,” wrote James Reston in the New York Times. “He has touched the intellect of the country, but not its heart. He has informed but not inspired the nation. … [H]is problem is probably not how to get elected, but how to govern.” Fifty years later, it’s a fitting description of another president in the midst of his own health care fight.\n\nRead more in Slate on the 50th anniversary of the JFK assassination."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/health-care-reform", "page_content": "Health Care Reform\n\nHealth care reform, driven by a desire to contain costs, has become a common feature of the Canadian political landscape in the 1990s. Indeed, many believe that it has already had a significant impact on the quality of the Canadian health care system. This has led to speculation concerning the legal responsibility of the various health care decision makers for the reduction, perceived or otherwise, in the standard of health care services. For instance, can a patient who believes that he or she has been injured as a result of a cost containment initiative successfully sue his or her physician, health authority or government?\n\nWhile there have been very few cases directly on point, at the current time Canadian courts seem uncomfortable allowing economic exigency to stand as an excuse for substandard health care (ie, the paramount duty of the physician is to the patient, not to the health care system). However, as cost containment becomes an increasingly common feature of our health policy, Canadian courts may find it difficult not to incorporate economic considerations in their assessment of medical malpractice cases."}], "Harry S. Kennedy was a strong advocate for the rights of the disabled.": [{"url": "https://www.nps.gov/articles/disabilityhistoryrightsmovement.htm", "page_content": "President George H.W. Bush signing the Americans with Disabilities Act. Photo inscribed to Justin Dart, Jr., 1990. Image from the National Museum of American History (CC BY-SA 2.0; https://www.flickr.com/photos/nationalmuseumofamericanhistory/20825041956/)\n\nTreatment and perceptions of disability have undergone transformation since the 1900s. This has happened largely because people with disabilities have demanded and created those changes. Like other civil rights movements, the disability rights movement has a long history. Examples of activism can be found among various disability groups dating back to the 1800s. Many events, laws, and people have shaped this development. To date, the 1990 Americans with Disabilities Act (ADA) and the subsequent ADA Amendments Act (2008) are the movement’s greatest legal achievements. The ADA is a major civil rights law that prohibits discrimination of people with disabilities in many aspects of public life. The disability rights movement continues to work hard for equal rights.\n\n\n\nOrganizations by and for people with disabilities have existed since the 1800s. However, they exploded in popularity in the 1900s. The League of the Physically Handicapped organized in the 1930s, fighting for employment during the Great Depression. In the 1940s a group of psychiatric patients came together to form We Are Not Alone.[2] They supported patients in the transition from hospital to community. In 1950, several local groups came together and formed the National Association for Retarded Children (NARC). By 1960, NARC had tens of thousands of members, most of whom were parents. They were dedicated to finding alternative forms of care and education for their children.[3] Meanwhile, people with disabilities received assistance through the leadership of various presidents in the 1900s. President Truman formed the National Institute of Mental Health in 1948. Between the years 1960 and 1963, President Kennedy organized several planning committees to treat and research disability.[3]\n\n\n\nThe US Congress has passed many laws that support disability rights either directly or by recognizing and enforcing civil rights. Civil rights laws such as Brown v. Board of Education and its decision that school segregation is unconstitutional laid the groundwork for recognizing the rights of people with disabilities. Several sections of the 1973 Rehabilitation Act, which specifically address disability discrimination, are especially important to the disability rights movement. Section 501 supports people with disabilities in the federal workplace and in any organization receiving federal tax dollars. Section 503 requires affirmative action, which supports employment and education for members of traditionally disadvantaged minority groups. Section 504 prohibits discrimination against individuals with disabilities in the workplace and in their programs and activities. Section 508 guarantees equal or comparable access to technological information and data for people with disabilities. The regulations for Section 504 of the Rehabilitation Act of 1973 were written but not implemented. In 1977, the disability rights community was tired of waiting, and demanded that President Carter sign the regulations. Instead, a task force was appointed to review them. Afraid that the review would weaken the protections of the Act, the American Coalition of Citizens with Disabilities (ACCD) insisted they be enacted as written by 5 April 1977, or the coalition would take action. When the date arrived and the regulations remained unsigned, people across the country protested by sitting-in at federal offices of Health, Education, and Welfare (the agency responsible for the review). In San Francisco, the sit-in at the Federal Building lasted until April 28, when the regulations were finally signed, unchanged. This was, according to organizer Kitty Cone, the first time that “disability really was looked at as an issue of civil rights rather than an issue of charity and rehabilitation at best, pity at worst.”[4]\n\n\n\nThe 1975 Education of All Handicapped Children Act guaranteed children with disabilities the right to public school education. These laws have occurred largely due to the concerted efforts of disability activists protesting for their rights and working with federal government. In all, the United States Congress passed more than 50 pieces of legislation between the 1960s and the passage of the ADA in 1990.\n\n\n\nSelf-advocacy groups have also shaped the national conversation around disability. Self-advocacy means representing one's own interests. Such groups include DREDF (Disability Rights Education and Defense Fund), ADAPT (Americans Disabled for Accessible Public Transportation, later changed to Americans Disabled Attendant Programs Today), and the CIL (Center for Independent Living). The CIL provides services for people with disabilities in the community. The CIL began in the early 1960s at Cowell Memorial Hospital. Located in California, Cowell Memorial Hospital was once listed on the National Register of Historic Places. The building is now demolished, but its legacy remains. The hospital supported the \"Rolling Quads\" and the \"Disabled Students Program” at University of California Berkeley. Students Ed Roberts and John Hessler founded both organizations. Both men lived with physical disabilities and needed to find housing options after their acceptance to the university. University dormitories could not manage Roberts' iron lung, an assistive breathing device for people with polio, or Hessler's physical needs. Hessler and Roberts instead lived at Cowell Memorial Hospital when they arrived at college in the early 1960s. With the assistance of College of San Mateo counselor Jean Wirth, they demanded access to the school and encouraged other students with physical disabilities to attend UC Berkeley. They also influenced school architecture and planning. UC Berkeley eventually created housing accommodations for these students. It was there that the students planted the seed of the independent living movement. The independent living movement supports the idea that people with disabilities can make their own decisions about living, working, and interacting with the surrounding community. This movement is a reaction to centuries of assisted living, psychiatric hospitals, and doctors and parents who had made decisions for individuals with disabilities.\n\n\n\nRoberts, Hessler, Wirth and others established the Disabled Students Program at UC Berkeley. Although this was not the first program of its kind-- Illinois offered similar services beginning in the 1940s-- the UC Berkeley Program was groundbreaking. They promoted inclusion for all kinds of students on campus. The program inspired universities across the country to create similar organizations. Many of these organizations are still active today."}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/jfk-domestic-politics/", "page_content": "On the evening of May 3, 1963, Americans watched on television as Martin Luther King Jr.'s campaign to desegregate Birmingham, Alabama collapsed under a wave of officially sanctioned violence. Birmingham police attacked peaceful black demonstrators with clubs, dogs, and high-pressure fire hoses, and for the first time many citizens understood the breadth of America's racial divide. Perhaps no one regarded the events with more anguish than President John Fitzgerald Kennedy. The violence in Birmingham proved that Kennedy's piecemeal approach to civil rights had failed.\n\nMartin Luther King. and cabinet meeting , August 5 , 1965. Courtesy: Library of Congress\n\nElected president in 1960, Kennedy had campaigned on an idealistic New Frontier platform. The president believed that by showing the world what a free and democratic society had to offer, the United States could ensure the defeat of Communism. Unfortunately, since Kennedy had taken office, the world had seen the negative side of America -- intolerance and oppression. Despite Constitutional assurances to the contrary, African Americans were treated as second class citizens. They were frequently denied access to public facilities, prohibited from exercising their voting rights, and subjected to racist violence.\n\nUnder leaders such as King, African Americans organized nonviolent protests to gain access to public facilities. They sued in the courts for equal treatment, and used the pulpits and the press to eloquently state the case for full citizenship. And they implored their president to take a forceful public stand by issuing a call for comprehensive civil rights legislation. For the first two years of his administration, Kennedy ignored the call.\n\nThe Democrats held a narrow majority in Congress, and many of the Democratic seats were held by Southerners who opposed civil rights legislation. The president needed the white Southern vote to win reelection in 1964. So Kennedy adopted a cautious approach to civil rights, emphasizing enforcement of existing laws over the creation of new ones.\n\nKennedy pushed civil rights on many fronts. He ordered his attorney general to submit friends of the court briefs on behalf of civil rights litigants. He appointed African Americans to positions within his administration, named Thurgood Marshall to the Second Circuit Court of Appeals in New York, and supported voter registration drives.\n\nBut such an approach was problematic. By not addressing civil rights publicly and comprehensively, Kennedy was forced to address racial incidents on a case by case basis -- often after they had escalated to violence. In May, 1961, racists attacked Freedom Riders traveling by bus from Washington, D.C. to Birmingham, Alabama. Kennedy sent federal marshals to protect the protesters. But even armed marshals could not guarantee protection.\n\nJames Meredith at the University of Mississippi at Oxford, Courtesy: Library of Congress\n\nIn September 1962, James Meredith, a black man, attempted to register at the segregated University of Mississippi at Oxford. Kennedy had brokered a deal with segregationist governor Ross Barnett. The registration would occur on a Sunday, when opposition forces were least likely to be active. Federal marshals would be there to protect Meredith. But as Kennedy prematurely announced Meredith's successful registration on national television, marshals were fighting -- and losing -- a battle to control violent segregationists at the university.\n\nIf this incident embarrassed the Kennedy administration, it did little to alter the president's approach to civil rights. Activists asked Kennedy to issue an executive order ending discrimination in Federal mortgage loans. He put off the action for months, and issued a watered-down order in November of 1962. In February, 1963, he sent a civil rights package to Congress which included legislation to secure black voting rights. That the bill failed to address access to public facilities -- a major point of contention for civil rights activists -- was a moot point. The president did little to promote the bill's passage, and it quickly expired.\n\nKennedy's approach to civil rights was viewed, by civil rights leaders, as noncommittal. But the violence in Birmingham on May 3 of 1963 left him no choice but to alter his course. The nightsticks, the police dogs, and the fire hoses had revealed a glimpse of what America could become. Unless Kennedy took a firm stand, the New Frontier might deteriorate into a bloody race war.\n\nOn the evening of June 11, just hours after federal marshals had escorted black students to their dormitories at the University of Alabama at Tuscaloosa, the president delivered a televised address to the nation. Speaking with conviction, Kennedy announced he would send comprehensive civil rights legislation to Congress. The package would include provisions for access to public facilities, voting rights, and technical and monetary support for school desegregation.\n\n\"The heart of the question,\" the president said, \"is whether all Americans are to be afforded equal rights and opportunities.\" The answer from those who opposed civil rights came later that evening, when segregationist Byron de La Beckwith shot and killed Medgar Evers, the NAACP's Mississippi field secretary.\n\nFive months later, Kennedy himself was assassinated in Dallas, Texas. Comprehensive civil rights legislation had not yet passed. It would be up to Lyndon Baines Johnson, Kennedy's successor -- and to committed activists across the nation -- to resume the battle for equality.\n\nKennedy's failure to secure meaningful civil rights legislation was emblematic of other stalled domestic policy initiatives introduced by his administration. His efforts to cut taxes and increase funding for education also died in Congress. At the end of his brief presidency, much of the bright promise of the New Frontier had yet to be fulfilled."}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/kennedys-and-civil-rights/", "page_content": "JFK, 1963. John F. Kennedy Presidential Library and Museum\n\nJohn Kennedy was elected president in 1960 partly because of his promise to secure equal rights for black Americans. Yet, once in office, he and his brother Robert, the attorney general, sought to avoid too great an involvement in the politically divisive struggle. Violent Southern conflict about black civil rights overtook the Kennedys, forcing them to intervene on the side of the integrationists. Still, President Kennedy resisted sending strong civil rights legislation to Congress, unwilling to risk further alienating the powerful Southern conservatives blocking his domestic program.\n\nA Rising Movement\n\nThe African American movement for equal rights had been building for years. The Supreme Court ruled in Brown v. Board of Education in 1954 that segregated educational facilities were inherently unequal. An African American teenager from Chicago, Emmett Till, was brutally murdered in Mississippi in summer 1955. When his mother decided to keep her son’s casket open, to show what had been done to him, many people who had stayed on the sidelines were moved to join the struggle for justice. A few months later, an African American seamstress, Rosa Parks, sat in the front of a bus, refusing to move to the back, where blacks were expected to sit. Her arrest motivated a boycott of Montgomery, Alabama buses led by the Reverend Martin Luther King Jr.\n\nVehement Opposition\n\nEven as supporters of equal rights increased their activism, the opposition grew. White supremacist Citizens’ Councils sprung up in Mississippi following the Brown decision. In 1956 a mob nearly lynched Autherine Lucy, a black woman who tried to register as a student at the University of Alabama. George Wallace, an ambitious Alabama politician, lost his bid for governor in 1958 after receiving the endorsement of the NAACP. His victorious opponent had been endorsed by the Ku Klux Klan. Wallace took away the lesson that he needed to take a stronger position against integration; his hardened attitude would help him claim victory in 1962.\n\nThe 1960 Election\n\nBy the time John Kennedy and Richard Nixon met to debate in the 1960 presidential campaign, the civil rights issue could not be ignored. Both candidates sympathized with the plight of African Americans, but failed to provide solutions to the problem. During the campaign, Martin Luther King Jr.was arrested in Atlanta for a sit-in and sentenced to four months hard labor. His friends worried that he would be lynched while in prison. Kennedy called Mrs. King directly and offered his sympathy; meanwhile, his brother Bobby called the judge in Georgia and King was released on bail a few days later. This incident drew little mainstream press, but the African American community was well aware of it. Martin Luther King Sr., who had endorsed Nixon earlier, switched allegiances. “This man was willing to wipe the tears from my daughter[-in-law]'s eyes,” he said. “I’ve got a suitcase of votes, and I’m going to take them to Mr. Kennedy.” The black vote was pivotal in the swing states of Illinois, Michigan and South Carolina that Kennedy carried.\n\nReluctant Involvement\n\nThe African American vote may have been pivotal in getting Kennedy into office but once he was there he was reluctant to get involved in the divisive issue of civil rights. He and his brother Robert were drawn into the struggle when thirteen black and white members of the Congress of Racial Equality boarded a bus in Washington, D.C., and headed to New Orleans to protest segregation of interstate transportation. When these Freedom Riders were stopped by violence in Birmingham, Alabama, Robert Kennedy intervened to get the Riders back on their way. When mobs of angry whites attacked the Freedom Riders in Montgomery, Alabama, Robert Kennedy sent in federal marshals.\n\nHaving It Both Ways\n\nForced to react on the side of civil rights, the Kennedy brothers still did not seem committed to the issue. “The Kennedys wanted [it] both ways. They wanted to appear to be our friends and they wanted to be the brake on our movement,” said civil rights activist Roger Wilkins. But John Kennedy saw himself as having done more than any other president for African Americans. Historian Robert Dallek wrote, “he had gone beyond other presidents, but it was not enough to keep up with the determined efforts of African Americans to end two centuries of oppression.” Still, the Freedom Riders conflict had its impact. Robert Kennedy later said, “I never recovered from it.” For the rest of his life, he would remain a champion of civil rights.\n\nThe Early Sixties\n\nRacial tensions continued to build. In 1962 President Kennedy sent hundreds of U.S. marshals to enforce a court order to admit African American James Meredith to the University of Mississippi. The marshals encountered fierce resistance from violent segregationists. In a melee, two people were killed and dozens injured. In February 1963 Kennedy submitted a civil rights bill to Congress that did not address the important issue of integration of public facilities. He did little to support the bill and it floundered. When racial violence erupted in Birmingham, Alabama, in May 1963, John Kennedy realized it was time to put forward a broad new civil rights bill. Most of his advisers told him it would be a terrible political mistake. But Robert advised him that the future of the country was at stake and urged him to go ahead with the bill.\n\nA Landmark Speech\n\nOn June 11, 1963, the day that Governor George Wallace made his “stand in the school room door” to prevent two black students from attending the University of Alabama, President Kennedy spoke to the nation in a televised address to ask for support of the civil rights bill. He said, “We are confronted primarily with a moral issue. It is as old as the scriptures and is as clear as the American Constitution. The heart of the question is whether all Americans are to be afforded equal rights and equal opportunities.”\n\nTwo Reactions\n\nFor some, Kennedy’s speech was a long-awaited show of support. “All of a sudden, he brought passion to it, he brought that eloquence to it and it electrified me and all kinds of other black people,” Roger Wilkins remembered. Fellow civil rights activist John Lewis said, “that night in June… he spoke, I think, to the heart and to the soul of America. I would never forget that speech.” For others, the speech was intolerable. Later that night, a reply came from those who opposed civil rights. Segregationist Byron de la Beckwith shot and killed Medgar Evers, the NAACP’s field secretary in Mississippi.\n\nLegislative Victory\n\nWithin weeks, Kennedy presented to Congress the most sweeping civil rights legislation since Reconstruction. In September 1963, asked to comment on a Gallup poll reporting that fifty percent of the nation thought he was pushing too fast on integration, Kennedy said, “This is not a matter on which you can take the temperature every week or two… you must make a judgment about the movement of a great historical event which is taking place in this country… Change always disturbs.” Just two months later, John Kennedy was assassinated. His successor, Lyndon Johnson, pushed the bill through Congress and signed it into law in 1964."}, {"url": "https://www.jfklibrary.org/learn/about-jfk/jfk-in-history/john-f-kennedy-and-people-with-intellectual-disabilities", "page_content": "Please note that intellectual and developmental disabilities were referred to in President Kennedy’s time as \"mental retardation.” The Kennedy Library has chosen to use the term “intellectual disabilities” wherever possible here.\n\n\"We must promote--to the best of our ability and by all possible and appropriate means--the mental and physical health of all our citizens.\" - President Kennedy, February 5, 1963\n\nAt the dawn of the New Frontier, as John F. Kennedy launched his administration, intellectual disability was a neglected issue, receiving minimal state or federal funding. Few scientists were researching its causes, and even fewer doctors and educators were trained to support people with intellectual disabilities and their families. Many children and adults with intellectual disabilities were cared for in overcrowded, understaffed institutions that isolated them from their families and communities. President Kennedy, with strong support from his sister Eunice Kennedy Shriver, brought intellectual disabilities \"out of the shadows\" and into the public light.\n\nA Family Matter\n\nThe Kennedy family had a personal connection to the issue; the president's sister Rosemary, sixteen months his junior, was born with intellectual disabilities.\n\nIn 1946, Ambassador and Mrs. Joseph P. Kennedy established the Joseph P. Kennedy Jr. Foundation (in memory of their eldest son) to \"seek the prevention of intellectual disabilities by identifying its causes, and to improve the means by which society deals with citizens who have intellectual disabilities.\" Eunice Kennedy Shriver began directing the foundation in 1957 and became a staunch advocate for people with intellectual disabilities and their families.\n\nAt the urging of Eunice Kennedy Shriver, Kennedy made intellectual disabilities a priority for his new administration. Before his inauguration, he created a transition task force. Once in office, he followed its recommendation to establish the National Institute of Child Health and Human Development. Still in existence today, the institute was charged with conducting and supporting research on intellectual disabilities as well as all aspects of maternal and child health and human development.\n\nNine months after the inauguration, at a press conference on October 11, 1961, President Kennedy announced his intention to appoint \"a panel of outstanding scientists, doctors, and others to prescribe a plan of action in the field\" intellectual disabilities. He added, \"The central problems of cause and prevention remain unsolved, and I believe that we as a country, in association with scientists all over the world, should make a comprehensive attack.\" The 27-member panel met with President Kennedy at the White House on October 18, 1961.\n\nThe President's Panel on Mental Retardation\n\nThe president charged panel members with submitting their report by the close of 1962. The President's Panel on Mental Retardation spent a year busily gathering information, interpreting data, and debating solutions. They reconciled competing agendas and submitted their report ahead of deadline. At a meeting with the president on October 16, 1962, they presented more than 100 recommendations for a comprehensive federal approach to intellectual disabilities and urged him to \"think and plan boldly.\"\n\nPresident Kennedy used the panel's report as a blueprint to address those living with intellectual disabilities. On February 5, 1963, in a \"Special Message to the Congress on Mental Illness and Mental Retardation,\" he announced \"a bold new approach\" to Intellectual disabilities. He outlined recommendations from the panel, including new programs for maternity and prenatal care, initiatives for moving away from \"custodial institutions\" to community-centered agencies, and plans for the construction of research centers that would include diagnostic, clinical, and treatment services. He also emphasized the importance of special education, training, and rehabilitation.\n\nLegislation for Mental Health Care\n\nEight months later, on October 24, 1963, President Kennedy signed the Maternal and Child Health and Mental Retardation Planning Amendment to the Social Security Act, the first major legislation to combat mental illness and intellectual disabilities. The amendment incorporated many of the panel's recommendations and provided planning grants to enable states to update their intellectual disabilities programs. It also increased funding for prevention through maternity and infant care.\n\nA second piece of legislation, approved on October 31, 1963, provided funding for the construction of facilities related to the prevention, care, and treatment of people with intellectual disabilities. These included research centers that would study the causes of intellectual disabilities, university-related diagnostic treatment clinics, and community-based centers for the care of people with intellectual disabilities. The law also increased funding to \"train teachers of mentally retarded and other handicapped children.\"\n\nIn a special ceremony to celebrate the signing of the landmark legislation, President Kennedy remarked, \"It was said, in an earlier age, that the mind of a man is a far country which can neither be approached nor explored. But, today, under present conditions of scientific achievement, it will be possible for a nation as rich in human and material resources as ours to make the remote reaches of the mind accessible. The mentally ill and the mentally retarded need no longer be alien to our affections or beyond the help of our communities.\"\n\nLasting Influence\n\nPresident Kennedy and his family forever changed public attitudes toward people with intellectual disabilities. Their influence on related policies and programs can still be seen today. In the twenty years following the Kennedy administration, Congress passed 116 acts or amendments providing support for people with intellectual disabilities and their families.\n\nEstablished in 1966 by President Johnson, the President's Committee for People with Intellectual Disabilities (formerly called the President's Committee on Mental Retardation) still exists today, providing advice to the president and to the secretary of Health and Human Services.\n\nEunice Shriver was a dynamic, unwavering advocate for people with intellectual disabilities her entire life. In 1968, she founded Special Olympics, an organization dedicated to celebrating and accepting people with intellectual disabilities as athletes. Today, more than 5 million children and adults in more than 170 countries participate in Special Olympics. Inspired by his mother's life-long commitment, Anthony Shriver co-founded Best Buddies, an organization that creates opportunities for people with intellectual and developmental disabilities.\n\nWatch this event with audio description."}, {"url": "https://www.ohchr.org/en/instruments-mechanisms/instruments/declaration-rights-disabled-persons", "page_content": "The General Assembly ,\n\nMindful of the pledge made by Member States, under the Charter of the United Nations to take joint and separate action in co-operation with the Organization to promote higher standards of living, full employment and conditions of economic and social progress and development,\n\nReaffirming its faith in human rights and fundamental freedoms and in the principles of peace, of the dignity and worth of the human person and of social justice proclaimed in the Charter,\n\nRecalling the principles of the Universal Declaration of Human Rights, the International Covenants on Human Rights, the Declaration of the Rights of the Child and the Declaration on the Rights of Mentally Retarded Persons, as well as the standards already set for social progress in the constitutions, conventions, recommendations and resolutions of the International Labour Organisation, the United Nations Educational, Scientific and Cultural Organization, the World Health Organization, the United Nations Children's Fund and other organizations concerned,\n\nRecalling also Economic and Social Council resolution 1921 (LVIII) of 6 May 1975 on the prevention of disability and the rehabilitation of disabled persons,\n\nEmphasizing that the Declaration on Social Progress and Development has proclaimed the necessity of protecting the rights and assuring the welfare and rehabilitation of the physically and mentally disadvantaged,\n\nBearing in mind the necessity of preventing physical and mental disabilities and of assisting disabled persons to develop their abilities in the most varied fields of activities and of promoting their integration as far as possible in normal life,\n\nAware that certain countries, at their present stage of development, can devote only limited efforts to this end,\n\nProclaims this Declaration on the Rights of Disabled Persons and calls for national and international action to ensure that it will be used as a common basis and frame of reference for the protection of these rights:"}, {"url": "https://www.encyclopedia.com/social-sciences/applied-and-social-sciences-magazines/presidents-physical-fitness-challenge", "page_content": "The President's Physical Fitness Challenge\n\nPamphlet\n\nBy: Anonymous\n\nDate: 2005\n\nSource: The President's Physical Fitness Challenge. \"10 Ideas to Get Active.\" <http://www.presidentschallenge.org/tools_to_help/ten_ideas.aspx> (accessed June 18, 2006).\n\nAbout the Author: This pamphlet was written by staff members of The President's Council on Physical Fitness and Sports (PCPFS), a committee of volunteer citizens who promote the importance of fitness to the public and advise the President through the Secretary of Health and Human Services about physical activity, fitness, and sports in America.\n\nINTRODUCTION\n\nThe first \"Council on Youth Fitness\" was created by President Dwight D. Eisenhower. The official start date was July 16, 1956—with the year 2006 being hailed as the Fiftieth Anniversary Year of the Council. Although Eisenhower was an advocate of healthy living and a proponent of physical fitness, it was when he read the unfavorable results of a study comparing American children with a group of European youth on a cadre of measures of physical fitness that he felt a strong need to create a national initiative. The initial goal was the promotion of a more active lifestyle and a higher degree of physical fitness among the children and youth of America. Later, the goal was broadened to suggest family fitness programs.\n\nIn 1960, under President John F. Kennedy, the name was changed to \"The President's Council on Physical Fitness.\" Kennedy was a firm believer in the pursuit of fitness goals for the entire age span, and wished to create more emphasis on family activities as well as adult- and elder-oriented fitness programs. It was his goal to create a fitter, more active country, and to engage every citizen of the United States to be involved in voluntary personal activity programs.\n\nPresident Lyndon Johnson decided to further push the idea that fitness can be fun and rewarding, and created the \"Presidential Physical Fitness Award,\" creating goals and incentives for youth to excel in school fitness programs. President Lyndon B. Johnson was a strong believer in the positive benefits of organized sports, and believed that they could be part of an active lifestyle no matter what age the individual. He changed the name of the President's Council to reflect that, calling it \"The President's Council on Physical Fitness and Sports.\"\n\nCongress designated the month of May as \"National Fitness and Sports Month\" beginning in 1983. The Surgeon General's Report on Physical Activity and Health\" was made public in 1996; the President's Council on Physical Fitness and Sports' treatise on \"Physical Activity and Sport in the Lives of Girls\" was published in 1997. It has become progressively more apparent that it is necessary to motivate the United States of America to get active, to get healthy, and to engage in voluntary physical fitness programs, from the youngest to the eldest citizens, in order to combat increasing trends of obesity and chronic diseases that afflict the masses.\n\nPRIMARY SOURCE\n\nTEN IDEAS TO GET ACTIVE\n\nAdults\n\nUse a push mower to mow the lawn Go for a walk in a nearby park Take the stairs instead of an elevator Bike to work, to run errands, or visit friends Clean out the garage or the attic Walk with a friend over the lunch hour Volunteer to become a coach or referee Sign up for a group exercise class Join a softball league Park at the farthest end of the lot\n\nKids\n\nTake your dog out for a walk Start up a playground kickball game Join a sports team Go to the park with a friend Help your parents with yardwork Play tag with kids in your neighborhood Ride your bike to school Walk to the store for your mom See how many jumping jacks you can do Race a friend to the end of the block\n\nSIGNIFICANCE\n\nIt has been several decades since John F. Kennedy published his article in Sports Illustrated, in which he said \"We do not want in the United States a nation of spectators. We want a nation of participants in the vigorous life. We are under-exercised as a nation; we look instead of play; we ride instead of walk… Physical fitness is the basis for all other forms of excellence.\"\n\nDuring that time, Americans have become, as a group, progressively less healthy. It is an overweight nation, and becoming more obese, at younger ages, with each passing year. Children are now developing lifestyle-related diseases, such as Type II Diabetes, high cholesterol, and the precursors for heart and liver dysfunction, the overwhelming majority of which were previously the province of aging and overweight adults.\n\nIn previous generations, most daily work involved significant physical labor, or at least quite a bit of exertion. In an effort to swing the societal pendulum back toward the middle, employers have begun to offer incentives to their workers to increase their daily activity levels by building on-site workout centers, by offering discounts at area fitness facilities, or by allowing time in each workday to leave the office and engage in some sort of exercise regimen. Health insurance providers have begun to recognize the importance of preventive care, and have begun offering discounts for gym memberships, weight loss centers, and smoking cessation programs. Still, the unhealthy lifestyle of the average American continues, and worsens.\n\nIn 2002, President George W. Bush sought to pique the interest of the American public by creating the President's Challenge Awards Program aimed at significantly raising public consciousness about the benefits of healthy and fit living. By creating the President's Challenge it was his hope that, ultimately, all of the people of the United States would choose to adopt some form of regular physical activity, and incorporate the concept of fitness into their daily lives. The Challenge is designed to be a strong motivator for improving activity and performance levels for individuals in all stages of life, at all activity levels, and at all possible levels of mobility.\n\nThe overarching goal of the The President's Council on Physical Fitness and Sports, as well as that of the President's Challenge, has always been the promotion of healthy and fit living for all Americans. It encourages the development of an active lifestyle based on voluntary regular physical fitness and activity programs, participation in sports, engagement in age-related and level of mobility appropriate group activity programs such as dance, water aerobics, wheelchair sports, community sports programs, master's swimming, and the like. Although the initial target for fitness programming was, and remains, children and youth, it stems from a belief that the creation of behavior patterns and activity preferences in childhood and early adolescence can set the stage for a lifetime of healthy choices and commitment to enduring physical fitness. By extension, healthy and fit children who become equally healthy and fit adults will transmit their values and beliefs to their children (and so on), leading to shared and promoted beliefs in the benefits of active, healthy living.\n\nFURTHER RESOURCES\n\nBooks\n\nAmerican College of Sports Medicine. Guidelines for ExerciseTesting and Prescription, 5th ed. Philadelphia: Lea & Febiger, 1995.\n\nArmstrong, L. and S. Jenkins. It's Not About the Bike: My Journey Back to Life. New York: Putnam, 2000.\n\nAron, C. S. Working at Play. New York: Oxford University Press, 1999.\n\nPeriodicals\n\nAbbott, R. D., B. L. Rodriguez, C. M. Burchfield, and J. D. Curb. \"Physical Activity in Older Middle-Aged Men and Reduced Risk of Stroke: The Honolulu Heart Program.\" American Journal of Epidemiology 139 (1994): 881–893.\n\nKennedy, John Fitzgerald. \"The Soft American.\" Sports Illustrated. 13, 26 (December 26, 1960): 15–17.\n\nWeb sites\n\nThe President's Challenge. \"You're It. Get Fit!\" 2006 <http://www.presidentschallenge.org> (accessed June 18, 2006)."}, {"url": "https://www.nps.gov/articles/000/the-kennedys-and-civil-rights.htm", "page_content": "President Lyndon B. Johnson hands Senator Robert F. Kennedy a pen from the signing of the Voting Rights Act. President's Room, U.S. Capitol, Washington, DC. August 6, 1965. LBJ Library photo by Yoichi Okamoto\n\nAfter the Kennedy Presidency\n\nShortly after being sworn in following President Kennedy’s assassination, President Lyndon B. Johnson urged the passage of the Civil Rights Act be carried out in honor of the late president.\n\nJohnson used his connections and experience gained as former Senate Majority Leader to sucessfuly negotiate support for the bill. On July 2, 1964, a little more than a year after President Kennedy introduced the bill, President Johnson officially signed the Civil Rights Act of 1964 into law. The act made discrimination in public facilities and federally funded programs illegal.\n\n\n\nRobert Kennedy left the Johnson Administration when he was elected as a U.S. Senator to New York. As a senator, he continued his support for the Voting Rights Act of 1965. He also continued to travel the country, expanding his views on race and poverty in America. In 1968, Kennedy made his own presidential bid. He quickly garnered overwhelming support from the Black community and other minorities who felt he would be their greatest advocate in the Oval Office.\n\n\n\nOn the evening of April 4, 1968, Martin Luther King Jr. was assassinated.\n\n\n\nKennedy was scheduled to deliver a campaign speech that night in Indianapolis, IN to a crowd of predominantly Black Americans. As he delivered the shocking news of King’s assassination, he empathized with his supporters and encouraged them to find peaceful and productive ways to channel their sorrow. The text and video of the speech are linked here.\n\n\n\nAs violence broke out across many American cities that evening, Indianapolis stayed peaceful. John Lewis would later say, “He {Kennedy} became the one man who could soothe the savage pain that swept through the city of Indianapolis, and there were no violent outbreaks there. I do remember calming my own sorrow in that dark hour by thinking, Dr. King is gone, but we still have Bobby.\"\n\n\n\nTwo months later, Robert Kennedy was assassinated.\n\n\n\nAlthough Senator Kennedy was assassinated in 1968, his legacy continues through the nonprofit, Robert F. Kennedy Human Rights. This nonprofit continues the work of Senator Kennedy, advocating for human rights and social justice. In 1995, President Clinton visited Indianapolis' Martin Luther King Jr. Park to dedicate the “Landmark for Peace” memorial commemorating the site where Robert Kennedy delivered his immortal words on the night of Dr. Martin Luther King Jr’s assassination. In 2018, the site was added to the African American Civil Rights Network."}, {"url": "https://www.accessibility.com/blog/a-brief-history-of-the-disability-rights-movement-in-america", "page_content": "One in four American adults lives with a disability. People with disabilities constitute the largest minority group in the United States.\n\nThe attitudes towards − and opportunities available to − people with disabilities have changed dramatically over the past century. People with disabilities and their allies have led the charge to end discrimination and fight for equal rights − we examine the Disability Rights movement.\n\nA long history of discrimination\n\nThe disability rights movement was spurred by a long history of discrimination against people with disabilities. They were often shut out of public life, denied educational and economic opportunities, and seen as less capable than people without disabilities.\n\nPeople with disabilities were viewed as objects of pity, requiring charity rather than civil rights and accommodations to live independently. Many people with psychiatric and developmental disabilities were institutionalized, and these institutions were often inhumane and neglectful.\n\nIn 1887, the journalist Nellie Bly went undercover in an asylum for the mentally ill, exposing abusive conditions and prompting reform. Nearly a century later, investigative reporter Geraldo Rivera’s 1973 exposé highlighted the horrendous conditions at Willowbrook State School, a New York State-funded institution for children with intellectual disabilities that operated from 1930 to 1983.\n\nAlong with other minority groups, people with disabilities were targeted by forced sterilization policies in the United States. Discrimination against people with disabilities is unfortunately not over, and the disability rights movement continues to advocate for equitable treatment and equal opportunities.\n\nEarly advocacy\n\nOrganizations for people with disabilities have existed since the 1800s. In the 1930s, the League of the Physically Handicapped was formed to advocate for access to employment during the Great Depression.\n\nIn the 1940s, a psychiatric patient group created We Are Not Alone, which supported patients transitioning from hospitals to living in their communities. President Harry S. Truman created the National Institute of Mental Health in 1948, and between 1960 and 1963, President John F. Kennedy organized committees on the research and treatment of disability.\n\nSeveral groups joined forces to create the National Association for Retarded Children (NARC) in the 1950s, which is now known as The Arc of the United States. Most of NARC’s members were parents of children with intellectual and developmental disabilities. They refused to accept that institutionalization was the only option, and devoted themselves to raising their children at home and providing them with an education.\n\nFrom pity to power\n\nThe passage of the Rehabilitation Act of 1973 was an important milestone in the history of the disability rights movement. The Act requires federally-funded programs, activities, and federal employment to be accessible to people with disabilities. Section 504 of the Rehabilitation Act specifically prohibits discrimination on the basis of disability in programs that receive federal financial assistance.\n\nFour years later, the regulations for Section 504 had not yet been implemented. When President Jimmy Carter took office in 1977, the disability rights community demanded that he sign and implement the regulations. The president’s new Health, Education, and Welfare (HEW) Secretary Joseph Califano responded by appointing a task force without a representative from the disability community to review the 504 regulations.\n\nThe American Coalition of Citizens with Disabilities (ACCD) demanded that the regulations be signed unchanged by April 5, or ACCD would take action. When that date came and went and the regulations remained unsigned, disability rights advocates across the nation protested by sitting in at federal HEW offices. Sit-ins had been used to great effect during the 1960s civil rights movement, and “demonstrated to the entire nation that disabled people could take control over our own lives and take leadership in the struggle for equality,” according to activist Judith Heumann.\n\nIn San Francisco, the protest lasted nearly a month and became the longest sit-in of a federal building in American history. The Section 504 protests worked, and the regulations were finally signed (unchanged) on April 28. According to activist Kitty Cone, the sit-ins were \"the public birth of the disability rights movement... For the first time, disability really was looked at as an issue of civil rights rather than an issue of charity and rehabilitation at best, pity at worst.\"\n\nSection 504 laid important groundwork for the Americans with Disabilities Act (ADA) of 1990 and the ADA Amendments Act (2008). Between the 1960s and the ADA, Congress passed more than 50 pieces of disability rights legislation, driven largely by the efforts of disability activists.\n\n“Nothing about us without us”\n\nSelf-advocates have played a crucial role in disability history. The independent living movement’s philosophy is that people with disabilities should have the same access to opportunities, rights, and autonomy over their lives as their non-disabled counterparts. It represents a shift from the medical model (in which disability is seen as a problem to be fixed) to the social model of disability (in which society’s failure to include and accommodate people with disabilities is the issue).\n\nEd Roberts is considered to be the father of the independent living movement. Severely disabled after contracting polio as a teenager, Roberts required the use of a respirator to breathe. When he was admitted to the University of California at Berkeley in 1962, the school arranged for him to live in Cowell Memorial Hospital.\n\nWith the help of College of San Mateo counselor Jean Wirth, Roberts demanded access to the university. Roberts led a group of students with physical disabilities known as The Rolling Quads, which pressured the university to become more accessible and to provide personal attendant services that would allow disabled students to live independently.\n\nThe 1978 Amendments to the Rehabilitation Act provided funding for consumer-controlled CILs. Today, there are nearly 400 CILs in the United States, which provide services to people with disabilities in their communities.\n\nCivil rights activist Reverend Wade Black is another important figure in the disability rights movement. He founded the independent living-based Atlantis Community in 1974, which provided community-based personal assistance services to people with disabilities. In 1978, Black and 19 members of the Atlantis Community took a public transit bus “hostage” in Denver to protest barriers to accessible transportation. They founded ADAPT (Americans Disabled for Accessible Public Transportation, later renamed Americans Disabled Attendant Programs Today in 1990, when the organization shifted its focus to ending the institutionalization of people with disabilities against their will).\n\nIn 1988, students at Gallaudet University led the week-long “Deaf President Now” protest. Gallaudet University is the only institution of higher learning specifically for deaf and hard-of-hearing students. The protestors called for a Deaf president and majority-Deaf Board of Trustees to represent their interests, and their demands were met: Dr. I. King Jordan was named Gallaudet's eighth president, the first Deaf person to hold the position.\n\nThe independent living movement and demands for representation encapsulate the ethos behind the disability rights slogan “nothing about us without us.”\n\nThe ADA\n\nLowell P. Weicker, a senator, and parent of a child with a disability is considered to be the “father” of the ADA. He sponsored several pieces of legislation that laid the groundwork for the act and introduced the first version of the ADA in 1988.\n\nOn March 12, 1990, protesters came to Washington D.C. to urge Congress to pass the ADA, which had been held up for several months. Transit companies had lobbied against accessibility requirements for passengers with disabilities, delaying the passage of the act.\n\nProtestors with disabilities participated in the “Capitol Crawl,” abandoning their mobility aids and crawling up the capitol’s 83 steps to symbolize the barriers to accessibility they faced. Gallaudet University professor Dr. Jordan said “We’re not asking for any favors… We’re simply asking [for] the same rights and equality any other American has.”\n\nImages of the “Capitol Crawl” spread across the nation. The news highlighted Jennifer Keelan, an eight-year-old girl living with cerebral palsy, who said “I’ll take all night if I have to” as she pulled herself up the steps by her arms.\n\nThe protestors’ efforts worked: President George H.W. Bush signed the ADA into law on July 26, 1990. At the signing ceremony, the president said “Let the shameful wall of exclusion finally come tumbling down.”\n\nLooking to the future\n\nThe ADA was passed over 30 years ago, and it remains the most comprehensive disability rights legislation in the nation’s history. The government has since enacted several pieces of legislation to encourage access to employment and education for people with disabilities.\n\nDespite significant gains, there is still much to accomplish. People with disabilities continue to face barriers to employment, education, transportation, accessibility, and equal participation in society. The disability rights movement’s efforts to create a more just society for all people is ongoing."}, {"url": "https://www.khanacademy.org/humanities/us-history/postwarera/civil-rights-movement/a/the-civil-rights-act-of-1964-and-the-voting-rights-act-of-1965", "page_content": "From the author: This is a pretty complex answer, but here goes: during and after the Civil War (1854-1877), the Republican Party had been the party of African American rights, so when African American men got the right to vote they voted Republican.\n\n\n\nThen, after 1877, the institution of Jim Crow laws in the South meant that few if any African Americans could vote at all. Democrats in the South were the party of white supremacy.\n\n\n\nAnother important point is that both parties, Republican and Democrat, used to have liberal and conservative wings. So the Democratic Party had a northern, more liberal wing that by the 1930s and the Great Depression came to embrace civil rights, while the southern wing of the party was still embracing white supremacy. Northern African Americans began to switch to the Democratic Party. Southern African Americans still couldn't vote.\n\n\n\nIn the 1960s, the Democratic Party at the national level aligned more with its liberal wing and began pushing through civil rights legislation (like the Civil Rights Act and Voting Rights Act). With those, African Americans had voting rights in the South finally, but white Democrats in the South who supported white supremacy were no longer happy with the Democratic Party. The Republican Party then moved to pick up those white voters, particularly in Richard Nixon's campaign of 1968.\n\n\n\nWith that group having moved from the Democratic Party to the Republican Party, the Democratic Party both north and south became associated with civil rights legislation, and African Americans in both those regions voted Democrat.\n\n1 comment Comment on Kim Kutz Elliott's post “This is a pretty complex ...” ( 33 votes ) Button opens signup modal Upvote\n\nButton opens signup modal Downvote\n\nButton opens signup modal Flag more"}, {"url": "https://www.centerforlearnerequity.org/news/black-history-month-recognizing-black-disability-rights-activists/", "page_content": "From the start, the disability rights movement has been inextricably interwoven with Black Americans’ fight for civil rights.\n\nThe Civil Rights Movement of the 1960s inspired many disability rights advocates, who used the model and tactics demonstrated by Black activists to pursue deinstitutionalization and legal rights.\n\nBlack disabled activists, as well as Black supporters without disabilities, provided instrumental support to the disability rights movement from the beginning—and strong alliances linked the two movements.\n\nSimilarly, disability rights activists used the legal precedents of the Civil Rights Act to enshrine the rights of people with disabilities. Brown v. Board of Education, which had determined that “separate but equal” schools were illegal, was a powerful tool for activists fighting for students with disabilities’ right to a quality public education delivered alongside their peers.\n\nTo this day, Black students and students with disabilities remain subject to disproportionate negative educational outcomes, including violent discipline, and Black students with disabilities face the impacts of both structural racism and ableism. We have a long way to go to ensure that Black students and students with disabilities receive equitable educational opportunities.\n\nBut even as that fight goes on, it is important to recognize the immense contributions that Black activists have made to the disability rights movement. This month, we’re highlighting their work.\n\nLois Curtis — Fighting for the Right to Live in the Community\n\nLois Curtis is a Black disability activist and artist best known for her role as a plaintiff in the Olmstead vs L.C. Supreme Court Case establishing the right of people with disabilities to live independently.\n\nRead More About Lois Curtis\n\nBrad Lomax—Uniting the Civil Rights and Disability Rights Movements\n\nBrad Lomax (1950–1984), a Civil Rights leader and disability rights activist, brought together the two movements to present a united front in the fight for equity—most notably during 1977’s 504 Sit-In.\n\nRead More About Brad Lomax\n\nFannie Lou Hamer—Paving the Way for the Civil Rights, Women’s Rights, and Disability Rights Movements\n\nFannie Lou Hamer (1917–1977), a civil rights activist with multiple disabilities, was a pivotal figure in the fight for Black enfranchisement, women’s rights, and civil rights.\n\nRead More About Fannie Lou Hamer\n\nJohnnie Lacy—An Advocate for Independent Living\n\nJohnnie Lacy (1937–2010) helped found the Berkeley Center for Independent Living and ran Hayward, California’s Community Resources for Independent Living (CRIL) for over a decade.\n\nRead More About Johnnie Lacy\n\nDonald Galloway—Fighting for Full Participation in Society\n\nDonald Galloway (1938–2011) was a fierce advocate for the rights of people with disabilities and for the inclusion of people of color in the disability rights movement.\n\nRead More About Donald Galloway"}]}