{"David Kappos is a member of the New York Bar.": [{"url": "https://www-dev2.law.columbia.edu/faculty/david-kappos", "page_content": "David J. Kappos is a partner at Cravath, Swaine & Moore LLP.\n\nHe is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues.\n\nFrom August 2009 to January 2013, Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). Prior to leading the USPTO, he held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s vice president and assistant general counsel for intellectual property. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. He joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nKappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI).\n\nKappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise, and the Intellectual Property Owners Educational Foundation.\n\nHe received his B.S. in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.pli.edu/faculty/david-j.-kappos-i607870", "page_content": "Biography\n\nDavid J. Kappos is a partner at Cravath. He is a leader in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters and was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the 2011 Leahy-Smith America Invents Act.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, including as Vice President and Assistant General Counsel for Intellectual Property from 2003 to 2009. In that capacity, he managed global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel.\n\nMr. Kappos has received numerous accolades for his contributions to the field of IP, including being named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in IP” by Managing IP, one of the “Top 50 IP Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “IP Professional of the Year” by the Intellectual Property Owners Association and being inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation. He is a member of the Advisory Board of ORoPO Foundation and Chair of the Advisory Council of the Naples Roundtable. Additionally, Mr. Kappos is the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an adjunct professor at Columbia Law School, where he teaches copyright litigation, and Cornell Law School, where he teaches legal advising for the start-up general counsel.\n\nMr. Kappos received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.iam-media.com/rankings/patent-1000/profile/person/david-j-kappos", "page_content": "When you need the best of the best for the highest-priority patent deals and disputes, Cravath is at the top of a very short list of firms. It is uniquely set up: its lawyers receive the highest quality generalist training but develop specialisation over time, granting them the pliability to deal with any issue, along with enhanced problem-solving and creative thinking skills and deep substantive knowledge of the relevant issues. Among them are several eminent trial lawyers, including Keith Hummel , Evan Chesler , David Marriott and Sharonmoyee Goswami : Hummel is ingenious, resourceful, resolute and unflagging – there is nothing he cannot do when it comes to complex legal conflict. So, too, Chesler, who is referred to in reverent tones as “godlike in litigation”. He continues to work closely with Marriott – they valiantly battled Apple on Qualcomm’s behalf – and is currently representing short-form streaming start-up Quibi and consumer technology holding company WndrCo alongside him in consolidated patent infringement and trade secret litigation against Israeli technology company JBF Interlude. Marriott has proven his mettle in many high-profile IP, antitrust and securities cases. Goswami is the rising star of the practice and comes in for special praise: “Sharon is extremely strategic and detail-oriented and knows how to position cases to maximise chances of success. She has a sense of self and purpose about her and is highly collaborative, with a unique ability to work seamlessly across multiple teams.” One of the top IP experts, not just at Cravath but in the world, corporate partner David Kappos anchors a leading transactions practice. He gets the biggest deals done before tea time but also devotes mental energy to crystal-ball gazing; he has an uncannily accurate sense of where things are heading – what the policy issues will be and where commercial opportunities will arise – making his behind-the-scenes strategic counsel utterly priceless.\n\nMr Kappos received a BS summa cum laude in electrical and computer engineering from the University of California, Davis in 1983 and a JD from the University of California, Berkeley in 1990.\n\nMr Kappos has received numerous accolades for his contributions to the field of intellectual property, including being named one of the Top 25 Icons of IP by Law360, one of the 50 Most Influential People in IP by Managing Intellectual Property, one of the Top 50 IP Trailblazers and Pioneers and one of the 100 Most Influential Lawyers in America by The National Law Journal and being inducted into the IP Hall of Fame by IAM in 2012.\n\nPrior to leading the USPTO, Mr Kappos served as IBM’s chief IP lawyer from 2003 to 2009. In that capacity, he managed all global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles such as litigation counsel and Asia-Pacific IP counsel, where he led all aspects of IP protection, including licensing and transactions support for the region.\n\nFrom 2009 to 2013, Mr Kappos served as undersecretary of commerce and director of the USPTO. In that role, he advised the president, the secretary of commerce and the administration on IP policy matters. Mr Kappos led the agency in dramatically re-engineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the US patent system in generations through the passage and implementation of the Leahy-Smith America Invents Act 2011.\n\nDavid J Kappos is a partner at Cravath, Swaine & Moore LLP. He is widely recognised as one of the world’s foremost leaders in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices, as well as commercialisation and enforcement of innovation-based assets.\n\nFirm Profile\n\nCravath has been known as one of the premier US law firms for over two centuries. Each of its practices is highly regarded and its lawyers are recognised around the world for their commitment to the representation of their clients’ interests.\n\nIntellectual property is one of Cravath’s core practice areas and a cornerstone of Cravath’s reputation as the firm of choice for clients with respect to their most challenging legal issues, most significant business transactions and most critical disputes. In the 19th century, the firm handled the telegraph patent litigation for Samuel Morse and mechanical reaper patent matters for Cyrus McCormick. Today, the firm’s expertise covers the entire innovation marketplace, spanning the consumer products, energy, healthcare, media and entertainment, pharmaceuticals, retail, technology and telecommunications industries, among others. Cravath also advises on matters in connection with emerging technologies, including artificial intelligence, blockchain and fintech, as well as data security and privacy issues.\n\nCravath’s strength in intellectual property stems in part from the firm’s unique culture. Cravath’s lawyers are trained as generalists and, over time, as partners, many focus on and deepen their expertise in specific areas. As a result, Cravath has a dedicated team of IP practitioners with an extensive understanding of patent and other issues, as well as experience in a broad range of trial and transactional work, which enables them to devise creative and commercially practicable solutions to complex problems. Cravath’s governance as a true partnership ensures that all clients receive the benefit of the firm’s overall knowledge, expertise and experience.\n\nCorporate IP practice\n\nCravath has a broad-based corporate IP practice representing clients ranging from early-stage start-ups to global companies in contexts across the full spectrum of IP disciplines, technologies and jurisdictions. Its lawyers work hand in glove with the firm’s premier M&A and financing teams to handle the many IP issues that arise in complex transactions, including issues relating to patents, trademarks, copyright, data, trade secrets, privacy and information security. In addition, Cravath provides strategic counselling, review and analysis in developing and managing IP portfolios, commercialising innovation-based assets and optimising IP rights to ensure its clients are maximising value from their intellectual property in the United States and in non-US markets.\n\nLitigation IP practice\n\nRepresenting both plaintiffs and defendants at the trial level, on appeal, in investigations or in an advisory capacity, Cravath’s litigators are adept at handling a wide variety of matters involving patents, trade secrets, copyright and trademarks, as well as the commercial litigation that frequently arises from IP matters, such as antitrust and breach of licence claims. Whatever the subject matter at issue, the firm’s litigators bring to each case a trial lawyer’s courtroom perspective and deep trial expertise in a variety of matters. As a result, clients turn to Cravath to protect them from infringement of their most important intellectual property or to defend valuable products against claims of infringement. Cravath has supervised and coordinated IP disputes that span the entire globe. The firm regularly advises on national and worldwide IP strategy and the identification of patents and other assets that can be used effectively for offensive or defensive purposes. Its practice also includes participation in inter partes review matters.\n\nInternational clients\n\nCravath regularly advises clients based outside the United States on a wide range of transactions, including cross-border mergers and acquisitions, international capital markets and bank financings, general corporate and Securities and Exchange Commission compliance matters. Its lawyers also handle US litigation, international arbitrations and investigations for non-US clients, and plan, coordinate and supervise multinational proceedings. The firm works closely with a network of leading law firms in major international markets, each of which has demonstrated a commitment to achieving the same high standards that clients expect from Cravath.\n\nCravath and its lawyers have been recognised as leaders in intellectual property by numerous industry publications, including Chambers USA, Chambers Global, The Legal 500 US, Benchmark Litigation, The Best Lawyers in America, Law360, Managing Intellectual Property, U.S. News-Best Lawyers’ Best Law Firms and IAM."}, {"url": "https://www.uspto.gov/about-us/david-j-kappos", "page_content": "2009-2013\n\nDavid J. Kappos was born in 1961 in Palos Verdes, California. He was educated at the University of California, Davis, where he earned a Bachelor of Science in electrical and computer engineering, and the University of California, Berkeley, where he earned a Doctorate of Jurisprudence.\n\nKappos spent more than 25 years at IBM. As counsel in the area of global intellectual property (IP) protection, he oversaw the protection of the firm’s IP in the Asia-Pacific region. Then, in 2003, he became IBM’s chief IP lawyer. Attaining the rank of Vice President and Assistant General Counsel, Intellectual Property Law, he managed IBM’s patent and trademark portfolios.\n\nIn 2009, President Barack Obama nominated Kappos for the position of Under Secretary of Commerce for Intellectual Property and Director of the USPTO. The Senate confirmed Kappos’s appointment on August 13, 2009. As Director, Kappos prioritized the strategic navigation of a severe recession, the implementation of the Leahy-Smith America Invents Act (AIA), and the reduction of pendency intervals (the amount of time between an applicant's submitting an application and receiving a decision).\n\nIn response to financial pressures resulting from the recession (2007-2009) and a decline in business activity for the agency, the USPTO froze hiring and scaled back programs where possible. The outlook brightened in 2011 when Congress passed the AIA, which Director Kappos helped to shape. He then set to work implementing the Act’s provisions, including the establishment of the Patent Trial and Appeal Board, and restarting expansions and initiatives that had been interrupted by the recession.\n\nMeanwhile, Director Kappos and the USPTO succeeded in reducing pendency by several months. The number of unexamined utility patent applications shrank, too, as the backlog fell from about 750,000 in 2009 to about 609,000 in 2013. In the same period, the Trademark organization exceeded its targets for action and final pendency. In pursuit of greater efficiency, Director Kappos pushed for the replacement of antiquated information technology, reengineering many of the systems and processes that kept patent and trademark applications moving.\n\nUnder Director Kappos’s leadership, new offices and institutions arrived that proved to be lasting. The USPTO gained a Chief Economist and its first permanent satellite location, the Elijah J. McCoy Midwest Regional Office in Detroit, Michigan.\n\nOther major milestones under Director Kappos’s leadership include the issuance of patent 8 million and the attainment of fifth place for employee satisfaction among the 300-plus federal agency and agency subcomponents surveyed by the Partnership for Public Service in 2012. The USPTO had risen steadily in these rankings from 172nd place in 2009, just before Kappos assumed office, to first place, shortly after his departure.\n\nFurther reading\n\nDavid J. Kappos. Cravath, Swaine & Moore LLP. Accessed June 15, 2021.\n\nUnited States Patent and Trademark Office FY 2009 Performance and Accountability Report. USPTO. November 2009.\n\nUnited States Patent and Trademark Office FY 2010 Performance and Accountability Report. USPTO. November 2010.\n\nUnited States Patent and Trademark Office FY 2011 Performance and Accountability Report. USPTO. November 2011.\n\nUnited States Patent and Trademark Office FY 2012 Performance and Accountability Report. USPTO. November 2012.\n\nUnited States Patent and Trademark Office FY 2013 Performance and Accountability Report. USPTO. November 2013.\n\nThe White House, Office of the Press Secretary. President Obama Announces More Key Administration Posts, 6-18-09. Press release. June 18, 2009."}, {"url": "https://www.wikiwand.com/en/David_J._Kappos", "page_content": "David \"Dave\" J. Kappos (born March 3, 1961) is an attorney and former government official who served as Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO) from 2009 to 2013. Kappos is currently a partner at New York law firm Cravath, Swaine & Moore.\n\nQuick facts: David J. Kappos, Under Secretary of Commerce ... ▼\n\nPrior to being confirmed to the post by the U.S. Senate on August 7, 2009,[2] Kappos was the vice president and assistant general counsel, intellectual property law, for IBM Corporation.[3] Kappos announced his intent to step down from the position in late January 2013.[4][5] His final day in office was February 1, 2013.[6] He was succeeded by Teresa Stanek Rea as Acting Under Secretary and Acting Director.[7]"}, {"url": "https://gemini.yesterweb.org/proxy/gemini.techrights.org/2021/09/07/david-kappos-bar-complaint/", "page_content": "● 09.07.21\n\nGemini version available ♊︎\n\n●● David Kappos (IBM/Microsoft Lobbyist) Reported for Misuse of Authority and Conflict of Interest\n\nPosted in America, GNU/Linux, IBM, Microsoft, Patents at 9:50 am by Dr. Roy Schestowitz\n\nOld monopolies and current monopolies want more than just patent monopolies\n\nImage: IBM and Nazi flag\n\nImage sourced from “The Hidden Nazi History of IBM and how they chose profit over morality“\n\nSummary: For a number of decades the USPTO has been discriminating against GNU/Linux users and for a number of years it has been pushing “Microsoft tax” (applicants must pay more if they don’t use Microsoft’s proprietary formats); some people challenge this culture of vendor capture inside the USPTO\n\nLAST month we wrote about issues associated with past staff of the U.S. Patent and Trademark Office (USPTO) which now works in the lobbying sector, in effect trying to shape the law for large clients like IBM and Microsoft. Among the objectives: extinguishing 35 U.S.C. § 101 and bringing back software patents. Last year we showed that an IBM lobbyist (paid millions by IBM) “Used COVID-19 Lies to Push for Software Patents From the Back Door, Undermining What Courts Have Determined” (even the highest court); not even the EPO had gone that far in promotion of software patents.\n\nissues\n\n↺ USPTO\n\nshowed\n\n↺ IBM\n\n↺ highest court\n\n↺ EPO\n\n↺ software patents\n\n“We have many readers who use GNU/Linux, but we’re not sure how many of them interact with patent offices.”Earlier this year we mentioned how those same people misused the USPTO to reinforce Microsoft’s monopoly. One of our readers has had enough and is taking action [PDF]. Bar complaint against Kappos was submitted the other day. “I filed a bar complaint against Kappos in California,” a reader told us, where he’s a member of the bar. I’ll file complaints in New York and Washington, DC, too – where he is also a member – but it seems to be a little more difficult than in California.”\n\n↺ taking action\n\n↺ Kappos\n\n“I will be very surprised if anything is done about my complaint. But, if they go so far as to contact Kappos about the complaint, it will have been worth it.\n\n“The issue I attacked him on is the “Electronic Filing Incentive.” You can read about it in the attached pdf.\n\n“I live in rural West Virginia, so I have only been on the internet for 7-8 years, and, before that, I filed my applications through the post. No problem, until Kappos came along, and tried to force everybody to buy Microsoft and Lenovo.\n\n“At first, I used Windows – like everybody – but I bought Windows 8, which was junk, and I discovered Linux, which I’ve been using for probably about 7 years.\n\n“Most of the people at the USPTO are lawyers, it seems, and they are creating “barriers” – as described in my pdf – against Linux users.\n\n“Maybe somebody could file bar complaints against lawyers in the USPTO because of the barrier against Linux, using the complaint in my pdf as a guide. It would require some research to identify the lawyers, and then find out where their bar membership is: which state(s), and maybe Washington, DC.\n\n“I can’t do it. I use Linux, but don’t really have the technical knowledge to make a strong complaint. Maybe you know somebody who could do it.”\n\nWe have many readers who use GNU/Linux, but we’re not sure how many of them interact with patent offices. Nevertheless, any action against behaviour such as this can only potentially improve things. We need to make ourselves noticeable/heard. Otherwise, systematic discrimination will carry on, reinforced by people whose top clients are proprietary software giants that pursue loads of software patents. █\n\nsuch as this\n\nShare in other sites/networks: These icons link to social bookmarking sites where readers can share and discover new web pages.\n\nPermalink > Image: Mail\n\nSend this to a friend\n\nPermalink\n\n↺ Send this to a friend\n\n----------\n\nTechrights\n\n➮ Sharing is caring. Content is available under CC-BY-SA."}, {"url": "https://www.fedsoc.org/contributors/david-kappos", "page_content": "David J. Kappos is a partner at Cravath. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets. Mr. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues, including those pertaining to blockchain and financial technology (FinTech).\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically re-engineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy‑Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an Adjunct Professor at Columbia Law School, where he teaches copyright litigation, and Cornell Law School, where he teaches legal advising for the start-up general counsel.\n\nMr. Kappos was born in Palos Verdes, California. He received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.prweb.com/releases/kappos/uspto/prweb3713564.htm", "page_content": "David Kappos, Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO), will give a talk titled “Vision for the USPTO in the 21st Century: Ensuring America’s Innovation Future,” on Friday, March 26 at 1 p.m. at New York Law School, located at 185 West Broadway. The event is presented by the Law School’s Center for Patent Innovations (CPI) and the Institute for Information Law & Policy.\n\n“Anyone who knows Dave Kappos well knows that the USPTO is in great hands as the organization rises to meet the challenges of the 21st century,” Mark Webbink, Executive Director of CPI, said. “We are pleased to welcome the New York legal community and, especially, the New York patent bar to New York Law School to hear from one of the most dynamic leaders to ever head the USPTO.”\n\nKappos was appointed Director of the USPTO during the summer of 2009. In this position, he serves as main advisor to President Obama, secretary of commerce, and the entire administration on all issues pertaining to intellectual property and manages the office, responsible for granting U.S. patents and registering trademarks. He brings to the office more than 20 years of experience as a patent professional, formerly serving as Vice President and Assistant General Counsel for Intellectual Property at IBM. Kappos has also served on the board of directors for various intellectual property law associations in Asia, Europe, and the U.S. and has lectured extensively on intellectual property.\n\nIn his talk at the Law School, he will discuss the future of the patent office, as well as the issues it currently faces, including patent quality, long waiting times for patent examination, and a 770,000 patent application backlog.\n\n“In order to assist the businesses, innovators, and inventors that create American jobs, the USPTO must be a model in the world for IP administration and protection,” Kappos said. “We must lead in application pendency, examination quality, as well as protection of IP rights globally. To cut long wait times, and reduce the backlog, the USPTO is working diligently to increase examination capacity and gain process efficiencies. To ensure the highest quality patents the USPTO is reengineering its quality management program from top to bottom.”\n\nThis event is free and open to the public. Please register with Naomi Allen at Naomi.Allen@nyls.edu or 212.431.2368.\n\nAbout the Center for Patent Innovations\n\nNew York Law School formed the Center for Patent Innovations in June 2008 as a part of the Institute for Information Law & Policy. The Center is focused on bringing real-world technology solutions to improve government operations, particularly in the area of patent law. The Center for Patent Innovations will continue to pursue innovations in patent law and has launched a number of projects related to Peer to Patent, such as the Post-Issue Peer to Patent http://www.post-issue.org, which extends the community-based approach of finding prior art relevant to re-examination of patents that have already been granted.\n\nAbout New York Law School\n\nFounded in 1891, New York Law School is an independent law school located in lower Manhattan near the city’s centers of law, government, and finance. New York Law School’s renowned faculty of prolific scholars has built the School’s strength in such areas as constitutional law, civil and human rights, labor and employment law, media and information law, urban legal studies, international and comparative law, and a number of interdisciplinary fields. The School is noted for its nine academic centers: Center on Business Law & Policy, Center on Financial Services Law, Center for International Law, Center for New York City Law, Center for Professional Values and Practice, Center for Real Estate Studies, Diane Abbey Law Center for Children and Families, Institute for Information Law & Policy, and Justice Action Center. New York Law School has more than 13,000 graduates and enrolls some 1,500 students in its full- and part-time J.D. program and its four advanced degree programs in financial services law, real estate, tax, and mental disability law studies. http://www.nyls.edu\n\n# # #"}, {"url": "https://apps.calbar.ca.gov/attorney/Licensee/Detail/150148", "page_content": "You are leaving the State Bar of California website and are being directed to an external web address provided to the State Bar by a California-licensed attorney. The State Bar relies on attorneys to maintain accurate and updated website listings and makes no warranties or other representations regarding the accuracy, content, or policies of external websites or for those of subsequent links.\n\nYou will be redirected after seconds.\n\nTo access the site, click Go Now or disable your browser’s popup blocker."}, {"url": "https://ficpi.org/ficpi-news/david-j-kappos-confirmed-speaker-us-dinner-30th-october", "page_content": "Exciting news ahead of FICPI’s first in-person meeting for nearly two years – a dinner for US members and IP professionals on October 30th, on the evening of the close of the AIPLA conference in DC.\n\n\n\nThe guest speaker will be David J. Kappos, a partner at New York law firm Cravath, Swaine & Moore, who will share his insights on the state of subject matter eligibility and 101 reform.\n\n\n\nMr. Kappos was the Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO) from 2009 to 2013. Prior to being confirmed to the post by the U.S. Senate on August 7, 2009, David Kappos was the vice president and assistant general counsel, intellectual property law, for IBM Corporation.\n\nThe dinner is open to both FICPI members and non-members.\n\nIt begins at 6pm, at Landini Brothers Restaurant, 115 King Street, Alexandria, VA."}]}