{"David Kappos began his career in intellectual property law in 1983 at the law firm of Cravath, Swaine & Moore in New York City.": [{"url": "https://ipwatchdog.com/people/david-kappos/", "page_content": "David Kappos is a Co-Chair of Cravath‘s Intellectual Property Practice. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters. Mr. Kappos led the Agency in dramatically reengineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy-Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel, where he led all aspects of IP protection, including licensing, transactions support and M&A activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was also honored as the inaugural recipient of IPWatchdog’s Paul Michel Award in 2021. Mr. Kappos was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Global Leaders, IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, LMG Life Sciences, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation and on the Advisory Board for C-IP2. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an Adjunct Professor at Cornell Law School, where he teaches legal advising for the start-up general counsel."}, {"url": "https://patentlyo.com/patent/2009/07/statement-of-david-j-kappos-nominee-for-under-secretary-of-commerce-for-intellectual-property.html", "page_content": "Statement of David J. Kappos\n\nNominee for Under Secretary of Commerce for Intellectual Property\n\nand Director of the United States Patent and Trademark Office\n\nNomination Hearing before the Senate Judiciary Committee\n\nJuly 29,2009\n\nChairman Leahy, Ranking Member Sessions and distinguished members of the Senate Judiciary Committee, thank you for the opportunity to appear before you today. I am grateful to President Obama and to Secretary Locke for the trust they have placed in me and to you for considering my nomination to serve as Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office.\n\n… It is exceptional and humbling under any circumstance to have the chance to serve one's country. But it is particularly so for me as the son and grandson of immigrants – my father came to this country from Greece and my mother's parents came to the US from Italy. So, the opportunity to be here today is particularly poignant for me, as it is for my family.\n\nIf recommended by this Committee and confirmed by the Senate, I look forward to joining Secretary Locke and his team at Commerce in their mission as stewards of American economic growth, job creation and innovation.\n\nI have spent nearly my entire professional career in the field of intellectual property law, and indeed my entire career around technology and innovation. After receiving my education from the University of California system, first in electrical and computer engineering and subsequently in law, I went to work for IBM as an intellectual property law attorney.\n\nDuring my career at IBM, I have held intellectual property law positions in nearly all of its business units. I have written and prosecuted patent applications in many technical areas and I have searched the prior art files of the USPTO alongside other patent professionals, including examiners themselves. I have handled many trademark matters in the US and globally. I managed IBM's IP law interests across the Asia-Pacific region, and lived in Japan during that period. Currently and for the past six years, I have served as Vice President and Assistant General Counsel for intellectual property law at IBM's corporate headquarters. In that role, I am responsible for the management of intellectual property interests – patents, trademarks, trade secrets and copyrights – on a worldwide basis. Additionally, I have served in leadership positions in the major professional associations that represent the intellectual property law community in this country and globally, including the Intellectual Property Owners Association and the American Intellectual Property Law Association.\n\nI care passionately about this field and the role intellectual property plays in advancing American innovation. So, it is particularly exciting for me to be considered for the position of Director of the USPTO, an organization that traces its roots to the founding fathers and their understanding that promoting and rewarding innovation is critical to our country's success.\n\nThe PTO faces many challenges. Most immediate are those resulting from the current economic downturn, the need for a stable and sustainable funding model, the need to address pendency concerns while preserving and enhancing patent quality, and the imperative to attract and retain skilled personnel at a time of fiscal constraint. Secretary Locke has personally asked me to make it my number one priority to refashion the patent examination process to meet these challenges. In carrying forward this direction, I will focus substantial personal attention within the USPTO. Additional challenges flow from a rapidly globalizing trade environment , impacting trademark and patent interests, as well as respect for intellectual property and the consequences where IP is not respected.\n\nLonger term, the USPTO must keep abreast of the astounding pace of technological change across a broad range of scientific disciplines. It needs to understand new modes of innovation and their effect on its mission. And it will need to constantly rethink how to maintain and enhance the constitutional imperative to promote innovation and scientific advancement for the public good – both in terms of the technology confronting the Office and in terms of leveraging and applying the law to that technology.\n\nI welcome this challenge and pledge to you all of my energy, creativity and intellect should I be confirmed. As I consider this challenge, I am mindful of several things.\n\nI am mindful that the USPTO serves the interests of ALL innovators in this country, small and large, corporate and independent, academic and applied, and – most importantly — the public interest. While I have spent my career to date at a large corporate enterprise, I am familiar with the concerns and issues of all USPTO constituents – including small and independent inventors, the venture and start-up community, public interest groups, the patent bar and many others – and will reach out to all of them.\n\nI am mindful of the incredible dedication of the thousands of USPTO employees, and the essential role they play to the success of the US innovation system. I will work every day with the USPTO employees and the unions that represent them to establish strong, positive relationships grounded in professional treatment for these workers producing work product based on professional judgment.\n\nI am acutely mindful that innovation today is global and that IP policy is of paramount importance, not only in our country, but also in the EU and Japan, in China, India, Brazil and many other developing countries. I will use my international experience and my understanding of global IP trends to help this Administration represent, advance, and protect the interests of American innovators in the global arena and to lead the world in developing strong, balanced, inclusive intellectual property systems that advance the well-being of all participants.\n\nFinally, I am mindful that the office for which I am being considered, working as part of Secretary Locke's team and within the Administration's agenda, must be intensely focused on how to serve the American people at this time of economic uncertainty. I believe the USPTO can play a significant role in enhancing economic growth, creating jobs and advancing American innovation. I hope to play a part in this important mission.\n\nAgain, I am grateful for the opportunity to address you today. I am honored by the opportunity to serve and I look forward to joining this Administration and Secretary Locke's team should I be confirmed.\n\nI am pleased to answer any questions.\n\nDavid J. Kappos"}, {"url": "https://citp.princeton.edu/event/patent-success-or-failure-the-america-invents-act-and-beyond/", "page_content": "Much of the criticism of our patent system can be traced to the feeling that the system does not work equally for all stakeholders, and the AIA is no exception to this. This session will offer a comparative look at the AIA across industries, such as software and biotechnology.\n\nThe AIA has the potential to alter the patent landscape significantly. Given the lengthy timeline for fully implementing the AIA, it may be years before we feel the full effects of the legislation. This session will examine the ways in which the AIA has already changed patent law, and look forward to the future effects of the legislation.\n\nThe AIA sets out a protracted timeline for implementing its many provisions, with the last of these provisions taking effect September 16, 2019. This session will focus on major questions of implementation.\n\nAttorneys: This transitional CLE program has been approved in accordance with the requirements of the New York Continuing Legal Education Board for a maximum of five hours professional practice credit. This program has been approved by the Board on Continuing Legal Education of the Supreme Court of New Jersey for 5.4 hours total CLE credit. Those seeking CLE credit should review the written materials .\n\nOn September 16, 2011, President Obama signed the Leahy-Smith America Invents Act (AIA), the most significant change to the US Patent system since the Patent Act of 1952. The result of years of efforts to revise and reform the laws governing patent practice in the US, many consider the AIA to be a success. However, the AIA is not without its critics. “Patent Success or Failure?” will bring together government officials, judges, lawyers, and academics to consider the effects of the AIA on the patent landscape.\n\nRegistration has exceeded our expectations and capacity. We are unfortunately unable to accept any more registrations at this time. If you have not already registered for the conference, you will not be permitted to enter.\n\n\n\nColleen Chien Professor Colleen Chien is nationally known for her research and publications surrounding domestic and international patent law and policy issues. Her work has been cited by the FTC and in Congress. She has testified before the DOJ/FTC/PTO on patent issues, frequently lectures at national law conferences and has published several in-depth empirical studies, including of patent litigation, patent amicus briefs, non-practicing entities (NPE), and the secondary market for patents. She is an expert on the International Trade Commission (ITC), a topic on which she has authored several articles and co-authors a practice guide, The Section 337 Patent Investigation Management Guide. Prior to joining the Santa Clara University School of Law faculty in 2007, Professor Chien prosecuted patents at Fenwick & West LLP in San Francisco, as an associate and then Special Counsel. She also served as an advisor to the School of Social Medicine at Harvard Medical School, worked as a spacecraft engineer at NASA/Jet Propulsion Lab, and was an investigative journalist at the Philippine Center for Investigative Journalism as a Fulbright Scholar. She lives in the east bay with her husband and their two sons.\n\n\n\nDennis Crouch Professor Crouch is Associate Professor of Law at the University of Missouri School of Law. Prior to joining the MU Law Faculty, he was a patent attorney at McDonnell Boehnen Hulbert & Berghoff LLP in Chicago, Illinois, and taught at Boston University Law School. He has worked on cases involving various technologies including computer memory and hardware, circuit design, software, networking, mobile and internet telephony, automotive technologies, lens design, bearings, HVAC systems, and business methods. He is also the editor of the popular patent law weblog: Patently-O.\n\n\n\nSteven Halpern Mr. Halpern maintains a intellectual property practice with an emphasis on the procurement, management, and enforcement of domestic and international intellectual property rights. His practice focuses on patent prosecution and portfolio management, IP-related agreements, due diligence, and opinions of counsel concerning freedom-to-operate assessments, invalidity, and infringement. He has substantial experience in computer and data communications, software, physics, medical devices, automation systems, radar systems, heating, drive controls, electromechanics, and other technologies.\n\n\n\nAndrea Kamage Andrea Kamage is Senior Patent Counsel for Johnson & Johnson, where she supports the pharmaceutical businesses of J&J for both small molecule and biologic therapeutics. She spend many years in private practice supporting the intellectual property needs of pharmaceutical, biological, chemical and medical device entities, from small startups to universities to large multinational corporations. Her current practice includes a wide range of intellectual property areas such as patent prosecution, due diligence, transactions, and patent litigation support. She recently served as President of the New Jersey Intellectual Property Association; and currently is a member of the Intellectual Property Editorial Advisory Board for Law360 and the Chair of the Pharmaceutical & Biotechnology Issues Committee for The Intellectual Property Owners Association.\n\n\n\nDavid Kappos David Kappos is the Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office. In this role, he advises the President, the Secretary of Commerce, and the Administration on intellectual property matters. Over a 20-year career in intellectual property, Mr. Kappos has accrued deep knowledge of the intellectual property system and broad respect from professionals across the field. Mr. Kappos directs an office that provides incentives to encourage technological advancement and helps businesses protect their investments, promote their goods and services and safeguard against deception in the marketplace. The Office continues to deal with a patent application backlog of more than 700,000, long waiting periods for patent review, information technology systems that are regarded as outdated and an application process in need of reform. Before joining the USPTO, Mr. Kappos served as Vice President and Assistant General Counsel for Intellectual Property at IBM. Mr. Kappos managed IBM’s patent and trademark portfolios – protecting and licensing intellectual property worldwide. He has served on the Board of Directors of the American Intellectual Property Law Association, the Intellectual Property Owners Association, and the International Intellectual Property Society. He has held various other leadership positions in intellectual property law associations in Asia and the U.S. and has spoken widely in Asia, Europe and the U.S. on intellectual property topics. Mr. Kappos received his Bachelor of Science degree in electrical and computer engineering from the University of California-Davis in 1983, and his law degree from the University of California Berkeley in 1990.\n\n\n\nJoe Matal Joe Matal has been a Judiciary Committee counsel to Senator Jon Kyl since 2002, except that he served as the Republican General Counsel of the Committee while Senator Jeff Sessions was the ranking member from 2009 through 2010. He was one of the principal legislative staff involved in the drafting and floor management of the American Invents Act, and recently published the first part of two-part law-review article about the legislative history of the Act. Joe has also worked as an associate attorney at Gibson, Dunn & Crutcher, as a law clerk to a judge on the U.S. Court of Appeals for the Ninth Circuit, and is a 1996 graduate of Boalt Hall School of Law.\n\n\n\nChief Judge Paul R. Michel (Retired) Paul R. Michel was appointed to the United States Court of Appeals for the Federal Circuit in March of 1988. On December 25, 2004, he assumed the duties of Chief Judge. After his elevation to Chief Judge, he served as one of 27 judges on the Judicial Conference of the United States, the governing body of the Judicial Branch. In 2005 he was appointed by Chief Justice Rehnquist to also serve on the Judicial Conference’s seven-judge Executive Committee. On May 31, 2010, Chief Judge Michel stepped down from the bench after serving more than 22 years on the court. In his years on the bench Judge Michel judged thousands of appeals and wrote over 800 opinions, approximately one-third of which were in patent cases. Prior to his appointment to the bench, Judge Michel served in the executive and legislative branches for 22 years. Following graduation from Williams College in 1963 and the University of Virginia Law School in 1966, Michel served as Assistant District Attorney and then Deputy District Attorney for Investigations under Arlen Specter in Philadelphia; as Assistant Special Watergate Prosecutor in 1974-1975; from 1975 to 1976 he was an assistant counsel for the Senate Select Committee on Intelligence; from 1976-1978, he served as Deputy Chief of the Justice Department’s Public Integrity Section, where he directed the “Koreagate” investigation; in 1978 he was appointed as an Associate Deputy Attorney General; in 1980 he served as Acting Deputy Attorney General; and from 1981 until 1988, he served on Senator Arlen Specter’s staff, including as Counsel and Chief of Staff. Judge Michel has been named one of the 50 Most Influential People in the world in intellectual property by Managing Intellectual Property magazine. In 2008 Chief Judge Michel was awarded the first annual Lifetime Achievement Award by the Richard Linn American Inn of Court; the Sedona Conference Lifetime Achievement Award; the first “Outstanding Achievement in the Area of Intellectual Property Law” award given by the Philadelphia Intellectual Property Law Association; and the annual Judicial Honoree Award by the Bar Association of the District of Columbia. In 2010 he received the U.S. Patent and Trademark Offices’ Federico Award for “outstanding contribution to the Patent and Trademark Systems of the United States of America”; the North American Lifetime Achievement Award by Managing Intellectual Property Magazine; the Distinguished Intellectual Property Professional Award from the Intellectual Property Owners Education Foundation; the career achievement award of the American Intellectual Property Law Association (AIPLA); and was one of five global figures inducted into Intellectual Asset Management magazine’s Intellectual Property Hall of Fame. He has been a Member of Honor of FICPI since 2001. Since retiring from the court, Judge Michel continues to share knowledge gained during his 22 years on the court by speaking out on issues related to the courts and the patent system. He also provides mediation, arbitration, and case evaluation services to private clients. Judge Michel is also serving as an advisor to a number of organizations. In June 2010, Judge Michel was elected a member of the Board of Directors of the Intellectual Property Owners (IPO) Education Foundation and became a Distinguished Scholar in Residence there. He also serves as Special Advisor to the Patent Reform Task Force and the Council of the Section on Intellectual Property of the American Bar Association, and is a member of the AIPLA Committee on Public Appointments. Most recently he was invited to join the Advisory Committee of the World Intellectual Property Organization’s Networked Innovation project and the Advisory Committee of the Manufacturing Initiative of the U.S. Council on Competitiveness.\n\nSuzanne Michel Suzanne Michel is Senior Patent Counsel at Google where she focuses on patent policy issues. Before joining Google in 2011, she was Deputy Director in the Office of Policy Planning at the Federal Trade Commission where she worked on patent policy and IP/antitrust issues. At the FTC, she headed the project on the “Evolving IP Marketplace,” including the drafting of the Commission report, released in March 2011. The FTC awarded her the Paul Rand Dixon award and the Excellence in Supervision award. Before joining the FTC in 2000, Suzanne worked at the U.S. Department of Justice as a patent litigator. Suzanne received her B.S. with honors from Northwestern University and her Ph.D. in Chemistry from Yale University. She graduated from Boalt Hall School of Law at Berkeley, where she was a member of the Order of the Coif and received the prize for best paper published by a graduating student. Following law school, she served as a law clerk to the Honorable Paul R. Michel (no relation) at the Court of Appeals for the Federal Circuit. She is a registered patent attorney.\n\n\n\nMark Nikolsky Mr. Nikolsky is a registered patent attorney in the Intellectual Property/Information Technology law practice group of McCarter & English. His practice focuses on the procurement, licensing, and enforcement of Intellectual Property rights, including patents, trademarks, copyrights and trade secrets. A substantial portion of Mr. Nikolsky’s practice is devoted to representing clients before the U.S. Patent and Trademark Office to acquire patents covering technologies in the electrical, mechanical, and software arts, including computer software and hardware, digital and analog systems, optoelectronics, semiconductor fabrication processes, business methods, plasma physics devices, telecommunications, distributed computing systems, and other types of technologies. Additionally, Mr. Nikolsky conducts PCT and foreign international filings on inventions, and interacts with clients on a nearly daily basis to draft and refine patent applications and advise on prosecution strategies. Mr. Nikolsky frequently prepares Intellectual Property opinions including patent validity, patent infringement, patent novelty, and trademark search opinions. He participates in litigation proceedings involving Intellectual Property matters including patent, trademark, and copyright infringement. Additionally, Mr. Nikolsky has experience with patent reexamination, trademark opposition, and trademark cancellation proceedings, as well as negotiating and drafting business-related agreements including technology licensing, confidentiality, and non-disclosure agreements. Mr. Nikolsky has a technical background in Computer Science, and is active in industry associations including the Association for Computing Machinery (ACM) and the Institute for Electrical and Electronics Engineers (IEEE). He also gives presentations to small business and educational entities regarding Intellectual Property protection.\n\n\n\nChief Judge Randall Radar Randall R. Rader was appointed to the United States Court of Appeals for the Federal Circuit by President George H. W. Bush in 1990 and assumed the duties of Chief Circuit Judge on June 1, 2010. He was appointed to the United States Claims Court (now the U. S. Court of Federal Claims) by President Ronald W. Reagan in 1988. Chief Judge Rader’s most prized title may well be “Professor Rader.” As Professor, Chief Judge Rader has taught courses on patent law and other advanced intellectual property courses at George Washington University Law School, University of Virginia School of Law, Georgetown University Law Center, the Munich Intellectual Property Law Center, and other university programs in Tokyo, Taipei, New Delhi, and Beijing. Due to the size and diversity of his classes, Chief Judge Rader may have taught patent law to more students than anyone else. Chief Judge Rader has also co-authored several texts including the most widely used textbook on U. S. patent law, “Cases and Materials on Patent Law,” (St. Paul, Minn.: Thomson/West 3d ed. 2009) and “Patent Law in a Nutshell,” (St. Paul, Minn.: Thomson/West 2007) (translated into Chinese and Japanese). Chief Judge Rader has won acclaim for leading dozens of government and educational delegations to every continent (except Antarctica), teaching rule of law and intellectual property law principles. Chief Judge Rader has received many awards, including the Sedona Lifetime Achievement Award for Intellectual Property Law, 2009; Distinguished Teaching Awards from George Washington University Law School, 2003 and 2008 (by election of the students); the Jefferson Medal from the New Jersey Intellectual Property Law Association, 2003; the Distinguished Service Award from the Berkeley Center for Law and Technology, 2003; the J. William Fulbright Award for Distinguished Public Service from George Washington University Law School, 2000; and the Younger Federal Lawyer Award from the Federal Bar Association, 1983. Before appointment to the Court of Federal Claims, Chief Judge Rader served as Minority and Majority Chief Counsel to Subcommittees of the U.S. Senate Committee on the Judiciary. From 1975 to 1980, he served as Counsel in the House of Representatives for representatives serving on the Interior, Appropriations, and Ways and Means Committees. He received a B.A. in English from Brigham Young University in 1974 and a J.D. from George Washington University Law School in 1978.\n\n\n\nArti Rai Arti Rai, Elvin R. Latty Professor of Law at Duke Law School and member, Duke Institute for Genome Science and Policy, is an authority in patent law, administrative law, and innovation policy. Rai has also taught at Harvard, Yale, the University of Pennsylvania, and the University of San Diego law schools. From 2009-2010, Rai took a leave of absence from Duke Law School to serve as the Administrator of the Office of External Affairs at the U.S. Patent and Trademark Office. Rai’s academic research on innovation policy in areas such as synthetic biology, green technology, drug development, and software has been funded by NIH, the Kauffman Foundation, and Chatham House.\n\n\n\nDaniel B. Ravicher Daniel B. Ravicher is Executive Director of the Public Patent Foundation (“PUBPAT”) and a Lecturer in Law at Benjamin N. Cardozo School of Law. Labeled a modern day ‘Robin Hood’ by Science magazine, and awarded an Echoing Green Fellowship for social entrepreneurship, Professor Ravicher is a registered patent attorney who writes and speaks frequently on patent law and policy, including twice testifying as an invited witness before Congress on the topic of patent reform. As a result of his accomplishments and professional reputation, Professor Ravicher was named to both Managing Intellectual Property magazine’s ’50 Most Influential People in IP’ list and IP Law & Business magazine’s ‘Top 50 Under 45’ list. Professor Ravicher received his law degree from the University of Virginia School of Law, where he was the Franklin O’Blechman Scholar of his class, a Mortimer Caplin Public Service Award recipient and an Editor of the Virginia Journal of Law and Technology, and his bachelors degree in materials science magna cum laude with University Honors from the University of South Florida. Professor Ravicher writes about patent policy issues for the Huffington Post and patent related corporate valuation issues for Seeking Alpha. He is admitted to the United States Supreme Court, the Courts of Appeals for the Federal, 2nd and 11th Circuits, the District Courts for the Southern and Eastern Districts of New York, the State of New York, and the United States Patent and Trademark Office.\n\n\n\nJulie Samuels Julie Samuels is a Staff Attorney at EFF, where she focuses on intellectual property issues. Before joining EFF, Julie litigated IP and entertainment cases in Chicago at Loeb & Loeb and Sonnenschein Nath & Rosenthal. Prior to becoming a lawyer, Julie spent time as a legislative assistant at the Media Coalition in New York and as an assistant editor at the National Journal Group in D.C. She was also an intern at the National Center for Supercomputing Applications. Julie earned her JD from Vanderbilt University and her B.S. in journalism from the University of Illinois at Urbana-Champaign.\n\n\n\nJason M. Schultz Jason M. Schultz is an Assistant Clinical Professor of Law and Director of the Samuelson Law, Technology & Public Policy Clinic at the UC Berkeley School of Law (Boalt Hall). Before joining Boalt Hall as a faculty member in the Samuelson Clinic, he was a Senior Staff Attorney at the Electronic Frontier Foundation (EFF), one of the leading digital rights groups in the world. Prior to EFF, he practiced intellectual property law at the firm of Fish & Richardson, P.C. and served as a clerk to the Honorable D. Lowell Jensen of the Northern District of California.\n\n\n\nRobert Sterne Robert Greene Sterne is a Founding Director of Sterne, Kessler, Goldstein & Fox P.L.L.C. He is a recognized thought leader on the subjects of patent reexamination and concurrent litigation, post issuance proceedings under the new America Invents Act, patent monetization, licensing and enforcement, USITC 337 proceedings, corporate intellectual property best practices including the Chief Intellectual Property Officer (CIPO), and Board of Director responsibility for IP. He has spoken and written extensively on these topics over the past 30 years. With regard to technology, he specializes in cutting edge technologies in electronics, computers, software, communications, semiconductors, wireless, medical devices, nanotechnology and business methods. He has handled over 150 reexaminations at the PTO. He is highly rated in peer-review lists, including Chambers, Best Lawyers in America, IAM, Super Lawyers, and others, and is the recipient of the Sedona Conference Award for Excellence in Advanced Legal Education (2004)."}, {"url": "https://www.csis.org/analysis/us-intellectual-property-critical-national-security", "page_content": "America has been the undisputed global leader in science and technology over the past century. But this global order is in flux. China’s extensive investments and years of strategic planning—including strengthening its intellectual property (IP) regimes—have enabled it to catch up to, and in some areas surpass, our capabilities in artificial intelligence (AI) and other emerging technologies. Congress is mulling over legislative proposals to counter China’s economic and geopolitical ambitions for technological dominance and the president is getting ready to announce a national AI strategy. IP reform must be a part of this sea change to ready the United States for the AI era.\n\nThe newly emerging technologies are vastly different from technologies of the past. AI provides computers the ability to learn on their own and make decisions that have traditionally required human intelligence. And when combined with other emerging technologies, its power will be truly dramatic. Quantum computers, for example, which are based on the behavior of energy and materials on the atomic and subatomic levels, can be millions of times faster than current classical computers. Just imagine military equipment driven by AI and operated by quantum computers. The country that gains the lead in these technologies will enjoy towering national security advantages, including in economic and military power.\n\nFor the United States to maintain its technological edge, we must encourage Americans to make more discoveries in AI and other emerging technologies. This in turn requires providing strong IP rights to incentivize and protect the huge investments required to make those discoveries. China’s president Xi Jinping recognizes the critical role IP plays in innovation and ultimately national security and has underscored its importance to new fields such as big data, AI, and genetic technology. The irony is that China relentlessly steals IP from the United States, while simultaneously working to strengthen its own IP system. China now reliably issues patents on cutting-edge technologies, provides injunctions for infringement of patented inventions, and has created specialty IP courts with procedures and rules similar to those of Western courts. China’s AI patenting has increased dramatically in the past few years and is distributed broadly across its companies, government organizations, and universities, while U.S. patenting on AI comes mostly from large companies. On the international stage, China uses its IP policies to attract innovation to its borders and influence the adoption of its technologies as global standards.\n\nAlthough we are undeniably in a race for technology leadership, the United States is failing to leverage IP to its full advantage. By including IP rights in the Constitution, America had granted itself a global head start in the industrial revolution. But the statute that defines the types of inventions eligible for patent protection has effectively not changed since 1793, well before any of the technologies of the modern era. This has left the Supreme Court to hold recently that some of the most critical inventions at the very core of AI and some other emerging technologies are outside the scope of our patent laws. This puts the United States at a significant disadvantage vis-à-vis our key competitors. We are also behind our competitors when it comes to IP policies surrounding the big datasets necessary for AI.\n\nIf we are to maintain our technological lead, we must reexamine all such key IP weaknesses and embrace IP policies that will incentivize and protect investments in creating AI and other emerging technologies. These are bipartisan issues. As former directors of the United States Patent and Trademark Office (USPTO) in Democrat and Republican administrations, we know that the U.S. government has the expertise and capabilities to develop comprehensive IP policies to fuel innovation aligned with our national security interests. This government-wide expertise must be coordinated.\n\nA whole-of-government approach to develop comprehensive IP policies is exactly what has just been recommended by the National Security Commission on Artificial Intelligence (NSCAI). An independent commission created by Congress, NSCAI recently published a report that recommends elevating U.S. IP policy to a national priority integrated into our national security strategies. Under NSCAI’s proposal, the secretary of commerce, in coordination with the USPTO director and leaders of other agencies, would recommend reforms and new policies that strengthen our IP system and encourage more American innovation. As reflected in NSCAI’s recommendations, public deliberation with stakeholders in industry and academia will be critical in exploring these issues.\n\nIf we are going to win the race for AI and other technologies critical to our national security, we must use every available tool to expand America’s innovation engine. This means pulling America’s IP levers to optimize technology and economic competitiveness. The United States should implement NSCAI’s IP recommendations.\n\nAndrei Iancu is a partner at Irell & Manella. David J. Kappos is a partner at Cravath, Swaine & Moore. Both are former directors of the USPTO.\n\nReprinted with permission from the July 6, 2021, edition of the New York Law Journal © 2021 ALM Media Properties, LLC. All rights reserved. Further duplication without permission is prohibited, contact 877-257-3382 or reprints@alm.com."}, {"url": "https://cointelegraph.com/news/intellectual-property-has-an-awkward-fit-in-web3-decentralization-lawyers", "page_content": "Intellectual property (IP) rights will continue to be a growing area of tension within Web3 and nonfungible tokens (NFTs), as IP rights often rely on a single “identifiable entity,” while Web3 is more often decentralized.\n\nSpeaking to Cointelegraph, David Kappos, a partner at Cravath, Swaine & Moore LLP, said that IP is traditionally “owned by an identifiable entity, which makes it necessarily centralized from a legal viewpoint.”\n\nKappos suggested that the tension between IP and decentralization does not have a clear solution, asking “how does a DAO really own the IP of the protocol it is supposed to govern?”\n\nOver the last year, there have been several lawsuits against NFT projects alleged to be violating IP, copyright and trademarks.\n\nWhen asked about third parties creating digital artworks or wearables of branded products, Kappos suggested that “an unlicensed implementer in a Web3 environment should refrain from creating a wearable that is confusingly similar to a brand owned by a third party — the same as in the real world.”\n\nOne such example is digital artist Mason Rothschild being sued by French luxury group Hermès for creating Metabirkins, an NFT collection inspired by the group’s famous Birkin bags.\n\nIn August, NFT company Yuga Labs released a new IP rights agreement for its CryptoPunks and Meebit collection, offering all CryptoPunk and Meetbits holders to use their NFTs for commercial or personal purposes.\n\nRelated: NFTs and intellectual property, explained\n\nNathanael Lim, co-founder of Web3 media startup Avium said this was a positive step for users, but the real change is that the market will be noticing IP rights more.\n\nIn August, venture capital firm Andreessen Horowitz (A16z) announced a set of six licenses tailored to NFTs based on the Creative Commons license. Lim suggests that these are mainly improvements on the Creative Commons licenses released twenty years ago and have helped clarify some of the confusion people have had about the licenses by updating the more relevant parts, but more innovation needs to occur within the space.\n\nBoth Lim and Kappos were speakers at IP Week @ SG 2022, a global conference organized by the Intellectual Property Office of Singapore (IPOS)."}, {"url": "https://www.nytimes.com/2011/01/02/business/02unboxed.html", "page_content": "AS a national strategy, China is trying to build an economy that relies on innovation rather than imitation. Clearly, its leaders recognize that being the world’s low-cost workshop for assembling the breakthrough products designed elsewhere \u0097 think iPads and a host of other high-tech goods \u0097 has its limits.\n\nSo can China become a prodigious inventor? The answer, in truth, will play out over decades \u0097 and go a long way toward determining not only China’s future, but also the shape of the global economy.\n\nClues to the Chinese approach emerge from a recent government document containing goals for drastically increasing the nation’s production of patents. It offers a telling glimpse of how China intends to engineer a more innovative society.\n\nThe document, published in November by the State Intellectual Property Office of China, is called the “National Patent Development Strategy (2011-2020).” It discusses broad economic objectives as well as specific targets to be attained by 2015."}, {"url": "https://www.iam-media.com/article/ip-hall-of-fame-2020-inductees-announced", "page_content": "Following a nomination process that began in February, and a subsequent vote by the IP Hall of Fame Academy members – who have the final say on who we inaugurate – today we are delighted to announce that the five inductees into the IP Hall of Fame for 2020 are:\n\nArturo Alessandri Besa: A distinguished lawyer and politician, Alessandri Besa served in Chile’s Chamber of Deputies and Senate, and was a presidential candidate in the country’s 1993 election. Having joined the Chilean Bar Association in 1949, he played an important role in discussions leading up to the passing of the country’s Industrial Property Law in 1991. He served as vice president of the Inter-American Association of Industrial Property (ASIPI) between 1976 and 1979, and founded the Alessandri law firm.\n\nA distinguished lawyer and politician, Alessandri Besa served in Chile’s Chamber of Deputies and Senate, and was a presidential candidate in the country’s 1993 election. Having joined the Chilean Bar Association in 1949, he played an important role in discussions leading up to the passing of the country’s Industrial Property Law in 1991. He served as vice president of the Inter-American Association of Industrial Property (ASIPI) between 1976 and 1979, and founded the Alessandri law firm. Professor Graeme Dinwoodie: An internationally-renowned trademark law scholar, Dinwoodie is also a celebrated teacher. He is the Global Professor of Intellectual Property Law at the Chicago-Kent College of Law, having previously held chairs at the University of Oxford and Queen Mary College, University of London. In 2008, INTA awarded him the prestigious Pattishall Medal for Teaching Excellence. Dinwoodie has advised WIPO on private international law and the United Nations on the protection of traditional knowledge.\n\nAn internationally-renowned trademark law scholar, Dinwoodie is also a celebrated teacher. He is the Global Professor of Intellectual Property Law at the Chicago-Kent College of Law, having previously held chairs at the University of Oxford and Queen Mary College, University of London. In 2008, INTA awarded him the prestigious Pattishall Medal for Teaching Excellence. Dinwoodie has advised WIPO on private international law and the United Nations on the protection of traditional knowledge. Lord David Kitchin: A justice of the UK Supreme Court since late 2018, Lord Kitchin is the first specialist IP judge ever to be appointed to the country’s highest court. He was made a judge of the High Court of England and Wales, Chancery Division in 2005 before being appointed a senior judge of the Patents Court two years later. Between 2009 and 2011, he served on the Enlarged Board of Appeal of the European Patent Office, before being appointed Lord Justice of Appeal. All of this followed a distinguished career as a barrister beginning in 1977.\n\nA justice of the UK Supreme Court since late 2018, Lord Kitchin is the first specialist IP judge ever to be appointed to the country’s highest court. He was made a judge of the High Court of England and Wales, Chancery Division in 2005 before being appointed a senior judge of the Patents Court two years later. Between 2009 and 2011, he served on the Enlarged Board of Appeal of the European Patent Office, before being appointed Lord Justice of Appeal. All of this followed a distinguished career as a barrister beginning in 1977. Louis Pirkey: Pirkey has been one of the most accomplished trademark lawyers in the United States over the course of a career spanning more than four decades. Having served as president of the AIPLA and been a member of INTA’s Board of Directors, he also founded boutique law firm Pirkey Barber, where he continues to practise on behalf of some world’s best-known brands.\n\nPirkey has been one of the most accomplished trademark lawyers in the United States over the course of a career spanning more than four decades. Having served as president of the AIPLA and been a member of INTA’s Board of Directors, he also founded boutique law firm Pirkey Barber, where he continues to practise on behalf of some world’s best-known brands. Teresa Stanek Rea: the first woman ever to serve as under-secretary of commerce for intellectual property and director of the USPTO, when she took the posts in an acting capacity following the resignation of David Kappos in January 2013, Stanek Rea played a pivotal role in the implementation of the America Invents Act. A former president of the American Intellectual Property Law Association, Rea is passionate about increasing diversity in IP law and is currently vice-chair of the IP group at law firm Crowell & Moring, LLP.\n\nReacting to the news of their inclusion, this year’s new inductees said the following:\n\n“I am honoured to have been selected as an inductee to the IP Hall of Fame and delighted to join such an eminent group of prior recipients. They include luminaries who have shaped our field and whose work has informed my research. I have been privileged to teach intellectual property law to so many wonderful students. My students have been a constant source of inspiration and have prompted me to think harder about the subject of intellectual property law. I am grateful to all my colleagues and students for enabling me to earn this accolade.\" Graeme Dinwoodie\n\n“It has been my great good fortune to have worked in the IP field for the whole of my career, first as a barrister and then as a judge. There are very few aspects of modern life which are not touched by IP law in one way or another and this and its ever growing importance to business and individuals make it an endlessly fascinating subject. I feel very honoured to have been selected for the IP Hall of Fame and greatly look forward to meeting and working with Academy members in the years to come, many of whom I already know well and hold in the highest regard.” Lord Kitchin\n\n“I have been privileged throughout my career in Intellectual Property law to be surrounded by talented law partners and associates, astute clients, instructive adversaries, and a supportive family. I founded my current firm with Bill Barber and Steve Meleen, fabulous colleagues and two of the best intellectual property lawyers on the planet. They and others have guided me in the right direction and produced outstanding work bearing my name. I am forever grateful for their efforts, and deeply honored to be elected to join so many champions of intellectual property in the IP Hall of Fame.” Louis Pirkey\n\n“I am honored and humbled to be selected for membership in the IP Hall of Fame. As a member of the IP community for almost 40 years, I have had a great deal of respect for the talented members of the IP Hall of Fame. The importance of IP to the economy continues to increase and it is clear that IP is a great motivator for innovation. I thank the Academy for this honour and I thank the many IP practitioners whose vision created the systems and precedents that we rely on today.” Teresa Stanek Rea\n\n(Arturo Alessandri Besa has not yet been available for comment)\n\nStarted in 2006, the IP Hall of Fame honours outstanding individuals – living or deceased – who have made a game-changing, positive impact on the global IP landscape. New inductees are chosen by the IP Hal of Fame Academy – consisting of inductees from previous years, as well as other distinguished members of the global IP community – after a nomination process that begins in January. The full list of previous inductees can be found here."}, {"url": "https://www.reuters.com/legal/transactional/week-ahead-intellectual-property-oct-18-2021-2021-10-15/", "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere are some upcoming events of interest to the intellectual property law community. Unless otherwise noted, all times are local, and court appearances are in person.\n\nMonday, Oct. 18\n\nFormer U.S. President Donald Trump is due to file an answer to \"Electric Avenue\" musician Eddy Grant's claims that he misused Grant's hit song in an animated anti-Biden video posted to his Twitter account in 2020. U.S. District Judge John Koeltl said last month that Trump and his campaign hadn't proven at an early stage of the case that the 55-second video, of a high-speed red Trump train contrasted with a slow-moving Biden handcar, made fair use of the song.\n\nThe case is Grant v. Trump, U.S. District Court for the Southern District of New York, No. 1:20-cv-07103. For Grant: Brian Caplan and Robert Clarida of Reitler Kailas & Rosenblatt. For Trump: Darren Saunders of Peroff Saunders; Kenneth Caruso of Mukasey Frenchman.\n\n9:30 a.m. - U.S. District Judge Leonard Stark in Delaware will hear oral arguments in a trademark dispute between Emerson Electric and Emerson Quiet Kool, which makes air conditioners and dehumidifiers. Emerson Electric, which said it also makes \"products that play a significant role in the temperature, humidity level and overall comfort of the home,\" alleged that EQK's name is likely to cause confusion, and that its trademark had been abandoned. EQK said in a motion for summary judgment that, among other things, Emerson Electric previously admitted EQK's marks won't cause confusion and consented to its trademark registration.\n\nThe case is Emerson Electric Co v. Emerson Quiet Kool Co, U.S. District Court for the District of Delaware, No. 1:17-cv-01846. For Emerson Electric: Adam Poff of Young Conaway Stargatt & Taylor, Michael Brennan and George Moustakas of Harness Dickey & Pierce. For EQK: John Simmons and Keith Jones of Panitch Schwarze Belisario & Nadel.\n\nTuesday, Oct. 19\n\n2:30 p.m. - The U.S. Senate Judiciary Committee's Subcommittee on Intellectual Property will hold a hearing by video entitled \"Pride in Patent Ownership: The Value of Knowing Who Owns a Patent.\" U.S. Senator Patrick Leahy, the head of the subcommittee and a Democrat from Vermont, recently introduced the Pride in Patent Ownership Act with the subcommittee's ranking member, Republican Senator Thom Tillis of North Carolina, which would require patent owners to disclose their identity to the U.S. Patent and Trademark Office when a patent issues and whenever it changes hands. The witnesses appearing at the hearing are Intel senior vice president and deputy general counsel Allon Stabinsky, Engine's IP counsel Abigail Rives, University of California, Hastings law professor Robin Feldman, and Cravath Swaine & Moore partner and former PTO director David Kappos.\n\nFriday, Oct. 22\n\n9:30 a.m. - The 9th U.S. Circuit Court of Appeals will hear oral arguments on Eat Just Inc's appeal of an order to comply with the terms of its settlement with Just Goods Inc. U.S. District Judge William Orrick in San Francisco ruled last year that \"Just Mayo\" maker Eat Just had failed to comply with the settlement of a trademark dispute with Just Goods, whose flagship product is \"Just Water,\" because Eat Just referred to itself as \"Just\" on social media and stylized its corporate name as \"Eat JUST.\" Eat Just argues on appeal that the district court \"re-wrote the Parties' binding term sheet by gutting a key provision and inserting new restrictions.\"\n\nThe case is Just Goods Inc v. Eat Just Inc, 9th U.S. Circuit Court of Appeals, No. 20-15809. For Eat Just: Charles Hooker and Dennis Wilson of Kilpatrick Townsend & Stockton, Philip Wang and Constance Yu of Putterman Yu. For Just Goods: Jill Pietrini, Matthew Halgren, and Paul Bost of Sheppard Mullin Richter & Hampton.\n\nKnow of an event that could be included in an upcoming Week Ahead in Intellectual Property? Contact Blake Brittain at blake.brittain@thomsonreuters.com\n\n\n\n\n\n\n\n\n\n\n\nOur Standards: The Thomson Reuters Trust Principles."}, {"url": "https://plato.stanford.edu/entries/intellectual-property/", "page_content": "First published Tue Mar 8, 2011; substantive revision Thu Aug 18, 2022\n\nLegal protections for intellectual property have a rich history that stretches back to ancient Greece and before. As different legal systems matured in protecting intellectual works, there was a refinement of what was being protected within different areas. Over the same period several strands of moral justification for intellectual property were offered: namely, personality-based, utilitarian, and Lockean. Finally, there have been numerous critics of intellectual property and systems of intellectual property protection. This essay will discuss all of these topics, focusing on Anglo-American and European legal and moral conceptions of intellectual property.\n\nIntellectual property is generally characterized as non-physical property that is the product of original thought. Typically, rights do not surround the abstract non-physical entity; rather, intellectual property rights surround the control of physical manifestations or expressions of ideas. Intellectual property law protects a content-creator’s interest in their ideas by assigning and enforcing legal rights to produce and control physical instantiations of those ideas.\n\n1. History of Intellectual Property\n\nOne of the first known references to intellectual property protection dates from 500 B.C.E., when chefs in the Greek colony of Sybaris were granted year-long monopolies for creating particular culinary delights. There are at least three other notable references to intellectual property in ancient times—these cases are cited in Bruce Bugbee’s formidable work The Genesis of American Patent and Copyright Law (Bugbee 1967). In the first case, Vitruvius (257–180 B.C.E.) is said to have revealed intellectual property theft during a literary contest in Alexandria. While serving as judge in the contest, Vitruvius exposed the false poets who were then tried, convicted, and disgraced for stealing the words and phrases of others.\n\nThe second and third cases also come from Roman times (first century C.E.). Although there is no known Roman law protecting intellectual property, Roman jurists did discuss the different ownership interests associated with an intellectual work and how the work was codified—e.g., the ownership of a painting and the ownership of a table upon which the painting appears. There is also reference to literary piracy by the Roman epigrammatist Martial. In this case, Fidentinus is caught reciting the works of Martial without citing the source.\n\nThese examples are generally thought to be atypical; as far as we know, there were no institutions or conventions of intellectual property protection in Ancient Greece or Rome. From Roman times to the birth of the Florentine Republic, however, there were many franchises, privileges, and royal favors granted surrounding the rights to intellectual works. Bugbee distinguishes between franchises or royal favors and systems of intellectual property in the following way: franchises and royal favors restrict access to intellectual works already in the public domain, thus these decrees take something from the people. An inventor, on the other hand, deprives the public of nothing that existed prior to the act of invention (Bugbee 1967). One of the first statutes that protected authors’ rights was issued by the Republic of Florence on June 19, 1421, to Filippo Brunelleschi, a famous architect. This statute not only recognized the rights of authors and inventors to the products of their intellectual efforts; it built in an incentive mechanism that became a prominent feature of Anglo-American intellectual property protection. For several reasons, including Guild influence, the Florentine patent statute of 1421 issued only the single patent to Brunelleschi. The basis of the first lasting patent institution of intellectual property protection is found in a 1474 statute of the Venetian Republic. This statute appeared 150 years before England’s Statute of Monopolies; moreover, the system was sophisticated. The rights of inventors were recognized, an incentive mechanism was included, compensation for infringement was established, and a term limit on inventors’ rights was imposed.\n\nAmerican institutions of intellectual property protection are based on the English system that began with the Statute of Monopolies (1624) and the Statute of Anne (1710). The Statute of Monopolies granted fourteen-year monopolies to authors and inventors and ended the practice of granting rights to “non-original/new” ideas or works already in the public domain. In contrast to patent institutions in Europe, literary works remained largely unprotected until the arrival of Johannes Gutenberg’s printing press in the fifteenth century. Even then there were few true copyrights granted—most were grants, privileges, and monopolies.\n\nThe Statute of Anne (1710) is considered by scholars to be the first statute of modern copyright. The statute begins:\n\n“Whereas printers, booksellers, and other persons have lately frequently taken the liberty of printing, reprinting, and publishing books without the consent of the authors and proprietors … to their very great detriment, and too often to the ruin of them and their families: for preventing therefore such practices for the future, and for the encouragement of learned men to compose and write use books, be it enacted …” (Great Britain, Statute of Anne, 1710)\n\nThe law gave protection to the author by granting fourteen-year copyrights, with a fourteen-year renewal possible if the author was still alive.\n\nIn the landmark English case Miller v. Taylor (1769), the inherent rights of authors to control what they produce, independent of statute or law, was affirmed. While this case was later overruled in Donaldson v. Becket (1774), the practice of recognizing the rights of authors had begun. Over the following decades other European countries, including Belgium, Holland, Italy, and Switzerland, followed the example set by England (Bugbee 1967). Various international treaties like the Berne Convention treaty and the Trade-Related Aspects of Intellectual Property (TRIPS 1994) agreement have expanded the geographic scope of intellectual property protection to include most of the globe.\n\n2. The Domain of Intellectual Property\n\nAt the most practical level, the subject matter of intellectual property is largely codified in Anglo-American copyright, patent, and trade secret law, as well as in the moral rights granted to authors and inventors within the continental European doctrine. Although these systems of property encompass much of what is thought to count as intellectual property, they do not map out the entire landscape. Even so, Anglo-American systems of copyright, patent, trade secret, and trademark, along with certain continental doctrines, provide a rich starting point for understanding intellectual property (Moore 1998a). We will take them up in turn.\n\n2.1 Copyright\n\nThe domain of copyright protection is original works of authorship fixed in any tangible medium of expression (17 U.S.C. §102 (1988)). Works that may be copyrighted include literary, musical, artistic, photographic, architectural, and cinematographic works; maps; and computer software. First, for something to be protected, it must be fixed in a permanent or tangible medium of expression. For example, an expression could be chiseled into stone, printed in a book, or saved on a hard drive. Second, the work must be “original”—the work must be the author’s own production; it cannot be the result of copying (Bleistein v. Donaldson Lithographing Co., 188 U.S. 239 (1903)). Third, copyright does not extend to short phrases, titles, or names as these to do not contain the minimum amount of authorship required by copyright. A fourth requirement that limits the domain of what can be copyrighted is that the expression must be “non-utilitarian” or “non-functional” in nature. Utilitarian products, or products that are useful for work, fall, if they fall anywhere, within the domain of patents. Finally, rights only extend over the actual concrete expression and the derivatives of the expression—not to the abstract ideas themselves. For example, Einstein’s Theory of Relativity, as expressed in various articles and publications, is not protected under copyright law. Someone else may read these publications and express the theory in her own words and even receive a copyright for her particular expression. Some may find this troubling, but such rights are outside the domain of copyright law. The individual who copies abstract theories or ideas and expresses them in her own words may be guilty of plagiarism, but she cannot be held liable for copyright infringement.\n\nThere are five exclusive rights that copyright owners enjoy, and three major restrictions on the bundle. The five rights are: the right to reproduce the work, the right to adapt it or derive other works from it, the right to distribute copies of the work, the right to display the work publicly, and the right to perform it publicly. Under U.S. copyright law, each of these rights may be individually parsed out and sold separately by the copyright owner. All five rights lapse after the lifetime of the author plus 70 years—or in the case of works for hire, the term is set at 95 years from publication or 120 years from creation, whichever comes first. Aside from limited duration (17 U.S.C. §302), the rules of fair use (17 U.S.C. §107) and first sale (17 U.S.C. §109(a)) also restrict the rights of copyright owners. Although the notion of “fair use” is notoriously hard to spell out, it is a generally recognized principle of Anglo-American copyright law that allows anyone to make limited use of another’s copyrighted work for such purposes as criticism, comment, news reporting, teaching, scholarship, and research. For example, fair use would cover a student using short quotes of copyrighted material for academic purposes. The “first sale” rule prevents a copyright holder who has sold copies of a protected work from later interfering with the subsequent sale of those copies. For example, a copyright holder could not place, as a condition of sale, that the work in question never be given to a library or thrift shop. In short, the owners of copies can do what they like with their property, short of violating the copyrights mentioned above.\n\nAdditionally, copyright does not preclude independent creation (unlike patents). For example, if Smith creates a short poem and Jones independently creates the exact same poem. Both could obtain copyrights to their original expressions.\n\n2.2 The Creative Commons, Copyleft, and Licensing\n\nAs a modern workaround for the first sale rule, many online content providers, rather than selling a copy of a work, simply offer licensing agreements (through click-wrap, shrink-wrap, etc.) that allow only specific uses of protected content. These approaches to protecting intellectual works are relatively new and seemingly build upon the copyright systems already in place. For example, by using licensing agreements to guarantee different levels of downstream access, the Creative Commons and Copyleft models seek to expand the commons of thought and expression (Stallman 1997; Lessig 2004). An owner may allow others to build upon a protected work provided that the “new” work is similarly accessible or usable. Note that the moral bindingness of these contracts/agreements presuppose prior entitlements (hinting at the moral justifications offered below). For example, if neither party to a Copyleft license owns or has legitimate title to the intellectual work in question, then the resulting agreement/license will not be binding. Thus, Creative Commons and Copyleft models are actually built upon ownership or entitlement claims to intellectual works.\n\n2.3 Patents\n\nThe domain or subject matter of patent law is the invention and discovery of new and useful processes, machines, articles of manufacture, or compositions of matter. There are three types of patents recognized by US patent law: utility patents, design patents, and plant patents. Utility patents protect any new, useful, and nonobvious process, machine, article of manufacture, or composition of matter, as well as any new and useful improvement thereof. Design patents protect any new, original, and ornamental design for an article of manufacture. Finally, the subject matter of a plant patent is any new variety of plant that is asexually propagated (e.g. rose bushes grown by cutting pieces of the stem). Patent protection is the strongest form of intellectual property protection, in that a twenty-year exclusive monopoly is granted to the owner over any expression or implementation of the protected work (35 U.S.C. §101 (1988) and 35 U.S.C. §154(a)(2)).\n\nAs with copyright, there are restrictions on the domain of patent protection. The U.S. Patent Act requires usefulness, novelty, and non-obviousness of the subject matter. The usefulness requirement is typically deemed satisfied if the invention can accomplish at least one of its intended purposes. Needless to say, given the expense of obtaining a patent, most machines, articles of manufacture, and processes are useful in this minimal sense.\n\nA more robust requirement on the subject matter of a patent is that the invention defined in the claim for patent protection must be new or novel. There are several categories or events, all defined by statute, that can anticipate and invalidate a claim of a patent (35 U.S.C. §101 (1988)). In general, the novelty requirement invalidates patent claims if the invention was publicly known before the patent applicant invented it. For example, someone could not obtain a patent on the production of stained glass by mixing potash and sand, heating the mixture to 3000 Fahrenheit, and then adding different metallic oxide powders to produce different colors, even if the inventor in this case independently came up with this process.\n\nIn addition to utility and novelty, the third restriction on patentability is non-obviousness. United States patent law requires that the invention not be obvious to one ordinarily skilled in the relevant art at the time the invention was made. A hypothetical individual is constructed and the question is asked, “Would this invention be obvious to an expert in the relevant field?” If it would be obvious to this imaginary individual then the patent claim fails the test (35 U.S.C. §103).\n\nIn return for public disclosure and the ensuing dissemination of information, the patent holder is granted the right to make, use, sell, and authorize others to sell the patented item (35 U.S.C. §154 (1984 and Supp. 1989)). The bundle of rights conferred by a patent excludes others from making, using, or selling the invention regardless of independent creation. Like copyright, patent rights lapse after a given period of time—20 years for utility and plant patents, 14 for design patents. But unlike copyright protection, during their period of applicability these rights preclude others who independently invent the same process or machine from being able to patent or market their invention.\n\n2.4 Trade Secret\n\nThe subject matter of trade secret law is almost unlimited in terms of the content or subject matter that may be protected and typically relies on private measures, rather than state action, to preserve exclusivity. “A trade secret is any information that can be used in the operation of a business or other enterprise and that is sufficiently valuable and secret to afford an actual or potential economic advantage over others” (U.S. Legal Code, The Restatement (Third) of Unfair Competition, 1995, §39). The secret may be a formula for a chemical compound; a process of manufacturing, treating, or preserving materials; a pattern for a machine or other device; or a list of customers. Trade secrets are not registered with a government agency.\n\nThe two major restrictions on the domain of trade secrets are the requirements of secrecy and competitive advantage. An intellectual work is not a secret if it is generally known within the industry, published in trade journals, reference books, etc., or readily copyable from products on the market.\n\nAlthough trade secret rights have no built-in expiration, they are extremely limited in one important respect. Owners of trade secrets have exclusive rights to make use of the secret only as long as the secret is maintained. If the secret is made public by the owner, then trade secret protection lapses and anyone can make use of it. Moreover, owners’ rights do not exclude independent invention or discovery. Within the secrecy requirement, owners of trade secrets enjoy management rights and are protected from misappropriation. This latter protection is probably the most important right granted, given the proliferation of industrial espionage and employee theft of intellectual works. If a trade secret is misappropriated and made public, courts may impose injunctive relief and damages. For example, if someone misappropriates a trade secret and publishes it on a website, courts may require deletion and payment of fines.\n\n2.5 Trademark\n\nThe domain or subject matter of trademark is, generally speaking, the good will or good name of a company. A trademark is any word, name, symbol, or device, or any combination thereof, adopted by a manufacturer or merchant to identify her goods and distinguish them from goods produced by others (15 U.S.C. §1127 (1988)). Some marks identify services rather than products.\n\nA major restriction on what can count as a trademark is whether or not the symbol is used in everyday language. In this respect, owners of trademarks do not want their symbols to become too widely used because once this occurs, the trademark lapses. An example of this restriction eliminating a word from trademark protection is “aspirin”—as the word became a part of the common culture, rights to exclusively use the trademark lapsed.\n\nOwnership of a trademark confers upon the property holder the right to use a particular mark or symbol and the right to exclude others from using the same (or similar) mark or symbol. The duration of these rights is limited only in cases where the mark or symbol ceases to represent a company or interest, or becomes entrenched as part of the common language or culture.\n\n2.6 Protecting Mere Ideas\n\nOutside of the regimes of copyright, patent, trade secret, and trademark, there is a substantial set of case law that allows individuals to protect mere ideas as personal property. This system of property is typically called the “law of ideas” (Nimmer 1954, Epstein 1992). A highly publicized case in this area is Buchwald v. Paramount Pictures (13 U.S.P.Q. 2d 1497 (Cal. Super. Ct. 1990)), concerning the Eddie Murphy movie Coming to America. Buchwald approached Paramount Pictures with a movie idea and it was agreed that if a movie was made following Buchwald’s premise he would receive compensation. Buchwald did not fix his idea, for example by writing it down, and thus copyright infringement did not apply. After several years of false starts and negotiations Paramount notified Buchwald that the movie based on his idea was not going to be produced. Shortly after this notification, Coming to America was released and credit was given to Eddie Murphy. Even though the movie supposedly lost money, Buchwald sued and received compensation.\n\nThe law of ideas is typically applied in cases where individuals produce ideas and submit them to corporations expecting to be compensated. In certain cases, when these ideas are used by the corporation (or anyone) without authorization, compensation may be required. Before concluding that an author has property rights to her idea(s), courts require the idea(s) to be novel or original (Murray v. National Broadcasting, 844 U.S. F2d 988 (Second Cir. 1988)) and concrete (Hamilton Nat’l Bank v. Belt (D.C. Cir. 1953)). Compensation is offered only in cases of misappropriation (Sellers v. American Broadcasting Co. (11th Cir. 1982)).\n\n2.7 Droits Morals: Continental Systems of Intellectual Property\n\nArticle 6bis of the Berne Convention articulates the notion of “moral rights” that are included in continental European intellectual property law. The doctrine protects the personal rights of creators, as distinguished from their economic rights, and is generally known in France as “droits morals” or “moral rights.” These moral rights consist of the right to create and to publish a work in any form desired, the creator’s right to claim the authorship of his work, the right to prevent any deformation, mutilation or other modification thereof, the right to withdraw and destroy the work, the prohibition against excessive criticism, and the prohibition against all other injuries to the creator’s personality (Roeder 1940).\n\n3. Justifications and Critiques\n\nArguments for intellectual property rights have generally taken one of three forms (Hughes 1988; Moore 2008). Personality theorists maintain that intellectual property is an extension of individual personality. Utilitarians ground intellectual property rights in social progress and incentives to innovate. Lockeans argue that rights are justified in relation to labor and merit. To this we add a recent fourth strand of justification (Moore 2018). This more recent justification analyzes content creation and access as a form of the prisoner’s dilemma. On grounds of prudence and self-interest, we each have reason to adopt and promote institutions that protect intellectual works. While each of these strands of justification has its weaknesses, there are also strengths unique to each.\n\n3.1 Personality-Based Justifications of Intellectual Property\n\nRather than focusing on incentives and consequences or labor and merit (see utilitarian and Lockean arguments below), the personality theorist argues that intellectual property is an extension of individual personality. Personality theorists such as Hegel maintain that individuals have moral claims to their own talents, feelings, character traits, and experiences. We are self-owners in this sense. Control over physical and intellectual objects is essential for self-actualization—by expanding our selves outward beyond our own minds and mixing these selves with tangible and intangible items, we both define ourselves and obtain control over our goals and projects. For Hegel, the external actualization of the human will requires property (Hegel 1821). Property rights are important in two ways according to this view. First, by controlling and manipulating objects, both tangible and intangible, our will takes form in the world and we obtain a measure of freedom. Individuals may use their physical and intellectual property rights, for example, to shield their private lives from public scrutiny and to facilitate life-long project pursuit. Second, in some cases our personality becomes fused with an object—thus moral claims to control feelings, character traits, and experiences may be expanded to intangible works (Humboldt 1792; Kohler 1969).\n\nThe right of divulgation, when and if an intellectual work is placed before the public, is grounded in justified possession or prior entitlements over the work in question and the wrongness of compelling speech. A central wrong-making feature of violating the rights of attribution and integrity is that, in the typical case, a kind of misrepresentation or fraud occurs. For example, when Smith changes a painting by Jones without notice, there is a misrepresentation being offered. As with attribution and integrity, the right of withdraw could be protected by contracts that determine the downstream uses of intellectual works.\n\n3.1.1 Problems for Personality-Based Justifications of Intellectual Property\n\nThere are at least four problems with this view (Hughes 1988; Palmer 2005; Schroeder 2006). First, it is not clear that we own our feelings, character traits, and experiences. While it is true that we have possession of these things or that they are a part of each of us, an argument is needed to establish the relevant moral claims.\n\nSecond, even if it could be established that individuals own or have moral claims to their personality, it does not automatically follow that such claims are expanded when personalities become infused in tangible or intangible works. Rather than establishing property claims to such works, perhaps we should view this as an abandonment of personality—similar to the sloughing off of hair and skin cells. Moreover, misrepresenting an intellectual work (assuming there are no moral rights to these expressions) might change the perception of an author’s personality, but it would not in fact change their personality.\n\nThird, assuming that moral claims to personality could be expanded to tangible or intangible items, we would still need an argument justifying property rights. Personality-based moral claims may warrant nothing more than use rights or prohibitions against alteration. Finally, there are many intellectual innovations in which there is no evidence of a creator’s personality—a list of customers or a new safety-pin design, for instance (Hughes 1988). Given these challenges, personality-based theories may not provide a strong moral foundation for legal systems of intellectual property.\n\n3.1.2 The Personality Theorist’s Rejoinder\n\nEven if we acknowledge the force of these objections, there does seem to be something intuitively appealing about personality-based theories of intellectual property rights. Suppose, for example, that Mr. Friday buys a painting at a garage sale—a long-lost Crusoe original. Friday takes the painting home and alters the painting with a marker, drawing horns and mustaches on the figures in the painting. The additions are so clever and fit so nicely into the painting that Friday hangs it in a window on a busy street. There are at least two ethical worries to consider in this case. First, the alterations by Friday may cause unjustified economic damage to Crusoe. Second, and independent of the economic considerations, Friday’s actions may damage Crusoe’s reputation. The integrity of the painting has been violated without the consent of the author, perhaps causing long-term damage to his reputation and community standing. If these claims are sensible, then it appears that we are acknowledging personality-based moral “strings” attaching to certain intellectual works. By producing intellectual works, authors and inventors put themselves on display, so-to-speak, and incur certain risks. Intellectual property rights afford authors and inventors a measure of control over this risk. To put the point a different way, it is the moral claims that attach to personality, reputation, and the physical embodiments of these individual goods that justify legal rules covering damage to reputation and certain sorts of economic losses.\n\nThere is also the issue of compelled speech. Friday, in this example, is misrepresenting Crusoe and compelling him to discuss the changes, integrity, and original intent of the intellectual work. Instances of plagiarism and forgery are also example of misrepresentation and fraud.\n\nMoreover, personality-based theories of intellectual property often appeal to other moral considerations. Hegel’s personality-based justification of intellectual property rights included an incentive-based component as well—he asserts that protecting the sciences promotes them, benefiting society (Hegel 1821). Perhaps the best way to protect these intuitively attractive personality-based claims to intangible works is to adopt a more comprehensive system designed to promote progress and social utility.\n\n3.2 The Utilitarian Incentives-Based Argument for Intellectual Property\n\nIn terms of “justification,” modern Anglo-American systems of intellectual property are typically modeled as incentive-based and utilitarian (Oppenheim 1951; Machlup 1962; Boonin 1989; Hettinger 1989; Mackaay 1990; Coskery 1993; Palmer 1997; Moore 2001, Lemley 2015). On this view, a necessary condition for promoting the creation of valuable intellectual works is granting limited rights of ownership to authors and inventors. Absent certain guarantees, authors and inventors might not engage in producing intellectual property. Although success is not ensured by granting these rights, failure is inevitable if those who incur no investment costs can seize and reproduce the intellectual effort of others. Adopting systems of protection like copyright, patent, and trade secret yields an optimal amount of intellectual works being produced, and a corresponding optimal amount of social utility. Coupled with the theoretical claim that society ought to maximize social utility, we arrive at a simple yet powerful argument for the protection of intellectual property rights.\n\nIt is crucial to note that the issue of whether intellectual property protection does, or does not, sufficiently promote human happiness or well-being is an empirical question. Whether or not, for example, intellectual property protection provides an incentive that elicits some optimal output of content creation can be settled only by looking to the empirical evidence. Likewise, whether or not intellectual property protection has the effect of hindering innovation and inhibiting the production of novel valuable content can be settled only by empirical analysis. The difficulties involved in obtaining such evidence suggest that the empirical question will remain debated for some time. Complicating the task is the fact that the efficacy or lack thereof of intellectual protection in promoting well-being seems to vary from one industry to the next (Lemley 2015).\n\nOn the positive side there are numerous authors who claim that the empirical evidence is now squarely in favor of intellectual property protection. The tragedy of a ‘no-protection rule’ is secrecy, restricted markets, and lost opportunities (Miners & Staff 1990; Mossoff 2015; O’Connor 2016). William Fisher notes:\n\nPotential innovators will know that, once they reveal their breakthroughs to the world, other people will be able to take advantage of them for free. Consequently, the innovators will be unable to recoup the costs of their innovations (the costs of the education they underwent to prepare them to make the innovations, the outlay for research and development, their opportunity costs, etc.). Aware of this risk, potential innovators will devote their energies to other, more lucrative activities, and society at large will suffer. (Fisher 2001)\n\nRobert J. Barro and Xavier Sala-I-Martin note that over the long run the world’s growth rate is largely:\n\ndriven by discoveries in the technologically leading economies. Followers converge at least part way toward the leaders because copying is cheaper than innovation over some range. As the pool of uncopied ideas diminishes, the cost of imitation tends to increase…the consequence from the absence of intellectual property rights across economies…[is] the leading places tend to have insufficient incentive to invent, and the follower places tend to have excessive incentive to copy. (Barro & Sala-I-Martin 1997)\n\nProfessor Petra Moser makes the following observation:\n\nIn countries without patent laws, inventors depend entirely on secrecy, lead-time, and other alternatives to patents in protecting their intellectual property. As a result, investments in research and development may be most attractive in industries in which secrecy can effectively guarantee exclusive rights long enough to allow inventors to recoup their investments. (Moser 2013)\n\nWhile much of the economic literature in this area focuses on patents, similar points can be made with respect to copyright. With the ease of copying and distribution afforded by modern digital networks, content creators would seem to be at a serious disadvantage compared to copiers. Without copyright there would be nothing to stop copiers from simply copying movies, books, articles, and music and selling, trading, or allowing others to make free copies. Michael Smith and Rahul Telang, argue that piracy harms both producers and consumers by undermining the income streams of producers, resulting in less content being created (Smith & Telang 2016). Sean O’Connor notes, “it should be clear that no one would invest without some appropriation mechanism that would provide them with a favorable return on their investment through the monetization of the commercialized goods or services. If they cannot see a way to get such a return, they will not make the investment” (O’Connor 2015).\n\n3.2.2 Problems for the Utilitarian Incentives-Based Argument\n\nOn the negative side there are many who argue that “the jury is out” or that systems of IP protection actually hinder innovative activity (Machlup 1958; Schiff 1971; Palmer 1990; Boldrin & Levine 2007). On patent protection, Fritz Machlup (1958) wrote “No economist, on the basis of present knowledge, could possibly state with certainty that the patent system, as it now operates, confers a net benefit or a net loss upon society” (Machlup 1958). Nevertheless, Machlup went on to argue that such considerations do not yield the conclusion that we should abolish patent protection. Professors Michele Boldrin and David Levine argue that a ‘first mover advantage,’ coupled with secrecy and add-on services, is sufficient as an incentive for creation and discovery (Boldrin & Levine 2007). Tom Palmer made a similar point seventeen years earlier, arguing that intellectual works should be protected via technological fences and contracts, along with bundling in other products and services (Palmer 1990).\n\nGiven that the utilitarian argument rests on providing incentives, what is needed to critique it are cases that illustrate better ways, or equally good ways, of stimulating production without granting private property rights to authors and inventors. It would be better to establish equally powerful incentives for the production of intellectual property that did not also require initial restricted use guaranteed by rights (Polanyi 1943; Machlup 1962; Hettinger 1989; Waldron 1993; Moore 2003; Wright 1998).\n\nOne alternative to granting intellectual property rights to inventors as incentive is government support of intellectual labor (Hettinger 1989; Calandrillo 1998). This could take the form of government-funded research projects, with the results immediately becoming public property. The question becomes: can government support of intellectual labor provide enough incentive to authors and inventors so that an equal or greater amount of intellectual products are created compared to what is produced by conferring limited property rights? Better results may also be had if fewer intellectual works of higher quality were distributed to more people.\n\nUnlike a government-supported system of intellectual property rights, reward models may be able to avoid the problems of allowing monopoly control and restricting access, and at the same time provide incentives to innovate (Shavell and Van Ypersele 2001). In this model, innovators would still burn the midnight oil chasing that pot of gold, and governments would not have to decide which projects to fund or determine the amount of the rewards before the works’ “social value” was known. Funds necessary to pay the rewards could be drawn from taxes or collecting percentages of the profits of these innovations. Reward models may also avoid the disadvantages of monopoly pricing, and obstructions to further adaptation and innovation.\n\nTrade secret protection appears to be the most troubling from a utilitarian incentives-based perspective (Hettinger 1989). Given that no disclosure is necessary for trade secret protection, promoting trade secrets through incentives yields no reciprocal long-term social benefit. Trade secret protection allows authors and inventors the right to slow the dissemination of protected information indefinitely—a trade secret necessarily requires secrecy.\n\n3.2.3 The Utilitarian Rejoinder\n\nThe utilitarian who defends the incentives argument may well agree with many of these criticisms and still maintain that intellectual property rights, in some form, are justified—the current system of protection is better than government support of intellectual property creation, reward models, or nothing at all. Additionally, most of the worries surrounding the incentive-based approach appear to focus on problems of implementation. We could tinker with our system of intellectual property, cutting back on some legal protections and strengthening others (Coskery 1993; Moore 2008). Perhaps we could include more personality-based restrictions on what can be done with an intangible work after the first sale, limit the term of copyrights, patents, and trade secrets to something more reasonable, and find ways to embrace technologies that promote access while protecting incentives to innovate. The utilitarian might also remind us of the costs of changing our system of intellectual property. The ‘jury may be out’ so-to-speak regarding the economic advantages of legal protections for intellectual works, but the social and economic costs of radically changing these institutions at this point would be overly burdensome.\n\n3.3 Lockean Justifications of Intellectual Property\n\nA different strategy for justifying intellectual property rights begins with the claim that individuals are entitled to control the fruits of their labor (Locke 1690; Hettinger 1989; Becker 1993; Gordon 1993; Moore 1998b; Hughes 1988; Palmer 2005; Himma 2005a, 2006, 2008, 2013; Merges 2011). In general, the intuition is that the person who clears unowned land, cultivates crops, builds a house, or creates a new invention obtains property rights by engaging in these activities. Laboring, producing, thinking, and persevering are voluntary, and individuals who engage in these activities are entitled to what they produce. Subject to certain restrictions, rights are generated when individuals mix their labor with an unowned object. Restrictions or limits on acquisition include a labor requirement, a non-waste requirement, and the “enough and as good” proviso (Locke 1690). Labor, for Locke, is best understood as metaphor for productive activities needed to sustain and promote human flourishing (Mossoff 2012). The non-waste requirement invalidates a property claim if the appropriator takes more than she can consume or use without spoilage. Unlike the labor metaphor, spoilage for Locke means rotting or the destruction of an existing good useful for sustaining human life. Finally, the “enough and as good” proviso is best illustrated by an example Locke gives. When someone takes a drink of water from a river it is as if he takes nothing at all. His fellows are, all things considered, unaffected by this acquisition.\n\nConsider a more formal version of Locke’s famous argument. Individuals own their own bodies and labor—i.e., they are self-owners. When an individual labors on an unowned object, her labor becomes infused in the object and for the most part, the labor and the object cannot be separated. It follows that once a person’s labor is joined with an unowned object, assuming that individuals exclusively own their body and labor, rights to control are generated. The idea is that there is an expansion of rights: we each own our labor and when that labor is mixed with objects in the commons, our rights are expanded to include these goods.\n\nIn terms of intellectual property, the act of creation or discovery typically takes time, effort, and skill. Intellectual works don’t spoil like apples, so there are no “non-waste” concerns. Moreover, the creation or discovery seemingly leaves “enough and as good.” Creating a poem, for example, and holding it as a secret does not preclude others from creating their own poems.\n\n3.3.1 Objections to Locke\n\nLocke’s argument is not without difficulties. Jeremy Waldron (1983) argued that the idea of mixing one’s labor is incoherent—actions cannot be mixed with objects. P. J. Proudhon (1840) argued that if labor was important, the second labor on an object should ground a property right in an object as reliably as the first labor. Nozick (1974) asked why labor mixing generated property rights rather than a loss of labor. Waldron (1983) and Perry (1978) have argued that mixing one’s labor with an unowned object should yield more limited rights than rights of full ownership. Finally, if the skills, tools, and inventions used in laboring are social products, then perhaps individual claims to title have been undermined (Grant 1987; Hettinger 1989).\n\n3.3.2 The Lockean Rejoinder\n\nAmong defenders of Lockean-based arguments for private property, these challenges have not gone unnoticed (Spooner 1855; Schmidtz 1990; Mack 1990; Simmons 1992; Child 1990; Moore 2001; Mossoff 2012; Claeys 2017). Rather than rehearsing the points and counterpoints, consider a modified version of the Lockean argument—one that does not so easily fall prey to the objections mentioned above.\n\nAfter weeks of effort and numerous failures, suppose Ginger comes up with an excellent new recipe for spicy noodles—a recipe that she keeps in her mind and does not write down. Would anyone argue that Ginger does not have at least some minimal moral claim to control the recipe? Suppose that Fred samples some of Ginger’s noodles and desires to purchase the recipe. Is there anything morally suspicious with an agreement between them that grants Fred a limited right to use Ginger’s recipe provided that Fred does not disclose the process? Alas, Fred didn’t have to agree to the terms and, no matter how tasty the noodles, he could eat something else or create his own recipe. Arguably, part of the moral weightiness of the agreement between Ginger and Fred relies on the fact that Ginger holds legitimate title to the recipe. A slightly different way to put this Lockean argument for intellectual property rights is:\n\nStep One: The Generation of Prima Facie Claims to Control – Suppose Ginger creates a new intellectual work – creation, effort, etc., yield her prima facie claims to control (similar to student desert for a grade). Step Two: Locke’s Proviso – If the acquisition of an intellectual object makes no one (else) worse off in terms of their level of well-being compared to how they were immediately before the acquisition, then the taking is permitted. Step Three: From Prima Facie Claims to Property Rights – When are prima facie claims to control an intellectual work undefeated? Answer: when the proviso is satisfied. Alas, no one else has been worsened – who could complain? Conclusion: So long as no harm is done – the proviso is satisfied – the prima facie claims that labor and effort may generate turn into property claims (Moore 2012).\n\nIn small communities it may even be possible to contract with all of one’s fellows securing all or some of the bundle of full ownership. In this sort of example, every single member of the community would be directly part of the agreement. Ginger says to her peers, “if you want access to my recipe, then you will have to agree to my right to enjoy income” and they reply “but such rights can’t be indefinite … we as a community won’t be on the hook for defending this agreement indefinitely.” In the ensuing give-and-take an agreement is hammered out. It is important to note that the moral bindingness of such an agreement is crucially dependent on the initial set of entitlement claims generated by labor, desert, and non-worsening. If Ginger, in this case, was not the author of the recipe — suppose she took it from someone else — it is not at all clear that the resulting contract would be morally or legally binding.\n\nMoving from small communities to larger ones a more general form of agreement between authors, inventors, and society can be considered. If intellectual works are to be held as anything other than trade secrets, walled off with narrow contracts like non-disclosure agreements or non-competition arrangements, there must be a way of securing access. Society may purchase access by offering limited rights to authors and inventors. Moreover, if some society does not offer this sort of protection, then innovators would likely employ their talents in other areas or simply move to a society where such agreements are recognized.\n\n3.4 Intellectual Property and the Prisoner’s Dilemma\n\nA major concern and limitation on the traditional justifications for intellectual property already discussed is that many scholars reject the starting assumptions needed to generate the desired moral claims. For example, non-utilitarians will dismiss the theoretical foundations of utilitarianism. Non-Lockeans will reject Locke’s commitment to self-ownership, natural rights, and individual flourishing. Building off of the positive economic analysis mentioned in the utilitarian justification for IP discussed above, Moore (2018) offers a different sort of argument based on individual prudence and self interest. Note that this argument, while concerned with consequences, is not focused on maximizing human well-being or flourishing.\n\nConsider the following case. Imagine that we have two intellectual property creators, Beren and Lúthien, and two possible outcomes for each. In a single-play prisoner’s dilemma game, each player can copy an intellectual creation of the other, or not. Assume as well that the intellectual works created by Beren and Lúthien are valuable, interesting, or desired. The best case for either player is one where their own intellectual creation is not copied and yet they get to copy the work of the other player. This is ‘best’ for the player who copies and ‘worst’ for the player who doesn’t because, (1) the player who copies gets to enjoy or consume more content compared to the other player, (2) the player who copies still has the option or possibility of obtaining benefit by selling, trading, or bartering with the other player, while the non-copier does not enjoy these possibilities — this provides a way to recoup research and development costs, and (3) via selling, trading, or bartering the copier may obtain a positional advantage and more capital for future exchanges compared to the non-copier. Simply put, the copier obtains more content and retains more opportunities to sell, barter, or exchange compared to the non-copier. If Beren and Lúthien both refrain from copying each other, then each will avoid the worst outcome in terms of recouping investment costs and being at a positional disadvantage. Both will also retain the option of buying or bartering for the non-copied content the other enjoys. This payoff is ‘okay,’ better than ‘worst’ but not as good as ‘best.’ If both Beren and Lúthien copy each other, then both will get extra content to enjoy and will not be put at a positional disadvantage, but each will be denied the possibility of recouping research and development costs. The other player will not buy or barter for content he already possesses. These payoffs mirror a prisoner’s dilemma game (Axelrod 198, 1984, Skyrms 1990, Binmore 2015, Holt, Johnson and Schmidtz 2015).\n\nIn modeling content creation, access, and copying as an iterated prisoner’s dilemma between numerous individuals, the problem becomes even more salient. It will be individually rational to copy the intellectual efforts and creations of others. This will suppress innovation and lead to a sub-optimal result. Based solely on rational self-interest and prudence, Moore argues we should adopt institutions that promote innovation and allow inventors the capacity to recoup research and development costs. If copying becomes too widespread or if enforcement mechanisms fail, then we will likely spiral toward the collectively sub-optimal result of suppressing innovation. We see similar results of an intellectual property prisoner’s dilemma played out between nations. Through the use of sanctions against copying the intellectual efforts of others, we give ourselves compelling reasons to pursue a collectively superior outcome.\n\n4. General Critiques of Intellectual Property\n\nPutting aside the strands of argument that seek to justify moral claims to intangible works and the rather focused problems with these views, there are several general critiques of the rights to control intellectual property to consider.\n\n4.1 Information is Not Property\n\nCritics argue that information is not the kind of thing that can be owned or possessed and is not something that can be property, as that notion is typically defined. Information objects, such as numbers and propositions are abstract objects, which cannot causally interact with material objects, and hence cannot be owned or possessed. The idea, for example, that one could, in the relevant sense, possess and hence own the novel expressed by the book A Tale of Two Cities makes as little sense as the idea that one could possess and hence own the entity denoted by the symbol “2.” Whatever concepts might properly be applied to abstract objects, on this view, the concept of property, according to these theorists, does not. As a conceptual matter, the term “intellectual property,” at best, applies to nothing and, at worst, is incoherent.\n\nThis analysis is vulnerable to at least two objections. First, it is not clear that ownership, as a conceptual matter, requires physical possession. One can argue that the essence of ownership consists in a power — the power to exclude others from certain behaviors involving the relevant entity — and not in physical control or possession of the entity. Second, the claim that information objects cannot be property does not imply that it is illegitimate to grant to authors or content-creators a legal right to exclude others from appropriating those objects without their consent. That some entity E is not “property” implies only that it should not be legally protected qua property; it does not imply that E should not be protected in very similar ways. It might be that such legal rights should be called something other than “intellectual property rights,” but these rights could be called something else, such as, for example, “intellectual content rights.”\n\n4.2 Information is Non-Rivalrous\n\nMany have argued that the non-rivalrous nature of intellectual works grounds a prima facie case against rights to restrict access. Since intellectual works are not typically consumed by their use and can be used by many individuals concurrently (making a copy does not deprive anyone of their possessions), we have a strong case against moral and legal intellectual property rights (Kuflik 1989; Hettinger 1989; Barlow 1997). One reason for the widespread pirating of intellectual works is that many people think restricting access to these works is unjustified. Consider a more formal version of this argument:\n\nP1. If a tangible or intangible work can be used and consumed by many individuals concurrently (is non-rivalrous), then maximal access and use should be permitted. P2. Intellectual works falling under the domains of copyright, patent, and trade secret protection are non-rivalrous. C3. It follows that there is an immediate prima facie case against intellectual property rights, or for allowing maximal access to intellectual works.\n\nThe weak point in this argument is the first premise (Moore 2012; Himma, 2005b). Consider sensitive personal information. Moore argues that it false to claim that just because this information can be used and consumed by many individuals concurrently, a prima facie moral claim to maximal access is established. This argument applies as well to snuff films, obscene pornography, information related to national security, personal financial information, and private thoughts; each are non-rivalrous, but this fact does not by itself generate prima facie moral claims for maximal access and use. Moreover, it is not clear that unauthorized copying does no harm to the owner even in cases where the copier would not have purchased a copy legitimately (and thus is not denying the owner economic compensation they would otherwise receive). Unauthorized copying creates un-consented to risks that owners must shoulder.\n\nHimma points out that, by itself, the claim that consumption of information is non-rivalrous does not imply that we have a right of any kind to those objects. While this certainly provides a reason against thinking protection of intellectual property is morally justified, it does not tell us anything about whether we have a right of some sort because it does not contain any information about morally relevant properties of human beings—and the justification of general rights-claims necessarily rests on attributions of value that implicitly respond to interests of beings with the appropriate level of moral standing—in our case, our status as persons (Himma 2005b).\n\n4.3 Information Wants to be Free\n\nBarlow (1997) argues that information is entitled to moral consideration in virtue of being alive. On his view, information is a form of life with a claim to be free that is grounded in interests and “wants” of its own. As he puts the point, information objects “are life forms in every respect but a basis in the carbon atom. They self-reproduce, they interact with their surroundings and adapt to them, they mutate, they persist.” Further, these living information objects have some sort of interest in being made available to everyone free of charge.\n\nBarlow’s argument can be challenged on a couple of grounds. First, Himma (2005b) argues that it is simply implausible to think of abstract objects as having wants — or even interests. The concept of desire is such that only conscious beings are capable of having desires; although a conscious being can have subconscious desires, non-sentient entitles are no more accurately characterized as having desires than as having hopes. Second, even if information objects had wants or interests, Barlow gives no reason for thinking that they have a desire to, or interest in being made freely available to all. Certainly, the claim that being made freely available to all somehow benefits information objects needs an argument if for no other reason than that it is counterintuitive.\n\n4.4 The Free Speech Argument against Intellectual Property\n\nAccording to some, promoting intellectual property rights is inconsistent with our commitment to freedom of thought and speech (Nimmer 1970; Hettinger 1989; Waldron 1993). Closely associated with this argument is the position that individuals have a right to knowledge and intellectual property institutions interfere with this basic right. Hettinger argues that intellectual property “restricts methods of acquiring ideas (as do trade secrets), it restricts the use of ideas (as do patents), and it restricts the expression of ideas (as do copyrights)—restrictions undesirable for a number of reasons” (Hettinger 1989). Hettinger singles out trade secrets as the most troublesome because, unlike patents and copyrights, they do not require disclosure.\n\nThree sorts of replies have been offered to this kind of worry (Himma 2006; Moore 2012). While we focus on the free speech argument against intellectual property, right to know arguments fall prey to similar objections. The first objection notes that it is the incentives found in providing limited protection that fosters the creation and dissemination of information—a system of intellectual property protection may cause restricted access in the short run, but overall, the commons of thought and expression is enhanced. Simply put, in the long run we get more to talk about, consume, and enjoy because of the incentives afforded by copyrights and patents.\n\nSecond, it is not at all clear that free speech is so presumptively weighty that it nearly always trumps other values. Shouting at someone over a bullhorn all day is not something we would countenance as protected free speech. Hate speech, obscene expressions, sexual harassment, and broadcasting private medical information about others are each examples of speech that we are willing to limit for various reasons—perhaps intellectual property rights can be viewed in this light.\n\nFinally, consider the contentious, yet established, idea/expression rule of copyright. Copyright only applies to fixed expressions, not to the ideas that may make up a fixed expression. For example, someone may read Darwin’s original writings on evolution, express these ideas in her own words, and obtain a copyright in the new expression. This individual may be guilty of plagiarism, but so long as her expressions are not copied from Darwin’s original or substantially similar to the original, she can obtain a copyright. Copyrights and patents require disclosure and thus the ideas that make up these intellectual works may be discussed and analyzed.\n\n4.4 The Social Nature of Information Argument\n\nAccording to this view, information is a social product and enforcing access restrictions unduly benefits authors and inventors. Individuals are raised in societies that endow them with knowledge which these individuals then use to create intellectual works of all kinds. On this view the building blocks of intellectual works—knowledge—is a social product. Individuals should not have exclusive and perpetual ownership of the works that they create because these works are built upon the shared knowledge of society. Allowing rights to intellectual works would be similar to granting ownership to the individual who placed the last brick in a public works dam. The dam is a social product, built up by the efforts of hundreds, and knowledge, upon which all intellectual works are built, is built up in a similar fashion (Proudhon 1840; Grant 1987; Shapiro 1991; Simmons 1992, Boyle 1997).\n\nBeyond challenging whether the notion of “society” employed in this view is clear enough to carry the weight that the argument demands, critics have questioned the view that societies can be owed something or that they can own or deserve something (Spooner 1855; Nozick 1974; Moore 2012). Lysander Spooner writes:\n\n“What rights society has, in ideas, which they did not produce, and have never purchased, it would probably be very difficult to define; and equally difficult to explain how society became possessed of those rights. It certainly requires something more than assertion, to prove that by simply coming to a knowledge of certain ideas—the products of individual labor—society acquires any valid title to them, or, consequently, any rights in them” (Spooner 1855).\n\nThe problem of how individuals acquire property rights (personality, utilitarian, Lockean, etc.) now applies to how societies obtain these rights.\n\nMoore charges that defenders of the social nature argument against intellectual property fail to see that it may prove too much.\n\nBut like the defender of the first cause argument for the existence of God who rides the principle of sufficient causation to a certain point and then conveniently abandons it (every event or object needs a sufficient cause and nothing is self-caused except God) the proponent of the “shared culture” view is guilty of a similar trick. “Shared culture” or the social nature of intellectual property view is sufficient for undermining intellectual property rights or robust control of intellectual works, but conveniently not strong enough to undermine student desert for a grade, criminal punishment, or other sorts of moral evaluation (Moore 2012).\n\nFinally, even if a defender of this view can justify societal ownership of general pools of knowledge and information, it could be argued that we have already paid for the use of this collective wisdom when we pay for education and the like.\n\n4.6 The Cost of Publishing Digital Information\n\nCoy (2007) argues is that, in a competitive market, the cost of information should properly reflect the cost of making it available to users. On this line of analysis, while the cost of making publishing information in traditional material media like books might be sufficiently high to justify charging users a price for it, the cost (per user) of making information available on digital media approaches zero as the number of users grow larger. For example, there might be some fixed cost involved in making information available on a website, but no additional cost is required beyond that to make that content available to any number of users; the more users appropriating the information, the lower the cost of making it available to any particular user. Thus, the argument concludes, it would be unfair to charge users a fee for appropriating any piece of (digital) information; information should be free (or nearly free) so as to reflect its dissemination costs.\n\nThere are two problems with this argument. First, if one accepts the legitimacy of free enterprise, as appears to be presupposed by the above argument, then what is a fair price will be determined by the voluntary interactions of buyers and sellers in a competitive market: the fair price is that which is set by the contractual transactions of free, prudentially-rational buyers and sellers. If buyers in a competitive market are willing to pay a price for digital information that is significantly higher than the seller’s marginal cost, then that price can be presumed fair. Second, the argument overlooks the fact that the fixed costs associated with producing and distributing intellectual content can be quite high. For example, the Disney Company spent more than $100 million in making the film West Side Story in 2021. If one assumes that a fair price is such as to allow the producer to recover the fixed development costs associated with producing and distributing intellectual content, this would entail that it is fair for content producers to charge a price that is sufficiently above the marginal costs to allow them to recover these fixed costs.\n\n4.7 The Liberty Objection to Intellectual Property\n\nWhen an individual owns a physical item her rights exclude others from interfering with her control of it. But intellectual property rights sweep across the entire domain of human action, restricting individual liberty even in the privacy of one’s own home. “How can the artist, copyright or patent holder determine what I can do with my stuff?” Many have attacked the notion of intellectual property on the grounds that it violates individual liberty rights (Palmer 1990). Tom Palmer argues,\n\nLiberty and intellectual property seem to be at odds, for while property in tangible objects limits actions only with respect to particular goods, property in ideal objects restricts an entire range of actions unlimited by place or time, involving legitimately owned property (VCRs, tape recorders, typewriters, the human voice, and more) by all but those privileged to receive monopoly grants from the state (Palmer 1990).\n\nThere are at least two replies to this sort of worry. First, the problem may be addressed by adopting specific legal rules. For example, current Anglo-American institutions of intellectual property have built in provisions that limit the rights of authors and inventors. These limitations, for example “fair use” (17 U.S.C. §107) and “first sale” (17 U.S.C. §109(a)) allow individuals to use a patented or copyrighted work for personal use, non-profit, or educational purposes. Under current law it is permissible to make back-up copies of computer games or to copy a chapter of a book from the library. Perhaps these kinds of limitations could be built into the bargain between society and those who create intellectual works.\n\nA second reply is that rights of all sorts restrict what individuals can do with their bodies and property. Restricting individual liberty is no more a feature of intellectual property than of other sorts of rights. Physical property rights to a car, for example, prohibit all of humanity from swinging a bat and damaging the car in question. Even in the privacy of your own home it is not legally permissible to punch someone in the face, destroy a visitor’s personal property, or engage in risky activities that threaten one’s neighbors."}, {"url": "https://www.law.ac.uk/employability/legal-practice-areas/intellectual-property-law/", "page_content": "These rights are established, protected, enforced and promoted through means such as patents (usually for such things as technical inventions), trademarks (for goods and services), copyright (music, art and literature) and designs (products and logos).\n\nWhat does an intellectual property lawyer do?\n\nLawyers tend to specialise in either contentious or non-contentious IP. Non-contentious work involves checking and registering client’s rights through, for example, patents and trademarks, as well as drafting commercial agreements to issue licences that allow others to use those rights.\n\nContentious work is required when a client’s rights have been infringed or abused in any way, for example, when counterfeit products are being sold or music is used illegally.\n\nHow to get into intellectual property law?\n\nHaving a degree in a STEM subject is preferable but not essential for a career in intellectual property law. Work experience in the area is important so gaining as much IP experience as possible will help. This doesn’t need to be legal based. Many people come from the entertainment industry, engineering and technology industries to become an IP lawyer. You will also need to follow all the steps to becoming a qualified solicitor.\n\nTo become a solicitor, you can either take the Solicitors Qualifying Examination (SQE), or if you are eligible, you can study the Legal Practice Course (LPC).\n\nIf you qualify through the SQE, you will also need to complete two years of Qualifying Work Experience (QWE). To prepare for the SQE, we recommend studying one of our SQE courses, which have been designed to give you the knowledge and skills for a successful career as a solicitor.\n\nIf you’re eligible to study the LPC, you will need to get a two-year training contract with a law firm. To find out what route is right for you, see our Becoming a Solicitor page.\n\nOnce you complete your two-year training contract or QWE, you can apply to the Solicitors Regulation Authority (SRA) to be admitted as a solicitor.\n\nIf you want to become a barrister, you will need to have completed an undergraduate law degree, or if you are a non-law graduate, a conversion course, before completing the Bar Practice Course (BPC). You will then need to secure pupillage.\n\nYou can also study a Master of Law (LLM) in Data Protection and Intellectual Property or an LLM in Compliance and Regulation to give you the knowledge and skills to move into this sector.\n\nWhat skills do you need to be an intellectual property lawyer?\n\nClients can range from unknown individuals with a brilliant idea to patent, through to pharmaceutical giants and famous artists. IP lawyers need to build a rapport with a wide range of different people, and be able to think commercially and from a client’s point of view.\n\nLawyers in this practice area need to understand the complex and technical language – many IP lawyers have previous relevant experience in other fields like science, technology and medicine. Attention to detail is vital as is the ability to manage huge volumes of paperwork alongside some tight deadlines.\n\nIP work is likely to involve commercial law and litigation so it’s a good idea to look at the skills required for those areas too.\n\nWhy study intellectual property law?\n\nStudying intellectual property law will not only allow you to progress into an exciting and ever-evolving area of law, but will also teach you attention to detail, technical and scientific knowledge and broader awareness of areas like commercial law, creative commons and litigation. It is an area that has seen a rise in interest over recent years and will continue to become an important part of law.\n\nAverage salary in intellectual property law\n\nA newly qualified solicitor in a firm outside of the city or smaller criminal practice may expect to earn around £30,000 to £50,000. An average IP solicitor salary in London is anything from £40,000 to £80,000 based on five years’ experience according to IPCareers.com. For those with over ten years' experience, earnings can range from £60,000 to £140,000. Those based in London and bigger cities will often earn more too.\n\nGaining intellectual property law work experience\n\nThe following student guides have useful information on working in intellectual property law: LawCareers.net, Chambers and Partners Student Guide and Target Law.\n\nIntellectual Property Office – Information on the Intellectual Property industry."}]}