{"David Kappos was responsible for IBM's intellectual property litigation.": [{"url": "https://www.uspto.gov/about-us/david-j-kappos", "page_content": "2009-2013\n\nDavid J. Kappos was born in 1961 in Palos Verdes, California. He was educated at the University of California, Davis, where he earned a Bachelor of Science in electrical and computer engineering, and the University of California, Berkeley, where he earned a Doctorate of Jurisprudence.\n\nKappos spent more than 25 years at IBM. As counsel in the area of global intellectual property (IP) protection, he oversaw the protection of the firm’s IP in the Asia-Pacific region. Then, in 2003, he became IBM’s chief IP lawyer. Attaining the rank of Vice President and Assistant General Counsel, Intellectual Property Law, he managed IBM’s patent and trademark portfolios.\n\nIn 2009, President Barack Obama nominated Kappos for the position of Under Secretary of Commerce for Intellectual Property and Director of the USPTO. The Senate confirmed Kappos’s appointment on August 13, 2009. As Director, Kappos prioritized the strategic navigation of a severe recession, the implementation of the Leahy-Smith America Invents Act (AIA), and the reduction of pendency intervals (the amount of time between an applicant's submitting an application and receiving a decision).\n\nIn response to financial pressures resulting from the recession (2007-2009) and a decline in business activity for the agency, the USPTO froze hiring and scaled back programs where possible. The outlook brightened in 2011 when Congress passed the AIA, which Director Kappos helped to shape. He then set to work implementing the Act’s provisions, including the establishment of the Patent Trial and Appeal Board, and restarting expansions and initiatives that had been interrupted by the recession.\n\nMeanwhile, Director Kappos and the USPTO succeeded in reducing pendency by several months. The number of unexamined utility patent applications shrank, too, as the backlog fell from about 750,000 in 2009 to about 609,000 in 2013. In the same period, the Trademark organization exceeded its targets for action and final pendency. In pursuit of greater efficiency, Director Kappos pushed for the replacement of antiquated information technology, reengineering many of the systems and processes that kept patent and trademark applications moving.\n\nUnder Director Kappos’s leadership, new offices and institutions arrived that proved to be lasting. The USPTO gained a Chief Economist and its first permanent satellite location, the Elijah J. McCoy Midwest Regional Office in Detroit, Michigan.\n\nOther major milestones under Director Kappos’s leadership include the issuance of patent 8 million and the attainment of fifth place for employee satisfaction among the 300-plus federal agency and agency subcomponents surveyed by the Partnership for Public Service in 2012. The USPTO had risen steadily in these rankings from 172nd place in 2009, just before Kappos assumed office, to first place, shortly after his departure.\n\nFurther reading\n\nDavid J. Kappos. Cravath, Swaine & Moore LLP. Accessed June 15, 2021.\n\nUnited States Patent and Trademark Office FY 2009 Performance and Accountability Report. USPTO. November 2009.\n\nUnited States Patent and Trademark Office FY 2010 Performance and Accountability Report. USPTO. November 2010.\n\nUnited States Patent and Trademark Office FY 2011 Performance and Accountability Report. USPTO. November 2011.\n\nUnited States Patent and Trademark Office FY 2012 Performance and Accountability Report. USPTO. November 2012.\n\nUnited States Patent and Trademark Office FY 2013 Performance and Accountability Report. USPTO. November 2013.\n\nThe White House, Office of the Press Secretary. President Obama Announces More Key Administration Posts, 6-18-09. Press release. June 18, 2009."}, {"url": "https://itif.org/person/david-kappos/", "page_content": "David J. Kappos is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation‑based assets. Mr. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues, including those pertaining to blockchain and financial technology (FinTech) as well as data security and privacy.\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically re‑engineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy‑Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region."}, {"url": "https://www.iam-media.com/rankings/patent-1000/profile/person/david-j-kappos", "page_content": "When you need the best of the best for the highest-priority patent deals and disputes, Cravath is at the top of a very short list of firms. It is uniquely set up: its lawyers receive the highest quality generalist training but develop specialisation over time, granting them the pliability to deal with any issue, along with enhanced problem-solving and creative thinking skills and deep substantive knowledge of the relevant issues. Among them are several eminent trial lawyers, including Keith Hummel , Evan Chesler , David Marriott and Sharonmoyee Goswami : Hummel is ingenious, resourceful, resolute and unflagging – there is nothing he cannot do when it comes to complex legal conflict. So, too, Chesler, who is referred to in reverent tones as “godlike in litigation”. He continues to work closely with Marriott – they valiantly battled Apple on Qualcomm’s behalf – and is currently representing short-form streaming start-up Quibi and consumer technology holding company WndrCo alongside him in consolidated patent infringement and trade secret litigation against Israeli technology company JBF Interlude. Marriott has proven his mettle in many high-profile IP, antitrust and securities cases. Goswami is the rising star of the practice and comes in for special praise: “Sharon is extremely strategic and detail-oriented and knows how to position cases to maximise chances of success. She has a sense of self and purpose about her and is highly collaborative, with a unique ability to work seamlessly across multiple teams.” One of the top IP experts, not just at Cravath but in the world, corporate partner David Kappos anchors a leading transactions practice. He gets the biggest deals done before tea time but also devotes mental energy to crystal-ball gazing; he has an uncannily accurate sense of where things are heading – what the policy issues will be and where commercial opportunities will arise – making his behind-the-scenes strategic counsel utterly priceless.\n\nMr Kappos received a BS summa cum laude in electrical and computer engineering from the University of California, Davis in 1983 and a JD from the University of California, Berkeley in 1990.\n\nMr Kappos has received numerous accolades for his contributions to the field of intellectual property, including being named one of the Top 25 Icons of IP by Law360, one of the 50 Most Influential People in IP by Managing Intellectual Property, one of the Top 50 IP Trailblazers and Pioneers and one of the 100 Most Influential Lawyers in America by The National Law Journal and being inducted into the IP Hall of Fame by IAM in 2012.\n\nPrior to leading the USPTO, Mr Kappos served as IBM’s chief IP lawyer from 2003 to 2009. In that capacity, he managed all global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles such as litigation counsel and Asia-Pacific IP counsel, where he led all aspects of IP protection, including licensing and transactions support for the region.\n\nFrom 2009 to 2013, Mr Kappos served as undersecretary of commerce and director of the USPTO. In that role, he advised the president, the secretary of commerce and the administration on IP policy matters. Mr Kappos led the agency in dramatically re-engineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the US patent system in generations through the passage and implementation of the Leahy-Smith America Invents Act 2011.\n\nDavid J Kappos is a partner at Cravath, Swaine & Moore LLP. He is widely recognised as one of the world’s foremost leaders in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices, as well as commercialisation and enforcement of innovation-based assets.\n\nFirm Profile\n\nCravath has been known as one of the premier US law firms for over two centuries. Each of its practices is highly regarded and its lawyers are recognised around the world for their commitment to the representation of their clients’ interests.\n\nIntellectual property is one of Cravath’s core practice areas and a cornerstone of Cravath’s reputation as the firm of choice for clients with respect to their most challenging legal issues, most significant business transactions and most critical disputes. In the 19th century, the firm handled the telegraph patent litigation for Samuel Morse and mechanical reaper patent matters for Cyrus McCormick. Today, the firm’s expertise covers the entire innovation marketplace, spanning the consumer products, energy, healthcare, media and entertainment, pharmaceuticals, retail, technology and telecommunications industries, among others. Cravath also advises on matters in connection with emerging technologies, including artificial intelligence, blockchain and fintech, as well as data security and privacy issues.\n\nCravath’s strength in intellectual property stems in part from the firm’s unique culture. Cravath’s lawyers are trained as generalists and, over time, as partners, many focus on and deepen their expertise in specific areas. As a result, Cravath has a dedicated team of IP practitioners with an extensive understanding of patent and other issues, as well as experience in a broad range of trial and transactional work, which enables them to devise creative and commercially practicable solutions to complex problems. Cravath’s governance as a true partnership ensures that all clients receive the benefit of the firm’s overall knowledge, expertise and experience.\n\nCorporate IP practice\n\nCravath has a broad-based corporate IP practice representing clients ranging from early-stage start-ups to global companies in contexts across the full spectrum of IP disciplines, technologies and jurisdictions. Its lawyers work hand in glove with the firm’s premier M&A and financing teams to handle the many IP issues that arise in complex transactions, including issues relating to patents, trademarks, copyright, data, trade secrets, privacy and information security. In addition, Cravath provides strategic counselling, review and analysis in developing and managing IP portfolios, commercialising innovation-based assets and optimising IP rights to ensure its clients are maximising value from their intellectual property in the United States and in non-US markets.\n\nLitigation IP practice\n\nRepresenting both plaintiffs and defendants at the trial level, on appeal, in investigations or in an advisory capacity, Cravath’s litigators are adept at handling a wide variety of matters involving patents, trade secrets, copyright and trademarks, as well as the commercial litigation that frequently arises from IP matters, such as antitrust and breach of licence claims. Whatever the subject matter at issue, the firm’s litigators bring to each case a trial lawyer’s courtroom perspective and deep trial expertise in a variety of matters. As a result, clients turn to Cravath to protect them from infringement of their most important intellectual property or to defend valuable products against claims of infringement. Cravath has supervised and coordinated IP disputes that span the entire globe. The firm regularly advises on national and worldwide IP strategy and the identification of patents and other assets that can be used effectively for offensive or defensive purposes. Its practice also includes participation in inter partes review matters.\n\nInternational clients\n\nCravath regularly advises clients based outside the United States on a wide range of transactions, including cross-border mergers and acquisitions, international capital markets and bank financings, general corporate and Securities and Exchange Commission compliance matters. Its lawyers also handle US litigation, international arbitrations and investigations for non-US clients, and plan, coordinate and supervise multinational proceedings. The firm works closely with a network of leading law firms in major international markets, each of which has demonstrated a commitment to achieving the same high standards that clients expect from Cravath.\n\nCravath and its lawyers have been recognised as leaders in intellectual property by numerous industry publications, including Chambers USA, Chambers Global, The Legal 500 US, Benchmark Litigation, The Best Lawyers in America, Law360, Managing Intellectual Property, U.S. News-Best Lawyers’ Best Law Firms and IAM."}, {"url": "https://ipwatchdog.com/people/david-kappos/", "page_content": "David Kappos is a Co-Chair of Cravath‘s Intellectual Property Practice. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters. Mr. Kappos led the Agency in dramatically reengineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy-Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel, where he led all aspects of IP protection, including licensing, transactions support and M&A activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was also honored as the inaugural recipient of IPWatchdog’s Paul Michel Award in 2021. Mr. Kappos was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Global Leaders, IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, LMG Life Sciences, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation and on the Advisory Board for C-IP2. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an Adjunct Professor at Cornell Law School, where he teaches legal advising for the start-up general counsel."}, {"url": "https://www.pli.edu/faculty/david-j.-kappos-i607870", "page_content": "Biography\n\nDavid J. Kappos is a partner at Cravath. He is a leader in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters and was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the 2011 Leahy-Smith America Invents Act.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, including as Vice President and Assistant General Counsel for Intellectual Property from 2003 to 2009. In that capacity, he managed global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel.\n\nMr. Kappos has received numerous accolades for his contributions to the field of IP, including being named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in IP” by Managing IP, one of the “Top 50 IP Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “IP Professional of the Year” by the Intellectual Property Owners Association and being inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation. He is a member of the Advisory Board of ORoPO Foundation and Chair of the Advisory Council of the Naples Roundtable. Additionally, Mr. Kappos is the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an adjunct professor at Columbia Law School, where he teaches copyright litigation, and Cornell Law School, where he teaches legal advising for the start-up general counsel.\n\nMr. Kappos received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.iam-media.com/authors/david-j-kappos", "page_content": "David J Kappos\n\nPartner\n\n[email protected]\n\nDavid J Kappos is Co-Chair of the Intellectual Property Practice. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation‑based assets. Mr. Kappos supports Cravath’s clients with a wide range of their most complex intellectual property issues, including those pertaining to blockchain and financial technology (FinTech) as well as data security and privacy.\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically re‑engineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy‑Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was also honored as the inaugural recipient of IPWatchdog’s Paul Michel Award in 2021. Mr. Kappos was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Global Leaders, IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, LMG Life Sciences, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation and on the Advisory Board for C-IP2. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.‑China IP Cooperation Dialogue. He is also an Adjunct Professor at Cornell Law School, where he teaches legal advising for the start‑up general counsel.\n\nMr. Kappos was born in Palos Verdes, California. He received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.patentbaristas.com/archives/2009/06/19/ibms-david-kappos-to-be-nominated-as-under-secretary-of-commerce/", "page_content": "President Barack Obama has announced his intent to nominate David J. Kappos as Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office.\n\nAccording to the press release:\n\nMr. Kappos is Vice President and Assistant General Counsel, Intellectual Property Law, for IBM Corporation. Based in Armonk, New York, Mr. Kappos directs IBM’s Intellectual Property Law function, providing legal counsel over all facets of protecting and licensing IBM’s intellectual property assets and leading IBM’s engagement of intellectual property law policy issues. In particular, Mr. Kappos is responsible for the management of IBM’s patent and trademark portfolios; protecting and licensing intellectual property (patents, copyrights, trademarks, know-how and technology) worldwide; directing intellectual property law operations relating to the research, services, consulting, computer systems, storage products, semiconductor and technology development, software, marketing and other groups, divisions, and entities within IBM. In addition, Mr. Kappos has responsibility for IP policy and coordination with IBM’s litigation and corporate development groups in matters relating to intellectual property. Mr. Kappos serves on the Board of Directors of the American Intellectual Property Law Association, the Intellectual Property Owners Association, and the International Intellectual Property Society. He is also the Vice President of the Intellectual Property Owners Association. He has held various previous leadership positions in intellectual property law associations in Asia and the U.S. He has spoken widely in Asia, Europe, and the U.S. on intellectual property topics. Mr. Kappos received his Bachelor of Science Degree in Electrical and Computer Engineering from the University of California Davis in 1983, and his law degree from the University of California Berkeley in 1990. He joined IBM in 1983 as a Development Engineer and has served as an Intellectual Property Law attorney in IBM’s Storage Division and Litigation group, as IP Law Counsel in IBM Software Group, as Assistant General Counsel in IBM Asia/Pacific, IBM Corporate Counsel and as Assistant General Counsel prior to his current position.\n\nThis is sure to be a blow to Gene Quinn, of IPWatchdog, who nominated Alfred E. Neuman for PTO Director. Gene’s rationale:\n\nA character like Al Neuman would be perfect because he wouldn’t (and couldn’t) get in the way of the progress being made by the quite able members of the PTO senior management team who are doing what is necessary to move the PTO forward. Amazing what can be accomplished without having the watchful eye (and meddling) of a political appointment.\n\nThe Coalition for Patent Fairness (CPF) has already issued the its statement regarding the nomination of Kappos as Undersecretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office:\n\nThe PTO has an important role to play in fostering an economic environment that promotes American innovation and global competitiveness, spurs new product development and creates jobs here in the United States. As leading U.S. patent holders, we look forward to the opportunity to work with Mr. Kappos in helping the PTO fulfill that important responsibility. We support President Obama’s call for reforms to the US patent system that will spur innovation and job creation.\n\nThe IAM Blog thinks Kappos is good news for the USPTO and the wider IP community:\n\nFor my part, I think he will do an excellent job. He knows the issues; he has a strong IP background; he comes from an industry in which IP is hugely important; he knows all the major players; he has long management experience; and he thinks deeply about IP and its role in society. Frankly, I cannot think of anyone better to do the job. He is not perfect, but who is? President Obama has made a good choice.\n\nDennis Crouch at Patently-O is excited:\n\nAs someone who writes daily about US Patent Law, I am excited about the Kappos nomination because he is likely to open access to previously hidden data and information. He will also work to create systems that work and measures that are meaningful. I suspect that the biggest challenge for Mr. Kappos will be moving beyond the unique IBM perspective. Big Blue is an atypical patent owner in its internal systems, patenting volume, and licensing power. As I discussed earlier, it will be important for him to spend time understanding how the rest of the patent community operates.\n\nBiotechnology Industry Organization (BIO) President and CEO Jim Greenwood gave Kappos a thumbs up:\n\nWe believe Mr. Kappos will bring a thoughtful perspective to the Department of Commerce and the USPTO. He has a long history of industry experience, providing a point of view and insights we have always thought to be highly valuable in this position. He also has a demonstrated track record of managing a large organization, and a true appreciation for industrial innovation. As a prominent and respected member of the patent community, Mr. Kappos brings much goodwill to this position. We look forward to working with him and his leadership team over the coming years.\n\nThe Patent Prospector questions the nomination given that IBM has submitted some questionable patent applications (citing its 2009/0119,148 application for “enhancing productivity,” which appears to claims claims using shorter hours to facilitate shorter meetings):\n\nPresident Obama announced today nominees for two related governmental posts: Director, Office of Civilian Radioactive Waste Management, Department of Energy; and Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office. Warren F. “Pete” Miller, Jr., a part-time Professor at Texas A&M University, got the easier job. Managing the real radioactive waste went to David J. Kappos, who, as long-time corporate mook, has shaped IBM patent policy, publicly spouting horse hockey in the process. People have been known to rise to a position, garnering dignity. Let’s hope these boys are up to the job of containing the waste."}, {"url": "https://theorg.com/org/partnership-for-public-service/org-chart/david-j-kappos", "page_content": "About\n\nDavid J. Kappos is a partner at Cravath. Kappos supports the firm’s clients with a wide range of their most complex intellectual property issues.\n\nFrom August 2009 to January 2013, Kappos served as undersecretary of commerce and director of the United States Patent and Trademark Office. In that role, he advised the president, secretary of commerce and the administration on intellectual property policy matters. As director of the USPTO, he led the agency in dramatically reengineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations, through passage and implementation of the Leahy Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Kappos served more than 25 years at IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s vice president and assistant general counsel for intellectual property. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. He also served as litigation counsel and Asia Pacific IP counsel, leading all aspects of intellectual property protection for the Asia/Pacific region. Kappos joined IBM as a development engineer.\n\nKappos has received numerous recognitions, including induction into the Intellectual Property Hall of Fame by Intellectual Asset Management magazine, being named one of the 50 most influential people in intellectual property by Managing IP magazine, and being named intellectual property professional of the year by the Intellectual Property Owners Association in 2011.\n\nKappos was born in Palos Verdes, California. He received a B.S. summa cum laude in electrical and computer engineering from the University of California, Davis, in 1983, and a J.D. from the University of California, Berkeley, in 1990."}, {"url": "https://www-dev2.law.columbia.edu/faculty/david-kappos", "page_content": "David J. Kappos is a partner at Cravath, Swaine & Moore LLP.\n\nHe is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues.\n\nFrom August 2009 to January 2013, Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). Prior to leading the USPTO, he held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s vice president and assistant general counsel for intellectual property. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. He joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nKappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI).\n\nKappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise, and the Intellectual Property Owners Educational Foundation.\n\nHe received his B.S. in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.fedsoc.org/contributors/david-kappos", "page_content": "Please Enable Cookies\n\nwww.fedsoc.org is using a security service for protection against online attacks. The service requires full cookie support in order to view this website.\n\nPlease enable cookies on your browser and try again."}], "David Kappos was responsible for IBM's strategic IP transactions.": [{"url": "https://www.uspto.gov/about-us/david-j-kappos", "page_content": "2009-2013\n\nDavid J. Kappos was born in 1961 in Palos Verdes, California. He was educated at the University of California, Davis, where he earned a Bachelor of Science in electrical and computer engineering, and the University of California, Berkeley, where he earned a Doctorate of Jurisprudence.\n\nKappos spent more than 25 years at IBM. As counsel in the area of global intellectual property (IP) protection, he oversaw the protection of the firm’s IP in the Asia-Pacific region. Then, in 2003, he became IBM’s chief IP lawyer. Attaining the rank of Vice President and Assistant General Counsel, Intellectual Property Law, he managed IBM’s patent and trademark portfolios.\n\nIn 2009, President Barack Obama nominated Kappos for the position of Under Secretary of Commerce for Intellectual Property and Director of the USPTO. The Senate confirmed Kappos’s appointment on August 13, 2009. As Director, Kappos prioritized the strategic navigation of a severe recession, the implementation of the Leahy-Smith America Invents Act (AIA), and the reduction of pendency intervals (the amount of time between an applicant's submitting an application and receiving a decision).\n\nIn response to financial pressures resulting from the recession (2007-2009) and a decline in business activity for the agency, the USPTO froze hiring and scaled back programs where possible. The outlook brightened in 2011 when Congress passed the AIA, which Director Kappos helped to shape. He then set to work implementing the Act’s provisions, including the establishment of the Patent Trial and Appeal Board, and restarting expansions and initiatives that had been interrupted by the recession.\n\nMeanwhile, Director Kappos and the USPTO succeeded in reducing pendency by several months. The number of unexamined utility patent applications shrank, too, as the backlog fell from about 750,000 in 2009 to about 609,000 in 2013. In the same period, the Trademark organization exceeded its targets for action and final pendency. In pursuit of greater efficiency, Director Kappos pushed for the replacement of antiquated information technology, reengineering many of the systems and processes that kept patent and trademark applications moving.\n\nUnder Director Kappos’s leadership, new offices and institutions arrived that proved to be lasting. The USPTO gained a Chief Economist and its first permanent satellite location, the Elijah J. McCoy Midwest Regional Office in Detroit, Michigan.\n\nOther major milestones under Director Kappos’s leadership include the issuance of patent 8 million and the attainment of fifth place for employee satisfaction among the 300-plus federal agency and agency subcomponents surveyed by the Partnership for Public Service in 2012. The USPTO had risen steadily in these rankings from 172nd place in 2009, just before Kappos assumed office, to first place, shortly after his departure.\n\nFurther reading\n\nDavid J. Kappos. Cravath, Swaine & Moore LLP. Accessed June 15, 2021.\n\nUnited States Patent and Trademark Office FY 2009 Performance and Accountability Report. USPTO. November 2009.\n\nUnited States Patent and Trademark Office FY 2010 Performance and Accountability Report. USPTO. November 2010.\n\nUnited States Patent and Trademark Office FY 2011 Performance and Accountability Report. USPTO. November 2011.\n\nUnited States Patent and Trademark Office FY 2012 Performance and Accountability Report. USPTO. November 2012.\n\nUnited States Patent and Trademark Office FY 2013 Performance and Accountability Report. USPTO. November 2013.\n\nThe White House, Office of the Press Secretary. President Obama Announces More Key Administration Posts, 6-18-09. Press release. June 18, 2009."}, {"url": "https://itif.org/person/david-kappos/", "page_content": "David J. Kappos is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation‑based assets. Mr. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues, including those pertaining to blockchain and financial technology (FinTech) as well as data security and privacy.\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically re‑engineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy‑Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region."}, {"url": "https://www.iam-media.com/rankings/patent-1000/profile/person/david-j-kappos", "page_content": "When you need the best of the best for the highest-priority patent deals and disputes, Cravath is at the top of a very short list of firms. It is uniquely set up: its lawyers receive the highest quality generalist training but develop specialisation over time, granting them the pliability to deal with any issue, along with enhanced problem-solving and creative thinking skills and deep substantive knowledge of the relevant issues. Among them are several eminent trial lawyers, including Keith Hummel , Evan Chesler , David Marriott and Sharonmoyee Goswami : Hummel is ingenious, resourceful, resolute and unflagging – there is nothing he cannot do when it comes to complex legal conflict. So, too, Chesler, who is referred to in reverent tones as “godlike in litigation”. He continues to work closely with Marriott – they valiantly battled Apple on Qualcomm’s behalf – and is currently representing short-form streaming start-up Quibi and consumer technology holding company WndrCo alongside him in consolidated patent infringement and trade secret litigation against Israeli technology company JBF Interlude. Marriott has proven his mettle in many high-profile IP, antitrust and securities cases. Goswami is the rising star of the practice and comes in for special praise: “Sharon is extremely strategic and detail-oriented and knows how to position cases to maximise chances of success. She has a sense of self and purpose about her and is highly collaborative, with a unique ability to work seamlessly across multiple teams.” One of the top IP experts, not just at Cravath but in the world, corporate partner David Kappos anchors a leading transactions practice. He gets the biggest deals done before tea time but also devotes mental energy to crystal-ball gazing; he has an uncannily accurate sense of where things are heading – what the policy issues will be and where commercial opportunities will arise – making his behind-the-scenes strategic counsel utterly priceless.\n\nMr Kappos received a BS summa cum laude in electrical and computer engineering from the University of California, Davis in 1983 and a JD from the University of California, Berkeley in 1990.\n\nMr Kappos has received numerous accolades for his contributions to the field of intellectual property, including being named one of the Top 25 Icons of IP by Law360, one of the 50 Most Influential People in IP by Managing Intellectual Property, one of the Top 50 IP Trailblazers and Pioneers and one of the 100 Most Influential Lawyers in America by The National Law Journal and being inducted into the IP Hall of Fame by IAM in 2012.\n\nPrior to leading the USPTO, Mr Kappos served as IBM’s chief IP lawyer from 2003 to 2009. In that capacity, he managed all global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles such as litigation counsel and Asia-Pacific IP counsel, where he led all aspects of IP protection, including licensing and transactions support for the region.\n\nFrom 2009 to 2013, Mr Kappos served as undersecretary of commerce and director of the USPTO. In that role, he advised the president, the secretary of commerce and the administration on IP policy matters. Mr Kappos led the agency in dramatically re-engineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the US patent system in generations through the passage and implementation of the Leahy-Smith America Invents Act 2011.\n\nDavid J Kappos is a partner at Cravath, Swaine & Moore LLP. He is widely recognised as one of the world’s foremost leaders in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices, as well as commercialisation and enforcement of innovation-based assets.\n\nFirm Profile\n\nCravath has been known as one of the premier US law firms for over two centuries. Each of its practices is highly regarded and its lawyers are recognised around the world for their commitment to the representation of their clients’ interests.\n\nIntellectual property is one of Cravath’s core practice areas and a cornerstone of Cravath’s reputation as the firm of choice for clients with respect to their most challenging legal issues, most significant business transactions and most critical disputes. In the 19th century, the firm handled the telegraph patent litigation for Samuel Morse and mechanical reaper patent matters for Cyrus McCormick. Today, the firm’s expertise covers the entire innovation marketplace, spanning the consumer products, energy, healthcare, media and entertainment, pharmaceuticals, retail, technology and telecommunications industries, among others. Cravath also advises on matters in connection with emerging technologies, including artificial intelligence, blockchain and fintech, as well as data security and privacy issues.\n\nCravath’s strength in intellectual property stems in part from the firm’s unique culture. Cravath’s lawyers are trained as generalists and, over time, as partners, many focus on and deepen their expertise in specific areas. As a result, Cravath has a dedicated team of IP practitioners with an extensive understanding of patent and other issues, as well as experience in a broad range of trial and transactional work, which enables them to devise creative and commercially practicable solutions to complex problems. Cravath’s governance as a true partnership ensures that all clients receive the benefit of the firm’s overall knowledge, expertise and experience.\n\nCorporate IP practice\n\nCravath has a broad-based corporate IP practice representing clients ranging from early-stage start-ups to global companies in contexts across the full spectrum of IP disciplines, technologies and jurisdictions. Its lawyers work hand in glove with the firm’s premier M&A and financing teams to handle the many IP issues that arise in complex transactions, including issues relating to patents, trademarks, copyright, data, trade secrets, privacy and information security. In addition, Cravath provides strategic counselling, review and analysis in developing and managing IP portfolios, commercialising innovation-based assets and optimising IP rights to ensure its clients are maximising value from their intellectual property in the United States and in non-US markets.\n\nLitigation IP practice\n\nRepresenting both plaintiffs and defendants at the trial level, on appeal, in investigations or in an advisory capacity, Cravath’s litigators are adept at handling a wide variety of matters involving patents, trade secrets, copyright and trademarks, as well as the commercial litigation that frequently arises from IP matters, such as antitrust and breach of licence claims. Whatever the subject matter at issue, the firm’s litigators bring to each case a trial lawyer’s courtroom perspective and deep trial expertise in a variety of matters. As a result, clients turn to Cravath to protect them from infringement of their most important intellectual property or to defend valuable products against claims of infringement. Cravath has supervised and coordinated IP disputes that span the entire globe. The firm regularly advises on national and worldwide IP strategy and the identification of patents and other assets that can be used effectively for offensive or defensive purposes. Its practice also includes participation in inter partes review matters.\n\nInternational clients\n\nCravath regularly advises clients based outside the United States on a wide range of transactions, including cross-border mergers and acquisitions, international capital markets and bank financings, general corporate and Securities and Exchange Commission compliance matters. Its lawyers also handle US litigation, international arbitrations and investigations for non-US clients, and plan, coordinate and supervise multinational proceedings. The firm works closely with a network of leading law firms in major international markets, each of which has demonstrated a commitment to achieving the same high standards that clients expect from Cravath.\n\nCravath and its lawyers have been recognised as leaders in intellectual property by numerous industry publications, including Chambers USA, Chambers Global, The Legal 500 US, Benchmark Litigation, The Best Lawyers in America, Law360, Managing Intellectual Property, U.S. News-Best Lawyers’ Best Law Firms and IAM."}, {"url": "https://ipwatchdog.com/people/david-kappos/", "page_content": "David Kappos is a Co-Chair of Cravath‘s Intellectual Property Practice. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters. Mr. Kappos led the Agency in dramatically reengineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy-Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel, where he led all aspects of IP protection, including licensing, transactions support and M&A activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was also honored as the inaugural recipient of IPWatchdog’s Paul Michel Award in 2021. Mr. Kappos was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Global Leaders, IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, LMG Life Sciences, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation and on the Advisory Board for C-IP2. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an Adjunct Professor at Cornell Law School, where he teaches legal advising for the start-up general counsel."}, {"url": "https://www.iam-media.com/authors/david-j-kappos", "page_content": "David J Kappos\n\nPartner\n\n[email protected]\n\nDavid J Kappos is Co-Chair of the Intellectual Property Practice. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation‑based assets. Mr. Kappos supports Cravath’s clients with a wide range of their most complex intellectual property issues, including those pertaining to blockchain and financial technology (FinTech) as well as data security and privacy.\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically re‑engineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy‑Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Global Agenda Council Vision Award for the Intellectual Property Council’s pro bono initiative from the World Economic Forum, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI). He was also honored as the inaugural recipient of IPWatchdog’s Paul Michel Award in 2021. Mr. Kappos was named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in Intellectual Property” and the “Outstanding Practitioner of the Year in IP Transactions” by Managing IP, one of the “Top 50 Intellectual Property Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “Intellectual Property Professional of the Year” by the Intellectual Property Owners Association and inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012. Mr. Kappos was also recognized as a leading lawyer by IAM Global Leaders, IAM Strategy 300, IAM Patent 1000, World IP Review, The Legal 500 US, Who’s Who Legal: Patents, LMG Life Sciences, Lawdragon, Super Lawyers and The Best Lawyers in America. He is a frequent speaker and has authored many published articles on various intellectual property, innovation and leadership topics.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation and on the Advisory Board for C-IP2. He is the Chair of the Advisory Council of the Naples Roundtable, and the U.S. Chair of the U.S.‑China IP Cooperation Dialogue. He is also an Adjunct Professor at Cornell Law School, where he teaches legal advising for the start‑up general counsel.\n\nMr. Kappos was born in Palos Verdes, California. He received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://cip2.gmu.edu/about/advisory-board/david-j-kappos/", "page_content": "Advisory Board Member\n\nDavid J. Kappos\n\nPartner, Cravath, Swaine & Moore LLP, New York;\n\nFormer Director, U.S. Patent & Trademark Office\n\nDavid J. Kappos is a partner at Cravath. He is a leader in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices as well as commercialization and enforcement of innovation-based assets. From 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters. Mr. Kappos led the Agency in dramatically reengineering its entire management and operational systems and its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy-Smith America Invents Act, signed into law by President Obama in September 2011.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s chief intellectual property lawyer. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection and exploitation. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel, where he led all aspects of IP protection, including licensing, transactions support and M&A activity for the Asia/Pacific region."}, {"url": "https://www.pli.edu/faculty/david-j.-kappos-i607870", "page_content": "Biography\n\nDavid J. Kappos is a partner at Cravath. He is a leader in the field of intellectual property, including IP management and strategy, the development of global IP norms, laws and practices as well as commercialization and enforcement of innovation-based assets.\n\nFrom 2009 to 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the U.S. Patent and Trademark Office (USPTO). In that role, he advised the President, the Secretary of Commerce and the Administration on IP policy matters and was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the 2011 Leahy-Smith America Invents Act.\n\nPrior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, including as Vice President and Assistant General Counsel for Intellectual Property from 2003 to 2009. In that capacity, he managed global IP activities for IBM. During his more than 25 years at IBM, he also served in a variety of other roles including litigation counsel and Asia Pacific IP counsel.\n\nMr. Kappos has received numerous accolades for his contributions to the field of IP, including being named one of the “Top 25 Icons of IP” by Law360, one of the “50 Most Influential People in IP” by Managing IP, one of the “Top 50 IP Trailblazers & Pioneers” and one of the “100 Most Influential Lawyers in America” by The National Law Journal, “IP Professional of the Year” by the Intellectual Property Owners Association and being inducted into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine in 2012.\n\nMr. Kappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise and the Intellectual Property Owners Education Foundation. He is a member of the Advisory Board of ORoPO Foundation and Chair of the Advisory Council of the Naples Roundtable. Additionally, Mr. Kappos is the U.S. Chair of the U.S.-China IP Cooperation Dialogue. He is also an adjunct professor at Columbia Law School, where he teaches copyright litigation, and Cornell Law School, where he teaches legal advising for the start-up general counsel.\n\nMr. Kappos received a B.S. summa cum laude in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.fedsoc.org/contributors/david-kappos", "page_content": "Please Enable Cookies\n\nwww.fedsoc.org is using a security service for protection against online attacks. The service requires full cookie support in order to view this website.\n\nPlease enable cookies on your browser and try again."}, {"url": "https://www.law.columbia.edu/faculty/david-kappos", "page_content": "David J. Kappos is a partner at Cravath, Swaine & Moore LLP.\n\nHe is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues.\n\nFrom August 2009 to January 2013, Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). Prior to leading the USPTO, he held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s vice president and assistant general counsel for intellectual property. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. He joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nKappos has received numerous accolades for his contributions to the field of intellectual property, including, among others, the 2014 Jefferson Medal from the New Jersey Intellectual Property Law Association (NJIPLA), the 2013 Board of Director’s Excellence Award from the American Intellectual Property Law Association (AIPLA), the 2013 Champion of Intellectual Property Award from the District of Columbia Bar Association and the 2013 North America Government Leadership Award from Semiconductor Equipment and Materials International (SEMI).\n\nKappos serves on the Boards of Directors of the Partnership for Public Service, the Center for Global Enterprise, and the Intellectual Property Owners Educational Foundation.\n\nHe received his B.S. in Electrical and Computer Engineering from the University of California, Davis in 1983 and a J.D. from the University of California, Berkeley in 1990."}, {"url": "https://www.thecge.net/team/david-j-kappos/", "page_content": "David J. Kappos is a partner at Cravath. He is widely recognized as one of the world’s foremost leaders in the field of intellectual property, including intellectual property management and strategy, the development of global intellectual property norms, laws and practices as well as commercialization and enforcement of innovation-based assets. Mr. Kappos supports the Firm’s clients with a wide range of their most complex intellectual property issues.\n\nFrom August 2009 to January 2013, Mr. Kappos served as Under Secretary of Commerce and Director of the United States Patent and Trademark Office (USPTO). In that role, he advised the President, Secretary of Commerce and the Administration on intellectual property policy matters. As Director of the USPTO, he led the Agency in dramatically reengineering its entire management and operational systems as well as its engagement with the global innovation community. He was instrumental in achieving the greatest legislative reform of the U.S. patent system in generations through passage and implementation of the Leahy-Smith America Invents Act, signed into law by the President in September 2011. Prior to leading the USPTO, Mr. Kappos held several executive posts in the legal department of IBM, the world’s largest patent holder. From 2003 to 2009, he served as the company’s Vice President and Assistant General Counsel for Intellectual Property. In that capacity, he managed global intellectual property activities for IBM, including all aspects of patent, trademark, copyright and trade secret protection. Mr. Kappos joined IBM as a development engineer. During his more than 25 years at IBM, he served in a variety of roles including litigation counsel and Asia Pacific IP counsel, based in Tokyo, Japan, where he led all aspects of intellectual property protection, including licensing, transactions support and mergers and acquisitions activity for the Asia/Pacific region.\n\nMr. Kappos has received numerous recognitions, including induction into the Intellectual Property Hall of Fame by Intellectual Asset Management Magazine, being named one of the 50 most influential people in intellectual property by Managing IP, and being named intellectual property professional of the year by the Intellectual Property Owners Association in 2011.\n\nBack to Leadership"}]}