{"Akila Dananjaya made his international debut for the Sri Lankan cricket team in August 2018.": [{"url": "https://www.espncricinfo.com/cricketers/akila-dananjaya-574178", "page_content": "Another instalment from Sri Lanka's production line of unorthodox spinners, Akila Dananjaya sparked controversy when he was picked in the preliminary squad for the 2012 T20 World Cup despite never having played a professional match in his life. Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner with astounding control, he had impressed Sri Lanka captain Mahela Jayawardene so much as a net bowler at a practice session that Jayawardene requested he be fast-tracked to the national squad.\n\nDananjaya played three matches of the World Cup, including the final, but went out of favour with the selectors once Jayawardene stepped down from the captaincy.\n\nHe made his comeback in 2017, and took a six-for against India in an ODI that year, and another against South Africa in 2018. In between he made a successful entry into Test cricket, taking four five-wicket hauls in his first six Tests.\n\nIn September 2019, Dananjaya was banned from bowling in international cricket for 12 months because of an illegal bowling action. His return was dramatic - in a T20I in Antigua in March 2021, he took a hat-trick in one over but was carted for six sixes by Kieron Pollard in his next."}, {"url": "https://www.wikiwand.com/en/Akila_Dananjaya", "page_content": "Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera (Sinhala: අකිල ධනංජය; born 4 October 1993), popularly as Akila Dananjaya, is a professional Sri Lankan cricketer, who played all forms of the game for the national team. In March 2021, he became the first bowler to take hat-trick and be hit for the maximum of six sixes in an over in the same match, by Kieron Pollard against West Indies .[1]\n\nSri Lankan cricketer\n\nQuick facts: Personal information, Full name, Born, H... ▼\n\nIn December 2018, he was suspended from bowling in international matches after his bowling action was deemed to be illegal, which was later corrected to play in March 2019.[2] However, in September 2019, the International Cricket Council (ICC) suspended Dananjaya from bowling in international matches for twelve months after his bowling action was once again deemed to be illegal, a penalty received for failing a biomechanics assessment twice within a two-year period.[3] He was cleared to bowl in international cricket again on 8 January 2021.[4]"}, {"url": "https://www.sportskeeda.com/cricket/sri-lankan-spinner-akila-dananjaya-cleared-to-bowl-in-international-cricket", "page_content": "The International Cricket Council (ICC) on Friday informed that Sri Lanka spinner Akila Dananjaya can start bowling in international cricket again after remedial work on his bowling action and re-assessment of the same.\n\nAkila Dananjaya was banned from bowling for one year in September 2019 after he was reported during a Test match against New Zealand in Galle. His suspension ended in August 2020.\n\nReleasing a statement on Akila Dananjaya, the ICC said:\n\n\"Following remedial work and re-assessment, the bowling action of Sri Lanka spinner Akila Dananjaya has been found to be legal, and he can resume bowling in international cricket.”\n\nAlthough Dananjaya’s suspension ended in August 2020, he still needed to prove to the ICC that his remodeled action complied with the maximum limit of 15 degrees of elbow flexion.\n\nSince travelling to ICC-accredited biomechanics lab wasn’t allowed owing to COVID-19 restrictions, Akila Dananjaya was cleared by a panel that went through video footage of the spinner’s remodeled action provided by Sri Lanka Cricket. The ICC release further informed:\n\n\"An Expert Panel studied video footage of Dananjaya's bowling action provided by Sri Lanka Cricket, as attendance and assessment at an ICC accredited centre was not possible due to various restrictions resulting from Covid-19.\"\n\nThe International Cricket Council (ICC) today announced that following remedial work and re-assessment, the bowling action of Sri Lanka spinner Akila Dananjaya has been found to be legal, and he can resume bowling in international cricket.https://t.co/RlNVVe4dqe — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) January 8, 2021\n\nThe panel, after studying the provided footage carefully, came to the conclusion that the elbow extension in his new bowling action was \"within the 15-degree level of tolerance\" allowed as per the ICC regulations.\n\nThe ICC statement further informed:\n\n\"To assist the match officials, they will be provided with the report, images and video footage of the bowler's remodeled legal bowling action.\"\n\nAkila Dananjaya’s international stats\n\n27-year-old Akila Dananjaya made his international debut in a T20I against New Zealand back in September 2012. His ODI debut followed a couple of months later against the same opponent, but he had to wait until February 2018 before he made his Test debut, against Bangladesh at Dhaka.\n\nPrior to his suspension, Akila Dananjaya featured in six Tests, 36 ODIs and 22 T20Is, claiming 33, 51 and 22 wickets respectively. The slow bowler, who has an ODI fifty to his name, last featured for Sri Lanka in a T20I against New Zealand in September 2019.\n\nHe finished with impressive figures of 2 for 28 in Lanka’s 37-run triumph. This was the same match in which Lasith Malinga picked up four wickets in four balls.\n\nPoll : 0 votes"}, {"url": "https://www.cricbuzz.com/profiles/8483/akila-dananjaya", "page_content": "\n\nFull profile Sri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mah...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 6 10 2 135 43 16.88 254 53.15 0 0 0 14 0 ODI 39 30 6 291 50 12.12 417 69.78 0 0 1 25 3 T20I 31 15 7 61 11 7.62 71 85.92 0 0 0 6 0 IPL 1 1 1 4 4 0.0 5 80.0 0 0 0 0 0\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 6 12 1385 819 33 6/115 8/44 3.55 24.82 41.97 4 0 ODI 39 37 1935 1661 56 6/29 6/29 5.15 29.66 34.55 2 0 T20I 31 31 665 909 28 3/36 3/36 8.2 32.46 23.75 0 0 IPL 1 1 24 47 0 0/47 0/47 11.75 0.0 0.0 0 0\n\nCareer Information\n\nProfile\n\nSri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mahela Jayawardene was so impressed by the youngsters control of the googly, carrom ball, leg-break, doosra and off-spinner, that he convinced the selectors to fast track him to the national side. Dananjaya did not disappoint as he played 4 games and picked up 7 wickets at an average of 13 and an economy under 7.\n\n\n\nHowever, he only played one more game before being dropped. He was also overlooked for the 2014 T20 World Cup in Bangladesh. With the success in the T20 World Cup, Dananjaya was snapped up by the Chennai Super Kings during the 2013 edition for $20,000.\n\n\n\nRevolving doors of Sri Lankan cricket meant that Dhananjaya could never settle himself in the national team. Having played a handful of T20Is, he found himself completely out of favour with the national selectors for four long years. He was eventually recalled to the national team during the home season of 2017 and promptly made an immediate impact, grabbing career-best figures of four for 47 against the visiting Zimbabweans. It wasn't an one-off achievement, two days after his marriage, he claimed six for 54 against India, thereby cementing his place for the immediate future."}, {"url": "https://www.sportskeeda.com/player/akila-dananjaya", "page_content": "Akila Dananjaya: A Brief Biography\n\nAkila Dananjaya Biography\n\n\n\n\n\nAkila Dananjaya is a Sri Lankan cricketer, who plays the limited overs format in the national team. He was born on 4 October 1993 in the Panadura region of Sri Lanka. The 5 feet 7 inches tall bowls right-arm off the break and is considered as a bowling all-rounder.\n\n\n\n\n\nBackground\n\n\n\n\n\nDananjaya talents were spotted by former Sri Lankan captain Mahela Jayawardene when he was bowling at the nets for Wayamba United during the inaugural Sri Lanka Premier League.\n\n\n\n\n\nAs a result, Dananjaya was roped in by the team for that edition of the tournament. He performed phenomenally in the second match itself as he took 3/18 against Nagenahira Nagas.\n\n\n\n\n\nDebut\n\n\n\n\n\nThe Sri Lankan made his international debut in the year 2012 and was selected in the Sri Lanka squad for the 2012 ICC World Twenty20.\n\n\n\n\n\nThe 18-year old played his first game in front of his home crowd in Kandy, when he played against the Kiwis. He picked up two wickets in the match.\n\n\n\n\n\nHe made to the ODI squad later that year against the same opponents in the year 2012. However, the match was washed out due to rain and he could not bowl a single delivery.\n\n\n\n\n\nDananjaya played his first ODI match only in June 2017 against Zimbabwe.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nAfter coming back to the Lankan set up in 2017, Dananjaya was among the few bright spots in an otherwise dreadful year for Sri Lankan cricket. His performance against India at Pallekele, when he took six wickets to wipe out the Indian middle-order was noteworthy, despite Sri Lanka not being able to close out the game in their favor.\n\n\n\n\n\nLow Point\n\n\n\n\n\nDuring Dananjaya’s debut performance in the T20 cricket, he met with an injury which was a dreadful phase of his life. New Zealand’s batsman, Rob Nicol hit the ball towards the bowler, the ball slipped from Dananjaya’s hands and fractured his cheekbone which led him to miss rest of the tournament.\n\n\n\n\n\nClub Career\n\n\n\n\n\nAkila Dananjaya was sold to the Chennai Super Kings for his base price of $20,000 in the 2013 IPL season."}, {"url": "https://www.cricketerlife.com/akila-dananjaya-biography/", "page_content": "Akila Dananjaya is a Sri Lankan cricketer. He was bron on 4 October 1993 in Panadura, Sri Lanka. His full name is Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera.\n\nHe is a left handed batsman and right arm off break and also leg break googly+Doosra bowler. He play as a bowler in Sri Lankan cricket team. His height is approx 5 feet 7 inches.\n\nAkila Dananjaya married in 2017 with Nethalie Tekshini. His father Moratuwa, Dananjaya is a carpenter. He started his international career for Sri Lankan national cricket team in 2012 vs New Zealand."}, {"url": "https://www.timesnownews.com/sports/cricket/article/icc-bans-sri-lanka-spinner-akila-dananjaya-from-bowling-in-international-cricket-for-one-year/491888", "page_content": "Akila Dananjaya banned from bowling by ICC. | Photo Credit: IANS\n\nKey Highlights Akila Dananjaya has been banned by ICC for illegal bowling action The Sri Lankan spinner has been banned for one year He was reported for suspected bowling action in Test series against New Zealand last month\n\nThe International Cricket Council on Thursday issued a one-year ban on Sri Lankan spinner Akila Dananjaya after he was reported for illegal action during the Test series against New Zealand. This is the second time Dananjaya has been banned from bowling by the ICC after being handed a suspension in December 2018. However, he was later permitted to bowl after making a few changes in his action.\n\nDananjaya's suspicious action came under the scanner of the match officials during the first Test between Sri Lanka and New Zealand in Galle last month. Dananjaya picked up a five-wicket haul in the first innings of the Test match and later finished with a total of six wickets under his belt. He was subsequently reported by the match officials and underwent an independent assessment to check the legality of his bowling action in Chennai on August 29.\n\nThe assessment ruled out that Dananjaya's bowling action was illegal prompting ICC to hand him a 12-month ban. The spinner cannot bowl in international cricket for next one year and can appear for reassessment only after the expiration of the ban. Dananjaya had missed the second Test after being reported for his action.\n\nDananjaya made his international debut for Sri Lanka in September 2012 in a T20I match against New Zealand. He made his Test debut last year against Bangladesh. Since making his debut seven years back, he has played six Tests, 36 ODIs and 22 T20Is for Sri Lanka picking up a total of 106 wickets in international cricket. While he has been relatively successful in the international arena, his action has always remained under the scanner.\n\nIn their two-match series against New Zealand at home, Sri Lanka bagged the first Test comfortably by six wickets before suffering a defeat by an innings and 65 runs in the second game. The series ended in a stalemate with both the teams sharing an equal number of points in the ICC Test Championship."}, {"url": "https://www.sportskeeda.com/cricket/sri-lanka-s-off-break-bowler-akila-dananjaya-suspended-from-international-cricket-for-12-months", "page_content": "What's the story?\n\nAkila Dananjaya the right-arm off-break bowler from Sri Lanka, has received a 12-month-suspension from international cricket after he was reported for suspect action during the first Test match of the Sri Lanka vs New Zealand series played last month. This is the second time in ten months that the Sri Lankan has been reported for suspect action.\n\nThe background\n\nThe 26-year-old spinner from Panadura had come into limelight in 2012 when the then Sri Lankan captain, Mahela Jayawardene had spotted him bowling at the nets for Wayamba United in the Sri Lankan Premier League. He impressed the skipper with his performances and grabbed a place in the T20 squad for the ICC World T20 2012.\n\nThough Dananjaya has not had much success in international cricket, he has been in the headlines for his controversial action. Earlier in December 2018, ICC banned him for his suspect action before lifting it in February 2019.\n\nThe heart of the matter\n\nSri Lanka bowler Akila Dananjaya has been banned from bowling in international cricket for 12 months. FULL STORY ⬇️ https://t.co/3sXzaJIDuq — ICC (@ICC) September 19, 2019\n\nThe Sri Lankan off-spinner had picked a five-wicket haul for his team in that Test match versus New Zealand. However, he did not play the 2nd Test of the series. As per ICC's rules and regulations, if a bowler gets suspended twice in a two-year period, he automatically faces a ban from international cricket for 12 months.\n\nWhat's next?\n\nAkila Dananjaya now has to get his action cleared under ICC's re-assessment after his suspension expires. This suspension means that the off-break bowler will not be able to represent Sri Lanka in the ICC T20 World Cup 2020. Hence, the Sri Lankan selectors will now have to find his replacement in the team.\n\nAlso see - Live cricket score\n\nPoll : 0 votes"}, {"url": "https://www.inuth.com/sports/cricket/india-vs-sri-lanka-2017/akila-dananjaya-5-startling-facts-sri-lankan-mystery-spinner-whose-life-changed-24-hrs/", "page_content": "The second One Day International between India and Sri Lanka became an interesting contest only because of a single person who bagged 5 wickets in the span of 13 balls. Akila Dananjaya. He ended up with a 6-fer against India, which allowed the dominant hosts the first time to give a headache to the visitors. Virat Kohli-led India won the toss and opted to field first. The hosts managed to cobble up 237 runs, which didn’t seem enough. India began the pursuit and was looking to score a runaway win. That is when India was reduced from 108 for 1 to 131 for 7 in no time. The match had turned on its head because of Akila Dananjaya. However, Sri Lanka did not go on to win the match despite being in a position of strength because of great commitment shown by Mahendra Singh Dhoni and Bhuvneshwar Kumar.\n\nBut Akila has announced himself at the world stage. So who is this mystery spinner who nearly polished off India at the blink of an eye?\n\nHere are five startling facts about the new mystery spinner in the block for Sri Lanka:\n\nInternational debut ahead of first class debut: That makes him unique as very few players have done this in the past. He was first spotted and selected for a T20I versus New Zealand, way back in 2012. A year later in 2013, he made his first-class debut for Colts Cricket Club against Ragama Cricket Club.\n\nMahela Jayawardena pushed his case: One of the most impactful batsmen from Sri Lanka, Mahela Jayawardena, was impressed by his set of skills and asked to push for his selection. He used to be a net bowler in the past. It was only on Jayawardena’s request that he was selected for the ICC World T20 in 2012.\n\nA Chennai Super Kings man: Yes, you may not have seen him in the yellow jersey, but he was selected for CSK in 2013 auctions. He was sold for a base price of $20,000, which approximately sums up to Rs. 10.5 Lakh.\n\nThe ball struck on his face: In his debut match against New Zealand, on Akita’s delivery, New Zealand batsman Rob Nicol hit the ball straight back at Akila, who could not react quickly and the ball went on to hit his face. His cheek bone was injured. That is what did not allow him to take further part in the tournament.\n\nAww.. Gets married yesterday and gets the man of the match today.. #AkilaDananjaya #SLvIND pic.twitter.com/iXxxNJxcNW — Aiyappa CG (@yaps9) August 24, 2017\n\nMarried 24 hours before the game: This is shocking! Akila Dananjaya apparently married 24 hours before the 2nd ODI against India. He tied the knot with Nethali Tekshini. He was not a part of the team in the first ODI but was later picked for the second ODI, which proved to be the best of his career."}, {"url": "https://sports.ndtv.com/cricket/players/1713-akila-dananjaya-playerprofile", "page_content": "Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera Profile\n\nWhen 18-year old Akila Dananjaya was picked in the Sri Lankan T20I squad for the 2012 World Twenty20, he had not played a single professional match in his career.\n\n\n\nA right-arm off break bowler, Dananjaya impressed Wayamba captain Mahela Jayawardena in the nets during the Sri Lanka Premier League with his variety of legbreak, googly, carrom ball, doosra and a stock off spinner. So good was his control, that Mahela quickly vouched for his inclusion in the national side. He was then included in the final squad of 15 for the WT20. Dananjaya made his international debut in a T20I against New Zealand, picking up two wickets in the spell. Consequently, he made his ODI debut against the same opposition. In 2013, he was picked by the IPL franchise Chennai Super Kings for the tournament's sixth season."}]}