{"Akila Dananjaya's bowling style is right-arm off-spinner.": [{"url": "https://www.cricbuzz.com/profiles/8483/akila-dananjaya", "page_content": "\n\nFull profile Sri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mah...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 6 10 2 135 43 16.88 254 53.15 0 0 0 14 0 ODI 39 30 6 291 50 12.12 417 69.78 0 0 1 25 3 T20I 31 15 7 61 11 7.62 71 85.92 0 0 0 6 0 IPL 1 1 1 4 4 0.0 5 80.0 0 0 0 0 0\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 6 12 1385 819 33 6/115 8/44 3.55 24.82 41.97 4 0 ODI 39 37 1935 1661 56 6/29 6/29 5.15 29.66 34.55 2 0 T20I 31 31 665 909 28 3/36 3/36 8.2 32.46 23.75 0 0 IPL 1 1 24 47 0 0/47 0/47 11.75 0.0 0.0 0 0\n\nCareer Information\n\nProfile\n\nSri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mahela Jayawardene was so impressed by the youngsters control of the googly, carrom ball, leg-break, doosra and off-spinner, that he convinced the selectors to fast track him to the national side. Dananjaya did not disappoint as he played 4 games and picked up 7 wickets at an average of 13 and an economy under 7.\n\n\n\nHowever, he only played one more game before being dropped. He was also overlooked for the 2014 T20 World Cup in Bangladesh. With the success in the T20 World Cup, Dananjaya was snapped up by the Chennai Super Kings during the 2013 edition for $20,000.\n\n\n\nRevolving doors of Sri Lankan cricket meant that Dhananjaya could never settle himself in the national team. Having played a handful of T20Is, he found himself completely out of favour with the national selectors for four long years. He was eventually recalled to the national team during the home season of 2017 and promptly made an immediate impact, grabbing career-best figures of four for 47 against the visiting Zimbabweans. It wasn't an one-off achievement, two days after his marriage, he claimed six for 54 against India, thereby cementing his place for the immediate future."}, {"url": "https://sports.ndtv.com/cricket/sri-lanka-off-spinner-akila-dananjaya-suspended-from-bowling-over-illegal-action-icc-1960642", "page_content": "Sri Lanka off-spinner Akila Dananjayahas been suspended from bowling in international cricket over an illegal action, the International Cricket Council announced on Monday. Akila Dananjaya was reported over a suspect bowling action during last month's first Test of the England series in Sri Lanka, which the tourists won by 211 runs on their way to a 3-0 whitewash.\n\nHe underwent an independent assessment of his bowling action on November 23 in Brisbane which revealed his deliveries exceeded the 15-degrees level of tolerance permitted under the regulations.\n\n\"The International Cricket Council today announced that an independent assessment has found the bowling action of Sri Lanka's off-spinner Akila Dananjaya to be illegal and, as such he has been suspended from bowling in international cricket with immediate effect,\" the ICC said in a statement.\n\nBREAKING: The bowling action of Sri Lanka spinner Akila Dananjaya has been found to be illegal. He has been suspended from bowling in international cricket with immediate effect.\n\n\n\nMORE ➡️ https://t.co/Rd6a18a7EP pic.twitter.com/5eWZ9y5K5p — ICC (@ICC) December 10, 2018\n\nDananjaya's suspension will be also enforced by all national cricket federations for domestic matches, though he may be able to play domestically in Sri Lanka with the permission of Sri Lanka Cricket.\n\nThe 25-year-old, who has played five Tests since making his debut against Bangladesh in February, must now modify his action before applying for further testing and possible reinstatement.\n\n(With AFP inputs)"}, {"url": "https://sports.stackexchange.com/questions/20395/can-an-off-spinner-bowl-a-googly", "page_content": "To quote from the very Cricinfo page you link to:\n\nAnother installment from Sri Lanka's production line of unorthodox spinners [...] Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner\n\nDananjaya is both a finger spinner and a wrist spinner, so he has (at least) two balls which turn into the right-handed batsman: the standard offspinner, bowled with a finger spinner's action, and the googly, bowled with a wrist spinner's action. Similarly, he can bowl two balls which turn away from the right-hander: the regular legbreak and the doosra.\n\nThe large selection of variations than Dananjaya possesses makes it harder for a batsman to read - for example, if a bowler can bowl only legbreaks and googlies, it's relatively easy to read the bowler from the hand by noting whether the back of the hand is facing the batsman or not. But with Dananjaya, the \"back of the hand\" ball could equally well be the doosra turning away from the right-hander, as opposed to the googly turning into the right hander."}, {"url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-off-spinner-akila-dananjaya-banned-from-bowling-due-to-illegal-action-1407147-2018-12-11", "page_content": "By India Today Web Desk: Sri Lanka spinner Akila Dananjaya has been suspended from bowling in international cricket with immediate effect after an independent committee found his bowling action to be illegal, the International Cricket Council (ICC) said on Monday.\n\nDananjaya was reported for a suspect action following Sri Lanka's first Test against England in Galle last month.\n\nThe 25-year-old's bowling action was assessed on Nov. 23 at the National Cricket Centre in Brisbane, where the straightening of his elbow during deliveries was found to exceed the 15-degree tolerance limit.\n\nadvertisement\n\nDananjaya's international suspension will also be recognised and enforced by all national cricket federations for domestic cricket events played in their own jurisdiction, the ICC said.\n\nHowever, Dananjaya may be able to bowl in domestic cricket events played under the auspices of Sri Lanka Cricket.\n\nHe will now undergo remedial work on his action and will be allowed to resume bowling in international cricket if his modified action passes the 15-degree rule.\n\nDananjaya has claimed 27 wickets in five Tests for Sri Lanka since making his debut against Bangladesh in February.\n\nHe has also bagged 46 wickets in 30 one-day internationals and 14 wickets in 16 Twenty20 internationals.\n\n(With Reuters inputs)"}, {"url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-spinner-akila-dananjaya-ban-1-year-icc-illegal-bowling-action-1601003-2019-09-19", "page_content": "By Asian News International: Sri Lankan spinner Akila Dananjaya was on Thursday banned from bowling for 12 months following an independent assessment of his action by the International Cricket Council (ICC).\n\nAkila Dananjaya was assessed after his bowling action came under scrutiny by the match officials in the first Test against New Zealand in Galle from August 14-18.\n\nFirst, his action was reported to the apex cricketing body and then he underwent an assessment in Chennai on August 29 which revealed that he had employed an illegal bowling action.\n\nadvertisement\n\nIn accordance with Article 11.1 of the ICC Regulations for the review of bowlers reported with suspect bowling actions, Dananjaya's international suspension will also be recognised and enforced by all cricket federations for domestic events played in their jurisdiction.\n\nHe was first suspended from bowling in December 2018.\n\nFollowing remedial work on his action, he was reassessed and was permitted to resume bowling in February this year.\n\nIt is the player's second report within a two-year period. The first led to a suspension and now he is automatically banned from bowling in international cricket for a period of 12 months.\n\nDananjaya is entitled to approach the ICC for a re-assessment of his action after the expiry of the one-year period."}, {"url": "https://au.sports.yahoo.com/akila-dananjaya-banned-bowling-illegal-action-233834460.html", "page_content": "Sri Lankan off-spinner Akila Dananjaya has been banned from bowling in international matches for a year after his action was found to be illegal.\n\nThe 25-year-old was subjected to an independent assessment of his bowling action after umpires questioned his style in the first Test against New Zealand at Galle in August.\n\n‘THERE’S NO WAY’: England coach's stunning call to ban Aussie players\n\nDananjaya had also been suspended in December after being reported by umpires during the first Test against England in November 2018.\n\nAkila Dananjaya in action against New Zealand. Image: Sri Lanka Cricket\n\nHowever he was permitted to resume bowling in February following \"remedial work on his action.\"\n\nHowever, he was found to have an illegal action following another assessment after being reported again last month, the ICC said.\n\n\"As the latest report constitutes the player’s second report within a two-year period, the first of which led to a suspension, he is automatically suspended from bowling in international cricket for a period of 12 months,\" the ICC said in a statement.\n\nAkila Dananjaya starred for Sri Lanka against New Zealand. Image: Getty\n\nDananjaya has starred with the ball\n\nIt said he will be entitled to approach the ICC for a re-assessment of his bowling action after the expiry of this one-year period.\n\nThe Galle match against New Zealand was Dananjaya's first Test since his reinstatement.\n\nHe has taken 33 wickets in six Tests for Sri Lanka since making his debut against Bangladesh last year, as well as 51 wickets in one-dayers and 22 in Twenty20 internationals.\n\nAKILA DANANJAYA BANNED FOR A YEAR!\n\n\n\nAkila will not be allowed to bowl in international cricket until August 29, 2020 after failing another technical assessment.\n\n\n\nA huge blow for Sri Lankan cricket. pic.twitter.com/KJWcJWTVmy — 🏏FlashScore Cricket Commentators🏏 (@FlashCric) September 19, 2019\n\nBREAKING NEWS: Sri Lankan spinner, Akila Dananjaya is banned from bowling in international cricket for 12 months due to an illegal bowling action.\n\n\n\nHe was reported in the SLvNZ Test last month. This is terrible news for SL. #Cricket pic.twitter.com/Aa16VmmGq9 — ThePoppingCrease (@PoppingCreaseSA) September 19, 2019\n\nwith agencies"}, {"url": "https://www.icc-cricket.com/media-releases/1349580", "page_content": "The International Cricket Council today announced that Sri Lanka spinner Akila Dananjaya has been banned from bowling in international cricket for 12 months following an independent assessment of his action.\n\nThe 25-year-old was assessed after the legality of his bowling action came under question by match officials in the first Test against New Zealand in Galle from 14-18 August. He subsequently underwent the independent assessment in Chennai on 29 August, which revealed that he employed an illegal bowling action.\n\nDananjaya was originally suspended from bowling in December 2018. Following remedial work on his bowling action, he was reassessed and permitted to resume bowling in February 2019.\n\nAs the latest report constitutes the player’s second report within a two-year period, the first of which led to a suspension, he is automatically suspended from bowling in international cricket for a period of 12 months. Dananjaya will be entitled to approach the ICC for a re-assessment of his bowling action after the expiry of this one-year period.\n\nDetails of the ICC regulations for the review of bowlers reported with suspected illegal bowling actions can be found here.\n\nPrevious ICC media releases on Dananjaya’s bowling action can be found below:\n\nOn being reported for the first time here\n\nOn action being found to be illegal here\n\nOn being allowed to bowl again here\n\nOn being reported again here"}, {"url": "https://www.hindustantimes.com/cricket/icc-suspends-sri-lanka-spinner-akila-dananjaya-from-bowling-over-illegal-action/story-Fc0PDakmxY8kukWThTRKRM.html", "page_content": "Sri Lanka off-spinner Akila Dananjaya has been suspended from bowling in international cricket over an illegal action, the International Cricket Council announced on Monday. Akila Dananjaya underwent an independent assessment of his bowling action on November 23 in Brisbane which revealed his deliveries exceeded the 15-degrees level of tolerance(AP)\n\nDananjaya was reported over a suspect bowling action during last month’s first Test of the England series in Sri Lanka, which the tourists won by 211 runs on their way to a 3-0 whitewash.\n\nHe underwent an independent assessment of his bowling action on November 23 in Brisbane which revealed his deliveries exceeded the 15-degrees level of tolerance permitted under the regulations.\n\n“The International Cricket Council today announced that an independent assessment has found the bowling action of Sri Lanka’s off-spinner Akila Dananjaya to be illegal and, as such he has been suspended from bowling in international cricket with immediate effect,” the ICC said in a statement.\n\nDananjaya’s suspension will be also enforced by all national cricket federations for domestic matches, though he may be able to play domestically in Sri Lanka with the permission of Sri Lanka Cricket.\n\nThe 25-year-old, who has played five Tests since making his debut against Bangladesh in February, must now modify his action before applying for further testing and possible reinstatement."}, {"url": "https://sports.ndtv.com/cricket/players/1713-akila-dananjaya-playerprofile", "page_content": "Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera Profile\n\nWhen 18-year old Akila Dananjaya was picked in the Sri Lankan T20I squad for the 2012 World Twenty20, he had not played a single professional match in his career.\n\n\n\nA right-arm off break bowler, Dananjaya impressed Wayamba captain Mahela Jayawardena in the nets during the Sri Lanka Premier League with his variety of legbreak, googly, carrom ball, doosra and a stock off spinner. So good was his control, that Mahela quickly vouched for his inclusion in the national side. He was then included in the final squad of 15 for the WT20. Dananjaya made his international debut in a T20I against New Zealand, picking up two wickets in the spell. Consequently, he made his ODI debut against the same opposition. In 2013, he was picked by the IPL franchise Chennai Super Kings for the tournament's sixth season."}, {"url": "https://www.icc-cricket.com/news/906621", "page_content": "Sri Lanka off-spinner Akila Dananjaya has been reported with a suspect bowling action during the first Test against England, which the visitors won by 211 runs on Friday.\n\nThe match officials’ report, which was handed over to the Sri Lanka team management, cited concerns about the legality of the 25-year-old’s bowling action.\n\nDananjaya’s bowling action will now be scrutinised further under the ICC process relating to suspected illegal bowling actions reported in Tests, ODIs and T20Is. He is required to undergo testing within 14 days and, during this period, Dananjaya is permitted to continue bowling in international cricket until the results of the testing are known.\n\n\n\nDetails of the ICC regulations for the review of bowlers reported with suspected illegal bowling actions can be found here."}], "Akila Dananjaya's batting style is right-handed.": [{"url": "https://www.espncricinfo.com/cricketers/akila-dananjaya-574178", "page_content": "Another instalment from Sri Lanka's production line of unorthodox spinners, Akila Dananjaya sparked controversy when he was picked in the preliminary squad for the 2012 T20 World Cup despite never having played a professional match in his life. Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner with astounding control, he had impressed Sri Lanka captain Mahela Jayawardene so much as a net bowler at a practice session that Jayawardene requested he be fast-tracked to the national squad.\n\nDananjaya played three matches of the World Cup, including the final, but went out of favour with the selectors once Jayawardene stepped down from the captaincy.\n\nHe made his comeback in 2017, and took a six-for against India in an ODI that year, and another against South Africa in 2018. In between he made a successful entry into Test cricket, taking four five-wicket hauls in his first six Tests.\n\nIn September 2019, Dananjaya was banned from bowling in international cricket for 12 months because of an illegal bowling action. His return was dramatic - in a T20I in Antigua in March 2021, he took a hat-trick in one over but was carted for six sixes by Kieron Pollard in his next."}, {"url": "https://www.cricbuzz.com/profiles/8483/akila-dananjaya", "page_content": "\n\nFull profile Sri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mah...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 6 10 2 135 43 16.88 254 53.15 0 0 0 14 0 ODI 39 30 6 291 50 12.12 417 69.78 0 0 1 25 3 T20I 31 15 7 61 11 7.62 71 85.92 0 0 0 6 0 IPL 1 1 1 4 4 0.0 5 80.0 0 0 0 0 0\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 6 12 1385 819 33 6/115 8/44 3.55 24.82 41.97 4 0 ODI 39 37 1935 1661 56 6/29 6/29 5.15 29.66 34.55 2 0 T20I 31 31 665 909 28 3/36 3/36 8.2 32.46 23.75 0 0 IPL 1 1 24 47 0 0/47 0/47 11.75 0.0 0.0 0 0\n\nCareer Information\n\nProfile\n\nSri Lanka is a country known to produce unconventional spinners. Dananjaya is the latest one in that list. Having not played a first class game, Dananjaya was picked for the 2012 T20 WC. Mahela Jayawardene was so impressed by the youngsters control of the googly, carrom ball, leg-break, doosra and off-spinner, that he convinced the selectors to fast track him to the national side. Dananjaya did not disappoint as he played 4 games and picked up 7 wickets at an average of 13 and an economy under 7.\n\n\n\nHowever, he only played one more game before being dropped. He was also overlooked for the 2014 T20 World Cup in Bangladesh. With the success in the T20 World Cup, Dananjaya was snapped up by the Chennai Super Kings during the 2013 edition for $20,000.\n\n\n\nRevolving doors of Sri Lankan cricket meant that Dhananjaya could never settle himself in the national team. Having played a handful of T20Is, he found himself completely out of favour with the national selectors for four long years. He was eventually recalled to the national team during the home season of 2017 and promptly made an immediate impact, grabbing career-best figures of four for 47 against the visiting Zimbabweans. It wasn't an one-off achievement, two days after his marriage, he claimed six for 54 against India, thereby cementing his place for the immediate future."}, {"url": "https://www.mykhel.com/cricket/players/akila-dananjaya-p5746/", "page_content": "You can manage your notification subscription by clicking on the icon\n\nTo start receiving timely alerts, as shown below click on the Green “lock” icon next to the address bar\n\nClick it and Unblock the Notifications Click it and Unblock the Notifications\n\nClose X"}, {"url": "https://cricclubs.com/IPL/viewPlayer.do?playerId=1855374&clubId=2447", "page_content": "Registrations are mandatory for players regardless playing within club, trainings or NDCA or PJCA tournaments due to personal and Third safety and insurance purposes.\n\nFees :-\n\nAt the moment there is no Registration fees to join Jordan Springs Cricket Club, As it is Non- Profitable Association; Club Administration will try to cover all expenses from sponsors; But if there will be any changes in the future fee you will be notified.\n\nIndemnity and release:-\n\nIn consideration of being allowed to participate in cricket matches, training, including travel and associated events (“Activities”) organised and/or supervised by Jordan Springs Cricket Club. I acknowledge, agree and confirm the following:"}, {"url": "https://iplwiki.com/player/akila-dananjaya/", "page_content": "Akila Dananjaya is cricket player of Sri Lanka and he is good Bowler⚾, . He is a Left-handed batsman and Right-arm offbreak bowler . Akila Dananjaya was born on October 4, 1993 .\n\nAditya Tare Ben Cutting Evin Lewis Hardik Pandya Ishan Kishan Jasprit Bumrah Kieron Pollard Krunal Pandya Mayank Markande Mitchell McClenaghan Rohit Sharma Suryakumar Yadav Barinder Sran Quinton de Kock Yuvraj Singh Akila Dananjaya JP Duminy Mustafizur Rahman Pradeep Sangwan Saurabh Tiwary\n\nName Akila Dananjaya Nationality Sri Lanka Position Bowler⚾ Matches 1 Runs 4 Wickets 0 Current Price ( ₹ ) Rs 50 lakh Batting Style Left-handed Bowling Style Right-arm offbreak Current Team Mumbai Indians Seasons 2018 Birthday October 4, 1993 Age 29\n\nBowling Season Team Total -\n\nAkila Dananjaya Family Background: Religion, caste, sun sign\n\nAkila Dananjaya have a complexion.\n\nAkila Dananjaya career journey from state level to international cricket:\n\nCurrently, Akila Dananjaya is in Mumbai Indians team.\n\nAkila Dananjaya played 2018, seasons in IPL.\n\nAkila Dananjaya is played around 1 matches in IPL. His total runs scored is 4."}, {"url": "https://advancecricket.com/cricket-player/akila-dananjaya-records-in-2022/62040653-2022", "page_content": "Akila Dananjaya Recent Dream11 Points DateTime MatchType Bat Bowl Field Total 01 Apr 23 ODI 0 133 8 145 30 Mar 23 ODI 30 39 0 73 26 Mar 23 ODI 11 67 0 82 20 Mar 23 ODI 4 99 0 107 22 Jan 23 T20 4 2 0 10 15 Jan 23 T20 0 0 0 4 11 Jan 23 T20 0 25 0 29 22 Sep 22 T20 0 0 0 4 21 Sep 22 T20 1 25 0 30 17 Sep 22 T20 1 4 8 17 14 Sep 22 T20 0 35 0 39 11 Sep 22 T20 11 58 0 73 08 Sep 22 T20 0 60 0 64 01 Sep 22 T20 0 -2 0 2 01 Sep 22 T20 0 0 0 4 28 Aug 22 T10 0 0 0 4\n\nAkila Dananjaya Fantasy Cricket Records Competition T10 CPL DODI Run Per Inn - 4.0 - Run Per Match - 1.3 - Boundary (In Ball) - 18.0 - 4s (In Ball) - 18.0 - 6s (In Ball) - - - Over Per Match 2.0 2.4 10.0 Wicket Per Inn - 0.7 2.0 Wicket Per Match - 0.6 2.0 Wicket (In Ball) - 24.0 30.0 Wicket (In Runs) - 31.5 25.5 Field In Match % - 11 % 100 % Catch In Match % - 11 % 100 %\n\nAkila Dananjaya Batting Records Competition T10 CPL DODI Matches 1 9 1 Innings 0 3 0 Not Out 0 0 0 Runs 0 12 0 Highest Score 0 10 0 Average 4.00 Balls Faced 0 18 0 Strike Rate 0 66.6 0 20s 0 0 0 30s 0 0 0 50s 0 0 0 100s 0 0 0 200s 0 0 0 90s 0 0 0 150s 0 0 0 4s 0 1 0 6s 0 0 0 Outtype LBW 0 0 0 Bowled 0 1 0 Stumped 0 0 0 Catch 0 2 0 Run Out 0 0 0 Wicket Taker Left Arm 0 0 0 1- Fast 0 0 0 2- Fast-Medium 0 0 0 3- Medium 0 0 0 4- Slow 0 0 0 1- Bowled 0 0 0 2- Catch 0 0 0 3- Stumped 0 0 0 4- Lbw 0 0 0 Right Arm 0 3 0 1- Fast 0 0 0 2- Fast-Medium 0 2 0 3- Medium 0 1 0 4- Slow 0 0 0 1- Bowled 0 1 0 2- Catch 0 2 0 3- Stumped 0 0 0 4- Lbw 0 0 0\n\nAkila Dananjaya Bowling Cricket Records Competition T10 CPL DODI Matches 1 9 1 Innings 1 8 1 Balls 12 144 60 Runs 22 189 51 BBI 0/22 2/28 2/51 Average 0 31.50 25.50 Strike Rate 24.00 30.00 Maiden 0 0 0 2w 0 2 1 3w 0 0 0 5w 0 0 0 8w 0 0 0 10w 0 0 0 Wickets 0 6 2 LBW 0 2 0 Bowled 0 1 1 Stumped 0 1 0 Catch 0 2 1 Batsman Type Right Handed 0 4 1 1- LBW 0 1 0 2- Bowled 0 1 1 3- Stumped 0 1 0 4- Catch 0 1 0 Left Handed 0 2 1 1- LBW 0 1 0 2- Bowled 0 0 0 3- Stumped 0 0 0 4- Catch 0 1 1\n\nAkila Dananjaya Fielding Cricket Records Competition T10 CPL DODI Matches 1 9 1 Catch 0 1 1 Stumping 0 0 0 Direct Throw(RO) 0 0 0 Throw(RO) 0 0 0 Receiver(RO) 0 0 0\n\nT10 [In 2022] Details Akila Dananjaya played 1 T10 matches and scored 0 runs in 0 Innings. Akila Dananjaya's Highest Score in T10 is 0. A Dananjaya has 0 T10 centuries, 0 T10 half centuries and 0 times 30+ and 0 times 20+ T10 runs. A Dananjaya has a strike rate of 0 with average of in 0 T10 balls. Akila Dananjaya made total 0 boundaries with 0 fours and 0 sixes in T10. A Dananjaya's T10 outtype analysis are lbw 0 times, bowled 0, stumped 0 times, catch 0 times, Run Out 0 times. Akila Dananjaya's T10 wicket takers are 0 left arm and 0 right arm. A Dananjaya's Left Arm T10 Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. Akila Dananjaya's Right Arm T10 Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. A Dananjaya's wicket taken by Left Arm Bowlers in T10 analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Akila Dananjaya's wicket taken by Right Arm Bowlers in T10 analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Akila Dananjaya Took 0 Wickets (In 1 T10 innings) with Strike Rate of and Average of 0. A Dananjaya's delivered 12 balls (with 0 Maiden over) and took 2 wickets 0 times, 3 wickets 0 times, 5 wickets 0 times, 8 wickets 0 times, 10 wickets 0 times. 0 Right Handed and 0 Left Handed batsman out by Akila Dananjaya in T10. Right Handed Batsman T10 outtype analysis (wicket taken by A Dananjaya) are LBW 0 times, Bowled 0 times, Stumped 0 times, Catch 0 times. Left Handed Batsman T10 outtype analysis (wicket taken by A Dananjaya) are LBW 0 times, Bowled 0 times, Stumped 0 times, Catch 0 times. Akila Dananjaya Fielding analysis are Catch 0 times, Stumping 0 times, Direct Throw(Run Out) 0 times, Throw(Run Out) 0 times.\n\nCPL [In 2022] Details Akila Dananjaya played 9 CPL matches and scored 12 runs in 3 Innings. Akila Dananjaya's Highest Score in CPL is 10. A Dananjaya has 0 CPL centuries, 0 CPL half centuries and 0 times 30+ and 0 times 20+ CPL runs. A Dananjaya has a strike rate of 66.6 with average of 4.00 in 18 CPL balls. Akila Dananjaya made total 1 boundaries with 1 fours and 0 sixes in CPL. A Dananjaya's CPL outtype analysis are lbw 0 times, bowled 1, stumped 0 times, catch 2 times, Run Out 0 times. Akila Dananjaya's CPL wicket takers are 0 left arm and 3 right arm. A Dananjaya's Left Arm CPL Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. Akila Dananjaya's Right Arm CPL Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 2 wickets, Medium bowler 1 wickets, Slow bowler 0 wickets. A Dananjaya's wicket taken by Left Arm Bowlers in CPL analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Akila Dananjaya's wicket taken by Right Arm Bowlers in CPL analysis are lbw 0 wickets, bowled 1 wickets, stumped 0 wickets, catch 2 wickets. Akila Dananjaya Took 6 Wickets (In 8 CPL innings) with Strike Rate of 24.00 and Average of 31.50. A Dananjaya's delivered 144 balls (with 0 Maiden over) and took 2 wickets 2 times, 3 wickets 0 times, 5 wickets 0 times, 8 wickets 0 times, 10 wickets 0 times. 4 Right Handed and 2 Left Handed batsman out by Akila Dananjaya in CPL. Right Handed Batsman CPL outtype analysis (wicket taken by A Dananjaya) are LBW 1 times, Bowled 1 times, Stumped 1 times, Catch 1 times. Left Handed Batsman CPL outtype analysis (wicket taken by A Dananjaya) are LBW 1 times, Bowled 0 times, Stumped 0 times, Catch 1 times. Akila Dananjaya Fielding analysis are Catch 1 times, Stumping 0 times, Direct Throw(Run Out) 0 times, Throw(Run Out) 0 times.\n\nDODI [In 2022] Details Akila Dananjaya played 1 DODI matches and scored 0 runs in 0 Innings. Akila Dananjaya's Highest Score in DODI is 0. A Dananjaya has 0 DODI centuries, 0 DODI half centuries and 0 times 30+ and 0 times 20+ DODI runs. A Dananjaya has a strike rate of 0 with average of in 0 DODI balls. Akila Dananjaya made total 0 boundaries with 0 fours and 0 sixes in DODI. A Dananjaya's DODI outtype analysis are lbw 0 times, bowled 0, stumped 0 times, catch 0 times, Run Out 0 times. Akila Dananjaya's DODI wicket takers are 0 left arm and 0 right arm. A Dananjaya's Left Arm DODI Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. Akila Dananjaya's Right Arm DODI Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. A Dananjaya's wicket taken by Left Arm Bowlers in DODI analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Akila Dananjaya's wicket taken by Right Arm Bowlers in DODI analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Akila Dananjaya Took 2 Wickets (In 1 DODI innings) with Strike Rate of 30.00 and Average of 25.50. A Dananjaya's delivered 60 balls (with 0 Maiden over) and took 2 wickets 1 times, 3 wickets 0 times, 5 wickets 0 times, 8 wickets 0 times, 10 wickets 0 times. 1 Right Handed and 1 Left Handed batsman out by Akila Dananjaya in DODI. Right Handed Batsman DODI outtype analysis (wicket taken by A Dananjaya) are LBW 0 times, Bowled 1 times, Stumped 0 times, Catch 0 times. Left Handed Batsman DODI outtype analysis (wicket taken by A Dananjaya) are LBW 0 times, Bowled 0 times, Stumped 0 times, Catch 1 times. Akila Dananjaya Fielding analysis are Catch 1 times, Stumping 0 times, Direct Throw(Run Out) 0 times, Throw(Run Out) 0 times."}, {"url": "https://livesportworld.com/akila-dananjaya-cricketer-wife-bowling/", "page_content": "Akila Dananjaya is an international professional Sri Lankan team National cricketer. He has played first test cricket of his life on 8 February 2018 with the Bangladesh team and last test match has played 20 July 2018 against the South African team. And his ODI cricket team was starting on 12 November 2012 against New Zealand.\n\nBasically, any users check here Dananjaya’s batting and bowling average, IPL 2018, height, age, personal life, weight, marriage, girlfriends, wife name and also. Basically, Akila is an all-rounder of the Sri Lankan national team\n\nAkila’s age and height\n\nHe was born on 4 October 1993. At present, his age is 25 years old. His height is 5 feet 7 inches as far as I know.\n\nAkila’s house and net worth\n\nHis birthplace is Panadura, Sri Lanka. His IPL 2018 salary is 50 lakh.\n\nAkila Dananjaya biography, family, career and personal details\n\nHis family, biography, wife, baby, favourite things, school, cricket caree and more Full or real name Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera His Profession Professional cricketer Nickname Dananjaya Height in cm & m 170cm and 1.70m Height in feet inches (estimated) 5 feet 7 inches Weight in kg (estimated) 65 kg Weight in pound 143 Ibs Hair color Black Eye color Black Body mesurments Chest-40, Waist-32, Biceps-14 Date of birth October 4, 1993 actual age [showcurrentage month=\"October\" day=\"4\" year=\"1993\" template=\"9\"] Place of Birth Panadura, Sri Lanka Religion Hinduism School life Mahanama Vidyalaya, Panadura (Sri Lanka) College name Unknown National team or side Sri Lanka Zodiac Sign Libra Hometown Panadura, Sri Lanka Present Salary Unknown Net worth Unknown PSL Unknown Net worth in Indian money Unknown BPL team Khulna Titans IPL team Mumbai Indians (2018-present) Dananjaya's family, mother, girlfriend and more Mother name Name unknown Father name Sunil Perera Brother name N/A And sister name Not known Marital status Married Marriage date August 22, 2017 Wife Nethalie Tekshini Girlfriends/affairs name Nethalie Tekshini Baby or Children N/A His cricketer of career, record Top Score in batting Test in 43* and ODI 50 Nature of field Unknown Domestic team Unknown Coach Unknown Best score ODI in 50 runs ODI cricket debut 12 November 2012 against New Zealand team T20 International debut 27 September 2012 against New Zealand team Test cricket debut 8 February 2018 against Bangladesh team Batting style left-handed Bowling Style right-arm off-break Playing rule all-rounded bowling average Test-16.29, ODI-29.34, T20-30.35 Career Records Top 5 wickets he got in Odi 2 times and Test 2 times Highest Score 5 wickets in Odi two times and also 2 times 5 wickets in Test Jersey no 10 in Sri Lanka SLC team Wayamba United in 2012-present Total 100 and 50 runs time In ODI 0/1 Playing teams wayamba United, Sri Lanka Under-23s, Mumbai Indians, Chennai Super Kings, and Sri Lanka Like to play against New Zealand and Bangladesh Favourite footballer Leonel Messi, Ronaldo Favourite Cuisine Unknown Hobbies Fishing, Swimming, Rice has smoked No Favorite Destination London Drinking Alcohol Unknown\n\nHis Wife or girlfriend\n\nSri Lankan cricketer Akila married 1 year ago before starting his career. His marriage date is on 22 August 2017. And his wife name is Nathalie Tekshini.\n\nHis Cars and favorite things\n\n.. Cars and favorite all things His favorite cars Audi, FERARRI Favorite food Fast foods, Rice and also Favorite actress Unknown Best Friend Dhananjaya de Silva Favorite Sports Football and Cricket Favorite footballers Neimar, Ronaldo, Ronaldinho Favorite Cell phone iPhone Favourite Cricketer Batsman: Rangana Herath, MS Dhoni Bowler: Ajantha Mendis Favourite color Green Favorite Actor Unknown Favorite animal Unknown Favourite website twitter, Facebook His car collection Audi, BMW Favorite subjects Unknown Drinks Apple Juice Favorite time Morning of the Day Favorite day Friday Favorite digit 2 Favorite Premier League club IPL and SLC Favorite flower Rose Favorite Destination London favorite Celebrity Unknown\n\nAkila batting, and the latest news\n\nIn fact, Akila’s batting system is the left-handed batsman and also bowling style right-arm off-break bowler. Basically, his batting average respectively tests cricket batting average 22.00 and T20I cricket batting average 7.75 and also his ODI match batting average 13.56.\n\nBesides, as an all-rounder, his bowling average is the test cricket 16.29 ODI crickets 29.34 and T20 cricket bowling average is 30.35.\n\nWhen at the age of 18 he joined the national team debut against New Zealand. In 2017, he was recalled into the ODI team after five years for the Zimbabwe tour. Cricketer he scored his maiden ODI fifty runs against Pakistan on 13 October 2017.\n\nFrom February-20 to July-20 all sports was off for Covid-10 but, then started cricket successfully.\n\nHe joined the Asia Cup cricket as an all-rounder in Sri Lanka team.\n\nRecord, centuries and other honors\n\nHe played the test cricket second score against South Africa during the match on 20 July 2018 and had a 74-run with Rangana Herath good partnership. He scored an unbeaten 43 runs in that first innings and helped Sri Lanka their first-innings total to 338.\n\nI think that you have got details about Akila Dananjaya Perera all-rounder career details.\n\nRead more post in Sri Lanka another cricketer\n\nNuwan Kulasekara’s biography\n\nDushmantha Chamaera’s biography\n\nThisara Perera profiles and more details"}, {"url": "https://www.cricketerlife.com/akila-dananjaya-biography/", "page_content": "Akila Dananjaya is a Sri Lankan cricketer. He was bron on 4 October 1993 in Panadura, Sri Lanka. His full name is Mahamarakkala Kurukulasooriya Patabendige Akila Dananjaya Perera.\n\nHe is a left handed batsman and right arm off break and also leg break googly+Doosra bowler. He play as a bowler in Sri Lankan cricket team. His height is approx 5 feet 7 inches.\n\nAkila Dananjaya married in 2017 with Nethalie Tekshini. His father Moratuwa, Dananjaya is a carpenter. He started his international career for Sri Lankan national cricket team in 2012 vs New Zealand."}, {"url": "https://www.mykhel.com/cricket/players/akila-dananjaya-ipl-p5746/", "page_content": "You can manage your notification subscription by clicking on the icon\n\nTo start receiving timely alerts, as shown below click on the Green “lock” icon next to the address bar\n\nClick it and Unblock the Notifications Click it and Unblock the Notifications\n\nClose X"}, {"url": "https://www.espncricinfo.com/cricketers/akila-dananjaya-574178/bowling-batting-stats", "page_content": "South Africa\n\nAll\n\nAlphabetically sorted top ten of players who have played the most matches across formats in the last 12 months"}]}