{"Sri Lanka Army Sports Club participated in the 2013C14 Premier League Tournament.": [{"url": "https://www.espncricinfo.com/series/premier-league-tournament-2014-15-801337/sri-lanka-army-sports-club-vs-sinhalese-sports-club-group-b-801363/live-cricket-score", "page_content": "RESULT • 7th Match • PRO 3-Day • Nangarhar\n\nBOOST 159 & 103 AMOR 412/4d\n\nAmo-Region won by an innings and 150 runs"}, {"url": "https://isport.in/sri-lanka-army-sports-club/", "page_content": "Sri Lanka Army Sports Club Team Country: Sri Lanka Team City: Panagoda Founded (Year): 2006 Home Ground: Army Ground, Panagoda Coach: Captain: Thisara Perera Forms of Cricket: First-Class Limited Overs Twenty20\n\nSri Lanka Army Sports Club: competitions Sri Lanka Army Sports Club: First-Class Cricket Competitions Logo Tournament Wins Years Premier Trophy 0 Sri Lanka Army Sports Club: Limited Overs Cricket Competitions Logo Tournament Wins Years Premier Limited Overs Tournament 0 Sri Lanka Army Sports Club: Twenty20 Cricket Competitions Logo Tournament Wins Years Twenty20 Tournament 1 2014–2015\n\nSri Lanka Army Sports Club: Current Squad\n\nThisara Perera All-rounder\n\nSri Lanka Army Sports Club: professional team\n\nThe Sri Lanka Army Sports Club (ASC) is a Sri Lankan cricket franchise that has participated in the National Major League – Premier Trophy since the 2006/07 season.\n\nThe team is involved in all internal tournaments of the first-class format, but they have not managed to win a single trophy at the moment.\n\nASC’s home games take place at the 10,000th Army Ground in Panagoda.\n\nSri Lanka Army Sports Club: history\n\nIt can be noted that the contribution made by the Army Sports Club structure to the development of sports in Sri Lanka is invaluable. In this case, it is appropriate to say that the cricket club’s history begins with the army department, which was assigned to many disciplines (football, athletics, boxing, rugby), including cricket. Initially, all sports areas were part of the training of the military. Therefore, they were considered secondary.\n\nOver time, the development of the Army Sports Club reached a new level, which allowed the sports divisions to participate in national championships on an ongoing basis.\n\nThis is how the Sri Lanka Army Sports Club cricket team has been playing in first-class format matches since the 2006/07 season. Unfortunately, the club still has not shown itself in any way, but the successful completion of the group stage of the championship allows it to be deservedly in the top division (the Super Eight) of the country.\n\nSri Lanka Army Sports Club: achievements\n\nDuring its fifteen-year history, the club never managed to become the owner of the highest trophies. There is not a single championship on the ASC account.\n\nAt the same time, the Sri Lanka Army Sports Club has positive statistics. According to the latest data, the team played 93 first-class matches, where they won 38 victories, suffered 21 defeats and drew 34 times. The situation is similar in the List A format, where ASC has 35 wins in 68 matches, with 28 defeats and 5 unfinished fights.\n\nSri Lanka Army Sports Club: line-up\n\nThe Sri Lanka Army Sports Club line-up for the 2019/20 season:\n\nNo Name Nat Age Batting Style Bowling Style Batsmen 6 Lakshan Edirisinghe 28 Left-handed Right-arm off-break 17 Himasha Liyanage 24 Left-handed Right-arm off-break 36 Ashan Randika 27 Left-handed Right-arm medium – Lakshitha Madushan 29 Right-handed Right-arm leg-break – Dilshan de Soysa 26 Right-handed Right-arm leg-break – Ranjan Silva 32 Right-handed Right-arm off-break – Navod Ilukwatta 29 Left-handed Right-arm off-break – Tharindu Dharsana 32 Right-handed Right-arm medium-fast All-rounders 2 Dushan Vimukthi 29 Right-handed Right-arm off-break 7 Sanjika Ridma 26 Left-handed Slow left-arm orthodox 14 Asela Gunaratne 35 Right-handed Right-arm medium-fast 1 Thisara Perera (Captain) 32 Right-handed Right-arm Right-arm medium-fast 41 Seekkuge Prasanna 36 Right-handed Right-arm leg-break 99 Janith Silva 30 Right-handed Right-arm medium Wicket-keepers 3 Leo Fransisco 26 Left-handed – 96 Kasun de Silva 30 Right-handed Right-arm leg-break 144 Dinesh Chandimal 31 Right-handed Right-arm off-break – Pathum Dilshan 30 Right-handed – Bowlers 21 Navantha Rathnayake 42 Right-handed Right-arm fast-medium 23 Buddika Madushanka – – Right-arm fast-medium 40 Ajantha Mendis 36 Right-handed Right-arm off-break 66 Janaka Sampath 33 Right-handed Right-arm leg-break – Malka Madusanka 25 Left-handed Slow left-arm orthodox – Viraj Pushpakumara 34 Left-handed Right-arm leg-break – Yasoda Mendis 28 Left-handed Right-arm medium – Nuwan Liyanapathirana 34 Right-handed Right-arm fast-medium – Lakshan Madushanka 30 Right-handed Right-arm off-break\n\n* international players are in bold."}, {"url": "https://www.sofascore.com/team/cricket/sri-lanka-army-sports-club/416419", "page_content": "Sri Lanka Army Sports Club scores, player list and schedule from all cricket tournaments that Sri Lanka Army Sports Club played.\n\nSri Lanka Army Sports Club next match\n\nStatistics are updated at the end of the game.\n\nSri Lanka Army Sports Club previous match\n\nSri Lanka Army Sports Club fixtures tab is showing last 100 cricket matches with statistics and win/lose icons.\n\nThere are also all Sri Lanka Army Sports Club scheduled matches that they are going to play in the future.\n\nSri Lanka Army Sports Club performance and form graph is Sofascore’s unique algorithm that we are generating from the team’s last 10 matches, statistics, detailed analysis and our own knowledge.\n\nThis graph may help you predict Sri Lanka Army Sports Club future matches.\n\nFor today’s cricket matches and results visit our cricket live score page."}, {"url": "https://wiki.alquds.edu/?query=Sri_Lanka_Army_Sports_Club_(cricket)", "page_content": "Sri Lanka Army Sports Club is a first-class cricket team in Sri Lanka. It has competed in the Premier Trophy since 2006–07.\n\nHistory [ edit ]\n\nAs of late January 2016, Sri Lanka Army Sports Club had played 93 first-class matches, for 38 wins, 21 losses and 34 draws,[1] and 68 List A matches, for 35 wins, 28 losses and 5 unfinished.[2]\n\nCurrent squad [ edit ]\n\nPlayers with international caps are listed in bold. Updated as on 2 August 2022.\n\nHonours [ edit ]\n\nRecords [ edit ]\n\nReferences [ edit ]"}, {"url": "https://www.army.lk/news/eight-civil-sports-clubs-vie-642-infantry-brigade-organized-football-tournament", "page_content": "Eight Civil Sports Clubs Vie in 642 Infantry Brigade-organized Football Tournament\n\nThe 642 Infantry Brigade of the 64 Infantry Division of the Security Forces HQ-Mullaittu (SFHQ-MLT) organized a football tournament all among civil sports clubs in Oddusudan, aimed at enhancing sports skills of the youth and reconciliation between the Security Forces and civilians from 06 April to 11 April.\n\n8 teams of civil sports clubs participated in the tournament that went on throughout the day. The Walarmadee Sports Club and Parandhaman Sport Club teams vied in the final tussle. Players in the Walarmadee Sports club finally won the match amid cheers.\n\nThe final match and award of trophies took place on 11 April at Oddusudan Maha Vidyala playground. Major General H.D.W.K.N Eriyagama RWP RSP, General Officer Commanding of the 64 Division graced the occasion as the chief guest.\n\nUnder the guidance of Colonel W.M.P.W.N.D.B Weerakoon RSP USP, Commander, 642 Infantry Brigade, troops of the 23 Vijayabahu Infantry Regiment and the 17 (v) Gajaba Regiment organized the event, supervised closely by respective Commanding Officers of both battalions.\n\nBrigade Commanders of 641 and 642 Brigades, Senior Officers, Officers, the Divisional Secretary of Oddusudan and civilians witnessed the final match."}, {"url": "https://cricketarchive.com/Archive/Scorecards/890/890105.html", "page_content": "Sri Lanka Army Sports Club bowling Overs Mdns Runs Wkts Wides No-Balls Silva 6 0 20 1 1 2 Prasanna 17 4 55 7 - - Wimalasekara 8 3 20 1 - - Palleguruge 4 1 21 0 - - Gunaratne 1 0 3 0 - - Mendis 1 0 11 0 - -\n\nSri Lanka Army Sports Club bowling Overs Mdns Runs Wkts Wides No-Balls Mendis 10 0 67 2 - 2 Prasanna 8 2 61 1 - - Palleguruge 3 0 31 0 - - Wimalasekara 1 0 10 0 - - Gunaratne 3 0 19 0 - - Madushan 1 0 19 0 - -\n\n--> AK Tyronne made his debut in First-Class matches--> WR Palleguruge made his last appearance in First-Class matches--> GSM Ekanayake made his last appearance in First-Class matches--> SL Jayawardene (1) 50 in 141 balls with 6 fours and 1 six--> KDV Wimalasekara (1) 50 in 104 balls with 6 fours and 1 six--> PC Wickramasinghe (1) passed 500 runs in First-Class matches when he reached 15--> LK Fransisco (2) 50 in 137 balls with 7 fours--> AVL Madushan (2) 50 in 118 balls with 4 fours--> DAS Gunaratne (2) 50 in 72 balls with 5 fours and 1 six--> DAS Gunaratne (2) 100 in 102 balls with 12 fours and 3 sixes--> DAS Gunaratne (2) 150 in 161 balls with 15 fours and 4 sixes--> DAS Gunaratne (2) passed 4000 runs in First-Class matches when he reached 95--> SMA Priyanjan (2) 50 in 34 balls with 5 fours and 3 sixes--> SMA Priyanjan (2) passed 4500 runs in First-Class matches when he reached 32--> PWH de Silva (2) 50 in 49 balls with 8 fours--> KMC Bandara achieved his best innings bowling analysis in First-Class matches when he dismissed SL Jayawardene in the Sri Lanka Army Sports Club first innings (previous best was 5-63)"}, {"url": "https://cricketarchive.com/Archive/Events/30/Premier_League_Tournament_Tier_A_2017-18.html", "page_content": "Premier League Tournament Tier A 2017/18\n\nPoints Table Averages: [Batting] [Bowling] [Fielding] Averages by [Team] Highlights\n\nThis page was created by the CricketArchive Oracles"}, {"url": "https://www.sundaytimes.lk/171119/sports/premier-cricket-comes-aboard-from-december-1-269389.html", "page_content": "Premier cricket comes aboard from December 1 View(s):\n\nSri Lanka Cricket will commence its first class season with the three-day Premier League Cricket tournament, 2017/2018 starting December 1. The tournament of 24 clubs will be played in two tiers—A and B.\n\nTier A will consist of the top 14 clubs who will initially play in two groups of seven teams before the top four in each group play against each other in the Super Eight tournament. The remaining six teams will play for the Plate Championships.\n\nThe Super Eight matches will be played across four days and set to begin on January 19, 2018. Kicking off the first class tournament, defending champions SSC will meet bottom ranked Moors in their opening fixture, followed by Saracens vs CCC, Port Authority vs Chilaw Marians, NCC vs Baduraliya, BRC vs Army in Tier A matches starting from December 1. The Tier B matches will also begin simultaneously.\n\nLast year Tier B tournament was rocked by an alleged match-fixing incident unusual match patterns were reported in the match between Kalutara PCC and Panadura SC.\n\nMeanwhile at the end of the Premier League Tournament, country’s top 60 cricketers will play the four-team Super Provincial Tournament, which will sit above the first-class tournament.\n\nThe four teams—Colombo (Colombo, Gampaha, Kalutara), Galle (Galle, Matara, Hambantota, Monaragala, Ratnapura and Badulla), Kandy (Trincomalee, Batticaloa, Ampara, Kandy, Nuwara Eliya, Kegalle) and Dambulla (Jaffna, Kilinochchi, Mullaitivu, Vavuniya, Mannar, Anuradhapura, Polonnaruwa, Puttalam, Kurunegala, Matale)—are based on the four Centers of Excellence being formed around four international venues in each province.\n\nGroup ‘A’ Group ‘B’\n\nSinhalese Sports Club Chilaw Marians CC\n\nRagama Cricket Club Nondescripts Cricket Club\n\nColombo Cricket Club Army Sports Club\n\nColts Cricket Club Tamil Union C & AC\n\nSaracens Sports Club Burgher Recreation Club\n\nBloomfield C & AC Badureliya Cricket Club\n\nMoors Sports Club Sri Lanka Port Authority SC\n\nPremier League Tournament 2017/2018\n\nDec 1-2-3:\n\nSSC vs Moors SC; Ragama CC vs Bloomfield; Saracens SC vs CCC; SLPA SC vs Chilaw Marians; NCC vs Badureliya CC; BRC vs Army SC\n\nDec 8-9-10:\n\nRagama CC vs SSC; Colts CC vs Bloomfield; Moors SC vs Saracens SC; Chilaw Marians vs NCC; Badureliya CC vs Tamil Union; BRC vs SLPA SC\n\nDec 15-16-17:\n\nSSC vs Saracens SC; Colts CC vs Ragama CC; CCC vs Moors SC; Chilaw Marians vs BRC; NCC vs Tamil Union; Army SC vs SLPA SC\n\nDec 22-23-24:\n\nBloomfield vs SSC; Ragama CC vs Saracens SC; CCC vs Colts CC; Chilaw Marians vs Badureliya CC; NCC vs BRC; Army SC vs Tamil Union\n\nDec 28-29-30:\n\nSSC vs CCC; Saracens SC vs Colts CC; Bloomfield vs Moors SC; Chilaw Marians vs Army SC; Tamil Union vs BRC; Badureliya CC vs SLPA SC\n\nJan 5-6-7:\n\nCCC vs Ragama CC; Moors SC vs Colts CC; Saracens SC vs Bloomfield; Army SC vs NCC; SLPA SC vs Tamil Union; BRC vs Badureliya CC\n\nJan 12-13-14:\n\nColts CC vs SSC; Moors SC vs Ragama CC; Bloomfield vs CCC; Tamil Union vs Chilaw Marians; SLPA SC vs NCC; Badureliya CC vs Army SC"}, {"url": "https://www.army.lk/news/eight-civil-sports-clubs-vie-642-infantry-brigade-organized-football-tournament", "page_content": "Eight Civil Sports Clubs Vie in 642 Infantry Brigade-organized Football Tournament\n\nThe 642 Infantry Brigade of the 64 Infantry Division of the Security Forces HQ-Mullaittu (SFHQ-MLT) organized a football tournament all among civil sports clubs in Oddusudan, aimed at enhancing sports skills of the youth and reconciliation between the Security Forces and civilians from 06 April to 11 April.\n\n8 teams of civil sports clubs participated in the tournament that went on throughout the day. The Walarmadee Sports Club and Parandhaman Sport Club teams vied in the final tussle. Players in the Walarmadee Sports club finally won the match amid cheers.\n\nThe final match and award of trophies took place on 11 April at Oddusudan Maha Vidyala playground. Major General H.D.W.K.N Eriyagama RWP RSP, General Officer Commanding of the 64 Division graced the occasion as the chief guest.\n\nUnder the guidance of Colonel W.M.P.W.N.D.B Weerakoon RSP USP, Commander, 642 Infantry Brigade, troops of the 23 Vijayabahu Infantry Regiment and the 17 (v) Gajaba Regiment organized the event, supervised closely by respective Commanding Officers of both battalions.\n\nBrigade Commanders of 641 and 642 Brigades, Senior Officers, Officers, the Divisional Secretary of Oddusudan and civilians witnessed the final match."}, {"url": "https://cricketarchive.com/Archive/Scorecards/890/890105.html", "page_content": "Sri Lanka Army Sports Club bowling Overs Mdns Runs Wkts Wides No-Balls Silva 6 0 20 1 1 2 Prasanna 17 4 55 7 - - Wimalasekara 8 3 20 1 - - Palleguruge 4 1 21 0 - - Gunaratne 1 0 3 0 - - Mendis 1 0 11 0 - -\n\nSri Lanka Army Sports Club bowling Overs Mdns Runs Wkts Wides No-Balls Mendis 10 0 67 2 - 2 Prasanna 8 2 61 1 - - Palleguruge 3 0 31 0 - - Wimalasekara 1 0 10 0 - - Gunaratne 3 0 19 0 - - Madushan 1 0 19 0 - -\n\n--> AK Tyronne made his debut in First-Class matches--> WR Palleguruge made his last appearance in First-Class matches--> GSM Ekanayake made his last appearance in First-Class matches--> SL Jayawardene (1) 50 in 141 balls with 6 fours and 1 six--> KDV Wimalasekara (1) 50 in 104 balls with 6 fours and 1 six--> PC Wickramasinghe (1) passed 500 runs in First-Class matches when he reached 15--> LK Fransisco (2) 50 in 137 balls with 7 fours--> AVL Madushan (2) 50 in 118 balls with 4 fours--> DAS Gunaratne (2) 50 in 72 balls with 5 fours and 1 six--> DAS Gunaratne (2) 100 in 102 balls with 12 fours and 3 sixes--> DAS Gunaratne (2) 150 in 161 balls with 15 fours and 4 sixes--> DAS Gunaratne (2) passed 4000 runs in First-Class matches when he reached 95--> SMA Priyanjan (2) 50 in 34 balls with 5 fours and 3 sixes--> SMA Priyanjan (2) passed 4500 runs in First-Class matches when he reached 32--> PWH de Silva (2) 50 in 49 balls with 8 fours--> KMC Bandara achieved his best innings bowling analysis in First-Class matches when he dismissed SL Jayawardene in the Sri Lanka Army Sports Club first innings (previous best was 5-63)"}]}