{"Sri Lanka named Akila Dananjaya in their Test squad for their series against England in October 2018 but did not play.": [{"url": "https://www.indiatoday.in/sports/t20-world-cup-2021/story/t20-world-cup-lahiru-kumara-akila-dananjaya-included-as-sri-lanka-finalise-squad-1863235-2021-10-10", "page_content": "By India Today Web Desk: Sri Lanka have named Lahiru Kumara, Binura Fernando and Akila Dananjaya in their final 15-man squad for the upcoming ICC Men's T20 Cricket World Cup 2021.\n\nEarlier, Sri Lanka had named 20 players in their probable squad for the T20 World Cup 2021 after adding 5 more names a few days ago. Now, SLC has trimmed the squad to the final 15 with Dasun Shanaka being named captain and Dhananjaya de Silva appointed as the vice-captain.\n\nadvertisement\n\nThe major omissions from the squad are Niroshan Dickwella, Kusal Mendis and Danushka Gunathilaka, who were banned for a year for breaking the Covid-19 protocols on their tour of England in July. Sri Lanka is in Group A of round one matches, which also has Ireland, Namibia, and the Netherlands. Sri Lanka will face Namibia on October 18 in Abu Dhabi.\n\nThe following 15 member final squad was selected by the Cricket Selection Committee to take part in the ICC Men’s #T20WorldCup 2021, which will be played in UAE and Oman from 17th October to 14th November 2021. READ: https://t.co/RfgjaODBwa pic.twitter.com/oEI5UZCdwc — Sri Lanka Cricket (@OfficialSLC) October 10, 2021\n\n\"The following 15 members final squad was selected by the Cricket Selection Committee to take part in the ICC Men's T20 Cricket World Cup 2021, which will be played in UAE and Oman from 17th October to 14th November 2021,\" SLC said in a statement.\n\nSri Lanka will play in two ICC-organised World Cup warm-up games, on October 12 and 14 before commencing its T20 World Cup campaign.\n\nSri Lanka’s 15-man squad for T20 World Cup 2021: Dasun Shanaka(C), Kusal Janith Perera, Dinesh Chandimal, Dhananjaya De Silva (VC), Pathum Nissanka, Charith Asalanka, Avishka Fernando, Bhanuka Rajapaksa, Chamika Karunaratne, Wanindu Hasaranga, Dushmantha Chameera, Lahiru Kumara, Maheesh Theekshana, Akila Dananjaya, Binura Fernando"}, {"url": "https://www.espncricinfo.com/cricketers/akila-dananjaya-574178", "page_content": "Another instalment from Sri Lanka's production line of unorthodox spinners, Akila Dananjaya sparked controversy when he was picked in the preliminary squad for the 2012 T20 World Cup despite never having played a professional match in his life. Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner with astounding control, he had impressed Sri Lanka captain Mahela Jayawardene so much as a net bowler at a practice session that Jayawardene requested he be fast-tracked to the national squad.\n\nDananjaya played three matches of the World Cup, including the final, but went out of favour with the selectors once Jayawardene stepped down from the captaincy.\n\nHe made his comeback in 2017, and took a six-for against India in an ODI that year, and another against South Africa in 2018. In between he made a successful entry into Test cricket, taking four five-wicket hauls in his first six Tests.\n\nIn September 2019, Dananjaya was banned from bowling in international cricket for 12 months because of an illegal bowling action. His return was dramatic - in a T20I in Antigua in March 2021, he took a hat-trick in one over but was carted for six sixes by Kieron Pollard in his next."}, {"url": "https://sports.ndtv.com/icc-t20-world-cup-2021/icc-t20-world-cup-lahiru-kumara-akila-dananjaya-included-as-sri-lanka-finalise-squad-2570782", "page_content": "Sri Lanka on Sunday announced their final 15-member squad for the upcoming ICC men's T20 World Cup. Lahiru Kumara, Binura Fernando and Akila Dananjaya have been included in the final squad by Sri Lanka Cricket (SLC). \"The following 15 member final squad was selected by the Cricket Selection Committee to take part in the ICC Men's T20 Cricket World Cup 2021, which will be played in UAE and Oman from 17th October to 14th November 2021,\" SLC said in a statement. Last month, Mahela Jayawardene was appointed as the consultant of the Sri Lankan squad for the first round of the 2021 T20 World Cup.\n\nSri Lanka will play in two ICC-organised World Cup warm-up games, on October 12 and 14 before commencing its T20 World Cup campaign.\n\nSri Lanka squad:Dasun Shanaka - Captain, Kusal Janith Perera, Dinesh Chandimal, Dhananjaya De Silva - Vice Captain, Pathum Nissanka, Charith Asalanka, Avishka Fernando, Bhanuka Rajapaksa, Chamika Karunaratne, Wanindu Hasaranga, Dushmantha Chameera, Lahiru Kumara, Maheesh Theekshana, Akila Dananjaya, Binura Fernand"}, {"url": "https://www.espncricinfo.com/story/akila-dananjaya-in-sri-lanka-s-emerging-squad-604678", "page_content": "Sri Lanka's new selection panel has chosen Angelo Perera, Tharindu Kaushal and Akila Dananjaya along with 21 other young players\n\nSri Lanka's new selection panel has chosen Angelo Perera Tharindu Kaushal and Akila Dananjaya along with 21 other young players in an emerging squad from which the team for the warm-up match against Bangladesh in Matara will be chosen.\n\nPerera, a 22-year-old middle order batsman, has been in stunning form in the Premier League tournament, having made two aggressive hundreds and an 87 in his three innings so far.\n\nOffspinner Tharindu Kaushal, 19, has also been picked on form during his first season of domestic cricket, in which he has taken 22 List A wickets at 18.63, and 19 first-class scalps at 8.89. His first two first-class matches have yielded three five-wicket hauls. Kaushal was picked in the Sri Lanka squad for the home Tests against New Zealand in November last year, but did not get a game.\n\nDananjaya meanwhile, has been part of Sri Lanka's limited-overs squads since last year's World Twenty20, and has also had a promising debut domestic season so far.\n\nWicketkeeper-batsman and opener Niroshan Dickwella, who was the 2012 schoolboy cricketer of the year, has also had a successful introduction to professional cricket at 19, most notably scoring a match-winning hundred in the inter-provincial limited overs final.\n\nAshen Silva, a 22-year-old opener in a more conservative mould, has been chosen, while middle-order batsman Kithruwan Vithanage, who has scored heavily in the Premier League Tournament so far, also earns a spot.\n\nThe team will be coached by former Sri Lanka wicketkeeper-batsman Romesh Kaluwitharana, and play a three-day match against Bangladesh from March 3-5 to kick off the tour."}, {"url": "http://staging.cricketcountry.com/news/akila-dananjaya-named-in-sri-lanka-squad-for-bangladesh-tests-677755", "page_content": "Akila Dananjaya named in Sri Lanka squad for Bangladesh Tests\n\nIt seems Sri Lanka’s mystery spinner Akila Dananjaya is all set to make his Test debut. He has been included in the 16-member Sri Lanka squad for two-match series against Bangladesh. Dananjaya is Sri Lanka s vital cog in limited-overs cricket. He will be playing amongst spinners like Rangana Herath, Lakshan Sandakan and Dilruwan Perera. Amongst the fast bowlers, Dushmantha Chameera and Lahiru Kumara have been recalled while Dasun Shanaka and Vishwa Fernando have been dropped. They were part of the three-match Test series against India.\n\nSadeera Samarawickrama and Lahiru Thirimanne have been left out. Thirimanne was part of the first two Tests against India. He was, however, dropped in the final game at Delhi. Thirimanne managed to score just a half century from four innings. However, he has been in good form in domestic cricket. Sri Lanka s top-order looks sorted with the return of Danushka Gunathilaka and Kusal Mendis.\n\nWith no Thirimanne, the vice-captaincy duties have been handed over to Suranga Lakmal. So apart from spear heading the pace attack Lakmal would also have to assist Dinesh Chandimal. This is not the first time Lakmal has been handed responsibility. Lakmal has led the Tamil Union in domestic cricket. Meanwhile, Asela Gunaratne who is named in the ODI squad for Bangladesh tri-series is dropped for the Tests.\n\nSri Lanka will begin their journey in Bangladesh with the tri-series followed by the first Test at Chittagong from January 31.\n\nSri Lanka Tests squad: Dinesh Chandimal (c), Niroshan Dickwella (wk), Suranga Lakmal (vc),Dimuth Karunaratne, Angelo Mathews, Danushka Gunathilaka, Kusal Mendis, Dhananjaya de Silva, Roshen Silva, Rangana Herath, Dilruwan Perera, Dushmantha Chameera, Lakshan Sandakan, Akila Dananjaya, Lahiru Gamage and Lahiru Kumara."}, {"url": "https://english.newsnationtv.com/sports/cricket/akila-dananjaya-lasith-malinga-sri-lanka-squad-for-three-match-odi-series-vs-bangladesh-231853.html", "page_content": "highlights Lasith Malinga will retire after the end of the first ODI.\n\nAkila Dananjaya will play for the first time since December 2018.\n\nMalinga is the third-highest wicket-taker for Sri Lanka in ODIs.\n\nNew Delhi:\n\nAkila Dananjaya’s career was at the crossroads after his action was deemed illegal in December 2018. He remodeled his action and was cleared by the International Cricket Council in February 2019 but he was not selected in the World Cup squad. Sri Lanka failed to qualify for the knock-out stages of the tournament as they finished in sixth spot. Ahead of the series against Bangladesh, Dananjaya has been picked in the side as the lone specialist spinner for the three-match ODI series. Apart from Dananjaya, the Sri Lanka selectors named Shehan Jayasuriya, Lahiru Kumara, Wanindu Hasaranga and Dasun Shanaka in their 17-man squad.\n\n\n\nThe match on July 26 will witness the final ODI for Lasith Malinga, who has announced his retirement from the format. Malinga has been picked only in the first match while Shanaka will join the squad for the remaining two matches. Niroshan Dickwella and Dinesh Chandimal continue to be left out of the side.\n\n\n\nPosting a video message to his fans on his wife's Facebook page, Malinga said he felt no ill will towards officials and players who may have tried to push him out of the team. The 35-year-old said he was sidelined by selectors two years ago but was able to prove his value to the national team at the recent World Cup.\n\n\"Friday will be the last day you will see me playing an ODI match,\" Malinga said. \"If you can, please come for the match.\" During practice Tuesday ahead of the first ODI against Bangladesh, Malinga said he hoped to play T20 cricket and had his sights on the 2020 World Cup in Australia. \"I hope to be able to take Sri Lanka to the next T20 World Cup,\" he said.\n\n\n\nMalinga, 35, will leave as Sri Lanka’s third highest wicket-taker in ODI cricket with 335 wickets in 219 innings so far. Only Muttiah Muralitharan (523) and Chaminda Vaas (399) have taken more wickets than Malinga in ODIs for Sri Lanka. He was Sri Lanka’s highest wicket-taker at the World Cup, claiming 13 scalps in seven innings. Malinga retired from Test cricket in 2010 but continued to remain available in other formats since then.\n\n\n\nSquad: Dimuth Karunaratne (capt), Kusal Perera, Avishka Fernando, Kusal Mendis, Angelo Mathews, Lahiru Thirimanne, Shehan Jayasuriya, Dhananjaya de Silva, Dasun Shanaka (Only 2nd and 3rd ODI), Wanindu Hasaranga, Akila Dananjaya, Amila Aponso, Lasith Malinga (only 1st ODI), Nuwan Pradeep, Kasun Rajitha, Lahiru Kumara, Thisara Perera, Isuru Udana."}, {"url": "https://www.espn.co.uk/cricket/story/_/id/25329013/uncapped-nishan-peiris-replaces-akila-dananjaya-sri-lanka-squad-third-test", "page_content": "Uncapped offspinner Nishan Peiris has been drafted in to the Sri Lanka squad for the third Test against England, which is set to begin on November 23 in Colombo.\n\nThe 21 year-old Peiris replaces Akila Dananjaya, who is set to undergo a bowling-action assessment at the National Cricket Centre in Brisbane on November 23.\n\nDananjaya was reported for a suspect action following the first Test in Galle, and was given 14 days to respond to the charges, which allowed him to play the second Test in Pallekele last week.\n\nPeiris has picked up 38 wickets in 12 first-class matches at an average of 29.52, having made his debut for Badureliya Sports Club in 2016. He played for the Sri Lanka Board XI in both of England's warm-up games before the Test series, picking up the wickets of Ben Stokes, Jos Buttler and Moeen Ali in the first match."}, {"url": "https://apnews.com/article/9df64e66f2a7461aac97d997b5cb849e", "page_content": "England's Joss Buttler, right, runs between wickets as Sri Lanka's Akila Dananjaya watches during the first day of the first test cricket match between Sri Lanka and England, in Galle, Sri Lanka, Tuesday, Nov. 6, 2018. (AP Photo/Eranga Jayawardena)\n\nEngland's Joss Buttler, right, runs between wickets as Sri Lanka's Akila Dananjaya watches during the first day of the first test cricket match between Sri Lanka and England, in Galle, Sri Lanka, Tuesday, Nov. 6, 2018. (AP Photo/Eranga Jayawardena)\n\nKANDY, Sri Lanka (AP) — Sri Lanka has backed Akila Dananjaya for the second test against England from Wednesday despite the offspinner being reported for a suspect bowling action.\n\nDananjaya was reported to the International Cricket Council by the match officials after the first test, in which he took two wickets in 38.5 overs. Sri Lanka lost by 211 runs. He’s eligible for the second test but needs to be tested within 14 days of being reported.\n\n“I talked to him and said don’t worry about anything, just focus on this game,” Sri Lanka stand-in captain Suranga Lakmal said on Tuesday. “He’s bowled well in the past and he has to do that again. Getting reported is just another thing. Forget that and bowl well in this game.”\n\nEngland captain Joe Root wasn’t worried about Dananjaya either.\n\n“Ultimately, for us, we played him at Galle pretty well. Try to do the same this time round,” Root said. “If you see anyone with a question mark by their action, you hope they get through and it doesn’t hamper their career. Never nice to see.”\n\nEngland confirmed it will play an unchanged side, and Ben Stokes would swap places with Moeen Ali to bat at No. 3, and Ali in the middle order. Ben Foakes, who made a man-of-the-match debut in Galle for injured wicketkeeper Jonny Bairstow, was retained.\n\nBairstow remained on tour after hurting his ankle while playing football during the limited-overs leg.\n\nStuart Broad, who was left out of the Galle test as England banked on three spinners, was expected to play the second test, but the dry nature of the Pallekele pitch has resulted in the tourists sticking to three spinners.\n\nEngland has not won a test series in Sri Lanka in 17 years, and is favored to do so.\n\nSri Lanka has been forced to make two changes.\n\nCaptain Dinesh Chandimal was nursing a hamstring injury and Roshen Silva looks set to bat. Charith Asalanka has come into the squad but was not expected to play in Kandy.\n\nAfter Rangana Herath’s retirement following the Galle test, left-arm orthodox spinner Malinda Pushpakumara or left-arm wrist spinner Lakshan Sandakan will fill Herath’s spot.\n\nSri Lanka has struggled at Pallekele since it became the new international ground in Kandy, after test cricket was taken away from Asgiriya in 2007. Sri Lanka has played six games here and won only one.\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports"}, {"url": "https://www.espncricinfo.com/story/sri-lanka-s-akila-dananjaya-reported-for-suspect-bowling-action-1164871", "page_content": "The Sri Lanka spinner is required to undergo testing on his action within 14 days, but can bowl in international cricket until the results of the tests are out\n\nHe is required to undergo testing on his action within 14 days, but can bowl in international cricket until the results of the tests are out, the ICC said.\n\nThe second Test against England begins on November 14 in Pallekele, so Dananjaya will be eligible to bowl in that match if selected to play. He took only two wickets in the first Test in Galle."}, {"url": "https://indianexpress.com/article/sports/cricket/sri-lanka-vs-england-sri-lanka-back-suspect-spinner-akila-dananjaya-for-second-test-5444925/", "page_content": "Dananjaya was reported to the International Cricket Council by the match officials after the first Test, in which he took two wickets in 38.5 overs. (AP Photo) Dananjaya was reported to the International Cricket Council by the match officials after the first Test, in which he took two wickets in 38.5 overs. (AP Photo)\n\nSri Lanka has backed Akila Dananjaya for the second Test against England from Wednesday despite the offspinner being reported for a suspect bowling action. Dananjaya was reported to the International Cricket Council by the match officials after the first Test, in which he took two wickets in 38.5 overs. Sri Lanka lost by 211 runs. He’s eligible for the second Test but needs to be tested within 14 days of being reported.\n\n“I talked to him and said don’t worry about anything, just focus on this game,” Sri Lanka stand-in captain Suranga Lakmal said on Tuesday. “He’s bowled well in the past and he has to do that again. Getting reported is just another thing. Forget that and bowl well in this game.”\n\nEngland captain Joe Root wasn’t worried about Dananjaya either. “Ultimately, for us, we played him at Galle pretty well. Try to do the same this time round,” Root said. “If you see anyone with a question mark by their action, you hope they get through and it doesn’t hamper their career. Never nice to see.”"}]}