{"Sri Lanka participated in the 2018 ACC Emerging Teams Asia Cup.": [{"url": "https://wikimili.com/en/2018_ACC_Emerging_Teams_Asia_Cup", "page_content": "The 2010 ICC Under-19 Cricket World Cup was the eighth edition of the Under-19 Cricket World Cup and took place in New Zealand. Since 1998, the tournament has been held every 2 years. This edition had 16 teams competing in 44 matches between 15 and 30 January 2010. These included the 10 ICC Full Members and 6 Qualifiers. The tournament was originally scheduled to take place in Kenya, but the International Cricket Council (ICC) moved it to New Zealand after an inspection in June 2009 found that it would be unrealistic to expect Kenya to complete preparations in time.\n\nThe 2014 ICC Under-19 Cricket World Cup was a one-day cricket competition for sixteen international U-19 cricketing teams which was played in the United Arab Emirates. This was the tenth edition of the tournament. Sixteen nations competed: the ten Test-playing teams, the United Arab Emirates as hosts, and five additional associate and affiliate qualifiers. India entered the tournament as defending champions, having won the title in 2012 in Australia under the captaincy of Unmukt Chand. In the final, South Africa beat Pakistan by six wickets to win the tournament. South Africa captain Aiden Markram was awarded Man of the Series.\n\nThe 2014 Asia Cup was the twelfth edition of the Asia Cup cricket tournament. The tournament was held in Bangladesh from 25 February to 8 March 2014. Pakistan were the defending champions, having won the previous tournament. The tournament included the four Asian test-playing nations, Bangladesh, India, Pakistan and Sri Lanka; and ICC Asian Associate member Afghanistan. This was the first 50-over tournament in which Afghanistan took part. Ten league matches were played along with the final. The title sponsors of the tournament were Arise India and it was powered by Cycle Agarbathis. Sri Lanka Beat Pakistan in the final to become Asia Cup champions for the fifth time.\n\nThe 2008 Women's One-Day Internationals Asia Cup was the fourth edition of the ACC Women's Asia Cup, a Women's One Day International cricket tournament organized by the Asian Cricket Council. Four teams took part in the tournament: Bangladesh, India, Pakistan and Sri Lanka. It was held between 2 May and 11 May 2008, in Sri Lanka. The matches were played at the Welagedara Stadium and Rangiri Dambulla International Stadium. India won the final against Sri Lanka by 177 runs.\n\nThe 2013 ACC Emerging Teams Cup was the first edition of the ACC Emerging Teams Asia Cup was held in Singapore. Eight teams participated in the tournament, comprising four under-23 teams from Test nations and four top associate teams from Asia.\n\nThe 2021 ICC Men's T20 World Cup was the seventh ICC Men's T20 World Cup tournament, with the matches played in the United Arab Emirates and Oman from 17 October to 14 November 2021. The West Indies were the defending champions, but were eventually eliminated in the Super 12 stage.\n\nThe 2015 ACC Twenty20 Cup was an international cricket tournament that was held between 25–30 January 2015 in the United Arab Emirates. Oman won the round-robin tournament and qualified for the 2015 ICC World Twenty20 Qualifier, along with Afghanistan, Hong Kong, Nepal and UAE who did not play in this tournament as their T20I status had qualified them directly to the 2015 ICC World Twenty20 Qualifier to be held in Ireland and Scotland. The full members of the ACC automatically qualify for the 2016 ICC World Twenty20 tournament.\n\nThe 2016 Asia Cup was a Twenty20 International (T20I) cricket tournament that was held in Bangladesh from 24 February to 6 March 2016. It was the 13th edition of the Asia Cup, the fifth to be held in Bangladesh, and the first to be played using the T20I format. Bangladesh hosted the tournament for the third consecutive time after 2012 and 2014. Micromax was the main sponsor of the tournament after 2012.\n\nThe 2018 Asia Cup was a One-Day International (ODI) cricket tournament that was held in the United Arab Emirates in September 2018. It was the 14th edition of the Asia Cup and the third time the tournament was played in the United Arab Emirates, after the 1984 and 1995 tournaments. India were the defending champions, and retained their title, after beating Bangladesh by three wickets in the final.\n\nThe 2018 ICC Under-19 Cricket World Cup was an international limited-overs cricket tournament that was held in New Zealand from 13 January to 3 February 2018. It was the twelfth edition of the Under-19 Cricket World Cup, and the third to be held in New Zealand. New Zealand was the first country to host the event three times. The opening ceremony took place on 7 January 2018. The West Indies were the defending champions. However, they failed to defend their title, after losing their first two group fixtures.\n\nThe 2020 ICC Under-19 Cricket World Cup was an international limited-overs cricket tournament that was held in South Africa from 17 January to 9 February 2020. It was the thirteenth edition of the Under-19 Cricket World Cup, and the second to be held in South Africa. Sixteen teams took part in the tournament, split into four groups of four. The top two teams from each group advanced to the Super League, with the bottom two teams in each group progressing to the Plate League. India were the defending champions.\n\nThe 2016 Women's Twenty20 Asia Cup was the sixth edition of the ACC Women's Asia Cup, organized by the Asian Cricket Council. It took place from 26 November to 4 December 2016, in Thailand, and was the second edition played as a 20-over tournament. Matches were played at the Asian Institute of Technology Ground and the Terdthai Cricket Ground.\n\nThe Sri Lanka cricket team toured the United Arab Emirates in September and October 2017 to play two Tests, five One Day Internationals (ODIs) and three Twenty20 International (T20I) matches against the Pakistan cricket team. It included the first Tests that Sarfaraz Ahmed of Pakistan captained following the retirement of Misbah-ul-Haq. The tour also featured a T20I match in Pakistan, the first time that Sri Lanka had visited the country since 2009.\n\nThe 2017 ACC Emerging Teams Asia Cup was the second edition of the ACC Emerging Teams Asia Cup held in Bangladesh. Eight teams participated in the tournament including four under-23 age level teams of Test nations and four top associate teams from Asia.This Competition was organized by ACC.\n\nThe 2018 Under-19 Asia Cup was the 7th edition of ACC Under-19 Cup. The cricket tournament was held in Bangladesh from 29 September to 7 October at Chittagong and Cox's Bazar. 8 teams participated in the tournament, including 5 full members and three qualifiers. Afghanistan were the defending champions but failed to defend their title after a loss against Sri Lanka in the semi-finals. India defeated Sri Lanka by 144 runs in the final to win the tournament for the 6th time.\n\nThe 2018 Asia Cup Qualifier was a cricket tournament that was held in Malaysia from 29 August to 6 September 2018. The event served as the qualifier for the 2018 Asia Cup. The top two teams from the group stage met in the final, with the winner progressing to the 2018 Asia Cup. The fixture between the United Arab Emirates and Nepal on 30 August 2018 was a One Day International (ODI) match. It was the first time both sides had played each other in an ODI match, with the UAE going on to win the fixture by 78 runs.\n\nThe 2018 Women's Twenty20 Asia Cup was the seventh edition of the ACC Women's Asia Cup, organized by the Asian Cricket Council (ACC). It took place between 3 and 10 June 2018 in Malaysia, and was the third edition played as a 20-over tournament. The tournament was contested between Bangladesh, India, Malaysia, Pakistan, Sri Lanka and Thailand. India were the defending champions.\n\nThe 2019 Under-19 Asia Cup was the 8th edition of ACC Under-19 Cup. The cricket tournament was held in Sri Lanka from 5 to 15 September 2019. 8 teams participated in the tournament, including 5 full members and three qualifiers.\n\nThe 2019 ACC Emerging Teams Asia Cup was the fourth edition of the ACC Emerging Teams Asia Cup held in Bangladesh between 14 and 23 November 2019. Eight teams participated in the tournament, including five under-23 age level teams of Test nations and the top three teams from the 2018 Asia Cup Qualifier. The tournament was organized by the Asian Cricket Council (ACC). Nepal replaced the United Arab Emirates, after they pulled out due to an unknown reason. Nepal qualified on virtue of being fourth in the Asia Cup qualifier."}, {"url": "https://www.cricketzine.com/acc-emerging-teams-asia-cup-2018-squads-players-list/", "page_content": "ACC Emerging Teams Asia Cup 2018 Squads, Players List\n\nACC Emerging Teams Asia Cup 2018 is a 50-overs cricket tournament that is contested between Asian Countries having test status at International level. 2018 ACC Emerging Teams Asia Cup is scheduled to be held from December 06 to December 15 in Sri Lanka and Pakistan.\n\nThe 2018 Emerging Team’ Asia Cup will be co-hosted by Pakistan and Sri Lanka. Initially, the tournament slated for April, but it has been moved to December. The final of the Emergent Trophy will be played in Sri Lanka, and the matches involving Pakistan and India will be played at their respective home grounds.\n\nACC Emerging Teams Asia Cup 2018 features fifteen matches (12 matches in group stage, two semi-finals, and the grand final), teams are clubbed in two groups. Sri Lanka, Afghanistan, India, and Oman in Group A while Pakistan, Bangladesh, Hong Kong, United Arab Emirates in group B.\n\nGroup A: Sri Lanka U23, Oman, India U23, Afghanistan\n\nSri Lanka U23, Oman, India U23, Afghanistan Group B: Pakistan U23, Hong Kong, Bangladesh U23, United Arab Emirates\n\nSri Lanka Emerging Squad: Charith Asalanka (c), Shammu Ashan, Avishka Fernando, Kamindu Mendis, Hasitha Boyagoda, Sandun Weerakkody, Asitha Fernando, Asela Gunaratne, Nishan Madushka, Jeffrey Vandersay, Lasith Embuldeniya, Nishan Peiris, Shehan Madushanka, Jehan Daniel, Chamika Karunaratne\n\nUnited Arab Emirates Squad: Rohan Mustafa (c), Ahmed Raza, Ashfaq Ahmed, Amir Hayat, Fahad Nawaz, Ghulam Shabber, Imran Haider, Mohammad Boota, Zahoor Khan, Mohammad Naveed, Muhammad Usman, Qadeer Ahmed, Rameez Shahzad, Shaiman Anwar, Tahir Latif\n\nHong Kong Squad: Aizaz Khan (c), Anshuman Rath, Aftab Hussain, Nizakat Khan, Arshad Mohammad, Raag Kapur, Babar Hayat, Ehsan Khan, Ehsan Nawaz, Hamed Khan, Mohammad Hassan, Shahid Wasif, Tanveer Ahmed, Tanwir Afzal, Waqas Khan, Mohammad Ghazanfar\n\nOman Squad: Zeeshan Maqsood (c), Twinkal Kumar Bhandari, Aqib Ilyas, Suraj Kumar, Bilal Khan, Nestor Dhamba, Ahmad Fayyaz Butt, Jatinder Singh, Jayesh Odedra, Kaleemullah, Khawar Ali, Ajay Lalcheta, Moonamchery Michal, Mohammad Nadeem, Wasim Ali\n\nIndia U23 Squad: Jayant Yadav (c), Ankush Bains, Ruturaj Gaikwad, Himmat Singh, Siddharth Desai, Deepak Hooda, Mayank Markande, Shams Mulani, Prasidh Krishna, PrabhSimran Singh, Ankit Rajpoot, Nitish Rana, Atit Sheth, Shivam Mavi, Atharwa Taide\n\nPakistan U23 Squad: Sahibzada Farhan, Zeeshan Malik, Ali Imran, Ghulam Mudassar, Hussain Talat, Saad Ali, Khushdil Shah, Saud Shakeel, Mohammad Rizwan (c), Ashiq Ali, Mohammad Asghar, Sameen Gul, Muhammad Musa, Muhammad Ilyas, Suleman Shafqat\n\nBangladesh U23 Squad: Nurul Hasan (c), Afif Hossain, Mizanur Rahman, Saif Hassan, Mohor Sheikh, Mosaddek Hossain, Nayeem Hasan, Nazmul Hossain Shanto, Qazi Onik, Shafiul Islam, Shoriful Islam, Khaled Ahmed, Tanvir Islam, Yasir Ali, Zakir Hasan\n\nAfghanistan 23 Squad: Najibullah Zadran (c), Azmatullah Omarzai, Rahmanullah Gurbaz, Darwish Rasooli, Ibrahim Zadran, Ihsanullah Janat, Ikram Ali Khil, Karim Janat, Nasir Jamal, Qais Ahmad, Shahidullah Kamal, Wafadar, Zahir Khan, Zia-ur-Rehman, Fazal Haque"}, {"url": "https://www.thepapare.com/charith-asalanka-lead-sri-lanka-emerging-teams-asia-cup-2018/", "page_content": "Charith Asalanka has been appointed as the captain of the emerging squad of Sri Lanka which will take part in the Emerging Teams Asia Cup. Sammu Ashan will be his deputy while Asela Gunaratne and Sandun Weerakkody have also been called up.\n\nDefending champions, Sri Lanka is co-hosting the tournament with Pakistan. The tournament begins on the 6th of December.\n\nFormer Sri Lanka under-19 captain, Charith Asalanka was very impressive in the recently concluded SLC Major Emerging League. He was the chief architect in his club’s way to the title. He slammed a swashbuckling century in the finals to see his team home by first-innings points. He was also the Man of the Series in last year’s edition of the Emerging Teams Asia Cup.\n\nSandun Weerakkody and Charith Asalanka put SSC on top The final match of the Sri Lanka Cricket Major Emerging League Tournament 2018 commenced today at R Premadasa…\n\nAssisting him will be another promising prospect in the domestic circuit, Sammu Ashan. Asela Guneratne, who couldn’t find a spot back in the Sri Lankan team after his fall out in January due to injury, has also been selected to this squad.\n\nSinhalese Sports Club crowned Major Emerging League champions Sinhalese Sports Club was crowned champions of the Sri Lanka Cricket Major Emerging League Tournament 2018…\n\nExplosive left-hander Sandun Weerakkody, who was out of the Sri Lankan squad ever since his debut tour to South Africa has also finally come under the radar of the selectors again following his prolific run in the SLC Major Emerging League 2018.\n\nThe schoolboy, Nishan Madushka, who just finished his Sri Lanka U19 career has also been added in the squad while the rest of the squad is mostly the one that played against the South African emerging team in August, this year."}, {"url": "https://www.sundayobserver.lk/2023/06/11/sports/sri-lanka-women-contest-emerging-teams-asia-cup", "page_content": "Sathya Sandeepani will lead a 14 member Sri Lanka team that will take part in the Women’s Emerging Teams Asia Cup 2023 scheduled to begin in Hong Kong next week.\n\nThe squad also features the talented Vishmi Gunaratne, Umasha Thimeshani, Malsha Shehani, Sachini Nisansala, Imesha Dulani and Tharika Sewwandi.\n\nThe ACC Emerging teams event will see the National ‘A’ teams of Bangladesh, India, Pakistan, Sri Lanka, Thailand along with the National teams of Hong Kong, China, Malaysia and UAE compete in two groups. The top two teams from each group will qualify to the semi-finals.\n\nGroup A – India, Pakistan, China, Hong Kong\n\nGroup B – Sri Lanka, Bangladesh, UAE, Malaysia\n\nSri Lanka Match Schedule:\n\nJune 12 - Vs UAE\n\nJune 14 - Vs Bangladesh\n\nJune 16 - Vs Malaysia\n\nSri Lanka squad: Sathya Sandeepani (captain), Malsha Shehani, Vishmi Gunaratne, Umasha Thimeshani, Imesha Dulani, Piyumi Wathsala, Sachini Nisansala, Kaushini Nuthyangana, Tharika Sewwandi, Nimesha Madhushani, Nilakshana Sandamini, Madhushika Meththananda, Rashmi Silva, Dewmi Vihanga. (YK)"}, {"url": "https://playerswiki.com/chamika-karunaratne", "page_content": "Sri Lankan cricket and badminton player Chamika Karunaratne plays domestically for Nondescripts Cricket Club, and he also represents the Sri Lankan team. He is a right-handed astonishing bowling all-rounder. The emerging Sri Lankan cricketer has experience playing for several exotic cricket teams. Since 2017, Karunaratne originally represented the Nondescripts.\n\nThe Sri Lankan all-rounder has been playing cricket for some time and made his national team debut on February 1, 2019. Along with cricket, Chamika Karunaratne works in a number of other fields. After making his international cricket debut, Chamika played for Sri Lanka in all three forms of the game, with the most recent match occurring on June 24, 2022. He has earned 148 test caps, 196 ODI caps and 88 T20I caps.\n\nEarly Life and Parents\n\nEdirimuni Chamika Dinushan Perera Karunaratne, professionally known as Chamika Karunaratne was born on May 29, 1996, in Colombo, Sri Lanka, to his parents. Louis Karunaratne is his father's name and his mother's name is not known. He has two siblings; Dinuka Karunaratne and Niluka Karunaratne. Dinuka and Nikula both are professional Sri Lankan badminton players and represent Sri Lanka at international levels.\n\n\n\nKarunaratne was born and nourished in Sri Lanka, where he attended elementary school. He went to Royal College for his higher studies. Karunaratne is also Sri Lankan-national, and his peak point is 5 feet 9 inches (1.80m). Sri Lankan passport is held by Chamika Karunaratne. Karunaratne has short dark hair, black eyes, and a 72 kg weight.\n\nKarunaratne's Domestic Career\n\nOn December 18, 2015, he made his first-class debut for the Tamil Union Cricket and Athletic Club during the 2015–16 Premier League Tournament. He was included on Kandy's roster for the 2017–18 Super Four Provincial Tournament in March 2018. He was included in Kandy's team for the 2018 SLC T20 League in August of that year. He was included in a preliminary team of 31 players for the 2018 Asia Cup by Sri Lanka Cricket that same month.\n\nHe was included in Colombo's roster for the 2019 Super Provincial One Day Tournament in March. He was selected to play for the SLC Reds in the 2021 SLC Invitational T20 League competition in August of that year. He was chosen in the players' draft for the 2021 Lanka Premier League to play for the Dambulla Giants in November 2021. He was purchased by the Kolkata Knight Riders in the auction for the 2022 Indian Premier League competition in February 2022. He was acquired by the Kandy Falcons in July 2022 for the third Lanka Premier League season.\n\nInternational Career\n\nHe was included on Sri Lanka's roster for the 2018 ACC Emerging Teams Asia Cup in December 2018. He was included in Sri Lanka's Test team in January 2019 in time for the second Test against Australia. On February 1st, 2019, he played his first Test for Sri Lanka against Australia. He was included in the Sri Lankan ODI team for their series against Bangladesh in May 2021.\n\nOn May 28, 2021, he played in his first ODI for Sri Lanka against Bangladesh. He was included in Sri Lanka's lineup for their series against India in July 2021. He made his Twenty20 International (T20I) debut on 25 July 2021, for Sri Lanka against India. Karunaratne was selected for the Sri Lankan team to compete in the ICC Men's T20 World Cup in September 2021.\n\nAlso See: Sadeera Samarawickrama\n\nBesides Domestic and International Career\n\nJavelin threw junior national champion Chamika Karunaratne also played international badminton. His brothers Dinuka, Niluka, and Diluka, as well as his father Louie Karunaratne, are also accomplished, badminton players.\n\nHe participated in the men's singles first-round matches at the Sri Lankan Badminton Nationals in February 2021 with his older brother, Niluka Karunaratne, the top badminton player in Sri Lanka.\n\nSalary and Net Worth\n\nChamika Karunaratne makes a comfortable living playing professional cricket and badminton. Karunaratne has competed in a number of international events, and his successes there must have contributed to his financial success. Chamika Karunaratne makes the most of his money when competing for clubs.\n\nChamika earns a respectable wage being a member of Sri Lanka's national cricket team. When Chamika plays for Sri Lanka, he earns a basic wage of $35,000 plus additional payments of $7,500, $5,500, and $3,500 for Test, ODI, and T20I matches, respectively. Additionally, Chamika is compensated by the numerous international teams he has before played with.\n\nChamika showing his iPhone after a paid partnership with SOURCE: [email protected]\n\nChamika has also played the latest season of the Indian Premier League. He was associated with Kolkata Knight Riders. He earned around 50 lakh INR playing for Knight Riders. Chamika Karunaratne, who is quite wealthy, unquestionably lives a lavish lifestyle. His estimated net worth is $5 million based on this. He does, however, have ties to a number of athletic associations. Karunaratne has undoubtedly profited financially from expanding his company.\n\nLearn the biography, marital status and salary of Charith Asalanka\n\nKarunaratne's Relationship Status\n\nChamika Karunaratne is a naturally reserved and shy person who becomes more so in an amorous mood. He has kept his love relationships a secret due to his shy attitude. It is challenging to identify Chamika's current relationship status because he has never been reported as being in one.\n\nChamika may be seeing someone else and keeping it a secret till the proper moment. Chamika could not have the leisure to socialize because of his unwavering commitment to his career. Chamika Karunaratne is no longer in a relationship despite the lack of specifics.\n\nSocial Media Presence\n\nChamika is a talented all-rounder who enjoys using social media a lot. On social media, Chamika enjoys sharing daily updates about his life. Among other social networks, Instagram is Karunarathe's favorite. @chamikakarunaratne is the username of Karunaratne's verified Instagram account, which also has a blue checkmark.\n\nAlthough Chamika uses Twitter as well, he tends to use Instagram more frequently. Chamika has the username @ChamikaKaru29 on Twitter. He has 125k Instagram followers and 100 followers on Twitter. He is also regarded as one of Sri Lanka's and Nondescripts' best players.\n\nStay Tuned With Playerswiki"}, {"url": "https://www.cricketzine.com/asia-cup-2018-live-scores-schedule-squads-points-table-tv-guide/", "page_content": "Asia Cup 2018 Live Scores, Schedule, Squads, Points Table, Live Streaming & TV Channel\n\nThe 2018 Asia Cup will be a One Day International (ODI) cricket tournament scheduled to be held in the United Arab Emirates in September 2018. Asia Cup 2018 will be the 14th edition of the Asia Cup and the third time the tournament will be played in the United Arab Emirates, after the 1984 and 1995 tournaments. India are the defending champions. Originally, the tournament was scheduled to be played in India. It was moved to the United Arab Emirates, following ongoing political tensions between India and Pakistan.\n\nOn 29 October 2015, following the Asian Cricket Council (ACC) meeting in Singapore, Board of Control for Cricket in India (BCCI) secretary stated that the 2018 edition of the tournament would be held in India. In August 2017, the BCCI sought government clearance to host the tournament, after the 2017 ACC Under-19 Asia Cup was moved to Malaysia. In April 2018, Mohammed bin Zayed Al Nahyan, the Crown Prince of Abu Dhabi, asked if the BCCI and ACC would consider hosting the tournament in Abu Dhabi, in a bid to ensure Pakistan’s participation.\n\nPakistan were scheduled to host the 2018 ACC Emerging Teams Asia Cup ahead of the tournament in April with the announcement that the Asia Cup would be played in the United Arab Emirates, the Emerging Teams Asia Cup was moved to December 2018, with Sri Lanka scheduled to co-host the tournament with Pakistan.\n\nStar Sports to broadcast live coverage of ACC Asia Cup 2018 in India and its subcontinent (Sri Lanka, Afghanistan, Nepal, Bangladesh, Pakistan, Maldives, and Bhutan) countries; all matches streamed live in the Indian subcontinent on Hotstar digital platform (Website, App).\n\nGroup A: India, Pakistan, Hong Kong\n\nGroup B: Bangladesh, Sri Lanka, Afghanistan\n\nMatches Schedule as follows:\n\n\n\nDate: September 15, 2018\n\nMatch: Bangladesh vs Sri Lanka, 1st ODI, Group B\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 16, 2018\n\nMatch: Pakistan vs Hong Kong, 2nd ODI, Group A\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 17, 2018\n\nMatch: Sri Lanka vs Afghanistan, 3rd ODI, Group B\n\nVenue: Sheikh Zayed Stadium, Abu Dhabi\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 18, 2018\n\nMatch: India vs Hong Kong, 4th ODI, Group A\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 19, 2018\n\nMatch: India vs Pakistan, 5th ODI, Group A\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 20, 2018\n\nMatch: Bangladesh vs Afghanistan, 6th ODI, Group B\n\nVenue: Sheikh Zayed Stadium, Abu Dhabi\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 21, 2018\n\nMatch: India vs Bangladesh, 1st Super Four\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 21, 2018\n\nMatch: Pakistan vs Afghanistan, 2nd Super Four\n\nVenue: Sheikh Zayed Stadium, Abu Dhabi\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 23, 2018\n\nMatch: India vs Pakistan, 3rd Super Four\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 23, 2018\n\nMatch: Afghanistan vs Bangladesh, 4th Super Four\n\nVenue: Sheikh Zayed Stadium, Abu Dhabi\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 25, 2018\n\nMatch: India vs Afghanistan, 5th Super Four\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 26, 2018\n\nMatch: Pakistan vs Bangladesh, 6th Super Four\n\nVenue: Sheikh Zayed Stadium, Abu Dhabi\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nDate: September 28, 2018\n\nMatch: India vs Bangladesh, Final\n\nVenue: Dubai International Cricket Stadium, Dubai\n\nTime: 11:30 AM GMT, 03:30 PM Local, 05:00 PM IST\n\nTeam Squads for ACC Asia Cup 2018\n\n\n\nAfghanistan\n\nBangladesh\n\nIndia\n\nPakistan\n\nSri Lanka\n\nHong Kong (2018 Asia Cup Qualifier)\n\nAfghanistan Squad: Asghar Afghan (c), Aftab Alam, Javed Ahmadi, Mohammad Shahzad, Ihsanullah Janat, Rahmat Shah, Hashmatullah Shahidi, Mohammad Nabi, Gulbadin Naib, Rashid Khan, Sayed Shirzad, Najibullah Zadran, Mujeeb Ur Rahman, Samiullah Shenwari, Munir Ahmad, Sharafuddin Ashraf, Yamin Ahmadzai\n\nBangladesh Squad: Shakib Al Hasan, Mohammad Mithun, Tamim Iqbal, Mashrafe Mortaza (c), Liton Das, Mushfiqur Rahim, Ariful Haque, Mahmudullah, Abu Hider Rony, Mosaddek Hossain, Mehidy Hasan, Nazmul Islam, Rubel Hossain, Mustafizur Rahman, Nazmul Hossain Shanto\n\nIndia Squad: Rohit Sharma (c), Lokesh Rahul, Shikhar Dhawan, Ambati Rayudu, Manish Pandey, Kedar Jadhav, MS Dhoni, Dinesh Karthik, Hardik Pandya, Shardul Thakur, Kuldeep Yadav, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Jasprit Bumrah, K Khaleel Ahmed\n\nPakistan Squad: Sarfraz Ahmed (c), Fakhar Zaman, Imam-ul-Haq, Babar Azam, Shan Masood, Shoaib Malik, Haris Sohail, Shadab Khan, Hasan Ali, Mohammad Nawaz, Faheem Ashraf, Junaid Khan, Usman Khan, Shaheen Afridi, Asif Ali, Mohammad Amir\n\nHong Kong Squad: Anshuman Rath (c), Aizaz Khan, Babar Hayat, Christopher Carter, Cameron McAulsan, Ehsan Khan, Ehsan Nawaz, Arshad Mohammad, Kinchit Shah, Waqas Khan, Nadeem Ahmed, Nizakat Khan, Raag Kapur, Scott McKechnie, Tanveer Ahmed, Tanwir Afzal, Aftab Hussain\n\nSri Lanka Squad: Angelo Mathews (c), Kusal Perera, Kusal Mendis, Dhananjaya de Silva, Upul Tharanga, Danushka Gunathilaka, Lasith Malinga, Thisara Perera, Dasun Shanaka, Akila Dananjaya, Dinesh Chandimal, Dilruwan Perera, Amila Aponso, Kasun Rajitha, Suranga Lakmal, Dushmantha Chameera\n\nACC Asia Cup 2018 Points Table, Team Standings (PLD – Played Matches, PTS – Points)\n\n4 points awarded for each match won\n\n2 point per team taking part in any match with no result and any match which is tied (super over not possible or super over also tied)\n\n0 points awarded for any match lost."}, {"url": "https://www.famousfix.com/list/asian-cricket-council-competitions", "page_content": "0 0\n\nrank #2 ·\n\nThe 2018 Under-19 Asia Cup was the 7th edition of ACC Under-19 Cup. The cricket tournament was held in Bangladesh from 29 September to 7 October at Chittagong and Cox's Bazar. 8 teams participated in the tournament, including 5 full members and three qualifiers. Afghanistan were the defending champions but failed to defend their title after a loss against Sri Lanka in the semi-finals. India defeated Sri Lanka by 144 runs in the final to win the tournament for the 6th time."}, {"url": "https://www.brandsynario.com/asia-cup-2018-schedule-venues-teams-more/", "page_content": "Update: Pakistan Cricket Board has selected the 16-member squad for Asia Cup 2018. The PCB announced the final list on Twitter.\n\nThe members are:\n\nSarfraz Ahmed (Captain) Fakhar Zaman Shoaib Malik Mohammad Amir Shadab Khan Imam ul Haq Shan Masood Babar Azam Asif Ali Haris Sohail Mohammad Nawaz Fahim Ashraf Hasan Ali Junaid Khan Usman Shinwari Shaheen Afridi\n\nPakistan 16 member squad for Asia Cup 2018 announced. Sarfraz Ahmed (Captain)\n\nFakhar Zaman\n\nShoaib Malik\n\nMohammad Amir\n\nShadab Khan\n\nImam ul Haq\n\nShan Masood\n\nBabar Azam\n\nAsif Ali\n\nHaris Sohail\n\nMohammad Nawaz\n\nFahim Ashraf\n\nHasan Ali\n\nJunaid Khan\n\nUsman Shinwari\n\nShaheen Afridi — PCB Official (@TheRealPCB) September 4, 2018\n\nThe upcoming Asia Cup 2018 tournament is just around the corner. Teams are eager to get their hands on the beautiful trophy!\n\nAfter the success of Pakistan in Champions Trophy 2017, it is one of the favourites which will play against other teams, including its rival, India!\n\nAsia Cup 2018 Venue\n\nAsia Cup 2018 was to be hosted by India this year, however, due to the political unrest between India and Pakistan, the venue has shifted to the United Arab Emirates.\n\nThe request was given by Pakistan Cricket Board, which was accepted by the Executive Board of the Asian Cricket Council in Kuala Lumpur on Tuesday.\n\nThe decision came following protest from Pakistan that if India refuses to send its players to the country for the ACC Emerging Teams’ Asia Cup, it won’t send its players to India for Asia Cup.\n\nThe Emerging Teams’ Asia Cup will now be co-hosted by Pakistan and Sri Lanka, with the latter set to host the majority of the matches. The tournament has, however, been shifted from April to December.\n\n“The ACC deliberated on the matter and decided that this was the best way forward,” Sethi was quoted as saying yesterday.\n\n“All decisions were unanimous. All participants agreed to support the return of international cricket to Pakistan subject to certain constraints. That’s why the ACC Annual General Meeting will be held in Lahore and the BCCI has pledged to participate in it like all other ACC members. That’s why a number of matches of the Emerging Asia Cup will be played in Pakistan,” -Najam Sethi\n\nAsia Cup 2018 Tournament Dates\n\nThe cup will kick off in September. The tournament will commence from the 13th-28th, in Dubai and Abu Dhabi.\n\nAsia Cup 2018 Teams\n\nThe tournament will have 6 teams competing for the beautiful trophy, they include the following;\n\nPakistan\n\nIndia\n\nBangladesh\n\nSri Lanka\n\nAfghanistan\n\nThe 6th team will be added after being shortlisted from Afganistan. Hong Kong, Nepal, Oman, and UAE.\n\nPakistan’s 18-Man Asia Cup Camp Squad\n\nPakistan’s 18-man squad for Asia Cup 2018 Camp has been announced. The national selectors chopped the 26 potential men down to 18 for the final phase of training.\n\nThe squad was announced by chief selector Inzamam-ul-Haq after feedback and discussions with skipper Sarfraz Ahmed and Mickey Arthur.\n\nThe squad consists of:\n\nFakhar Zaman Imam-ul-Haq Shan Masood Mohammad Hafeez Babar Azam Shoaib Malik Asif Ali Haris Sohail Sarfraz Ahmed Shadab Khan Mohammad Nawaz Imad Wasim Hassan Ali Usman Khan Shinwari Mohammed Amir Junaid Khan Shaheen Shah Afridi Faheem Ashraf\n\nAsia Cup 2018 Schedule\n\nGroup Stages\n\n18th September Pakistan vs. Qualifier Team\n\nBangladesh vs. Sri Lanka 19th September India vs. Qualifier Team 20th September Afghanistan vs. Sri Lanka 21st September Pakistan vs. India\n\nBangladesh vs. Afghanistan\n\nSuper 4 Round"}, {"url": "https://www.cricketzine.com/india-u23-vs-sri-lanka-u23-final-live-cricket-score-ind-v-sl-2018/", "page_content": "India U23 vs Sri Lanka U23 Final Live Cricket Score, IND v SL Live Streaming & TV Channels 2018\n\nACC Emerging Teams Asia Cup 2018 final match between India U23 v Sri Lanka U23 on December 15 at Colombo Cricket Club (CCC), Colombo; the game starts at 04:30 AM GMT.\n\nACC Emerging Teams Asia Cup 2018 is a 50-overs cricket tournament that is contested between Asian Countries having test status at International level. The 2018 Emerging Team’s Asia Cup will be co-hosted by Pakistan and Sri Lanka. The final of the Emergent Trophy will be played in Sri Lanka, and the matches involving Pakistan and India will be played at their respective home grounds.\n\nLive Streaming & TV Channel: ACC Emerging Teams Asia Cup 2018 would not broadcast live on any television network, so far tournament right not acquired by any sports television network, nor this tournament stream live on any social or digital platform. ACC Emerging Teams Asia Cup 2018 both semi-finals and final game to be stream live on Asian Cricket Council (ACC) official Facebook Page.\n\nSri Lanka U23 v India U23 Final Live Score, ACC Emerging Asia Cup 2018\n\nSri Lanka U23 won by 3 runs\n\n\n\nIND U23\n\n267/9 (50 ovs) SL U23\n\n270/7 (50 ovs)\n\nDates December 15, 2018 Match Sri Lanka U23 vs India U23, Final Venue Colombo Cricket Club (CCC), Colombo Time 04:30 AM GMT, 09:30 AM PKT, 10:00 AM IST Time ACC Emerging Teams Asia Cup 2018 Points Table TV & Live Streaming ACC Emerging Teams Asia Cup 2018 Live Streaming & TV Channel Tournament ACC Emerging Teams Asia Cup 2018 Head to Head\n\nSo far no head to head meeting Prediction\n\nIndia U23 to win Toss Sri Lanka U23 opt to bat\n\nIND U23 Playing XI Ruturaj Gaikwad, Ankush Bains (wk), Himmat Singh, PrabhSimran Singh, Nitish Rana, Atit Sheth, Deepak Hooda, Jayant Yadav (c), Shams Mulani, Mayank Markande, Ankit Rajpoot SL U23 Playing XI Sandun Weerakkody (wk), Hasitha Boyagoda, Avishka Fernando, Shammu Ashan (c), Shehan Jayasuriya, Asela Gunaratne, Chamika Karunaratne, Shehan Madushanka, Kamindu Mendis, Lasith Ambuldeniya, Wanidu Hasaranga Result Sri Lanka U23 won by 3 runs\n\nTeam Squads\n\n\n\nIndia U23 Squad: Jayant Yadav (c), Ankush Bains, Ruturaj Gaikwad, Himmat Singh, Siddharth Desai, Deepak Hooda, Mayank Markande, Shams Mulani, Prasidh Krishna, PrabhSimran Singh, Ankit Rajpoot, Nitish Rana, Atit Sheth, Shivam Mavi, Atharwa Taide\n\nSri Lanka Emerging Squad: Charith Asalanka (c), Shammu Ashan, Avishka Fernando, Kamindu Mendis, Hasitha Boyagoda, Sandun Weerakkody, Asitha Fernando, Asela Gunaratne, Nishan Madushka, Jeffrey Vandersay, Lasith Embuldeniya, Nishan Peiris, Shehan Madushanka, Jehan Daniel, Chamika Karunaratne\n\nCricket fans around the world can also get this match score updates via CricketZine Facebook Page, Twitter Account, Instagram Account, and YouTube Channel."}, {"url": "https://www.readkong.com/page/accounts-2019-asian-cricket-council-4127375", "page_content": "& Accounts 2019\n\nCONTENTS PRESIDENT’S REPORT MEMBER COUNTRIES EXECUTIVE BOARD EVENT AND DEVELOPMENT MANAGER’S REPORT ACC TOURNAMENTS FINANCE & OPERATIONS STATEMENT OF ACCOUNTS ACC ANNUAL REPORT & ACCOUNTS 2019\n\nThe year 2019 saw a concentrated effort on part of Cricket World Cup title in South Africa in early 2020. the Asian Cricket Council (ACC) towards improving The other finalist was also an Asian nation and five- and developing cricketing capacities across the time champions India. l Signing of a corporation agreement between the ACC and the ICC will allow the cricket bodies to maximise continent and in all our member countries - with development cooperation. All teams and the organisations and people behind development at the grassroots level and growth of their successes deserve to be congratulated for their the women’s game being ACC’s prime focus areas. One of the major highlights of 2019 was the signing efforts. We appreciate and are grateful to our members of a cooperation agreement with the ICC to develop cricket in the region. The idea was to work together ACC Events for their continuous encouragement and support in to gather maximum advantage and output from a ACC’s major accomplishment of the year was carrying this vision forward. coordinated use of both our resources to improve successfully hosting eight regional tournaments Moving our base from Sri Lanka to the UAE the game. across various countries. This attests to the planning and organisation capabilities of the ACC and its In early 2019, the ACC shifted its base from Sri Lanka Asian cricket impress professionalism in executing such well laid out plans. to the United Arab Emirates. I would like to take this One of the main events of 2019 was the ACC Emerging moment as an opportunity to express our profound Teams Asia Cup held in Bangladesh which was won thanks to Sri Lanka Cricket for hosting the ACC from l Asian teams performed admirably at international by Pakistan for the very first time as they defeated 2016 to 2018. events. the hosts in the final. Also held in the year, was one l Thailand women’s and Oman men’s teams qualiﬁed In the UAE, the Emirates Cricket Board has graciously for major ICC events. of Asia’s most prestigious tournaments for its next come forward and provided us with an office space, l Bangladesh Under 19s became world champions. generation of stars, the Under 19 Asia Cup hosted by Sri Lanka. India’s dominance in Under 19 level was free of cost, for our operational activities in Dubai. Throughout the calendar year, Asian teams have further consolidated as they scraped past Bangladesh With Dubai being a prominent commercial hub in the performed exceptionally well on the field. It was in the final to win their seventh title. However, the region and being that that the International Cricket particularly heartening to see our associate member defeat by the slimmest of margins only re-affirmed Council (ICC) is also headquartered in the same city, teams making cricket headlines. In particular, the a blossoming rivalry between the two nations at all the new arrangement proves to be very convenient Thailand women’s team finished in the top two of levels, which is great news for cricket neutrals. as it enables us to work cohesively with the ICC and the ICC Women’s World Twenty20 Qualifier 2019 all our member boards. I am extremely pleased to and sealed a historic first berth in the ICC Women’s note that the ACC’s transition to the new secretariat T20 World Cup 2020 in Australia. Also, extremely noteworthy is the Oman men’s team gaining ACC hosted eight regional tournaments. has been smooth and we are already functioning l qualification to the ICC T20 World Cup 2020. l Women’s cricket receives boost. Inaugural ACC with a new degree of efficiency. Women’s Emerging Teams Asia Cup held. We are also happy to report, that the Bangladesh l First level one coaching course for women organised. Corporation agreement Under 19 team won their first ever ICC Under 19 4 5\n\nA renewed emphasis was given to the growth of Finally, it has been an immense honour for me to women’s cricket, where the ACC has taken several serve as the President of the ACC. I wish to express key initiatives. For instance, the inaugural ACC my sincere gratitude for the warmth, assistance l The rights of Asia Cup Tournaments from 2020 to l The future of Asian cricket is in very good hands. Women’s Emerging Teams Asia Cup was played in 2023 was awarded to Twenty First Century Media and camaraderie extended to me by the Executive Pvt. Ltd. (TCM) for a period of four years. Sri Lanka which witnessed the participation of four Board, my colleagues from member boards and the l The value received for the four years was ﬁfty-ﬁve thought to be significant. Accordingly, the Board teams - India, Pakistan, Bangladesh and the hosts. percent more than the amount in the previous after due consideration of such factors, decided ACC staff during the last two years. rights cycle. India went on to win the first edition of the event. to postpone the Asia Cup. Accordingly, the board With this tournament set to be played regularly in the As I hand over the ACC Presidency to the incoming after due consideration of such factors decided future, I am very optimistic that the ACC has opened As projected, both the Accumulated Fund and the President, I do so with a sense of fulfilment and to postpone the Asia Cup. We have since been in the door at unearthing major talents in Asia’s women’s Development Fund recorded deficits at the end of reassurance that the future of the region’s cricket is the process of identifying a suitable window for cricket who will one day set the world stage alight. the year. A deficit of US$ 2.38 million was reported in very good hands. the Asia Cup in the altered FTP and are on track The ACC also successfully conducted the first ever in the Development Fund, whereas the deficit in the to rescheduling the tournament to a time frame Nazmul Hassan level one coaching program for women in Pakistan Accumulated Fund amounted to US$ 544K. It should appropriate to all participants. President, ACC where twenty female coaches from ACC associate be noted that these figures were much lower than members participated. We had set objectives for the the projections made, which can be attributed to women’s game in the region at the beginning of the improved interest income, practical budgeting for year and the progress has been promising. operational expenses and accurate adjustments with previous year’s provisions. Financial performance Covid-19 and its impact on the ACC Apart from organising development tournaments Unfortunately, the year 2020 will always be in 2019, the ACC invested its financial resources remembered for the adverse impact of the Covid-19 from the revenues of the 2018 Asia Cup for the pandemic on cricket in the region. Much to the expansion of the game. In this venture it is important disappointment of the ACC and its members, most to secure the future of finances which the ACC has of the ACC events planned for the year had to be proactively pursued. A major arrangement was rescheduled to 2021. The biggest setback was the arrived at in relation to the rights of the Asia Cup postponement of Asia Cup 2020, the marquee Tournaments to be held from 2020 to 2023. These event of the ACC. While the ACC Board was keen rights were awarded to Twenty First Century Media on organising the tournament as per the original Pvt. Ltd. (TCM) for a period of four years through a schedule, travel restrictions and changing health competitive and transparent bidding process. I am protocols posed as significant challenges to the pleased to announce that the value agreed upon for same. Moreover, the risks related to health and safety the said four years was fifty-five percent more than of participating players, support staff, commercial the amount received in the previous rights cycle. partners, fans and the cricketing community were 6 7\n\nINDIA PAKISTAN SRI LANKA BANGALADESH AFGHANISTAN BAHRAIN ACC Member ACC Member ACC Member ACC Member ACC Member ACC Member 1983 1983 1983 1983 2003 2003 ICC Member ICC Member ICC Member ICC Member ICC Member ICC Member 1926 (Full) 1953 (Full) 1981 (Full) 2000 (Full) 2013 (Associate) 2001 (Aﬃliate) BHUTAN BRUNEI CAMBODIA CHINA CHINESE TAIPEI HONG KONG ACC Member ACC Member ACC Member ACC Member ACC Member ACC Member 2001 1996 2012 2004 2012 1983 ICC Member ICC Member ICC Member ICC Member 2001 (Aﬃliate) 2002 (Aﬃliate) 2004 (Aﬃliate) 1969 (Associate) IRAN KUWAIT MALAYSIA MALDIVES MYANMAR NEPAL ACC Member ACC Member ACC Member ACC Member ACC Member ACC Member 2003 1996 1983 1996 2005 1990 ICC Member ICC Member ICC Member ICC Member ICC Member ICC Member 2003 (Aﬃliate) 2005 (Associate) 1967 (Associate) 1998 (Aﬃliate) 2006 (Aﬃliate) 1996 (Associate) OMAN QATAR SAUDI ARABIA SINGAPORE ACC Member ACC Member ACC Member ACC Member 2000 2000 2003 1983 ICC Member ICC Member ICC Member ICC Member 2014 (Associate) 1999 (Aﬃliate) 2016 (Associate) 1974 (Associate) TAJIKISTAN THAILAND UAE ACC Member ACC Member ACC Member 2012 1996 1984 ICC Member ICC Member 2005 (Associate) 1990 (Associate) 8 02 9\n\nTHE EXECUTIVE BOARD* Mr. Nazmul Hassan, President Mr. K H Imran, Vice President Mr. Sourav Ganguly, Executive Board Member Mr. Ehsan Mani, Executive Board Member Mr. Shammi Silva, Executive Board Member Mr. Farhan Yusefzai, Executive Board Member Mr. Ravi Sehgal, Executive Board Member Mr. Pankaj Khimji, Executive Board Member Mr. Mohamad Aflah, Executive Board Member Mr. Jay Shah, Ex. Officio, Hon. Secretary, BCCI Mr. Wasim Khan, Ex-officio, COO, PCB Mr. Ashley De Silva, Ex-officio, CEO, SLC Mr. Nizam Uddin Chowdhury, Ex-officio, CEO, BCB Mr. Rahamatullah Quraishi, Ex-officio, CEO, ACB AGM Photograph 2019 FINANCE & MARKETING COMMITTEE* Mr. Jay Shah, Chairman Mr. Nazmul Hassan, President, ACC Mr. Ehsan Mani, Chairman, Development Committee Mr. Lasantha Wickremesinghe, Member Mr. Rahamatullah Quraishi, Member Mr. Mubashir Usmani, Member Mr. Rahul Sharma, Member Mr. Thusith Perera, Convenor, GM – Finance & Operations THE DEVELOPMENT COMMITTEE* Mr. Ehsan Mani, Chairman Mr. Nazmul Hassan, President, ACC Mr. Jay Shah, Chairman, Finance & Marketing Committee Mr. Mahinda Vallipuram, Member Mr. Mahmood Gaznavi, Member Mr. Nadeem Nadwi, Member Mr. Manzoor Ahmad, Member Mr. Sultan Rana, Convenor – Events and Development Manager *As at 31 December 2020 11\n\nEvents & Development Manager’s Report In the year 2019, the Asian Cricket Council had a clear mission to provide more cricketing events to all Giving more impetus to the women’s game, we launched the ACC Women’s Emerging Teams member countries in all age-groups - for men and Asia Cup this year as four Test-playing nations – women. With that set plan in motion, we successfully India, Bangladesh, Pakistan, and hosts, Sri Lanka participated in the inaugural version which was won conducted eight regional tournaments and two by India. programs in over six countries. Emerging Teams Asia Cup has already become a The first of the competitions for the year was played permanent fixture in the ACC calendar. Bangladesh in January when the Oman Cricket Board hosted the played hosts to this wonderful tournament in 2019 ACC Western Region T20 competition. Saudi Arabia and saw Pakistan winning the title for the very first provided a late blitz on the finals day to win the time. tournament springing a major surprise. After beating Apart from conducting the tournaments without Kuwait in the morning session, they went onto to a glitch, ACC continued their drive to educate the stun a red-hot Qatar side by 8 wickets to stamp their coaches in the region. For the very first time, Pakistan authority in the region. arranged a Level 1 coaching course for the women tutors in the region. This proved once again the The Under 16 regional tournaments, the commence- ACC’s continued desire to improve the women’s ment of identifying talent for their respective game among the member countries. Another coach member countries were successfully conducted in educator program for the coaches who are certified 2019 as well. Thailand hosted the U16 Eastern Region to train Level 1 & 2 coaches was initiated at the ICC competition which saw Nepal defending their tile, Cricket Academy, Dubai. whilst Oman played host to the U16 Western Region As the ACC Events and Development Manager, tournament as the home team beat the United Arab I am extremely pleased on conducting all the Emirates to grab the title. tournaments and programs in 2019 successfully. I would also like to appreciate the efforts of the Malaysia and UAE, two of the more popular hosts Chairman Development Committee, members of for ACC events, made sure the Under 19 Eastern the Development Committee, and the ACC Board and Western regional competitions were conducted for their excellent support and guidance. 2020 will successfully as the winners booked their places for certainly bring us newer challenges throughout the the prized Under 19 Asia Cup. India won their seventh course of the year and that will require unending Under 19 Asia Cup title as Sri Lanka faultlessly hosted support from all ACC members. their first tournament on the calendar year beating Sultan Rana Bangladesh in a final which went down to the wire. Convenor – Events and Development Manager 13\n\n14 15\n\n14th – 23rd November 2019 The ACC Emerging Teams Asia Cup 2019 Bangladesh, playing their first ACC Nazir won the Player of the Final award for was the most anticipated event in the Asian Emerging Teams Asia Cup final, opted to his brilliant hundred, while experienced Cricket Council calendar year. The 50-over chase. However, wicket-keeper batsman Bangladesh national player, Soumya tournament was held over the course of 10 and one-drop batter, Rohail Nazir dished Sarkar won the Player of the Tournament days in four venues in Bangladesh. out one of the finest knocks in the award. Despite failing in the final, Sarkar competition, hammering 113 runs in just had a stellar competition scoring 244 runs Having initiated this unique tournament better of Afghanistan by seven wickets they lost all their matches. In the curtain down Sri Lanka’s 238. 111 deliveries with 12 fours and 3 sixes as in 5 matches with a best of 84* against in 2013, the fourth edition of the ACC in the semi-finals. The eventual winners, raiser, they were stunned by Oman, who Pakistan posted a mammoth 301/6 on the Hong Kong. He registered two more half- Even though they lost at the hands of Emerging Teams Asia Cup featured the Pakistan, too, had a smooth run-up in their chased down 269 in the back of Jatinder board. Nazir was ably supported by Imran centuries in the competition against India the two finalists, the former champions region’s five Test playing nations alongside group matches, dispatching Afghanistan, Singh’s excellent hundred. Next time Rafique and Saud Shakeel in the middle and Afghanistan in the semi-final. Sarkar – India, showed their dominance against three other associate members of the Oman and Sri Lanka to top Group A before around, Muhammed Hasnain’s extra order, who made 62 and 42 respectively. contributed with the ball as well, capturing ICC – Oman, Hong Kong and Nepal, who overcoming arch-rivals India with a thrilling pace was too much to handle as he Hong Kong and Nepal, winning those two 5 wickets. came through a qualifying event to join - Fast-bowler Sumon Khan was the best three-run win in the last-four battle. picked up 6 for 19 with Pakistan bundling battles quite convincingly. Afghanistan, the India, Bangladesh, Pakistan, Sri Lanka and bowler for the hosts, taking 3 wickets but Nazir was in sublime form throughout out Sri Lanka for 93, who were chasing newest Test nation from Asia, played good Sri Lanka, who came into the competition Afghanistan. The United Arab Emirates leaked 75 runs from his quota of 10 overs. the competition, accumulating 302 runs cricket overall in the competition despite as the defending champions, had their only 184 for victory. In the third and final pulled out of the tournament in the Bangladesh’s reply started poorly as they in 5 innings with an average of 75.5. He succumbing at the hands of Pakistan and worst-ever campaign in the history of game, Afghanistan’s Shahidullah Kamal eleventh hour and were replaced by Nepal lost both openers cheaply, Soumya Sarkar was closely followed by the home team the ACC Emerging Teams Asia Cup as mustered a brilliant, unbeaten ton to chase Bangladesh. who had finished fourth in the qualifying for 15 and Nayeem Sheikh for 16. They kept captain, left-hander, Nazmul Shanto, who tournament. on losing wickets at regular intervals and cracked 280 runs in 5 matches with 3 half- centuries to his name. Fast-bowler Sumon GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR The strong Pakistan outfit claimed failed to build up any momentum in their Khan edged out Muhammad Hasnain by their maiden championship of the ACC chase as tearaway seamer Muhammed PAKISTAN 3 3 0 0 6 +2.066 BANGLADESH 3 3 0 0 6 +2.502 a wicket to top the charts with 14 scalps Emerging Teams Asia Cup, having come Hasnain grabbed 3 wickets to disrupt all against the latter’s 13-wicket haul in the second in the final twice before. They Bangladesh plans, while Khushdil Shah AFGHANISTAN 3 2 1 0 4 +0.316 INDIA 3 2 1 0 4 +0.829 competition. defeated the two-time hosts, Bangladesh and Saif Badar picked up two wickets comprehensively in the final by 77 runs apiece for the winners. With the bat for The hosts, Bangladesh reached the final OMAN 3 1 2 0 2 -1.673 NEPAL 3 1 2 0 2 -0.752 at the Sher-e-Bangla National Stadium in Bangladesh, skipper Nazmul Shanto, Afif four as Group B champions beating Hong SRI LANKA 3 0 3 0 0 -0.837 HONG KONG 3 0 3 0 0 -2.058 Mirpur. Hossain and Mahadi Hasan made 40s. Kong, Nepal and India before getting the 16 17\n\nACC Women’s Emerging Teams Asia Cup 2019 22nd – 29th October 2019 Sri Lanka With the vision of providing more over the age of 23. All four teams were The first fixture of the tournament in opportunities in the women’s game, the scheduled to play each other in a round- Colombo saw India recording the opening Asian Cricket Council launched its maiden robin stage with the top two teams as per points of the competition after beating the ACC Women’s Emerging Teams Asia Cup the points qualifying for the final. hosts, Sri Lanka by 32 runs. Put into bat in Sri Lanka. first, India posted 171 runs for the loss of However, the first two match days were four wickets in 39 overs and then bowled Four Test-playing countries, India, Pakistan, washed off due to inclement weather reply, skipper Harshitha Madavi made In a virtual semi-final, Sri Lanka ousted India posted a decent score of 175/9 in out Sri Lanka for 139. Bangladesh and hosts, Sri Lanka fielded which forced the organizers to reschedule fine 55 to keep the chase alive. However, Bangladesh by 4 wickets to seal their 50 overs. Then skipper Devika Vaidya teams for this inaugural competition. The the fixtures. However, the revamped Skipper Devika Vaidya top-scored with 43, Tanuja Kanwar and Sushree Dibyadarshini place in the finals. They had to win with captured another four-wicket haul with tournament saw a mix of young, raw talent itinerary saw two matches being fully while Tejal Hasnabis provided the late blitz shared six wickets between them as India a superior net run-rate and chasing 128 able support from Tanuja Kanwar, who together with the experienced names canceled – Sri Lanka vs Pakistan and India with a fine 37. Seamer Sathya Sandeepani completed their opening win. runs to win, Sri Lanka had to reach the also claimed four wickets to restrict the as four players from each squad were vs Bangladesh. took 2 wickets for the Lankan lasses. In target in 35 overs. They did so in 33.4 overs hosts. Sri Lanka had been set a revised Bangladesh shocked Pakistan at the thanks to skipper Harshitha Madavi’s target of 149 in 35 overs but they managed Navy Headquarters as they registered a second consecutive half-century. India only 135 all out in 34.3 overs. comfortable 65-run win. After being sent comfortably defeated Pakistan by 6 into bat, Bangladesh made 181 from their The five matches were conducted in wickets to remain unbeaten as skipper allotted 48 overs thanks to opening batter two venues – R. Premadasa International Devika Vaidya captured four wickets for Murshida Khatun’s half-century. Pakistan’s Cricket Stadium in Colombo and Navy the winners. chase was derailed by Bangladesh Grounds in Welisara. skipper Shaila Sharmin and Rabeya, who In the all-important final against the hosts, took three wickets apiece as they were Sri Lanka, India recorded a thrilling 13-run bowled out for just 116 runs. (D/L) win. The pre-tournament favourites, TEAMS M W L NR PTS NRR TEAMS M W L NR PTS NRR INDIA 3 2 0 1 5 +1.305 BANGLADESH 3 1 1 1 3 +0.155 SRI LANKA 3 1 1 1 3 +0.326 PAKISTAN 3 0 2 1 1 -1.453 18 19\n\nU19 ASIA CUP SRI LANKA 2019 5th – 14th September 2019 India continued their dominance in Under Ankolekar took the final two wickets in the from Group B joined Afghanistan and India 19 cricket in region as they won the ACC space of four deliveries to finish off a nail- from Group A in the semi-finals with a Under 19 Asia Cup which was held in the biting encounter. match to spare as they won their second island nation of Sri Lanka. matches against UAE and Nepal as all Earlier in the curtain raiser, India defeated teams started reaching high scores. Having not been a part of only one ACC Kuwait by 7 wickets in a rain-marred Both the semi-finals India vs Sri Lanka third positions respectively with 194 and and Kuwait – had to come through after Under 19 Asia Cup final throughout the 23-over contest. However on the same Sri Lanka’s Navod Paranavithana was and Bangladesh vs Afghanistan were 167 runs. The hero of the final, Atharva playing their regional qualifiers. eight editions played so far, the ever- day, only a couple of kilometers away, named player of the match against UAE, abandoned without a ball being bowled Ankolekar led the bowling charts with 12 strong India emerged victorious to win the biggest surprise of the tournament when he scored 61 at the top of the India were pooled alongside Afghanistan, due to heavy rain. Therefore, the top wickets, while four bowlers – Shafiquallah their seventh title beating Bangladesh in happened, when Afghanistan stunned the order before claiming 4 wickets with his two teams of each group – India and Ghafari and Noor Ahmed of Afghanistan, Pakistan and Kuwait in Group A while Sri a thrilling, low-scoring final played at R. strong Pakistan lineup by 87 runs as per orthodox left-arm spin. Skipper Akbar Ali’s Bangladesh progressed to the finals. Sushant Mishra of India and Navod Lanka, Bangladesh, United Arab Emirates Premadasa International Cricket Stadium the D/L method. unbeaten 98 guided Bangladesh through Paranavithana of Sri Lanka ended up with and Nepal were in Group B. in Colombo. a stiff chase against Nepal. Indian opening batsman Arjun Azad, who Sri Lanka and Bangladesh registered 8 wickets apiece. The matches were played in five venues in won the Player of the Tournament award, After being bundled out for 106 on a placid comfortable wins on the second match Pakistan and Nepal returned home with was the top run-scorer in the competition While the five Test playing nations – India, Colombo and its suburbs – R. Premadasa Khettarama pitch, Indian bowlers led by day beating Nepal and United Arab only single win in the competition as they with 202 runs in 4 innings, while Mahmudul Pakistan, Sri Lanka, Bangladesh and International Cricket Stadium, P. Sara Oval, left-arm spinner Atharva Ankolekar’s five- Emirates respectively. Two centuries by beat Kuwait and UAE in their respective Hasan Joy of Bangladesh and Rohail Nazir Afghanistan qualified automatically for the Marians Cricket Grounds, Colombo Cricket fer bowled out Bangladesh for 101 to win Arjun Azad and Tilak Varma ensured India final group matches. However, the group of Pakistan finished on the second and competition, three teams – UAE, Nepal Grounds and Tyronne Fernando Grounds. the final by 5 runs. Having lost 9 wickets beat their arch-rivals Pakistan to book their deciders – Sri Lanka vs Bangladesh and for 84 runs, the 22-run last-wicket stand place in the semi-finals, while Afghanistan India vs Afghanistan proved to be vital between Karan Lal and Akash Singh with too secured a berth in the final four when towards the latter part of the competition. GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR the former scoring a vital, match-winning they brushed aside Kuwait. Bangladesh managed to beat the hosts, INDIA 3 3 0 - 6 +1.178 BANGLADESH 3 3 0 - 6 +1.218 37 off 43 deliveries. Indian opening batsman Azad won his Sri Lanka by 42 runs thanks to a man-of- With Bangladesh 8 down for 78, India second man-of-the-match award in the-match winning knock by Mahmudul AFGHANISTAN 3 2 1 - 4 +1.266 SRI LANKA 3 2 1 - 4 +0.392 looked like they had bagged the game but consecutive games, while Afghanistan’s Hasan Joy. India held their nerve in a low- the Bangladesh tail fought back to inch leg-spinning sensation Shafiqullah too scoring thriller to beat Afghanistan by 3 PAKISTAN 3 1 2 - 2 +0.123 NEPAL 3 1 2 - 2 +0.852 closer towards the target with a 23-run won the second consecutive man-of-the- wickets. Left-arm seamer Sushant Mishra KUWAIT 3 0 3 - 0 -3.541 UAE 3 0 3 - 0 -2.455 stand for the ninth wicket. However, match award. Sri Lanka and Bangladesh impressed for the Indians taking 5 wickets. 20 21\n\nU19 Western Region UAE 2019 26th April – 3rd May 2019 The hosts, United Arab Emirates secured batsman Syed Haider and number three During the semi-finals, Kuwait defeated a place in the U19 Asia Cup 2019 after bat, Vriithya Aravind Rudhravel. Saudi Arabia by 103 runs. Opening becoming the champions of the ACC U19 batsman Gokul Kumar’s unbeaten 108 Western Region Tournament 2019. The Skipper Abdul Sadiq took 2 for 48 from his ensured Kuwait reach 254 for 6. However, runners-up, Kuwait, also managed to seal 10 overs. In reply, UAE bowlers did not let Saudi Arabia were bowled out for just 151. a place in the eight-team U19 Asia Cup. Kuwait batsmen settle as they got bowled Jandu Amanullah and Abdul Sadiq picked out for only 141 to lose the contest. Govind up three wickets apiece for the winners. In It was a convincing victory for the dominant Earlier in the group stages, both UAE and Kuwait’s Gokul Kumar was the top run 16 scalps in 5 matches. He took two five- Kumar top-scored with a patient 30. Right- the other semi-final, UAE thumped Qatar UAE outfit in the final played at the Dubai Kuwait remained unbeaten in their three scorer during the entire competition with wicket hauls, while his closest rival was International Cricket Stadium, as they arm leg-spinner Karthik Meiyappan was by 10 wickets. After being asked to bat 223 runs in 5 matches. His twin brother matches in respective groups – A & B, Kuwait’s Jandu Amanullah who captured cruised to a 90-run win over Kuwait. After the most impressive bowler for the host first, Qatar were dismissed for a mere 48 while Saudi Arabia and Qatar registered Govind Kumar was the third-highest run 9 wickets in 5 games. being sent into bat, UAE made 231/7 in their country, who took 4 for 32 and also won with Aryan Lakra recording impressive two wins of their own to finish second scorer with 192 runs in as many games, 50 overs with half-centuries from opening the Player of the Final award. figures of 6 for 9 in just 7.1 overs. in the groups. Bahrain and Oman had while right-handed Azyan Farhath Yoosuf The 15 matches in the competition were a solitary win during the group stages, of Maldives was the second in the most played at the Dubai International Cricket runs list with 199 runs in 3 games. Stadium, the ICC Academy (Dubai), The while Iran and Maldives had disappointing campaigns and remained without a win in Left-arm spinner Aryan Lakra of UAE Sevens Stadium’s Sir Maurice Flanagan the tournament. finished as the highest wicket-taker with Oval and Ajman’s Eden Garden (UAE). GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR UAE 3 3 0 0 6 +5.027 KUWAIT 3 3 0 0 6 +2.32 SAUDI ARABIA 3 2 1 0 4 +0.713 QATAR 3 2 1 0 4 -0.647 BAHRAIN 3 1 2 0 2 -1.129 OMAN 3 1 2 0 2 +0.213 IRAN 3 0 3 0 0 -4.605 MALDIVES 3 0 3 0 0 -1.887 22 23\n\n2nd – 9th July 2019 An undefeated Nepal secured a berth tournament’s highest-run scorer, Adit 5 runs per wicket stood out throughout in the ACC U19 Asia Cup 2019 after Gorawara played the lone hand scoring the tournament and was the major factor becoming winners of the the ACC U19 a fighting 24. In reply, Nepal lost only for Nepal’s victory. His best figures came Eastern Region Tournament 2019 beating four wickets as opening batsman Pawan against China, 6 for 19 and in four matches, Hong Kong by six wickets in the final Saraf’s 39 anchored the chase. They he won the Player of the Match award in played at Kinrara Oval in Kuala Lumpur. reached the target in just 16.1 overs. three games. Having successfully cruised through to the knockout stage, while Malaysia, China, Bhutan and Thailand. All the games Sagar Dhakal’s impressive five-wicket Left-arm spinner Sagar Dhakal, who took Gorawara won the Best Batsman’s the group stages, beating China and despite losing to Hong Kong in a thriller were conducted in three venues – Kinrara haul restricted Hong Kong to just 5 for 18 from his 10 overs with 5 maidens award having scored 220 in 5 games at Singapore, Nepal qualified for the in their group game, defeated Thailand Oval, Selangor Turf Club and newly- 95 runs in 43.1 overs. Kamal Singh won the Player of the Final award. His an average of 55, while his team-mate, finals beating the hosts, Malaysia in and Bhutan to secure a place in the semis. opened TPCA Oval. Airee supported Dhakal with a three- 15 wickets in 4 matches also won him Raunaq Kapur won the Best Bowler’s the first semi-final. while the runner-up China and Bhutan went winless in the fer as Nepal stamped their authority the Player of the Tournament award. award after capturing 11 wickets in 4 Nepal, who won the sole ticket from the Hong Kong saw off the challenge from tournament, however, Thailand continued with the ball. Hong Kong captain and Dhakal’s impressive average of below games. Eastern Region, joined the United Arab Singapore in the second semi-final. Hong to impress. They gave a scare to Malaysia Emirates and Kuwait, who qualified from Kong topped their group winning all three in their group game and also managed to the Western Region, at the U19 Asia Cup matches. beat Bhutan. along with hosts Sri Lanka, Afghanistan, Singapore’s solitary win over China in The participating teams were the hosts, Bangladesh, defending champions India the group stages helped them advance Malaysia, Nepal, Hong Kong, Singapore, and Pakistan. GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR NEPAL 2 2 0 - 4 +5.344 HONG KONG 3 3 0 - 6 +2.072 SINGAPORE 2 1 1 - 2 -1.059 MALAYSIA 3 2 1 - 4 +1.82 CHINA 2 0 2 - 0 -6.711 THAILAND 3 1 2 - 2 -0.126 BHUTAN 3 0 3 - 0 -3.977 24 25\n\n21st – 29th October 2019 Oman wrote another golden chapter in The Omani bowlers did their work after captured five wickets for 15 runs in 7 overs. their cricketing annals when they lifted electing to field as they folded the UAE UAE and Oman reached the final after their maiden ACC Under 16 Western lineup for just 87 runs in 29 overs. Ayman beating Kuwait and Bahrain in their Region championship beating the Ayaz was the pick of the bowlers with 3 respective semi-finals. Both Oman and defending champions, United Arab for 11, while Afzal Khan top scored for the UAE remained unbeaten throughout the Emirates by one wicket in a low-scoring UAE with a fine 50-ball 27. Chasing 88 runs group stages while Kuwait and Bahrain thriller in the final conducted at Amerat to win, Oman reached the target thanks lost only to the group toppers. Maldives Grounds in Oman. In the previous edition to a valiant last-wicket stand between and Iran went home without a solitary win held in 2018 in the UAE, the hosts won the Bilal Asim and Zayed Ali Khan. Adithya while Saudi Arabia and Qatar managed competition beating Oman in the final. Kumar troubled the Oman batsmen as he one win each. After 15 matches, Ali Naseer of UAE was tournament for UAE as he took 22 wickets over the course of nine days in the twin turf the top run scorer with 205 runs, followed in 5 matches and had a clear 10-wicket grounds situated at the Amerat Grounds. by his team mate Rudra Mahadev (181 gap with the second-best, Siddh Hemal The teams were divided into two groups runs) and Yash Verma (149 runs) of Mehta of Oman. with UAE, Saudi Arabia, Iran and Bahrain Oman. Ali Naseer’s unbeaten 197 against Iran remained as the highest individual The 35-over tournament saw eight team competing in Group A, while the hosts, score in the competition. In the bowling participating – Oman, UAE, Iran, Kuwait, Oman, Qatar, Maldives and Kuwait made front, young Adithya Kumar had a dream Qatar, Bahrain, Maldives, and Saudi Arabia up the Group B. GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR UAE 3 3 0 0 6 +7.646 OMAN 3 3 0 0 6 +4.767 BAHRAIN 3 2 1 0 4 -1.152 KUWAIT 3 2 1 0 4 +2.068 SAUDI ARABIA 3 1 2 0 2 -1.101 QUATAR 3 1 2 0 2 +1.594 IRAN 3 0 3 0 0 -5.19 MALDIVES 3 0 3 0 0 -7.295 26 27\n\n20th – 28th April 2019 Nepal defended their ACC Under 16 Kumar Patel bowled a solid spell to take matches won the Best Bowler’s award in Eastern Region title, which they won back 4 scalps for Nepal as Malaysians were the tournament, while Singapore’s Girin in 2017, beating Malaysia by 59 runs in the left clueless in a small chase. Bohra’s all- Rahul Gune who accumulated 200 runs in final conducted at the Prem International round excellence won him the Player of 5 games was named Best Batsman in the School in Chiang Mai, Thailand. the Final award. competition. Nepal skipper Bishal Bikram KC won the Player of the Tournament Deepak Bohra starred for Nepal in the Despite coming in second, Malaysian award for his superior leadership skills on final with a quick-fire 23 with the bat and bowlers shone throughout the tournament and off the field. capturing 3 wickets with the ball as the as they had been able to take all ten reigning champions defended 140 runs wickets in each of the four matches they Singapore won the 3rd/4th place play-off to dismiss Malaysia to a paltry 81. Bohra’s had played sans the final. Malaysia’s defeating Hong Kong by a mammoth 81 new-ball partner, left-arm seamer Bishal Sachinu Hettige, who took 9 wickets in 5 runs at RCGC. Girin Rahul Gune’s bat did the talking once again for Singapore as his Singapore. Initially both the finalists met in two teams in group B. 56 ensured they had enough runs on the their group stage clash which Nepal won Myanmar lost all their group A matches, board to defend against Hong Kong. by 39 runs. Whilst Nepal and Malaysia qualified from group A which also saw while the hosts, Thailand won only one Nepal and Malaysia qualified for the Thailand and Myanmar. Singapore topped game. Bhutan registered their only victory finals having won their respective semi- group B with Hong Kong coming in against China, who failed to record a single final encounters against Hong Kong and second. Bhutan and China were the other win in the competition. GROUP A M W L NR PTS NRR GROUP B M W L NR PTS NRR NEPAL 3 2 0 1 5 +2.417 SINGAPORE 3 3 0 0 6 +5.633 MALAYSIA 3 2 1 0 4 +0.703 HONG KONG 3 1 1 1 3 +0.919 THAILAND 3 1 1 1 3 +0.877 BHUTAN 3 1 2 0 2 -1.199 MYANMAR 3 0 3 0 0 -2.913 CHINA 3 0 2 1 1 -5.014 28 29\n\n20th – 24th January 2019 Underdogs Saudi Arabia came out of Kuwait, as Saudi Arabia reached the target from their allotted 20 overs. Taimoor Sajjad nowhere to win the five-team ACC Western of 136 in just 9.1 to seal their place in the top-scored with a blitzkrieg 68 off 38 Region T20 championship on a dramatic final. He brought up his fifty in just 15 balls, deliveries. Purat’s 88 earned him the Player finals day at Amerat Grounds in Oman. The then the third fastest T20I half-century. of the Final award. tournament was played over the course of During the finals, the much-fancied While Saudi Arabia reached the final five days. and undefeated Qatar outfit fell short in the most dramatic fashion with four Initially during the first set of games, Saudi dramatically as Saudi Arabia recorded an points and superior net run-rate, Qatar Arabia played its last group game against eight-wicket win under the flood lights. cruised through to win all their round- Kuwait with only one win and two points out Shamsudeen Englam Purat’s 48-ball 88 robin encounters. However, Bahrain and of three games. They needed a miraculous anchored Saudi Arabia’s chase of 158. After Kuwait, the two batting powerhouses in win to reach the final. Faisal Khan’s blistering being asked to bat first, Qatar managed to the tournament with four points each, had 28-ball 83 ensured a complete thrashing of post a score of 157 for the loss of 6 wickets one bad day on the park and their hopes of reaching the final had gone with the wind. The competition, which saw 11 matches an international T20 hundred. Qatar all- Maldives, the other participating nation in being played between five teams saw 130 rounder Taimur Sajjad was the pick of the the competition lost all their four matches. sixes and 278 fours as all teams flexed bowlers, topping the charts with 10 wickets. This competition was among the first to their muscles. Kuwait’s Ravija Sandaruwan He even contributed with the bat, smashing be played after the International Cricket De Silva was the top run scorer in the 118 runs at a staggering strike-rate of 176. Council expansion of T20I status to all of its tournament smashing 177 runs in 4 Therefore, the adjudicators named Sajjad members. Therefore all the matches were matches with a best of 103. He also as the Player of the Tournament. recorded as international T20 encounters. became the first Kuwaiti batsman to score TEAMS M W L NR PTS NRR TEAMS M W L NR PTS NRR QATAR 4 4 0 0 8 +1.368 KUWAIT 4 2 2 0 4 -0.06 SAUDI ARABIA 4 2 2 0 4 +0.489 MALDIVES 4 0 4 0 0 -2.075 BAHRAIN 4 2 2 0 4 -0.035 30 31\n\nFirst for Women Coaches Coaches for the Next Generation The Asian Cricket Council together with the Pakistan With the intention of improving the coaching standards Cricket Board conducted the first-ever Level 1 in the region, the Asian Cricket Council held a Level 2 Coaching Course for Women tutors in the region Coach Educator Course at the ICC Cricket Academy in from 16th to 19th October 2019 at the National Cricket Dubai from the 9th to 13th December 2019. Academy in Lahore, Pakistan. The coach educators attached to the Board of Through this program, ACC successfully imparted Control for Cricket in India (BCCI) and Pakistan basic cricket coaching knowledge to 16 participants Cricket Board (PCB) took the forefront in successfully from various countries across the region. The main conducting this program for ACC. Several accredited objective was to put the ACC vision in action in Level 3 coaches were invited from different ACC developing the women’s game in the grassroot level member countries to participate in this high-intensity throughout Asia and increase the sport’s popularity program. The purpose of this exercise was to cater to amongst girls. The highly-qualified coach educators the growing demand throughout the Asian region for working with the PCB developed and initiated the coach educators as they uplifted their communication complete three-day program which had various and assessment skills in order to go back to their practical and theoretical activities for all the partakers. countries and create the next generation of coaches. 02 33\n\nFinance & Operations 34 35\n\nREVIEW OF 2019 teams and upgrading skills of resource persons in total amount spent was well within the annual budget office related expenses. The operational expenditure Asia are considered development activities. Such of US$ 2.87 million, which was possible primarily for the period amounts to US$ 941K, which is lower 2019 was another exciting and eventful year for activities are funded by the development fund. on account of prudent expenditure management than the budget for the year. As in the past, staff costs the ACC, beginning with the T20 Western Region by hosting countries. Figure 1 above provides a and meeting expense are the highest expenditure tournament held in Oman in February. During the composition of development expenditure in 2019. heads under operational costs. Other expenses of year, seven tournaments and two educational programmes were organized, and ACC was U$ 32K comprise of office relocation expenses from After accounting for the abovementioned successful in implementing all the activities that were Sri Lanka to UAE. Additionally, rescheduling of the development expenditure, an amount of US$ 3.52 planned for the period, which included the inaugural yearend meetings to Y2020 has resulted in lower million remained in the Development Fund 1. This Women’s Emerging Teams Asia Cup. The event was meeting expenses compared to what was budgeted. carried forward to the next year and will be utilized to conducted with funding support from ACC’s Test support activities in 2020 and beyond. The ACC Accumulated Fund reported a deficit for the Playing Members and saw participation from teams period amounting to around U$ 544K - much lower from India, Pakistan, Sri Lanka, and Bangladesh. OPERATIONAL INCOME & EXPENDITURE than the projected deficit. This could be because One of the most notable achievements in 2019 was ACC’s operational expenses are funded from the of increased revenues and cautious expenditure the licensing of ACC’s sponsorship and ground rights Accumulated Fund, which is sourced by the surplus management. for the Asia Cup events which were to be conducted from Asia Cup, investment income and other from 2020-23. These rights were awarded through miscellaneous income. FINANCIAL POSITION a competitive bidding process where M/S Twenty ACC maintains two funds i.e. i) Development Fund 1 The Accumulated Fund reported an income of ACC’s financial position is stronger as of the balance First Century Pvt. Limited acquired the license over - comprising funds received from the ICC under the about US$ 397K consisting of an interest income sheet date. Receivables and payables mainly consist these rights by submitting the highest bid. The value previous ACC/ICC agreement; and ii) Development of US$ 287K and other income of US$ 110K. The of US$ 6.5 million receivable from the IOB and received for the four years was 55% more than the Fund 2 – including funds derived from Asia Cup interest income for the year exceeded the amount corresponding payables from the same. The exact amount received for the previous rights cycle. earnings. The purpose of having two separate funds reported in the previous year by 24%, which can be amount payable will be decided at a later stage once As projected, both the Accumulated Fund and the was to maintain an accurate record of the utilization the Bombay High Court decides the matter. attributable to the improved interest rates prevailing Development Fund recorded deficits at the end of of funds from these different sources. the year. A deficit of US$ 2.38 million reported in in 2019. Towards the end of 2019, however, we Except for the main Asia Cup, all other ACC events observed a gradual decrease in interest rates. Now, AUDITOR’S REPORT the Development Fund, whereas the deficit in the Accumulated Fund amounted to US$ 544K. However, and programmes are considered as development these rates are at historically low levels due to the ACC financials for 2019 have been audited EY DUBAI these figures were much lower than the amounts activities. Accordingly, and in conformity with ACC’s impact of COVID-19 pandemic. We, therefore, expect and EY Malaysia. This is the first year of audit for EY, that were projected owing to improved interest past practices, all costs associated with organizing a reduced investment income over the next few Dubai and EY Malaysia. The operations for 2019 were income, lower budgeted operational expenses and such events and programmes in 2019 were funded years as a result of this lowered interest rate. Other carried under ACC UAE and EY Dubai has provided an adjustment with previous year provisions. from the Development Fund, specifically the income of the Accumulated Fund comprised of unqualified opinion on the UAE financials. However, Development Fund 1. tender fees, income from the sale of match footages the audit report of EY Malaysia has qualification on DEVELOPMENT FUND A sum of U$ 2.39 million was spent on development and adjustments to previous year provisions. the legal matter. The activities focused on the improvement of playing programmes and activities in 2019 of which US$ 2.24 Operational costs include staff costs, office Thusith Perera standards, and competitiveness of ACC Member million had been utilized on ACC tournaments. The maintenance costs, meeting & travel costs, and other GM – Finance & Operations 36 37\n\n38 39\n\n40 41\n\n42 43\n\nLL 03608 LL 03608 The Asian Cricket Council The Asian Cricket Council (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, as a Company Limited by Guarantee) as a Company Limited by Guarantee) Consolidated statement of income and expenditure Council statement of income and expenditure For the financial year ended 31 December 2019 For the financial year ended 31 December 2019 (contd.) Accumulated Development Development Accumulated Development Development fund fund fund 2 Total fund fund fund 2 Total Group Note USD USD USD USD Council Note USD USD USD USD 31 December 2019 31 December 2019 Income Income Other operating income 5 397,632 5,360 - 402,992 Other operating income 5 376,232 5,360 - 381,592 Expenditure Expenditure Operating expenses 6 (40,699) - - (40,699) Operating expenses 6 (941,166) - - (941,166) Development fund Development fund - Development programmes expenses 7 - 21,476 - 21,476 - Development programmes expenses 7 - (2,372,403) - (2,372,403) - Administrative and other expenses 8 - (12,166) - (12,166) - Administrative and other expenses 8 - (12,166) - (12,166) Operations in United Arab Emirates (\"UAE\") (941,166) (2,384,569) - (3,325,735) - Net tournament and programmes expenses 9 - (2,393,879) - (2,393,879) - Administrative and other expenses 10 (900,591) - - (900,591) Deficit before tax (564,934) (2,379,209) - (2,944,143) (941,290) (2,384,569) - (3,325,859) Taxation 11 - - - - Deficit for the financial year (564,934) (2,379,209) - (2,944,143) Deficit before tax (543,658) (2,379,209) - (2,922,867) Taxation 11 - - - - Deficit for the financial year (543,658) (2,379,209) - (2,922,867) 7 8 44 45\n\nLL 03608 LL 03608 The Asian Cricket Council The Asian Cricket Council (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, as a Company Limited by Guarantee) as a Company Limited by Guarantee) Council statement of income and expenditure Statements of financial position For the financial year ended 31 December 2019 (contd.) As at 31 December 2019 Accumulated Development Development Group Council fund fund fund 2 Total 31.12.2019 31.12.2019 31.12.2018 1.1.2018 31 December 2018 Note USD USD USD USD Note USD USD USD USD (Restated) (Restated) Income Assets Net tournament income 4 1,822,223 - - 1,822,223 Other operating income 5 286,841 - - 286,841 Non-current assets Contribution from the Fixtures, fittings and Asian Cricket Council 4 - - 725,000 725,000 equipment 12 41,434 2 270 1,138 2,109,064 - 725,000 2,834,064 Investment in a subsidiary 13 - 13,739 - - Expenditure 41,434 13,741 270 1,138 Operating expenses 6 92,520 - - 92,520 Development fund Current assets - Development programmes expenses 7 - 37,701 - 37,701 Other receivables 14 8,424,168 8,049,763 8,323,536 6,924,565 - Administrative and other expenses 8 - (26,044) - (26,044) Deposits with financial 92,520 11,657 - 104,177 institutions 15 6,895,314 6,595,314 11,145,389 8,804,173 Cash at bank balances 15 2,326,695 2,278,371 585,970 1,587,629 Surplus before tax 2,201,584 11,657 725,000 2,938,241 17,646,177 16,923,448 20,054,895 17,316,367 Taxation 11 (4,818) - - (4,818) Surplus for the financial year 2,196,766 11,657 725,000 2,933,423 Less: current liabilities Other payables 16 7,318,078 6,773,520 6,814,947 6,848,804 Tax payable - - 4,818 - 7,318,078 6,773,520 6,819,765 6,848,804 Net current assets 10,328,099 10,149,928 13,235,130 10,467,563 The accompanying accounting policies and explanatory notes form an integral part of the financial statements. Less: non-current liability 9 Provision for gratuity 17 184,588 - 127,588 294,312 10,184,945 10,163,669 13,107,812 10,174,389 Represented by: Accumulated fund 18 4,956,170 4,934,894 5,499,828 3,303,062 Development fund 19 3,523,775 3,523,775 5,902,984 5,891,327 Development fund 2 20 1,705,000 1,705,000 1,705,000 980,000 10,184,945 10,163,669 13,107,812 10,174,389 The accompanying accounting policies and explanatory notes form an integral part of the financial statements. 10 46 47\n\nLL 03608 LL 03608 The Asian Cricket Council (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, The Asian Cricket Council as a Company Limited by Guarantee) (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, as a Company Limited by Guarantee) Statements of changes in funds For the financial year ended 31 December 2019 Statements of cash flows For the financial year ended 31 December 2019 Accumulated Development Development Group Council fund fund fund 2 Total 31.12.2019 31.12.2019 31.12.2018 USD USD USD USD USD USD USD Group Cash flows from operating activities (Deficit)/surplus of income over expenditure (2,922,867) (2,944,143) 2,938,241 At 1 January 2019 5,499,828 5,902,984 1,705,000 13,107,812 Adjustments for: Deficit for the financial year (543,658) (2,379,209) - (2,922,867) Depreciation of fixtures, fittings and equipment 4,656 268 868 At 31 December 2019 4,956,170 3,523,775 1,705,000 10,184,945 Provision/(reversal) of gratuity 57,000 - (166,724) Interest income (287,398) (287,398) (230,165) Council Operating (deficit)/surplus before working capital changes (3,148,609) (3,231,273) 2,542,220 At 1 January 2019 5,499,828 5,902,984 1,705,000 13,107,812 Changes in working capital: Deficit for the financial year (564,934) (2,379,209) - (2,944,143) Receivables (100,632) 260,034 (1,398,971) At 31 December 2019 4,934,894 3,523,775 1,705,000 10,163,669 Payables 503,131 (169,015) (33,857) Net cash flow (used in)/from operations (2,746,110) (3,140,254) 1,109,392 At 1 January 2018, as previously stated 3,932,369 5,891,327 980,000 10,803,696 Tax paid (4,818) (4,818) - Prior financial year adjustments (629,307) - - (629,307) Interest received 287,398 287,398 230,165 At 1 January 2018, as restated 3,303,062 5,891,327 980,000 10,174,389 Net cash flows (used in)/from Surplus for the financial year 2,196,766 11,657 725,000 2,933,423 operating activities (2,463,530) (2,857,674) 1,339,557 At 31 December 2018 5,499,828 5,902,984 1,705,000 13,107,812 Cash flows from investing activity Purchase of fixtures, fittings and equipment representing net cash used in investing activity (45,820) - - The accompanying accounting policies and explanatory notes form an integral part of the financial statements. Cash flows from financing activity Net movement in deposits with licensed banks representing net cash from/(used in) 11 financing activity 4,250,075 4,550,075 (2,341,216) Net increase/(decrease) in cash and cash equivalents 1,740,725 1,692,401 (1,001,659) Cash and cash equivalents at beginning of the financial year 585,970 585,970 1,587,629 Cash and cash equivalents at the end of the financial year (Note 15) 2,326,695 2,278,371 585,970 The accompanying accounting policies and explanatory notes form an integral part of the financial statements. 12 48 49\n\nLL 03608 LL 03608 The Asian Cricket Council The Asian Cricket Council (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, (Incorporated in Labuan F.T., Malaysia, under the Labuan Companies Act, 1990, as a Company Limited by Guarantee) as a Company Limited by Guarantee) Notes to the financial statements - 31 December 2019 2. Significant accounting policies (cont'd.) 1. Council information 2.2 Changes in accounting policies The Council is established under the Memorandum of Articles. The Council is a Council The accounting policies adopted by the Group and the Council are consistent with limited by guarantee which was incorporated in Labuan F.T., Malaysia under the Labuan those of the previous financial year except as follows: Companies Act 1990, on 31 January 2003. On 1 January 2019, the Group and the Council adopted the following new and The address of the registered office and principal place of business of the Council is as amended IFRSs mandatory for annual financial periods beginning on or after 1 follows: January 2019. Brumby Centre Effective for annual Lot 42, Jalan Muhibbah periods beginning 87000 Labuan F.T., Malaysia Description on or after The principal activities of the Council consist of developing, coordinating, regulating and IFRS 9: Prepayment Features with Negative Compensation 1 January 2019 promoting the game of cricket in the Asian region. The Council has members from various (Amendments to IFRS 9) countries (\"ACC Members\"). ACC members are admitted into the Council based on the IFRS 16: Leases 1 January 2019 eligibility specified in accordance with the Memorandum of Articles. IAS 28: Long-term Interests in Associates and Joint Ventures (Amendments to IAS 28) 1 January 2019 The principal activities of the subsidiary is disclosed in Note 13. Annual Improvements to IFRSs 2015 - 2017 Cycle 1 January 2019 (Amendments to IFRS 3, IFRS 11, IAS 12 and IAS 23) The financial statements were authorised for issue by the Executive Board Members in IAS 19: Plan Amendment, Curtailment or Settlement 1 January 2019 accordance with a resolution of the Executive Board Members on 24 November 2020. (Amendments to IAS 19) IFRIC Interpretation 23: Uncertainty over Income Tax Treatments 1 January 2019 2. Significant accounting policies The adoption of the above standards did not have any material effect on the financial performance or position of the Group and the Council. 2.1 Basis of preparation The financial statements of the Group and the Council have been prepared in accordance with International Financial Reporting Standards (\"IFRS\") and the requirements of the Labuan Companies Act, 1990 in Malaysia. On 1 January 2019, the Group and the Council adopted new and amended IFRSs and IFRIC Interpretations that have been issued by the International Accounting Standards Board (“IASB”) as described fully in Note 2.2. The financial statements of the Group and the Council have been prepared on a historical cost basis except as otherwise disclosed in the accounting policies below. The financial statements are presented in United States Dollar (\"USD\"), which is also the functional currency of the Group and the Council. 13 14 50 51"}], "Akila Dananjaya was the leading wicket-taker for Sri Lanka in the 2018 ACC Emerging Teams Asia Cup with nine dismissals.": [{"url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-india-by-4-wickets-in-2nd-t20i-to-level-series-1-1-1833926-2021-07-28", "page_content": "By Rohan Sen: Sri Lanka beat a Covid-hit Indian team by 4 wickets in the second T20 international on Wednesday to level the 3-match series 1-1 at the R Premadasa stadium in Colombo.\n\nChasing a challenging target of 133 on a slow pitch at the R Premadasa stadium, the Lankans cross ed the finish line in the final over thanks to a handy 7th-wicket partnership between Dhananjaya de Silva and Chamika Karunaratne.\n\nadvertisement\n\nThe duo rescued the Lankan innings in the death overs, after they were reduced to 105 for 6, to register only their second win out of 5 games against India this month. De Silva top-scored with an unbeaten 40 to guide Sri Lanka home along with Karunaratne, who remained not out on 12. Opening Minod Bhanuka also chipped in with a crucial knock of 36 off 31 balls at the top of the order.\n\nIND vs SL 2nd T20I: Highlights\n\nThe Indian bowlers made a fist of the game with Kuldeep Yadav leading the way with 2 for 30 from his 4 overs while Bhuvneshwar Kumar, Chetan Sakariya, Rahul Chahar and Varun Chakravarthy picked up a wicket each.\n\nBut Sri Lanka's performance came against an Indian side which was missing 9 of its regular players after Krunal Pandya tested positive for Covid-19 on Tuesday.\n\nManish Pandey, Hardik Pandya, Prithvi Shaw, Deepak Chahar, Suryakumar Yadav, Ishan Kishan, Yuzvendra Chahal and Krishnappa Gowtham were ruled out of the final two T20Is after being identified as the close contacts of Krunal, who tested positive on July 27 which forced the postponement of this match by 24 hours.\n\nIndia had to field 4 debutants Nitish Rana, Devdutt Padikkal, Ruturaj Gaikwad and Chetan Sakariya due to the unavailability of the other players.\n\nLANKAN SPINNERS CHOKE INDIA\n\nEarlier, the Sri Lankans restricted India to 132 for 5 on a sluggish wicket at the R Premadasa Stadium after Dasun Shanaka won the toss and elected to bowl first.\n\nShanaka operated with 5 spinners out of which Akila Dananjaya ended up as the pick of the bowlers with 2 wickets from 29 runs from his 4 overs while Wanindu Hasaranga and the skipper bagging a wicket each.\n\nShikhar Dhawan top-scored with 40 off 42 balls while Devdutt Padikkal and Ruturaj Gaikwad made useful contributions but the inexperience showed as the rest struggled to failed to get going on the turning wicket.\n\nIndia only had 4 specialist batsmen in their lineup along with wicketkeeper Sanju Samson due to the unavailability of the 9 regulars.\n\nThe third and final T20I will be played at the same venue in Colombo on July 29 after which the Indian players will return home while Krunal Pandya and 8 of his close contacts will continue to quarantine in their hotel rooms."}, {"url": "https://www.icc-cricket.com/news/1057207", "page_content": "Akila Dananjaya is set to return to international cricket after being included in Sri Lanka’s squad for the upcoming five-match ODI series against South Africa.\n\nDananjaya’s action has been declared as legal after undergoing remedial work, and he will resume his international career having last played for Sri Lanka in their Test series against England in 2018.\n\nDananjaya's inclusion is one of a number of changes to Sri Lanka’s squad. Experienced opener Upul Tharanga returns to the side having missed out on selection for the tour of New Zealand, while Oshada Fernando, who made his Test debut in Sri Lanka’s one-wicket win over South Africa in Durban last week, has received his maiden ODI call-up.\n\nThe experienced Upul Tharanga is back in the ODI set-up\n\nOthers selected include: Avishka Fernando, Kamindu Mendis, Priyamal Perera, Isuru Udana and Vishwa Fernando. Angelo Perera, who recently became the second man in history to score two double centuries in a first-class match, has also been named in the 17-man squad.\n\nUdana's inclusion is a particularly notable one – the left-arm seamer's last ODI appearance came against India in July 2012. However, after some impressive performances for Sri Lanka A against Ireland Wolves – Udana took 11 wickets in five List A matches – he now finds himself back in the 50-over reckoning.\n\nDinesh Chandimal, who missed out on selection for the Test series, has also been excluded from the ODI squad. The ODI series is Sri Lanka's last before squads for the ICC Men's Cricket World Cup are announced in April.\n\nSri Lanka have also announced a change to their squad for the ongoing Test series. Chamika Karunaratne, who made his Test bow against Australia at the start of the month, has suffered an injury and is to be replaced by Asitha Fernando.\n\nThe first ODI between South Africa and Sri Lanka is set to take place on 3 March in Johannesburg."}, {"url": "https://www.espncricinfo.com/series/sl-v-ind-2017-1109590/sri-lanka-vs-india-2nd-odi-1109606/match-report", "page_content": "Bhuvneshwar Kumar and MS Dhoni added an unbroken 100, an Indian record for the eighth wicket, to turn the tables on Sri Lanka and lead India to a three-wicket win\n\nIndia 231 for 7 (Rohit 54, Bhuvneshwar 53*, Dhawan 49, Dananjaya 6-54) beat Sri Lanka 236 for 8 (Siriwardana 58, Bumrah 4-43) by three wickets (DLS method)\n\nHis name is Akila Dananjaya . He is supposed to be an offspinner but his nimble fingers can do what they want to the ball. One minute in 2012, he was bowling in the nets, the next he was fast-tracked into the Sri Lanka team by no less a spotter of talent than Mahela Jayawardene, in a World T20 to boot. If that isn't enough drama, on debut , he struck in his first over, and then got hit in the face by a cricket ball. If his career had ended then, he would still have felt it was a roller-coaster.\n\nThen came August 24, 2017. And even if it ended with victory for India by three wickets, he would never forget this rain-hit night.\n\nTwenty-three-years-old now, a day after getting married, Dananjaya took 6 for 54 and had one of the world's mightiest batting line-ups looking at him like he was a ghost. Virat Kohli was bowled for 4, deceived in the manner he might once have been while playing backyard cricket while still a child. He cast a dumbstruck look at the pitch as he walked off but the demon wasn't there. He was 22 yards away, smiling and whooping and dancing with a bunch of men who had put only 236 runs on the board, but felt they were on their way to defending it.\n\nMS Dhoni watched all of the revelry, typically expressionless. He had more important work to do, like reviving India's chase, yet again.\n\nFrom 131 for 7, through sheer force of will and fiendish common sense, he marshalled India towards their target. He had advice for those who would listen, and Bhuvneshwar Kumar, in the course of a record-breaking eighth-wicket partnership of 100, certainly did. Don't get stuck on the back foot, said the master to his protégé. Stick with him, pleaded all of India as they turned to a familiar hero.\n\nAkila Dananjaya celebrates with his team-mates after snaring his sixth victim • Associated Press\n\nMost of the Dhoni innings that stick in the mind feature brutish strokes and calculated carnage. But with a small target defended by a set of bowlers that were on an almighty roll, a different type of innings was required. One that would fetch 45 runs off 68 deliveries at a strike-rate of 66.17 with only one boundary. He had denied Muttiah Muralitharan in 2011 . He did the same to Dananjaya on Thursday.\n\nFor one brief moment though, Sri Lanka thought they had glory. In the 35th over, with India 59 runs away, Vishwa Fernando produced a false shot from Dhoni and the ball trickled between his legs to hit the stumps. But the zing bails - heavier than the normal ones - wouldn't fall. And neither would Dhoni. He and Bhuvneshwar brought the target down below 50, with a slog sweep for six. To 30, with back-to-back fours. Under 10, as both the sky and Sri Lanka's hopes faded to black.\n\nIt was so that Pallekele, which had gasped and swooned and howled and cried, had to go back home knowing their country had lost playing its 800th ODI. But there might well be a smile on their faces once the wound stops feeling so fresh. At long last, their prayers had been answered. They had found someone who could actually land the ball where an Indian batsman didn't want it.\n\nThere had been 329 runs and 44.2 overs between a Sri Lankan bowler taking a wicket on this tour. In the space of 15 balls, Dananjaya had four. By his fifth over, he had a five-for. Where was he all this time? Why hasn't he been playing every match for his country? Why would anyone hide a bowler who, on one of his days, rouses thousands of people up and make them forget woes which had seemed all-consuming only last weekend\n\nBhuvneshwar Kumar posted his maiden ODI half-century and led India's chase • Associated Press\n\nBut to do that, Dananjaya had to become a villain to a few people. Like Rohit Sharma, who had, until the 16th over, batted with such ease that he was playing any shot that popped into his mind, like a scoop against the express pace of Dushmantha Chameera. In the blink of an eye, he had scored one-sixth of the 37 runs he had made over his last 10 ODIs on the island. Then he had to face an offspinner. He saw a good length ball pitching on middle and leg and thought it ripe to sweep. After all, it would be turning further down leg. Except, it didn't. It couldn't. It was a legbreak. It spun the other way and pinned the man who dared to make 264 against Sri Lanka right in front. India were 109 for 1 in the 16th over.\n\nUp the order came Kedar Jadhav. He was previously earmarked to be a finisher, but India wanted to experiment in this series. Only Frankenstein would not find the monster he was looking for this night. Dananjaya got back to his mark. He changed his grip; instead of the front two fingers gripping the ball, all of them wrapped around it. And after he trotted up to the crease, he released it from the back of his hand. Jadhav did not see it. But he sure as heck heard it crashing into middle stump.\n\nProper legspiners would not have the control Dananjaya does. Nor would they have his ripping googly. He got four of his wickets with it - three of them bowled, all of them in the same over. Hardik Pandya handed him his third five-wicket haul in all representative cricket, blindly charging out of his crease to be stumped off an ugly shot.\n\nBut such a special spell still ended up on the wrong side of a scorecard because Sri Lanka's batsmen had let him down. Five of the top six faced at least 20 deliveries, and even Upul Tharanga, the man who missed out, got two scintillating boundaries. The pitch held no threat, the bowling wasn't anything more than efficient, a more experienced team might have got through the tough stages to post a monumental total.\n\nSri Lanka were certainly heading that way after being put in. They were coasting at 70 for 1 in the 14th over, but lurched to 121 for 5 in the 29th, and if it wasn't for Milinda Siriwardana finally unveiling the composure and shot selection expected of an international batsman, who knows what the score might have been? The allrounder made a timely half-century - his third in the format - and lifted Sri Lanka to a total that came within three wickets of being enough."}, {"url": "https://english.newsnationtv.com/sports/cricket/akila-dananjaya-lasith-malinga-sri-lanka-squad-for-three-match-odi-series-vs-bangladesh-231853.html", "page_content": "highlights Lasith Malinga will retire after the end of the first ODI.\n\nAkila Dananjaya will play for the first time since December 2018.\n\nMalinga is the third-highest wicket-taker for Sri Lanka in ODIs.\n\nNew Delhi:\n\nAkila Dananjaya’s career was at the crossroads after his action was deemed illegal in December 2018. He remodeled his action and was cleared by the International Cricket Council in February 2019 but he was not selected in the World Cup squad. Sri Lanka failed to qualify for the knock-out stages of the tournament as they finished in sixth spot. Ahead of the series against Bangladesh, Dananjaya has been picked in the side as the lone specialist spinner for the three-match ODI series. Apart from Dananjaya, the Sri Lanka selectors named Shehan Jayasuriya, Lahiru Kumara, Wanindu Hasaranga and Dasun Shanaka in their 17-man squad.\n\n\n\nThe match on July 26 will witness the final ODI for Lasith Malinga, who has announced his retirement from the format. Malinga has been picked only in the first match while Shanaka will join the squad for the remaining two matches. Niroshan Dickwella and Dinesh Chandimal continue to be left out of the side.\n\n\n\nPosting a video message to his fans on his wife's Facebook page, Malinga said he felt no ill will towards officials and players who may have tried to push him out of the team. The 35-year-old said he was sidelined by selectors two years ago but was able to prove his value to the national team at the recent World Cup.\n\n\"Friday will be the last day you will see me playing an ODI match,\" Malinga said. \"If you can, please come for the match.\" During practice Tuesday ahead of the first ODI against Bangladesh, Malinga said he hoped to play T20 cricket and had his sights on the 2020 World Cup in Australia. \"I hope to be able to take Sri Lanka to the next T20 World Cup,\" he said.\n\n\n\nMalinga, 35, will leave as Sri Lanka’s third highest wicket-taker in ODI cricket with 335 wickets in 219 innings so far. Only Muttiah Muralitharan (523) and Chaminda Vaas (399) have taken more wickets than Malinga in ODIs for Sri Lanka. He was Sri Lanka’s highest wicket-taker at the World Cup, claiming 13 scalps in seven innings. Malinga retired from Test cricket in 2010 but continued to remain available in other formats since then.\n\n\n\nSquad: Dimuth Karunaratne (capt), Kusal Perera, Avishka Fernando, Kusal Mendis, Angelo Mathews, Lahiru Thirimanne, Shehan Jayasuriya, Dhananjaya de Silva, Dasun Shanaka (Only 2nd and 3rd ODI), Wanindu Hasaranga, Akila Dananjaya, Amila Aponso, Lasith Malinga (only 1st ODI), Nuwan Pradeep, Kasun Rajitha, Lahiru Kumara, Thisara Perera, Isuru Udana."}, {"url": "https://sportstar.thehindu.com/cricket/akila-dananjaya-five-wicket-haul-ross-taylor-approaches-century-new-zealand-vs-sri-lanka-first-test-cricket-report/article64892315.ece", "page_content": "Sri Lanka spinner Akila Dananjaya took a five-for for the fourth time in six Tests only for Ross Taylor to provide some New Zealand resistance on the opening day of a rain-affected first Test in Galle.\n\nNew Zealand, back in action for the first time since its thrilling Super Over loss to England in the Cricket World Cup final a month ago, won the toss and looked comfortable on 64 without loss.\n\nHowever, Tom Latham (30), Kane Williamson (0) and Jeet Raval (33) all fell in quick succession as Dananjaya spun a web, the 25-year-old then returning before Tea to account for Henry Nicholls (42) and BJ Watling (1).\n\nREAD: India manager Sunil Subramaniam called back from West Indies\n\nRoss Taylor had moved on to an unbeaten 86 by the time a torrential downpour 7.4 overs into the final session ended the day's play prematurely with New Zealand 203-5.\n\nDananjaya made the breakthrough when Latham dangled his bat out and nicked behind and he had the prized wicket of Williamson three balls later, the New Zealand captain meekly chipping straight to short mid-wicket.\n\nThe touring side was three down when Raval gave Dhananjaya de Silva a low catch at slip, but Taylor and Nicholls put on a 100-run stand to wrest back the initiative.\n\nREAD: CoA clarifies no conflict of interest with Dravid\n\nIt was Dananjaya who broke that partnership by trapping Nicholls, a decision which he frivolously appealed, and Watling went two overs later as he was pinned straight in front when attempting a wild swipe.\n\nThe fifth wicket heralded Tea and the final session of the day proved brief thanks to an almighty shower, with Mitchell Santner (8 not out) due to return on day two alongside Taylor."}, {"url": "https://sportstar.thehindu.com/cricket/asia-cup-stats-most-wickets-bowling-records-malinga-shakib-mendis-ravindra-jadeja/article65793587.ece", "page_content": "Published : Aug 21, 2022 11:59 IST\n\nHere is a look at the top wicket-takers in the history of the Asia Cup. In keeping with the prevalent conditions in the continent, spinners dominate the list, with Lasith Malinga the only fast-bowler in the top five. While no Indian figures even in the top 10, Ravindra Jadeja is ninth on the list with 22 wickets.\n\nLasith Malinga (33 wickets)\n\nFormer Sri Lanka pacer Lasith Malinga is the leading wicket-taker in the Asia Cup with 33 wickets in 15 innings. His staggering numbers include two four-fers and three five-wicket hauls. His best figures of five for 34 came against Pakistan in the 2010 edition. His two other five-wicket hauls were also against Pakistan, both in the 2014 tournament where he picked 11 wickets in four matches to help Sri Lanka clinch the title.\n\nInnings Wickets Economy Rate Average Best 4/5 15 33 4.70 18.84 5/34 2/3\n\nMuttiah Muralitharan (30 wickets)\n\nLegendary spinner Muttiah Muralitharan is hot on the heels of his compatriot Malinga with 30 wickets in 24 innings at the continental event. His most successful outing was in 2008, when he scalped 11 wickets in five matches, which included a five for 31 against Bangladesh. However, Muralitharan has had limited success against stronger oppositions such as India and Pakistan, picking a combined 10 wickets in 16 matches against the two teams.\n\nInnings Wickets Economy Rate Average Best 4/5 24 30 3.75 28.83 5/31 1/1\n\nAjantha Mendis (26 wickets)\n\nThird on the list is yet another Sri Lankan Ajantha Mendis, with a staggering haul of 26 wickets in just eight matches in the Asia Cup. The wily off-spinner turned heads when he wrecked India in the 2008 Asia Cup final in Karachi with figures of six for 13. The Men in Blue had no response to the then 23-year-old’s mystery and capitulated for 173 in response to 273. Earlier in the tournament, Mendis had tormented UAE and Pakistan with figures of five for 22 and four for 47, respectively and ended the 2008 edition with 17 wickets in five matches at an astounding average of 8.52.\n\nInnings Wickets Economy Rate Average Best 4/5 8 26 3.98 10.42 6/13 2/2\n\nSaeed Ajmal (25 wickets)\n\nYet another off-spinner, Saeed Ajmal, makes it to the list of the top wicket-takers at the Asia Cup. With 25 wickets in 12 innings under his belt, Ajmal is Pakistan’s most successful bowler in the tournament. He had a dream run in the 2014 edition, where he scalped 11 wickets in five matches in Pakistan’s march to the final. Ajmal also helped Pakistan clinch the title in 2012, contributing with eight wickets in four matches.\n\nInnings Wickets Economy Rate Average Best 4/5 12 25 4.21 19.40 3/26 0/0\n\nShakib Al Hasan (24 wickets)\n\nAll-rounder Shakib Al Hasan, who will lead Bangladesh in Asia Cup 2022, is also his country’s highest wicket-taker in the tournament with 24 scalps in 18 innings. His most fruitful outing was at the last edition in 2018, where he picked seven wickets in four matches, including four for 42 against Afghanistan in the group stage. Other than topping the bowling charts for Bangladesh, Shakib is also third on the list of the highest run-scorers for the Tigers in the tournament with 479 runs at an average of 28.17."}, {"url": "https://www.sportskeeda.com/cricket/sri-lanka-vs-india-2017-akela-dhananjaya-six-wicket-haul-destroyed-indian-batsmen", "page_content": "When I began to write this article, I was prepared to pen down the tale of three quick wickets by Akila Dananjaya. By the time I reached the end of my article, he had registered a six-wicket haul in the match. If that does not describe the voodoo Dananjaya hid in his Arsenal, I don't know what will.\n\n2nd ODI, second innings, and countless surprises...Sri Lanka finally served their revenge dish to their guests.\n\nIt all looked fine for the Men in Blue in the beginning. Repetitive may be the right word but Dananjaya carried a magic wand to change the fortunes of this match. His six-wicket haul snatched the match away from the plates of the Indian team while the latter struggled to recover from Dananjaya's bowling assault.\n\nFirst, he hunted Rohit Sharma who looked in form after a long time. He scored 54 runs after which he was sent back to the pavilion by Dananjaya. He was cruising, was Rohit, and for some reason decided to get down low to a full ball in order to sweep only to miss the ball which crashed into his pads.\n\nSharma was quite confident about not being out and he went for a review upon Dhawan's insistence. Little did they know that the ball that Sharma's tried to sweep had landed him in deep trouble. Wicket number 1...India's opening partnership had been snapped for 109, a Sri Lankan bowler had picked the first wicket of this series. No worries India thought, we have the belief, Dananjaya retorted!\n\nIn the sixteenth over, Shikhar Dhawan was dismissed for 49 by Siriwardana and Dananjaya returned with the ball in the next over.\n\nWith Kedhar Jadhav on strike in the 17th over and Dananjaya on a roll, he delivered a googly which skidded across the surface, kissed the inside edge of his bat and was headed for the middle stump. Bamboozled, Jadhav had a puzzling look and meandered back... not the match, it came roaring back to life.\n\nIndian fans' eyebrows were not yet furrowed, but drips of sweat were forming!\n\nAs Virat Kohli walked in to bat, he smashed Dananjaya's first ball for a splendid boundary. Yeah, normalcy folks, the king of chases is in, calm down. Just when everyone thought the captain will let the hosts know who dominates the game, Dananjaya decided to make up for his previous ball.\n\nHe delivered a googly which was fullish, Kohli moved his front foot out of the way to play his whiplash cover drive, the ball deviated, missed that broad bat and smashed the stumps. Boom... the crowd were baying for Kohli's blood, Kohli himself was baying for the solace of the dressing room. He stood there perplexed, seeking answers from KL Rahul as the Sri Lankan team came together for a wild celebration. Energy simmering all over the place, the ghosts of the series slowly fading away!\n\nIt was Rahul's turn next. Another googly and another batsman bowled. The ball tricked Rahul as it gently touched the inside edge and went past the pads to hit the wickets.\n\nHardik Pandya looked confident at the crease being well accompanied by MS Dhoni. Unfortunately, Pandya was out for a duck today. As he advanced to hit the ball, it betrayed him smartly after brushing against his bat and landing directly in Niroshan Dickwella's hands.\n\nAs Pandya started to walk back, Dhoni was seen contemplating the measures to revive team India. Axar Patel walked in to bat.\n\nDananjaya delivered a fantastic ball and Patel misjudged it. No one was even surprised, not anymore. He moved forward to defend but the ball sneaked its way around his bat and went straight to the stumps. There was no way to cancel out that splendid dismissal.\n\nTeam India is determined to make a comeback in this match while they hope to veil the over-confidence they bore ahead of this encounter. As Dhoni and Bhuvneshwar Kumar are struggling to calculate their moves, faces look grieved in the Indian dressing room. Sri Lankan fans are seen dancing to the rhythm of their heartbeat and the hosts are hailing their new hero.\n\nFun fact, Dananjaya got married yesterday. I was even prepared to flood my social media articles with his pictures but I guess that will be possible once I recover from this spell. In my defence, I wasn't prepared for this just like the other 1.3 billion Indian fans (and probably the entire island of Sri Lanka).\n\nDespite the results of this match, one cannot overlook the spell that left the entire cricket world spellbound.\n\nAkila Dananjaya, take a bow, he also took the man of the match, some solace after all!\n\nPoll : 0 votes"}, {"url": "https://cricshots.com/akila-dananjayas-six-wicket-provided-perfect-finish-for-sri-lanka-in-the-odi-series-against-south-africa/", "page_content": "Akila Dananjaya’s six-wicket provided perfect finish for Sri Lanka in the ODI series against South Africa\n\nSri Lankan off-spinner Akila Dananjaya’s six-wicket helped the hosts Sri Lanka to sign off the five-match ODI series against the visitors South Africa with a fine victory. However, Sri Lanka failed to win the series as South Africa won the series by 3-2.\n\nOn Sunday’s day-night game at R.Premadasa Stadium (Khettarama, Colombo), Sri Lankan captain Angelo Mathews decided to bat first after winning the toss. From the opening wicket, Sri Lanka had a total of four 50 or more runs partnerships that helped the team to score 299/8 at the end of 50 overs. In the last 10 overs, Sri Lanka managed to score 93/3.\n\nSri Lankan skipper Mathews played a brilliant unbeaten 97-run knock off 97 balls (11 fours and one sixer). Sri Lankan opener and wicketkeeper-batsman Niroshan Dickwella was the second highest scorer with 43 runs off 65 balls (5 fours). Also, Kusal Mendis (38) and Dhananjaya de Silva (30) reached the 30-run marks.\n\nAmong the South African bowlers, Willem Mulder (2/59) and Andile Phehlukwayo (2/60) got two wickets each while Kagiso Rabada (1/47), Junior Dala (1/57) and Keshav Maharaj (1/34) picked up one wicket each.\n\nIn reply, South African batsmen totally surrendered against the Sri Lankan off-spinner Akila Dananjaya who finished with the bowling figure of 9-0-29-6. Only the stand-in skipper Quinton de Kock (54) and no.3 batsman Aiden Markram (20) reached the 20-run marks while seven visiting batsmen failed to reach the double-digit score. South Africa was bundled out for just 121 runs (24.4 overs) as Sri Lanka won by 178 runs.\n\nAmong the other Sri Lankan bowlers, Lahiru Kamara (2/34) bagged two wickets while Suranga Lakmal (1/22) and Dhananjaya de Silva (1/21) claimed one wicket each.\n\nBrief Scores: Sri Lanka – 299/8 in 50 overs (Angelo Mathews 97*, Niroshan Dickwella 43; Willem Mulder 2/59)\n\nSouth Africa – 121 in 24.4 overs (Quinton de Kock 54, Aiden Markram 20; Akila Dananjaya 6/29)\n\nResult – Sri Lanka won by 178 runs\n\nImportant stats highlights of the match:"}, {"url": "https://www.sportskeeda.com/cricket/sri-lankan-spinner-akila-dananjaya-cleared-to-bowl-in-international-cricket", "page_content": "The International Cricket Council (ICC) on Friday informed that Sri Lanka spinner Akila Dananjaya can start bowling in international cricket again after remedial work on his bowling action and re-assessment of the same.\n\nAkila Dananjaya was banned from bowling for one year in September 2019 after he was reported during a Test match against New Zealand in Galle. His suspension ended in August 2020.\n\nReleasing a statement on Akila Dananjaya, the ICC said:\n\n\"Following remedial work and re-assessment, the bowling action of Sri Lanka spinner Akila Dananjaya has been found to be legal, and he can resume bowling in international cricket.”\n\nAlthough Dananjaya’s suspension ended in August 2020, he still needed to prove to the ICC that his remodeled action complied with the maximum limit of 15 degrees of elbow flexion.\n\nSince travelling to ICC-accredited biomechanics lab wasn’t allowed owing to COVID-19 restrictions, Akila Dananjaya was cleared by a panel that went through video footage of the spinner’s remodeled action provided by Sri Lanka Cricket. The ICC release further informed:\n\n\"An Expert Panel studied video footage of Dananjaya's bowling action provided by Sri Lanka Cricket, as attendance and assessment at an ICC accredited centre was not possible due to various restrictions resulting from Covid-19.\"\n\nThe International Cricket Council (ICC) today announced that following remedial work and re-assessment, the bowling action of Sri Lanka spinner Akila Dananjaya has been found to be legal, and he can resume bowling in international cricket.https://t.co/RlNVVe4dqe — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) January 8, 2021\n\nThe panel, after studying the provided footage carefully, came to the conclusion that the elbow extension in his new bowling action was \"within the 15-degree level of tolerance\" allowed as per the ICC regulations.\n\nThe ICC statement further informed:\n\n\"To assist the match officials, they will be provided with the report, images and video footage of the bowler's remodeled legal bowling action.\"\n\nAkila Dananjaya’s international stats\n\n27-year-old Akila Dananjaya made his international debut in a T20I against New Zealand back in September 2012. His ODI debut followed a couple of months later against the same opponent, but he had to wait until February 2018 before he made his Test debut, against Bangladesh at Dhaka.\n\nPrior to his suspension, Akila Dananjaya featured in six Tests, 36 ODIs and 22 T20Is, claiming 33, 51 and 22 wickets respectively. The slow bowler, who has an ODI fifty to his name, last featured for Sri Lanka in a T20I against New Zealand in September 2019.\n\nHe finished with impressive figures of 2 for 28 in Lanka’s 37-run triumph. This was the same match in which Lasith Malinga picked up four wickets in four balls.\n\nPoll : 0 votes"}, {"url": "https://www.theguardian.com/sport/2018/nov/11/sri-lanka-england-cricket-akila-dananjaya-suspect-bowling-action", "page_content": "The Sri Lanka off-spinner Akila Dananjaya was reported for a suspect bowling action during the first Test against England.\n\nThe match officials’ report handed to the Sri Lanka management cited concerns about the 25-year-old’s action, which will be scrutinised further under the ICC process laid down for international cricket.\n\nDananjaya is required to undergo testing within 14 days but he is permitted to continue bowling until the results are known.\n\nThe chances of Dananjaya being selected for the Kandy Test had already been reduced, because he had a wretched game in Galle, where he took two for 183 in the match and scored only eight runs in two innings.\n\nDefinitely out of the remainder of the series is the captain, Dinesh Chandimal, because of a groin injury. Charith Asalanka, who scored an unbeaten half-century against England in a warm-up match, has been called up as a replacement.\n\nEngland, who arrived in Kandy in time to mark Armistice Day in the gardens of their hotel, have taken the unusual step of trimming their party in the middle of the tour.\n\nOllie Pope, the 20-year-old batsman from Surrey, will leave Sri Lanka on Wednesday, the first day of the second Test and head for Dubai. There he will join the Lions tour in the UAE and he will be available for the unofficial Test match against Pakistan A. It starts on 18 November and is followed by five ODIs and two T20s.\n\nWith Jonny Bairstow returning to fitness and Joe Denly also available the chances of Pope being required for the Tests have dwindled to practically zero. He will gain far more benefit from playing in the UAE than batting in the nets and carrying drinks in Sri Lanka.\n\n“It is important Ollie is playing and the selection panel felt that to aid his development the best course of action is for him to play for the Lions in a competitive series against Pakistan A,” Trevor Bayliss said.\n\nThe England coach added: “Ollie needs some game time before the West Indies Test tour early next year and will get more out of playing competitively for the Lions. He will get the opportunity of playing up to eight matches across all formats in the UAE.”"}]}