{"Pattern is Movement is an American indie rock band from Philadelphia, Pennsylvania.": [{"url": "https://www.wikiwand.com/en/Pattern_Is_Movement", "page_content": "Pattern Is Movement (often stylized as Pattern is Movement) is an American indie rock band from Philadelphia, Pennsylvania that established in 2001. They have been categorized by some reviewers as a math rock group and compared to groups such as Don Caballero, Sunny Day Real Estate and Pinback. However, as the band moved from a five piece to a two piece, their sound moved away from the angular sound of previous records and closer to a more melodic heavy composition structure with sing-a-long choruses. The current two-piece sound can be attributed to influences such as Dirty Projectors, Beirut and Grizzly Bear. In an interview with Baeble Music, Ward coined the band with the term \"indie cabaret\".[citation needed]\n\nAmerican indie rock band\n\nQuick facts: Pattern Is Movement, Background information, ... ▼\n\nIn 2006, producer and engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes. Solter is credited on the album with \"machines, razors, tape.\"[1]\n\nSince 2008, Pattern Is Movement have been performing as a two-piece. On the January 2008, issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year\".[2] The band emerged with a new album, All Together, documenting the lineup in the spring of 2008, also recorded with Solter.[3] In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing\".\n\nIn April 2009 they became one of Limewire's Featured Artists.\n\nIn 2015, after releasing their self-titled fourth album, Pattern Is Movement announced their farewell tour.[4]"}, {"url": "https://wiki.alquds.edu/?query=Pattern_Is_Movement", "page_content": "American indie rock band\n\nPattern Is Movement (often stylized as Pattern is Movement) is an American indie rock band from Philadelphia, Pennsylvania that established in 2001. They have been categorized by some reviewers as a math rock group and compared to groups such as Don Caballero, Sunny Day Real Estate and Pinback. However, as the band moved from a five piece to a two piece, their sound moved away from the angular sound of previous records and closer to a more melodic heavy composition structure with sing-a-long choruses. The current two-piece sound can be attributed to influences such as Dirty Projectors, Beirut and Grizzly Bear. In an interview with Baeble Music, Ward coined the band with the term \"indie cabaret\".[citation needed]\n\nIn 2006, producer and engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes. Solter is credited on the album with \"machines, razors, tape.\"[1]\n\nSince 2008, Pattern Is Movement have been performing as a two-piece. On the January 2008, issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year\".[2] The band emerged with a new album, All Together, documenting the lineup in the spring of 2008, also recorded with Solter.[3] In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing\".\n\nIn April 2009 they became one of Limewire's Featured Artists.\n\nIn 2015, after releasing their self-titled fourth album, Pattern Is Movement announced their farewell tour.[4]\n\nDiscography [ edit ]\n\nThe (im)possibility of Longing (NFI) – 2004\n\n(NFI) – 2004 Stowaway (NFI) – 2005\n\n(NFI) – 2005 Scott Solter Plays Pattern Is Movement: Canonic (Hometapes) – 2006\n\n(Hometapes) – 2006 All Together (Hometapes) – 2008\n\n(Hometapes) – 2008 Pattern Is Movement (Hometapes) – 2014"}, {"url": "https://alchetron.com/Pattern-Is-Movement", "page_content": "Pattern Is Movement (often stylized as Pattern is Movement) is an American indie rock band from Philadelphia, Pennsylvania that established in 2001. They have been categorized by some reviewers as a math rock group and compared to groups such as Don Caballero, Sunny Day Real Estate and Pinback. However, as the band moved from a five piece to a two piece, their sound moved away from the angular sound of previous records and closer to a more melodic heavy composition structure with sing-a-long choruses. The current two-piece sound can be attributed to influences such as Dirty Projectors, Beirut and Grizzly Bear. In an interview with Baeble Music, Ward coined the band with the term \"indie cabaret\".\n\nContents\n\nIn 2006, producer and engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes. Solter is credited on the album with \"machines, razors, tape.\"\n\nSince 2008, Pattern Is Movement have been performing as a two-piece. On the January 2008 issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year\". The band emerged with a new album, All Together, documenting the lineup in the spring of 2008, also recorded with Solter. In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing\".\n\nIn April 2009 they became one of Limewire's Featured Artists.\n\nIn 2015, after releasing their self-titled fourth album, Pattern Is Movement announced their farewell tour."}, {"url": "https://sonofeed.com/musicians/pattern-is-movement", "page_content": "Pattern Is Movement (often stylized as Pattern is Movement) is an American indie rock band from Philadelphia, Pennsylvania that established in 2001. They have been categorized by some reviewers as a math rock group and compared to groups such as Don Caballero, Sunny Day Real Estate and Pinback. However, as the band moved from a five piece to a two piece, their sound moved away from the angular sound of previous records and closer to a more melodic heavy composition structure with sing-a-long choruses. The current two-piece sound can be attributed to influences such as Dirty Projectors, Beirut and Grizzly Bear. In an interview with Baeble Music, Ward coined the band with the term \"indie cabaret\".\n\nIn 2006, producer and engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes. Solter is credited on the album with \"machines, razors, tape.\"\n\nSince 2008, Pattern Is Movement have been performing as a two-piece. On the January 2008, issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year\". The band emerged with a new album, All Together, documenting the lineup in the spring of 2008, also recorded with Solter. In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing\".\n\nIn April 2009 they became one of Limewire's Featured Artists.\n\nIn 2015, after releasing their self-titled fourth album, Pattern Is Movement announced their farewell tour."}, {"url": "https://drownedinsound.com/artists/Pattern_Is_Movement", "page_content": "THIS SITE HAS BEEN ARCHIVED AND CLOSED.\n\nPlease join the conversation over on our new forums »\n\nIf you really want to read this, try using The Internet Archive."}, {"url": "https://dictionary.sensagent.com/Pattern%20Is%20Movement/en-en/", "page_content": "Pattern is Movement is an American indie rock band from Philadelphia, Pennsylvania, and established in 2001. They have been categorized by some reviewers as a math rock group, and compared to groups such as Don Caballero, Sunny Day Real Estate, and Pinback. However, as the band moved from a five piece to a two piece, their sound moved away from the angular sound of previous records and closer to a more melodic heavy composition structure with sing-a-long choruses. The current two piece sound can be attributed to influences such as Dirty Projectors, Beirut and Grizzly Bear. In a recent interview with Baeble Music, Chris coined the band with the term \"Indie Cabaret\".\n\nIn 2006, producer/engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes—Solter is credited on the album with \"machines, razors, tape.\"[1]\n\nAs of 2008, Pattern is Movement are performing as a two-piece. In a January 2008 issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year.\"[2] The band emerged with a new album, 'All Together', documenting the lineup in the spring of 2008, also recorded with Solter.[3] In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing.\"[4] In April 2009 they became one of Limewire Featured Artists.\n\nDiscography\n\n2004 - The (im)possibility of Longing (NFI)\n\n(NFI) 2005 - Stowaway (NFI)\n\n(NFI) 2006 - Scott Solter Plays Pattern Is Movement: Canonic (Hometapes)\n\n(Hometapes) 2008 - All Together (Hometapes)\n\n\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/1522609", "page_content": "Infobox musical artist\n\nName = Pattern is movement\n\n\n\n\n\nImg_capt =\n\nImg_size =\n\nLandscape =\n\nBackground = group_or_band\n\nAlias =\n\nOrigin = Philadelphia , Pennsylvania , United States\n\nGenre = Indie rock\n\nYears_active = 2001–present\n\nLabel = NFI, Hometapes\n\nAssociated_acts =\n\nURL = [ http://www.patternismovement.com/ Official Website ]\n\nCurrent_members = Andrew Thiboldeaux\n\nChris Ward\n\nPast_members = Wade Hampton\n\nDaniel McClain\n\nCorey Duncan\n\nNotable_instruments =\n\nPattern is Movement is an American indie rock band from Philadelphia , Pennsylvania , and established in 2001. The group's music often features repeating patterns that show their influence from minimalism. They have been categorized by some reviewers as a math rock group, and compared to groups such as Don Caballero , Sunny Day Real Estate , and Pinback . All of the group's members have a background in classical music. [ http://www.patternismovement.com/press/bio.pdf ]\n\nIn 2006, producer/engineer Scott Solter (who has worked with John Vanderslice and the Mountain Goats ) remixed the 2005 album Stowaway, which he had also recorded. This remix was considered unique due to its exclusivity to analog processes--Solter is credited on the album with \"machines, razors, tape.\" [ http://music.for-robots.com/archives/001623.html ]\n\nAs of 2008, Pattern is Movement are performing as a two-piece. In a January 2008 issue of Philadelphia Weekly they were featured in a cover story citing \"Four indie bands that can expect a big year.\" [ http://www.philadelphiaweekly.com/articles/16158/cover-story ] The band emerged with a new album, 'All Together', documenting the lineup in the spring of 2008, also recorded with Solter. [ http://stereogum.com/archives/concert/pattern-is-movement-cake-shop-nyc-the-forms-cd-rel_006997.html ] In his favorable review, Pitchfork Media writer Joe Tangari described it as \"an accessible album that nonetheless sounds unlike what any other band is doing.\" [ http://www.pitchforkmedia.com/article/record_review/50287-all-together ]\n\nDiscography\n\n*2004 - \"The (im)possibility of Longing\" (NFI)\n\n*2005 - \"Stowaway\" (NFI)\n\n*2006 - \"Scott Solter Plays Pattern Is Movement: Canonic\" (Hometapes)\n\n*2008 - \"All Together\" (Hometapes)\n\nExternal links"}, {"url": "https://patternismovement.bandcamp.com/album/all-together", "page_content": "Digital Album Streaming + Download Includes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Purchasable with gift card Buy Digital Album $8 USD or more Send as Gift\n\nPattern Is Movement \"All Together\" LP Record/Vinyl + Digital Album Order PIM's 2008 album in its most deluxe form. The black vinyl LP is packaged in a heavyweight woodgrain inner sleeve, slipped inside a heavyweight woodgrain jacket. All full color on uncoated stock. The insert was made by hand: a collection of photographs, each one corresponding to the song that it inspired, inside a glassine envelope that mimics the bag the original photos were found in. So nice. The download cards have expired for this title, but you'll get an immediate download of the album (at even higher quality) when you purchase here.\n\n\n\nIncludes unlimited streaming of All Together via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\nPattern Is Movement \"All Together\" CD Compact Disc (CD) + Digital Album This CD is beautiful. Printed in Portland, OR by Stumptown Printers, the wallet features the \"All Together\" woodgrain motif, plus die-cut inner pockets that reveal the bright green spot-color interior of the package. The collection of photographs that inspired the songs on the album were reproduced in a strip of perforated(!) pictures. That's right: you can tear them apart and create your own collection. Of course, the CD face was printed in CMYK.\n\n\n\nIncludes unlimited streaming of All Together via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\n\n\nShare / Embed\n\nabout\n\n• Full length CD + LP + DIG\n\n• Artwork: Sara Padgett & Adam Heathcott\n\n\n\nAndrew Thiboldeaux and Chris Ward embody Pattern is Movement and the music that’s been a long time building, rising out of the ether of evangelical childhoods, best friendship, and life in Philadelphia. The two met at the ages of 13 and 14 --- as part of a Christian hip hop group. Raised in strict Pentecostal households and schools (see Jesus Camp), both Andrew and Chris found refuge in their shared love for Dr. Dre’s The Chronic --- and a friendship born out of secular escape turned into a creative collaboration. In high school, hand-me-down church sound equipment and a weekend obsession with making and recording music provided the means for what became Pattern is Movement.\n\n\n\nAll Together continues the mysterious narrative of the band and it exalts their existence as a two-man wall of sound. The pounding energy of their live show --- with Chris and Andrew side-by-side, simultaneously hammering their instruments, sweat flying --- resides in ten exquisitely constructed tracks. In the studio (Scott Solter’s), every idea was given its voice; a range of guest instruments embellished the core magic of Andrew’s vocals and keys and Chris’ drums. All Together embraces the vocabulary of the band’s experienced and obsessive recording language, yet it holds on to that unmistakable dynamism of their live performance.\n\n\n\nFurthering All Together’s lore is its song-by-song relationship to a series of old photographs. Found by Andrew’s brother on the street in Philly, ten tiny early 20th century images formed Pattern is Movement’s own set of Oblique Strategies. Each photo abstractly inspired a song and its final form on the record, with Andrew and Chris even referring to the pictures during tracking. The record’s name also arose from the connotation of this found collection: though essentially disparate, we’re ultimately all together in our experience. Once time passes, all our pictures tell the same story.\n\ncredits\n\nreleased April 1, 2008\n\nlicense\n\nall rights reserved"}, {"url": "https://chicagoreader.com/blogs/philly-indie-rock-group-pattern-is-movement-say-good-bye-to-chicago/", "page_content": "Courtesy of Hometapes\n\nPattern Is Movement\n\nPattern Is Movement have long held a place in my heart (ever since my friend Dan Levine introduced me to the Philadelphia indie-rock band seven years ago) and tomorrow night they return to Chicago one last time during a monthlong farewell tour. I remember Pattern Is Movement were called “lumberjack rock” when I first heard them, a term that doesn’t really describe the tone of their delicate, minimal songs as much as it focuses on what the band members look like: singer-keyboardist Andrew Thiboldeaux and drummer Chris Ward have an affinity for woodsman-type flannel, sport beards that suggest they spend a lot of time in a forest (though Thiboldeaux shed his for the above press photo), and look like they could make a living chopping down trees.\n\nPattern Is Movement by Pattern is Movement Pattern Is Movement by Pattern is Movement\n\nThe music these guys make together seems fit more for a church than the woods. Many of the songs on Pattern Is Movement’s 2014 self-titled album evoke images of sunlight beaming through stained-glass windows—the tracks are whimsically colorful and Thiboldeaux’s gossamer singing has a crystal sharpness that retains a beautiful fragility. As a duo they manage to do a lot with a little, though the band roped in a half-dozen musicians to pull off the quasi-symphonic and R&B touches that appear on Pattern Is Movement. Thiboldeaux and Ward had a grip on genres outside of indie-rock’s circle long before last year’s album: they’d long been covering D’Angelo’s “Untitled (How Does it Feel)” in concert. At one point they teamed up with the Roots to pull it off live, and Pattern Is Movement finally released their version of the track last year.\n\nPattern Is Movement play Lincoln Hall tomorrow night for their final local appearance. Make sure you show up early, because they go on first, just before Maps & Atlases. The concert starts at 9 PM; tickets are $17, or $15 in advance."}, {"url": "https://www.thefreelibrary.com/A+Guide+to+Essential+American+Indie+Rock+(1980-2005).-a0201098898", "page_content": "A Guide to Essential American Indie Rock (1980-2005).\n\nPage/Link: Page URL: Page URL: HTML link: <a href=\"https://www.thefreelibrary.com/A+Guide+to+Essential+American+Indie+Rock+(1980-2005).-a0201098898</a> HTML link: Citations: MLA style: \"A Guide to Essential American Indie Rock (1980-2005)..\" The Free Library . 2009 Music Library Association, Inc. 11 Jun. 2023 \"A Guide to Essential American Indie Rock (1980-2005)..\". 2009 Music Library Association, Inc. 11 Jun. 2023 https://www.thefreelibrary.com/A+Guide+to+Essential+American+Indie+Rock+(1980-2005).-a0201098898\n\nChicago style: The Free Library. S.v. A Guide to Essential American Indie Rock (1980-2005)..\" Retrieved Jun 11 2023 from The Free Library. S.v. A Guide to Essential American Indie Rock (1980-2005)..\" Retrieved Jun 11 2023 from https://www.thefreelibrary.com/A+Guide+to+Essential+American+Indie+Rock+(1980-2005).-a0201098898\n\nAPA style: A Guide to Essential American Indie Rock (1980-2005).. (n.d.) >The Free Library. (2014). Retrieved Jun 11 2023 from A Guide to Essential American Indie Rock (1980-2005).. (n.d.) >The Free Library. (2014). Retrieved Jun 11 2023 from https://www.thefreelibrary.com/A+Guide+to+Essential+American+Indie+Rock+(1980-2005).-a0201098898\n\nA GUIDE TO ESSENTIAL AMERICAN INDIE ROCK (1980-2005)BY VINCENT J. NOVARA AND STEPHEN HENRYIndie rock is a genre of popular music presently commanding more commercial success and academic attention than at any point in its relatively short history. The term \"indie rock\" was first introduced around 1980 in the United Kingdom where the first charts for independent artists were compiled. (1) The genre remains somewhat vaguely defined, but its practitioners are generally characterized by some degree of separation from the business practices and creative control of the large corporations operating major labels. Indie rock is more difficult to define in strictly musical terms, as it contains many subgenres that embrace rock music and other divergent styles equally. (2) However, while independence from major labels is of fundamental importance to indie rock, this factor alone is not enough to fully describe the genre. (3)Partly as a result of the impulse to remain independent of mainstream expectations, a distinct indie rock sound has developed. (4) The hallmarks of this sound include: the careful balancing of pop accessibility with noise, playfulness in manipulating pop music formulae, sensitive lyrics masked by tonal abrasiveness and ironic posturing, a concern with \"authenticity,\" and the cultivation of a \"regular guy\" (or girl) image. These characteristics constitute a shared pool of aesthetics common to the genre. Each individual artist makes use of these characteristics to a greater or lesser degree--no artist is likely to epitomize all of them--and individual styles develop, in part, through the emphasis or rejection of one or more characteristics, or the introduction of other, \"non-indie\" characteristics. In particularly creative instances entire subgenres have resulted from the manipulation of the indie rock formula. (5)MethodologyThis guide provides a critical analysis of American indie rock recordings that, in the authors' estimation, best illustrate the genre's evolution from 1980 through 2005. (6) Rather than presenting a list of \"best\" albums, this essay focuses on selected albums that represent specific time periods and/or subgenres. Indie rock is a genre whose practitioners tend, like jazz musicians, to be highly conscious of their musical history and traditions, and indie rock artists are often acutely aware of the ways that their music fits into that history. Bearing this in mind, the recordings highlighted in this article are representative of their respective eras and illustrate ways that the \"anxiety of influence\" may be in play as the artists respond to, build on, challenge, or reject the works of their predecessors. (7) Since the historical context of each recording and the lineage of influence from artist to artist can be so important, the analysis that follows is arranged chronologically.Reference and trade publications such as the All Music Guide, Pitchfork, Spin and other sources in academic popular music literature served as a bases for an objective selection process; however, some amount of subjectivity in the selections is unavoidable. For example, Guided by Voices' Bee Thousand (8) is here used to represent the \"lo-fi\" movement, whereas any number of albums by that band or others could have quite ably illustrated the characteristics of that subgenre. Although this guide is by no means all-inclusive, we hope it will serve as a starting point for collection managers interested in acquiring indie rock recordings for their collections, and for anyone else who may be interested in a basic introduction to the genre.An Overview of American Indie RockWhat has come to be called indie rock grew out the \"alternative\" or \"college rock\" scenes of the 1980s. (9) While its pioneers may or may not have been \"independent\" per se, they are now regarded as such by virtue of being imitated and cited by true indie acts of the 1990s and beyond. Bands like Husker Du and Violent Femmes were just as prominent during this time period, and just as artistically independent, yet for whatever reason, they have remained iconoclastic, and are not the bands that are frequently cited as inspirations to the current generation of indie rockers.Alternative rock was ushered into the mainstream by bands like REM and Soul Asylum, who gained popular acceptance despite their atypical music and appearance by dint of relentless touring, airplay on commercial radio, and, perhaps most tellingly, music videos on MTV. \"True\" indie rock emerged after alternative rock reached a mass audience following the surprise success of Nirvana's Nevermind (DGC Records DGCD 24425) in 1991. At mis point, being \"indie\" became a point of pride, a badge of honor, and while many genres of music are recorded for independent labels, the term \"indie rock\" came at this point to be commonly applied to the specific sound described in the introduction: grungy, noisy, but at the same time frequently quite tuneful and sometimes playful. \"Indie rock\" also came to refer to a more-or-less self-sustaining network of communities, or \"scenes,\" of artists that coalesced most frequently in major cities or small college towns. The indie scenes evolved into places for experimentation and, ironically, as havens for musicians with straight-ahead pop sensibilities (as opposed to the \"edgy,\" testosterone-driven sensibilities of post-Nevermind alternative rockers).American indie rock reached maturity in the mid-to-late 1990s. At this point, the indie community had become relatively well defined and quite self-sustaining, having developed its own commercial infrastructure. A sort of indie \"mainstream\" arose, as exemplified by bands such as Pavement and Superchunk (both of whose careers reach back to the early 1990s, though by this point both were regarded as elder statesmen of \"high-indie\" rock). Subgenres also began to flourish with the likes of Elliott Smith (who created a sort of \"indie folk\" sound) and Tortoise (who championed what came to be called \"post-rock\" (10)). Toward the very late 1990s and into the present decade, indie rock has attracted a savvy and much broader audience, just as alternative rock had done a decade before.Foundation: The 1980sThe alternative and college rock performers of the 1980s wielded a significant influence on the aesthetics and, in some cases, the commercial ethics of the first generation of independent artists. Yet, during that decade, artists frequently released their music on independent labels not as a matter of principle but simply out of sheer necessity. After proving themselves a viable commodity, many of them signed with major labels. By contrast, many of their indie descendents of the 1990s took pride in having chosen to be independent. Consequently, the earlier bands profiled in this section have mostly entered the indie rock canon retrospectively. These are the artists that bands of the \"high-indie\" period of the early-to-mid-1990s have cited as inspirational or influential. Many bands from this time period were just as prominent and just as independent as the four chosen here to represent the 1980s. However, the hallmarks of the nascent indie rock style are particularly well exemplified by these four albums by The Replacements, Dinosaur Jr., Sonic Youth, and The Pixies. These early groups, who were particularly successful in working (at least initially) outside the boundaries of the commercial mainstream, produced some of the daring and challenging music that laid the foundation for indie rock.While the story of independent rock begins a bit earlier, few American records prior to The Replacements' Let It Be (Rykodisc 438844, 2008 [originally released on LP as Twin/Tone TTR 8441-2, 1984]) were as influential to the development of indie rock over the following twenty years. The Replacements arose from the Minneapolis underground scene that also fostered Husker Du, whose beginnings had been local and modest but who had signed with a major label by the mid-1980s. With Let It Be, their third release, the Replacements achieved their greatest artistic success to this point and also perfected a \"slacker\" aesthetic that harked back to The Who's \"My Generation.\" Yet, on this release, principle songwriter Paul Westerberg also significantly refined his craft, attaining a wider appeal for the band by building on his distinctive raw vocals to inject a new sincerity into what had been notoriously sloppy, even detached performances in previous recordings and concerts. The Replacements employed an eccentric mix of musical styles, all of them tied together by a distinctive and trebly guitar tone. Though more stylistically eclectic than current indie releases, Let it Be continues to influence current bands such as The Shins, who utilize similar textures and songwriting techniques. Let It Be, which boasted such classic indie rock songs as \"Sixteen Blue\" and \"I Will Dare,\" was The Replacements' last record for an independent label.While The Replacements were active in Minneapolis, two songwriters from Boston, guitarist J. Mascis and bassist Lou Barlow, were collaborating as Dinosaur Jr. The band's early albums, of which You're Living All Over Me (SST SSTCD-130, 1987) is perhaps most representative, featured extended jams, feedback, guitar solos, and heavy metal riffs to such a degree as to make them superficially indistinguishable from hard rock artists of the period. However, close inspection of Mascis's lyrics, which often describe romantic insecurity and emotional detachment, reveal a sensitivity uncommon in mainstream hard rock, and tend to recast the noise and virtuosic guitar work as ironic macho posturing. Mascis's songs also demonstrated a willingness to experiment and tinker with song forms that was rarely seen in such hard rock acts Van Halen or Guns n' Roses. The song \"Sludgefeast,\" for example, begins and ends with long virtuosic instrumental passages that occur where many songwriters would have placed verses, while a short vocal passage sits where one would normally expect to find a guitar solo. The tropes of sensitive lyrics buried under layers of noise and of self-conscious manipulation of popular song forms would both become hallmarks of many indie acts of the nineties.Perhaps to an even greater degree than Dinosaur Jr., Sonic Youth is a guitar-heavy band known for making innovative and challenging use of noise. Daydream Nation (Enigma 75403, 1988; reissued in 1993 as DGC Records DGCD 24515), its sixth release, finds the group moving to a more accessible sound. This groundbreaking and oft-imitated double album is equally rooted in guitar rock, avant-garde art music, punk rock, and noise rock. (11) Sonic Youth's early work was deliberately anti-commercial, and that stance had always informed the band's songwriting more than any genre-specific constraints. (12) With Daydream Nation, the band not only reached a wider audience, but also introduced that audience to something new. Even in this more accessible work, Sonic Youth juxtaposed conflicting approaches to rhythm, melody, style and timbre. During \"Candle,\" for example, Thurston Moore's and Lee Ranaldo's clean guitar tones alternate with abrasive distortion and feedback. On other songs their vocal melodies adhere to formulaic and tonal pop conventions before veering into dissonance. The band also combines predictable rock forms (i.e., verse/bridge/chorus) with irregular rhythmic groupings to produce engagingly quirky compositions like \"Silver Rocket.\" All of these strategies eventually became models for groups ranging from Fugazi to Nirvana. Daydream Nation was reissued in 1993 on a major label, when Sonic Youth's music had become more palatable to mainstream audiences now accustomed to the edgier sounds also found in alternative rock.The Pixies occupied the same cultural milieu as Dinosaur Jr. (Boston's late-1980s alt-rock scene) and the two groups shared a similar songwriting strategy: obscuring hooky pop tunes under layers of noise while creatively subverting standard song structures. However, where Dinosaur Jr. favored an aesthetic of excess--seemingly gratuitous guitar solos, extended jams, multiple overdubs--the Pixies moved in a direction that suggested a stark pop minimalism. The band's first full-length album, Surfer Rosa (Rough Trade ROUGH-US-38, 1988; reissued in 2003 as 4AD/Elektra 61295-2), inhabits a no-man's land between punk and pop, with a bit of surf rock thrown in for good measure. Singer Black Francis alternates between a mumbled Sprechstimme and a more traditionally melodic singing style. Bassist Kim Deal contributes harmony vocals as well as the song \"Gigantic,\" the album's most accessible tune and its first single. Surfer Rosa is also notable for the production work of Steve Albini, who would soon become legendary in the rock world for producing Nirvana's In Utero (DGC Records 24607, 1993). Albini gave Surfer Rosa a dry, reverb-free sound, which would become his production signature in the coming years (and which would either be imitated or explicitly rejected by many later indie bands and producers). For all its influence and pop sensibility, Surfer Rosa remains an idiosyncratic and difficult album. The lyrics are obscure (and often disturbing), the meters mixed, and the arrangements complex, all of which may help to explain the continued fascination with this recording on the part of both critics and fans.1990-1991, the Juncture Before NevermindAmerican indie rock made significant progress towards artistic and commercial success during the 1990s. A thriving band often had little reason to leave an independent label, which typically offered higher royalty rates, greater creative control, financial transparency, and easier access to label management than bands on major labels enjoyed. (13) By the 1990s, independent labels were resolving distribution issues by a variety of means: mail order as promoted in magazines, negotiating distribution terms directly with vendors and record stores, establishing their own distribution companies, or allowing their artists to sell recordings at shows. (14) At this point in rock history, many artists chose to stay on independent labels and enjoyed rewards equal to those realized by their major-label peers. Furthermore, new subgenres developed and indie rock scenes began to grow in unlikely places. Four recordings from this period illustrate these developments particularly well.No Depression (Rockville 6050, 1990), the debut release of trio Uncle Tupelo, (15) combined elements of country, classic guitar rock, and blue-grass with the sort of energetic abandon normally associated with punk rock. This pioneering release carved out an indie rock subgenre of such originality that it required a new term: \"alt.country.\" (16) No Depression is a showcase for the complementary voices and compositional skills of Jay Farrar and Jeff Tweedy, who split songwriting duties evenly between themselves. The band incorporated both banjo and lap steel guitar to give their standard rock instrumental configuration (bass, guitar, drums) more of a traditional country sound. By setting authentic-sounding country and folk elements within hard-rocking songs, No Depression displayed an engagingly dynamic variety. The title track is the band's alt.country interpretation of the A. P. Carter country classic about the Great Depression. Other tracks contemplate such typical country-music themes as romantic heartbreak, day-job frustrations, religion, and death. The magazine No Depression, which documented the growing alt country scene from September 1995 until June 2008, took its name from this recording--further testament to the importance of Uncle Tupelo's debut. Tweedy went on to international fame with Wilco, while Farrar has enjoyed significant commercial success with Son Volt.In sharp contrast to Uncle Tupelo's rural, earthy approach stands Washington D. C.'s Fugazi, which combined the aggressively political lyrical content and visceral musical assault of hardcore punk with indie rock experimentalism. Singer/guitarists Guy Picciotto and Ian MacKaye had formerly worked with seminal emo (17) and hardcore bands (Rites of Spring and Minor Threat, respectively), but on Repeater (Dischord 44, 1990) they expanded the typical hardcore sound with clever arrangements, left-field melodic guitar licks, instrumental interludes, and an ensemble approach that often gave unusual amounts of space to the bass and drums. Bassist Joe Lally's sound is significantly informed by repetitive patterns found in reggae and dub, while drummer Brendan Canty provides the requisite post-punk beats while personalizing his sound by incorporating a ship's bell into his kit for jarring accents and color. This musical variety and lively creativity contrast greatly with the dour seriousness of the band's lyrics, which at times can tend toward the simplistic. \"You wanted everything/You needed everything/Everything is greed\" constitute the complete lyrics for \"Greed,\" for example. On the other hand, similarly unsophisticated lyrics sometimes provide concise summations of the indie rock creed--for example, \"We owe you nothing/You have no control\" from \"Merchandise.\" In spite of its anti-corporate-rock stance, Fugazi has influenced mainstream acts from Green Day to Limp Bizkit.Slint put the Louisville scene on the map with its second release and magnum opus, Spiderland (Touch and Go TG64-CD, 1991). On this recording, the band was clearly influenced by producer Steve Albini's songwriting with his own band Big Black: soft/loud patterns featuring spoken vocals. Spiderland itself, though, remains highly influential today with many adepts of the math rock (18) subgenre. Indeed, without Spider-land it is impossible to imagine the existence of current indie mainstays Mogwai or Shipping News, who set similar performance practices within a more moody atmosphere. This dark and imaginative album is reminiscent of progressive rock (19) from the 1970s in that its six songs span thirty-nine minutes. The individual songs are highly organized and each is clearly subdivided into distinct sections that consist of smooth unison phrases arranged in odd-meter figures. Slint contrasts sections of softly whispered vocals with periods of shouting accompanied by heavily distorted guitars. The lyrics resemble short stories, especially during spoken passages, which feature topics ranging from carnival fortunetellers (\"Breadcrumb Trail\") to catastrophes at sea involving children (\"Good Morning, Captain\"). Slint disbanded soon after this release, but has reunited periodically for tours or to perform Spiderland in its entirety at festivals.Superchunk's second release, No Pocky for Kitty (Matador 35, 1991), provided a defining moment in indie rock history when the band dismissed all major label overtures in favor of remaining with the well-regarded independent Matador label. The risk paid off when both critical acclaim and large record sales followed. (20) Superchunk's singer/guitarist, Mac McCaughan, and bassist, Laura Ballance, used the royalties to launch their own successful label, Merge Records, establishing Chapel Hill as a new and influential indie rock scene. (21) Superchunk went on to make a career of energetic punk pop centered on McCaughan's distinctive and impassioned high-tenor vocals. No Pocky for Kitty is the album on which the band perfected that sound. Produced by the ubiquitous Albini in collaboration with Ballance, the album maintains an unrelenting intensity through twelve tracks, as pop hooks shine through the dense punk-rock textures. While the album remains predominantly near the louder end of the dynamic spectrum, dramatic shifts in tempo from song to song relieve any potential monotony. No Pocky for Kitty's second track, \"Seed Toss,\" is perhaps the finest example of both MacCaughan's song-craft and Albini's and Ballance's unusual production approach. Super-chunk is still active as a band, producing recordings and performing sporadically.POST-NEVERMINDThe aesthetic distinctions between indie rock and alternative rock became more conspicuous after Nirvana, a former indie rock band, released Nevermind in 1991 on the major label Geffen (DGC 24425). With the smash hit \"Smells like Teen Spirit\" and other singles, Nevermind effectively defined the sound of popular rock music for the first half of the 1990s. Nevermind was the first attempt by a major label to sell \"grunge\" (22) to mainstream audiences. Nirvana's sound was more accessible than that of their grunge peers, and their songs featured enough conventional pop elements and traditional song structure to appeal to millions of listeners worldwide. Consequently, major labels scoured America's indie rock scenes looking for the next Nirvana. Many artists (including those profiled in this section) found themselves faced with a difficult choice between maintaining control of their careers and creativity and remaining committed to a local scene on the one hand, and realizing the quick financial rewards promised by these large corporations on the other. Each of the recordings examined from this era offers an example of an artist's stalwart refusal to compromise aesthetically despite the promise of commercial success.In many ways, Slanted and Enchanted, Pavement's 1992 debut full-length album (Matador OLE-038-2; reissued in 2002 as OLE-557-2), marks the point at which indie rock split completely with its predecessors (hardcore, punk, alternative rock, etc.). Founding members Stephen Malkmus and Scott Kannberg (a.k.a. Spiral Stairs) were well-adjusted suburban adolescents who sounded as if they made music more for fun than to pursue a political agenda or even a career. Recorded in drummer Gary Young's laundry room and circulated among their friends on cassette tape, the album eventually reached the hands of a record reviewer at Spin magazine, where it received a glowing review. (23) The recording's amateuristic flavor and its primitive recording techniques helped give rise to the lo-fn (24) subgenre of indie rock, while singer Malkmus's lackadaisical drawl and the band's willingness to accept mistakes in execution spawned a movement that was dubbed (fairly or unfairly) \"slacker rock.\" Critics of the album speculated about Pavement's creative influences, and the band members themselves, in the liner notes for the reissue of Slanted and Enchanted, expressed anxiety that the record sounded too much like Dinosaur Jr., or The Fall. In fact, the band's raucous guitar style does owe a debt to Dinosaur Jr., and Malkmus's deadpan, half-spoken vocals do at times evoke those of The Fall's Mark E. Smith. However, Pavement juxtaposes these borrowings, and others (Sonic Youth-style white noise and feedback, Pixies-esque deconstruction of pop song structures) in unexpected and refreshing ways, to the point that it is difficult to say whether they are parodies, homages, or simply ripoffs. For the careful listener, picking out these obscure references and debating their meaning is still half the fun.Liz Phair's 1993 debut album Exile in Guyville (Matador 23227) made significant waves upon release. Besides being marketed as a song-by-song response to the Rolling Stones' classic album Exile on Main Street (Rolling Stones/Atlantic 2900, 1972; reissued on CD in 1990 as Columbia 40489), Phair's debut also contained occasionally sexually explicit lyrics, which shocked many during an era obsessed with political correctness. Furthermore, Phair's complete creative control of the album challenged the traditional role of women in a still male-dominated genre. By 1993 the female bass player had become a staple of the indie rock scene (25) but Exile in Guyville introduced indie rock listeners to an entire album of songs written and recorded almost exclusively by a female singer/songwriter. Musically, Phair's songs cover a wider range than those of her contemporaries. \"Glory,\" with its whispered and double-tracked vocals and unusual guitar style, anticipates an approach that Elliott Smith would perfect a few years later. Other songs, like the poppy \"Never Said,\" find Phair sounding like a lo-fi version of Sheryl Crow.Robert Pollard's group Guided by Voices was known for intelligent songs that pushed the limits of the lo-fi subgenre, and Bee Thousand (Scat 35, 1994) established the band as a vital force in indie rock. With abundant tape hiss, amplifier buzz, feedback, and underproduced instruments, the recording process creates a sonic design equal in importance to the actual songwriting. Throughout twenty brief songs spanning just thirty-six minutes, the concise songwriting offers twists on standard pop formulas, while convoluted yet amusing lyrics are couched in attractive melodies. A slacker disposition akin to that of The Replacements or Pavement is manifest in the performances; each instrument is played loosely and perfect vocal intonation is not always a priority. While sloppy playing and out-of-tune singing are often hallmarks of unenjoyable albums, with Bee Thousand Guided by Voices create an aesthetic that places a priority on songwriting over precise execution with truly affecting results. Guided by Voices released sixteen albums and sixteen EPs (26) before breaking up in 2004.The Denver band The Apples in Stereo were key members of the Elephant 6 recording collective, a group of musicians who worked on each other's albums and shared a similar aesthetic, namely, an appreciation for 1960s pop bands such as the Beach Boys, a fondness for extended instrumentation (horns, strings, percussion, synthesizers), and a sort of playful, anodyne psychedelia. Other bands in the collective included Neutral Milk Hotel and The Olivia Tremor Control. However, The Apples' Fun Trick Noisemaker (spinART/Elephant 6 42, 1995) is Elephant 6's statement of purpose. On this recording, singer/songwriter Rob Schneider spelled out what Elephant 6 as a whole was trying to accomplish: extensive use of fuzz bass, lyrics about gummy worms and splashing in puddles, sumptuous background vocal harmonies, and spacey sound effects. The Apples in Stereo, and their Elephant 6 peers, in some ways represent a peripheral subgenre of indie rock, but they can also be seen as the first in a long line of bands who moved away from indie's noise-rock roots and towards a more accessible pop sensibility. The Apples also best illustrate a secondary characteristic of indie rock: the self-conscious referencing of the 1960s. While 1960s pop culture references have long been a part of the indie rock aesthetic, (27) the practice of basing one's sound fundamentally on 1960s genres seems to have increased in recent years, and is discussed below in reference to the singer-songwriter approach of Elliott Smith and the psychedelic folk-rock of The Shins.Late 1990s and New DirectionsAs the music industry's hysteria surrounding Nirvana's Nevermind subsided, indie rock artists and listeners began taking more chances on new subgenres. Artists explored new ways to expand upon the innovations of their predecessors, which led to the efflorescence of what came to be called \"post-rock\". The recordings examined from this era continue to display an indifference to the 1990s music industry's ongoing desire to find a new Nirvana. Many independent artists responded by turning inward with folk music or with jazz/rock fusion-inspired improvisations. Chicago's Tortoise turned inward to great effect.Tortoise enjoys a rare place in the indie rock genre as a successful experimental rock band that performs only instrumentals. Though frequently lumped into the post-rock subgenre, Tortoise has proven more versatile than its post-rock peers. Tortoise creates its fairly unique music by incorporating techniques from contemporary experimental music, film scores, dub reggae, jazz/rock fusion, Krautrock, (28) the repetitive phase processes of Steve Reich, and nonwestern music, whereas many of their peers (such as Trans Am or June of 44), typically draw from a much narrower spectrum of sources and thus create a much more limited, if often unpredictable, sound. Millions Now Living Will Never Die (Thrill Jockey 25, 1996), Tortoise's second release, begins with \"Djed,\" a captivating twenty-one minute exploration of several experimental styles and techniques as well as phase processes, noise, and rock. This was a bold move for any rock album, especially one aimed at indie rock listeners accustomed to compact songs focused on personal or political messages. \"Glass Museum\" is a more traditional indie rock song, reminiscent of Slint, but with vibraphones and a clean guitar tone. Though the songs occasionally amount to collages of the genres described above, all delivered in widely varying and contrasting timbres (i.e., vibraphone against electronic noise), these creative melanges are never formless, nor do they devolve into mere extended instrumental \"jams.\" The recording closes with \"Along the Band of Rivers,\" which calls to mind Angelo Badalamenti's film scores from the late 1980s. Tortoise is still actively recording and touring.Either/Or (Kill Rock Stars KRS269, 1997), the third release from Portland, Oregon singer/songwriter Elliott Smith, is a more traditional indie rock album. It not only showcased Smith at the peak of his craft, but it also exerted a significant influence on the indie-folk subgenre in the years following its release. Previously known for simpler lo-fi home recordings, on Either/Or Smith engaged listeners with a wider range of instrumentation and richer arrangements. Songs such as \"Alameda\" and \"Pictures of Me\" depart from his usual minimalism with dense vocal harmonies and stronger roles for bass guitar and organ. The album's superior production quality is also worth noting. Either/Or has a somewhat enhanced audio fidelity for this era in indie rock, yet still possesses enough of a lo-fi aura to maintain credibility amongst its peers. Smith's hallmark themes of loneliness, substance abuse, and rejection continue to constitute the primary subject matter on this recording. Tragically, Smith died in 2004 of an apparent suicide while completing his sixth record.Also from Portland, the female trio Sleater-Kinney created impassioned post-Riot Grrrl (29) music during its career. Dig Me Out (Kill Rock Stars 279, 1997), its third full-length album, proved too intense for pop listeners and too refined for punk, yet both styles are clearly evident on tracks such as \"Turn it On,\" \"Little Babies\" and \"The Drama You've Been Craving.\" Sleater-Kinney defied established rock convention by eliminating bass guitar and then compensating by lowering its guitars to a baritone C# tuning, assigning one guitar to play bass-like patterns. The trio also employed floor tom ostinatos to add substance to the lower frequencies. Janet Weiss's powerful drumming style incorporated surf-rock elements and nontraditional patterns that added to the group's distinctive sound. For vocals, Corin Tucker sang at the top end of the alto range with extensive use of vibrato, which contrasted effectively with Carrie Brownstein's secondary, contralto vocals. This unusual vocal pairing was especially interesting when the two sang contrapuntal lines, as on \"One More Hour.\" These defining musical elements gave added depth and power to arrangements that featured multiple emotional eruptions during the vast majority of the songs on Dig Me Out. Considering the intensely personal and political lyrical themes of intimacy, gender perceptions, and sexual orientation issues, this formal strategy was well suited to their songwriting. Sleater-Kinney broke up in 2006 after a twelve-year career.Moon Pix (Matador 286, 1998) was the breakthrough release for Cat Power, the alias of a brooding New York singer/songwriter named Chan Marshall. At this point in her career, Marshall created songs with a sparse sonic palette similar to that of some of her notable contemporaries, especially Elliott Smith on his earlier recordings. On Moon Pix, especially in comparison to her earlier releases, Marshall refined her songwriting and broadened the use of her voice in terms of both melodic range and dynamics. Indeed, Marshall's singing has become the most distinctive and imitated element of any Cat Power recording. On \"American Flag,\" Marshall howls over a sampled drum loop, live drums, and her trademark spare, minimal electric guitar playing. Elsewhere, her haunted and despairing voice is accompanied even more simply on songs like \"The Colors & the Kids,\" \"He Turns Down,\" and \"Say.\" On \"Cross Bones Style,\" one of only a few songs utilizing drums, Marshall eliminates the conventional rock bass part (in much the same way that Sleater-Kinney did), and the resulting open texture clears the way for her rather strung-out, but effective, vocal delivery. Cat Power's influence is heard in the singing of such current artists as dream-rocker Mr. Gnome and avant-garde chamber-folk singer Joanna Newsom.Recent ArtistsIn recent years, indie rock has become nearly ubiquitous. Songs in a variety of indie rock subgenres feature in films, advertisements, and television programs. Indie rock albums by new artists debut at high chart positions, bringing greater attention than one would previously have thought possible to this once-obscure corner of the pop music marketplace. (30) Indie rock artists have built their audiences through the traditional strategies of regular commercial releases and relentless touring, but also by utilizing innovative marketing methods such as online social networks or the Discrevolt system, (31) or simply by releasing their albums on independent labels of their own. Moreover, the paralyzing business practices resulting from recent consolidations of multiple major labels into a handful of behemoth corporate bodies are consolidating the position of independent record labels as an attractive long-term home for established artists. (32) The commercial success now available to many indie rock artists is demonstrated by the high-charting releases discussed in the final section of this essay.Perhaps no moment is more emblematic of indie rock's recent success than a scene in the 2004 film Garden State in which Natalie Portman's character tells love interest Zach Braff that The Shins' \"New Slang\" would change his life. The scene serves to establish Portman's hipster credentials while also providing an intimate moment in which the main characters share a secret. It is hard to say, though, whether more viewers identified with Portman's character or with Braff's: \"New Slang,\" featured on The Shin's 2001 debut album Oh, Inverted World (Sub Pop 550, 2000), was already familiar to many audience members. Others did feel as if they were being let in on a secret, however, and their enthusiasm helped to increase The Shins' popularity in the years since the film's release. In either case, the Garden State scene illustrates indie rock's ability to convey a feeling of exclusivity and hipness even while appealing to a mass audience.It is somewhat surprising that so many fans found Oh, Inverted World so revelatory: the album is in many ways the most conservative one discussed in this article. Singer and songwriter James Mercer's songs are in some ways throwbacks to those of 1960s acts such as The Association and The Zombies, yet they manage to sound fresh due to Mercer's sheer songwriting talent. His lyrics are obtuse but full of startling images and intricate internal rhyme schemes. Most impressive is his ability to play with the listener's expectations. Mercer takes seemingly conventional musical phrases and extends them in surprising ways, reuses the musical material of introductions in verses, and writes continually changing melodies over repeating chord sequences. The result of this approach is that his songs effectively make the old sound new again.Like The Shins, Death Cab for Cutie and The Postal Service represent recent indie rock trends: both are more or less obscure bands that everyone seems to have heard of, and both make simple, old-fashioned pop songs that somehow sound new and \"edgy.\" Both Death Cab for Cutie and The Postal Service are centered around the songwriting and singing of Ben Gibbard, whose compositions have been lumped into the \"indie pop\" and \"twee\" categories. These are distinguishable from standard indie rock in their open acknowledgement of the artificiality of their music and in their implied rejection of any concern with \"authenticity,\" which has historically been so important to the indie rock community. This tweaking of the indie aesthetic has led to increasingly polished performances and better studio sound, a reluctance to hide song forms behind noise, and more earnest, direct lyrics. Death Cab for Cutie is Gibbard's full-band project and its critically acclaimed album Transatlanticism (Barsuk 32, 2003) is especially representative of its approach. Like The Shins, Death Cab reached a wide audience thanks to the use of one of its songs on a network television program. Gibbard's songs show his penchant for straight-ahead popcraft and the arrangements and production (by Death Cab guitarist Chris Walla) offer tasteful support while allowing the songs themselves to shine--note, for example, the way the guitar doubles the vocal melody on \"The Sound of Settling,\" or the counter melodies the keyboard provides to the vocal line on \"License and Registration.\" While popular culture references are common in indie rock songs, Death Cab's are of interest in that they do not seem to be commentaries on or parodies of earlier styles. Instead, Death Cab seems generally to be concerned with unironically recreating the gentle easy-listening sound of 1980s light rock. (33) With the acceptance of rap-metal, gangsta rap, and grunge as mainstream music styles, the soft sounds of light rock are now often regarded as \"alternative.\" In fact, Death Cab can be so soft, and Gibbard's voice so gentle, that the band sounds strained when it attempts to pull off harder rocking numbers such as \"The New Year\" and Transatlanlicism's title track. Perhaps this is the reason for the success of The Postal Service, Gibbard's collaboration with mellow elec-tronica artist Jimmy Tamborello.Tamborello had previously released solo albums under his pseudonym Dntel, and Gibbard had made numerous guest appearances on those albums. The Postal Service's debut album Give Up (Sub Pop 595, 2003) was the first full-length collaboration between the two artists. Gibbard's songs and vocal delivery remain much the same as on his work with Death Cab, but here they are backed by soft synthesizer sounds, glitchy beats, and background vocals that float in and out of the mix. The result is an album that smoothes out the few rough edges exhibited on Death Cab's albums and sounds like an updated version of The Pet Shop Boys--a natural fit for Gibbard's style. With this album, Gibbard continued to infiltrate the mainstream, as the United Parcel Service used the song \"Such Great Heights\" in multiple television commercials.If The Shins, Death Cab for Cutie, and The Postal Service represent indie rock in the earlier part of the present decade, then Clap Your Hands Say Yeah (the band, as well as its self-titled debut of 2005 [Ounsworth 6494]) nicely encapsulate the state of independent music in the mid-2000s. The album was released without support from any label, yet, through buzz created by the indie rock blog scene, word of mouth, and the band's own Web site, it found its way into the mainstream marketplace and was even featured in a story on National Public Radio. (34) Moreover, the band does not seem to have arisen out of any regional \"scene\" or shared aesthetic. The album's arrangements tend to be spare and economical, allowing each individual instrument to shine, yet a notable feature of Clap Your Hands Say Yeah's sound is that one instrument rarely dominates the texture for more than a few measures at a time. Twin guitars bounce rhythm riffs and lead lines back and forth, their interaction often highlighted by hard left and right panning. A melodic bass pattern gets out of the way just in time for a tastefully understated drum fill to pop out of the mix. All in all, the record shows restraint and good sense, unusual characteristics for a band this young.ConclusionIn the twenty-five years surveyed here, American indie rock has evolved from an alternative genre produced, enjoyed and supported primarily by underground misfits to a popular one that has achieved widespread acceptance. The recordings are a lasting testament to the artists who chose creativity and expression above financial reward and commercial approval, sometimes gaining those rewards regardless, but often not. While the recordings represented here only scratch the surface of a comprehensive indie rock discography, they are representative of the practices, ethics, sonic characteristics, diversity and charm of this rich genre. While the lines are presently blurring between true independent rock and mainstream popular music, it is likely that indie rock will continue to thrive outside of the corporate mergers and commercial pressure of an industry largely controlled by major labels.SELECTED DISCOGRAPHY(All selections are compact discs)The Apples in Stereo. Fun Trick Noisemaker. spinART/Elephant 6 42, 1995. Cat Power. Moon Pix. Matador 286, 1998.Clap Your Hands Say Yeah. Clap your Hands Say Yeah. Ounsworth 6494, 2005.Death Cab for Cutie. Transatlanticism. Barsuk 32, 2003.Dinosaur Jr. You're Living all Over me. SST SSTCD-130, 1987.Fugazi. Repeater. Dischord 44, 1990.Guided by Voices. Bee Thousand. Scat 35, 1994.Nirvana. Nevermind. DGC 24425, 1991.Pavement. Slanted and Enchanted. Matador OLE-557-2 (originally released as OLE-038-2, 1992).Phair, Liz. Exile in Guyville. Matador 23227, 1993.The Pixies. Surfer Rosa. 4AD/Elektra 61295-2, (originally released as Rough Trade ROUGH-US-38, 1988).The Postal Service. Give Up. Sub Pop 595, 2003.The Replacements. Let it Be. Rykodisc 438844 (originally released on LP as Twin/Tone TTR 8441-2, 1984).The Shins. Oh, Inverted World. Sub Pop 550, 2000.Sleater-Kinney. Dig me Out. Kill Rock Stars 279, 1997.Slint. Spiderland. Touch and Go TG64-CD, 1991.Smith, Elliott. Either/Or. Kill Rock Stars KRS269, 1997.Sonic Youth. Daydream Nation. DGC Records DGCD-24515, 1993 (originally released as Enigma 74503, 1988).Superchunk. No Pocky for Kitty. Matador 35, 1991.Tortoise. Millions now Living will Never Die. Thrill Jockey Records 25, 1996.Uncle Tupelo. No Depression. Rockville 6050, 1990.(1.) Wendy Fonarow. Empire of Dirt (Middletown, Connecticut: Wesleyan University Press, 2006), 32.(2.) Ryan Hibbett, \"What is Indie Rock?\" Popular Music and Society 28, no. 1 (February 2005): 59.(3.) There are examples of independent artists that do not typically fall into the indie rock canon (i.e., Aimee Mann), and conversely there are artists on major labels who exhibit select traits of indie rock (l.e., They Might Be Giants, Weezer).(4.) The sound also results from indie rock's appropriation of punk rock's do-it-yourself (DIY) aesthetic, which features a range of tropes including resistance to commercialism, the glorification of amateurism, and the use of vintage instruments and recording equipment. What generally distinguishes indie rock from punk is that where the latter favors an aggressive, frequently offensive, in-your-face quality, the former is commonly less overtly confrontational and challenging, and is often characterized rather by withdrawal and irony. For a fuller discussion of the connection between indie rock and punk rock's DIY principles, see Kerry L. Smith, Encyclopedia of Indie (Westport, Connection Greenwood Press, 2008), s.v. \"DIY (Do-It-Yourself).\"(5.) For the purposes of the present discussion, this brief sketch of the indie rock sound will have to suffice. For a much fuller discussion of the musical characteristics of indie rock, see Matthew Bannister, \"What Does It Mean to Be Alternative? Indie Guitar Rock as a Genre,\" in White Boys, White Noise: Masculinities and 1980s Indie Guitar Rock (Aldershot, England: Ashgate, 2006), 57-90. Hibbett takes a different approach in defining the genre, arguing that indie rock's sound is fluid and unstable, as the genre must respond to changing market forces and mainstream tastes in order to preserve its \"logic of authenticity and otherness\"(56).(6.) Though indie rock is popular on other continents--Europe, especially--it is nearly impossible to represent global developments in the genre in one article.(7). This notion stems from Harold Bloom, The Anxiety of Influence: A Theory of Poetry (New York, NY: Oxford University Press, 1997).(8.) Scat 35, 1994.(9.) The term \"college rock\" was commonly used in the hue 1980s and early 1990s to define the alternative music featured on American college radio stations.(10.) \"Post-rock\" is an eccentric and experimental rock music subgenre that came to prominence in the 1990s. The \"post\" prefix arises from its practitioners' tendency to assemble experimental non-rock conventions into a type of cerebral rock music that lacks the traditional aggression or swagger normally associated with the genre.(11.) Noise rock is an outgrowth of punk in which the previous genre's abrasive songs are distilled to the point that noise itself becomes the primary focus of the music.(12.) Chris Smith, 100 Albums that Changed Popular Music (Westport, CT: Greenwood Press, 2007), 197.(13.) Todd Martens and Melinda Newman, \"The Great Label Debate, Indies vs. Majors: Developing Acts Face Tough Choices,\" Billboard, 19 March 2005, 64.(14.) Smith, Encyclopedia of Indie Rock, s.v. \"DIY (Do-It-Yourself).\"(15.) Uncle Tupelo were based out of Belleville, Illinois, but were commonly associated with the St. Louis independent scene.(16.) Barry Alfonso et al., eds., Billboard Illustrated Encyclopedia of Music (New York, NY: Billboard Books, 2003), s.v. \"alt.country.\" Other examples of alt.country artists include The Handsome Family, Lambchop, and Tift Merritt.(17.) Emo was originally a subgenre of punk known for highly emotive songs about personal subjects. Rites of Spring was one of the more influential emo bands. The term is presently used to describe sentimental alternative rock such as the music of Dashboard Confessional or Five for Fighting.(18.) Math rock features odd meters, odd phrasing, and complicated rhythms.(19.) Progressive rock was first popular in the 1970s and featured longer song forms and instrumental virtuosity. Mystical lyrics were common.(20.) Vladimir Bogdanov, Chris Woodstra, and Stephen Thomas Erlewine, eds., All Music Guide to Rock: The Definitive Guide to Rock, Pop, and Soul, 3d ed. (San Franscisco, CA: Backbeat Books, 2002), s.v. \"Superchunk.\"(21.) Chapel Hill was also home to such successful independent bands as Polvo, Squirrel Nut Zippers, and Portastatic (McCaughan's side-project).(22.) Grunge was originally a form of aggressive rock music with roots in the indie rock scenes of the Pacific Northwest, but later evolved into a popular form of alternative rock. Its sound commonly featured distorted guitar, screaming vocals, and morose song topics. The songs were typically performed in a sloppy, or \"grungy,\" manner. Other notable early grunge artists include Mudhoney and Tad.(23.) Spin 7, no. 1 (March 1902): 73.(24.) Lo-fi is typified by a production style in which instruments are recorded without any attempt to correct imperfections in the process. This same studied imperfection often applies to live performances as well.(25.) Sonic Youth, The Pixies, Superchunk. and The Apples in Stereo all featured female bassists.(26.) EP, or extended play, is a common release format on vinyl. CD. or download for indie rock artists. These releases feature only a handful of tracks and serve as a bridge between a single and a full-length recording. Some feature out takes or live versions, others represent the abundant creative output for a band between full-length releases.(27.) For a discussion of indie rock's relationship with 1960s popular culture, see Bannister, 77-9.(28) Krautrock is a term commonly used to describe experimental electronic rock from Germany.(29.) Riot Grrrl was a feminist movement of the early 1990s that grew out of punk rock scenes in the U.S. and U.K. For more information, see Nadine Monem. ed., Riot Grrrl: Revolution Girl Style Now! (London: Black Dog Publishing, 2007) or Marion Leonard. Gender in the Music Industry: Rock, Discourse and Girl Power (Aldershot. England: Ashgate, 2007).(30.) Jeff Leven, \"Clever Indie Even-people Unite! Kilo Kiley and Rock's New Era,\" Paste 3\") (September 2007]; 54.(31.) Discrevolt is a business that distributes music online via redeemable codes on plastic cards rather than by distributing digital or analog discs.(32.) Martens and Newman, 64.(33.) In fact, Gibbard went so far as to record a sincerely respectful cover of Phil Collins's 1984 hit, \"Against All Odds (Take a Look at Me Now)\" as a single with his side project, The Postal Service (on Various Artists, Wicker Park Soundtrack Album, Lakeshore Records 33804, 2004).(34.) Jacob Ganz, \"To Generate Buzz, Clap Your Hands on the 'Net\" All Things Considered, NPR, 29 November 2005 (http://www.npr.org/templates./story/story.php?storyId=5023133 [accessed 18 February 2009]).EDITED BY RICK ANDERSON"}]}