{"Pattern is Movement has released four full-length albums, two EPs, and several singles.": [{"url": "https://patternismovement.bandcamp.com/album/all-together", "page_content": "Digital Album Streaming + Download Includes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Purchasable with gift card Buy Digital Album $8 USD or more Send as Gift\n\nPattern Is Movement \"All Together\" LP Record/Vinyl + Digital Album Order PIM's 2008 album in its most deluxe form. The black vinyl LP is packaged in a heavyweight woodgrain inner sleeve, slipped inside a heavyweight woodgrain jacket. All full color on uncoated stock. The insert was made by hand: a collection of photographs, each one corresponding to the song that it inspired, inside a glassine envelope that mimics the bag the original photos were found in. So nice. The download cards have expired for this title, but you'll get an immediate download of the album (at even higher quality) when you purchase here.\n\n\n\nIncludes unlimited streaming of All Together via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\nPattern Is Movement \"All Together\" CD Compact Disc (CD) + Digital Album This CD is beautiful. Printed in Portland, OR by Stumptown Printers, the wallet features the \"All Together\" woodgrain motif, plus die-cut inner pockets that reveal the bright green spot-color interior of the package. The collection of photographs that inspired the songs on the album were reproduced in a strip of perforated(!) pictures. That's right: you can tear them apart and create your own collection. Of course, the CD face was printed in CMYK.\n\n\n\nIncludes unlimited streaming of All Together via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\n\n\nShare / Embed\n\nabout\n\n• Full length CD + LP + DIG\n\n• Artwork: Sara Padgett & Adam Heathcott\n\n\n\nAndrew Thiboldeaux and Chris Ward embody Pattern is Movement and the music that’s been a long time building, rising out of the ether of evangelical childhoods, best friendship, and life in Philadelphia. The two met at the ages of 13 and 14 --- as part of a Christian hip hop group. Raised in strict Pentecostal households and schools (see Jesus Camp), both Andrew and Chris found refuge in their shared love for Dr. Dre’s The Chronic --- and a friendship born out of secular escape turned into a creative collaboration. In high school, hand-me-down church sound equipment and a weekend obsession with making and recording music provided the means for what became Pattern is Movement.\n\n\n\nAll Together continues the mysterious narrative of the band and it exalts their existence as a two-man wall of sound. The pounding energy of their live show --- with Chris and Andrew side-by-side, simultaneously hammering their instruments, sweat flying --- resides in ten exquisitely constructed tracks. In the studio (Scott Solter’s), every idea was given its voice; a range of guest instruments embellished the core magic of Andrew’s vocals and keys and Chris’ drums. All Together embraces the vocabulary of the band’s experienced and obsessive recording language, yet it holds on to that unmistakable dynamism of their live performance.\n\n\n\nFurthering All Together’s lore is its song-by-song relationship to a series of old photographs. Found by Andrew’s brother on the street in Philly, ten tiny early 20th century images formed Pattern is Movement’s own set of Oblique Strategies. Each photo abstractly inspired a song and its final form on the record, with Andrew and Chris even referring to the pictures during tracking. The record’s name also arose from the connotation of this found collection: though essentially disparate, we’re ultimately all together in our experience. Once time passes, all our pictures tell the same story.\n\ncredits\n\nreleased April 1, 2008\n\nlicense\n\nall rights reserved"}, {"url": "https://patternismovement.bandcamp.com/album/suckling-untitled-how-does-it-feel", "page_content": "Digital Album Streaming + Download Includes high-quality download in MP3, FLAC and more. Paying supporters also get unlimited streaming via the free Bandcamp app. Purchasable with gift card Buy Digital Album name your price Send as Gift\n\nPattern Is Movement \"Suckling / Untitled (How Does It Feel?)\" Limited Edition 12\" Record/Vinyl + Digital Album Limited to 500 hand-numbered copies, this 12\" is pressed on transparent green vinyl and is packaged in a full-color 20pt. matte-finish jacket. Features \"Suckling\" from their 2013 self-titled album PLUS the band's classic version of D'Angelo's \"Untitled (How Does It Feel?)\". Includes a high quality digital download (MP3, FLAC). Featuring art by Adam Heathcott of Hometapes.\n\n\n\nIncludes unlimited streaming of Suckling / Untitled (How Does It Feel?) via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\n\n\nShare / Embed\n\nabout\n\nFounded in Philadelphia by Andrew Thiboldeaux and Christopher Ward, Pattern Is Movement and its twelve year history map a vast territory of internal exploration and external output. As the band recorded a series of albums over the past decade — The (Im)possibility of Longing, Stowaway, and All Together — they also shifted in membership and in stylistic focus, eventually solidifying into a powerful duo: Thiboldeaux on Rhodes, synth, bass, and vocals, and Ward on drums. Deeply soulful and natively genre-defying, they toured extensively, joining bands like St. Vincent, The Roots, and Shudder to Think, before delving into their fourth album and, along with it, the brightest and darkest corners of composition, orchestration, and collaboration. Their first reveal is a limited edition 12\" and digital single, featuring the new song \"Suckling\" backed with the long-awaited studio recording of fan favorite \"Untitled (How Does It Feel?),\" Pattern Is Movement's sweltering cover of D'Angelo.\n\ncredits\n\nreleased October 8, 2013\n\n\n\nPattern Is Movement is\n\nAndrew Thiboldeaux - vocals, keyboards, bass, percussion\n\nChristopher Ward - drums, percussion\n\n\n\nProduced by Pattern Is Movement and David Downham\n\nRecorded at The Gradwell House\n\nEngineered by David Downham\n\n\n\nSuckling (3:20)\n\nWritten and performed by Pattern Is Movement\n\nTrumpet by Josh Anderson\n\nMixed at The Gradwell House and Sigma Sound\n\nMixed by David Downham with additional mixing by Christopher Ward\n\nMastered by Tony Dawsey at Masterdisk\n\n\n\nUntitled (How Does It Feel?) (5:13)\n\nWritten by D'Angelo and Raphael Sadiq\n\nPerformed by Pattern Is Movement\n\nMixed by David Downham at The Gradwell House\n\nMastered by David Downham at The Gradwell House\n\n\n\nArt and layout by Adam Heathcott, Hometapes.\n\nlicense\n\nall rights reserved"}, {"url": "https://patternismovement.bandcamp.com/album/pattern-is-movement", "page_content": "Digital Album Streaming + Download\n\nIncludes high-quality download in MP3, FLAC and more. Paying supporters also get unlimited streaming via the free Bandcamp app.\n\nPurchasable with gift card"}, {"url": "https://patternismovement.bandcamp.com/album/light-of-the-world-ep", "page_content": "Digital Album Streaming + Download\n\nIncludes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nPurchasable with gift card"}, {"url": "https://patternismovement.bandcamp.com/album/canonic-scott-solter-plays-pattern-is-movement", "page_content": "Digital Album Streaming + Download Includes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Purchasable with gift card Buy Digital Album $7 USD or more Send as Gift\n\n\"Canonic: Scott Solter Plays Pattern Is Movement\" CD Compact Disc (CD) + Digital Album Lovingly and ONLY produced on compact disc, PIM's first Hometapes release is packaged in a chipboard Arigato Pak and includes an insert, both printed in two rich spot colors (matching the two-color CD face) by Stumptown Printers in Portland, OR.\n\n\n\nIncludes unlimited streaming of Canonic: Scott Solter Plays Pattern is Movement via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Sold Out\n\n\n\nShare / Embed\n\nabout\n\n• 12-song compact disc\n\n• Artwork: Sedaqa\n\n\n\nFor Canonic, Pattern is Movement handed over everything about themselves to a man named Scott Solter. He recorded their last record,\n\nStowaway, in 2005 at San Francisco studios Tiny Telephone (John Vanderslice’s place) and his own 15th St. Scott has worked as an engineer and producer with the likes of Vanderslice, Spoon, the Mountain Goats, Two Gallants, and Tarentel. He’s also got a few records by his own name: The Brief Light (Manifold) and this year’s One River (on Tell-All) which we highly recommend. Just last year he also put his stamp on John Vanderslice’s Cellar Door with remix album MGM Endings.\n\n\n\nEarly this year Scott picked up and moved to North Carolina, bringing Pattern Is Movement’s Stowaway tapes with him. At his new studio, Baucom Road, with grease, razor, and tape in hand, Scott conjured up something completely new. Running with Pattern Is Movement’s insistent rhythms and vocal experimentation, he has created an all-analog album of songs that would make King Tubby and Scientist proud. These songs boom and shake and crackle and hiss and revalidate the art of the remix.\n\n\n\nWe present to you......Canonic.\n\ncredits\n\nreleased October 10, 2006\n\nlicense\n\nall rights reserved"}, {"url": "https://diymusician.cdbaby.com/releasing-music/what-is-an-ep/", "page_content": "The difference between an EP, LP, and single on platforms like Spotify and Apple Music.\n\nPity the poor EP, that oft-overlooked music format; the middle child between the single and long playing album (LP). Often misunderstood and forever caught in format purgatory by digital music services, the EP has languished long enough.\n\nHeck, even its name is misleading. EP stands for “extended play,” but the format is actually shorter than long playing — or “full length” — albums.\n\nDespite its confusing name though, this humble format possesses a flexibility any artist can employ to their advantage. We’re here to show you how you can use an EP to build momentum for your music; we’ll also shed light on how Spotify and Apple music define an EP.\n\nBut first, what even is an EP?\n\nA brief history of the EP\n\nIn the early days of the music industry when vinyl reigned supreme, the single was the only format by necessity. Technology had not evolved enough to fit more than one song on the wax cylinders and brittle shellac discs early sound recordings were cut on. So, from the day Thomas Edison sang “Mary Had a Little Lamb” into his phonograph in 1877 to the 1920s, recorded sound was sold by the song.\n\nFinally, labels began pressing 78 rpm (revolutions per minute) records, which were able to fit two songs instead of one on the record due to the thinner grooves. In 1948 Columbia Records introduced the 33 1/3 rpm 12-inch long playing (LP) record and a year later RCA Victor released its 45 rpm seven-inch single, gambling that consumers would disregard the 45’s limited four minute cap on each side in favor of its higher fidelity.\n\nThe ensuing “battle of the speeds” between Columbia and RCA Victor in the late ‘40s resulted in a decisive victory for Columbia, and the industry standardized the 12-inch, 33 1/3 LP as the receptacle of choice for its newest format: the long playing album (LP).\n\nBut that didn’t stop RCA from one last attempt at besting their rival. In 1952 they released the seven-inch Extended Play 45. RCA compromised sound quality by narrowing the grooves to fit nearly twice as much music on each side as their original 45, but it wasn’t enough to topple the LP juggernaut.\n\nBy the mid-’60s, most artists were not content to release one to four songs on an EP when the LP allowed five or six songs on each side. The Beatles released Sgt. Pepper, the concept album was born, and the ‘70s ushered in the era of Album Oriented Rock (AOR). Singles were released to radio stations and albums were distributed to record stores. A few major RCA artists like Elvis Presley had used the EP to significant success throughout the late ’50s and into the ’60s, but by the ’70s its limited space relegated the format to niche status.\n\nIn the ‘80s, the short song lengths of the emerging punk rock scene combined with the musicians’ inability to pay for LP-length recording sessions brought on a resurgence of the EP. Bands like Black Flag took full advantage of the format; Dukowski and Co. cut three legendary EPs– each under seven minutes – before their ’81 debut Damaged. Thus, the EP had a newfound and noble purpose in independent music: to introduce hungry young bands to the world.\n\nAs the ‘90s dawned and CDs fully supplanted vinyl and cassettes as the dominant physical format, the EP kept its job and helped numerous artists sign record deals. Eminem signed with Aftermath after label owner Dr. Dre heard the Slim Shady EP through Interscope CEO Jimmy Iovine. (Coincidentally, the cover of Slim’s EP bears a striking resemblance to Black Flag’s Damaged.) This continued into the New Millennium. In 2001, the Strokes’ EP The Modern Age attracted the attention of enough labels that the band essentially had their pick among potential suitors.\n\nThree ways artists use EPs in the modern era\n\nIn the wake of the streaming revolution where cherry-picking and playlists have mostly replaced full album downloads, artists have created a few uses for the EP:\n\nAs a multi-track debut after your single\n\nThe EP is still a great option for a first release, especially once you have more than one song recorded. It’s not as long as an album, so there’s no pressure to write more songs if you only have five instead of 10. It’s also cheaper to record since you spend less time in the studio. The debut EP is a fantastic way to get what you have out to potential fans while you’re writing more material. A common practice for artists is to re-record a song or two from their EP for their full-length debut. So pick a few favorites and make them even better when you get the cash for more studio time.\n\nAs a stopgap between albums\n\nEstablished artists use the EP to sate their fans’ appetites between albums. Normally this consists of already recorded B-sides that didn’t make it on the previous album; a nice snack for their following while the artist works on new music, tours, or even takes a much-needed break. Carly Rae Jepsen released Emotion: Side B a year after her 2015 album Emotion. It was a quick 27 minutes of tunes fans hadn’t heard before but were already in the hopper after her album.\n\nAs a mix of recordings you enjoy that may not work on an album\n\nThe great thing about the EP is that it’s flexible and freeform. Think of it as a little room to stretch and experiment. Got a few live recordings you’re particularly fond of? Maybe a remix another artist did of one of your songs that you enjoyed? A song or two that didn’t make the cut on your album? Toss ‘em all onto a release and that’s five tracks your fans haven’t heard yet! A popular use of EPs in electronic music is to lead off the release with a single, then follow with a few remixes or reinterpretations. The EP is the gumbo of recorded music. Whatever you’ve got that sounds good, add it to the pot.\n\nWhat qualifies as an EP with the digital platforms?\n\nNow that you have some ideas about why and how to make your EP, you might be asking just what qualifies as an EP with digital services like Apple Music and Spotify. Luckily, there are some pretty exact guidelines for those two major services, as they are the only two who list the EP as its own category.\n\nAn EP on Apple Music\n\nEPs must meet one of the following two requirements on Apple Music:\n\nThe release has a total of one to three (1-3) tracks, one or more of the tracks is/are 10 minutes or longer, and the entire release is less than 30 minutes.\n\nThe release has a total of four to six (4-6) tracks and the entire release is less than 30 minutes.\n\nIf your submission meets these criteria, iTunes will automatically add “-EP” to the end of your title. So whether or not you meant to release an EP, they’ll qualify it as such if it falls under their qualifications.\n\nAn EP on Spotify\n\nAnything that meets the below requirements will show up under “EP’s & Singles” rather than your “Albums” section:\n\nThe release is under 30 minutes.\n\nThe release has 4-6 tracks.\n\nNote: Spotify will NOT change the title of your release to reflect the format.\n\nWhat qualifies as a single with the digital platforms?\n\nIf you only have one song, a single is still the best way to get your first song out there. As with EPs, Apple Music and Spotify have requirements for submissions to be listed under the Single category.\n\nA single on Apple Music\n\nApple Music will classify your release as a single if:\n\nThe release is one to three (1-3) tracks.\n\nThe entire release is 30 minutes or less and all individual tracks are less than 10 minutes.\n\nLike EPs, if you submission meets the requirements of a Single with Apple Music, they will add “-Single” at the end of the submission.\n\nA single on Spotify\n\nYour music will be classified under the single category if:\n\nThe release is under 30 minutes.\n\nThe release has three (3) or fewer tracks.\n\nHere are 10 strategies for releasing singles in 2019.\n\nEPs help artists in the streaming age build momentum and keep the attention of fans\n\nWhile singles are a great way to release one song, the EP is a fantastic next step in a young artist’s career. It doesn’t require the attention span of an album and it costs less to record. What’s there not to like?"}, {"url": "https://dittomusic.com/en/blog/albums-vs-eps-vs-singles-a-guide-to-releasing-music/", "page_content": "The results are in! EPs are officially on the rise whilst albums are in demise - and we've got the data to prove it. Read on to check it out for yourself!\n\nWell with digital streaming taking a hold of the new music industry, we're beginning to wonder where that leaves the EP and traditional album formats in 2023 - and more importantly - which one is best suited for new artists to who want to know how to release music in 2023. All will be answered in due course. But first, let’s open the floor with a basic run-down of what each is and how they differ.\n\n<hr>\n\n\n\nWhat's the difference between an EP and an album?\n\nWhat separates a single, album and EP comes down to 2 main things;\n\n1. Length (i.e. the number of songs which feature on the track list) 2. Duration (i.e. the total running time) of the entire project\n\n<br>\n\nAn album or LP (Long Play) refers to a full length body of work, features between 7-29 tracks and has a running time of roughly 35-60 mins.\n\nAn EP (Extended Play) refers to a half-length body of work, features between 4-6 tracks and has a running time of roughly 15-22 mins (but can be up to 30 minutes).\n\nA single is the shortest body of work you can release, features between 1-3 tracks and has a running time of roughly less than 10 mins.\n\n<br>\n\n<center>\n\n</center>\n\n<br>\n\n<hr>\n\n<br>\n\nHow many albums, EPs and singles are released each year?\n\n\n\nAs you can see by the graph below, since 2016, album release numbers are plummeting while EPs & singles continue to skyrocket.\n\n<br>\n\n<center>\n\n</center>\n\n<br>\n\nAccording to data from Ditto Music, over the past 5 years the number of album releases has seen a consistent year-on-year drop. While albums made up 35% of all releases in 2016, their popularity has dropped significantly, with albums making up only 9.7% of all releases last year in 2021 (that's over -25%!)\n\nOn the other hand, the number of singles & EP releases has seen continuous growth over the same 5 year period, making a whopping 90.3% of total releases in 2021.\n\nSo by a majority and popularity count, singles & EPs definitely come out on top.\n\n<hr>\n\n<br>\n\nShould I release an album or an EP?\n\nDeciding whether or not to record and release an EP or an album ultimately comes down to a couple of different individual factors, including your budget, your target audience and ultimately, your music goals.\n\n<br>\n\n1. Budget\n\n<br>\n\n<center>\n\n</center>\n\n<br>\n\nIn terms of money, EPs are cheaper to make than albums.\n\nWith almost half the no. of songs, you’ll also be halving any money spent on things like studio time, production costs, instrument hire, session musicians - the list goes on!\n\n<br>\n\n2. Target audience\n\n<br>\n\n<center>\n\n</center>\n\n<br>\n\nWhich album format you choose will directly influence your fans.\n\nWhether that’s explorative audiences, your luke-warm fans or even your diehard superfans.\n\nAn EP tends to attract new listeners whilst also turning already gained listeners into luke-warm fans. Once you start releasing even more music in the form of an album, you’ll be strengthening your relationship with your luke-warm fans, but also turning some into die-hard superfans. Makes sense right?\n\nSo to cut it short - putting out an EP tends to work better if you’re a new artist with the aim of getting discovered by new listeners.\n\n<br>\n\n3. Your music goals\n\n<br>\n\n<center>\n\n</center>\n\n<br>\n\nWhat are you aiming to achieve with your release?\n\nFor example, raising your artist profile, changing up your sound or launching new merch/a tour might be better suited to an album.\n\nWhereas if you’re still finding your sound, getting your music into the ears of new listeners or simply focussed on getting music out quickly and consistently, an EP is arguably the better option.\n\nSo what does all this mean?\n\nWell, although there’s no one-rule-fits-all for this kind of thing, for new, upcoming artists who are just starting out (which is probably you if you’re reading this post!), there’s a general consensus that releasing an EP is the better option during this early stage in your music career.\n\nRead on to find out why!\n\n<hr>\n\nWhy release an EP over an album?\n\n<br>\n\n1. The streaming industry\n\n\n\nWith on-demand streaming taking the new music industry by storm, digital streaming platforms like Apple Music and Spotify, as well as social media platforms like TikTok and Instagram are now the main places where listeners are looking for new music.\n\nSo it makes sense that a short-form EP works perfectly to release on these big platforms, plus smaller ones like BandCamp and SoundCloud too.\n\nYou can show off what you and your brand is all about by really playing on your strengths as an artist, through a more specific selection of tracks that exhibit your strongest work to date. Talk about a crowd pleaser!\n\nAnd if you aren’t already releasing music to major streaming platforms and stores, then what are you waiting for?!\n\nSign up and get started with Ditto today.\n\n<br>\n\n2. Playlists & music consumption habits\n\n\n\nWith millions of songs available to listeners at the touch of a button, listeners are becoming conditioned to listen to more artists and a shorter collection of songs.\n\nThis is down to modern consumption habits - including a shortened listener attention span as well as streaming giants like Apple Music and Spotify highly promoting more playlist consumption.\n\nNew listeners now rely on algorithmic playlist recommendations from the likes of ‘Discover Weekly’ and ‘New Music Friday’ to find new artists and tracks to listen to - and you’ve got a much better chance of your favourite singles from your latest EP landing on there, that could otherwise get lost in the clutter if you released it within a longer-form album format.\n\nLearn how to get your music on Discover Weekly & Release Radar playlists!\n\nDid you know: A global streaming study found over half (54%) of people interviewed are listening to fewer albums now, than they did 5 or 10 years ago.\n\n<br>\n\n3. Maintain a regular release schedule\n\n\n\nFor new artists entering the music game, releasing singles that form an eventual EP over time might possibly be the best strategy to stay relevant, keep your fans engaged and even buy you some time should you want to eventually release an LP.\n\nAt this early stage, you don’t want to be spending so much time and money recording, producing and marketing the perfect 12 track concept album, putting it out a year down the line, only to realise you’ve lost all the listeners and fans you’d already gained in the process because they got tired waiting to hear new music from you.\n\nGrowing a fan base is important - yes - but like any kind of business, it’s important to hold onto the fans you already have, and turn them into superfans.\n\nHaving a predictable and regular release schedule is the way to do just that.\n\nReleasing an EP means you can still target new fans with a high standard of music that reflects your best work, whilst also marketing to current fans by releasing regular music.\n\n<br>\n\n4. Releasing music that didn’t fit the bill\n\n\n\nHave you ever written an epic track but it just doesn't fit the theme or soundscape of your project?\n\nDon’t dismiss it! Get it out there through an EP.\n\nArtists like Tech N9ne pledge to never waste a song - and he’s right! He puts out every song he ever records, and you’ll see this if you've ever had a gander at his discography. His output is huge - and a lot of that comes down to regular EPs that exist because the tracks on them didn’t fit on his previous albums.\n\n<br>\n\n5. To act as a stop-gap between LPs\n\n\n\nBetween every major album or LP, some artists will choose to release an EP as a sort of precursor if you like, to their next project.\n\nThe point of the EP in this scenario is to introduce or hint at themes and concepts that will be revealed in the content of their bigger album.\n\nMaybe your LP will explore a radically different sound that your fans won’t have heard from you before? Use an EP to slowly introduce them to your musical evolution.\n\n<hr>\n\n<br>\n\nAlbum vs EP release strategies\n\n<br>\n\nThe best EP release strategies\n\n\n\nWhen you’re releasing an EP, don’t leave your fanbase waiting for new material. Releasing an EP by dropping some regular, killer singles is the most logical way!\n\nThis is what’s been termed in the industry as the ‘Waterfall Strategy.’\n\nHit play on the video below to hear how it works!\n\n<br>\n\n<center>\n\n<div class=\"embed-youtube\">\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LHjT_orf9n0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n</div>\n\n</center>\n\n<br>\n\nThe point is - by releasing singles consistently over time, you’ll actually be making an EP in the process.\n\nThis way you’ll be able to handpick a selection of 4 - 6 tracks for your EP based on singles which have performed the best among your fans, which almost guarantees a highly successful EP release.\n\nIt’ll ultimately serve as a portfolio of your best quality work to date and help you find out what your listeners love hearing from you, which can influence your approach to future singles, future EPs or an eventual LP down the line.\n\nIf you’re not sure how, find out how to release a single in 2022.\n\n<br>\n\nThe best album release strategies\n\n\n\nAn album release plan is totally different from a single or EP.\n\nWriting, recording and promoting an album can take months - if not a year or more - of hard work and dedication.\n\nWhich leaves a good gap of time to fall out of the listening space of your audience.\n\nThat’s why even when it comes to making and releasing an LP, you should never stop with the single output!\n\nLoads of big artists opt for this release strategy. Just last year Adele made a huge comeback with her single release ‘Easy On Me’, before releasing her entire studio album ‘30’ just a few weeks later.\n\nDrip-feeding content first to build a following and thinking about the post-album release is just as important as the actual album drop itself.\n\n<hr>\n\n<br>\n\nShould I release an EP before an album?\n\nThe short answer - yes, probably.\n\nOnce you’ve got some singles and an EP or a few under your belt, you’ll soon be able to predict what your fans want to see from you which makes the time, effort and cost of an album well-worth it.\n\nIt’s also really important you don’t rush into an album release.\n\nYour first album (and the ones after) will be a hallmark moment in your music career. They’ll generate a lot of interest from not just fans, but music critics, fellow artists and alike.\n\nSo put in the time to make sure that like your EPs, your album is an accurate reflection of your best work.\n\nAnd don’t be put off by consumption habits!\n\nPeople will still listen to longer-form. You just have to lure them in with short-form first. Earn their time through quality and consistency.\n\n<hr>\n\nAlbum vs EP. Have we settled the debate?\n\nLike we mentioned, there’s not one-size-fits all. Every artist is different and so too will their approach be to either an EP or album release.\n\nBut it’s important to have all the facts on both before you start putting out your own projects.\n\nWhatever you decide to do, base it on what’s right for your budget, your target audience and your musical goals at this stage of the game.\n\n<br>"}, {"url": "https://wegotthiscovered.com/music/all-exo-members-ages-and-birthdays/", "page_content": "EXO is a South Korean-Chinese boy group that debuted under the company, SM Entertainment in 2012 with the EP MAMA. The group initially consisted of 12 members: Suho, Kris, Luhan, Baekhyun, Chanyeol, Tao, Lay, Chen, Sehun, Xiumin, Kai, and D.O., and was created to promote their music in both South Korea and China.\n\nThree Chinese members (Kris, Luhan, and Tao) left the group individually between 2014 and 2015, leaving nine members. Known to be one of the most popular and influential K-pop boy groups of all time, EXO has been famously dubbed “Kings of K-pop”, by many fans of the genre.\n\nHere are some of the personal facts about the members of the popular group.\n\nSuho\n\nKim Junmyeon was born on May 22 in 1991 and is 30 years old. The singer, songwriter, actor, and leader of EXO stands at 173cm (five foot, eight inches) tall. At age 16, he was discovered by an SM casting manager and became a trainee after passing the SM Entertainment casting system in 2006. He made his acting debut in 2016 with the indie film, One Way Trip. Since then, he has starred in several films and dramas. He finally debuted as a soloist in 2020 with his EP, Self-Portrait. Suho enlisted for his mandatory military service in May 2020 and was discharged on February 13, 2022. He had his comeback in April with his second mini-album, Grey Suit, and has been promoting his music since then.\n\nChanyeol\n\nPark Chanyeol was born on November 27, 1992, and is 29 years old. He is 186cm (six foot) tall. A singer, rapper, songwriter, producer, actor, and model, Chanyeol’s interest in music began in elementary school after watching School of Rock, and listening to Yoo Young Jin’s song, “Unconditional Kismet”. He joined SM Entertainment after placing in second in the Smart Model contest in 2008, and began to focus on rapping. He has starred in various films and dramas like: So I Married an Anti-Fan and Missing Nine. He and fellow EXO member, Sehun, debuted as the sub-unit EXO-SC in 2019 with the EP What a Life. He enlisted for his mandatory military service in March 2021 and will be discharged in September 2022.\n\nChen\n\nKim Jongdae was born on September 21, 1992. The 29-year-old stands at 172cm (five foot, six inches) tall. He is a singer and songwriter that joined SM Entertainment as a trainee at the age of 19. He debuted as a solo artist with the song “The Best Luck”, which was an OST for the popular drama series It’s Okay, That’s Love, and he has released two EPs, both in 2019. He enlisted in October 2020 after his marriage. He is now a father of two and has been discharged as of April 2022.\n\nBaekhyun\n\nByun Baekhyun was born on May 6, 1992, and is 30 years old, and 174cm (five foot, seven inches) tall. A singer, songwriter, and actor, Baekhyun gained interest in music as a child and began training to be a singer at age 11. He received piano lessons and later joined a band called Honsusangtae. He is a member of the sub-unit CBX (with fellow EXO members Chen and Xiumin), and the group SuperM. Popularly referred to as the “Genius Idol”, Baekhyun pursued a solo career in 2019 with his mini-album, City Lights. He made his acting debut in a supporting role in the drama Moonlovers: Scarlet Heart Ryeo. Baekhyun released his fourth mini-album, Bambi, before enlisting in the military on May 6, 2021. He will be discharged in February 2023.\n\nKai\n\nKim Jongin was born on January 14, 1994, which makes him 28 years old. He is 182cm (five foot, nine inches) tall. Kai is a singer, dancer, actor, and model. Widely recognized as one of the best dancers in K-pop and South Korea as a whole, Kai graduated from the School of Performing Arts Seoul in 2012. He started learning dance at age eight and signed under SM Entertainment in 2007. He has starred in various web dramas including Andante and Choco Bank. Kai is a Gucci and Seoul Fashion Week ambassador. He made his solo debut in 2020 with the mini-album, Kai, and released his second mini-album, Peaches a year after.\n\nXiumin\n\nKim Minseok was born on March 26, 1990. He is 32 years old and 173 (five foot, six inches) tall. He is a singer and actor, and had initially auditioned at JYP Entertainment in 2008 but was rejected. He then participated in SM’s Everysing Contest and was signed that same year through the casting system. His stage name “Xiumin” was coined from the Chinese character for “great or show” and part of his birth name. Xiumin’s debut song was a part of his first acting gig, Falling for Challenge, where he played a leading role. He enlisted for his military service in May 2019 and was discharged in December 2020.\n\nD.O.\n\nDo Kyungsoo was born on January 12, 1993. He is 29 years old, and 172cm (five foot, six inches) tall. He is a singer, songwriter, and actor and started singing in primary school, participating in many singing contests. He auditioned at SM and was accepted, and he made his acting debut with the film Cart in 2014 and contributed to the soundtrack of the movie. He has starred in many more dramas and films and was selected by the Korean Film Council as one of the 200 Korean actors that promote the Korean movie scene. He enlisted for his military service in July of 2019 and debuted officially as a soloist with his mini-album Empathy after he was discharged in July 2021.\n\nSehun\n\nOh Sehun was born on April 12, 1994. He is 28 years old and 183cm (five foot, 11 inches) tall. Sehun is a singer, actor, model, songwriter, and model who was scouted on the streets by an SM casting agent when he was 12, but ran away thinking they were kidnappers. He eventually joined SM in 2008 after going through four auditions in two years. Sehun had his acting debut in the drama, Dokgo Rewind and was recently cast as the supporting role in the movie The Pirates: The Last Royal Treasure. Sehun was named the face of Dior in 2020 and a global ambassador for the brand in 2021.\n\nLay\n\nZhang Yixing, also known as Lay Zhang, was born on October 7, 1991. He is 30 years old and 177cm (five foot, eight inches) tall. Lay is a singer, songwriter, producer, dancer, rapper, actor, and businessman. He made his acting debut in the 1998 Chinese drama We the People. He became a child star after he won third place in a competition in 2005. At age 16, Lay auditioned to be a trainee under SM and passed which led him to move to South Korea to complete his training. In 2015, Lay founded a personal agency and released his solo debut song “What U Need?”, and a mini-album, Lose Control. He also made his acting debut in 2015 with the movie Ex-Files 2. He has released four full-length albums and four mini-albums since then. In 2020, he founded the Chromosome Entertainment Group and is recruiting trainees worldwide. Lay was unable to promote with EXO for five years and announced his departure from SM Entertainment on April 8, 2022.\n\nAbout the author"}, {"url": "https://emastered.com/blog/ep-vs-lp", "page_content": "Navigating your first public project can be challenging. If you're gearing up to release music, you're likely overwhelmed by industry jargon, acronyms, and all of the mechanics that come with distributing a professional project.\n\nNot to worry! Below, we'll delve into the key difference between an EP vs LP so that you can secure the right format for your release.\n\nEP vs. LP In The Music Industry At A Glance\n\nTo get to the heart of the matter, an EP is a collection of typically four to six tracks while an LP or album is a body of work that contains seven or more tracks. These amounts were originally determined by the amount of music that could be held on vinyl records as discussed below, but the legacy of the track limits still holds today.\n\nEPs and LPs aren't the only music industry-standard formats, though they are arguably the most common for artists releasing projects. Streaming platforms might have changed the way we release music, but an extended play record and full-length album have a long recorded history within the music business.\n\nFor reference, EP stands for extended play while LP stands for long play. You could even consider an EP album a mini album by principle - these projects are too long to be considered singles, but too short to warrant the title of album.\n\nThe History Behind Vinyl Records: What Created EPs vs LPs?\n\nEPs and LPs are distinguished by the length of music and the number of tracks. These two factors came into play during the creation of vinyl records. Originally, Columbia records created a vinyl record that could hold up to 23 minutes of audio on each side. This was a huge advancement since at the time, the standard was a 12-inch record that could only play 5 minutes of audio on each side. Hence, the creation of full-length albums.\n\nIn order to compete with this format, RCA records released a smaller vinyl record that could hold approximately 8 minutes of audio on each side. These smaller records paved the way for the typical EP, serving as album samplers or just smaller projects for musicians.\n\nUnderstanding The Different Formats: LP, EP, and Singles\n\nTo start, it's key to break down the different possible formats for music releases. When you're releasing music, you're distributing your art as a single, EP, mixtape, LP or full-length album, or double LP.\n\nLP\n\nAn LP or full album holds anywhere from 7 to 29 tracks of physical or digital music. This is also the name of a modern studio album. An LP album is typically between 35 and 60 minutes long.\n\nDouble LPs\n\nDouble LPs are the most long-playing vinyl record, with track limits above 29 tracks. These album formats came about with the dawn of retrospective albums, like an artist's \"Greatest Hits\" record.\n\nThe double LP records come with two double-sided records that could encompass multiple or a single album era. Double LPs might also include bonus tracks or extended versions of songs that your top music fans may enjoy.\n\nEP\n\nEP albums tend to hold 4 to 6 tracks. The EP album format is usually 15 to 20 minutes long and serves as a great way for up-and-coming artists to build their music careers before they're ready for album releases.\n\nSingles\n\nA single release is typically one track released on its own, but it can technically be up to three tracks, bridging the gap between EP releases.\n\nMixtapes\n\nMixtapes operate in a category of their own. This distribution format has few rules and originates from the hip-hop community, though it's used all throughout the music industry. Typically, mixtapes are compilations of multiple songs that don't have as much marketing or cohesion as typical formal EP or album releases.\n\nBuilding Your Project Rollout\n\nReady to start releasing music? It's a good idea to put together a release plan for your project. Here are several methods for putting together your project release:\n\nWaterfall Release\n\nIn the age of streaming platforms, the waterfall release seems to be the most common. In this method, artists will drop the first track of an album or EP, then followed by the release of another track and the first track. This process continues until the release of the entire project, usually unveiling a handful of new music along with the previously expressed work.\n\nThe benefit of the waterfall release is that having a more continuous project on streaming can help boost listening since the platform will auto-play to the next song.\n\nTwo Singles and An EP or LP\n\nMany artists opt to drop two to three singles, followed by an EP or LP. This way, your listener gets a taste of what's to come, and you can build anticipation to your album with some extra runway.\n\nThe Project Drop\n\nLegacy artists like Beyonce can drop a project seemingly without planning and still reach the top of the charts. This rollout is more or less reserved for superstar artists who have built up their community to a point where it can run itself.\n\nReleasing Singles\n\nIf you have a track that didn't quite fit your previous albums or find yourself in between releases, it may make sense to drop a single entirely on its own. Artists might also drop singles as an extended single as bonus tracks to the album that was recently released.\n\nShould I Release An Album Or An EP?\n\nThe best release schedule is entirely dependent on your goals as an artist. Are you looking for new listeners? Single might be the best way to quickly introduce new sounds into your catalog. Looking to provide some depth for fans? Opt for an album or LP. Somewhere in the middle? An EP makes sense for artists who want to start building beyond single releases.\n\nIt's also worth mentioning that a debut album or entire release comes with its own connotations. Some artists may prefer to wait until they progress along their music career before dropping their first studio album. Other artists might not find this aspect as important.\n\nIn any event, don't let your fears around the project format prevent you from releasing new music. In the age of digital downloads and streaming platforms, your most popular songs may hit peak popularity years after they've been released.\n\nFinding the right way to roll out more songs can be confusing. At the end of the day, listen to your fan base when choosing between launching a single, EP, or album. Committing to consistently releasing music will help keep your fans engaged while you build your skillset along the way. Have fun sending your art out into the world!"}, {"url": "https://victrola.com/blogs/articles/ep-vs-lp-what-s-the-difference", "page_content": "It’s typical for music fans to talk about the albums they love or how different a song sounds on a vinyl record vs. a digital format or a CD. However, when taking a deeper dive into the artistry of all things music, the discussion often turns to other topics, such as the differences between Mixtapes vs. Albums, or the differences between EP vs. LP.\n\nRegardless of where you are on the music listening spectrum, it’s likely you’ve seen these terms before. But, you may not be quite sure what they actually mean. We’re here to define these terms, review the differences between an EP vs. LP vs. album, and share a few of the best of each of these album types. After reading this blog, you will feel like a pro next time you visit a record store.\n\nWhat is an EP?\n\nAn EP stands for an extended play album. It is usually in reference to a vinyl record but could also be a CD or digital download. The listening format isn’t what defines an EP but rather how many tracks are included, or album length. Compared to a full length album, an EP album is a short album but has more songs than a single. A typical EP album, like the The Format: EP, has about four to six tracks, depending on the genre or artist’s decision.\n\nHowever, even if an EP just has two or three songs, there are no time limitations to how long a song can be. That means you could still have nearly an hour-long listening experience from the entire release if the songs on the record are extended. For example, six tracks at around 12 minutes each fits into the EP album format.\n\nWhen it comes to comparing an EP vs. LP album, EPs are a way for indie artists to get their music heard (and funded) before producing a full-length long play album. They’re often used for promotional purposes and to have ready when distributing to a record label and producers.\n\nVinyl EPs: What Sets Them Apart?\n\nWhile a small collection of songs can be called an EP across all mediums, vinyl EPs stand out for their uniqueness and collectibility. Unlike records on CD or in digital formats, vinyl EPs are physically different from their LP counterparts.\n\nLike David Bowie, vinyl EPs can easily be identified by their quirky physical characteristics, including their:\n\nSize – Any diehard Prince fan can tell you that great things come in small packages. Like singles, EPs are most frequently pressed onto 7-inch vinyl discs, the smallest of the standard sizes—although, in some exceedingly rare and magical cases such as Bon Iver’s Blood Bank , EPs can come on 10-inches. 1 Despite their small stature, you can still spin them on a standard record player, as long as you have an…\n\n– Any diehard Prince fan can tell you that great things come in small packages. Like singles, EPs are most frequently pressed onto 7-inch vinyl discs, the smallest of the standard sizes—although, in some exceedingly rare and magical cases such as Bon Iver’s , EPs can come on 10-inches. Despite their small stature, you can still spin them on a standard record player, as long as you have an… Adapter – Many EPs—especially older ones—don’t fit directly onto a standard record player’s spindle. While your not-so-ingenious friend may suggest wadding up paper and stuffing it in an EP’s oversized hole, without the proper attachment, you’re going to damage your vinyl and your turntable. 7-inch EPs need a small plastic adapter to function properly—and if they still sound funny with it on, that’s probably because you’re spinning them at the wrong speed.\n\n– Many EPs—especially older ones—don’t fit directly onto a standard record player’s spindle. While your not-so-ingenious friend may suggest wadding up paper and stuffing it in an EP’s oversized hole, without the proper attachment, you’re going to damage your vinyl and your turntable. 7-inch EPs need a small plastic adapter to function properly—and if they still sound funny with it on, that’s probably because you’re spinning them at the wrong speed. Spin rate – The speed at which a record turns on a player, or turntable speed, is measured in Revolutions Per Minute (RPM). The majority of 7-inches are pressed to spin at 45 RPM, hence their nickname 45s. Less commonly, EPs can be produced to turn at 33 1/3 RPM, but it’s not the industry standard.2\n\nThe unique properties of the 7-inch actually helped shape EPs as we know them. A standard 7-inch turning at 45 RPM can hold about six minutes of music per side—the perfect amount for a couple choice tunes from a mid-20th century crooner.2\n\nThus, since the 45 rose to prominence around 1950, they’ve always come packed with a few quick and killer songs. One thing that has changed about them, however, is how they’re viewed by the music industry.\n\nOriginally, 45s were seen as a form of competition to the standard full-length records (LPs) that we all know and love. The Battle of the Speeds pitted LP vs EP, and critics believed one format would emerge victorious over the other and become the go-to for the industry.2\n\nBut in the end, who won the epic war of EP vs LP?\n\nUltimately, the winners are all music fans—who now have two wonderful ways to enjoy new music and songs from their favorite artists.\n\nWhat is an LP?\n\nAn LP refers to a long-playing or long play record or a full-length album. When comparing an EP vs. LP, think of the EP record as a warm-up to the headlining performance, a musical appetizer to the main course. An LP album is typically between 10 to 12 tracks and anywhere from 30 to 50+ minutes long. Keep in mind when listening to music on vinyl, a record can only hold 40 minutes of music per side, which is why some extended track albums aren’t found on vinyl.\n\nFinally, when it comes to the difference between an EP vs LP vs album, LPs and albums are more often used interchangeably. For an EP, you may also find it referenced as a recording since an album represents a much longer body of work.\n\nWhat Makes Vinyl LPs Special?\n\nUnlike the term EP, people generally don’t refer to albums as LPs unless they’re pressed onto vinyl. Hence, LP is more of a name for the medium rather than a catch-all for full-length releases.\n\nStill, that doesn’t mean that all records pressed onto vinyl are LPs. Besides their longer track count, LPs can be distinguished from EPs by their:\n\n12 inches of glory – Sometimes, size really does matter. Not only does the larger surface mean more songs can be jammed onto an LP than an EP, but it also provides a larger canvas for artists to express themselves visually. Some LPs, such as Tool’s limited edition etched Fear Inoculum collection, use the vinyl’s surface as a medium for artistic expression as much as the music itself.\n\nSlow turning speed – Unlike EPs zipping away at 45 RPM, LPs spin at a more lackadaisical 33 1/3 RPM. There are 12-inch records that turn at 45 RPM, but rare Maxi Singles such as M83’s Go! are completely distinct entities from traditional LPs.\n\n– Sometimes, size really does matter. Not only does the larger surface mean more songs can be jammed onto an LP than an EP, but it also provides a larger canvas for artists to express themselves visually. Some LPs, such as Tool’s limited edition etched collection, use the vinyl’s surface as a medium for artistic expression as much as the music itself. – Unlike EPs zipping away at 45 RPM, LPs spin at a more lackadaisical 33 1/3 RPM. There are 12-inch records that turn at 45 RPM, but rare Maxi Singles such as M83’s are completely distinct entities from traditional LPs. Propensity to double up – Despite their increased length, some artists have more to say than one LP can handle. If there are two vinyls in one sleeve—such as The Cure’s Kiss Me, Kiss Me, Kiss Me—that's likely a double LP you’re holding. Of course, musical rules are made to be broken, and, in this case, Courtney Barnett’s A Sea of Split Peas is perhaps the most famous double-EP culprit.\n\nWhile certainly interesting to note, do all these distinctions between LP vs EP vs album really matter to anyone besides certified music nerds?\n\nYes, indeed, and they’re of particular importance to musicians themselves.\n\nWhy Does the Difference Between EP vs. LP Matter?\n\nTo the listener, the song length or number of tracks on a record may not matter as much on the surface. However, as you learn about different musicians and their creativity, you’ll understand it’s a big difference for them.\n\nFirst, organizing song tracks is an artistic choice. The sequencing is designed to channel a certain mood or vibe and give the listener an optimal experience. Conceptually, it’s similar to what goes into preparing a live music show.\n\nHave you ever noticed how most artists start and end with their most upbeat songs with a slower break in the middle to play any ballads, acoustic versions, or song covers they like to perform? This is one way to optimize the experience. When EPs were reserved for vinyl records only, the limited amount of space also made it crucial to time each song and maximize the effort.\n\nSecond, EPs have been a medium for artists to get their foot in the door with record label prospects and fans. Although today, big name artists often use EPs as a way to give their audiences bonus track songs on their full-length albums. It’s a way to provide deeper cuts or behind-the-scenes looks at the making of an album. Artists may share hidden bonus tracks that may have previously been on the cutting room floor. This gives EPs a special feel as an insight into the artist’s recording process and an encore to the album fans already know and love.\n\nWhen sorting through the records of popular artists or looking for new music to enjoy, consider the difference between EP vs LP and know that if there is a full-length album already released, you may be able to find an EP. Additionally, as a record collector, stumbling across a rare EP of an artist when they were first starting out can be a rare gem to add to your collection. Here are a few examples of EPs and albums from some of the world’s best known artists that we carry at Victrola.\n\nDuran Duran is arguably one of the ‘80’s biggest artists, riding the New Wave era of music. They’ve sold over 100 million records worldwide and have 30 Top 40 singles to their name.\n\nTheir No Ordinary Tour EP has three tracks: “Come Undone: Live,” “Notorious: Live,” and their most popular, “Hungry Like the Wolf: Live from Tower Records,” which was recorded in an intimate acoustic show in Hollywood, CA in 1993.\n\nThe only people in attendance for this exclusive performance were those who won tickets from a radio station contest. At the time, the No Ordinary Tour EP was given away as a free cassette to attendees. “Hungry Like a Wolf” then went on to be included on the band’s second studio album, Rio.\n\nThis five-track EP is a must-have for fans of the legendary Carlos Santana. The concept of the recording stemmed from the artist’s interaction with the famed Mona Lisa painting in Paris. Following his view, Santana created five songs for In Search of Mona Lisa that were written and produced by Santana and Narada Michael Walden. For listeners, it provided a unique artist insight into the place and memories of one of the world’s most notorious performers.\n\nBefore lead singer Karen O was beloved by screaming audiences, her band the Yeah Yeah Yeahs recorded its debut, self-released, five-song EP in 2001. It was the first production of the band, made up of Karen O’s notorious vocals, drums from Brian Chase, and guitar riffs by Nick Zinners. Their distinctive, driving, alternative garage sound was introduced through these early tracks, which eventually led them to the stardom they’ve reached today.\n\nWhen it comes to comparing EP vs LP vs album, Stevie Wonder’s 16th studio album, Innervisions, released in 1973 is considered one of the best records of his career. Though an LP, here is where he transitioned from his earlier, more romantic, pop sound from his earlier Motown days and began to explore societal issues at the time that are still prevalent today.\n\nHe incorporated these themes through his lyrics, instrumentation, and sounds, which are captured beautifully when listening to this album on vinyl. Two of the best-known tracks, “Living for the City” and “Higher Ground,” come in at 7:23 and 3:40, respectively, lengths familiar to the EP style. Stevie Wonder is an artist who’s adapted to the changing trends in the music industry and has taken parts from each decade and made them his own.\n\nJazz is arguably one of the best genres to listen to on vinyl since that’s where it originated. Charlie Parker is one of the world’s most well-known jazz musicians with several albums to his name.\n\nThe Immortal is a green-colored vinyl with bonus tracks that makes this a collector’s item for any longtime fan or even as a beginning album for those just getting into the genre. The vinyl LP music album was released posthumously and is a compilation of selections from five different recording sessions between 1944 and 1948. It contains previously unreleased alternate takes from these sessions.\n\nBeatlemania lives on with this special three-LP set of The Beatles recording music for a variety of radio shows throughout their career. It features an extensive 40 tracks, as well as live interviews with each member of the band.\n\nThough there are their most recognizable hits on the album, there are also song covers of rock and roll classics, as well as speech tracks of in-studio conversations capturing the banter between The Beatles and Saturday Club’s Brian Matthew. For Beatles fans, there’s no better gift than a rarity like On Air: Live at the BBC 2 to get a more intimate feel of their live performances.\n\nBefore Canadian superstar The Weeknd rose to international prominence, he kicked off his career with what, at that point, was considered a mixtape. Now, House of Balloons is noted as a seminal album in establishing the dark and foreboding tones that defined R&B throughout much of the 2010s.\n\nPressed onto a double LP, this is Abel Tesfaye as you’ve never heard him. Vinyl is the perfect medium to experience the eclectic samples and silky smooth singing that alerted listeners to The Weeknd in the first place. From the new-wave tones of the title track to the dark ethereality of The Party and the Afterparty, House of Balloons is the certified soundtrack of nocturnes and late-night contemplators everywhere.\n\nLegendary singer-songwriter Neil Young may be getting on in years, but this live EP proves his musical talents age like fine wine. Recorded in the sanctity of his own home, The Times was Neil’s attempt to comfort those suffering from loneliness and isolation during the height of the COVID-19 pandemic.3\n\nWith live performances of some of his most iconic songs, including Ohio, Alabama, and Southern Man, The Times is the kind of golden era Young to get nostalgic for. The quick collection of songs holds a welcome surprise as well, with a moving cover of Bob Dylan’s The Times They Are A-Changin sandwiched in the middle of Neil’s hits.\n\nFind your Next EP or LP with Victrola\n\nInterested in exploring the world of EP and LP records? Peruse Victrola’s record store and see which of your favorite artists may have EPs with tracks you’ve never heard of before or special performances that take you back to a different time. The way you hear a song on a studio album will be much different than how it’ll sound as a live performance or recording session.\n\nAnd still, how a song started as an EP recording may evolve into the full-length performance you’re familiar with today. The beauty of the differences between an EP vs. LP vs. album shows how expansive music is and how the same song can sound different when using different mediums and formats.\n\nSources:"}]}