{"Kévin Gameiro won the Ligue 1 title in 2013.": [{"url": "https://fbref.com/en/players/42276181/Kevin-Gameiro", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://amp.france24.com/en/live-news/20230527-%F0%9F%94%B4-psg-clinches-record-breaking-11th-french-league-title", "page_content": "World Cup winner Lionel Messi put PSG ahead from Kylian Mbappe's pass in the 59th minute. Former PSG striker Kevin Gameiro equalized for Strasbourg in the 79th.\n\nIt was Messi's 496th career league goal in Europe, breaking Cristiano Ronaldo's scoring record for Europe's top five leagues.\n\nLens secured second place and automatic entry into next season's Champions League by beating relegated Ajaccio 3-0 at home.\n\nDefending champion PSG overtook former French powerhouse Saint-Étienne, which won its 10th title in 1981 but was relegated to the second division last season.\n\nPSG has won nine of its 11 titles since Qatari backers QSI took charge 12 years ago, with the first of those in 2013. PSG's other titles were in 1986 and '94.\n\n(AP)"}, {"url": "https://www.france24.com/en/20130329-psg-montpellier-football-paris-france-beckham-gameiro-sport", "page_content": "FOOTBALL-LIGUE 1\n\nA late goal by striker Kévin Gameiro gave Ligue 1 leaders Paris Saint-Germain a 1-0 victory over Montpellier on Friday.\n\nAdvertising Read more\n\nParis Saint-Germain widened their comfortable lead at the top of France’s League 1 on Friday, overpowering title holders Montpellier 1-0 at home.\n\nThe victory should give PSG a burst of confidence for the first leg of their Champions League quarter-final against Barcelona on Tuesday.\n\nKévin Gameiro opened the score with 11 minutes left in the game, at the end of two sly passes from Jérémy Ménez and Zlatan Ibrahimovic.\n\nThe goal came just minutes after Gameiro and midfielder David Beckham took to the pitch. Fresh from a promotional tour in China, it was unclear if Beckham would play.\n\nMontpellier made a few, painful efforts to equalise with the clock winding down, but came up against a confident Paris defence.\n\nThe win helped PSG move eight points clear of second-placed Olympique Lyon, who play Sochaux on Sunday.\n\nUnderwhelming performance\n\n\n\nThe match was an underwhelming one before Gameiro brought the Parc des Princes to its feet by slipping the ball past Montpellier’s keeper.\n\nPSG dominated the midfield throughout the game, keeping their rivals on the defensive and giving them few opportunities in front of the goal, but the Parisian squad seemed unable to capitalise on their attacks. The Paris club only mustered three shots on target in the first half.\n\nMénez cried foul when he was clearly tripped up within the penalty box by Benjamin Stambouli 26 minutes into the match, but the referee disagreed.\n\nIn the second half PSG kept up the pressure, but some potentially dangerous shots sailed far from their target.\n\nMontpellier also staged a few exciting runs towards Salvatore Sirigu’s goal, but were never a real threat to the Paris goalie.\n\nDaily newsletterReceive essential international news every morning Subscribe"}, {"url": "https://www.pesmaster.com/gameiro/pes-2013/player/30323/", "page_content": "Kévin Gameiro PES 2013 Stats\n\nGameiro is a 25-year-old, 68-rated Center Forward from France. Kévin Gameiro plays for Ligue 1 team Paris Saint-Germain in Pro Evolution Soccer 2013.\n\nGameiro Nationality France Team Paris Saint-Germain League Ligue 1 Position CF Age 25 Stronger Foot Right Height 172 Weight 69 MLO yes Type Normal Positions LWF SS CF RWF LMF DMF CMF AMF RMF LB SW CB RB GK PAS SHT PHY DEF DRI SPD Ability Settings Technique C 78 Attack 37 Defence 79 Header Accuracy 79 Dribble Accuracy 78 Short Pass Accuracy 71 Short Pass Speed 79 Long Pass Accuracy 76 Long Pass Speed 80 Shot Accuracy 81 Place Kicking 79 Swerve 81 Ball Control 5 Weak Foot Accuracy 5 Weak Foot Usage 50 Goalkeeping Skills Speed B 90 Responsiveness 81 Explosive Power 83 Dribble Speed 76 Top Speed Physical C 72 Body Balance 79 Stamina 75 Kicking Power 75 Jump 3 Injury Resistance Resistance C 3 Atk Awareness 2 Def Awareness 5 Form 75 Tenacity 83 Teamwork Player Index S17 - Scissor Kick\n\nP12 - Goal Poacher Similar Players 63 A. Bueno 70 D. Cvitanich 67 Leguizamon 70 Marco Fabián 66 Belaustegui 68 Togglemejner 69 Higor 69 Moisés 76 Hugo Vieira 70 N. Roux\n\nComments\n\nPlease enable JavaScript to view the comments powered by Disqus.\n\nDisqus"}, {"url": "https://footystats.org/players/france/kevin-gameiro", "page_content": "Ligue 1 Stats for Kevin Gameiro General Total Per 90 Minutes Percentile Matches Played 34 N/A 89 Minutes 2102 62 min' per appearance 68 Annual Salary €1,680,000 N/A 87 Matches Started 23 N/A 65 Matches Subbed In 11 N/A Matches Subbed Out 1 N/A\n\nGoals and xG (Expected Goals) Goals, xG, Shots Total Per 90 Minutes Percentile Goals Scored 10 0.43 94 Goal Involvement 10 0.43 85 Goals at Home 5 0.4 91 Goals at Away 5 0.46 92 Expected Goals (xG) 7.80 0.33 93 Non-Penalty xG (npxG) 7.10 0.30 93 Penalties Scored 1 Hat-tricks 0 3 or More Goals 0 2 or More Goals 0 Minutes Per Goal 210 min' / goal Kevin Gameiro has scored 10 goals in 34 matches so far in the Ligue 1 2022/2023 season. 5 of the 10 goals were scored at home while he scored 5 goals at away games. Overall, Kevin Gameiro's goals scored per 90 minutes is 0.43. Moreover, Kevin Gameiro's total G/A (goals + assists) is 10 for this season. His goal involvement equates to 0.43 per 90 minutes. His Non-Penalty xG per 90 minutes is 0.30. This puts Kevin Gameiro's npxG output at 7.10 which puts him in the top 93 percentile of Ligue 1 players.\n\nShots Taken Shots Data Total Per 90 Minutes Percentile Shots Taken 36 1.54 80 Shots On Target 26 / 36 1.11 91 Shots Off Target 10 / 36 0.43 58 Hit The Woodwork 0 times 0.00 66 Shot Conversion Rate 27.78% 93 Shot Accuracy 72.22% 95 Shots Per Goal Scored 3.60\n\nKevin Gameiro has taken 36 shots in 34 matches so far in the Ligue 1 2022/2023 season. Of the 36 shots, 26 shots were on target and the other 10 shots were off target. That means that Gameiro's shooting accuracy is 72.22%. He scores a goal for every 3.60 shots he takes and takes 1.54 shots per 90 minutes on the pitch.\n\nAssists, Passing, & Chance Creation Stats Assists & Passing Total Per 90 Minutes Percentile Assists 0 0 40 Expected Assists (xA) 2.04 0.09 26 Passes 725 31.06 28 Successful Passes 584 / 725 25.02 33 Pass Completion Rate 80.55% 48 Key Passes 25 1.07 68 Crosses 20 0.86 49 Successful Crosses 8 / 20 0.34 62 Cross Completion Rate 40.00% 95 Minutes Per Assist No Assists Kevin Gameiro hasn't assisted any goals during this Ligue 1 season.\n\nDribbling & Offside Stats Dribbles & Offsides Total Per 90 Minutes Percentile Dribbles 41 1.76 64 Successful Dribbles 15 0.64 53 Dribble Success Rate 36.59% 20 Dispossesed 26 1.11 33 Offsides 4 0.17 72\n\nYellow Cards, Red Cards and Foul Stats Cards & Fouls Total Per 90 Percentile Yellow Cards 2 Red Cards 1 Total Cards 3 0.13 42 Minutes Per Booking 701 min' / card 73 Cards Over 0.5 1 3% 18 Fouls Committed 15 0.64 22 Fouled Against 15 0.64 31 Kevin Gameiro has received 2 yellow cards and 1 red cards in 34 matches so far in the Ligue 1 2022/2023 season. He commits 0.64 fouls per 90 minutes.\n\nDefending Stats Defending Total Per 90 or % Percentile Goals Conceded 33 1.41 38 Minutes Per Goal Conceded 64 min' 39 Clean Sheets 4 12% 13 Tackles 19 0.81 21 Interceptions 9 0.39 27 Ground Duels 172 7.37 26 Ground Duels Won 61 2.61 11 Aerial Duels Won 12 0.51 29 Dribbled Past 19 0.81 42 Clearances 0 0.00 2 Shots Blocked 1 0.04 26 Penalties Given Away 0 0.00 99"}, {"url": "https://www.ligue1.com/Articles/LEGENDS/2021/04/09/all-you-need-to-know-rc-strasbourg-alsace", "page_content": "HISTORY\n\nThe origins of the club are traced back to the Strasbourg district of Neudorf in 1906, when the city was part of the German Empire. As part of the territory of Alsace-Lorraine, it was annexed by Germany in 1871 following its victory in the Franco-Prussian War and only returned to France after World War I.\n\nIt was after that, in 1919, that the club known as FC Neudorf became RC Strasbourg Neudorf and then Racing Club de Strasbourg. Champions of Alsace three times in the 1920s, the club began to broaden its horizons. In 1933 they joined the national second division and a year later they were promoted to the fledgling top division. Strasbourg finished second and then third in their first two top-flight campaigns and have remained in the elite for most of their subsequent history, despite often turbulent times.\n\nThey emerged from the German occupation during World War II and finished third in the league in 1947, a year in which they also reached their second Coupe de France final, losing to Lille. In 1949 they finished second from bottom but were spared relegation because their Alsatian neighbours SR Colmar - who had finished higher up the table - gave up their professional status.\n\nFrom then until 1986, Strasbourg suffered five relegations but on each occasion returned to the top flight at the first attempt. They won their first major honour in 1951, beating US Valenciennes 3-0 in the Coupe de France final. In 1966 they won the trophy again, defeating FC Nantes in the final.\n\nChampions\n\nHowever the club rarely finished in the upper reaches in the league and they were relegated twice in the 1970s. Demoted in 1976, they returned to the elite in 1977 and finished third in their first season back. The 1978-79 campaign would go down in history as Racing won the league for the first and to date only time in their history. Coached by former player Gilbert Gress, a team featuring the likes of French international goalkeeper Dominique Dropsy, striker Albert Gemmrich, Raymond Domenech and Arsène Wenger finished two points clear of Nantes and AS Saint-Etienne, the two powerhouses of the era.\n\nThe golden era would be short-lived. In 1979-80 Strasbourg beat Start of Norway and the Czechs of Dukla Prague before losing to Ajax in the European Cup quarter-finals. Despite signing prolific Argentine striker Carlos Bianchi from Paris Saint-Germain, Racing dropped down to fifth and then seventh in the following two campaigns. They have not finished as high in the four decades since.\n\nCup success and European runs\n\nThe 1990s and early 2000s were marked by regular Cup runs, with Strasbourg losing the Coupe de France final to PSG in 1995 and then winning the Coupe de la Ligue in 1997 by defeating Girondins de Bordeaux on penalties. In 2001 they won the Coupe de France for the third time, although they needed penalties to get the better of third-tier Amiens SC in the final. There was another Coupe de la Ligue victory in 2005, when SM Caen were vanquished in the final at the Stade de France.\n\nThose successes opened the door to European runs. In 1997-98 they beat Rangers and Liverpool en route to the third round of the UEFA Cup, where they were narrowly beaten by the eventual tournament winners, the Internazionale of Brazilian superstar Ronaldo. They reached the UEFA Cup last 16 in 2005-06 before losing to Basel.\n\nLiquidation and the rise back through the divisions\n\nBy then the difficult times were setting in. Strasbourg were relegated that season. They made an immediate return to Ligue 1 but went back down again at the first time of asking in 2007-08 despite the emergence of a young talent called Kévin Gameiro, losing their last 11 league games. Two years later, in 2010, they dropped into the third tier for the first time in their history. In 2011 they were forced into liquidation and had to drop down into the regional fifth tier.\n\nFormer player Marc Keller took on the presidency of the club in 2012 with the backing of city and regional authorities. Strasbourg began the long climb back to the top, winning promotion to the third tier Championnat National in 2013 and then surviving there in 2014 only because of the financial difficulties of clubs above them. They returned to Ligue 2 in 2016 and came straight up to Ligue 1 in 2017. In 2019 they capped their rise back to the top level of the French game by winning the Coupe de la Ligue for the third time, beating EA Guingamp on penalties in the final in Lille.\n\nStrasbourg beat Guingamp to win the 2019 Coupe de la Ligue final\n\n\n\nCLUB COLOURS AND CREST\n\n‘Jetz geht’s los’\n\nStrasbourg wear blue shirts, white shorts and blue socks, while their away shirt is white. The club’s badge includes a red band and features the cathedral that is one of the main symbols of the city of Strasbourg. It also features a stork, one of the symbols of Alsace. Their 2020-21 shirts also feature the expression Jetzt geht’s los, a motto of encouragement in the local Alsatian dialect, next to a stork carrying the Coupe de France trophy, marking 70 years since they first won that particular piece of silverware.\n\nCLUB ICONS\n\nGilbert Gress\n\nGress was born in Strasbourg and started his playing career at his hometown team, spending seven years there and helping them win the Coupe de France in 1966. After a spell in West Germany with VfB Stuttgart he won two league titles and one Coupe de France with Olympique de Marseille before returning for two more years from 1973 to 1975. He returned again as coach in 1977, taking the team to promotion to the top flight and then leading them to their one and only league title in 1979. He later had two more spells as coach.\n\nDominique Dropsy\n\nThe French international goalkeeper played for the club for more than a decade, starring in the team that won the league in 1979. He also played for his country at the 1978 World Cup and later won two league titles at Bordeaux. Dropsy died in 2015 aged just 63.\n\nJacky Duguépéroux\n\nAs a player, Duguépéroux was a defender or midfielder who spent six years at Strasbourg culminating in their 1979 title-winning campaign. He later had four spells as coach, twice leading them to Coupe de la Ligue final victories and also taking them to a Coupe de France final in 1995.\n\nFrank Leboeuf\n\nA classy defender, Leboeuf played for the club from 1991 to 1996, featuring in their run to the 1995 Coupe de France final. He was sold to Chelsea and went on to star in London and in the France side that won the World Cup on home soil in 1998.\n\nRené Hauss\n\nAn Alsace native, Hauss holds the record for the most appearances in a Strasbourg shirt with more than 500. A right-back, he spent his entire playing career at the club from 1949 to 1967 and played in the Coupe de France-winning teams of 1951 and 1966, serving as captain in the latter. He later spent a season as coach before going on to win three Belgian titles in charge of Standard de Liège. Hauss died in December 2010 aged 82.\n\nOskar Rohr\n\nThe club’s record goal-scorer with 118, Rohr was a German international who played for Bayern Munich before moving to France in 1934 and spending five years at Strasbourg. In 1937 he scored in the Coupe de France final defeat by Sochaux and was the top scorer in the league with 30 goals in a 30-game season. He later played for FC Sète before being sent to a concentration camp and ending up on the Eastern Front in World War II. He survived and eventually died aged 76 in 1988.\n\nHONOURS\n\nFrench champions: 1979\n\nCoupe de France winners: 1951, 1966, 2001\n\nCoupe de la Ligue winners: 1997, 2005, 2019\n\nEUROPEAN RUNS\n\nEuropean Cup quarter-finalists : 1979-80\n\nInter-Cities Fairs Cup quarter-finalists : 1964-65\n\nUEFA Cup last 16 : 1978-79, 1997-98, 2005-06\n\nSTADIUM: Stade de la Meinau\n\nThe club started playing on the ground in 1914, when it was known as the Jardin Haemmerlé, but it only really began to take shape after World War I. The Stade de la Meinau hosted matches at the 1938 World Cup and again at the 1984 European Championship, by which time it had taken on its modern form. A record crowd of 44,766 watched West Germany play Portugal at Euro 84 but today capacity is reduced to 26,109. There are, however, plans in place to refurbish the stadium and raise capacity to 32,000 by 2025.\n\nDID YOU KNOW?\n\nThe atmosphere at the Stade de la Meinau is known as one of the best in France but it is enhanced by a tradition that was picked up across the border in Germany. When Strasbourg score a goal, the stadium announcer gives the first name of the player and the supporters add the second name. The announcer thanks them. His “Merci” is met with a giant “De Rien” (‘You’re welcome’) by the fans in unison. Stadium speaker Jean-Luc Filser explained in a 2017 interview with magazine So Foot that he was given the inspiration from watching a Bayern Munich game and enjoying how the fans and stadium speaker interacted.\n\n>> CLUB PROFILE: RC Strasbourg Alsace"}, {"url": "https://www.football-espana.net/2021/07/19/kevin-gameiro-completes-strasbourg-return-from-valencia", "page_content": "Former French international Kevin Gameiro has completed a full circle career move by returning to Strasbourg from Valencia.\n\nThe 34-year-old was released by Los Che as part of the move, to allow him to rejoin the Ligue 1 club on a free transfer, and sign a two year contract at Stade de la Meinau.\n\nGameiro had struggled to make a consistent impact at the Estadio Mestalla following his €16m move from Atletico Madrid ahead of the 2018/29 La Liga season.\n\n13 years since leaving the club that developed him, Kevin Gameiro has officially rejoined Racing on a two-year deal! Welcome home, @kevingameiro9 💙pic.twitter.com/IxlZ36Tx8U — RC Strasbourg English (@RCS_English) July 18, 2021\n\nAfter netting 19 goals across two seasons in Madrid he managed just 16 goals from three years in an injury disrupted stint in Valencia.\n\nHowever, despite his low key end to life in Spain, his time with Sevilla from 2013 to 2016 will go down as the most successful spell in his domestic career.\n\nHe won three consecutive Europa League titles in Andalucia as part of Unai Emery‘s dominant side before going on to win a fourth title at Atletico in 2018."}, {"url": "https://www.republicworld.com/sports-news/football-news/psg-secures-record-11th-ligue-1-title-with-draw-at-strasbourg-lens-finishes-2nd-articleshow.html", "page_content": "Paris Saint-Germain clinched a record 11th French league title after drawing 1-1 at Strasbourg on Saturday to move four points of second-place Lens with one game left.\n\nWorld Cup winner Lionel Messi put PSG ahead from Kylian Mbappe's pass in the 59th minute. Former PSG striker Kevin Gameiro equalized for Strasbourg in the 79th.\n\nIt was Messi's 496th career league goal in Europe, breaking Cristiano Ronaldo's scoring record for Europe's top five leagues.\n\nLens secured second place and automatic entry into next season's Champions League by beating relegated Ajaccio 3-0 at home.\n\nDefending champion PSG overtook former French powerhouse Saint-Étienne, which won its 10th title in 1981 but was relegated to the second division last season.\n\nPSG has won nine of its 11 titles since Qatari backers QSI took charge 12 years ago, with the first of those in 2013. PSG's other titles were in 1986 and '94.\n\n“This is of course an historic moment for Paris Saint-Germain. This 11th French league title is the reward for all the hard work we have put in over the last 12 years,” said PSG president Nasser al-Khelaïfi, who has been in control since 2011. “To make Ligue 1 history and overtake Saint-Etienne is a real source of pride.”\n\nThe title will be celebrated next Saturday at Parc des Princes when PSG hosts Clermont in what could be Messi’s last game for PSG. He has not taken up the option for an extra year on the contract he signed two years ago.\n\nMessi has felt the ire of PSG fans at times this season after his form dipped following his return from Argentina’s victory at the World Cup, and he was suspended by the club this month after an unauthorized trip to Saudi Arabia. But in the end it was his goal that allowed the fans to celebrate — and gave Messi a 43rd career major trophy for club and country.\n\nIt was a second league title for PSG coach Christophe Galtier, after he guided Lille to an against-the-odds success in 2021, when his side finished ahead of PSG."}, {"url": "https://www.sofascore.com/player/kevin-gameiro/3504", "page_content": "Kévin Gameiro is 36 years old (May 9, 1987), 172 cm tall and plays for Strasbourg.\n\nKévin Gameiro prefers to play with righ foot. His jersey number is 9.\n\nKévin Gameiro career statistics, match ratings, heatmap and goals are available on Sofascore for current and previous seasons. Last player match was Lorient - Strasbourg (2 - 1) and Kévin Gameiro received 6.2 Sofascore rating.\n\nIf Kévin Gameiro is going to be in Strasbourg lineup, it will be confirmed on Sofascore one hour before the match starts.\n\nIf Kévin Gameiro plays you will also be able to follow his live Sofascore rating, statistics and heatmap. Kévin Gameiro football player profile displays all matches and competitions with statistics for all the matches Kévin Gameiro played in. Most important stats for each competition, including average Sofascore rating, matches played, goals, assists, cards and other relevant data are also displayed."}, {"url": "https://footystats.org/players/france/kevin-gameiro", "page_content": "Ligue 1 Stats for Kevin Gameiro General Total Per 90 Minutes Percentile Matches Played 34 N/A 89 Minutes 2102 62 min' per appearance 68 Annual Salary €1,680,000 N/A 87 Matches Started 23 N/A 65 Matches Subbed In 11 N/A Matches Subbed Out 1 N/A\n\nGoals and xG (Expected Goals) Goals, xG, Shots Total Per 90 Minutes Percentile Goals Scored 10 0.43 94 Goal Involvement 10 0.43 85 Goals at Home 5 0.4 91 Goals at Away 5 0.46 92 Expected Goals (xG) 7.80 0.33 93 Non-Penalty xG (npxG) 7.10 0.30 93 Penalties Scored 1 Hat-tricks 0 3 or More Goals 0 2 or More Goals 0 Minutes Per Goal 210 min' / goal Kevin Gameiro has scored 10 goals in 34 matches so far in the Ligue 1 2022/2023 season. 5 of the 10 goals were scored at home while he scored 5 goals at away games. Overall, Kevin Gameiro's goals scored per 90 minutes is 0.43. Moreover, Kevin Gameiro's total G/A (goals + assists) is 10 for this season. His goal involvement equates to 0.43 per 90 minutes. His Non-Penalty xG per 90 minutes is 0.30. This puts Kevin Gameiro's npxG output at 7.10 which puts him in the top 93 percentile of Ligue 1 players.\n\nShots Taken Shots Data Total Per 90 Minutes Percentile Shots Taken 36 1.54 80 Shots On Target 26 / 36 1.11 91 Shots Off Target 10 / 36 0.43 58 Hit The Woodwork 0 times 0.00 66 Shot Conversion Rate 27.78% 93 Shot Accuracy 72.22% 95 Shots Per Goal Scored 3.60\n\nKevin Gameiro has taken 36 shots in 34 matches so far in the Ligue 1 2022/2023 season. Of the 36 shots, 26 shots were on target and the other 10 shots were off target. That means that Gameiro's shooting accuracy is 72.22%. He scores a goal for every 3.60 shots he takes and takes 1.54 shots per 90 minutes on the pitch.\n\nAssists, Passing, & Chance Creation Stats Assists & Passing Total Per 90 Minutes Percentile Assists 0 0 40 Expected Assists (xA) 2.04 0.09 26 Passes 725 31.06 28 Successful Passes 584 / 725 25.02 33 Pass Completion Rate 80.55% 48 Key Passes 25 1.07 68 Crosses 20 0.86 49 Successful Crosses 8 / 20 0.34 62 Cross Completion Rate 40.00% 95 Minutes Per Assist No Assists Kevin Gameiro hasn't assisted any goals during this Ligue 1 season.\n\nDribbling & Offside Stats Dribbles & Offsides Total Per 90 Minutes Percentile Dribbles 41 1.76 64 Successful Dribbles 15 0.64 53 Dribble Success Rate 36.59% 20 Dispossesed 26 1.11 33 Offsides 4 0.17 72\n\nYellow Cards, Red Cards and Foul Stats Cards & Fouls Total Per 90 Percentile Yellow Cards 2 Red Cards 1 Total Cards 3 0.13 42 Minutes Per Booking 701 min' / card 73 Cards Over 0.5 1 3% 18 Fouls Committed 15 0.64 22 Fouled Against 15 0.64 31 Kevin Gameiro has received 2 yellow cards and 1 red cards in 34 matches so far in the Ligue 1 2022/2023 season. He commits 0.64 fouls per 90 minutes.\n\nDefending Stats Defending Total Per 90 or % Percentile Goals Conceded 33 1.41 38 Minutes Per Goal Conceded 64 min' 39 Clean Sheets 4 12% 13 Tackles 19 0.81 21 Interceptions 9 0.39 27 Ground Duels 172 7.37 26 Ground Duels Won 61 2.61 11 Aerial Duels Won 12 0.51 29 Dribbled Past 19 0.81 42 Clearances 0 0.00 2 Shots Blocked 1 0.04 26 Penalties Given Away 0 0.00 99"}]}