{"Kévin Gameiro joined Atlético Madrid in 2017.": [{"url": "https://www.uefa.com/uefachampionsleague/news/022f-0e94a0aed76e-b07593df444e-1000--the-rise-of-atletico-madrid-signing-kevin-gameiro/", "page_content": "The 2015/16 campaign was when strikers around Europe thrust themselves into the limelight.\n\nAthletic Club's Aritz Aduriz registered 36 goals in all competitions at the age of 35 and former non-league forward Jamie Vardy spearheaded Leicester City's barely believable march to the Premier League title.\n\nIn southern Spain, meanwhile, Sevilla's Kevin Gameiro took up the mantle from the departed Carlos Bacca, scoring a career best 29 goals.\n\nGameiro – who struck in every round as his club won the UEFA Europa League for an unprecedented third successive season – today joined Atlético Madrid on a four-year contract subject to a medical. UEFA.com reviews his career to date.\n\nEarly promise and pain\n\nGameiro, 29, makes no bones about the fact he always thought he would be a footballer when he roamed the streets of his home town of Senlis, on the outskirts of Paris, dreaming of emulating his idol Ronaldo. He started realising that dream in the reserves at Strasbourg aged 16, making his senior debut in Ligue 1 barely a year later.\n\nHe scored his first professional goals in a dramatic UEFA Cup game against Crvena zvezda in December 2005, two late headers salvaging a 2-2 draw. A dream first season had a nightmare ending, however, as Gameiro ruptured knee ligaments and missed the remainder of the campaign, which ended with Strasbourg relegated.\n\n©AFP/Getty Images\n\nA lust for goals\n\nIt was not until he switched to Lorient in June 2008 that Gameiro realised his true potential, posting 11 league goals in his first season, 17 in his next and 22 in his third and final term with the Brittany team.\n\nThat convinced Paris Saint-Germain to swoop in summer 2011, Gameiro joining the club he had supported as a boy. A runners-up finish behind Montpellier was followed by the Parc des Princes outfit winning the title in 2012/13, when Gameiro, in a reduced role, still managed an impressive eight goals in seven league starts.\n\nMaking Sevilla his home\n\nHungry for regular football, Gameiro succumbed to the advances of Sevilla, who tried to sign him a year earlier, in July 2013. Though he started fewer games than Bacca, Gameiro outscored his strike partner with 21 goals in his first campaign and converted the decisive penalty against Benfica in the UEFA Europa League final.\n\n©Getty Images\n\nSeventeen goals and another UEFA Europa League triumph followed the next season, but it was not until Bacca left for Milan that Gameiro showed his true worth. Gameiro gave a simple explanation for his most fruitful season, telling UEFA.com: \"The most important thing as a striker is to be confident. This season I feel completely confident and everyone trusts me.\"\n\nIf Gameiro can maintain that level of belief at Atlético, the Rojiblancos will have made some signing."}, {"url": "https://www.intothecalderon.com/2017/10/4/16391812/kevin-gameiros-disappearing-act-atletico-madrid-la-liga", "page_content": "These are strange, new times at Atlético Madrid. Diego Simeone is embracing rotation like never before — and for the second consecutive season, Atlético are unbeaten in LaLiga entering the second international break. However, the increasing dependence/reliance on youth and squad depth has had a couple hiccups. It’s also come at a price for Atleti’s older players, including Gabi (has started five of nine games in all comps), Diego Godín (has already missed three games) and Juanfran (just three league starts).\n\nThe most curious casualty thus far, though, has to be Kévin Gameiro.\n\nIn July 2016, Gameiro arrived in Madrid as Simeone’s Plan B, once it became clear Chelsea would not sell Diego Costa. The France international went on to produce a wildly inconsistent season in red and white; he was at times brilliant, forming an excellent partnership with compatriot Antoine Griezmann. But there were the patches of invisibility and the inability to take chances when the business end of the season came along (I need not remind you of the glorious chance he blew in the Champions League semifinal first leg). Gameiro could not escape the “enigmatic“ tag — in hindsight, maybe it wasn’t a great idea to spend €32 million-plus on a slight-of-build forward who has scored three times in 17 UCL appearances and who hasn’t scored 20-plus league goals in six years.\n\nStill, Gameiro is a fine striker. He did score a dozen league goals last season. He’s blazing fast and has undeniable chemistry with Griezmann; only Grizi created more goals between LaLiga and the Champions League than Gameiro’s 20. You could do worse than him — in fact, Simeone already is, by playing Luciano Vietto over him.\n\nVietto has made five starts already this season and has yet to score. Despite an improved work ethic (nearly two tackles per 90 minutes), he looks the same awkward fit he was in Simeone’s team two years ago. El Cholo has him, so he has to use him, but Vietto has failed to last more than 65 minutes in any appearance and Atlético have been held to a goalless draw in three of the 23-year-old’s past four starts — in one of those starts, against AS Roma, he missed a golden opportunity 1v1 to put his side ahead.\n\nYou could do worse than Gameiro — in fact, Simeone already is, by playing Luciano Vietto over him.\n\nGameiro, meanwhile, has made just two substitute appearances for a total of 27 minutes: he played 18 minutes of the 0-0 draw at Valencia and nine minutes in the 2-0 win vs. Sevilla. He has yet to share the pitch with Griezmann or attempt a shot.\n\nGriezmann and Ángel Correa are Atlético’s two best forwards — that’s not debatable. But what IS debatable is El Cholo’s decision to give Vietto burn while Gameiro sits on the bench. It perhaps has something to do with the 30-year-old’s reported decision to go on summer holiday rather than get a groin operation, which led to him missing the season’s first two weeks. That could have soured his relationship with the coach — who had already told him he wasn’t his first choice — and it’s undoubtedly given rise to rumors that Everton will launch a bid for Gameiro when the transfer window reopens in January.\n\nBut there’s a long way to go between now and then. The “if you have him, you may as well use him” philosophy is the main reason why Vietto has featured so often over the season’s first six weeks — and by extension, it is a reason why Atlético have scored just five goals in the past five league contests. The situation has to be the same for Gameiro as Atlético look for a solution to these recent attacking woes.\n\nWhat do you think? Does Gameiro deserve more playing time? Sound off in the comments!"}, {"url": "https://www.pesmaster.com/k-gameiro/pes-2017/player/30323/", "page_content": "Kévin Gameiro PES 2017 Stats\n\nK. Gameiro is a 29-year-old, 83-rated Center Forward from France. Kévin Gameiro plays for Spanish League team Club Atlético de Madrid (Atlético de Madrid) in Pro Evolution Soccer 2017.\n\nK. Gameiro Nationality France Team Atlético de Madrid League Spanish League Position CF Age 29 Stronger Foot Right Height 172 Weight 69 MyClub yes Type Normal Positions LWF SS CF RWF LMF DMF CMF AMF RMF LB CB RB GK PAS SHT PHY DEF DRI SPD Ability Settings 87 Attacking Prowess 82 Ball Control 80 Dribbling 79 Low Pass 73 Lofted Pass 85 Finishing 55 Place Kicking 75 Swerve 69 Header 54 Defensive Prowess 49 Ball Winning 76 Kicking Power 85 Speed 87 Explosive Power 80 Body Control 74 Physical Contact 77 Jump 40 Goalkeeping 40 Catching 40 Clearing 40 Reflexes 40 Coverage 82 Stamina 1 Weak Foot Use 2 Weak Foot Accuracy 5 Form 2 Injury Resistance Playing Style Goal Poacher Player Skills Acrobatic Finishing Track Back Super-sub COM Playing Styles Mazing Run Speeding Bullet Incisive Run Similar Players 85 M. Salas 80 Lucas Pérez 83 W. Ben Yedder 77 M. Gabbiadini 80 I. Perišić 78 A. Peters 83 Nolito 84 C. Bacca 84 A. Lacazette 79 L. Rémy\n\nKévin Gameiro PES 2017 Stats\n\nK. Gameiro is a 29-year-old, 83-rated Center Forward from France. Kévin Gameiro plays for Spanish League team Club Atlético de Madrid (Atlético de Madrid) in Pro Evolution Soccer 2017.\n\nComments\n\nPlease enable JavaScript to view the comments powered by Disqus.\n\nDisqus"}, {"url": "https://www.theguardian.com/football/2016/jul/30/atletico-madrid-kevin-gameiro-signs-sevilla-la-liga-france-transfer", "page_content": "The France striker Kevin Gameiro has joined Atlético Madrid on a four-year deal from fellow La Liga side Sevilla, last season’s Champions League finalists announced on Saturday.\n\nGameiro, 29, scored 67 goals in three years at Sevilla and though no financial details of the transfer were released, media reports suggested Atlético signed the France forward for an initial fee in the region of £28m (€32m).\n\n“Atlético Madrid and Sevilla FC have reached an agreement for the transfer of Kevin Gameiro to our club. The striker, who will sign for four seasons, will travel to Madrid this evening,” Atlético said in a statement. “The transfer is contingent to the French player successfully undergoing a medical examination.”\n\nGameiro’s arrival is also likely put an end to Atlético’s hopes of re-signing the striker Diego Costa from Chelsea. “Diego Costa is our player,” the Chelsea manager, Antonio Conte, said this month. “He’s a fantastic player with fundamental importance. He’s very happy and is working hard.”\n\nMeanwhile, the Atlético forward Luciano Vietto has moved in the opposite direction by joining Sevilla on a season-long loan, with the Europa League champions having the option of reaching a permanent deal during the next summer transfer window.\n\nAtlético Madrid finished third in La Liga last term and begin the new season at home against Deportivo Alavés on 21 August."}, {"url": "https://www.intothecalderon.com/2017/2/18/14656996/sporting-gijon-1-4-atletico-madrid-kevin-gameiro-steals-the-show", "page_content": "Kévin Gameiro came off the bench to record the fastest Liga Santander hat trick in more than 20 years, which in turn carried Atlético Madrid to a 4-1 victory over relegation candidates Sporting Gijón on Saturday afternoon.\n\nGameiro entered the game just after the hour for Fernando Torres, but his impact was felt most inside the final 10 minutes, when he registered a hat trick in 4:44, the quickest time in a LaLiga match since 1995. The trio of goals made comfortable what had been a very difficult game for Atlético, which earned its first win at El Molinón since 2008.\n\nWith the Champions League looming, Diego Simeone chose to rotate comparatively little. Ángel Correa was handed his first league start of 2017 and Šime Vrsaljko stepped into the XI to replace the injured Juanfran. Lucas Hernández and Stefan Savić retained their places as the two center backs with Diego Godín and José Giménez on the mend.\n\nThe first half was an intense affair with little good football that was dominated by Sporting. Rubi’s side set up in a 4-5-1, which stifled Atlético’s attacking 4-3-3 and controlled the midfield. Lacina Traore - all 6’8’’ of him - was a handful for Atleti’s defenders, who also struggled to track left winger Burgui’s super runs near the penalty area. Sporting received a handful of corners that went for nought, and the first 45 minutes petered out into a goalless stalemate.\n\nThat stalemate would end very quickly in the second half. Immediately off the restart, Gabi played a long ball to Torres, who headed down for a charging Yannick Carrasco. The Belgian’s shot was mostly saved by Iván Cuéllar, but Carrasco fired in from a couple yards to make sure his goal counted. Atlético had the lead.\n\nHowever, the 1-0 advantage would last only three minutes. Burgui, unmarked, crossed into the box and the ball fell for Sergio Álvarez. The ensuing shot pinballed off Filipe Luís and past a well-positioned Savić into the net to level the scores with essentially an entire second half to play.\n\nSporting looked set to resume its dominance from the first half and looked the more likely side to go ahead 2-1 until Simeone went to his substitutes. In the 61st minute, El Cholo inserted Gameiro and Saúl Ñíguez for Torres and Correa, and in the 68th minute Carrasco made way for Thomas Partey. With Gabi and Saúl in the middle and Koke and Thomas on the flanks, Atlético’s midfield went from liability to supercharged death machine. Antoine Griezmann had a goal wrongly ruled out 15 minutes from time, but that moment made it clear that Atleti had steered the game where it needed to be.\n\nAt 79:34, the French Connection would link up to restore the lead. Griezmann slipped through a sensational pass to Gameiro, who rounded Cuéllar to finish expertly with his left foot. That goal likely would have been enough to seal the three points, but Gameiro was not close to done yet. At 80:53, Gameiro scored his second with the right foot after Thomas knocked down a pass intended for Sporting center back Fernando Amorebieta and the ball pinged straight into the Frenchman’s path. Finally, at 84:18, Gameiro latched onto a pinpoint Griezmann long ball, and with the flag down, coolly completed his hat trick with a clean right-footed strike. With that, Sporting had been opened up and put to the sword, and Atlético saw out the win from there.\n\nThe hat trick put a fair helping of gloss onto what had been a nearly 80-minute struggle for los colchoneros, but the three points nonetheless extended Atleti’s unbeaten run in LaLiga to eight games. Gameiro and Griezmann are now tied for fifth in the Pichichi race with nine goals apiece, and Griezmann is on six assists, which gives him the third-highest total in the league. Atleti will fly to Germany on Monday secure in the knowledge that fourth place remains in safe hands for another week, as the Champions League shoots again to the forefront."}, {"url": "https://en.atleticodemadrid.com/noticias/agreement-with-sevilla-fc-for-the-transfer-of-kevin-gameiro", "page_content": "HE WILL SIGN FOR FOUR SEASONS Agreement with Sevilla FC for the transfer of Kevin Gameiro The French striker has played the last three seasons in the team from Sevilla with which he has scored 67 goals and given 17 assists in three seasons.\n\nAtlético de Madrid and Sevilla FC have reached an agreement for the transfer of Kevin Gameiro to our club. The striker, who will sign for four seasons, will travel to Madrid this evening. The transfer is contingent to the French player successfully undergoing the medical examination.\n\nGameiro (Senlis, France, 9th May, 1987) made his debut with Racing Strasbourg in the French Ligue 1 in 2005. In 2008, he signed with FC Lorient with which he would score 56 goals in three seasons, an effectiveness that would catch the attention of PSG and make him debut with the French senior national team. After two seasons in the Parisian club, with which he scored 23 goals, he came to Sevilla.\n\nIn the Sevillian squad, Gameiro was key in the winning of three Europa Leagues. In total, the French international scored 67 goals and gave 17 assists in three seasons to become one of the more destabilising strikers of LaLiga.\n\n\n\nJosé Luis Pérez Caminero analysed the signing of Gameiro from Australia. For Atlético’s Sporting Director, this is \"great news, since he is a reinforcement that will allow us to increase the competitiveness in the offensive part of the group. He is a very fast player, a great finisher and has been competing for several years in the Spanish League, so his adaptation will be easier. He is a forward used to pressuring the rival’s attack and tireless in his effort, so he fits perfectly into what we wanted to strengthen our attack.\"\n\nThe club wishes him the best in this new professional stage as an Atlético. #WelcomeGameiro!"}], "Kévin Gameiro moved to Valencia in 2018.": [{"url": "https://www.egypttoday.com/Article/8/55844/Gameiro-switches-from-Atletico-to-Valencia", "page_content": "Soccer Football - International Champions Cup - Atletico Madrid v Arsenal - Singapore National Stadium, Singapore - July 26, 2018 Arsenal's Rob Holding in action with Atletico Madrid's Kevin Gameiro REUTERS/Edgar Su\n\nVALENCIA, Spain - 13 August 2018: French striker Kevin Gameiro is set to join Valencia from La Liga rivals Atletico Madrid after the two clubs struck a deal on Sunday.\n\n\n\n\"Valencia CF have reached an agreement with Atletico Madrid, which still needs to be formalised, for the transfer of Kevin Gameiro,\" said a statement from Valencia, who finished fourth in La Liga last season and will compete in the Champions League group stage.\n\n\n\nGameiro, 31, struck 27 goals and provided 11 assists in 83 games in all competitions for Atletico, having joined the Madrid side from Sevilla in 2016 for a reported 27 million euros ($30.81 million). His presence in the team faded after January, however, when Diego Costa was free to play after rejoining the club.\n\n\n\nGameiro lifted one trophy during his time at Atletico, the 2018 Europa League, although he was an unused substitute in the 3-0 win over Olympique de Marseille in the final.\n\n\n\nGameiro is the second striker Valencia have picked up in three days following the acquisition of Belgium international Michy Batshuayi on loan from Chelsea on Friday."}, {"url": "https://en.as.com/en/2018/08/13/soccer/1534184042_708532.html", "page_content": "Kevin Gameiro has been presented as a Valencia player after completing his move from Atlético Madrid and is aiming to make his debut against his former club.\n\nThe France international initially joined Atlético in 2016 after impressing at Sevilla, but he was rarely considered first-choice despite costing them a reported 32 million euros at the time.\n\nHe made just 11 starts in LaLiga last term, though he still managed to score seven times as Diego Simeone's men finished second to Barcelona in Spain's top tier.\n\nAlthough Gameiro was considered a viable option both out wide and in attack, the pre-season arrivals of Gelson Martins, Nikola Kalinic and Thomas Lemar saw him fall even further down the pecking order, and Atlético have managed to recoup 16m euros for the 31-year-old.\n\nGameiro deal follows loan capture of Chelsea's Batshuayi\n\nGameiro has become Valencia's second attacking reinforcement in quick succession following the loan arrival of Michy Batshuayi and he plans to be available to face Atlético as his new side get their LaLiga campaign started on 20 August.\n\nSays he'll \"perhaps\" be able to make Los Che bow against Atleti\n\n\"Perhaps,\" Gameiro told a news conference when asked if he will be ready for the visit of Atlético. \"I have a little time left to get there [in terms of fitness]. I have a week to be here and prepare for the game.\"\n\nAccording to speculation, Simeone and Atlético were reluctant to sell Gameiro, particularly to a team which will likely be a direct rival of theirs in the top four this season.\n\nStriker determined to repay Marcelino confidence\n\nBut in securing the switch, Gameiro finds himself somewhere he has wanted to be for quite some time.\n\n\"It was not easy, but as the president has said, it has long been clear in my head [that he wanted to join Valencia],\" Gameiro said. \"Now I'm here and I'm very happy.\n\n\"A long time ago I wanted to come here, but because of club problems it couldn't be. Then there was no option and I went somewhere else.\n\n\"The coach [Marcelino García Toral] told me that he wanted to work with me for a long time. When the coach tells you that, it gives you a lot of confidence to come. I will work hard to try to do many great things here.\"\n\nGameiro has signed a three-year deal at Valencia."}, {"url": "https://www.espn.com/soccer/soccer-transfers/story/3594426/atletico-madrid-and-valencia-reach-agreement-on-kevin-gameiro-transfer", "page_content": "Kevin Gameiro will leave Valencia after two seasons at Atletico Madrid. Paul Miller/Getty Images for ICC\n\nKevin Gameiro is set to join Valencia from Atletico Madrid after the two clubs reached a deal on Sunday.\n\nGameiro, 31, will move for €16 million, according to multiple reports, and is expected to undergo a medical and sign a contract on Monday before a formal presentation.\n\nHe became surplus to requirements at Atletico after they signed Nikola Kalinic from AC Milan last week, but the transfer was held up as the teams negotiated terms.\n\nGameiro, who moved to Atletico from Sevilla in 2016 for a reported €27m, scored 11 goals in 36 games in all competitions last season.\n\nHis role in the team diminished after January, however, when Diego Costa rejoined the club.\n\nGameiro is the second striker Valencia have picked up in the last three days after they added Belgium international Michy Batshuayi on loan from Chelsea on Friday.\n\nValencia are also close to finalising a deal for Paris Saint-Germain winger Goncalo Guedes, sources have told ESPN FC, after he spent last season on loan at the club."}, {"url": "https://www.espn.com/soccer/soccer-transfers/story/3594426/atletico-madrid-and-valencia-reach-agreement-on-kevin-gameiro-transfer&lang=en", "page_content": "Kevin Gameiro will leave Valencia after two seasons at Atletico Madrid. Paul Miller/Getty Images for ICC\n\nKevin Gameiro is set to join Valencia from Atletico Madrid after the two clubs reached a deal on Sunday.\n\nGameiro, 31, will move for €16 million, according to multiple reports, and is expected to undergo a medical and sign a contract on Monday before a formal presentation.\n\nHe became surplus to requirements at Atletico after they signed Nikola Kalinic from AC Milan last week, but the transfer was held up as the teams negotiated terms.\n\nGameiro, who moved to Atletico from Sevilla in 2016 for a reported €27m, scored 11 goals in 36 games in all competitions last season.\n\nHis role in the team diminished after January, however, when Diego Costa rejoined the club.\n\nGameiro is the second striker Valencia have picked up in the last three days after they added Belgium international Michy Batshuayi on loan from Chelsea on Friday.\n\nValencia are also close to finalising a deal for Paris Saint-Germain winger Goncalo Guedes, sources have told ESPN FC, after he spent last season on loan at the club."}, {"url": "https://www.marca.com/en/football/spanish-football/2019/06/08/5cfb925746163f9e468b45e7.html", "page_content": "Kevin Gameiro to stay at Valencia LaLiga Only striker certain to remain\n\nKevin Gameiro is the only forward in the Valencia squad who the club aren't considering selling.\n\nThere were rumours linking the Frenchman with a move away earlier in the season, but he has become an integral part in Marcelino's side over the last few months.\n\nHis goal in the Copa del Rey final against Barcelona proved that Los Che can rely on him to lead the line during the next campaign.\n\nHowever, the same can't be said about Gameiro's other three strike partners.\n\nFrom what Valencia's president and coach have said, it seems like Rodrigo Moreno will be sold this summer if the right offer comes in.\n\nThere is serious interest from Napoli, while Barcelona and Atletico Madrid have also been linked with a move for the Spanish international.\n\nSanti Mina is another frontman that could be leaving the Estadio Mestalla. Celta Vigo want to bring him back to Balaidos as part of any deal that would see Maxi Gomez move the other way.\n\nNegotiations between the two clubs are ongoing and Mina is ready to go back to the club where he started his career.\n\nThe other striker in the squad is Ruben Sobrino. The Spaniard arrived at the Mestalla for four million euros in January but has seen his opportunities to play limited under Marcelino.\n\nHe has played just 192 minutes in LaLiga Santander for Los Che, but has had more game time in the Europa League which included a goal against Celtic.\n\nGameiro is a winner\n\nSince 2014, Gameiro has finished every season apart from one - at Atletico Madrid - with a medal around his neck.\n\nHe won the Europa League three times with Sevilla and once with Atletico, and has now added the Copa del Rey to his medal collection."}, {"url": "https://www.football-espana.net/2021/07/19/kevin-gameiro-completes-strasbourg-return-from-valencia", "page_content": "Former French international Kevin Gameiro has completed a full circle career move by returning to Strasbourg from Valencia.\n\nThe 34-year-old was released by Los Che as part of the move, to allow him to rejoin the Ligue 1 club on a free transfer, and sign a two year contract at Stade de la Meinau.\n\nGameiro had struggled to make a consistent impact at the Estadio Mestalla following his €16m move from Atletico Madrid ahead of the 2018/29 La Liga season.\n\n13 years since leaving the club that developed him, Kevin Gameiro has officially rejoined Racing on a two-year deal! Welcome home, @kevingameiro9 💙pic.twitter.com/IxlZ36Tx8U — RC Strasbourg English (@RCS_English) July 18, 2021\n\nAfter netting 19 goals across two seasons in Madrid he managed just 16 goals from three years in an injury disrupted stint in Valencia.\n\nHowever, despite his low key end to life in Spain, his time with Sevilla from 2013 to 2016 will go down as the most successful spell in his domestic career.\n\nHe won three consecutive Europa League titles in Andalucia as part of Unai Emery‘s dominant side before going on to win a fourth title at Atletico in 2018."}, {"url": "https://www.intothecalderon.com/2018/8/3/17645814/reports-borussia-dortmund-all-in-kevin-gameiro-atletico-madrid-valencia-la-liga", "page_content": "As successful as Atlético Madrid’s summer has been to this point, there remains work to be done before the window closes on Sept. 1. Atlético have to finalize a couple more exits after Šime Vrsaljko completed a move to Inter Milan on Tuesday, and the next players mooted to leave are forwards Luciano Vietto and Kévin Gameiro.\n\nWhile Vietto’s market has just about dried up and it appears he will have no choice but to stay in Madrid until January, Gameiro finds himself in a tug-of-war. Valencia and now Borussia Dortmund are fighting for his services.\n\nCadena SER Valencia on Wednesday and Marca on Thursday both claimed that Dortmund have emerged as a surprise candidate to land Gameiro. Lucien Favre is believed to want the player and BVB have launched a €23 million bid in an effort to bring in the Frenchman. Gameiro and los Che agreed a three-year contract with a huge pay cut some weeks ago, and it was thought Atlético had closed an agreement. However, Atlético have yet to secure a replacement, and the delay in acquiring him (“him” likely being Nikola Kalinić) has allowed BVB to sneak in with a late offer.\n\nDue to that bid, it is said that los rojiblancos want Valencia to pony up €20 million (rather than €14 million with variables) in order to finalize the transfer. Gameiro has been an objective at Mestalla for most of the summer and the reports say he has no interest in moving to the Bundesliga. The 31-year-old currently is without a squad number after Lucas Hernández received his #21 shirt and Diego Simeone considers him surplus to requirements after two hit-or-miss seasons in the capital. It is still expected that the veteran forward will get his move to Marcelino’s side, but it will involve a few million more euros.\n\nThen again, one only has to go back to 2016 to remember how a slam-dunk transfer out of Atleti went horribly, horribly wrong."}, {"url": "https://en.as.com/en/2018/07/22/soccer/1532263739_007437.html", "page_content": "Kevin Gameiro maybe physically in Madrid but his mind is already in Valencia. And in the meantime, Valencia are patiently waiting for him in their Swiss summer base camp in Crans-Montana. In the back rooms at Mestalla, it's taken as read that Gameiro will joining them - and the club is convinced that the French striker will be excluded when Diego Simeone names his squad for the upcoming trip to Singapore tomorrow.\n\nFull screen Gameiro and Rodri in training last week JESUS ALVAREZ ORIHUELA DIARIO AS\n\nAgreement in place with Gameiro\n\nGameiro, who has spent the last coupke of days training apart from his team mates at the Cerro del Espino, reached an agreement to join Valencia weeks ago. Valencia will pay a fee of around 15 million euros plus add-ons for the France international who has agreed to take a pay cut but has been offered a longer contract at Mestalla.\n\nFull screen RAFA APARICIO DIARIO AS\n\nDiakhaby, Racic, Kondogbia, Wass, Piccini... and Gameiro\n\n\n\nIf all goes to plan, Gameiro will become Valencia's sixth reinforcement of the summer. El Cholo has delayed his departure until Atlético secure a replacement. Part of the delay has been because AC Milan have pulled the plug on Nikola Kalinic's proposed move to Atlético, which has forced the Rijiblancos to turn their attentions to Olivier Giroud."}, {"url": "https://www.footballtransfers.com/en/players/kevin-gameiro", "page_content": "Kévin Gameiro (FRA) is a a shadow striker and currently plays for Strasbourg. Kévin Gameiro is 36 years old (1987/05/09) and he is 172cm tall. His preferred foot is Right. His jersey number is 9.\n\nKévin Gameiro's current transfer value is between €1.1M and €1.9M. His last transfer was from Valencia to Strasbourg in 2021. Strasbourg got Kévin Gameiro for free.\n\nKévin Gameiro latest transfers and transfer rumours, season statistics and career statistics are available on FootballTransfers."}, {"url": "https://www.theguardian.com/football/2016/oct/07/world-cup-2018-qualifiers-roundup-gameiro-france-bulgaria-holland", "page_content": "France produced a scintillating show as they put memories of one of the most painful moments in their football history to one side by crushing Bulgaria 4-1 in a World Cup Group A qualifier.\n\nLes Bleus had not hosted Bulgaria since the infamous qualifier in November 1993 when they conceded a late goal to lose 2-1, a defeat that meant they missed out on a place at the 1994 World Cup in the United States.\n\nThe home side trailed again at the Stade de France on Friday after conceding an early penalty but bounced back by taking control of the midfield and breaching a porous defence almost at will.\n\nGoals from Kévin Gameiro, Dimitri Payet and Antoine Griezmann put them 3-1 up at the break. Gameiro, stylishly celebrating his first international for five years, then completed the scoring with his second goal of the night in the 59th minute.\n\nFrance, with four points from two games, are joint top of the group alongside Holland and Sweden. Bulgaria occupy fourth position on three points.\n\nQuincy Promes scored two early goals to set Holland on their way to a 4-1 victory over Belarus and end a miserable run of home form. Davy Klaassen and Vincent Janssen added two more in the second half as the Dutch, who finished third at the last World Cup in Brazil but failed to qualify for Euro 2016, ended an unprecedented run of five successive home defeats stretching back 16 months.\n\nPromes’ opener in the 14th minute marked his first international goal as he hit the ball through the legs of three defenders. He added a second 15 minutes later with a strong finish from the edge of the penalty area. Belarus threatened with two good chances before the break and then scored straight after it with Sergei Kornilenko’s strong run setting up Aleksey Rios for a close-range finish.\n\nBut the Dutch quickly restored their two-goal advantage in the 54th minute as Klaassen tapped home the rebound after Belarus had lost possession on the edge of their own area. Janssen struck the woodwork but found the net with a thunderous left-foot shot as the Dutch moved to four points from their opening two qualifiers after a draw in Sweden last month. They host France in Amsterdam on Monday.\n\nSweden remain unbeaten after their first two matches thanks to Mikael Lustig’s second-half winner in Luxembourg. The Celtic defender’s half-volley from Marcus Berg’s corner was the only goal of the game.\n\nBelgium hammered Bosnia-Herzegovina 4-0 for their second straight World Cup qualifying win under Roberto Martínez, brushing off injuries to lead Europe’s Group H. The European Championship quarter-finalists exposed weaknesses in a Bosnian defence that buckled in the 26th minute when Emir Spahic scored an own-goal.\n\nTwo minutes later a gifted touch from Dries Mertens found Eden Hazard, who ran by defenders and chipped the ball past the goalkeeper, Asmir Begovic.\n\nThe normally well-composed Bosnians were forced into spells of panic defending and Toby Alderweireld made it 3-0 on the hour. Besieged by five Bosnian players, Romelu Lukaku swung in the fourth.\n\nBelgium are level on points with Greece, who defeated a hard-working Cyprus 2-0 to continue their recovery under their new coach, Michael Skibbe.\n\nValentin Stocker came off the bench to score in the last minute and give Switzerland a 3-2 win away to Hungary after Adam Szalai had twice equalised for the hosts. Switzerland struggled to get going in the first half without the suspended Arsenal midfielder Granit Xhaka, who usually dictates the rhythm in midfield. But Haris Seferovic, the striker widely criticised for his performances at Euro 2016 when he failed to score a goal, put the Swiss in front six minutes after half-time, scoring from a rebound after Xherdan Shaqiri’s shot was saved by Peter Gulacsi.\n\nSzalai equalised two minutes later, also from a rebound after his own shot hit the post. Ricardo Rodríguez put Switzerland back in front in the 67th minute, volleying home from Valon Behrami’s lofted cross for his first international goal, only for Szalai to equalise again four minutes later. Switzerland were not to be denied, however, and snatched the points when a long thrown-in was twice headed on and Stocker scored at the far post.\n\nThe Swiss went top of Group B with six points from two matches following a game in which all five goals were scored after half-time, while Hungary were left with one point and already look unlikely to make a first World Cup appearance since 1986.\n\nThe Faroe Islands are second with four points after their shock 2-0 win in Latvia. Portugal and Latvia have three and Andorra none."}]}