{"Lee Hsien Loong was born on 10 February 1952.": [{"url": "https://www.britannica.com/biography/Lee-Hsien-Loong", "page_content": "father Lee Kuan Yew ...(Show more)\n\nLee Hsien Loong, (born February 10, 1952, Singapore), Singaporean politician who was the third prime minister of Singapore (2004– ).\n\nLee was born and raised in Singapore, the son of Lee Kuan Yew, the city-state’s first prime minister (1959–90). Lee distinguished himself academically, studying mathematics and graduating with a first-class degree (1974) from the University of Cambridge before earning a master’s degree (1980) in public administration from Harvard University’s Kennedy School of Government. He then became an officer in the Singaporean military, eventually rising to the rank of brigadier general.\n\nLee’s political career began in 1984 when he joined his father’s party, the ruling People’s Action Party. Later that year he was elected to Parliament and was also appointed minister of state in both the Ministry of Trade and Industry and the Ministry of Defense. In 1985 he chaired the Economic Committee, which recommended a large tax reduction and the implementation of a consumption tax. A year later he was elected to his party’s Central Executive Committee, and in 1987 he became minister for trade and industry and second minister of defense. Lee assumed the position of deputy prime minister immediately upon the ascension of his father’s successor as prime minister, Goh Chok Tong, in 1990. Lee was treated for lymphoma in the early 1990s. The cancer ultimately went into remission, and he made a vigorous return to political life, serving as chairman of the Monetary Authority of Singapore (1998–2004) and as finance minister (2001–07).\n\nOn August 12, 2004, Lee assumed office as prime minister of Singapore, replacing the outgoing Goh. The transition had been planned and occurred without an election. Lee’s father was appointed to the newly created cabinet post of “minister mentor,” and Goh remained as the senior cabinet member; both men resigned from the cabinet in 2011. In addition, Lee’s wife, Ho Ching, served as executive director of the government-run investment firm Temasek Holdings, which owned stakes in some of Singapore’s largest companies. The cabinet included for the first time two female ministers of state; it was made up primarily of appointees who had been reassigned from other ministry posts.\n\nWhile observers expected Lee to retain tight control over the prosperous city-state, he appeared sensitive to the desire among many Singaporeans for a more open society. He promised to permit greater freedoms in a country where rigid social policies and limits on political expression were strictly enforced. Revised guidelines on free speech were announced shortly after Lee was sworn in, but while certain restrictions were eased—licenses for indoor political meetings were no longer required, for example—many remained intact. During his tenure as prime minister, Lee was subject to charges of nepotism and corruption and, as had his father, took a number of his detractors to court for libel. Though he was successful in such legal proceedings, he drew disapprobation over what was perceived internationally as the suppression of free speech.\n\nLee championed the legalization of gambling in 2005, attracting significant foreign investment in the development of casino facilities. His 2006 economic package disbursed a portion of the large budget surplus as a bonus to citizens and channeled money to health care, education, and housing programs. Even greater attention was paid to those programs after the 2011 parliamentary elections, when opposition candidates made an unexpectedly strong showing. Notable was the creation of a compulsory health care insurance plan, which was to go into effect by the end of 2015.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 2007 a large salary increase received by Lee and other ministers brought widespread criticism. In response, Lee promised to donate a significant portion of his earnings to charity and to voluntarily subject himself to a salary freeze. Continued criticism of the high salaries, however, prompted the government in 2012 to cut the pay of ministers (including the prime minister) by about one-third and that of Singapore’s president by half."}, {"url": "https://www.encyclopedia.com/people/history/southeast-asia-history-biographies/lee-hsien-loong", "page_content": "Lee Hsien Loong\n\nAfter a brilliant 13-year career in the Singapore Armed Forces Lee Hsien Loong (born 1952) was elected a member of Parliament for Teck Ghee in 1984, winning more than 80 percent of the vote. In October 1990 he became deputy prime minister to Goh Chok Tong.\n\nLee Hsien Loong, the eldest son of Singapore's former prime minister Lee Kuan Yew, was born in Singapore on February 10, 1952. Lee had an outstanding record as a student. He received his primary and secondary school education at the Catholic High School in Singapore, which required students to be proficient in both English and Mandarin. In addition to these two languages, he was proficient in Malay and had also studied Russian. He attended the National Junior College for his pre-university education and was awarded the president's scholarship in 1970 and the Singapore Armed Forces (SAF) scholarship in 1971 for his academic prowess.\n\nHe proceeded to Cambridge University to study mathematics. In 1974 he graduated with first-class honors in mathematics and was also awarded a diploma in computer science with distinction from the same university. In 1978 he attended the U.S. Army Command and General Staff Course at Fort Leavenworth in Kansas. One year later he was a Mason fellow at the Kennedy School of Government at Harvard University, where he received a Master of Public Administration degree in 1980.\n\nLee's connection with the army began in 1971, when he was awarded the SAF scholarship to study mathematics at Cambridge University. However, his military career did not begin until 1974 when he was assigned to an artillery division on his return to Singapore. His first major appointment in the SAF occurred in 1980, when he was made commanding officer of the Artillery Gun Battalion. After that he was promoted with astonishing speed to assistant chief of the General Staff (Operations) in 1981; to chief of staff of the General Staff in 1982; and to director, Joint Operations Planning Directorate with the rank of brigadier general in 1983. He was publicly commended for his role in coordinating the Sentosa cable car rescue operations in 1982. He was also credited for two achievements during his SAF career—the unification of the SAF's three services and the modernization of its weaponry. He resigned from the SAF on September 21, 1984. Following his election to Parliament as a member of the People's Action Party (PAP), he was appointed political secretary to the minister for defense by the prime minister.\n\nLee's rise within the PAP and government hierarchies was even more rapid. In January 1985 he was appointed as minister of state (MOS) in two key ministries: the Ministry of Defense (MINDEF) and the Ministry of Trade and Industry (MTI). As MOS in the MIT, Lee chaired the Economic Committee set up one month after his appointment to tackle the economic recession facing the country. The creation of the Economic Committee can be viewed as the beginning of the PAP government's consultative style of leadership, as Lee managed to obtain feedback and views on the causes of the recession as well as suggestions for ensuring economic recovery from about a thousand participants from both the public and private sectors in Singapore. The Economic Committee completed its report one year later, and its 12 recommendations enabled the government to deal successfully with the economic recession.\n\nIn February 1986, Lee was appointed acting minister for trade and industry and he also retained his MOS position in MINDEF. During the same year, he was made chairman of the newly created PAP Youth Wing. In January 1987, he was confirmed as minister for trade and industry and promoted to second minister for defense (services). Two years later, he was appointed as the second assistant secretary-general of the PAP's Central Executive Committee. Then, in October 1990, six years after he became an MP, he was appointed as one of the two deputy prime ministers with Ong Teng Cheong.\n\nGiven his outstanding performance in the army and his meteoric rise up the party and government hierarchies, it was not surprising that Lee was expected by most Singaporeans to succeed Goh Chok Tong as Singapore's third prime minister when Goh retired from the political scene. However, in November 1992 the government announced that Lee was diagnosed as suffering from an intermediate grade malignant lymphoma. After undergoing 18 weeks of chemotherapy, Lee's health improved as his doctors reported in April 1993 that there was \"no evidence of any residual disease.\" Lee's health remained stable and he kept his position as deputy prime minister. In the 1997 elections, the PAP won all but two of Singapore's 83 seats in Parliament; Lee and Goh remained in their governmental positions.\n\nFurther Reading\n\nLee Hsien Loong's speeches as minister for trade and industry and as deputy prime minister can be found in Speeches, which was published by the Ministry of Communications and Information until November 1990, and then by the Ministry of Information and the Arts from December 1990 onwards. His three most significant speeches are: \"Salary Revision for the Administrative, Professional, and Other Services\" (March 17, 1989); \"Core Principles of Government\" (1992); and \"Costs of Living and Medical Costs\" (Petir, October 1992). For more information on Singapore see Stella R. Quah and John S. T. Quah (compilers), Singapore (Oxford, 1988), which contains 764 annotated references; and Kernial S. Sandhu and Paul Wheatley (editors), Management of Success: The Moulding of Modern Singapore (Singapore: Institute of Southeast Asian Studies, 1989), which has over 40 chapters on various aspects of life in Singapore. □"}, {"url": "https://www.pmo.gov.sg/The-Cabinet/Mr-LEE-Hsien-Loong", "page_content": "Mr Lee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to four consecutive Singapore General Elections victories in 2006, 2011, 2015 and 2020. He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency.\n\nMr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master in Public Administration.\n\nMr Lee was born on 10 February 1952. He married Dr Wong Ming Yang in 1978, and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr Lee enjoys reading, photography, walking, listening to classical music, and computer programming.\n\nBiodata"}, {"url": "https://www.discoverwalks.com/blog/singapour/top-10-amazing-facts-about-lee-hsien-loong/", "page_content": "Top 10 Amazing Facts about Lee Hsien Loong\n\nShare\n\nPin\n\n\n\nLee Hsien Loong, a Singaporean politician and former brigadier general, was born on February 10, 1952. Since 2004, he has held the positions of Prime Minister of Singapore and Secretary-General of the ruling People’s Action Party (PAP).\n\nHe was the nation’s deputy prime minister from 1990 until 2004 before being named prime minister. Since 1991, he has served as the Member of Parliament (MP) for the Teck Ghee ward of the Ang Mo Kio GRC; from 1984 to 1991, he served as the Teck Ghee SMC MP. Lee Hsien Loong was born at KK Women’s and Children’s Hospital in Singapore on February 10, 1952, when Singapore was still a British colony.\n\nHe was the oldest child of Lee Kuan Yew and Kwa Geok Choo and the patriline grandson of Chua Jim Neo (1905-1980), a chef, and Lee Chin Koon (1903-1995), a retired storekeeper turned salesman. His mother has ancestors from Shantou and the Tong’an District of China.\n\nThe younger Lee, who frequently accompanied his father to rally sites, had mastered the Jawi script by the time he was five, according to the biography of Lee Kuan Yew.\n\nThese top 10 intriguing facts about Lee Hsien Loong will help you discover more about his fascinating life.\n\n1.Lee Hsien Loong knows four different languages\n\nIn addition to English and Mandarin, he is also proficient in Bahasa Melayu (he provides several speech segments in Malay, especially during the yearly National Day Rally). Oddly enough, he is also proficient in Russian, which he claims to have used, albeit rustily, five years ago:\n\n2 Lee Hsien Loong has battled cancer twice in his lifetime\n\nIn April 1993, after receiving a 1992 lymphoma diagnosis, he entered remission. PM Lee had a prostate cancer diagnosis more recently, in 2015, and underwent surgery to have his prostate gland removed.\n\n3.The female cabinet minister who serves in Lee Hsien Loong’s cabinet is a first for Singapore\n\n2009 saw the appointment of Lim Hwee Hua as Singapore’s first female full minister. The Workers’ Party won the 2011 General Election, ending her team’s tenure in government, which included former foreign minister George Yeo.\n\n4.The first Singaporean prime minister to apologise in public was PM Lee Hsien Loong\n\nIn reality, he did it twice—once in 2011 and again in 2017. The first public apology was made during the 2011 general election, a time of intense popular unrest toward the administration. The second apology was made after the controversy surrounding 38 Oxley Road, when his family’s problems were brought to the public’s attention.\n\n5.Lee Hsien Loong used to be a clarinet player in the marching band at his school\n\nHe played clarinet and was a part of the Catholic High School Band in 1968.\n\n6.After his father, the late Lee Kuan Yew, PM Lee is the second-longest-serving prime minister in Singapore\n\nDespite the fact that Singapore has only had three prime ministers to yet, 15 years and counting is nevertheless a significant accomplishment.\n\nFrom 1965 to 1990, or more than 25 years, LKY was Singapore’s first prime minister, and he is likely to continue holding the record for the longest tenure in our history.\n\nFrom 1990 to 2004, Emeritus Senior Minister Goh Chok Tong presided as PM before handing the reins to PM Lee.\n\n7.Even after accounting for inflation, PM Lee Hsien Loong remains the highest-paid PM of the three Singapore has had\n\nPM Lee makes around S$2.2 million year, according to the 2017 Review of Salaries report. And he’s been quite good about it, growth-wise at least, bucking recommendations to increase salaries and sticking to the same amount for the past few years.\n\nHe also doesn’t receive bonuses because there isn’t anyone to evaluate how he’s doing.\n\nThat being said… the late LKY earned S$9,500 per month back in 1973, which, with 13th-month added to it, amounted to roughly S$364,000 annually after adjusting for inflation to 2018.\n\n8.Singapore’s first senior wrangler is PM Lee Hsien Loong\n\nAt Cambridge, Lee Hsien Loong was the Senior Wrangler and the top-ranked student in the Math Tripos. He received 31 alphas, which is 12 more than the runner-up.\n\nHe was the class valedictorian and actually prevailed by a street. At the time, it was obvious who was superior, but the person who finished in second is today a top-tier mathematician.\n\n9.Lee Hsien Loong’s military career\n\nLee enlisted in the Singapore Armed Forces in 1971, and from 1974 to 1984 he was an officer. He attended the United States Army Command and General Staff College at Fort Leavenworth in 1978, and he has held a number of staff and command positions, including Chief of Staff of the General Staff and Director of the Joint Operations and Plans Directorate.\n\nAfter receiving a promotion in July 1983, Lee advanced swiftly through the ranks of the Singapore Army, becoming the nation’s youngest brigadier-general in history. Notably, he was given control of the rescue efforts after the Sentosa cable car accident.\n\nBefore departing the SAF in 1984 to pursue a career in civilian politics, Lee served as the commanding officer of the 23rd Battalion Singapore Artillery in the Singapore Army.\n\n10.Lee Hsien Loong in the PAP Youth committee\n\nFirst Deputy Prime Minister Goh Chok Tong and Lee spoke about how to persuade younger Singaporeans to join the party in March 1986. Goh was adamant that the planned committee should only draw in the right types of people, and he disapproved of financial incentives.\n\nThe purpose of the proposed youth wing was to promote system development from within and give new members a stake in the nation’s future.\n\nLater, Lee said that the leadership’s anxieties about the younger generation voting for opposition parties and possibly toppling the PAP administration were the driving force behind the creation of the youth wing.\n\nThe youth wing was a “tailor-made” mechanism created by the government to promote opposing views.\n\nLee served as the inaugural chairman of the PAP Youth Committee, the organization that preceded Young PAP, when it was established. Lee enjoys computer programming, he constructed a Sudoku solver during his coding time."}, {"url": "https://www.calendarz.com/on-this-day/february/10/lee-hsien-loong", "page_content": "Birth\n\nFeb, 10\n\nLee Hsien Loong\n\nLee Hsien Loong, Singaporean general and politician, 3rd Prime Minister of Singapore\n\nLee Hsien Loong (Chinese: 李显龙; pinyin: Lǐ Xiǎnlóng; born 10 February 1952) is a Singaporean politician and former brigadier-general who has served as Prime Minister of Singapore and secretary-general of the People's Action Party (PAP) since 2004. Prior to his appointment as prime minister, he served as the deputy prime minister between 1990 and 2004 and was the finance minister between 2001 and 2007.\n\n\n\nBorn in British Singapore, Lee is the eldest son of Singapore's first prime minister, Lee Kuan Yew. He studied in Trinity College at the University of Cambridge, graduating in 1974 with a bachelor's degree in mathematics and a diploma in computer science. In 1980, he earned a Master of Public Administration at Harvard University's Kennedy School of Government. From 1971 to 1984, he served in the Singapore Armed Forces (SAF), where he rose to the rank of Brigadier-General. Entering civilian politics in 1984, he was elected as the Member of Parliament for Teck Ghee SMC and since its dissolution in 1991 has represented Ang Mo Kio GRC.\n\n\n\nLee served in various ministerial appointments under Goh Chok Tong before succeeding him as prime minister in 2004. In his first two years, his government enacted a \"five-day work week\" and extended maternity leave days. His proposal to build two Integrated Resorts (IRs) in Singapore to increase tourism revenue led to the development of the Marina Bay Sands and Resorts World Sentosa. Following the Great Recession, he oversaw the country's economic recovery within two years. Political reforms in 2010 legalised online activism and increased the number of non-constituency members of parliament (NCMPs) in Parliament.\n\n\n\nHis government has advocated Goods and Services Tax (GST) hikes to fund social spending and infrastructure development, with the GST expected to be raised from 7% to 9% by 2025. In 2019, his government introduced the controversial Protection from Online Falsehoods and Manipulation Act (POFMA) to combat online misinformation. That year, Lee reshuffled his cabinet and promoted Heng Swee Keat to deputy prime minister.\n\n\n\nOn 31 May 2019, Lee Hsien Loong that touched on Vietnam's invasion of Cambodia in 1978 has sparked anger in both countries."}, {"url": "https://prabook.com/web/lee.hsien_loong/337188", "page_content": "Lee Hsien Loong Edit Profile\n\nmilitary politician statesman\n\nLee Hsien Loong is a Singaporean politician and the current Prime Minister of Singapore. He also served as the Minister for Trade and Industry, Minister for Finance and Deputy Prime Minister.\n\nBackground Ethnicity: Lee's paternal grandmother, Chua Jim Neo, was a Hokkien Hakka Nyonya, and his mother, Kwa Geok Choo, had ancestry from Tong'an District and Shantou in China.\n\n\n\nLee Hsien Loong was born on February 10, 1952 in Singapore. He is a son of Lee Kuan Yew, Singapore's first Prime Minister, and Kwa Geok Choo, a lawyer. Lee has a brother and a sister.\n\nEducation Lee Hsien Loong studied at Nanyang Primary School and Catholic High School in Singapore. He also attended National Junior College, where he learned the clarinet. In 1971, Lee was awarded a President's Scholarship and Singapore Armed Forces Overseas Scholarship by the Public Service Commission to study mathematics at Trinity College, University of Cambridge. In 1973, he became the Senior Wrangler and, in 1974, he received his first-class honors degree in Mathematics and a Diploma in Computer Science (now equivalent to a master's degree in Computer Science). Lee attended the United States Army Command and General Staff College at Fort Leavenwort from 1978 to 1979. Later, he studied at the John F. Kennedy School of Government, where he received a Master of Arts degree in Public Administration in 1980.\n\nCareer Lee Hsien Loong's military career started in 1971, when he joined the Singapore Armed Forces. In 1982, he became Chief of Staff of the General Staff and, in 1983, he was appointed Director of the Joint Operations and Plans Directorate. When he left the Singapore Armed Forces to enter politics in 1984, he was the youngest Brigadier-General.\n\n\n\nIn 1984, Lee Hsien Loong joined the ruling People's Action Party and was elected a member of Parliament for Teck Ghee Single Member Constituency. He held this post until 1991. In 1986, he became a member of the Central Executive Committee of the People's Action Party. Also, Lee served as the Minister for Trade and Industry from 1986 to 1990 and as the Second Minister for Defense from 1987 to 1990. Besides, he served as the Second Assistant Secretary-General from 1989 to 1992 and the First Assistant Secretary-General of the People's Action Party from 1992 to 2004.\n\n\n\nLee Hsien Loong assumed the position of the Deputy Prime Minister in 1990 and, one year later, he became a member of Parliament for Ang Mo Kio Group Representation Constituency. In 1998, he became the Chairman of the Monetary Authority of Singapore and held this post until 2004. In 2001, Lee was made the Minister for Finance and carried out various tax reforms. On August 12, 2004, Lee Hsien Loong was appointed the Prime Minister of Singapore. At the same time, he became the Secretary-General of the People's Action Party and also the Chairman of the Research, Innovation and Enterprise Council. He left the post of the Minister for Finance in 2007 and, in 2011, Lee was appointed the Chairman of the Government of Singapore Investment Corporation.\n\nAchievements Lee Hsien Loong is a politician, known as the current Prime Minister of Singapore. He is also the Secretary-General of the People's Action Party. In 2015, the government of Lee Hsien Loong was among the top ten most effective governments in the world according to the World Economic Forum. As the Minister for Finance, he was able to cope with the crisis situation in the country's economy and develop a program of financial market liberalization.\n\n\n\nLee Hsien Loong is said to be the world’s highest-paid leader. In 2008, he received the Grand Cross of the Order of the Sun and, in 2010, he was awarded the Gold Olympic Order.\n\n\n\nIn addition, in January 2009, Lee Hsien Loong Award for Outstanding All-Round Achievement was introduced by the Ministry of Education of Singapore.\n\nPolitics Lee Hsien Loong joined the People's Action Party in 1984. He led the People's Action Party to three consecutive Singapore General Elections victories in 2006, 2011 and 2015. He was first elected Member of Parliament in 1984 and has been re-elected seven times, most recently as a Member of Parliament for the Ang Mo Kio Group Representation Constituency.\n\n\n\nAs the Prime Minister, Lee launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create the future of better living, more opportunities and stronger communities. He also introduced 5 days work week and two months paid maternity leave for mothers with newborn babies. In 2005, Lee legalized gambling, which attracted significant foreign investment. At the same time, he took the required steps in order to limit the negative impact of gambling. He suggested safeguards, such as prohibiting minors from the casinos and charging an entrance fee for Singaporeans of 100 Singapore dollars.\n\n\n\nAt the beginning of 2006, Lee's government announced a 2.6 billion dollar bonus, called the Progress Package. Under this program, Lee channeled the budget surplus, accumulated over the years into healthcare, housing and education. In addition, every adult Singaporean citizen got a cash bonus.\n\n\n\nLee instituted electoral reforms to the current electoral system in 2010. He reduced the number of group representation constituencies, increased the number of Non-constituency Members of Parliament to the maximum of nine and the number of Nominated Members of Parliament permanent also to nine. He also legalized internet campaigning and mandated a \"cooling-off\" day, where campaigning is prohibited except for party political broadcasts.\n\n\n\nIn 2005, Lee Hsien Loong met with Chinese Vice-Premier, Wu Yi, and proposed the establishment of the China-ASEAN Free Trade Zone, which would achieve the goal of realizing $50 billion in trade volume before 2010. The same year, Lee signed the Strategic Framework Agreement with then-President George W. Bush in his inaugural visit to the United States as Singapore's Prime Minister to foster closer cooperation in defence and security. He was one of the early drafters and a strong advocate of the Trans-Pacific Partnership and on many occasions urged the United States Congress to ratify the trade deal as soon as possible. However, this plan fell through after Donald Trump assumed the presidency in 2017 and pulled the country out of the Trans-Pacific Partnership.\n\nViews In his interview with the BBC journalist in 2000, Lee Hsien Loong said, that he is not in favor of repealing Section 377A of the Penal Code, which criminalizes sex between men, even if it is between consenting adults in private. However, in 2015, he said, that Singapore is ready for same-sex marriage because society is still conservative although it is changing gradually.\n\n\n\nIn his interview on April 3, 2014 with Executive Director Khoo Teng Chye and Koh Buck Song of the Centre for Liveable Cities, Lee gave his take on urban liveability and described his hopes for his country 100 years ahead. He believes, that a liveable city is a place, where people can live, work, play and fulfill the human spirit. Quotations: \"You need people, who have their own views, whose views you respect, whom you can have a productive disagreement with and work out ideas, which you might not have come up with, or who improve on ideas you had.\"\n\n\n\n\"We have long depended on an America, which has got a clear sense of its stakes in the world and how much it depends on the world, as well as how much the world and its allies and friends depend on the United States of America, and we hope this will continue.\"\n\n\n\n\"Just as our forefathers saved and invested to build what we, the current generation, are enjoying today, so, too, we must plant trees, so that our sons and daughters, and their sons and daughters, can enjoy the shade.\"\n\n\n\n\"There is no policy too sensitive to question, and no subject so taboo, that you cannot even mention it.\"\n\nPersonality Lee Hsien Loong is interested in computer programming and has written a Sudoku solver in C++ programming language. He also likes taking selfies. Physical Characteristics: In the early 1990's, Lee was diagnosed with lymphoma, for which he underwent chemotherapy. He also underwent a successful robot-assisted keyhole prostatectomy on 15 February 2015 after being diagnosed with prostate cancer.\n\nInterests reading, walking, tinkering with computers\n\nMusic & Bands classical music\n\nConnections On May 20, 1978, Lee Hsien Loong married Wong Ming Yang. The marriage produced two children. Wong Ming died on October 28, 1982 three weeks after giving birth to her daughter. In 1985, Lee married Ho Ching. The marriage produced two sons. Father: Lee Kuan Yew Lee Kuan Yew (September 16, 1923 - March 23, 2015) was a Singaporean politician and lawyer, who served as the first Prime Minister of Singapore from 1959 to 1990. Mother: Kwa Geok Choo Kwa Geok Choo (December 21, 1920 - October 2, 2010) was a Singaporean lawyer and the wife of Lee Kuan Yew, the first Prime Minister of Singapore. Brother: Lee Hsien Yang Lee Hsien Yang (born September 24, 1957) is a Singaporean business executive. He served as Chairman of the Civil Aviation Authority of Singapore from 2009 to 2018. Sister: Lee Wei Ling Lee Wei Ling (born 1955) is a Singaporean neurologist. late wife: Wong Ming Yang (died October 28, 1982) Son: Li Yipeng (born October 1982) Daughter: Li Xiuqi (born 1980) Wife: Ho Ching Ho Ching (born March 27, 1953) is a Singaporean business executive and the chief executive officer of Temasek Holdings. Son: Li Hongyi Li Hongyi (born May 1, 1987) is deputy director in the Government Technology Agency of Singapore. He worked as a consultant in the Government Technology Agency from 2013 to 2017. He also served as a product manager at Google company and as a research assistant at Massachusetts Institute of Technology. Son: Lee Haoyi Lee Haoyi (born 1989) is a staff software engineer at Databricks company. He also served as a software engineer at Dropbox company."}, {"url": "https://www.birthdayanswers.com/date/february-10-1952/", "page_content": "It was the 2nd Sunday of 1952. If you were born on this date your birthday numbers 2, 10 and 1952 reveal that your life path number is 2. Your zodiac sign is Aquarius with a ruling planet Uranus, your birthstone is the Amethyst, and your birth flower is the Violet. You are 71 old, and were born in 1950s, in the middle of Baby Boomers Generation. The generation you are born into makes an impact on your life. Swipe up to find out what it all means.\n\n→ February 10, 1952 was a Sunday\n\n→ Zodiac sign for this date is Aquarius\n\n→ This date was 26,052 days ago\n\n→ 1952 was the Year of the Dragon\n\n→ In 2024, February 10 is on Monday\n\nView fun February 10, 1952 birthday facts that no one tells you about, such as your life path number, birthstone, ruling planet, zodiac sign and birth flower.\n\nYou have been alive for:\n\n\n\nPeople born on this day will turn 72 in exactly .\n\nIf you were born on this date:\n\nYou have been alive for . You were born in the Year of the Dragon. Your birth sign is Aquarius with a ruling planet Uranus. There were precisely 883 full moons after you were born up to this day. Your billionth second was on was on October 19, 1983.\n\n→ You’ve slept 8,684 days or 23.79 years.\n\n→ Your next birthday is away\n\n→ You’ve been alive\n\n→ You were born in the Year of the Dragon\n\n→ You have been alive 625,253 hours\n\n→ You are 37,515,213 minutes old\n\n→ Age on next birthday: 72 years old\n\nYou were born on a Sunday\n\nFebruary 10, 1952 was the 2nd Sunday of that year. It was also the 41st day and 2nd month of 1952 in the Georgian calendar. The next time you can reuse 1952 calendar will be in 2036. Both calendars will be exactly the same.\n\nThere are left before your next birthday. Your 72nd birthday will be on a Tuesday and a birthday after that will be on a Monday. The timer below is a countdown clock to your next birthday. It’s always accurate and is automatically updated.\n\nYour next birthday is in:\n\n\n\nTuesday\n\nYou’ve slept 33% of your life!\n\nYour next birthday is on a\n\nAssuming you’ve been sleeping 8 hours daily since birth. Here is how much time you’ve spent sleeping so far:\n\nYou’ve slept 23.79 years of your life.\n\nYou’ve slept 285 month of your life.\n\nYou’ve slept 1,241 week of your life.\n\nYou’ve slept 8,684 days of your life.\n\nDid you know you have taken approximately 525,208,320 breaths since your birth? Moreover, using 80 beats per minute as average, your heart has beaten over 3,001,190,400 times. You have also blinked over 637,752,960 times in your lifetime.\n\n#1 Song on your birthday\n\nThe number one song in the US on the day of your birth was [Not available]. No song matches found.. (Billboard Hot 100 – February 10, 1952) . Ask your parents if they remember this popular song.\n\nDo you remember the number one song on your 14th birthday? It was \"My Love\" by Petula Clark (February 10, 1966) .\n\nCelebrities born on February 10, 1952\n\nYou share a birthday with You share a birthday with Lee Hsien-Loong (politician).\n\nWe have over 150,000 celebrities in our database. We will continue to update this list with matching birthdays, so bookmark this page and check back often. You can also find out all celebrity birthdays born on February 10, 1952.\n\nWhat happened on February 10th\n\nBelow are some of the most important historical events that happened on 10 February 1952.\n\nSports in 1952\n\nSt Paul thought to have been shipwrecked at Malta.Edmond Halley appointed as the second Astronomer Royal at the Greenwich Observatory.Treaty of Paris ends French-Indian War, surrendering Canada to Britain.Simón Bolivar named dictator by the Congress of Peru.Henry Morton Stanley departs for the Congo.\n\nNBA – Minneapolis Lakers beat New York Knicks (4 - 3) to win the NBA Finals.\n\nNHL – Detroit Red Wings defeated Montreal Canadiens (4 - 0) to win the Stanley Cup.\n\nNFL –\n\nMLB – New York Yankees beat Brooklyn Dodgers (4 - 3) to win the World Series.\n\nYour life path number is 2\n\nSo what does your birthday really say about you and what does your life path number mean? On the next page, we’ll explain what your birth sign, ruling planet, age generation, birthstone, and birth flower mean — and more!\n\nContinue to the next page to discover the answers to the most important questions about your birthday."}, {"url": "https://www.celebsagewiki.com/lee-hsien-loong", "page_content": "Age, Biography and Wiki\n\nLee Hsien Loong was born on 10 February, 1952 in Singaporean, is a 3rd and current Prime Minister of Singapore. Discover Lee Hsien Loong's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 71 years old?\n\nPopular As Lee Hsien Loong Occupation N/A Age 71 years old Zodiac Sign Aquarius Born 10 February 1952 Birthday 10 February Birthplace N/A Nationality Singaporean\n\nWe recommend you to check the complete list of Famous People born on 10 February. He is a member of famous Minister with the age 71 years old group.\n\nLee Hsien Loong Height, Weight & Measurements\n\nAt 71 years old, Lee Hsien Loong height not available right now. We will update Lee Hsien Loong's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Lee Hsien Loong's Wife?\n\nHis wife is Wong Ming Yang(m. 1978; died 1982) Ho Ching (m. 1985)\n\nFamily Parents Not Available Wife Wong Ming Yang(m. 1978; died 1982) Ho Ching (m. 1985) Sibling Not Available Children Li Xiuqi (daughter)Li Yipeng (son)Li Hongyi (son)Li Haoyi (son)\n\nLee Hsien Loong Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Lee Hsien Loong worth at the age of 71 years old? Lee Hsien Loong’s income source is mostly from being a successful Minister. He is from Singaporean. We have estimated Lee Hsien Loong's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Minister\n\nLee Hsien Loong Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Lee Hsien Loong Wikipedia Imdb\n\nTimeline"}, {"url": "https://infogalactic.com/info/Lee_Hsien_Loong", "page_content": "From Infogalactic: the planetary knowledge core\n\nLee Hsien Loong (Chinese: 李显龙, pinyin: Lǐ Xiǎnlóng; born 10 February 1952) is a Singaporean politician. He is the third and current Prime Minister of Singapore, and has been in office since 2004. He is the eldest son of Singapore's first Prime Minister, Lee Kuan Yew.\n\nAs the Secretary-General of the People's Action Party (PAP), Lee became Prime Minister in August 2004, succeeding Goh Chok Tong. He has been a Member of Parliament (MP) for Teck Ghee since 1984 and a member of the Cabinet since 1987, and was one of the key leaders in Singapore's political transition in the 1980s and 1990s.\n\nBefore becoming Prime Minister in 2004 he served as the Minister for Trade and Industry, Minister for Finance and Deputy Prime Minister. Prior to his election to Parliament, he served as an officer in the Singapore Armed Forces, quickly rising to the rank of Brigadier-General.[citation needed]\n\nBackground and education\n\nThe eldest child of Singapore's first prime minister Lee Kuan Yew and his wife Kwa Geok Choo, Lee Hsien Loong was born in Singapore on 10 February 1952. His paternal grandmother, Chua Jim Neo, was a Hokkien Nyonya, and his mother has ancestry from Tong'an District, Xiamen, Fujian, China.[2][3] According to Lee Kuan Yew's biography, the younger Lee had learnt the Jawi script from the age of five, and has always been interested in the affairs of Singapore, often following his father to the rally grounds since 1963.\n\nLee studied at Nanyang Primary School and received his secondary education at Catholic High School, before going on to National Junior College (where he learned the clarinet under the tutelage of Adjunct Associate Professor Ho Hwee Long). In 1971, he was awarded a President's Scholarship and Singapore Armed Forces Overseas Scholarship by the Public Service Commission to study mathematics at Trinity College, University of Cambridge. He was senior wrangler in 1973,[4][5] and graduated in 1974 with first class honours in mathematics and a diploma in computer science (with distinction). In 1980, he completed a Master of Public Administration at the John F. Kennedy School of Government, Harvard University.\n\nMilitary career\n\nLee joined the Singapore Armed Forces (SAF) in 1971. In 1978, he attended the United States Army Command and General Staff College at Fort Leavenworth, and held various staff and command posts, including the Director of the Joint Operations and Plans Directorate, and Chief of Staff of the General Staff. Lee rose quickly through the ranks in the Singapore Army, becoming the youngest brigadier-general in Singaporean history after his promotion in July 1983. Notably, he was put in command of the rescue operations following the Sentosa Cable Car Disaster. Lee left the SAF in 1984 to pursue civilian politics.[6]\n\nEarly political career\n\nIn the 1980s, Lee was regarded as the core member of the next batch of new leaders in the People's Action Party (PAP) leadership transition that was taking place in the mid-1980s, as Lee Kuan Yew had declared that he would step down as prime minister in 1984. Following the 1984 general election, all of the old Central Executive Committee members resigned on 1 January 1985, except for Lee Kuan Yew himself.[7]\n\nLee was elected a Member of Parliament (MP) in 1984 at the age of thirty-two and he has been re-elected seven times, most recently in 2015 as an MP for the Ang Mo Kio Group Representation Constituency. Following his election, he was appointed as minister of state at the Ministry of Trade and Industry and the Ministry of Defence by his father, who was the prime minister at the time.\n\nIn 1985, Lee chaired the government's economic committee, which recommended changes to established government policies to reduce business costs, foster longer-term growth and revive the Singapore economy, which was experiencing a recession at the time. The committee's recommendations included reductions in corporate and personal taxes and the introduction of a consumption tax.\n\nIn 1986, Lee was appointed the acting minister for Trade and Industry. In 1987, he became a full member of the Cabinet as the minister for trade and Industry and second minister for defence.\n\nLee was the chairman of the PAP Youth Committee, the predecessor to the Young PAP, when it was established in 1986, while he was still a brigadier-general. The PAP had been undergoing leadership transition, and many of its key leaders were aging, with younger replacements scarce. PAP branches were urged to recruit 40-50 members each. Lee envisioned there would be a lot of young people who were \"idealistic, patriotic, nationalistic, keen to work for the nation.\" Lee's goal was to maintain the preeminence of the PAP such that \"when the people think about the government of Singapore, if they think about the future of Singapore, then they will think about the PAP\". Lee also said that the youth wing would be a channel in which the youth could communicate dissent, in which otherwise they might be \"tempted\" to vote for the opposition political parties and bring the PAP government down.[8]\n\nDeputy Prime Minister\n\nOn 28 November 1990, Goh Chok Tong took over from Lee Kuan Yew as Singapore's Prime Minister, and Lee Hsien Loong was made one of two Deputy Prime Ministers (along with Ong Teng Cheong). He also continued to serve as the Minister for Trade and Industry until 1992.\n\nIn 1992, Lee was diagnosed with lymphoma and underwent a three-month period of chemotherapy. When his treatment began, he relinquished his position as the Minister for Trade and Industry, though he continued to be a Deputy Prime Minister. His chemotherapy was successful, and his cancer has since gone into remission.\n\nLee was appointed Chairman of the Monetary Authority of Singapore (MAS) in 1998, and in 2001 he was made the Minister for Finance.\n\nTo ease the growing budget deficit due to falling tax revenues from cuts in corporate and personal income taxes and other factors such as the Iraq War and SARS outbreak, Lee proposed on 29 August 2003 to raise the GST from three percent to five percent, a change which took place in January 2004.\n\nLee also initiated several relaxations of the requirements for Singapore citizenship, notably for foreign-born children of Singaporean women.[9] The changes were made after repeated pleas from MPs and the Remaking Singapore Committee.\n\nIn the sphere of domestic politics, Lee played a key role as Deputy Prime Minister. In an interview with the media in 1996, ahead of the 1997 general election, he outlined what the ruling party looked for in its candidates for Members of Parliament.[10]\n\nOn the international front, Lee helped build relations with other countries like New Zealand.[11]\n\nPrime Minister\n\n2004\n\nIn the months leading up to Lee taking over as Singapore's third Prime Minister in 2004, he was already signalling reforms in some key areas, including ceding more space to the private and people sectors. Of the government's role, he said in a speech: \"Nanny should not look after everything all the time\".[12]\n\nOn 12 August 2004, Lee succeeded Goh Chok Tong as Prime Minister and relinquished his chairmanship of the Monetary Authority of Singapore to Goh Chok Tong. Lee was sworn in by Chief Justice Yong Pung How at the Istana.\n\nLee made his maiden National Day Rally on 12 August 2004. In his speech, Lee initiated the policy of the \"Five-day work week\", a plan that would remove a half-working day on Saturday. The plan took effect on 1 January 2005.\n\nLee also proposed two-month paid maternity leave for mothers of newborn children and financial incentives to mothers who give birth to a fourth child. These policies were initiated in response to the declining birth rate that Singapore has experienced in recent years.\n\nIn November 2004, Lee sparked a national debate when he revealed a proposal to build two Integrated Resorts (IRs) which are holiday resorts with casinos. In April 2005, despite some opposition expressed by the public, Lee announced the decision to approve the proposal. The two IRs were built in Marina Bay and Sentosa. To limit the negative social impact of casino gambling, Lee suggested that safeguards be implemented, such as prohibiting minors from entering the casinos and charging a S$100 entrance fee for Singaporeans and permanent residents or S$2000 for a year-long entrance fee.\n\n2006 general election\n\nIn February 2006, three months before the general election, Lee announced in parliament a S$2.6 billion bonus called the Progress Package.[13][14] The plan was to distribute budget surpluses accumulated from the past few years in the form of cash to all adult Singaporeans, top-ups to the state pension savings for elders, rental and utilities rebates for those living in public housing, educational funds for school children from low-income families, and cash bonuses for low-wage workers above 40 and for those men who have completed National Service. The cash bonuses was distributed in early May 2006.\n\nCritics, especially members of the opposition, have slammed the Progress Package as a \"vote-buying exercise\" for the Singapore parliamentary election held on 6 May 2006. In that election, Lee led the People's Action Party to win 82 of the 84 seats, including 37 walkovers. Lee and his six-member team won the Ang Mo Kio Group Representation Constituency (GRC) with 96,591 (60.42%) votes out of the total 159,872 votes cast. Most of the opposition Workers' Party (WP)'s team of six were in their 20s and the constituency was contested for the first time in 15 years.\n\nIts decision to contest Ang Mo Kio came as a surprise, as the opposition was expected to stay away from GRCs helmed by heavyweight ministers; but the party said that giving Ang Mo Kio residents a chance to vote was a prime reason for contesting the GRC. Given the inexperience of the WP team and Lee Hsien Loong's position as the Prime Minister, they won a surprisingly strong 49,468 votes (30.94%). There were also an extremely high percentage of void votes: 13,813 (8.64%).\n\n2010\n\nIn May 2010, Lee instituted electoral reforms to the current electoral system by reducing the number of group representation constituencies (GRC), increased the number of Non-constituency Members of Parliament (NCMPs) to a maximum of nine (inclusive of the number of elected opposition members of Parliament), and the number of Nominated Members of Parliament (NMPs) permanent also to nine. Also part of the reforms was the legalization of internet campaigning and mandating a \"cooling-off\" day where campaigning is prohibited except for party political broadcasts.\n\n2011\n\nEffective 1 June 2011, Lee was named chairman of the Government of Singapore Investment Corporation (GIC) which manages more than S$100 billion of assets. He succeeded his father, Lee Kuan Yew, who remained as senior advisor to the fund until his death.[15]\n\n2011 general election\n\nIn April 2011, a general election was called for 7 May 2011. For the second time, the PAP was not return to government on Nomination Day with only one uncontested walkover. In the final results, the PAP saw a 6.46% swing against it from the 2006 elections to 60.14%, its lowest since independence.[16] While the PAP met most expectations to sweep into power and claim over two-thirds of parliamentary seats, it won 81 out of 87 seats, and lost Aljunied Group Representation Constituency to the Workers' Party (WP), the first time a GRC was won by an opposition party. Two cabinet ministers, namely Foreign Minister George Yeo and Minister in the Prime Minister's Office Lim Hwee Hua, were defeated.[17]\n\nLater on, Minister Mentor Lee Kuan Yew and Senior Minister Goh Chok Tong tendered their resignations from the Cabinet, stating that they wished to give the Prime Minister a \"fresh clean slate\" in forming the government and enable him to \"have a completely younger team of ministers to connect to and engage with this young generation\".[18] Lee and Goh were appointed as senior advisers to the Government of Singapore Investment Corporation (GIC) and the Monetary Authority of Singapore (MAS) respectively.[19][20]\n\nLee was sworn-in into a second term on 21 May 2011. His new cabinet included three newly appointed ministers. S. Iswaran, formerly Senior Minister of State for Education and for Trade and Industry, was elevated to the Cabinet as Minister in the Prime Minister's Office, and Second Minister for Home Affairs and for Trade and Industry. Heng Swee Keat and Chan Chun Sing, both elected to Parliament for the first time, were respectively assigned the posts of Minister for Education, and Acting Minister for Community Development, Youth and Sports and Minister of State for the Ministry of Information, Communications and the Arts.[21][22] Heng was the first new MP directly appointed a full minister since 1984.[23][24]\n\n2012\n\nOn 20 April 2012, Lee set up his Facebook page to connect with Singaporean netizens.[25]\n\nForeign relations\n\nChina\n\nRelations with China have improved under Lee's administration. Smooth progress has been made in areas of trade, tourism and investment, which is not merely in accordance with the interest of the two countries, but promises to be beneficial to the common development of the region. The China-Singapore Joint Council for Bilateral Cooperation (JCBC) is responsible for promoting Sino-Singaporean co-operation.\n\nDuring his meeting with vice-premier Wu Yi in September 2005, Lee proposed the establishment of a China-ASEAN Free Trade Zone, which would achieve the goal of realizing US$50 billion in trade volume before 2010. In doing so, both agreed that relations between China and the Association of Southeast Asian Nations (ASEAN) should be elevated.\n\nDuring his seven-day visit to China in late October 2005, the Prime Minister stressed the need of improving bilateral diplomatic relationships between ASEAN and China. Lee also urged leaders to focus on the next wave of growth in north-eastern China, saying: \"It is a long-term commitment. There is no place in the world that you can go in and your money just grows on trees. Not in China.\"\n\nUnited States\n\nFile:Bush Lee.jpg Lee visits the United States in July 2005.\n\nSingapore has generally had a favourable relationship with the United States. The growth of bilateral trade improved commercial and diplomatic ties between the two countries after the implementation of the U.S.-Singapore Free Trade Agreement and the growth in bilateral trade has been evident since the Free Trade Agreement became effective on 1 January 2004.\n\nLee made his inaugural visit to the United States, as Prime Minister of Singapore, between 6 July and 16 July 2005. Several other ministers, notably Defence Minister Teo Chee Hean and Foreign Minister George Yeo, accompanied Lee.\n\nOn 12 July 2005, President of the United States George W. Bush and Lee signed the \"Strategic Framework Agreement between the United States of America and the Republic of Singapore for a Closer Cooperation Partnership in Defence and Security\". The agreement was a natural step in the expansion of bilateral ties. President Bush and the then Singaporean prime minister Goh Chok Tong had first announced their intention to conclude this agreement in October 2003.\n\nThe intention of the agreement is to address common threats such as terrorism and the proliferation of weapons of mass destruction (WMD), which called for even closer cooperation between the United States and Singapore.\n\nThe agreement recognizes Singapore's role as a Major Security Cooperation Partner and will expand the scope of current cooperation in areas such as counter-terrorism, counter-proliferation, joint military exercises and training, policy dialogues and defence technology. The Agreement will further enhance regional stability by supporting the continued security presence of the United States in Southeast Asia.\n\nBoth Prime Minister Lee and United States President George W. Bush agreed that the American presence in Southeast Asia has promoted peace and stability, which are crucial for regional cooperation and economic development.\n\nDuring their meeting, both Bush and Lee acknowledged the progress in the war on terror. Lee commended Bush's 'resolute and steadfast stance in the war on terror' and expressed Singapore’s continued support in this endeavour. In exchange, Bush commended the professionalism of the Singapore Armed Forces personnel, who have been deployed in support of Iraq operations over the past two years and of the Singapore Police Force, which has provided critically important training. Both Bush and Lee also pledged to sustain the close cooperation between the United States and Singapore in key regional and global multilateral institutions.\n\nControversies\n\nAs the eldest son of Singapore's first Prime Minister Lee Kuan Yew, Lee's career has been shadowed by allegations of nepotism.[26][27][28][29] At the age of 32, he became the youngest brigadier-general in Singaporean history, and from a young age was widely tipped to be Lee Kuan Yew's successor as Prime Minister. When Lee Kuan Yew stepped down as Prime Minister to make way for his successor, Goh Chok Tong, several critics had seen Goh as a seat-warmer, but Lee Kuan Yew said he had disproved that. In his memoirs, Lee Kuan Yew stressed that he could not have his son directly succeed him: \"It was better that someone else succeed me as Prime Minister. Then were Loong to make the grade later, it would be clear that he made it on his own merit.\"\n\nThe Lees are very sensitive to the issue of nepotism, with Lee explaining: \"And if anybody doubts that I as Prime Minister am here not because I'm the best man for the job but because my father fixed it, or that my wife runs Temasek because I put her there and not because she's the best woman for the job, then my entire credibility and moral authority is destroyed because I'm not fit to be where I am.\"[26][27]\n\nThe Lees have reacted strongly against published allegations of nepotism by taking legal action in Singapore courts, winning out-of-court settlements for defamation from the Financial Times (2007)[29] and the New York Times Company.[30] However, in a 2008 report, the International Bar Association Human Rights Institute (\"IBAHRI\") claimed that the \"slim likelihood\" of a successful defence to defamation, combined with high damages awarded in cases involving PAP officials, \"sheds doubt on the independence of the judiciary\" in cases involving PAP litigants or interests.[31]\n\nTaiwan\n\nOn 10 July 2004, Lee visited Taiwan, causing displeasure in China. On 28 August 2004 in his very first National Day Rally speech, he criticized the Taiwanese leadership and populace of overestimating the support they would receive if they were to declare Taiwan independence. At the same time, he also clarified during the rally that his visit to Taiwan in July was to ensure he gathered enough intelligence to make the right decisions when he took over the baton as Prime Minister. He reiterated his support for the One-China policy. Later that year in September, Foreign Minister George Yeo cautioned the United Nations General Assembly about the dangers of letting the cross-strait relationship deteriorate. In response, an enraged Taiwanese Foreign Minister, Mark Chen, called Singapore a \"nose-shit country\".[32] Chen later made a formal apology.[33]\n\nDefamation lawsuit: The New York Times Company\n\nIn 2010, Lee, together with the two former prime ministers who preceded him, Lee Kuan Yew and Goh Chok Tong, threatened legal action against The New York Times Company which owns the International Herald Tribune regarding an Op-Ed piece titled ‘All in the Family’ of 15 February 2010 by Philip Bowring, a freelance columnist and former editor of the Far Eastern Economic Review. The International Herald Tribune apologized in March that readers of the article may ‘infer that the younger Lee did not achieve his position through merit’. The New York Times Company and Bowring also agreed to pay SG$60,000 to Lee, SG$50,000 to Lee Kuan Yew and SG$50,000 to Goh (total amounted to about US$114,000 at the time), in addition to legal costs. The case stemmed from a 1994 settlement between the three Singaporean leaders and the paper about an article also by Bowring that referred to ‘dynastic politics’ in East Asian countries, including Singapore. In that settlement, Bowring agreed not to say or imply that the younger Lee had attained his position through nepotism by his father Lee Kuan Yew. In response, media rights watchdog Reporters Without Borders wrote an open letter to urge Lee and other top officials of the Singapore government to stop taking ‘libel actions’ against journalists.[30][34][35][36]\n\nSalary\n\nFrom 2008 to 2012, Lee earned an annual salary of S$3,870,000 (US$2,856,930),[37] an increase of 25% from the previous S$3,091,200 (US$2,037,168).[38] On January 2012, in response to public unhappiness at the high salary,[39] Lee took a 28% paycut reducing his salary to S$2.2 million (US$1.7 million).[40][41][42] He remains the highest-paid prime minister in the world.[43]\n\nIntegrated Resorts\n\nDuring a parliament session on 18 April 2005, Lee announced the cabinet's decision to develop two casinos[44] and associated hotels and malls in Marina South[45] and Sentosa.[46] In an official release, Lee announced in April 2005:\n\n<templatestyles src=\"Template:Blockquote/styles.css\" />\n\n\"After weighing the matter carefully, the Cabinet has collectively concluded that we had no choice but to proceed with the IRs. As Prime Minister, I carry the ultimate responsibility for the decision.\"[47][48]\n\nThe National Council on Problem Gambling (Singapore) was set up in Singapore on 31 August 2005 to address problem gambling. Within the first three days of the casino opening at Resorts World Sentosa eight people were arrested.[49] Amidst a variety of social issues that made the news thereafter,[50] gamblers seeking help in Singapore increased[51] after the casinos opened,[52] with more than 3000 Malaysians reportedly gambling in Singapore daily.[53] Between 2010 and 2013 both Resorts World Sentosa and Marina Bay Sands have become the world's most profitable casinos.[54][55]\n\nDefamation lawsuit: Roy Ngerng\n\nOn 15 May 2014, Singaporean activist and blogger Roy Ngerng who has been leading public protests over CPF policy issues wrote an article in his blog, featuring a chart which seemingly draws parallel between the scandal involving the round-tripping of City Harvest Church funds[56] and the movement of CPF funds.[57] Lee launched a lawsuit[58] against Ngerng stating the following in his court affidavit:[59]\n\n\"The offending words and images, in their natural and ordinary meaning, meant and were understood to mean that I, as the Prime Minister of Singapore and Chairman of GIC, am guilty of criminal misappropriation of the monies paid by Singaporeans to the Central Provident Fund (CPF).\"\n\nNgerng who successfully raised S$112,000 through crowd-funding to fight the case was eventually found guilty of defamation[60] by the High Court with yet-to-be assessed damages of at least S$250,000.\n\nPersonal life\n\nLee's first wife, a Malaysian-born doctor named Wong Ming Yang, died at the age of 31 on 28 October 1982 of a heart attack,[61] three weeks after giving birth to Lee's first son, Li Yipeng, an albino. In 1985, when he was 33, Lee married Ho Ching, a fast-rising civil servant who subsequently became the executive director and chief executive officer of Temasek Holdings.\n\nLee has one daughter – Xiuqi – and three sons – Yipeng, Hongyi and Haoyi (including the daughter and son from Lee's first marriage). Ho Ching's eldest son, Li Hongyi, was the winner of the Lee Kuan Yew Award for Math & Science in 2006, the same year he was commissioned as an officer in the Singapore Armed Forces (SAF).\n\nLee was initially diagnosed with lymphoma which he underwent chemotherapy for[62] in the early 1990s[63] then subsequently also underwent a successful robot-assisted keyhole prostatectomy on 15 February 2015 after being diagnosed with prostate cancer.[64][65][66]\n\nLee is interested in computer programming, and has written a Sudoku solver in C++ in his spare time.[67]\n\nHonours\n\nReferences\n\nCitations\n\nBibliography\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nSpeeches"}, {"url": "https://simple.wikipedia.org/wiki/Lee_Hsien_Loong", "page_content": "Lee Hsien Loong (b. 10 February 1952) is the current Prime Minister of Singapore. His father is Lee Kuan Yew, first Prime Minister of Singapore.\n\nLee Hsien Loong was born in Kandang Kerbau Hospital (presently known as KK Women's and Children's Hospital).[1][2] He is the first child of Lee Kuan Yew and Kwa Geok Choo.\n\nIn August 2004, Goh Chok Tong stepped down as Prime Minister, while Lee Hsien Loong took over the position. He then became the General Secretary of People's Action Party (PAP).\n\nBackground and education [ change | change source ]\n\nHis grandmother (father's side), Chua Jim Neo is a Hokkien Nyonya. His mother's ancestors are from Tong'an District, Xiamen, Fujian, China.\n\nStudied at Nanyang Primary School, Catholic High School and National Junior College.\n\nMilitary life [ change | change source ]\n\nIn 1971, Lee joined the Singapore Armed Forces (SAF). Lee was promoted to very high rank quickly in the Singapore Army. In July 1983, he became the youngest Brigadier General in Singapore. He left SAF in 1984.[3]\n\nEarly political life [ change | change source ]\n\nIn the 1980s, Lee Kuan Yew said he will step down as Prime Minister in 1984. Lee Hsien Loong was considered in the list of new leaders in PAP.\n\nIn 1984, at 32, He was elected an MP. His father immediately assigned him as a Minister of State for some ministries.\n\nIn 1987, he joined in the Cabinet as the Minister for Trade and Industry and Second Minister for Defence.\n\nFrom 2008 to 2012, Lee's salary is S$3.87 million every year.[4] He had a salary increase of 25%, it was originally S$3,091,200.[5]\n\nIn January 2012, his salary was reduced to S$2.2 million due to the public then complaining about his unfair salary. [6][7][8] But, he is still the prime minister with the highest salary in the world.[9]\n\nPersonal life [ change | change source ]"}], "Lee Hsien Loong is a politician.": [{"url": "https://www.britannica.com/biography/Lee-Hsien-Loong", "page_content": "father Lee Kuan Yew ...(Show more)\n\nLee Hsien Loong, (born February 10, 1952, Singapore), Singaporean politician who was the third prime minister of Singapore (2004– ).\n\nLee was born and raised in Singapore, the son of Lee Kuan Yew, the city-state’s first prime minister (1959–90). Lee distinguished himself academically, studying mathematics and graduating with a first-class degree (1974) from the University of Cambridge before earning a master’s degree (1980) in public administration from Harvard University’s Kennedy School of Government. He then became an officer in the Singaporean military, eventually rising to the rank of brigadier general.\n\nLee’s political career began in 1984 when he joined his father’s party, the ruling People’s Action Party. Later that year he was elected to Parliament and was also appointed minister of state in both the Ministry of Trade and Industry and the Ministry of Defense. In 1985 he chaired the Economic Committee, which recommended a large tax reduction and the implementation of a consumption tax. A year later he was elected to his party’s Central Executive Committee, and in 1987 he became minister for trade and industry and second minister of defense. Lee assumed the position of deputy prime minister immediately upon the ascension of his father’s successor as prime minister, Goh Chok Tong, in 1990. Lee was treated for lymphoma in the early 1990s. The cancer ultimately went into remission, and he made a vigorous return to political life, serving as chairman of the Monetary Authority of Singapore (1998–2004) and as finance minister (2001–07).\n\nOn August 12, 2004, Lee assumed office as prime minister of Singapore, replacing the outgoing Goh. The transition had been planned and occurred without an election. Lee’s father was appointed to the newly created cabinet post of “minister mentor,” and Goh remained as the senior cabinet member; both men resigned from the cabinet in 2011. In addition, Lee’s wife, Ho Ching, served as executive director of the government-run investment firm Temasek Holdings, which owned stakes in some of Singapore’s largest companies. The cabinet included for the first time two female ministers of state; it was made up primarily of appointees who had been reassigned from other ministry posts.\n\nWhile observers expected Lee to retain tight control over the prosperous city-state, he appeared sensitive to the desire among many Singaporeans for a more open society. He promised to permit greater freedoms in a country where rigid social policies and limits on political expression were strictly enforced. Revised guidelines on free speech were announced shortly after Lee was sworn in, but while certain restrictions were eased—licenses for indoor political meetings were no longer required, for example—many remained intact. During his tenure as prime minister, Lee was subject to charges of nepotism and corruption and, as had his father, took a number of his detractors to court for libel. Though he was successful in such legal proceedings, he drew disapprobation over what was perceived internationally as the suppression of free speech.\n\nLee championed the legalization of gambling in 2005, attracting significant foreign investment in the development of casino facilities. His 2006 economic package disbursed a portion of the large budget surplus as a bonus to citizens and channeled money to health care, education, and housing programs. Even greater attention was paid to those programs after the 2011 parliamentary elections, when opposition candidates made an unexpectedly strong showing. Notable was the creation of a compulsory health care insurance plan, which was to go into effect by the end of 2015.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 2007 a large salary increase received by Lee and other ministers brought widespread criticism. In response, Lee promised to donate a significant portion of his earnings to charity and to voluntarily subject himself to a salary freeze. Continued criticism of the high salaries, however, prompted the government in 2012 to cut the pay of ministers (including the prime minister) by about one-third and that of Singapore’s president by half."}, {"url": "https://www.pmo.gov.sg/The-Cabinet/Mr-LEE-Hsien-Loong", "page_content": "Mr Lee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to four consecutive Singapore General Elections victories in 2006, 2011, 2015 and 2020. He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency.\n\nMr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master in Public Administration.\n\nMr Lee was born on 10 February 1952. He married Dr Wong Ming Yang in 1978, and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr Lee enjoys reading, photography, walking, listening to classical music, and computer programming.\n\nBiodata"}, {"url": "https://pantheon.world/profile/person/Lee_Hsien_Loong/", "page_content": "Lee Hsien Loong\n\nLee Hsien Loong (Chinese: 李显龙; pinyin: Lǐ Xiǎnlóng; born 10 February 1952) is a Singaporean politician and former brigadier-general who has been serving as Prime Minister of Singapore and Secretary-General of the People's Action Party since 2004. He has been the Member of Parliament (MP) representing the Teck Ghee division of Ang Mo Kio GRC since 1991, and previously Teck Ghee SMC between 1984 and 1991. Born in Singapore during British colonial rule, Lee is the eldest son of Singapore's first prime minister, Lee Kuan Yew . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Lee Hsien Loong has received more than 4,600,922 page views. His biography is available in 63 different languages on Wikipedia (up from 59 in 2019) . Lee Hsien Loong is the 3,648th most popular politician (up from 4,335th in 2019), the 3rd most popular biography from Singapore and the 3rd most popular Singaporean Politician."}, {"url": "https://www.discoverwalks.com/blog/singapour/top-10-amazing-facts-about-lee-hsien-loong/", "page_content": "Top 10 Amazing Facts about Lee Hsien Loong\n\nShare\n\nPin\n\n\n\nLee Hsien Loong, a Singaporean politician and former brigadier general, was born on February 10, 1952. Since 2004, he has held the positions of Prime Minister of Singapore and Secretary-General of the ruling People’s Action Party (PAP).\n\nHe was the nation’s deputy prime minister from 1990 until 2004 before being named prime minister. Since 1991, he has served as the Member of Parliament (MP) for the Teck Ghee ward of the Ang Mo Kio GRC; from 1984 to 1991, he served as the Teck Ghee SMC MP. Lee Hsien Loong was born at KK Women’s and Children’s Hospital in Singapore on February 10, 1952, when Singapore was still a British colony.\n\nHe was the oldest child of Lee Kuan Yew and Kwa Geok Choo and the patriline grandson of Chua Jim Neo (1905-1980), a chef, and Lee Chin Koon (1903-1995), a retired storekeeper turned salesman. His mother has ancestors from Shantou and the Tong’an District of China.\n\nThe younger Lee, who frequently accompanied his father to rally sites, had mastered the Jawi script by the time he was five, according to the biography of Lee Kuan Yew.\n\nThese top 10 intriguing facts about Lee Hsien Loong will help you discover more about his fascinating life.\n\n1.Lee Hsien Loong knows four different languages\n\nIn addition to English and Mandarin, he is also proficient in Bahasa Melayu (he provides several speech segments in Malay, especially during the yearly National Day Rally). Oddly enough, he is also proficient in Russian, which he claims to have used, albeit rustily, five years ago:\n\n2 Lee Hsien Loong has battled cancer twice in his lifetime\n\nIn April 1993, after receiving a 1992 lymphoma diagnosis, he entered remission. PM Lee had a prostate cancer diagnosis more recently, in 2015, and underwent surgery to have his prostate gland removed.\n\n3.The female cabinet minister who serves in Lee Hsien Loong’s cabinet is a first for Singapore\n\n2009 saw the appointment of Lim Hwee Hua as Singapore’s first female full minister. The Workers’ Party won the 2011 General Election, ending her team’s tenure in government, which included former foreign minister George Yeo.\n\n4.The first Singaporean prime minister to apologise in public was PM Lee Hsien Loong\n\nIn reality, he did it twice—once in 2011 and again in 2017. The first public apology was made during the 2011 general election, a time of intense popular unrest toward the administration. The second apology was made after the controversy surrounding 38 Oxley Road, when his family’s problems were brought to the public’s attention.\n\n5.Lee Hsien Loong used to be a clarinet player in the marching band at his school\n\nHe played clarinet and was a part of the Catholic High School Band in 1968.\n\n6.After his father, the late Lee Kuan Yew, PM Lee is the second-longest-serving prime minister in Singapore\n\nDespite the fact that Singapore has only had three prime ministers to yet, 15 years and counting is nevertheless a significant accomplishment.\n\nFrom 1965 to 1990, or more than 25 years, LKY was Singapore’s first prime minister, and he is likely to continue holding the record for the longest tenure in our history.\n\nFrom 1990 to 2004, Emeritus Senior Minister Goh Chok Tong presided as PM before handing the reins to PM Lee.\n\n7.Even after accounting for inflation, PM Lee Hsien Loong remains the highest-paid PM of the three Singapore has had\n\nPM Lee makes around S$2.2 million year, according to the 2017 Review of Salaries report. And he’s been quite good about it, growth-wise at least, bucking recommendations to increase salaries and sticking to the same amount for the past few years.\n\nHe also doesn’t receive bonuses because there isn’t anyone to evaluate how he’s doing.\n\nThat being said… the late LKY earned S$9,500 per month back in 1973, which, with 13th-month added to it, amounted to roughly S$364,000 annually after adjusting for inflation to 2018.\n\n8.Singapore’s first senior wrangler is PM Lee Hsien Loong\n\nAt Cambridge, Lee Hsien Loong was the Senior Wrangler and the top-ranked student in the Math Tripos. He received 31 alphas, which is 12 more than the runner-up.\n\nHe was the class valedictorian and actually prevailed by a street. At the time, it was obvious who was superior, but the person who finished in second is today a top-tier mathematician.\n\n9.Lee Hsien Loong’s military career\n\nLee enlisted in the Singapore Armed Forces in 1971, and from 1974 to 1984 he was an officer. He attended the United States Army Command and General Staff College at Fort Leavenworth in 1978, and he has held a number of staff and command positions, including Chief of Staff of the General Staff and Director of the Joint Operations and Plans Directorate.\n\nAfter receiving a promotion in July 1983, Lee advanced swiftly through the ranks of the Singapore Army, becoming the nation’s youngest brigadier-general in history. Notably, he was given control of the rescue efforts after the Sentosa cable car accident.\n\nBefore departing the SAF in 1984 to pursue a career in civilian politics, Lee served as the commanding officer of the 23rd Battalion Singapore Artillery in the Singapore Army.\n\n10.Lee Hsien Loong in the PAP Youth committee\n\nFirst Deputy Prime Minister Goh Chok Tong and Lee spoke about how to persuade younger Singaporeans to join the party in March 1986. Goh was adamant that the planned committee should only draw in the right types of people, and he disapproved of financial incentives.\n\nThe purpose of the proposed youth wing was to promote system development from within and give new members a stake in the nation’s future.\n\nLater, Lee said that the leadership’s anxieties about the younger generation voting for opposition parties and possibly toppling the PAP administration were the driving force behind the creation of the youth wing.\n\nThe youth wing was a “tailor-made” mechanism created by the government to promote opposing views.\n\nLee served as the inaugural chairman of the PAP Youth Committee, the organization that preceded Young PAP, when it was established. Lee enjoys computer programming, he constructed a Sudoku solver during his coding time."}, {"url": "https://www.straitstimes.com/singapore/no-regrets-in-choosing-a-political-career-over-mathematics-pm-lee", "page_content": "SINGAPORE – Getting Singaporeans to trust him is an “unending task”, said Prime Minister Lee Hsien Loong.\n\n“But after many years, having been in the public eye for many years, people know you and they have seen you. They have seen your conduct, they have heard what you have said,” he said in an interview with broadcaster China Central Television (CCTV) that aired on Friday.\n\n“Look and see what happens in different situations. Are you there for them or not? Are you still reliable under pressure? Do you have a message and hope for them? And gradually, you can build up. It takes time.”\n\nPM Lee was responding to a question on his leadership as the hour-long interview took a more personal turn, following a discussion about geopolitics, foreign policy and Singapore-China relations.\n\nHe said he does not regret choosing to be a politician rather than a mathematician.\n\nHe studied maths during his undergraduate days at the University of Cambridge in Britain.\n\n“I was not a rising star. I was a promising student,” he told his interviewer, Ms Esther Zou, who replied that he was being modest.\n\n“No, it is a vast field. I did two undergraduate years in mathematics, so it is just barely at the foothills...\n\n“I decided that I had the responsibility to come back to Singapore, be part of Singapore, and do what I could to help the country to succeed,” he said.\n\nIt has been a very fulfilling life, said PM Lee, who joined politics in 1984 at the age of 32, becoming the MP for Teck Ghee.\n\nHe has been prime minister since 2004, and is expected to hand over the reins to Deputy Prime Minister Lawrence Wong.\n\nBeing in government for nearly 40 years now is “tremendously” intellectually stimulating, said PM Lee, because of the need to deal with a wide range of issues, including keeping Budgets balanced.\n\nBut it is never just numbers, he said. “The numbers have to work, but you must be able to make it work in terms which people can understand, accept and want to see. What difference does it make to somebody’s life? Why does it matter to them?”\n\nThese are often intangible issues that are difficult to settle.\n\n“You cannot say, ‘Done, proven, QED, put aside, next problem,’” he said, referring to the Latin phrase often used in maths, “quod erat demonstrandum” or “which was to be demonstrated”."}, {"url": "https://biographymask.com/lee-hsein-loong/", "page_content": "Lee Hsien Loong is a Singaporean politician and former army general to the Prime Minister of Singapore. Similarly, Lee Hsien Loong is also working as the secretary-general of the ruling People’s Action Party since the year 2004. Moreover, he is the eldest son of Prime Minister of Singapore Lee Kuan Yew.\n\nEarly Childhood\n\nLee Hsien Loong whose Chinese name is Li Xianlong was born on 10th February 1952 and is currently 71 years old at present. Being born in early February, his zodiac sign is Aquarius. Likewise, Lee was born in British Singapore and is a Singaporean by nationality. Similarly, talking about her ethnicity and religion, he belongs to an Asian ethnic group and follows Buddhism. Likewise, about his family members, Lee Hsein was born to Lee Kuan Yew and Kwa Geok Choo. He is the eldest child of his parents. Similarly, Lee has two other siblings who are younger than him.\n\nLikewise, his siblings are one sister Lee Wei Ling and one brother Lee Hsien Yang. His brother Yang is the chairman of the Civil Aviation Authority of Singapore. Likewise, his parents, Lee Kuan Yew is the popular founding father of independent Singapore. Similarly, he is also the first Prime Minister of Singapore who has served in the office from the year 1959 to 1900. Likewise, her mother Kwa Geok Choo was the pioneer advocate of Singapore’s women’s rights.\n\nFurthermore, talking about his educational background, Lee did his early education from Nanyang Primary School and later join to Catholic High School for his secondary education. Likewise, after graduating in the year 1969, he went to National Junior College for his post-secondary studies. Followed by this, in the year 1971, he joins Singapore Armed Forces and at the same time, he got scholarship for studying mathematics at Trinity College under the University of Cambridge. Followed by this, he then graduate with first class honors and a diploma in Computer Science. Similarly, he attend the United States Army Command and General Staff College at Fort Leavenworth in the year 1978. Likewise, he did his master’s in Public Administration at the John F. Kennedy School of Government at Harvard University.\n\nProfessional Life\n\nFollowed by his graduation from Harvard, Lee then joins Singapore Armed Forces and then quickly rose through the ranks. Moreover, he became the Brigadier General of the force in the year 1983 however, in the year 1984 he resign it to join politics. Lee joined the ruling People’s Action Party which was a center-right political party led by his father Lee Kuan Yew. Moreover, it has been the dominating political group of Singapore right from the 1959 general election. In the same year, Lee became elected as a Member of Parliament from Teck Ghee Single Member Constituency and also became the Minister of State at the Ministry of Trade and Ministry and Ministry of Defense. He was only 32 years old at that time.\n\nLikewise, on another year, Lee became the Chairman of the Economic Committee which was set to retrieve the economy of Singapore. Similarly in the year 1986, Lee became a member of the PAP Executive Committee and also the Chairman of PAP Youth Committee. Moreover, his career in politics took a breakthrough when his father Lee Kuan Yew stepped down from his long held position of Prime minister. He was appointed as one of the Deputy Prime Ministers in the new setup. Similarly, he also retains the Trade and Commercial portfolio.\n\nHowever, in the year 1992, Lee gave up his Trade and Commerce portfolio after being diagnosed with lymphoma and underwent long treatment. However, later he retains his position as the Deputy Prime Minister. Moreover, on 12th August 2004, Goh Chok Tong step down from his position as the Prime Minister of Singapore, Lee then became his successor in the position.\n\nLee Hsein Loong – Net worth 2023\n\nTalking about his net worth and earnings, Lee is a politician by profession. Moreover, he is one of the world’s highest-paid leaders. However, he has not yet shared any information about his net worth and earnings in media.\n\nAchievements\n\nHowever, he has made quite a fame in his career. Similarly, he became the ‘Order El Sol del peru en el grado de Gran Cruz con Brillanted’ on 22nd November 2008. Similarly, he also got the ‘Olympic Order’ on 13th August 2010.\n\nRelationship Status\n\nRegarding his relationship status, Lee is straight and in a marital relationship. On the year 1985, he tied the knot with Ho Ching who is a civil servant under the Ministry of Defense. This couple has two sons together whose names are Hongyi and Haoyi. However, before this, he tied the knot with Malaysian-born doctor Wong Ming Yang. They have two children together one daughter and one song Xiuqi and Yipeng together but Wong died on 28th October 1982 after three weeks of giving birth to Yipeng.\n\nLee Hsien Loong – Body Measurement 2022\n\nUnfortunately, there is no information about his body measurement detail in media.\n\nLee Hsien Loong – Social Media 2022\n\nReflecting upon his social media presence, Lee is active in Facebook, Twitter, and Instagram. Likewise, his Twitter account is @leehsienloong, and has had 801.8k followers since he joined in April 2009. Similarly, his @leehseinloog account in Instagram has over 606k followers. Likewise, his @leehsienloong has over 1.7 million followers on Facebook."}, {"url": "https://www.newshub360.net/richest-politicians-in-singapore/", "page_content": "Richest Politicians in Singapore 2023\n\nRichest Politicians in Singapore and their Net Worth. Wealthiest Singaporean Billionaires High ministerial salaries is one of the hottest topics in Singapore. The World renowned ranking organization, Forbes, annual listing of billionaires, for three consecutive years.\n\nHere’s a list of The Top 10 Richest Politicians in Singapore and their Net Worth\n\n10. George Yeo Net Worth – US $ 28.6 million\n\nGeorge Yeo is a politician from Singapore and currently Chancellor of the Nalanda University and the also the member of the Governing Board of Nalanda University.\n\nHe did serve as a Member of Parliament from 3 September 1988 to 7 May 2011, and as our Minister for Foreign Affairs for almost 7 years. Since resigning from politics, Yeo had a stint at Nalanda University from 2011 to 2016 as a chancellor and member of governing board.\n\nGeorge Yeo is currently the chairman and executive director of Kerry Logistics Network, director of Kerry Holdings, and non-executive director of Wilmar International as well as AIA Group.\n\nAlso member of the PAP who served as the Minister of Information and Arts, Minister of Trade and Industry, Minister of Health, Minister of Foreign Affairs from 1991 to 2011. George Yeo estimated net worth is US $ 28.6 million and he is ranked at No. 10 in the list of top 10 richest politician of Singapore.\n\n9. Charles Chong Net Worth- US $ 30 million\n\nCharles Chong is a Member of Parliament representing Punggol East SMC, and serves as the Deputy Speaker of Parliament, to Tan Chuan Jin who is the current Speaker.\n\nChong is relatively lower-profile compared to the rest on this list, his most notable moment in recent memory probably when he won Punggol East SMC back from the Worker’s Party in 2015 with 51.76% of the vote.\n\nCharles Chong estimated net worth is US $ 30 million and he is ranked in the last at 9th position in the list of top 10 richest politician of Singapore as appeared in financial magazines such as Forbes and Bloomberg.\n\nShare To Facebook Groups\n\n8. Vivian Balakrishnan Net Worth- US $ 34.2 million\n\nVivian Balakrishnan is our current Minister of Foreign Affairs, and has helmed the Ministry since 1 October 2015.Previously, he had held the posts of Minister for Community Development, Youth and Sports, and Minister for the Environment and Water Resources. In addition, he is also in charge of the Smart Nation Programme, which aims to keep Singapore abreast of latest technological developments.\n\nREAD MORE : Top 10 Richest People In Singapore 2023\n\n7. Low Yen Ling Net Worth – $40.8 million\n\nOur first female minister on this list, Low Yen Ling is the Senior Parliamentary Secretary of the Ministry of Education, a post she has held since 1 May 2017. Prior to the posting, she also held posts of Parliamentary Secretary for the Ministry of Social and Family Development (MSF), as well as Senior Parliamentary Secretary for the Ministry of Trade and Industry.\n\nOur first female minister Low Yen Ling estimated net worth is $40.8 million.\n\n6. Chiam See Tong Net worth – $50.7 million\n\nAt 83 years of age, Chiam See Tong held the title as the longest serving opposition Member of Parliament of Potong Pasir SMC from 1984 to 2011.\n\nChiam See Tong only recently ceded the title to Worker’s Party Low Thia Khiang, who has just passed the 27th year mark of service as an Opposition MP this year. Chiam was the founding leader of the Singapore Democratic Party, as well as the Singapore People’s Party.\n\n5. Grace Fu Net worth – $64.5 million\n\nThe only other female politician on this list, Grace Fu is the current Minister for Culture, Community and Youth, a role she has held since 1 October 2015.\n\nShe is only the second female full Minister since Lee Hwee Hua, who retired from politics in 2011, making Fu the only female full Minister currently.\n\nCHECK THIS OUT : Top 10 Richest Sportsmen in Singapore 2023\n\n4. Goh Chok Tong Net Worth – $81.2 million\n\nPerhaps most Singaporeans will be able to predict who the top four richest politicians are. Goh Chok Tong served as our second Prime Minister from 1990 to 2004, taking on perhaps one of the most difficult tasks politically – succeeding Lee Kuan Yew.\n\n3. Teo Chee Hean Net Worth- $95.4 million\n\nOur other Deputy Prime Minister, Teo Chee Hean is currently also serving as the Co-ordinating Minister for National Security and Minister-in-charge of the Civil Service.\n\n2. Tharman Shanmugaratnam Net Worth -$106.2 million\n\nPerhaps Singapore’s current most capable and popular politician, and in our point of view deservedly so, this man has unfortunately ruled himself out of the running for Singapore’s next Prime Minister.\n\nTharman Shanmugaratnam is currently serving as wait for it Deputy Prime Minister of Singapore, Coordinating Minister for Economic and Social Policies, Chairman of the Monetary Authority of Singapore, and Chairman of the Group of Thirty a group comprising thirty of the finest policymakers and financial experts in the world.\n\nCHECK THIS : Top 10 Richest Celebrities in Singapore 2023\n\n1. Lee Hsien Loong Net Worth -$108.6 million\n\nPrime Minister Lee Hsien Loong is Singapore’s third and current PM, and has been our incumbent PM since 3 December 2004. The eldest son of founding father Lee Kuan Yew, LHL joined politics in 1984, and served as the Ministers of Finance, Trade and Industry, and Deputy Prime Minister prior to his current role.\n\nHe is also married to Ho Ching, CEO of Temasek Holdings since 2002, and currently ranked the 28th most powerful woman in the world by Forbes.PM Lee Hsien Loong is currently the highest paid world leader globally, despite a 2011 pay cut which reduced his salary to a mere S$2.2 million per year.\n\nCHECK THIS : Lee Hsien loong Salary Per Month 2023\n\nLee Hsien Loong estimated net worth is $108.6 million, and he is ranked at No. 1 in the list of top 10 richest politician of Singapore as given the impression in financial magazines such as Forbes and Bloomberg.\n\nTop 10 Richest Politicians in Singapore 2023 – Newshub360.net\n\nShare To Facebook Groups\n\nCHECK THIS OUT :\n\n♦ Lee Hsien loong Net Worth 2023\n\n♦ Top 10 Richest Politicians in Singapore 2023\n\n♦ Top 10 Richest Sportsmen in Singapore And Their Net Worth\n\n♦ Top 5 Singapore Celebrities With Impressive University Degrees\n\n♦ Top 10 Schools in South Africa That Charge More than R200,000 Fees\n\n♦ University Rankings in South Africa Released [UCT is 2nd ]\n\n♦ Top 10 Best High Schools in Durban, 2023 [ Durban High School is 2nd ]\n\n♦ Top 10 Best Private Schools In Johannesburg [ St. Martin’s is 3rd ]\n\n♦ Top 10 South African Universities With The Best Academic Performance\n\n♦ Top 10 Best Boarding Schools in Gauteng [ Parktown Boys is 2nd ]\n\n♦ Top 10 Best Girl’s High Schools in South Africa [ Durban Girls is 3rd ]\n\n♦ Top 10 SA Female Celebrities With First Class Honours [ University Degrees ]\n\n♦ Top 10 Best High Schools in Johannesburg [ St John’s College is 2nd ]\n\n♦ Top 10 Best Primary Schools in Johannesburg [ Melpark School is 2nd ]\n\nCredit : Newshub360.net"}, {"url": "https://ethnicelebs.com/lee-hsien-loong", "page_content": "Place of Birth: Singapore\n\nDate of Birth: 10 February, 1952\n\nEthnicity: Chinese [Hakka, Peranakan]\n\nLee Hsien Loong is a Singaporean politician. He is the third Prime Minister of Singapore, having served in the position, since 12 August, 2004. He has also been the 3rd Secretary-General of the People’s Action Party, from 3 December, 2003, and Minister for Finance, from 10 November, 2001 to 1 December, 2007, among other duties.\n\nHis father, Lee Kuan Yew, was the first Prime Minister of Singapore, from 3 June, 1959 to 28 November, 1990. His mother was Kwa Geok Choo. He is married to Ho Ching. He was previously married to Wong Ming Yang, until her death. He has two children with Wong and two children with Ho.\n\nLee Hsien Loong’s patrilineal ancestry can be traced back to his 26th great-grandfather, Lee Huo De.\n\nLee Hsien Loong’s paternal grandfather was Lee Chin Koon (the son of Lee Hoon Leong and Ko Liem Nio). Lee Chin Koon was a Chinese Indonesian emigrant, from Semarang, Central Java. Lee Hoon Leong was the son of Lee Bok Boon and Seow Huan Neo. Lee Bok Boon emigrated from Dabu County, Guangdong province, China, to Singapore in 1863.\n\nLee Hsien Loong’s paternal grandmother was Chua Jim Neo (the daughter of Chua Kim Teng and Neo Ah Soon). Chua Jim Neo was Peranakan. Lee’s great-grandfather Chua the son of Ying Chiang Chua and Chia Bee Tan.\n\nLee Hsien Loong’s maternal grandfather was Kwa Siew Tee (the son of Kwa Wan Tjioe and Tan Bit Nio). Kwa Siew Tee was a Chinese Indonesian emigrant, from Semarang, Central Java. Kwa Wan Tjioe was the son of Kwa Khay It and Tan Giok Nio.\n\nLee Hsien Loong’s maternal grandmother was named Wee Yew Neo (the daughter of Wee Theam Seng). Wee Theam Seng was the son of Wee Kay Chiang and Goh Teck Neo.\n\nSource: Genealogy of Lee Hsien Loong – https://www.geni.com"}, {"url": "https://wikispooks.com/wiki/Lee_Hsien_Loong", "page_content": "Lee Hsien Loong is a Singaporean politician and son of Singapore founder Lee Kuan Yew. Trained in Britain and the US, and selected a Global Leader for Tomorrow by the World Economic Forum in 1993, he has been Prime Minister of Singapore and secretary-general of the ruling People's Action Party (PAP) since 2004. After introducing a law against fake news 2019, he led the city state's active participation through the COVID-19 deep event, with preplanning, lockdowns,RNA-vaccines and vaccine passports.\n\nEarly Life\n\nBorn in British Singapore, Lee is the eldest son of Singapore's first prime minister, Lee Kuan Yew. He studied in Trinity College at the University of Cambridge, graduating in 1974 with a bachelor's degree in mathematics and a master's degree in computer science. In 1980, he earned a Master of Public Administration at Harvard University's Kennedy School of Government. From 1971 to 1984, he served in the Singapore Armed Forces (SAF), where he rose to the rank of Brigadier-General. He entered civilian politics in 1984 as a Member of Parliament.\n\nPolitics\n\nLee served in various ministerial appointments under Goh before succeeding him as prime minister in 2004. In his first two years, his government enacted a \"five-day work week\" and extended maternity leave days. His proposal to build two Integrated Resorts (IRs) in Singapore to increase tourism revenue led to the development of the Marina Bay Sands and Resorts World Sentosa. Following the 2009 Recession, he oversaw the country's economic recovery within two years. Political reforms in 2010 legalised online activism and increased the number of non-constituency members of parliament (NCMPs) in Parliament.\n\nHis government has advocated Goods and Services Tax (GST) hikes to fund social spending and infrastructure development, with the GST expected to be raised from 7% to 9% by 2025. In 2019, his government introduced the insidious Protection from Online Falsehoods and Manipulation Act (POFMA) to combat online misinformation. That year, Lee reshuffled his cabinet and promoted Heng Swee Keat to deputy prime minister.\n\nIn foreign policy, Lee's government's policy has been to stay neutral in an era of great power competition between China and the United States. Under Lee, both the Chinese and Singaporean governments have cooperated on projects, with Lee's government backing China's Belt and Road Initiative as one of its largest investors. At the same time, Singapore has a close defence relationship with the United States, signing the Strategic Framework Agreement (SFA) in 2005 to cooperate on terrorist and cybersecurity threats. Lee's government has had complex and fraught relations with Malaysia, particularly with regard to water supply and territorial claims, although the countries have agreed to work on cross-border projects such as the Johor Bahru–Singapore Rapid Transit System.\n\nProtection from Online Falsehoods and Manipulation Act 2019\n\nThe Protection from Online Falsehoods and Manipulation Act 2019, commonly abbreviated as POFMA and known colloquially as Fake News Law,[1] is a statute of the Parliament of Singapore that enables authorities to tackle the spread of fake news or false information. The law is designed specifically to allow authorities to respond to fake news or false information through a graduated process of enforcing links to fact-checking statements, censorship of website or assets on social media platforms, and criminal charges.[2] Reporters Without Borders called the bill \"terrible\", \"totalitarian\", and a tool for censorship.[3]\n\n\n\n\n\nEvents Participated in\n\n\n\n\n\nReferences\n\n\n\n"}, {"url": "https://www.channelnewsasia.com/singapore/tharman-shanmugaratnam-president-lee-hsien-loong-letters-election-3547731", "page_content": "SINGAPORE: Senior Minister Tharman Shanmugaratnam on Thursday (Jun 8) informed Prime Minister Lee Hsien Loong of his decision to retire from politics and all positions in government, in order to contest Singapore's presidential election.\n\nThis is Mr Tharman's letter to Mr Lee, in full:\n\nDear Prime Minister Lee,\n\nI wish to inform you that I have decided to put myself forward as a candidate in the forthcoming Presidential Election. I hence wish to retire from politics and all my positions in Government.\n\nI intend to resign from the People's Action Party, and step down as Senior Minister and Coordinating Minister for Social Policies. I plan to do so a month from now (on 7 July 2023), so that I can first fulfil my immediate official commitments in Singapore and internationally, and ensure that arrangements are fully in place for constituents of Jurong GRC to be well­ served for the rest of the electoral term.\n\nLikewise, I will step down as Chairman of the Monetary Authority of Singapore (MAS), Deputy Chairman of the Government of Singapore Investment Corporation (GIC), Chairman of the Economic Development Board's International Advisory Council and other responsibilities that I have been undertaking in my Ministerial capacity.\n\nI have been humbled by the requests I have received in recent months, from Singaporeans from different walks of life, to stand in the Presidential Election if President Halimah chose not to stand again.\n\nIt has been a difficult decision. I have consulted my family, and given careful thought to how I can best serve the country in the years ahead.\n\nI have spent my whole working life committed to the public service and advancing Singapore's interests. I started off as a professional economist at the MAS. I went on to join the civil service, and asked specifically to serve at the Ministry of Education. I later returned to the MAS when you were Chairman to work with you to stabilise the financial system during the Asian Financial Crisis and reorient how we regulated and developed the system, serving first as Deputy Managing Director and then as Managing Director.\n\nHowever, my greatest privilege has been to serve in politics over the last 22 years. As Member of Parliament (MP), helping residents overcome difficulties and fulfil their aspirations. In my ministerial responsibilities in Government as we made major shifts to build a more inclusive society and restructure the economy. In advancing Singapore's standing through my leadership of various international councils. And in the non-government sector, where I have chaired the board of the Ong Teng Cheong Labour Leadership Institute for two decades and that of SINDA over the last 12 years, and supported other civic organisations.\n\nWe are in a time of transition, both in Singapore and internationally. The '4G' team under DPM Lawrence Wong has been shaping up very well, consulting actively with the public, and rethinking our strategies for the future. The challenges they have to take on will keep evolving, however, well beyond the handover of leadership. They will have to tackle new global crises that will surely emerge, work closely with Singaporeans to retain trust in a changing domestic environment, and ensure Singapore's appeal and relevance in a more divided world.\n\nI believe that I can now best serve Singapore not in politics, but in a different role that has to be above politics. If I am fortunate enough to be elected as President, I will represent the unity of Singaporeans, of all races and religions, social backgrounds, and political leanings, at a time when views in the population are becoming more diverse.\n\nI will be thorough and impartial in fulfilling the constitutional duties of the President with regard to the prudent use of the nation's reserves and the key appointments which preserve the integrity of the Singapore system. I will also work to the best of my abilities to project Singapore's interests and voice of reason in an increasingly turbulent world.\n\nMy greatest sadness is in retiring as an MP on the ground, having built deep-rooted relationships with residents and volunteers in Taman Jurong and the rest of Jurong GRC. I hope to maintain these friendships, many of which go back decades. I am assured that my dedicated fellow MPs in Jurong will work doubly hard to serve all our residents fully during the current electoral term.\n\nI am deeply grateful for the opportunities I have been given to serve Singapore. I am particularly thankful for your leadership, advice and openness to collegial debate through the years, for the teamwork and contributions of all my colleagues in Government, and for the guidance provided by then-PM Mr Goh Chok Tong and his team when I came into Cabinet.\n\nMy role vis-a-vis the Government will change fundamentally if I am elected President. What will never change is my conviction in the continuing Singapore story: a society where everyone has the support to uplift themselves regardless of their starting point in life, and a multiracial nation whose citizens take pride in its unique identity and feel a deepening sense of togetherness.\n\n"}], "Lee Hsien Loong is the current Prime Minister of Singapore.": [{"url": "https://www.pmo.gov.sg/The-Cabinet/Mr-LEE-Hsien-Loong", "page_content": "Mr Lee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to four consecutive Singapore General Elections victories in 2006, 2011, 2015 and 2020. He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency.\n\nMr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master in Public Administration.\n\nMr Lee was born on 10 February 1952. He married Dr Wong Ming Yang in 1978, and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr Lee enjoys reading, photography, walking, listening to classical music, and computer programming.\n\nBiodata"}, {"url": "https://www.britannica.com/biography/Lee-Hsien-Loong", "page_content": "father Lee Kuan Yew ...(Show more)\n\nLee Hsien Loong, (born February 10, 1952, Singapore), Singaporean politician who was the third prime minister of Singapore (2004– ).\n\nLee was born and raised in Singapore, the son of Lee Kuan Yew, the city-state’s first prime minister (1959–90). Lee distinguished himself academically, studying mathematics and graduating with a first-class degree (1974) from the University of Cambridge before earning a master’s degree (1980) in public administration from Harvard University’s Kennedy School of Government. He then became an officer in the Singaporean military, eventually rising to the rank of brigadier general.\n\nLee’s political career began in 1984 when he joined his father’s party, the ruling People’s Action Party. Later that year he was elected to Parliament and was also appointed minister of state in both the Ministry of Trade and Industry and the Ministry of Defense. In 1985 he chaired the Economic Committee, which recommended a large tax reduction and the implementation of a consumption tax. A year later he was elected to his party’s Central Executive Committee, and in 1987 he became minister for trade and industry and second minister of defense. Lee assumed the position of deputy prime minister immediately upon the ascension of his father’s successor as prime minister, Goh Chok Tong, in 1990. Lee was treated for lymphoma in the early 1990s. The cancer ultimately went into remission, and he made a vigorous return to political life, serving as chairman of the Monetary Authority of Singapore (1998–2004) and as finance minister (2001–07).\n\nOn August 12, 2004, Lee assumed office as prime minister of Singapore, replacing the outgoing Goh. The transition had been planned and occurred without an election. Lee’s father was appointed to the newly created cabinet post of “minister mentor,” and Goh remained as the senior cabinet member; both men resigned from the cabinet in 2011. In addition, Lee’s wife, Ho Ching, served as executive director of the government-run investment firm Temasek Holdings, which owned stakes in some of Singapore’s largest companies. The cabinet included for the first time two female ministers of state; it was made up primarily of appointees who had been reassigned from other ministry posts.\n\nWhile observers expected Lee to retain tight control over the prosperous city-state, he appeared sensitive to the desire among many Singaporeans for a more open society. He promised to permit greater freedoms in a country where rigid social policies and limits on political expression were strictly enforced. Revised guidelines on free speech were announced shortly after Lee was sworn in, but while certain restrictions were eased—licenses for indoor political meetings were no longer required, for example—many remained intact. During his tenure as prime minister, Lee was subject to charges of nepotism and corruption and, as had his father, took a number of his detractors to court for libel. Though he was successful in such legal proceedings, he drew disapprobation over what was perceived internationally as the suppression of free speech.\n\nLee championed the legalization of gambling in 2005, attracting significant foreign investment in the development of casino facilities. His 2006 economic package disbursed a portion of the large budget surplus as a bonus to citizens and channeled money to health care, education, and housing programs. Even greater attention was paid to those programs after the 2011 parliamentary elections, when opposition candidates made an unexpectedly strong showing. Notable was the creation of a compulsory health care insurance plan, which was to go into effect by the end of 2015.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 2007 a large salary increase received by Lee and other ministers brought widespread criticism. In response, Lee promised to donate a significant portion of his earnings to charity and to voluntarily subject himself to a salary freeze. Continued criticism of the high salaries, however, prompted the government in 2012 to cut the pay of ministers (including the prime minister) by about one-third and that of Singapore’s president by half."}, {"url": "https://www.reuters.com/world/asia-pacific/singapore-pm-appoints-finmin-wong-new-deputy-premier-2022-06-06/", "page_content": "[1/2] Singapore Minister Lawrence Wong seen in this picture at the Southeast Asian Games in 2015. Prime Minister Lee Hsien Loong has said Wong would succeed him as PM. Mandatory Credit: Singapore SEA Games Organising Committee / Action Images via Reuters/File Photo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSINGAPORE, June 6 (Reuters) - Singapore Prime Minister Lee Hsien Loong on Monday named finance minister and chosen successor Lawrence Wong as his new deputy effective next week, paving the way for him to become the city state's next leader.\n\nWong, 49, was picked in April as leader of the People's Action Party's (PAP) so-called fourth generation team but the timeframe for a change in power in the ruling party remains unclear.\n\nLee, 70, has previously said Wong would succeed him either before or after the next general election, which is due in 2025.\n\n\"The next generation leadership is taking shape. I ask everyone to give your full support to this important transition, to steer Singapore safely out of the pandemic and into a brighter future,\" Lee said in a Facebook post on Monday.\n\nWong said in a Facebook post he was taking on \"possibly (the) biggest responsibility\" of his life.\n\n\"I seek your support, as I take on my latest appointment...to steer Singapore through the many challenges we are facing today,\" he said.\n\nMonday's announcement included the moving of several other political office-holders to different ministries.\n\nWong, who headed Singapore's COVID-19 taskeforce, will continue in his current role of finance minister while serving as deputy prime minister, according to an official statement. He would stand in for Lee as the leader in the event of his absence.\n\nSingapore has been governed by the PAP since its 1965 independence and leadership succession is usually a carefully planned affair.\n\nFelix Tan, a political analyst at Nanyang Technological University, said Wong's appointment would ensure a smoother transition to the top job, which is unlikely to be imminent.\n\n\"This will give him some leeway to familarise himself in the role, give him the chance to form a new cabinet or at least be involved in the decision-making process of forming a new cabinet,\" he said.\n\n\"I don't necessarily think PM Lee is going to step down anytime soon. Perhaps we would see a timeframe of a year or two, which will bring us closer to the next general election.\"\n\nReporting by Chen Lin; Editing by Martin Petty\n\n\n\n\n\n\n\n\n\n\n\nOur Standards: The Thomson Reuters Trust Principles."}, {"url": "https://time.com/6285748/singapore-tharman-shanmugaratnam-president/", "page_content": "Since he entered Singaporean politics just over two decades ago, Tharman Shanmugaratnam has shied away from persistent calls by the public that he should be the Southeast Asian country’s next Prime Minister. An extremely popular lawmaker who has risen the ranks of the ruling People’s Action Party (PAP) and is even liked among members of the opposition, Tharman has insisted he’s not right for the top job. He even likened his governing skills to soccer, saying he is better as a team player who can provide assists than as the star who scores the goals. “I enjoy,” he told Fareed Zakaria in 2015, “making the long passes. But I am not the striker.”\n\nNow, however, it seems like Tharman, 66, is ready to hang up his boots altogether and take on the arguably more visible—albeit on the sidelines—role of mascot. On Thursday, Tharman, currently a Cabinet minister, announced his resignation from government and intention to run for President, a largely ceremonial role with a smattering of constitutional duties.\n\nIt’s a far cry from seeking the premiership—currently held by Lee Hsien Loong, who is the son of Singapore’s founding Prime Minister and who is expected to retire and handpick his successor before the country’s next general election in 2025—but it’s a move that helps sidestep for now the looming question of whether the Chinese-majority city-state (or its ruling party) of 6 million people that touts its multiracial, pluralistic society is ready or reluctant to elevate a racial minority to the head of government. (Tharman is ethnically Tamil, while all three of Singapore’s Prime Ministers since its founding have been of Chinese descent.)\n\nMore from TIME\n\n“If I am fortunate enough to be elected as president, I will represent the unity of Singaporeans, of all races and religions, social backgrounds and political leanings, at a time when views in the population are becoming more diverse,” Tharman wrote in his resignation letter to Lee on June 8. “I believe that I can now best serve Singapore not in politics, but in a different role that has to be above politics.”\n\nWhile the veteran statesman is the first to throw his hat into the ring for the presidential election—which is set to take place sometime before September 13, when incumbent President Halimah Yacob’s term ends (Halimah announced last month that she would not be seeking re-election)—it will be very difficult for any other candidate to beat Tharman in the popular vote.\n\nTharman has enjoyed immense popularity in parliamentary elections, repeatedly earning from his constituency among the largest margins of victory at the polls in the country. And in 2016, an overwhelming majority of Singaporeans preferred him to succeed Lee as the next Prime Minister, according to a Yahoo News poll.\n\nFor his part, Tharman has long dismissed the possibility of becoming Prime Minister, saying he is not inclined for the position. Yet his sheer popularity has at times forced other PAP officials to confront the country’s delicate racial politics, with party leaders sometimes suggesting that the older generation of Singaporeans would not be comfortable with a non-Chinese Prime Minister while government critics have suggested that it’s the party itself that is uncomfortable with the notion. Meanwhile, Singapore has had multiple Presidents of minority backgrounds, including of Malay and Indian descent, since its independence from Malaysia in 1965.\n\nAlthough candidates for President are not permitted to belong to a political party, and Tharman is also leaving the PAP, Prime Minister Lee effectively endorsed Tharman’s bid in a public response to his resignation, saying: “Your departure from the Cabinet and the Party will be a heavy loss.”\n\n“We will miss your leadership, insightful views, and wise counsel. But I understand why you have decided to make this move and run for president. It is in keeping with the spirit of public service and sense of duty that you have shown all these years,” Lee added. “Your international stature and your experience in government and politics will also stand you in good stead as you represent the nation domestically and abroad.”\n\nWho is Tharman Shanmugaratnam?\n\nTharman, a Singapore native, has an extensive academic background, obtaining degrees from the London School of Economics, the University of Cambridge, and Harvard University’s Kennedy School of Government. He was chief economist of the Monetary Authority of Singapore (MAS)—the country’s central bank—before making his political debut in November 2001 after being elected to represent the Jurong district.\n\nSince then, Tharman has taken on various government roles, including handling the finance and education ministerial portfolios. In 2011, he was appointed as deputy Prime Minister and as MAS chairman. To embark on his presidential bid, he will be leaving his current duties as senior minister and coordinating minister for social policies as well as his positions as MAS chair, deputy chair of the Government of Singapore Investment Corporation, and chairman of the Economic Development Board’s International Advisory Council. Tharman said his resignation will take effect July 7.\n\nThroughout his career, Tharman has also held important international appointments. He co-chairs the Global Commission on the Economics of Water and is chairman of the Board of Trustees of the Group of 30, a global body of economic and financial leaders and academics. Tharman was also the first Asian chair of the International Monetary Fund’s policy forum and was believed to be on the shortlist to become the next IMF chief.\n\nTharman is known for his grassroots approach to politics and attention to social mobility, which has won the hearts of Singaporeans across political factions. In an interview with BBC Hardtalk presenter Stephen Sackur in Switzerland in 2015, Tharman described Singapore’s approach to social policies not as a safety net but rather a “trampoline”—a response that went viral.\n\nWho else is in the running?\n\nNo one else has fielded their candidacy, yet, but Prime Minister Lee’s estranged younger brother, Lee Hsien Yang, said in March that he is considering running.\n\nTo be eligible to run for President, one must be a Singaporean citizen, not younger than 45 years old, and resident in the country for at least 10 years. Candidates also must satisfy the Presidential Elections Committee that they are of integrity, good character, and reputation; and they must convince the Committee that they have met specific public or private service requirements.\n\nIf anything, Tharman is seen as more than qualified. “He’s been the architect of a lot of key financial policies that created financial stability for Singapore,” Bridget Welsh, an honorary research associate at the University of Nottingham in Malaysia, tells TIME. “The fact that he is good moving to the role of the presidency, which is largely a ceremonial role, it shows to a certain degree, the need of the PAP to have somebody strong in that position.”\n\nContact us at letters@time.com."}, {"url": "https://www.channelnewsasia.com/singapore/tharman-shanmugaratnam-president-lee-hsien-loong-letters-election-3547731", "page_content": "SINGAPORE: Senior Minister Tharman Shanmugaratnam on Thursday (Jun 8) informed Prime Minister Lee Hsien Loong of his decision to retire from politics and all positions in government, in order to contest Singapore's presidential election.\n\nThis is Mr Tharman's letter to Mr Lee, in full:\n\nDear Prime Minister Lee,\n\nI wish to inform you that I have decided to put myself forward as a candidate in the forthcoming Presidential Election. I hence wish to retire from politics and all my positions in Government.\n\nI intend to resign from the People's Action Party, and step down as Senior Minister and Coordinating Minister for Social Policies. I plan to do so a month from now (on 7 July 2023), so that I can first fulfil my immediate official commitments in Singapore and internationally, and ensure that arrangements are fully in place for constituents of Jurong GRC to be well­ served for the rest of the electoral term.\n\nLikewise, I will step down as Chairman of the Monetary Authority of Singapore (MAS), Deputy Chairman of the Government of Singapore Investment Corporation (GIC), Chairman of the Economic Development Board's International Advisory Council and other responsibilities that I have been undertaking in my Ministerial capacity.\n\nI have been humbled by the requests I have received in recent months, from Singaporeans from different walks of life, to stand in the Presidential Election if President Halimah chose not to stand again.\n\nIt has been a difficult decision. I have consulted my family, and given careful thought to how I can best serve the country in the years ahead.\n\nI have spent my whole working life committed to the public service and advancing Singapore's interests. I started off as a professional economist at the MAS. I went on to join the civil service, and asked specifically to serve at the Ministry of Education. I later returned to the MAS when you were Chairman to work with you to stabilise the financial system during the Asian Financial Crisis and reorient how we regulated and developed the system, serving first as Deputy Managing Director and then as Managing Director.\n\nHowever, my greatest privilege has been to serve in politics over the last 22 years. As Member of Parliament (MP), helping residents overcome difficulties and fulfil their aspirations. In my ministerial responsibilities in Government as we made major shifts to build a more inclusive society and restructure the economy. In advancing Singapore's standing through my leadership of various international councils. And in the non-government sector, where I have chaired the board of the Ong Teng Cheong Labour Leadership Institute for two decades and that of SINDA over the last 12 years, and supported other civic organisations.\n\nWe are in a time of transition, both in Singapore and internationally. The '4G' team under DPM Lawrence Wong has been shaping up very well, consulting actively with the public, and rethinking our strategies for the future. The challenges they have to take on will keep evolving, however, well beyond the handover of leadership. They will have to tackle new global crises that will surely emerge, work closely with Singaporeans to retain trust in a changing domestic environment, and ensure Singapore's appeal and relevance in a more divided world.\n\nI believe that I can now best serve Singapore not in politics, but in a different role that has to be above politics. If I am fortunate enough to be elected as President, I will represent the unity of Singaporeans, of all races and religions, social backgrounds, and political leanings, at a time when views in the population are becoming more diverse.\n\nI will be thorough and impartial in fulfilling the constitutional duties of the President with regard to the prudent use of the nation's reserves and the key appointments which preserve the integrity of the Singapore system. I will also work to the best of my abilities to project Singapore's interests and voice of reason in an increasingly turbulent world.\n\nMy greatest sadness is in retiring as an MP on the ground, having built deep-rooted relationships with residents and volunteers in Taman Jurong and the rest of Jurong GRC. I hope to maintain these friendships, many of which go back decades. I am assured that my dedicated fellow MPs in Jurong will work doubly hard to serve all our residents fully during the current electoral term.\n\nI am deeply grateful for the opportunities I have been given to serve Singapore. I am particularly thankful for your leadership, advice and openness to collegial debate through the years, for the teamwork and contributions of all my colleagues in Government, and for the guidance provided by then-PM Mr Goh Chok Tong and his team when I came into Cabinet.\n\nMy role vis-a-vis the Government will change fundamentally if I am elected President. What will never change is my conviction in the continuing Singapore story: a society where everyone has the support to uplift themselves regardless of their starting point in life, and a multiracial nation whose citizens take pride in its unique identity and feel a deepening sense of togetherness.\n\n"}, {"url": "https://simple.wikipedia.org/wiki/Lee_Hsien_Loong", "page_content": "Lee Hsien Loong (b. 10 February 1952) is the current Prime Minister of Singapore. His father is Lee Kuan Yew, first Prime Minister of Singapore.\n\nLee Hsien Loong was born in Kandang Kerbau Hospital (presently known as KK Women's and Children's Hospital).[1][2] He is the first child of Lee Kuan Yew and Kwa Geok Choo.\n\nIn August 2004, Goh Chok Tong stepped down as Prime Minister, while Lee Hsien Loong took over the position. He then became the General Secretary of People's Action Party (PAP).\n\nBackground and education [ change | change source ]\n\nHis grandmother (father's side), Chua Jim Neo is a Hokkien Nyonya. His mother's ancestors are from Tong'an District, Xiamen, Fujian, China.\n\nStudied at Nanyang Primary School, Catholic High School and National Junior College.\n\nMilitary life [ change | change source ]\n\nIn 1971, Lee joined the Singapore Armed Forces (SAF). Lee was promoted to very high rank quickly in the Singapore Army. In July 1983, he became the youngest Brigadier General in Singapore. He left SAF in 1984.[3]\n\nEarly political life [ change | change source ]\n\nIn the 1980s, Lee Kuan Yew said he will step down as Prime Minister in 1984. Lee Hsien Loong was considered in the list of new leaders in PAP.\n\nIn 1984, at 32, He was elected an MP. His father immediately assigned him as a Minister of State for some ministries.\n\nIn 1987, he joined in the Cabinet as the Minister for Trade and Industry and Second Minister for Defence.\n\nFrom 2008 to 2012, Lee's salary is S$3.87 million every year.[4] He had a salary increase of 25%, it was originally S$3,091,200.[5]\n\nIn January 2012, his salary was reduced to S$2.2 million due to the public then complaining about his unfair salary. [6][7][8] But, he is still the prime minister with the highest salary in the world.[9]\n\nPersonal life [ change | change source ]"}, {"url": "https://www.pmo.gov.sg/frequently-asked-questions", "page_content": "You can email PM Lee at lee_hsien_loong@pmo.gov.sg\n\nOr write to PM at:\n\nPrime Minister’s Office\n\nIstana\n\nOrchard Road\n\nSingapore 238823\n\nYou can also contact the Prime Minister’s Office at:\n\nEmail: pmo_hq@pmo.gov.sg\n\nAs PM receives a large amount of correspondence, we seek your understanding that it may take a while to properly respond to all your emails and queries.\n\nAll views are welcomed but please share your opinions respectfully and courteously, and avoid offensive language. PMO reserves the right to ignore trolls or take preventive action against abusive emails, especially if the source is anonymous."}, {"url": "https://www.pmo.gov.sg/Newsroom/PM-Lee-Hsien-Loong-on-COVID-19-A-New-Phase-on-24-Mar-2022", "page_content": "Please scroll down for the Malay, Chinese and Tamil translations of the English transcript.\n\n* * * * *\n\nMy fellow Singaporeans,\n\nOur fight against COVID-19 has reached a major turning point. We will be making a decisive move towards living with COVID-19. The Multi-Ministry Taskforce (MTF) will announce the changes after this broadcast. But let me set the context: Take stock of our journey thus far; and explain our plans moving forward.\n\nOur COVID-19 Journey\n\nWe have battled COVID-19 for more than two years now. Right from the start, we had one overriding aim: to protect lives, and prevent as many avoidable deaths as possible. We saw in other countries bleak images of people desperately seeking admission into hospitals, and healthcare workers being forced to choose who lived and who died. We were determined to prevent that happening here, and fortunately we have managed to do so. Our healthcare system came under strain, but it was not overwhelmed. We ensured enough ICU beds and oxygen for everyone who needed them. We recorded one of the lowest rates of COVID-19 related deaths in the world.\n\nThis has been a tough fight. With each new wave, we had to move quickly and adapt. Every time we thought we had the pandemic under control, the virus surprised us. In the early stages, when little was known about the virus, we adopted stringent measures. Our measures kept community cases very low, and helped us to control and clear a major outbreak in our migrant worker dormitories. We bought time to ramp up our healthcare capacity and roll out a comprehensive national vaccination programme.\n\nThen the more dangerous Delta variant struck. Thankfully, by then our vaccination programme was in full swing. But we kept strict measures in place to slow the spread of the virus, until we had vaccinated nearly everyone eligible, especially the elderly. Meanwhile, we changed our health protocols to allow mild cases to recover safely at home, relieving the load on our healthcare system. When we eased up on Safe Management Measures, we had a large wave of COVID-19 cases. But by then most Singaporeans had been vaccinated, and were well protected from the Delta variant. Still, many patients had to be hospitalised, and some unfortunately succumbed to the virus.\n\nNot too long after the Delta wave subsided, the virus threw us another curveball – this time the even more infectious Omicron variant. We braced ourselves as countries across the world saw record-high cases. Our numbers went up sharply too, at the peak exceeding 25,000 in a single day. With our high vaccination rate and strong healthcare system, we were quietly confident we could cope. Still, we tightened our border measures and held back easing our SMMs, to give our healthcare system and workers time to respond.\n\nWe were relieved that Omicron turned out less severe than earlier variants, and that relatively few cases were serious enough to need oxygen support or ICU care. Over the last two weeks, daily new cases have been coming down. Week on week, the ratio is now around 0.8. At this rate, the number of daily infections will halve in about three weeks\n\nA Collective Achievement\n\nWe only achieved this through everyone’s collective effort. You understood the mission and did your part — trusted the government, accepted sound medical advice, abided by Safe Management Measures patiently and responsibly, got yourself and your loved ones vaccinated, organised yourselves to help one another, and self-tested with ART kits, and self-isolated if you tested positive.\n\nBusinesses and essential workers also did their part, to keep our economy and social services going. They adapted repeatedly to changing SMMs. They coped with supply chain and manpower disruptions, and stayed resilient despite formidable difficulties, especially in the hard-hit sectors. Thank you for your grit and resourcefulness, you helped us protect Singaporeans’ livelihoods, and prepared ourselves to emerge stronger from the pandemic.\n\nMost of all, I want to thank our healthcare workers. You made tremendous sacrifices, at a heavy personal cost. Pulling long shifts, day after day, week after week, since the start of the pandemic, returning to work on rest days to cover for colleagues who caught the virus, putting up with all the safety measures at the hospitals, and risking exposure as you cared for infected patients. Because of you, we have maintained some semblance of normalcy in the past two years. Some countries have seen mass resignations of healthcare workers. But our healthcare team, doctors and nurses stayed at their posts and kept on performing their duties. So to our healthcare and frontline workers, from the bottom of my heart, and on behalf of a grateful nation, I want to say: Thank you!\n\nTo our healthcare and frontline workers, from the bottom of my heart, and on behalf of a grateful nation, I want to say: Thank you! PM Lee Hsien Lioong\n\nTowards COVID-19 Resilience\n\nNow, we have reached a major milestone in our COVID-19 journey. The overwhelming majority of our population is fully vaccinated, and nearly everyone eligible has received a booster shot. The Omicron wave has crested, and is now subsiding. With many of us already exposed to the virus and recovered, our population has stronger immunity. Crucially, our healthcare system remains resilient. It was under considerable stress at the peak of the Omicron wave, but it held up. The load is still heavy, but the pressure is now easing.\n\nIn judging how far and fast to ease restrictions, we are very mindful not to stress our healthcare workers and system to breaking point. We must not place an impossible burden on the healthcare workers, and endanger many COVID-19 and non-COVID-19 patients who urgently need treatment. At the same time, we must weigh the cost of stringent SMMs on businesses and the economy, and their impact on children needing to learn, youths yearning to interact, families seeking to bond, and communities striving to connect. Taking all things into consideration, we believe that we are now ready to take a decisive step forward towards living with COVID-19.\n\nWe will make the following changes to our SMMs. First, we will double the group size from the current 5 persons, to 10 persons. Second, we will allow up to 75% of employees who can work from home to return to their workplaces. Third, we will increase the capacity limit for larger events and settings (those with more than 1,000 people) to 75%. Fourth, wearing masks outdoors will now be optional. This is because the risk of outdoor transmission is significantly lower, but indoors, masks will still be mandatory. Finally, we will maintain safe distancing requirements for now – one meter between groups where masks are off, to minimise transmission in mask-off settings. These changes will come into effect next Tuesday, 29 March.\n\nConcurrently, we will ease up cross-border travel substantially. Earlier, we were cautious because of uncertainty over Omicron’s impact. Now the Omicron situation is well under control. Nearly all our cases are domestic, originating within the community. Arrivals from abroad constitute only a very small proportion of cases. We can therefore safely open up our borders. We will drastically streamline testing and quarantine requirements for travellers. This simplified Vaccinated Travel Framework will let Singaporeans travel abroad more easily – almost like before COVID-19. It will also lift most restrictions for fully vaccinated visitors entering Singapore. This will reconnect Singapore with the world. It will give a much-needed boost to businesses, particularly the tourism sector. And help Singapore reclaim its position as a business and aviation hub. The MTF will provide the details.\n\nThese domestic and cross-border changes represent a major step towards living with COVID-19, but they stop short of a complete opening up. We remain watchful because COVID-19 may yet bring further surprises. Some countries have taken a ‘Freedom Day’ approach. They have declared the pandemic over, relaxed all restrictions at once. Now they are anxiously watching their infection and mortality numbers rising rapidly again. We are choosing to maintain our measured approach, which has served us well over the past two years. After this major step, we will wait a while to let the situation stabilise. If all goes well, we will ease up further. But we should also be psychologically prepared for more twists and turns ahead. With more interactions, we too may see another wave of cases, and Omicron will not be the last variant we encounter. The virus will continue to evolve. Hopefully, new variants will become progressively milder and more flu-like. But it is also possible that more aggressive and dangerous mutants will turn up, just like Delta did. If that happens, we may have to backtrack and tighten up our restrictions again. We cannot rule this out, even though we hope it will not be necessary. But whatever happens, we now have the knowledge and the means to keep everyone safe. For example, giving everyone another booster jab, or administering an updated vaccine, if necessary.\n\nSo please take today’s announcements in the right spirit. Resume more normal lives, enjoy larger gatherings of family and friends, go outdoors without masks, or reunite with loved ones abroad. But do not throw all caution to the wind. Each one of us must still play our part. Comply with the revised SMMs. If you feel ill, test yourself. If you test positive, isolate yourself at home; If you test negative, and decide to go out, please wear a mask to protect others, even outdoors, just in case. Let us all continue to exercise personal and social responsibility — to keep ourselves well, to keep others safe, and to avoid adding to the burden on our healthcare workers. That way, even when new problems arise, we stand a much better chance of keeping things under control and staying on the path to a new normal.\n\nConclusion\n\nWe have come a long way in our fight against COVID-19. We are not yet at the finish line, though we are getting closer. Key to our response has been the trust that Singaporeans have placed in your government, in the medical authorities, and in each other. Throughout our journey, we have kept faith and supported one another. This solidarity remains crucial as we tackle fresh challenges ahead. I thank everyone for your continued trust and support. Let us keep it up, and see through this pandemic as one united people.\n\nThank you!\n\n* * * * *\n\nUCAPAN OLEH PERDANA MENTERI LEE HSIEN LOONG MENGENAI COVID-19: SATU FASA BARU, PADA 24 MAC 2022\n\nSaudara saudari sekalian\n\nKita telah mencapai satu titik perubahan utama dalam usaha kita memerangi COVID-19. Pemerintah akan mengambil tindakan yang tegas ke arah menjalani kehidupan dengan COVID-19. Pasukan Bertindak Berbilang Kementerian (MTF) akan mengumumkan perubahan-perubahan tersebut selepas siaran ini. Tetapi sebelum itu izinkan saya menerangkannya dalam konteks berikut: Mengambil kira apa yang kita telah lalui sejauh ini; dan menerangkan rancangan kami untuk maju ke hadapan.\n\nPerjalanan COVID-19 Kita\n\nKita telah berjuang melawan COVID-19 selama lebih dua tahun sekarang. Sejak dari mula lagi, matlamat utama kami hanya satu: untuk melindungi nyawa, dan mengurangkan seberapa boleh kematian yang dapat dielakkan. Kita telah menyaksikan paparan suram di negara-negara lain yang menunjukkan keadaan terdesak pesakit-pesakit sedang mereka cuba sedaya upaya untuk mendapatkan rawatan di hospital, dan bagaimana para pekerja penjagaan kesihatan terpaksa memilih siapa yang hidup dan siapa yang mati. Kami bertekad untuk mengelakkan perkara itu daripada berlaku di sini, dan kita telah berjaya melakukannya.\n\nSistem penjagaan kesihatan kita telah menghadapi tekanan, namun ia tidak terlalu dibebani. Kami memastikan terdapat katil-katil ICU dan bekalan oksigen yang cukup untuk setiap individu yang memerlukannya. Kadar kematian berkaitan COVID di sini adalah antara yang terendah di dunia.\n\nIni adalah perjuangan yang sukar. Dengan setiap gelombang jangkitan yang baru, kami terpaksa bertindak dengan pantas dan membuat penyesuaian. Setiap kali kami rasa kami telah dapat mengawal pandemik ini, virus ini mengejutkan kita. Pada peringkat awal apabila sedikit sahaja yang diketahui tentang virus ini, kami melaksanakan langkah-langkah ketat. Langkah-langkah yang kami laksanakan memastikan jumlah kes dalam masyarakat berada pada paras paling rendah, dan membantu kami mengawal dan menangani penularan besar di dormitori-dormitori pekerja hijrahan kita. Ia memberikan kami masa untuk mempertingkatkan kemampuan penjagaan kesihatan kita dan melancarkan program vaksinasi nasional yang menyeluruh.\n\nKemudian varian Delta yang lebih berbahaya melanda. Mujurlah program vaksinasi kita sedang rancak berjalan pada masa itu. Tetapi kami mengekalkan langkah-langkah ketat untuk memperlahankan penularan virus tersebut, sehingga kami selesai memvaksin hampir semua orang yang layak mendapatkannya, terutamanya golongan warga emas. Sementara itu, kami mengubah protokol-protokol kesihatan untuk membenarkan kes-kes yang ringan pulih dengan selamat di rumah, dan dengan itu mengurangkan beban ke atas sistem penjaaan kesihatan kita. Apabila kami melonggarkan Langkah-langkah Pengurusan Selamat (SMM), kita mengalami gelombang besar kes COVID-19. Mujurlah pada masa itu, kebanyakan rakyat Singapura telahpun menjalani vaksinasi, dan terlindung dengan baik daripada varian Delta. Sungguhpun demikian, ramai pesakit perlu dirawat di hospital, dan malangnya ada yang meninggal dunia akibat jangkitan virus tersebut.\n\nTidak berapa lama selepas gelombang Delta reda, virus tersebut menduga kita lagi – kali ini, dalam bentuk varian Omicron yang lebih mudah berjangkit. Kita mempersiapkan diri kita sedang negara-negara di seluruh dunia mencatatkan jumlah rekod kes. Bilangan kes kita turut melonjak, dan pada kemuncaknya, jumlah kes melebihi 25,000 sehari. Dengan kadar vaksinasi kita yang tinggi dan sistem penjagaan kesihatan yang kukuh, di dalam hati, kami yakin kami mampu mengatasinya. Namun, kami mengetatkan langkah-langkah kawalan di sempadan kita dan menangguhkan rancangan untuk melonggarkan SMM, demi memberi masa kepada sistem penjagaan kesihatan dan para pekerja kesihatan kita menyesuaikan diri.\n\nKami berasa lega kerana Omicron ternyata tidak seteruk varian-varian lebih awal, dan tidak banyak kes yang terlalu serius sehingga memerlukan bantuan oksigen atau penjagaan di ICU. Sepanjang dua minggu lalu, jumlah kes harian telah mula menurun. Minggu demi minggu nisbahnya kini sekitar 0.8. Pada kadar ini, bilangan jangkitan harian akan berkurangan sebanyak separuh dalam masa lebih kurang tiga minggu.\n\nSatu Pencapaian Bersama\n\nKita hanya dapat mencapai semua ini dengan usaha bersama semua pihak. Anda memahami misinya dan memainkan peranan anda. Anda menaruh kepercayaan kepada Pemerintah. Anda menerima nasihat pihak berkuasa perubatan. Anda mematuhi SMM dengan sabar dan bertanggungjawab. Anda dan orang-orang yang anda sayangi telah mendapatkan suntikan vaksin. Anda menyusun langkah untuk saling membantu antara satu sama lain. Anda melakukan ujian ART secara kendiri, dan mengasingkan diri jika anda diuji positif.\n\nPerniagaan-perniagaan dan para pekerja perkhidmatan penting turut memainkan peranan mereka untuk memastikan ekonomi dan perkhidmatan sosial kita terus berfungsi. Mereka menyesuaikan diri berulang kali dengan SMM yang berubah-ubah, mengharungi gangguan rantaian bekalan dan sumber tenaga manusia, dan kekal berdaya tahan meskipun menghadapi kesukaran, terutama sekali bagi mereka yang berada dalam sektor-sektor yang teruk terjejas. Berkat kerja keras dan kepintaran anda, kita telah dapat melindungi mata pencarian rakyat Singapura dan mempersiapkan diri kita untuk bangkit dengan lebih kukuh daripada pandemik ini.\n\nYang paling penting, saya ingin mengucapkan terima kasih kepada para pekerja penjagaan kesihatan kita. Anda telah banyak berkorban dan menanggung kos peribadi yang tinggi. Bekerja syif panjang, hari demi hari, minggu demi minggu, sejak pandemik ini bermula. Kembali bertugas pada hari-hari rehat anda untuk menggantikan rakan sekerja yang dijangkiti virus. Bersabar menghadapi semua langkah keselamatan di hospital-hospital. Menghadapi risiko terdedah kepada virus demi menjaga para pesakit. Disebabkan pengorbanan andalah, kita telah dapat mengekalkan kehidupan hampir seperti sedia kala sepanjang dua tahun lalu. Ada beberapa negara yang mengalami pemberhentian pekerja penjagaan kesihatan secara beramai-ramai. Namun pasukan penjagaan kesihatan kita, para doktor dan jururawat tetap berdiri teguh dan melaksanakan tanggungjawab mereka. Justeru, kepada para pekerja penjagaan kesihatan dan barisan hadapan kita, dari lubuk hati saya dan bagi pihak negara yang terhutang budi kepada anda, saya ucapkan: Terima kasih!\n\nKe arah membina Daya Tahan terhadap COVID-19\n\nKini kita telah mencapai penanda penting dalam perjalanan COVID-19 kita. Sebahagian besar penduduk kita telah menjalani vaksinasi penuh, dan hampir semua orang yang layak mendapatkan dos penggalak telah berbuat demikian. Gelombang Omicron telah mencapai kemuncaknya dan sudah mula reda. Oleh kerana kebanyakan daripada kita telah dijangkiti virus tersebut dan telah pulih, masyarakat kita kini mempunyai daya tahan tubuh yang lebih kuat. Apa yang paling penting, sistem penjagaan kesihatan kita kekal berdaya tahan. Ia menghadapi tekanan yang ketara sewaktu kemuncak gelombang Omicron, tetapi ia dapat bertahan. Bebannya masih berat, tetapi tekanannya kini mula reda. Dalam menilai sejauh dan sepantas mana untuk melonggarkan sekatan-sekatan, kami amat prihatin agar tidak menambah tekanan ke atas para pekerja dan sistem penjagaan kesihatan kita sehingga ke tahap yang tidak lagi dapat menampung jumlah kes. Jangan letakkan beban yang tidak mungkin mampu digalas para pekerja penjagaan kesihatan, kerana ini akan membahayakan ramai pesakit COVID-19 dan bukan pesakit COVID-19 yang memerlukan rawatan segera. Pada masa yang sama, kita mesti menimbangkan kos akibat SMM yang ketat ke atas perniagaan-perniagaan dan ekonomi, dan kesannya ke atas kanak-kanak yang perlu belajar, keinginan para belia untuk berinteraksi, keluarga-keluarga yang ingin menjalin ikatan, dan masyarakat yang berusaha untuk menjalin hubungan. Apabila diambil kira semua ini, kami percaya bahawa kami sekarang bersedia untuk mengambil langkah yang tegas ke arah menjalani kehidupan dengan COVID-19. Pemerintah akan melaksanakan perubahan kepada SMM kita: Pertama, kami akan menggandakan saiz kumpulan daripada 5 orang sekarang, kepada 10 orang. Kedua, kami akan membenarkan sehingga 75 peratus daripada pekerja yang boleh bekerja dari rumah untuk kembali ke tempat kerja mereka. Ketiga, kami akan menaikkan had kapasiti bagi acara-acara yang lebih besar (di mana terdapat lebih daripada 1,000 hadirin) hingga 75 peratus. Keempat, pemakaian pelitup apabila berada di luar kini tidak akan diwajibkan. Ini kerana risiko jangkitan di luar bangunan adalah jauh lebih rendah. Tetapi di dalam bangunan, pelitup tetap wajib dipakai. Akhir sekali, kami akan mengekalkan keperluan jarak selamat buat masa ini – satu meter antara kumpulan-kumpulan dalam situasi di mana pelitup tidak dipakai, untuk mengurangkan penularan dalam situasi-situasi sedemikian. Perubahan-perubahan ini akan berkuatkuasa mulai Selasa depan, 29 Mac.\n\nPada masa yang sama, kami akan melonggarkan dengan ketara kawalan perjalanan rentas sempadan. Sebelum ini, kami bersikap berhati-hati kerana kurang pasti akan kesan varian Omicron. Kini, situasi varian Omicron dapat dikawal dengan baik. Hampir kesemua kes kita disebabkan jangkitan dalam masyarakat kita sendiri. Ketibaan pelawat dari luar negara membentuk hanya sebahagian kecil daripada jumlah kes. Oleh itu, kita boleh membuka sempadan kita dengan selamat. Kami akan memperkemaskan dengan ketara keperluan ujian dan kuarantin bagi para pelawat. Rangka Kerja Perjalanan bagi yang Sudah Menjalani Vaksinasi yang dipermudahkan ini akan membolehkan rakyat Singapura ke luar negara dengan lebih mudah – hampir seperti keadaan sebelum wabak COVID-19. Ia juga akan melonggarkan kebanyakan sekatan bagi para pelawat yang sudah menjalani vaksinasi penuh untuk memasuki Singapura. Ini akan menghubungkan semula Singapura dengan dunia luar. Pembukaan ini akan memberi rangsangan yang amat diperlukan oleh perniagaan-perniagaan, terutama sekali sektor pelancongan, dan membantu Singapura merebut kembali kedudukan kita sebagai sebuah hab perniagaan dan penerbangan. MTF akan memberikan butir-butir lanjut.\n\nPerubahan-perubahan di dalam negeri mahupun rentas sempadan ini melambangkan satu langkah penting menuju kehidupan bersama COVID-19. Namun, kita masih belum boleh meniadakan langsung sebarang langkah kawalan. Kita tetap berwaspada kerana COVID-19 masih boleh membawa kejutan baru. Terdapat beberapa negara yang mengambil pendekatan ‘Hari Kebebasan’ atau ‘Freedom Day’. Mereka telah mengisytiharkan pandemik sudah berakhir dan melonggarkan kesemua sekatan secara serta merta. Sekarang mereka sedang memantau situasi dengan cemas kerana bilangan jangkitan dan kematian mereka mula meningkat dengan pantas sekali lagi. Kami memilih untuk mengekalkan pendekatan berhati-hati, yang telah membuahkan hasil untuk kita semua sepanjang dua tahun yang lalu. Selepas langkah utama ini, kami akan memberikan sedikit masa untuk membolehkan keadaan stabil. Jika semuanya berjalan lancar, kami akan melonggarkan lagi kawalan. Namun, kita juga harus bersiap sedia dari segi psikologi bahawa keadaan boleh menjadi lebih rumit pada masa hadapan. Dengan lebih banyak interaksi, kita juga mungkin akan menyaksikan gelombang baru kes jangkitan. Dan Omicron bukanlah varian terakhir yang kita perlu tangani. Virus ini akan terus berkembang. Kami harap jangkitan varian-varian baru akan menjadi lebih ringan secara progresif dan lebih menyerupai demam selesema. Tetapi mungkin juga, mutan-mutan yang lebih agresif dan berbahaya akan muncul, sama seperti Delta. Jika itu berlaku, kita mungkin perlu mundur dan mengetatkan semula langkah-langkah kawalan kita sekali lagi. Kita tidak boleh menolak kemungkinan ini akan berlaku, meskipun kita berharap langkah-langkah tersebut tidak perlu diambil. Walau apapun yang berlaku, kini kami mempunyai pengetahuan dan keupayaan untuk memastikan semua orang selamat. Contohnya, memberikan setiap orang satu lagi dos penggalak atau vaksin yang baru.\n\nJadi saya berharap anda memahami tujuan di sebalik pengumuman hari ini. Anda boleh menyambung semula kehidupan seperti biasa, menikmati masa bersama keluarga dan rakan-rakan dalam kumpulan yang lebih besar, keluar rumah tanpa memakai pelitup, atau bertemu semula dengan orang-orang yang tersayang di luar negara. Tetapi jangan bersikap sambil lewa tanpa menghiraukan risikonya. Setiap seorang daripada kita harus tetap memainkan peranan kita. Patuhi SMM yang telah disemak. Jika anda berasa kurang sihat, lakukan ujian kendiri. Jika anda diuji positif, asingkan diri anda di rumah. Jika anda diuji negatif, dan anda membuat keputusan untuk keluar rumah, harap pakai pelitup untuk melindungi orang lain, walaupun anda berada di luar rumah, sebagai langkah berjaga-jaga. Marilah kita terus mengamalkan tanggungjawab peribadi dan sosial kita. Untuk terus menjaga kesihatan kita, untuk terus menjaga keselamatan orang lain, untuk mengelakkan daripada membebankan para pekerja penjagaan kesihatan kita. Dengan cara itu, walaupun apabila masalah-masalah baru timbul, kita mempunyai peluang yang lebih baik untuk mengawal keadaan dan dapat meneruskan usaha kita untuk mencapai kebiasaan yang baru.\n\nPenutup\n\nKita telah mencapai banyak kemajuan dalam usaha kita memerangi COVID-19. Kita belum lagi tiba di garisan penamat, walaupun kita semakin hampir. Kunci kepada respons kita adalah kepercayaan rakyat Singapura terhadap Pemerintah, terhadap pihak berkuasa perubatan, serta kepercayaan antara satu sama lain. Sepanjang perjalanan kita ini, kita telah saling meyakini dan saling membantu antara satu sama lain. Semangat bersatu padu ini akan terus memainkan peranan penting, sedang kita menangani cabaran-cabaran baru pada masa hadapan. Saya berterima kasih kepada anda semua atas kepercayaan dan sokongan anda yang berterusan. Marilah kita teruskan usaha ini, dan mengatasi pandemik ini sebagai satu rakyat.\n\nTerima kasih.\n\n* * * * *\n\n【李显龙总理全国讲话】冠状病毒-19: 迈入新阶段\n\n2022年3月24日\n\n各位同胞\n\n我国与冠病疫情的对抗，已经进入重要转折点。接下来，我们将果断地迈向与冠病共存。政府抗疫跨部门工作小组将在我发表全国讲话后，宣布相关的调整。但我想先告诉大家有关的背景情况，回顾我国的抗疫历程，并说明政府接下来的计划。\n\n新加坡的抗疫历程\n\n新加坡对抗冠病的战役，至今已持续两年多。从一开始，我们最重要的目标就是保护生命，以及把可避免的死亡病例降到最低。当时，我们看到一些国家情况严峻，病患迫切需要入院治疗。医护人员被迫决定该救谁和不救谁。我们坚决不让新加坡发生这样的情况，而我们做到了。虽然我国医疗系统面临压力，但还是能够应付疫情。我们确保了医院有足够的加护病房床位和氧气供应，治疗每一位有需要的病人。我国是冠病死亡率最低的国家之一。\n\n这是一场硬仗。每次出现新一波疫情，我们都要迅速应对。每当我们以为情况已受控时，疫情又出现意料不到的演变。疫情初期，由于对病毒了解不多，我们采取了严格的防疫措施。这些措施使得社区病例非常少，并有助于我国控制并稳定客工宿舍暴发的疫情。此外，我们也争取到时间提升医疗系统的应对能力和全面推行全国疫苗接种计划。\n\n接着，更危险的德尔塔变种毒株来袭。幸好，我们当时已全面展开疫苗接种计划。但我们继续实施严格的防疫措施以减缓病毒的传播速度，直到几乎所有符合条件的人，尤其是年长人士都完成疫苗接种。与此同时，我们调整了冠病医疗方案，让轻症患者能安全地在家休养，以减轻医疗系统的负担。在放宽了安全管理措施之后，冠病患者却大幅度增加。然而，当时大多数的国人已经接种了疫苗，能有效地抵抗德尔塔毒株。可是，许多病患还是得住院，当中一些人也不幸逝世。\n\n德尔塔疫情消退不久，我们又遇到难题，这回来袭的是更具传染性的奥密克戎变种毒株。我们严阵以待，全球各地的确诊人数则不断创新高。新加坡的病例同样激增，单日新增病例曾在最高峰时超过2万5000起。但由于我国的疫苗接种率高，加上医疗系统健全，因此我们还是有信心可以应付疫情。尽管如此，我们还是收紧边境措施，并延后放宽安全管理措施，以让医疗系统和医护人员有足够的时间应对。\n\n我们很庆幸奥密克戎毒株的威力不比之前出现的其他毒株来得强。本地也没有太多需要输氧或入住加护病房的重症病例。过去两个星期，单日新增病例已经有所减少。现在的每周病例增长率约为0.8。如果能保持这样的趋势，单日新增病例大约会在三周内减半。\n\n齐心抗疫的成果\n\n这全靠大家的努力付出，齐心抗疫。你们深明大义，各尽其责，信任政府，听取卫生当局的建议，遵守安全管理措施，保持耐心和负起社会责任。让自己和亲人接种疫苗，群策群力，守望相助。自行做抗原快速检测，一旦结果呈阳性就自我隔离。\n\n企业和提供必要服务的员工也做出贡献，让经济活动和社会服务得以继续。他们一再适应不时改变的安全管理措施，以及应付供应链受干扰和人手短缺的问题。他们在面对巨大困难时，保持坚韧不拔。尤其是那些受重创的行业。因为你们的勇气和毅力，灵活应变，让我们保住了国人的生计，也做好准备，使我国能在后冠病时代变得更强韧。最重要的是，我要感谢我们的医护人员。你们做出了很大的牺牲，付出了巨大的个人代价。日复一日地长时间工作，从疫情初期便是如此。在休息日时回到医院代班，顶替感染冠病的同事。你们配合医院的安全措施。不惜冒着感染风险，尽心照顾冠病患者。因为你们的付出，我们这两年来才能过着接近正常的生活。一些国家有大量的医护人员辞职。但我们的医疗团队、医生和护士始终坚守岗位，把工作做好。所以，我要向我们的医护和前线人员表示感激，我谨代表全国人民由衷地向你们说声谢谢！\n\n成为具冠病韧性的社会\n\n此刻，我国迎来了抗疫历程的一个重要里程碑。本地绝大部分人已完成疫苗接种，几乎所有符合条件的人也打了追加剂。奥密克戎毒株所引发的疫情，已经达到顶峰，开始缓和下来。许多人也曾染病并已经康复，所以我们的群体免疫力更高了。更关键的是，我们的医疗系统始终保持坚韧。尽管它在奥密克戎疫情最严重时，承受相当大的压力，但始终挺过了难关。如今，医院仍旧负担沉重，但面对的压力已有所减轻。\n\n在决定多快放宽限制，放宽多少的时候，我们深知不能让医护人员和医疗系统所承受的压力达到极限。我们不能让医护人员负担过重，这会使到急需治疗的冠病和非冠病患者面临危险。同时我们也必须衡量严格的防疫措施对企业和经济所造成的代价，以及对孩子们的学习，或是年轻人、家人和社群之间的互动交流所带来的影响。在考虑了所有因素后，我们相信我国已经做好准备，能够果断地迈向与冠病共存\n\n所以，我们将调整安全管理措施：第一，我们会放宽聚会人数限制，从现在的5人增加到10人。第二，我们将允许多达75%的居家办公者，重返工作场所上班。第三，我们将放宽大型活动和场所的容量限制，（人数超过1000人时）容量可高达75%。第四，人们在户外时可以选择不戴口罩。这是因为，病毒在户外传播的风险比在室内低许多。不过，人们在室内还是必须戴口罩。最后，安全距离规定则暂时不变。只要是没有戴口罩，人们就必须保持一米的安全距离，以把传播风险降到最低。这些措施将在下星期二，也就是3月29日生效。\n\n与此同时，我们也会大幅度放宽跨境旅游限制。之前，我们一直谨慎行事，因为我们不知道奥密克戎毒株会带来什么样的冲击。如今，奥密克戎疫情已受到控制。几乎所有病例属于境内感染，病源来自社区，而境外输入的病例只占很少数。因此，我们可以安全地开放边境。我国也将大大地简化旅客做检测和隔离的相关规定。简化的疫苗接种者旅游框架将更方便国人出国，和疫情前几乎一样。我们也会放宽大多数的限制，让已完成疫苗接种的旅客在入境新加坡时更方便。这将让新加坡重新和世界各地连接起来，为企业注入一剂强心针，尤其能提振旅游业，并有助于新加坡恢复商业及航空枢纽的地位。政府抗疫跨部门工作小组将提供有关细节。\n\n这些有关国内防疫措施和跨境旅游限制的改变，意味着我们正在大步迈向与冠病共存。不过，这不等于全面放宽所有限制。我们保持警惕，因为冠病疫情可能还会有出乎意料的发展。一些国家已采取自由开放的策略，宣告疫情已结束，并全面解封。如今他们正密切关注患病和死亡人数再度飙升的情况。\n\n我们选择继续采取适当的策略，因为过去两年的经历显示这个做法是有效的。在迈出这重大一步后，我们会等待一段时间，让疫情稳定下来。如果情况发展良好，我们将再次放宽限制。但我们也要做好心理准备，未来有可能会遇到更多波折。由于人们有更多互动，我们也可能迎来新一波的疫情。奥密克戎病毒不会是我们面对的最后一个变种毒株。病毒会继续变异。但愿新的变种毒株，其威力会越变越弱，更像流感病毒。但也有可能的是，传染性更强以及更危险的变种毒株会出现，就像德尔塔毒株一样。如果这样的情况发生，我们可能需要倒退，再次收紧防疫措施。我们不能排除这个可能性，即便我们希望它不会发生。无论如何，如今我们已有经验和方法来应对，能保护每个人。例如，政府也许得让人们再接种追加剂，又或者为大家施打新款疫苗。\n\n因此，请大家以正确的心态看待今天的宣布。让生活进一步回归正常，和更多的亲友聚会、在户外无需戴口罩，或与国外亲友团聚。但请不要彻底放松警惕。我们每个人还是必须各尽其责，继续遵守调整后的安全管理措施。身体不适时，就自我检测。如果结果呈阳性，请在家隔离。即便结果呈阴性，请在决定外出时戴口罩保护他人；即使是在户外，也照旧戴着，以防万一。我呼吁大家继续对自己以及对社会负起责任，保护自己，也保护他人的健康，避免加重医护人员的负担。这样，即使出现新的问题，我们也更有把握让情况受到控制。持续稳步向前，以到达新常态。\n\n总结\n\n在这条漫长的抗疫之路，我们取得了很大的进展。我们还没有到达终点，但我们离终点线更近了。我们能沉着应战的关键因素，是国人对政府和卫生当局的信任，以及对彼此的互信。一直以来，我们都互相信任，互相扶持。这股同舟共济、团结一致的精神，在我们日后迎接新挑战时，仍至关重要。我感谢大家继续信任和支持我们。让我们再接再厉，全国上下一心，共同走出疫情。\n\n谢谢。\n\n* * * * *\n\nகொவிட்-19 குறித்த உரை: புதிய கட்டம்\n\nபிரதமர் லீ சியன் லூங்\n\n24 மார்ச் 2022\n\nஎன் சக சிங்கப்பூரர்களே\n\nகொவிட்-19 கிருமிக்கு எதிரான நமது போராட்டம், ஒரு முக்கிய திருப்புமுனையை எட்டியுள்ளது. கொவிட் கிருமியுடன் வாழ்வதை நோக்கி நாம் தீர்க்கமான நடவடிக்கையை மேற்கொள்ளவிருக்கிறோம். இந்த ஒளிபரப்புக்குப் பின்னர், அமைச்சுகளுக்கு இடையிலான பணிக்குழு, புதிய மாற்றங்கள் குறித்து அறிவிக்கும்.\n\nஆனால், இதற்கான பின்னணியை நான் விளக்குகிறேன். இதுவரை நாம் கடந்து வந்த பாதையைத் திரும்பிப் பார்ப்போம். அடுத்துவரும் நமது திட்டங்கள் பற்றி எடுத்துக்கூறுகிறேன்.\n\nநமது கொவிட்-19 பயணம்\n\nகடந்த ஈராண்டுகளுக்கும் அதிகமாக, நாம் கொவிட் -19 கிருமியுடன் போராடி வந்துள்ளோம். தொடக்கத்திலிருந்தே, நமக்குத் ஒரேயொரு தலையாய குறிக்கோள் இருந்தது: உயிர்களைப் பாதுகாக்கவேண்டும்; தவிர்க்கக்கூடிய மரணங்களைக் கூடுமானவரை தவிர்க்கவேண்டும். மற்ற நாடுகளில் உள்ள மக்கள், மிகுந்த பரப்பரப்புடன் மருத்துவமனைகளுக்குச் செல்வதை நாம் கண்டிருப்போம். அவர்களில் யார் வாழ்வது, யார் மடிவது என்ற முடிவை எடுக்கும் இக்கட்டான நிலைக்கு அங்கிருந்த சுகாதாரப் பராமரிப்பு ஊழியர்கள் தள்ளப்பட்ட நிலையையும் நாம் பார்த்திருப்போம். இங்கு அதுபோன்ற சம்பவம் நடக்காமல் தடுக்க, நாம் உறுதிகொண்டிருந்தோம். நாம் அதில் வெற்றியும் கண்டுள்ளோம். நமது சுகாதாரப் பராமரிப்புக் கட்டமைப்பு நெருக்கத்திற்கு உள்ளானது. ஆனால், அது நிலை தடுமாறவில்லை. தீவிர சிகிச்சைப் பிரிவில் படுக்கைகளும், பிராணவாயுவும் தேவைப்படும் அனைவருக்கும் அவை போதுமான அளவு இருப்பதை நாம் உறுதிசெய்தோம். ஆகக் குறைவான கொவிட்-19 மரணங்கள் பதிவான உலக நாடுகளில் நாமும் ஒன்று.\n\nஇது கடினமான ஒரு போராட்டம். ஒவ்வொரு புதிய கிருமிப்பரவல் அலையிலும், நாம் துரிதமாகச் செயல்பட்டு மாறவேண்டியிருந்தது. ஒவ்வொரு முறையும், கிருமிப்பரவல் கட்டுக்குள் வந்துவிட்டதாக நாம் எண்ணியபோது, கிருமி நம்மை அதிர்ச்சிக்குள்ளாக்கியது. தொடக்கக் கட்டங்களில், கிருமி பற்றி அதிகம் தெரியாதிருந்தபோது, நாம் கெடுபிடியான நடவடிக்கைகளைப் பின்பற்றினோம். நமது நடவடிக்கைகள், நமது சமூகத்தில் கிருமித்தொற்றுச் சம்பவங்களை மிகக் குறைவான எண்ணிக்கையில் வைத்திருந்தன; நமது குடிபெயர்ந்த ஊழியர் தங்கும் விடுதிகளில் ஏற்பட்ட மிகப் பெரிய கிருமிப்பரவலைக் களைய உதவின. நமது சுகாதாரப் பராமரிப்புத் துறையின் ஆற்றலை அதிகரிக்கவும், விரிவான தேசியத் தடுப்பூசித் திட்டத்தைச் செயல்படுத்தவும், இக்காலம் கைகொடுத்தது.\n\nஅதன்பின்னர், இன்னும் ஆபத்தான டெல்ட்டா கிருமிவகை நம்மைத் தாக்கியது. நல்ல வேளை! அதற்குள் நமது தடுப்பூசித் திட்டம் முழுவீச்சாக இயங்கிக் கொண்டிருந்தது. ஆனால், தடுப்பூசிக்குத் தகுதிபெறும் அனைவரும், குறிப்பாக மூத்தோர் தடுப்பூசி போட்டுக்கொள்ளும் வரையில், கிருமியின் பரவலை மெதுவடையச் செய்ய, நாம் கெடுபிடியான நடவடிக்கைகளைத் தொடர்ந்து நடப்பில் வைத்திருந்தோம். அதே வேளை, மிதமாக பாதிக்கப்பட்டவர்கள் வீட்டிலேயே பாதுகாப்பான முறையில் குணமடைவதற்கு ஏதுவாக நமது சுகாதார நெறிமுறைகளை மாற்றினோம். அதன் மூலம் நமது சுகாதாரப் பராமரிப்புக் கட்டமைப்பு மீதான பளு குறைக்கப்பட்டது. நாம் பாதுகாப்பான நிர்வாக நடவடிக்கைகளைத் தளர்த்தியபோது, பெருமளவிலான கொவிட்-19 கிருமித்தொற்றுச் சம்பவங்கள் ஏற்பட்டன. ஆனால், அதற்குள் பெரும்பாலான சிங்கப்பூரர்கள் தடுப்பூசி போட்டுக்கொண்டனர். டெல்ட்டா கிருமிவகையிலிருந்து அவர்கள் நன்கு பாதுகாக்கப்பட்டனர். இருப்பினும், நோயாளிகள் பலர் மருத்துவமனையில் அனுமதிக்கப்பட்டனர்; சிலர் துரதிர்ஷ்டவசமாக அந்தக் கிருமிக்குப் பலியாயினர்.\n\nடெல்ட்டா கிருமிவகை ஓய்ந்த சிறிது காலத்திலேயே, கொவிட் கிருமி நம்மிடையே இன்னொரு பிரளயத்தை ஏற்படுத்தியது. இம்முறை, மேலும் எளிதில் தொற்றக்கூடிய ஓமிக்ரான் கிருமிவகை நம்மைத் தாக்கியது. உலக நாடுகளில் கிருமித்தொற்றுச் சம்பவங்கள் புதிய உச்சத்தைத் தொட, நாமும் அதனை எதிர்கொள்ள ஆயத்தமானோம். நமது கிருமித்தொற்றுச் சம்பவங்களின் எண்ணிக்கையும் கணிசமாக உயர்ந்தது. உச்சகட்டமாக, ஒரே நாளில் 25,000யைத் தாண்டியது. தடுப்பூசி போட்டுக்கொள்ளும் விகிதம் அதிகமாக இருந்ததாலும், வலுவான சுகாதாரப் பராமரிப்புக் கட்டமைப்பாலும், நம்மால் சமாளிக்கமுடியும் என்ற நம்பிக்கை உறுதியாக இருந்தது. எனினும், நிலைமையைச் சமாளிக்க நமது சுகாதாரப் பராமரிப்புக் கட்டமைப்புக்கும் ஊழியர்களுக்கும் கால அவகாசம் அளிக்கும் நோக்கில், எல்லைக் கட்டுப்பாடுகளைக் கடுமையாக்கினோம்; பாதுகாப்பான நிர்வாக நடவடிக்கைகளைத் தளர்த்தாமல் இருந்தோம்.\n\nஓமிக்ரான் கிருமிவகை, முன்னைய கிருமிவகைகளைவிட வீரியம் குறைவாக இருந்ததும், பாதிக்கப்பட்டவர்களில் வெகு சிலருக்கே பிராணவாயு அல்லது தீவிர சிகிச்சைப் பிரிவில் பராமரிப்பு தேவைப்பட்டதும் கண்டு, நாம் நிம்மதி கொண்டோம். கடந்த இரண்டு வாரமாக, கிருமித்தொற்றுச் சம்பவங்களின் அன்றாட எண்ணிக்கை குறைந்து வருகின்றது. வாராந்தரக் கிருமித்தொற்று விகிதம் இப்போது 0.8. இதே விகிதம் தொடர்ந்தால், இன்னும் சுமார் மூன்று வாரத்தில், அன்றாட கிருமித்தொற்று எண்ணிக்கை பாதியாகிவிடும்.\n\nஓர் ஒட்டுமொத்த சாதனை\n\nஅனைவரின் ஒட்டுமொத்த முயற்சியால் மட்டுமே நாங்கள் இதைச் சாதித்தோம். நீங்கள், இப்பயணத்தின் இலக்கைப் புரிந்துகொண்டு, உங்கள் பங்கை ஆற்றினீர்கள். அரசாங்கத்தின் மீது நம்பிக்கை வைத்தீர்கள். மருத்துவ அதிகாரிகளின் ஆலோசனையை ஏற்றுக்கொண்டீர்கள். பொறுமையாகவும் பொறுப்பாகவும் பாதுகாப்பான நிர்வாக நடவடிக்கைகளைக் கடைப்பிடித்தீர்கள். நீங்களும் உங்கள் அன்புக்குரியவர்களும் தடுப்பூசி போட்டுக்கொண்டீர்கள். ஒருவருக்கு மற்றொருவர் உதவி செய்ய உங்களைத் தயார்ப்படுத்திக்கொண்டீர்கள். ஏண்டிஜன் விரைவுப் பரிசோதனைகள் மூலம் உங்களைச் சுயமாகப் பரிசோதித்துக்கொண்டு, உங்களுக்குக் கிருமித்தொற்று உறுதிசெய்யப்பட்டால், நீங்களே உங்களைத் தனிமைப்படுத்திக்கொண்டீர்கள்.\n\nதொழில்களும் அத்தியாவசிய ஊழியர்களும், நம் பொருளாதாரத்தையும் சமூகச் சேவைகளையும் தொடர்ந்து தக்கவைத்துக்கொள்ள தங்கள் பங்கை ஆற்றினர். அவர்கள் மாறிவந்த பாதுகாப்பான நிர்வாக நடவடிக்கைகளுக்கு ஏற்ப தங்களைத் தொடர்ந்து மாற்றிக்கொண்டனர். விநியோகத் தொடர்கள், மனிதவளம் ஆகியவற்றில் ஏற்பட்ட இடையூறுகளைச் சமாளித்தனர். கடுமையான சவால்களை எதிர்கொண்டபோதிலும் மீள்திறனுடன் இருந்தனர் – குறிப்பாக, மோசமாகப் பாதிக்கப்பட்ட துறைகளில். உங்கள் மனவுறுதிக்கும் வளமைத் திறத்திற்கும் நன்றி, நாம் சிங்கப்பூரர்களின் வாழ்வாதாரங்களைப் பாதுகாத்தோம்; கிருமிப்பரவல் சூழலிலிருந்து மேலும் வலிமையுடன் மீண்டெழுவதற்காக நம்மை நாமே ஆயத்தப்படுத்திக்கொண்டோம்.\n\nமுக்கியமாக, நம் சுகாதாரப் பராமரிப்பு ஊழியர்களுக்கு எனது நன்றியைத் தெரிவித்துகொள்ள விரும்புகிறேன். கணிசமான, தனிப்பட்ட இழப்புகளுக்கு இடையில், நீங்கள் மகத்தான தியாகங்களைச் செய்தீர்கள். கிருமிப்பரவல் தொடங்கியதுமுதல், ஒவ்வொரு நாளும், ஒவ்வொரு வாரமும், நீண்டநேரத்திற்கு வேலை செய்து வருகிறீர்கள். கிருமித்தொற்றுக்கு ஆளாகிய சக ஊழியர்களுக்குப் பதிலாக, உங்கள் ஓய்வு நாட்களில் வேலைக்குத் திரும்பினீர்கள். மருத்துவமனைகளில் இருந்த அனைத்து பாதுகாப்பு நடவடிக்கைகளுக்கும் ஈடுகொடுத்திருந்தீர்கள். கொவிட்-19 கிருமியால் பாதிக்கப்பட்ட நோயாளிகளைக் கவனித்துக்கொண்ட வேளையில், அக்கிருமியால் பாதிக்கப்படும் அபாயத்தை எதிர்கொண்டீர்கள். உங்களால்தான், கடந்த ஈராண்டுகளில் ஓரளவு இயல்புநிலையை நம்மால் தக்கவைத்துக்கொள்ள முடிந்தது. சில நாடுகளில், பெரிய அளவிலான சுகாதாரப் பராமரிப்பு ஊழியர்கள் தங்கள் வேலையை விட்டுச் சென்றுள்ளனர். ஆனால், நமது சுகாதாரப் பராமரிப்பு ஊழியர்கள், மருத்துவர்கள், தாதியர் ஆகியோர் தங்கள் பணிகளில் தொடர்ந்து இருந்தனர்; தங்கள் கடமைகளைத் தொடர்ந்து ஆற்றி வந்தனர். எனவே, நமது சுகாதாரப் பராமரிப்பு ஊழியர்களுக்கும் முன்னிலை ஊழியர்களுக்கும், நன்றியுணர்வு மிக்க ஒரு தேசத்தின் சார்பில், நான் கூற விரும்புவது: மிக்க நன்றி!\n\nகொவிட்-19 மீள்திறனை நோக்கி\n\nஇப்போது நாம், நம்முடைய கொவிட்-19 பயணத்தில் ஒரு முக்கியமான மைல்கல்லை அடைந்துள்ளோம். நமது மக்கள்தொகையில் பெரும்பாலானோர் முழுமையாகத் தடுப்பூசி போட்டுக்கொண்டுள்ளனர்; கிட்டத்தட்ட, தகுதிபெற்ற அனைவரும் கூடுதல் தடுப்பூசியைப் போட்டுக்கொண்டுள்ளனர். ஓமிக்ரான் கிருமித்தொற்று அலை, உச்சத்தை எட்டியுள்ளது; தற்போது தணிந்து வருகிறது. நம்மில் பலர் அக்கிருமியால் ஏற்கனவே பாதிக்கப்பட்டு, குணமடைந்திருப்பதால், நமது மக்கள்தொகை மேலும் வலுவான நோய் எதிர்ப்புசக்தியைப் பெற்றுள்ளது. முக்கியமாக, நமது சுகாதாரப் பராமரிப்புக் கட்டமைப்பு தொடர்ந்து மீள்திறனுடன் இருந்துள்ளது. ஓமிக்ரான் கிருமித்தொற்று அலையின் உச்சத்தில், அது அதிகமான நெருக்குதலுக்கு உள்ளானது. ஆனால், அது நிலைமையைச் சமாளித்தது. அவர்களுடைய பணிச்சுமை இன்னும் அதிகமாகவே உள்ளது. ஆனால், நெருக்குதல் இப்போது குறைந்து வருகிறது.\n\nகட்டுப்பாடுகளைத் தளர்த்த எவ்வளவு தூரமாகவும், வேகமாகவும் செயல்படவேண்டும் என்பதைத் தீர்மானிக்கும் அதே வேளையில், நமது சுகாதாரப் பராமரிப்பு ஊழியர்களையும் கட்டமைப்பையும் நொடித்துப் போகும் அளவிற்கு நெருக்கக்கூடாது என்பதில் நாம் மிகவும் கவனமாக உள்ளோம். நமது சுகாதாரப் பராமரிப்பு ஊழியர்கள்மீது நாம் தாளமுடியாப் பளுவைச் சுமத்திவிடக் கூடாது; மருத்துவச் சிகிச்சை அவசரமாகத் தேவைப்படும் கொவிட்-19, கொவிட்-19 சாரா நோயாளிகள் பலரின் உயிர்களுக்கு ஆபத்து விளைவித்திடும். அதே வேளையில், கெடுபிடியான பாதுகாப்பு நிர்வாக நடவடிக்கைகள், தொழில்களுக்கும் பொருளாதாரத்திற்கும் ஏற்படுத்தும் பாதிப்பையும், கல்வி கற்கவேண்டிய பிள்ளைகள், உறவாட ஏங்கும் இளையர்கள், ஒன்றிணைய விழையும் குடும்பங்கள், தொடர்புகொள்ள முனையும் சமூகங்கள் ஆகியவற்றின் மீது ஏற்படுத்தும் தாக்கத்தையும் நாம் சீர்தூக்கிப் பார்க்கவேண்டும். அனைத்து அம்சங்களையும் கவனத்தில் எடுத்துக்கொள்ளும்போது, கொவிட்-19 கிருமியுடன் வாழ்வது தொடர்பில் நாம் தீர்க்கமான ஒரு முடிவை எடுக்க இப்போது தயாராக இருப்பதாய் நம்புகிறோம்.\n\nநமது பாதுகாப்பான நிர்வாக நடவடிக்கைகளுக்கு, பின்வரும் மாற்றங்களை நாம் செய்யவிருக்கிறோம்: முதலில், குழு அளவை இரட்டிப்பாக்கவுள்ளோம், ஐந்து நபர்களிலிருந்து 10 நபர்களுக்கு. இரண்டாவது, வீட்டிலிருந்து வேலை செய்யக்கூடிய 75 விழுக்காடு ஊழியர்கள், இனி தங்கள் வேலையிடங்களுக்குத் திரும்ப அனுமதிக்கப்படுவர். மூன்றாவது, பெரிய நிகழ்ச்சிகளுக்கான (1,000க்கும் அதிகமானோர்) கொள்ளளவு வரம்பை, 75 விழுக்காட்டிற்கு நாம் உயர்த்தவுள்ளோம். நான்காவது, வெளிப்புறங்களில் இனி முகக் கவசம் அணிவது கட்டாயமல்ல. வெளிப்புறத்தில் கிருமிப்பரவலுக்கான அபாயம் மிகவும் குறைவாக இருப்பதே இதற்குக் காரணம். ஆனால், உட்புறங்களில் முகக் கவசங்கள் அணியப்படுவது தொடர்ந்து கட்டாயமாக இருக்கும். இறுதியாக, பாதுகாப்பான தூர இடைவெளி சார்ந்த விதிமுறைகள் தற்போதைக்குத் தொடரும். அதன்படி, முகக் கவசம் அணியப்படாத சூழல்களில் கிருமிப்பரவலைக் குறைக்க, குழுக்களிடையே ஒரு மீட்டர் இடைவெளி இருக்கவேண்டும். இந்த மாற்றங்கள் அடுத்த செவ்வாய்கிழமை, மார்ச் 29 முதல் நடப்புக்கு வரும்.\n\nஅதே சமயத்தில், எல்லை தாண்டிய பயணங்களையும் கணிசமான அளவில், நாம் எளிதாக்கவிருக்கிறோம். முன்னதாக, ஓமிக்ரான் கிருமிவகையின் தாக்கம் குறித்த நிச்சயமற்ற போக்கால், நாம் எச்சரிக்கையுடன் செயல்பட்டோம். இப்போது, ஓமிக்ரான் பரவல் நன்கு கட்டுக்குள் கொண்டு வரப்பட்டுள்ளது. நம்முடைய கிருமித்தொற்றுச் சம்பவங்கள் அனைத்துமே கிட்டத்தட்ட உள்நாட்டில், சமூகத்தில் தோன்றியவைதான். கிருமித்தொற்றால் பாதிக்கப்படுபவர்களில், வெகு சிலரே வெளிநாட்டிலிருந்து வந்தவர்கள். எனவே, நாம் பாதுகாப்பாக, நமது எல்லைகளைத் திறந்துவிடலாம். பயணிகளுக்கான நமது பரிசோதனை, தடைக்காப்பு விதிமுறைகளை நாம் பெருமளவில் குறைக்கவிருக்கிறோம். தடுப்பூசி போட்டோருக்கான எளிமையாக்கப்பட்ட இந்தப் பயணப்பாதைக் கட்டமைப்பு, சிங்கப்பூரர்கள் மேலும் எளிதாக வெளிநாடு செல்ல அனுமதிக்கும் – கிட்டத்தட்ட கொவிட்-19 சூழலுக்கு முன்பைப் போன்று. இந்தக் கட்டமைப்பு, சிங்கப்பூருக்குள் நுழையும் முழுமையாகத் தடுப்பூசி போட்டுக்கொண்ட பயணிகளுக்கான பெரும்பாலான கட்டுப்பாடுகளை நீக்கிவிடும். இது சிங்கப்பூரை உலகத்துடன் மீண்டும் இணைக்கும். இது, நமது தொழில்களுக்கு, குறிப்பாகச் சுற்றுப்பயணத் துறைக்கு அதிகம் தேவைப்படும் ஊக்கத்தை அளிக்கும். தொழில், விமானத்துறை மையமாக சிங்கப்பூர் தமது நிலையை மீட்டெடுக்க அது உதவும். அமைச்சுகளுக்கு இடையிலான பணிக்குழு மேல் விவரங்களை அறிவிக்கும்.\n\nஉள்நாட்டு அளவிலும், எல்லை தாண்டிய நிலையிலும் கொண்டு வரப்படவுள்ள இந்த மாற்றங்கள், கொவிட்-19 கிருமியுடன் வாழ்வது தொடர்பிலான ஒரு முக்கிய மாற்றத்தைப் பிரதிநிதிக்கின்றன. ஆனால், கட்டுப்பாடுகள் முழுமையாக நீக்கப்படவில்லை. நாம் தொடர்ந்து எச்சரிக்கையுடன் இருக்கிறோம். ஏனெனில், கொவிட்-19 கிருமி மேலும் பல அதிர்ச்சிகளைக் கொண்டு வரக்கூடும். சில நாடுகள், அனைத்துக் கட்டுப்பாடுகளையும் நீக்கிவிட்டன. அவை கிருமிப்பரவல் ஓய்ந்துவிட்டதாக அறிவித்துள்ளன. அனைத்து விதிமுறைகளையும் ஒரே சமயத்தில் தளர்த்திவிட்டன. இப்போது அவை, மீண்டும் வேகமாக அதிகரித்து வரும் கிருமித்தொற்றுச் சம்பவங்கள், மரண எண்ணிக்கைகளைப் பதற்றத்துடன் கண்காணித்து வருகின்றன.\n\nநாம் நம்முடைய கவனமான அணுகுமுறையைத் தொடர முடிவெடுத்துள்ளோம். கடந்த ஈராண்டில், அது நமக்கு பலனளித்துள்ளது. இந்த முக்கியமான மாற்றத்திற்குப் பிறகு, நிலைமை சீராவதற்குக் கொஞ்ச காலம் நாம் காத்திருக்கவேண்டும். அனைத்தும் நன்றாக நடந்தேறினால், நாம் கட்டுப்பாடுகளை மேலும் தளர்த்துவோம். ஆனால், எதிர்பாராத பல திருப்பங்களுக்கும் நாம் மனதளவில் தயாராக இருக்கவேண்டும். அதிகமான சந்திப்புகளுடன், நாமும் கூட இன்னொரு கிருமித்தொற்று அலையை எதிர்கொள்ளக்கூடும். ஓமிக்ரான், நாம் எதிர்கொள்ளும் கடைசி கிருமிவகையாக இருக்காது. அந்தக் கிருமி தொடர்ந்து உருமாறும். புதிய கிருமிவகைகள் மேலும் மிதமாக, சளிக் காய்ச்சல் போன்று இருக்கும் என்று நம்பலாம். ஆனால், மேலும் வீரியம் மிகுந்த, ஆபத்தான கிருமிவகைகளும் தோன்ற வாய்ப்பு உள்ளது. டெல்ட்டா கிருமிவகையைப் போன்று அவ்வாறு நடந்தால், நாம் பின்னோக்கிச் சென்று, நமது கட்டுப்பாடுகளை மீண்டும் கடுமையாக்கவேண்டும். அந்த நிலை தேவைப்படாது என்று நாம் நம்பிக்கை கொண்டிருந்தாலும் கூட, நாம் அதனைப் புறக்கணித்துவிட முடியாது. ஆனால் என்ன நடந்தாலும், அனைவரையும் பாதுகாப்பாக வைத்திருக்கத் தேவையான அறிவாற்றலும் செயல்திறனும் நம்மிடம் உள்ளது. உதாரணத்திற்கு, அனைவருக்கும் இன்னொரு கூடுதல் (Booster) தடுப்பூசி அல்லது புதியதொரு தடுப்பூசியைப் போடுதல்\n\nஆக, இன்றைய அறிவிப்புகளை, சரியான மனப்போக்கில் எடுத்துக்கொள்ளுங்கள். மேலும் இயல்புநிலை மிக்க வாழ்க்கையை மீண்டும் தொடங்குவதோடு, குடும்பத்தினர், நண்பர்கள் ஆகியோருடன் பெரிய குழுக்களாக ஒன்றுகூடுதல், முகக் கவசமின்றி வெளிப்புறங்களுக்குச் செல்லுதல், வெளிநாடுகளில் உள்ள அன்புக்குரியவர்களுடன் இணைதல் ஆகியவற்றில் மகிழ்ச்சி கொள்ளுங்கள். ஆனால், எச்சரிக்கையாக இருப்பதைத் தவிர்க்க வேண்டாம். நாம் ஒவ்வொருவரும் நமது பங்கைத் தொடர்ந்து ஆற்றவேண்டும். புதிய பாதுகாப்பான நிர்வாக நடவடிக்கைகளுக்கு இணங்கி நடக்கவேண்டும். உங்களுக்கு உடல் நலமில்லை என்றால், உங்களை நீங்களே பரிசோதித்துப் பாருங்கள். உங்களுக்குக் கிருமித்திற்று உறுதிசெய்யப்பட்டால், உங்களை நீங்களே வீட்டில் தனிமைப்படுத்திக்கொள்ளுங்கள். உங்களுக்குக் கிருமித்தொற்று இல்லையென்று தெரிய வந்து, நீங்கள் வெளியே செல்ல முடிவெடுத்தால், தயவுசெய்து, வெளிப்புறத்திலும்கூட, பிறரைப் பாதுகாக்க, முன்னெச்சரிக்கையாக முகக் கவசம் அணிந்திடுங்கள். நாம் அனைவரும் தனிப்பட்ட, சமூகப் பொறுப்புணர்வைத் தொடர்ந்து கடைப்பிடிப்போம். நம்மை நலமாக வைத்திருக்க; பிறரைப் பாதுகாப்பாக வைத்திருக்க; நமது சுகாதாரப் பராமரிப்பு ஊழியர்களின் பணிச்சுமை அதிகரிப்பதைத் தவிர்க்க. அவ்வகையில், புதிய பிரச்சினைகள் எழும்போது கூட, நாம் நிலைமையைக் கட்டுக்குள் வைத்திருக்கும் சாத்தியம் அதிகமாக இருக்கும்; புதிய இயல்புநிலையை நோக்கிய பாதையில் நம்மால் தொடரமுடியும்.\n\nமுடிவுரை\n\nகொவிட்-19 கிருமிக்கு எதிரான நமது போராட்டத்தில் நாம் நெடுந்தூரம் வந்துள்ளோம். நாம் இறுதிக்கோட்டினை நெருங்கிக்கொண்டிருந்தாலும் அதனை இன்னும் எட்டவில்லை. நமது நடவடிக்கைகளுக்கு முக்கியத் தூணாக விளங்கியது, தங்கள் அரசாங்கத்தின் மீதும், மருத்துவ அதிகாரிகள் மீதும், ஒருவர் மற்றொருவர் மீதும் சிங்கப்பூரர்கள் வைத்திருந்த நம்பிக்கையே. நமது பயணம் முழுவதும், நாம் ஒருவர்மீது ஒருவர் நம்பிக்கை வைத்து, ஆதரவளித்துள்ளோம். புதிய சவால்களைச் சமாளிக்கும் வேளையில், இந்த ஒருமைப்பாடு, இன்றியமையாததாகத் தொடர்கிறது. நீங்கள் அனைவரும் தொடர்ந்து நம்பிக்கை வைத்திருப்பதற்கும் ஆதரவளிப்பதற்கும் நான் நன்றி தெரிவித்துக்கொள்கிறேன். நம் முயற்சிகளைத் தொடர்ந்து செயல்படுத்தி ஒன்றுபட்ட மக்களாக, இந்தக் கிருமிப்பரவலைக் கடந்து செல்வோம்.\n\nநன்றி!\n\n* * * * *"}, {"url": "https://www.straitstimes.com/singapore/singapores-cabinet-reshuffle-5-things-to-know", "page_content": "SINGAPORE - Prime Minister Lee Hsien Loong on Friday (April 23) announced a reshuffle of his Cabinet, in the first change to political appointments since the general election last year.\n\nThis comes two weeks after Deputy Prime Minister Heng Swee Keat stepped aside as leader of the People's Action Party's (PAP) fourth-generation (4G) team and paved the way for a younger person with a longer runway to lead the country when PM Lee retires. Although he remains DPM and Coordinating Minister for Economic Policies, he will relinquish his role as Finance Minister to Mr Lawrence Wong.\n\nSix other ministries will also be helmed by new faces, with the changes taking effect from May 15.\n\nPM Lee said these \"major moves\" would give some of the ministers fresh responsibilities and help them gain different exposure and experience.\n\n\"The reshuffle is also an opportunity for them to work together in new capacities, so that they can understand each other better, and strengthen their cohesion as a team,\" he added. \"This will make the new team readier to take over from me and my older colleagues.\"\n\nHere's what you need to know about Friday's announcements:\n\n1. Who is the new Finance Minister?"}, {"url": "https://eresources.nlb.gov.sg/history/events/e65f9022-dcfc-4ee7-8049-ae2784b58d45", "page_content": "Lee Hsien Loong was formally sworn in as the third prime minister of Singapore on 12 August 2004, taking over the post from Goh Chok Tong.[1] Lee entered politics when he was elected as member of parliament (MP) for the Teck Ghee constituency following his win in the 1984 parliamentary general election. Since 1991, he has been one of the MPs for the Ang Mo Kio Group Representation Constituency (GRC), which was formed after Teck Ghee merged with the Ang Mo Kio and Yio Chu Kang constituencies.[2]\n\n\n\nIn January 1985, Lee was appointed Minister of State for Defence and Trade and Industry.[3] In February 1986, Lee was appointed Acting Trade and Industry Minister before becoming Minister for Trade and Industry and Second Minister for Defence (Services) in January the following year.[4] In 1990, Lee was appointed deputy prime minister and retained his trade and industry portfolio, while serving concurrently as chairman of the Monetary Authority of Singapore (MAS). He was chairman of MAS from January 1998 until August 2004 when he became prime minister.[5] In November 2001, Lee was appointed Minister for Finance while he was still deputy prime minister. He relinquished the finance minister post on 30 November 2007.[6]\n\n\n\nAside from political appointments in the cabinet, Lee also headed two high-level committees that looked into the restructuring of Singapore’s economy. In March 1985, Lee was appointed chairman of the Economic Committee that recommended changes to existing government economic policies to revive the economy during the 1985–86 recession, as well as to foster longer-term growth.[7] Similarly in December 2001, Lee was appointed chairman of the Economic Review Committee to develop a new economic blueprint for Singapore.[8]\n\n\n\nLee’s swearing-in ceremony was held outdoors on the Istana grounds in order to accommodate the 1,400 invited guests.[9] After he was sworn in by then Chief Justice Yong Pung How, Lee gave a speech thanking Goh and inviting Singaporeans to join him in writing the next chapter of Singapore.[10] He also pledged in the speech to be a prime minister for Singaporeans of different ethnic, religious and social backgrounds, and pay extra attention to the needs of the younger generation Singaporeans as well as the less fortunate.[11]\n\n\n\nSince becoming prime minister, Lee has launched a series of measures aimed at building an inclusive society and improving the competitiveness of Singapore’s economy. Some of these measures include changes to the education system to ensure that every Singaporean child attains at least a secondary school education, and the establishment of two institutes – The Institute of Water Policy (part of the Lee Kuan Yew School of Public Policy) and The Centre for Liveable Cities – to look into transforming the city and living environment.[12] In January 1995, Lee announced a billion-dollar package to provide poor, old and unemployed Singaporeans with jobs and financial assistance. One of the measures introduced under this package was the Community Care (ComCare) fund, which was an endowment fund to strengthen the country’s social safety nets. In 2007, Lee introduced changes to the Central Provident Fund (CPF) and employment laws to address the challenges of an ageing population.[13] As prime minister, Lee also led the People’s Action Party (PAP) to victory in the 2006 and 2011 parliamentary general elections.[14]\n\n\n\nReferences\n\n1. Zuraidah Ibrahim. (2004, August 13). Let us shape our future together. The Straits Times, p. 1; Zuraidah Ibrahim. (2004, July 18). August 12: Date for DPM Lee to take over as PM. The Straits Times, p. 1. Retrieved from NewspaperSG.\n\n2. Brig-Gen Lee makes an early thank-you call. (1984, December 24). The Straits Times, p. 11; Stronger identity for Ang Mo Kio. (1991, August 10). The Straits Times, p. 22. Retrieved from NewspaperSG.\n\n3. Three new MPs to become ministers of state. (1985, January 1). The Straits times, p. 1. Retrieved from NewspaperSG.\n\n4. New faces in the CEC. (1986, November 24). The Straits Times, p. 17; Eugene Yap takes over as deputy whip. (1987, January 29). The Straits Times, p. 11. Retrieved from NewspaperSG.\n\n5. Chok Tong announces remaining changes to cabinet. (1990, November 3). The Business Times, p. 16; Ong, C. (1997, December 20). BG Lee is MAS chairman from Jan 1. The Business Times, p. 1; SM Goh takes over as MAS chairman. (2004, August 21). Channel NewsAsia, p. 12. Retrieved from NewspaperSG.\n\n6. PM gives 7 newcomers top jobs. (2001, November 18). The Straits Times, p. 1; Quah, M. (2007, November 30). Tharman to take over as finance minister. The Business Times, p.1. Retrieved from NewspaperSG.\n\n7. Committee set up to review economy. (1985, March 14). Singapore Monitor, p. 11. Retrieved from NewspaperSG.\n\n8. We’ll leave no stone unturned: BG Lee. (2001, December 4). The Straits Times, p. 2. Retrieved from NewspaperSG\n\n9. Lim, L. (2004, August 12). 1,400 to witness Istana swearing-in ceremony. The Straits Times, p. 1; For everyone present, a piece of history. (2004, August 13). The Straits Times, p. 3. Retrieved from NewspaperSG.\n\n10. Join me to write this next chapter. (2004, August 13). The Straits Times, p. 8. Retrieved from NewspaperSG.\n\n11. The Straits Times, 13 Aug 2004, p. 8; ‘The future is full of exciting opportunities which we must together seize.’ (2004, August 13). The Straits Times, p. 8.\n\n12. Lee, U.-W. (2005, August 22). No child will get left behind. The Straits Times, p. 3; Fernandez, W. (2008, June 25). Singapore, ‘living lab’ for cities. The Straits Times, p. 3. Retrieved from NewspaperSG.\n\n13. Lim, L. (2005, January 20). PM Lee offers lifelines to old, needy and jobless. The Straits Times, p. 1; Lim, L. (2007, August 20). CPF changes: Better returns, longer wait for minimum sum. The Straits Times, p. 1. Retrieved from NewspaperSG.\n\n14. Zuraidah Ibrahim. (2006, May 7). PM gets his strong mandate. The Straits Times, p. 1; Zuraidah Ibrahim. (2011, May 8). 81-6: Workers' Party wins Aljunied GRC; PAP vote share dips to 60.1%. The Straits Times. Retrieved from Factiva.\n\nThe information in this article is valid as at 2014 and correct as far as we are able to ascertain from our sources. It is not intended to be an exhaustive or complete history of the subject. Please contact the Library for further reading materials on the topic."}]}